{
    "articleURL": "/wires/pa/article-12059657/Former-Yotties-unite-annual-working-party-Royal-Yacht-Britannia.html",
    "content": [
        "Former sailors who served on the Royal Yacht Britannia have described themselves as a “band of brothers” as they arrived on the ship for their annual working party as a way to keep the bonds they built in service alive.",
        "More than 50 former “Yotties”, as they are affectionately known, will spend much of the week aboard the ship which was in royal service between 1953 and 1997, helping with its upkeep as well as catching up and sharing memories of their time on board.",
        "The vessel is now berthed on the Leith in Edinburgh and run by The Royal Yacht Britannia Trust trust as tourist attraction.At 9.30am on Monday, the Yotties raised their flag onboard to mark the beginning of their four-day work party.Andy Fletcher, who served from 1976 until 1978, shared a memory of the late Queen Elizabeth II from when the ship was decommissioned in 1997.“Decommissioning was dreadful for us in 1997,” he said.",
        "“People will have seen the pictures of the late Queen. She was very emotional and it was probably the only time you’ll have seen a tear in the Queen’s eyes on the day (the yacht) was decommissioned.”Mr Fletcher paid tribute to the maintenance crews who looked after the yacht and urged anyone who had served aboard to join the association.“It’s the wealth of stories, the bond that we have.“In the Navy there was a saying that you don’t have friends in the Navy, you have close acquaintances.“This ship changes all of that. They are not acquaintances, we’re a band of brothers,” he said, adding thier association is a way to keep the strong “brotherly” bonds alive.",
        "Robbie Robson served from 1973 to 1982 and has been a “Yottie” since 2008.He said he was “very emotional” the first time he came back on board.“I absolutely loved my time on the ship,” Mr Robson said.“I went down to the mess deck. It was quite emotional because I went down to where I lived and slept for 10 years and put myself in my bunk and I literally cried, it was that emotional.Dave Varns was on board for a year between 1976 and 1977 and said it was an “absolutely brilliant experience”.",
        "He had lost all contact with the yacht and the yachtsmen until he found the association.“I was made so welcome. We’re a different class, we’re a family,” he said.“No matter who you spoke to, you would always get a laugh or a smile out of any yachtsman.“They are just an absolute team.”Mr Varns was attending his first working party and said he was sure it would not be his last.“We’re supposed to be working but it’s now 11 o’clock and we’ve done nothing since half past nine,” he joked.“That’s the type of work I like!”",
        "Such is the bond between those who served aboard, that Mr Robson has asked Mr Fletcher to scatter his ashes from the Royal Yacht as part of a ceremony they hold for every Yottie who dies.",
        "“We’ve got a ceremony tomorrow. This means so much to me, I’ve made my family promise that when I do go that my ashes will come up here to be scattered.“I hope it’s my colleague (Andy Fletcher) that is actually scattering my ashes for me,” Mr Robson said.“It is an emotional thing, that’s the wonderful thing about our association that we’re able to provide that to bereaved families,” Mr Fletcher added."
    ]
}