{
    "articleURL": "/sport/golf/article-12058005/Wyndham-Clark-wins-Wells-Fargo-Championship.html",
    "content": [
        "Wyndham Clark's two-shot advantage was wiped out in the first three holes Clark responded superbly to birdie five of the next eight holes in his roundDailyMail.com provides all the latest international sports newsWyndham Clark overcame the swift loss of his overnight lead to claim his first PGA Tour title in the Wells Fargo Championship.",
        "Clark's two-shot advantage was wiped out in the first three holes and the 29-year-old American found himself a shot behind playing partner Xander Schauffele after seven holes of the final round at Quail Hollow.However, Clark responded superbly to birdie five of the next eight and with Schauffele stumbling around the turn, the win became something of a formality.A closing 68 gave Clark a winning total of 19 under par and four-shot victory over Schauffele, with England's Tyrrell Hatton and American Harris English three strokes further back in third.Tommy Fleetwood and former world number one Adam Scott finished in a tie for fifth on 11 under.",
        "'Gosh, sorry, I'm a little choked up,' Clark told CBS after joining the likes of Anthony Kim, Rory McIlroy, Rickie Fowler and Max Homa in making the Wells Fargo Championship their maiden PGA Tour title.'It's been a long five years to get to this point on Tour and I thought I would have had one earlier, but it's well worth the wait and I'm so grateful.'There's so much that goes into this and there's so many times I wanted to cry and break clubs – and I did break the club sometimes – in this journey and to get to this point is so sweet.",
        "'It's just amazing to finally do this.'I didn't start out great, I was kind of shaky and I think in years past I might have folded. This time I just stayed patient and hung in there and got hot on the back side.'",
        "Schauffele was left to rue costly dropped shots on the ninth and 11th and told reporters:'When you're trying to win on Sunday you need to put the screws down and put some pressure on the guys leading and I didn't do that.'I probably had to shoot seven under today again to tie him or win by one. 'I think if I could have just put a little bit of pressure down through that mid part where I started leaking oil, it probably would have looked a little bit different.'Once again I'm playing really solid and just had a flat Sunday unfortunately.'"
    ]
}