{
    "articleURL": "/news/article-12041457/Watch-heart-stopping-moment-control-car-slams-speed-traffic-police-officer.html",
    "content": [
        "Shocking footage was captured on dash-camera during a routine police stopThe incident could have ended in tragedy but the officer scrambled out the wayThis is the shocking moment an out-of-control car veers at 'well over 120mph' across several lanes of traffic and slams into a police officer.",
        "The heart-stopping footage was captured on a police dash-camera while an officer was making a routine traffic stop in Fairfax, Virginia, on Monday.The incident could have easily ended in tragedy but the officer saw the vehicle charging towards him and he was able to scramble out of the way.The speeding car then collided with the stationary vehicle, just clipping the officer's leg and knocking him to the ground.The driver of the out-of-control 2018 BMW M3 was identified as a 17-year-old. He was charged with reckless driving after reconstruction experts determined that the car had been going 120 mph in a 50 mph zone.",
        "In the shocking footage, the black BMW can be seen skidding across a median on the Fairfax County Parkway near Braddock Road.Appearing to drift out-of-control at great speed, it then strikes the car that had been pulled over and ricochets into the patrol car.The officer falls to the ground for a second, then quickly pops up to radio for help and check on injuries.Miraculously, no major injuries were reported, even though the black BMW had two teenage passengers in addition to the driver. All three in the black BMW were wearing seatbelts, police said.The driver of the black BMW was charged with reckless driving, a misdemeanor that can often result in jail time in Virginia. Police said the driver was 17 years old, and state law restricts them from identifying him or releasing any details about the crash that could be used to identify him.",
        "Deputy Police Chief Bob Blakley said traffic safety among teen drivers is on the decline. So far this year, Fairfax police have seen a 62 percent increase in teen speeding citations, and a 98 percent increase in tickets for failure to follow signs or signals.In Monday's crash, reconstruction experts determined that the car had been going 120 mph in a 50 mph zone before it lost control.'The vehicle lost control because cars can't go that fast on the highway,' he said.",
        "Fairfax County Police Chief Kevin Davis did not identify the officer, who was uninjured but recovering at home Tuesday.Davis and Blakley said the 13-year veteran may be alive today because he approached the driver he pulled over on the passenger side of the vehicle - a tactic that is optional for officers but advised in cases where approaching on the driver side presents a safety hazard, Blakley said.Davis complimented the officer's professionalism at a news conference Tuesday.'His grace under pressure was calm, cool, collected,' Davis said.Davis said the accident is a good reminder about the importance of traffic safety and recognizing the dangers that officers face enforcing traffic laws. Also, in Fairfax County, one of the wealthiest counties in the nation, Davis suggested that parents might want to reconsider providing high-performance automobiles to their children.",
        "'The car involved in that collision yesterday was a whole lot of car for an inexperienced driver,' Davis said. 'It was going way too fast. It was a rocket, and then it became a missile.'"
    ]
}