{
    "articleURL": "/sport/football/article-12061391/It-not-make-decision-Ruben-Selles-admits-uncertainty-Southampton-future.html",
    "content": [
        "Southampton lost 4-3 to Nottingham Forest in the Premier League on MondayThe result leaves them seven points from safety with three games to playManager Ruben Selles admits he doesn't know what his future holds  Southampton boss Ruben Selles does not know what the future holds after a 4-3 defeat at Nottingham Forest left them on the brink of Premier League relegation.",
        "Saints were on the wrong side of a seven-goal thriller at the City Ground and they will lose their top-tier status at the weekend if they fail to beat Fulham or results go against them elsewhere.In contrast, Forest climbed out of the bottom three with a vital win which came courtesy of Taiwo Awoniyi's brace, Morgan Gibbs-White's penalty and Danilo's brilliant team goal to give realistic hope that they can avoid the drop in their first season back in the top tier for 23 years.Carlos Alcaraz, Lyanco and James Ward-Prowse goals ensured the Saints were always in the game, but they are now staring the drop to the Championship in the face.Selles, who took over from Nathan Jones on a deal until the end of the season, would like to stay at the club, but says that is not for him to decide.",
        "'I try to do my best and as I said before I expected to win more football matches,' he said.'It's a decision that the club needs to make. I would be happy to be here for the next 10 years as I have said many times.'But it is not for me to make that decision. I can only work every day and of course, in the situation we are in right now, it's so much uncertainty for everybody.",
        "'We just need to handle it in the best way possible, whatever happens, and then continue facing forward whatever it is.'And if it is facing forward - if it's together then it's better.'The club will present an agenda for the coming days or weeks on how it is going to deal with that if it happens. That is for the club to respond.'I can tell you what we are going to do for the next weeks, we are going to just keep working as much as we can and keep the situations for the future for the people that need to be responsible for that.'",
        "Forest took full advantage of defeats for Leeds and Leicester to move up to 16th, three points above the drop zone with three games to play.Boss Steve Cooper says the fight against the drop is not over, but that this could be a huge moment.'We feel like we are playing OK and we have won two games in three,' he said. 'You always want consecutive wins and where we are that is not easy to do, so to win two in three is a real positive thing.'It just gives us a little bit more confidence and momentum to just go into the next one. For sure we are going to need more points and more positive results.",
        "'It is a massive win tonight and an important one, but it will be even bigger if we build on it.'That has to be the plan from now. We will start the cycle of putting one game to bed and preparing for the next one.'No days off and the work ethic has to be at its maximum in giving the players everything they need to be ready for the next game.'"
    ]
}