{
    "articleURL": "/tvshowbiz/article-12059201/EXC-Love-Islands-Faye-Winter-reveals-REAL-reason-shock-split-Teddy-Soares.html",
    "content": [
        "Faye Winter has revealed the real reason behind her shock split with Teddy Soares.",
        "The former Love Island contestant, 27, who met her ex-boyfriend, 28, on the reality show's 2021 series, announced their 'heartbreaking and difficult' separation in February after a year-and-a-half of dating.And while the pair have kept quiet about the cause for months, Faye has finally spilled the beans in an exclusive interview with MailOnline.Faye, who is the face of The Big Help Out campaign, confessed they were both in 'different places' and wanted opposing things, which put a strain on their relationship.She said: 'It's been very obvious, especially over the last few months, we just wanted different things. We were just in different places.",
        "'And you know, relationships... they're hard, you know, they're hard things to maintain. People go through breakups every single day. People go through heartbreak every single day.'It's just part of life and it's a really difficult situation to go through. I'm not ready. I don't know if I will ever be ready to disclose what fully happened between us because that is between me and Teddy.'But we just wanted really different things and, yeah, I think that's become... you know, I wanted to continue doing my work with charity and my Guide Dogs work.'And it's just one of those things, unfortunately, and it is sad. It will always be sad and he'll always hold a very special place in my heart.",
        "'But we've just got to keep moving and it's difficult because everybody wants to know, but at the same time we've got to respect our own privacy and also respect each other's.'Teddy and Faye became parents to golden retriever Bonnie during their relationship, with the former financial consultant admitting he now 'misses' the pooch, who lives with the Devon-native.He previously told MailOnline: '[Faye] is posting the dog which is really hard because we shared it. I have a snoop every so often to see the dog, she’s grown so much since I left in January.'But when asked about his comments, Faye clapped back, claiming she's 'never' stopped Teddy seeing Bonnie while vowing to let him take her away for weekends.",
        "She said: 'I have always said, and I will stick to it, if Teddy ever reaches out to me, if that's in a week's time, a day's time, two years' time, six months' time, he can see Bonnie. I have never once stopped him. I've even asked him to come and see her.'So I really struggle with that because, you know, Bonnie isn't something that I would ever take away from him. She is the most incredible little character and she's helped me through so much.'If he misses her, he can see her. He knows that the door is open for him to come and see her, take her away for the weekend, do as he wishes.",
        "'But yeah, once that conversation arises or once he reaches out, then absolutely he can do that. It's really not a problem.'Elsewhere, Faye is calling on all young people to get involved with volunteering, as part of The Big Help Out's launch on May 8.The initiative marks His Majesty The King’s Coronation, where thousands of organisations across the country are getting together to give us all the chance to help out in our own local communities.'Campaign Star' Faye has been volunteering with The Guide Dogs for the past six years and has continued to be ever-involved as her fame grows.She said: 'We're not asking for money. We're asking for you to give a bit of your time, find something new that you love whilst trying to help somebody else.'Obviously it's all in line with the King's coronation and there are so many amazing opportunities, charities and small businesses. There's just so much you can do!'For more information on The Big Help Out please see: thebighelpout.org.uk."
    ]
}