{
    "articleURL": "/wires/reuters/article-12046385/Apollo-acquire-aerospace-industry-supplier-Arconic-5-2-bln-deal.html",
    "content": [
        "By Pratyush Thakur",
        "May 4 (Reuters) - Arconic Corp has agreed to be bought by Apollo Global Management Inc in a take-private deal valued at about $5.2 billion, the U.S. aerospace supplier said on Thursday.Apollo will pay $30 for each Arconic share held, representing a premium of 35.6% as of close on Feb. 27, a day before reports of deal talks emerged.Shares of Pittsburgh-based Arconic jumped 27% to $28.75 on Thursday.The deal, which is expected to close in the second half of the year, has an equity value of about $3 billion, as per calculations by Reuters.The company, which supplies to Boeing Co, had rebuffed an almost $10 billion offer from Apollo in 2018. Two years later, the company split into two publicly traded firms, Arconic Corp and Howmet Aerospace Inc.Arconic retained rolled products, aluminum extrusions, and building and construction systems business, while the engine products, fastening systems and forged wheels businesses were spun off to Howmet.Arconic struggled with falling metal prices last year and its stock lost roughly 38% of its value.\"Aerospace production at Boeing and Airbus is accelerating, automotive production is experiencing less impact from supply chain issues, and aluminum can-sheet inventories will likely correct, making it (Arconic) an attractive entry point for a private equity investor,\" said Benchmark analyst Josh Sullivan.",
        "Apollo said it was committed to investing \"significant capital\" in Arconic, expected to be used for plant technology upgrades.The transaction, which includes a minority investment from Irenic Capital Management, comes at a time when high interest rates have sapped the appetite for private equity investments.BMO Capital Markets, Mizuho Securities USA LLC and TD Securities were financial advisers to Apollo, while Evercore Group and Goldman Sachs &amp;amp; Co were Arconic's advisers. (Reporting by Pratyush Thakur in Bengaluru; Editing by Vinay Dwivedi, Rashmi Aich, Sriraj Kalluvila and Shounak Dasgupta)"
    ]
}