{
    "articleURL": "/tvshowbiz/article-12055967/Jennifer-Lawrence-husband-Cooke-Maroney-enjoy-casual-night-New-York-City.html",
    "content": [
        "Jennifer Lawrence enjoyed a casual night out alongside her husband Cooke Maroney on Saturday in New York City. ",
        "The Oscar winner, 32 – who recently rocked a leggy look at CinemaCon – kept it simple in black as she and Maroney, 38, joined a few business associates at il Bucco for some top-notch Italian food.The actress added some extra height to her look with a pair of black strappy heels. Lawrence's other half looked like a handsome everyman in his white shirt, light jacket and black pants.Married for three years, the A-lister met her manhattan art gallerist in 2018 through a mutual friend and the pair share a one-year-old son together named Cy.",
        "During an interview with the New York Times last year, Jennifer reflected on her decision to marry Cooke and admitted she was 'so happy' that she went ahead with the nuptials.'When you don’t fully know yourself, you have no idea where to put yourself,' the award-winning star explained to the outlet.'And then I met my husband, and he was like, \"Put yourself here.\" I was like, \"That feels right, but what if it’s not?\"' Jennifer further expressed.After filming her project, Causeway, which was released in November 2022, Lawrence returned home to Cooke and stated, 'Then I went back, and when I’m home with my husband making this family, I’m so happy I stayed.'",
        "'I'm so happy I didn’t freak out and cancel the wedding and run away and go, ‘I’ll never be taken down!'After the couple tied the knot in 2019, the couple became parents to son Cy, who turned one in February. Jennifer has opened about motherhood in the past, telling Vogue in September 2022, 'The morning after I gave birth, I felt like my whole life had started over.''My heart has stretched to a capacity that I didn’t know about,' she told the outlet. I include my husband in that.' Jennifer's meeting in Manhattan comes as she is gearing up for the highly anticipated release of her first raunchy comedy No Hard Feelings.  ",
        "The trailer for the hard R-rated movie promises more laughs than Lawrence has delivered in years, and it's the first comedic romp she has ever made, as most of her lighter projects have been dramedies or satires.In No Hard Feelings, Jennifer plays Maddie, who finds herself in such dire financial straits that she is on the brink of losing her late mother's house.Maddie throws herself on the mercy of a rich pair of New Age 'helicopter parents,' played by Broadway stars Laura Benanti and Matthew Broderick. Percy, their geeky 19-year-old son, is about to go to college and has been cosseted his whole life, never breaking the rules. The couple offers Maddie a car in exchange for a heavyweight favor — she must seduce Percy before he leaves for Princeton."
    ]
}