{
    "articleURL": "/sport/mlb/article-12038065/Aaron-Boone-booed-pulls-starter-Domingo-German-Clay-Holmes-leading-Yankees-loss.html",
    "content": [
        "Boone's decision to pull German - who only tossed 88 pitches - cost the Yankees Reliever Clay Holmes gave up two runs in 10 pitches leading to a New York loss DailyMail.com provides all the latest international sports news With the Yankees about to wrap up a win in 1 hour, 45 minutes, the Cleveland Guardians said not so fast after Aaron Boone pulled a serious managerial blunder.",
        "Starting pitcher Domingo German was two outs from a one-hitter and his first big league complete game when manager Aaron Boone went to his bullpen. German was on just 88 pitches when he was pulled.Within just ten pitches, reliever Clay Holmes was charged with giving up two hits and two runs. Wandy Peralta came into the game in Holmes' stead and walked a third run home in a stunning rally for Cleveland that saw them escape Yankee Stadium with a 3-2 victory.'It felt like the only thing that made that game not an hour was commercials,' Cleveland pitcher Cal Quantrill said.After AL MVP Aaron Judge became the latest in a string of pinstriped stars on the injured list, New York's relievers unraveled and the Yankees (15-15) lost for the sixth time in eight games, dropping to .500 for the first time since they were 1-1.",
        "'I just thought it was the right decision to do that there. Obviously it didn't work, so ultimately that falls on me,' Boone said. 'The long ball's been in play and bit him a little bit at times.'New York took a 2-0 lead in the third off Quantrill when Jose Trevino drove a changeup to left for a 425-foot home run, the longest of his career, and DJ LeMahieu, in a 1-for-17 skid, added an RBI single.",
        "The game was 1:40 old when Steven Kwan singled with one out in the ninth on Germán's 88th pitch to become Cleveland's third baserunner following Amed Rosario's first-inning single and Josh Bell's fifth-inning walk.Fans in the crowd of 33,414 booed when Boone went to the mound and sent Germán to the dugout.'Of course you want the opportunity to finish a game, but at the same time you understand that it's a decision that the manager makes, and I'm never going to disagree,' Germán said through a translator.Holmes, an All-Star last year who has been inconsistent this season, tried to backhand Rosario's slow two-hopper between the mound and third. But he dropped the ball and could not throw to first in time, and was charged with an error.'Maybe I should have just tried to barehand it,' Holmes said. 'It's a play I need to make.'José Ramírez singled sharply to left, loading the bases. Holmes fell behind his third straight batter, going to a 2-0 count on Naylor.",
        "Naylor grounded the ball past diving second baseman Oswald Peraza and into right field, tying the score 2-2. Naylor didn't mind Yankees fans targeting him since his rocking a baby gesture during a home run celebration in Game 4 of the playoffs last October, which some New York supporters interpreted as a taunt of Gerrit Cole - Naylor said it wasn't.",
        "'It's humorous. It's fun, though,' Naylor said. 'It's part of the game, and it's awesome to play at Yankee Stadium.'Holmes threw just four of 10 pitches for strikes and blew a save for the second time in six chances.'Even times when I've been maybe in the zone, it's just not maybe quite as crisp,' Holmes said.Peralta relieved and walked Bell, reloading the bases, then struck out Andres Gimenez.",
        "Zunino, who struck out his first three times up, fouled off a pair of full-count sinkers, then took a low-and-inside changeup.'I was able to get something a little bit lower than I thought to make it an easy take,' Zunino said.Enyel De Los Santos (2-0) got the final two outs of the eighth, throwing one pitch and picking off Anthony Volpe. Emmanuel Clase got three straight outs for his 10th save in 12 chances, ending a game that took just 2:06.'We're totally OK giving up lots of things on the field, but we won't give up commercial breaks,' Quantrill said."
    ]
}