{
    "articleURL": "/wires/pa/article-12051625/Which-royals-celebrities-politicians-attending-King-s-coronation.html",
    "content": [
        "Notable royals, celebrities and politicians will attend the King’s coronation service at Westminster Abbey.",
        "The eyes of the world will be on London as Charles is crowned on Saturday.Here are some of the famous faces who will be in the Abbey.– RoyalsAlmost the entire UK royal family will attend the ceremony, although the Duchess of Sussex and the Duchess of York will miss the service.",
        "All three of the Prince and Princess of Wales’ children are going and Prince George will be one of his grandfather’s four Pages of Honour.The Duke of Sussex and Duke of York, who are no longer working royals, will attend the service on Saturday, but will not perform any duties.– Foreign royalsIn a break from tradition, members of foreign royal families will be invited to the ceremony.Centuries-old tradition stated that a coronation should be a sacred ceremony between a monarch and their people in the presence of God.However, Prince Albert II and Princess Charlene of Monaco will be attending, along with King Willem-Alexander and Queen Maxima of the Netherlands, King Philippe and Queen Mathilde of Belgium, King Carl XVI Gustaf and Crown Princess Victoria of Sweden and Dragon King of Bhutan Jigme Khesar Namgyel Wangchuck and his wife Queen Jetsun Pema Wangchuck.Spain’s King Felipe and Queen Letizia are expected to be there.",
        "Crown Prince Fumihito and Crown Princess Kiko of Japan will represent Emperor Naruhito at the ceremony.– UK politiciansPrime Minister Rishi Sunak is expected to be there with his living predecessors, Cabinet ministers and leader of the Opposition Sir Keir Starmer.",
        "First Minister of Scotland Humza Yousaf has accepted an invite, as has Sinn Fein’s leader in Northern Ireland Michelle O’Neill.– Foreign leadersThe US First Lady is due to be there, but her husband President Joe Biden will not.European French president Emmanuel Macron will be in the Abbey, along with Germany and Italy’s ceremonial presidents Frank-Walter Steinmeier and Sergio Mattarella, rather than heads of government Olaf Scholz and Giorgia Meloni.Chinese vice-president Han Zheng, Australian prime minister Anthony Albanese and Pakistani prime minister Shehbaz Sharif will also be there.Iran has not been invited to the King’s coronation – joining a list that includes Russia, Belarus, Myanmar, Afghanistan, Syria and Venezuela.– CelebritiesAmong the notable faces who are on the list are; Lord Andrew Lloyd Webber, Ant and Dec, David and Victoria Beckham and Rowan Atkinson.",
        "Musicians Lionel Richie, Kelly Jones of Welsh band Stereophonics and Nick Cave are confirmed to be going.Also set to attend are; Edward Enninful, Charlotte Mensah, Stella McCartney, Dame Joanna Lumley and Bear Grylls."
    ]
}