{
    "articleURL": "/wires/ap/article-12059441/Elegant-easy-French-braised-chicken-impress-Mom.html",
    "content": [
        "If you associate chicken with dry, bland childhood dinners, you probably were eating boneless, skinless breast. It does the job, but it´s inherently flavorless and easy to overcook.",
        "That´s why we often call for boneless, skin-on chicken thighs. Not only is darker meat juicier and more flavorful, its higher fat content makes it more forgiving in the pan. Combine that with an elegant but simple classic French preparation, and you won´t have to worry Mom is forcing a smile during dinner on Mother´s Day.In this recipe from our book \"Tuesday Nights Mediterranean,\" which features weeknight-friendly meals from the region, we take inspiration from artichauts à la barigoule. This classic Provençal braise combines fresh artichoke hearts with aromatic vegetables, herbs and white wine. In our version, we sear chicken thighs on the stovetop, then finish cooking them in the oven. Meanwhile, we used canned artichokes in a simplified barigoule with carrots, garlic and onion that serves as both a vegetable accompaniment and a flavorful sauce.For subtle lemony notes, we simmer strips of zest with the artichokes. A Y-style vegetable peeler is the best tool for removing zest in strips from the fruit, but try to take only the yellow peel, as the white pith underneath is bitter. In this recipe, it´s best to avoid jarred marinated artichoke hearts; the seasonings will overpower the other ingredients.Be sure to serve this with warm, crusty bread to dip in the sauce. To complete the meal, toss some mixed greens and halved cherry tomatoes with a drizzle of olive oil and squeeze of lemon juice.",
        "Chicken with Artichokes and White Wine https://www.177milkstreet.com/recipes/chicken-artichokes-white-wine-barigoule-tn-med",
        "Start to finish: 40 minutes Servings: 42½ pounds bone-in, skin-on chicken thighs, trimmed and patted dry Kosher salt and ground black pepper 1 tablespoon extra-virgin olive oil 3 tablespoons salted butter, cut into 1-tablespoon pieces, divided 1 medium yellow onion, halved and thinly sliced 2 medium carrots, peeled, halved lengthwise and sliced crosswise ¼ inch thick 4 medium garlic cloves, minced 1 cup dry white wine Two 14-ounce cans artichoke hearts, drained, cut into quarters if whole Three 3-inch-long strips lemon zest, plus 2 tablespoons lemon juice 1 cup low-sodium chicken broth ¼ cup finely chopped fresh flat-leaf parsleyHeat the oven to 475°F with a rack in the middle position. Season the chicken all over with salt and pepper. In a 12-inch skillet over medium-high, heat the oil until barely smoking. Add the chicken skin down and cook without disturbing until golden brown on the bottoms, 5 to 8 minutes. Using tongs, transfer the chicken skin up to a rimmed baking sheet and roast until the thickest part of the thighs reach 175°F, 15 to 20 minutes.While the chicken roasts, pour off and discard all but 1 tablespoon fat from the skillet. Set the pan over medium and melt 2 tablespoons of butter. Add the onion, carrots and ¼ teaspoon salt and ½ teaspoon pepper, then cook, stirring occasionally, until the onion is translucent, 3 to 5 minutes. Add the garlic and cook, stirring, until fragrant, about 30 seconds. Add the wine and cook, scraping up any browned bits, until reduced by about half, 2 to 4 minutes.",
        "Stir in the artichokes, lemon zest and broth. Bring to a simmer over medium-high and cook, uncovered and stirring occasionally, until the carrots are tender and the liquid is slightly reduced, 4 to 5 minutes. Remove from the heat, cover and set aside.When the chicken is done, using tongs, transfer it to a platter. Remove and discard the lemon zest from the artichoke mixture. Add the remaining 1 tablespoon butter and stir until melted, then stir in the lemon juice and parsley. Taste and season with salt and pepper. Spoon the mixture around the chicken.EDITOR´S NOTE: For more recipes, go to Christopher Kimball´s Milk Street at 177milkstreet.com/ap"
    ]
}