{
    "articleURL": "/sport/nba/article-12044093/Lakers-LeBron-James-does-not-receive-single-MVP-vote-time-20-year-career.html",
    "content": [
        "His 28.9 pts, 8.3 rebs, and 6.8 asts averages were less than several candidates  James has won four MVP awards, but has not lifted the trophy since 2013 DailyMail.com provides all the latest international sports newsFor the first time in his 20-year NBA career Los Angeles Lakers forward LeBron James did not receive a single vote for MVP.",
        "Philadelphia 76ers Joel Embiid was named NBA MVP for the 2022-2023 season Tuesday, after he beat out former MVPs Nikola Jokic and Giannis Antetokounmpo.The 38-year-old James has won MVP four times in his career but has not lifted the trophy since 2013.James posted a stellar stat line that saw him average 28.9 points, 8.3 rebounds, and 6.8 assists while helping the Lakers secure the No. 7 seed in the west and a spot in the NBA Play-in Tournament. He also became the NBA’s all-time leading scorer, breaking Kareem Abdul-Jabbar’s record of 38,387 career points on February 7 against Oklahoma City.",
        "However, it is hard to say James was deserving of being in the MVP race this season, when comparing his stats to other candidates, such as Embiid, Jokic and Antetokounmpo. For one, James's season was once again marred with injury after he only played in 55 games. Furthermore, the Lakers struggled for a large portion of the season before reworking a large portion of their roster before turning things around and rising to postseason contention.MVP voting is often tied to the best player or players from the league's most-winning teams.Aside from failing to fall into the 'most winning' category for majority of the year, the Lakers late-season turnaround is arguably tied more closely to the roster-flipping trades, than James carrying the team, which could have hurt his chances of being seriously considered.",
        "Along with this, unlike many of the candidates who received votes, James did not end the regular season in the top five for any major statistical category.Embiid averaged 33.1 points to win his second straight scoring title, averaged 10.2 rebounds and tied a career high with 4.2 assists per game, en route to winning this years award which far clears the numbers James put up."
    ]
}