{
    "articleURL": "/femail/article-12054825/BEL-MOONEY-Camilla-looked-dazed-rock-solid-ever.html",
    "content": [
        "Her hands rested loosely in her lap; when she released one of them to wave, it was tentative, even tense.",
        "The journey to Westminster Abbey in the Diamond Jubilee State Coach must have been an ordeal for a down-to-earth woman who never wanted to be Queen. A shadowed figure in cream robes, she seemed, I thought, rather dazed by events – though rock-solid as ever.Never mind a golden coach: this woman is happier in a garden. She looked magnificent in silk, yet the real Camilla turns up in wellies to support small rural charities few people know about. Competent, she can turn her hand to anything – and as, wife, mother and grandmother, she has been a powerful voice for all women. In the coach, she looked as petrified as we would be.Within the glory of Westminster Abbey, she knew that the fanfare and the pomp and ceremony were for her husband first. Yet since this couple is indivisible, it was all for her, too.",
        "As the King received the regalia, she sat still and attentive, robed in dignity. Her eyes sometimes moved anxiously to left and right; I imagine she felt comforted by the knowledge that her son and daughter were nearby. Who could blame her for looking wary when the Archbishop placed the heavy crown on her head – and a nervous hand rose to steady it, then fiddled with her hair?",
        "I noticed that in the coach and on the balcony, this King and Queen - husband and wife – constantly whispered reassurance to each other. She seemed to be pointing to the joyful crowds with incredulity mixed with relief.I especially noticed that on the balcony, she marshalled the children like any grandmother – but the biggest smile of the day was for her husband, nobody else.Of course I shed a year to see our new queen anointed. The first time I met Camilla Parker Bowles, I thought her the jolliest, warmest woman. At a large private party in about 1990, we laughed ruefully and swapped anecdotes about our teenage daughters: bedroom a tip, staying out late, sulky moods.Unlike so many people at parties, she never once let her eyes slide to see if there was somebody grander to talk to. She was happy to laugh with me: a ’good egg’, as they say.The next time we met was after the then-Prince of Wales had separated from Diana. What stressful, sad and turbulent times those were for all concerned. It was a small dinner – and Camilla and I ended up the naughty ones who perched on the padded fender by the fire and blew cigarette smoke up the chimney. Again I thought, here’s a down-to-earth gal I could drink, smoke and laugh with any time. Both dog-lovers too, which matters.",
        "In a long career, I’ve met people from all walks of life, so I trust my instincts. Whenever somebody is natural, interesting and good fun, I like them. That was Camilla.",
        "After one cosy evening with her in 1993, I noted in my diary how marvellous it was that although we come from such very different backgrounds (mine a Liverpool council flat, Camilla the scion of a grand family) and I’m not a horsey country girl, we could still connect.In 1994, my first husband, Jonathan Dimbleby, made a long television documentary and wrote a biography of Prince Charles. He had my full support and I remain proud.When Charles admitted he had resumed his relationship with Mrs Parker Bowles after his marriage to Diana had irretrievably broken down, I admired the Prince’s honesty. Yes, it was a journalistic coup – but it also lanced the boil of gossip.I was honoured to meet Charles on more than one occasion, and to have all my impressions of him confirmed.It was the same with the woman he always tellingly described as his ‘friend’. Whenever we subsequently met, she and I could chat easily as before - even though her circumstances had changed so radically.I loved her unpretentious warmth, and that skill at putting people at their ease that the cameras reveal at every charitable occasion.",
        "My own marriage ended in 2004, and I assumed I’d never see her again. But in 2005, the Prince of Wales and his bride-to-be invited me to their wedding in my own right. It was unexpected and touched me greatly.",
        "But the Royal couple knew what it was like to be divorced: how much you want to feel that everything will be all right. Those private memories might explain the happiness I felt yesterday. I was glad to pledge allegiance with friends, raise a glass and celebrate two people I respect and - dare I say it? – yes, love. Why not use that word when I – like millions of others – am so moved by the pageantry and the sacred ritual that united us on an historic day? A profound sense of belonging to this beloved country shone in the happy faces of those who surged along the Mall; it fluttered in all the proud Union flags - no matter if rather wet! – and it resounded in the cheers.I don’t care one jot if anybody mocks my patriotism and loyalty. To me, the happiness of Coronation Day did represent love: of country, of monarchy – and a recognition of the deep devotion felt by two people who have triumphed over the odds. When, with friends, I toasted the King and Queen, it was also in acknowledgment of their private courage.",
        "Back when I was lucky enough to spend some time with them, I could never have thought that I would go on become an advice columnist. Over 16 years in our sister paper, the Daily Mail, I have dealt with the all-too-human problems that end so many marriages. People fall in and out of love, relationships grow stale, extra-marital affairs are conducted, hearts are broken. Each week my postbag presents disappointment, anger, bitterness and a tragic inability to talk and forgive - in couples who once loved. There are also the miserable family problems: a daughter estranged from her ill father, a son resenting his elder brother, a parent bewildered that a beloved offspring is full of ugly resentment…Any of that sound familiar?All this can become depressing – but then come letters full of joy. Readers like to share their good news - because hearts do mend. I hear from older couples who have endured the anguish of the end of a marriage, but come through to wed a true friend known for a very long time. (That is my own story, by the way.)Forget fairy-tale weddings: love without friendship will not last. Those letters are full of gratitude that turbulent times have led them into calmer waters. There are millions like that.",
        "And the honest ones will admit that happiness is usually hard-won.Who dares pass judgement on the complicated private lives of others? Which of us can know exactly how they’d have responded to similar pressures, what choices they would have made?It makes me profoundly regretful that there are people who still insist in clinging to an obsession with Diana and anger about infidelity, human frailty and need. It’s all so pointless and sad.",
        "But then – that’s precisely the nature of my advice column. As a Christian, I can do no more than echo the words of Jesus: ‘Let him who is without sin cast the first stone.’Given the familiar history, our strong Camilla is a perfect Queen for these fractured times: someone who can reach out to the many who have known brokenness.Those who have realised we must all ‘just get on with it’, as my mother used to say. Those of us who can forgive the people who wronged us and show the strength of character to build bridges. Those of us who know we must stand up for the causes we believe in, take any opportunity to help others, and try to do good with energy and good humour.Those who also realise that although nothing can ever be perfect, we can jolly well enjoy ourselves while life goes on.All of the above I think, sums up good Queen Camilla. She is a wise, kind woman – and God bless her."
    ]
}