{
    "articleURL": "/tvshowbiz/article-12052287/Kylie-Jenner-nearly-unrecognizable-blonde-siren-new-ad-Jean-Paul-Gaultier.html",
    "content": [
        "Kylie Jenner was nearly unrecognizable as she posed for Jean Paul Gaultier in a new campaign shared on social media Friday. ",
        "The model, 25, who showcased her hourglass curves in a plunging black and white JPG gown at the Met Gala Monday, was styled in a flowing platinum blonde wig with a flower behind her ear.She was dressed in a sheer plum and chartreuse striped 'morphing' dress. Her makeup included a bold plum blush, a light reflecting sheen around her eyes and muted lips.  'Introducing “Flowers” Starring Jean Paul Gaultier’s new mermaid @kyliejenner, the collection reveals a mesmerizing virtual world,' the design house wrote online next to the introductory snap.",
        "The ankle length frock, which also comes in green and blue as well as red and orange sells on the website for €490 or $540. The designer shared some behind the scenes snaps and video from the fashion shoot in their Instagram stories.Kylie appeared to be wearing nothing beneath the diaphanous fabric as she moved around on a white platform against a white background.  The company said the new collection was created by 'exploring the vast universe of the house and drawing inspiration from its 2000s archives.''Here blooms Flowers, a ready to wear that pays homage to the designer's unmistakable hijacks.'Although Kylie has made a fortune from her beauty and skincare lines, the reality star may want to take on the demanding beauty standards which she and her family, including Skims founder Kim Kardashian, 42, have helped foment. ",
        "In a trailer for season three of The Kardashians, the mother of two said, 'All of us need to have a bigger conversation about the beauty standards we’re setting,  adding, 'I don’t want my daughter to do the things I did.'The reality star who shares daughter Stormi, five, and son Aire, one, with ex-partner Travis Scott, 32, has denied having cosmetic surgery, but admitted to using fillers. ",
        "In an interview with Homme Girls the Kylie Beauty founder said 'I had my one lip insecurity thing, so I got lip filler, and it was the best thing I've ever done. I don't regret it.'But she said, otherwise, she has been comfortable in her own skin.'I think a big misconception about me is that I've had so much surgery on my face and that I was some insecure person, and I really wasn't!''Yeah, I love full lips and wanted full lips,' she continued, 'but growing up I was always the most confident person in the room. I was the girl performing for everyone.' The Kylie Baby entrepreneur said motherhood has 'made me love myself more.''I see my features in my daughter and my son now, but you know, my daughter looks like me. I get to see my beauty in her, and it’s made me love myself more for sure. Beauty is always changing for me. '",
        "And as young Stormi grows up in her mother's shadow, Kylie shared the only beauty advice she would give to her daughter. 'That she’s perfect the way that she is. Be confident, always be confident in yourself.' "
    ]
}