{
    "articleURL": "/tvshowbiz/article-12038021/Harry-Styles-skipped-Met-Gala-avoid-run-Olivia-Wilde-Emily-Ratajkowski.html",
    "content": [
        "Harry, 29, hasn't seen his ex Olivia, 39, since their breakup in November 2022The As It Was singer was the first male to ever grace the cover of Vogue solo  Olivia felt 'betrayed' by former pal Emily, 31, for hooking up with Harry in March READ MORE: Olivia Wilde risks another run-in with Emily Ratajkowski at Met Gala afterparty at Zero Bond Harry Styles 'avoided' last night's Met Gala 'like the bubonic plague' in order to save himself from the risk of having an 'awkward run-in' with both his ex-girlfriend Olivia Wilde and his recent fling Emily Ratajkowski.  ",
        "According to a friend of the 29-year-old pop sensation - who was the first man to ever land a solo cover of American Vogue - Harry was extended an invitation to Anna Wintour's prestigious event but graciously declined after learning that Olivia, 39, and Emily, 31, were both attending. 'Harry was invited to the Met Gala, but knowing that both of them were definitely going, he avoided it like it was the bubonic plague,' the insider told DailyMail.com. 'He was told by his team that they would take all necessary steps to ensure that there was no awkward run in with Olivia, but he was not trying to risk it at all.'  ",
        "'Harry has no desire to have a face-to-face encounter with Olivia at this time,' the insider adds. DailyMail.com has contacted Harry's spokesperson for comment.  The Met Gala marked the first time that Olivia and Emily have crossed paths since the model was caught on camera enjoying a very public kiss with Harry on the streets of Tokyo. But while Emily and Harry's incredibly public display is said to have left Olivia feeling 'betrayed', neither woman showed any signs of tension last night when they were both seen attending the Met Gala - before heading to the same after party at New York City hotspot Zero Bond. ",
        "Still, Harry - who was in a relationship with Don't Worry Darling director Olivia for two years until their November 2022 split - was not willing to take any risks when it came to potential run-ins with the two women.'Running into Olivia at an event with Emily would just be way too intense,' the source adds.  And for good reason. Four months after splitting with Olivia, Harry shocked the world when DailyMail.com published exclusive photos of him and Emily locking lips in a parking lot in Japan. At the time, a source told DailyMail.com that Olivia felt 'betrayed' by Emily's fling with her former partner, which happened just weeks after the two ladies were seen mingling at the Vanity Fair Oscars Party. ",
        "'Olivia and Emily were friends and this is a betrayal,' the insider shared. Prior to that Olivia and Emily had previously attended one of Harry's concerts for his Love On Tour shows - dancing side by side at one point.But if there is any friction simmering between the two starlets, they did not allow it to show on Monday night's red carpet, where they both put on a dazzling display - even in the absence of the former One Direction star, who has previously proved himself to be one of the leading style stars of the glittering soiree.",
        "In fact, Harry's fashion-forward ensembles have turned him into a mainstay of the industry - and in 2019, Vogue Editor-in-Chief Anna bestowed the ultimate honor upon him by inviting him to be a co-chat of that year's Met Gala, alongside Serena Williams, Alessandro Michele, and Lady Gaga. The title of co-chair was made all the more significant given that Harry had not yet attended the event - making his debut that same year. The following year, Harry became the first man to ever grace the cover of American Vogue solo. Since then, he has appeared in countless issues.However, Harry was unable to celebrate his 2020 cover success at the Met Gala that year because it was canceled amid the COVID-19 pandemic.  Then, in 2021, the popstar was forced to decline Anna's invite once again because of a scheduling conflict with his Love On Tour, which had him performing in Houston on the same night that the iconic event took place. ",
        "Anna made clear there were no hard feelings however when she was seen attending one of Harry's concerts at Madison Square Garden in New York City just a few months later - with images capturing the famously-frosty editrix beaming with delight as she watched the performer on-stage. Fans had hoped that Olivia and Harry might make their Met Gala debut as a couple at 2022's event - only to be left disappointed when they failed to appear on the red carpet, an absence that they never publicly addressed. ",
        "Harry left his fans wanting again last night when he failed to turn up to the gala - even though he is currently enjoying a break from his world tour, which is due to resume on May 13 with a concert in Denmark.  Although Harry did not partake in last night's ménage à trois with his recent lady loves, they did not hold back when it came to their fashion choices.Both ladies looked absolutely stunning when they walked the red carpet minutes apart for the Met Gala, which was themed in honor of late fashion icon Karl Lagerfeld. It is unclear if they had any interaction at the actual event, but it seems unlikely that they did not see each other all night.Following the Met Gala, Olivia and Emily upped their fashion game and arrived within minutes of each other to the VIP after-party at Zero Bond, where they partied the night away. While the women previously had a friendly relationship, tensions between them escalated after the Emily told Vogue Spain she 'feels bad' for Olivia for hooking up with her ex-boyfriend. The 2023 Met Gala returned to the Metropolitan Museum of Art with everyone from Kim Kardashian to Sydney Sweeney in attendance at the annual fundraising event.Since 1948, stars have ascended the majestic staircase into a very exclusive party where no selfies are allowed.",
        "This year, the ball's theme was Karl Lagerfeld: A Line of Beauty. The late German designer was Chanel's long-time creative director. He passed at age 85 in 2019."
    ]
}