{
    "articleURL": "/wires/ap/article-12047797/Barrera-hopes-Carmen-film-shows-human-border.html",
    "content": [
        "Before taking on a new role, Melissa Barrera asks herself, \"What is the message that I´m trying to send out into the world with this?\"",
        "The Mexican actor and singer is intentional with the projects she selects, including her latest movie, \"Carmen,\" the feature directorial debut of \"Black Swan\" choreographer Benjamin Millepied.It's a musical love story loosely inspired by the 1875 George Bizet opera. The modern-day retelling, now showing in theaters, is set both in the desert along the U.S.-Mexican border and in gritty Los Angeles.Barrera - best known to U.S. audiences, perhaps, for the \"Scream\" series and the film adaptation of \"In the Heights\" - stars here as Carmen, a young Mexican woman. She crosses paths near the border one night with Aidan (portrayed by Oscar nominee Paul Mescal), a Marine with PTSD who is working as a volunteer border patrol guard. A series of dangerous events forces them to go on the run together.Barrera says that building chemistry with Mescal was easy, since they spent hours in dance rehearsals together.\"When you´re dancing with someone, you get to know their body and you get to know how they move, and you make a fool of yourselves together, and you laugh and you fail and you fall,\" she said. \"And it´s a very complete way of getting to know another human being very quickly.\"",
        "Millepied takes audiences on a visually poetic journey as the two make their way to Los Angeles. Carmen reunites there with her late mother´s best friend, Masilda - portrayed by Rossy De Palma - and finds comfort in dance and her growing love for Aidan.",
        "The film´s score is composed by Nicholas Brittell, with Julieta Venegas, Taura Stinton and Tracy \"The Doc\" Curry.When Barrera first heard of the project, she did not know what the story was about. \"I just saw Benjamin Millepied is making his feature debut, and it´s going to be an adaptation of `Carmen.' That´s all I got,\" said the actor.It was not until months later, when she received the script, that she realized it was a story featuring an immigrant woman fleeing the cartel. That's a theme that Barrera had been trying to avoid since she began her crossover acting career in the United States. When she first moved here, she said, she would only get calls to be part of immigrant storylines or cartel-related roles.\"And we (Latinos) are always the victims, and we´re always painted in an `aye pobrecito' (oh, you poor little thing) light,\" said the actor.While she knows that immigrant stories are real and important, Barrera prefers to \"fight for other spaces where they don´t see us, and try and get us in there.\"As she kept reading the script, however, her initial hesitation began to disappear.\"I was like, OK, this is different. This is kind of beautiful and romantic and poetic, and it´s going to be told through movement and dance sequences,\" she said.",
        "Millepied´s \"Carmen\" is a surrealist fever dream with avant-garde symbolism woven throughout. Each song and each dance sequence features Barrera, Mescal or De Palma.When asking herself \"What is the message?\" in this case, Barrera said, it´s \"the plight of this woman who is like many women that are at the border right now, who is running from danger and trying to find a better life and find freedom and safety and love, which is what all human beings want.\"She hopes the movie will humanize the individuals at the border who are waiting for asylum, create conversation and \"get through to another type of audience.\"Barrera said she worked closely with Millepied, who was born and grew up in France, to approach the story with sensitivity.\"It was a very collaborative experience, and I always felt like my opinion mattered and my voice mattered. And it was the first time that I ever felt like that on a project.\" she said.Barrera's career began in Mexico on popular telenovelas, and she appeared in Netflix´s \"Club De Cuervos.\" In the U.S., she quickly landed a television crossover role in Starz´s \"Vida,\" as Lyn. She went on to star as Vanessa in Jon M. Chu and Lin Manuel Miranda´s film \"In the Heights,\" among other projects.",
        "When taking the role of Sam in \"Scream,\" Barrera said, the message she wanted to send is \"we (Latinos) belong in franchises... We can be the lead of a franchise.\"\"I like to just keep working and keep knocking on those doors and keep auditioning for things that aren´t meant for me but change people´s minds, and be like, `Oh, actually, it can be someone like you,´\" she said.Barrera will soon be starring in an untitled monster thriller directed by \"Scream VI\" directors Tyler Gillett and Matt Bettinelli-Olpin. Audiences can also watch her on Netflix´s \"Keep Breathing.\""
    ]
}