{
    "articleURL": "/wires/reuters/article-12043145/Why-Republican-presidential-hopefuls-keeping-US-debt-ceiling-squabble.html",
    "content": [
        "By Gram Slattery and Tim Reid",
        "WASHINGTON, May 3 (Reuters) - It is the one topic that everyone on Capitol Hill is talking about and yet hundreds of miles away, on the plains of Iowa and the hills of New Hampshire, none of the Republicans vying for the 2024 presidential nomination have even mentioned it.The U.S. government could default on its debt in less than a month if Democratic and Republican leaders do not arrive at a deal to raise the nation's $31.4 trillion debt ceiling. A default, which would be unprecedented, could cripple the nation's economy and unsettle global financial markets.Lawmakers in the House of Representatives have issued press releases, passed bills and prepared legislation behind the scenes at a furious pace in recent days in a bid to avert such a scenario. But as Republican presidential hopefuls including Florida Governor Ron DeSantis and former President Donald Trump crisscross the country, they have instead focused on hot-button issues like immigration and transgender participation in youth sports.That is in part because the issue of the debt limit is a murky one with the public.A broad majority of voters in both parties believe the debt ceiling presents a good opportunity to debate public policy priorities, according to a Reuters/Ipsos poll conducted in March. At present, Republicans in the House of Representatives are insisting on a package of conservative reforms in return for raising the debt ceiling, a position congressional Democrats and President Joe Biden reject.",
        "But that same poll showed a wide majority of voters, including 71% of Republicans, think both parties must reach a deal on the issue and avoid a default to save Americans from undue financial stress.Still, it is unclear how much Republican primary voters know about the debt limit debate - or even care - campaign aides and strategists said.At dueling events in New Hampshire on Thursday of last week, neither former UN Ambassador Nikki Haley nor Trump, both presidential candidates, brought up the issue.Of nine attendees interviewed by Reuters at the town hall meeting held by Haley, none mentioned the debt ceiling as one of their top concerns. In a question-and-answer session with the former ambassador, the topic did not come up.In the absence of pressure from voters, candidates have stuck to red-meat topics likely to linger throughout the primary, like restricting the teaching of gender issues in schools.\"It's a total Beltway issue unless it goes south,\" said Republican strategist Sarah Longwell, referring to a freeway outside the capital that is shorthand for the dividing line between political insiders and average citizens.Venturing opinions on tricky policy matters has proven hazardous for 2024 hopefuls in the past.In March, for instance, DeSantis provoked the ire of party lawmakers and donors for dismissing Russia's invasion of Ukraine as a \"territorial dispute,\" a position that he partially walked back.",
        "There is also little upside for the White House hopefuls to get embroiled in a fight in which everyone ends up muddied.After weeks of rancorous partisan battles in 2011 over raising the debt ceiling brought the country to the brink of default, disapproval of Congress rose to an all-time high of 82%, according a New York Times/CBS News public opinion poll published at the time.VAGUE RESPONSESReuters reached out to the campaigns of Trump, Haley, former Arkansas Governor Asa Hutchinson, venture capitalist Vivek Ramaswamy and businessman Perry Johnson. The news agency also contacted DeSantis, former Vice President Mike Pence and U.S. Senator Tim Scott of South Carolina, who have not yet declared they will run but are expected to do so.Only Ramaswamy and Johnson, both long-shots for the nomination, responded.Ramaswamy said he favors tying modest spending cuts to any deal to raise the debt limit but declined to give specifics. He said he strongly supported creating work requirements for people to receive welfare benefits as part of any debt-limit package.Johnson proposed a \"2-cents plan,\" which would eliminate 2 cents on every dollar in discretionary spending.Others have addressed the debt ceiling in the past, but only in general terms.Pence said on CNBC's \"Squawk Box\" in February that it was important to maintain \"the full faith and credit of the United States.\" He said he \"respected\" House Speaker Kevin McCarthy's decision to take cuts to Social Security and Medicare off the table.",
        "Pence refused to be drawn in the interview on what spending cuts he would ask for in any deal, merely repeating as he has done all year that cuts to entitlement spending have to be made \"in the long term.\"Trump, in a January video produced by his campaign, also came out against touching entitlement programs in the context of the debt-limit debate.Since then, he has remained largely silent on the issue.(Reporting by Gram Slattery in Washington and Tim Reid in Los Angeles Additional reporting by Nathan Layne in Manchester, New Hampshire, and James Oliphant in Washington Editing by Ross Colvin and Matthew Lewis)"
    ]
}