{
    "articleURL": "/wires/pa/article-12057411/Chelsea-pressure-leaders-Manchester-United-huge-win-Everton.html",
    "content": [
        "Chelsea kept the pressure on Manchester United at the top of the Women’s Super League table after a thumping 7-0 win over Everton.",
        "United had earlier moved six points clear at the summit with a 3-0 success over Tottenham, but Emma Hayes’ side reeled that lead back to four points, with two games in hand, following their demolition of the Toffees.They took control of the game early on with goals from Guro Reiten, Sam Kerr, Pernille Harder, Sophie Ingle and Jessie Fleming putting them 5-0 up at half-time.Everton showed some resistance after the break but Harder grabbed her second in the final 10 minutes and Erin Cuthbert finished things off in added time.United and Chelsea will take a break from the title race as they face each other in the FA Cup final next weekend.Marc Skinner’s side racked up a fifth successive win as first-half goals from Leah Galton and Alessia Russo and a second-half Nikita Parris strike downed Spurs.",
        "Defeat did little to help Spurs’ relegation worries and they remain just three points above rock-bottom Reading.Manchester City lost ground in the title race after they were beaten 2-1 at Liverpool on Sunday, which was their second defeat in four games.Mid-table Liverpool went ahead through Natasha Dowie’s 16th-minute strike, but Lauren Hemp levelled matters 12 minutes later.Missy Bo Kearns restored the hosts’ lead shortly after the restart and despite a strong City response, where they racked up 17 shots during the game, Liverpool held on for a surprise win.",
        "Rachel Daly scored a hat-trick as Aston Villa sent Reading closer to relegation with 5-0 thrashing.The England international opened the scoring in the 14th minute and then added further strikes in the 55th and 63rd to claim the match ball, with Alisha Lehmann and Kirsty Hanson also netting before the break.Brighton beat West Ham 1-0 thanks to Kayleigh Green’s second-half goal."
    ]
}