{
    "articleURL": "/wires/reuters/article-12055331/Panthers-look-continue-hot-hand-Game-3-vs-Leafs.html",
    "content": [
        "The Florida Panthers bid to extend their franchise-record playoff winning streak to six games on Sunday when they host the Toronto Maple Leafs in Game 3 of their Eastern Conference semifinal series in Sunrise, Fla.",
        "The Panthers are no strangers to turning things around this season.Florida got off to a slow start and needed a late surge to grab the second wild-card spot in the conference.Then, the Panthers overcame a 3-1 series deficit by winning three straight games against the Presidents' Trophy-winning Boston Bruins.Florida followed up its 4-2 win in the series opener versus Toronto by overcoming an early two-goal deficit in a 3-2 win on Thursday.\"This is a special group,\" said Panthers forward Anton Lundell, who had one goal and one assist on Thursday. \"We feel ready for this. We've been playing playoff-type hockey since January.\"The Panthers held a 15-6 edge in blocked shots in Game 2.\"We put our work boots on,\" Panthers defenseman Radko Gudas said.Florida forward Sam Bennett recorded a team-high 10 hits and added two blocks in 18:41 of ice time.Marc Staal, one of the oldest Panthers at age 36, logged a team-high 25:26 of ice time. Fellow defenseman Brandon Montour registered a plus-3 rating.Florida's biggest star is winger Matthew Tkachuk, who has an Eastern Conference-best 15 points in the playoffs. Tkachuk was quick to credit Sergei Bobrovsky for the two-time Vezina Trophy recipient's play since stepping back in for Alex Lyon.\"He played awesome,\" Tkachuk said. \"He's been driving it for us ever since he's come back in. He deserves it. He works so hard. He's the hardest worker I've seen. He grinds and just continues to work on his game and take care of himself like I've never seen somebody do. He's been the leader for us ever since he's come back, so we're lucky to have him.\"",
        "Panthers coach Paul Maurice said his players welcomed the time off since Thursday, as they had played five games in nine days.Toronto, meanwhile, faces tough odds as road teams who have taken a 2-0 lead in a best-of-seven series -- such as the Panthers -- are 85-21 in NHL history.\"We're all disappointed,\" Maple Leafs forward Ryan O'Reilly said. \"Being down 2-0 is not what we wanted, but there's a lot of hockey left. We need to win the next game and build from there.\"Leafs coach Sheldon Keefe said that he has been \"baffled\" by the way his team is playing.\"They have forced us to make mistakes that we didn't make in the previous series (against Tampa Bay),\" Keefe said.Leafs center Auston Matthews has an eight-game point streak, posting five goals and six assists during that span.During the regular season, Matthews scored 40 goals, tying William Nylander for the team lead. Mitch Marner led the Leafs in assists (69) and points (99). Captain John Tavares, who had 36 goals and 80 points, completes Toronto's \"Big Four.\"However, in the first two games in this series, those four players effectively have been shut down. Matthews has two points, Marner has one, and Tavares and Nylander have been held off the scoresheet.",
        "--Field Level Media"
    ]
}