{
    "articleURL": "/news/royals/article-12048891/Charles-pays-special-tribute-Camilla-including-special-medal.html",
    "content": [
        " Camilla appears behind her husband on the medal It will be awarded to military personnel, emergency workers and civil servantsFor all the latest Royal news, pictures and video click here King Charles has paid a personal tribute to the Queen Consort by including her on his Coronation Medal, the Mail can reveal.",
        "Camilla appears behind her husband on the medal which will be awarded to military personnel, emergency workers and civil servants – subject to eligibility criteria.The Mail has also obtained the first image of the much anticipated medal, which is yet to be formally unveiled. Its design had been shrouded in secrecy. King Charles has followed the example of George VI who included Queen Elizabeth on his coronation medal in 1937.Her inclusion is considered entirely appropriate given the Queen Consort’s support for King Charles in carrying out his work and duties.",
        "The silver medal is expected to cost as much as £35million, according to reports.The King and Queen Consort appear on one side, with the Sovereign’s personal monogram on the other.She also undertakes public engagements on behalf of charities and holds a number of honorary positions in the armed forces.Tens of thousands of medals will be minted and will be awarded at a later date. The King and Queen Consort appear on one side, with the Sovereign’s personal monogram on the other.The cypher, consists of the initials of the monarch’s name, Charles, and title, Rex, which is Latin for King.The ‘C’ and the ‘R’ appear beneath a representation of the Crown and are surrounded by a laurel wreath.",
        "The Mail has learned that, following a row between government departments over who should pay for the medals, strict eligibility criteria has been imposed.The King’s Coronation Medal will be awarded to members of the armed forces who have completed five years of service by today (Fri), frontline emergency services and prison service personnel, members of the Royal Household and living recipients of the Victoria Cross and George Cross gallantry awards.In addition, the medal will be awarded to service personnel who provide ‘active, contributory service’ to official Coronation events. Senior civil servants and officials from devolved administrations, crown dependencies and overseas territories will also receive the medal.Coronation medals have been issued for each British monarch since the Coronation of George IV in 1821. Medals have also been issued to commemorate the late Queen’s Silver, Golden and Diamond Jubilees."
    ]
}