{
    "articleURL": "/wires/reuters/article-12061319/Soccer-Three-players-investigated-prosecutors-brawl-Argentine-derby.html",
    "content": [
        "By Janina Nuno Rios",
        "May 8 (Reuters) - River Plate's Agustin Palavecino and Boca Juniors' Marcos Rojo and Luis Vazquez are under investigation by Buenos Aires prosecutors, Argentine media reported, following a fiery brawl that led to seven red cards in River's 1-0 win in the Argentine derby on Sunday.As the 'Superclasico' between Argentina's two most popular teams was heading for a goalless draw, the referee awarded a stoppage-time penalty to River that Miguel Angel Borja converted to hand the league leaders victory, leaving defending champions Boca 13th in the table.Palavecino then celebrated the goal in front of the Boca players, triggering a brawl that stopped the match for 16 minutes, with the stadium police having to intervene, resulting in three players being sent off from each side, as well as Boca coach Jorge Almiron.The Buenos Aires Prosecutor's Office for Mass Events filed charges against Palavecino and Vazquez for inciting disorder, and Rojo for entering the pitch without authorisation, as the former Manchester United defender was not involved in the match due to injury.\"Marcos went to help the team because he is the captain and he went to collaborate, he didn't go to harm anyone,\" Boca Juniors president Jorge Amor told Reuters.\"These are the consequences of the refereeing for which we feel harmed. I am not in favour of any act of violence. Nobody was looking for aggression, it all started after the shout (of Palavecino after the goal).",
        "\"A lot of people entered the pitch and had nothing to do there. I saw a big crowd and only saw Luis (Vazquez) separating people.\"River Plate president Jorge Brito said he did not like the way the match ended despite their victory, and that both teams made mistakes that triggered the brawl.\"It happens to all of us, it happens to me as a head, that the fan in us comes out and you do something that can annoy the other team,\" Brito told local broadcaster Tyc Sports.\"I think Boca's reaction was exaggerated but that's fine. For these things to happen there had to be mistakes on both sides and we have to work so that these things don't happen again.\"Pala is an intelligent player, he's a good person and he's going to learn from this.\"Palavecino apologised on Monday, saying he regretted his actions and admitted he could not control himself.\"It was a mistake and it's not the image we want to give at River. There is a path to go down and we have to follow it,\" the midfielder told Tyc Sports.Under Argentine law, Rojo could be sanctioned with one to five days of community service or a fine of 200 to 2000 Argentine pesos ($0.87 to $8.79).",
        "Palavecino and Vazquez could face fines of 10,000 to 50,000 Argentine pesos or five to 30 days' detention. ($1 = 227.6000 Argentine pesos) (Reporting by Janina Nuno Rios in Mexico City Editing by Toby Davis)"
    ]
}