{
    "articleURL": "/news/article-12039003/Bud-Light-risk-losing-status-selling-beer-industry-expert-says.html",
    "content": [
        "Bud Light could lose its status as the top-selling US beer brand, expert saysModelo Especial is the No. 2 brand and could gain the crown if Bud sales slipLast year, Bud Light store sales were $4.8B, versus $3.75B for Modelo EspecialA beer industry expert has said that Bud Light is in danger of losing its status as the country's top selling beer, if sales of the product continue to plunge in the wake of controversy over the brands partnership with trans influencer Dylan Mulvaney.",
        "Weeks after the controversy first emerged, in-store sales of Bud Light were down 26 percent from one year ago for the week ended April 22, according to industry data reported by Beer Business Daily. While Bud Light is still the best-selling beer brand in the country, if parent company Anheuser-Busch can't reverse the decline in sales, 'then Bud Light is in serious trouble this year,' industry expert Bump Williams told the St. Louis Post-Dispatch.'I think it runs the risk of losing that No. 1 position at the end of calendar year 2023 to Modelo Especial,' said Williams, the founder of Bump Williams Consulting, a firm specializing in the alcoholic beverage industry.According to Williams, last year $4.8 billion worth of Bud Light was sold in stores, making it the top US beer brand, followed by Modelo Especial with $3.75 billion and Michelob Ultra with $3.3 billion.",
        "Michelob Ultra is owned by Bud Light parent company Anheuser-Busch InBev, while Modelo is brewed in Mexico under AB InBev ownership, but sold and distributed in the US by Constellation Group.Meanwhile, Molson Coors brands Coors Light ($2.48 billion) and Miller Lite ($2.17 billion) ranked No. 4 and 6 in sales respectively last year, according to data Williams shared with DailyMail.com. Corona Extra ranked fifth with sales of $2.28 billion.",
        "All of those figures are for in-store sales only, and do not include sales at restaurants and bars. Williams told DailyMail.com that because Coors Light and Miller Lite are so far behind Bud Light in sales, 'I don't think they have a chance to surpass Bud Light' despite the brand's recent slump. However, he speculated that if defections from Bud Light continue, and all those customers were to instead choose Coors Light or Miller Lite, then the space could conceivably become a much more competitive three-way race. Williams also told the Post-Dispatch that he was beginning to see other Anheuser-Busch brands suffering from what is known as a negative halo effect, with the controversy from Bud Light spilling over.'I also think that what's happening now is that anybody that is a Bud Light drinker and switches to Michelob Ultra because they don't want to be seen holding a Bud Light, someone down the bar is going to say, 'Hey, buddy, that's an Anheuser-Busch product you're holding,' Williams said. ",
        "The controversy first emerged on April 1 when Bud Light presented Mulvaney with personalized cans showing her face as a commemorative gift for the influencer.Fans of the beer erupted in fury. Kid Rock used Bud Light cans as target practice, and country singers John Rich and Travis Tritt publicly denounced the brand, accusing Anheuser-Bush of pursuing a social agenda at odds with the beliefs of its core customers. ",
        "Two senior Anheuser-Busch marketing executives have taken leave of absence in the wake of the controversy.On Sunday, Beer Business Daily reported that Bud Light's off-premise sales volume - meaning the amount of beer sold outside of restaurants and bars - had fallen by 26.1 percent from a year earlier in the week ended April 22.Sales were down 21.1 percent in the prior week. While competitors, Coors Light and Miller Lite, saw consumers turning to their brands as both have had an increase in sales.So far this year, Bud Light volumes are down 8 percent.'The shocking deterioration of Bud Light Blue's market share continued apace through the third week of April – and actually somehow worsened. 'We've never seen such a dramatic shift in national share in such a short period of time,' Beer Business Daily wrote on its website.Coors Light's volume was up 13.3 percent for the same time period, and Miller Lite rose 13.6 percent.",
        "Last week senior executives at parent company Anheuser-Busch held a closed-door meeting with distributors in Washington, DC, where they laid out future plans - and promised to 'spend heavily' on Bud Light to salvage its public image, according to reports. Benj Steinman, editor of Beer Marketer's Insights, said that spending on the brand 'fell off a cliff last year,' but Anheuser-Busch leaders are promising to rectify the situation, New York Post reported. ",
        "On top of the marketing blitz, executives working for Bud Light will also go through a more rigorous screening process, according to one Northeast-based beer distributor who spoke to The New York Post. 'There will be an improved screening process before any marketing hits the public. Executives will have to go through a more rigorous screening process,' Bud Light execs said during Zoom meetings this month."
    ]
}