{
    "articleURL": "/wires/pa/article-12056675/Kieran-McKenna-proud-Ipswich-season-despite-missing-title.html",
    "content": [
        "Ipswich missed out on the League One title but manager Kieran McKenna hailed his team’s “incredible” season after a final-game 2-2 draw at Fleetwood.",
        "Substitutes Freddie Ladapo and Marcus Harness took runners-up Town’s final league goal tally to 101 and a 19th game unbeaten.But a second-half double from one-time Ipswich academy product Jack Marriott denied the visitors a chance to rack up a century of points.Ladapo and Harness scored either side of Marriott’s brace while Town finished with 10 men after Harry Clarke’s stoppage-time dismissal for his second booking.“It wasn’t our best performance and we didn’t hit the levels we did across the large majority of the season,” said McKenna.“We finished at home with a 6-0 (win over Exeter) which was such a wonderful day, probably the best day in a lot of the players’ lives.",
        "“We wanted to hit those levels again but the players are only human.“They and the staff work so hard and train to levels of intensity and professionalism that are really high.“That is why performances have been at the consistent levels they have been.“We didn’t have that same edge and intensity this week for obvious reasons.“When we don’t we aren’t such a good team. It was a little reminder for everyone going into next season that what separates us is the intensity and focus that we work with day to day.“That’s what we need to do many times over next year. But I have great pride in the season.",
        "“We wanted to finish it off with a win but there is still an awful lot to be pleased about.“It has been an incredible season in so many ways on and off the pitch. Everyone can take the next week to enjoy that.“But after that we will be already starting to refocus for next season to be as ready as we can be.”Fleetwood’s point saw them finish 13th, drawing both games with promoted Town.“We need to make sure we push towards the play-offs (next season),” said manager Scott Brown. “Or as far up the league as we possibly can.“Our budget won’t be anywhere near some of the teams in this league. But the chairman has ambition so I think we all must dream high.“Over the two games against Ipswich we competed really well against a team who has been promoted.“We knew they would come here expecting to win. But we didn’t worry about them and our performance typified our season.“There was no pressure on us so we could go and show our talent and compete.”"
    ]
}