{
    "articleURL": "/news/article-12044829/Jacinta-Price-slams-Labors-sneaky-Voice-Parliament-ad-claims-deceiving-Australians.html",
    "content": [
        " Jacinta Nampijinpa Price criticises 'sneaky' Voice adAd does not mention the words Voice to ParliamentDo you have a politics tip? Email brittany.chain@mailonline.comJacinta Nampijinpa Price has criticised the Albanese Government's 'sneaky' new ad promoting the Voice to Parliament.",
        "The Shadow Indigenous Affairs Minister and critic of the Voice told 2GB's Ben Fordham the warm and fuzzy national ad campaign was 'very, very deceptive'.The ad focuses heavily on the word 'recognition' - something which Ms Nampijinpa Price and many other critics believe should be an entirely separate discussion to the Voice.'The word recognition, that's something I think all Australians can get behind,' she said.'But there's not a lot [in the ad] in the way of the Voice.'In fact, the words Voice to Parliament, or even just the Voice, are not mentioned once in the 30-second clip.",
        "The ad includes a voiceover of Gadigal elder Uncle Allen Madden saying 'Australia's constitution is 122 years old, and still doesn't recognise Indigenous Australians,' before cutting to an Indigenous woman who says: 'We've been here for 65,000 years.'The voiceover continues: 'This year Australians have the chance to fix that with a referendum to give Indigenous Australians a real say in their future.'Ms Nampijinpa Price told Fordham: 'It's very, very deceitful, but typical of Labor.'To suggest we're not recognised in the constitution... we're Australian citizens. It's nonsense. That's taking Australians for a ride.'The Voice proponent of it, for three per cent of the population to have an extra vote and say for matters that relate to every single Australian... that's not equality of citizenship.' ",
        "The campaign was rolled out in late April and has been described as a 'rallying call' to encourage 'Yes' voters.The ad has been shown on televisions, online, billboards and on bus shelters across the nation. But there's no explanation of the most controversial elements of the proposal - which is that the Voice will enable a new component to be added to Parliament if it were to pass. Between October and December this year, Australians will be asked via a referendum whether they support the establishment of the Voice to Parliament to recognise Indigenous people in the Constitution.The Voice will establish a body that can 'make representations to the parliament and the Executive Government of the Commonwealth on matters relating to Aboriginal and Torres Strait Islander peoples'. This body - comprised of Indigenous people from a range of ages and demographics - would give advice to the government. But critics note it's unclear exactly what they could advise on.Fordham noted that supporters of the Voice campaign have expressed concerns that if Australia votes down the referendum, there may never be a welcome to country again.Ms Nampijinpa Price shrugged off such suggestions, arguing that she doesn't feel the need to be 'welcomed to our own country' frequently.She said: 'My elders taught me it doesn't matter what your racial heritage is, if you were born or conceived in this country, you too have a spiritual connection to this country.",
        "'To suggest you should be welcomed to your own country all the time, I think people are getting sick of that. I know I am. I'd rather get on with the real job of overcoming some of our most pressing issues.'  ",
        "Ms Nampijinpa Price is leading the Liberal party's campaign against the Voice after leader Peter Dutton promoted her to MP for Indigenous Australians in the wake of Julian Leeser's resignation.'She's a warrior for Indigenous Australians and she's a very proud (Northern) Territorian,' Mr Dutton said of her appointment.'She's always fought hard to improve the lives of Indigenous women and kids.'  A referendum is needed to change the constitution for the Voice to go ahead. The vote will need support from the majority of Australians in the majority of states to be successful. Ms Nampijinpa Price is the daughter of a Warlpiri woman, Bess Price, who served in the Northern Territory Legislative Assembly and a father with Anglo-Celtic ancestry.She acknowledged in the interview with Fordham that there is 'a lot of goodwill out there from Australians' regarding supporting Indigenous communities, but argues there's no guarantee the Voice will improve the lives of marginalised people.'What is it that they say - the road to hell is paved with good intentions,' she said.  ",
        "A group of everyday Indigenous Australians have launched a campaign speaking out about why they intend to vote against the Voice to Parliament.The group, called Fair Australia, is led by Ms Nampijinpa Price.On Fair Australia's website, she says: 'It is not right to divide us along the lines of race, especially within our Australian founding document.'Cheron Long, a campaigner on women's rights whose cousin died hours after being sexually assaulted, said: 'The only voice we will ever need is the Australian voice. Let's create unity and not division.",
        "'We are one Mob, the Aussie Mob. Don't let them divide us.'Another woman, named Matilda Walker, told Fair Australia: 'I'm a daughter, I'm an aunty, I'm a cousin and I don't want others to look at me differently. We are one Mob.'An elder, named Lavinus, added: 'I love my family, and I don't want people to look at them differently.'While a man named Stewart Rankin said: 'I don't want you to look at me differently. That's why I'm voting no.'"
    ]
}