{
    "articleURL": "/news/article-12041965/Intelligence-specialist-soldier-24-killed-walking-home-drinking-session-army-friends.html",
    "content": [
        "LCpl Kayde Kumar, 24, was killed by lorry walking home from drinking sessionInquest heard he walked 10 miles to Upavon, Wiltshire base early in the morningAn intelligence specialist soldier was killed while walking home from a drinking session with army friends, an inquest heard",
        "Lance Corporal Kayde Kumar, 24, decided to walk 10 miles back to his base in Upavon, Wiltshire in the early hours of the morning.But he was struck by a heavy goods vehicle at 55mph when the driver failed to see him in time as he walked in dark clothes.An inquest heard it was a mystery why LCpl Kumar, from Wrexham, North Wales, was walking west on the carriageway - and may have got lost after setting off towards his base in Upavon, Wiltshire.LCpl Kumar's heartbroken mother described her soldier son as 'highly respected' in the military. ",
        "The soldier had previously walked miles home from nights out in order to avoid £30 taxi fares.He had been out in Amesbury with four fellow soldiers and had drunk over five pints of lager, Disaronno and cokes and shots on the night out.LCpl Kumar was almost struck by passing cars several times but the inquest heard he didn't seem to be aware of the danger.He was seen 'staggering' and 'wobbly' before being struck.At around 2.10am on January 28 last year, while around three miles east of Stonehenge, the soldier was hit by the wing mirror of the DAF lorry and was pronounced dead two hours later. He was almost three times the drink-drive limit.",
        "The coroner was told he was 'inconspicuous' due to his dark clothing, was not walking on the footpath alongside the A303 in Wiltshire, and had declined a lift home from his friends during the night out.LCpl Kumar's mother Zoe Kumar, from Wrexham, said: 'He was having an exceptional career and was highly respected by his military colleagues and peers.'Keeping fit was something he loved, he liked long walks and hikes with friends. He was a selfless individual who raised money for charity, doing the Three Peak Challenge.'He was a passionate sportsman - a black belt in karate and and a keen footballer.'",
        "She added: 'He was the life and soul of the party. He loved going out to socialise, whether for food or drinks, he valued spending time with his friends and it always made him so happy.'He was always happy, always smiling, he had the most amazing smile. I was so proud to be his mum.'LCpl Kumar, who had three brothers and was also from Wrexham, joined the Army in 2019 and had recently served in Afghanistan.At Salisbury Coroner's Court, Coroner David Ridley recorded a conclusion that alcohol impaired his thinking and that he would have been hard to see due to his dark clothing."
    ]
}