{
    "articleURL": "/wires/aap/article-12044815/Day-battles-health-issue-return-golfs-big-time.html",
    "content": [
        "He's finally shaken a debilitating back injury that derailed his career but now Jason Day is battling another health issue that threatens to undermine the former world No.1's promising return to prominence.",
        "With six top-10 finishes and 11 top-25s in 14 starts this season, a revitalised Day entered last month's Masters among the favourites at the year's first major.But an untimely bout of vertigo cruelled his chances as Day crashed from contention to a final-round eight-over-par 80 and a tie for 39th at Augusta National.Day is trying to look on the bright side ahead of this week's $US20 million ($A30 million) Wells Fargo Championship in North Carolina, where he won the trophy in 2018 for his most recent tour victory.\"Overall I'm very pleased with how things are. I just would like to try and get myself closer to the lead on the weekend to give myself a chance at winning an event here soon,\" he said.\"Obviously Augusta was a little bit of a hiccup. Last round was not where I needed it to be.\"But overall coming into this week, I've had three weeks off so looking forward to getting some good momentum going not only this week but next week and then the PGA after that, so I've got three in a row. We'll see how it goes.\"Day didn't want to make a fuss of his vertigo struggles but the condition also struck him down when he led world No.1 Scottie Scheffler during the quarter-finals of the WGC Match Play in Texas last month as well.",
        "The 35-year-old admits it's frustrating.\"It's just hard because when you feel like you're running on all cylinders, you're making a lot of birdies, you're doing a lot of good things, it's difficult when sometimes the health plays a factor,\" Day said.\"If it's a back I understand, but I feel like I'm kind of beyond that now, which has been great because I worked really hard on it.\"Obviously there's this sort of thing. So it's just one thing after another where I just kind of have to peel it back a little bit.\"Then I am under a lot more stress this year than what I was in previous years just because of where I am week in and week out. I've been playing a lot better so there's obviously more stress.\"And when you have more stress, your immune system can get compromised and for me it was just unfortunate that happened in the last round (at the Masters).\"But I've had three weeks off and I feel like I'm getting a handle on it, which is good.\"Day will play the first two rounds at Quail Hollow in the marquee group with world No.3 and three-time Wells Fargo winner Rory McIlroy and reigning US Open champion Matt Fitzpatrick.",
        "Fellow Australians Adam Scott, Cam Davis and Harrison Endycott are also in the field.American Max Homa is defending champion."
    ]
}