{
    "articleURL": "/tvshowbiz/article-12055527/Belinda-Russell-breaks-silence-shock-departure-Weekend-Today.html",
    "content": [
        "Belinda Russell has broken her silence following her departure from Channel Nine's Weekend Today.",
        "The TV presenter, 44, told this week's Stellar magazine, she wasn't expecting to be let go and was 'disappointed' by the decision.'It wasn't the start to 2023 that I was expecting, and it was disappointing,' she began.'It's going to be a bit of a knock to your confidence and self-esteem but you do then think, well, what's next? You've got to trust the universe and back yourself.'Belinda, who gained a huge fan base with her lighthearted Tik-Tok videos, went on to say 'life is good' after leaving the role.",
        "'I work at Channel Nine and for Channel Nine, but I don't think any particular role belongs to me,' Belinda added. 'You hope your ability means you're put in roles that you can shine in, but my eyes are wide open. If I don't work in the TV industry any more or I leave Channel Nine, life is still going to be good.'Belinda announced she was leaving Weekend Today in early March via a statement on Instagram. A move that shocked viewers.In a terse statement addressing her 'career update', she wished the Today team 'good luck' and confirmed she was 'looking forward to future opportunities' at Nine.",
        "'Hello, friends. A little career update for you. My time on Weekend Today has come to an end. Thanks to those who tuned in,' she began.",
        "'I hope I brought some sunshine and joy to your weekends. I have loved the last year and am looking forward to future opportunities at Nine.'Good luck to the team for 2023 and beyond!'Nine did not comment on Russell's departure from Weekend Today, but said in a statement she remains 'a valued member of the 9News team which will enable her to work across all of our news brands'.After joining Nine 16 years ago, Russell steadily rose through the ranks, becoming the weeknight weather presenter for Nine News Sydney in 2013.   She became a familiar face to daytime TV viewers in 2019 when she filled in on Today Extra while Sylvia Jeffreys was on maternity leave.",
        "She continued to host the morning program on Fridays alongside David Campbell after Jeffreys returned to work a year later.She was appointed co-host of Weekend Today with Charles Croucher and Richard Wilkins in November 2021.Russell shares three daughters with her Sky News executive husband Mark Calvert, who was previously Nine's director of morning television.In addition to her TV career, Russell is known for her viral dancing videos on TikTok, where she has more than 400,000 followers."
    ]
}