{
    "articleURL": "/femail/article-12049763/I-simple-mistake-travelling-Bali-ended-hospital.html",
    "content": [
        "Shakira Coldwell, 30, got sick after drinking ice while holidaying in Bali READ MORE:  Travellers are flocking to this 'magical' stretch of rainforestA woman has gone viral on TikTok revealing the simple mistake she made while travelling in Bali – ending up in hospital after the blunder.",
        "Shakira Coldwell, 30, visited the Indonesian province in December 2022, planning to spend three months there before continuing a trip around the world.But despite warning from tour guides to avoid drinking the local water, Shakira, from Brisbane, consumed some ice – and quickly became sick, faint and dehydrated, before being rushed to hospital.Her story has reached more than 27.9m views on TikTok after she shared her experience to warn others visiting the country.After consuming the ice , she began to feel dizzy and nauseous, but continued her trip, travelling to Gili Island off the coast of Bali.",
        "It was then that things started to get worse, and Shakira visiting a nearby medical centre as her symptoms worsened.The doctor immediately lay her down and gave her an IV drip while he ran tests.The results showed she had salmonella poisoning.'It is a common conception to always ask for your drinks without ice,' Shakira, a student, said. 'I was in Bali for about three and a half weeks and was sick for about half of it.'They told me that I was very sick and dehydrated, and they also said I had salmonella poisoning.'I couldn't even focus on what he was saying before I was in pain and the room was spinning.",
        "'I looked very dehydrated and did not look well.",
        "'There is no hospital on the Gili islands so it was just a tiny medical centre with doctors.'Shakira was given IV fluids and medication, and after five hours in the medical centre was finally discharged, feeling better after three hours.The treatment cost her $346.Shakira shared her experience on TikTok, warning others not to drink the water in Bali – especially if you have a sensitive stomach.",
        "The video, titled 'Don't forget pls', has garnered 27.9 million views and 2.6 million likes, with viewers sharing their own experiences.Gina said: 'I had Bali Belly - It is not fun!!!! But I still love Bali all the same,' one person said. 'I don't get ice anywhere EVER because restaurants don't clean their ice machine and serve black mould cubes instead of ice,' commented another user.'I'm so scared to go to Bali for this reason,' said someone else.",
        "One commented: 'It definitely is the alcohol! it's real cheap/not good for you there. The ice cubes are regulated so it's not tap water.'And another added: 'I literally had the worst time of my life in Bali. I have never been so sick in my entire life.'But Shakira hasn't let the experience sully her view of the travel hotspot.",
        "She said: 'This has happened to many people. I was just glad I bought health insurance beforehand!'But I definitely do not want this to make people think that Bali is a bad place.'I am definitely returning – I love the atmosphere, the locals and the food.'"
    ]
}