{
    "articleURL": "/sport/nfl/article-12048587/Young-Jets-players-starstruck-arrival-new-teammate-four-time-MVP-QB-Aaron-Rodgers.html",
    "content": [
        "Rodgers, 39, was spotted at Madison Square Garden with CB Sauce GardnerThe one-time Super Bowl champion is pinching himself after his move to NYC DailyMail.com provides all the latest international sports news Aaron Rodgers was sitting alone in the dark two months ago, pondering his future while many speculated about his next move, but he's now standing in the limelight following his trade to the New York Jets, while his some of his new, young teammates look at him in total admiration.",
        "'That's a legend right there, that's a Hall of Fame player,' wide receiver Garrett Wilson said in a video call on Wednesday. 'This is something 20 years from now, 30 years from now, I can tell my kids, ''You know, I played with Aaron Rodgers.'' 'I try not to think about it too much at this point, you know, just because we're going to work and he's my teammate and that's got to be the mindset. 'Guard Alijah Vera-Tucker, 23, said that getting to practice with Rodgers at Florham Park created 'a surreal feeling.'Linebacker Quincy Williams admitted that he was stood in awe at the sight of seeing the four-time league MVP in scrimmage for the first time.",
        "'I ain't gonna lie to you: I was starstruck a little bit,' said the 26-year-old. 'I was like, ''Hold on, Coach, let me just take a little minute to just take this in,'' just to watch a few throws and seeing him in the green.' Cornerback Sauce Gardner was spotted bonding with Rodgers on celebrity row at the New York Knicks' playoff game on Tuesday night at Madison Square Garden, while also meeting the likes of Chris Rock, Tracy Morgan and Dave Chappelle. 'Everybody knew who he was,' the 22-year-old said of Rodgers. 'I was able to be in his shadow a little bit. It was a great feeling.'  ",
        "After an offseason that included the 39-year-old going on an isolation retreat in Oregon and deciding to continue his playing career - and with the Jets - the one-time Super Bowl Champion was formally introduced by New York last Wednesday after acquiring him from Green Bay. The deal brought one of the league's greatest players to a franchise frustrated by 12 straight seasons without a playoff appearance and hungry for a winner. And Rodgers is already making an impact.'We expect to compete with everyone in the league, beat everyone in the league, be one of the better teams in the league,' said Wilson, last season's Offensive Rookie of the Year. 'We expect to do that. 'I'd be lying if I said we have someone of Aaron Rodgers' pedigree and the expectation doesn't go up a little bit. 'We know what comes with it. 'We know, all of a sudden, eyes are on us, and we have to back it up every time we take the field, practice or game. We're excited to prove that every week. With what we know we have, we're excited to prove that to the world every week.'",
        "The Jets haven't had a star quarterback since 2008, when Brett Favre, who preceded Rodgers in Green Bay, played for one season at MetLife Stadium, before dipping.",
        "Rodgers, who's admitted to 'pinching myself a lot of days' after his arrival in the Big Apple has attended three sporting events at the Garden and has been invited by the New York Mets to throw out the first pitch in a game, the 10-time Pro Bowler revealed on 'The Pat McAfee Show.'He even dined and wined with Gardner before picking up the tab at Carbone restaurant, one of New York's finer Italian restaurants. 'We were getting seated (at the Garden) and he was like, ''We're about to sit by Jessica Alba,''' said Gardner, last season's AP Defensive Rookie of the Year. 'I was like, ''Oh, I don´t know who that is.'' He looked at me like I'm crazy.'",
        "Rodgers is participating in offseason workouts, something he hadn't done the past couple of seasons in Green Bay while he feuded with the Packers' front office. A slow-motion video posted Monday by the Jets of Rodgers throwing a pass to Wilson has gotten more than 9.6million views.The Jets are counting on Rodgers doing that and jumpstarting an offense that ranked near the bottom of the league in several categories the past two years with Zach Wilson struggling in then-coordinator Mike LaFleur's system. Rodgers is reunited with Nathaniel Hackett, his offensive coordinator for three years in Green Bay, including the last two of his four MVP awards in 2020 and 2021.",
        "Hackett isn't the only former Packers teammate joining Rodgers in New York. The Jets signed Lazard, backup quarterback Tim Boyle and offensive lineman Billy Turner in free agency. They also already had wide receiver Malik Turner and offensive lineman Adam Pankey.The Jets also signed wide receiver Randall Cobb on Wednesday night. Cobb had two stints as Rodgers' teammate in Green Bay and walked off the field with the quarterback after the Packers' season-ending loss to Detroit at Lambeau.'It´s like the first day of school every single day,' Rodgers said on 'The Pat McAfee Show.' 'Everything's new and exciting and fun.'"
    ]
}