{
    "articleURL": "/wires/ap/article-12049253/Panthers-beat-Maple-Leafs-3-2-2-game-lead-series.html",
    "content": [
        "TORONTO (AP) - The Florida Panthers took advantage of crucial mistakes by the Toronto Maple Leafs, and now lead their second-round playoff series 2-0.",
        "Sergei Bobrovsky made 35 saves and the Panthers defeated the Maple Leafs 3-2 on Thursday night.\"Disappointing, baffling,\" Toronto coach Sheldon Keefe said. \"We didn´t make those mistakes one time in the last series.\"Anton Lundell had a goal and an assist, and Aleksander Barkov and Gustav Forsling also scored for Florida.Ryan O´Reilly and Alexander Kerfoot scored for Toronto, which blew an early 2-0 lead. Ilya Samsonov stopped 26 shots.´´(Go) back home, look in the mirror,\" Samsonov added. \"And ask what I need to do more? This is what we need to do - everybody.\"",
        "The best-of-seven series shifts to Sunrise, Florida, for Game 3 on Sunday. Game 4 is scheduled for Wednesday.The Panthers are in the midst of an impressive run, taking a two-game lead in the series after eliminating the Presidents´ Trophy-winning Boston Bruins in seven games, including three times on the road.\"It´s perspective,\" Panthers head coach Paul Maurice said. \"That´s five games in nine nights of as intense, emotional pressure you can put on a hockey team. We´ve been on an airplane for a while. We didn´t think we had much in our legs.\"It was just about character and it was just about fighting through it and battling.\"Toronto led 2-1 following a spirited, chippy first period. Trouble found the Maple Leafs in the second.",
        "Barkov tied the game 19 seconds into the period on a long shot for his second goal of the postseason. Less than a minute later, there was some sloppy play by Toronto in the defensive zone when Mitch Marner flipped an ill-advised pass to Auston Matthews, who couldn´t get it out of the zone.Florida quickly countered as Forsling finished off a setup by Matthew Tkachuk - his fourth of the series - for his second and a 3-2 lead.\"We´re not just running around like animals,\" Panthers winger Matthew Tkachuk said. \"We´re just trying to play our identity.\"The Maple Leafs took a while to recover before Nylander hit the post with a shot that also hit Bobrovsky in the back and stayed out. Florida defenseman Brandon Montour then hit the post at the other end.Toronto captain John Tavares had a great chance in front before Josh Mahura took a Nylander shot off the visor that left a trail of blood on the ice as he exited for the locker room. The Panthers defenseman returned for the third period.Toronto came out for the third with plenty of urgency, but couldn´t solve Bobrovsky, who has started to rediscover his Vezina Trophy-winning form in these playoffs after losing the starting job late in the regular season to third-stringer Alex Lyon.",
        "Tavares was stopped in alone and Nylander hit another post. The Maple Leafs winger was also denied in tight with five minutes left in regulation.Toronto continued to press with Samsonov on the bench for an extra attacker, but couldn´t beat Bobrovsky.\"Not an ideal spot,\" Tavares said of his team´s predicament. \"A chance to regroup here and look forward to getting on the road. Going to be a tough test, but one we´ve got to raise our level.\"Toronto dropped the series opener 4-2 at Scotiabank Arena, but got off to a fast start Thursday when Kerfoot scored on the rebound of a Luke Schenn point shot for his second at 2:20 of the first.Unable to connect on two early power plays in Game 1, the Maple Leafs made it 2-0 on a man advantage at 5:10 when Marner found O´Reilly, who scored his third on a one-timer.The Panthers, who beat the record-setting Boston Bruins in seven games to make the second round, started to push back as the period wore on.Florida responded at 11:13 when Lundell scored his first after linemate Eetu Luostarinen crushed Leafs defenseman Timothy Liljegren behind Samsonov´s net and Tavares fell.TORONTO´S KNIES HURT The Maple Leafs lost forward Matthew Knies to injury after he was roughed up behind the net by Florida´s Sam Bennett midway through the first period and did not return to the game after the break.",
        "Bennett bodychecked Knies into the boards and used his right arm to drive him downward as both players fell to the ice. Knies appeared dazed after the play and was slow to get to his feet.\"I don´t have an update on his status,\" Maple Leafs coach Sheldon Keefe said. \"Obviously he didn´t complete the game so that´s not positive. In terms of the hit, I´m not going to comment on that.\"The team announced early in the second period that Knies would not return. Specifics on the injury were not revealed.MATTHEWS ON THE MARKMatthews assisted on O´Reilly´s first-period goal, giving him points in eight straight games and matching a franchise record previously shared by Gary Roberts (2002), Doug Gilmour (1993) and Gary Leeman (1986).GET KRAKENToronto defenseman Mark Giordano - the first captain in Seattle Kraken history - has been keeping tabs on his old team´s run in the playoffs.The second-year franchise finished 30th in last year´s standings, but secured the Western Conference´s first wild-card spot this spring before upsetting the defending Stanley Cup champion Colorado Avalanche in seven games in the first round.\"The foundation was laid in place last year,\" said Giordano, acquired by Toronto prior to the 2022 trade deadline. \"They also made some huge additions and really helped their team.\"",
        "___AP NHL Playoffs: https://apnews.com/hub/stanley-cup and https://twitter.com/AP_Sports"
    ]
}