{
    "articleURL": "/news/article-12049781/Coronation-weather-forecast-Met-Office-warns-heavy-rain-London-tomorrow.html",
    "content": [
        "Met Office says 60% chance of light rain in London from 9am to 12pm tomorrowForecasters warn there is then an 80% to 90% chance of heavy rain until 2pmThe Coronation of King Charles III could be a washout tomorrow with royal fans set to be soaked as London is lashed by heavy rain during the processions.",
        "The Met Office has warned of a 60 per cent chance of light rain from 9am until midday tomorrow, then an 80 to 90 per cent chance of heavy rain until 2pm.Charles and Camilla's procession will sets off from Buckingham Palace at 10.20am tomorrow, before the service at Westminster Abbey at 11am. They will then travel back to the Palace between 1pm and 1.30pm, before a scheduled flypast at 2.15pm. Conditions are set to become drier from 3pm but it will also feel humid in the capital with temperatures of 15C (59F) to 17C (63F) expected in the afternoon.The poor outlook has prompted concerns that the flypast to celebrate the occasion is at risk of being cancelled, with a final decision set to made at the last minute.Today will be a day of sunshine and showers, with some of the rain expected to be heavy and slow moving at times along with thunder, lightning and hail.",
        "The downpours will affect most parts of the UK, including London, and highs of up to 20C (68F) are expected across much of England and Wales.",
        "Here is a rundown of all the timings so far for the King's Coronation day 6am - Viewing areas open along the procession route.7.15-8.30am - Guests for Westminster Abbey begin to arrive at security check points in Victoria Tower Gardens.9am - Congregation to be seated inside the Abbey.9.30-10.45am - Heads of state, overseas government representatives, Government ministers, First Ministers, former PMs, foreign royals and members of the royal family arrive.9.45am - The Sovereign's Escort of the Household Cavalry begin to gather ready for the procession from Buckingham Palace.10.20am - The King and Queen Consort's procession sets off from the Palace.10.53am - The King and Queen Consort arrive at Westminster Abbey.11am - Charles and Camilla enter the Abbey through the Great West Door and the service begins.12pm - The King is crowned. The Archbishop of Canterbury places the St Edward's Crown on Charles's head. Trumpets will sound and gun salutes will be fired across the UK.1pm - The service ends and the newly crowned King and Queen begin their coronation procession back to Buckingham Palace in the Gold State Coach.1.33pm - Charles and Camilla are expected to enter Buckingham Palace through the Centre Arch.1.45pm - The King and Queen Consort receive a royal salute from the military in the Palace gardensAround 2.15pm - The King, Queen Consort and members of the royal family appear on the Palace balcony to watch the flypast.",
        "Tomorrow is then forecast to be another cloudy, wet day for many.",
        "Showers are set to develop in central, eastern and northern areas as well as across Northern Ireland, but are not expected to be as intense or as heavy as those today.Met Office deputy chief forecaster Steven Keates said: 'A further area of rain is expected to move into southwest England early on Saturday, moving east and north through the day with some heavy bursts at times.'This is likely to bring some rain to London by around lunchtime. Further north in Scotland, northern England and Northern Ireland it will be a day of sunshine and showers before the more persistent rain moves northwards overnight. It will feel humid, especially in the south, with highs of 17C possible in London.'Heavy and thundery downpours are then expected again on Sunday, although the day will start with areas of rain and drizzle.The heavier downpours could then develop across central, eastern and southern England, with parts of North East England and eastern Scotland looking grey and wet.Western parts of the UK, Northern Ireland, Wales, western Scotland and South West England are forecast to see the driest and brightest weather on Sunday.On Monday, eastern areas will start out mostly dry but a band of rain in the West will move eastwards during the day and bring rain to many areas.",
        "This rain will be followed by sunshine and scattered showers, while winds are expected to be fresh to strong with temperatures near average.Royal Air Force (RAF) Air Chief Marshal Sir Michael Wigston has said 'it's 50/50' as to whether the flypast will go ahead tomorrow, and the final decision will be made just one or two hours before it is due to start.Cloudy and wet conditions in London on Saturday could hamper the ability of pilots to fly safely.More than 60 aircraft from the Royal Navy, British Army and Royal Air Force - including the Red Arrows - are scheduled to fly over The Mall and Buckingham Palace at around 2.15pm.The King and Queen Consort are due to appear on the palace balcony with other members of the royal family to watch the six-minute flypast.Sir Michael said: 'The weather isn't looking brilliant, but there's nothing we can do about it. We have to be safe, we have to make sure that we aren't taking any unnecessary risks.",
        "'We'll make a weather call one or two hours before the actual moment, but if there's rain and low cloud then it will be almost impossible to get it through.'It's 50/50 at the moment, but we have lots of options, the decision will be made, at this stage we're hoping for the best.'",
        "A Ministry of Defence (MoD) spokesman also said: 'The latest weather information will be obtained from both the Met Office and from our helicopters performing weather checks in advance of the main flypast on Saturday.'If suitable, the flypast will continue as planned. If not, then there are options available to reduce the numbers of aircraft, with cancellation being the last resort.'The decision on whether to go ahead with the flypast can be made by the RAF's Air Vice-Marshal Mark Flewin, Air Officer Commanding No 1 Group, or the aircraft pilots.There were fears the flypast for the late Queen's coronation in June 1953 would be called off due to bad weather, but after conditions improved it went ahead at 5.15pm following a delay.",
        "According to Met Office analysis of coronations since Edward VII in 1902, the current warmest on record was that of George V on June 22, 1911, when temperatures reached 17C (63F).On the late Queen Elizabeth II's coronation, on June 2, 1953, the maximum temperature was just 11.8C (53.2F).Coronations during the 20th Century were also generally dull, with no sunshine recorded on George V or George VI's coronations and only 1.2 hours when Queen Elizabeth was crowned.The UK's warmest day of the year so far was April 17, when 21.2C (70.2F) was recorded at Kinlochewe in northern Scotland.",
        "However yesterday ran close to this, with a UK high of 20.9C (69.6F) recorded at Charlwood in Surrey."
    ]
}