{
    "articleURL": "/news/article-12045621/Wife-cheating-military-police-officer-admitted-affairs-accused-stalking-harassing-him.html",
    "content": [
        "Rebecca Egerton-Jones, 48, is accusing of harassing ex-husband Michael HarrisSgt Harris, 40, of Leuchars, Fife, admitted to having two affairs during marriageA military officer claimed his wife stalked and tracked him for a year after finding scantily-clad photographs of other women stored on his computer.",
        "Military policeman Sergeant Michael 'Bomber' Harris, 40, admitted having two affairs during his marriage but denied cheating on his wife with five women.He told a jury that his former wife and superior officer Rebecca Egerton-Jones, 48, made him the object of 'pity and ridicule' among his army colleagues.Sgt Harris told Perth Sheriff Court that his wife subjected him to a year-long campaign of bullying and harassment.He said she refused to let him have passwords on his laptop or mobile phone because she wanted to carry out inspections to check on his behaviour.",
        "He told the court she threatened to kill him and hit him on the head and, on another occasion, ripped his shirt during an angry tussle at their Leuchars home.'She has made my life a hell and has done everything to destroy me,' he said. 'It was just like constantly living on edge.'It was a consistent feeling that if I didn't behave the way she thought I should, or do something she disliked, things would just blow up.'I had the consistent worry that if you tried to escape then something bad would happen. She's a nasty, vindictive person and I wouldn't put anything past her.'Sgt Harris admitted having an affair with British Embassy staff member Liz Atwell while he was posted in Afghanistan during 2014.",
        "He also admitted having an affair with a second woman in 2018, and accepted he told his wife he had a third affair with another colleague on duty in Northern Ireland.The court was told that Egerton-Jones found a topless picture of a woman on the hard drive of her husband's computer. He told her it was of an ex-girlfriend he had dated prior to their marriage.Sgt Harris told the trial that he had subsequently become involved in a relationship with the topless woman's sister and that Egerton-Jones had then flon into a rage.He said she sent him the topless picture and also sent it on to members of the woman's family as well as threatening to send it to her husband.",
        "Sgt Harris, who has also worked as a close protection officer, said: 'The relationship was quite strained. She would have these outbursts. She would want to know where I was all the time.'She would shout at me. There was a lot of negativity and hostility and it was very unpleasant. There was no affection or intimacy or anything like that.'I didn't want to be there. I stood up to leave the room. She got in my way so I tried to get past her and she grabbed me, ripped my shirt and started to claw and scratch me.",
        "'As I bent down to put shoes on I remember feeling something on the back of my head and she had slapped or punched me. I was really shaken up.'He told the jury that other officers invited him to a pub quiz night, but his wife - by now working at Specsavers - had told him he could not go out.Instead, she went to the same quiz night with her colleagues - and as a result he was mocked by his colleagues for being under the thumb and humiliated.He said: 'I think she did it primarily to humiliate me. The guys used to joke about it. My nickname was Bomber and they used to call me a battered husband.'I kind of became a bit of a pathetic creature. People used to make a joke about it. It wasn't great for me to have colleagues see me as a subject of pity or ridicule.'He told the court the couple had got together in 2005, married in 2008 and had two children, before separating finally in 2019.Solicitor Iain Houston, defending, asked: 'Did you resent your wife having a higher ranking than you?' He replied: 'No, that never mattered to me.'Egerton-Jones denies the charge and the trial, before Sheriff William Wood, continues."
    ]
}