{
    "articleURL": "/wires/pa/article-12051501/Jill-Biden-meets-Sunak-s-wife-Akshata-Murty-Downing-Street.html",
    "content": [
        "US first lady Jill Biden has joined Prime Minister Rishi Sunak’s wife for an afternoon exploring veterans’ affairs and education before attending the coronation.",
        "Mrs Biden and Akshata Murty met veterans taking part in a boxing session at Downing Street on Friday.Ms Murty then accompanied Mrs Biden, who is a professor at a community college in the US, to speak with primary school pupils in central London.",
        "The first lady has flown to the UK to represent her husband, US President Joe Biden, at the service at Westminster Abbey on Saturday.She is being joined on the trip by granddaughter Finnegan Biden, who accompanied Mrs Biden to No 10 on Friday.It comes after former US president Donald Trump, during a visit to Scotland this week, accused Mr Biden – who defeated the billionaire at the 2020 presidential election – of being “disrespectful” to Charles by not attending the ceremony.After posing for photos outside the door of No 10, the leaders’ wives held private discussions over tea and cakes.They then met British veterans minister Johnny Mercer and US ambassador to the UK Jane Hartley in the Pillared Room, where a veterans’ session organised by the Fighting Chance boxing charity was under way.",
        "The exercise class had been due to be held in the garden of Downing Street but heavy rain saw it brought inside.As well as talking to the organisers, Mr Mercer introduced the two women to former lance corporal Maurillia Simpson.",
        "Mr Mercer helped Ms Simpson, who has won a gold medal at the Invictus Games, out of her wheelchair so she could stand and talk with Mrs Biden and Ms Murty.After chatting for a few minutes, the three of them helped Ms Simpson, who was injured during service, back into her chair.In the US, Mrs Biden has her own White House initiative to support military and veteran families, called Joining Forces.Later in the afternoon, Ms Murty and Mrs Biden took a short drive over the River Thames to Borough, south London, where they met primary school children enjoying a coronation-themed lunch.",
        "Mrs Biden and Ms Murty sat at a table with the Charles Dickens Primary School children, who were wearing paper crowns and eating sandwiches and cakes, to talk with them about Saturday’s service.Before getting up to leave for a tour of the school, the first lady told the pupils: “Nice to see you all, have fun tomorrow. I’ll be thinking about all of you.”The pair also visited a Y6 music lesson and listened to pupils play guitars, a cello and a double bass to perform Lovely, a song by American artist Billie Eilish.After the performance, Mrs Biden said: “This was a treat, thank you so much. Thank you for sharing your talent with us.”",
        "The 71-year-old laughed in surprise when one of the pupils told her his favourite musician was the late pop singer Michael Jackson, who died in 2009."
    ]
}