{
    "articleURL": "/wires/reuters/article-12049863/Ukraines-nuclear-deal-Canadas-Cameco-carries-big-risks-rewards.html",
    "content": [
        "By Rod Nickel and Pavel Polityuk",
        "WINNIPEG, Manitoba/KYIV, May 5 (Reuters) - Ukraine's 12-year deal to buy enough uranium from Canadian miner Cameco Corp to power all of its nuclear reactors gives each side the right to change sales volumes with two years' notice, the Ukrainian state-owned utility Energoatom told Reuters.The unusual flexibility of the deal announced in February, the details of which have not been reported previously, reflects the uncertainties caused by Russia's war with its neighbour and underlines the high stakes for both parties.For Cameco, the risks are financial. For Ukraine, reliance on a single provider leaves it with few alternatives to maintain power supplies.\"There's a lot of flexibility\" in the deal, Energoatom CEO Petro Kotin told Reuters in an interview. \"The agreement is up to 2035, but two years prior to supply of the uranium, we are to (give) them an indication of what we will need, what volume of uranium we will require.\"Prior to Russia's invasion of Ukraine in February last year, Ukraine ran its nuclear reactors on Russian fuel, producing 55% of the country's electricity.Ukraine has since ceased Russian fuel purchases and has turned to Western companies such as Cameco.Last year Cameco restarted the world's largest high-grade uranium mine in northern Saskatchewan, as a more than decade-long slump in the sector eased, partly because of the Ukraine war and partly because of global efforts to reduce carbon emissions.",
        "As the company ramps up production for the Ukraine contract, its biggest so far, it is also betting on winning more deals from eastern European countries as they try to reduce dependence on Russian energy.The stock of Cameco, the world's fourth-largest uranium producer, is up more than 50% since Jan. 31, 2022, when expectations Russia, a big uranium producer, would launch a full-scale invasion spurred an extended rally.DEAL WORTH $4 BILLIONUnder the agreement with Energoatom, worth at least $4 billion at current prices, Cameco will supply Ukraine with uranium hexafluoride (UF6) from 2024-2035, allowing the country to end its reliance on Russian fuel.The deal will supply the nine reactors under Ukrainian control, with an option to supply six captured reactors in the southeastern Zaporizhzhia region if Ukraine retakes them.Cameco, like Energoatom, can adjust how much uranium it delivers on two years' notice, Kotin said.A spokesperson for Energoatom said there were no restrictions on how much either side can adjust the deliveries.The two-year window to adjust volumes without limit offers flexibility well beyond the normal uranium contract adjustments of 5%-15% annually, Nick Carter, executive vice president of UxC LLC, an independent research firm focused on the nuclear fuel cycle, said.For Cameco, the biggest risk is that Ukraine, whose energy grid and thermal power generators have been military targets since the invasion, might require less uranium should Russia capture or damage more reactors.",
        "Cameco would then have to \"find a home for this previously contracted material,\" Carter said.\"We have plenty of visibility and advance notice regarding the annual volumes required under the contract, which provides us with flexibility to adjust our plans, including for production if circumstances require,\" Cameco spokesperson Veronica Baker said in a statement, declining to confirm deal terms.DISCOUNTS OR PRICE SPIKES?Finding new buyers at short notice could be costly.Contracted uranium prices are typically higher than spot prices, meaning that Cameco may take a discount if Ukraine purchases less uranium due to the war's impact, Carter said.Alternatively, if prices spike during the next 12 years, Cameco may be unable to fully cash in with so much production dedicated to Ukraine unless it scales back those sales, Carter added. He expects prices to continue rising in the next two years.\"I think Cameco has more to lose here than the Ukrainians if the (market) price were to continue higher,\" Carter said.Kotin said Energoatom will buy Cameco's uranium at a price based equally on a fixed price and a market price. Such an arrangement partly protects Energoatom from price spikes.Baker said it was normal for sellers and buyers to face risk from commodity price swings.Energoatom's risk is that Cameco chooses to sell it less uranium so that the miner can cash in on higher prices elsewhere, but that seems unlikely, Carter said.",
        "The main alternative to Cameco, French state-owned company Orano, told Energoatom it cannot supply it with more uranium until 2030, Kotin said. Orano declined to comment.To hedge against the risk of relying so much on a single supplier, Ukraine is trying to expand its domestic nuclear industry, Kotin said.BIG POTENTIAL REWARDSWhile Ukraine will rely on Cameco for uranium, it has struck separate deals for further processing.It has a contract with United Kingdom-based Urenco Group to enrich the uranium from Cameco, and with U.S.-based Westinghouse to fabricate the enriched uranium into reactor fuel. Such arrangements may secure Ukraine's energy needs no matter how long the war lasts.Other countries including Poland and the Czech Republic are also looking to increase reliance on Western-made reactors and fuels, Carter said.\"There is considerable interest among many nations and utilities seeking to realign how they meet their future energy input needs, including in eastern Europe,\" Cameco's Baker said.In April, Cameco signed a 10-year contract with Westinghouse - the nuclear service business which it and Brookfield Renewable Partners are in the process of buying - to supply UF6 for Bulgaria's single nuclear generating station.Canadian Natural Resources Minister Jonathan Wilkinson said Canada had \"a huge role\" to play globally. Without naming them, he said he had spoken with European countries keen to move away from Russian reactors and fuel.",
        "\"We have an abundance of uranium,\" Wilkinson said. (Reporting by Rod Nickel in Winnipeg, Manitoba and Pavel Polityuk in Kyiv; additional reporting by Benjamin Mallet and Forrest Crellin in London, Katya Golubkova in Tokyo and Steve Scherer in Ottawa; Editing by Denny Thomas, Mike Collett-White and Barbara Lewis)"
    ]
}