{
    "articleURL": "/wires/afp/article-12043257/Embiid-makes-improbable-NBA-MVP-dream-come-true.html",
    "content": [
        "Joel Embiid played volleyball and football as a child growing up in Cameroon, never turning to basketball until age 15. Now he's the NBA's Most Valuable Player.",
        "The 29-year-old power forward reflected on his improbable journey when he spoke Wednesday after practice for the Philadelphia 76ers as they prepared to face the Boston Celtics in the second round of the NBA playoffs.\"Probably the probability of someone like me, starting playing basketball at 15, to get the chance to be the MVP of the league is I'd say probably negative zero,\" Embiid said.\"But improbable doesn't mean impossible and you can accomplish anything you set your mind to as long as you believe in it and you keep working hard, anything can happen.\"For Embiid, it happened after he switched sports as a child and was seen by Cameroonian NBA player Luc Mbah a Moute, who helped him move to the United States at age 16 to boost his dreams of playing in the NBA.After a youth career and a season at the University of Kansas, Embiid was the third overall selection in the 2014 NBA Draft by the 76ers.Embiid stepped up his game as the years went along, having been an NBA All-Star since 2018 and winning the league scoring crown last season and this season with career highs of 30.6 points in 2021-22 and 33.1 points a game in 2022-2023.This year, he claimed the MVP award, defeating the past two MVPs, Denver's Nikola Jokic and Milwaukee's Giannis Antetokounmpo.",
        "\"Feels good obviously,\" Embiid said. \"That's something that I dreamt of and I've always wanted.\"No MVP has then led his club to an NBA playoff crown since Stephen Curry of the Golden State Warriors in 2015.Embiid hopes to end that drought despite suffering a sprained right knee and missing the opener of the best-of-seven series against Boston.While he feels healthy after some rest following a first-round triumph, Embiid says doctors will largely dictate when he returns.\"I'm going to listen to those guys and see what they have to say, the doctors,\" Embiid said.\"Obviously I want to play. Everybody knows me. I just love being on the court. If I've got the green light then we're going to go ahead.\""
    ]
}