{
    "articleURL": "/news/article-12042335/Inflation-bites-price-cheese-rockets-44-milk-costs-1-70.html",
    "content": [
        "Food items rose in price by as much as 52 per cent in the year to March 2023The ONS has released a new tool to help households calculate their cost of livingInflation is continuing to bite Britons with household staples including cheese, milk and meat rising in price by as much as 50 per cent in just one year, new data revealed today.",
        "Figures from the Office for National Statistics comparing food prices in March 2022 with March 2023 show the pressure on households is not set to ease anytime soon.The price of milk has risen 38 per cent to an average of £1.70 in the last year while a joint of roast beef for a family Sunday lunch will now set households back almost £12.The data has been published by the Office for National Statistics and is based on the Consumer Prices Index including owner-occupiers' housing costs (CPIH).This is a different measure to the usual inflation figures based on the CPI (Consumer Prices Index), as it includes the costs associated with owning, maintaining and living in your own home.",
        "It came after data from researchers Kantar found last week that overall food inflation remains above 17 per cent. The ONS said milk, cheese and eggs products saw one of the highest annual inflation rates in groceries, with a 30 per cent increase in the 12 months to March 2023.Hard cheese such as emmental and gruyere has seen the largest rise with an annual inflation rate of 44 per cent, increasing from £6.92 to £9.98 the year to March 2023.Oil-based products have also seen a significant rise, as the average bottle of olive oil jumped by 49 per cent to £5.78 since March 2022.",
        "They said a roast dinner for four people, including a whole chicken (1.5kg), white potatoes (1kg), carrots (1 kg), broccoli (350g) and butter (100g) now costs £8.68 on average, up £1.68 in a year - with broccoli recording the biggest rise at 34 per cent.Across fast food and takeaways, fish and chips saw the largest increase at 19 per cent, while the price of a pub hot meal went up 13 per cent or £1.25 to an average of £11.05. The price of an alcoholic drink is also up, with gin, vodka and liqueurs rising.But the item which saw the biggest price increase in the last 12 months was cucumber, which shot up by 52 per cent to cost 84p each. ",
        "The figures came just a week after new research put food inflation at well over 17 per cent, although dipped slightly from the previous month's 17.5 per cent.",
        "Own label sales were up 13.5 per cent year on year, with the very cheapest value lines soaring by 46 per cent, the research by analysts at Kantar found - with branded sales up 4.4 per cent while prices have risen fastest for staples including eggs, milk and cheese.The data also found UK grocery sales rose 8.1 per cent over the four week period year-on-year.",
        "Meanwhile some clothing and footwear items have increased in price by well over 15 per cent.The overall prices of clothing and footwear rose by 7 per cent in the year to March 2023, slightly down from 8 per cent in February 2023.But the ONS said that for more than half of the garments in the shopping price comparison tool, prices increased at a faster rate than the latest available official consumer price inflation measure for clothing and footwear.It also pointed out that there is much seasonality in clothing prices which may account for some of the variation seen.The ONS said that over a third of the clothing and footwear items in the comparison tool increased by more than 10 per cent.However, some experts at the Bank of England are predicting overall inflation will fall to below four per cent by the end of the year."
    ]
}