{
    "articleURL": "/news/article-12061299/Federal-Budgets-real-winners-revealed-stage-three-tax-cuts-benefit-wealthy.html",
    "content": [
        "The government to hand down the budget on TuesdayWealthy Aussies will benefit the most due to tax cuts This is despite cost-of-living measures in the budget While the Albanese government's federal budget prioritises relief for low income earners, the wealthy are set to benefit the most due to tax cuts.",
        "Treasurer Jim Chalmers, who has comprehensively broken down the support that will be provided for Aussies amidst the cost-of-living crisis, will hand down the budget in Parliament on Tuesday.At the core of the government's plans is more than $14.6 billion in cost-of-living relief for Australians over a period of four years.This includes an electricity relief handout that will save households up to $500 in energy bill costs. This handout will favour aged pensioners and welfare recipients.But the stage three tax cuts, which will be enforced next year, means high-income earners will see the biggest savings over the coming years. ",
        "The stage three cuts scrap the 37 per cent marginal tax bracket and lowers the 32.5 per cent tax rate to 30 per cent for all individuals earning between $45,000 and $200,000. A new top marginal tax rate of 45 per cent would apply for those earning more than $200,000. This means those earning more than $200,000 doing their tax returns for the 2024-25 financial year will get back $9,075 compared with 2023-24.Someone earning $80,000, a level shy of Australia's average full-time salary of $92,030, would get back just $875.The cuts are estimated to cost the budget about $20billion a year from mid-2024, according to the Gratton Report. This increases to $31billion by 2030.",
        "Over a period of ten years, the stage three cuts will cost the country about $254 billion.This means wealthy Australians will secure the most relief over the next four years thanks to the cuts - even with the government's cost-of-living measures at the centre of the budget. ",
        "The stage three cuts were introduced by the former Morrison government back in 2019 in a bid to stimulate the economy and fix bracket creep.It passed with Labor's support despite the party initially having reservations about the cuts.Anthony Albanese promised in the lead up to last year's federal election to make no changes to the cuts if he was elected.Treasurer Jim Chalmers has remained adamant that the government still had no intentions to make changes to the legislation.'The tax cuts are in the budget because our position hasn't changed and they were legislated some time ago,' he told the ABC last Sunday. He also said earlier in the month: 'Our position on stage 3 tax cuts hasn't changed and it's important to remember that they don't come in for more than a year now.''Our focus in this Budget is to work through all of the pressures in our economy in a methodical and responsible way. That means a decent cost-of-living package focused on the most vulnerable, delivered in the most responsible way.'",
        "The stage three tax cuts will come into effect in July, 2024.",
        "$45,000: Nothing$60,000: $375$80,000: $875$120,000: $1,875$150,000: $3,975$200,000: $9,075Tax liabilities for 2024-25 compared with 2022-23"
    ]
}