{
    "articleURL": "/money/markets/article-12046607/Hargreaves-Lansdown-buoyed-end-tax-year-clients-continue-withdraw-cash.html",
    "content": [
        "Assets under administration up 4% to £132bn in first three months of the yearBut asset retention lower than last year as some clients keep withdrawing cashShare dealing volumes up 23% versus previous quarter, down 20% on last yearHargreaves Lansdown said customers rushing to use their Isa and Sipp allowances before the end of the tax year and a return in investor confidence lifted its quarterly results. ",
        "The DIY investing platform reported that assets under administration rose 4 per cent to £132billion in the three months to the end of March compared with the previous quarter, supported by a 14 per cent rise in net new business to £1.6billion.However, asset retention was lower than in the same period last year, reflecting 'the continued need of certain clients for cash withdrawals', the company said.",
        "The fund manager attracted 23,000 new customers in the quarter, down from 31,000 a year ago, taking the total to 1.8million, while asset retention was 89.1 per cent, down from 91.5 per cent.Despite 'moderated' flows across the market, clients looking to make the most of their Isa and Sipp tax allowances helped drive the 'significant' improvement in net new business.Share dealing volumes were also up 23 per cent versus the previous quarter, but remained 20 per cent below last year.This is because the start of 2022 saw 'particularly elevated' trading activity, before investor confidence was hit hard by concerns over the war in Ukraine and cost of living crisis.Hargreaves Lansdown shares surged 4 per cent in early trade, but lost some of those gains to trade up 1 per cent to 800p towards market close. They remain down by around 10 per cent compared to last year.",
        "Fund managers suffered a tough market last year, with investors looking to hold on to their cash amid recession fears and volatile stock markets.Investor confidence took another beating in March this year as a result of the collapse of Silicon Valley Bank and consequent banking turmoil.But Hargreaves Lansdown chief executive, Chris Hill, remained upbeat.He said: 'Macroeconomic uncertainty continues but the improved activity demonstrates that as confidence returns, HL is well positioned to grow and support new and existing clients.'During the quarter, we launched a new cash ISA, three new Portfolio Funds and our enhanced Share Exchange service helping clients enable efficient use of their tax allowances.'In March, Hargreaves Lansdown cut its fees for Lifetime Isas and scrapped them entirely for Junior Isas to encourage young people to build their savings.",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}