{
    "articleURL": "/wires/reuters/article-12049319/Australia-PM-says-frustrated-continued-detention-Julian-Assange.html",
    "content": [
        "SYDNEY, May 5 (Reuters) - Australian Prime Minister Anthony Albanese said on Friday he was frustrated for not yet finding a diplomatic fix over the continued detention of Julian Assange and that he remained concerned about the mental health of the WikiLeaks' founder.",
        "\"I know it's frustrating, I share the frustration,\" Albanese told ABC television from London where Assange is being held pending a U.S. extradition case.\"I can't do more than make very clear what my position is and the U.S. administration is certainly very aware of what the Australian government's position is. There is nothing to be served by his ongoing incarceration.\"Assange, an Australian citizen, is battling extradition from Britain to the United States where he is wanted on criminal charges over the release of confidential U.S. military records and diplomatic cables in 2010. Washington says the release of the documents had put lives in danger.Albanese said Australians were failing to understand the reasons for freeing the source who leaked the documents to Assange while he still remained in prison, referring to the release of former U.S. soldier and WikiLeaks source Chelsea Manning.Assange spent seven years holed up in Ecuador's embassy in London after being offered refuge but was dragged out by British police in 2019. He has been staying in a prison in London while his extradition case was decided.Albanese has been advocating for the release of Assange, who faces a sentence of up to 175 years in a maximum security prison if extradited to the United States.",
        "\"Enough is enough, this needs to be brought to a conclusion, it needs to be worked through,\" said Albanese.In November, Albanese had raised the issue in meetings with United States officials but did not confirm on Friday if he would raise it with President Biden during his visit to Sydney on May 24 for the Quad leaders' summit.\"The way that diplomacy works ... is probably not to forecast the discussions that you will have,\" he said.(Reporting by Renju Jose in Sydney; Editing by Michael Perry)"
    ]
}