{
    "articleURL": "/tvshowbiz/article-12061581/Julian-Tobias-Island-nightclub-Sydney-dating-Fans-star-Paris-Ow-Yang.html",
    "content": [
        "Julian Tobias has unveiled romance with 'content creator' Paris Ow-YangTobias split from French model Charlotte Coquelin in 2021Tobias owns popular Sydney party haunts The Island, Bedouin and Sussudio Sydney nightclub boss and playboy Julian Tobias appears to have a new addition to his succession of glamorous partners, after linking with OnlyFans model and TikTok star Paris Ow-Yang.",
        "The 44-year-old nightclub proprietor, who runs popular Sydney Harbour venue The Island and Potts Point disco Sussudio, has been sighted around town recently with Ow-Yang - a stunning 21-year-old Bondi 'content creator'.Neither wanted to comment when contacted by Daily Mail Australia but friends say the new couple have been 'close friends' for several months but have recently taken the relationship to the next level, with Ow-Yang a regular visitor to Tobias' $5.5million Bondi penthouse.",
        "The pair are believed to  be holidaying together in California with Ow-Yang posting a handful of teaser snaps of her new beau while Tobias has also dropped relationship hints across his Instagram stories.Tobias, who opened his first Sydney bar in 2009, has established a reputation for dating a succession of stunning, high-profile women over the years.Tobias' most significant relationship to date was Charlotte Coquelin with whom he said to be engaged to for five years before the French model packed her bags and moved back to Paris in 2021.Prior to that, he made headlines in 2014 when he began dating Canadian actress and Vampire Diaries star Nina Dobrev, before moving on with American Instagram megastar Alexis Ren in 2016. ",
        "Meanwhile, the one-time Cleo Bachelor of the Year was recently embroiled in a violent incident at a Potts Point bar which resulted in hospital treatment.",
        "Kings Cross police allege Tobias was assaulted by prominent Sydney interior designer Joshua Clapp in the early hours of April 7.Clapp was charged with two counts of common assault and given conditional bail to appear at Downing Centre Local Court on May 3.Clapp later pled guilty to two counts of common assault and was sentenced to a  12-month community order.The magistrate also imposed a two-year apprehended violence order which prevent him going within 50 metres of Tobias including where he lives, works or socialises.",
        "Tobias has been contacted by Daily Mail Australia for comment.The nightclub boss is understood to be holidaying in the US with Ow-Yang and Barrio Chino owner Peter Lew and is expected to return to Australia in coming weeks to complete the addition of a Mexican-style cantina on Darlinghurst Road to his growing hospitality empire.Ow-Yang, meanwhile, is a significant presence on OnlyFans, attracting 40,000 views per post on the subscription adults-only content site.She also boasts a huge following in TikTok and Instagram. "
    ]
}