{
    "articleURL": "/travel/article-12051605/Im-22-year-old-pilot-people-tell-Im-young-fly.html",
    "content": [
        "Sabrina Johnson, 22, is frequently slammed for being 'too young to fly' She started flying when she was just 14 after being introduced to it by her dadAs much as she loves her job, she sometimes struggles with the hateA 22-year-old pilot has revealed she frequently fires back at trolls who make sexist comments about her and claim she's too young to fly a plane. ",
        "Sabrina Johnson is an airline and helicopter pilot who has been flying since she was 14, and despite having nine years of experience soaring the skies, she still struggles to fit into the male-dominated field.The pilot, who doesn't reveal the name of the airline she flies for, frequently shares her travels with her followers on both Instagram and TikTok, where she boasts more than 71,000 followers. And while Sabrina tries to pay no mind to negative remarks, she sometimes chooses to fire back, saying she doesn't 'trust' anyone on her plane who doesn't think she is capable of flying.",
        "Speaking to Insider, she revealed that while she received a ton of admiration for her job, Sabrina said there were also many comments hating on her. According to the Pilot Institute, only about 9.5 per cent of pilots are women, which makes Sabrina stick out in the male-dominated field, opening her up to the ruthlessness of trolls.She said some people even claim she was faking flying a plane and slammed her for her young age. 'They say, \"I wouldn't trust you to fly a plane\" all the time. And I'm like, \"Hey, I wouldn't trust you to be on my plane,\"' Sabrina added.Her dad was the person who first got her into flying by setting up a discovery flight for her - where those interested in becoming pilots can learn more about aircrafts. ",
        "She said that as soon as she started learning about flying, she became addicted. Now, nine years later, she is a pro.She usually files an Embraer ERJ 175, which is a 76-passenger jet. ",
        "Her flights are within the US, Mexico, and Canada. The longest flight she has made is from Chicago to Mexico, which was a three-and-a-half-hour trip.Sabrina's favorite part of being a pilot is taking in the glorious views. 'My favorite part of flying in general is the sights. On the cloudiest day, I pop above the clouds and see the sun and the sunset. You just can't beat the sights,' she told Insider.And although she loves the sights, Sabrina said the '24/7 vacations' don't hurt.As a pilot, she is only required to pay the taxes on tickets. Because she loves her job so much, Sabrina hopes that she can inspire young girls to never stop chasing their dreams, and never let anything stand in their way."
    ]
}