{
    "articleURL": "/wires/afp/article-12046249/Rwanda-counts-cost-floods-landslides-kill-130.html",
    "content": [
        "Rwandans grieved Thursday for lost loved ones and destroyed homes after powerful floods and landslides tore through the country killing at least 130 people and leaving many thousands homeless.",
        "The government was still counting the cost as families buried their dead in the aftermath of one of the worst such natural disasters in years in the hilly East African nation.Rivers of mud swept away homes and other infrastructure and cut off roads after heavy rains in several areas, particularly the Western Province bordering Lake Kivu where the worst devastation was reported.\"I found my child buried under rocks and bricks that fell on him during the heavy rains. He died at the hospital,\" Anonciata, who only gave one name, told AFP in the hard-hit district of Karongi.\"It is very devastating for our family. One of my other children also got badly injured on the head. I pray he survives.\"",
        "Imacule Kankwanzi said normal life had come to a halt in her village with nothing to eat and the roads blocked.\"Our houses are destroyed or flooded,\" she told AFP. \"My house is completely under water. In short, we are desperate and without hope.\"In Rubavu, another district badly affected, survivors said the floodwaters brought their homes crashing down.\"I kept calling, asking and wondering where my children were,\" Nshimiyimana Egide told AFP.He and his wife were able to find shelter in trees but \"unfortunately all our kids were already dead\", he added.",
        "Others were counting their blessings while coming to grips with the scale of destruction.Jacqueline Mukamana rushed out of her home at midnight when neighbours warned her the river was flooding only for her home to be swept away.",
        "\"Our house, and everything (else), has been destroyed,\" she said.Another resident, Paul Bizimana, said he was grateful he managed to get his family out: \"I managed to rescue my kids and family members... at least they are safe.\"- Over 5,100 homes destroyed -The government was racing trucks of emergency supplies to the worst-hit areas where evacuees are sheltering in tents.They have been advised to remain there until the rain stops, amid fear of further mudslides and flooding with rivers still raging and land unstable.\"The death toll is now 130 people. We do not know the total number of homeless people at the moment, but counting is ongoing,\" deputy government spokesperson Alain Mukuralinda told AFP.\"What we know is over 5,100 homes were destroyed and they all had families living in them.\"Another 2,500 homes have been partially damaged, according to a government tally.Mukuralinda said 77 people were hurt in the disaster, including 36 still in hospital with serious injuries.Prime Minister Edouard Ngirente toured the worst-affected regions Thursday and joined mourning families as they prepared to bury relatives.",
        "Ngirente urged survivors to \"be strong\", adding that the government would \"help them to settle properly again... we will help the wounded and hopefully life will continue\".The government will extend compensation of 100,000 Rwandan francs ($110) to each family for every member killed in the disaster.The African Union, UN agencies and countries such as France were among those sending condolences to Rwanda.The Vatican said Thursday that Pope Francis \"was deeply saddened to learn of the loss of life and destruction\" caused by the floods.\"His Holiness also offers the assurance of prayers for the dead, injured, and displaced\", the Vatican's secretary of state, Cardinal Pietro Parolin, wrote in a telegram.East Africa often suffers from wild weather during the rainy seasons, and Uganda has also suffered in recent days with six people reported dead in a landslide.Last month, at least 14 people died after heavy rains triggered floods and landslides in southern Ethiopia, while hundreds of livestock perished and scores of houses were damaged.In May 2020, at least 65 people died in Rwanda as heavy rains pounded the region while more than 200 people died in floods and landslides in the first four months of 2018.Experts say extreme weather events are happening with increased frequency and intensity due to climate change -- and Africa, which contributes the least to global warming, is bearing the brunt."
    ]
}