{
    "articleURL": "/sport/nhl/article-12045107/NHL-ROUNDUP-Vegas-overcomes-Leon-Draisaitls-four-goals-Hurricanes-flying-series-start.html",
    "content": [
        "Ivan Barbashev scored two goals, including one that put Vegas ahead for goodThe Hurricanes' suffocating defensive performance in the first got them aheadDailyMail.com provides all the latest international sports newsIvan Barbashev scored two goals, including one that put Vegas ahead for good, and the Golden Knights overcame Leon Draisaitl's four goals to beat the Edmonton Oilers 6-4 in Game 1 of the second-round series on Wednesday night.",
        "It was the second night in a row a team had won despite allowing an opposing player to score four goals. Seattle beat Dallas 5-4 on Tuesday even with Joe Pavelski scoring four goals for the Stars. Teams with a player scoring four goals had been 36-3 before that game in the playoffs, and it had been 30 years since a team had overcome such a performance.In addition to Barbashev, the Knights also received goals from Chandler Stephenson, Michael Amadio, Mark Stone and Jack Eichel. Eichel's goal was an empty netter from deep in his zone, and he and Stone also each had an assist. Zach Whitecloud had two assists.Evan Bouchard, Mattias Ekholm, Zach Lyman and Connor McDavid each had two assists for the Oilers.Game 2 is Saturday in Las Vegas.",
        "Draisaitl extended his goal streak to four games, and he has at least a point in all seven playoff games. He had never scored four goals in a playoff game, and had reached that mark just once in the regular season - March 2, 2020, against Nashville.Two of his goals game on the power play, making Edmonton 11 of 19 this postseason with the man advantage. The Oilers set an NHL record during the regular season by converting 32.4% of their chances.",
        "This series was billed as the Oilers' star power against the Knights' balanced attack, and that's how the opening game played out. Vegas found a way even with one of the NHL's most dynamic scorers having a career night.After Draisaitl scored on a power play less than two minutes into the third period to make the score 3-3, the Knights took the lead for good with two goals in 50 seconds. Barbashev scored on a rebound and Stephenson from the right circle.HURRICANES 5, DEVILS 1 The Carolina Hurricanes raced off to a fast start in their series against the New Jersey Devils with a 5-2 rout Wednesday night. The Canes spent the first period swarming the puck and closing just about any fleeting bit of open ice the New Jersey Devils could find.It was a dominating start to their second-round playoff series - and the blueprint the Hurricanes know they must follow going forward.The Hurricanes got goals from Brett Pesce and Seth Jarvis alongside a suffocating defensive performance in the first, allowing Carolina to jump quickly on New Jersey en route to a 5-1 win Wednesday night to start this best-of-seven series.Jesperi Kotkaniemi, Brady Skeji and Jesper Fast also scored for the Hurricanes, who took the Devils completely out of any type of first-period flow while surrendering a single shot on goal. Meanwhile, Pesce scored on a low-flying shot through traffic to beat Akira Schmid and Jarvis blew past Ryan Graves near the blue line to beat Schmid over his glove for a 2-0 lead.",
        "By the time Kotkaniemi followed early in the second, Schmid was headed for the bench.'That´s a super-skilled team that is fast and comes in waves,' said Carolina forward Jordan Martinook, who found Kotkaniemi for his point-blank putaway. ' If you can stay on top of them and kind of limit their space, that's what we're going to have to do.'Yeah, it's hard. It's a lot of work, but we're willing to put it in.'Game 2 is Friday night in Raleigh.Nathan Bastian scored for the Devils, who played this one without trade-acquisition Timo Meier following his huge hit from New York Rangers forward Jacob Trouba during Monday´s Game 7 win. Bastian´s goal came when he got loose coming into the zone to beat Frederik Andersen at 5:02 of the second period, but the Devils got not closer.'They backed us into a corner right away,' Devils coach Lindy Ruff said.The Hurricanes pushed into the second round after beating the New York Islanders, with the Game 6 clincher coming Friday night. That gave a team with an injury-hit group of forwards a few extra days to regroup, and Carolina jumped right back in to establish its style and play confidently from in front with the backing of a loud home-ice crowd.",
        "'We played fast, physical,' Skjei said. 'We got some pucks to the net. It was just the way we wanted to start, that first period.'",
        "The Devils are in the playoffs for the first time since 2018 and won a series for the first time in 11 years. But they had less than 48 hours following the Game 7 clincher against the Rangers to get ready for Wednesday´s puck drop. Ruff had said Tuesday he liked jumping right into a series to keep rolling.Instead, the Devils' lone shot in the first period was a wrister from Bastian that looked more like an entry pass from the blue line before dribbling its way to Andersen at 12:15.New Jersey eventually began to establish its style in the second, but by then, the Devils were fighting uphill.'We didn't get to our game,' forward Jesper Bratt said. 'We were a little sloppy on the puck. We were a little slow getting to pucks and supporting each other. When you're not supporting each other against a team like this ... you're not going to create that much.'"
    ]
}