{
    "articleURL": "/wires/ap/article-12048137/Simon--Schuster-sale-executives-confirm.html",
    "content": [
        "NEW YORK (AP) - Simon &amp; Schuster is again up for sale. Months after a federal judge halted Penguin Random House's plan to purchase its longtime rival, Simon &amp; Schuster's CEO and parent company, Paramount Global, have confirmed that the publisher is back on the market, with a sale possible by the end of the year.",
        "\"I can now report that, as expected, Paramount has resumed the process of selling Simon &amp; Schuster,\" Simon &amp; Schuster CEO Jonathan Karp wrote in a staff memo shared Thursday with The Associated Press. Karp noted in the letter that Simon &amp; Schuster is enjoying a strong 2023 so far, with double-digit domestic revenue growth over the first three months compared with the same time period last year.\"It should come as no surprise that there are many interested parties, a reflection of the fact that we are an even more successful and more profitable company than when the sale process first began,\" Karp wrote.Paramount has said that Simon &amp; Schuster does not fit \"strategically\" because it's not video-based. During an earnings report call Thursday morning, Paramount CFO Naveen Chopra noted that the company was committed to \"divesting non-core assets.\"\"We have restarted the sale process for Simon &amp; Schuster and we see a path to potentially closing a transaction this year,\" she said. \"The combination of initial interest and strong operating performance of the business over the last several years, gives us confidence in our ability to maximize the value of this asset for our shareholders.\"Simon &amp; Schuster, founded nearly a century ago, publishes such best-selling authors as Colleen Hoover, Stephen King and Bob Woodward. It has a long history of releasing political books, from Hillary Clinton's memoir \"Living History\" to Woodward's Donald Trump book \"Fear,\" and also works with such acclaimed fiction writers as King, Jennifer Egan and Don DeLillo.",
        "Penguin Random House, already the country's largest trade publisher, had offered $2.2 billion in 2020 for Simon &amp; Schuster, a deal that would have created a dominant force in the book market. But the U.S. Justice Department sued, alleging the sale would reduce the number of books published and damage competition, and U.S. District Judge Florence Y. Pan ruled in the government's favor after a trial last summer. The DOJ's case was part of a larger effort by the Biden administration to push back against proposed mergers.Hachette Book Group and HarperCollins Publishing, each of which have expressed interest in buying Simon &amp; Schuster, did not immediately respond to requests for comment Thursday. Paramount is otherwise expected to favor a private equity firm, which would not face similar government objections over anti-trust law."
    ]
}