{
    "articleURL": "/news/article-12053189/Eight-Trumps-16-alternate-Georgia-electors-granted-immunity-Fulton-DA-Fani-Willis-office.html",
    "content": [
        "There 16 people in Georgia being eyed for investigation over their roles in alleged attempts to overturn the results of the 2020 presidential electionAt least eight of those people have no struck immunity deals with prosecutors, leaving them open to testify against former President Donald TrumpThe Fulton County DA's office has yet to decide if charges will be filed in the case  Prosecutors for Georgia's Fulton County have granted immunity to at least eight people under investigation for conspiring to overturn Georgia's vote in the 2020 presidential election, according to a court filing on Friday.",
        "Fulton County District Attorney Fani Willis is expected to disclose this summer whether former President Donald Trump and others will be charged with crimes related to interfering with the 2020 election.Attorney Kimberly Bourroughs Debrow represented 10 of the 16 suspected fake electors who may have offered to cast electoral college votes for Trump even though Democrat Joe Biden won Georgia and the right to all of the state's 16 electoral college votes.Debrow said in a court filing on Friday that prosecutors 'made actual, written offers of immunity to these eight electors in April 2023 but not to the remaining two.' That led to the non-immunized clients getting new lawyers, Debrow said in the filing. With immunity, those eight would be free to testify against any defendants. ",
        "Willis' probe began soon after a recorded January 2021 phone call in which Trump asked Georgia's top election official to 'find' the votes to reverse Biden's victory.Last July, the DA's office revealed that each of the 16 people who signed the false elector certificate was a target of her investigation.The 16 fake electors met at the state Capitol on Dec. 14, 2020, and signed a certificate declaring falsely that Trump had won the presidential election and declaring themselves the state's 'duly elected and qualified' electors. ",
        "Willis' office has yet to decide whether or not to file charges against the fake electors. In letters sent to law enforcement agencies late last month, she advised them to prepare adequate security as she intends to announce her charging decisions between mid-July and early September. Debrow's filing Friday came in response to a motion filed last month by Willis seeking to bar the defense attorney from further participation in the proceedings stemming from the investigation. Debrow called Willis' motion 'reckless, frivolous, offensive, and completely without merit.' At the time when Willis informed the 16 fake electors last summer that they could face charges in the investigation, 11 of them were represented by Debrow and another attorney, Holly Pierson, who were hired by the state Republican Party. ",
        "Fulton County Superior Judge Robert McBurney, who oversaw the special grand jury that had been seated to aid the investigation, ruled in November that Georgia Republican Party Chairman David Shafer could not share an attorney with the other 10 fake electors represented by Debrow and Pierson. In the new filing, it says that when the district attorney's office offered immunity deals to eight of her 10 clients, she consulted with her other two clients and they determined that the 'most conservative and practical course' was for those two people to hire their own lawyers. She said they have since done that.",
        "In her motion last month, Willis said that in interviews with her team in April some of Debrow's clients said another of the fake electors she represents 'committed acts that are violations of Georgia law.' The motion also says some of Debrow's clients said they were never told about possible immunity deals last summer despite Pierson having told the court that they had spoken to their clients and none were interested.Debrow's representation of 10 of the fake electors represents a clear conflict and had become an 'impracticable and ethical mess,' Willis wrote. Willis 'has falsely but publicly maligned the integrity of two well-respected and fellow members of the Bar based on fictional claims known to be untrue when made,' Debrow wrote. 'Such reckless and unprofessional conduct is simply untenable and unacceptable.'The only actual immunity offers made by Willis' team came on April 4, and any prior discussions were 'highly generalized, non-individualized 'offers to offer' potential immunity to undisclosed recipients,' Debrow wrote. Each of the 11 people she and Pierson represented last summer was provided with information in August on the existence and possible implications of potential immunity offers. All 11 of them declined the offer of potential immunity as presented at the time, Debrow wrote.Additionally, Debrow wrote, 'none of the interviewed electors said anything in any of their interviews that was incriminating to themselves or anyone else, and certainly not to any other elector represented by defense counsel.'",
        "During the interviews with her clients last month, prosecutors never said they believed that any of Debrow’s clients was incriminating another and never said they objected to her representation of all of her clients, Debrow wrote.There was no basis to disqualify her from the case before and that is even more true now that all of her clients have immunity, Debrow wrote.Meanwhile, Trump’s Georgia legal team in March filed a motion seeking to toss the special grand jury report and any evidence related to the panel’s investigation and to bar Willis from any further involvement in the case. Cathy Latham, who signed the bogus elector certificate, joined that motion on April 29. Latham had been one of the 10 represented by Debrow, but last week’s motion was filed by a different lawyer.McBurney has given Willis until May 15 to file a combined response to Trump and Latham’s motions.Trump, who is seeking the 2024 Republican presidential nomination, has denied wrongdoing and accused Willis, an elected Democrat, of targeting him for political gain.The former Apprentice host became the first former U.S. president to face criminal charges when New York prosecutors indicted him on March 30 for allegedly falsifying business records related to hush money payments made to a porn star who claimed to have had an affair with him.",
        "He faces other investigations, including a pair of U.S. Justice Department probes into his handling of classified materials after leaving the White House and his efforts to alter 2020 election results."
    ]
}