{
    "articleURL": "/wires/aap/article-12039761/NZ-jobless-rate-stays-low-wages-growth-record-highs.html",
    "content": [
        "New Zealand's jobless rate remains near historic lows at 3.4 per cent, with more women than ever in the workforce.",
        "Stats NZ on Wednesday revealed the seasonally adjusted unemployment rate for the March 2023 quarter was 3.4 per cent, steady from the previous quarter.\"Unemployment and under-utilisation rates, as measured by the Household Labour Force Survey, have been sitting at or near record lows for more than a year,\" Stats NZ spokeswoman Becky Collett said.An extra 22,000 people found work in the quarter, with under-utilisation dropping from 9.3 per cent to 9.0 per cent.On the same day, Stats NZ also produced new data showing wage growth at record highs.The labour cost index (LCI) was measured at 4.3 per cent in the year to March, the highest level since measurements began in 1992.\"This aligns with other wage measures, like the unadjusted LCI and average hourly earnings, both of which also had the largest annual increases on record,\" Stats NZ spokesman Bryan Downes said.The measure is up from 4.1 per cent in December.Average total weekly earnings were up 7.1 per cent in the year to March, with average ordinary time hourly earnings now at $NZ38.93 ($A36.28).Finance Minister Grant Robertson seized on that figure to say wages were growing faster than headline inflation, at 6.7 per cent.\"We know that many Kiwi families are doing it tough in the face of cost of living pressures, but they do so while in paid work and with wages growing faster than inflation, easing some of the pressure that they are under,\" he said.",
        "NZ's unemployment figure remains broadly similar to Australia's, last measured at 3.5 per cent.The figures also revealed the highest levels of labour force participation for women on record.The seasonally adjusted labour force participation for women is 67.7 per cent, the highest level since the series began in 1986.\"Women's rates have been steadily increasing over the last 30 years, narrowing the gap in engagement between men and women in New Zealand's workforce,\" Ms Collett said.Men's participation is at 76.4 per cent."
    ]
}