{
    "articleURL": "/sport/nba/article-12049329/Bradley-Beals-lawyer-withdraws-50K-battery-lawsuit-Wizards-guard-sued-AGAIN.html",
    "content": [
        "Beal allegedly struck the cap off a fan in the tunnel after a game in OrlandoSince then, he's accused of defaming the fan who sued him for $50,000 DailyMail.com provides all the latest international sports news Bradly Beal has been sued for defamation by the Orlando Magic fan who previously filed a $50,000 battery lawsuit against the Washington Wizards guard in April - and now the NBA star will be looking for new representation to argue his defense.",
        "Kyler Briffa sued Beal last month for battery, claiming the Wizards guard struck him during an altercation following a March game in Orlando.Since then, Beal has responded publicly to the lawsuit, suggesting to reporters that Briffa made comments about his 'family,' 'character,' and 'integrity.'Furthermore, Beal's attorney Dan Morgan slammed the lawsuit, calling it 'frivolous,' and suggesting to TMZ that Briffa directed 'racial slurs' at his client.Now, according to plaintiff's attorney, Edward Guerrette, Morgan has withdrawn himself from the civil battery case as Briffa has filed a defamation lawsuit against Beal and the Wizards.",
        "Morgan did not immediately respond to DailyMail.com's request for comment.According to Guerrette, video of the incident proves that Briffa did not speak to Beal prior to being struck by the Wizards star.Briffa has maintained that Beal targeted the wrong fan, and it was actually another man who made the comment that prompted the physical altercation.According to both lawsuits, Briffa and a friend were granted access inside a team tunnel in Orlando as the Wizards were heading to the locker room following a loss to the Magic.Briffa claims his friend made a comment to Beal about a bet he lost as a result of the came.'You f***ed me [out of] $1,300 you f**k,' the friend reportedly yelled.",
        "Per the suit, Beal then turned, walked back to the group, and struck the side of Briffa's head - sending his hat flying back '5-6 feet behind him'.After the altercation started, a Wizards staff member broke up the tiff and escorted Beal away.Briffa says that Beal 'was attempting to provoke a physical altercation' and that he suffered emotional distress as well as pain and suffering.Named parties in the suit are Beal, who is being accused of assault, as well as the Wizards organization - which is being accused of negligence. No criminal charges have been filed, although police have investigated the matter. Beal acknowledged the incident in a season-ending press conference.'I go to casinos, I gamble, I understand that,' Beal said, 'But, I also understand it's probably a 99 percent chance I'm going to lose.'I'm not sitting here about to get angry at the dealer or angry at everybody else... Nobody wants to lose money. I get it. If you keep it about sports, I'm all for it.'But, I think it's when people start getting personal, talking about your family, talking about your character, your integrity towards the game. I think all of that, we can save it. We can really keep those comments to ourselves.'",
        "Morgan then released a statement that criticized the lawsuit, calling it 'frivolous litigation'.",
        "'No charges have been filed and he is now trying to change the narrative,' Morgan said. 'We will make sure the standard is clear -- you can't harass people, call them racial slurs, talk about their family, insult their character… and then turn around a sue them on top of that.''This is America,' he added, 'we believe in Justice here.'According to Guerrette's statement, both Beal and Morgan were given a chance to retract their statements, but declined.'As a result, statutory notice of our client's defamation claim was provided to Mr. Beal and his attorney last week, giving both an opportunity to retract their false statements and to apologize to Mr. Briffa,' read Guerrette's statement. 'No retraction or apology was made, even though those false statements were damaging to Mr. Briffa's reputation. Beal's attorney, Dan Morgan of Morgan &amp; Morgan has since advised that he is no longer representing Mr. Beal.'"
    ]
}