{
    "articleURL": "/sport/nba/article-12057771/James-Harden-gifts-Michigan-State-shooting-survivor-signed-shoes-76ers-win.html",
    "content": [
        "James Harden was the star in a dramatic win for the Philadelphia 76ersAnd there was one person he wanted to see in the aftermath of the win DailyMail.com provides all the latest international sports newsJames Harden's bond with John Hao, a paralyzed Michigan State shooting survivor who developed a long-distance FaceTime bond with the Philadelphia 76ers star, was strengthened further on Sunday in an epic NBA playoff game.",
        "An overtime three-pointer from Harden propelled the 76ers to a one-point victory over the Celtics, levelling the Eastern Conference series at 2-2 on Sunday night. Harden scored 42 points overall on the night as his team won 116-115.The atmosphere in the Wells Fargo Center was bouncing and all the cheers were for Harden. But there was one person that the man of the moment wanted to see, and it was Hao.Harden looked out for his new friend as he was led onto the court in the aftermath and took of his shoes, signed them and handed them to Lao in emotional post-game scenes.Earlier, Harden took a moment away from his pre-game rituals to welcome Hao to the game.",
        "'You look good,' Harden told Hao.The 20-year-old Hao and his parents smiled as the Sixers star guard resumed his pregame routine Sunday ahead of Game 4. The family had been invited by Harden to attend a 76ers game once Hao was available to travel.Hao, an international student from China, recently left a Chicago rehabilitation facility where he´d been since a February shooting on the East Lansing campus that killed three students and injured five others.Hao wore Harden´s No. 1 Sixers jersey and attended the game with his parents. Hao's father also wore a Harden jersey and posed for pictures as the 76ers warmed up behind him before they played Boston.",
        "Harden learned after the shooting that Hao was a fan of his and donated sneakers, money and then called the student to offer encouragement.'I know it´s tough right now, just gotta be mentally strong,' Harden said in February in video of the call. 'Just think about the positive things and keep pushing. Keep fighting. I got you.'Harden also kept his promise that Hao could attend a game. The family watched the game from a club box at the Wells Fargo Center.",
        "'When I got injured, he read the news about that, he just came to give us all the support we need,' Hao told The Associated Press. 'I´m so appreciative of that.'Hao said his spirits were strong and he was now a 76ers fan because of Harden.'He taught me to keep strong,' Hao said.The shootings at Michigan State happened in February during evening classes at Berkey Hall and nearby at the MSU Union. Students across the vast campus were ordered to shelter in place for four hours - 'run, hide, fight' if necessary - while police hunted for Anthony McRae, 43, who eventually killed himself when confronted by police not far from his home in Lansing.Hao said he doesn´t know what´s next for him and still needs additional treatment. Hao said he was committed to graduating from Michigan State, though he may move back with his parents to China.",
        "'I hope to get back to my normal life and rehab as soon as possible,' he said."
    ]
}