{
    "articleURL": "/news/article-12061025/Boris-Johnson-warned-Charles-sell-Duchy-speech-slavery.html",
    "content": [
        "Boris Johnson warned Charles over slavery speech opening door for reparationsCharles, then prince, gave speech anyway which 'appalled' the former PMREAD MORE: Ex-No10 media chief claims Boris confronted Charles over RwandaCharles pressed ahead with a speech on slavery despite a warning from Boris Johnson that it risked opening the door to claims for massive financial reparations, it was claimed last night.",
        "Former No 10 communications director Guto Harri alleged Mr Johnson was 'appalled' when the then-Prince of Wales told him last year he was planning to argue for a 'deeper understanding of slavery's enduring impact'.The then-PM warned him that it could open up the Royal Family to claims for reparations. But the future King told Mr Johnson it was a 'conversation whose time had come'.He ignored the prime minister's warning and pressed ahead with the undiluted speech later that day.Details of the reported clash at last year's Commonwealth Heads of Government summit in Rwanda are revealed in a new six-part podcast called Unprecedented, for Global Player, in which Mr Harri documents the final months of Mr Johnson's premiership.",
        "Mr Harri says the discussion came during a 15-minute row between Charles and the then-PM at the summit. The two men had already clashed over Charles's criticism of the Government's plan to send Channel migrants to Rwanda.",
        "Writing in today's Mail, Mr Harri says: 'Seeking to move on, the Prime Minister sought to compare notes on the speeches they were both due to deliver at the summit.'Boris was planning an upbeat tribute to the success of so many Commonwealth countries in growing their economies and consolidating their democracies, heralding the potential benefits for them and the UK in a post-Brexit world.",
        "'The prince was about to argue for a \"deeper understanding of slavery's enduring impact\". It was, he said, \"a conversation whose time has come\".'The PM was appalled. And warned the prince in plain English, \"I wouldn't talk about slavery or you'll end up being forced to sell the Duchy of Cornwall to pay reparations to those whose ancestors built it\".'Relations never fully recovered and Prince Charles will be relieved that Boris had left No 10 before he ascended to the throne.' Charles, who was representing the Queen at the summit, continued with the speech to Commonwealth leaders shortly afterwards.He revealed he was on a personal journey of discovery, saying he wanted to 'deepen my own understanding of slavery's enduring impact'.The future King said he was aware that the roots of the Commonwealth 'run deep into the most painful period of our history'. He added: 'I cannot describe the depths of my personal sorrow at the suffering of so many.'Last month, Buckingham Palace announced it was cooperating with a landmark study into the British monarchy's involvement with the transatlantic slave trade. The Palace said the King took the issue 'profoundly seriously'.The research is expected to analyse previous monarchs' involvement with slave trading companies, including the Royal African Company and its deputy governor, Edward Colston, whose statue was thrown into Bristol harbour by anti-racism protesters.",
        "The King's support for the academic work, carried out by the University of Manchester with Historic Royal Palaces, was welcomed by researchers and campaigners.But it led to immediate calls for reparations. Arley Gill, chairman of the National Reparations Commission of Grenada, said: 'The Royal Family must make repair and atonement for the people and societies that would have suffered because of their involvement in the slave trade.'Reparations now cannot be a subject that can be swept under the royal rug.'Last month, The Guardian published research suggesting that direct ancestors of the King had owned slaves on tobacco plantations in Virginia in the 17th century.Buckingham Palace last night declined to comment."
    ]
}