{
    "articleURL": "/money/cars/article-12059673/Blow-electric-car-owners-nearly-40-CENT-free-charging-points-disappear.html",
    "content": [
        "The number of free charging points has dropped from 5,715 to 3,568READ MORE: Falling demand sees used Tesla, Jaguar and Audi EV prices crashBritain's electric car owners will have to pay more to recharge as thousands of free charging points have disappeared this year due to rising energy costs.",
        "The number of charging points that offer electricity for free has dropped from 5,715 to 3,568, a drop of almost 40 per cent in the past year, according to figures obtained by the Telegraph.This is in stark comparison to a year ago, when one in five chargers were free.According to data from Zap Map, at the end of April there were 42,566 electric vehicle charging points across the UK, across 24,909 charging locations.  This is an increase of 37 per cent compared to figures in April last year. ",
        "The swapping of free charging points to paid ones is a blow to the Government's target of reaching net-zero greenhouse gas emissions by 2050.It aims for all new cars and vans be fully zero emission at the tailpipe from 2035 while, between 2030 and 2035, new cars and vans can be sold if they have the capability to drive a significant distance with zero emissions. Free charging points were installed by supermarkets and car park operators as part of a strategy to encourage electric vehicle ownership but due to a spike in energy prices, it has become too expensive to run them.Tesco, which has been providing charging points to customers since 2019, stopped offering free electricity in November last year. Instead, motorists have to pay 28p per kW of charge. ",
        "In March this year, the Government announced a net-zero strategy to curb carbon emissions and strengthen energy security, as gas bills are set to soar.This comes following green levy tax on the polluting fuel, which is enforced by the government as an environmental charge added to energy bills.Prime Minister Rishi Sunak unveiled 'Powering Up Britain – The Net Zero Growth Plan', saying the plan is vital to 'drive down energy prices', 'grow our economy' and reduce emissions to net zero by 2050.The proposed government targets update means 22 per cent of all cars sold in 2024 must be battery-powered rather than petrol or diesel. ",
        "Currently, around 17 per cent of all new motors entering the car park are EVs.British car manufacturing saw output rises of 13.1 per cent in February this year to 69,707 units, according to Society of Motor Manufacturers and Traders (SMMT).While volumes for vehicles are always on the rise, hybrid, plug-in hybrid and battery electric vehicle output have surged in 2023, up 72.2 per cent - accounting for two in five cars produced in the month.And they have predicted that almost 500,000 new hybrid and electric cars will be seen on UK roads this year.",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}