{
    "articleURL": "/wires/afp/article-12048131/Kolkata-Chakravarthy-hold-nerve-defeat-Hyderabad.html",
    "content": [
        "Indian spinner Varun Chakravarthy defended eight runs in the last over of Sunrisers Hyderabad's chase to seal a five-run victory for Kolkata Knight Riders in the IPL on Thursday.",
        "Hyderabad, led by South African star Aiden Markram, who scored a 40-ball 41, controlled the chase of their 172-run target until his dismissal when the team still needed 27 runs off 19 balls.Fellow South African Heinrich Klaasen, who scored a 20-ball 36 with three sixes, stabilised the innings after they lost three quick wickets at the start.They were reeling at 53-3 in the sixth over after out-of-form India opener Mayank Agarwal (18), his partner Abhishek Sharma (9) and Rahul Tripathi (20) failed to convert their starts.England sensation Harry Brook failed to open his account, leaving Sunrisers at 54-4 before the two South Africans struck up a 70-run partnership.Markram's dismissal in the 17th over to Indian rookie pacer Vaibhav Arora changed the game as Hyderabad's lower-order only reached 166-8 in their 20 overs.Chakravarthy, who bowled some of the toughest overs of the innings and still finished with 1-20, won player-of-the-match for his four-over spell.West Indian all-rounder Andre Russell, Arora and India's Shardul Thakur took five wickets between them.Earlier, Nitish Rana-led Kolkata lost wickets at regular intervals.Both openers, Afghanistan's Rahmanullah Gurbaz (0) and England's Jason Roy (20) fell early.In-form Venkatesh Iyer fell for seven and the innings was stabilised by Rana (42) and IPL rising star Rinku Singh, who hit a 35-ball 46 before his dismissal by pacer T Natarajan.",
        "Hyderabad's two left-arm pacers -- Natarajan and South Africa's Marco Jansen -- and India swing veteran Bhuvneshwar Kumar took five wickets between them in tight spells for their team.Russell smashed two sixes in a 15-ball 24.\"I thought we played good cricket for a large portion of that game but unfortunately in the crunch times we got it wrong,\" said Markram.\"So it's a difficult one to swallow.\"Kolkata remain eighth in the 10-team table, one place above Sunrisers."
    ]
}