{
    "articleURL": "/news/article-12058047/ABC-facing-possible-lawsuit-Australian-Monarchist-League-King-Charles-Coronation-coverage.html",
    "content": [
        "The ABC has come under fire for its coronation coverageThe Australian Monarchist Group to file a formal complaintA monarchist group has threatened legal action against the ABC over its coverage of King Charles III's Coronation. ",
        "The public broadcaster aired a two-hour special on Saturday that focused heavily on the impact colonisation had on Indigenous Australians and people of colour.The Drum's Julia Baird and Jeremy Fernandez hosted the segment with Q&amp;A host Stan Grant, Australian Republic Movement co-chair Craig Foster among the panel.Liberal MP and monarchist Julian Leeser and Wiradjuri and Wailwan woman Teela Reid also made an appearance.The program was aired at 5pm, just three hours before the Coronation of King Charles III was broadcast in Australia.The coverage drew criticism from monarchist group the Australian Monarchist League, 3AW radio host Neil Mitchell and a number of Liberal MPs and ABC viewers.The AML released a statement revealing it was preparing to file a legal complaint to the public broadcaster's board.",
        "'Our legal advisers are preparing a formal complaint to the board of the ABC in regard to the production and airing of Saturday's extremely biased pre-Coronation programme specifically designed to attack the Constitution and the Crown,' AML national chair Philip Benwell wrote. 'Our Executive and others are meeting this week to formalise our approach.''So vitriolic are their attacks on the King, the monarchy, the British settlement and everything that came thereafter that they forget that they are the very people who want our vote for their Voice to the Parliament.'",
        "Mr Benwell said the group welcomed 'pertinent comments from members' about the broadcast that would help in compiling their formal complaint.'This should include specific comments made during the programme by interviewers and panelists,' he added.Melbourne's 3AW radio broadcaster Neil Mitchell slammed the public broadcaster.He said ABC management needed to 'be accountable' over the coverage which 'misread the mood'. 'I really wonder sometimes why we feed these ABC people, I don't blame the people on air, it's whomever in management decides, \"Ah, here's a good idea, let's use footage from London while we bag the living daylights out of the monarchy\",' he said.'Somebody in the ABC needs to be accountable for this, as the national broadcaster it should have been the place you go to see the coverage of the coronation, instead you see all this bitterness about our Indigenous history.'He added the panel featured four people with 'three of them republicans'. Liberal MP Julian Leeser, who was on the panel and the only monarchist present at the time, claimed the ABC 'got the balance wrong'.'To have only one of four panellists as supporters of our existing constitutional arrangements meant there was little opportunity for a panel discussion that reflected the warmth and respect Australians have for King Charles,' he said. ",
        "The outrage was also reflected on social media, with a number of viewers lambasting the ABC over the two-hour special.'Ok I'm about to change channels away from ABC. Who can tell me the best coverage of the actual coronation?' one viewer tweeted.'I had to turn off the boring ABC coverage of the coronation,' another said, comparing it to a 'history lecture'.'I'm finding it quite inappropriate that we are talking negatively about the monarchy when it's coronation day,' a third said.'Have a slight bit of respect ABC.''Tried to watch it on #ABCNews but they have on commentators that are just talking non-stop about the evils of the monarchy &amp; the wrongs they've done to Australia,' said another.'Can coverage get back to the Coronation please? We don't want your Voice/Republic propaganda,' said another.'This was one of the worst coverage ABC has done in a long time. This is about a coronation, not race. Unbelievable.''Totally disrespectful by the ABC.'There were also many Aussies who were pleased to see the panel discuss different ideas.'ABC coverage of the Coronation has gotten off to an excellent start by putting First Nations perspectives on colonisation and empire front and centre,' one viewer said.'Watching pre-coronation coverage on ABC, with First Nations people saying it like it is: this coronation is political,' another wrote.",
        "'The real Australia is about invasion, theft, extermination.'",
        "An ABC spokesperson defended the public broadcaster's coverage of the event when questioned about the criticism by Daily Mail Australia.'The ABC brought full coverage of the Coronation of King Charles III to Australians across its television and digital radio platforms and to audiences across the Asia Pacific via ABC Australia and Radio Australia,' they said.'Preceding the ceremonial events, as part of the comprehensive coverage ABC News canvassed an array of perspectives and views on the role of the monarch in 21st century Australia.'The spokesperson listed the guests on the panel before explaining the role of the ABC to broadcast a 'diverse' range of perspectives. 'The role of the national broadcaster is to facilitate conversations that reflect the diversity of views in the community.''Hearing from Indigenous Australians and reflecting on Australia's history is an important part of this, especially as this year Australians will vote in a referendum on whether a First Nations Voice to Parliament should be included in the nation's Constitution.'A number of programs dedicated to King Charles that aired on the ABC were also referred to in the public broadcaster's response. "
    ]
}