{
    "articleURL": "/tvshowbiz/article-12043177/Coronation-Street-SPOILER-Amy-takes-action-against-rapist-Aaron-shes-accused-harassment.html",
    "content": [
        "Amy Barlow is set to take drastic action against her rapist Aaron Sandford in next week's Coronation Street - leading to big consequences for the teen. ",
        "The character was raped by Aaron when he had sex with her when she was too drunk to consent, but while he believes he didn't do anything wrong and continues to get on with his life, things have taken a huge toll on Amy.In the wake of her rape, Amy (Elle Mulvaney) has been struggling emotionally and mentally since , with her turmoil even seeing her turn to drink and end up in hospital as a consequence. She even went on to withdraw her allegation as she thought it would make things easier, but in upcoming scenes, she continues to struggle as Aaron (James Craven) acts like nothing at all happened Next week will see Amy spot Mia, whom Aaron recently rekindled his romance with, in the garage and tell her that Aaron raped her.",
        "Though Mia is shocked by Amy's allegations, she stands by her boyfriend and accuses Amy of making the whole thing up.While Amy assures Aaron's boss Abi that she’s telling the truth.Later, Mia confronts Aaron over Amy’s rape allegation but Aaron swiftly explains that they slept together once, Amy cried rape but then changed her mind and the police dropped the case. And Mia buys his every word, appalled that Amy is dragging Aaron’s name through the mud. ",
        "Later, Amy gets quite the shock when DS Swain calls at No.1 and tells Amy that a serious allegation of harassment has been made against her. Livid at the injustice of her situation, Amy sets about writing up her whole dreadful ordeal.When her dad Steve sees what she's written, he encourages her to post her document about Aaron on social media, with Amy then posting her words online.Over at the garage, Abi and Tyrone tell Aaron that they’ve read Amy’s online post and give him his marching orders, telling him he can find himself another job.",
        "Meanwhile his seething Eric vows to make Amy pay for what she did.Eric then visits No.1 and announces that he’s suing Amy for libel. When Amy later receives a letter from Eric’s solicitor ordering her to take down her post or they’ll sue, Steve advises her to stick to her guns.However, lawyer Dee Dee warns them that a libel case could end up costing them a fortune. But a determined Tracy’s is adamant that they’ll fight it all the way. ",
        "Later in the week, Steve and Tracy realise they’ll have to sell their businesses to fund the huge legal fees.Meanwhile Eric and Aaron meet up with their solicitor who warns them of the risks of taking the case to Court. ",
        "Undeterred by the massive financial implications, Tracy pushes ahead and arranges for a valuation on the florists. "
    ]
}