{
    "articleURL": "/debate/article-12061561/CRAIG-BROWN-Old-favourites-meltdown-Madame-Tussauds.html",
    "content": [
        "There's nothing like a visit to Madame Tussauds in London to make you feel your age, says Craig Brown There's nothing like a visit to Madame Tussauds in London to make you feel your age.",
        "I can date my first visit to 1966, when a noisy, smoky, new exhibit of the Battle of Trafalgar had just opened, and we were taken to see it on a school expedition.Fifty-odd years later, the Battle of Trafalgar has disappeared, and the waxworks of most of the stars of yesteryear — Morecambe and Wise, Harold Wilson, Bobby Moore, the Queen Mother, Vera Lynn, Mike Yarwood, Sandie Shaw, even The Beatles — have all gone, too.Politicians are out: the only Prime Minister I spotted on my recent visit was Sir Winston Churchill, standing outside No 10, alongside Mrs Pankhurst, who was on a chair, wagging a finger.More recent Prime Ministers — Thatcher, Blair, Cameron, Sunak — are nowhere to be seen. Have they perhaps been melted down, remoulded, squeezed into corsets, and transformed into Little Mix?",
        "Oddly enough, the only area where old familiar faces are still out in force is the Chamber of Horrors. I had imagined that the current puritanical climate might have ensured its closure.Far from it: The Acid Bath Murderer, John Haigh, is there, still going about his deadly business, and John Christie, Dr Crippen, the Kray Brothers and poor Ruth Ellis are all there, too.They have been joined, in recent years, by Dennis Nilsen, staring through the bars of a cell. A nondescript shirt and trousers are draped over a hanger, captioned, 'Original shirt and trousers that were worn by Dennis Nilsen serving time in prison for multiple murders'.",
        "In fact, he died five years ago, but the news has clearly not reached Madame Tussauds. Also on display is 'Dennis Nilsen's personal TV taken from his house in Cranley Gardens, London, where he committed multiple murders.'Looking at these bizarre exhibits, I was reminded of the time Nilsen's biographer, Brian Masters, visited him in prison and told him that someone had just surpassed his record as our most prolific serial killer. Nilsen's reply was: 'Well, that's showbiz.'Madame Tussauds takes this macabre joke seriously: mass murderers stand just a few yards away from Hollywood stars and the Royal Family, with little to distinguish between them. In the strange world of Madame Tussauds, murder offers the psychopath a charmed route to posterity.Pop singers, on the other hand, come and go: Liam and Noel Gallagher have been ousted, and Madonna, Michael Jackson, Elvis Presley and Frank Sinatra have also been sent to the knackers' yard. Their places have been taken by Little Mix, Ed Sheeran, Lady Gaga, Miley Cyrus and Ariana Grande.But how long will this new batch last until they, too, are thrust into the melting pot, to be boiled down and remoulded into other celebrities, newer and younger?In the Royal section, Prince Harry seems to be hanging on by his fingertips, standing all alone in a dinner jacket and bow-tie (pictured, below). I was surprised to find that Meghan isn't with him. Instead, I found her unaccompanied in the Awards Night section, just along from Kim Kardashian and the Beckhams.",
        "And what of the Duke of York? For more than half a century, man and boy, he was resident at Madame Tussauds, but these days he is nowhere to be seen. Yet hope is not lost. When the time is right, perhaps he will be allotted his own little corner in the Chamber of Horrors. Needs must.The key change at Madame Tussauds since my last visit is that where once the waxworks were separate and untouchable, they are now there purely to lend selfies a bit of interest.Every few seconds, visitors squeeze in next to Queen Elizabeth II and the Duke of Edinburgh, hold their phones up, and take selfies. They then move on to Dwayne 'The Rock' Johnson, just round the corner.The exhibits are now there for the greater glory of the customer. In the Awards Party section, you can even press a button and up will pop a message on the big screen saying, 'And the winner is . . . YOU!'A surprisingly high proportion of visitors come from India, which might explain why the waxworks in the Awards Party section include Priyanka Chopra Jonas, Deepika Padukone and Shah Rukh Khan.It's all about market forces. If you want to visit waxworks of basic British stars such as Simon Cowell or Alan 'Chatty Man' Carr, you will have to visit the Madame Tussauds in Blackpool."
    ]
}