{
    "articleURL": "/news/article-12045935/King-Charles-III-Jill-Bidens-12th-cousin-four-times-removed.html",
    "content": [
        "Mrs Biden and the King both descend from Philippe de Croÿ and wife Johannade Croÿ died in 1595 and served as a knight under Spain's King Philip II For all the latest Royal news, pictures and video click here Much has been made of the fact that US President Joe Biden will not be attending the King's Coronation.",
        "Instead, his wife Jill, 71, will lead the delegation from the States at the historic ceremony in Westminster Abbey on Saturday.Remarkably, new research has revealed how Mrs Biden and King Charles are distant cousins.New research has revealed how the monarch and Mrs Biden both descend from 16th century noble couple Philippe III de Croÿ and his wife Johanna. They are 13th cousins once removed.Philippe III, who died in 1595, served as a knight under Spain's King Philip II, the husband of Queen Mary who sent the Spanish Armada to invade England in 1588. The research by genealogy website MyHeritage has also shown that the King is a 12th cousin of Canadian PM Justin Trudeau, who will also be at the Coronation. ",
        "The King and Mrs Biden are both the 13th generation descending from De Croÿ. The 'once removed' element of their connection refers to the number of generations that separate them.A first cousin once removed would refer to a cousin who is of your parents' generation.  De Croÿ, who was also the Stadtholder - or steward - of Flanders in Belgium, had daughters Anne and Marguerite with his wife. Charles is directly descended from Anne, whilst Mrs Biden descends from Marguerite.The King's link continues through the German Princely House of Thurn and Taxis, descending down to Francis, Duke of Teck.",
        "Francis was the father of Mary of Teck, who went on to become Queen Mary as the wife of King George V. She was the King's great-grandmother. ",
        "Predictably, Mrs Biden's descendants are less prestigious than the King's. They include five generations of the van Gilder family, which hailed from the Netherlands and Belgium and settled in New Jersey. Mrs Biden's great-great-grandmother, Emily Godfrey, was the daughter of Thompson Van Gilder. Charles and Mr Trudeau are both descended from husband and wife Roger and Joan Boyle, who lived in the 16th century. The King descends from their son, Richard Boyle, the 1st Earl of Cork, whilst Mr Trudeau descends from their daughter Lady Mary Smyth.The 1st Earl of Cork served as Lord Treasurer of the Kingdom of Ireland, when the country was a client state of England. The 4th Earl of Cork, who was also called Richard, was the great-great-great grandfather of the King's great-grandmother, Cecila Bowes-Lyon.Her daughter was the Queen Mother, Charles's grandmother.  Mr Trudeau's heritage includes eight generations of the Bernard family. Thomas Patrick Bernard was his great-grandfather on his mother's side. Roi Mandell, the director of research at MyHeritage, said: 'The family tree of the Royal Family is more meticulously documented than any other in history, and its branches spread all over the world. ",
        "'The connections we found between the First Lady of the United States, Jill Biden, as well as the Prime Minister of Canada, Justin Trudeau with the King — which presumably was unknown to them — is a perfect illustration of the beauty of genealogical research: it allows us to take a broad look at family ties that cross borders and countries.",
        "'When we say that in the end, we are all connected to each other, this is exactly what we mean.'For this reason and in celebration of the Coronation, we have released 1.1 billion records for free to help people find their connections.' Roi Mandel, Director of Research, MyHeritageIt emerged last month that President Biden would not attend the King's Coronation and that the First Lady would instead go on his behalf.A White House statement said: 'The President congratulated the King on his upcoming Coronation and informed him that First Lady Jill Biden looks forward to attending on behalf of the United States. 'The President also conveyed his desire to meet with the King in the United Kingdom at a future date.' ",
        "Mr Trudeau will enjoy a video call with the King before he attends the Coronation on Saturday.   A statement released yesterday confirmed his attendance at Westminster Abbey. He will be joined by Governor General Mary Simon, the monarch's representative in Canada, and several other dignitaries, including Indigenous leaders and astronauts. ",
        "On Friday, Charles will be joined by working royals at a special lunch for realm prime ministers and governors general at Buckingham Palace.The King, who is head of the Commonwealth, will also attend a Commonwealth Heads of Government leaders meeting and garden reception at London's Marlborough House the same day.And on the eve of the coronation, the King and the royal family will host a glittering reception for foreign royalty and other overseas dignitaries at the Palace."
    ]
}