{
    "articleURL": "/wires/reuters/article-12059627/Delhi-city-asks-judge-quash-Pernods-liquor-licence-rejection-appeal.html",
    "content": [
        "By Arpan Chaturvedi and Aditya Kalra",
        "NEW DELHI, May 8 (Reuters) - Authorities in India's capital New Delhi have sought to quash Pernod Ricard's court challenge against a decision to reject its city liquor licence, saying the French firm did not meet the necessary requirements, a legal document showed.Pernod's popular brands such as Chivas Regal and Absolut vodka have not been available in Delhi for more than six months. Pernod has challenged in the Delhi High Court the city's April 13 decision to reject its sale licence citing certain ongoing investigations against the company.India's federal financial crime agency has accused the company of illegally making profits by giving false information to Delhi city authorities in 2021, and violating rules by financially supporting retailers in exchange for stocking more of its brands. Pernod has repeatedly denied wrongdoing.Pernod last month asked a judge to push Delhi city to grant it a licence, arguing no wrongdoing had been proved. But a new court filing on Thursday by the city's government, which is not public but has been seen by Reuters, showed the city has asked the judge to quash Pernod's case.The French company can appeal the rejection with senior Delhi officials, the city argued in the filing, citing ongoing investigations against the company and saying that Pernod \"has not fulfilled conditions for grant of licence\".",
        "Pernod did not respond to a request for comment. The case will next be heard on Wednesday.The spirits giant has previously told the court it has been \"suffering massive losses\" due to the situation.India contributes 10% of Pernod group sales. The Delhi business accounts for 5% of Pernod's sales in the country and the company is \"hopeful\" it can obtain the licence, CFO Helene de Tissot told Reuters last month.(Reporting by Aditya Kalra; Editing by Kirsten Donovan)"
    ]
}