{
    "articleURL": "/wires/reuters/article-12041797/Taco-Bell-parent-Yum-Brands-beats-quarterly-store-sales-estimates.html",
    "content": [
        "Q1 sales top estimates but EPS misses",
        "Labor crunch easing, staffing close to 2019 levels - CFOShares down over 4%(Adds comments from CFO interview in paragraphs 7 and 8; updates share move in paragraph 2)By Deborah Mary SophiaMay 3 (Reuters) - Yum Brands Inc missed Wall Street estimates for first-quarter profit on Wednesday, as the Taco Bell parent doubled down on promotions to attract inflation-wary consumers while also facing lingering commodities and labor cost pressures.Shares of the KFC and Pizza Hut owner tumbled more than 4% after the company also warned of a $10 million to $20 million hit to current-quarter operating profit.Yum Brands has banked on aggressive promotional offers - including Taco Bell's $2 burritos and KFC's $5 Mac &amp;amp; Cheese - as well as new menu items to attract more low-income customers, helping total same-store sales jump 8% in the March quarter, handily beating estimates of a 5.45% increase.However, along with higher food and labor costs, foreign exchange pressures and ramped up investments in automation and digital business, the aggressive promotions largely drove a 25% slump in profit.The earnings miss \"was a little bit surprising when you consider what everyone else has reported. You've seen very positive results (from restaurants) across the board,\" Edward Jones analyst Brian Yarbrough said.",
        "McDonald's Corp, Burger King parent Restaurant Brands and Chipotle Mexican Grill all topped quarterly sales and profit estimates on the back of price hikes and robust demand.Inflationary pressures were now abating and trending back to pre-pandemic patterns, Chief Financial Officer Chris Turner told Reuters, adding the company expects U.S. food inflation to be in the low-single-digit range for the full year.Labor challenges were also easing, with the company seeing job application rates increase while staffing levels were either at or near 2019 levels.Excluding special items, it earned $1.06 per share, missing estimates of $1.13, according to Refinitiv data. (Reporting by Deborah Sophia in Bengaluru; Editing by Shounak Dasgupta and Sriraj Kalluvila)"
    ]
}