{
    "articleURL": "/tvshowbiz/article-12055541/TV-superstar-looks-UNRECOGNISABLE-long-hair-moustache-guess-is.html",
    "content": [
        "This TV superstar has become a staple of Saturday night television both in the UK and the US after bursting onto the scene in 2001. ",
        "He is reported to be worth a whopping £380million thanks to his many business ventures and shrewd investments. Known for his quick whit and acid put downs and unlike the dodgy throwback snap, his sense of style and perfectly trimmed barnet.Having fronted dozen's of TV talent shows he also has managed some of the biggest music stars in the world.But can YOU guess who it is? ",
        "It's none other than Britain's Got Talent's Simon Cowell, 63, who looks world's away from his perfectly put together screen appearances. The music mogul is more often seen in an all black ensemble with a figure hugging top and his trousers famously pulled high.On the latest episode of Britain's Got Talent, Amanda Holden quizzed Simon about when he had longer hair in his younger years.She said: 'Bruno [Tonili] was saying today that you used to have shoulder-length hair,' before Simon desperately urged her not to Google it in embarrassment.It comes after Simon was left fuming during Saturday's episode of Britain's Got Talent when he was covered in pink gunge by 90s icon Mr Blobby.The notoriously badly behaved character appeared on the show to showcase his magic tricks.After performing a card trick, Blobby pulled the show's head judge Simon, 63, up onto the stage, placing him into 'Mr Blobby's Disappearing Box'.",
        "Simon was seen taking a seat before Mr Blobby closed the door, with the crowd cheering.However, things took a turn for the worse for the music mogul, as when Mr Blobby was seen closing the door, pink slime was seen sloshing out, much to the astonishment of Simon's fellow judges Amanda Holden, 52, Alesha Dixon, 44, and Bruno Tonioli, 67.The door was then opened once again, showing a very miffed Simon being covered in the slime.",
        "Simon warned: 'Don't touch me! Get away from me!'Keen to get the other stars of the show involved in the action, Simon was seen hugging show hosts Ant McPartlin and Declan Donnelly in a bid to cover them in slime too.Nineties TV icon Mr Blobby threw this weekend's episode of Britain's Got Talent auditions into chaos.The manic pink character attempted to impress with his own unique brand of magic before falling flat on his face in front of the judges.Blobby - who found fame in BBC1's Noel Edmond's House Party - was welcomed by a round of applause from the audience.",
        "However judge Alesha grumbled 'oh no' as soon as she clapped eyes on the pink and yellow spotted star.As he made his way from the stage to the panel he took a tumble, with Bruno declaring: 'Mr Blobby is going to hospital.'",
        "He then offered Amanda a card as he attempted to showcase his magic tricks, only to fail dismally. While the audience were left in stitches head judge Simon glared as he appeared to be less than impressed.Created by Charlie Adams, a writer on Noel's House Party, Mr Blobby is a bulbous pink figure who communicates only by saying the word 'blobby'.He topped the UK Charts in 1993 with his Christmas hit Mr Blobby and more recently has appeared on Dancing on Ice, Loose Women and This Morning.Britain's Got Talent continues on ITV1 and ITVX next Sunday at 7.40pm. "
    ]
}