{
    "articleURL": "/wires/reuters/article-12050291/ECB-policymakers-promise-hikes-beat-inflation.html",
    "content": [
        "Villeroy and Simkus speak after rate hike",
        "Markets doubt ECB's resolveECB surveys point to slowing prices, long journey aheadFRANKFURT, May 5 (Reuters) - The European Central Bank will continue raising interest rates until inflation is under control, two ECB policymakers said on Friday as surveys showed the fight against rising prices was far from over.French central bank governor Francois Villeroy De Galhau and his Lithuanian peer Gediminas Simkus reaffirmed the ECB's intention to further increase borrowing costs, multiple times if needed, which financial markets are still doubting.\"The essence of the effort has been done, although there will probably be a few more rate hikes,\" Villeroy told French broadcaster Radio Classique.The central bank for the 20 countries that use the euro hiked its key deposit rate on Thursday for the seventh consecutive time but the 25 basis point rise was smaller than previous increases.Money market prices showed investors were putting a high likelihood on another 25 bp increase in the deposit rate next month, which would take it to 3.50%, but were less convinced the ECB would hike again after that.Villeroy explained Thursday's smaller rate increase by saying higher rates were beginning to have an effect on inflation. The ECB has raised the deposit rate by an unprecedented 375 basis points since last July.",
        "\"We see that the impact of the rate hikes has percolated through the economy,\" he said.Data on Friday showed retail sales in the euro zone fell more than expected in March, evidence of demand cooling.And two ECB surveys also published on Friday showed economists had cut their inflation forecasts for this year and the next - to 5.6% and 2.6% respectively - and that companies were moderating the pace of price hikes.But the surveys, which were presented to policymakers at this week's meeting, also showed inflation was seen holding slightly above the ECB's 2% target in 2025 and that companies were concerned about surging wages.That is likely to have cemented the ECB's determination to keep tightening monetary policy in the coming months, albeit by smaller increments.\"The duration (of the rate hikes) now is more important than the speed,\" Villeroy said. \"We will be persistent until inflation is under control.\"The ECB aims to bring inflation back to 2% by 2025, \"maybe even by the end of 2024\", he added.Simkus echoed that view, telling reporters in Vilnius that rates were \"not high enough\" and would \"need to be increased further\".\"We will keep rates high for a sufficiently long time to get inflation back to 2%,\" the Lithuanian central bank chief said. (Reporting by Benoit Van Overstraeten, GV De Clercq, Balazs Koranyi and Andrius Sytas; Writing by Francesco Canepa in Frankfurt; Editing by Catherine Evans)"
    ]
}