{
    "articleURL": "/wires/reuters/article-12049709/Adidas-optimistic-quarter-sales-beat-expectations.html",
    "content": [
        "Shares jump 8% as sales, profit beat expectations",
        "Adidas sticks to 2023 guidanceSees Chinese market improving(Adds analyst quote in paragraphs 4-5)By Helen ReidLONDON, May 5 (Reuters) - Adidas reported better-than-expected quarterly results and said the Chinese market was improving, sending its shares up 8%, although its chief executive warned the group still faces a \"bumpy year with disappointing numbers\".The German sportswear giant is forecasting a loss this year after ending its Yeezy partnership with rapper Kanye West, who changed his name to Ye in 2021.Losing the highly profitable Yeezy line hit sales in the quarter by around 400 million euros ($440 million), Adidas said, mainly denting revenue across North America, Greater China and EMEA. But after six months of relentlessly gloomy news, investors were cheered by some early signs of recovery.\"Adidas is managing investors' expectations,\" said Mamta Valechha, equity research analyst at Quilter Cheviot, which holds shares in Adidas.\"They are going in the right direction - China is recovering, inventories are still too high but at least sequentially down,\" she added. Clearing out the inventory will be key for Adidas this year.Adidas gave no update on what it plans to do with its stock of unsold Yeezy shoes, but CEO Bjorn Gulden told reporters Adidas has narrowed down the options for the shoes, and it is getting closer to a decision.",
        "Quarterly operating profit of 60 million euros beat analyst expectations of 15 million euros. And although sales fell by 1%, this was also better than a forecast 4% drop, prompting an 8% rise in Adidas shares to their highest level since August.Adidas stuck to its 2023 guidance, having warned of a 700 million euro operating loss if it decides to completely write off the Yeezy stock.North America was the worst hit by the loss of Yeezy, with currency-neutral sales down 20% from last year.BRIGHTER SIGNS IN CHINASales in Greater China, a difficult region for Adidas, fell by 9% but Gulden said there were signs of improving performance in that market.The sell-through rate - or the share of product held in inventory that went on to be sold - jumped by 12% in the first quarter in Adidas' own stores and wholesalers in China, meaning retailers are likely to order more in future.\"For the first time... (in) the last two and a half years, we are actually optimistic that the numbers will turn from red to green,\" said Gulden, who joined Adidas from sportswear rival Puma at the start of the year.Latin America was a bright spot, with sales up 49%. The \"terrace\" shoe style is doing well in all markets, and Adidas has started to make more Samba, Gazelle, and Campus shoes, Gulden said.",
        "Overall, sales were 5.274 billion euros, down from 5.302 billion euros in the first quarter of 2022.Adidas' gross margin fell to 44.8% due to the loss of Yeezy sales, higher supply chain costs and discounts.Inventories rose by 25% to 5.675 billion euros and Gulden said Adidas is working hard to \"normalise\" levels, which would allow it to discount less and boost the brand. ($1 = 0.9084 euro) (Reporting by Helen Reid; Editing by Himani Sarkar, Sherry Jacob-Phillips Alexander Smith and Keith Weir)"
    ]
}