{
    "articleURL": "/wires/reuters/article-12046149/TD-First-Horizon-call-13-4-bln-deal.html",
    "content": [
        "By Nivedita Balu and Niket Nishant",
        "May 4 (Reuters) - Canada's Toronto-Dominion Bank Group on Thursday called off its $13.4 billion takeover of First Horizon Corp, triggering a near 40% fall in the U.S. regional bank's shares.First Horizon and TD said in a statement they had mutually decided to end the deal because there was no clarity on when they would get regulatory approvals. TD will pay $200 million to First Horizon, in addition to a $25 million fee reimbursement.TD's biggest deal to date, which it launched more than a year ago, had faced months of regulatory uncertainty and Canada's No. 2 lender came under pressure from some investors to scrap the purchase after the U.S. regional banking crisis.A spokesperson for First Horizon said the termination was solely related to TD, which was unable to get approvals, and had nothing to do with ongoing banking turmoil.First Horizon CEO Brian Jordan told investors that TD informed the U.S. bank that they \"could not provide an updated timeline for an extension and they could not produce assurance of regulatory approval in 2023 of 2024.\"TD declined to comment beyond the press release.\"We are surprised that the parties could not come to an agreed upon lower price and believe that there could be broader repercussions from walking away,\" Barclays analyst John Aiken said.",
        "\"This could affect the willingness of potential partners to sit across the table from TD in the future,\" Aiken added.TD agreed to buy First Horizon in February last year in a deal it said at the time would have made it the sixth-largest U.S. bank, raising its position from No. 8, with about $614 billion in assets and operating in 22 states.The Canadian bank also has a stake in Charles Schwab, making it one of the most exposed to U.S. markets, and its First Horizon u-turn leaves its U.S. strategy in limbo.\"We believe TD shareholders will be concerned about the bank's ability to deploy excess capital into the U.S. market given regulatory headwinds that could persist for the foreseeable future,\" KBW analyst Mike Rizvanovic said.The collapse of the deal further spooked already shaky sentiment towards U.S. regional banks. Three have collapsed since February after a deposit flight spiraled out of control.The latest was First Republic Bank, which was taken over by regulators who then sold its assets to JPMorgan Chase &amp;amp; Co earlier this week.Average deposits at First Horizon fell 4% to $62.2 billion in the first quarter, compared to the end of last year.TD, which acquired New York-based boutique investment bank Cowen Inc for $1.3 billion this year, was also in the running for BNP Paribas' U.S. unit, Bank of the West, but later lost that bid to peer Bank of Montreal.",
        "ORTEX said on Thursday that TD was still the world's most shorted banking stock, confirming its position early last month.(Reporting by Niket Nishant in Bengaluru; Editing by Savio D'Souza, Nivedita Bhattacharjee, Anil D'Silva and Alexander Smith)"
    ]
}