{
    "articleURL": "/tvshowbiz/article-12046299/Peter-Andre-breaks-silence-cosy-snaps-emerged-model-Caprice.html",
    "content": [
        "Peter Andre has issued a response after he was pictured holding hands with model Caprice on a recent trip to Italy. ",
        "The married singer, 50, hit the headlines this week when he was seen enjoying an alfresco lunch outside the luxurious Atzaró Agroturismo Hotel.In the images Peter was seen looking cosy with mother-of-two Caprice as they laughed and chatted during their meal. After raising eyebrows with the snaps, Peter explained that there was nothing untoward with the outing and revealed the pair were actually filming scenes for a movie. During an appearance on Thursday's Heart Breakfast, Peter was probed by Jamie Theakston: 'What is going on? You are in Ibiza together having lunch together, staring into each other’s eyes...' ",
        "Peter then clarified: 'Well Caprice is an old friend but that is actually a scene from a film, for Hallmark in America. I’m playing a nice little Spanish man called Carlos… it’s very romantic! 'So there you go unfortunately it’s nothing amazing and \"wow!\"' Peter is happily loved up with NHS doctor Emily, 33, who he married in a lavish ceremony at Mamhead House in Exeter in 2015.The couple share two children together, Amelia, nine, and Theo, six. Emily is also stepmum to Peter's two children Junior, 17, and Princess, 15, from his previous marriage to Katie Price.In April, Emily gushed that her marriage is 'stronger than ever' despite the singer being away from home for months.",
        "The doctor revealed the couple don't always get to spend much quality time together due to their busy schedules.However she admitted they put in the extra effort for date nights when they do reunite as the distance isn't the issue.She told The Sun: 'We always make time for each other, we just get on with it really.'He hasn't been this busy in years, it's crazy. He's doing loads of different things and it's one after the next - he'll finish one thing and then there's something else.'",
        "Meanwhile, Caprice shares two sons, nine-year-old Jett and Jax, one born via a surrogate and the other carried by herself, that she shares with her husband of four years, Ty Comfort.The blonde bombshell revealed the passion is still very much alive in their marriage when she made a cheeky confession last year. Caprice revealed she used to pay her sons to leave her and her husband alone so they could have sex. Speaking in her Closer column, Caprice explained that the couple would give their sons 'a few pounds and tell them to get lost' for an hour. The American star, said: 'Sex keeps a relationship strong. I've had times where I've just had to say in the daytime, \"Right, Mummy and Daddy are doing smoochers! Nobody bother us for an hour,\" - and the boys know.",
        "'We went through a stage where we even had to pay them off so they didn't disturb us. We'd give them a few pounds and tell them to get lost, basically. They were happy they had money for sweets!'"
    ]
}