{
    "articleURL": "/tvshowbiz/article-12052627/Kim-Kardashian-flashes-flat-midriff-corset-crop-denim-skirt-furry-hat.html",
    "content": [
        "Kim Kardashian sported a Marc Jacobs X Fendi crop top, denim shirt with gloves and a statement furry hat.",
        "The stunning star, 42, showcased her impossibly flat midsection and a hint of her ample cleavage in the striking look.Kim chose a white sleeveless corset crop top paired with a light wash denim maxi skirt.The mom of four wore clear ombre heels, long white gloves and a fluffy statement hat. Kim hashtagged #MarcJacobsXFendi, adding @Fendi, @MrKimJones and @Silviaaventurinifendi.",
        "The look is from Marc Jacobs X Fendi's Summer 2023 capsule collection, which launches on May 11.Her fashion moment comes just days after she stunned at the Met Gala, which took place on Monday, May 1 at the Metropolitan Museum of Art in New York City.The brunette beauty dazzled in a custom Schiaparelli look, featuring 50,000 pearls hand strung and placed on her body. Kim arrived dripping in pearls, looking absolutely heavenly - as she seemingly revisited her Playboy look from 2007 by accident. The pearls draped along her chest and her hips and legs, with a white coat draped on her arms.She added a large statement silver and pearl choker, with a diamond ring on her finger.This year's dress code for the fashion extravaganza was Karl Lagerfeld: A Line of Beauty - paying tribute to the controversial German fashion designer, known for his work with Chanel, who passed away in 2019. ",
        "Kim revealed she worked with Schiaparelli's artistic director Daniel Roseberry on her look, when chatting with Vogue.com.'I wanted to be dripping in pearls,' she said of her look.The mother of four revealed that she wanted pearls because 'what is more Karl' than 'iconic Chanel pearls,' she said during her interview on Vogue.com 's livestream. ",
        "The star was also seen chatting with her ex-boyfriend Pete Davidson and pal Usher at the Met Gala.Pete and Kim dated from October 2021 until they split in August 2022.The Met Gala reunion came nine months after they broke up.Pete couldn't stop grinning at his ex-girlfriend as they enjoyed a conversation inside the Met Gala. "
    ]
}