{
    "articleURL": "/news/article-12042497/Republic-not-deterred-receiving-letter-Home-Office-coronation-protest.html",
    "content": [
        "Graham Smith said campaign around the coronation will proceed as plannedAt least 1,600 people are expected to join peaceful 'Not My King' protestsAnti-monarchist group Republic has said 'it will not be deterred' after receiving a 'passive aggressive' letter from the Home Office warning them against plans to protest at the King's coronation.",
        "At least 1,600 people are expected to join peaceful 'Not My King' protests in Trafalgar Square and along the coronation procession route on Saturday.But the group has slammed the Home Office for the official warning letter which they 'interpreted as a passive/aggressive intimidation of a legitimate protest group'. The letter, sent by the Home Office's Police Powers Unit, set out new offences under the Public Order Bill which was given Royal assent by the monarch yesterday.Under new legislation, protesters blocking key infrastructure such as roads, airports and railways can face 12 months behind bars.",
        "Anyone found 'locking on' or gluing themselves to buildings or objects could get six months in jail and face an unlimited fine.",
        "Police can also stop and search anyone they suspect is planning to cause disruption under measures which came into force today - ahead of the coronation on May 6. The Home Office has contacted a number of protest groups to notify them of new offences which may affect them.But Graham Smith, the chief executive of Republic, said its campaign around the coronation will proceed as planned.Mr Smith said it is 'very odd' the letter came from the Home Office and described it as 'intimidatory'. He said: 'We have had two meetings with the Met police, and numerous phone conversations.",
        "'They have repeatedly said they have no concerns about Republic's plans. It is a mystery why the Home Office thought it was necessary to send us an anonymous letter that could be interpreted as intimidation.''Republic will not be deterred and we will be protesting on Trafalgar Square and along the route of the coronation procession on Saturday.'It is telling that Charles, who has had no problem speaking up on various issues, has chosen not to defend democratic rights when they are being threatened in his name. Perhaps he might make it clear that he believes in the right to protest.'Security minister Tom Tugendhat said that the group has 'the liberty that anybody in the United Kingdom has to protest.'What they don't have the liberty to do is to disrupt others.",
        "'And that's where we're drawing and making a difference.'A security and policing operation is under way with 11,500 police officers on duty on Saturday and a further 10,000 military personnel taking part in the ceremony. Today a senior office warned that protesters who try to disrupt the coronation can expect 'very swift action' from police who will have 'an extremely low threshold' with dealing with them.The Metropolitan Police have also said they will use facial recognition technology to spot troublemakers during King Charles' Coronation this weekend.",
        "Metropolitan Police Deputy Assistant Commissioner Ade Adelekan said that the force will not tolerate any criminal activity masquerading as protest during the event.Specialist teams have begun scouring the area of central London where events will unfold and will continue monitoring crowds to spot signs of suspicious behaviour.There will be more than 29,000 police officer deployments over the coming week in the lead up to Coronation Day and over the rest of the Bank Holiday weekend.In a statement, The Met said: 'Our tolerance for any disruption, whether through protest or otherwise, will be low. We will deal robustly with anyone intent on undermining this celebration.'The policing plan, dubbed Operation Golden Orb, has been re-examined after a security incident outside Buckingham Palace on Tuesday evening when a man who allegedly had a knife threw shotgun cartridges over the palace gates.The man was detained on suspicion of possessing a knife and ammunition had asked to speak to a soldier before warning police to handle his rucksack carefully at around 7.15pm yesterday.",
        "Speaking at a briefing for journalists ahead of the coronation, Metropolitan Police Deputy Assistant Commissioner Ade Adelekan said the man had initially asked police officers if he could speak to a soldier.When the officers said that was not possible, the man allegedly began throwing the ammunition, Mr Adelekan said.",
        "Meanwhile climate activists Just Stop Oil have also been holding 'slow march' protests to London's Parliament Square, a stone's throw away from Westminster Abbey, in the run-up to Saturday.The Met Police said 16 people were arrested this morning for breaching conditions that they remain off the road during a slow march between Whitehall and Parliament Square.Tuesday and Bank Holiday Monday saw similar slow marches held by the group. ",
        "Hundreds of thousands of people are expected to travel to central London for the event, including scores of foreign VIPs who need close protection.Commander Karen Findlay, who is Gold Command for the policing operation, said there are more VIPs for the coronation than there were for the Queen's funeral.She said: 'It is an absolutely historic, unprecedented mobilisation for us in terms of scale, but most importantly the nature and specialness of this event to the public, to the service, and all our communities in London and actually the whole of the United Kingdom and globally.'It's such an event of constitutional, spiritual importance for us all to be involved in.'A total of 29,000 officer shifts will be used during the days around the coronation, with specialist teams including armed police, sniffer dogs, mounted officers and marine officers on the Thames all taking part.",
        "There will be an airspace restriction across London on Friday and Saturday as part of 'an extensive security operation'.As well as the coronation itself, there are 1,800 registered events taking place in London over the weekend."
    ]
}