{
    "articleURL": "/sport/football/article-12056919/Newcastle-interested-Fenerbaches-Arda-Guler-dubbed-Turkish-Lionel-Messi.html",
    "content": [
        "Newcastle are one of several clubs interested in Fenerbache's Arda Guler The midfielder is seen as one of the most promising young stars in the game Guler could be available for £4.4m if he doesn't play 1,500 minutes this season  Newcastle are among the club’s interested in Fenerbahce’s teenage wonderkid Arda Guler - who has been dubbed the ‘Turkish Lionel Messi’.",
        "The 18-year-old is widely viewed as one of the hottest young prospects in European football having made his first-team breakthrough at the Turkish club last season.And Mail Sport understands that Newcastle are manoeuvring themselves into a position to strike for Guler ahead of next season.Barcelona and Ajax are among the rival clubs believed to have made their interest known in the player in recent weeks.Guler already has two senior appearances for the national side under his belt despite the fact he does not turn 19 until February. ",
        "Interested clubs have been alerted to a clause in Guler’s deal - that expires in 2025 - that allows him to leave for as little as £4.4million if he does not play 1,500 minutes of football this season.The teenager, who has scored six goals and provided four assists this season, has not passed the playing time threshold this season.",
        "The 18-year-old has made 29 appearances for the club this season, returning four goals and two assists from 16 league appearances helping Fenerbache rise to third in the Turkish Super Lig.Guler notably scored a duo of goals during his side's recent 3-3 draw to Istanbulspor. It comes as Eddie Howe to be in the market to bolster his midfield stocks, with reports last week suggesting that the Magpies were considering a £31m move for Inter Milan's Marcelo Brozovic. ",
        "Newcastle are also 'confident' of their chances of securing out-of-favour wing back Kieran Tierney, with Howe's side gearing up to make a £30m move for the defender. "
    ]
}