{
    "articleURL": "/wires/reuters/article-12050831/Warner-Bros-Discoverys-surprise-loss-clouds-strong-streaming-unit-show.html",
    "content": [
        "May 5 (Reuters) - Warner Bros Discovery Inc reported a surprise quarterly loss on Friday on costs tied to its 2022 merger, taking the shine off the first profit for its streaming business and sending the company's shares down 5%.",
        "The media company forged by the union of WarnerMedia and Discovery Inc recorded a $1.81 billion charge in the first quarter due to the merger, while also booking $95 million in restructuring expenses.Loss per share came in at 44 cents, while analysts had expected a profit of 1 cent, according to Refinitiv data.\"Our U.S. streaming business is no longer a bleeder,\" CEO David Zaslav said on a post-earnings call.The streaming unit, which includes the HBO Max and Discovery+ services, posted adjusted pre-tax earnings of $50 million in the quarter, compared with a loss of $227 million a year earlier. It gained 1.6 million subscribers.That marked a milestone for a division that had been losing money in its bid to gain subscribers and a foothold in the industry's digital future. However, Zaslav said the churn on HBO Max was unacceptably high.Zaslav was in the vanguard of media executives who sought to restrain spending on content for the company's service, seeking to balance the growth of the nascent service with continued investment in Warner Bros Discovery's traditional film and television business.The company's new streaming service, christened \"Max,\" is set to launch on May 23. It will seek to expand its reach beyond fans of HBO's acclaimed and edgy shows by incorporating unscripted fare and children's programming.",
        "Warner Bros Discovery is also banking on the slate of movies releasing over the summer including \"Dune 2\" and \"The Flash\" and is confident of generating $1 billion or more of profitability in 2025 globally.Zaslav also said the company was looking to boost cash flow by licensing content in India, where it struck a deal with India's Reliance Viacom18 in April.Revenue was $10.70 billion in the quarter, compared with estimates of $10.78 billion, according to Refinitiv data.The Warner Bros studio segment missed on its revenue forecasts, as its big March release \"Shazam! Fury of the Gods,\" a sequel to 2019's \"Shazam,\" was met with a cool reception at the box office.For the networks segment, on a pro-forma basis, advertising revenue fell 14% because of the softening ad market and smaller TV audiences.(Reporting by Dawn Chmielewski in Los Angeles and Samrhitha Arunasalam in Bengaluru; Editing by Sriraj Kalluvila)"
    ]
}