{
    "articleURL": "/wires/reuters/article-12046643/Qualcomm-amplifies-chip-gloom-sobering-report.html",
    "content": [
        "May 4 (Reuters) - Qualcomm Inc's shares sank nearly 8% premarket on Thursday after the chip designer signalled it would take longer for its crucial smartphone market to rebound from a post-pandemic slump.",
        "The company, which supplies to top handset makers Apple Inc and Samsung Electronics, was set to lose about $10 billion in market valuation, if the losses hold.Qualcomm's quarterly revenue outlook was the second time a chip firm has underwhelmed Wall Street this week. Advanced Micro Devices slumped more than 9% on Wednesday after a dour forecast.\"While we believe investors were expecting a miss, this was admittedly a somewhat sobering report,\" said Bernstein analysts, among the 13 brokerages that cut price targets on Qualcomm's stock.The company blamed the weakness on the timing of purchases by a customer that only buys its cellular modems and China, where an expected post-COVID recovery was yet to materialize.Qualcomm did not name the modem customer, but analysts pointed to Apple, which will report results after markets close.\"The next two quarterly estimates will be adversely impacted by Apple as this leading modem-only customer purchased modems from Qualcomm in greater volumes earlier than normal due to the supply chain issues,\" said Michael Walkley of Canaccord Genuity.China will remain a headache with no timeline for a recovery there, while competition is deepening from Taiwan's MediaTek in the high-end smartphone chips, analysts said.\"We worry about customers mixing lower now that wafers are no longer scarce as well as increasing competition from Mediatek at the higher end,\" brokerage Evercore ISI said.",
        "Still, there were some encouraging signs for Qualcomm.Automotive revenue jumped 20% and the internet-of-things unit reported in line sales, indicating that Qualcomm's efforts to diversify away from the smartphone market were on track.(Reporting by Aditya Soni; Editing by Sriraj Kalluvila)"
    ]
}