{
    "articleURL": "/wires/pa/article-12054331/Stephen-Fry-Paul-McCartney-Elton-John-lead-stars-congratulating-King.html",
    "content": [
        "Stephen Fry has praised the “magnificent” coronation service as he was joined by other famous faces including Sirs Paul McCartney and Elton John in congratulating the King and Queen.",
        "Fashion designer Victoria Beckham and her husband, former England footballer David, also paid tribute on social media to Charles and Camilla as the royal couple were crowned at Westminster Abbey on Saturday.Fry, who was among the more than 2,000 guests at the ceremony, told the PA news agency: “I thought the service was magnificent.",
        "“I mean truly wonderful. The music to start with was just inspiring, both the real kind of hammer-blow classics, the principal one I suppose has to be Handel’s Zadok The Priest at the time of the anointing because it quotes a passage of the Bible, which is exactly consonant with this idea of anointing.“And it just has this power that only Handel could muster – it’s similar to his Hallelujah Chorus, you know, just has this phenomenal sort of depth and force to it.”He added: “It was very moving and the King looked vulnerable, which all monarchs do when they’re being crowned, they’re being encumbered with all these symbols and all this heavy cloak and this sceptre, the orb, the heavy crown, which means he can barely move.“And in a strange way, I’m sure not deliberately originally, but it’s kind of symbolic of the encumbrances in life that you have if you’re a monarch, so it’s a very touching ceremony.",
        "“He’s quite lonely somehow – as the Queen was if you watch the 1953 coronation – but I feel very lucky to have been there.”TV presenting duo Anthony McPartlin and Declan Donnelly spoke about how “fantastic” it was to witness the coronation.“The view was very good by the way, we were here, and then there was only one row, then he (the King) walked past, they all walked past,” McPartlin told ITV News as he left Westminster Abbey.McPartlin said that the most amazing moment of the ceremony was “when the crown went on”.“The crowning, the whole thing, just a fantastic day,” added Donnelly.Beatles star Sir Paul posted a picture on Instagram of him and Charles on stage together, writing: “Enjoy this special day in our country’s history”.Music veteran Sir Elton shared a photo of the King donning royal regalia as he congratulated him in an Instagram post.It was previously confirmed to Rolling Stone magazine that Sir Elton had been asked to play at Sunday’s coronation concert but could not “due to scheduling issues”, with the musician on his Farewell Yellow Brick Tour.Welsh actress Catherine Zeta-Jones also offered her love and support to the royal couple on the historic day.Alongside a series of images of her meeting Charles, she wrote: “God Save the King. God bless the Queen. All my love to King Charles and Queen Camilla.",
        "“Right now I am here in Britain, in my best robe, eating scones with clotted cream and drinking copious amounts of English breakfast tea as I await history being made.”Victoria Beckham recalled “fond memories” of Charles over the years, describing him as “so supportive and kind”.The former Spice Girl posted a number of images of the British girl group meeting the King as she wrote: “From then to now! I have so many fond memories of meeting His Majesty throughout my career, and he is always so supportive and kind.“Today is a truly historic day and I’m incredibly humbled to celebrate King Charles III and Queen Camilla as they embark on their new roles. VB”The Spice Girls’ official Instagram account also remembered the group’s famous encounter with Charles in 1997 where they broke royal protocol as Melanie Brown and Geri Horner gave him a kiss.“Today marks the coronation of HM King Charles III. Here’s the first time we met at the Royal Gala in 1997”, they wrote alongside an image of the moment.David Beckham wrote on Instagram: “Today our country comes together to celebrate the coronation of Their Majesties King Charles III and Queen Camilla.”Former I’m A Celebrity winner and podcaster Giovanna Fletcher, who is an ambassador for the Prince’s Trust, the charity founded in 1976 by the now King, wrote on Instagram: “As an ambassador for @princestrust I’ve seen first hand the impact King Charles has had through his work, and I look forward to seeing his passion to help others grow in the future.",
        "“Having met the King a couple of times in the past, I have to say I’ve found him very driven in what he believes in, and a little bit cheeky! #kingcharles”."
    ]
}