{
    "articleURL": "/wires/pa/article-12059371/Prince-Louis-digs-family-Big-Help-Out-event-renovating-scout-hut.html",
    "content": [
        "Prince Louis made up for missing out on a night of musical excitement celebrating the King’s coronation – by messing about in a digger.",
        "The young royal joined his big brother and sister – Prince George and Princess Charlotte – helping to renovate a Scout hut in Slough as part of the Big Help Out.",
        "When the Prince of Wales took control of a digger, Louis sat in his father’s lap as William moved the mechanical arm and grabbed a bucket full of soil before dumping it on a spoil heap.Later the five-year-old prince was given the task of filling a wheelbarrow with what looked like builders’ sand and he focused on the job, diligently shovelling the material before wheeling the barrow himself.",
        "George was allowed to use a drill and concentrated as he worked making a hole in a piece of wood.Charlotte was spotted painting what appeared to be doors and Louis tried his hand at interior decorating, making hand prints on a wall under the direction of the Princess of Wales, as the royals volunteered at the 3rd Upton Scouts Hut in Slough helping to renovate and improve the building.",
        "The event was another milestone for Louis, who has made a number of official public appearances including attending the Christmas Day service at Sandringham with his parents and siblings.The young royals got a reward for their hard work, toasting marshmallows over a barbecue, and then tried their hand at archery.",
        "Across the country people have been encouraged to devote some free time on the Monday of the coronation bank holiday weekend for the Big Help Out, aimed at showcasing volunteering.The event was a change from Sunday night’s star-studded coronation concert, where George and Charlotte waved Union flags, sang and sported glowing wristbands during the Windsor Castle event that featured global stars including Lionel Richie, Katie Perry and a host of celebrities from film, TV and theatre.",
        "William and Kate looked relaxed after their late night, which ended with them hosting an after-show reception for some of those involved in the show and which was attended by the Duke and Duchess of Edinburgh and their daughter Lady Louise.",
        "The duke paid a moving tribute to the King during the concert, telling his father: “Pa, we are all so proud of you.”"
    ]
}