{
    "articleURL": "/wires/reuters/article-12048749/Rockies-rally-upend-Brewers.html",
    "content": [
        "Kris Bryant, Charlie Blackmon and Mike Moustakas had two hits apiece, and the Colorado Rockies beat the Milwaukee Brewers 9-6 in Denver on Thursday.",
        "Brad Hand (1-1) pitched the eighth for the Rockies, who swept the three-game series and won their fourth straight.Christian Yelich homered among his three hits, and Rowdy Tellez and Tyrone Taylor also went deep for the Brewers. Brian Anderson had three hits and Victor Caratini and Jesse Winker had two hits apiece for Milwaukee.Colorado rallied from down four runs to tie it, and then went ahead in the eighth against Peter Strzelecki (2-2). With one out C.J. Cron singled, Ryan McMahon ran for Cron and Moustakas doubled to put runners on second and third.Harold Castro drove in both with a single, Ezequiel Tovar was hit by a pitch and Brenton Doyle walked to load the bases. Tyson Miller relieved Strzelecki and gave up a sacrifice fly to Elias Diaz, and Blackmon drove in two more with a single.Yelich and Winker had RBI singles in the top of the ninth for Milwaukee.The Brewers went ahead 2-0 off starter Connor Seabold in the first on solo homers from Yelich, his fourth, and Tellez, his ninth.The Rockies threatened in the fourth when starter Wade Miley walked the first two batters but got out of the inning unscathed.Taylor, who came off the injured list on Tuesday to make his season debut, homered to left leading off the fifth inning to make it 3-0. Milwaukee added another run in the sixth when Anderson tripled with two outs and scored on a single by Caratini.",
        "Seabold allowed three runs on seven hits in five innings.Colorado wiped out the deficit in the seventh. Moustakas and Alan Trejo led off with singles and both came home on a double by Tovar.Joel Payamps relieved Miley and gave up a single to Doyle to put runners on the corners. Doyle stole second, went to third when Tovar scored on a balk and came home on a sacrifice fly by Diaz.Miley allowed three runs on six hits in six-plus innings.--Field Level Media"
    ]
}