{
    "articleURL": "/tvshowbiz/article-12049449/Great-British-Bake-star-Dame-Prue-Leith-reacts-viral-response-ball-gag-necklace-WWHL.html",
    "content": [
        "The 83-year-old baking competition judge was asked by a pair of Florida viewers for her reaction to a necklace she wore recently on TV 'Do you know what a ball gag is?,' show host Andy Cohen asked Prue'Well, I do now,' she quipped. 'Only because of the uproar about that necklace. Now I feel sort of obliged to wear them... I just think it's such nonsense'Dame Prue Leith was asked about her necklace that resembled a 'ball gag' while making an appearance on Thursday's episode of Watch What Happens Live.",
        "The 83-year-old baking competition judge was remotely asked by a pair of Florida viewers for her reaction to a necklace she wore recently on The Great Celebrity Bake Off For Stand Up To Cancer being compared to a ball gag.Show host Andy Cohen, 54, shared a photo of the necklace the featured a single round red ball and admitted it looked like a ball gag.'Do you know what a ball gag is?,' Andy asked Prue.'Well, I do now,' she quipped. 'Only because of the uproary about that necklace. Now I feel sort of obliged to wear them. ...I just think it's such nonsense.'",
        "Fellow guest Ellie Kemper, 43, agreed and urged Prue to lean into it.'I don't want to be intimidated by some a lot of chaps on Twitter who have a dirty mind!,' Prue added.Andy said he thought people would have been celebrating it.'Well, who knows,' Prue said.A ball gag is a sex bondage item usually made of of a rubber or silicone ball with a strap passing through it that is placed into a person's mouth behind their front teeth.It is used as a sex toy to keep a submissive partner quiet during consensual sex.Prue's is known for her quirky fashion style that often features bright colors and bold patterns and the unusual necklace she wore in March on The Great Celebrity Bake Off For Stand Up To Cancer caught the attention of viewers.",
        "Flo said on Twitter: 'You cannot tell me that is a necklace.'",
        "Meanwhile, Sean Peterson-Stocks commented: 'I get the sentiment of @PrueLeith's necklace, but is anyone else seeing something else?'A user named Tasha then replied: 'You mean it looks like a ball gag?', while another said: 'Does @PrueLeith realise she's wearing a ball gag?'The baking judge also caused a stir in October 2017 when viewers of The Great British Bake Off compared her jewelry to a sex toy.Prue was on the Bravo talk show along with Ellie to promote season six of The Great American Baking Show that features Prue as a judge along with her The Great British Bake Off co-judge Paul Hollywood, 57, and Ellie as a co-host.The Roku Channel announced in May 2022 that it would be airing season six of the show and it also has ordered a seventh season of the series."
    ]
}