{
    "articleURL": "/wires/ap/article-12053449/Pederson-Davis-propel-Giants-6-4-win-Brewers.html",
    "content": [
        "SAN FRANCISCO (AP) - Joc Pederson hit a go-ahead, two-run single against Corbin Burnes in the fifth inning that propelled the San Francisco Giants to a 6-4 victory over the scuffling Milwaukee Brewers in the opener of a three-game series Friday night.",
        "J.D. Davis and pinch-hitter Wilmer Flores homered for the Giants, who erased a pair of two-run deficits and won their third straight following a five-game skid.The Brewers fell to 0-4 on their trip to Colorado and San Francisco and dropped their fifth in a row overall after starting the season 18-9.Sean Manaea (1-1) allowed four runs - three earned - in five innings for his first win with the Giants.Burnes (3-2) permitted five runs over six innings, but only two were earned. A two-base throwing error by shortstop Willy Adames keyed a three-run fifth that gave San Francisco a 5-4 lead.The Giants pointed to two big moments in overcoming a 2-0 first-inning deficit and eventually beating the 2021 NL Cy Young Award winner.",
        "The first was Davis' team-leading seventh homer, in the bottom of the first, which tied the game 2-all. The other was Manaea striking out William Contreras to strand two runners in the second. Contreras, batting leadoff for the first time in the majors, had doubled to start Milwaukee's two-run first.Davis' homer was a rarity at Oracle Park, a right-handed drive over the right-field wall, which rises 24 feet above the warning track.\"My goal, I've told all these guys, is to be one of the first righties to hit it into the water,\" Davis said, referring to McCovey Cove behind the right-field wall.",
        "In fact, no right-handed hitter has reached the cove since the park opened in 2000.Giants manager Gabe Kapler said the homer was especially huge given who threw the pitch.\"Just scratching across a run or two against Burnes is always going to feel like a win, let alone scoring two in an inning on a home run,\" Kapler said. \"You just don't expect that to happen.\"Burnes retired 12 of 13 batters after the homer before Brett Wisely singled to start the decisive three-run fifth, which began with the Giants down 4-2. Adames' throwing error on Cal Stevenson's bouncer helped extend the inning, allowing Thairo Estrada to drive in one run with a two-out chopper off Burnes' glove for an infield hit. Davis walked to load the bases for Pederson, who grounded his go-ahead single past diving second baseman Owen Miller.John Brebbia, Tyler Rogers and Camilo Doval combined for four shutout innings of relief to protect the Giants' lead, which grew to 6-4 on Flores' eighth-inning homer.The Brewers are 18-14 despite the losing streak, which gives them no comfort.\"No one wants to lose five games in a row,\" Burnes said. \"We're trying to win every game we play.\"TRAINER´S ROOMBrewers: RHP Adrian Houser is expected to come off the injured list and make his 2023 debut in Sunday´s series finale. Houser strained his right groin during his final spring training start and has spent the past three weeks on a rehab assignment with Triple-A Nashville, where he had a 3.07 ERA in 14 2/3 innings over four starts.",
        "Giants: SS Brandon Crawford (right calf strain) and OF Mike Yastrzemski (left hamstring strain), both hurt April 30 in Mexico City, are boosting their work on this homestand. Crawford is ahead of Yastrzemski and will begin running this weekend. Yastrzemski will start playing catch. Neither is eligible to come off the IL before the Giants start a series in Arizona on Thursday night. ... OF Bryce Johnson was cleared to return after recovering from a concussion he sustained running into an outfield wall April 12. ... LHP Alex Wood (left hamstring strain) threw a second bullpen and has not been ruled out for the homestand.UP NEXTGiants RHP Alex Cobb (1-1, 2.43 ERA) faces RHP Colin Rea (0-2, 4.79) in the middle game of the series Saturday afternoon.___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}