{
    "articleURL": "/wires/pa/article-12040565/MP-Give-ministers-power-overturn-controversial-London-transport-plans.html",
    "content": [
        "Proposals to allow ministers to review and overturn “controversial” transport schemes introduced by the mayor of London will be raised in Parliament on Wednesday.",
        "Conservative former cabinet minister Theresa Villiers said the Government should have the power to intervene when there are “very serious concerns” about decisions relating to transport and air quality.Labour mayor Sadiq Khan’s intention to expand London’s ultra low emission zone (Ulez) has come under fire with a High Court judge last month deciding five Conservative-led councils could challenge the plan.If it goes ahead, the expansion will see drivers in outer London pay a £12.50 daily fee from August 29 if their vehicles do not meet required emissions standards. Where there are very serious concerns about the decision by the Mayor of London I think it's legitimate for my constituents to want the Government to step in and ask that the mayor does something different  Theresa Villiers  The new borders will reach Buckinghamshire, Essex, Hertfordshire, Kent and Surrey.Mr Khan’s team says he is responding to a “health emergency” by taking action to tackle “toxic air” in the capital.A spokeswoman for the mayor said it was “disappointing that some backbench MPs are wasting parliamentary time playing politics”.Ms Villiers, who represents Chipping Barnet, said her proposals could apply to other projects including low traffic neighbourhoods and moves to build on station car parks.She will seek to introduce the Greater London Authority Act 1999 (Amendment) Bill in the Commons through the 10-minute rule motion procedure, although it is unlikely to become law in its current form.",
        "Ms Villiers told the PA news agency: “A key theme is the unhappiness, especially with Ulez but also with a number of the other controversial transport schemes the mayor has introduced.“A lot of my constituents would like the Government to be able to step in and ask the mayor to think again.",
        "“My Bill, in principle, would allow that to happen although you will appreciate this procedure is more about raising issues really than the promise of actual legislative change.“The mayor of London’s decisions do have an impact on people living outside London as well.“I’m sure some people will say you can’t interfere with the devolution settlement, but decisions on our capital city can have a massive impact on millions of people who commute in and out, as well as the UK’s economy as a whole.“So I think there is a place for intervention by ministers. I’m not saying this should happen as a matter of routine. But where there are very serious concerns about the decision by the mayor of London I think it’s legitimate for my constituents to want the Government to step in and ask that the mayor does something different.“With Ulez expansion, of course we all want to improve air quality in London, there is an air quality issue that needs to be addressed, but this is the wrong scheme at the wrong time.”",
        "Ms Villiers said the scheme will have a “very limited impact on cleaning up our air”, adding: “And yet it will have a really tough impact on many people who are probably already struggling with rising prices and also on small businesses who may be dependent on vans and they simply can’t run a business using the public transport network.”The mayor’s spokeswoman said: “The mayor has been clear that the decision to expand the ultra low emission zone London-wide was not an easy one, but necessary to tackle toxic air pollution and the climate crisis. It is disappointing that some backbench MPs are wasting parliamentary time playing politics. Both No 10 and the Transport Secretary have been clear this is a matter for the elected mayor.“With around 4,000 Londoners dying prematurely each year due to air pollution, there is no time for inaction and it’s people in outer London, particularly the poorest households, who suffer the most from the damaging health effects.“Nine out of 10 cars in outer London are already Ulez compliant. For those with the most polluting vehicles the mayor has launched his £110 million vehicle scrappage scheme – the largest scheme ever launched by any city in the UK – to help low-income Londoners, disabled Londoners and micro businesses, sole traders and charities to replace their polluting vehicles.",
        "“The mayor is calling on the Government to match his action on toxic air by funding a targeted national scrappage scheme or providing funding to London and the surrounding areas to support the switch to cleaner vehicles. The Government have given millions of pounds for scrappage schemes in other parts of the country, but not a single penny to London.”"
    ]
}