{
    "articleURL": "/tvshowbiz/article-12054859/Myleene-Klass-looks-effortlessly-chic-pink-crochet-midi-dress-collection-Next.html",
    "content": [
        "Myleene Klass looked effortlessly chic on Saturday as she presented live on ITV for King Charles' historic Coronation.",
        "The giddy presenter, 45, had been made ITV's prime Music Expert and joined the channel live from the ceremony on Saturday.And the beauty looked nothing short of sensational as she took to Instagram to share snaps from her hosting gig.She looked incredible in a pink crochet midi dress from her collection with Next as she posed up a storm with an ITV umbrella during the rainy ceremony. ",
        "To finish off the look, Myleene elevated her height with a pair of gold platform heels and donned a few layered gold necklaces to accessorise.She also styled her short brunette locks in a straight bob to work at the historic occasion.Taking to Instagram, she wrote: 'And that’s a wrap. What an incredible, historic moment to be a part of. Thank you for watching @itv #Coronation dress @nextofficial #MyleeneKlassXNext Ad'.The stunning snaps come after Myleene arrived at Westminster Abbey on Friday ahead of the Coronation to prepare for the big day.Myleene took to her socials to reveal that she was en route to the iconic London landmark for the rehearsal.The beauty donned a bold floral dress and shared her excitement with her followers.Myleene looked nothing short of sensational in the multicoloured two-piece that she teamed with a pair of towering gold heels.",
        "During the car ride, Myleene gave her followers an update on her look.'I was told to dress smart so I've gone very subtle,' she joked gesturing to her eye-catching ensemble.Updating her followers in the Instagram Story, she continued: 'I'm not sure what to expect but I'm very excited. I have got my passport for entry. I'll keep you posted'",
        "Myleene then slipped on a high-vis jacket and shielded her eyes with a pair of sunglasses as she made her way inside the Abbey.She explained: 'Just following the team to the studio, this is Gazza he's my protection officer, he's going to keep me out of trouble.'VIP guests queued for a mile from 6am to get one of the prime 2,300 seats inside Westminster Abbey on Saturday. The Abbey was full at just before 9am. Some 100 heads of state are in London, with representatives from 203 countries attending to watch Charles be crowned in a Christian ceremony that dates back for 1,000 years on a day dripping with glorious displays of pageantry. Stunning flowers in reds, burgundies and yellow golds covered the top of the ornate golden High Altar.More than 100million people around the world watched the historic first coronation of a British monarch in 70 years - with an estimated 2million people on the streets of London to watch history unfold.",
        "King Charles, 74, automatically took the throne following the death of his mother, Queen Elizabeth II, in September last year.Myleene's quick dash to Westminster came following her usual stint on Smooth Radio Friday morning.Elsewhere, Amanda Holden was interviewing giddy Royal fanatics that were already lining the streets of London while Sharon Osbourne greeted campers on The Mall ahead of Coronation festivities on Friday - as the stars got ready for the big day."
    ]
}