{
    "articleURL": "/news/article-12042437/Buckingham-Palace-break-ins-teenager-stole-Queen-Victorias-underwear-Michael-Fagan.html",
    "content": [
        "Michael Fagan broke into the Queen's bedroom and spoke to her in July 1982Edward Jones got into the Palace three times during Queen Victoria's reign Yesterday's security breach at Buckingham Palace was just the latest in a long line of intrusions into the King's home. ",
        "The incident saw police detain a man after suspected shotgun cartridges were allegedly thrown into the grounds as Coronation rehearsals took place.It came more than 40 years after Michael Fagan broke into the Queen's bedroom in July 1982 and woke her up, before allegedly speaking to her for ten minutes.During the reign of Queen Victoria, 14-year-old Edward Jones broke in to the palace three times and stole the monarch's knickers, whilst in 2004 a member of campaign group 'Fathers 4 Justice' scaled the balcony while dressed as batman.And there have been at least a dozen other security breaches at the Palace down the decades. ",
        "Michael Fagan - the man who broke into the Queen's bedroomFagan initially broke into the palace in early July 1982. On that occasion, he said he shimmied up a drainpipe before getting inside through an unlocked window on the roof.He spent half an hour wandering around while eating cheese and crackers, tripping at least three alarms along the way. Incredibly, police turned them off, believing they were faulty.After looking at royal portraits, entering the throne room and drinking wine, he became tired and so left without being caught. A few nights later, he returned. He again got in by climbing a drainpipe.",
        "Fagan initially went into an anteroom, where he cut his hand after breaking a glass ashtray.Then, carrying a piece of the ashtray, he wandered into the Queen's bedroom. After waking up, she quickly pressed an alarm bell, but the policeman who had been on guard outside her room had finished his shift. Her footman Paul Whybrew was outside walking the dogs and her maid was cleaning in another room, so no one came.The Queen ensured she kept talking to Fagan and, when a maid did return, the pair ushered him into a pantry on the pretext of giving him a cigarette.Her Majesty also had to ensure that her corgis were kept out of the way as Fagan became increasingly agitated, before he was finally removed by arriving police. ",
        "The then Home Secretary, Willie Whitelaw, offered his resignation following the enormous security lapse, but Prime Minister Margaret Thatcher refused to accept it.After the Queen's death last September, Fagan, who suffers from schizophrenia, said that he was 'sad she is gone'.The 74-year-old said: 'I have no plans to go to the funeral but I have been to church to light a candle for her and hopefully it is all behind me.'I think Charles will do a good job and look after the planet. He will be very good at that.",
        "'There is also too much division between the rich and poor in society and I think Charles will help heal that.'",
        "When 'Batman' got onto to the Buckingham Palace balconyIn 2004, campaigner Jason Hatch from group Fathers 4 Justice managed to climb into the balcony of Buckingham Palace while dressed as Batman.Matt O'Connor, a spokesman for the organisation, claimed he 'legged it past the armed guards'.Hatch unfurled a banner which read: 'Super dads of Fathers 4 Justice'. His group, which was founded in 2001, wanted law changes to support fathers' rights. Another protestor, David Pyke, attempted to join Hatch while dressed as Robin but was stopped by police. Fortunately, the Queen was away at Balmoral on her summer break at the time.The following year, Pyke returned and was able to scale the Palace gates while dressed as Father Christmas.  ",
        "The teenage radical who wanted to put a gun to Queen Victoria's head Queen Victoria survived seven attempts on her life. The penultimate one, in 1872, came when the monarch was inside the perimeter of Buckingham Palace.Teenage radical Arthur O'Connor, aged just 17, had initially tried to ambush the Queen as she attended a service at St Paul's Cathedral.He had wanted to put a gun to her head and force her to sign a document that would have secured the release of Irish republican prisoners.   ",
        "But two days after the plot failed, O'Connor, who was the great-nephew of famous Chartist Feargus O'Connor, headed to Buckingham Palace and was able to climb over the fence undetected.When the Queen arrived back at the palace after a trip out, he ran to her carriage and tried to put his plan into action. ",
        "But he was quickly thwarted by her loyal manservant John Brown.O'Connor was quickly mocked by the press, denounced by the Irish republican movement and was sentenced to a year's hard labour.Victoria complained about his light sentence and so the teenager was persuaded to leave the country. He headed to Australia and was meant to remain there, but instead came back to England less than a year later and returned to Buckingham Palace.After being confronted again, he explained that he had hoped to be killed by police. O'Connor spent much of the rest of his life locked up in asylums. The teenager who stole Queen Victoria's knickers More than three decades earlier, 14-year-old Edward Jones sealed his place in history when he broke into Buckingham Palace and stole Victoria's knickers.Remarkably, Jones was able to get into the palace on three separate occasions between 1838 and 1841.On one of the occasions, he was able to read a letter that he took from her private rooms and then was caught with women's underwear spilling from his trousers.",
        "He also sat on the Queen's throne, read books from her library and stole food from her kitchen.  Writing in her journal, the Queen said: 'But supposing he had come into the Bedroom, how frightened I should have been.'Dr Jan Bondeson, a senior lecturer at Cardiff University who spent five years researching and writing a book about Jones, told how he got into the palace through unlooked doors or unshuttered windows on the ground floor. ",
        "He added: 'There was no royal security in those days.' After being caught, Jones was initially sentenced to three months in prison as a rogue and vagabond but, when he kept stalking Victoria, the government 'kidnapped' him and sent him on a ship to Brazil.When he returned, he was put on a prison ship and kept there for six years. He became an alcoholic on his release and then became a burglar before being deported to Australia. Jones did return to Britain again but was persuaded to go back to Australia, where he died an alcoholic in 1893. ",
        "July 1992 - Kevin McMahon, 25, was arrested inside the grounds for the second time in a week. During his first sortie, he forced a helicopter carrying the Queen and the Duke of Edinburgh to divert as he roamed the grounds.1994 - A naked paraglider landed on the roof of Buckingham Palace. American James Miller was fined £200 and deported.1995 - Student John Gillard rammed the Palace gates in his car at 50mph, tearing one off its hinges.November 2003 - Daily Mirror journalist Ryan Parry sparked a major alert when he managed to become a footman using false references and infiltrated the workings of the Queen's London home in November 2003.Parry claimed he was given the chance to get close enough to the Queen to have poisoned her and said no rigorous checks were made into his background. He took pictures of the bed in which US president George Bush and his wife Laura were to sleep during a subsequent state visit.2012 - Four climate change activists were arrested in 2012 for scaling the Palace gates and chaining themselves to the railings. Two of them held a banner carrying a quote from the Prince of Wales reading: 'The doomsday clock of climate change is ticking ever faster towards midnight. We are simply not reacting quickly enough.'September 2013 - A man scaled a fence at the Palace and was found in a room that had been open to the public during the day. Another man was arrested outside the Palace. Less than 48 hours after the incident, two police officers confronted the Duke of York in the Palace gardens demanding to know who he was.2013 - A man with a 6in kitchen knife was rugby-tackled to the ground by police outside the Palace after he jumped over a vehicle barrier in an attempt to see the Queen. David Belmar admitted trespass and possession of a bladed article. The court heard that he wanted to see the Queen because he was unhappy with his benefits.November 2015 - Activists climbed on the roof of Buckingham Palace in a protest over fathers' rights in November last year. Martin Matthews, 48, and Bobby Smith, 33, used a ladder to breach security after another campaigner caused distraction outside the Palace.2016 - A musical group claimed to have 'gatecrashed' Buckingham Palace, fooling guests at a private art talk last month. In a video uploaded online, Cat's Eyes said they had previously attempted to get into the Palace to perform a song from their new album. The group said they pretended to be a Renaissance ensemble performing music from that era, when really they gave a live rendition of their own song, We'll be Waiting.In a separate incident in May of the same year Denis Hennessy, 41, wandered through the royal gardens for up to ten minutes, before asking armed officers, 'Is Ma'am in?'The unemployed Irishman was oblivious to the security alert he had caused as the Queen, Duke of Edinburgh and Duke of York were rushed to safety.After the drunken trespasser was confronted just 50 yards from the palace, investigators were shocked to discover his past conviction – which saw him jailed for life at the age of 18.He had bludgeoned homeless man Kevin Cusack to death with a 10in iron bar outside a north London fish and chip shop, in an attack compared to scenes from the ultra-violent film A Clockwork Orange.One detective said the case was the worst he had seen in his 27-year career. Hennessy was found guilty by a jury at the Old Bailey.2018Steven Lawlor was jailed for 28 days after he trespassed into the grounds of Buckingham Palace and damaged items before falling asleep.He broke poster boards and glass cabinets fixed to metal railings so he could use them as bedding.  2021Danriel Brydges scaled two fences to gain access to the gardens at Buckingham Palace in December 2021. Brydges, who was 'fixated' on accessing royal grounds, had travelled from his home in Portsmouth and attempted to get into the palace a month before on November 15 but was not charged.The intruder, 33, admitted two counts of trespassing and damaging the barbed wire fence 'belonging to the Queen's Estate'.District Judge Annabel Pilling sentenced him to 12 weeks' imprisonment, suspended for 18 months, and said he must not go within 100m of a royal residence. "
    ]
}