{
    "articleURL": "/wires/reuters/article-12055809/Anthony-Davis-Lakers-paste-Warriors-30-Game-3.html",
    "content": [
        "Anthony Davis scored 25 points with 13 rebounds and LeBron James added 21 points as the Los Angeles Lakers rebounded for a 127-97 blowout Saturday over the visiting Golden State Warriors in Game 3 of the Western Conference semifinals.",
        "The Lakers took a 2-1 lead in the series.D'Angelo Russell also scored 21 points as the Lakers returned home and found their energy again after a lackluster 127-100 defeat in Game 2. The victory came even as James did not take a shot from the field in the first quarter and did not score his first basket until 5:22 remained in the first half.Stephen Curry scored 23 points and Andrew Wiggins added 16 points with nine rebounds for the defending champion Warriors, who also trailed 2-1 in their first-round series against the Sacramento Kings before advancing in seven games.Klay Thompson scored 15 points for the Warriors, who shot 39.6 percent from the field and had 19 turnovers. Golden State was 29.5 percent from 3-point range after going 50.0 percent from distance in Game 2.The Warriors had the best of the early going as they opened a 30-23 lead after one quarter. The Lakers stormed back in the second quarter, using a 22-2 run to take a 51-42 lead with 2:23 remaining in the first half. Los Angeles led 59-48 at the break.The Lakers continued their charge into the third quarter, taking their first 20-point lead at 86-66 following a close-range fade-away jumper from James with 1:01 left in the period. Los Angeles took an 86-68 lead into the fourth quarter and coasted home to the victory.",
        "The Warriors removed Curry, Thompson and Draymond Green from the floor with 9:11 remaining and the Lakers up 98-72.Davis went 7 of 10 from the field and 11 of 12 from the free-throw line after he was just 5 of 11 from the field and scored 11 points in Game 2. The star forward appeared to play through rib discomfort on his left side after he fell on top of Green in the first half.Lonnie Walker IV and Dennis Schroder each scored 12 points for the Lakers, who improved to 4-0 in home games during the playoffs and play host in Game 4 on Monday.--Field Level Media"
    ]
}