{
    "articleURL": "/news/article-12058527/Greens-leader-Adam-Bandt-slams-Anthony-Albanese-federal-budget.html",
    "content": [
        "Federal budget handed down on Tuesday May 9Greens won't support Housing Australia Future Fund BillThe Greens have slammed Anthony Albanese's government accusing it of catering to the 'top end of town' as it prepares to hand down its first full federal budget.",
        "The Prime Minister and Treasurer Jim Chalmers have talked up $14.6billion worth of cost of living measures ahead of the release of the budget on Tuesday.Power bill relief and Jobseeker increases 'across the board' are just some of the benefits expected to be announced tomorrow. ",
        "The Greens have lashed out claiming the 2023-24 budget will be a let down for Australia's most vulnerable households.Greens leader Adam Bandt accused the government of not doing enough to increase welfare payments and slow rental increases.He argued the budget would most benefit people who are already financially secure. 'Labor’s budget will spend more on tax breaks for wealthy property investors with multiple properties than it will on its cost of living packages,' he said.The government's planned stage three tax cuts, which are due to come into effect in 2024, are set to be a key sticking point for its opponents.Under the policy introduced by the Morrison government, people on incomes of up to $200,000 will all pay less tax.Labor has said it will not abandon the former government's stage three tax cuts policy.Mr Bandt says the Albanese government should be freezing rents, focusing more on reducing poverty and ensuring gas companies pay fairer taxes. While the budget is the main game, Labor is also seeking the support of the Greens and crossbenchers to secure the passage of its Housing Australia Future Fund Bill.",
        "That bill holds the key to a $10billion plan to improve social and affordable housing as the Senate debates government legislation this week.The fund's earnings will help deliver 30,000 new social and affordable homes over five years.The government wants a vote on the bill before the Senate rises on Thursday.While Labor will have the support of independents, the Greens are holding out for a more ambitious plan.Mr Bandt said it would be a 'terrible idea' for the government to force a vote on the bill.",
        "'It would be much better for the government to put their effort into negotiating improvements to the bill so that it can pass, because that is something the Greens are willing to do,' he said.Mr Bandt said the legislation in its current form did not have the support of his party, which wanted to see action on the rental crisis and significant spending on housing.Independent senator Tammy Tyrrell, who secured a floor in the program of 1,200 homes for every state and territory, said the Greens could end up delivering 'nothing'.'The Greens need to back in the Housing Australia Future Fund,' she said.Another key item for debate will be laws to set up Jobs and Skills Australia and improve protections of and access to worker entitlements, including for superannuation and parental leave.",
        "Labor will head into the budget sittings with a solid lead over the Liberal-National coalition in opinion polls, and its newest MP Mary Doyle will be sworn in as the member for Aston on Tuesday.Ms Doyle will deliver her first speech on Thursday.Former minister and Fadden MP Stuart Robert is expected to address parliament following his retirement announcement over the weekend.The resignation will trigger a by-election in the Gold Coast seat, with local businesswoman Fran Ward considered the frontrunner to be endorsed as the LNP's candidate.The parliament will mark the passing of a number of significant Australians, including Indigenous leader Yunupingu, former ministers John Kerin and Stewart West, and social justice campaigner Father Bob Maguire.On Monday morning, Mr Albanese confirmed he will raise the age for the single parenting payment in the Budget.Single parents will now be entitled to financial support on the Parenting Payment (Single) until their child is 14 in a commitment worth $1.9 billion.Centrelink's JobSeeker payments may be increased by up to $40 a fortnight. "
    ]
}