{
    "articleURL": "/news/article-12055575/Mareeba-brawl-puts-three-hospital-six-charged-Byrnes-Street-attack.html",
    "content": [
        "Brawl sees group attack man on the groundMan punch and kicked until he is knocked outFight puts three in hospital with six charged Shocking footage has captured the moment a vicious brawl broke out before three men were rushed to hospital and another six charged over the attack.",
        "CCTV footage captured the punch-on as it unfolded on Byrnes Street at Mareeba, a settlement in far north Queensland, on April 29. One man in a black t-shirt is seen trying to ward off several youths before picking one of them up and slamming him onto the ground.",
        "Several youths then rush at him and lay punches and kicks to him causing the man to slump over the young person beneath him. He is rolled onto his back and lies unmoving while several people continue to stomp on him and kick him in the head.Another man in a blue buttoned shirt is seen backing up into a corner as punches and kicks rain down on him.He gets up before he is pushed causing him to stumble and fall over again.Dan, one of the men caught up in the attack, said he had been celebrating his 34th birthday with friends before the brawl unfolded. He said he saw a group of kids fighting seasonal workers and other youths trying to storm the pub, which had closed, locking them out. 'Me and my friend were walking ahead of this older guy,' Dan told the Cairns Post.'We heard a commotion because a couple of (people) had singled him out. We tried to get him away from them.",
        "'More and more of them started arriving, a couple quickly turned into six or eight. They were whistling to each other to bring more people down. It blew up so quick.'Dan said he was knocked unconscious and was taken to the local hospital before he was discharged the following day at 4am on Sunday.",
        "His 29-year-old friend was flown to Cairns Hospital.He said he was 'out for a good few minutes' during the attack.Dan said his friend required four-and-a-half hours of surgery as surgeons worked to reattach the nerves in his neck. He said his friend had gained a bit of movement back at the mouth, but he was still having trouble with his eyes. Another 45-year-old man was also admitted to hospital suffering bruising, police said.Police have made six arrests over the incident.A Queensland Police spokeswoman said a 27-year-old man has been charged with three counts of assault occasioning bodily harm and also fraud and public nuisance charges.He is expected to appear before Mareeba Magistrates Court on May 29.A 15-year-old boy was dealt with under the provisions of the Youth Justice Act, while three 14-year-old boys and a 13-year-old face assault and breach of bail charges. They will appear before Mareeba Children's Court.Dan said this incident was hardly an isolated one and he had witnessed many similar brawls in Mareeba. "
    ]
}