{
    "articleURL": "/wires/ap/article-12043845/Eurovision-fashion-Some-contests-iconic-looks.html",
    "content": [
        "LONDON (AP) - Since 1956, the Eurovision Song Contest has provided catchy tunes, cheesy pop and bombastic anthems - but also some eye-catching fashion.",
        "One of the most memorable competitors in Eurovision history was heavy metal band Lordi, who donned monster prosthetics and won for Finland in 2006 with \"Hard Rock Hallelujah.\"\"It was a blessed victory on so many levels,\" said lead singer Mr. Lordi (aka Tomi Petteri Putaansuu), \"and of course it was the first time that some really pretty people won.\"In some cases, the fashion outshines the song: Glam metal outfit Wig Wam, Norway´s entry in 2005, only finished in ninth place, but the band´s lead singer drew much attention in an extremely figure-hugging star spangled jumpsuit.Familiar faces and outlandish looks don't necessarily hold sway with judges. Twin duo Jedward - John and Edward Grimes - represented Ireland in 2011 and the following year. In 2012, they finished sixth at the contest in Baku, Azerbaijan, wearing matching robot outfits with shoulder pads and boots, with their signature huge quiff hairdos.Some other notable looks from recent years:",
        "- Krista Siegfrids from Finland performed \"Marry Me\" in 2013, wore a tulle wedding dress with a strapless bodice, a train and electric-pink platform heels. Her performance also made history, with the first ever lesbian kiss at the contest.- Austrian singer and drag queen Conchita Wurst won the competition in 2014 with \"Rise Like a Phoenix,\" sporting a figure-hugging golden gown, complete with perfectly groomed facial hair.",
        "- Italian band Måneskin, who won Eurovision in 2021, wore custom red leather outfits with silver studs designed by Etro - but couldn´t wait to remove them at a press conference afterward.The 2023 Eurovision final will be held in Liverpool - the U.K. stepped in to host on behalf of last year's winner, Ukraine - on May 13."
    ]
}