{
    "articleURL": "/wires/afp/article-12046787/Africa-eyes-potential-bounty-space.html",
    "content": [
        "After decades on the sidelines, African countries are venturing into the space industry, hoping to reap rewards in agriculture, disaster prevention and security.",
        "Ivory Coast, which recently hosted a \"NewSpace Africa\" conference organised by the African Union, has announced the creation of a space agency and plans to build the country's first nanosatellite by 2024.In April, Kenya's first working satellite was put into orbit by a SpaceX rocket launched from the United States.The two countries follow African pioneers South Africa, Nigeria, Algeria and Egypt -- a trailblazer which owned the first African satellite sent into space in 1998.According to AU space programme coordinator Tidiane Ouattara, about 15 African countries have a space agency.The AU in 2018 fostered the African Space Agency, whose headquarters will be in Cairo alongside the Egyptian Space Agency, to promote coordination among AU members.According to a Vienna-based NGO, the Space Generation Advisory Council, African countries have launched 41 satellites since 2016, led by Egypt, South Africa, Algeria and Nigeria.But only nine were designed and made in African states, while the rest were provided by foreign states, which also provided launch capability.- Lower cost barrier -The good news is that cost, the great barrier to entering space, is plummeting thanks to cheaper components and miniaturisation, which reduces satellite weight.\"Space is no longer expensive, not at all,\" said Ouattara. A nanosatellite with a mass of between one and 10 kilos (2.2 and 22 pounds) can be built by African universities for between $50,000 and $100,000, he said.",
        "A top priority for African countries is Earth observation -- satellites that monitor cloud cover, rainfall, flooding, drought and so on, said Mamadou Sarr, head of a pan-African group, the Regional African Satellite Communication Organization (RASCOM).Nearly half of Africa's population lives from farming, according to UN figures.The continent also accounts for nearly two-thirds of the world's uncultivated arable land, according to the African Development Bank -- a crucial factor in how the planet can feed a human population expected to reach nine billion by 2050.Satellites can also play a security role, monitoring foreign plundering of coastal fisheries and movements of jihadist rebels destabilising the Sahel and northern Mozambique.- $20 billion market -Another big market is communications.Africa was an early convert to satellite technology, which along with mobile phone networks helped it leapfrog over copper wire networks to move around data.Its billion population are voracious digital consumers, not just for classic entertainment such as TV and radio but also in innovative areas such as mobile phone banking and telemedecine.According to an AU study published in 2019, the African space market will be worth $20 billion next year.But right now, it is the foreign providers who harvest the data bounty -- a scenario that some have likened to a rerun of colonial history.",
        "\"Africa should not become a place for conquest once more,\" Ivory Coast's minister for higher education and scientific research, Adama Diawara, said at the space conference.Africa's problems in developing commercial use of space are not just about funding, he said.The continent's vibrant entrepreneurial culture is being hampered by \"hazy or absent regulations\", and this creates uncertainty for investors, he said."
    ]
}