{
    "articleURL": "/wires/reuters/article-12041427/Political-prisoners-2-000-pardoned-Myanmar-junta.html",
    "content": [
        "May 3 (Reuters) - Myanmar's military government on Wednesday pardoned more than 2,000 prisoners, state media reported, among them a journalist and what activists and media said were numerous political detainees.",
        "State television MRTV said 2,153 prisoners convicted of incitement were pardoned to mark a Buddhist holiday and warned they would be arrested and given additional sentences if they re-offend.Since overthrowing an elected government in 2021, Myanmar's military has detained thousands of opponents, according to rights groups, drawing global condemnation and Western sanctions.At least 17,897 people have been held and 3,452 killed by security forces, according to the Assistance Association for Political Prisoners (AAPP), an activist group.The military says it is fighting \"terrorists\" intent on destroying the country.But many of the junta's opponents were charged under a law prohibiting incitement, the definition of which has been expanded and used against people urging civil servants to go on strike.AAPP spokesperson Bo Kyi said the group was verifying the list of those pardoned and considers those jailed for incitement as being political prisoners.He also said the junta was disingenuous and included many people who were already close to completing their sentences, or unlikely to be released at all.The military periodically frees prisoners from its crowded jails and last month said it released more than 3,000 detainees, including 98 foreigners.Zaw Tun, a freelance photojournalist arrested in Yangon while covering an anti-coup protest in December 2021, confirmed his release by telephone on Wednesday.",
        "\"I had to survive through the interrogation. I am happy that I got freed but many people are still behind bars and I am wishing for their release,\" he told Reuters.Among the most prominent political prisoners is ousted leader Aung San Suu Kyi, who is serving 33 years in prison for a multitude of offences she says were trumped up. The military has said all detainees receive due process. (Reporting by Reuters staff; Writing by Kanupriya Kapoor; Editing by Martin Petty)"
    ]
}