{
    "articleURL": "/news/article-12046879/Mystery-500lbs-cooked-spaghetti-ziti-elbow-macaroni-dumped-New-Jersey-woods.html",
    "content": [
        "A New Jersey resident discovered mounds of pasta near a stream on a walk Local advocate Nina Jochnowitz posted the viral pictures of the unusual sight  prompting local public works to clean it up Who dumped the cooked noodles, and why, remains a mystery A New Jersey town has an unusual mystery on their hands after 500 pounds of cooked spaghetti, ziti and elbow macaroni were found dumped along a stream.",
        "The bizarre pollution was discovered last month when a resident taking a stroll along the wooded area near their home in Old Bridge Township spotted the peculiar piles of pasta.The resident initially contacted their township to report the dump, then contacted local advocate Nina Jochnowitz, who previously ran for city council in the sixth ward.Jochnowitz told DailyMail.com, 'the resident thought it was hay at first but when they got closer saw it was tons of cooked pasta.'She followed up with her own email to the township, but when she also did not hear back, she took the matter into her own hands and went down to the site to take pictures. She posted the mountains of carbohydrates on her public Facebook page for locals to eat up. Within hours public works cleaned up the needless noodles, but the culprit and their motive were still unknown. ",
        " 'You might say, 'Who cares about pasta?' But pasta has a PH level that will impact the water stream,' Jochnowitz told The Philadelphia Inquirer.'That water stream is important to clean up because it feeds into the town's water supply ... It was one of the fastest cleanups I've ever seen here.'Jochnowitz praised Public Works Director Kasey Lenning for their response but took the opportunity to note the public cleanup issues plaguing the area which she said has become an eyesore and a 'dumping area' where garbage is thrown. ",
        "'We are the only town in Middlesex County that has failed to provide bulk garbage pickup for its residents,' she said. 'This has been going on for at least a decade.' Old Bridge Township located in Middlesex County has a population of 66,000. 'The Department of Public Works cleaned it up. They are a great group of people. When given the right opportunity they do the right thing,' she said. 'Unfortunately, they are typically overwhelmed.' The garbage issue has been a bone of contention with many of its residents and with Jochnowitz when she was running for office. 'The Mayor [Owen Henry] thinks the $20 cost for bulk garbage pickup for each homeowner is too much money and I brought it up when I was running for city council and it has been a conversation for years.'She added, 'when it rains here, it smells like sewage.'The local advocate shared another mess she coordinated and got cleaned up was when 300 tires were thrown in an estuary lake  She said the county helped clear it out, but a pile of trash from the incident still remains that the township still has not removed, the Inquirer reported.",
        "While the mystery of who dumped the pasta and why remains to be unsolved,  Jochnowitz says she hopes the bizarre occurrence can raise awareness of contamination concerns and environmental neglect.",
        " 'As humorous as it is, it is also really sad,' Jochnowitz said. 'Unfortunately, it is reflecting a bigger problem in the country - garbage and gluttony. Look at what is going on in our oceans .... the animals consider it another piece of land.'In the interim, her photos of the mounds of ziti and macaroni turned into a viral sensation on Reddit and Twitter on Tuesday.'We should send the perpetrators to the state penne tentiary,' one of the top comments on the New Jersey subreddit thread said. 'I don't know. If we do that, I'm alfredo what will happen to them,' another user replied."
    ]
}