{
    "articleURL": "/wires/aap/article-12053485/On-coronation-day-Stan-Grant-wants-monarchy-ditched.html",
    "content": [
        "\"It's a pretty good place to be on coronation day,\" said one member of Stan Grant's audience at the Melbourne Writers Festival.",
        "His latest book, The Queen is Dead, argues for a republic, a just settlement with Indigenous people, and an end to the monarchy in Australia.Even those who disagree with his stance would have to acknowledge his timing, hours before the coronation of King Charles, is spot on.Grant is expected to participate in media coverage of the event later on Saturday, despite the Wiradjuri man arguing the monarchy represents suffering for Australia's First Nations people.He believes that to take the coronation seriously would be to accept an Australian prime minister pledging allegiance to a crown that tried to exterminate his people.Grant explained that as a child, he had to recite an oath of allegiance to God and the Queen, an act that was loveless and never felt right.\"I've never felt part of the song of Australia, I have wrestled with that all my life,\" he said.King Charles will be blessed with holy oil, marking him as a gift from God, Grant told the festival audience of more than 500 people.Yet invoking Christ, a brown-skinned man of suffering, to crown a king of empire does not fit with the black Christianity he experienced growing up.On the debate surrounding the voice to parliament referendum, Grant told the crowd it has become immersed in politics - something he does not want to get involved in.",
        "\"When I get close to politics I feel diminished, I look for poetry not politics,\" he said.A First Nations member of the audience asked Grant for advice on what to do if the referendum fails.He predicts that nothing will fundamentally change if that happens.\"We are going to wake up to the same country with rivers that flow the same way,\" he said.Beyond the voice there is still the Uluru Statement from the Heart, according to Grant, a document that speaks to our souls.\"It's an incredible expression of love from a people who know who they are,\" he said.Stan Grant appeared in conversation with Anne Pattel-Gray as part of the Melbourne Writers Festival."
    ]
}