{
    "articleURL": "/wires/ap/article-12060783/Maybe-investors-shouldnt-worry-Buffetts-successor.html",
    "content": [
        "OMAHA, Neb. (AP) - Many investors worry about the future of Berkshire Hathaway after its legendary CEO Warren Buffett is gone, but most of the conglomerate's companies have already made the transition to reporting to the man who will eventually replace the 92-year-old.",
        "Buffett himself and executives at Berkshire Hathaway companies like See's Candy and Dairy Queen say they don't have any qualms about Vice Chairman Greg Abel's ability to lead the conglomerate. Abel already oversees all of Berkshire's noninsurance businesses. So the main parts of the CEO job he's not already doing are overseeing the insurance side of the company and deciding how to invest Berkshire's nearly $131 billion in cash.Buffett reassured investors at Saturday's annual meeting that he believes Abel is the right man for the job and that he does know how to allocate capital following the same model Buffett uses even if he's not making those spending decisions now. Plus, Abel did help oversee a number of large acquisitions at Berkshire's utility unit that he led from 2008 until 2018, including the purchases of NV Energy in Nevada for $5.6 billion and Canadian power transmission firm Altalink for nearly $3 billion.\"I don´t have a second choice. I mean it is that tough to find. But I have also seen Greg in action and I feel 100% comfortable,\" Buffett said. \"Greg is inheriting a good business and I think he´ll make it better.\"Buffett confirmed that Abel will eventually take over for him two years ago after his partner Charlie Munger let it slip at that year's annual meeting although Buffett has no plans to retire.",
        "Plus, Berkshire does have two other investment managers and another vice chairman who oversees all the insurance business, including Geico and several large reinsurers, in place although Buffett said it will be up to Abel to decide how much to lean on those folks after he becomes CEO.",
        "Gonzaga University business professor Todd Finkle, who just wrote a new book titled \"Warren Buffett: Investor and Entrepreneur,\" said Berkshire shareholders should trust Buffett's judgement about his successor because he has been thinking about his successor for years.To underscore how long Buffett has been thinking about this, Berkshire showed video clips Saturday of Buffett getting questions about his successor for at least the last 29 years. It probably came up before then too, but Berkshire doesn't have video of the meeting before 1994.\"He´s not going to screw this up,\" Finkle said at the Gabelli Funds Value Investing Conference on the eve of the annual meeting in Omaha.CFRA Research analyst Cathy Seifert agreed: \"The succession issue has been put to rest.\"Berkshire managers who have been reporting to Abel instead of Buffett since 2018 said they're confident and impressed with his ability to oversee dozens of different businesses as varied as Israeli tookmaker Iscar Metalworking, industrial conglomerate Marmon Holdings, jeweler Helzberg Diamonds and the NetJets private jet service.",
        "Dairy Queen CEO Troy Bader said that whenever he has any issues related to the brand, Abel is always available, and he reaches out if he ever has any questions. Bader said he's not sure where Abel \"gets all the time in the day, but his access has been terrific.\"\"Greg is a very quick study. He understands the businesses quickly and he´s going to challenge us, as you would expect any really good manager to do,\" he said.Buffett is clearly a tough act to follow after leading Berkshire for 58 years and earning a reputation as one of the best investors ever, but Bader said there is a lot of talent among Berkshire's other managers.\"Obviously Berkshire has never known anything other than Warren and Charlie very well involved,\" Bader said. \"But having had the privilege of getting to know so many of the other leaders, Berkshire´s in very capable hands, and that´s a credit again to Warren.\"Buffett and Abel joked during a CNBC interview earlier this spring that Abel might even be able to get more out of Berkshire's businesses because he doesn't the history of having acquired them and may ask tougher questions as he gets to know the companies better. But just like Buffett, Abel largely lets the businesses run themselves, talking strategy with them periodically and offering advice whenever they need it. But the CEOs of each Berkshire business make the day-to-day decision except that they'll run any big spending decisions past headquarters.",
        "Brooks Running CEO Jim Weber said Abel approaches the businesses with the background of an operator who helped build the Berkshire Hathaway Energy utility unit as opposed to Buffett's background as an investor. Abel may even direct a few more pointed questions about Brooks' competition to Weber because unlike Buffett, Abel is a runner who wants to try on the shoes not just talk numbers. But he still provides similar oversight.\"We definitely see he´s got he´s got the brain of an operator. And so in that sense, there is a different slate of questions that are, I think, more in tune with business topics and issues,\" Weber said. \"But at the end of the day, you know, the relationship is, is still kind of working the same for us.\"See's Candy Pat Egan said shareholders should know that Abel is remarkable in his own right.\"Greg´s singularly talented. He´s an amazing guy,\" Egan said. \"So in terms of leadership, we have no, no concerns whatsoever.\""
    ]
}