{
    "articleURL": "/wires/ap/article-12045061/Artists-Russia--Our-Fire-Stronger-Than-Your-Bombs.html",
    "content": [
        "GOFFSTOWN, N.H. (AP) - As Ukrainian artists Jenya Polosina and Anna Ivanenko watched missiles descend on their country, the two decided to use their creativity to push back against Russia's invasion. Working in the early days of the war from bunkers or sometimes without electricity and water in Kyiv, they and other artists started drawing.",
        "Some of their war posters are now on display in New Hampshire. In the exhibit entitled \"Our Fire is Stronger Than Your Bombs,\" posters from Ivanenko show children studying in a bomb shelter and Ukrainians fleeing the country soon after the war started. Polosina's drawings celebrate a female gymnast and a young mathematician who were killed in missile strikes.\"We understood that it´s a good pill, a good medicine for not panicking, for keeping yourself together. So, we started drawing,\" Ivanenko told The Associated Press from the studio in Kyiv she shares with Polosina. They are among eight artists who contributed 20 posters to the exhibit at the New Hampshire Institute of Politics in Manchester that opened Monday. The posters were shown previously at Dartmouth College and still can be seen as part of a digital exhibit.Before the war, Polosina was producing illustrations for books and advertising that focused on social themes like human rights and Ukraine's largest LGBTQ rights event, KyivPride.Ivanenko did book and advertising projects. But they quickly turned their focus to the war and, through Instagram, shared their images. They have been joined by scores of other Ukrainian artists who produce graphic novels, comics and other types of media to spread the news about the war.",
        "The colorful and a times startling posters produced last year have helped rally support for the war among their fellow Ukrainians, raise money for the war effort as well as give them something to do. The posters have also become part of a growing digital effort to draw attention around the globe to the invasion and its impact on Ukraine.",
        "\"One hundred pictures from illustrators in Ukraine ... are helping to grow awareness about what is happening and then that will have an impact on those who make decisions,\" Polosina said.Polosina said the opportunity to show their work in New Hampshire \"is very important for us because this is almost direct communication with viewers outside of Ukraine that can see our reflections, that can see our feelings and be more sympathetic.\"Some of the posters on display in New Hampshire have the feel of classical war propaganda aimed at raising the spirits and rallying residents.One shows four people staring up at a missile featuring the Russian coat of arms and the words \"Our Fire Is Stronger Than Your Bombs.\" Another shows two people holding the Ukrainian flag in Kherson next to the words from the Ukrainian national anthem, \"And We Will Show Brothers That We Are Of The Cossack Nation.\" Russian had taken over Kherson in the early days of the war and Ukraine retook it late last year.",
        "Others serve to document the most dramatic events of the war like the Mariupol theater attack or fighting in Bakhmut, which has become the longest-running battle since Russia launched its full-scale invasion more than a year ago. That poster features a soldier, blood on his chest and white bandages on his head, gripping a red snake in each hand that represent Russian forces struggling to encircle the city. Another shows masked workers in white hazmat suits exhuming a mass grave.Ivanenko described how she was \"charged with rage\" and a \"desire to stop the war, stop the aggressions\" whenever she hears about explosions or another collapsed building in Ukraine. So her posters are her effort to help \"in a small way.\"Some are more like diary entries of the artists, documenting the daily struggles they encounter. Along with the posters of children and family impacted by the war, one shows children with reflective vests playing, a reference to the precautions they often take during frequent blackouts.\"We focus mostly on some things that are related to our experiences because it's feels little bit more true to us,\" Ivanenko said. \"Of course, some things we hear about in the media, it's also our experience. You can't stay indifferent to everything.\"The exhibition was the inspiration of Veronika Yadukha and Hanna Leliv, translators who fled Ukraine and arrived in the United States in September. They are both at Dartmouth and felt that an exhibit of war posters chronicling the first year of the war would be a way to overcome American fatigue around the long-running conflict.",
        "\"People get tired very quickly of these horrific events and the news. Usually, when we see the photographs or videos, our mind blocks all this stressful information,\" Yadukha said. \"I realized that these pictures or illustrations work as an alternative media ... People see these pictures. There is space between the real life and the message. They get the information which is the essential thing.\"In Manchester, Yadukha and Leliv spent Monday putting up the posters, which were printed at Dartmouth from digital files provided by the artists. About 60 people came out for the opening, listening to the artists speak about creating the posters and listening to Ukrainian poetry that was inspired by the war.\"It's devastating,\" said Mary Fuller, a homemaker and former teacher from Concord who had come to the exhibit opening. \"It's devastating what these people are going through for money and power. But that is the world ... This is the reality and the depth of the war. It's not superficial. You can feel it in these pictures.\"___Stepanenko reported from Kyiv."
    ]
}