{
    "articleURL": "/wires/pa/article-12042169/Man-arrested-outside-Buckingham-Palace-asked-speak-soldier.html",
    "content": [
        "A man arrested outside Buckingham Palace on suspicion of possessing a knife and ammunition had asked to speak to a soldier before warning police to handle his rucksack carefully.",
        "The suspect was arrested at around 7.15pm on Tuesday when he allegedly began throwing shotgun cartridges over the palace gates.Speaking at a briefing for journalists ahead of the coronation, Metropolitan Police Deputy Assistant Commissioner Ade Adelekan said the man had initially asked police officers if he could speak to a soldier.",
        "When the officers said that was not possible, the man allegedly began throwing the ammunition, Mr Adelekan said.He was searched and allegedly found to be in possession of a lock knife. He was then arrested on suspicion of possession of a knife and ammunition.During the arrest, the man told officers that they should handle his rucksack with care, which led to a controlled explosion being carried out on the bag.The blast, which could be heard live on GB News, happened as cordons were put up in the area just hours before a major military rehearsal of the coronation procession overnight.",
        "Footage captured by Australia’s Channel 7 News showed four officers detaining a man, dressed in an olive green gilet and checked shirt, outside the gates to the palace near a security hut where armed officers are stationed.Mr Adelekan said the suspect was detained within seconds and arrested within five minutes.He said he had no knowledge of reports that the man had been shouting that he wanted to kill the King before he was arrested.",
        "The suspect has undergone a mental health assessment and has been deemed fit to be interviewed.Scotland Yard say they are not treating the incident as terror-related.",
        "Neither the King nor the Queen Consort were at Buckingham Palace at the time of the incident, but Charles did host Australian Prime Minister Anthony Albanese during an audience there earlier on Tuesday.The items thrown into the palace grounds “have been recovered and will be taken for specialist examination”, the Met Police said.Chief Superintendent Joseph McDonald said: “Officers worked immediately to detain the man and he has been taken into police custody.“There have been no reports of any shots fired, or any injuries to officers or members of the public.”In February, Jaswant Singh Chail, then 21, admitted a charge under the Treason Act of trying to harm the late Queen.He was caught in the grounds of Windsor Castle with a loaded crossbow on Christmas Day 2021, close to the late Queen’s private residence, where she and other members of the royal family were at the time."
    ]
}