{
    "articleURL": "/wires/reuters/article-12053399/Kyle-Tuckers-late-HR-lifts-Astros-Mariners.html",
    "content": [
        "Kyle Tucker hit a tiebreaking, two-run homer in the ninth inning as the Houston Astros defeated the host Seattle Mariners 6-4 Friday night in the first meeting of the season between the American League West rivals.",
        "Yordan Alvarez hit a towering three-run shot for the Astros, who snapped a two-game skid and halted the Mariners' four-game winning streak.Astros reliever Bryan Abreu (1-0) got the victory and Ryan Presley worked the ninth for his fourth save of the season.Jose Abreu led off the ninth with a walk off Mariners reliever Matt Brash (3-3). Tucker then hit a 3-2 pitch over the wall in center field to put Houston ahead.Alvarez broke a scoreless tie in the third inning. Jake Meyers led off with a double to left field and advanced to third on a sacrifice bunt by Martin Maldonado. After Mauricio Dubon struck out, Alex Bregman drew a two-out walk to bring up Alvarez. He hit an 0-1 pitch that just cleared the fence in right-center field.The Astros added to their lead in the fourth after Tucker led off with a double to right. Jeremy Peña reached on an infield single, sending Tucker to third. Pena was thrown out trying to steal second, with Tucker scoring on the play to make it 4-0.The Mariners rallied in the fifth. Cal Raleigh and Teoscar Hernandez led off the inning with singles to right. With one out, Raleigh advanced to third on a wild pitch before Taylor Trammell walked to load the bases. Kolten Wong lined a bases-clearing double to right-center to pull Seattle within a run.",
        "The Mariners tied the score with a two-out rally in the eighth off Abreu. Ty France grounded a single into right and Jarred Kelenic followed with a single to right-center, sending France to third. Eugenio Suarez grounded a run-scoring single to right to make it 4-4.Both starting pitchers went seven innings.Astros right-hander Cristian Javier allowed three runs on three hits, with two walks and eight strikeouts.Seattle's Luis Castillo gave up four runs on five hits. The right-hander walked one and struck out five.--Field Level Media"
    ]
}