{
    "articleURL": "/wires/ap/article-12055311/Hurdles-no-challenge-Jets-rookie-Zack-Kuntz.html",
    "content": [
        "FLORHAM PARK, N.J. (AP) - Zack Kuntz has had no trouble clearing hurdles along his journey to the NFL.",
        "Literally.The 6-foot-8 New York Jets tight end was only an inch or two shorter than he stands now when he was competing for the track team at Camp Hill High School in Pennsylvania. And he absolutely dominated the hurdles.\"State champion,\" the seventh-round draft pick proudly pointed out with a smile after the Jets' rookie minicamp practice Saturday.He sure was, winning the Pennsylvania state class AA championship in the 110-meter event in 2017. And at his height, he certainly stood out among the comparatively shorter athletes.\"Very different body type for me out there,\" Kuntz said. \"But I always used my speed and obviously the hurdles aren't much of an obstacle for me.\"",
        "And that had some ribbing Kuntz about his height - and how the hurdles should be raised for him.\"I would just tell them, `Why don´t you just grow a couple of inches?'\" a grinning Kuntz said.For as long as he can remember, Kuntz has always been, as he says, \"super tall.\"\"In eighth grade, I was like 6-5 and in seventh grade I was dunking on kids in middle school ball,\" he recalled. \"Everybody has that kind of Bambi phase, where, you know, you´re growing into your body. My feet grow and I´m tripping over myself and things like that. I´ve always been tall. In high school, I was probably 6-6, 6-7, right at that 6-8 bar.",
        "\"Now, I think I´m done growing now - hopefully.\"But he always used his size to his advantage. Kuntz also played basketball in high school, but football quickly became his first love.\"I was fortunate to be pretty good at both of them,\" Kuntz said. \"But football, in the end, is just way more fun to play.\"He got some looks from colleges who were interested in having him play basketball for them, but Kuntz made it clear he preferred the gridiron over the hardwood. He ended up staying close to home, going 90 minutes north to Penn State.Kuntz, who now weighs 251 pounds, said he was basically \"skin and bones\" went he got to college and acknowledged it took some time for him to develop physically along with his football abilities at the college level.\"In high school, you´re asked to just go be a better athlete than everybody else and more times than not, you´re able to do that,\" Kuntz said. \"But (college) really helped me learn the ins and outs of the game.\"He had just one catch in 21 games at Penn State before he transferred to Old Dominion, where he broke out in his first season there with 73 catches for 692 yards and five touchdowns in 13 games while also being selected to the first-team All-Conference USA in 2021.",
        "Suddenly, Kuntz found himself on the radar of pro teams because of his height and speed combination, along with an ability to make big catches.But an injury to a kneecap that required surgery last November limited him to just 12 catches for 144 yards and two TDs in five games last season, and it clouded his prospects for playing in the pros.He recovered quickly, though, and was able to perform at the NFL combine in Indianapolis in February - and was impressive.\"He tested through the roof,\" Jets general manager Joe Douglas said. \"So we were sitting there at the top of the seventh round and just going through some of the guys who just had that `freak factor´ to him and he was right there at the top. The size, the speed, the length, the jump - just everything.\"With the Jets, Kuntz joins a tight ends room that includes veterans C.J. Uzomah and Tyler Conklin, and Jeremy Ruckert, a third-rounder last year. He models his game after the Patriots' Mike Gesicki, a 6-6, 250-pound former Penn State star who holds the Nittany Lions' receptions record for tight ends and was drafted by Miami in 2018.\"He´s an athletic freak, as everybody knows,\" Kuntz said. \"There´s certainly traits of his game that I love to say I kind of exhibit in mine.\"",
        "Kuntz is from the same south-central Pennsylvania area as Mickey Shuler, arguably the greatest tight end in Jets franchise history. Kuntz recently stopped at a car wash owned by the two-time Pro Bowl selection and bumped into Shuler, who told him to always just be himself and learn from the veterans.\"I´m the new guy around here,\" Kuntz said, \"so I´m just going to do everything I can to learn and add value and help us win some games.\"AP NFL: https://apnews.com/hub/nfl and https://twitter.com/AP_NFL"
    ]
}