{
    "articleURL": "/wires/ap/article-12049455/Trump-accused-court-rape-Will-matter-2024.html",
    "content": [
        "E. Jean Carroll testified in sometimes searing detail about the day she says Donald Trump raped her in a department store dressing room two decades before he became president, allegations the Republican has repeatedly and vehemently denied.",
        "Taking the witness stand in support of Carroll this week, two friends told jurors that they spoke with the former magazine columnist shortly after the alleged 1996 attack, and that they believe she is telling the truth. Other women testified about separate encounters; one said Trump grabbed and groped her while they were on a flight in the late 1970s, the other told jurors he forcibly kissed her at his Florida home in 2005.The accounts, shared during the civil trial on Carroll's claims of battery and defamation against Trump, mark the first time that any of the numerous allegations of sexual misconduct against the former president have been heard in a court trial. Given a chance to rebut Carroll's accusations on the witness stand, Trump declined to make an appearance, instead traveling overseas. He told reporters in Ireland that he may still testify in person, though his attorney said in court that he will not and that they will not present other witnesses.For most politicians, the allegations laid out in a New York courtroom would be enough to torpedo any future aspirations. But Trump isn't the average politician, a fact that became clear when he won the 2016 presidential contest a month after the release of an \"Access Hollywood\" tape in which he boasted about sexually assaulting women and said that as a star, \"you can do anything.\"",
        "Now, as Trump campaigns for a 2024 presidential bid, the Carroll case provides another test of Trump's ability to survive scandals that would sink others. Some political observers say the public already has hardened opinions of the former president - love him or hate him - and that claims about him abusing women aren´t new.\"At this point, the American people have a pretty good sense of Donald Trump´s character, so it is unlikely that the Carroll trial will change many voters´ minds,\" said Christina Wolbrecht, a political science professor at the University of Notre Dame who studies politics and gender.",
        "She said a more relevant question is whether a verdict against Trump in this trial, or convictions in other cases, will scare away potential donors or advisers.In addition to the Carroll case, Trump was recently charged in New York with 34 felony counts of falsifying business records in a hush-money scheme to cover up allegations of extramarital affairs during the 2016 campaign. He is also under criminal investigation over his attempts to overturn his 2020 election loss and his retention of classified documents after leaving office.Democratic pollster Celinda Lake, who has worked with President Joe Biden, said that during recent focus groups she's been conducting with Democratic and independent likely voters on Trump and his legal troubles, women kept volunteering that the case they were most troubled by is \"the rape case.\" That has left Lake thinking the trial testimony could be more damaging than she initially assumed.",
        "\"I was flabbergasted, because I thought this was baked in\" to how voters feel about Trump, Lake said. \"They knew he didn´t respect women and that he was a real playboy, but rape is different.\"Steven Cheung, a spokesperson for Trump´s campaign, did not respond to a message seeking comment for this story.Trump's other legal issues have so far brought limited political fallout, but that could change, according to a poll last month by The Associated Press-NORC Center for Public Affairs Research.It found only 4 in 10 U.S. adults believe Trump acted illegally in the New York hush-money case. About half of voters believe he broke the law in Georgia, where he is under investigation for interfering in the 2020 election vote count, the poll found.It also showed about half feel similarly about Trump's role in his supporters' storming of the U.S. Capitol on Jan. 6, 2021, and his handling of classified documents found at Mar-a-Lago. The poll did not ask about the Carroll case.Carroll filed a defamation suit against Trump while he was still president, over denials and insults he made about her. She filed the rape claim in November, under a New York state law that temporarily allows sexual assault victims to sue over alleged attacks that happened even decades ago. Because it is a civil and not criminal case, Trump faces no prison time; Carroll is seeking unspecified monetary damages.",
        "Jurors did see parts of a recorded deposition in which Trump answered questions under oath last fall. He called Carroll a \"nut job\" and \"mentally sick,\" adding, \"She said that I did something to her that never took place.\" The jury also was shown the \"Access Hollywood\" tape.Trump, his attorneys and his supporters have dismissed Carroll´s allegations as politically motivated attacks and an attempt to sell more copies of her memoir. Trump has said he wasn´t at the department store with Carroll and had no clue who she was when she first aired the story publicly. On his social media network last week, Trump called the case \"a made up SCAM.\"At trial, Trump´s attorney also questioned why Carroll didn´t report the alleged assault to police at the time; Carroll, 79, said many people her age were conditioned to keep quiet about such attacks. Carroll, a registered Democrat, also testified that she voted for Trump´s Democratic opponents in 2016 and 2020 but said that has nothing to do with her lawsuit.Rachel O'Leary Carmona, executive director of Women's March, said she is hopeful that Carroll's case will mobilize voters. After Trump's election, millions of people turned out to protest him at women's marches across the country, and the events have been credited with sparking increased political involvement by women, including seeing a record number of women elected to the U.S. House in the 2018 midterms.",
        "\"I hope that we can take this moment as another proof point of the absolutely dire, critically dire need to build women´s political power in this country,\" she said.The Associated Press typically does not name people who say they have been sexually assaulted unless they come forward publicly, as Carroll has done.___Associated Press writer Michelle Price in New York contributed to this report."
    ]
}