{
    "articleURL": "/sport/boxing/article-12047123/Amanda-Serrano-takes-Heather-Hardy-Jake-Paul-clashes-Nate-Diaz-Dallas-August.html",
    "content": [
        "Serrano, 34, came out on top against Hardy, 41, to claim the WBO title in 2019The fight will take place before Paul fights Diaz at the American Airlines center DailyMail.com provides all the latest international sports news Amanda Serrano is set for a rematch against an old rival, taking on Heather Hardy in the co-main event of the Jake Paul vs Nate Diaz card on August 5 in Dallas, Texas. ",
        "After earning the WBO featherweight from Hardy nearly four years ago, Serrano will put all her belts on the line and defend her undisputed title for the first time against the former title holder. The 10-roundfight will take place at the American Airlines Center, home of the NBA's Dallas Mavericks. Serrano, the first Puerto Rican undisputed world champion, started her current title reign at featherweight by defeating Hardy in a brutal 10-round fight in 2019 to win the WBO belt.The 34-year-old steps back into the ring after winning a blood-soaked bout against WBA featherweight champion Erika Cruz in February, making her the undisputed featherweight champion but also left her with a hand injury that led to her with no choice but to cancel her much anticipated rematch with Katie Taylor. Serrano's decisive win against Cruz followed her previous win over Sarah Mahfoud in Manchester, England that added the Dane's IBF title to her WBO, WBC, and IBO featherweight belts.",
        "Her resounding clash against Katie Taylor at Madison Square Garden in 2022 earned recognition as Sports Illustrated's Fight of the Year. Taylor defeated Serrano by split decision.'I am the undisputed featherweight champion today because Heather Hardy agreed to fight me in 2019 for her WBO title,' said Serrano. 'That was the first step in my current run at featherweight. ",
        "'It's only right that I give her the opportunity to earn it back. I'm excited to once again share the card with Jake and put on an exciting war. This will be the first time I get to fight in Texas, and I promise the fans that they will not be disappointed.' Hardy, a Brooklyn-native, is out to seek revenge against the fighter who knocked her off the summit of women's boxing after claiming the WBO title in 2018 and 2019. The 41-year-old made her professional debut in 2012, claiming the vacant WBC international super bantamweight title in 2014. Two years later, she won the WBC international featherweight title and became one of the biggest draws in boxing. Since losing to Serrano in 2019, Hardy has battled back towards the top, recently defeating Brazil's Taynna Cardoso in her last fight in February. ",
        "'I'm beyond grateful for this opportunity,' said Hardy. 'In 2021, I came back to boxing with a renewed passion for the sport. My late trainer told me, the day before he died, that 2023 would be my year. Now, I have the opportunity to prove him right and become an undisputed champion. 'Thank you to Amanda and team for keeping their word on giving me the rematch, but come fight night, I only have winning on my mind and stealing the show from Jake Paul and Nate Diaz.' ",
        "Most Valuable Promotions, founded by Jake Paul and Nakisa Bidarian, and Real Fight, Inc., founded by Nate Diaz, are partnering to bring the bout to global audiences as Paul and Diaz battle it out as the main event of the night at the American Airlines Center. The event will be distributed and co-produced globally by DAZN PPV and made available on all devices, platforms, cable, and satellite PPV providers around the world. "
    ]
}