{
    "articleURL": "/wires/pa/article-12056445/Elie-Youan-frustrating-real-threat--Hibs-boss-Lee-Johnson.html",
    "content": [
        "Hibernian manager Lee Johnson hailed Elie Youan’s work-rate in Saturday’s 2-1 victory over St Mirren, although he admitted the unpredictable forward can leave him tearing his hair out in frustration at times.",
        "The 24-year-old – on loan from Swiss side St Gallen – scored his seventh goal of the season after just four minutes and had supporters in raptures with his willingness to track back and make tackles.“We expect that from our wingers,” said Johnson. “You’ve got to work hard. I’m pretty critical when they don’t, so when they do it’s fantastic.“We call it (being) a ball thief when they nick it on the way back in. Elie’s earned his rest over the weekend because of the physical effort he put in, and that’s what Elie has got to do.“He can frustrate the life out of us at times – I’m sure he even frustrates you guys (reporters), who are impartial – but he’s also got that real threat about him and can peg a team back and he can run all day.“He’s still young and he’s got quite unique attributes so we just need to keep developing him.”",
        "Hibs are keen to sign Youan permanently, and Johnson admits if the attacker was able to hit his best form consistently, he would be out of their reach.“If he put it all together we wouldn’t have him,” he smiled. “That’s what we’ve got to try and do before we sell him!",
        "“It’s difficult for me to talk about his contract but we do have an option to buy. Every negotiation is different. Some are done in advance and then put in a drawer, and some still need to be done. Obviously that’s not my bag, that’s for the CEO to deal with.”Will Fish scored Hibs’ second before Alex Greive hit back for the Buddies who were unable to force an equaliser despite piling on the pressure in the closing stages.The defeat saw Saints slip three points behind the fifth-placed Hibees in the battle for European places. Stephen Robinson’s men host fourth-placed Hearts next Saturday.Robinson of his team’s Euro prospects: “They aren’t as good as they were before the game. You can pull that back very quickly, there are 12 points still to play for.“We’ve got Hearts at home next week and we’ve been very good at home. We need to press more aggressively than we did in the first 20 minutes (against Hibs) and hope and pray we don’t make individual errors.”"
    ]
}