{
    "articleURL": "/wires/ap/article-12053221/Tatum-Brown-spark-Celtics-past-76ers-114-102-Game-3.html",
    "content": [
        "PHILADELPHIA (AP) - Scrambling for a loose ball late in the fourth quarter and the outcome of Game 3 still in the balance, Grant Williams was accidentally stomped face-first into the court by Joel Embiid's wayward foot.",
        "Much like the Celtics after their Game 1 debacle, a bloody, shaken Williams absorbed the beating and came back to help stick it to the suddenly shaky 76ers.\"That was kind of nasty,\" Celtics guard Jayson Tatum said.So, too, is what the Celtics have done to Embiid, James Harden and the rest of the Sixers while seizing control of the series.Tatum scored 27 points, Jaylen Brown had 23 and Boston spoiled Embiid's MVP coronation, beating Philadelphia 114-102 Friday night to take a 2-1 lead in the Eastern Conference semifinal series.Game 4 is Sunday in Philadelphia.",
        "Williams didn't score a point in 23 minutes, but his toughness in shaking off the sneaker to the back of his head symbolized the way Boston has continued to fight after a Game 1 embarrassment.\"I was like, ´Dang, I really got curb-stomped,'\" Williams said. \"I'm just thankful he didn´t like fully just lean his weight onto it. He definitely got me pretty badly. But then I think he felt that he landed on something, so he picked his foot up. It hurts a little bit.\"Embiid had 30 points and 13 rebounds in his second game back from a sprained right knee after receiving his MVP trophy in a pregame ceremony.Boston gave 76ers fans little reason to cheer again.",
        "The Sixers pulled within five on De´Anthony Melton´s 3-pointer to get the crowd back into the game for all of 20 seconds before Malcolm Brogdon countered with a 3 to give Boston a 100-92 lead. Al Horford crushed the Sixers again - as he has most of his career - when he buried a 3 for a seven-point lead.Embiid, forced to try and win it alone without any serious offensive help, missed a pull-up 18-footer and Tatum drained a jumper that all but put the game away. Tatum hit one more 3 for good measure and the Celtics won their second straight.\"We just held the ball too long, too much,\" Embiid said. \"We don't start our actions fast enough. That's why it looks so slow. We're not scoring the ball. We're not making shots.\"Embiid was flanked by his parents and teammates as he received the MVP trophy from NBA Commissioner Adam Silver before Game 3. Sixers fans roared as Embiid hoisted the trophy high over his head. Then the moment turned touching. Embiid´s young son, Arthur, ran onto the court and into the arms of his father.Embiid held his son, who wore a \"My dad is the MVP\" T-shirt, and wiped tears from his eyes as fans chanted \"MVP! MVP!\"",
        "\"Honestly, he´s the main reason why I´m really here,\" Embiid said. \"Becoming a father really changed my whole life. I just wanted to show him a good example.\"The good times didn´t last long.Boston spiked any emotional carryover from the ceremony and raced to a quick 10-point lead.The Sixers spent the rest of the game playing catch-up. All the energy spent to come back and take brief leads quickly evaporated and the Celtics snagged them right back.Embiid gamely tried to carry the Sixers on one good knee, but got almost no help from Harden and Tyrese Maxey. Harden´s 45-point effort in a Game 1 upset in Boston seemed more an aberration than a sign of things to come. Harden followed his 2 of 14 in a Game 2 loss with 3-for-14 shooting for 16 points.Harden's 5-for-28 shooting the last two games is the worst for him over any two-game span in his career, regular season or playoffs, in which he´s attempted at least 20 field goals.\"We´re just trying to make him work as much as we can,\" Celtics coach Joe Mazzulla said. \"Trying to keep him off the free-throw line. Guys are just working to take away those details.\"Harden failed to pick up the Sixers in the third, when he could have changed the game.",
        "He did hit P.J. Tucker for a 3 that pulled the Sixers to 74-72. Harden then missed two straight jumpers and fouled Brown on a tough layup. Brown made the free throw and the Celtics were back up by eight.Harden oddly passed up plenty of easy looks and layups and also committed five turnovers.Embiid had scored 53 points against the Celtics in an early-April matchup, but could never get cooking in Game 3. The Celtics double-teamed Embiid from the jump and he looked gassed by the end of the third. Without a teammate he could trust to make shots, Embiid took the scoring load on himself and scored 12 points in the third when he played the entire quarter.\"I didn't get the ball enough,\" Embiid said. \"Not to score, but also to make plays for my teammates. They had a tendency of doubling quite a bit tonight, so I thought we could have used that to our advantage. When we did, we also missed a lot of wide-open 3s.\"TIP-INSCeltics: Tatum added 10 rebounds. ... Boston 16 of 45 3-pointers.76ers: Made 12 of 12 free throws in the first quarter. ... Made 16 of 37 3s.___AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP_Sports"
    ]
}