{
    "articleURL": "/wires/aap/article-12040519/Koala-poo-clues-marsupial-brink.html",
    "content": [
        "For most people, the topic of poo isn't one to be too enthusiastic about.",
        "But for wildlife campaigner Josey Sharrad it's something to celebrate.Finding koala poo among recently planted trees across the NSW coast is a sign the species could be brought \"back from the brink\" she says.\"There's a lot to get excited about,\" she told AAP.\"You can tell so much from one golden nugget of koala poo.\"Ms Sharrad and her team at the International Fund for Animal Welfare joined forces with Bangalow Koalas two years ago to plant more than 20,000 trees in the NSW Northern Rivers region.These 'koala corridors' are hoped to reconnect patches of koala habitat to provide safe passage for the animals in areas where they are at risk from human activity, cars or predators.So far 22,365 trees have been planted across six properties which form part of the Bangalow Koalas Community Wildlife Corridor.One property has already shown signs of koala use.\"Poo is a good sign,\" Ms Sharrad said.\"Koalas are so elusive and difficult to find, but poo is easier to spot.\"The koala deposits also provide \"a whole world\" of data for researchers.Koala scats and scratches on trees were found on the Bangalow site as well as evidence of echidnas and native birds.\"This is why we do this work,\" she said.",
        "\"When you are up at the top of a hill ... you can see the corridor. You just think, 'it's worth all the blood, sweat and tears, and we are making a real change for the future.\"Seeing the presence of koalas on trees so young gives us hope that we can bring them back from the brink.\"The corridors provide a lifeline to the native marsupials, creating a safe passage for the animals to roam.\"Planting or cutting down a tree can mean a matter of life and death,\" Ms Sharrad said.\"Koalas are up against it. The places they call home are shrinking drastically as humans encroach on their habitat and extreme weather destroys what is left.\"The wildlife advocate called for stronger protection of koala habitats and to stop cutting down the trees they call home.\"This will ensure a future where koalas are seen beyond the gates of a zoo,\" she said.The koala is in crisis, despite being a national and international icon, the Bangalow Koala charity says.Excessive land clearing destroys forest habitat and forces koalas to live in urban areas while deadly encounters with cars, dogs and disease threaten their day-to-day survival.But there's hope.Bangalow Koalas, the International Fund for Animal Welfare and 550 volunteers have created 15.4 hectares of habitat in the Byron Shire area alone through tree-planting projects.",
        "\"It really doesn't get much better than planting bare paddocks and watching them grow into forests,\" the charity said."
    ]
}