{
    "articleURL": "/wires/reuters/article-12041401/Journalist-Ryanair-plane-diverted-Belarus-jailed-8-years--state-media.html",
    "content": [
        "By Caleb Davis",
        "May 3 (Reuters) - A Belarusian journalist who was arrested after being hauled off a Ryanair plane that was forced to land in Minsk almost two years ago was sentenced on Wednesday to eight years in jail on charges of conspiring against the state.Roman Protasevich, 27, was found guilty of a range of offences including organising mass disturbances, inciting acts of terrorism and slandering President Alexander Lukashenko, the Belta state news agency said.He had worked as a journalist at the news outlet Nexta, which reported extensively on mass protests against Lukashenko in 2020 following an election that the opposition and Western governments denounced as rigged.Nexta's founder Stsiapan Putsila and former editor Yan Rudik were sentenced in absentia by the same court to 20 and 19 years respectively. Belarus declared Nexta a \"terrorist organisation\" last year.The circumstances of Protasevich's arrest in May 2021 prompted international outrage and triggered European Union sanctions against Lukashenko.He had been flying from Greece to Lithuania when Belarusian air traffic control diverted the flight to Minsk on the false pretext of a bomb threat. He was arrested and detained along with his Russian then-partner, Sofia Sapega, who was sentenced to six years and is now set to be transferred to serve her term in Russia.",
        "Prosecutors had accused the three defendants of at least 1,586 crimes, including \"conspiracy to seize state power\", calling for sanctions against Belarus and \"creating or leading an extremist group\".Exiled opposition leader Sviatlana Tsikhanouskaya called the trial \"fake\". She noted that the verdicts were issued on World Press Freedom Day, tweeting that Protasevich had been \"the regime's hostage since the Ryanair hijacking\".After his arrest, Protasevich was shown on state television tearfully confessing on state television to involvement in anti-government protests and plotting to topple Lukashenko. The exiled Belarus opposition said the admissions were false and had been coerced.Video from state media showed him declining to answer questions from journalists in court about whether he would appeal.(Writing by Caleb Davis; editing by Mark Trevelyan and Kevin Liffey)"
    ]
}