{
    "articleURL": "/tvshowbiz/article-12049761/Kaley-Cuoco-reunites-8-Simple-Rules-sister-Amy-Davidson-LA-benefit-John-Ritters-charity.html",
    "content": [
        "New parents Tom Pelphrey and Kaley Cuoco hired a babysitter and glammed up to attend the John Ritter Foundation for Aortic Health's 20th Anniversary Evening From The Heart at Avalon Hollywood on Thursday.",
        "The 37-year-old SoCal native covered her post-baby body in a pink Philosophy blazer dress, chrome Christian Louboutin heels, and Shay jewelry selected by styling duo Brad Goreski and Daniela Viviana Romero.Hairstylist Marilee Albin coiffed Kaley's messy ponytail for the benefit where tickets ranged between $500-$1K.Make-up artist Jamie Greenberg made sure Cuoco was ready for her close-up at the charity event.The three-time Emmy nominee was wearing several rings, including one on her engagement finger, as she posed with her black-clad 40-year-old babydaddy.",
        "'Kaley and Tom aren't in a hurry to tie the knot, they're committed to each other and to their family and that's enough for them right now,' an insider told Us Weekly on Thursday.'Kaley doesn't want to be married again, but Tom is so kind and supportive, friends think they could end up getting engaged and having a very small wedding, but not anytime soon.'Here's hoping Kaley and Tom's relationship with lasts longer than her 21-month marriage to pro tennis player Ryan Sweeting and three-year marriage to equestrian Karl Cook.It's hard to believe it's only been five weeks since Cuoco and Pelphrey welcomed their daughter Matilda Carmine Richie Pelphrey, and only one year since they met at the Manhattan premiere of Netflix's final season of Ozark.",
        "The Priceline brand ambassador reunited with her 8 Simple Rules co-star Amy Davidson and Amy Yasbeck, the widow of their late co-star John Ritter who died, aged 54, in 2003 from aortic dissection.Kaley and the flame-haired 43-year-old famously played the beloved Emmy winner's teenage daughters Bridget and Kerry Hennessy in the NBC sitcom from 2002-2005.'To this day, if anyone asks me [about] John Ritter, I get this chill because I love him so much,' Cuoco recalled in the Reelz documentary John Ritter: Behind Closed Doors in 2018.'He sat down on the couch and he goes, \"I love you.\" And I was like, \"I love you too, silly man!\" And he goes, \"No, I want you to know, I love you.\" And I said, \"I love you too.\" And then he goes, \"That's it\" and he gave me a hug and that's the last time I saw him.'",
        "The Flight Attendant producer-star, Davidson, and the 60-year-old retired actress happily posed with What Happened to My Sister star Ashley Jones.Amy D. opted for a midi-sleeve green ruched dress while Amy Y. - best remembered for Robin Hood: Men in Tights - looked fabulous in a purple cut-out pencil dress.Yasbeck was also joined on the black carpet by Holiday Heritage actress Holly Robinson Peete wearing a red off-the-shoulder maxi-dress.",
        "Thanks to some delectable auction items, the John Ritter Foundation raised over $308K of a $400K goal towards raising awareness of thoracic aortic aneurysm and dissection through research, education, and advocacy.John's brother Tom Ritter, his son Tyler Ritter, and Tyler's wife Lelia Parma were also there representing the family and his legacy.Amy seemed especially close to Better Call Saul star Patrick Fabian, who sweetly arranged for the cast and crew to autograph his character Howard's NAMAST3 license plate for the auction.Five-time Emmy nominee Amy Brenneman went make-up free and dressed down in a black beanie, grey overcoat, pink-patterned blouse, black leather pants, and boots.Suiting up for the charity function were Chicago Med star Steven Weber and Emmy winner Dan Bucatinsky.",
        "Fans can catch more of Kaley as Ava Bartlett opposite Chris Messina in Craig Rosenberg and Jason Bateman's eight-episode serial killer comedy Based on a True Story, which premieres June 8 on Peacock.Cuoco has also been hard at work providing her voiceover for the upcoming fourth season of Paul Dini and Bruce Timm's adult animated series Harley Quinn on HBO Max.The Meet Cute producer-star executive produces and voices the titular character, who has the distinction of being one of the few out and proud bisexual characters from DC Comics."
    ]
}