{
    "articleURL": "/sport/football/article-12052871/Napoli-chief-Aurelio-Laurentiis-says-no-way-sell-Victor-Osimhen.html",
    "content": [
        "Victor Osimhen is thought to be the subject of significant interest this summerNapoli striker has been influential in ending their 33-year Serie A title droughtManchester United are reported to be one of those clubs interested in him Napoli chief Aurelio De Laurentiis has insisted the club will not sell star striker Victor Osimhen this summer in the face of significant interest from across Europe.",
        "Osimhen, 24, has been one of the club's most influential players this campaign as they ended a 33-year Serie A title drought. The Nigerian scored the crucial equalising goal at Udinese on Thursday which confirmed the title, though his goals and general performances had long meant it was an inevitability. The Nigeria international has scored 22 goals in 27 league appearances this season, only serving to heighten speculation surrounding his future with a host of Europe's top clubs said to be interested in acquiring his services this forthcoming summer.However, the infamously difficult to deal with De Laurentiis has offered a warning to those who feel they will be able to sign him, insisting the club would not allow him to depart this summer. 'I will not sell Victor Osimhen this summer - no way!' he told Cinque Minuti.",
        "It is another indication of the trouble some clubs might have this summer in attempting to pick apart Napoli's title-winning side.Speculation has linked Osimhen and his team-mate Khvicha Kvaratskhelia with big money moves away this summer, while Min-jae Kim and Stanislav Lobotka, among others, are also said to be the subject of interest from abroad.De Laurentiis, who has owned Napoli since the club went bust in 2004, has developed a fierce reputation over the years for his no-nonsense approach to negotiations and the often sky-high prices he demands for the club's top talent.",
        "Kalidou Koulibaly, it is believed, was long denied a move away from the club owing to the figures De Laurentiis mooted to those who expressed an interest. Manchester United are said to be one of those interested in Osimhen, with Erik ten Hag having made no secret of his desire to add quality to his squad this summer.It is believed Osimhen would cost upwards of £100m, with his asking price potentially as high as £150m. His contract runs until 2025, meaning Napoli have an upper hand in any negotiations that might take place. The club have expressed significant interest in Tottenham's Harry Kane in recent weeks amid chaos at the north London club, though Daniel Levy is cut from the same cloth as De Laurentiis in being a difficult person to negotiate with.Osimhen's Nigeria coach Jose Peseiro, however, believes the club might have a tall order on their hands trying to hold onto him.\"Everyone wants to buy one like this, it won't be easy for Napoli to keep him in the summer,' Peseiro told Tuttomercatoweb",
        "'If the Azzurri rightly ask for millions for his price tag, I am convinced that there will be several clubs willing to meet their high demands. This Osimhen would be a starter in any team in the world'.",
        "De Laurentiis, meanwhile, will strive to end speculation surrounding the future of manager Luciano Spalletti.'He's a legend I've been chasing for at least ten years,' he said. 'I finally brought him to Naples after the Covid crisis and I hope to open a cycle with him, because he is a great leader. 'I exercised the clause for the renewal of the contract, now it's up to him to say the word... Luciano declared that he fell in love [with Naples], here he has become a hero and it is right that he enjoys it.'"
    ]
}