{
    "articleURL": "/wires/reuters/article-12047359/Sacked-Leeds-manager-Gracia-defends-record-calls-stability.html",
    "content": [
        "May 4 (Reuters) - Former Leeds United manager Javi Gracia has defended his record at the relegation-threatened club and called for greater stability in the Premier League after being sacked and replaced by Sam Allardyce until the end of the campaign.",
        "Leeds are 17th in the table with 30 points, only above 18th-placed Nottingham Forest, who currently occupy the final relegation spot, on goal difference with four games remaining.The 53-year-old Spaniard's dismissal took the number of managerial changes in the top-flight to 13 this season.\"I do think to be able to do a good job, greater stability is needed,\" Gracia told The Athletic, adding that he was sacked over a phone call on his birthday. \"It is more healthy and you are able to show your best work.\"I analysed the games we played a lot and we competed with the teams around us. We got 11 points in my 11 matches, while Everton got eight points, Leicester City and Southampton took six and Forest five. So everyone else down there got fewer.\"Of course, we were in a moment during the last few games that was not what we hoped, but from another point of view, other teams were doing worse than us. So you can be optimistic in some way.\"Gracia, the second Leeds manager to be sacked this season after they parted ways with American Jesse Marsch in February, lasted two-and-a-half months at the Elland Road.\"When we arrived, we were 19th in the table. In my first training session we had 11 players injured and we trained with 10 healthy outfield senior players. This was not easy,\" he added.",
        "\"Bit by bit, we got some players back and the team grew. But the inflexion point was (the 5-1 home defeat) against Crystal Palace (on April 9).\"Since then Leeds have picked up just one point from four games, conceding 13 goals and scoring four having been thumped 6-1 at home by Liverpool and 4-1 at Bournemouth. (Reporting by Pearl Josephine Nazare in Bengaluru; Editing by Ken Ferris)"
    ]
}