{
    "articleURL": "/tvshowbiz/article-12057643/Jennifer-Lopez-shows-fans-signature-Bronx-goddess-glow-new-skincare-tutorial.html",
    "content": [
        "Jennifer Lopez showed fans how to get her signature 'Bronx goddess glow' on Sunday when she posted a new makeup-free skincare tutorial on Instagram.",
        "The 53-year-old superstar –  who recently gushed about Ben Affleck's skills as a father – used her own JLO Beauty product line in the video, which she posted to the brand's Instagram account. Captioning the post, Lopez wrote: 'Throwing it back with that Bronx Goddess Glow ✨ Skin prep with @JLoBeauty and then I tie it all together with a little lip gloss and my signature hoops.'Sheathed in a luxurious monogramed bathrobe, the Let's Get Loud hitmaker kicked things off with a fresh face of radiant skin. 'So a lot of you have asked what is my signature, quick, five-minute go-to look, well I call it the Bronx goddess glow and it's four easy steps.'",
        "The pop star began by applying her JLO Beauty serum and explained that her 'Bronx goddess glow' is perfect for a casual night out with girlfriends. 'This is for when you need to do something really quick for a fun girl's night out, you don't wanna be too fussy, you're not trying to impress nobody, just trying to look your best.'Jennifer then applied some of her 'blockbuster' moisturizer before adding some eye cream to her lower lids, chin and frown lines. A hint of Lopez's 'complexion booster' was added to her contour areas and a dab of 'pink champagne' face highlighter added some extra magic.",
        "The megastar finished off her dewy look with a bit of lipgloss: 'A little lipgloss never hurt anybody.'Mascara made her long lashes pop with definition and the final must-have was Jennifer's beloved hoop earrings.'This is not optional,' she declared while adorning her ears with a pair of giant hoops. 'Bronx beauty... you gotta have your hoops.'Smoothing down the baby hairs on the edge of her hairline, the Hustlers star added: 'If you really wanna take it to the next level, just lay down those baby hairs just a little bit.' ",
        "In another makeup-free tutorial posted earlier this week, Jennifer showed off some of her beauty hacks, like using $8 KISS fake eyelashes from a drugstore.The songstress preached about the importance of hydration before prepping her skin for the Met Gala. In the video she also shared that she never sunbathes but uses plenty of fake tanning cream and bronzer. Jennifer's show-stopping Met Gala look was without the major accessory of her husband Ben Affleck, who had 'work commitments he could not get out of' in Los Angeles. "
    ]
}