{
    "articleURL": "/wires/afp/article-12059147/Taiwan-talks-500-mn-weapons-package-US-defence-minister.html",
    "content": [
        "Taiwan is expecting a fast-tracked $500 million weapons package from Washington this year to make up for delays in arms procurements, the island's defence minister said on Monday.",
        "The self-ruled, democratic island lives under constant threat of an invasion by China, which claims Taiwan as part of its territory to be seized one day -- by force if necessary.With Beijing increasing its sabre-rattling towards the island, Taiwan's key ally the United States in September approved the Taiwan Policy Act -- which would see new legislation provide billions in military aid to Taipei.But there have been reported delays in delivering weapons, and Taiwan's Defence Minister Chiu Kuo-cheng on Monday confirmed that Washington has been discussing a separate -- and fast-tracked -- weapons package with Taipei.\"The use of the $500 million package is aimed at prioritising supplying us with spot goods (available for immediate delivery) over any delay or late delivery in our arms procurement,\" Chiu told lawmakers when questioned in parliament about the \"military aid\" package.\"It should be implemented this year,\" he said, adding that the $500 million package \"is not counted into (previous) arms sales\" and that Taiwan would be asking first for its \"priorities\".However, he did not elaborate on what type of equipment would be prioritised in the $500 million weapons package, saying only that the details would be thrashed out by both sides soon.\"For the delayed arms sales, they will make up by providing some of their spot goods or simulators or training equipment,\" he said. \"So when the arms are delivered in the future, we can start using them right away.\"",
        "The United States has for decades sold weapons to Taiwan.But the decision in September goes a step further -- providing US security assistance to the tune of $4.5 billion over four years, a move that has infuriated Beijing.There have been some roadblocks in deliveries.Taiwan's defence ministry revealed last year it was looking for replacements after Russia's war in Ukraine led to a shortage of Stinger anti-aircraft missiles.Last week, the ministry announced it was notified by Washington that the first of the 66 advanced new F-16V fighter jets it had previously ordered from the United States would come \"out of the factory\" in the third quarter next year.This puts it almost a year behind schedule, and was blamed on pandemic-spurred supply disruptions."
    ]
}