{
    "articleURL": "/wires/afp/article-12059263/Ukraine-looms-Chinese-foreign-ministers-European-visit.html",
    "content": [
        "Chinese Foreign Minister Qin Gang will visit Europe this week, Beijing said on Monday, as China pushes to act as a mediator in the Ukraine conflict and rebuild ties with the continent.",
        "Beijing has sought to portray itself as a neutral party in Russia's war in Ukraine, with President Xi Jinping last month holding his first call with Kyiv's leader since Moscow's invasion.But recent comments by China's ambassador to France questioning the sovereignty of ex-Soviet states threw its neutral stance into question, and a position paper from Beijing on ending the conflict was met with scepticism by the United States and NATO.Qin's visit comes on the heels of several high-profile visits to China by European leaders, most notably French President Emmanuel Macron and German Foreign Minister Annalena Baerbock.He will hold meetings with counterparts from Germany, France and Norway from Monday to Friday, foreign ministry spokesman Wang Wenbin said.Qin and French counterparts are expected to hold an \"in-depth exchange of views on implementing the consensus reached by the two heads of state\" last month, he told a news briefing Monday.They will also \"promote the comprehensive strategic partnership between China and France to continuously reach new heights\", Wang said.The German foreign ministry confirmed Qin will hold talks with Baerbock in Berlin on Tuesday. Spokesman Christofer Burger told a regular news conference the Ukraine war \"is a very high foreign policy priority for us in all our talks\".Burger said Berlin believed \"China has an important role to play in this issue and, in this respect, it would not surprise me if this were to be raised again\".",
        "Officials in Paris said Qin will meet French Foreign Minister Catherine Colonna on Wednesday, and Norway's top diplomat said his visit on Friday would allow the nations to \"discuss issues relating to our common interests\".\"It is important to have a regular dialogue with China, which is one of the most important players in international politics and the world economy,\" Foreign Minister Anniken Huitefeldt said, adding Qin would also meet Prime Minister Jonas Gahr Store.- Balancing act -Qin's visit comes after Beijing restated that it respects the sovereignty of all former Soviet countries. This followed comments by Lu Shaye, China's envoy in Paris, that countries that emerged after the fall of the Soviet Union \"don't have effective status under international law\".His comments to French broadcaster LCI appeared to be referring not just to Ukraine, which Russia invaded in February 2022, but to all former Soviet republics that emerged as independent nations after the fall of the Soviet Union in 1991.EU foreign policy chief Josep Borrell said an explanation from Beijing had \"duly clarified\" the issue and that China was not calling into question the sovereignty of ex-Soviet states.Xi spoke with Zelensky by phone shortly after the furore over Lu's comments, a nearly one-hour discussion during which Xi reportedly advocated for peace negotiations.",
        "The call prompted Russian accusations that Ukraine was undermining efforts to end the fighting.Beijing's 12-point \"position paper\", released in February, was seen by many Western governments as skewed towards Russia. A friendly Moscow visit by Xi in March to meet Russian President Vladimir Putin also sparked widespread criticism.Beijing says it is neutral in the Ukraine conflict. Xi has never condemned the Russian invasion but the Chinese leader has come under increased pressure from Western nations to step in.Baerbock urged China to ask \"the Russian aggressor to stop the war\" in Ukraine during her visit to Beijing last month and said \"no other country has more influence on Russia\".She also said she had expressed concerns about human rights issues and warned of the dangers of escalating tensions with Taiwan.Her visit to the Chinese capital came a week after that of Macron and Ursula von der Leyen, the head of the European Commission, who also urged Beijing to play a greater role in resolving the crisis in Ukraine."
    ]
}