{
    "articleURL": "/sport/football/article-12042067/Odds-Frank-Lampard-SACKED-Chelsea-cut-just-6-4-bookmakers.html",
    "content": [
        "He became the first English manager to lose 10 successive games for 35 yearsThe Chelsea interim manager, 44, has lost all six of his matches since returningMauricio Pochettino is believed to be the favoured candidate following a searchOdds on Frank Lampard to be sacked by Chelsea have been cut to just 6/4 by the bookmakers.",
        "Lampard became the first English manager to lose 10 successive games in charge of a top-flight club for 35 years on Tuesday as his Chelsea side succumbed 3-1 at Arsenal.Chelsea's all-time leading goalscorer has lost all six of his matches since returning to become interim manager in the wake of Graham Potter's sacking.The 44-year-old might soon be replaced by Mauricio Pochettino, according to the latest Paddy Power odds.The former Tottenham boss is believed to be the favoured candidate following a three-week search led by co-sporting directors Paul Winstanley and Laurence Stewart.",
        "The scale of the job Chelsea's next permanent manager faces was spelt out by Lampard in his post-match assessment.'From what this season tells you, from start to finish, we have to find the reasons quickly,' he said.'It's not an overnight fix. The main answer is simple. We have to do the basics better and then we'll get some progress.'It's clear tonight for me. The first half is nowhere near good enough. But it's the reality. It's what I've come into.''We weren't good enough,' he continued. 'We were too nice to play against, too passive. In possession we weren't playing balls over their press, or winning second balls.'Chelsea have been a big success for 20 years domestically and in the Champions League, at the moment we're not in that position.",
        "'But from the moment I've been here it's been evident we're too nice as a team.'We can't change things overnight but we had better get there quickly because we have another game at the weekend and games to come.'"
    ]
}