{
    "articleURL": "/sport/football/article-12054163/Javier-Mascherano-PSG-fans-regret-criticising-Lionel-Messi-LUCKY-him.html",
    "content": [
        "The Argentinian, 35, was reportedly fined and suspended by the Ligue 1 leadersThe issue has highlighted a souring of the relationship between Messi and PSGMascherano said he doesn't understand why Messi has received such treatment PSG fans 'will regret' criticising Lionel Messi and they are 'lucky' to have the all-time great, Javier Mascherano has claimed.",
        "The Argentinian was reportedly fined and suspended by the Ligue 1 leaders after undertaking a promotional visit to the Middle East country without permission.The issue has highlighted an apparent souring of the relationship between the World Cup-winner and PSG, with reports since emerging that he is set to leave the club in the summer.Mascherano, a former international team-mate of Messi, said that he doesn't understand why the seven-time Ballon d'Or winner has received such treatment.'It's a pity for not realising they were lucky to have him on their team,' he told Ole. 'I think that 10 years ago, no Paris fan imagined that they could possibly have the best player in history on their team. ",
        "'And instead of enjoying it, they spent these two years criticizing him. In 10 years they will regret it. 'Any team in the world would give anything to have him for five minutes. Neither party deserved this ending. 'If there is something that cannot be criticised [about Messi] it's his professionalism: it's hard to find someone with his professionalism even though he's possibly the best player in history. 'It's impossible to criticise him. Let him go where he's happy and with his family. If it's here, great: see him every weekend it would be a great goal. ",
        "'Otherwise we will continue watching him on TV as we have been doing for almost 20 years.' The 35-year-old, who is an ambassador for the Saudi Tourism Authority, was pictured in Riyadh on Monday, the day after his side suffered a surprise loss to Lorient.Messi says he had to make the trip for contractual reasons having previously cancelled it and had assumed he had a day off.He said in a video posted on Instagram: 'I wanted to make this video due to everything that is happening.'First of all, I want to say sorry to my team-mates and to the club. I honestly thought that we were going to be free after the game, as had been the case in previous weeks.",
        "'I had organised this trip to Saudi Arabia, which had been cancelled previously and this time I couldn't. I apologise again and I'm here for whatever the club decide. All the best.'Messi joined PSG in a blaze of publicity after Barcelona ran into severe monetary difficulties two years ago.He has been linked with a return to the Nou Camp but it is widely thought the LaLiga leaders' financial position makes that unrealistic. Saudi Arabia and the United States are rumoured to be other potential destinations."
    ]
}