{
    "articleURL": "/tvshowbiz/article-12039585/Melbourne-convenience-store-worker-scouted-Tyra-Banks-Australias-Model.html",
    "content": [
        "An unsuspecting Melbourne convenience store worker found himself in the limelight after a chance encounter with supermodel Tyra Banks.",
        "Banks, 49, who is currently in Australia on holiday, spotted Marwan Shimy's potential and decided to share her discovery with her 7million Instagram followers.'What if I told you I'm going to put you on my Instagram and we're going to see if we can change your life,' she enthusiastically said on the social media platform.Appearing on The Project, Shimy told hosts Sarah Harris and Hamish McDonald it was 'the best day' of his life.'I was working normally, Tyra Banks comes in and to be honest I didn't recognise her in the beginning,' he said.",
        "'She was so sweet and she was so humble you don't get the feeling of like, \"I'm a superstar, you have to know me\".'Shimy said it was at the end of her transaction Tyra started to ask if he had modelled before.'I was a little bit, like shy and I kept laughing, I just kept laughing to be honest,' he said.",
        "Shimy is from Egypt, and is in Australia to study, but he and his family are excited about what this opportunity could bring.On Tuesday night, Banks re-shared his interview, writing: 'Literally DAYS ago I discovered @mshimy and now he's on the @theprojecttv news! Go, Shimy!'This isn't Tyra's first time Down Under.",
        "Previously speaking to The Kyle and Jackie O Show, Tyra recalled her previous trip to Australia and said she was a fan of Australian ice cream chain, Gelato Messina.'The last time I went to Australia, for the finale of Australia's Next Top Model, five years ago, it was around my birthday,' she said.'I love ice-cream and I was asking everybody in Sydney, where I find good ice cream,' continued Tyra, who was on the show to promote her latest venture, Modelland.  And years later, she still hasn't been able to forget the taste."
    ]
}