{
    "articleURL": "/femail/article-12051219/Belgiums-Princess-Elisabeth-Catharina-Amalia-Netherlands-Buckingham-Palace-reception.html",
    "content": [
        "Princess Elisabeth of Belgium put on a stylish display as she arrived at the PalaceREAD MORE: For all the latest Royal news, pictures and video click hereThey were surrounded by royalty - and yet Princesses Elisabeth of Belgium and Catharina-Amalia of the Netherlands still made sure they stood out from the crowd when attending a lavish reception at Buckingham Palace this evening.",
        "Elisabeth, who is studying History and Politics at Oxford University, put on an elegant display in a navy midi dress as she stepped out at the occasion in London, alongside her father King Philippe of Belgium.Cinched at the waist with a dainty black belt, the 21-year-old teamed her long sleeved dress with matching high heels.The future Queen - who will ascend the throne after her father - added a touch of glitz to her look with dazzling diamond drop earrings and a coordinating silver bag when attending the event hosted by King Charles on the eve of his coronation.Also arriving at the reception - hosted by the British monarch for foreign royalty and other overseas dignitaries - was Catharina-Amalia of the Netherlands, who is heir to the Dutch throne.",
        "Catharina-Amalia stepped out alongside her grandmother Princess Beatrix of the Netherlands, 85, who abdicated in favour of her son King Willem-Alexander of the Netherlands in 2013.The 19-year-old princess opted for a sophisticated navy suit, teamed with matching high heels and a clutch bag. She enhanced her pretty features with glamorous makeup and wore a dazzling silver necklace. Like Catharina-Amalia, Princess Elisabeth will ascend the throne after her father. A change in the law a decade ago made it possible for the eldest child, male or female, to ascend the throne in the country. She will become the country's first Queen Regent if she takes up the role.",
        "Elisabeth spent 18 months boarding at UWC Atlantic College in South Wales before returning home to Brussels in March ahead of the government lockdown.The princess, who received her International Baccalaureate Diploma in 2020, enrolled at Oxford University after completing a one-year course in social and military sciences at the Royal Military Academy.The course is said to teach in-depth about the four components of Belgian defence; Army, Air Force, Navy and Medical.King Philippe, 60, spent three years at the esteemed institution between 1978 to 1981.",
        "Last month, the Crown Princess of Belgium called the late British Queen her 'role model' as she represented her parents King Philippe and Queen Mathilde in signing a book of condolence in Brussels.Princess Elisabeth signed the book of condolences at the residence of the UK ambassador, and wrote a sweet note praise the late Monarch's 'exemplarity'.The Belgian royal appeared deep in thought in pictures shared by the royal household on Instagram.'Her Majesty Queen Elizabeth II has been a role model and a source of inspiration for many of us, young and old,' the Princess wrote in her note.'I join the millions around the world in mourning an extraordinary personality, whose exemplarity has had a profound impact on younger generations. May her soul rest in peace.",
        "'On behalf of King Philippe and Queen Mathilde, I wish to express our deepest condolences to the Royal Family and the people of the United Kingdom, the Realms and the Commonwealth.'",
        "Elisabeth dedicated the note 'in loving memory of her majesty Queen Elizabeth II.' and signed her name. Meanwhile, in February, the Dutch Crown Princess Catharina-Amalia opened up about 'missing normal life' after she was forced to leave university accommodation over a gangster plot to kidnap her.The teenager, who started a degree in politics, psychology, law and economics at the University of Amsterdam last year, moved out of her student accommodation and returned to her home in The Hague in October. At the time, several Dutch media outlets reported that the princess, whose formal title is Princess of Orange, was under heightened security due to fears that criminal gangs may target her for kidnapping or an attack. During her tour of the Caribbean earlier this year, the royal briefly touched on her heightened security, and in a clip shared by Dutch media site NOS, said: 'I'm going to be very honest, I'm still having a very hard time.",
        "'I miss the normal life, the life of a student. Walking the streets, being able to go to a store.'Meanwhile she said she had enjoyed having some freedom back during the international tour, saying: 'I had a wonderful time.'",
        "In October, Dutch news agency ANP quoted Queen Maxima, 51, during a state visit to Sweden with her husband King Willem-Alexander, saying: 'She can hardly leave the house.",
        "'The consequences are very difficult for her. There is no student life for her like others have,' she added with an unusual amount of emotional candour. The name of the princess, along with Dutch Prime Minister Mark Rutte, are understood to have come up in communications among organised crime groups which indicated they may be in their crosshairs for kidnapping.'I'm very sorry for her and I'm obviously very concerned about it,' the Prime Minister said, without divulging details about the threats or the security measures. 'That makes people angry who want to be informed,' said the Prime Minister. He added that Dutch authorities are doing everything to ensure that the princess is safe. Princess Amalia started her degree in September and was living in rented accommodation she shared with several other students in Amsterdam before she had to move back home.The princess is viewed in Holland as a relatively down-to-earth royal. She is a keen jockey with a horse named Mojito and she was nicknamed the Cocktail Queen after working a summer at a beach bar in Scheveningen. She recently took part in her first international tour, joining her parents on a lengthy visit to the Dutch Caribbean Islands.",
        "This morning the King took part in a final coronation rehearsal at Westminster Abbey, where a 2,300-strong congregation, and a television audience likely to be in the tens of millions, will watch him being crowned on Saturday. ",
        "As excitement ramps for Britain's first coronation in 70 years, Charles and Kate joined a lunch for VIPs at Buckingham Palace.His Majesty was joined by working royals at a special event for prime ministers and governors general at the Palace from midday, just after the heavens opened on London.The Prince and Princess of Wales, the Duke and Duchess of Edinburgh, the Princess Royal and Vice Admiral Sir Tim Laurence were at the event. Completing the royal contingent were the Duke and Duchess of Gloucester and the Duke of Kent. But there was no invite for Prince Andrew, who was seen driving around Windsor this lunchtime. ",
        "There were 42 attendees in total, including UK Prime Minister Rishi Sunak, Australia's republican Prime Minister Anthony Albanese, and Prime Minister of New Zealand Chris Hipkins. Charles, Queen Consort Camilla and Prince William had been at Westminster Abbey this morning for final rehearsals ahead of the Coronation tomorrow, around the time Prince Harry may have landed in the UK. His Majesty and his wife waved to crowds as he was driven down The Mall to the church for further preparations, before a run of diplomatic duties including hosting a Buckingham Palace lunch for VIPs. ",
        "But the monarch looked shocked by the heavy rain as he passed thousands of people who are camped out along the route from the Abbey to the Palace including the packed Mall, dubbed Chaztonbury due to the huge numbers camped out there.Meanwhile Prince Harry may have already landed in the UK for his 24-hour visit for the Coronation - leaving his wife and two children at home.The Duke of Sussex is intending to fly back to California straight after the historic ceremony ends tomorrow afternoon so he can make it back to see Archie on his fourth birthday.This morning a private jet from Van Nuys airport in California landed at Farnborough, the airport closest to Windsor Castle. Van Nuys is just an hour from Harry and Meghan's Montecito mansion, but it is not yet known if he was on board.Some 100 heads of state are descending on London for the coronation on Saturday, with representatives from 203 countries due to attend. "
    ]
}