{
    "articleURL": "/money/saving/article-12038415/Over-65s-risk-financial-exclusion-dont-use-online-banking.html",
    "content": [
        "Two in five over-65s do not use online banking, putting them at high risk of ‘financial exclusion’, research reveals.",
        "More than four million pensioners still rely on physical bank branches and phone lines to manage their finances, according to a survey by charity Age UK.But as High Street banks axe branches across the UK, over-65s are at risk of losing access to vital services.Money Mail revealed last month that as many as eight in ten of the remaining 5,500 bank branches countrywide could be closed by the end of next year, leaving millions of people in ‘bank branch deserts’.A fear of being defrauded by scammers and a general lack of IT skills are the two biggest barriers to online banking.Caroline Abrahams, of Age UK, says: ‘We need to face up to the fact that huge numbers of older people are not banking online. It’s crucial that banks respond.’ More than 5,000 branches have closed since 2015.l.purkess@dailymail.co.uk",
        "PGRpdiBkYXRhLW1vZHVsZS12ZXJzaW9uPTEuNC4wIGRhdGEtbW9sLWZlLXhwbW9kdWxlLXNhdmluZ3MtbmV3c2xldHRlciBkYXRhLXBsYXRmb3JtPWlvcyBkYXRhLW5ld3NsZXR0ZXI9InNhdmluZ3MiIGRhdGEtY29sb3ItdGhlbWU9cHVycGxlIGRhdGEtZm9ybS1hY3Rpb24tdXJsPSJodHRwczovL2xpbmsubmV3cy50aGlzaXNtb25leS5jby51ay9zL1RoaXMrSXMrTW9uZXkrLStTYXZpbmdzK0FsZXJ0cyIgZGF0YS1wcml2YWN5LXBvbGljeS11cmw9Imh0dHBzOi8vd3d3LnRoaXNpc21vbmV5LmNvLnVrL2hvbWUvYXJ0aWNsZS03NzU5MjczL1ByaXZhY3ktQ29va2llcy1Qb2xpY3ktUG9saWN5Lmh0bWwiPjwvZGl2Pg==",
        "Savings rates are on the rise after many years in the doldrums, with savers now able to bag deals as high as 5 per cent.But many people still have money languishing in old sub-1 per cent paying savings accounts. Checking top rates is essential, but can also possible to make life easier to manage your savings pots in one place.  Over the past few years a number of savings platforms have launched, offering savers the option to switch as and when better deals become available and manage accounts from different banks and building societies.They each work slightly differently and include their own exclusives. To find out more and check out what's on offer visit our special savings platform top rates tables.You can also view our comprehensive best buy savings tables, independently curated by savings guru Sylvia Morris and the This is Money team.Savings essentials:&gt; Compare best savings rates in our tables &gt; Check the best rates from savings platforms &gt; Sign up to Savings Alerts to get top deals sent to you",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}