{
    "articleURL": "/wires/reuters/article-12056831/Israel-demolishes-Palestinian-West-Bank-school.html",
    "content": [
        "By Emily Rose",
        "JERUSALEM, May 7 (Reuters) - Israeli authorities demolished a Palestinian school in the occupied West Bank on Sunday, drawing harsh condemnation from the European Union.COGAT, a branch of the Israeli military, said in a statement that the building, located about 2 km from Bethlehem, had been constructed illegally and \"was found to be dangerous to the safety of anyone studying or otherwise visiting there,\" and thus an Israeli court \"had ordered it demolished.\"The European Union Delegation to the Palestinians, on its official Twitter account, said it was \"appalled\" by the school's demolition, which it said would affect 60 Palestinian children. The demolition was \"illegal under international law\" and would \"only increase the suffering of the Palestinian population and further escalate an already tense environment,\" the EU delegation said.COGAT said the building's owner had refused several attempts by Israeli authorities to engage in dialogue over the status of the structure before the enforcement of the demolition.Students and witnesses said the building had been brought to rubble with no trace of the school that once stood there.\"We got ready to come to school and when we arrived we didn't find the school,\" student Mohammed Ibrahim told Reuters. \"We want a school today! We want to study, if they (Israeli forces) will keep demolishing, we will keep building.\"",
        "Witnesses also said the contents of the building had been confiscated.\"They demolished the school and they took everything with them,\" a nearby resident and witness whose grandson was a student at the school Ismael Salah told Reuters. \"All the furniture, they put them in trucks and took them.\"Israel has often cited a lack of building permits, which Palestinians and rights groups say are nearly impossible to obtain, in destroying Palestinian structures in the West Bank, an area it captured in the 1967 Middle East war.The Palestinians want the more than half a million Jewish settlers there, along with Israeli soldiers, to leave the occupied territories. Israel balks at such sweeping pullouts, citing historical claims on the biblical lands.The Gush Etzion Regional Council, which represents a nearby block of Jewish settlers in the West Bank, welcomed the demolition.\"This is definitely another step in the persistent struggle for our State lands, Gush Etzion Regional Council Mayor, and Chairman of the Yesha Council, Shlomo Neeman said in a statement. \"There is still a lot of work to be done.\"The Palestinian Authority's ministry of education called the demolition a \"heinous crime\" and said it would cause \"the school's students to be deprived of receiving their education in a free, safe and stable manner, similar to children in the rest of the world.\"",
        "An Israeli official source told Reuters that the dispute over the building's safety had gone on for six years and that a nearby school would absorb the students displaced by the demolition. (Reporting by Emily Rose, Yosri Al-Jamal, Ali Sawafta; Editing by Susan Fenton)"
    ]
}