{
    "articleURL": "/wires/ap/article-12039407/Close-call-high-speed-video-shows-officer-evade-crash.html",
    "content": [
        "FAIRFAX, Va. (AP) - A police officer remarkably escaped injury Monday when a car careened across a highway at 120 mph while he conducted a traffic stop.",
        "Dashcam video of the crash released Tuesday by Fairfax County Police shows a black BMW sedan driven by a teenager coming within inches of the officer, who had stepped out of his patrol car to pull over a gray BMW for speeding.In the seconds before the crash, the black BMW can be seen skidding across a median on the Fairfax County Parkway near Braddock Road. It then strikes the car that had been pulled over and ricochets into the patrol car. The officer falls to the ground for a second, then quickly pops up to radio for help and check on injuries.Miraculously, no major injuries were reported, even though the black BMW had two teenage passengers in addition to the driver. All three in the black BMW were wearing seatbelts, police said.The driver of the black BMW was charged with reckless driving, a misdemeanor that can often result in jail time in Virginia. Police said the driver was 17 years old, and state law restricts them from identifying him or releasing any details about the crash that could be used to identify him.Deputy Police Chief Bob Blakley said traffic safety among teen drivers is on the decline. So far this year, Fairfax police have seen a 62 percent increase in teen speeding citations, and a 98 percent increase in tickets for failure to follow signs or signals.",
        "In Monday's crash, reconstruction experts determined that the car had been going 120 mph in a 50 mph zone before it lost control.\"The vehicle lost control because cars can´t go that fast on the highway,\" he said.Fairfax County Police Chief Kevin Davis did not identify the officer, who was uninjured but recovering at home Tuesday. Davis and Blakley said the 13-year veteran may be alive today because he approached the driver he pulled over on the passenger side of the vehicle - a tactic that is optional for officers but advised in cases where approaching on the driver side presents a safety hazard, Blakley said.Davis complimented the officer's professionalism at a news conference Tuesday.\"His grace under pressure was calm, cool, collected,\" Davis said.Davis said the accident is a good reminder about the importance of traffic safety and recognizing the dangers that officers face enforcing traffic laws. Also, in Fairfax County, one of the wealthiest counties in the nation, Davis suggested that parents might want to reconsider providing high-performance automobiles to their children.\"The car involved in that collision yesterday was a whole lot of car for an inexperienced driver,\" Davis said. \"It was going way too fast. It was a rocket, and then it became a missile.\""
    ]
}