{
    "articleURL": "/femail/article-12042049/Princess-Charlotte-adorable-59-floral-Rachel-Riley-dress.html",
    "content": [
        "Princess Charlotte, 8, and mother Kate, 41, have both stunned in print dressesREAD MORE: Royals arrive for King Charles lll's Coronation rehearsalsPrincess Charlotte was pretty as a picture today as she arrived at rehearsals for King Charles III's Coronation.",
        "The only daughter of the Prince and Princess of Wales was seen at Westminster Abbey with her mother Kate, 41, who looked chic as ever in monochrome, donning the L.K.Bennett Mortimer Black and White Fruity Floral Print Dress. And her mini me Charlotte was similarly smart just a day after her eighth birthday, in a £59 Rachel Riley poplin dress - that is now sold out.The dress originally priced at £59, was marked down to £35.40 in a sale, before finally selling out.The knee-length number features a green daisy pattern print, atop a sky blue background, as well as front button fastenings and slightly puffed sleeves. It is gathered at the waist and the collar, and the sleeves and button placket are cut with scalloped lace trims. ",
        "Kate's dress has also been marked down from £359 to £179.The tea dress is said to be crafted from beautiful black silk with a white fruity floral silhouette print, abd features a pussy bow neckline, oversized pearl buttons and long sleeves.The body-skimming number fell elegantly on the monarch's trim figure as it landed just below the knee. The princess's new look comes just one day after her parents delighted royal fans by sharing a new photo of their daughter to mark her eighth birthday on their Instagram account.",
        "In the official portrait, Princess Charlotte is pictured snuggling up to the family's black cocker spaniel Orla - as she recreated her seventh birthday portrait.The birthday girl - who bears a striking resemblance to her father - is dressed in a £23 blue-and-white striped jumper from Boden,  white button-up blouse and pair of blue jeans.Looking happy and relaxed in front of the camera, Charlotte appears to be lying in a meadow for her annual birthday portrait. ",
        "Although the couple didn't reveal exactly where the photo was taken, it appears to be a very similar setting to previous family portraits - which were shot in the grounds of Amner Hall in Norfolk. The image was taken by the photographer Millie Pilkington - whom Kate and William used for Prince Louis' fifth birthday portrait last month.Sharing the heartwarming image with their 14.6m Instagram followers, the couple took the opportunity to express their gratitude for all the well wishes on their daughter's special day.They captioned the image: 'Thank you for all the birthday wishes.'The post has already amassed over 30,000 'likes' and delighted royal fans.One gushed: 'So adorable! You can see both her parents in her face.' 'Cuteness overload,' another added.'She looks so beautiful,' a third said. 'I hope [her] day was amazing.' ",
        "In 2020, Kate and William welcomed their beloved black cocker spaniel Orla to their family - just months before their first dog Lupo sadly passed away.Both of the couple's pets were bred by Kate's younger brother James Middleton.  Last month, photographer Millie Pilkington thanked the royal couple for the opportunity to take portraits of Prince Louis.She wrote on Instagram: 'Thanking the Prince and Princess of Wales for entrusting me with this shoot. #trulyblessed'Last night, the couple released another new image of Princess Charlotte ahead of her birthday.Photographed by her mother, as in previous years, she gave the Princess of Wales, 41, a gap-toothed grin to mark the occasion. What's more, the Princess of Wales dressed her daughter in a £70 white floral dress from Trotters for the occasion as she photographed Charlotte sitting on a white wicker chair.  With her tousled dark hair and flushed cheeks, it seems that country life at the King’s Berkshire estate, where the family moved to last summer, is agreeing with her. ",
        "Releasing the images, Kensington Palace said: 'The Prince and Princess of Wales are delighted to share a new photograph of Princess Charlotte ahead of her eighth birthday.'And just like the images posted last year to mark Charlotte's special day, it shows the striking resemblance the princess has to her father Prince William, 40.",
        "The father-daughter duo appear to share a number of similar facial features, including their eyes and nose, and expressions.They both have large, beaming smiles, which boast more than a passing family resemblance.Every year, the Wales release new pictures to mark their children's birthdays, generally taken by their mother, the Princess of Wales.Last year, as Charlotte celebrated turning seven, photos showing the youngster at the family's country home Anmer Hall in Norfolk were published.The princess was no doubt delighted by the pre-birthday treat her mother arranged for her on Saturday, taking a group of friends to the Royal Opera House to see the ballet Cinderella, where the girls were allowed up on stage at the end. As a Twitter user confirmed her surprise at seeing the royal mother and daughter in the audience, a video on Instagram showed the Princess of Wales going up to her daughter who was on stage. ",
        "Charlotte is set to enchant royal fans this weekend when she appears with her family at the Coronation. She is not believed to have an official role due to her age but she is expected to attend the ceremony at Westminster Abbey as well as make an appearance on the Buckingham Palace balcony.And the young royal is expected to join her father the Prince of Wales, her mother Kate, older brother Prince George, nine and younger brother Prince Louis, five, in the coronation procession.",
        "It was reported last week that the royal siblings will sit in a carriage with their parents behind King Charles and Queen Camilla, who will travel in the Gold State Coach.The Wales will be joined by the Princess Royal, her husband Vice Admiral Sir Tim Laurence, the Duke and Duchess of Edinburgh, the Duke and Duchess of Gloucester, the Duke of Kent and Princess Alexandra.Princess Anne, who is a former Olympic equestrian, will ride horseback behind the gold state coach that will carry Charles and Camilla down The Mall.This role is formally given the title of Gold-Stick-in-Waiting, a position that has historically been given to the person trusted with looking after the Monarch's safety.Prince Andrew, Princess Beatrice, Princess Eugenie and Prince Harry are not expected to participate.After much speculation about whether the Sussexes would attend the coronation or not, it was confirmed last month that Prince Harry would be flying into London to be at Westminster Abbey for the ceremony, but Meghan would remain in Montecito, California with Prince Archie and Princess Lilibet.But it was reported at the weekend that the Duke's visit to the UK would be fleeting and it was unlikely he'd stick around for very long as he is eager to return to the US for Prince Archie's fourth birthday - which is also on Saturday."
    ]
}