{
    "articleURL": "/news/article-12052389/Mayorkas-describes-extremely-challenging-situation-border-Title-42-end-days.html",
    "content": [
        "Alejandro Mayorkas is on a two-day trip to the border to see conditionsTitle 42 is due to end on May 11, lifting pandemic migration restrictions Homeland Security Secretary Alejandro Mayorkas visited the southern border on Friday to see preparations for the end of Title 42 next week and described the situation as 'challenging.'",
        "'The situation at the border is a very serious one,' he told reporters in Brownsville, Texas. 'A very challenging one, and a very difficult one.'This week the White House announced is was sending 1500 troops to the border. And cities in Texas and Arizona have begun declaring states of emergency.Mayorkas was asked whether enough had been done to cope with an expected influx.'I think that there is no question that this is going to be extremely challenging,' he said. 'I do not want to understate the severity of the challenge that we expect to encounter.'",
        "Republicans, who have been scoring political points off the record numbers of people crossing the border, scoffed at his choice of words.'The word Mayorkas is looking for is \"crisis,\"' tweeted the Republican National Committee.Title 42 is a regulation that allows border authorities to immediately return migrants who cross the border illegally during public health emergencies.It was invoked by the Trump administration during the COVID pandemic.It is due to end on May 11, and so migrants will now be handled under Title 8, the nation's existing immigration law.At least 12,000 people have congregated in the Mexican city of Ciudad Juarez, according to the mayor of neighboring El Paso, and may be waiting for the end of Title 42 before trying to cross in the mistaken believe that they will be allowed to enter the United States.",
        "Mayorkas said the U.S. was actually making the rules tougher. 'We will by May 11 finalise the rule that we published in a proposed format that provides that individuals who do not access our lawful pathways will be presumed to be ineligible for asylum and will have a higher burden of proof to overcome that presumption of ineligibility,' he said.'We are building lawful pathways and we are delivering consequences for those who do not use those meaningfully accessible pathways. 'The message is very clear. We are coming with the relief that our laws provide to the individuals in need. 'The border is not open, it has not been open and it will not be open subsequent to May 11.'",
        "He said smugglers who were trying to exploit the vulnerable were spreading misinformation.Illegal crossings tumbled after President Joe Biden announced asylum restrictions in January, but they have risen since mid-April. Mayorkas said it was caused by a surge in numbers of people from Venezuela. Brandon Judd, president of the National Border Patrol Council, said this week they have been hovering around 7,200 daily, up from about 5,200 in March.Border Patrol Chief Raul Ortiz said 1,500 active-duty troops will be dispatched to El Paso, Texas, adding to 2,500 National Guard troops already positioned across the border. ",
        "Ortiz said El Paso was chosen because it has been a busy corridor for illegal crossings over the last six months. The troop deployment was announced this week but not the location."
    ]
}