{
    "articleURL": "/wires/pa/article-12056297/Law-firm-awarded-4m-contract-help-Brexit-bonfire-plans.html",
    "content": [
        "Ministers are spending £4 million to hire a private law firm to help deliver on the promised “bonfire” of 4,000 EU-era laws.",
        "The Department of Business and Trade has hired lawyers from one of the largest firms in the UK amid reports that the Government is likely to fall short of its plan to rid the statute books of EU law by the end of the year.American-British law firm Hogan Lovells is set to work with the Government until the end of 2023, after being awarded a contract worth around £4 million.A Government spokesman said: “The Government is fully committed to removing and reforming burdensome EU law, and has procured external legal support to build on existing capacity in the Government Legal Department to assist with delivery of the REUL Reform programme.“Once passed, the Retained EU Law Bill will enable the country to further seize the opportunities of Brexit by ensuring regulations fit the needs of the UK, helping to drive economic growth and innovation.”Hogan Lovells was awarded the contract following a tendering process, with the £4 million contract due to run until December 31.",
        "The planned law, which is currently in the House of Lords, will put a “sunset” clause on the remaining EU-derived legislation.But Brexiteers have grown concerned that the Bill, which has attracted criticism from trade unions and businesses, is in danger of being delayed.",
        "Critics warn that rushing through with the plan would create uncertainty, while also threatening legal rights and protections.The exact nature of the support to be provided by law firm is not known, but it has published a number of guides to the Bill.In a post on its website from March, the firm said its lawyers would be “following the Bill’s progress through Parliament and how the Bill’s powers are used (or not) by Ministers in the second half of 2023”."
    ]
}