{
    "articleURL": "/news/article-12057253/STEPHEN-POLLARD-Liverpool-fans-showed-disrespectful-behaviour-booing-national-anthem.html",
    "content": [
        "Supporters booed and chanted 'Liverpool' throughout the national anthem On Saturday at 3pm, I stood with more than 60,000 football fans at Tottenham Hotspur's stadium and sang the national anthem to mark the Coronation.",
        "There was no particular fuss about it in advance, nor afterwards. Shortly before the Spurs and Crystal Palace teams were due to kick off, they walked to the centre circle, a drum-roll played over the speakers and the familiar anthem began.As my friend said to me when it was over: 'That was stirring. We should do it before every game!'The same scene played out at every Premier League ground on the fixture list that weekend – except for one.Just before the match began at Anfield, the home of Liverpool Football Club, the stadium's steep and imposing stands rang out not with 'God Save The King' but jeers and boos. The anthem playing on the PA system struggled to be heard over chants from some fans of 'Liverpool, Liverpool'.",
        "According to a statement by the club, it was absolutely fine for Liverpool fans to boo. Liverpool FC said it was a matter of 'personal choice' how supporters reacted.Quite right, too. We live in a democracy and no one is compelled to be a monarchist, let alone to sing the national anthem. That's one of the great things about our country.But that freedom of choice cuts both ways. Because just as Liverpool fans are free to react to the national anthem as they see fit, the rest of us are free to regard them as fools who shame their city and their club by their uncouth and disrespectful behaviour.",
        "Not that this is anything new. Last Wednesday, a number of Liverpool fans chanted, 'You can stick your Coronation up your a***,' as their team took on Fulham. They also booed Prince William – the president of the Football Association – when his presence was announced at Wembley before last year's FA Cup Final.This booing first started in the 1980s as a political statement of opposition to the Thatcher government's perceived treatment of the city. The Hillsborough disaster, and the subsequent cover-up and lies from the police about what happened, understandably fuelled further anger. It has stuck. But what these Liverpool fans don't grasp is that they are the ones who look bad when they boo. They are the ones who come across to the rest of us as juvenile when they chant.A far more dignified protest – if that's what they actually wanted – would be to remain silent or seated when the national anthem plays.",
        "Besides, the barracking Liverpool fans wilfully ignore how the national anthem is not about the Government or the police. It's not even really about any individual King or Queen, whatever the words may say. It's a symbol of togetherness as a nation.Just as the secret of the monarchy's success is that it is about more than the particular individuals who represent it – it is something much bigger as an institution which binds us all together – so the national anthem is really a statement of pride in being British.",
        "When it plays at an Olympics medal ceremony, for example, it's not about honouring the monarchy – it's honouring the nation that has produced such a fine athlete. That's why every country – be they a republic or not – has a national anthem.So when some of the Liverpool fans boo the national anthem, all they are really doing is booing their own country. They are sticking two fingers up to the rest of us.And they should not be surprised when our response is to treat them with scorn."
    ]
}