{
    "articleURL": "/news/article-12039801/Hawley-calls-Interior-Sec-saying-theres-blue-collar-jobs-Americans-fill.html",
    "content": [
        "Hawley slammed Biden's 'radical climate agenda' during a hearing TuesdayThe senator criticized Interior Secretary Haaland for saying there are 'too many' U.S. jobs for blue collar workers to fill Republicans argue more natural resource production and mining should happen domestically to provide jobs, up competition and decrease reliance on China Sen. Josh Hawley had a terse interaction with Deb Haaland at a hearing Tuesday when he accused the Interior Secretary of saying there are 'too many' blue collar jobs in the U.S. and not enough people to work them.",
        "The Missouri senator was alleging that the Biden administration's energy proposals are making the U.S. less competitive on the world stage and exacerbating the outsourcing of legitimate blue collar jobs to China.Haaland, along with Deputy Interior Secretary Tommy Beaudreau, were before the Senate Energy and Natural Resources Committee for a hearing on the budget proposal. They fielded several questions on domestic oil and natural resources production.The vast majority of members on the committee, including Hawley, are from western states where natural resources are more plentiful. Republicans feel the western U.S. is an untapped area for many domestic energy sources.",
        "Hawley questioned Haaland on the Biden administration green energy plan, which he called a 'radical climate agenda,' specifically asking why the U.S. does not mine for resources like zinc, lithium nickel graphite and cobalt.He said all of these resources could be mined in the U.S., but are instead being outsourced to China.'Jobs for blue collar workers in this nation are valuable resources. The livelihood and wellbeing of American families are valuable resources. The ability of America to have our own industry and not be dependent on China is a valuable resource,' Hawley said.'Why should those things for millions of Americans be sacrificed in favor of your agenda for radical climate agenda?'",
        "'I know that there's like 1.9 jobs for every American in the country right now. So I know there's a lot of jobs –' Haaland responded, but was cut off by the Missouri Republican senator.'Wait a minute, wait a minute. You're telling me we've got too many jobs in the country?' Hawley scoffed with a sarcastic chuckle.'Well, I'm saying that we don't have enough people,' Haaland clarified. 'That's why we are having a hard time finding folks to work at our Department.'Hawley wasn't buying it.'You're telling me we have too many jobs for blue collar workers?' he questioned. 'Have you seen the number of jobs we have lost in this country to China in the last 20 years?''Over 3 million jobs have gone to China. Do you know where those jobs have come from? They've come out of Midwestern towns, like the ones I represent,' the senator added, getting visibly more upset. 'They are blue collar workers. Are you sitting here and telling me that we have too many jobs in this country? Are you serious?'",
        "'Senator, we are working hard every single day,' Haaland replied, noting that the administration is also working to open more natural resource mines in the U.S.'We're moving backwards,' Hawley shot back.",
        "'You're shutting down and denying permits for mines in this country where we can develop our own resources,' he alleged.The Biden administration is requesting $18.9 billion for the Interior Department for the next fiscal year, which is a $2 billion increase from 2023.Haaland and her deputy fielded questions on the increase in appropriations request, the energy policy of the Biden administration and the push by Republicans for more domestic natural resource production and mining.Hawley also serves on the Senate Committees on the Judiciary; Homeland Security and Governmental Affairs; and Small Business and Entrepreneurship."
    ]
}