{
    "articleURL": "/wires/ap/article-12039763/Money-Mexican-migrants-sent-home-rose-11-4-Q1.html",
    "content": [
        "MEXICO CITY (AP) - Mexicans living abroad sent home a total of almost $14 billion in the first three months of 2023, an 11.4% increase over the same period of 2022, the country's central bank said Tuesday.",
        "While still considerable, the rate of growth in remittances appears to be slowing, after large pandemic-era increases in 2022 and 2021. In March, remittances for the month were actually down 1.2% compared to the same month last year.That may be related to the Feb. 28 decision by the government to stop accepting remittances through the government-owned Bienestar bank.The government said the decision was made to avoid duplicating the functions of another government transfer office. But some experts said it was a reaction to signs that drug cartels may have been using remittances through the Bienestar bank to launder money.The Bienestar bank has not yet responded to questions about reports that there had been a surge in remittances sent through the bank to the cartel-dominated state of Sinaloa.Remittances grew by 13.4% in 2022, totaling about $58.5 billion for the year as a whole. In 2021, remittances grew by an astounding 27.1%, totaling about $51.6 billion for the year.Remittances now surpass almost all other sources of the country´s foreign income, including tourism, oil exports and most manufacturing exports.Mexico receives more money from remittances than any other country except India. Indian migrants send home about $100 billion each year.Still, no one is getting rich in Mexico from remittances; the average amount each migrant sent was $391, according to the Bank of Mexico.",
        "Remittances as a percentage of Mexico´s GDP have almost doubled over the previous decade, growing from 2% of GDP in 2010 to 3.8% in 2020, according to the government. Between 2010 and 2020, the percentage of households in Mexico receiving remittances rose from 3.6% to 5.1%."
    ]
}