{
    "articleURL": "/sport/formulaone/article-12058619/Im-not-George-Russell-hits-distracting-pre-race-introductions.html",
    "content": [
        "American rapper LL Cool J introduced the drivers before the Miami Grand Prix It is understood the pre-race show will take places at certain other racesGeorge Russell hit out at the pre-race ceremony, describing it as 'distracting' George Russell said he is not in Formula One for the show after taking aim at the pre-race razzmatazz put on by the sport's bosses for the Miami Grand Prix.",
        "In a break from convention, the grid's 20 drivers were individually introduced to the crowd by American rapper LL Cool J as will.i.am conducted an orchestra.It is understood the pre-race show seen in Miami will only take place at certain events, possibly eight this season.But Russell, a director of the Grand Prix Drivers' Association, said: 'It is distracting. I'm here to race, I'm not here for the show, I'm here to drive and I'm here to win.'We're on the grid for half an hour in all of our overalls in the sun. I don't think there's any other sport in the world that 30 minutes before you go out to do your do your business, that you're out there in the sun, with all the cameras on you, making a show of it.",
        "'I appreciate that we are in the entertainment world and we only want the best for the sport. We're open to changes. I guess we have to roll with it.'Russell drove well to finish fourth as Max Verstappen won from ninth on the grid to extend his lead in the championship to 14 points over Red Bull team-mate Sergio Perez.Russell's Mercedes team-mate Lewis Hamilton started 13th, but a late comeback saw him take the chequered flag in sixth.",
        "Mercedes are due to bring an upgrade to the next round in Imola on May 21 which the team hopes will propel them forward.However, Hamilton said: 'It is not like I have a second upgrade coming, which is what I need.'But it's something and it's a step in the right direction for us to really be able to progress.'"
    ]
}