{
    "articleURL": "/sport/nba/article-12059239/Nikola-Jokic-ridiculous-Kevin-Durant-says-Nuggets-center-drops-54-Game-4-loss-Suns.html",
    "content": [
        "Jokic scored 53 points in a Game 4 loss, as the Suns evened the series at 2-2Denver's center could be banned for Game 5 after appearing to shove Ishbia DailyMail.com provides all the latest international sports newsWhile Nikola Jokic awaits word on a possible suspension for Game 5 of the ongoing Nuggets-Suns playoff series, Phoenix's Kevin Durant could not help but marvel at the Denver center's 53-point effort in Sunday's Game 4.",
        "'Yeah he's ridiculous,' Durant told reporters after the Suns tied the series at 2-2 with a 129-124 win in Phoenix.Specifically, Durant marveled at the 6-foot-11, 284-pound Serbian's unconventional, methodical style, which seemed impervious to Suns defenders for much of the night.'I felt like all of those shots felt like they was easy shots , ya know?' Durant continued. 'He just plays the game at a pace, you can't speed him up, fluster him, he's strong, he can make every shot.'I mean I hate when he makes shots because he's so unorthodox and it's like 'Oh yeah that's a miss' and then it goes straight it. He's incredible. I thought he carried them all night tonight scoring the ball. Him and Jamal [Murray] do a great job in that pick and roll, it's so tough to stop. But we just play extremely hard. You're not going to stop these guys. Efficient players. But we played hard. I think that made up for it.'",
        "Jokic sank 20 of 30 from the field and 11 of 13 at the line, adding 11 assists, while Murray finished with 28.But Booker and Durant each had 36 points for Phoenix, while the Suns' bench outscored the Nuggets', 40-11.But the story of the night was the technical foul Jokic received for an on-court altercation with Suns owner Mat Isbia.",
        "Late in the second quarter, Suns guard Josh Okogie crashed into the seats while trying to save a loose ball. He landed in a group of fans on the baseline that included Ishbia, who grabbed the basketball.Jokic was trying to get the basketball quickly — apparently so the Nuggets could start their offensive possession — when he tried to take the ball away from Ishbia. The ball flew backward into the crowd, and then Ishbia was knocked backward by Jokic's elbow.Jokic was unapologetic after the game.'The fan put the hand on me first,' Jokic said. 'I thought the league was supposed to protect us. Maybe I am wrong. I know who he is, but he is a fan. Isn't he?Said Nuggets coach Michael Malone: '[Jokic] is going to get the ball and some fan is holding on to the ball like he wants to be part of the game. Just give the ball up, man.'Jokic typically likes to get the inbounds ball in quickly, preventing the defense from setting up. In this case, he was rushing to inbounds the ball because Okogie had yet to set his feet.Suns star Devin Booker — who finished with 36 points and 12 assists — said he knew it was Ishbia in the middle of the fracas.",
        "'He got us a point!' Booker said with a grin.",
        "Ishbia told The Associated Press at halftime that he was 'fine' and more worried about the game than the altercation. He was back in his usual seats in the second half. The tiff didn't seem to bother Jokic either — the MVP runner-up finished with 53 points on 20-of-30 shooting.Ishbia has only been the Suns' owner for a few months, purchasing the team from the embattled Robert Sarver.Game 5 is on Tuesday in Denver, when Jokic could be suspended by the league for the Ishia incident. The two-time MVP pushed back on that suggestion with reporters after Sunday's loss.'Why? His hands are on me,' Jokic said. 'They are not going to protect me? They are going to protect the fan? I'm talking about it as a player.'"
    ]
}