{
    "articleURL": "/femail/article-12042821/Brooks-Koepkas-model-wife-Jena-Sims-reveals-PREGNANT-child.html",
    "content": [
        "Jena, 34, shared the exciting news this morning in honor of Brooks 33rd birthdayShe shared a carousel of photos that showed him kissing her baby bump The pair met in 2015 and tied the knot in Turks and Caicos in June 2022Model and actress Jena Sims has announced that she's expecting her first child with her golfer husband Brooks Koepka.",
        "Jena, 34, shared the exciting news via Instagram this morning, while wishing the athlete, 33, a happy birthday.'Happiest birthday, the best is yet to come,' she captioned a carousel of photos that showed the sports star kissing her baby bump and holding up a sonogram photo.The happy couple posed on the beach together as the sun set behind them. Jena donned a pair of unbuttoned jeans, a white bikini top, and an unzipped gray sweatshirt - which left her growing tummy on full display.",
        "As for the athlete, he opted for a pair of gray shorts and a black, long-sleeve T-shirt. ",
        "On her Instagram Stories, the expecting mother thanked everyone for the 'love,' adding, 'I'm all in my feels. I'll share more later of course, just going to spend some time with my birthday boy/baby daddy.'She also confirmed that she and Brooks knew the sex of the baby - but said they 'couldn't hit us with the announcement and gender reveal all in one day.'The pair first met in 2015 at the Masters tournament in Augusta, Georgia, which Jena told Golf Digest in 2019 was fitting because she's a Georgia native. 'We met at the 2015 Masters. And that’s so special because I’m from Georgia, so it’s perfect,' she dished.",
        "'We were on Hole Seven, which I don’t even remember, but he’s like, \"Oh, I remember what you were wearing, where we were standing, everything.\"' They announced that they were engaged in April 2021, after more than five years together.And in September 2021, Brooks opened up about how Jena changed his life.",
        "'The way I’m wired, I’m all on or all off. Maybe I didn’t understand that the first 25 years of my life, but in the past five years I’ve been able to own who I am and find that happiness,' he told Golf Digest.",
        "'I don’t know if that’s because of Jena or because I understand more of how things work, but you mature a little more.'I can’t put my finger on it. But when it comes together, and you see what works, you say, this is the program, and I’m going to stick with it.' They officially tied the knot during a stunning beach-side wedding in Turks and Caicos in June 2022, surrounded by their close friends and family. Jena - who is an actress most known for her role in the Sharknado movies and is currently a Sports Illustrated Swim Search finalist - spoke out about her 'supportive' her husband is of her career last month.",
        "'He’s so supportive, and I think that’s why our relationship is so successful because I’m also supportive of his hopes and dreams,' she gushed.'And he’s so interested in everything that I have going on, which couldn’t be further from what he has going on.'"
    ]
}