{
    "articleURL": "/tvshowbiz/article-12049759/Actress-Logan-Browning-shows-support-Writers-Guild-America-strike.html",
    "content": [
        "Thursday marked the third day that movie and TV writers manned picket lines at studios all over Los Angeles and New York City, with several actors also joining their cause, including Logan Browning.",
        "The 33-year-old Dear White People star marched with a slew of other writers outside the Paramount Pictures lot in Hollywood on Thursday.She was joined by actor Timothy Simons (Veep) and actor-writer Ike Barinholtz, who got his star as an actor and writer on Mad TV.Browning also took to her Instagram to share photos of her day on the picket line, with a message of support for writers and her fellow actors.'I remember the last writer’s strike. It went on for so long I ended up leaving LA,' Browning began, referencing the 2007-2008 WGA strike that lasted 100 days.",
        "'Writers are that necessary. The studios have to know that. I have been a proud SAG-AFTRA member for two decades, and I stand in solidarity with the WGA,' she added. 'Money may be what moves this town, but art makes it. You can’t make or move anything without writers,' she added. 'Writers deserve to have their value honored in every way. STARTING WITH LIVING WAGES,' Browning continued. 'Every industry can relate to the changing world impacting their careers. We have to stick together as humans who give a s**t about each other. Don’t become a robot,' she concluded with the hashtags #AIdidnotwritethis #WGAstrong #UnionStrong #SAGAFTRAsupportsWGA.Her 'robot' comments reflect one of the major sticking points the writers guild are fighting against, the regulation of A.I.-generated content used for films and TV.",
        "Browning walked the picket line with an olive green short-sleeved shirt tucked into light blue jeans.She had her dark hair pulled up into a bun with dark sunglasses, with a digital camera dangling from a strap on her arm.The actress carried a WGA strike sign while accessorizing with a gold bracelet and gold rings, finishing her look with green New Balance sneakers. ",
        "Other actors also joined Browning on the picket lines were Veep star Timothy Simons, who was seen outside of the Netflix building on Sunset Boulevard.Actor-writer Ike Barinholtz was also seen on the picket line outside of the Paramount Pictures lot. Another actor-writer, Breckin Meyer, marched with a self-deprecating sign, which read, 'Do you really want me acting again?'Mad Men creator Matthew Weiner also marched with his fellow writers outside the Netflix building in Hollywood."
    ]
}