{
    "articleURL": "/wires/pa/article-12038425/Scotland-excellent-advocate-overseas-s--Cleverly.html",
    "content": [
        "The Foreign Secretary has said he is Scotland’s “excellent advocate overseas” after he was accused of “sabotaging” the Scottish economy with his “draconian” rules on foreign trips.",
        "James Cleverly was challenged in the Commons by SNP foreign affairs spokesman Drew Hendry, who suggested his new guidance to heads of mission abroad is sabotaging “vital economic activity” north of the border.Mr Hendry’s comments come after the Foreign Secretary asked diplomats to take a “strengthened approach” to Scottish ministerial visits – ensuring officials from the UK Government are present during meetings with host governments.While foreign policy has always been a matter reserved to Westminster, ministers in Holyrood have often engaged with foreign governments on a number of issues. Why does the Foreign Secretary seek to sabotage such vital economic activity by instructing UK diplomatic staff to hinder Scottish government direct engagement?  Drew Hendry, SNP foreign affairs spokesman  The Conservatives said SNP ministers are overstepping their powers during these visits and seek to undermine the UK Government.Mr Hendry told the Commons: “Scottish government minister Neil Gray MSP, along with agencies SDI (Scottish Development International) and HIE (Highlands and Islands Enterprise), have proved that direct foreign engagement works for Scotland by securing a £300 million manufacturing investment for subsea cables in the renewables industry, working with Sumitomo in Osaka.",
        "“It is a game changer that’s been welcomed across the Highlands. So why does the Foreign Secretary seek to sabotage such vital economic activity by instructing UK diplomatic staff to hinder Scottish government direct engagement?”",
        "Mr Cleverly replied: “The competences of the Scottish government and the reserved position of the UK Government are clear. They are absolutely clear.“And I would say to him and the House that Scotland has an excellent advocate overseas: it’s me.”SNP MP Deidre Brock (Edinburgh North and Leith) also pressed Mr Cleverly on the issue, asking him: “Will he explain exactly how on earth he thinks that diplomatic staff now to be overseeing meetings between Scottish ministers and ministers from other countries and governments will prevent discussion of whatever topics his Government decides are forbidden?“And why, given the FDI (foreign direct investment) growth was so much higher in Scotland than the rest of the UK last year, 14% against the rest of the UK’s 1.8%, he thinks such draconian interference is useful or necessary?”Mr Cleverly said: “I would have thought Scottish ministers would be better served ensuring that the people of Scotland are supported rather than seeing health outcomes heading in the wrong direction, rather than seeing tax rates head in the wrong directions.“I can assure her that every one of the diplomatic staff in the FCDO (Foreign, Commonwealth and Development Office) promote Scottish interests overseas.”"
    ]
}