{
    "articleURL": "/tvshowbiz/article-12045691/Martina-Navratilova-looks-cheers-wife-Julia-Lemigova-celebrity-basketball-match.html",
    "content": [
        "Martina Navratilova looked well as she cheered on her wife Julia Lemigova during the Wooshi World Celebrity Basketball Classic on Wednesday. ",
        "The tennis legend, 66, who recently got her all clear after overcoming breast and throat cancer, supported her wife as she took to the court in aid of charity. Taking her seat at The FLA Live Arena in Florida, Martina wore a sporty zip up jacket with a pair of matching burgundy trousers. Martina layered another padded jacket underneath, with a pinstriped shirt and completed her look with some colourful trainers.During the game, Julia perched on the floor as she discussed the match with Martina and smiled for a photo.  ",
        "The event hosted by Larsa Pippen, worked to raise money for both critically ill children and those with cancer diagnoses. It comes after Martina announced she is now 'cancer-free' after overcoming breast and throat cancer. The tennis legend revealed the good news in an emotional interview with Piers Morgan, adding she had feared she 'wouldn't see next Christmas' and that beating the disease was the 'hardest thing ever'.She said the diagnosis had forced her to put on hold plans to adopt a child with her wife Julia and even drew up a bucket list of things she wanted to do before she dies.In an interview on Morgan's TalkTV show, which will air tomorrow, Navratilova said the double diagnosis had terrified her, but confirmed that 'as far as they know I'm cancer-free'.",
        "She added that she only has two more weeks of radiation treatment radiotherapy on her breast and that after this 'I should be good to go'.The tennis ace, who won 59 major titles in a career spanning four decades, announced she had been diagnosed with cancer at the start of the year, sparking an avalanche of support.She had previously beaten breast cancer in 2010, but said she feared she might not see Christmas 2023 after it returned.",
        "Navratilova confirmed she was diagnosed after doctors found an enlarged lymph node in her neck during the WTA finals in Fort Worth in November, with tests later confirming she had both breast and throat cancer. After being diagnosed at the beginning of last December, she said: '[I'm thinking] I will see this Christmas but maybe not the next one.'She added: 'Who has two cancers at the same time? I was never an underachiever, but this is getting ridiculous.'However, displaying the spirit that guided her to success on the tennis court, Navratilova defiantly said: 'Giving up, giving in, stopping - that's just not an option for me. You get on with it. Quitting is just not in my DNA.'"
    ]
}