{
    "articleURL": "/femail/article-12041545/best-simba-mattress-deals-2023.html",
    "content": [
        "SHOPPING – Contains affiliated content. Products featured in this Mail Best article are selected by our shopping writers. If you make a purchase using links on this page, Dailymail.co.uk will earn an affiliate commission. Click here for more information.   ",
        "Shoppers looking to improve their sleep are rushing over to Simba, where the award-winning brand has slashed up to 55 per cent off their bestselling bed-in-a-box mattresses in their coronation sale.To celebrate the King's coronation, Simba has massively reduced the price of its bestselling mattresses, including the iconic Simba Hybrid Mattress, hailed 'supremely comfortable' by shoppers, now on sale for up to £560 less.Reductions have been rolled out online across all the brand's mattresses, so whatever your sleep style, you'll be able to find one that suits you.Highlights of the Simba coronation sale include the brand's most affordable mattress, the Simba Hybrid Essential, marked down to just £539.40 for a double.For the most luxurious sleep experience, the Simba Hybrid Luxe Mattress is surely the way to go, with over 5,000 five-star reviews testifying to its 'comfy and cosy' design.  But hurry, these irresistible savings will expire on 8 May, so you don't have long to grab a bargain.    Simba Hybrid Mattress (Double)  With half a million sold, the Simba Hybrid Mattress is also the brand's top-rated mattress, with over 72,000 five-star ratings.Packed with more micro springs than the original, alongside a layer of edge support to prevent it from sagging, the Hybrid will normally cost you £1,079 in a double, but now you can get it for just £647.40 - that's 40 per cent off. £647.40 (save £431.60) Shop  Simba Hybrid Essentials Mattress (Double)  The Hybrid Essential mattress contains all the patented sleep technology that has made Simba the world’s most five-star reviewed mattress brand - but at a cost-friendly price. The brand's most affordable mattress, it is designed for every sleep position: side, stomach, and back and is constructed from three layers of comfortable plush foam alongside an 'Aerocoil' layer of micro pocket springs.  £539.40 (save £360) Shop",
        "  Simba Orian Sleep Bundle (Double) If your bed needs a total refresh, then the Simba Orian Bundle is the way to go. Experience ultimate comfort and save money with the complete Hybrid experience. Choose between Hybrid Essential, Hybrid, Hybrid Pro or Hybrid Luxe mattresses, teamed up with your perfect Hybrid Pillow and Duvet to create your perfect bundle.  £1,772.35 (save £1,143) Shop  Simba Hybrid Pillow  You can save 25 per cent off the Simba Hybrid Pillow in the coronation sale. Not only is it customisable to your sleep position, but it's also been made with hot sleepers in mind, with 'astronaut-inspired temperature regulation' that absorbs, stores, and releases heat when needed. £81.75 (save £27) Shop  Simba Hybrid Pro Mattress (Double)  Looking for double the support? With two layers of micro springs and an additional layer of wool for temperature regulation, the Simba Hybrid Pro Mattress allows you to fall asleep and stay asleep more easily. It also has been designed with the Simbatex foam - an ‘open cell’ foam, with thirty times the airflow of memory foam for better temperature control. £959.40 (save £640) Shop  Simba Hybrid Luxe Mattress (Double) For your most indulgent sleep yet, why not opt for the Simba Hybrid Luxe Mattress.With a back-cradling, ten layers in total, including a double-stacked layer of micro springs at the top and another layer at the base, along with breathable foam and wool layers that don't trap heat or moisture, you can rest assured you'll sleep comfortably throughout the night. £1,379.40 (save £920) Shop  Simba Hybrid Topper (Double) For a comfort boost or to revive an old mattress, then the Simba mattress topper could be a savvy investment when on a budget.Dubbed 'the next best spring' to a new mattress, the mattress topper is crafted from a combination of spring and foam to act as an extra layer between you and your mattress, providing you with additional support whilst you sleep. £226.85 (save £122.15) Shop  Simbatex Foam Mattress (Double) The brand's latest mattress is a luxuriously deep foam mattress featuring four layers of cooling, supportive sleep tech. The innovative open cell structure of the foam ensures 30 times more airflow, so is ideal if you're a hot sleeper or worried about any heatwaves coming this summer.  £479.40 (save £320) Shop  Simba Hybrid Duvet  (Single) If you need a new duvet ahead of the warmer months, then the Simba Hybrid Duvet is the perfect combination of warmth and down-like softness.The ultra-fine Simba Renew fibres keep this 10.5 Tog duvet light and encourage airflow, while the ingenious cooling technology on one side helps control body heat.  £104.25 (save £35) Shop"
    ]
}