{
    "articleURL": "/news/article-12039633/Panicky-moment-Gold-Coast-seller-went-missing-auction-luxury-6million-home.html",
    "content": [
        "Home owner goes MIA at auction Agents at auction forced to delay Seller was having 'reception issues' A luxury home has been sold for whopping $6million despite its seller going AWOL for hours during the crucial bidding process. ",
        "The five-bedroom property at 126 Amalfi Drive, Isle of Capri on the Gold Coast was expected to go under the hammer at 11am on Saturday.But the owner was uncontactable while in China due to 'bad reception' leaving 22 people, including three registered bidders, in the lurch. Ivy Realty Principal Ivy Wu said it was an unusual situation after the agent had organised the seller to be available on the day.'It was something that had never happened to us before, he was overseas and he [told us later]the reception wasn't that great,' Ms Wu told Daily Mail Australia.",
        "The highest bidder offered $5.65million falling short of the $6million price the owner wanted for the two-storey home on the Nerang riverfront. The realtor was forced to stall the negotiations after she and her team tried calling the seller multiple times.'We had to announce to everyone saying we couldn't get a hold of the seller,' she said.'It was interesting because it's normally the buyer that doesn't turn up, not the seller, but we handled it right because we told the buyer it was out of our control.'Ms Wu said they finally reached the seller in the afternoon where negotiations continued with the keen bidder.The buyer finally agreed to part with $6million for the massive house by Sunday. ",
        "'We are glad the buyer was patient enough,' Ms Wu said.  Meanwhile, auctioneer Nigel Long said the no-show was the third time in his 15-year career where a seller had not turned up at their auction. 'I just explained to the crowd that we were having telephone communication issues,' Mr Long told the Gold Coast Bulletin. 'It's not the first time and it won't be the last.'The property boasts a pool by the riverside, a pontoon, a wine room and media space had attracted a lot of interest leading up to the auction. The luxurious home was sold for $4.5million in September, 2020. "
    ]
}