{
    "articleURL": "/tvshowbiz/article-12052181/Christina-Ricci-embraces-cool-mom-son-Freddie-8-Jennifer-Hudson-Show.html",
    "content": [
        "Christina Ricci embraced being a 'cool mom' as she opened up about motherhood and her two children, son Freddie, and daughter Cleo, while stopping by The Jennifer Hudson Show on Friday. ",
        "The Addams Family star, 43, who recently admitted that becoming a child star made her 'obnoxious,' revealed her son, eight, was a big fan of her TV shows, such as Wednesday and Yellowjackets. The actress shares Freddie with her ex-husband, James Heerdegen, and welcomed daughter Cleo, with current husband, Mark Hampton, whom she tied the knot with in 2021. Towards the beginning of the interview, Jennifer asked the mother of two, 'Does your son watch your shows?' prompting Christina to respond with, 'He watched Wednesday twice. He loved it so much.' She humorously revealed, 'And then he wanted me to dye his hair black. He was like, \"How can I look like a male Wednesday?\" And I was like, \"I can't be involved with this,\"' she added with a laugh. ",
        "Christina also explained that her son has visited her on set of the hit Showtime series, Yellowjackets, in Vancouver on more than one occasion. 'He came up to visit and he came on set and was like, my little assistant on set and loved it and had such an amazing time.' 'But then he said to me, \"How can I be expected to be on set and work on the show if I've never seen it,\"' the actress stated, adding air quotes around 'work on the show.' ",
        "The star continued, 'He's very good at badgering me and finally I was like, \"okay fine you can watch the show.\" I sat down with him. I fast forwarded all the inappropriate parts and he just, is obsessed.' Jennifer then quickly cut in to ask, 'So he knows he has a cool mom,' with Ricci admitting, 'He has told me that I'm cool.' She humorously added that he doesn't exactly listen to her and stated, 'He's just like, \"Yeah, all my friends think you're the coolest mom.\"' The star plays the role of Marilyn Thornhill in the hit Netflix show, Wednesday, and also portrays Misty in the Showtime series, Yellowjackets. In regards to the character of Wednesday that she portrayed in The Addams Family, Christina expressed that Freddie, 'was obsessed with how naughty my character was. Just like, \"Oh my God, mom, were you really going to kill your brother?\"' ",
        "Along with being a fan of his mother's projects, Christina also gushed how he enjoys being an older brother to his 16-month-old sister, Cleo. 'She's really sweet. She's obsessed with her older brother, too. She chases him all over the house.' In the past, the beauty has opened up about becoming a mother and expressed during an interview with Net-A-Porter's The Edit, per People, that, 'Marriage shows you your flaws in how you deal with things, and having a child forces you to grow up at the speed of light.' ",
        "She further added to the outlet that, 'I'm a completely different person than I was before I had my child.' While talking to Jennifer Hudson on Friday, Christina also proudly revealed that she would soon welcome a new addition into their family. 'We are getting a kitten,' Ricci announced, adding, 'I'm really excited about this.' The star revealed that her 'dream cat' was a Maine Coon, which is the largest cat breed and stated 'they are dog-sized cats!' 'I mean, can you imagine how great it would be to cuddle a dog-sized cat.' After Jennifer gave a rather concerned reaction, she added, 'I mean, you'd want to make sure it was a nice cat because a cat that size would be dangerous if there was something wrong.' On the show's main Instagram page, a video of the interview was also shared along with the caption of, '@riccigrams is definitely a cool mom.' Christina, who stunned in an elegant green dress, also shared a cute photo of herself posing with Jennifer on set of the talk show, and excitedly penned, 'I’m on @jenniferhudsonshow today! I’ve always loved @iamjhud and after meeting her I can say she’s an absolute dream. Thank you for having me on the show!!!!'  ",
        "The star, who turned heads in a figure-hugging, silver gown at the MET Gala earlier Monday in NYC, recently revealed that becoming a child star had made her 'obnoxious' during a new interview on the Reign With John Smith podcast. ",
        "While landing bigger roles in her 40s, she admits she didn't cope with the glaring spotlight in the best way when she was a child actor. 'Some people deal better with fame than other people and some people have more supportive families than other people,' she says. 'And I do think that having a \"famous child\" is a weird pressure to put on a child.' 'I think it's - and I always thought this when I was younger - when being asked questions about who I was before I knew who I was, I knew that that was not helpful as a kid, which is probably why I was so obnoxious in interviews all the time…''I find it interesting because anytime I do work with someone who has been a child actor, they are the most professional people on set.' 'They are the people that understand the sacrifices that are going to have to be made. They're always the most prepared, they're always the most adaptable, as far as working with them.'",
        "Christina says having to audition when she was just seven helped her deal with rejection and she deals with it better in her professional career than in her personal life.'I think professionally I'm actually very good at being rejected,' she says. 'I mean, you might be p****d off for an afternoon or a day, but I've never been somebody who lets it destroy me.",
        "'I feel like real life, your personal life is so much more difficult. My personal life is more difficult and requires a lot more of my focus and I emotionally react to it more than my professional life.'Christina finalized her divorce from film producer James Heerdegen in December of last year, two years after their bitter split. She tied the knot with hairstylist, Mark Hampton, in 2021. "
    ]
}