{
    "articleURL": "/news/article-12057701/Batemans-Bay-man-unscrews-lightbulb-takes-room-room-cost-living-crisis-spirals.html",
    "content": [
        "Man uses single lightbulb in his rental homeCost of living pressures means he has to budgetHe only takes cold showers and eats no-cook food A single father has taken to unscrewing a lightbulb and taking it from room to room to help alleviate rising cost-of-living pressures. ",
        "Martin Bongiorno uses a single lightbulb in his rental home at Bateman's Bay, on the NSW south coast, to cut down on skyrocketing power costs. Mr Bongiorno told the ABC he has been a strict budgeter after an accident at work saw him become reliant on workers' compensation payments. The former delivery driver was forced to employ some strict money-saving tactics after falling $2,000 behind on his electricity bills. 'I have one lamp positioned in the middle of the room and if I need to move from one room to the next, I just take out the light bulb and move it to the next room,' he said. The lone lightbulb is just one of the ways Mr Bongiorno is able to save on power. ",
        "He doesn't eat foods that need cooking, only takes cold showers and only turns his single lightbulb on when it is completely dark outside. After his rent was increased by $40 a week, Mr Bongiorno was forced to cut back on his weekly budget, allocating $15 a day for food and $20 a week for power. The single dad said it was 'draining' having to calculate every single expense. 'You're constantly in this sort of survival mode,' he said. 'It's exhausting because you realise this is not a temporary thing.' ",
        "It comes as the Albanese government pledges to help over five million households pay their soaring energy bills in the upcoming federal budget. However, the government has established income threshold limits for families dependent on the number of children in a household and their respective ages. In April, Australians across four states were told to expect steep electricity hikes after the country's energy regulator flagged rises of up to 31 per cent. Victorians were told their bills would increase by almost a third while NSW, Queensland and South Australia were also slapped with steep hikes. On Sunday, Treasurer Jim Chalmers said the new measure would allocate $500 to each household to help with bills and more than one million small businesses. Homes and businesses will be eligible for several hundred dollars to help with their power bills to take the edge off rising cost of living pressures. The amount made available will depend on the cost of electricity for the area. Dr Chalmers said it would also depend 'on how much the states and territories are willing to kick in because this is a co-investment with them' as to how generous the relief will be in different parts of Australia.",
        "The measure will also be targeted to help alleviate pressures on the 'most vulnerable' but won't just be restricted to age pensioners. ",
        "Australians have been warned not to expect vast government spending in Tuesday's budget, as they struggle with decades-high inflation and interest rates which have risen 11 times in just over a year.On Tuesday, the RBA shocked most financial analysts by lifting the cash rate to 3.85 per cent, adding hundreds of dollars to the cost of the average mortgage.The move - the 11th rate rise during the past year - flies in the face of the financial markets, which had almost unanimously predicted the RBA would leave rates on hold.In a further shock to borrowers, the RBA has also left open the possibility of further rate increases, with Reserve Bank Governor Philip Lowe describing inflation as still too high at 7 per cent in March.That is down from December's 32-year high of 7.8 per cent - but the RBA's target range for inflation is between 2 and 3 per cent.'Inflation in Australia has passed its peak, but at 7 per cent is still too high and it will be some time yet before it is back in the target range,' Dr Lowe said."
    ]
}