{
    "articleURL": "/health/article-12041351/Covid-guru-Sir-Patrick-Vallance-DOESNT-rule-virus-lab-leak-theory.html",
    "content": [
        "Scientist also hot back at critics of his pandemic comments in farewell speechRead more: Jab mandates 'morally akin' to sexual harassment, philosopher saysCovid having emerged from a lab leak cannot be ruled out according to the top scientist who helped lead Britain through the pandemic. ",
        "Sir Patrick Vallance, England's former Chief Scientific Adviser, told MPs during his valedictory speech today that the virus 'more likely' swept the world after a person was infected by an animal.But he said whether the virus could have leaked from a lab it was being studied in was a question of how secure the facility was.Nicknamed 'Dr Doom' for gloomy statements and being the bearer of bad news during the Covid crisis, Sir Patrick resigned from his official role last month. In his appearance before the Science, Innovation and Technology Committee today, he also fired parting shots at critics who had attacked his position on masks and herd immunity during the pandemic.",
        "When asked about the origins of the virus that made him a household name, Sir Patrick said that while the likeliest culprit was Covid coming from an animal, a lab leak was also a possibility.Many scientists back the natural origins theory, believing that the virus originated in bats and infected an intermediary species — possibly a pangolin — before then infecting humans. However, others believe the virus was leaked — accidentally or on purpose — from the Wuhan Institute of Virology (WIV), which was conducting experiments on live bats. 'Could a sample be taken into a lab and then that have leak out? You can't really answer that question biologically, it's not a biological question, it is a security question,' he said.",
        "'I think it's less likely...I think it's much more likely that this is a zoonotic overspill.'He said there were multiple opportunities for bats, the animal believed to be the biological source of the Covid virus, to pass it on to animal species held at the market which could have then infected humans. And in a last flash of 'Dr Doom' he suggested that a zoonotic overspill origin for Covid could in fact be worse because it makes it 'very likely' a similar virus with pandemic potential could emerge in the future. Where Covid came from is a hotly contested topic with a lab leak origin, once dismissed as a conspiracy theory, having gained traction over the course of the pandemic. Even the former head of China's top health body has now admitted a lab leak might have spawned Covid.MPs also asked Sir Patrick about the experiments some scientists suspect might have sparked the pandemic, known as gain of function research.  This is hugely controversial field of research that can involve purposely manipulating pathogens to make them more dangerous.In theory, it can help scientists get a head start on developing treatments for viruses that could naturally evolve to become deadlier. But critics of the technique warn that it poses a massive risk to human health — if the pathogens ever escape.",
        "Scientists at WIV, which is at the centre of the lab leak theory, have been accused of conducting such research on bat coronaviruses, but those who helped fund them have insisted these experiments were not gain of function.",
        "Born in Essex in the 1960s, Sir Patrick Vallance dreamed as a child of being a 'dinosaur hunter'.But ambitions of becoming a highly-renowned palaeontologist were soon abandoned in favour of a career in medicine.He was educated at Truro school in Cornwall, which costs nearly £30,000 to board now.Before becoming a household name for steering the nation through Covid, he spent time teaching at St George's, University of London, where the now 62-year-old graduated in the 1980s.He later became a specialist in the area of both diseases of blood vessels and endothelial biology. Sir Patrick, who describes his 'guiltiest pleasure' as driving fast cars, also spent a decade teaching at University College London. He joined British pharmaceutical giant GlaxoSmithKline in 2006 and worked there until 2017.After six years at GSK his base salary as Executive Director was said to be £780,000 a year.When he left to become No10's chief scientific advisor in 2018, he cashed in £5million worth of shares he got from them from his time working there until March 2018.During the pandemic, it transpired that Sir Patrick Vallance still had £600,000 of shares. It sparked controversy because GSK was one of many firms racing to develop a Covid vaccine.Married to former GP Sophie Dexter, the couple live in a semi-detached Victorian house worth £1.8m, which they bought in 2018 with cash.The street they live on is lined with expensive cars, with an R-class Mercedes once spotted parked on their own drive.They had to complete extensive renovations after it had been left completely gutted by a fire before they were involved in the property.The pair have three children together — who all think their father, knighted originally in 2019, is 'geeky'.",
        "Sir Patrick defended gain of function as a whole but acknowledged there were issues that needed to be addressed on the security measures in place at labs conducting such experiments. He said: 'Gain of function mutation is incredibly important for all sorts of areas of beneficial science and therapeutics. 'It is of course about biosecurity lapse, and I do think there is a need to make sure that biosecurity is properly regulated across the world.' The 63-year-old, who is resigning from his £185,000 role to become chairman of the Natural History Museum's Board of Trustees, also fired parting shots to his critics.The Government's stance on masks during the pandemic has come under fire, after ministers originally said the public did not need to wear them, before U-turning.Asked about criticism of the masking policy, Sir Patrick said: 'In my experience during Covid, the louder the voices, the lower the evidence base.'There were lots of uncertainties and lots of strong opinion and all sides.'He also hinted to recent studies that suggested face coverings were not the sure-fire solution to stopping infections. 'The evidence around the effects of masks changed and grew over time and I think pretty much ended up where lots of people thought at the beginning in terms of where they might be most effective,' he said.",
        "Sir Patrick admitted to MPs that he used 'clumsy wording' at times during the pandemic, pointing to his controversial comments about herd immunity.He faced huge backlash in the early days of the pandemic for, on a least three occasions, saying that the aim was to 'build up some degree of herd immunity'.Herd immunity is when a disease effectively runs out of people to infect, as enough of the population have some form of protection. But the comments sparked a furore because it suggested the Government was prepared to allow millions of Brits to get infected, some of whom would inevitably die, under the strategy. Speaking today about the row, Sir Patrick said: 'The mistake I made was to answer a question about herd immunity.'He claimed he had been misunderstood the question and that he was highlighting that herd immunity was how pandemics end.  Sir Patrick said: 'Because the question I was trying to get at was not \"there needs to be a strategy to get that\" but fundamentally that's how you end pandemics, people get immunity through vaccines and through catching infections. 'That's absolutely not the same as saying what you want to do is go out and deliberately and got out and get people infected.'",
        "He also fended off criticism of the Scientific Advisory Group for Emergencies (SAGE) — a group of scientists who advised Government during the pandemic.",
        "SAGE has been accused of not considering the economic impact of its recommendations to ministers.Prime Minister Rishi Sunak is among those who has been critical of SAGE at one point saying it had been a mistake to 'empower' the committee.But Sir Patrick hit back at suggestions SAGE should include economists into its stable of experts, labelling them 'completely wrong'.'The notion of bringing together all of the sciences and economics in a single advisory board is incorrect because it leaves ministers not having to make the trade-offs they need to make,' he said. 'It's a sperate question about whether economics and other things should provide input to that side of the equation for ministers to consider.'Sir Patrick has famously hit back at suggestions SAGE were scaremongering during the pandemic, arguing that it wasn't his job to be an optimist but to give ministers the data. Asked about what he was proud of during his reign as the nation's top scientist, Sir Patrick said supporting the development and deployment of Covid vaccines and the 2021 United Nations Climate Change Conference, known as COP26, featured highly.Sir Patrick served as the Government's Chief Scientific advisor for five years, first taking on the role in 2018.He is being succeed in the role by Professor Dame Angela McLean, an expert on the spread of infectious diseases from Oxford University, who previously worked as the Ministry of Defence's chief scientific adviser. "
    ]
}