{
    "articleURL": "/wires/pa/article-12057097/Ashes-hopeful-Olly-Stone-set-scan-hamstring-injury.html",
    "content": [
        "Ashes hopeful Olly Stone is set to undergo a scan to determine the severity of a hamstring problem.",
        "Stone, who has had a luckless run with injuries, pulled up late on Saturday during an over and shuffled off the field in Nottinghamshire’s LV= Insurance County Championship clash against Lancashire.Despite being in obvious discomfort, Stone hobbled to the crease at Trent Bridge on Sunday as last man and kept out the last four legal deliveries of the Division One match to help his side salvage a draw.Attention will now turn to his aggravation and it is understood he will be examined more thoroughly once any inflammation in the area has subsided, most likely within the next couple of days.Stone’s ability to generate speeds upwards of 90mph make him an attractive option for England’s six Tests between the start of June and mid-July – one against Ireland and five versus Australia.England captain Ben Stokes has indicated he wants eight fit seamers to call upon, all of whom can be rotated to share the burden, with Stone, Jofra Archer and Mark Wood providing the express pace options.Stone made his England comeback last winter after recovering from a fourth stress fracture in his back – he had an operation to reinforce his lower spine with two metal screws – and a broken finger.",
        "He played in four ODIs and a T20, was an unused squad member during England’s Test tour of New Zealand in February and, on the eve of the county season, spoke of his determination to put his injury woes behind him.",
        "“It’s been encouraging with how much cricket I’ve had under my belt this winter and come through it,” said Stone, who played the last of his three Tests in June 2021.“I’m feeling fit and strong and just raring to get stuck in now. I’ve looked at things in the past, injuries got in the way and I’ve been quite disappointed so I try not to look too far ahead.“But everyone knows how big a summer it is and I’d be lying if I said it wasn’t on the radar.”"
    ]
}