{
    "articleURL": "/tvshowbiz/article-12059369/Helen-Flanagan-reveals-got-trouble-Coronation-Street-bosses-fake-tan.html",
    "content": [
        "Helen Flanagan used to get in 'trouble all the time' with Coronation Street bosses for ruining scene continuity with her love of fake tan. ",
        "The actress, 32, who played Rosie Webster in the soap until her exit in 2018, admitted ITV executives would go 'absolutely mental' when she would come in 'really pale' one day and 'bright orange' the next. Speaking on I'm A Celebrity... South Africa, she said: 'I used to get in trouble all the time because of my fake tan. One time I'd be really pale and then the next time I'd be bright orange.'They go mental if you do stuff like that, they go absolutely mental. They flip if continuity changes mid-scene.'Dean Gaffney also reflected on his time on EastEnders playing Robbie Jackson and admitted he once had blunder by getting an eyebrow tint while filming. ",
        "He said: 'I was going to Dubai so I nipped off between scenes for a tint but I fell asleep and she left it on too long. 'First person I saw was [co-star] Danny Dyer. He was like: \"You alright son?\" but make-up were fuming. They were rubbing at them [eyebrows] for ages, exfoliating, all sorts.' During Friday's episode, Joe Swash complained he had the 'worst outro ever' on EastEnders as the campmates discussed their challenging experiences in the television industry.The contestants discussed the BBC One soap opera as both Joe and Dean both previously starred in it.",
        "Dean revealed he would go back to the show even after returning five times already.The discussion led to Joe, who previously portrayed Mickey Miller on the show, admitted: 'I wouldn't mind (going back), you know. 'Purely because of the family. Because you know what you're doing, how you're doing it, when you're doing it. They've never asked me to go back in again, not once, mate!'When asked about how things ended for his character, the actor added: '(It was) the worst outro ever... I didn't even leave at the end of the episode.'You know you leave and you get the \"duff duff\"? Mine, I went to Norwich to be a bellboy at a hotel and mid-scene just walked in The Vic, went, \"See you later\", turned back to Phil, come to me and I'd gone.'What? That was it? No \"duff duff\". I was there five years and not one \"duff duff\"!'I'm A Celebrity... South Africa continues at 9pm on ITV1 and ITVX on Monday."
    ]
}