{
    "articleURL": "/news/article-12056711/King-Charles-sorrow-Prince-Harry-disappearing-act-Archie-birthday.html",
    "content": [
        "Follow all the latest royal news and updates on Coronation events on MailOnline's live blog hereThe King raised a glass to toast the fourth birthday of Prince Harry’s son Archie at Buckingham Palace yesterday in a moving to tribute to the grandson he has barely seen.",
        "Despite the ongoing acrimony with Harry, who was on a plane back to the US within hours of his father being crowned, emotional Charles made a point of mentioning his absent grandchildren as well as those present on his big day.The poignant moment came at a private family gathering at the palace following his Westminster Abbey crowning and appearance on the balcony with Queen Camilla.It is understood that an invitation had been politely extended to Harry to join the family lunch but he decided to return to California to celebrate Archie’s big day.His wife, Meghan, stayed behind with their son and daughter Lilibet, and was said to be organising a small party for family and friends.A well-placed source said that, while most members of the Royal Family ‘breathed a sigh of relief’ that Harry didn’t join them, the King, 74, seemed ‘genuinely quite disappointed that he didn’t stay’.",
        "Before they started eating, Prince William, 40, stood and congratulated his father on such a momentous day.",
        "Charles replied, thanking everyone who had worked hard to make the day so special.The King raised a glass to his three grandchildren Prince George – who also served as a Page of Honour – Princess Charlotte and Prince Louis, who were among the stars of the show and carried out their public appearances with aplomb.",
        "But he made a point of also toasting ‘those that weren’t there’ and wished his other grandson a very happy birthday ‘wherever he was’.‘It was apparently a very sweet moment,’ the source said.It is understood that as well as the King, Queen and members of the Royal Family, others present included Camilla’s close family – her sister Annabel, best friend, Lady Landsdowne, both of whom served as her attendants on the day, as well as her children, Tom Parker Bowles and Laura Lopes, and grandchildren, Lola, Freddy, Eliza, Louis and Gus.The Princess of Wales’s family were also invited, with her parents Michael and Carole Middleton and siblings Pippa and James present.Staff put on a ‘running buffet’ at the palace while the official Coronation pictures were being taken by society photographer Hugo Burnand.The family were offered glasses of fizz and canapes including mini broad bean and tarragon Coronation quiches – the official dish of the Coronation weekend.There was also a ‘modern take’ on Coronation chicken canapes as neither the King nor the Queen is a big fan of the famous mayonnaise and curry dish created in Queen Elizabeth’s honour in 1953.Afterwards most of the family decamped to Windsor Castle where they held a private family drinks party. There was also a private family gathering after the official eve-of-Coronation reception at Buckingham Palace.",
        "But on both occasions very little alcohol was served as everyone needed to ‘keep a clear head’.No-one was inclined to hang around at the palace, the monarch’s official London residence, after yesterday’s ceremony as it is still undergoing extensive renovations.Staff even had to put down temporary floorboards in order for the family to get to the balcony to wave to the crowds.",
        "The King travelled up to Highgrove, his beloved country home in Gloucestershire, for some ‘R&amp;R’ (rest and relaxation) after such physically and emotionally draining day. It is not known whether Queen Camilla travelled with him but she also left London.She enjoys spending time at Ray Mill, her home in Wiltshire which she bought following her divorce from her first husband, Andrew Parker Bowles.The couple would normally have stayed at Windsor but the palace was ‘exceptionally noisy’ as last-minute preparations and rehearsals were being made for tonight’s Coronation concert.The King and Queen are expected to attend a VIP ‘after party’ at Windsor Castle tonight for family, friends and some of the star performers at the concert, including Lionel Richie, Katy Perry and Take That.It meant the 1,000-year-old royal residence will be rocking into the early hours of tomorrow morning."
    ]
}