{
    "articleURL": "/tvshowbiz/article-12057153/Cat-Deeley-looks-glamorous-white-thigh-split-gown.html",
    "content": [
        "Cat Deeley looked glamorous as she cosied up to her dapper husband Patrick Kielty at the 20th Irish Film and Television Academy Awards in Dublin on Sunday night.",
        "The presenter, 46, showed off her sense of style in a white thigh-split gown for the event where she dazzled on the red carpet.The star put on a daring display in the skimpy number which revealed her toned and tanned legs and also had a cut-out section at the front.She completed the look with chunky gold heels and toted a sparkly silver clutch bag in her hand.Cat wore her blonde tresses in perfect styled curls over her shoulders and opted for a typically bronzed makeup look. ",
        "Beside her Irish Patrick, 52, looked dapper in a black suit and crisp white shirt which he teamed with a bow tie and shiny black shoes.The family made London their home once again at the beginning of the 2020 pandemic when they relocated to the capital.Cat and Patrick left the US with their two sons Milo, six, and James, four, almost three years ago after 15 years of living in Beverly Hills.The star previously revealed the 'catalyst' for the family's departure was the terrifying moment Patrick and their eldest son narrowly avoided a public shooting incident at the Century City Mall.The couple were also keen for their boys to be schooled back home in the UK and be closer to their friends and family.",
        "The family were back in LA last year, but only temporarily, with Cat telling The Telegraph that they had relocated for the school holidays and would return to the UK when her show wraps.'You have such a small amount of time when everyone wants to hang out, so we moved back to take advantage of that. And then the pandemic hit…' she explained of how they have settled back in the UK.'We didn't want to put anyone at risk in the pandemic because, well, young kids! But we're making up for it now.",
        "'I taught Milo how to read and how to ride a bike in the pandemic. It was nice to all be together.'It comes after Cat shocked viewers of the Ellen show in June when she revealed her 'naughty' sons refuse to keep their clothes on.Cat laughed that 'it's fine now but not when they are 17 and doing it in supermarkets'.The TV personality was on the daytime show to speak about So You Think You Can Dance which had been delayed by two years due to the pandemic.She laughed: 'They look at me in the eye and say ''Mummy lets get handsome'' and then take everything off. Well that's not technically correct but I like their positive body image'.",
        "Cat and Patrick tied the knot in a traditional Catholic ceremony in Rome, Italy, in September 2012, which was an intimate affair with just six family and friends each.The couple were friends for 10 years before they tied the knot and Patrick insisted there was 'always a spark' between them before their relationship became romantic.",
        "He said: 'There was always a little bit of a spark between us but either she was with someone or I was with someone and by the time we were both single she was in America.'It was always one of those things that never worked out.'Women tend to be in charge and we men just have to get on the pitch, stand on the leg that's shaking most and not drop the ball when it comes our way.'The pair met when they presented Fame Academy together in 2002 and remained friends for almost a decade before making their debut as a couple in March 2012 and they married six months later."
    ]
}