{
    "articleURL": "/sport/football/article-12047939/Micah-Richards-claims-Vincent-Kompany-Carlos-Tevez-FIGHT-Man-City.html",
    "content": [
        "Micah Richards played with Vincent Kompany and Carlos Tevez at Man City He has revealed that the pair had a fight during their time at the clubRichards said Tevez landed two punches to Kompany's face when they fought Micah Richards has revealed Vincent Kompany and Carlos Tevez had a fight during their time together at Manchester City, with the Belgian defender taking multiple blows to the face.",
        "Kompany and Tevez shared a dressing room at the Etihad Stadium between 2009 and 2013, helping City to their first Premier League title in 2012.But Richards has revealed the pair did not always see eye to eye, and this led to a bust-up in front of the whole squad.'Tevez and Kompany had a fight,' Richards said on the Filthy Fellas YouTube channel.Richards' revelation left those around him stunned, and they instantly wanted to know who came out on top. The former City full back admitted it was hardly a fair fight as the team quickly got involved to try to cool Kompany down, but there was no stopping Tevez.",
        "'It was weird because we were holding Kompany back because when he goes he's going. And then Tevez (motions swinging punches). Kompany couldn't do nothing because we were holding him back,' Richards explained.Richards was then asked how many punches Tevez landed on his skipper, to which he replied: '(A) couple. But the thing is, Kompany, he ate them.'Kompany was a no-nonsense defender during his 11-year spell at City, and Richards has conceded you did not want to get on the wrong side of the centre back.He claimed that he almost came to blows with Kompany as well after they had a disagreement in training. ",
        "'There was a training ground incident and he kept smashing one of the young boys. And I was like \"Kompany, man, just chill out\". He was like 20, young but small, I can't remember his name,' Richards said.'Kompany said shut up to me. So I was there like \"you shut up!\" So I was like \"this could happen, you know\". And he's the captain, you've got to respect your captain, but when Vinny goes, that could have been difficult for me.'Kompany has carved out a successful coaching career since leaving City four years ago, and has led Burnley back to the Premier League at the first time of asking this season.He is set to return to England's top-flight with the Clarets next term, despite interest from Tottenham who are still looking for a permanent replacement for Antonio Conte. "
    ]
}