{
    "articleURL": "/news/article-12041129/Cabinet-Secretary-Simon-Case-forced-ministers-publishing-Sue-Gray-report.html",
    "content": [
        "Government briefed that a damning Cabinet Office report would be released But in the end only a brief statement was released by DPM Oliver DowdenMinisters pulled out of issuing a critical report into Labour's hiring of the civil servant behind the Partygate investigation after the Cabinet Secretary got 'cold feet', it was claimed today.",
        "The Government had briefed that a damning Cabinet Office report into Sue Gray's decision to join the opposition would be released last night. But in the end only a brief statement was released by Deputy Prime Minister Oliver Dowden, saying Ms Gray had refused to co-operate with the probe.The Times this morning reported that Mr Case talked ministers out of publishing the full report over legal fears and a lack of basic information due to her non-involvement. One source branded it a 'political gimmick'.It will now be down to the Advisory Committee on Business Appointments (Acoba), to decide whether any restrictions should be placed on Ms Gray over her employment by Sir Keir. She has co-operated fully with its investigation.",
        "A Tory source said last night: 'The fact that Sue Gray is refusing to co-operate tells you all you need to know about this grubby deal. It's like an experienced lawyer has told her to say no comment to every question in a police interview.'Sir Keir said very clearly in March that Sue Gray would lay out when she entered into talks with Labour. The fact she is refusing to do so means it's time for Starmer to come clean.'Tory former Cabinet minister Nadine Dorries said: 'Boris Johnson complied with Sue Gray's Partygate probe, but now the spotlight is on her she's lost for words. If she won't explain, Sir Keir Starmer needs to set the record straight.'",
        "Tory MP Mark Jenkinson criticised Ms Gray's approach to the Cabinet Office probe.'When Sue Gray was in the Propriety and Ethics Team, how might she have reacted to someone who failed to comply with her investigations?' he posted on Twitter.'What might she have said about Partygate witnesses if they'd declined her offer of a chat?'But Sir Tony Blair's former chief of staff said the report was a 'political stunt'.Jonathan Powell, who left the diplomatic service to work for the former prime minister, told BBC Two's Newsnight: 'We were briefed all day yesterday and today it was going to be full of these sins committed by Sue Gray and there's been absolutely nothing in it at all.'And I'm not surprised she didn't cooperate with it, it's not appropriate at all.'What she should be cooperating with, and she is, is Acoba, the correct body to apply to in these cases.'So I think today has really been a complete diversion and the real thing is Acoba.'Ms Gray was a 'long-standing civil servant who has a very clear grasp of the rules', he said, adding: 'If she says she's applied the rules, I believe her.'",
        "In his statement Mr Dowden revealed how the former senior civil servant chose not to give evidence to the Cabinet Office inquiry.",
        "He pointed towards confidentiality concerns as he admitted he was not yet able to provide 'further information' in the row over Labour's attempt to poach Ms Gray.He said the Government would consider its 'next steps' and had made 'submissions' to Acoba.The Deputy Prime Minister only reiterated that the civil service code requires that contacts between senior civil servants and top opposition politicians should be cleared with ministers.Giving an update on the Cabinet Office probe into Ms Gray's dramatic resignation in March, Mr Dowden wrote: 'I can update the House that Ms Gray was given the opportunity to make representations as part of this process but chose not to do so.'I hope the House will understand that, in order to maintain confidentiality towards an individual former employee, I am unable at this stage to provide further information relating to the departure of Ms Gray whilst we consider next steps.'Mr Dowden promised to provide a further update to MPs 'in due course' but suggested, in the meantime, it would be left to Acoba to make a ruling.'The Cabinet Office has made submissions to Acoba, the independent appointments watchdog, in relation to Ms Gray's application for advice under the Business Appointment Rules, prior to her taking up an appointment as Chief of Staff to the Leader of the Opposition,' he added.",
        "'The Government's confidential assessment is in line with the usual process and Acoba will consider evidence from a range of sources to make a recommendation on any appropriate restrictions on the appointment.'As set out in the Business Appointment Rules, the aim of the Rules includes avoiding any reasonable concerns that 'a former civil servant might improperly exploit privileged access to contacts in Government or sensitive information.'The decision on any recommended restrictions on the appointment is for Acoba.'"
    ]
}