{
    "articleURL": "/wires/reuters/article-12057579/Rays-overcome-6-run-deficit-against-Gerrit-Cole-beat-Yanks-10.html",
    "content": [
        "Isaac Paredes had an RBI single with one out in the 10th inning to lift the Tampa Bay Rays to an 8-7 win against the visiting New York Yankees in the rubber game of their three-game series on Sunday afternoon.",
        "Paredes hit an opposite-field line drive to right off Albert Abreu (1-1) to score Brandon Lowe from second base.Jose Siri and Christian Bethancourt homered for Tampa Bay, which came back from a 6-0 deficit.Harrison Bader homered, tripled, singled and scored three runs for New York. Anthony Rizzo also went deep.Yankees ace Gerrit Cole breezed through four innings before giving up two runs in the fifth and four in the sixth to blow the six-run lead. Cole gave up six runs (five earned) and eight hits, striking out six and walking two in his five-plus innings.Aaron Hicks began the 10th inning on second base for the Yankees, but was tagged out in a rundown between home and third for the second out. Rays reliever Garrett Cleavinger injured his leg during the play and was replaced by Jalen Beeks (1-2), who struck out Rizzo to end the scoreless frame.Javy Guerra pitched a scoreless first inning for the Rays before Josh Fleming followed with five innings of relief. He allowed six runs and seven hits while walking four and striking out one.The Yankees took a 1-0 lead on a solo homer by Rizzo in the third inning, followed by a two-run shot from Bader to make it 3-0.",
        "Hicks and Gleyber Torres had RBI doubles in the fourth to stretch the lead to 5-0.Bader led off the fifth with a triple and later scored to make it 6-0.Siri went deep in the fifth to trim the lead to 6-1. The inning continued with Wander Franco's infield single and an ensuing throwing error that made it 6-2.Harold Ramirez and Paredes delivered back-to-back doubles in the sixth to make it 6-3.The Yankees left Cole in the game after he walked Manuel Margot to put the tying run aboard. Bethancourt followed with a three-run homer to tie the game 6-6 and end Cole's day.Jimmy Cordero came in and walked Siri, who eventually scored on a groundout to give Tampa Bay a 7-6 lead.Bader led off the seventh with a single and came around to score on Jose Trevino's grounder to tie the score 7-7.--Field Level Media"
    ]
}