{
    "articleURL": "/wires/aap/article-12048701/Sydney-referees-wear-body-cameras-assault.html",
    "content": [
        "Body cameras will be worn by referees in a Sydney football association a week after their colleague had his jaw broken by a suspended player.",
        "Khodr Yaghi, 45, needed reconstructive surgery and spent four nights in hospital after being bashed at the end of a match in Padstow last Friday.In response, Bankstown District Amateur Football Association will from Friday begin a body camera trial for referees in men's premier league matches.\"Once the trial is running and we have evaluated its effectiveness, we will look to roll out body cameras in other competitions,\" the league said.The league has also cracked down on abuse directed at referees, saying some coaches and managers considered it \"their right to question or worse, argue or abuse referees\".Coaches and managers who approach referees before, during or after a match to question decisions will be red-carded and cause their team to forfeit the match.Dissent or abusive language from the sidelines will continue to be policed with a yellow card but a repeat instance will result in the manager's suspension and a team's forfeiture.Serious abuse can result in the loss of competition points.Teams have been asked to form a guard of honour for referees at all matches this weekend.\"We want to actively demonstrate to the BDR (Bankstown Football Referees), that our participants care and support them, and anti-social behaviour is not welcome in our game or Bankstown,\" the league's board said.",
        "The attack, which broke Mr Yaghi's jaw in three places and knocked out three teeth, drew widespread condemnation from the football faithful, politicians and the wider community.Former Australian footballer Craig Foster dubbed it \"absolutely horrific\" while Sports Minister Steve Kamper sought assurances from governing body Football NSW that the strongest possible action would be taken.The player alleged to have attacked Mr Yaghi was charged with affray and wounding with intent to cause grievous bodily harm.He has been remanded in custody until June 28."
    ]
}