{
    "articleURL": "/wires/ap/article-12049509/Pride-organizers-eye-drag-laws-ahead-festivals.html",
    "content": [
        "HARTFORD, Conn. (AP) - Tennessee organizers booked more than 50 drag entertainers for next month's Midsouth Pride festival in Memphis now that the state's new law placing strict limits on cabaret shows is temporarily on hold.",
        "But they are being cautious, making adjustments to performances should the limits of the first-in-the-nation law essentially banning drag from public property or in the presence of minors kick in before June celebrations.\"As soon as this stuff started making its way, I immediately started coming out with plans to be able to counteract that,\" said longtime festival organizer Vanessa Rodley. \"Because, at the end of the day, we can´t put on an event that then segregates a huge portion of our community, right? We just can´t do that. So you have to find ways around it.\"The show must go on.Organizers of Pride festivals and parades in mostly conservative states where there's been a broader push targeting LGBTQ+ rights have been under increasing pressure to censor their events. They're taking steps like editing acts and canceling drag shows in order to still hold their annual celebrations of lesbian, gay, bisexual, transgender and queer identity in today´s contentious climate.In some cases, they are trying to navigate broad legislative language that can equate drag performances and story hours with \"adult-oriented performances that are harmful to minors,\" as in the Tennessee law. In other places, Pride organizers have had to fight for local permits that were pro forma in past years, facing off with critics at local city council meetings who oppose drag.",
        "Most Pride organizations are busy \"doing their homework\" and investigating how legislation popping up around the country may impact their events, said Ron deHarte, co-president for the U.S. Association of Prides. And in more progressive states like California, this year´s Pride events will be an opportunity to make a larger statement and raise awareness about the LGBTQ+ community, he said.\"Our members attract more than 20 million people in the United States to their events every year,\" deHarte said. \"So when you talk about the collective impact that Pride organizers can have, not only in their community but across the country, it is powerful.\"Bills to limit or ban drag were filed in more than a dozen states. The only other state set to enact a law is Florida, where Republican Gov. Ron DeSantis is expected to sign a bill.Kayla Bates, a founder of ELGbtq+, an organizer of the community Pride festival and parade in Elgin, Illinois, said they expect a large turnout for the inaugural event given the legislation targeting transgender rights and drag shows elsewhere.\"I think people want to really make it known that they back us and that we should feel safe and protected in our community,\" Bates said.Often held in June, Pride events began as way to commemorate the uprising by New York´s LGBTQ+ communities in 1969, known as the Stonewall rebellion, and as a way to celebrate the LGBTQ+ rights movement.",
        "In New York City, a Pride rally planned for June 17 and a parade on June 25 will have a national theme: \"Strength in Solidarity.\" Sue Doster, co-chairperson of NYC Pride, said they're putting a spotlight on the transgender community and drag queens, targets of the recent legislation in conservative states.\"They're attacking these people because they´re less likely to stand up and fight back, which is why it´s important that we all come together in solidarity and speak up when we see these injustices,\" Doster said.Backlash against transgender individuals, drag performances and Pride events is not new. Last year, 31 members of a white supremacist group were arrested near an Idaho Pride event after they were found packed into the back of a U-Haul truck with riot gear.This year, the Pride Alliance of the Treasure Coast in Port St. Lucie, Florida has reacted to possible legislation, canceling a planned gay pride parade and restricting other events to people 21 years and older.The Pride festival in Hutchinson, Kansas, has also adjusted its program and secured a new venue after losing its original one when a local business owner posted a video on social media decrying the event, which included a drag queen story hour, as depraved.\"Our event is completely family friendly,\" said Hutchinson Salt City Pride chair Julia Johnson.",
        "Meanwhile, organizers in the Nashville, Tennessee, suburb of Franklin, opted not to include drag performances in their Pride celebrations so they can work with local officials to get other events permitted.In Naples, Florida, Pride organizers agreed they wouldn't allow drag performers to be tipped on stage, and later announced that the drag show portion of its festival will be held at an indoor venue because of safety concerns.In Memphis, drag entertainers plan to not change costumes mid-performance or accept tips from the audience if the limits are reinstated.Even in progressive-leaning Massachusetts, there's been debate about whether a drag show could be part of a Pride celebration in the small town of North Brookfield, about 50 miles (80 kilometers) west of Boston. The three-member select board had rescinded a previous vote and determined a drag show violated restrictions on \"adult entertainment.\" Last week, the town´s lawyer said the event could take place on the town common as planned after the ACLU got involved.Support for the community is also making a difference. In Iowa, the Cedar Falls Mayor Rob Green, this week reversed his controversial decision not to sign a proclamation declaring June as Pride Month. He wrote on Facebook that he signed the proclamation out of concern for the safety and health of LGBTQIA+ residents after hearing stories and receiving letters from constituents.",
        "\"I learn a lot from these kind of letters and very much appreciate the opportunity to re-examine my assumptions and thought processes,\" he wrote."
    ]
}