{
    "articleURL": "/wires/ap/article-12044017/With-Paul-hurt-Suns-Payne-tries-recreate-playoff-magic.html",
    "content": [
        "PHOENIX (AP) - Cameron Payne was a surprise hero for a few games during the Phoenix Suns' run to the NBA Finals two seasons ago.",
        "The team might need a similar effort from the backup point guard on Friday.The Suns could be without veteran point guard Chris Paul for Game 3 as they try to climb out of a 2-0 hole against the Denver Nuggets in their Western Conference semifinal series.Paul suffered a strained left groin Monday in Game 2 and is considered \"day to day,\" according to an update from the team late Tuesday. Coach Monty Williams didn't completely rule out the 12-time All-Star for Game 3 during practice Wednesday, but the Suns sounded like a team that's preparing to play at least one game without him.Three-time All-Star Devin Booker said the team has spent the past few days going through potential scenarios. In a strange bit of scheduling, the Nuggets and Suns have three days off between Games 2 and 3.\"You can't replace what Chris brings to the team,\" Booker said. \"He'll still be there, being a leader, being vocal, but the things he does on the court, we're just going to have to find other ways to be effective.\"",
        "The good news for the Suns is they´ve been through a similar scenario in the playoffs and flourished.During the team's run to the Finals in 2021, Paul had a shoulder injury that limited his play for several games in the opening round. He also missed the first two games of the Western Conference Finals against the Clippers after being place in COVID-19 protocol.",
        "Backup Payne was fantastic during Paul's absence, scoring 29 points in a Game 2 victory over the Clippers that was arguably the best performance of his career.He almost certainly will have a big role again on Friday.\"I feel like we´re capable of getting out of this hole,\" Payne said. \"We're back home. Our job was to go steal one (in Denver), it didn't happen, that's just what we've got now. Let's go 2-0 here and do what we've got to do on the road.\"The 6-foot-1 Payne was limited to 48 games during the regular season because of a variety of injuries, but he averaged 10.3 points per game when healthy. He missed most of the Suns' first-round series against the Clippers because of a sore back but has played some the past three games.Payne's unorthodox, herky-jerky playing style has proven effective during his time with the Suns. He won't be the only bench player for Phoenix who needs to step up on Friday. Landry Shamet, Terrence Ross, Damion Lee and T.J. Warren are others who could see a bigger role.The Nuggets won the first two games of the series by double figures - 125-107 in Game 1 and 97-87 in Game 2.Denver big man Nikola Jokic, who finished second in the league MVP voting on Tuesday, had 39 points and 16 rebounds in Game 2.",
        "\"Whether it´s Chris Paul, Cameron Payne, Landry Shamet, our game plan remains the same,\" Nuggets coach Michael Malone said. \"We know that they have two guys in Devin Booker and Kevin Durant that are great players. And they´ll have their home crowd in front of them. Down 2-0, we´re going to get their best effort and we have to exceed that.\"___AP Sports Writer Pat Graham in Denver contributed to this report.___AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP_Sports"
    ]
}