{
    "articleURL": "/wires/afp/article-12060541/Senegal-court-increases-sentence-against-opposition-figure.html",
    "content": [
        "A Senegalese court on Monday handed opposition figure Ousmane Sonko a six-month suspended sentence in an appeal of a defamation case that could jeopardise his run for president next year.",
        "Sonko came third in the 2019 presidential election and intends to stand again in 2024, but two court cases could ruin his candidacy.He received a two-month suspended sentence and a hefty fine in March for defaming Tourism Minister Mame Mbaye Niang and a Dakar appeals court increased the term to six months on Monday, potentially making Sonko ineligible for the vote.Baboucar Cisse, a lawyer for the minister, told reporters the sentence would rule Sonko out of the 2024 presidential vote if confirmed following a six-day period for appeals.The court also ordered Sonko to pay 200 million CFA francs (around $330,000) in damages to Niang.Sonko failed to turn up to Monday's proceedings, after warning he would no longer respond to court summonses without guarantees for his safety.And when the appeal opened, he was nowhere to be seen, an AFP reporter at the courthouse said.Prosecutor general Ibrahima Bakhoum called on the court to have Sonko arrested and jailed for two years.- 'Judicial banditry' -Sonko is also facing trial later this month for alleged \"rape and death threats\" over a complaint filed by an employee at a beauty salon where he went for a massage.\"We have never seen in the whole world a citizen summoned to court, who turns himself in, be the subject of so much fierceness, so much brutality and an attempt almost at physical liquidation,\" Sonko said on social media Sunday.",
        "He appeared to refer to his claims of a March assassination attempt by police during his forced transfer to the Dakar court during initial defamation proceedings.\"It is no longer justice, it is judicial banditry, and that is why I made the decision, still within the framework of my civil disobedience campaign, to no longer collaborate with this justice\" without security guarantees, Sonko said Sunday.In addition to appealing his defamation conviction, Sonko has denied the rape charge, saying he is the victim of a plot by President Macky Sall to torpedo his 2024 candidacy.The government has denied the accusation, and alleged Sonko has drummed up demonstrations to avoid justice.Sonko's appointments with the justice system are often sources of tension and near-paralysis of traffic in Dakar, as he usually travels to court with a procession of sympathisers.The rape charge against Sonko in 2021 helped trigger riots that left at least 12 people dead in the West African country, which is viewed as politically stable in a turbulent region."
    ]
}