{
    "articleURL": "/news/article-12060095/Lori-Vallow-Chad-Daybell-discussed-causing-pain-children-chilling-texts.html",
    "content": [
        "FBI agent Doug Hart said texts between Vallow, 49, and Chad Daybell, 54, talked about causing pain to children if they act up they'll give them a reason to scream Texts also highlighted a scale that showed how near to death her children wereVallow, 49, and Daybell, 54, are accused of murdering her kids JJ, seven, and Tylee, 16, in September 2019. A month later they allegedly killed his wife Tammy Lori Vallow and Chad Daybell discussed causing pain to children and 'giving them a reason to scream' in chilling texts before her kids were killed, the cult mom's trial heard Monday.",
        "FBI agent Doug Hart seized iCloud accounts belonging to Vallow which showed she texted Daybell about her niece's children being possessed in July, 2019.In another exchange, Daybell - the alleged leader of their doomsday cult - told her he had 'turned up the pain' on her daughter Tylee and 'placed a spiritual virus in her.'Vallow, 49, and Daybell, 54, are accused of murdering her kids JJ, seven, and Tylee, 16, in September 2019. The following month they allegedly killed his wife Tammy. The pair married two weeks later on the beach in Hawaii.The State alleges that they believed the three victims were possessed by 'dark' spirits and referred to them as 'zombies.'",
        "In July 2019, Vallow took a trip with her niece Melanie Boudreaux and her two children who Daybell referred to '3s' in the texts. Her son JJ was also on the trip, but it is not known if Tylee was there. The '3s' refers to the couple's twisted rating system for 'dark' people they believed were possessed.Daybell had sent a text to Vallow asking if she wanted him to 'cause pain' to the two 3s she was riding with.Vallow told Daybell to hold off, but added if they started acting up again, 'we can zap them.' Daybell agreed and said: 'If they are going to act up, we'll at least give them a reason to scream.'",
        "Hart told the Ada County Courthouse in Boise that the 'references to hurting children and giving them a reason to scream are relevant.' He confirmed that he never saw any messages that depicted Vallow protesting the harm of anyone. Hart, who took the stand last week, has told jurors that messages between the pair show that they were plotting the killings of her then-husband Charles Vallow, her kids, and Daybell's wife. Vallow is facing a separate trial over the killing of her estranged husband Charles who was shot dead by her brother in Arizona in July, 2019.On July 29, Daybell texted Vallow while she was on the trip with Boudreaux. 'One question: Do you want me to cause pain yet to those two 3s you're riding with?' Vallow responded: 'Probably hold off on then till we arrive. This will be mistake to deal with. But I'll text you if they start acting up and we can zap them. Miserable not mistake.' Daybell replied: 'Sounds great. Yes if they are going to act up, we'll at least give them a reason to scream. I love, cherish, treasure and adore you. The wonderful memories just keep coming back. you are mesmerizing. Raphael is one lucky guy.' Hart said that JJ was present in the car, but said he was not sure if Tylee was there. ",
        "Just a few days prior to the trip, Vallow had sent a text to Daybell talking about 'weird stuff happening in the middle of the night' and that Tylee had been acting weird. ",
        "On July 23, 2019, Vallow texted: 'Good morning. Missing you. Didn't sleep much. Need you to check jj. Weird stuff happened in the middle of the night. It's like they distracted us with Blake.'She added: 'When you get home, Check Tylee. She is being super sweet and helpful and she cleaned her room. See if she got switched. Totally not her.'Daybell responded: 'Yes. she was switched. Please let me know when you can talk, and I will explain it.'On July 26, Vallow sent a text asking Daybell to check on JJ.'She said he was calm and he watched movies all day which he would never do.'Daybell responded to her: 'It is still JJ. I'm told she is lying about him being calm and watching movies.'Vallow responded: 'Mel knew. She called me. She felt the real Brighton last night and knew she was different. She was told I didn't want to tell her. She is taking it well and knows it is part of a big plan. She is amazing! Although I'm still pretty upset about it, I love you. Missing your kisses.'",
        "Brighton is one of Boudreaux's child.There are also texts that revealed how the pair created a twisted percentage scale to show how close her kids were to death.Hart said that the closer the number is to 100 or zero, the closer they are to death. According to the scale, both children were very close.In texts sent between July and August, JJ was at 99.99. Tylee was at 0.13.One of the texts refers to causing Tylee pain.",
        "On July 18, Daybell texted Vallow: 'I have been instructed to focus my efforts on Hillary, so I will.'Hillary is the name they call the spirit they claim possessed Tylee. Vallow responded to Daybell: 'Ok. Find out her percentage for me and JJ.'Daybell to Vallow: 'She is at a 0.13. I turned up the pain to 10 and placed a spiritual virus in her. He is at 99.99. Raphael visited him and told him to follow Amy into the light. I also assured him that James would love and take care of his mommy, which he will with all of his heart and soul.'Vallow to Daybell: 'That is sweet! I miss you desperately.'On July 30, Daybell texted Vallow to let her know the death percentages had changed.",
        "'I got the inspiration to go back to my original death percentages that helped us track Charles, Ned, etc. Tammy is very close. Her percentage has fallen steadily since Hiplos left. It is encouraging!'Vallow responded with two questions: 'What s the percentage now? what about jjs too?' Daybell replied to her that, 'Tammy is at 3. JJ is at 2.' 'Both are being heavily shielded to stop intruders,' he added. Vallow asked: '2 and 3 percent? Not zero?' Daybell said he would explain later and she responded: 'Ok. Still feeling hot for you.' 'Yes, we might need to release a little steam next time we meet,' Daybell said in a cringy text. He continued: 'Anyway, this is the chart that checks what percentage mortals are still in their body. It worked for my friend's wife who died, my neighbor, George Bush, Stan Lee, etc. I kind of forgot about it because we've been dealing with zombies and demonic entities. But this afternoon Tammy said she felt lightheaded, as if her body and spirit weren't connected.' By August 10, a text exchange referred to 'orchestrated plan to take the children,' Hart said. 'You are doing everything right my love,' Daybell texted Vallow when she asked if there was anything she could do to help. He added the Lord told him that they are 'right on track.'",
        "Daybell also said in a text that he could sense JJ 'was barely attached to his body.'",
        "Last week, it was revealed that Vallow, 49, and Daybell, 54, also engaged in toe-curling sexting sessions about showering together and 'naked activities' during their affair which started shortly after they met at a doomsday conference in late 2018. The State says Vallow wanted 'money, power, sex' and that she also used 'those things to get what she wanted.' Vallow, who faces life in prison if convicted, denies the charges against her. Daybell is being tried separately.FBI agent Hart told the Ada County Courthouse in Boise that he seized two iCloud accounts belonging to Vallow under the usernames lori4style and lollytime.He pored through her data from the point after she met Daybell at a Preparing a People conference in St. George, Utah, on October 26, 2018.",
        "July 11, 2019: Lori Vallow's husband, Charles Vallow, is killed by her brother, Alex Cox, in Arizona. Police initially rule that Alex acted in self defense but reopen the case months later after the children are reported missing. August, 2019: Lori moves children JJ and Tylee to Rexburg, Idaho, close to where her future husband Chad Daybell lives with his wife Tammy.September 8, 2019: Tylee is seen alive for the last time during a trip to Yellowstone National Park with Lori, JJ and Alex. In the following weeks Lori tells people that her daughter is studying at Brigham Young University's Idaho campus.September 23, 2019: The last time JJ is seen at his school in Rexburg. Lori emails the school the following day claiming she is moving the family to California for a new job. October 2, 2019: Brandon Boudreaux, the ex-husband of Lori's niece Melani Pawlowski, is targeted in a drive-by shooting in Arizona. Police identify the vehicle carrying the shooter as a Jeep registered to Charles Vallow, Lori's late husband. October 19, 2019: Chad's wife Tammy, 49, dies at their Idaho home. An obituary states that she passed away peacefully in her sleep. Chad declines an autopsy and her death is listed as due to natural causes.October 25, 2019: A friend of Tylee receives a vague 'miss you' text from her phone but says that it didn't sound like the teen.   November 5, 2019: Lori and Chad tie the knot on a beach in Kauai. Receipts indicate that Lori purchased her own wedding ring from Amazon nearly three weeks prior to Tammy's death. November 26, 2019: Out-of-state relatives ask Idaho police to perform a welfare check on JJ. Lori and Chad claim he is in Arizona with relatives and ask their friend, Melanie Gibb, to lie and say she took the boy there for Thanksgiving. Police soon learn that no one has seen JJ or Tylee, since September. November 27, 2019: Police execute a search warrant related to the children at Lori's home and discover that she and Chad have fled Idaho.December 11, 2019: Tammy's body is exhumed from a Utah cemetery and her death is reclassified as suspicious.December 12, 2019: Lori's brother, Alex Cox, is found dead in a bathroom in his Arizona home. Months later an autopsy determines that he died of natural causes while he had the overdose drug Narcan in his system. December 21, 2019: Rexburg police issue the first press release about JJ and Tylee, revealing they believe their disappearance could be linked to Tammy's death and asking the public for information.December 24, 2019: Lori and Chad issue a statement through an attorney saying they love their son and daughter and look forward to addressing 'allegations once they have moved beyond speculation and rumor'.December 30, 2019: Police accuse Lori and Chad of lying to investigators and say they believe the couple know where the kids are or what happened to them.January 3, 2020: Police search Chad's home in Salem and remove 43 items, including tech devices and journals. They also comb over sections of the snow-covered yard with rakes and metal detectors.January 26, 2020: Lori and Chad are seen for the first time in months as police serve them with two search warrants in Kauai. Lori is also served with a court order to produce the children to authorities in Idaho in five days. The couple are approached by the media while officers serve the documents and refuse to say anything about the children.January 30, 2020: Lori misses the court deadline to produce the children to Idaho authorities.February 20, 2020: Lori is arrested in Kauai and charged with two felony counts for desertion and nonsupport of dependent children, and one misdemeanor count each for resisting and obstructing an officer, solicitation of a crime, and contempt of court. March 5, 2020: Lori is extradited to Idaho, where she is held on $1million bond at Madison County Jail.March 17, 2020: Lori professes her innocence in a statement through her attorney as two other members of her defense team quit and the judge removes himself from the case. March 24, 2020: Court documents filed in the divorce of Lori's niece Melani and her husband Brandon Boudreaux allege that Lori told people she believed her children were zombies before they disappeared. April 9, 2020: Authorities reveal they are investigating Lori and Chad for murder, attempted murder and conspiracy in connection with Tammy's death. June 9, 2020: Police search Chad's home in Salem for the second time and discover human remains in the backyard. Chad is taken into police custody and charged with destruction or concealment of evidence.May 25, 2021: Lori and Chad are charged with first degree murder in the deaths of the children. Chad is also charged with first-degree murder in the death of his wife Tammy. May 27, 2021: Lori is deemed incompetent to stand trial on the murder charges in Idaho. August 5, 2021: Prosecution announces it will seek the death penalty for Chad. April 11, 2022: Lori is restored competency. Criminal proceedings against her in Idaho are ordered to continue. April 14, 2022: Lori is taken to the Madison County Jail in Rexburg, Idaho, by Fremont County Sheriff officers.April 10, 2023: Lori Vallow goes on trial for the murders of JJ, 7, and Tylee, 16. "
    ]
}