{
    "articleURL": "/wires/reuters/article-12045259/Builder-Skanska-profits-slump-expected.html",
    "content": [
        "Skanska op income 394 mln SEK vs estimate 854 mln",
        "Losses for residential and commercial property developmentSees weakness in property development over coming yearConstruction order intake dips year-on-yearShares fall 8%(Adds CEO interview, shares)By Niklas PollardSTOCKHOLM, May 4 (Reuters) - Swedish builder Skanska reported a sharp fall in operating earnings for the first quarter on Thursday as soaring inflation and interest rates weighed on real estate markets, hitting its property development business.The Nordic region's largest builder, and one of the biggest in the United States, said operating profit fell to 394 million crowns ($39 million) from 1.85 billion crowns a year earlier, missing a Refinitiv SmartEstimate of 854 million crowns.Skanska's residential and commercial property development divisions both swung to losses in the quarter and shares in the company tumbled nearly 8% in early trade.Red-hot inflation and central bank rate hikes have weighed on activity in residential and commercial property development in recent quarters, above all in Skanska's home market Sweden. Meanwhile, construction orders have held up well.CEO Anders Danielsson said activity remained subdued in residential development, hitting revenues and unit sales, especially Skanska's affordable housing business where it has launched a turnaround programme to cut costs and staff.\"There is uncertainty in the market generally,\" Danielsson told Reuters. \"Buyers hesitate due to high interest rates and high inflation.\"",
        "In Sweden, housing prices have fallen by double digits since the Riksbank's tightening cycle began in earnest a year ago. While the decline has appeared to slow in recent months, many economists predict further falls.\"Things need to stabilise - interest rates need to stabilise, inflation needs to stabilise - so that people regain confidence and dare to invest in new housing, and that is going to take a bit of time,\" Danielsson said, referring to the residential business.Skanska forecast weak markets for both residential and commercial development over the coming year while guidance for construction, which accounts for the brunt of group revenues, was mixed, with continued strong activity in the United States, where demand is being driven by federal and state investment.Order bookings for Skanska's construction business fell to 25.8 billion crowns in the quarter from 30.0 billion a year ago. (Reporting by Niklas Pollard Editing by Anna Ringstrom and Mark Potter)"
    ]
}