{
    "articleURL": "/news/article-12058771/First-Lady-Jill-Biden-Rishi-Sunaks-wife-Akshata-Murty-spin-class-Coronation.html",
    "content": [
        "High-profile duo were spotted in Soul Cycle in Notting Hill at 9.30am, reports sayAmerica's first lady Jill Biden and Rishi Sunak's wife Akshata Murty were up early this morning to attend a fitness class following a big day of Coronation celebrations, according to reports. ",
        "The pair were among the high profile attendees at Soul Cycle in London's Notting Hill at 9.30am, taught by Abbey Ashley, People reported. Ten security guards were said to be at the studio as the famous duo arrived together, having struck up a bond over the Coronation weekend. Prime Minister Rishi Sunak hosted Mrs Biden and her granddaughter Finnegan at the Big Lunch party held in front of his office on Sunday - and they all appeared to be getting on very well. Photos showed Mrs Biden, wearing a long white embroidered coat, and Ms Murty chatting and laughing together after greeting each other with a kiss on both cheeks. ",
        "Ms Murty guided Mrs Biden towards the tables, where they began meeting guests and tucking into the carefully presented spread. Mrs Biden attended the Coronation on behalf of her husband, and was among those at the main ceremony at Westminster Abbey. The wives of Joe Biden and Rishi Sunak were all smiles as they met at Downing Street on Friday ahead of the King's Coronation.Jill was dressed in pink as she shook hands with Akshata on the steps of No 10.In a boxing session in the pillared room in Downing Street, the pair were introduced by Veterans Minister Johnny Mercer to former Lance Corporal Maurillia Simpson. ",
        "Mr Mercer helped Ms Simpson, who has won a gold medal at the Invictus Games, out of her wheelchair so she could stand and talk with the two women - before the three of them helped her back into her chair.The US ambassador to Britain Jane Hartley also attended the session organised by The Fighting Chance boxing club.The First Lady and Prime Minister's wife met veterans and visited a local school before they met US Embassy staff in Vauxhall. Mrs Biden later met King Charles at a reception in Buckingham Palace.",
        "Mrs Biden and Ms Murty also joined primary school children in Borough while they were enjoying a coronation-themed lunch.They sat down at a table with the Charles Dickens primary school children, who were wearing paper crowns and eating sandwiches and cakes, to talk with them about Saturday's service.The pair later visited a Y6 music lesson where they listened to pupils use guitars, a cello and double bass to perform Lovely, a song by American artist Billie Eilish.After the performance, Mrs Biden said: 'This was a treat, thank you so much. Thank you for sharing your talent with us.'"
    ]
}