{
    "articleURL": "/wires/reuters/article-12055159/Reuters-Health-News-Summary.html",
    "content": [
        "Following is a summary of current health news briefs.",
        "US FDA staff raises concerns over OTC use of Perrigo's birth control pillThe U.S. health regulator's reviewers on Friday raised concerns around allowing Perrigo Co's birth control drug over the counter, saying switching to non-prescription sale could lead to inappropriate usage by consumers. Perrigo's Opill, which is currently approved for prescription use, would be the first OTC non-estrogen contraceptive pill in the United States if approved.UNICEF: More than 1 million polio vaccines destroyed in SudanMore than 1 million polio vaccines intended for children have been destroyed as a result of looting in Sudan during the upsurge in violence since April, the U.N. children's agency UNICEF told Reuters on Friday. \"A number of cold chain facilities have been looted, damaged and destroyed, including over a million polio vaccines in South Darfur,\" Hazel De Wet, deputy director of the Office of Emergency Programmes, UNICEF told Reuters in an email.US CDC chief Rochelle Walensky stepping down in JuneU.S. Centers for Disease Control and Prevention (CDC) Director Dr. Rochelle Walensky, a top health official who oversaw the agency's contentious response to the COVID-19 pandemic, is leaving the institution at the end of June, the CDC said on Friday. Walensky led the institution for two years while the pandemic was at its height. Her agency was pivotal in ushering in the adoption of vaccine recommendations that slowed the spread of a virus that has killed more than a million Americans and is still killing more than a thousand a week.",
        "CDC to scale back data collection as US ends COVID health emergencyThe U.S. Centers for Disease Control and Prevention (CDC) said on Friday it would stop reporting or monitoring COVID-19 case data and transmission rates after the government ends the pandemic's public health emergency designation next week. The agency will stop using its color-coded COVID-19 Community Levels (CCL) system, which relies on those metrics to track the spread of the virus and will instead primarily rely on hospital admission data.Cigna's health insurance strength drives profit forecast raiseCigna Group on Friday raised its annual profit forecast after lower medical costs at the company's health insurance business helped it beat estimates in the first quarter, lifting shares 7.5% in morning trade. The health insurer also cut the midpoint of its 2023 medical cost ratio - or spending on claims as a percentage of premiums - by 10 basis points to between 81.5% and 82.3%.WHO declares end to COVID global health emergencyThe World Health Organization ended the global emergency status for COVID-19 on Friday more than three years after its original declaration, and said countries should now manage the virus that killed more than 6.9 million people along with other infectious diseases. The global health agency's Emergency Committee met on Thursday and recommended the UN organization declare an end to the coronavirus crisis as a \"public health emergency of international concern\" - its highest level of alert - which has been in place since Jan. 30, 2020.",
        "North Carolina's Republican-led legislature passes 12-week abortion banNorth Carolina's Republican-controlled legislature passed a bill on Thursday that limits the window for most abortions to 12 weeks, down from 20, which could sharply reduce access to the procedure for millions of women across the U.S. south. The measure now heads to Democratic Governor Roy Cooper, who has vowed to veto it, following the Senate's 29-20 approval along party lines, a day after the state House of Representatives passed it in a similar party-line vote.EU needs tiered drug pricing to improve patient access, Bayer exec saysThe European Union should put mechanisms in place to allow drugmakers to charge higher prices in wealthy European countries and lower prices in poorer nations to assure more equitable patient access to life saving medicines, Bayer's global pharmaceuticals head said in an interview. That might be accomplished in part by restricting drug importation within the EU, Stefan Oelrich, head of Bayer's pharmaceuticals unit, told Reuters on Thursday.FibroGen's anemia drug fails to meet main goal in late-stage trialFibroGen Inc said on Friday its anemia drug had failed to meet the main goal in a late-stage trial, sending its shares tumbling nearly 12% before the bell. The miss is the latest setback for the company whose application seeking approval for the drug to treat anemia in kidney disease patients was rejected by the U.S. Food and Drug Administration in 2021 seeking additional data."
    ]
}