{
    "articleURL": "/wires/pa/article-12058969/Max-Verstappen-claims-Miami-fans-booed-success.html",
    "content": [
        "Max Verstappen said he is targeted by Formula One’s boo brigade because they are jealous of him winning.",
        "Verstappen landed a third victory of the season with a fine drive from ninth at Sunday’s Miami Grand Prix to extend his championship lead to 14 points over Red Bull team-mate Sergio Perez.The double world champion was heckled as he was introduced on the grid in the moments before the race, and then also on the podium as he was presented with his winner’s trophy.But a typically bullish Verstappen said: “If I am driving at the back nobody will be doing anything in terms of a reaction.“It is normal when you are winning and they don’t like who is winning. This is something which is absolutely fine for me as long as I stand on the top step of the podium.“That is the most important thing. I take the trophy home and they can go back to their houses and have a nice evening.”Verstappen was jeered during the pre-race razzmatazz which involved American rapper LL Cool J acting as Master of Ceremonies and will.i.am conducting an orchestra.It is understood the pre-race show seen in Miami will only take place at certain events, possibly eight in all, this season.George Russell called the spectacle “distracting” and Verstappen was also not a fan.“Some people like to be more in the spotlight, and some people don’t,” said Verstappen. “Personally I don’t. So for me, what they did was not necessary.",
        "“I prefer just to talk to my engineers, walk to my car, put the helmet on and drive. I understand the entertainment value, but I hope we don’t have this at every single race, because we have a very long season ahead of us, and we don’t need to enter like that every time.”Fernando Alonso, who finished third behind Verstappen and Perez to claim his fourth podium this season, disagreed that the pre-race introductions should only be reserved for certain races.The 41-year-old Spaniard said: “If we do it here, we have to do it everywhere because I don’t think the Miami fans are better than the Italian fans in Imola or in Spain or in Mexico or in Japan.”However, seven-time world champion Lewis Hamilton, whose arrival on the grid was greeted with huge cheers, said: “Formula One is trying new things and trying to improve the show and I am in full support of that.“I grew up listening to LL Cool J, and LL Cool J was there. You look over and will.i.am is there, too, and he is an incredible artist. I thought it was cool.”"
    ]
}