{
    "articleURL": "/wires/reuters/article-12060205/US-STOCKS-Wall-St-edges-lower-bleak-earnings-ahead-inflation-data.html",
    "content": [
        "Gains in shares of regional lenders prove short-lived",
        "April CPI data awaited on WednesdayIndexes: Dow down 0.19%, S&amp;amp;P flat, Nasdaq off 0.14%By Shreyashi Sanyal and Shristi Achar AMay 8 (Reuters) - Wall Street's main indexes inched lower on Monday as Tyson Foods and Catalent led falls on the benchmark S&amp;amp;P 500 ahead of a key inflation reading this week, while a rebound in regional lenders ran out of steam by midday trading.Shares of Catalent Inc tumbled 26.6% as the contract drug manufacturer saw lower revenue and core profit in 2023, while Tyson Foods dropped 15.6% on posting a surprise second-quarter loss and cutting its annual revenue forecast.Also weighing on the main indexes was a 1.1% decline in shares of Microsoft Corp, while Apple Inc was flat after rising 4.7% on Friday following upbeat results.\"(Growth stocks are down) on nothing other than a mild profit-taking, given the strong move that we saw last week,\" said Michael James, managing director of equity trading at Wedbush Securities.The spotlight this week, however, will be on the Labor Department's inflation reading on Wednesday, which is expected to show the consumer price index (CPI) likely climbed 0.4% in April after gaining 0.1% in March. Producer prices, weekly jobless claims and consumer sentiment data are all lined up through the week.",
        "Data points this week will help investors not only gauge whether the Federal Reserve's aggressive tightening cycle - including its most recent 25 basis point hike last week - is working towards tamping down inflation but also if fears of stagflation are founded.\"The bigger picture is inflation will remain higher for longer and that we are heading into a recession. Whether that's hard or soft remains to be seen, but until there's something to disprove that bigger picture thesis, the overall market is going to remain somewhat range bound,\" James added.At 11:50 a.m. ET, the Dow Jones Industrial Average was down 65.63 points, or 0.19%, at 33,608.75, the S&amp;amp;P 500 was down 1.10 points, or 0.03%, at 4,135.15, and the Nasdaq Composite was down 16.93 points, or 0.14%, at 12,218.48.A rally in regional banks' shares proved short-lived, with PacWest Bancorp rising only 6.5% after gaining as much as about 30% earlier in the session after. The lender sharply cut its quarterly dividend to boost capital.The KBW Regional Banking index fell 2.2% after posting its best single-day performance in seven weeks on Friday.Shares of regional banks tumbled for much of last week on worries tied to the collapse of First Republic Bank.Warren Buffett's Berkshire Hathaway Inc's Class B shares rose 1.4% after posting a $35.5 billion first-quarter profit, reflecting gains from stocks such as Apple.",
        "American Airlines Group Inc rose 4.1% after J.P. Morgan raised its rating to \"overweight\" from \"neutral\".Shares of Zscaler Inc soared 21.2% after the cloud security company raised its annual forecast.Declining issues outnumbered advancers for a 1.15-to-1 ratio on the NYSE and for a 1.24-to-1 ratio on the Nasdaq.The S&amp;amp;P index recorded 10 new 52-week highs and four new lows, while the Nasdaq recorded 47 new highs and 53 new lows. (Reporting by Shreyashi Sanyal and Shristi Achar in Bengaluru; Editing by Nivedita Bhattacharjee and Maju Samuel)"
    ]
}