{
    "articleURL": "/wires/reuters/article-12038783/Increased-green-tax-credit-costs-sign-success-White-Houses-Podesta-says.html",
    "content": [
        "By Andy Sullivan",
        "WASHINGTON, May 2 (Reuters) - A top White House official said on Tuesday that he was not concerned that President Joe Biden's signature clean-energy law could cost more than originally anticipated as businesses take advantage of tax breaks that aim to spur green development.\"I think this is evidence that the bill was actually working, that people are making plans, they're investing money,\" John Podesta, a White House adviser who is overseeing implementation of the Inflation Reduction Act of 2022, said in a Reuters interview.Podesta's comments signaled that the White House is not interested in scaling back the law as Biden girds for a budget showdown with Republicans.Podesta and other administration officials have celebrated a wave of battery plants, solar facilities and other green-energy projects that have been announced since the law's passage. Goldman Sachs estimated in March that it would drive $3 trillion in private-sector climate investments.But that success may come at a cost.Congress' nonpartisan Joint Committee on Taxation estimated last week that the law's tax incentives will cost $515 billion over 10 years, up from its estimate of $270 billion at the time of passage.A separate analysis by University of Pennsylvania's Wharton School found they would cost $1.045 trillion over the coming 10 years, nearly three times its original $385 billion estimate.",
        "Republicans unanimously opposed the climate bill last year and are now seeking to repeal parts of it.A bill that passed the Republican-controlled House of Representatives would repeal the law's green-energy tax breaks and cut other spending programs as a condition for raising the government's $31.4 trillion borrowing authority.Democratic Senator Joe Manchin, one of the Inflation Reduction Act's main architects, has said the administration is interpreting its electric-vehicle tax credits too broadly, driving up costs. He has threatened to back the repeal effort.Podesta said he speaks regularly with Manchin and said other Democrats in the Senate would not support repeal.\"I think what he's been pushing recently is the question that the bill is kind of overperforming, that he's worried there's more takeup than was anticipated,\" Podesta said of Manchin. \"I think that's success.\" (Reporting by Andy Sullivan; Editing by Cynthia Osterman)"
    ]
}