{
    "articleURL": "/wires/reuters/article-12044457/Dodgers-stun-Phillies-Max-Muncy-s-walk-grand-slam.html",
    "content": [
        "Max Muncy hit a grand slam on the first pitch he saw from former teammate Craig Kimbrel as the Los Angeles Dodgers rallied past the visiting Philadelphia Phillies for a 10-6 walk-off victory Wednesday afternoon.",
        "Muncy's 12th home run of the season reached the seats down the right-field line after Chris Taylor singled to lead off the ninth inning, Freddie Freeman was walked intentionally and Will Smith walked to load the bases.Pinch hitter Austin Barnes hit a two-run single in the eighth inning as the Dodgers took a brief 6-5 lead before the Phillies tied it in the ninth on a Bryson Stott single with two outs against Brusdar Graterol.Miguel Vargas hit a home run for the Dodgers and right-hander Gavin Stone gave up five runs (four earned) on eight hits in four innings with two walks and a strikeout in his major league debut.Bryce Harper reached base five times for the Phillies, who saw their losing streak extend to four games. Down to their last out in the ninth inning, Harper singled and two batters later, Stott blooped a single to left field to tie the game 6-6.Harper had three hits and two walks in his second game of the season. Right-hander Aaron Nola gave up four runs on seven hits over 6 1/3 innings, with no walks and five strikeouts.Harper's one-out double in the third inning came after he went 0-for-4 with three strikeouts in his season debut Tuesday. He missed the start of the season after Tommy John surgery in November.",
        "Nick Castellanos followed Harper with his own double for a 2-0 Phillies lead. In a span of five batters to follow, Alec Bohm, Edmundo Sosa and Garrett Stubbs all had RBI singles to give Philadelphia a 5-0 lead.The Dodgers broke through in the bottom of the third on a Mookie Betts RBI double to cut the deficit to 5-1. Vargas' two-run home run in the fourth inning was his second of the season and the Dodgers got within a run in the seventh on a sacrifice fly from Freeman.Graterol (1-1) earned the win despite allowing the tying run. Kimbrel (1-1) was charged with four runs on two hits and two walks in a third of an inning.--Field Level Media"
    ]
}