{
    "articleURL": "/wires/ap/article-12048839/One-Championship-finally-lands-U-S-debut-show.html",
    "content": [
        "DENVER (AP) - One Championship finally makes its U.S. debut Friday night, and the martial arts promotion believes more stateside shows are in its near future.",
        "One is holding a Fight Night headlined by former UFC champion Demetrious Johnson at the 1st Bank Center in Broomfield, Colorado, just outside Denver. The multidisciplinary show is the culmination of a lengthy quest by the Singapore-based promotion to crack the U.S. market with live events.\"We really want to take the U.S. by storm,\" One Championship CEO Chatri Sityodtong said. \"We really just want to excite and delight and surprise the fans. American fans have never seen anything like this, whether it´s production value, whether it´s all these different martial arts, the very best of the best.\"One Championship has carved out a solid spot in the MMA world with its popular shows across Asia, but the promotion has been attempting to enter North America with live events for more than a half-decade. The plans were slowed by the coronavirus pandemic, but One is finally launching stateside with this 11-fight card that includes competition in MMA, muay thai and submission grappling.One's U.S. debut landed in the Denver suburbs instead of a higher-profile spot because the Colorado Combative Sports Commission accepted One's desire to employ its own Global Rule Set governing MMA competition, rather than the Unified Rules used by the UFC, Bellator and the rest of the U.S.-based MMA promotions.",
        "The most glaring difference in the rules is the Global Rule Set's allowance of knee strikes to a downed opponent. Those blows aren't allowed under the Unified Rules, but state athletic commissions can make their own decisions.The Fight Night airs worldwide on Amazon Prime Video, and many American MMA fans are familiar with One´s product from its years of availability online and on U.S. cable networks. One hasn't booked any additional North American shows yet, but One executives have spoken to athletic commissions in other states about their willingness to adopt One's rule set.\"Amazon is very happy with our numbers, and we´re in discussions now to increase, or rather deepen, the partnership,\" Sityodtong said. \"So let´s see what happens, but then again, we have very big plans in store, especially for next year.\"One's Fight Night event is headlined by the final bout of a trilogy between Johnson and Adriano Moraes.Johnson lost the One flyweight belt to Moraes in 2021 and then reclaimed it last year. Johnson is fighting in the U.S. for the first time since 2018, when he lost his UFC flyweight title by split decision to Henry Cejudo and subsequently left the promotion.\"I'm super grateful to come back here after five years in Asia,\" Johnson said. \"My kids get to watch me fight.\"",
        "___AP sports: https://apnews.com/hub/apf-sports and https://twitter.com/AP_Sports"
    ]
}