{
    "articleURL": "/sport/nfl/article-12059725/NFL-Jets-head-coach-Robert-Saleh-tells-left-tackle-Mekhi-Becton-earn-starting-spot-back.html",
    "content": [
        "On Saturday morning, Beckton shared on Twitter: 'I.AM.LEFT. TACKLE!!!' His tweet came after Saleh's warning on increased competition on offenseDailyMail.com provides all the latest international sports news New York Jets head coach Robert Saleh has challenged Mekhi Becton to earn back his starting spot back after the offensive tackle took to social media to express his discontent at his current status on the team..",
        "On Saturday morning, the 24-year-old shared on Twitter: 'I.AM.LEFT. TACKLE!!!'His statement comes right after Saleh told reporters that there will be an increase in competition across many starting jobs on both lines, though particularly on offense, following the arrival of new quarterback Aaron Rodgers.'We're gonna play our best five,' Saleh said at a Friday news conference. 'So, you can assume AVT [Alijah Vera-Tucker] is the best right guard, I'll say that. And [right guard] Laken [Tomlinson]. And then at center and both tackles, it's gonna be a really cool competition along the entire offensive line.'Becton's later deleted the tweet, though Saleh addressed reporters once again on Saturday, being asked for his thoughts on where the offensive linesman should play this coming season and if he should start. 'Go earn the left tackle,' the third-year Jets head coach said. 'Competition.' ",
        "Earlier in May, the Jets declined the fifth-year option on Becton's contract. It was an expected choice by New York, as it would have cost the franchise $13.6 million next season - a hefty amount given Becton's injury history. The 2020 first-round pick will now be a free agent after this season.Becton has missed most of the past two seasons with knee injuries after a solid rookie year during which he quickly established himself as one of the league's promising and physical young left tackles. ",
        "But the No. 11 overall pick out of Louisville missed 16 of 17 games in the 2021 season after dislocating his right kneecap and had cartilage damage in the knee in the opener at Carolina. While switching to right tackle last summer, he suffered a season-ending chip fracture in his right kneecap during a training camp practice.The 6-foot-7 Becton tipped the scales at close to 400 pounds at one point, but was noticeably slimmer when he spoke to reporters in the locker room the day after last season ended.'I'm losing a lot of weight,' he said. 'As you can see, I look really skinny right now.'",
        "Becton has frequently posted photos of himself standing in front of a mirror throughout the offseason, appearing in terrific shape.'He's on track,' general manager Joe Douglas said after the first round of the NFL draft in April. 'He's looking great. So excited to have him in great spirits and he's looking tremendous.''He looks good,' Saleh added. 'He looks fantastic, really. [...] He's attacking this offseason the right way, and I'm excited for him.' Duane Brown is expected to be the starting left tackle again this season, so Becton and second-year lineman Max Mitchell could compete for the job on the right side. New York also drafted versatile Pittsburgh tackle Carter Warren in the fourth-round of the NFL Draft.",
        "Veteran tackle Billy Turner, a former teammate of Rodgers in Green Bay, was also signed as a free agent on May 1 and will also compete for a starting spot on the team's o-line. "
    ]
}