{
    "articleURL": "/femail/article-12044419/CAROLINE-WEST-MEADS-want-leave-lying-controlling-husband.html",
    "content": [
        "READ MORE: 'I avoid sex with my selfish husband'Q I am 61 and unhappily married for the second time. I was with my first husband for 28 years. We divorced six years ago but it was amicable and we had two children, who are now grown-up. Sadly, my ex-husband died three years later. ",
        "I was very lonely for a while following the divorce, and especially after his death, so when I met my second husband two years ago, I thought I had a chance to be happy again. However, I have discovered that he constantly lies to me and I recently found out that he has been watching porn for hours on his phone as well as sending explicit texts to his ex.  I know he's been watching porn and sexting his ex  He was angry that I had looked at his phone but I know that he has looked at mine ‒ even though I have nothing to hide. Conversations with him are difficult because he always thinks he’s right and that only his opinion matters. I am under pressure all the time to do what he wants. I feel tense and don’t sleep well and it is affecting my health. I have no love for him any more. I need someone to tell me what to do. There is nothing left of the relationship but I’d feel so guilty if I left him.",
        "A I am so sorry to hear this as you do sound desperately unhappy in your marriage. The death of your first husband must also have been very difficult for you. Even though you were divorced, he was the father of your children, and clearly there was still a friendship, so this is a huge loss. ",
        "I wonder if, because of your grief and loneliness, maybe you couldn’t see your new husband’s true colours. It’s hard to make good decisions when our emotions are raw. You say that you need someone to tell you what to do but, actually, you already know that you want to end this marriage because there is nothing left – certainly no love.What you lack is the confidence to leave – perhaps because your husband is manipulative and controlling. He tries to make you feel guilty for looking at his phone (even though you had every reason to do so) and shifts the blame on to you when he is the one at fault.  He's making you feel guilty when he is the one at fault  And then there is the porn and his ex. Porn can be devastating for a relationship and has probably left you feeling unwanted, unloved and undesirable, although his habit is not a reflection on you, but about his own addiction. If there is any chance of your husband changing and getting help, he could look at pivotalrecovery.org.Unfortunately, the rest of his behaviour sounds selfish and he seems to care little about your feelings. It is never easy to leave a marriage – and perhaps harder in your 60s – so it is not a decision you should take lightly or unsupported. I recommend you seek counselling to help you make your mind up; visit relate.org.uk or bacp.co.uk.",
        "My friend didn't tell me my son was vaping Q The son of one of my closest friends encouraged my son to start vaping a few months ago. I am furious with my friend because she knew but didn’t tell me. Both boys are 16. Her eldest is not a bad lad but he’s a bit rebellious and pushes the boundaries. My son is shy and sometimes does things to fit in. When I asked my friend why she hadn’t told me, she replied that it was not her business what my son got up to and that there was nothing I could do about it ‒ teenagers will ‘go their own way’. I am trying to help my son quit and to stand up for himself more. However, I wonder if I should continue my friendship?",
        "A I agree that your friend should have told you – it is disappointing that she didn’t, especially as the boys are below the legal age for vaping. Perhaps her son pleaded with her not to tell you, or said that he would be angry with her if she did.Unfortunately, some teenagers will ‘go their own way’ whatever their parents do and it sounds as though your friend feels rather defeated in her attempts to keep her son on the right path. I can understand why she didn’t want to fall out with him but this wasn’t fair on you. ",
        "If she recognises that she made a mistake and should have trusted you with the information, then you might want to continue the friendship. However, if she remains totally unapologetic, you might not. Your son could see his GP to find out about services that will help him quit vaping. He might want to rethink his friendship as well ‒ a real friend wouldn’t be encouraging him to do something that he really didn’t want to.If you have a problem, write to Caroline West-Meads at YOU, 9 Derry Street, London W8 5HY, or email c.west-meads@mailonsunday.co.uk. You can follow Caroline on Twitter @Ask_Caroline_ "
    ]
}