{
    "articleURL": "/wires/ap/article-12043859/Flores-homers-help-Giants-4-2-win-Astros.html",
    "content": [
        "HOUSTON (AP) - Wilmer Flores homered and Joey Bart and Austin Slater had two hits each to give the San Francisco Giants a 4-2 win over the Houston Astros on Wednesday.",
        "Slater drove in a run to put the Giants up in a two-run sixth, and an RBI double by Bart extended the lead to 3-0 in the seventh.Alex Bregman got Houston within a run with a two-run home run in the eighth before Flores added some insurance for the Giants with a solo shot in the ninth.San Francisco starter Logan Webb (2-5) yielded five hits and two runs in 7 2/3 innings, and Camilo Doval pitched a scoreless ninth for his fifth save.Houston´s Framber Valdez (2-4) allowed five hits and two runs with eight strikeouts in six innings.The Astros have struggled at home this season and fell to 8-11 at Minute Maid Park with Wednesday's loss.",
        "\"We've certainly got to turn our home record around,\" manager Dusty Baker said. \"But there's nothing we can do about it now. We've just got to go and continue to play well on the road and try to address our home record when we get back.\"The Giants took two of three games of this series after a 2-0 win Tuesday night behind eight scoreless innings by Anthony DeSclafani.\"Whenever (Webb) is on the mound we obviously have a shot,\" Bart said. \"I was excited. I loved him and (DeSclafani) having the ball these last two days. I felt like it put us in a really good position to get through this lineup over and over again. Pitching has dominated for us these last two days.\"",
        "The Giants had lost four in a row before Tuesday's win.\"Overall great win,\" Bart said. \"Really good club we came in and bounced back to take two from. So really good way to finish.\"Neither team could get much going offensively before Bart singled on a line drive to right field to start the sixth and advanced to second on a sacrifice bunt by LaMonte Wade Jr. Slater followed with a single to right to score Bart and put San Francisco up 1-0.Slater reached second on the throw home on the play before stealing third base. Thairo Estrada walked before Slater scored on a single by Mitch Haniger. Valdez finally escaped the inning when J.D. Davis grounded into a double play.There was one out in the seventh when Valdez plunked Michael Conforto. A double by Bart with two outs scored Conforto to push the lead to 3-0.The Astros got singles by Mauricio Dubón, Yordan Alvarez and José Abreu in the first inning before Webb settled down.David Hensley walked with no outs in the eighth and the Astros got their first hit since the first inning when Martín Maldonado followed with a single. Dubón grounded into a double play before Bregman smacked his homer to left field to cut the lead to 1 and chase Webb.",
        "He was replaced by Scott Alexander, who struck out Alvarez to end the inning.\"We had (Webb) on the ropes a couple of times early in the game, and we just didn´t come through with a big hit,\" Baker said. \"It was tough on our offense the last couple of days.\"TRAINER´S ROOMAstros: 2B Jose Altuve resumed some baseball activities this week, but there still isn´t a timetable for when he´ll return to the team. Altuve fractured his right thumb in the World Baseball Classic and had surgery to repair the injury March 22.\"I think right now it´s hard to tell,\" Altuve said. \"Anything is possible. I´m working really hard. I want to come back and help these guys to win, but we´ll see. I think the next two weeks are really important in my rehab.\"UP NEXTGiants: Off Thursday. Starts a series at home against the Brewers on Friday. Neither team has announced its starters.Astros: Off Thursday. Opens a three-game series in Seattle on Friday with RHP Cristian Javier (2-1, 3.48 ERA) taking the mound against a yet-to-be-named starter for the Mariners.___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}