{
    "articleURL": "/sport/football/article-12055067/DOMINIC-KING-Shouting-whistling-never-going-way-Liverpool-fans.html",
    "content": [
        "Liverpool fans drowned out the national anthem ahead of their win on SaturdayGod Save the King was played at Anfield to mark the coronation of Charles III The only 'Kings' the crowd sung for were Kenny Dalglish and Mohamed Salah It was 5.25pm and the traditional Premier League fair play handshake had just taken place. In block 202 of the Kop, an already unusually hyper atmosphere for a low-key end-of-season fixture was about to significantly change.",
        "In this section of the stadium, they had just been singing for Mo Salah — Liverpool’s Egyptian King, in their words — but they knew what was coming. Everyone did. So George Sephton, Anfield’s long-serving stadium announcer, began to explain the National Anthem was about to be played.Sephton’s tone is as recognisable at Liverpool’s home as the team’s red shirt but it was becoming harder and harder to hear what he was saying. There was shouting and whistling, widespread dissent, and then the drum roll for God Save the King began.But Sephton had pressed play too early. And in block 202 — and all around the stadium — the reaction everyone outside the city had expected from Liverpool supporters and the marking of the Coronation had come to pass.Usually this level of animosity is only reserved for when the Manchester clubs are in town but this was different. Half the stadium didn’t want anything to do with the National Anthem, so they booed and they whistled and they shouted.",
        "By the time Sephton had properly started the anthem, you could only make it out if you really listened hard. Those who were not booing showed their true allegiances, hollering the words ‘Liverpool! Liverpool!’ repeatedly.At the other end of the stadium, Brentford fans, some of whom were dressed in Union Jack hats, joined in but there was nothing from Liverpool, save for Jordan Henderson —club captain and England’s vice-captain — who sang on the bench.",
        "There have been many remarkable moments at Anfield and this, for many reasons, was another that wouldn’t be forgotten. Liverpool had been placed in an impossible position by the Premier League, who had issued its members with flimsy guidance on April 28, and, as a club, they were angry.Not as angry as the fans, however. This, to be clear again, was not about booing King Charles or any single member of the Royal Family per se. The long-standing grievance Liverpool supporters hold is focused on the establishment. The National Anthem is symbolic of their distrust.It’s why the booing and whistling got louder in block 202 until the final note of the anthem, when Sephton instantly flicked a switch and played the first bars of You’ll Never Walk Alone. Now there was unity and now a stadium was singing something in which it believed.Sephton, whose first match doing this particular job was in August 1971, has a feel for the mood of the crowd and there are days when he simply fades out the music and allows those in the stadium to take over from Gerry Marsden. This was one such occasion.Undoubtedly, there would have been Liverpool fans dotted around Anfield who were uncomfortable with it all. There were plenty of flags outside homes in districts not far from the ground and many within the city are proud of the Royal Family. ",
        "Let us not forget, as examples, that Sir Kenny Dalglish was overwhelmed when he received a knighthood in 2018 and Henderson was similarly humbled when he was made an MBE last year, considering the day when he received his gong from Prince William one of the proudest of his life.But in block 202 nobody was interested in marking the start of the New Carolean era — and that was always going to be the case.The only ‘royalty’ they cared for here was Mohamed Salah, whose first-half goal carried him into the top five on the club’s all-time scoring list, and Dalglish.In the 62nd minute, long after the booing had stopped, they did sing for ‘The King’, but that man was Dalglish, for whom a banner had been unfurled before kick-off, not the man being feted outside Buckingham Palace. It was never, though, going to be any other way."
    ]
}