{
    "articleURL": "/wires/reuters/article-12041027/Frances-Le-Maire-wants-break-food-price-inflation-spiral-autumn.html",
    "content": [
        "Le Maire: economic growth remains solid",
        "Le Maire: meeting next week to tackle inflation concerns(Adds details)PARIS, May 3 (Reuters) - Finance Minister Bruno Le Maire said on Wednesday that he would meet with retailers and suppliers next week to discuss ways to break the food price inflation \"spiral\" by autumn, which is a major concern for cash-strapped consumers.Le Maire also told Franceinfo radio that economic growth remained solid in France despite recent strikes and protests against President Emmanuel Macron's legislation to raise the retirement age by two years to 64.French food retailers and their suppliers agreed a 10% average increase in prices in annual negotiations in March, which both sides said was necessary to cover higher production costs.Le Maire has since repeatedly called on both sides to reopen negotiations to ensure that a recent fall in global wholesale food prices is passed on to consumers. Le Maire has even threatened to take action if they do not respond to his calls.France's headline inflation rate rose to 5.9% in April from 5.7% in March. The French inflation level stood at 6.9%, as measured by a European Union-harmonised consumer price index.Bank of France governor and European Central Bank member Francois Villeroy de Galhau said last month he expected food price inflation to start easing in the second half of this year.",
        "Commenting on the impact on the French economy of recent strikes against pension reform, Le Maire also said: \"There is no significant impact from the social protests...French growth remains solid.\"Last month, data from statistics agency INSEE showed GDP edged up 0.2% in the first quarter after a flat fourth quarter, helped by household consumption, which was steady after falling one percent in the last three months of 2022. (Reporting by Dominique Vidalon; editing by Richard Lough and Christina Fincher)"
    ]
}