{
    "articleURL": "/wires/reuters/article-12046247/Moscow-says-US-Kremlin-drone-attack-Russian-forces-target-Kyiv.html",
    "content": [
        "White House, Kyiv deny Russian accusations",
        "Zelenskiy visits The Hague, says Putin must face justiceDiplomats work on extending Black Sea grains dealBy Pavel PolityukKYIV, May 4 (Reuters) - Russian drones attacked the Ukrainian capital Kyiv on Thursday evening, the fourth assault in as many days subjecting residents to spasms of gunfire and explosions, and at least one drone was shot down.City authorities had declared an alert for Kyiv and the surrounding area. Residents who had gone to air raid shelters said the drones arrived more quickly than usual after the alerts were declared. Reuters witnesses heard gunfire and repeated heavier explosions near the city centre.The attacks started just after 8 p.m. (1700 GMT) and lasted around 20 minutes. Ukraine's air force said in a statement that it had destroyed one of its own drones after the drone lost control over Kyiv region, probably because of a technical failure. It wasn't clear how many drones in total were destroyed.Russia said on Thursday that the United States was behind a purported drone attack on the Kremlin aiming to kill President Vladimir Putin. Washington and Kyiv denied involvement.Putin will head a scheduled meeting of Russia's Security Council on Friday and the Kremlin incident could be on the agenda, TASS news agency reported.",
        "Ukrainian President Volodymyr Zelenskiy, speaking in The Hague after visiting the International Court of Justice, said Putin must be brought to justice over the war and that Kyiv would work to create a new tribunal for this purpose.In other diplomacy, U.S. Ambassador to the United Nations Linda Thomas-Greenfield said on a visit to Brazil that she encouraged the government to include Ukraine in any attempt to negotiate an end to the war. She was referring to President Luiz Inacio Lula da Silva's comments calling on the West to stop arming Ukraine to allow peace talks to start.There are currently no peace talks to end the war, which has devastated Ukrainian towns and cities, killed thousands of people and driven millions from their homes.FRONTLINE ACTIONNearly 50 Russian attacks were repelled along the main sectors of the front line in eastern and southern Ukraine, the General Staff of the Ukrainian Armed Forces said on Thursday evening. The heaviest fighting is still in Bakhmut and in Maryinka, further south in Donetsk region, it said.Russian forces also launched 66 air raids and engaged in 33 shelling episodes on Ukrainian positions and on towns and villages, causing casualties and damaging infrastructure, the report said.Reuters was not able to verify the battlefield accounts.",
        "MOSCOW CITES 'US ORDERS'Putin's spokesman Dmitry Peskov, without providing evidence, said Ukraine had acted on U.S. orders to attack the Kremlin citadel in the early hours of Wednesday.White House national security spokesperson John Kirby dismissed Russian \"lies\" and said there still was no conclusive evidence as to the authenticity of a video showing the drone at the Kremlin.\"Attempts to disown this (attack on the Kremlin), both in Kyiv and in Washington, are, of course, absolutely ridiculous. We know very well that decisions about such actions, about such terrorist attacks, are made not in Kyiv but in Washington,\" Peskov told reporters.Peskov said an urgent investigation was under way and that any response would be carefully considered and balanced.Russia has increasingly accused the United States of being a direct participant in the war, intent on inflicting a \"strategic defeat\" on Moscow. Washington denies this, saying it is arming Kyiv to defend itself and retake illegally seized land.KYIV, ODESA TARGETEDEarlier on Thursday, Russia fired two dozen combat drones at Ukraine, hitting Kyiv and also striking a university campus in the Black Sea city of Odesa. There were no reports of casualties. Russia denies targeting civilians in Ukraine.Diplomats, meanwhile, are still working to keep a package deal for Ukrainian and Russian agricultural exports alive beyond May 18. Technical personnel from Turkey, Russia, Ukraine, and the United Nations will meet on Friday to discuss the deal, Turkish Defence Minister Hulusi Akar said.",
        "Russia has a list of demands it wants met for continuation of the Black Sea grains pact, which the U.N. said helps tackle a global food crisis aggravated by Russian forces invading neighbouring Ukraine in February 2022.Zelenskiy has vowed to drive all invading Russian forces back to the borders set in 1991 following the collapse of the Soviet Union. He said on Thursday the whole of Ukrainian society was preparing for a counteroffensive, which he said would be successful against what he called a \"demotivated\" Russia.(Reporting by Kyiv, Moscow and Amsterdam buros; Writing by Gareth Jones, Alexandra Hudson and Grant McCool; Editing by Nick Macfie and Daniel Wallis)"
    ]
}