{
    "articleURL": "/tvshowbiz/article-12039777/MAFS-star-refuses-quit-escorting-love.html",
    "content": [
        "Married At First Sight star Hayley Vernon has carved out a lucrative career as an escort and porn star since her reality TV debut in 2020.",
        "And the 35-year-old has no plans to give up her X-rated job, despite previously saying she was going to stop prostituting herself to become a mother via IVF.Speaking to Yahoo Lifestyle on Tuesday, Hayley revealed the reason she briefly stopped escorting was to please a boyfriend.'I actually stopped escorting because I was seeing somebody and it was getting serious, but he had a problem with it,' she said.'I gave it up for him but lost my independence and who I am too. I love my job and all of the interesting people I get to meet.'",
        "Hayley is now back doing porn and escorting full-time, having established herself as one of Australia's most in-demand sex workers.The former labourer, who has made more than $1.3million performing hardcore acts on OnlyFans, previously said she was proud of her work in the industry.'Am I ashamed? F**k no. I'm absolutely killing it and would like to thank you [the media] for the free publicity,' she told Daily Mail Australia.Hayley charges customers $950 an hour for a 'porn star experience'.According to her profile on the private escort directory Scarlet Blue, Hayley lists her body type as 'athletic' and is available for in-calls and out-calls.",
        "'I'm in the adult industry; I have sex for a living,' she told Yahoo Lifestyle last year.",
        "'I have top-tier customers wanting the experience and I, on the other hand, need men to film with.'The celebrity sex worker, who has forked out thousands on plastic surgery, is planning to increase the size of her breast implants this year.'I'm booked in for June this year, I'll be going from 450 to 700ccs,' she explained on Instagram.'I also have capsular contracture of my now implants so they need to be fixed ASAP.' ",
        "Hayley has spent a small fortune on plastic surgery since her stint on MAFS in 2020.In 2021, she underwent nose and eyelid surgery, later revealing the horrifying aftermath of her multiple procedures.'I woke up before and my eye was fused together, that's because I've got fake eyelashes on and obviously there's blood coming out from my eyelid surgery,' she said at the time.She also admitted to getting permanent fillers under her eyes, but said they had to be moved around because of the nose and eyelid surgeries."
    ]
}