{
    "articleURL": "/wires/aap/article-12040851/Australia-electric-car-slow-lane-expo-hears.html",
    "content": [
        "Australia is \"still in the slow lane\" on electric vehicle adoption and the federal government will need to introduce bold vehicle pollution caps or risk missing its climate target, a Sydney energy conference has heard.",
        "Australia's new National Electric Vehicle Strategy and debate over a fuel-efficiency standard dominated discussion at the Smart Energy Council Conference on Wednesday, with industry experts welcoming changes but urging further action.The federal government launched the strategy two weeks ago but is not expected to launch a draft vehicle pollution limit until late this year following a six-week consultation.Independent MP Allegra Spender told the conference the government's electric vehicle policy was critical but lacked detail and should have outlined a fuel-efficiency standard without another consultation process.\"Let's not pretend that the government are out of the slow lane yet,\" she said.\"Frankly, right now we're not getting it right. We have too many people who want to get an EV but can't, like the 30,000 Australians who registered their interest in a new Hyundai model last year when just 750 were allocated to this country.\"Fuel-efficiency standards set a limit on carbon emissions across a car maker's fleet, encouraging companies to import more low and zero-emission vehicles to balance their high-polluting models.Ms Spender, who represents the Sydney electorate of Wentworth, said too many Australians still needed better access to electric vehicles, subsidies to afford them, and education on how to install chargers in existing apartment blocks.She said a vehicle emissions limit should be higher than the voluntary standard set by the automotive industry and should aim to phase out the sale of petrol and diesel vehicles in just over a decade.",
        "\"We need a clear target that is enshrined in legislation and we need to see a clear path to all new car sales being zero-emissions by 2035 at the latest,\" Ms Spender said.\"The cars we're buying in 2035 are the ones we'll still be driving in 2050.\"Electric Vehicle Council chief executive Behyad Jafari said 2035 had become an increasingly popular deadline for the sale of fossil fuel vehicles around the world, with 42 per cent of the car market supporting a phase-out.\"In the last five years, we've gone from no markets banning internal combustion engines to almost half today and quite a few more coming as well,\" he said.\"Sixteen car companies around the world have also said that they will stop making and selling internal combustion engines by 2040.\"In Australia, only the ACT has named 2035 as a date to end the sale of internal combustion engine vehicles.iMove Australia programs director Lee-Ann Breger said if Australia did not take more ambitious action to cut emissions from transport, it could miss its legislated 2030 climate target.\"As it stands transport is so far behind in its contribution towards that 43 per cent decarbonisation by 2030 that we're not likely to make it,\" she said.\"If this isn't improved, it puts a lot of pressure on to other sectors to make up for the shortfall.\""
    ]
}