{
    "articleURL": "/femail/article-12059231/Side-hustle-1-2m-company-Dragons-Den-investment.html",
    "content": [
        "Two mums have turned over more than £1million from their businessKelly Aspland and Laura Waters, from South Wales, created Solar BuddiesRead More: Mothers who invented an £8 roll-on sunscreen device for children Two mums have turned their initial £5,000 investment into a business with a turnover of more than £1million.",
        "Kelly Aspland, 44, and Laura Waters, 40, from Cwmbran, South Wales, banded together to create a sunscreen applicator for children.Last month they appeared on Dragons' Den where panellists Deborah Meaden and Peter Jones gave them £80,000 to scale up their business.Their company Solar Buddies, which started as a side-hustle in 2011, has since turned over a jaw-dropping £1.2million. After appearing on the hit TV show the two dragons bought a 20 per cent stake in the company. ",
        "The created the product after a strict no-touch policy was introduced in their children's school, meaning their teachers aren't allowed to help them apply the sun protection. The mums, who have no previous experience of business, created the refillable, roll-on, mess free sunscreen applicator after bagging a £5,000 investment from a friend and enlisting the help of product design students at Cardiff Metropolitan University. Kelly told The Express: 'There was nothing out there for the kids to be able to make this job easy and they always run away from you.'It was just a bit of a moment where we thought, let's have a little Google and see if there's anything about and there wasn't.'So we thought, well, let's have a little go at doing it ourselves.'Solar Buddies launched its first product in 2015 and TikTok 'skyrocketed' the company into the US market.",
        "Solar Buddies retails for £7.98 in the UK and is available in Boots, on Amazon and in 40 airports. ",
        "Laura is mother to Emily, 22, Ffion, 16, and Ioan, 12, and Kelli, who has Olivia, 24, Sam, 22, Charlie, 16 and Harri, 13, started their business venture when their kids were much younger. The pair were introduced when their then three-year-old son and daughter met in nursery - and the children decided they wanted to get married.Kelli said: 'Laura and I met at our children's school St David's RC school in Cwmbran. Our three- year-olds were in the same nursery class and they adored each other.'Charlie, my son, and Ffion, Laura's daughter, fell in love and wanted to get married. We met up lots of times after being introduced through our children and we formed a great friendship.'The mothers were aware there was nothing on the market which helped children independently apply sunscreen and that many of the traditional suncream bottles and applicators were very difficult for children to use on their own.Kelli said: 'One of the teachers at our children's school had called me to tell me how my eldest son, Sam, had been asked to come help my middle son, Charlie, to apply his sunscreen at lunch time and how much of a mess they had both got into.",
        "'The teacher was telling me because it was a humorous story, and yes I laughed too, but when I told Laura about the story she told me how one of her friend's daughter, who attended a different school, had been badly sunburnt whilst at school because the teachers were unable to assist the children in applying the sunscreen.'We then discussed how it would be great to have a product which would help the children to be protected from the sun whilst at school and an easier way for them to put lotion on, if they aren't able to have assistance.'This conversation lead onto further chats about the issue back in Laura’s living room where they discussed what attributes would make a great applicator.Kelli said: 'After our initial talk about what would make a great applicator we decided to have a bash at trying to design one ourselves.'We went to our local healthcare shop and grabbed different types of applicator pads, roller balls products and small containers. We took all these items home and ripped them apart and then started to combine them to create our designs.'The mothers then bought different styles of sunscreen applicator and started pulling them apart and putting them back together to create new child-friendly styles. "
    ]
}