{
    "articleURL": "/femail/article-12045457/I-dont-care-tiny-thong-bikini-makes-Karens-beach-uncomfortable.html",
    "content": [
        "Edda, who is based in New York, took to TikTok to showcase her toned physiqueREAD MORE: Why do Brits say they're getting 'a Chinese'? US TikToker claims the phrase is 'odd' and even sounds 'a little racist' - but is quickly put straight! A fashionista has shared how she doesn't care if her tiny thong bikini makes 'all the Karents on the beach uncomfortable'. ",
        "Edda, who is based in New York, took to TikTok to showcase her toned physique in a stylish bikini, featuring a sea-shell top and a white thong. But to anyone who questioned her daring fashion choice, she had one message to share - that she seemingly didn't mind making certain beach-goers uncomfortable.'Me on my way to make all the Karens on the beach uncomfortable in my bikini,' she wrote over the video of her showing off her look.   A 'Karen' is a term for a self-righteous woman, who often complains. The phrase first became popular in meme culture on internet forum Reddit.",
        "Edda (@edaochel) has more than 22,000 followers on her social media account, where she regularly posts fashion reviews and outfit ideas while living in New York City.Last summer, she enjoyed a trip to The Hamptons, where she filmed the video of her dancing around in the sand.Marching into the spotlight wearing her bikini, the young women showcased her great sense of style.Showing off her fashion prowess, she teamed her statement bikini with a pair of fashionable sunglasses and a stunning straw bucket hat. ",
        "In the clip, she dances in the sunshine before turning slightly to the side to show off her thong bikini bottoms.   Many complimented her beach look, with one person writing in the comments of the post: 'Omg this suit! You look amazinggggg.'",
        "'Marry me,' another individual joked. A third delighted social media user simply added: 'LOVE."
    ]
}