{
    "articleURL": "/wires/ap/article-12056987/Ancelotti-backed-Madrid-winning-trophy.html",
    "content": [
        "MADRID (AP) - It wasn´t long after Real Madrid lifted the Copa del Rey that club president Florentino Pérez interrupted an interview by Carlo Ancelotti to congratulate the winning coach.",
        "The president and coach embraced and chatted for a few moments on Saturday night before Ancelotti went back in front of the camera to finish the interview.\"We are happy,\" Ancelotti said. \"Like all Madrid fans, we are all happy.\"Ancelotti went full circle with Madrid by winning the Copa, nearly a decade after he did it for the first time in his first stint at the helm of the Spanish powerhouse.Pérez later made sure he showed his full backing of the coach and expressed the club's desire to have Ancelotti continue his successful cycle with Madrid despite Brazil's push to sign him for the national team.\"I don´t even want to hear about this subject anymore,\" Pérez said after Madrid´s 2-1 win over Osasuna in the Copa final in Seville. \"He has a contract with us and we are happy.\"",
        "Ancelotti's current contract with Madrid lasts until the end of next season but speculation about his potential departure increased after Brazil said it was interested in hiring the veteran Italian coach to replace Tite. Brazil has been without a manager since the end of the World Cup and the Brazilian soccer federation hinted it is willing to wait until the end of the European season to hire its next coach.",
        "The 63-year-old Ancelotti has thanked Brazil for its interest but so far has said he wants to stay with Madrid for as long as the club wants to keep him.Pérez, who had previously not spoken publicly about Ancelotti's possible departure, came in for some criticism when he hired him to replace Zinedine Zidane in 2021. At the time, Ancelotti was coming off stints with Napoli and Everton and many said he was past his prime.The doubts were quickly gone, though, with Ancelotti leading the club to trophies in the Copa, Champions League, Spanish league, Club World Cup, Spanish Super Cup and UEFA Super Cup. He is the first coach to help Madrid win all significant trophies possible in a two-season span.\"All I can do is thank this squad, this club and these fans,\" Ancelotti said. \"We've achieved something hugely significant, winning every possible trophy in two years.\"In Ancelotti's first stint from 2013-2015, Madrid won the Copa, Champions League, UEFA Super Cup and Club World Cup. He now has 10 trophies with the club, behind Zidane (11) and Miguel Muñoz (14), who coached in the 1960s and '70s.Ancelotti has a chance to draw even with Zidane if he helps Madrid win a second-consecutive Champions League title later this season. The first leg of the semifinals against Manchester City is on Tuesday at the Santiago Bernabeu Stadium.",
        "Winning the Spanish league for the second year in a row is virtually out of the question as Madrid trails leader Barcelona by 14 points with five matches remaining.The Copa title was Pérez´s 32nd trophy with Madrid, tying him with former president Santiago Bernabéu.___Tales Azzoni on Twitter: http://twitter.com/tazzoni___More AP soccer: https://apnews.com/hub/Soccer and https://twitter.com/AP_Sports"
    ]
}