{
    "articleURL": "/wires/reuters/article-12058461/MORNING-BID-EUROPE-Markets-await-US-banks-credit-squeeze.html",
    "content": [
        "A look at the day ahead in European and global markets from Wayne Cole.",
        "It's been a quiet start to the week in Asia, which is no surprise given U.S. consumer prices loom this week as a major test of the market's sanguine view that the Fed is done hiking.Futures are 90% priced for steady rates in June and 38% for a cut as soon as July, leaving the market vulnerable to an upside surprise on the CPI. Median forecasts are for a rise of 0.4%, but the range is 0.2% to 0.6% and either of those would have an outsized effect.In the meantime, everyone is waiting for the Federal Reserve's Senior Loan Officer Opinion Survey, or 'SLOOS', to see just how much lending has tightened given the strife in U.S. regional banks.This is not a release that usually attracts much attention and there is no poll forecast for it. The main indicator is the share of respondents, which include up to 80 large domestic banks and 24 U.S. branches and agencies of foreign banks, who say lending standards have tightened somewhat or considerably in the quarter.The last survey out in January showed a combined 44.8% of respondents saw a tightening of standards for large and middle-market firms. Goldman Sachs sees that rising to 60.2%, \"a level tighter than the dot-com crisis but less extreme than during the financial crisis or the height of the pandemic.\"",
        "It would also be consistent with levels reached before or during the last four recessions - 1990-91, 2001, 2007-09 and early 2020. The survey was conducted between the last week of March and first week of April, so would have missed the latest turmoil around First Republic and PacWest.Fed chair Jerome Powell last week offered a heads up on the survey, saying they would not now have to raise rates quite as high because of the tightening in standards.\"If you put the credit tightening on top of that and the QT that's ongoing, I think you feel like we may not be far off (a neutral rate),\" he said in his Q&amp;amp;A. \"Possibly even at that level.\"The Bank of England isn't quite at neutral yet but will likely get closer to it later this week as the market implies a better-than-80% chance it will hike rates a quarter point to 4.5%.Futures are also priced for a further move to 4.75% given inflation is still in double figures, though there is a chance the BOE could take a dovish turn given the board split 7-2 last time, with two voting to hold steady.This week also sees Chinese data on inflation and trade, while G7 finance ministers meet in Niigata, Japan, from Thursday through Saturday.",
        "Key developments that could influence markets on Monday:- ECB board member Philip Lane speaks in Berlin- Fed Bank of Chicago President Goolsbee and Bank of Minneapolis President Kashkari are speaking(Reporting by Wayne Cole; Editing by Muralikumar Anantharaman)"
    ]
}