{
    "articleURL": "/sport/football/article-12052631/Mail-Sports-CHRIS-SUTTON-offers-predictions-weekends-Premier-League-action.html",
    "content": [
        "Premier League enters final knockings with title and relegation still on the lineSam Allardyce's Leeds travel to Man City looking to secure an unlikely victoryNewcastle host Arsenal on Sunday as they edge closer to Champions League The Premier League enters the final stretch of the season with much to play for and outcomes still to be decided.",
        "Leeds travel to Manchester City in a crucial game at the top and bottom of the table, with Sam Allardyce hoping he can get a tune out of his - very - new players to keep them in the Premier League.Should Manchester City triumph at the Etihad and Newcastle beat Arsenal at St James' Park on Sunday, the Gunners' title hopes will take a potentially fatal blowMeanwhile, Frank Lampard will look to avoid the ignominy of a seventh straight defeat as Chelsea interim against Bournemouth.Mail Sport's Chris Sutton offers his predictions for this weekend's Premier League action.",
        "Bournemouth 1-1 ChelseaI wouldn't blame Gary O’Neil if he occasionally flicks through a scrapbook full of the obituaries written about Bournemouth’s chances of Premier League survival. He has proved every expert wrong, myself included! They’re supremely organised and, though Frank Lampard may pick up his first point here, I don’t think he’ll get all three.",
        "Manchester City 3-0 LeedsSam Allardyce said he is as good as Pep Guardiola at his unveiling. He talks the talk, but I can’t see Leeds walking the walk today. Not even the new manager bounce can derail this runaway train at the Etihad. It will be intriguing to see what team is selected by Guardiola, given they have Real Madrid away in the Champions League on Tuesday.",
        "Tottenham 2-1 Crystal PalaceRoy Hodgson has given players like Eberechi Eze and Michael Olise a licence to thrill and they’ve tormented defences, taking Palace to the comfort of mid-table security. But it’s Harry Kane and Son Heung-min who I expect to edge this one to finally give Tottenham fans something to shout about.",
        "Wolves 0-1 Aston VillaAfter losing 1-0 to Manchester United at Old Trafford — their first defeat since February — I’m predicting Villa will immediately bounce back here. Unai Emery has worked wonders. It’s bound to be tight, but one which Villa will sneak against a Wolves team that have lost their bite.Liverpool 1-2 BrentfordLiverpool are on a good run. Five wins in a row have left Jurgen Klopp’s team with an outside shot at finishing in the top four. But I’m saying defeat by Brentford on Saturday will shatter that dream. Thomas Frank’s side can be awkward to play against and I’m not convinced by Liverpool defensively.Newcastle 2-1 ArsenalI love what Eddie Howe is doing with Newcastle. They’re fearless, home and away, and they will take the game to Arsenal, which is precisely what Chelsea did not do in that sorry showing on Tuesday. Sorry Arsenal supporters, but your title charge is about to suffer another significant dent.",
        "West Ham 1-2 Manchester UnitedEvery time I predict West Ham will get a result, they don’t! So maybe it’s good news for David Moyes that I’m saying they will lose this weekend. United have work to do after losing to Brighton on Thursday. Erik ten Hag will demand nothing less than a dominant win, but I suspect it will be a tighter contest than he hopes.Fulham 2-1 LeicesterLeicester have improved under Dean Smith but they still haven’t kept a Premier League clean sheet since November, before the World Cup. Fulham put up a good fight at Liverpool until that disgraceful penalty did them in. I expect a home win at Craven Cottage.Brighton 2-0 EvertonBrighton are my favourite team to watch this season, They’re phenomenal in their play. The way they were passing it around Manchester United on Thursday was mesmeric. If anything, I’ve been kind to Everton here — they could lose by more than two goals at the Amex Stadium.",
        "Nottingham Forest 2-1 SouthamptonI’m predicting Southampton will lose every game they play between now and the end of the season. Forest’s home form has been their saviour. Steve Cooper’s side need to be brave against a team destined for relegation and I think they will be able to lift themselves out of the bottom three."
    ]
}