{
    "articleURL": "/sport/football/article-12052029/Man-United-Man-City-Arsenal-makes-FIFA-23s-Premier-League-Team-Season.html",
    "content": [
        "EA Sports have announced their FIFA 23 Premier League Team of the Season Manchester City and Arsenal have seven players named in the XI between them Below, Mail Sport reveals which two Man United players are in, and who is in goalIt's early May - and that means we're nearing awards season in the Premier League, with plenty of fans gearing up to select their choice XIs as the end of the English domestic campaign on May 28 approaches.",
        "And on Friday, EA Sports announced their FIFA 23 Premier League Team of the Season, with players now available in the popular football video game.Manchester City and Arsenal - currently first and second respectively - perhaps unsurprisingly share the bulk of the team, with seven of the 11 named coming from Pep Guardiola's squad or Mikel Arteta's men.But there were also two Manchester United stars selected by supporters - with question marks over the goalkeeper, centre back and left wing positions too. And below, Mail Sport reveals which players have been chosen for the line-up - and those who narrowly missed out.",
        "Between the sticks, it's Arsenal's Aaron Ramsdale. There's definitely some tough competition in net, but the Gunners star gets the nod.Admittedly Newcastle (27) and Man City (30) have conceded significantly fewer goals than Arsenal (39), but 24-year-old tyro Ramsdale, in just his second season at the Emirates, has locked down the No 1 jersey.His distribution, confidence and communication has seen him accumulate 12 clean sheets, level with Liverpool's Alisson and only behind Man United's David de Gea (15) and Newcastle's Nick Pope (13).At right back, though Ben White is perhaps in with a shout, the selection of Newcastle's Kieran Trippier seems fair enough.The talented defender has proved a real statement signing for the club's Saudi Arabian owners, transforming the mentality with his leadership on and off the pitch, his attitude and, of course, creating chances with his brilliant set pieces.",
        "Arsenal's William Saliba has taken to Premier League football like a duck to water after three successive loans in France. The size of the elegant Frenchman's impact on the Gunners defence can only now really be appreciated given their struggles in his absence. His long-term back injury coincided with Arsenal losing their momentum - it may cost them in the title race.Next to him is another Rolls-Royce of a defender: City's Ruben Dias. The Portuguese is one of Pep's first names on the team sheet and he has adapted well to the innovative 3-2-4-1 formation the Spaniard now seems to prefer.",
        "Either side of him, there are classy defenders, sure. Nathan Ake, John Stones, Manuel Akanji. But he's the leader. He sets the tone. And so it's no surprise to see him in.On the left is Ukrainian Oleksandr Zinchenko, who has made a massive impact on Arsenal along with team-mate Gabriel Jesus, who also moved to north London from City this summer amid a hugely troubling time for his country. What mental strength.In midfield, the trio largely pick themselves. Brilliant Brazilian Casemiro, another player with a transformative effect on his new club, has brought genuine title-winning experience and pedigree to Erik ten Hag's Red Devils.Either side of him are Kevin De Bruyne, the majestic conductor of Pep's dizzyingly complicated orchestra, and potentially one of the players of the season in Arsenal skipper Martin Odegaard. One of two Norwegians to make the team...",
        "And up front, it's a terrifying front three that would strike fear into the hearts of any opposition players unlucky enough to face them. Of course, City's record breaker Erling Haaland leads the line. Enough said. Harry Kane of Tottenham has been brilliant but there's only one striker spot in the team and it goes to the 51-goal man.On the right, Mohamed Salah has been a rare bright spark in a disappointing Liverpool season, with 29 goals and 11 assists. Silly numbers, especially in the context of their struggles to even make the top four.While on the other side is United's second representative in this team - Marcus Rashford. He's discovered his best form again and it's a joy to watch him in full flow cutting in from the left wing. Defenders who narrowly missed the cut were Chelsea's Reece James and United's Raphael Varane. In midfield, Newcastle's Bruno Guimaraes has been a revelation, with Gunners wingers Bukayo Saka and Gabriel Martinelli also perhaps unfortunate to miss out. Son Heung-min's late resurgence saw him voted onto the shortlist too.",
        "EA Sports' FIFA 23 Premier League Team of the Season (4-3-3): Aaron Ramsdale (Arsenal); Kieran Trippier (Newcastle), William Saliba (Arsenal), Ruben Dias (Manchester City), Oleksandr Zinchenko (Arsenal); Kevin De Bruyne (Manchester City), Casemiro (Manchester United), Martin Odegaard (Arsenal); Mohamed Salah (Liverpool), Erling Haaland (Manchester City), Marcus Rashford (Manchester United). "
    ]
}