{
    "articleURL": "/wires/reuters/article-12051339/US-STOCKS-Wall-Street-climbs-investors-cheer-upbeat-Apple-earnings.html",
    "content": [
        "Regional banks rebound after bruising selloff",
        "U.S. employers add 253,000 jobs in AprilLyft slumps as lower fares stoke margin concernsIndexes up: Dow 1.39%, S&amp;amp;P 1.25%, Nasdaq 1.19%(Updates prices to open)By Ankika Biswas and Sruthi ShankarMay 5 (Reuters) - Wall Street's main indexes gained on Friday as Apple's upbeat results underscored resilience in corporate earnings, while a stronger-than-expected jobs report eased fears of an imminent economic downturn.Apple Inc gained 4.4% on better-than-expected results, helped by strong iPhone sales and notable inroads in India and other newer markets, fuelling a near 2% advance in technology stocks.Investors appeared to take in stride data showing U.S. employers boosted hiring in April while raising wages, pointing to sustained labor market strength that could prompt the Federal Reserve to keep interest rates higher for some time.The Labor Department's report showed non-farm payrolls increased by 253,000 last month, higher than economists' expectations of 180,000.Wages increased 4.4% year-on-year in April after climbing 4.3% in March, while the unemployment rate fell to 3.4%.\"This is a strong report and shows that the labor market is resilient. It bails out the Fed for raising another quarter point,\" said Peter Cardillo, chief market economist at Spartan Capital Securities.\"It's been a tough week for the stock market, the regional banking problems have raised the fear factor, but Apple earnings came in strong. Stocks are coming up from near-term oversold condition.\"",
        "Traders are betting the Fed will start easing the policy rate by September, according to CME Group's FedWatch Tool, compared with July before the release of the jobs data.The Fed raised its interest rate by 25 basis points as expected on Wednesday, but Chair Jerome Powell noted it was too early to say with certainty that the rate-hike cycle was over as inflation remains the chief concern.Wall Street fell on Thursday after PacWest Bancorp's move to explore strategic options deepened concerns about the health of regional banks, pulling down shares of peers and big banks such as JPMorgan Chase and Wells Fargo &amp;amp; Co.PacWest rebounded on Friday with a 48.3% gain, while Western Alliance Bancorp bounced back 32.0%. Western Alliance on Thursday denied a report that it was exploring a potential sale.At 9:48 a.m. ET, the Dow Jones Industrial Average was up 459.05 points, or 1.39%, at 33,586.79, the S&amp;amp;P 500 was up 50.85 points, or 1.25%, at 4,112.07, and the Nasdaq Composite was up 141.80 points, or 1.19%, at 12,108.20.Following upbeat results from megacap companies, analysts expect profits for S&amp;amp;P 500 companies in the first quarter to decline 0.9% from a year earlier, according to Refinitiv data, compared with a 5.1% drop expected at the start of April.",
        "Used-car retailer Carvana Co jumped 30.8% as it expects to post a profit in the current quarter and plans to further bring down excess used-car inventory.Lyft Inc slumped 19% as the ride-hailing company's strategy to claw back market share from rival Uber Technologies Inc with lower fares stoked concerns about a hit to its profit margins.Advancing issues outnumbered decliners for a 6.06-to-1 ratio on the NYSE and a 3.47-to-1 ratio on the Nasdaq.The S&amp;amp;P index recorded four new 52-week highs and two new lows, while the Nasdaq recorded 37 new highs and 43 new lows. (Reporting by Ankika Biswas and Sruthi Shankar in Bengaluru; Additional reporting by Stephen Culp in New York; Editing by Subhranshu Sahu and Shounak Dasgupta)"
    ]
}