{
    "articleURL": "/wires/reuters/article-12046267/Regeneron-beats-quarterly-profit-estimates-Dupixent-strength.html",
    "content": [
        "By Sriparna Roy",
        "May 4 (Reuters) - Regeneron Pharmaceuticals Inc's first-quarter sales of blockbuster eye drug Eylea came in below Wall Street targets on Thursday as competition heated up, dragging the company's shares more than 5% lower in early trade.Eylea, jointly developed with Bayer AG, has been a key growth driver for Regeneron for years, but its sales have fallen over the past few quarters, partly due to rising competition from Roche's Vabysmo since the rival secured U.S. approval last year.\"I say there's a little bit of a new-kid-in-town kind of effect,\" said EF Hutton &amp;amp; Co analyst Michael King, as doctors may be willing to give Vabysmo a try because it is the newest drug in the market.Regeneron is pinning its hopes on approval for a high-dose version of Eylea that could allow longer intervals between injections for patients - a feature that analysts expect will offer the company a better defense against Vabysmo.The quarterly results from Regeneron \"place even more emphasis on the need for near-flawless execution with the upcoming approval and likely launch\" of high-dose Eylea, BMO Capital Markets analyst Evan Seigerman said in a note.Quarterly Eylea sales of $2.28 billion missed analysts' expectations of $2.43 billion, according Refinitiv data.Low-dose Eylea is expected to become a smaller share of the company's revenue if the higher-dose version gains approval, Regeneron CEO Leonard Schleifer said.",
        "The U.S. health regulator's decision on the new version is expected by June 27.The company has also been leaning on its anti-inflammatory drug Dupixent - a treatment currently approved for five indications including asthma and atopic dermatitis, or eczema.Quarterly sales of Dupixent, recorded by partner Sanofi , rose about 37% to $2.49 billion, helping Regeneron beat quarterly profit estimates.Analysts said the beat was also driven by better-than-expected collaboration revenues.(Reporting by Sriparna Roy and Raghav Mahobe in Bengaluru; Editing by Devika Syamnath)"
    ]
}