{
    "articleURL": "/health/article-12051661/Ambulance-warning-celebrating-Coronation-999-crews-prepare-5-000-emergency-calls.html",
    "content": [
        "Ambulance bosses predict  a surge in demand over the Coronation celebrations Read more: MailOnline presents the  ultimate guide to King Charles' big dayRoyal revellers have been asked to play their part in avoiding a trip to A&amp;E this weekend as the London Ambulance Service prepares for an extra 1,000 call outs.",
        "As Brits descend upon the capital to be part of the historic Coronation, LAS is preparing for its own bumper weekend.The service usually sees about 4,000 emergency calls on a Saturday at this time of year, but is forecasting over 5,000 as crowds descend for King Charles' big day.It is predicting extras slips, bumps and falls from the crowds as well as the risk of people forgetting to eat and drink enough water on the day.LAS's chief paramedic Dr John Martin said while they were proud to play their part in helping the city mark the Coronation, the public could help them immensely by being prepared. ",
        "'There will be many visitors coming to central London to join the celebrations so we expect to be particularly busy,' he said. 'We ask the public to play their part: if you are coming to join the celebrations, please remember there may be showers across the weekend so bring a waterproof layer, wear appropriate clothing for the temperature, make sure you carry any regular medication with you, drink plenty of water and eat regularly.'People can also help us by only calling 999 in life threatening emergencies and using alternative services such as 111 online for advice about less serious issues.'To help manage the event itself, LAS is deploying 265 extra staff to be on hand in crowded areas to ensure anyone who falls seriously ill can get help as quickly as possible. ",
        "LAS has prepared for the Coronation-day operation - known as Golden Orb - for five months. Like other ambulance services in England, LAS has struggled to hit NHS targets for response times in recent months.In March, the latest data available, heart attack and stroke patients, known as category two callers, had to wait 39 minutes and 11 seconds for an ambulance, more than double 18 minute target for such emergencies.But LAS did perform slightly better than the 39 minutes and 33 seconds it took on average across England for paramedics to reach such emergencies. "
    ]
}