{
    "articleURL": "/tvshowbiz/article-12057687/Olly-Murs-puts-amazing-performance-King-Charles-IIIs-Coronation-concert.html",
    "content": [
        "Olly Murs put on an 'amazing' performance at King Charles III's Coronation concert at Windsor Castle on Sunday evening.",
        "The former X Factor star, 38, took to the stage to perform his classic hit Dance With Me Tonight in front of the royal family. The high energy number which certainly got the crowd dancing left BBC viewers gushing over the singer. He looked effortlessly cool in a cream blazer and a pair of matching trousers which he donned over a crisp white vest as he danced around the stage. Twitter users said he was 'the best' of the star studded line up which also included Lionel Richie and Katy Perry. ",
        "One wrote: 'We think you should have performed more than one song at the #CoronationConcert Mr Murs... Soooo good!'A second said: '@ollymurs is the best', while another added: '@ollymurs... he was the best! Only put it on to watch him'. 'I agree so much on this ! Such a fun song! Gets the crowd going and Olly smashing it as always!' someone else penned. '@ollymurs what a performance for the coronation just amazing,' added another. Despite the incredible show, some BBC viewers were left confused by the Essex singer's American accent. One wrote: 'What's with Olly Murs and the bizarre American accent??''I love Olly and I know he sings in an American accent but he's at the KING OF ENGLAND'S Coronation guys', said a second.",
        "Another joked: 'Olly is American now.'",
        "Earlier in the day, Olly took to Instagram to update fans on how he was feeling ahead of performing in front of the royal family. The singer revealed he headed to the gym to try and help his nervous and anxiety as it was the biggest honour of his career. He explained: 'Morning everyone, it's here - the King's Coronation performance and I'm really excited about it. I've been to the gym this morning and have had a good session. I'm feeling ready and pumped for today.'It's going to be a real special moment for me. I'm really excited and just wanted to say thank you to everyone for all the kind messages and support and love. Can't wait - it's going to be awesome'.The King and Queen and other members of the royal family joined around 20,000 members of the public at the Coronation Concert at Windsor Castle to continue the celebrations after their crowning at Westminster Abbey on Saturday. The Coronation Concert saw performances by Paloma Faith, Olly Murs, veteran rock guitarist Steve and Nicole Scherzinger of The Pussycat Dolls."
    ]
}