{
    "articleURL": "/tvshowbiz/article-12045229/Jax-Taylor-reveals-Lala-Kents-ex-Randall-Emmett-repaid-75K-loan.html",
    "content": [
        "Jax Taylor and Brittany Cartwright ripped Lala Kent's ex Randall Emmett for not paying back a $75,000 loan on their When Reality Hits podcast Tuesday.",
        "The Vanderpump Rules alums Taylor, 43, and Cartwright, 34, delved into detail about Emmett's non-payment on a longtime loan on their podcast.'I'm a little pissed off and its annoying,' Taylor said of the situation with Emmett, who has past been publicly accused of not paying back loans amid a 2019 rift with 50 Cent.'Jax has been nicer than he should have been because we all know who Randall is - he was Lala's ex, her baby daddy and he treated her terribly and did all this terrible stuff while they were dating,' Cartwright said of the film producer.Cartwright said her spouse and Randall 'got super close while he was dating' Kent, and that while she hadn't seen Emmett since his split with her friend Kent, Taylor remained in touch with him.",
        "'Jax had done this business deal with Randall so he still had to keep in contact - not like seeing him or hanging out or anything like that - but he was having to talk to him because he owed him so much money,' Cartwright explained.Taylor explained the details that led to the financially-fueled falling out, noting that he initially went into business with the producer during the timeframe Emmett was dating Kent.'Randall and I had a deal where I would invest in movies with him,' Taylor said. 'I invested into three movies where basically, they were bridge loans and I would get a producer credit.",
        "'I invest in the movie, I wait till the movie airs and then I would get my money back - there's really no losing in this, it's a pretty easy thing, he does it with his mom and dad, too.'Taylor said, 'We trusted him and I've learned my lesson big time,' adding that prior to the latest loan, Emmett had made good on all previous loans.Taylor said that just prior to the coronavirus pandemic in early 2020, Emmett called him and asked him if he wanted to invest $100,000 into a burgeoning project.Taylor said that coronavirus had shut down the film project, but when he contacted Emmett, he received 'some bulls*** excuse' about where the money went.He noted that Emmett was still working on separate movies, but did not include Taylor in those, nor did he pay the money back.",
        "'Where did that $100 grand go?' Taylor said.Taylor said that Emmett is now going by the name Randall Ives 'because his name is so shot in this town;' and to mislead Hollywood cast and crew members who sign up for films not knowing he is involved.'Everybody in Hollywood has written a negative story about Randall,' Taylor said.Taylor said that Emmett has paid him back $25,000 from the initial loan and still owes him $75,000.",
        "Taylor said that he has told Emmett that he would only speak to him through his lawyer, and would be willing to accept $50,000 to put an end to the debt.Cartwright added, 'He needs to pay everything he owes you,' to which Taylor said he would rather have the $50,000 'than nothing at all.'Taylor added, 'I am Jax Taylor, a family man, you took money from a family man, I need to support my family and pay my mortgage, you took from me. I need to feed my family, that is why I made these investments to make money to support my family.'Taylor said he was further infuriated seeing Emmett continue to live an expensive lifestyle via Instagram when he has yet to repay the loan.'Where the f*** is my money?' he said. 'You took from a family man, I'm not a studio.'Cartwright added, 'Randall, just pay him back.'"
    ]
}