{
    "articleURL": "/wires/pa/article-12044255/He-joy--Pep-Guardiola-says-Erling-Haaland-deserves-success.html",
    "content": [
        "Pep Guardiola said “special striker” Erling Haaland richly deserved the guard of honour by his Manchester City team-mates after breaking the Premier League single-season scoring record.",
        "The 22-year-old has made a mockery of those doubting whether he could repeat his goalscoring feats after last summer’s switch from Borussia Dortmund to the Etihad Stadium.Haaland took his tally to 51 in all competitions on Wednesday night, when his cool finish moved his Premier League haul on to 35 and broke Andy Cole and Alan Shearer’s competition record.The Norway international scored between Nathan Ake and Phil Foden’s efforts in a 3-0 win against West Ham that was followed by what Guardiola says was a pre-planned guard of honour.",
        "“It was (special), I think he deserved it,” the City boss said. “All the team deserved it because without the team he couldn’t do it, but he is a special striker.“We are very pleased for him because he is a joy, not just to work with him as a manager. I think everyone is happy to have him with us.“Of course this record will be broken sooner or later, maybe by him in the future or maybe another one but they’ll have to score a lot of goals because he scored a lot.“Of course (we planned the guard of honour). We thought about that and in football when there is a special occasion, we have to show how special it is.",
        "“Today it was with Erling. Another one, another day will happen but of course to score and overcome the position of Andy Cole and Alan Shearer – incredible, top, top strikers – is special.”",
        "Guardiola said “we cannot achieve many things without a good striker”, namechecking previous City frontmen like Sergio Aguero, Gabriel Jesus, Edin Dzeko and Mario Balotelli.But this night was all about Haaland, who still has five Premier League matches to increase his eye-watering record even further.“At the end when you buy a player in Erling we know he score goals everywhere and we thought he could do it (here),” Guardiola said.“But at the end we don’t know. You have to work and see the process.“He understands what we want to do, the players understand his movement and whatever, so a question of time.“The impact or how he adjusted to the league was so quick.“The first two goals was against West Ham. It’s a coincidence as he breaks the record against West Ham when he scored the first goals against them.“Immediately we saw he is a guy when you provide him with balls, he scores in all situations – except free kicks, but maybe in the future.“But penalties, crosses, combinations and transitions, he is a guy who can do many, many things. That’s why he scored a lot of goals.”",
        "Haaland’s latest goal helped calm any nerves at the Etihad Stadium, with Wednesday’s victory seeing title favourites City usurp Arsenal and reclaim top spot.“I said after Arsenal (last week) when everybody said it’s over, I said it was not over in my press conference,” Guardiola said of the 4-1 win last midweek.“Yesterday Arsenal proved it. They will not give up. I know quite well Mikel (Arteta), how competitive he is and I know a few players.“Arsenal is one of the historical teams and they will be there. I said to the players.”As for West Ham, the 3-0 defeat came on a night when illness ruled out Declan Rice, Nayef Aguerd and Tomas Soucek on the day of the game.David Moyes, whose side face Manchester United on Sunday, said: “I have got to hope they are (back).“Two of them we’re not sure if it’s maybe a bit of food poisoning they’ve picked up whether at the training ground or hotel.“One of them we think has got a virus, so, I’m not a doctor, whether antibiotics fix that not quickly or how you work it I’m not quite sure.“So, hopefully they’ll have a chance for the weekend but I think the biggest thing I have to praise the players who came in and did such a good job.",
        "“For long periods against a really good team we made it quite difficult”"
    ]
}