{
    "articleURL": "/wires/ap/article-12045041/Wisconsin-judge-hear-arguments-abortion-lawsuit.html",
    "content": [
        "MADISON, Wis. (AP) - Attorneys for a Republican prosecutor urged a judge Thursday to toss out a lawsuit seeking to repeal Wisconsin's 174-year-old abortion ban, arguing that a newer state law permitting pre-viability abortions complements the ban rather than supersedes it, as Democrats maintain.",
        "Wisconsin lawmakers passed a law in 1849 that outlaws abortion except to save the mother's life. The U.S. Supreme Court's landmark Roe vs. Wade decision in 1973 that legalized abortion statewide effectively voided the ban. It was held in abeyance for nearly five decades until the high court struck down Roe vs. Wade last year. The decision reactivated the ban.State Attorney General Josh Kaul, a Democrat, filed the lawsuit in Dane County circuit court last June seeking to repeal the ban. Kaul argues that the 1849 law is so old it was essentially adopted without the people's consent; or alternately, that more permissive restrictions on abortion enacted in Wisconsin in 1985 to comply with Roe v. Wade supersede the older statute. The 1985 legislation permits terminating pregnancies up until a fetus can survive outside the wombKaul has named three district attorneys in counties that were home to abortion clinics as defendants, including Sheboygan County's Republican prosecutor, Joel Urmanski. He filed a motion to dismiss the case in December.Dane County Circuit Judge Diane Schlipper listened to more than 90 minutes of oral arguments on the motion Thursday. She didn't issue a decision from the bench, and it's unclear when she might release a ruling.Urmanski's lead attorney, Matthew Thome, first argued that Kaul lacks the legal standing to challenge the ban because it doesn't affect his ability to perform his duties as attorney general.",
        "Kaul's argument that the ban is so old it's unenforceable is a \"stretch,\" Thome added. Laws don't vanish from the books, and the only reason the ban wasn't enforced was that the original 1973 Roe v. Wade decision blocked it, he said.He also maintained that legislators never repealed the ban. Modern-day laws restricting abortion, including the 1985 post-viability restriction , co-exist with the ban in \"harmony,\" he said. The new laws give county prosecutors charging options, he said.Assistant Attorney General Hannah Jurss maintained that the ban clearly conflicts with modern-day laws that permit abortion in some circumstances, creating confusion that only a judge can clarify. Kaul has legal standing because he's Wisconsin's top law enforcement official, and he needs to know what laws apply in the state, she said.The modern laws don't mean anything if the ban allows an abortion only to save the mother's life, she added.\"It can't be that the law says something is illegal and legal at the same time,\" Jurss said.She acknowledged that the argument that the ban is too old to be enforced has little precedent in Wisconsin. But she said the U.S. Supreme Court's decision to overturn Roe v. Wade was unprecedented as well.Schlipper offered few hints on which way she is leaning. She did take Thome to task over his contention that prosecutors can pick and choose which abortion laws to enforce.",
        "\"So, we´re back to doctors should choose their counties carefully?\" the judge said. \"People have a right to know which law applies where.\"She also questioned Jurss on whether the doctrine of implied repeal applies in the case. The doctrine is a legal concept that states' newer laws supersede old ones.Jurss responded that modern abortion laws address the same issue as the ban so the doctrine applies. Thome urged the judge to \"get back to principles,\" pointing out again that the Legislature has chosen not to repeal the ban and Schlipper shouldn't substitute her judgment for that of policymakers.The case carries so much weight that no matter what happens in Schlipper's courtroom or at the appellate level, it will almost certainly end up at the state Supreme Court.That plays to Kaul´s advantage because liberal-leaning justices will hold a 4-3 majority on the court after Milwaukee County Circuit Judge Janet Protasiewicz is sworn in this August. Protasiewicz signaled repeatedly during her campaign that she supports abortion rights, an unprecedented approach in a judicial race."
    ]
}