{
    "articleURL": "/sciencetech/article-12046285/Update-iPhone-Apple-issues-new-iOS-rapid-security-update.html",
    "content": [
        "Apple has issued the first 'Rapid Security Response' security update to iPhonesThis can be installed through Settings, and involves restarting the deviceApple has issued the first of a new type of security update for iPhones, iPads and Mac computers, called a 'Rapid Security Response'.",
        "These software releases aim to deliver important security improvements to devices between updates to the operating system.They could help to patch up vulnerabilities within the software that could give hackers access to your smartphone. The first 'Rapid Security Response' has been made available to Apple devices running the latest versions of iOS, iPadOS and macOS.These are iOS 16.4.1, iPadOS 16.4.1 and macOS 13.3.1, all of which were released last month.",
        "To install the first 'Rapid Security Response', go into your device's 'Settings', then click 'General' and 'Software Update'.",
        "Go to the Settings app on your Apple device.Tap 'General' and then 'Software Update'.A box should appear entitled 'iOS Security Response 16.4.1 (a)' and a button to 'Download and Install', which you should press.After clicking that button and then 'Restart Now', your device will turn off and back on again with the update installed.",
        "An option should appear that reads 'iOS Security Response 16.4.1 (a)', and below it a button which says 'Download and Install'.After clicking that button and then 'Restart Now', your device will turn off and back on again with the update installed. This should only take a few seconds, so is a lot quicker than normal iOS iPadOS and macOS updates.When it is completed, your operating system will read as iOS 16.4.1 (a), iPadOS 16.4.1 (a) or macOS 13.3.1 (a).Your device's settings will also be made to ensure that any future 'Rapid Security Response' is installed automatically.To check this, go back to the 'Software Update' section and click 'Automatic Updates'.There should be a switch next to an option called 'Security Responses &amp; System Files', which should be in the green position.",
        "Even with this option on, you may still be asked to restart your device to complete future setups.But if you disable it, the device will still receive the latest security fixes in the subsequent software update.Some may also be installed automatically even if it is turned off.",
        "The rollout of the first 'Rapid Security Response' comes less than a month after iOS 16.4.1 was released, which fixed two urgent security flaws.Both of them could have allowed hackers to infiltrate the device and 'execute arbitrary code', according to Apple.This code could have given them access to private data, let them gain control over the device's functionality and allowed them to install malware.It could even have allowed them to gain control of other devices connected to the network, or internet, that the original was connected to.Apple has said that the new 'Rapid Security Updates' could be used to 'mitigate some security issues more quickly', which may already have been exploited or reported to exist.They could also help improve critical system libraries - the collections of software components that allow the operating system and apps to run.For example, the Safari web browser or its WebKit engine.The concept of 'Rapid Security Responses' was unveiled at Apple's Worldwide Developer Conference (WWDC) last year.",
        "It gives users the option to uninstall a security patch if it causes them problems, and opt out of receiving them entirely.",
        "The last major software update was iOS 16.4, which came with a range of new features, including the addition of 21 new emoji to the keyboard.This includes the highly anticipated pink heart icon, as well as a shaking face ('I'm shook'), a moose, stem ginger, the Wi-Fi symbol and a pair of maracas. Apple software updates are not always plain sailing, which explains why some are reluctant to initiate them when offered. Some of those who have updated to iOS 16.4 complained that that a system bug is rapidly draining their device's battery life.Last month, iPhone users across the world also could not access live forecasts on the Apple Weather app, which some also linked to their new operating system.",
        "If you're the proud owner of a retro iPhone that's over ten years old, you may soon be forced to splash out on an upgrade. That's because Apple is cutting support for several online services, like the App Store, Siri and Maps, on devices running an operating system from iOS 11 to iOS 11.2.6.So if you own a handset which can't upgrade to iOS 11.3 at the very least, it will be rendered largely defunct from this month onwards. Although Apple is known to stop providing bug and security updates to older operating systems, this will mark the first time it has actively reduced their functionality.Find out if you will be affected"
    ]
}