{
    "articleURL": "/property/article-12059043/Five-bed-home-panoramic-vistas-Cornish-estuary-goes-market-4million.html",
    "content": [
        "The beautiful Cornwall property is in the exclusive waterfront Restronguet Point READ MORE: Celebs' £4M luxury beach homes could be swept into sea by 2040 A spectacular home with 325ft of water frontage and its own slipway has gone on the market for offers over £4million.",
        "The large detached property, called Bellevue, sits in a broad landscaped plot on the exclusive peninsula of Restronguet Point in Cornwall.It has spectacular panoramic views over the Fal Estuary on the south coast.The five-bedroom property, built in 1955 and extended in 2009, is being sold for only the second time in its history.Restronguet Point is regarded as one of the most exclusive and desirable waterfront locations in the county, accessed by a no-through lane.",
        "Properties in the prestigious area have skyrocketed in price since the 1990s - as some bought for less than £200,000 back then have been sold for upwards of £1million in recent years. The 'stuff of dreams' house is almost completely hidden from the lane and looks due south over the Fal Estuary and the mouth of Restronguet Creek.There is a reception hall, large living room and dining room both with far-reaching southerly views, kitchen, sun room, five bedrooms and three bathrooms on the ground floor.Upstairs is another 21ft long living room with a balcony and a study.Outside it has a detached garage, sweeping lawns and over 325ft direct deep water frontage with steps to the foreshore and a slipway. Two deep water moorings may be available from the Harbour Master.The property is expected to attract interest from both national and international buyers.",
        "Andrew Chilcott, from Lillicrap Chilcott, said: 'The sale of Bellevue for the first time in almost 55 years can reasonably be considered as one of the most important opportunities to come to the prime waterfront market in Cornwall in recent years in a world class waterfront location.'This is, without question, one of the most conveniently placed, prestigious and beautiful waterside locations in Cornwall - of huge appeal to those with keen sailing interests and those who seek an enchanting and blissful setting beside the water to live.'It's a very lovely place. We have been doing viewings and have seen seals at the bottom of the garden by the slipway and a pod of dolphins.'It's the stuff of dreams.'"
    ]
}