{
    "articleURL": "/tvshowbiz/article-12040351/KIIS-FM-Jackie-O-Henderson-breaks-tears-live-radio.html",
    "content": [
        "Radio host Jackie 'O' Henderson was moved to tears live on air on Tuesday after she watched the music video for Lewis Capaldi's new single Wish You the Best.",
        "The song, released last month, is about a break-up, but its music video is about the bond between an elderly man and his dog and how the animal loyally visits his master's grave after he dies.Jackie, 48, burst into tears upon watching the film clip with the KIIS FM team, and challenged her listeners to watch it without crying.'He's a postman and he takes his dog every day on his bike. I would love for anyone to watch it and let me know if you didn't cry,' she said.The Kyle and Jackie O Show Instagram page shared a video of Jackie crying over the heartbreaking ballad and captioned it: 'We weren't prepared.'",
        "It has been a rough week for Jackie, who was left mortified on Wednesday when a celebrity psychic told her she may not have sex until 2027.Clairvoyant Georgina Walker was doing her usual radio segment when Jackie's co-host Kyle Sandilands asked her when the single mother's dry spell would finally end.'I see a 27. It could mean the second of July, or 27 weeks or could be the year 2027. But it is going to happen,' Georgina responded. ",
        "Jackie was dismayed after being told she may have a long wait ahead of her, which prompted Georgina to reassure her the prediction could mean the second of July.",
        "'On that date I will be in Italy,' Jackie said, to which Georgina responded: 'Oh really? Let's get a gigolo going!''Do I have to pay for it?' Jackie asked, and after being told a gigolo is in fact a professional sex worker, she said she wasn't interested in paying for intimacy. ",
        "Back in March, Jackie admitted she loves being single because it means she is responsible for maintaining her own happiness.The mother of one spoke about being a single woman in her forties during an interview with KIIS FM's Will and Woody on International Women's Day.Jackie explained her friends and family keep her so busy she doesn't have time to feel 'lonely' about being single."
    ]
}