{
    "articleURL": "/wires/afp/article-12049625/HSBC-faces-shareholder-vote-splitting-bank.html",
    "content": [
        "Bank giant HSBC faces a vote by shareholders on Friday over a proposal by its largest stakeholder, Chinese insurer Ping An, to split the business to seek better returns.",
        "Asia-focused HSBC has urged shareholders to vote down the proposal at its annual general meeting in Birmingham, central England.The vote comes at the end of a week in which the London-headquartered bank posted a surge in quarterly net profit, boosted by rising interest rates and its rescue of the UK arm of failed US lender Silicon Valley Bank.Ping An has argued that the lender lags international peers and a recent improvement in performance was tied to rising interest rates, which it claims have peaked.The US Federal Reserve this week hinted that it would pause a policy of hiking borrowing costs aimed at cooling elevated inflation.The European Central Bank meanwhile on Thursday delivered a smaller interest rate hike as higher borrowing costs begin to take their toll, but said it had \"more ground to cover\" in fighting red-hot price increases.\"It is necessary for HSBC to push for structural reform to fundamentally address HSBC's underlying market competitiveness issues,\" Michael Huang, chairman and CEO of Ping An Asset Management, recently said.Ping An is calling for HSBC to engage in a \"strategic restructuring\" that would see it create a separately listed bank headquartered in Hong Kong.Huang said the proposal would allow HSBC to retain control over a separate Asia business.",
        "He adds that the bank's management has \"exaggerated many of the costs and risks\" associated with a split.HSBC was among a number of major banks to cancel dividends early in the Covid-19 pandemic after a de facto order from the Bank of England -- a move that riled some Hong Kong investors.Some retail investors have cited the dividends cancellation as a reason to back Ping An's spin-off proposal."
    ]
}