{
    "articleURL": "/wires/reuters/article-12058955/Blinken-threatened-contempt-US-Congress-Afghanistan-cable.html",
    "content": [
        "By Patricia Zengerle",
        "WASHINGTON, May 8 (Reuters) - The Republican chairman of the U.S. House of Representatives Foreign Affairs Committee threatened Secretary of State Antony Blinken with contempt of Congress if he does not comply with a subpoena seeking a classified cable related to the August 2021 U.S. withdrawal from Afghanistan.In a letter to Blinken dated Friday and released on Monday, Representative Michael McCaul said information that has been provided about a \"dissent channel\" cable sent in July 2021 and the department's response to the cable were insufficient to satisfy the committee.The committee issued a subpoena in March seeking the information.The \"dissent channel\" allows State Department officials to communicate directly with senior officials. A Wall Street Journal article in August 2021 said the cable warned top officials of the potential collapse of Kabul soon after the withdrawal of U.S. troops.The State Department has said some information can only be shared with senior officials to protect the identity of those expressing dissent. Asked for comment about McCaul's letter, a spokesperson said the department would provide Congress information needed to do its job while protecting the ability of State Department employees to do theirs.\"It´s unfortunate that despite having received a classified briefing on the dissent channel cable as well as a written summary that the House Foreign Affairs Committee continues to pursue this unnecessary and unproductive action,\" the spokesperson said in an emailed statement.",
        "McCaul has launched an investigation into the messy withdrawal from Afghanistan and events there since. Republicans - and some Democrats - say there has never been a full accounting of the chaotic operation, in which 13 U.S. service members were killed at Kabul's airport.The letter said the department must comply or assert a legal basis to withhold the documents no later than May 11 at 6:00 pm EDT (2200 GMT).\"As noted above, should the Department fail to comply with its legal obligation, the Committee is prepared to take the necessary steps to enforce its subpoena, including holding you in contempt of Congress and/or initiating a civil enforcement proceeding,\" the letter said. (Reporting by Patricia Zengerle; Editing by Sandra Maler)"
    ]
}