{
    "articleURL": "/wires/reuters/article-12057861/White-Sox-score-11-2nd-inning-dominate-Reds.html",
    "content": [
        "The Chicago White Sox scored 11 runs in the second inning and bludgeoned the host Cincinnati Reds 17-4 on Sunday afternoon.",
        "Hanser Alberto homered for the second straight game, Gavin sheets hit a three-run shot and Andrew Vaughn doubled, tripled and drove in four runs as the White Sox claimed the rubber match of the three-game series. Chicago has won five of its last seven games.The Reds got solo home runs from Jonathan India, Spencer Steer, Tyler Stephenson and Wil Myers, but lost for the fifth time in seven games.Reds right-hander Graham Ashcraft (2-1) struck out two in a 1-2-3 first inning, but his second inning fell apart quickly. The White Sox sent 14 batters to the plate before it was over.Alberto's two-run shot put Chicago ahead 2-1, and, after the Reds recorded two outs, the floodgates opened. A walk to Tim Anderson loaded the bases. Andrew Benintendi singled in two runs, Vaughn's triple brought in two, Luis Robert Jr. hit an RBI single and Yasmani Grandal added a run-scoring base hit off reliever Casey Legumina. Sheets then launched a long home run to right for an 11-1 lead.Ashcraft surrendered a career-worst eight runs on six hits and two walks in 1 2/3 innings. He struck out three. Legumina allowed six runs (three earned) on five hits and a walk in 1 1/3 innings.The beneficiary of the 18-hit offensive onslaught was right-hander Michael Kopech (1-3), who gave up the four solo shots. India hit Kopech's second pitch of the game over the right field wall for a 1-0 lead. Steer and Stephenson went back-to-back in the third, and Myers' blast came in the fourth.",
        "Kopech left after six innings, giving up the four runs on eight hits with a walk and two strikeouts. He also hit a batter.Alberto added two doubles and finished with four hits and a career-high four RBIs; Robert reached base four times, scored four runs and drove in two; Benintendi had three runs, two hits and two RBIs and Vaughn added three hits and two runs.Steer had three of the Reds' 10 hits, and Myers robbed Chicago's Seby Zavala of a home run with an over-the-wall catch in the sixth inning.Backup catcher Luke Maile pitched the top of the ninth for the Reds. He gave up a hit and no runs.--Field Level Media"
    ]
}