{
    "articleURL": "/wires/ap/article-12044139/YouTube-prankster-testifies-video-got-shot.html",
    "content": [
        "LEESBURG, Va., (AP) - Tanner Cook's prank videos were known to security guards at Dulles Town Center, a mall in northern Virginia where Cook sometimes found his unsuspecting targets.",
        "And the content creator was known to law enforcement. The sheriff's deputy who found Cook shot and bleeding outside the mall last month said he recognized Cook immediately.But Cook's pranks were unfamiliar, confusing and frustrating to Alan Colie, the man charged with shooting Cook while he and his team surrounded Colie last month for their latest joke.Cook, who has more than 50,000 subscribers to his \"Classified Goons\" prank channel on YouTube, testified for the first time Wednesday about the shooting inside the mall, which prompted a massive police response and panic from callers reporting an active shooter.Cook, 21, acknowledged that he and a cohort approached Colie at the mall's food court while two others filmed the prank from a short distance away.Cook described the prank as playing \"funny words\" on a Google translate app and watching Colie's confused reaction.",
        "On cross-examination, he acknowledged that he stuck his phone about six inches (15 centimeters) from Colie's face while the translate app repeated the phrase \"Hey dips---, stop thinking about my sparkle\" in English and Spanish.Colie backed away from the 6-foot-5 Cook (196 cm), who kept advancing toward Colie even as Colie said \"no\" and \"stop\" and pushed Cook's arm away.Then, Cook said, when the two were separated by a small distance, Colie pulled out an handgun and shot him in the abdomen.",
        "\"I was kind of in shock,\" Cook testified Wednesday at Colie's preliminary hearing in Loudoun County General District Court. \"I had to double check I was shot because I didn't feel anything at first.\"Cook fled the food court, and eventually collapsed outside a Cheesecake Factory when he thought he'd reached safety. That's where sheriff's deputies found him and took him to the hospital.Cook said the shooting ruptured his liver and left him scarred.Deputies found Colie in the food court, where he surrendered peacefully. The charges against him include aggravated malicious wounding and use of a firearm in the commission of a felony. He is in jail as he awaits trial.His lawyer, Adam Pouilliard, argued Wednesday that Colie's actions were reasonable under the circumstances.Cook \"is making money by causing fear\" in those he targets, Pouilliard said. \"We know these pranks are designed to generate confusion and frustration. And they do just that.\"Prosecutor Eden Holmes said there was nothing reasonable about Colie's response to the prank.\"They were holding cellphones, not weapons,\" she said of Cook and his associates.Cook said he's been posting pranks online for about a year. He said he was trying to avoid mall security while he filmed the prank on Colie because they had confronted him in the past. A survey of his YouTube channel finds a series of off-putting stunts, like pretending to vomit on Uber drivers and following unsuspecting customers through department stores.",
        "He said his goal in posting the videos is \"to bring people who are watching some kind of relief\" and that many of his viewers \"like when people get frustrated on camera.\"The judge at Wednesday's hearing found probable cause to send the case to a grand jury for an indictment. He acknowledged that the evidence shows Cook was \"perhaps acting in an obnoxious manner\" but said that fact alone \"does not justify the use of deadly force.\""
    ]
}