{
    "articleURL": "/wires/ap/article-12039579/Harper-returns-Phils-160-days-Tommy-John-surgery.html",
    "content": [
        "LOS ANGELES (AP) - Bryce Harper defied the odds and returned 160 days after Tommy John surgery on his right elbow.",
        "The Philadelphia Phillies slugger is trying to stress something else now that he is back in the lineup - patience.Harper went 0 for 4 and struck out three times in the Phillies´ 13-1 loss to the Los Angeles Dodgers on Tuesday night. While the two-time NL MVP was pleased to be back in what many consider to be a miraculous turnaround, there were positives and negatives to take from the first night back.\"I think you´re never excited for what just happened, right? You don´t want that to happen. I want the results to be better,\" Harper said. \"Granted, I´m excited to be back. You know, going through six months of grinding, hard work and to be able to get back today I was extremely excited. Now we´re just rolling into the season and playing as many games as I can.\"Harper saw breaking balls on nine of 16 pitches over four at-bats. Overall, he fouled off four pitches and had swinging strikes on five. His only fair-ball contact was a groundout to third baseman Max Muncy in the fourth inning.\"I thought the bat speed was there. I thought he was on a lot of pitches. There's going to be some timing stuff and recognizing breaking balls and things like that,\" Phillies manager Rob Thomson said. \"It shouldn't take long before he gets up to speed.\"",
        "Harper said he expected to see plenty of breaking pitches from Dodgers' starter Julio Urías and wasn't surprised.\"I feel like my timing is pretty good, it's just pitch selection right now. I had some pretty good pitches in that second at-bat and then on that last one from (Phil) Bickford. I should had better swings on,\" Harper said. \"My swing feels good, I don't want to change anything with that. Just understand it is going to take a minute.\"Harper's other big adjustment is dealing with the pitch clock for the first time. He said that might be a bigger challenge than pitch selection.\"Your whole career you've slowed the game down. I took a long time from the on-deck circle to the batter's box and also in between pitches,\" he said. \"I need to figure out when to use my time out and what else I want to do. The game is going to be a quicker pace for the foreseeable future.\"The return for the two-time NL MVP also occurred at the ballpark where he made his major league debut in 2012.\"Medically it is surprising, but by Harper genetic standards probably not,\" Harper's agent, Scott Boras, said while the Phillies were taking batting practice. \"I remember last Thanksgiving we were talking about when he could come back and he mentioned May and I told him not to tell anyone that.\"",
        "Harper will continue to wear a brace on his right elbow while hitting. He wore it most of last season after originally sustaining the injury last April and hit .286 with 18 homers and 65 RBIs.Harper's return also comes at a great time for the Phillies. The defending NL champs are 15-16 but have won seven of their last 11 games.It adds more power to a deep Philadelphia lineup.The Phillies added Trea Turner - a former teammate of Harper's in Washington - to join a batting order that includes Kyle Schwarber, Nick Castellanos and J.T. Realmuto. Brandon Marsh, who was acquired at the trade deadline from the Los Angeles Angels last year, is fifth in the majors with a .337 batting average.\"It really creates a long lineup,\" Thomson said. \"When you see it, you´re going to see a couple pretty good hitters way down there because Harper is back. Once he gets hot, we´re going to be a handful.\"Thomson moved Schwarber from fifth back to leadoff, where he batted most of last season. Turner is hitting second followed by Harper, Castellanos and Bryson Stott.Thomson said with the number of days off that the Phillies have in May, the expectation is that Harper can be in the lineup every day as long as he remains healthy.",
        "When it comes to the possibility of when Harper will return to the field, Thomson said that is likely to be a couple months away. Harper has played mostly right field, but is taking grounders and throwing from first base.Thomson's biggest worry at the moment is making sure Harper gets off to a good start at the plate.\"I wouldn´t be surprised where it is going to take some time to get true timing back but I´m pretty confident in his abilities,\" Thomson said.To make room for Harper, the Phillies optioned outfielder Jake Cave to Triple-A Lehigh Valley.___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}