{
    "articleURL": "/tvshowbiz/article-12054547/Larsa-Pippen-stands-accompanies-boyfriend-Marcus-Jordan-event-Miami-Beach.html",
    "content": [
        "Larsa Pippen and Marcus Jordan attended the Carbone Beach event in Miami Beach on Friday night.",
        "The 48-year-old reality television personality and the 32-year-old athlete held each other's hands as they strolled along the function's red carpet and made their way toward its main area.The media figure and the son of Michael Jordan, who are currently fielding rumors about a potential marriage, have been romantically linked ever since they were first spotted in each other's company in 2022.Pippen wore a partially sheer sleeveless black top that showcased her toned arms during the event.The former wife of NBA star Scottie Pippen also wore a pair of pink Mugler denim shorts that featured two black portions on her rear end, as well as matching high-heeled shoes.",
        "The reality television personality accessorized with a sparkling purse and various pieces of jewelry, and her flowing dark blonde hair cascaded onto her back.Jordan opted for a nearly all-black outfit that was comprised of a graphic-printed T-shirt, slim-fitting pants and Nike sneakers.Before she became involved with her current boyfriend, Pippen was married to Scottie from 1997 until 2021.The former couple shares sons Scotty Jr., 22; Preston, 20; and Justin, 17, as well as daughter Sophia, 14.The influencer and Jordan were first spotted in each other's company during a lunch date that took place in Miami in September of 2022.",
        "Although sources reported that they were dating the following month, Pippen tried to downplay the rumors and told People that she was 'just friends' with the former athlete.However, the pair ultimately went Instagram official with their relationship this past January.The happy couple has since been spotted in each other's company during several public outings.",
        "Pippen spoke about her relationship with Jordan during an interview with Tamron Hall and expressed via the New York Post that she did not expect to end up with the businessman at first. 'It wasn't like it was planned like that, I think we were just together a lot with our friends and it just happened,' she said.The media personality also stated that she felt as if her love life should not be the subject of public scrutiny.'I feel like I've overcome so many different obstacles because I feel like I should have love. I should be able to date who I want. I should be able to live happy and go wherever I want to go and not be judged,' she said. "
    ]
}