{
    "articleURL": "/wires/ap/article-12038105/Klopp-explains-anger-emotion-spat-referees.html",
    "content": [
        "LIVERPOOL, England (AP) - Jurgen Klopp was charged by the English Football Association with \"improper conduct\" on Tuesday for his post-match comments about the refereeing in Liverpool's dramatic 4-3 win over Tottenham.",
        "The Liverpool manager received a yellow card from referee Paul Tierney after racing along the sideline to celebrate Diogo Jota´s stoppage-time winner Sunday in front of fourth official John Brooks.Klopp was given until Friday to file an official response before the FA considers disciplinary action such as a suspension.\"It is alleged that the manager's comments regarding the match official during post-match media interviews constitutes improper conduct in that they imply bias, and/or question the integrity of the referee, and/or are personal /offensive, and/or bring the game into disrepute,\" the FA said in a statement.Klopp had said after the game that he did not know what Tierney \"has with us\" and also raised issues with comments made by the referee toward him.On Tuesday, Klopp tried to explain his behavior.\"The whole situation shouldn´t have happened at all. It was out of emotion, out of anger in that moment,\" Klopp said. \"That´s why I celebrated the way I celebrated.\"After the game I tried to calm down and didn´t properly. I said (in TV interviews): `What he (Tierney) said to me was not OK.' I opened the box which I didn´t want to open. The rest was things I said about how I felt in that moment and Paul Tierney doing our games. I´m not a resentful person but these things which happen in the past happens, not intentionally but they are there.\"",
        "Klopp pulled up sharply after appearing to injure his hamstring as part of his celebrations at Anfield.Tierney will not referee a game this weekend, but he is the fourth official for West Ham's game against Manchester United on Sunday and the VAR official for Nottingham Forest's match against Southampton a day later.Shortly after Liverpool's win over Tottenham, the Professional Game Match Officials Limited responded to Klopp's comments, saying it strongly refuted \"any suggestion that Tierney´s actions were improper.\"Speaking ahead of Wednesday´s home match against Fulham, Klopp said: \"With all the things I maybe expect a punishment. Refs think I questioned their integrity, which if I am sitting here now calm, I don´t do. We have to wait to see what they come back with.\"___More AP soccer: https://apnews.com/hub/soccer and https://twitter.com/AP_Sports"
    ]
}