{
    "articleURL": "/wires/ap/article-12052393/Craft-loans-Kentucky-GOP-campaign-additional-2M.html",
    "content": [
        "LOUISVILLE, Ky. (AP) - Republican Kelly Craft pumped another $2.25 million into her campaign for Kentucky governor, as her family's wealth fuels an advertising blitz in the final run against chief rival Daniel Cameron for the GOP nomination to challenge Democratic Gov. Andy Beshear in November.",
        "With the latest installments, Craft has loaned her campaign more than $9 million, her campaign finance report showed this week. The former United Nations ambassador is married to coal magnate Joe Craft.Her access to vast funds to bankroll her campaign gives Craft a crucial advantage as the 12-candidate GOP gubernatorial contest reaches the final stretch before the May 16 primary.Cameron, the state's attorney general, had more than $340,000 of campaign cash on hand for the final push, though he's also backed by a well-financed outside group that has run ads attacking Craft.Another GOP gubernatorial candidate, state Agriculture Commissioner Ryan Quarles, had more than $450,000 in campaign money in the bank, to support his marketing campaign and a grassroots network he cultivated from his years in office.Beshear's campaign, meanwhile, approached $7 million in fundraising as he prepares for a tough reelection race against the eventual GOP nominee. Facing token opposition in his party´s primary, Beshear has kept most of his campaign cash in reserve as the GOP campaign grows costlier and edgier.",
        "\"While the GOP candidates continue to fight in an expensive and messy primary, Governor Beshear will continue working hard to improve the lives of all Kentuckians,\" said his campaign manager, Eric Hyers.The Kentucky race is drawing national attention to see if Beshear - who has received consistently high voter-approval ratings - can win a second term despite his party´s struggles in the GOP-trending state.",
        "On the Republican side, Craft has capitalized on her lopsided financial edge to run ads for months touting her candidacy and attacking Cameron, who is widely seen as her main rival. Her latest infusion of loans will continue fueling her marketing blitz in the closing days of the primary contest.\"Kelly's got every market saturated with ads in the last two weeks,\" said U.S. Rep. James Comer, a Craft supporter, before a recent campaign rally in Liberty, Kentucky. \"I think she's going to close the deal.\"The Kentucky congressman said it appears that a significant number of Republican voters remain undecided in the gubernatorial primary, making the candidates' final pitches especially crucial.Cameron, unable to keep pace with the flood of Craft ads during the campaign, has tried to blunt that mass marketing deficit by playing up his tenure as attorney general. He points to his record of challenging Democratic policies and defending the state's near-total abortion ban in courts.\"We´re not running on ads,\" Cameron said at a campaign stop this week in Richmond, Kentucky. \"We´re running on a record that has been demonstrated over the course of these last three years.\"Cameron sounded confident about his prospects of winning the Republican nomination, and - in another dig at Craft - said he hopes that \"when this is all over, that she'll be just as eager to spend money to support our campaign against Andy Beshear.\"",
        "Fellow GOP gubernatorial candidate Eric Deters was more blunt in attacking the influx of Craft's money into the race. At a recent debate, he accused Craft and her husband of \"trying to buy the governorship.\"Craft counters that she has crisscrossed Kentucky for months, making more than 100 stops on what she calls her \"kitchen table tour\" to discuss issues - including education, jobs and combatting illegal drugs - that she says people talk about at home. Craft also has raised well over $1 million from outside individuals during her primary campaign.Craft supporters say her family´s immense wealth - and her ability to self-finance her campaign - would be an asset for Kentucky, freeing her from being beholden to anyone.\"Nobody is going to buy Kelly Craft off,\" Comer said at the Craft rally in Liberty. \"Trust me on that.\""
    ]
}