{
    "articleURL": "/wires/pa/article-12051315/Hard-say-Steve-Cooper-work-Dean-Henderson-again.html",
    "content": [
        "Nottingham Forest boss Steve Cooper cannot say whether he will work with Dean Henderson again in the future after the goalkeeper’s season was ended by thigh surgery.",
        "Henderson has spent the campaign on loan from Manchester United but picked up an injury in January and has not played since, with him going under the knife this week to finally repair the problem.The 26-year-old is likely to want to leave Old Trafford in the summer as he chases regular first-team action, but whether that will be at Forest will primarily depend on whether they are in the Premier League or not.And with Forest’s status up in the air going into the final four games of the season, Cooper was coy when asked whether he would like to work with Henderson again.“Hard to say. I have enjoyed working with him, we have all enjoyed Dean and the personality he is,” he said.“All you see mainly is when he is in goal but there is more to him than that. He is a real good professional, he really cares, he has a fantastic mentality of winning and wanting to be the best, we have really enjoyed working with him and are grateful for what he has given to us and what he will continue to give to us.",
        "“He will still be around and quite visible. The medical teams are working together with United and ourselves on what’s right for him and what they want our contribution to be.",
        "“With Dean he is on loan from Manchester United but he really bought into the football club and the city, moving here and making it a permanent base for the loan showed he really wanted to be part of it on and off the pitch.“We have had great commitment from him, even when he hasn’t been available in the last few months, it is a pity that his season has definitely ended because of surgery, but he has to focus on his recovery.“We have a good working relationship with United and communication. It is still fresh after the surgery for what his recovery plan will be. We wish him well.”Forest have been boosted by the news that midfielder Danilo’s injury is not as bad as first feared.The Brazilian limped out of last weekend’s defeat to Brentford, having earlier scored his second goal in two matches.Cooper said: “It is not as bad as we feared, when anyone comes off with a muscle injury you fear the worst, especially with the timing of the season and how little time is left but scan results were fairly positive and we hope for him to return sooner or later.”"
    ]
}