{
    "articleURL": "/tvshowbiz/article-12060601/EastEnders-Coronation-special-Sonia-finally-discovers-Reiss-HUGE-secret.html",
    "content": [
        "EastEnders aired its Coronation special on Monday night and there was the usual drama plaguing the Square amid the festivities. ",
        "The latest instalment saw the residents of Walford will gather together to celebrate the crowning of King Charles III, just like those around the UK did over the weekend. But the episode ended with a bang as Sonia Fowler (Natalie Cassidy) discovered her boyfriend Reiss Colwell's (Jonny Freeman) huge secret he has been hiding. Viewers were aware before Sonia that Reiss is married, although few details about the situation have been revealed. It's Sonia birthday on the day and Reiss pulled out all the stops when it came to treats however he ended up arriving late to the celebrations. ",
        "As Rocky Cotton (Brian Conley) contemplated telling Sonia about a mysterious phone call he overheard him taking, Reiss turned up, just in time for the coronation performance.However, when Rocky later demanded the truth from Reiss, Sonia walked in and overheard everything, demanding that Reiss get out of her life.   Reiss stammered as he tried to explain what had happened. He said: 'I am married her name is Debbie. She is a very special women'.Natalie then chucked him out of the house as she called him a 'two-faced liar' as the rest of the residents of the Square watched on in shock in the middle of their street party.  Reiss arrived in Walford ahead of Dot Branning's funeral last year as her great-nephew.",
        "He and Sonia quickly struck up a bond at Dot's wake as they play their trumpet and trombone together.Sonia was then seen taking Reiss upstairs before Dotty Cotton (Milly Zero) revealed trumpeter Sonia and Reiss had slept together.",
        "However, things quickly took a turn for the worst when Reiss ghosted Sonia for a month.He eventually answered her calls and met up with Sonia to help her with her inheritance tax issues, enabling her to find a loophole in the law that meant she could keep her home without losing any money.Reiss then told Sonia he had not been in contact as he hadn't had many girlfriends and he didn't want to mess anything up between the pair.They later celebrated Sonia keeping her house by playing the trumpet and trombone together once again before enjoying a glass of champagne which led to a kiss. Elsewhere in the special coronation episode as day dawns, Alfie Moon and Linda Carter (Shane Richie and Kellie Bright) prepared the Queen Vic for a coronation party, as the rest of the community excitedly got ready for a day of celebrations.Throughout the episode, Walford residents were treated to a performance from Kim Fox (Tameka Empson) and Felix Baker (Matthew Morrison) as Dusty Springfield.However, Kim was left distressed when she fails to spot Denzel Danes (Jaden Ladega) in the crowd, and with her stress levels already high ended up freaking out.",
        "Elsewhere, with Lola Pearce (Danielle Harold) having been given only a few months to live, Honey and Billy Micthell (Emma Barton and Perry Fenwick) were determined to create some special memories for her, but their attempts left them frazzled.In other scenes, Karen Taylor (Lorraine Stanley) was horrified to learn that Keanu (Danny Walters) was engaged to Sharon Watts (Letitia Dean).Though the party at the Vic is in full swing, Keanu was hesitant about celebrating there, for fear of infuriating Nish Panesar (Navin Chowdhry), following Keanu and Ravi Gulati's (Aaron Thiara) showdown the previous week.Desperate for ir to be over and eager to save her son, Karen turned to Suki Panesar (Balvinder Sopal) and begged her to get Nish to drop his vendetta.EastEnders airs on BBC1 at 7.30pm.  "
    ]
}