{
    "articleURL": "/tvshowbiz/article-12040185/Britney-Spears-posts-picture-ample-cleavage-black-lace-bra-pens-bizarre-caption.html",
    "content": [
        "Britney Spears shared a close-up of her ample cleavage on Tuesday when she wore nothing but a black lace bra and penned a bizarre caption.",
        "The 41-year-old pop star – who recently mused about 'balance and boundaries' – treated her 41.9 million Instagram followers to the strange post, in which she seemingly made a play on words between 'chest' and 'chess.'Pouring out of her lingerie, Britney paired her busty snap with a random black-and-white photograph by Gerhard Hund that showed a group of men studying a chess board.Beginning her caption with a question, Spears wrote: 'If I clapped my t**s could I make one POP like a balloon on Thursday ??? TICK TOCK TICK TOCK !!! 'I salute all b**ches today NOT with my middle finger… just my chest y’all !!!! How do you spell chest … is it chess or chest ???'",
        "The Toxic hitmaker's comments section remains turned off so fans couldn't express their opinions, but Britney certainly concerned her massive fanbase earlier this month when she danced in tiny snakeskin bikini bottoms.Wearing a vibrant yellow top and black leather boots, Spears stared down the camera as she squatted, mimed a heart with her hands, and swirled to Sauce by Naïka.She ended the video by slapping her behind and giving the camera the middle finger. Taking to Twitter one fan wrote: 'Okay, Britney Spears genuinely needs help,' while another added: 'I’m genuinely concerned about Britney Spears.'",
        "It all comes in the wake of Britney slamming rumors that her marriage to fitness guru-turned-actor Sam Asghari, 29, was on the rocks. The Gimme More songstress sparked rampant speculation that there might be trouble in paradise when she was seen without her sparkler during a recent trip to Hawaii.But Britney quickly shot down the rumors in subsequent Instagram videos and soon began wearing her ring once again. A representative for Sam also denied the concerns, saying, 'Sam is not having marital issues. He simply took off his ring because he is filming a movie.'",
        "According to IMDb, the aspiring action star's latest project Grand Death Lotto is currently in production, but he was seen running errands without his ring in March.Spears again sparked concern in February when she uploading a bizarre clip to Instagram that showed her using an Australian accent to show off some dresses she had received.At one point in the video, the singer abruptly stopped dancing around her room to tell fans not to contact the police if she decides to delete her Instagram in the future. The post came shortly after Britney fired back at claims that loved ones had staged a failed intervention over fears she 'might die' amid her alleged mental health struggles. "
    ]
}