{
    "articleURL": "/wires/ap/article-12038777/No-charges-ex-officer-hit-Tyre-Nichols-stun-gun.html",
    "content": [
        "MEMPHIS, Tenn.. (AP) - A former Memphis police officer who hit Tyre Nichols with a stun gun during a traffic stop that preceded Nichols´ brutal beating by other officers won't be charged criminally, a prosecutor said Tuesday.",
        "Nichols' slaying was one in a string of violent encounters between police and Black people that have spurred protests and renewed debate about police brutality.Five officers were charged with second-degree murder in Nichols' death and his family has sued the officers and the city of Memphis.Shelby County District Attorney Steve Mulroy said his office did a thorough investigation of Preston Hemphill´s role in the arrest, reviewing hours of body camera footage and interviewing witnesses multiple times.\"By no means do we endorse the conduct of Officer Hemphill at that first traffic stop ... but we do not believe that criminal charges are appropriate,\" Mulroy said.Attorneys for Nichols´ family said in a statement that they are supportive of the decision not to pursue charges because of Hemphill´s cooperation. Mulroy said Hemphill has cooperated fully with the investigation into Nichols´ death.",
        "Hemphill was fired Feb. 3 after an internal Memphis Police Department investigation showed he violated multiple department policies for his role in the Jan. 7 arrest of Nichols, who died in a hospital three days later. Five other officers have pleaded not guilty to criminal charges in Nichols´ death.The officers who have been fired and charged are Black, as was Nichols. Hemphill is white.Nichols was beaten after police stopped him for what they said was a traffic violation and he fled the stop. Video released after pressure from Nichols´ family shows officers holding him down and repeatedly punching, kicking and striking him with a baton as he screamed for his mother.",
        "Hemphill was not present for the initial traffic stop nor when other officers forcibly removed Nichols, 29, from his vehicle and put him on the ground, Mulroy said.\"He had to make his decisions based on what he knew, or what he thought was happening, and following the lead and in support of the other officers,\" Mulroy said. \"He acted on limited information in a matter of seconds at the direction and in support of the other officers. He did not pursue Mr. Nichols, was not present at the second incident where the actual beating took place that led to Mr. Nichols death.\"Hemphill´s body camera showed that from the very beginning of the traffic stop he and two other officers approached Nichols with force that was disproportionate for the alleged offense of reckless driving, according to a statement from the disciplinary hearing that took place before he was fired.Along with breaking rules regarding the use of a stun gun, Hemphill was also fired for violations of personal conduct and truthfulness, police have said.Hemphill´s Lawyer, Lee Gerald, said the decision \"did not come as a surprise.\"\"As we all know, Mr. Hemphill was not present at the second scene,\" Gerald said. \"However, as we prepared a defense our investigation brought to light evidence showing that Officer Hemphill´s actions did not violate Tennessee or federal law.\""
    ]
}