{
    "articleURL": "/wires/reuters/article-12056643/Yellen-warns-against-debt-ceiling-talks-gun-head-American-people.html",
    "content": [
        "By Tyler Clifford and John Kruzel",
        "WASHINGTON, May 7 (Reuters) - U.S. Treasury Secretary Janet Yellen on Sunday issued a stark warning that a failure by Congress to act on the debt ceiling could trigger a \"constitutional crisis\" that also would call into question the federal government's creditworthiness.Yellen sounded the alarm over possible financial market consequences if the debt ceiling is not raised by early June, when she has said the federal government could run short of cash to pay its bills.The negotiations on the issue should not take place \"with a gun to the head of the American people\", Yellen told the ABC program \"This Week.\"Biden has asked Congress to raise the debt ceiling with no conditions. The Republican-led House of Representatives last month passed a bill that would raise the government's $31.4 trillion debt ceiling, but the measure included sweeping spending cuts over the next decade that Biden and his fellow Democrats oppose.Biden is preparing to meet on Tuesday at the White House with Republican House Speaker Kevin McCarthy, Republican Senate Minority Leader Mitch McConnell and top congressional Democrats to discuss the issue.\"It's Congress's job to do this. If they fail to do it, we will have an economic and financial catastrophe that will be of our own making,\" Yellen said.",
        "\"And we should not get to the point where we need to consider whether the president can go on issuing debt. This would be a constitutional crisis,\" Yellen added, alluding the delineation of powers of the executive and legislature under the U.S. Constitution.Biden has steadfastly said he will not negotiate over the debt ceiling increase, but would discuss budget cuts after a new limit is passed. Congress has often paired debt-ceiling increases with other budget and spending measures.Washington regularly sets a limit on federal borrowing. Currently, the ceiling is equal to roughly 120% of the country's annual economic output. The debt reached that ceiling in January and the Treasury Department has kept obligations just within the limit, but by July or August, Washington could have to stop borrowing altogether.Under that scenario, shockwaves could ripple through global financial markets as investors question the value of U.S. bonds, which are seen as among the safest investments and serve as building blocks for the world's financial system.The House-passed bill would pare spending to 2022 levels and then cap growth at 1% a year, repeal some tax incentives for renewable energy and stiffen work requirements for some anti-poverty programs.Democratic Senate Majority Leader Chuck Schumer last week began to clear the way for a vote for a bill that would suspend the government's debt limit for two years without conditions. But Republicans in the Senate and House have said that they would not vote for such a measure.",
        "A group of 43 Senate Republicans on Saturday said they oppose voting on a bill that only raises the U.S. debt ceiling without tackling other priorities, showing they could block such a plan by Democrats.Legislation would require 60 votes to proceed in the 100-seat Senate. With only a 51-49 Democratic majority in the Senate, Schumer would need the support of at least nine Republicans to clear a 60-vote threshold to advance such legislation.Top House Democrat Hakeem Jeffries, speaking on the NBC program \"Meet the Press,\" said Biden has made clear there could be a conversation with lawmakers on spending, investments and revenues but that the responsible course of action would be to raise the debt ceiling.\"We have to make sure that America pays its bills to avoid a dangerous default on our debt in a manner that will blow up the United States economy,\" Jeffries said.Deputy Treasury Secretary Wally Adeyemo also underscored the perils in a potential default.\"Default is catastrophic for the United States,\" Adeyemo told MSNBC's \"The Sunday Show.\" \"If we were to default on our debt, it would have a terrible impact on interest rates.\"(Reporting by John Kruzel; Writing by Humeyra Pamuk; Editing by Will Dunham and Mary Milliken)"
    ]
}