{
    "articleURL": "/news/article-12045589/Judge-tosses-Donald-Trumps-lawsuit-against-New-York-Times.html",
    "content": [
        "Former president, who is facing several legal battles, filed $100m lawsuit in 2021Trump accused New York Times reporters of an 'insidious plot' to obtain taxesStories relied on information from niece Mary - who he made claims against tooA judge has tossed Donald Trump's lawsuit against the New York Times after he claimed its reporters were part of an 'insidious plot' with his niece to obtain his tax records.",
        "The New York judge also ruled that the former president must pay any legal expenses and attorney fees that the Times and its reporters have incurred during the $100million lawsuit which began in 2021. Trump, who is facing mounting legal troubles, alleged that the New York Times persuaded his niece Mary Trump 'to smuggle the records out of her attorney's office'.The stories which relied on Ms Trump providing information about the former president went on to win a Pulitzer Prize in 2018. Trump has also made claims against his niece which are yet to be ruled on.The Daily Beast reports that Trump's claims 'fail as a matter of constitutional law', according to New York Supreme Court Justice Robert R. Reed's ruling. He deemed the Times' newsgathering as being at 'the very core of protected First Amendment activity.'",
        "Charlie Stadtlander, a spokesperson for the Times, said the newspaper was 'pleased with the judge's decision'.He added: 'It is an important precedent reaffirming that the press is protected when it engages in routine newsgathering to obtain information of vital importance to the public.' ",
        "Trump also sued news outlet CNN last year for $475million in a defamation trial, but this too was dismissed - as were his attempts to sue the New York Times and Washington Post over opinion columns linking him to Russian interference during his 2016 presidential bid. ",
        "The latest ruling comes as the former president was pictured venturing onto his Trump Turnberry golf course in Scotland yesterday - before rubbing shoulders with old friend Nigel Farage for a second one-on-one interview with the former UKIP leader.During the interview with the now-GB News presenter, Trump blasted Meghan Markle over her treatment of the Queen, raging that she was 'very disrespectful' to Her Majesty. He also said he was 'surprised' Prince Harry was invited to his father's Coronation this weekend. But while Trump continues to be in the limelight - which continues as he leaves Scotland to visit another of his golf resorts in Doonbeg, Ireland - his lawyers are battling to save his reputation back at home. Trump has been indicted by a Manhattan district court for his alleged role in the payment of 'hush money' to porn star Stormy Daniels during the 2016 presidential election, as well as accusations of election interference and illegal retention of classified White House documents.Meanwhile, he is also in the middle of an ongoing New York City rape case, which on Monday saw Judge Lewis Kaplan throw out a request from Trump's lawyer to declare a mistrial based on 'unfair and prejudicial rulings'.",
        "The case has been brought by E. Jean Carroll who says Trump assaulted her between 1995 and 1996 in upmarket New York department store Bergdorf Goodman.",
        "Carroll sued Trump for battery and defamation last November over the alleged rape and his Tweets afterwards calling her a liar.Other women have also come forward as part of the case to make allegations against the former president.Trump's attorney confirmed yesterday that he will not be attending his rape trial in New York and instead a video deposition will be shown. Yesterday, Trump expressed confidence in his position in the trial, telling reporters 'I hear we're doing very well'. Trump's arrival in Scotland this week as seen the country's politicians urge new First Minister Humza Yousaf to look again at seeking a so-called 'McMafia' order to probe how Trump was able to buy the resorts in Aberdeenshire and Ayrshire.",
        "Trump's company purchased Turnberry in Ayrshire in 2014 from a Dubai-based company for an undisclosed fee. Despite still being in the development phase, he purchased the Menie, Aberdeenshire resort back in 2006.The Scottish government previously decided not to pursue an Unexplained Wealth Order in relation to the purchase of the two resorts in 2021."
    ]
}