{
    "articleURL": "/tvshowbiz/article-12047619/Myleene-Klass-told-change-start-career-ethnic.html",
    "content": [
        "Myleene Klass has revealed she was told to change her name at the start of her career because it was too 'ethnic'.",
        "The presenter, 45, who found fame with Hear'Say in 2000 on ITV's Popstars talent show, said she was advised to use her middle name 'Angela', but she refused.Myleene, who's mum is Filipino and Dad is Chinese, recalled the experience as she opened up about the fat-shaming she endured, and the time Sir Elton John, 76, sent apology flowers to the now-defunct pop group after claiming they were the 'ugliest band in pop'.Speaking on I'm A Celebrity South Africa, she said: 'I was asked to change my name. I was told people wouldn't be able to pronounce it because it was quite an ethnic name.'You'd be cancelled if you said something like that now. I was told to use my middle name. My middle name is Angela.' ",
        "She said she and fellow bandmates Kym Marsh, Suzanne Shaw, Danny Foster and Noel Sullivan were judged on their looks and seen as 'visual commodities' over talented singers.The musician, who plays the violin and piano, said: 'We weren't even thinking by the end of it as singers or performers we were just thinking of commodities, visual commodities.'I wasn't Helena Christensen - I'd gone in as Myleene Klass.' She continued: 'I had managers coming up, other band managers going \"you're the fattest band in pop\"... rather than the fact we had talent.",
        "'I could play any piano sonata, read any music, play most of the instruments you'd put in front of me [but] it came back down to that simple fact of \"fattest band in pop\".'We even got sent flowers from Elton John who said we were the ugliest band in pop. He sent sorry flowers to us at which point I was like \"you're a god to me... oh\". It was a different time in history.' Myleene went on she say she first experienced fat-shaming when she was cast in the West End production of Miss Saigon and told to lose weight in front of 24 male cast members.'I wasn't pulled aside and I just stood there and it swallowed me up,' she said.The Smooth Radio presenter was a surprise late arrival to I'm A Celebrity, entering the South African camp with Andy Whyment and Georgia Toffolo.",
        "Speaking about her famous white bikini from the 2006 series, which she won, she said: 'I find it hilarious the photos of me are out there forever. It was so innocent back then.'But after doing the programme I saw the photo and I was like \"my goodness, it does look glamorous\", but it certainly didn't feel like it - far from it!'.",
        "Back in February Myleene took to her Instagram with an emotional post as she paid tribute to her mixed raced heritage. The TV star shared a slew of throwback snaps and detailed the racism she had suffered growing up.Myleene was inspired to share her thoughts following Everything Everywhere All At Once and it's Asian cast triumphing at the SAG Awards in Los Angeles.She revealed that 'exceptional' actor Jonathan - who is white - was ‘Asianed up’ for the show with a black wig and 'obligatory ‘slit eyed’ - while producers declared Myleene herself didn't look 'Asian enough' to be cast. "
    ]
}