{
    "articleURL": "/tvshowbiz/article-12052805/Judi-Dench-invited-King-Charles-Coronation-host-stars.html",
    "content": [
        "Dame Judi Dench has been invited to King Charles' Coronation at Westminster Abbey along with a whole host of stars.",
        "The actress, 88, is on the guest list for the Coronation of King Charles III on May 6, the Daily Mail's Richard Eden has disclosed.Dame Judi won an Oscar for her performance as Queen Elizabeth I in Shakespeare In Love and last year condemned The Crown for its 'unjust' depictions of the Royal Family.As former spy chief 'M' in the James Bond films, perhaps Dame Judi can help Special Branch keep an eye on another national treasure due to be at Westminster Abbey - Rowan Atkinson.The Mr Bean star, 68, once sabotaged a coronation, snatching the crown in spoof spy film Johnny English.",
        "Absolutely Fabulous star and OBE Dame Joanna Lumley, 76, has also received her invitation as a guest of Charles and Camilla. David and Victoria Beckham - the former of whom met the late Queen on multiple occasions - are also rumoured to be on the list, but have yet to be confirmed.One of the biggest stars at the coronation will be US singer Katy Perry, who will be performing for the King and his dignitaries.  And the 38-year-old's husband and Pirates Of The Caribbean star Orland Bloom, 46, and their two-year-old daughter Daisy will be there to cheer her on. It comes after Katy was appointed ambassador of The British Asian Trust, a charity founded by Charles, in 2020. ",
        "Perry, who will be staying at Windsor Castle, told Extra's Melvin Robert: 'I'm an ambassador to one of his foundations for the British Asian Trust, which primarily focuses on ending child trafficking, which is a huge issue of our time that people don't talk enough about, and it just aligned with all my values… He asked me to sing and it all aligned.' Judi's invitation to the Coronation comes after she accused Netflix hit The Crown of being 'cruelly unjust' to the Royal Family.In a letter to The Times newspaper in October, she called on Netflix to display a disclaimer at the start of each episode to say it is 'fictionalised drama'.She said it would also show respect for the bereavement suffered by the Royal Family and the nation, she said.",
        "Dame Judi, who was made a Companion of Honour in 2005 and is pictured, right, as Queen Victoria in the film Victoria and Abdul, said she was stung by reports that the latest series would include scenes of Prince Charles lobbying to force his mother's abdication.She fears it will give an 'inaccurate and hurtful account of history'.She wrote: 'The closer the drama comes to our present times, the more freely it seems willing to blur the lines between historical accuracy and crude sensationalism.'",
        "Fans are awaiting the release of The Crown's final series later this year, with the show already courting controversy as it plans to depict the tragic death of Princess Diana. "
    ]
}