{
    "articleURL": "/wires/reuters/article-12052333/CANADA-FX-DEBT-Jobs-data-helps-lift-CAD-biggest-gain-four-months.html",
    "content": [
        "Canadian dollar strengthens 1.2% against the greenback",
        "Touches its strongest since April 18 at 1.3372Canada adds 41,400 jobs in AprilCanadian bond yields rise across flatter curve(Adds details on activity; updates prices)By Fergal SmithTORONTO, May 5 (Reuters) - The Canadian dollar strengthened to a two-week high against its U.S. counterpart on Friday, as investors dialed back bets for interest rate cuts by the Bank of Canada in the coming months following stronger-than-expected domestic jobs data.The loonie was trading 1.2% higher at 1.3372 to the greenback, or 74.78 U.S. cents, its biggest gain since Jan. 4 and its strongest level since April 18. For the week, it was up 1.3%.The Canadian economy gained 41,400 jobs in April, exceeding expectations for an increase of 20,000, while the jobless rate stayed near a record low.\"Another blockbuster Canadian jobs number,\" said Karl Schamotta, chief market strategist at Corpay.\"It smashed expectations and pointed to resilience in the underlying economy, and will almost certainly narrow interest rate differentials against the U.S. on the front of the curve by lowering the likelihood of rate cuts by the Bank of Canada and pushing those into 2024 at the earliest.\"Money markets are still expecting an interest rate cut by the BoC this year, but chances of a cut as soon as October fell to about 30% from 70% before the data.",
        "On Thursday, BoC Governor Tiff Macklem said that the bank is ready to tighten further if Canadian inflation gets stuck significantly above target. The bank's benchmark rate has been on hold at a 15-year high of 4.50% since January.U.S. job growth also beat expectations in April. Canada sends about 75% of its exports to the United States, including oil.The price of oil settled 4.1% higher at $71.34 a barrel, clawing back some recent declines.Canadian government bond yields were higher across a flatter curve. The 2-year rose 16.1 basis points to 3.728%, while the 10-year was up 12.3 basis points at 2.923%. (Reporting by Fergal Smith; editing by Jonathan Oatis and Sandra Maler)"
    ]
}