{
    "articleURL": "/news/article-12046109/Father-52-parked-Range-Rover-outside-school-gates-convicted-assault-shoving-mother.html",
    "content": [
        "Lee Rowe, 52, from Poole, attacked mum who wouldn't get out his wayHe had 'selfish' habit of parking 'flash' Range Rover outside infant school gatesAn 'arrogant' father who flew off the handle and attacked a mother for refusing to move out of his way in a row over parking at the school gates has been convicted of assault.",
        "Lee Rowe, 52, annoyed other parents with his 'selfish' habit of parking his 'flash' Range Rover outside the front gates of his child's infant school.On the morning of May 20, 2021, Rowe, from Poole in Dorset, pulled up to find mother Sarah Collins standing in the way, so he beeped his horn at her.But Mrs Collins was aware of Rowe's history of 'inconsiderate parking' and refused to move for him.A court heard she shook her head and mouthed the word 'No' at him.",
        "Businessman Rowe pulled up next to her, angrily got out and used two hands to shove her out of the way in front of other parents.Mrs Collins was 'very shocked' by the altercation at 9am. She was taken into the head teacher's office and the police were called.She described having an ache in her arm from where she was shoved and complained of Rowe's history of inconsiderate parking near the school.Mrs Collins, who is in her 40s, said: 'I had walked to the infant school for drop-off.'There were lots of parents there dropping children off just before the start of the day. I was looking back up towards the school, my back was to the road.'When I heard a horn beeping I turned around and saw Mr Rowe gesturing at me with two hands to move. I shook my head and turned back to look at the school.",
        "'I was very shocked when he moved the car further forwards and the next thing I knew the man got out of the car and shoved me out of the way.'Once he drove off other parents came to see if I was OK, and one of them took me to the head teacher's office to call the police.'I had observed Mr Rowe's driving before this incident and I had thought that he didn't think of others when parking just outside the school.'Diane Worboys, a teaching assistant at the school, witnessed the incident. She described Rowe as 'visibly angry'.She said: 'I turned around when I heard a car horn beeping. I saw a man get out of the car and aggressively shove the woman on the pavement.'He looked angry, my first concern was to get the rest of the children inside the school.'",
        "Charles Nightingale, prosecuting, said: 'Witnesses say that he used two hands to push her out of the way. This crosses the threshold of using unlawful force.'In his own words he arrogantly decided he had to park in that particular space outside the school gates. He could have parked somewhere else and avoided all of this.'Rowe, from Poole, denied assault, but admitted he had 'arrogantly' parked in his usual space on the street, but said did not touch Mrs Collins.",
        "He said: 'I never laid a hand on that woman, I've never laid a hand on any woman.'For the last two years I wished I parked somewhere differently. I guess it was arrogant that I decided I would park there even though she was close to the pavement.'James Moor, defending, put it to Mrs Collins that his client never pushed her.He said: 'He beeped you to ask you to move and you refused. You shook your head and mouthed \"No\".'You didn't move off the edge of the pavement because you wanted to have a confrontation with Mr Rowe about the manner of his driving.'You thought he was arrogant and you were fired up.'You were trying to teach him a lesson for parking inconsiderately and driving a flash car weren't you?'Mrs Collins denied this.",
        "Mr Nightingale said the incident was witnessed by two parents and Mrs Worboys. He said it was unlikely that the four witnesses would have come together to 'fabricate' a story.He said: 'There is a stark difference between the defendant's version of events and the witnesses'.'Presiding magistrate Leonard Vickery found Rowe guilty of assault following a trial at Poole Magistrates' Court.He said: 'We have considered all of the evidence and all of the witnesses we have heard agreed that the defendant did push Mrs Collins.",
        "'It was reckless of her to continue to stand on the edge of the pavement when asked to move.'We do not think that Mr Rowe ever meant to cause harm, but by his own admission he thinks he might have inadvertently pushed her.'We therefore find Mr Rowe guilty of assault.'Rowe was sentenced to an 18-month conditional discharge and was ordered to pay £200 court costs and a £22 victim surcharge."
    ]
}