{
    "articleURL": "/wires/reuters/article-12045101/Aljamain-Sterling-looks-defend-bantamweight-title-UFC-288.html",
    "content": [
        "A highly anticipated clash between the current bantamweight champion and the returning former titleholder headlines Saturday night's UFC 288 in Newark, N.J.",
        "Aljamain Sterling of Long Island, N.Y., will be the home team of sorts when he defends his title in the at the Prudential Center. There he will meet Henry Cejudo (16-2) of Phoenix in the evening's main event.Cejudo is one of the most accomplished combat-sports competitors of his generation. He won an Olympic gold medal in freestyle wrestling at age 21 in 2008. He proved a fast study in MMA, where he became nearly as adept at striking as he is wrestling. He won both the bantamweight and flyweight titles, becoming one of just four UFC fighters to simultaneously hold belts in two divisions. But he abruptly retired at his peak in 2020, vacating both crowns.Sterling (22-3), meanwhile, won the 135-pound title via disqualification due to an illegal strike in a bout he was handily losing to Petr Yan in 2021. He solidified his claim to the crown by winning a rematch via split decision a year later.The obvious big question heading into this one is whether Cejudo, at 36, can come out of retirement and immediately return to world-class form. It won't come easy against Sterling, who enters the match on an eight-fight winning streak.For his part, Sterling, who can further cement his place by defeating the guy who never lost the title in the Octagon, doesn't seem to be sweating the magnitude of the bout too much.",
        "\"At the end of day, it's another moment in time,\" Sterling told ESPN. \"And I just want to make sure I seize the opportunity and enjoy it as much as I can.\"The evening's semifinal bout is an intriguing matchup of highly touted welterweight contenders. Chicago's Belal Muhammad (22-3), winner of eight straight fights, takes on Brazilian veteran Gilbert Burns (22-5), a former title challenger who has won three of his past four.--Field Level Media"
    ]
}