{
    "articleURL": "/wires/reuters/article-12055435/IAEA-head-warns-dangers-Zaporizhzhia-nuclear-plant.html",
    "content": [
        "May 6 (Reuters) - The head of the U.N.'s nuclear power watchdog warned on Saturday that the situation around the Russian-held Zaporizhzhia nuclear station had become \"increasingly unpredictable and potentially dangerous\" and called for measures to ensure its safe operation.",
        "Rafael Grossi, director general of the International Atomic Energy Agency, issued the warning in view of what he said were evacuations under way in the nearby town of Enerhodar, ordered by the local Russian-installed governor.\"The general situation in the area near the Zaporizhzhia nuclear power plant is becoming increasingly unpredictable and potentially dangerous,\" Grossi said on the agency's website.\"I'm extremely concerned about the very real nuclear safety and security risks facing the plant. We must act now to prevent the threat of a severe nuclear accident and its associated consequences for the population and the environment.\"Russian forces seized the Zaporizhzhia plant days after President Vladimir Putin ordered the invasion of his neighbour in February 2022. Exchanges of fire have frequently occurred near the facility, with each side blaming the other.Grossi last visited the Zaporizhzhia station, Europe's largest nuclear power installation, in March, as part of efforts to speak to both sides to secure an agreement on safeguards to ensure the plant's safe operation.He has repeatedly warned of the dangers of military operations around the plant.Russia last September proclaimed the annexation of four Ukrainian regions, including Zaporizhzhia region.The plant is located in the part of that region under Russian control, with many of the staff operating it living in Enerhodar on the south bank of the Dnipro River.",
        "Yevgeny Balitsky, Russian-installed governor of the Russia-controlled part of Zaporizhzhia region, said on Friday he had ordered the evacuation of villages close to the front line with Ukrainian forces there. He said Ukrainian shelling had intensified in the area in recent days.A widely expected Ukrainian spring counter-offensive against Russian forces viewed as likely to take in the Zaporizhzhia region, around 80% of which is held by Moscow. (Reporting by Ron Popeski)"
    ]
}