{
    "articleURL": "/travel/escape/article-12038159/Delicious-wines-festivals-stunning-beaches-corner-Croatia.html",
    "content": [
        "In central Dalmatia, verdant hills and rugged mountains flow down to crystalline bays and terracotta-roofed fishing villages.",
        "This is the very heart of the Adriatic, where Croatia’s second city of Split - with its charming lanes and Roman palace - anchors together picture-perfect towns, ancient olive groves and shimmering island havens.And it’s so easy to explore. You can effortlessly weave together its verdant hinterland, vibrant Split and off-shore islands enriched with local culture and tradition.",
        "Whether exploring the 4th-century Diocletian’s Palace, a gleaming Roman ruin built with the lustrous white stone from nearby Brac Island, or strolling along the palm tree-studded waterfront in search of the perfect sun-kissed terrace, Split offers adventure to all.Split spectacular Sunbathing on sparkling beaches, admiring tangerine sunsets from the peak of Marjan Hill, or snorkelling through the crystalline waters, Split combines vibrant city living with the laid-back vibes of beachfront escapes.The Split Summer Festival lends magic to the air throughout July and August, with open-air jazz concerts, street theatre and opera evenings offering the perfect entertainment for any crowd. From ballet to film festivals, this festival has brought life to the sultry streets since 1954.",
        "Every July since 1960, the Split Festival has been attracting an energetic crowd to enjoy the latest pop sounds in the coastal city, while the Split Park Festival, a street food delight held everything July and August under Marjan Hill, invites you to discover Dalmatia’s rich gourmet scene.",
        "Down the coast in pirate-stronghold Omis, a cappella comes to the streets with the Festival of Klapas every June and July, a celebration of local singing recognised by UNESCO as an Intangible Cultural Heritage.Set on the Cetina River in the emerald hinterland, Trilj becomes a Blues centre from July 1 to 3 with the Thrill Blues Festival. Surrounded by hiking routes, river rafting and Roman camps, it’s the perfect weekend getaway.Island delightsNothing beats darting from shore to glistening shore on an island-hopping expedition, and these turquoise waters offer an exciting opportunity with a sprinkling of island gems waiting to be explored.",
        "Hosting shallow waters and sweeping, vineyards, orange trees and rustic homesteads, the island of Brac is a picture-perfect Mediterranean escape.Flanked by the rugged Vidova Gora mountain, pretty Bol looks out over an attractive harbour where colourful boats bob on the gentle waves. It’s best known for Golden Horn Beach, a mesmerising spit of land jutting out into the dazzling waters.The island of olives and wine, a trip to Brac isn’t complete without indulging in the local cuisine, perhaps after a hike up Vidova Gora to see the quarry which provided the stone for the White House and Diocletian’s Palace.Less than an hour away by ferry, the charming island of Hvar combines sheltered coves with quaint stone villages, sweeping lavender fields and captivating cuisine.",
        "Don’t miss the Old Town of Stari Grad, a Greek colony dating back to 385 BC and home to a picturesque harbour, prehistoric hill forts, and the beautiful Petar Hektorovic Fortress, designed by a 15th-century poet of the same name.Verdant VisAn hour away by the local ferry, Vis remains one of the best-kept secrets of the Adriatic. A former military base, in use up until 1989, its tourism industry has only flourished in recent years and fishing and winemaking remain the predominant industries on this green isle.Whether sipping on a cool glass of white vugava wine, a variety cultivated here since ancient times, or sunbathing in the near-closed-off cove of Stiniva, only accessible on foot, the idyllic island allows you to explore the best of the Mediterranean in peace.",
        "Composed partly of volcanic rocks, Vis is part of the Global UNESCO Geoparks Network, lending it the attention of geologists worldwide, along with visitors looking for a slice of authentic Croatia.The most prestigious sailing event in the country, the Vis Regatta, is held every October, bringing thousands of yachters and an activity-packed line-up to the tiny island.Pebbles, sand, or craggy inlets, Vis hosts some of the most breathtaking beaches in the world, from the secluded swimming spots of Kamenica to the quiet pebble beach Jurkovica.",
        "One unmissable spot is Stiniva, an almost-circular cove often rated as Europe’s best beach, with just a tiny sea entrance connecting it to the Adriatic.Stiniva was formed when an ice-age-era cave collapsed under rising water levels, but many subterranean gems are still waiting to be explored.",
        "Just off Vis, on the beautiful island of Ravnik, the serene Green Cave is illuminated with an emerald aura every day. Another fabulous phenomena, the sun’s rays enter the Blue Cave on the nearby island of Bisevo just before noon every day, creating an ethereal blue light.While visiting this island haven, try the sweet Prosek wine, matured by being buried in the sands, and the healthy risottos found in traditional tavernas all over the island. Cheese and seafood are served by the boatload, with the dragon-headed red fish racasse, a firm local favourite.Adriatic adventureThreading together secret coves with ancient recipes, vineyards with fragrant lavender fields, Dalmatia’s islands and shimmering coast offer the ultimate Mediterranean lifestyle in the heart of the Adriatic. Combine cosmopolitan city escapes and lush island sanctuaries with gourmet cuisine with aquatic adventure in this charming part of the world.And with local commuter ferries and car rentals easily accessible, it’s easy to let loose and enjoy the good things in life when you choose Split as your vibrant gateway to Croatia.",
        "Find out more and start planning your holiday at dalmatia.hr"
    ]
}