{
    "articleURL": "/wires/ap/article-12048103/Pro-Bowl-tackle-Taylor-Lewan-sues-doctor-ACL-repair.html",
    "content": [
        "NASHVILLE, Tenn. (AP) - A three-time Pro Bowl left tackle released by the Tennessee Titans in February over a failed physical issue is suing renowned orthopedist Dr. James Andrews for medical malpractice for the October 2020 surgery repairing his torn right ACL leaving him with \"severe and permanent\" damage.",
        "Attorneys for Taylor Lewan filed the lawsuit Tuesday night in circuit court in Escambia County, Florida.Others named as defendants are Benjamin Sherman, Baptist Health Care, Baptist Medical Group along with the Andrews Institute.The lawsuit accuses the defendants of an improper repair that caused \"permanent injury to his right knee, and surrounding structures, tendons, cartilage, and ligaments\" and cutting Lewan's NFL career short as a result of \"negligent acts and omissions.\"\"We cannot comment on patients or pending litigation,\" said Christian Garman of the Andrews Institute for Orthopaedics &amp; Sports Medicine.Andrews has long been among the top sports orthopedists in the world. He also maintains a medical center in Birmingham, Alabama.",
        "Lewan, a 6-foot-7, 309-pound tackle, was the 11th pick overall out of Michigan in 2014 by Tennessee. He went to three straight Pro Bowls between 2016 and 2018 and started 100 of 105 games played for the Titans.Now 31, Lewan originally i njured his right ACL on Oct. 18, 2020, in a win over Houston and was placed on injured reserve. He had surgery to repair his knee Oct. 27, returned in 2021 and started 13 games. In June 2022, Lewan described playing that season as a mental and physical grind.Lewan then tore the same ACL in the second game of the 2022 season. The Titans released him Feb. 22 with the nine-year veteran due $14.8 million in the final year of his contract after the knee injuries limited him to 25 of 50 regular-season games over the past three seasons.",
        "The lawsuit accuses Andrews of negligence for not using a specific graft, injuring surrounding knee cartilage, not repairing the medial meniscus, failing to supervise residents and fellows and failing to provide proper care after surgery.Lewan is dealing with \"severe pain and disability, suffering, disfigurement, loss of ability to enjoy life, past and future medical expenses, past and future loss of earnings, past and future loss of career earnings, past and future loss of career opportunities, and mental distress,\" according to the lawsuit.The lawsuit asks for a jury trial and damages in excess of $50,000 plus costs, interest, and other relief decided by the court.___AP NFL coverage: https://apnews.com/hub/nfl and https://twitter.com/AP_NFL"
    ]
}