{
    "articleURL": "/wires/reuters/article-12059971/US-UAE-climate-friendly-farming-fund-grows-13-bln.html",
    "content": [
        "By Leah Douglas",
        "WASHINGTON, May 8 (Reuters) - Funding for a U.S. and United Arab Emirates-led initiative to make the world's farming more environmentally friendly and resilient to climate change has grown to more than $13 billion, a U.S. official said on Monday.The Agriculture Innovation Mission for Climate (AIM for Climate) was launched in 2021 and had achieved commitments of $8 billion last November.\"Climate change continues to impact longstanding agricultural practices in every country and a strong global commitment is necessary to face the challenges of climate change head-on,\" U.S. Agriculture Secretary Tom Vilsack said in a statement.He announced the latest funding figures alongside UAE Minister for Climate and the Environment Mariam Almheiri and former U.S. vice president Al Gore at the AIM for Climate summit in Washington, D.C. on MondayThe UAE will host the COP28 climate change conference in November and December this year.\"We will make sure that COP28 will be a game-changer for food systems,\" Almheiri told the Washington summit, which continues through Wednesday and brings together officials from Canada, the Netherlands and the United Kingdom as well as academics and company executives.Gore said it was important that funding for climate change innovation is disbursed equitably.\"Black farmers, indigenous farmers, low-income farmers, they need access to this innovation as well. We need to loop them into this,\" he said.",
        "About $10 billion of the $13 billion of investment in the agricultural fund is from governments. The rest is from non-government parties funding initiatives to support smallholder farmers, emerging technologies and methane reduction, a U.S. Department of Agriculture spokesperson said.The fund seeks to unite nations to cut agriculture emissions, which account for about 10% to 12% of greenhouse gas emissions. These emissions are from sources including livestock manure, machinery and fertilizer application, according to the Intergovernmental Panel on Climate Change. (Reporting by Leah Douglas; Editing by Josie Kao and Barbara Lewis)"
    ]
}