{
    "articleURL": "/wires/reuters/article-12046097/Water-fight-Farms-wildlife-risk-Spanish-wetland-shrinks.html",
    "content": [
        "By Elena Rodriguez and Guillermo Martinez",
        "EL ROCIO, Spain, May 4 (Reuters) - Spain's Donana wetland has been a rich farming area for decades and a wildlife haven for centuries, but climate change is drying it out and has set regional and national authorities on a collision course over how to safeguard its future.Scientists, meanwhile, say the water needs of the farmers who grow thousands of tonnes of red berries per year are making the problem worse.The Donana national park lies atop a 2,700-square km (1,040 square mile) underground water reserve, one of the largest of its kind in Europe and an area almost twice the size of London.Its beautiful lagoons are being depleted by a long drought and hotter weather, and they are surrounded by a sea of greenhouses and a complex system of pipes that takes water from in some cases illegally drilled wells.Andalusia's conservative regional government plans an amnesty that would legalise additional irrigation around Donana, prompting an outcry from environmentalists and - with regional and local elections due this month - a pledge from the Socialist-led national government to protect the park.The region, and more specifically the province of Huelva, where the park is located, produces 97% of Spain's red fruits and is the world's largest exporter of strawberries.",
        "FARMERS DIVIDEDFarmers are divided over the regional plan.One group in favour says it only want permission to irrigate with surface water, without jeopardising the underground reserves.\"There is enough surface water to irrigate all the hectares in the area, some of which are using ground water,\" their spokesman Julio Diaz told Reuters.But the central government says that's not true, and scientists say water extraction, both legal and illegal, is affecting the park's biodiversity.The reserve also boasts marshlands, scrub woodland and beaches and is home to deer, badgers and endangered species including the Spanish imperial eagle and the Iberian lynx.\"The lagoons directly depend on the aquifer. If the lagoons are disappearing, it is because the aquifer is diminishing,\" said Eloy Revilla, head of the Donana Biological Station, calling for policies to reduce dependence on water in these areas because they are not going to be sustainable.Last year, Europe experienced its hottest summer on record, compounded by several extreme events including intense heatwaves, drought conditions and extensive wildfires, according to the Copernicus Climate Change Service, and many scientists say droughts are becoming more frequent and water more scarce.As the prolonged drought has left the Guadalquivir river basin's reservoirs at a quarter of capacity, water management authorities last month reduced the amount of water available for legal irrigation.",
        "That forced those Donana farmers who use legally-extracted water to kill part of their crops to save the rest, and they are not too happy about the regional plan to amnesty hundreds of illegally-watered hectares. WWF ecologists estimate that 1,900 hectares of illegal crops in Donana could be legalised.\"Those who have been cultivating illegally for 15 years are going to be rewarded with surface water so they can irrigate on demand,\" said Manuel Delgado, spokesman for Puerta Donana farmers association, standing in one of the greenhouses that grows 50 tons of berries per hectare. (Additional reporting by Emma Pinedo, editing by Andrei Khalip and John Stonestreet)"
    ]
}