{
    "articleURL": "/news/article-12041743/Brit-soldier-slapped-female-colleagues-bottom-said-dont-act-like-werent-asking-it.html",
    "content": [
        "Private Jonathan Rowell hit the woman so hard she was left 'stumbling forward' The soldier denies a single charge of sexual assault and the trial continuesA British Army soldier slapped a female colleague's bottom as she bent over and told her 'don't act like you weren't asking for it' when she protested, a court martial heard today.",
        "Private Jonathan Rowell allegedly left the soldier 'shocked' and 'uncomfortable' by smacking her as she readjusted her 'twisties', an elastic twist which keeps the cuffs of your trousers rolled up at the top of your boot.He hit the woman with such force she was left 'stumbling forward', it was heard. The soldier denies one count of sexual assault.Prosecutor Lieutenant Commander Jamie Brotherton told Bulford Military Court, Wiltshire, that the woman - who cannot be named for legal reasons - was walking from a smoking area when the alleged assault occurred.'The complainant was outside bending down to adjust her twisties when, without consent, the defendant came up behind her and grabbed her bottom hard, causing her pain and distress,' he said.Lieutenant Commander Brotherton said Private Rowell, of the Royal Military Academy in Sandhurst, Berkshire, had used such a 'good deal of force' that the woman's friend who had walked slightly ahead, turned around after hearing a 'loud slapping noise'. ",
        "'It was uninvited, unwanted and not consented to,' he continued.'She said it left her stumbling forward. The Crown say she was carrying out an everyday activity - adjusting her twisties - and she did not expect, invite or want anyone to grab her bottom.'She clearly wasn't asking for it.'",
        "Giving evidence, the woman told the court her break, which she had taken in a smoking area, had ended so she was returning to her workplace in a group containing Rowell.'We walked up a path back to our squadron,' she said.'Private Rowell was behind me in a group. I wore twisties on the bottom of my trousers - they go around the bottom of your boots to touch the bottom of your trousers to make them look neater.'I bent down to readjust them because I was going back to work, when Private Rowell came up behind me and slapped me on the bum - it knocked me forwards.'I shot up and obviously I was shocked. It hurt.' ",
        "The woman insisted she was 100 per cent sure it was Private Rowell and that she had given him no invitation to touch her.The court heard when the female soldier exclaimed 'what the f***?', Private Rowell said: 'Don't act like you weren't asking for it.''It made me feel really uncomfortable,' she added.'I didn't feel like I wanted to be touched by him and he had touched me.'Private Rowell denies a single charge of sexual assault. The trial continues."
    ]
}