{
    "articleURL": "/tvshowbiz/article-12049185/Jock-Zonfrillos-real-revealed-Scottish-village-mourns-death.html",
    "content": [
        "Jock Zonfrillo was 46 when he died on MondayGrew up in Scotland with his parents and older sister As a kid, he desperately wanted to be like his grandfather",
        "When 'Jock' Zonfrillo was a young boy growing up in a small village in Scotland, he wanted to be just like his grandfather - a 'kind, wise nonno' running around with all his grandkids.",
        "But his dream of growing old and watching his own four children become parents was ripped away in the early hours of Monday morning, when police found the 46-year-old dead in his bed at the boutique Zagames House hotel at Carlton in Melbourne.No drug paraphernalia was located, no one else was in the hotel room, and police formed the view MasterChef judge had died of natural causes.Zonfrillo's body has now been released to his wife, Lauren Fried, and the precise cause of his death will be determined by the coroner.Friends, family and colleagues from all over the world flooded social media with tributes to the fallen chef and, by Tuesday morning, there was little doubt in anyone's mind about the kind of person Zonfrillo was.The words 'kind', 'caring' and 'generous' were continually repeated by those who knew him as a MasterChef judge and culinary mentor, a friendly neighbour, a devoted father, and an incredible chef.However, missing from the published tributes were extraordinary details about his life in Ayrshire as a young boy, known then as Barry, who became the class clown because he hated going to school at Belmont Academy and didn't fit in.His neighbours in Ayrshire were proud that someone from their small community made it big internationally, and were saddened when he passed.",
        "His name and picture was shared three years ago in a local Facebook group by a Scotsman who was watching MasterChef Australia and realised Zonfrillo, a new judge on the show at the time, was from his area.'Anyone know him?' the man asked.Surprised locals flocked to the comments to say they remembered him as Barry, who was the son of well-regarded hairdressers Ivan and Sarah Zonfrillo.'I know him,' one man said. 'Worked as a Saturday boy in his father's shop.'Another wrote: 'Love to see someone from my home town doing really well on TV, but still Scottish.'A third person said: 'Wow one of our own, brilliant!' Others said they remembered him as a child at Belmont Academy, said his parents still live in Ayrshire, and shared intimate details about his extended family.On Monday, group members were upset when the thread was updated with news of his death.",
        "In his memoir, Zonfrillo recalled he was so desperate to spend time with his father that he volunteered to work in his barber shop on Saturdays - sweeping, washing hair, and bantering with gruff men who walked inside.He didn't want to follow his father into barbering at the time - he felt as though he'd be wiling his life away in a shop six days a week - but as he aged, he wondered if that's what he should have done.",
        "'I've often looked back and wished that I'd stayed in town, taken over the shop,' he wrote.'I would have loved nothing more than being able to work with Dad every day. 'I'd probably have been bored to tears, but that would've been mitigated by the chance to have him with me through the years as I went through all life's ups and downs'.And his life had many ups and downs. He was in trouble from the week he started school - his cousins, who shared his family name, were not well behaved and all the teachers didn't expect any less from the youngest Zonfrillo.He found school boring, teachers said he would never amount to anything, and he was bullied by other kids for being half-Italian and having salami and garlic on ciabatta for lunch instead of a stock-standard sandwich.But perhaps the most challenging aspect of his childhood came when he and his friends were 11 years' old and decided to break into a car yard in the dark and steal three vehicles.None of the schoolboys had driven a car before and promptly smashed one while trying to get it down the driveway.",
        "They got caught and two were charged, but Zonfrillo's parents managed to talk police out of laying their son with criminal charges.",
        "Despite getting him out of legal trouble, his parents were livid. His father was so angry he couldn't speak and his mother couldn't stop screaming and yelling.'From then on, my parents never let go of it,' Zonfrillo wrote.'It was this weird sort of grudge that Mum and Dad held against me. While they didn't verbalise it, they never let go of it ... I don't think my parents ever really forgave me.'Zonfrillo eventually got a job in a kitchen. He didn't like his first job washing dishes, but soon found his calling when he was offered a cooking position.He left school to pursue what would become a extraordinary career as a chef, during which time he battled heroin addiction, moved to Australia, opened award-winning restaurants.He had two kids with his second wife, and another two with his third wife, Ms Fried.It is believed Zonfrillo was settling into a new life in Rome with his young family before tragedy struck on Monday.He returned to Melbourne to undertake promotional work for the 15th season of MasterChef, which was due to premier on Monday.The show will now air at 7.30pm on Sunday."
    ]
}