{
    "articleURL": "/wires/ap/article-12047001/Democrats-pressure-GOP-debt-limit-spending-cuts.html",
    "content": [
        "WASHINGTON (AP) - Senate Democrats pressured Republicans on the increasingly menacing debt ceiling impasse Thursday, focusing on what they say will be painful reductions in government services if a bill the GOP recently pushed through the House becomes law.",
        "Republicans responded that they know the legal limit on government borrowing must be raised to avert a possible default. But they're insisting it be coupled with cuts in what they consider bloated federal spending.No one expects that the House bill, which would increase the nation's borrowing authority as well as cut spending, will reach President Joe Biden's desk. The Democratic Senate won't let it.Many Republicans admitted so when passing the measure. But they said the House action was necessary to get Biden to the negotiating table with Republican Speaker Kevin McCarthy. A meeting at the White House with congressional leaders of both parties is set for next week.Despite the legislation's certain demise, Democrats are eager to tie Republicans, particularly in swing districts and states, to various provisions in the bill. Those include one that would cap next year's spending at 2022 levels and allow it to rise only 1% annually in ensuing years, much below the rate of inflation.That spending limit, which would account for most of the Republicans' projected $4.8 trillion in savings, could have severe impacts on programs such as Head Start and Meals on Wheels, cancer research and veterans' health care, Democrats say.",
        "\"If Republicans won´t level with the American people about their terrible bill, Senate Democrats are going to do it for them,\" Senate Majority Leader Chuck Schumer, D-N.Y., said.",
        "It's just the latest jousting in Congress over the debt limit, a legal limit to government borrowing that has been raised repeatedly in recent years as the nation's debt has swelled past $31 trillion. Urgency around the issue intensified this week as the Treasury Department announced that the \"extraordinary measures\" being used to avoid a devastating government default could run out on June 1 - giving lawmakers just a few weeks to find a solution.Republicans described the Democratic effort as a distraction that won't change their position: Biden must negotiate on spending reductions in exchange for increasing the debt ceiling.\"It's showboating to badmouth the fact that the only thing that's been done on the debt ceiling and on the budget is what Republicans have done,\" said Sen. Chuck Grassley, the ranking Republican on the committee. \"Now the ball is in the court of the president to negotiate, and they want to distract from that.\"Grassley said it would be up to Congress to decide how to meet the spending caps that the House bill would put in place, and \"nothing in the legislation mandates cuts to defense, veterans' health care, border security or other activities that Republicans have already prioritized.\"The House bill would reduce deficits over 10 years by, among other things, clawing back unspent COVID aid, removing the clean energy tax credits that Biden signed into law last year and reversing Biden´s student debt forgiveness and repayment plan.",
        "But those spending reductions could come at a cost. Moody´s Analytics estimates the Republican bill would cause 790,000 job losses next year.Mark Zandi, chief economist at Moody's Analytics, said the timing of the spending cuts that would occur through the House bill would \"meaningfully increase\" the likelihood of a recession. Economic growth, he projects will be about 2.23% should Congress pass a clean debt ceiling, versus 1.61% if the House Republican legislation becomes law.\"We need to end this drama as quickly as possible,\" Zandi said of the debt ceiling impasse. \"If we don't, we're going to go into recession and our fiscal challenges will be made even worse.\"Republicans have argued that reduced spending is necessary to curb the inflation that has increased the cost of fuel, food and housing. They also say the House bill would put the country's finances on a more sustainable path.Sen. Sheldon Whitehouse, the Democratic chairman of the Senate Budget Committee, mocked that rationale. House Republicans care about the debt \"sporadically,\" he said, pointing to $7 trillion in debt that was added under President Donald Trump and $3 trillion under President George W. Bush.\"They seek to cause chaos,\" he said.Meanwhile, the White House insisted anew Thursday that the onus is on Republicans in Congress to raise the debt limit. Budget Director Shalanda Young said, \"Tomorrow, they could put a bill on the floor to make sure we won´t default. I could probably write the bill for them in five minutes. It´s pretty easy.\"",
        "But that logic works both ways, some witnesses and Republican lawmakers said.Brian Riedl, a senior fellow at the Manhattan Institute for Policy Research, told lawmakers that Congress has a long history of attaching efforts to reduce deficits to debt ceiling lifts. He said the nation´s debt, now more than $31 trillion, means all legislative avenues should be open to addressing it.Excluding defense programs and veterans' health benefits from the cuts when enacting future spending bills would put more pressure on other non-defense spending approved by Congress each year. Such spending would fall to 2% of GDP by 2033, the lowest level since at least the early 1960s. Such non-defense spending does not include mandatory funds for Medicare and Social Security.Sen. Ben Ray Lujan, D-N.M., said he is one of two senators to have attended Head Start schooling, and warned that the House bill would eventually lead to dramatic cuts in that program. He said his participation in Head Start allowed him to learn, socialize and receive healthy food while his parents could stay in the workplace.\"That sounds like good economic policy to me,\" Lujan said.Two other witnesses called on lawmakers to keep provisions passed into law last August designed to curb global warming and boost clean energy production. House Republicans propose rescinding most of the energy tax credits and spending in that bill, reducing deficits by more than $500 billion over 10 years.",
        "Those tax breaks have spurred billions of dollars in private investment across the country, according to Abigail Ross Hopper, president and CEO of the Solar Energy Industries Association. She said that some 40 new electric battery manufacturing sites are coming to states such as Michigan, Arizona and South Carolina. Companies are also expanding their battery plants in states such as Oklahoma and Alabama, while wind-power manufacturing facilities are coming to Iowa, Georgia, Texas and others.\"Any threat to the IRA,\" she said, referring to Democrats' Inflation Reduction Act, \"is a threat to these factories and these jobs.\"Fred Krupp, president of the Environmental Defense Fund, called on lawmakers to maintain a charge on excessive methane emissions from U.S. oil and gas facilities that the House bill would repeal. He said swift cuts in methane could slow the rate of global warming by 30%, plus provide important health benefits to Americans near oil or gas sites because other pollutants, such as cancer-causing benzene, are emitted alongside methane.\"Congress was right to enact (it), our health and the environment will benefit because of it, and it should be left in place to do its job,\" Krupp said.____White House reporter Josh Boak contributed to this report."
    ]
}