{
    "articleURL": "/wires/ap/article-12052839/F1-drivers-shrug-Red-Bull-dominance-Miami-GP-arrives.html",
    "content": [
        "MIAMI GARDENS, Fla. (AP) - Red Bull rolled into the first of Formula One's three stops in the United States undefeated and its challengers already waving the checkered flag on the championship.",
        "Max Verstappen and Sergio Perez have been so strong through the first four races that rival drivers have openly wondered if any other team will win a race this year.Boring? That's the narrative that followed F1 to the Miami Grand Prix, a highly anticipated event a year ago when it debuted now working through a bit of a hangover. With F1 races scheduled later this year for Austin, Texas, and Las Vegas, the early Red Bull dominance has created the perception that F1 will have a snoozer of a season that could dull the growing American interest.\"What if you go to the cinema and after 15 minutes the movie is (crap), but the last hour-and-a-half is amazing?\" asked Alpine driver Pierre Gasly. \"I don't think it's fair to already make such a claim. I think you need to give the season more time.\"The grumbling reached every corner of the paddock last Sunday after a lackluster Azerbaijan Grand Prix, where Red Bull posted its third 1-2 finish of the season. As Perez and Verstappen drove away from the competition, the rest of the field struggled to pass.Charles Leclerc said Ferrari will do its best to put on a good show Sunday.",
        "\"I´ll do my best to not make it boring, but at the end it´s a sport,\" Leclerc said. \"It´s like in every sport, sometimes a team is just better than others and at the moment it´s the case with Red Bull. We are working flat-out like everybody here is working flat out to try and recover the gap to the Red Bulls.\"",
        "There was early promise Friday when George Russell and Lewis Hamilton paced the first practice for Mercedes, while reigning two-time champion Verstappen was fourth fastest and Perez 11th.\"It´s not boring for me, I´m challenged every single day trying to get back to the front,\" said Hamilton, a seven-time F1 champion. \"But as a racing fan watching, I can understand because there´s not as much competition as perhaps they are used to with the NFL and NBA. They have tried to bring the teams closer but it never seems to work.\"Russell suggested spectators simply turn their focus to the action behind the Red Bulls.\"The competition we´ve got at the moment between Ferrari and Aston Martin, at every race we go to it´s really close between us in qualifying, the pace is really close in the race,\" said Russell. \"It´s obviously just a shame that there´s two more cars well out in front. So forget about those two and just watch the race for P3. It may be a bit more exciting.\"WELCOME BACK TO MIAMIThe inaugural Miami Grand Prix was one of the hottest tickets in sports a year ago. Seats and suites sold out almost as soon as they were made available. Former first lady Michelle Obama was among those who came out to see the cars and stars and the fake marina.",
        "Although F1 has said it expects 270,000 spectators over this week's three-day event, seats that sold for thousands of dollars last year can be found for about $300 on the secondary market. An additional 6,000 seats were added this year.The celebrity guest list is strong: actors Vin Diesel and Michelle Rodriguez have already gotten rides around the track, Bad Bunny is expected back Sunday for a second consecutive year, while Becky G, Jake Paul, Mike Tyson, Serena Williams and Martin Garixx are all listed as expected attendees.The campus layout was tweaked for the event held at Hard Rock Stadium, where the paddock this year was moved into the stadium from its previous spot behind the pits.The entire track circuit has also been resurfaced after driver complaints last year that it was falling apart in places - most of the layout includes parking lots around the stadium - and there were minor revisions to some run-off areas.\"The vibe´s pretty sick so far,\" said Lando Norris of McLaren. \"I think everyone enjoys it here. It´s just good fun.\"HAMILTON CONTRACTA day after Hamilton revealed an interest in trying NASCAR and other motorsport, Mercedes boss Toto Wolff said a contract extension will get completed with the seven-time champion.Hamilton, who turned 38 in January, has said he wants a multi-year deal. Wolff said there is no hurry to complete the extension.",
        "\"It's been 11 years that we've been together and every single time when we talk about Lewis' contract it is six months of, `Where are we and what is happening?´ and we keep saying the same thing that we are just rolling on,\" Wolff said Friday. \"It's not any difficult contract conversation, we're just putting different timelines and a few different numbers in there and that's what we do. It's a work in progress, bouncing emails back and forth. Eventually we're going to sign him.\"Hamilton´s contract with Mercedes expires after this season. He is the winningest driver in F1 history with 103 victories.Hamilton on Thursday was asked if he'd ever consider racing and NASCAR and he recalled a 2011 car swap he did with Hall of Famer Tony Stewart at Watkins Glen.\"I´d love to try it at some stage. It´s not a dream for me to go race another series, but I am an admirer,\" he said. \"I´m a fan of racing and other sports. So I would like to try it.\"Hamilton also expressed interest in swapping with Valentino Rossi and trying MotoGP and maybe even IndyCar, the U.S.-based open wheel series.\"I sometimes watch IndyCar and would love to try one of those at some stage,\" he said. \"But right now my focus is solely on Formula One, and I don´t plan on leaving any time soon.\"",
        "___AP auto racing: https://apnews.com/hub/auto-racing and https://twitter.com/AP_Sports"
    ]
}