{
    "articleURL": "/tvshowbiz/article-12046883/Jett-Kenny-finds-support-father-Grant-don-lipstick-womens-mental-health.html",
    "content": [
        "Jett Kenny and his father Grant have started wearing red lipstick to support women's mental health. ",
        "Jett took to Instagram to share an image of himself and his dad wearing different shades of lip colour in honour of Liptember.'Dad showing off his bright lip too! We nominate Karl Stefanovic and Jamo Porter to join us! Let's get uncomfortable for a good cause lads,' he wrote. He told his followers to tag him in Liptember to show them their images. Jett is the new ambassador for the inaugural Lip-Stick It Campaign, with him encouraging his male followers to wear lipstick on May 11 in support of the women in their lives. ",
        "'As you all know, my sister Jaimi passed away a few years ago after a lengthy battle with her mental health,' he began a few weeks ago. 'What people don't know is what goes on behind the closed doors of those families, like mine, who have someone close to them struggling with their mental health.'He went on to say: 'It can also be hard to know how we can best support the mental health struggles of our female friends and family.' ",
        "'That's why, I am thrilled to announce that I am the ambassador of the inaugural Lip-Stick It Campaign - a new and Australian-first fundraising campaign by Liptember Foundation.''On May 11th us lads will Lip-Stick It to women's mental health issues by donning a beautiful shade of lippy to support the women in our lives - stay tuned for more.'",
        "Jett went on to encourage his followers to join in on the campaign and make a donation through the link in his bio. ",
        "The Kenny-Curry family announced Jaimi's death on social media on September 15, 2020, one day after her passing.It was later reported that Jaimi had battled alcoholism and an eating disorder before her death at a Sunshine Coast hospital.For free and confidential support, contact Lifeline on 13 11 14 or the Butterfly Foundation for eating disorder concerns on 1800 ED HOPE."
    ]
}