{
    "articleURL": "/tvshowbiz/article-12057817/MTV-Movie-TV-Awards-2023-Pedro-Pascal-scoops-gong-night-stripped-show.html",
    "content": [
        "Coolidge was named the winner of the Most Frightened Performance and the Comedic Genius award Barrymore pulled out as host amid the strike, but was named Best Host anyway on the eveningThe Last Of Us came away with Best Show, Best Duo for Pedro Pascal and Bella Ramsey and Best Hero for Pascal A number of viewers were critical of the pre-taped nature of the show amid the WGA strike  The labor action also led the awards show to cancel its red carpet festivities and other stars dropped outJennifer Coolidge and Drew Barrymore showed their support for the Writers Guild of America amid the ongoing strike on Sunday as they picked up gongs at the 2023 MTV Movie &amp; TV Awards - while The Last of Us swept the board with three accolades.",
        "Other notable names who emerged victorious on the evening - which drew some criticism from fans amid the pre-recorded broadcast as result of the WGA strike - included Tom Cruise, Jenna Ortega and Taylor Swift.   Accepting the award for Comedic Genius, Jennifer, 61, said: 'Almost all great comedy starts with great writers. I just think as a proud member of SAG, I stand here before you tonight side-by-side with my sisters and brothers from the WGA that are fighting right now, fighting for the rights of artists everywhere.'She added, 'I think of the words of Shakespeare where he once said, you know, the play is the thing. Well, I don't want to put words in his mouth or anything but I think what he really meant was it's everything!'Coolidge won a second award for Most Frightened Performance for The White Lotus at the event. She prevailed in the category against Cocaine Bear's Jesse Tyler Ferguson, Barbarian's Justin Long, Bodies Bodies Bodies star Rachel Sennott and Smile's Sosie Bacon.",
        "BEST MOVIEScream VI (WINNER) BEST SHOWThe Last of Us (WINNER) BEST PERFORMANCE IN A MOVIETom Cruise — Top Gun: Maverick (WINNER)BEST PERFORMANCE IN A SHOWJenna Ortega — Wednesday (WINNER)MOST FRIGHTENED PERFORMANCEJennifer Coolidge — The White Lotus (WINNER) BEST DUOPedro Pascal + Bella Ramsey — The Last Of Us (WINNER)BEST SONGTaylor Swift — Carolina (Where The Crawdads Sing) (WINNER)BEST HOSTDrew Barrymore — The Drew Barrymore Show (WINNER)",
        "'My gosh, popcorn,' she said. 'Thank you. Oh, my go. Most frightening death. Thank you. I hope this is the last time that I ever die on a show. I would like to stay alive.'The Last Of Us star Pedro Pascal won the honor for Best Hero to kick off the award announcements on Sunday, as the show also garnered the honors for Best Show and Best Duo for Pascal and Bella Ramsey. Pascal prevailed over a field including Andor's Diego Luna, Wednesday's Jenna Ortega, Ant-Man &amp; The Wasp: Quantumania's Paul Rudd and Top Gun: Maverick's Tom Cruise for the honors. 'I want to say thank you, MTV Movie and TV awards,' Pascal said in his acceptance speech. 'I am a child of MTV. This means the absolute world to me. The people at MTV told me that 77.5 million people voted this year. Which blows my mind and just makes it such an honor.'He continued, 'I wish we could all be together so that I can look into your eyes and tell you that all young people in the world are my heroes and I wouldn't be here if it weren't for you. I want to say that you deserve a world that serves your interests.'You deserve to be healthy. You deserve to be safe. You deserve for your individual rights to be fought for and protected. You deserve real heroes in this world because you are real heroes to me. And I love you. Thank you. Thank you.'",
        "With writers on strike and picketing studios, host Drew Barrymore announced she was dropping out last Sunday.The 48-year-old actress-turned-talk show host had been set to MC the festivities, but she put her clout behind writers struggling to earn better pay and guarantees on staffing, as studios increasingly try to limit the size of writers' rooms and shrink the number of episodes per series.  'I have listened to the writers, and in order to truly respect them, I will pivot from hosting the MTV Movie &amp; TV Awards live in solidarity with the strike,' Barrymore told Variety. 'Everything we celebrate and honor about movies and television is born out of their creation.'",
        "Barrymore added that she'll be watching the show from home, and she stills plans to return as host next year. Despite her absence, the Hollywood stalwart was also named the Best Host for The Drew Barrymore Show. Barrymore said as she was accepting the honors, ‘Hello, hello. Thank you so much. I can't believe this. Thank you for letting me in. Get eyeball to eyeball. Thank you for this whole show. This whole world being - thank you. Thank you so much.She continued: ‘Oh, my goodness. Okay. Also I want to thank Chelsey, Christina, Liz, our amazing, amazing writers. Her this is definitely for them and every single person who makes the show. There is no I in my.'",
        "Tom Cruise was named the winner for Best Performance in a Movie for Top Gun: Maverick, besting fellow nominees Austin Butler (Elvis), Florence Pugh (Don’t Worry Darling), KeKe Palmer (Nope) and Michael B. Jordan (Creed III). Cruise showed off his trademark showmanship as he delivered his acceptance speech from the air in a jet.'Hi, everyone, thank you so much for this award,' the perennial A-lister said. 'I make these films for you. I love you. I love entertaining you. How much you enjoy it, how much you appreciate it. There is no better feeling and I hope you enjoy this.'Dead Reckoning coming out in July. It's a wild ride. Have a wonderful summer. Thank you again for letting me entertain you. It's an absolute privilege. We'll see you at the movies.'",
        "Scream VI was named the Best Movie of the year, edging out a field that included Avatar: The Way of Water, Black Panther: Wakanda Forever, Elvis, Nope, Smile and Top Gun: Maverick. Wednesday's Jenna Ortega was named the winner of Best Performance in a Show, besting a loaded category that consisted of Aubrey Plaza (The White Lotus), Christina Ricci (Yellowjackets), Riley Keough (Daisy Jones &amp; The Six), Sadie Sink (Stranger Things) and Selena Gomez (Only Murders in the Building). ",
        "The Kardashians were named Best Docu-reality Series over Jersey Shore Family Vacation, The Real Housewives of Beverly Hills, Family Reunion: Love &amp; Hip Hop Edition and Vanderpump Rules. In the category of Breakthrough Performance, Stranger Things star Joseph Quinn was crowned with the honor over fellow nominees Bad Bunny (Bullet Train), Bella Ramsey (The Last Of Us), Emma D’Arcy (House of the Dragon), and Rachel Sennott (Bodies Bodies Bodies). Vanderpump Rules quartet Ariana Madix, Katie Maloney, Scheana Shay and LaLa Kent was named Best Reality On-Screen Team, besting stars from shows such as Jersey Shore Family Vacation, The Challenge: Ride or Dies, RuPaul’s Drag Race and The Real Housewives of Beverly Hills.Adam Sandler took home the prize for Best Comedic Performance, besting fellow nominees Coolidge (Shotgun Wedding), Dylan O’Brien (Not Okay), KeKe Palmer (Nope) and Quinta Brunson (Abbott Elementary).In the category for Best Fight, the Scream VI conflict between Ghostface and Courteney Cox (as Gale Weathers) prevailed of the nominees.RuPaul’s Drag Race: All-Stars was crowned the Best Competition Series, besting competitors including All-Star Shore, Big Brother, The Challenge: USA and The Traitors.Outer Banks stars Madison Bailey and Rudy Pankow were crowned winners in the Best Kiss category, defeating competitors such as The Last Of Us' Anna Torv and Philip Prajoux, My Policeman's Harry Styles and David Dawson, Daisy Jones &amp; The Six's Riley Keough and Sam Claflin and Only Murders in the Building's Selena Gomez and Cara Delevingne. ",
        "The 2023 MTV Movie &amp; TV Awards aired Sunday in a pre-taped broadcast amid the commencement of the WGA writers' strike earlier this week.  The long-running awards show was one of the first victims of the ongoing dispute between the Alliance of Motion Picture and Television Producers and the Writers Guild of America union.Officials from the Writers Guild had pledged to picket at the event in Southern California - which will would have put celebrities in the awkward position of crossing the line - until MTV scuttled the live event Saturday evening.MTV executive producer Bruce Gillmer said in a statement, 'We're pivoting away from a live event,' according to the AP.Gillmer said that the pre-taped format enables the network 'to produce a memorable night full of exclusive sneak peaks, irreverent categories our audience has come to expect, and countless moments that will both surprise and delight.'As in previous years, the show will feature gender-neutral award categories. The show, which had previously been split over two days for scripted and unscripted content, had been condensed back into a single evening this year. Some fans were up in arms as the network aired a stripped-down version of its usual ceremony featuring little more than clip packages, a few pre-recorded sketches and a small number of stars accepting awards virtually.",
        "Many viewers on social media thought the show was little more than shell of its former self after it was swept up in ongoing contract disputes between the Writers Guild of America and the Alliance of Motion Picture and Television Producers (AMPTP), which represents film and TV production companies.The labor action also led the awards show to cancel its red carpet festivities, and other stars dropped out to show support to strikers - with the WGA picketing outside the Barker Hangar. The most significant blow was Barrymore's decision to drop out as host in solidarity with writers after the strike began on Monday. Although she didn't not cross a picket line to appear in person, she was featured in several pre-taped sketches and commercials.Film and television writers are on strike over complaints that studios have underpaid them for years, particularly when it comes to streaming programs that offer almost no residuals over time. They are also fighting back against studios' attempts to shrink writers's rooms, to shorten the number of episodes of television seasons and to leave open the possibility of replacing human writers with so-called 'AI' programs.'Worst award show ever,' wrote one person who reposted a funny video of a woman freaking out.'This has to be a joke. I do not believe this is happening. I'm literally about to f***ing kill myself and I'm not kidding,' screamed the woman in the video, which has become a popular meme. 'You better f***ing fix this s*** right now! I literally am gonna die, I need an ambulance.'Some people appeared to have not been paying attention to the battle between writers and studio bosses, as it has so far only impacted a few live shows.'Is this not a typical mtv movie awards lmao? I'm so lost,' wrote one confused person who included a photo of a woman grimacing. ",
        "Some users couldn't believe that MTV would move forward on a show that no longer had a host. Barrymore appeared in a few disjointed videos, but many of them referenced her hosting the live show, which no longer made sense in context. 'Drew Barrymore didn't host the #MTVAwards but they are still playing her clips,' wrote one viewer. For one Twitter user, the broadcast brought back back memories of the height of the ongoing coronavirus pandemic, when most television productions had to resort to virtual appearances to keep performers safe.'Bruh watching the #MTVMovieandTVAwards and thanks to the Writers Strike goin on, watching it like this feels like we're in Covid era all over again,' tweeted one viewer.Another user agreed, writing, 'I thought awards shows were weird in 2020 with the lockdown and everyone doing them on zoom but this is definitely weird.' Others pointed out the drastic changes in tone the broadcast suffered from due to its new format.'We went from Pedro [Pascal] give a heartwarming speech in his backyard to Tom Crusie in a f***ing plane [sic],' pointed out one person who included a screenshot of Cruise in his aircraft with his golden popcorn sitting behind him in the cockpit.",
        "BEST MOVIEAvatar: The Way of WaterBlack Panther: Wakanda ForeverElvisNopeScream VI (WINNER)SmileTop Gun: MaverickBEST SHOWStranger ThingsThe Last of Us (WINNER)The White LotusWednesdayWolf PackYellowstoneYellowjacketsBEST PERFORMANCE IN A MOVIEAustin Butler — ElvisFlorence Pugh — Don’t Worry DarlingKeKe Palmer — NopeMichael B. Jordan — Creed IIITom Cruise — Top Gun: Maverick (WINNER)BEST PERFORMANCE IN A SHOWAubrey Plaza — The White LotusChristina Ricci — YellowjacketsJenna Ortega — Wednesday (WINNER)Riley Keough — Daisy Jones &amp; The SixSadie Sink — Stranger ThingsSelena Gomez — Only Murders in the BuildingBEST HERODiego Luna — AndorJenna Ortega — WednesdayPaul Rudd — Ant-Man &amp; The Wasp: QuantumaniaPedro Pascal — The Last Of Us (WINNER)Tom Cruise — Top Gun: MaverickBEST VILLAINElizabeth Olsen — Doctor Strange in the Multiverse of Madness (WINNER)Harry Styles — Don’t Worry DarlingJamie Campbell Bower — Stranger ThingsM3GAN — M3GANThe Bear — Cocaine BearBEST KISS Anna Torv + Philip Prajoux — The Last Of UsHarry Styles + David Dawson — My PolicemanMadison Bailey + Rudy Pankow — Outer Banks (WINNER)Riley Keough + Sam Claflin — Daisy Jones &amp; The SixSelena Gomez + Cara Delevingne — Only Murders in the BuildingBEST COMEDIC PERFORMANCEAdam Sandler — Murder Mystery 2 (WINNER)Dylan O’Brien — Not OkayJennifer Coolidge — Shotgun WeddingKeKe Palmer — NopeQuinta Brunson — Abbott ElementaryBREAKTHROUGH PERFORMANCEBad Bunny — Bullet TrainBella Ramsey — The Last Of UsEmma D’Arcy — House of the DragonJoseph Quinn — Stranger Things (WINNER)Rachel Sennott — Bodies Bodies BodiesBEST FIGHTBrad Pitt (Ladybug) vs. Bad Bunny (The Wolf) — Bullet TrainCourteney Cox (Gale Weathers) vs. Ghostface — Scream VI (WINNER)Jamie Campbell Bower (Vecna) vs. Millie Bobby Brown (Eleven) — Stranger ThingsKeanu Reeves (John Wick) vs. Everyone — John Wick 4Escape from Narkina 5 — AndorMOST FRIGHTENED PERFORMANCEJennifer Coolidge — The White Lotus (WINNER)Jesse Tyler Ferguson — Cocaine BearJustin Long — BarbarianRachel Sennott — Bodies Bodies BodiesSosie Bacon — SmileBEST DUOCamila Mendes + Maya Hawke — Do RevengeJenna Ortega + Thing — WednesdayPedro Pascal + Bella Ramsey — The Last Of Us (WINNER)Simona Tabasco + Beatrice Grannò — The White LotusTom Cruise + Miles Teller — Top Gun: MaverickBEST KICK-ASS CASTAnt-Man &amp; The Wasp: QuantumaniaBlack Panther: Wakanda ForeverOuter BanksStranger Things (WINNER)Teen Wolf: The MovieBEST SONGDemi Lovato — Still Alive (Scream VI)Doja Cat — Vegas (Elvis)Lady Gaga — Hold My Hand (Top Gun: Maverick)OneRepublic — I Ain’t Worried (Top Gun: Maverick)Rihanna — Lift Me Up (Black Panther: Wakanda Forever)Taylor Swift — Carolina (Where The Crawdads Sing) (WINNER)BEST DOCU-REALITY SERIESJersey Shore Family VacationThe Real Housewives of Beverly HillsFamily Reunion: Love &amp; Hip Hop EditionThe Kardashians (WINNER)Vanderpump RulesBEST COMPETITION SERIESAll-Star ShoreBig BrotherRuPaul’s Drag Race: All-Stars (WINNER)The Challenge: USAThe TraitorsBEST HOSTDrew Barrymore — The Drew Barrymore Show (WINNER)Joel Madden — Ink MasterNick Cannon — The Masked SingerRuPaul — RuPaul’s Drag RaceKelly Clarkson — The Kelly Clarkson ShowBEST REALITY ON-SCREEN TEAM (presented by SONIC®)Mike “The Situation” Sorrentino, Vinny Guadagnino, Pauly D (MVP) — Jersey Shore Family VacationTori Deal and Devin Walker — The Challenge: Ride or DiesRuPaul Charles and Michelle Visage — RuPaul’s Drag RaceAriana Madix, Katie Maloney, Scheana Shay, LaLa Kent — Vanderpump Rules (WINNER)Garcelle Beauvais and Sutton Stracke — The Real Housewives of Beverly HillsBEST MUSIC DOCUMENTARYHalftimeLove, LizzoSelena Gomez: My Mind &amp; Me (WINNER)SherylThe Day the Music Died: The Story of Don McLean’s American PieBEST MUSICAL MOMENT Sofia Carson's Come Back Home from the film Purple Hearts (WINNER) COMEDIC GENIUS AWARDJennifer Coolidge (WINNER)"
    ]
}