{
    "articleURL": "/sport/nfl/article-12048541/Ravens-Lamar-Jackson-issues-challenge-new-receivers-massive-contract-extension.html",
    "content": [
        "Jackson officially signed five-year, $260m contract, making him the top-paid QBThe Ravens added WRs Odell Beckham Jr. and Nelson Agholor in the offseasonDailyMail.com provides all the latest international sports news Baltimore Ravens superstar quarterback Lamar Jackson officially signed five-year, $260 million contract on Thursday making him the highest paid QB in the league.",
        "Jackson's deal set a total of three NFL records for signing bonus, three-year cash flow and average per season, but what was perhaps even more noteworthy was the challenge he issued to his wide receivers amongst an offseason that his seen the offense take a full makeover.'I want to throw for like 6,000 yards with the weapons we have,' Jackson said while laughing. 'I'm not an individual award-type guy or a stat watcher. I just want to do that because no one has ever done it and I feel like we have the weapons to do it.'  Baltimore added multiple talented pass catchers in free agent wide outs in Odell Beckham Jr. and Nelson Agholor to go along with first-round draft pick Zay Flowers. ",
        "To top it off they also added a new offensive coordinator in former Georgia Bulldogs OC Todd Monken to transform the offense from the run-heavy schemes that became common place under former OC Greg Roman.The final piece to the Ravens offense was re-signing Jackson after the two sides had spent the last two years trying to reach a deal and at one point seemed like he may have been closer to leaving the team than re-signing.Jackson was originally franchise tagged to start the offseason and he eventually requested a trade from the organization. ",
        "He declined to speak on the trade request during the press conference and insisted that he is only focused on fulfilling the promise he made five years ago about bringing a title to Baltimore.'I didn't really care for other teams, I wanted to be here. I want to be a Raven,' Jackson said. 'I said something in 2018 and I meant that. ",
        "'I wanted to get this done before my time [is] up and branch off somewhere else. I really want to finish my career here and win a Super Bowl here.' The deal that Eagles quarterback Jalen Hurts signed also proved to be helpful as it provided a clearer picture of the quarterback market for Jackson despite the $230 million in guaranteed money that the Cleveland Browns gave Deshaun Watson last summer.\"I absolutely wanted to get it done because I was just tired of going back and forth about it,\" Jackson said.\"We've been doing it for years, but it was like the time had come. The numbers were right, and we were all satisfied.\" "
    ]
}