{
    "articleURL": "/tvshowbiz/article-12051081/Fatboy-Slim-58-brings-nineties-performs-Sydneys-Entertainment-Quarter.html",
    "content": [
        "Fatboy Slim was bringing the nineties back as he played his biggest hits to an excited crowd in Sydney. ",
        "The 59-year-old had audiences roaring and grooving as he performed at The Showring in Sydney's Entertainment Quarter on Friday night. Revellers were treated to a show filled of all of the classic's by Fatboy Slim, whose real name is Norman Cook. The superstar DJ wore a red, black, and white graphic t-shirt as he fist pumped into the air on-stage. In one photograph, sweat beads are seen falling down his face as he appears to put his all into livening up the crowd.",
        "The stage show had some visuals behind the DJ as he performed, with a number of projections shown. After going sober 14 years ago, the DJ has a shocking ritual that he does before going on-stage to ensure he is pumped up. Fatboy Slim said he requires a slap round the face to ensure he's alert and ready to go on stage for each gig.",
        "'That transformation involves three Red Bulls, putting on a Hawaiian shirt, removing my shoes and being slapped really hard around the face by my tour manager, Al,' he recently told The Sun.The ritual first came about when he went sober 14 years ago, with the smack taking the place of any drinks.He explained: 'The slap replaces the cheeky vodka and orange or something else which used to get me on stage fighting.",
        "'It just means all my adrenaline is there and I am in a fighting mood to perk me up.'",
        "Elsewhere, the star has admitted the first time he played a gig sober, he got stage fright and felt like a middle-aged man playing 'loud squelchy noises to a bunch of drunk people'.He checked himself into rehab in 2009 when he found his relationships with his family deteriorating.The DJ began his Australian tour last week in Melbourne and is playing five gigs in total across the country. His last set takes place this Sunday, May 7, at Burswood Park in Perth. "
    ]
}