{
    "articleURL": "/news/article-12044319/Missing-man-Kogarah-Zoran-Popovski-Police-launch-appeal.html",
    "content": [
        "Man goes missing in Kogarah areaZoran Popovski vanished on April 14The 54-year-old was seen on CCTV Vision of a man whose 'suspicious' disappearance is being investigated by homicide detectives has been released, showing him crossing a busy road moments before he vanished.",
        "Zoran Popovski was last seen on Railway Parade in Hurstville in Sydney's south on Friday April 14 where it is believed he took a train to Kogarah. Police are conducting a land search of the Kogarah area in a desperate bid to find him, with family saying he left home without his phone or wallet.CCTV footage of his last known movements on the day he vanished showed the dad walking up stairs with a slight limp as he carried papers.The vision also revealed him walking back and forth along a street in Kogarah outside a medical centre.",
        "Mr Popovski's family called police the day after they were unable to contact or locate him. The man's daughter Rebecca, 26, said she last saw her father the day before he went missing and spoke to him just hours before the bizarre disappearance.  He asked her to book an Uber so he could visit her on Friday morning but when she called him later to arrange it his phone was switched off.  'He was already gone. It's just like dad has vanished into thin air,' she told the Sydney Morning Herald. She said she didn't think her dad was in any trouble and he seemed OK when she spoke to him earlier on Friday. ",
        "Mr Popovski, who is an out-of-work brickie had recently moved into a Kogarah home, which he shares with an acquaintance. Rebecca said he had left his belongings and phone at the home. ",
        "'Me and my family just want answers. It's really frustrating not knowing what's going on,' she said.  Police formed Strike Force Yaminbah to investigate the disappearance and have issued several appeals to the public for information. He was last seen at around 1130am on Railway Parade in Hurstville on April 14 before he took a train to Kogarah, police said. The man was then spotted on CCTV crossing President Avenue at the Princess Highway intersection in Kogarah at about 12.40pm. Police are treating the disappearance as suspicious and have enlisted the help from the State Crime Command's Homicide Squad. A land search will be conducted in the areas surrounding Cross Lane, French Street, Cross Street and President Avenue in Kogarah. Superintendent Rohan Cramsie said the father going weeks without contact was out of character. 'Investigators believe that he has limited access to funds or money so when you put those things together in totality, it is concerning and the family are concerned and they're after some answers,' he said. Superintendent Cramsie added the missing dad was known to local authorities but he wouldn't talk more about his history. ",
        "Mr Popovski is described as Caucasian with an olive complexion and is between 165cm to 170cm tall with a thin build, with black hair and brown eyes.He was last seen wearing a dark shirt, dark pants and could be wearing glasses.Police are urging anyone who has information to contact Kogarah Police Station or Crime Stoppers on 1800 333 000. "
    ]
}