{
    "articleURL": "/wires/ap/article-12039363/Appeals-court-refuses-reconsider-Adnan-Syeds-sentence.html",
    "content": [
        "A Maryland appellate court on Tuesday denied a request by Adnan Syed's lawyer to reconsider its recent decision to reinstate his murder conviction. His lawyer said she will appeal to the Maryland Supreme Court.",
        "The Appellate Court of Maryland reinstated the conviction in March in a ruling that upheld arguments from the victim´s family claiming a lower court violated their rights.E. Gregory Wells, the chief judge of the appellate court, signed a brief order saying that the three-judge panel that made the initial ruling denied Syed´s motion, \"because it is based on an argument not previously raised.\"Syed´s attorneys claimed the appellate judges broke from the court´s own precedent by failing to require the victim´s family to prove the outcome of the September hearing would have been different if they had received more notice and attended in person. The motion also questions whether the court intends to award crime victims and their representatives \"special treatment not even available to criminal defendants.\"Erica Suter, Syed's attorney, said she would appeal to the state's highest court.\"Appellate courts routinely assess whether an error impacted the underlying proceedings,\" Suter said in a statement. \"We are dismayed that the Appellate Court of Maryland opted not to do so here. We will be seeking review in the Supreme Court of Maryland.\"",
        "Syed - whose long legal case gained international attention in 2014 from the debut season of the hit podcast \"Serial\" - regained his freedom last year when Baltimore prosecutors moved to vacate his conviction, saying they reviewed the case and found alternative suspects and unreliable evidence used at trial.",
        "But the victim´s family said they received insufficient notice to attend the September vacatur hearing in person, which violated their right to be \"treated with dignity and respect,\" and the state's intermediate appellate court agreed. In a 2-1 decision that was stayed for 60 days, the judges reinstated Syed´s conviction and ordered a redo of the hearing in question.Syed was 17 when his high school ex-girlfriend and classmate, Hae Min Lee, was found strangled to death and buried in a makeshift grave in 1999. He was arrested weeks later and ultimately convicted of murder. He received life in prison, plus 30 years.Syed has remained free as the case continues."
    ]
}