{
    "articleURL": "/wires/reuters/article-12040549/Lakers-squander-lead-Warriors-Game-1.html",
    "content": [
        "D'Angelo Russell stalled a Golden State Warriors rally by sinking a tiebreaking hoop with 1:24 remaining, Anthony Davis put up 30 points and 23 rebounds and the Los Angeles Lakers took Game 1 of the Western Conference semifinals from the defending champs 117-112 in San Francisco on Tuesday.",
        "The best-of-seven series continues Thursday in San Francisco.Russell's interior hoop came after the Warriors scored 14 straight points to rally into a tie after being down 112-98 with 5:58 to go. Stephen Curry triggered the run with a three-point play and later added 2- and 3-point hoops, the latter drawing Golden State even at 112-all.After Russell's basket, the Lakers scored only on free throws, with LeBron James making it a three-point game by going 1-for-2 with 1:05 to go and Dennis Schroder clinching the win by making a pair with 2.1 seconds left.The Warriors, meanwhile, missed their final four shots, including a Curry interior attempt that was blocked by Davis and a potential game-tying 3-point attempt by Jordan Poole with 9.1 seconds left.Davis' game-high point total came on 11-for-19 shooting and 8-for-8 from the free throw, where the Lakers outscored the Warriors 25-5, getting 29 attempts to the hosts' six.Davis also found time for five assists and four blocks.James also recorded a double-double for the seventh-seeded Lakers, accumulating 22 points and 11 assists, while Russell and Schroder finished with 19 points apiece. Austin Reaves contributed 10 points.Russell also had a team-high six assists. He went 1-for-5 from 3-point range, part of the team's 6-for-25 (24 percent) showing from long distance.",
        "Coming off a 50-point explosion Sunday in a Game 7 win at Sacramento, Curry managed 27 points on 10-for-24 shooting, 6-for-13 from beyond the arc.Klay Thompson matched his teammate's six threes en route to 25 points, while Poole also had six threes in a 21-point performance.Golden State went 21-for-53 (39.6 percent) from beyond the arc.Kevon Looney matched Davis' 23 rebounds to complement 10 points for the sixth-seeded Warriors. Andrew Wiggins chipped in with 15 points, and Draymond Green a game-high seven assists to go with six points.--Field Level Media"
    ]
}