{
    "articleURL": "/wires/ap/article-12052785/Judge-disciplined-using-position-dodge-traffic-ticket.html",
    "content": [
        "CHARLESTON, W.Va. (AP) - It wasn't the first time Judge C. Carter Williams had been pulled over by West Virginia law enforcement for minor violations.",
        "But his behavior at a traffic stop two years ago - berating the police officer, calling the officer´s supervisors to complain and even driving to the mayor's house to lecture her - crossed a line.Now, Williams has been suspended for six months without pay and was fined $5,000 for actions that \"ventured past coercion into retaliation,\" according to a state Supreme Court sanction issued Thursday. It was longer than the three-month suspension that the state Judicial Hearing Board recommended last October.Beth Walker, the Supreme Court's chief justice, wrote that Williams´ call to the officer's supervisor during the traffic stop \"can only reasonably be interpreted as coercive, and the calls made thereafter were a blatant invocation of his office.\"A judicial disciplinary investigation found Williams had been pulled over three other times in 2020 and 2021 without being ticketed.In another traffic stop, a state trooper did not ticket Williams for failing to wear a seat belt. The trooper said he \"didn´t really see a need to stir up the hornet´s nest for such a minor violation.\" The trooper also knew he was involved in felony court cases where Williams was the judge, according to court documents.During the July 2021 incident that led to Williams' suspension, Moorefield Police Officer Deavonta Johnson stopped the judge's car after seeing him driving with a cell phone in his hand, according to court records. Cell phone use by drivers is banned unless a hands-free device is used.",
        "Johnson had pulled Williams over once before after the judge ran a stop sign in January 2020.As the officer explained why the judge was being stopped, Williams interrupted, saying he was a judge and raising his voice at the officer, court records show. Williams said he'd heard something drop between the door and the seat, picked up the phone and transferred it from one hand to the other while his hands were on the steering wheel.Williams initially refused to provide his license and registration before complying, then told Johnson several times to write a ticket. When Johnson went back to his police cruiser, the judge called the officer's supervisor, who then called Johnson to ask if he had already written the ticket. If no, the supervisor told Johnson not to write it in order to defuse the situation, according to court records.Returning to Williams' car, Johnson told the judge that his license was expired and needed to be renewed. Williams took his license from the officer and drove off.Later that night, Williams called Johnson's supervisor again. He also phoned the Moorefield police chief to complain about the traffic stop before hanging up on him. Williams later called a former police chief, the circuit court's chief judge, and Moorefield Mayor Carol Zuber - as Williams was parked outside of her home.",
        "According to Zuber, who is also the town's police commissioner, a frustrated Williams said, \"You´re going to have to do something with your police officers.\"The Judicial Hearing Board found last October that Williams violated six judicial rules related to professional and public conduct, compliance with the law and using his office for personal gain."
    ]
}