{
    "articleURL": "/tvshowbiz/article-12042563/Coronation-Streets-Beverley-Callards-company-goes-bust-215k-debt.html",
    "content": [
        "Beverley Callard's company has been liquidated, three years after she bagged a rumoured £125,000 fee to star on I'm A Celebrity. ",
        "The Coronation Street star, 66, who is best known as Liz McDonald on the soap, set up personal services company JMBJ Ltd in 2020 after securing her bumper salary to be in the ITV2 show. But less than three years on, the firm has gone bust and accounts show it is £215,677 in debt. On the 13 April, the company was voluntary liquidated. Documents on Companies House reveal it was £114,124 overdrawn at the time of closure, after Beverley and her husband Jon McEwan took out director's loans. ",
        "It owed £51,450 VAT to HMRC, £47,319 corporation tax and £2,784 to two trade creditors - meaning in total the account was £215, 677 in debt at the time of liquidation. MailOnline has contacted Beverley's representatives for comment. It is not the first time Beverley has faced financial struggles. Back in 2012 she became bankrupt after she was hit with a tax bill of £60,000. The actress' money woes reached crisis point when she quit her role in the soap after suffering from ill health and depression. She was caring for her mother, who  was in the late stages of Alzheimer's.She told the Sunday Mirror at the time: 'Since the bankruptcy became public people think I'm a showbiz diva who frittered her cash away on expensive dinners and fancy clothes. That couldn't be further from the truth. ",
        "'Corrie schedules are full-on. It's all or nothing and I had to face a choice between The Street or Mum. I love everything about Corrie but there could only be one answer.'The actress had battles with money problems in the past. Beverley suffered a breakdown around February 2009, having worked double time at Corrie and at the pub which she owned with her fourth husband Joe McEwan.",
        "Hit hard by the credit crunch and smoking ban, losses at the pub meant that the couple's debts grew out of control.For a while the pair were reduced to borrowing cash off friends in order to afford the one meal per day they ate to survive.At her lowest point, Beverly was unable to cover the cost of electric shock therapy for depression while in a psychiatric ward at The Priory in Altrincham.Doctors had come to the conclusion that the treatment was the only option to snap Beverley out of the near-comatic state which she had reached.The actress remembers little of that time, and relies on accounts from her husband and her children.She said the experience made herself and Jon closer as a couple. "
    ]
}