{
    "articleURL": "/wires/reuters/article-12052253/US-STOCKS-Wall-St-rallies-Apple-US-jobs-data-suggests-strength.html",
    "content": [
        "Regional banks rebound after bruising selloff",
        "U.S. employers add 253,000 jobs in AprilIndexes up: Dow 1.6%, S&amp;amp;P 500 1.8%, Nasdaq 2.2%(New throughout, updates prices, market activity and comments; new byline and adds NEW YORK dateline)By Caroline ValetkevitchNEW YORK May 5 (Reuters) - U.S. stocks were up sharply Friday afternoon, with shares of Apple Inc rallying after upbeat results, while U.S. jobs data pointed to a resilient labor market.Apple's quarterly results cheered investors worried about a potential recession and the iPhone maker's stock surged nearly 5%. It hit a nine-month high and was on track for its biggest daily gain since November.Apple's stock was the biggest positive influence on all three major U.S. stock indexes.The U.S. Labor Department report showed job growth accelerated in April and wage gains increased solidly, suggesting the labor market has stayed strong despite recent interest rate hikes from the Federal Reserve.With the jobs report, \"it's about the state of the U.S. economy, and what we saw today suggests it's in a better position than previously expected,\" said Kristina Hooper, chief global market Strategist at Invesco in New York.Regional bank shares also rebounded after recent weakness tied to the collapse of First Republic Bank. PacWest Bancorp rallied along with Western Alliance Bancorp.The Dow Jones Industrial Average rose 512.48 points, or 1.55%, to 33,640.22, the S&amp;amp;P 500 gained 74.23 points, or 1.83%, to 4,135.45 and the Nasdaq Composite added 264.97 points, or 2.21%, to 12,231.37.",
        "On Wednesday, the U.S. central bank raised its interest rate by 25 basis points as expected, but Fed Chair Jerome Powell noted it was too early to say with certainty that the rate-hike cycle was over as inflation remains the chief concern.Apple drove gains in other tech shares. The S&amp;amp;P 500 technology index was up 2.8%, but all 11 major S&amp;amp;P sectors were higher on the day.The KBW regional index was up 3.5%, while the S&amp;amp;P 500 Banks index was up 3.4%.Advancing issues outnumbered declining ones on the NYSE by a 5.05-to-1 ratio; on Nasdaq, a 2.69-to-1 ratio favored advancers.The S&amp;amp;P 500 posted 11 new 52-week highs and 3 new lows; the Nasdaq Composite recorded 75 new highs and 90 new lows. (Additional reporting by Ankika Biswas and Sruthi Shankar in Bengaluru and Sinead Carew in New York; Editing by Subhranshu Sahu, Shounak Dasgupta and David Gregorio)"
    ]
}