{
    "articleURL": "/tvshowbiz/article-12052155/Hollyoaks-star-Abi-Phillips-gets-engaged-partner-11-years.html",
    "content": [
        "Hollyoaks star Abi Phillips has announced her engagement to her partner of 11 years, Gav.",
        "The actress, 29, who played Liberty Savage on the soap, took to Instagram on Friday to share the happy news.Abi posted a picture of herself showing off her dazzling ring as she posed in front of Italy's Lake Garda after jetting off on holiday with her beau.She captioned her post: 'So this happened last night! 'The most magical week in Lake Garda, with my favourite person in the world ended with us getting engaged. ",
        "'The most perfect proposal at sunset at the edge of the lake.'The last 11 years together have been the best of my life and I’m so looking forward to forever together.'Thank you for making this trip the most incredible week, it will forever hold a place in my heart. I love you so much!'It comes after Abi revealed she had been diagnosed with thyroid cancer last year after getting two lumps tested in her neck.Abi told her Instagram followers at the time that she was originally told there was nothing to worry about by a doctor due to her young age, before asking for a second opinion after Love Islander Demi Jones raised awareness by sharing the location of her own tumours.Former soap star Abi admitted she never expected to be told she had cancer, and said: 'So, I took these pictures before my scans and after my biopsy having a good old laugh about how ridiculously dressed up I looked in the hospital before a gig, not expecting for one moment to get the news that I did two weeks later…",
        "She explained that she was originally told that the lumps were 'nothing to worry about' and she was likely just recovering from a minor illness.  Abi said: 'I'd previously been sent away from the doctors after having found two lumps in my neck, they'd passed it off and said I was 'young' and it wouldn't be anything and I was 'probably getting over a cold' or my body was 'fighting something off'.",
        "'As much as that's what I wanted to hear I wanted to get everything checked for my own peace of mind. I booked in with a specialist and immediately she told me she was very concerned due to where my lumps were located and referred me for an urgent biopsy and scans.'Abi went on to reveal that a consultant later confirmed the worst and told her that her cancer would need urgent surgery and radiotherapy treatment.She added that she wouldn't have pushed to see a specialist if it weren't for Demi sharing her thyroid cancer ordeal on social media, and realised that their lumps were 'in the exact same place'.Abi found fame on Hollyoaks at the age of 16 when she debuted as Liberty in 2010. She also famously wrote the song Missing You that featured in Steph Cunningham's death scene. The character of Liberty Savage is now played by Jessamy Stoddart, who took on the role in 2018."
    ]
}