{
    "articleURL": "/wires/reuters/article-12043409/Kremlin-drone-incident-What-know.html",
    "content": [
        "May 3 (Reuters) - Here's a look at what we know about the alleged overnight drone attack on the Kremlin, and the questions it raises.",
        "WHAT HAPPENED?Two of the numerous videos published on Russian social media channels show two objects flying on the same trajectory towards one of the highest points in the Kremlin complex, the dome of the Senate, with the clock on the nearby Spassky Tower showing 2:27 and 2:43 in the early hours of Wednesday. The first seemed to be destroyed with little more than a puff of smoke, the second appeared to leave blazing wreckage on the dome. Reuters checks on time and location indicated that the videos could be authentic.WHAT IS RUSSIA SAYING?Russia called the incident a terrorist attack and an attempt to assassinate President Vladimir Putin, for which it said it reserved the right to retaliate.Western security analysts dismissed the idea that the attack was meant to kill Putin, given that the drones appeared to have been aimed at a highly visible point of the huge, walled Kremlin citadel, rather than any residential quarters, and that Putin often works from elsewhere. His office said he was not there at the time.WHAT DOES UKRAINE SAY?Ukraine denied responsibility. \"We don't attack Putin, or Moscow, we fight on our territory,\" President Volodymyr Zelenskiy told a press conference in Helsinki.WOULD UKRAINE BE ABLE TO MOUNT SUCH A STRIKE?",
        "Possibly. Ukraine appears to have mounted drone strikes deep inside Russia and Russian-annexed Crimea on many previous occasions, including twice last December on an air base for Russian strategic bomber planes. It typically has not claimed responsibility for such actions, although Ukrainian officials have often celebrated them.IF IT WAS UKRAINE, WHAT WOULD THAT MEAN?Ukraine has frequently surprised Moscow with its military prowess, staging attacks far beyond the front lines, but a hit on the symbolic centre of Russian power would be its most audacious act to date.\"If we presume it was a Ukrainian attack, consider it a performative strike, a demonstration of capability and a declaration of intent: 'don't think Moscow is safe', Russia specialist and security analyst Mark Galeotti wrote on Twitter.Some commentators described it as a humiliation for Russia, drawing comparison with a 1987 incident when a young West German pilot, Mathias Rust, evaded Soviet air defences and landed a small plane on Red Square.COULD IT BE A RUSSIAN 'FALSE FLAG' OPERATION?Some Western analysts said it was possible that Russia might have staged the incident itself in order to pin the blame on Kyiv and justify some kind of crushing response. The aim could be \"to make Ukraine look reckless, either to weaken Western support or try to shore up Russian domestic support\", said Phillips O'Brien of the University of St Andrews.",
        "James Nixey of London's Chatham House think tank said that, if it was a \"false flag\" operation, \"it reeks of desperation ... And it's a high-risk strategy likely to be exposed\".WHAT WILL THE U.S. MAKE OF IT?The Biden administration has poured cash and weapons into Ukraine to help it defend against Russia's invasion, but would likely be nervous of the unpredictable consequences that any Ukrainian attack on the Russian capital could entail. The White House said it had not been able to verify the Russian claim of a Ukrainian attack, and U.S. Secretary of State Antony Blinken said Russian assertions should be taken with a \"very large shaker of salt\".WHAT IS THE SIGNIFICANCE OF THE TIMING?The incident comes at a moment of high tension and a potential turning point in the war, as Ukraine prepares to mount a long-anticipated counter-offensive.Perhaps more immediately, it coincides with preparations for Russia's Victory Day holiday on May 9, marked with a military parade across Red Square, under the Kremlin walls.Some of the videos of the incident showed spectator stands that had already been put up for the parade, directly over the wall from the Senate. Security for the parade had already been tightened.WHAT HAPPENS NEXT?The statement from Putin's office pointed to a significant response. Former Russian president Dmitry Medvedev said it was time to \"physically eliminate Zelenskiy and his clique\", and parliament speaker Vyacheslav Volodin called for the use of \"weapons capable of stopping and destroying the Kyiv terrorist regime\".",
        "Western analysts questioned how far it was possible for Russia to escalate, given the death and destruction it has already inflicted on Ukraine with mass missile strikes.Matthew Ford, associate professor at the Swedish Defence University, said further strikes on Ukrainian energy infrastructure would be less effective now that spring has arrived, and that disruption to grain supplies would hurt Russia's own allies. He also questioned whether Russia was capable of taking out Zelenskiy. \"The closest they got was last spring. How they could pull it off now - that seems very unlikely,\" he said in a telephone interview.(Reporting by Reuters; Writing by Mark Trevelyan; Editing by Kevin Liffey)"
    ]
}