{
    "articleURL": "/sport/football/article-12049877/Promotion-winning-Wrexham-begin-monster-four-day-celebrations.html",
    "content": [
        "The side recorded a history-making 111-point season in the National League All set to move up to League Two, Wrexham celebrated their win in Sin CityThe first night of a packed four-day itinerary kicked off at the MGM Grand Wrexham's promotion winners have got a first taste of the high life in Las Vegas as part of their 'monster' party holiday, three days after celebrating the club's move up to League Two with an open-top bus parade. ",
        "The National League champions have been gifted an all-expenses-paid four-day trip to celebrate their record-breaking 111-point season by their co-chairmen Ryan Reynolds and Rob McElhenney. And after jetting off to Sin City on Thursday, the festivities have well and truly begun, with videos emerging of players on the dancefloor of a popular nightclub on the Vegas strip.  The team landed at the city's Harry Reid International Airport yesterday afternoon, and throw-in maestro Ben Tozer shared pictures of the group's stop-over in San Francisco ahead of reaching their final destination, gently mocking the group's matching outfits - Wxm Clothing line by star striker Ollie Palmer - by taking a picture that he captioned 'school trip'. ",
        "Wing-back Jacob Mendy was snapped enjoying the flight in A-list style, wearing a pair of dark glasses, and he later captured the team dressed up for the evening ahead passing through the Mandalay Bay Hotel. The players started their evening at Hakkasan, a modern Chinese restaurant at the MGM Grand hotel, where prices for the signature Phoenix menu start at $148 and the eatery's standout dish, the Signature HK Peking Duck, can be ordered with a side of Tsar Nicoulai Reserve Ossetra caviar for $188. Bottles of champagne, no doubt ordered to toast their successes, cost upwards of $200. ",
        "After dining well, the National League-topping side moved onto Hakkasan nightclub where they were greeted by an enormous presentation commemorating their successes. Huge Welsh flags were waved and the club's name was spelled out in neon lights as the champions were welcomed into town. Later, centre backs Eoghan O'Connell and Tozer shared a brief snippet of themselves on the dance floor. Phil Parkinson's side danced the night away to music from DJ James Hype, on only the first night of their planned getaway. Paul Mullin shared that the idea for a trip away to celebrate winning the league grew as they moved closer to their goal. Speaking to GQ, the 47-goal striker said: 'It became a thing where if we won the league, we'd get a holiday. So we're off to Vegas.'",
        "'Ryan and Rob told us to leave our cards at home, they're sorting the lot. They sent us a full itinerary just now. 'Part of me doesn't want to go, I might be dead by the end of it! But I'd never go to Vegas by my own accord, so I'm buzzing for it.' But one member of the history-making side did not make the trip: manager Parkinson, who told Sky News that he hopes his players enjoy their deserved reward but 'come back in one piece'. ",
        "Wrexham's increasing popularity in the US, spurred on by their Hollywood owners and given a boost by Disney+ docu-series 'Welcome to Wrexham', will have meant the champions receive a heroes' reception on American soil. The side will return to the country in July for a string of friendlies against Chelsea, Manchester United, LA Galaxy II and one more team yet to be confirmed.   "
    ]
}