{
    "articleURL": "/news/article-12050897/Chick-fil-budget-hack-score-cheaper-chicken-sandwich-frosted-lemonade-drink.html",
    "content": [
        "Chick-fil-A fans have been missing out on an easy money-saving loopholeBy ordering a kid's meal and an extra bun, the foodie made a modified sandwichThe custom combo comes out at $5.39, a big saving on the regular promo mealChick-fil-A fans looking to dine out on a budget are being urged to try combo meal hack that has taken the internet by storm. ",
        "Food blogger HellthyJunkFood has amassed a huge following revealing how to save big on food, with his latest offering showing how to get a cut-price meal at the fan favorite chicken franchise. By ordering a two count Chick-n-Strips Kid's Meal, customers also get a small side item, a kid's size drink and a lucky prize. Alongside waffle fries and a frosted lemonade, foodies can create a bargain chicken sandwich meal by simply ordering an extra bun and pickles with their order. Coming out at $5.39, the custom meal is $2 less than a regular Chick-fil-A combo - although the saving requires considerable effort, and a willingness to get your fingers greasy. ",
        "The viral food blogger also added an extra trick to optimizing his kid's meal hack, as he swapped out the prize with a vanilla soft-serve ice cream cone. 'Guys, if you get the Chick-fil-A combo, you're getting ripped off,' he said. The video, which has amassed over 179,000 views since it was posted Tuesday, divided some viewers, while many praised the 'genius' money-saving tip. 'OMG I needed this hack,' said one commenter. Another had a recommendation of their own: 'The lemonade with no ice is key, because they always give you like 80% ice in there.' Chick-fil-A notes on its website that its prices vary based on location, and some viewers said the hack didn't reap the same savings as promised. ",
        "One disgruntled customer said the trick rang up at $7.79, while others said their prices varied from $6.39 to a whopping $8.73. 'Chick-fil-A is a treat when I get it and I will not hack it. Want the real deal,' added a customer. 'Damn now I’m hungry.' 'The kids meal alone is $7', complained another. ",
        "Capitalizing on using chicken strips from the kids meal to make the regular sandwich is certainly the main tactic for this trick. But in a follow up video, the food blogger also revealed how to make the most of your lemonade. By using the soft-serve ice cream and kids' lemonade from the budget combo, customers can upgrade their drink by pouring the ice cream to make a frosted lemonade shake. By making the most of the $5.39 kids meal combo, people can enjoy the makeshift frosted lemonade without paying $3.75 for the real thing. "
    ]
}