{
    "articleURL": "/femail/article-12051941/Jenna-Bush-Hager-reveals-gross-comment-mom-Laura-wedding-night.html",
    "content": [
        "Bush Hager, 41, recalled the mortifying moment on the Today show Thursday She explained her sister had slept in her room the night before her wedding Her mom came in singing, 'You’re getting married! Let’s go change the sheets!'Jenna Bush Hager has revealed the 'gross' comment her mother, former First Lady Laura Bush, made about her bed sheets before her wedding night. ",
        "The Today host, 41, recalled the cringe-worthy moment while she and her co-star Hoda Kotb were chatting about Gwyneth Paltrow's candid interview on the Call Her Daddy podcast in which she dished about her famous exes. The conversation inspired them to ask each other if they ever 'kiss and tell.'  'I try not to. But I’ve been married to one person for a long time, so I don’t kiss and tell about that relationship,' Bush Hager said of her husband Henry Hager. ",
        "The couple had tied the knot nearly 15 years ago at the Bush family's Prairie Chapel Ranch near Crawford, Texas, on May 10, 2008. A photo of their wedding was then shown on the screen, prompting the former first daughter to reminisce about her big day.  'Oh, thank you for putting up my wedding photo,' she joked. 'That was the night it all happened, y’all! Just kidding.' Bush Hager went on to share how her mother mortified her and her twin sister, Barbara Bush, with her sexual innuendo the morning of her wedding. 'My sister and I spent the night the night before [my husband and I] got married, and my mom came in [singing], \"You’re getting married! Let’s go change the sheets!\" And Barbara goes, \"Eww gross, mom! This isn’t The Other Boleyn Girl!\"' she recalled. ",
        "'I won’t even say what she said after that,' she added, laughing. Bush Hager has never divulged when she had sex for the first time, but she recently opened up about her teenage fears that she wouldn't be able to 'save' her virginity.She had Kotb and their guest Amy Poehler in hysterics on the morning show when she recalled her embarrassing diary entries. ",
        "'I had [an entry about] looking at myself in the mirror and hoping I’d be able to save my virginity,' she admitted, unable to hold back her laughter. 'I was just worried in ninth grade that I wouldn’t have the wherewithal to hold it, you know?' Bush Hager explained, shrugging her shoulders. Poehler, 51, couldn't hide her amusement, joking, 'Your journals were like, \"You can do it! You can hold it.\"''What if you’re not able to do it, Jenna?' the former first daughter chimed in, prompting even more laughter. Bush Hager, who was born and raised in Texas, wrote the cringe-worthy diary entry years before her father, former President George W. Bush, took office in 2001. ",
        "'Who knows what happened,' she said, without going into further detail, 'but it was an embarrassing post to look back at.'Bush Hager went on to meet her future husband, Henry, during her father's 2004 presidential campaign. ",
        "In 2022, she detailed how Henry tried to sneak out of the White House after spending the night with her early on in their relationship. ",
        "'My parents were traveling and I was staying there,' she explained. 'We’d gone out to the bars and, like all relationships do, it reached a certain level.'Bush Hager said her future husband was in a panic the next morning.  'Henry said he woke up and he looked around and he was, like, 'Aaaaaaaah\" because he worked for my dad,' she explained, but she wasn't bothered about her then-boyfriend leaving in his clothes from the night before. She remembered telling him, 'Well, have fun...bye!' 'I didn't care,' she said.  Bush Hager later elaborated on the story during an appearance on Watch What Happens Live with Andy Cohen. 'Well, he was caught. That was the problem,' she joked. 'But as [Henry] says, [the Secret Service] are supposed to keep people from coming in. They're not looking for people that are going out, especially like a 26-year-old in the night-before clothes. 'He was caught, but their job wasn't to make sure I wasn't hooking up.' The couple, who shares three children together, will be celebrating 15 years of marriage this month.  "
    ]
}