{
    "articleURL": "/tvshowbiz/article-12061611/CHRISTOPHER-STEVENS-reviews-nights-TV.html",
    "content": [
        "Eurovision Calling: Jason And Chelcee’s Ultimate Guide ****",
        "Andrew: The Problem Prince **Prepare to feel 13 per cent better. According to social scientists at Imperial College London, nations that take part in Eurovision enjoy a measurable mood boost for days afterwards, even if they come last.For the UK this year, 13 per cent sounds like a serious underestimate. With a week-long build-up to the song contest on Saturday, climaxing in the mega-budget celebration in Liverpool, we ought to be walking on sunshine.Compound that with national euphoria in the wake of the Coronation and Britain might very soon be the happiest country in the world. Eurovision spirit is reaching parts and people usually oblivious to the joys of the event. Comedian Jason Manford admitted, in Eurovision Calling: Jason And Chelcee’s Ultimate Guide (BBC1), that before chancing to switch on the show last year, he’d never even heard Sam Ryder’s entry Space Man.But he has succumbed to the addictive optimism of the competition now. By the end of the hour, he was on stage in a gay pub in Manchester, belting out Conchita Wurst’s Rise Like A Phoenix, the winning anthem from 2014.",
        "Eurovision gives everyone a licence to be camp for a night. Sequins and feather boas are not compulsory but, if they make you feel 13 per cent better, why not? You might suppose it started with Abba, and the neon jumpsuits Anni-Frid and Agnetha wore for Waterloo in 1974. ",
        "But a clip unearthed by Jason and co-presenter Chelcee Grimes, of the UK’s 1968 entry Congratulations, suggests the real godfather of glam was Cliff Richard. Our eternal bachelor boy wore a suit with a ruffled shirtfront that was worthy of Austin Powers.This year, we’re represented by Mae Muller, with a cynically formulaic number called I Wrote A Song. Jason chatted with her over a pot of tea, though he avoided asking the Corbynista songster any tricky questions, such as, ‘You posted on Twitter that you “hate this country” — don’t you think it’s hypocritical to represent us at Eurovision?’Mae has previously said that it’s crucial she does the competition, because, ‘a lot of young women follow me and it’s important that they can see they can have a voice’.Sadly, she doesn’t have much of a voice herself — it’s thin and slightly nasal, not the sort of soaring, theatrical sound that traditionally does well at Eurovision. This year’s winner is more likely to be Sweden’s Loreen, who triumphed in 2012 with Euphoria. But even she might struggle against Ukraine’s entry, Heart Of Steel by Torchii. Public support could well mean that Ukraine matches Ireland, Israel, Luxembourg and Spain, by winning two years on the trot.We can be sure of one thing. In the Kremlin, no one will dare to sport sequins and feather boas.",
        "Emily Maitlis didn’t go that far in celebrating her Newsnight interview with Prince Andrew, which ended his career as a working royal. But there was a strong note of gloating about the second part of Andrew: The Problem Prince (Ch4). ",
        "Blurred reconstructions showed Emily arriving at Buckingham Palace, clutching a shoulder bag with a change of clothes and her notes. The brand logo on the bag was Sweaty Betty — a sarky reference to the prince’s claim that an overdose of adrenaline during the Falklands War left him unable to sweat.Remarkably, she said he’d already told her about his perspiration deficit during conversations before the interview.After filming was done, he invited her to join him for a film. Thursdays are cinema nights at the palace, apparently. Emily made her excuses and left."
    ]
}