{
    "articleURL": "/wires/pa/article-12060093/Mark-Hughes-delight-Bradford-hold-champions-Orient-secure-play-spot.html",
    "content": [
        "Mark Hughes expressed his delight after Bradford booked their place in the League Two play-offs by fighting back to draw with champions Leyton Orient.",
        "The Bantams got the point they needed to make sure of a top-seven finish with a 1-1 draw against Orient in front of a 22,576 crowd – the biggest for a league game at Valley Parade this century.Right-back Brad Halliday scored his first goal since December 2020 to cancel out Jordan Brown’s opener for the visitors.Bradford will now face Carlisle in the play-off semi-finals.Hughes said: “We’re obviously pleased because it was a difficult fixture for us. We were up against the champions and everybody saw they are champions for a reason.“They are an outstanding team at this level so going up against them in a game we still needed to get something out of looked a difficult task prior to kick-off.",
        "“It wasn’t one that was beyond us but we obviously had to do the right things.“We had the setback of the initial goal going against us but came back really quickly, which was important.“I felt then it was a game between two evenly-matched teams who didn’t give any quarter to each other.“We’re in a play-off situation. We still have an opportunity to get out of this league and that was the goal before the season started.”Bradford went close after four minutes as Andy Cook’s looping header was tipped on the bar by Lawrence Vigouroux.",
        "Then Romoney Crichlow stabbed wide from Sam Stubbs’ flick-on before Jamie Walker fired into the side-netting and Vigouroux again saved well from Cook.But it was Orient who struck first after 41 minutes, Bradford failing to deal with a corner before Brown swept home from 10 yards.The home side’s response was rapid to equalise two minutes later as Halliday’s volley took a heavy deflection beyond Vigouroux.Orient manager Richie Wellens said: “The last week has been really difficult keeping myself, the staff and the players motivated.“But I thought we came here and put in a good performance and kept Bradford honest. If they didn’t score so quickly after us, I think we could have dominated the game and possession.“Credit to them because they have responded well.“The last 15 minutes was played out because the result was OK for both. But you have to respect the competition we’re in and we did that.“Bradford have earned their play-off position. Hughesy was a hero of mine as a Man United fan and I wish him well. They are a big club.“As for us, we’ve enjoyed today and we’re going to enjoy our break in Marbella even more.“After that we need to come back and re-engage and plan for our future.”"
    ]
}