{
    "articleURL": "/tvshowbiz/article-12058355/Vince-Colosimo-spotted-cycling-streets-Melbourne-puffing-cigarette.html",
    "content": [
        "Vince Colosimo hit the streets of Melbourne on his bicycle on Saturday.",
        "The troubled actor, 56, smoked a cigarette while zooming along the bike lanes in a black hoodie, dark jeans and sunglasses.The sighting comes as the Chopper star faces the prospect of returning to court to contest claims he was issued with 169 traffic fines while banned from driving.He is accused of racking up a whopping $65,215 in unpaid fines dating back to 2012.It was reported in March that Fines Victoria would be applying for an enforcement warrant against Colosimo in the Melbourne Magistrates' Court. ",
        "Officers could be granted the power to search for and seize his property or vehicles to sell and settle the outstanding debts.A $60.20 administration fee will also be added to his outstanding fines.In October, Colosimo was forced to make an embarrassing exit from the Melbourne Magistrates' Court, rushing down a laneway in an effort to avoid a media pack. ",
        "The Wog Boy Forever star had pleaded guilty to drug and unlicensed driving and failing to give his real name to police.The ugly 2021 incident during Melbourne's harsh Covid-19 lockdowns saw him convicted and fined again - adding another $2,500 to his growing tally of fines.Film and legal sources close to Colosimo told Daily Mail Australia the actor disputed the number and total dollar values of the fines he allegedly racked up.",
        "'I don't even think it's possible to run up that many fines... it sounds extraordinarily large to have that many fines,' one source said.Colosimo had been in court over his well-publicised drug-driving charges, which saw him pretend to be his twin brother when pulled over by police.Word of the unpaid fines appeared to come as a shock to both Colosimo and his lawyer George Vassis, who quickly turned around to address his client seated behind him.Prosecutor Bianca Moleta told the court Colosimo had lost his licence again twice through demerit points while disqualified for fines incurred and issued to him in recent years while his licence was cancelled.",
        "'Although he wasn't charged, that's a reflection of the Traffic Camera Office not essentially communicating with Victoria Police, but those are recorded on his demerit point history after his licence was cancelled,' she said.A source told Daily Mail Australia that Colosimo maintained he had not incurred the traffic fines himself because he had loaned his Peugeot to a 'mate'.Colosimo and his legal team are said to be in the process of working through the fines to ascertain not only how they accumulated, but who might have been behind the wheel and when.The court heard Colosimo blames his mate for incurring the lion's share of the fines.",
        "It is understood Colosimo further claims most of the notifications for the alleged infringements were sent to old addresses after several home relocations and Covid-19 disruptions at VicRoads."
    ]
}