{
    "articleURL": "/wires/ap/article-12053213/Sale-fans-10-Red-Sox-Phillies-7th-straight-win.html",
    "content": [
        "PHILADELPHIA (AP) - Chris Sale struck out 10 in six innings, and the Boston Red Sox beat the Philadelphia Phillies 5-3 on Friday night for their seventh consecutive victory.",
        "The game was delayed for about 10 minutes in the first inning when a spectator fell over a protective railing and into the Red Sox bullpen while reaching for a baseball.Boston rookie Masataka Yoshida extended his hitting streak to 15 games. Kiké Hernández and Enmanuel Valdez each had two hits and drove in a run.Phillies slugger Bryce Harper was saluted with a 25-second standing ovation prior to his first at-bat. It was the slugger's first game in Philadelphia since he had Tommy John surgery on his right elbow in the offseason. He was 1 for 4 with a single and scored a run.The defending NL champs have dropped five in a row to fall three games under .500. Nick Castellanos had two hits, including a double, and an RBI for the Phillies.The 34-year-old Sale (3-2) was charged with three runs and seven hits. The seven-time All-Star is rounding into form after he was hampered by injuries in the previous two seasons.",
        "\"He's trending in the right direction,\" Boston manager Alex Cora said. \"He wants to compete. He wants to dominate. Today was a great day for him.\"Boston grabbed a 5-3 lead with two runs in the sixth against Zack Wheeler (3-2).Jarren Duran doubled and Hernández singled to put runners on first and third with no outs. Triston Casas flew out to the wall in center, scoring Duran and moving Hernández to second. Valdez then hit an RBI single off Connor Brogdon, who relieved Wheeler.",
        "Wheeler gave up four earned runs and seven hits with five strikeouts and no walks.Kenley Jansen pitched out of trouble in a scoreless ninth for his seventh save.FAN FALLSThe fan, who was wearing a Phillies jersey, tumbled one level from an open concourse into the Boston bullpen in right-center field. He was taken to the trauma center at Thomas Jefferson University Hospital, according to medical personnel on the scene.The injury occurred when the fan reached over a railing in an attempt to retrieve a ball thrown his way, the Phillies said in a statement. The Phillies said the fan was conscious and responsive upon leaving the ballpark. His injuries were not disclosed.\"It was definitely scary for a lot of us,\" Boston reliever Josh Winckowski said. \"We were all pretty worried, feeling uneasy.\"Winckowski said he was concerned that the fan might have died from the fall. Only after getting a call saying that the fan was conscious and responsive were Winckowski and the Boston relievers able to relax.HYPED FOR HARPERPhillies fans gave Harper a loud ovation and chanted \"M-V-P! M-V-P!\" before Harper´s at-bat. He went on to strike out swinging against Sale.\"Real cool moment,\" Harper said. \"I enjoyed it.\"TURNER TIMED OUTBoston´s Justin Turner was called out on strikes in the fifth inning because he was not ready to bat with eight seconds remaining on the pitch clock, as is required under Major League Baseball´s new pace-of-play rules. Turner disputed the call with plate umpire Doug Eddings, though replays confirmed Eddings´ ruling that Turner was not ready until seven seconds showed on the pitch clock. Afterward, Turner said he had no quarrels with the call.",
        "STILL STREAKINGYoshida is batting .433 during the streak, which continued with a second-inning single. The Japanese outfielder, who signed a five-year deal with the Red Sox in December, played against his baseball idol Harper for the first time.TRAINER´S ROOMRed Sox: Yoshida was removed from the game after getting hit by a pitch on the right knee in the ninth. Cora said Yoshida was OK but would get a day off on Saturday. ... RHP Kutter Crawford (left hamstring strain) was placed on the 15-day injured list. He left Wednesday´s 8-3 win over the Blue Jays. RHP Kaleb Ort was recalled from Triple-A Worcester to fill Crawford´s spot.Phillies: LHP Ranger Suárez (left forearm strain) is on target to return to Philadelphia´s rotation if all goes well with a minor league rehab start on Sunday. In preparation, LHP Matt Strahm is being moved to the bullpen. Strahm is 2-3 with a 3.38 ERA in seven appearances, six starts.UP NEXTRed Sox RHP Corey Kluber (1-4, 6.44 ERA) opposes LHP Bailey Falter (0-5, 5.01 ERA) on Saturday night.___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}