{
    "articleURL": "/wires/pa/article-12054593/Wolves-edge-past-Aston-Villa-survival-hopes-major-boost.html",
    "content": [
        "Resilient Wolves edged derby rivals Aston Villa 1-0 to end any lingering fears of relegation from the Premier League.",
        "Toti Gomes’ first Wolves goal secured a fourth straight home win and leave them 10 points clear of the Premier League relegation zone.It would now take a staggering set of results to send Wolves, who are 13th, down on 40 points.Villa’s European hopes suffered a potentially fatal blow as it leaves them eighth, a point behind Brighton – who they host on the final day – having played three games more.That they were even in European contention remains a tribute to the work Unai Emery has done since replacing Steven Gerrard in October.Villa do at least face Tottenham, Liverpool and the Seagulls – those immediately above them – in their final three games but any hopes of Europe are fading.",
        "Smarting from the 6-0 thumping at Brighton last week, Wolves’ heaviest league defeat in 16 years, the hosts went to remedy the result early.Villa actually enjoyed a brighter start in the opening exchanges but it was Wolves who grabbed a ninth-minute winner.Ruben Neves was forced to wait to take his corner but when he did the midfielder picked out Toti to crash in a header off the bar from 12 yards – just his second career goal.Villa, who lost a 10-game unbeaten run with a 1-0 defeat at Manchester United last weekend, responded with Jose Sa turning Emi Buendia’s strike wide.",
        "The visitors remained the aggressors but lacked the sharpness which had propelled them up the league since Emery’s arrival. It allowed Wolves to remain comfortable at the back, despite Villa dominating possession.Slowly, though, Emery’s side began to find space and Ollie Watkins’ acrobatic effort dropped wide. It was a warning for Wolves and they escaped again soon after when Jacob Ramsey’s cross dropped for Watkins seven yards out but the striker could only head straight at Sa.Wolves’ organisation and concentration was crucial and Craig Dawson was alert to halt Buendia as Villa probed for a leveller but there was still the occasional gap for the hosts to exploit.Just before the break Costa teed up Matheus Cunha to plant a half volley over from the edge of the box then, less than two minutes after the re-start, Pedro Neto found Costa who was denied by Emi Martinez.Chasing four successive top-flight home wins for the first time since 1975 Wolves at least begun the second half with more attacking purpose having spent the majority of the first frustrating Villa.Ashley Young swept a shot wide but Villa could not find the same spaces as before and needed Matheus Nunes to get in a tangle in front of goal from Neto’s cross not to concede a second.",
        "But, with 19 minutes remaining, the visitors blew their best chance to grab a point when Douglas Luiz’s free kick dropped for Mings six yards out, only for the defender to volley over."
    ]
}