{
    "articleURL": "/sport/football/article-12056477/Cambridge-United-2-0-Forest-Green-Rovers-Hosts-STAY-League-One-season-comfortable-win.html",
    "content": [
        "Cambridge United leapt to League One safety with a 2-0 win over relegated sideFirst half-goals for the hosts came courtesy of Harrison Dunk and Sam Smith Forest Green Rovers have long been condemned to League Two next seasonMark Bonner welled up with tears after his beloved Cambridge side pulled off one of the EFL's great escapes.",
        "Cambridge had been embedded in the bottom four since mid-January, and had shown little signs of clawing their way out of trouble until they grabbed 13 points in a hectic April schedule. It was their best monthly points return of the season.Even then, United went into this last day drama with matters out of their hands. A win for either of their relegation rivals, Morecambe or MK Dons, would have made their 2-0 victory over Forest Green Rovers academic.'What a way to do it, the last game at the end of a really brutal season,' admitted Bonner, who is still only 37. 'It's unbelievable, isn't it? It's so good that we are back in this league next year. It's horrible when you're not in control of it, but from where we were a few weeks back to where we are today is great.'Look at all the people here. There were four sides of the stadium full of Cambridge fans. I was a bit emotional. The whole place was refreshing their Twitter every ten seconds. Whether we were lucky to be in a season where 46 points keeps you in the league, I couldn't care less. It's always a challenge for us at this level.'",
        "The home players were buoyed by a standing ovation from the U's supporters as they left the pitch after their pre-match warm-up.",
        "And the party atmosphere was soon in full swing on 25 minutes after Harrison Dunk's far post header crept over the line, condemning the visitors, who were already relegated, to an unwanted record of failing to keep a clean sheet on the road in the league all season.Then the roof came off the Abbey Stadium when Sam Smith's Marco van Basten-esque volley put the game to bed eight minutes before the break.David Bowie's 'Heroes' blasted out of the rusty tannoys as the players left the pitch at half-time, perhaps a little prematurely seeing as MK Dons and Morecambe were only one goal away from swapping places with Cambridge.The second half petered out with Bonner's men in total control. Then confirmation of Morecambe's defeat at Exeter, prolonged by an agonising 14 minutes of stoppage time, sparked a good-natured pitch invasion for jubilant Cambridge fans.Bonner can now look forward to a third crack at the third tier next term. He added, 'You grow as a club and you get stronger when you have tough times. You're inhuman of you don't doubt yourself when things get difficult and tough. But we've built up resilience and have got a strength here, and it's paid us back massively.'Rovers finished their disastrous campaign 19 points from safety, and manager Duncan Ferguson admitted, 'We've got a rebuild on our hands and we need to make sure we're competitive, because there are already teams ahead of us.'",
        "Cambridge (4-2-3-1): Mitov 6; L Bennett 7, R Bennett 7, Morrison 6 (Okenabirhie 7),Dunk 8; Digby 7, McGrandles 7; Brophy 7, Lankester 8 (Thomas 6), Knibbs 7; Smith 8Substitutes not used: Mannion, Haunstrup, O'Neil, Ironside, OkedinaGoals: Dunk 25, Smith 37Forest Green Rovers (4-3-3): Doohan 7; Bernard 6 (O'Keeffe 6), Casey 6, Cooper 6, Robson 6 (Sanniola 6); Brown 6 (Peart Harris 5), Bunker 6, McGeouch 6 (Savage 6); O'Brien 5 (McKenzie 5), Omotoye 5, Garrick 6Substitutes not used: ThomasBooked: Bunker, CooperReferee: Ben Toner 8Attendance: 7,493"
    ]
}