{
    "articleURL": "/news/article-12049627/Former-Space-Force-blasts-Navy-using-drag-queen-help-boost-recruitment.html",
    "content": [
        "Matthew Lohmeier questioned who the Navy hoped to reach with its new spokesperson, Yeoman 2nd Class and drag queen Joshua KelleyLohmeier was in charge of the 11th Space Warning Squadron in Colorado before he was removed from his post for denouncing critical race theory on a podcastHe said senior Navy officials likely didn't like the use of Kelley as a recruitment spokesperson, but that they were unable to express their true feelingsA former Space Force lieutenant booted from his post for lamenting the proliferation of critical race theory in the military has spoken out about the drag queen the United States Navy is using as a recruitment ambassador.",
        "Matthew Lohmeier, formerly in charge of the 11th Space Warning Squadron in Colorado until he was ousted in 2021 after denouncing CRT and marxism on a podcast, questioned who the Navy thought it was going to reach with its latest recruitment tactics.'I have to wonder who it is that our senior military leaders, in fact, think they're appealing to in the recruiting process by hiring a drag queen as their digital ambassador,' Lohmeier told Fox News in a recent interview.He was referring to Yeoman 2nd Class Joshua Kelley who was named a 'Digital Ambassador' for the Navy as part of a pilot program that started in November and ran through March.The decision to use the drag queen as an ambassador has drawn a strong reaction as people criticize the move.  ",
        "Kelley goes by the stage name 'Harpy Daniels' and has a strong following on social media, including TikTok, with 60,800 followers and 1.3 million likes. Kelley is also on Instagram with nearly 9,000 followers. In the videos, Kelley often starts out in uniform, and then reappears as Harpy Daniels. The non-binary drag queen dances and often shares an inspirational message about being an LGBTQ+ sailor.Lohmeier told Fox News he was vexed by the Navy's decision, and predicted that Kelley's position as a spokesperson would not help recruitment.",
        "He said most service members 'believe in the Western nuclear family,' and are wary of letting children be exposed to the likes of drag queens.The former lieutenant said the situation was merely another example of leftist agendas working their way into the armed services.'We've known for the past couple of years during the Biden administration, this has been taking place more and more,' he said. 'What's surprising is that senior military leaders continue to push an agenda like this despite the fact that it's hurting our recruiting efforts and it's hurting our retention.'He added there were likely senior members of the military who did not like the use of Kelley, but were unable to speak out leaving it up to 'late' members of the forces to voice those opinions.Some government officials have spoken out against Kelley's position, however. A group of 14 Republican senators wrote a letter Wednesday to Secretary of the Navy Carlos Del Toro asking why the Navy enlisted a 'TikTok drag queen' to beef up recruitment numbers. Sens. Ted Cruz, Rick Scott, Marco Rubio and others told Del Toro that 'we are concerned about both the promotion of a banned app and behavior that many deem inappropriate in a professional workplace.'",
        "In the letter, the Republicans first took issue with the Navy seemingly endorsing TikTok, with the choice of Kelley as a 'Digital Ambassador.' ",
        "They pointed to the No TikTok on Government Devices Act, which President Joe Biden signed into law in December, and which bars the app from being downloaded onto U.S. government devices due to its Chinese owner.'The bottom line is that the Navy should not be promoting use of TikTok, an app banned on Department devices, on the personal devices of servicemembers or its \"ambassadors,\"' the letter stated. The Republicans then moved on to the Navy's choice to make a drag queen a 'Digital Ambassador.' 'At a time when our nation's military is facing a recruiting crisis, it is as important as ever to reach broader swaths of the eligible population - but not at the cost of privacy, security, or professionalism,' the Republicans argued. In the letter, they ask Del Toro if the Navy endorses drag shows.'Would the Navy enlist burlesque dancers or exotic dancers to reach possible recruits?' the senators ask. 'Such activity is not appropriate for promotion in a professional workplace or the United States military,' they add.The senators then asked Del Toro a number of questions about the ambassador program, including whether any federal funds were spent. They gave the Navy secretary until May 24 to respond. ",
        "Kelley joined the Navy in 2016 and gave a drag performance for the first time as a sailor during a deployment in 2018. ",
        "In a post from November, when Kelley was named a 'Digital Ambassador,' the drag queen wrote that sharing drag with fellow sailors 'has been a blessing.' 'This experience has brought me so much strength, courage and ambition to continue being an advocate and representation of queer sailors!' Kelley wrote. 'Thank you to the Navy for giving me this opportunity! I don't speak for the Navy but simply sharing my experience in the Navy! Hooyah, and let's go Slay!' the drag queen added. LGBTQ+ members of the military have fought for decades to serve openly. In 1993, President Bill Clinton signed 'Don't Ask, Don't Tell,' which barred gay and lesbian Americans from serving openly, but was supposed to prohibit discrimination. That policy got overturned by President Barack Obama and Democratic majorities in Congress in 2010. In 2016, under the Obama administration, the ban on transgender service members was lifted. However, in July 2017, then-President Donald Trump reintroduced the ban via tweet. President Joe Biden reversed the ban on his fifth day in office in January 2021. More broadly, Republicans have continued to target the LGBTQ community with new laws. In 2023, the American Civil Liberties Union tracked 471 anti-LGBTQ bills being pushed around the country. "
    ]
}