{
    "articleURL": "/news/article-12040541/Man-jailed-fatal-crash-Dorset-killed-grandmother.html",
    "content": [
        "Shane Bovey, 41, of Yeovil, was jailed at Bournemouth Crown Court yesterdayHe struck three generations of same family in Mosterton, Dorset, in FebruaryA drunk driver who acted like a 'wild animal' when he knocked down and killed a grandmother and left her daughter and grandson seriously injured has been jailed for 14 years.",
        "Shane Bovey, 41, of Yeovil, Somerset, was travelling at more than twice the speed limit in a Mercedes car following an all-day drinking session when he struck three generations of the same family in the Dorset village of Mosterton on February 8.Nicole Bowden, her daughter Emily Fox-Williams and her 11-month-old son, had just left their home to attend a birthday celebration at a pub at the time of the collision.",
        "Mrs Bowden, 48, suffered fatal injuries as she was crushed against a brick wall. ",
        "Nicole Bowden's father Sidney Fox told the court of the impact the crash has had on him.'The law does not have adequate powers for the taking of such a beautiful life, a wonderful wife, mother, grandmother and daughter.'They were just 30 metres from their homes. The scene looked like a war zone - a 3ft thick wall broken down and a burnt out car. All this in a 30mph zone. It wasn't the car that was out of control, it was the person driving it who had no control.'He has broken several laws and destroyed a large part of my family. As well as the loss of Nicole, Emily, my poor granddaughter, is going through a living death, still in a critical condition in hospital, leaving a son without his mother.'I feel so angry, I wish it was him who was in this condition, not Emily. Every time I see her I hope and pray the damage done is not irreversible.'He is a wild and lawless animal, out of control. I hope he spends a long time in prison so he cannot destroy another family's life.'",
        "Miss Fox-Williams, 24, was thrown 98ft and suffered such severe head injuries her family say she is 'going through a living death' in hospital three months on. Her brain injury is likely to lead to lifelong disability.Her baby son was in a pushchair which was also thrown the same distance as his mother. He suffered a fractured skull but has since recovered.The first person on the scene was Mrs Bowden's husband, Matthew Bowden, who moments earlier had been overtaken by Bovey at up to 80mph in a 30mph zone.Mr Bowden was driving his 16-year-old son home from football training at the time.He first went to the aid of an unconscious Bovey who was lying next to the blazing Mercedes CLK 320 car before realising it was his family he had hit.He comforted his dying wife at the scene, which was described like a 'war zone'. After coming round, Bovey then fled the scene before later being arrested.He pleaded guilty to causing death by dangerous driving, two offences of causing serious injury by dangerous driving and an offence of aggravated vehicle taking.Bovey, who has 44 previous convictions for 85 offences, was yesterday jailed for 14 years at Bournemouth Crown Court.Mrs Bowden and Miss Fox-Williams' devastated family told the court of the impact the crash has had on them.",
        "Mrs Bowden's father Sidney Fox said: 'The law does not have adequate powers for the taking of such a beautiful life, a wonderful wife, mother, grandmother and daughter.'They were just 30 metres from their homes. The scene looked like a war zone - a 3ft thick wall broken down and a burnt out car. All this in a 30mph zone. It wasn't the car that was out of control, it was the person driving it who had no control.'He has broken several laws and destroyed a large part of my family. As well as the loss of Nicole, Emily, my poor granddaughter, is going through a living death, still in a critical condition in hospital, leaving a son without his mother. ",
        "'I feel so angry, I wish it was him who was in this condition, not Emily. Every time I see her I hope and pray the damage done is not irreversible.'He is a wild and lawless animal, out of control. I hope he spends a long time in prison so he cannot destroy another family's life.'Jasmine Williams, Mrs Bowden's other daughter and Miss Fox-Williams's sister, described how she said goodbye to her mother in hospital.She said: 'I held her right hand as it was the only bit of her I could recognise. She didn't look like my mum anymore. Her beautiful face was so bruised and swollen. I held on so tightly to her hand right until the very end.",
        "'The last ten weeks have been agony, not knowing if you're going to lose your sister as well as your mum is torture.'Thankfully Emily is still with us but she will never be the same again. In a way I'm glad my mum is not here to see Emily in this state, it would kill her anyway.'She also said she is due to get married in June, with her sister as bridesmaid and nephew as pageboy. She added: 'The thought of getting married without Emily and mum there haunts me and I'm not sure if I will be able to do it.'",
        "The court heard Bovey, a commercial fisherman from Yeovil, had been drinking at a pub in Lyme Regis with his friend Sam Cook and his father David Cook on February 8.They arrived at the Royal Standard pub at 2.10pm and in little over an hour he had drunk two pints of lager, six to eight sambucas and three or four Jagerbombs.He bought cans of lager from Tesco before going fishing with Sam and returned to the pub at 6.15pm for more drinks before heading to the Cooks' flat in an agitated and aggressive state.David Cook agreed to drive him to his mother's house in Yeovil but when he ordered him to drive faster, Mr Cook pulled over and got out of the car. Bovey took the key from him and threatened to kill him before driving off.",
        "Bovey lost control of the car at left-hand bend close to the Bowdens' home at about 8.10pm.Following the crash, Dorset Police said Bovey was described as being verbally aggressive and visibly drunk, with him walking away from the scene before officers arrived.He was found a short time later in a back garden when police were told by the resident of the property.",
        "Bovey was arrested before being taken to hospital for treatment of a fractured sternum.Patrick Mason, defending, said his client feels 'immense sadness' for what he did and that he was 'totally remorseful.'In jailing Bovey, judge William Mousley said: 'Nicole Bowden was a completely selfless woman and the complete opposite of the selfish individual that you were that night.'The way in which you behaved was not only selfish but cowardly. In that village you lost control and collided with a wall and then these three individuals.'They had only just stepped away from their home. They were walking to the nearby pub to celebrate a family birthday. Of course they never made it there.'Bovey was also disqualified from driving for ten years after release.Sergeant Jay Griffin, of the force's traffic unit, said: 'Shane Bovey's extremely reckless actions on the night of Wednesday, February 8, 2023 had devastating consequences, with the death of one woman and two others being seriously injured.",
        "'He was intoxicated and driving at excessive speed through a rural village before losing control of his vehicle and colliding with the three pedestrians.'Our thoughts go out to the victims and their loved ones, and we have continued to do all we can to support them throughout the investigation and court process.'I hope this tragic incident can send a clear message to anyone thinking of getting behind the wheel while under the influence of drink and drugs of the truly awful consequences that can occur.'We will continue to do all we can to catch anyone who poses a risk to themselves and other road users by driving while under the influence. We will ensure those who do break the law are investigated robustly and evidence is brought before the court to ensure they are held to account for their offending.'"
    ]
}