{
    "articleURL": "/news/article-12039565/CNBC-reporter-Hadley-Gamble-says-former-exec-called-c-t.html",
    "content": [
        "Hadley Gamble said former CNBC vice president and international managing editor Patrick Allen called her the 'C-word,' and that two employees saw itAllen left CNBC in early 2023, and Gamble's complaint was filed in MarchHer complaint also alleged sexual harassment against NBCUniversal CEO Jeff Shell, who was ousted in April as a result of an investigation into the complaintGamble filed the complaint after she learned her contract wasn't being renewed The CNBC reporter who accused NBCUniversal CEO Jeff Shell of sexual harassment also complained a former executive called her the 'C-word,' according to a complaint she filed with the outlet.",
        "Hadley Gamble, 41, alleged former CNBC vice president and international managing editor Patrick Allen called her the foul slur, the latest detail to come out of her damning complaint which led to Shell's ousting in April.Allen's behavior was witnessed by two former CNBC staffers, according to Axios. He left the outlet in early 2023.Gamble also claimed international president and managing director John Casey fostered a 'toxic' culture where employees were afraid to complain about harassment.Her complaint led to an internal investigation which culminated in Shell, 57, admitting he had an 'inappropriate relationship with a woman in the company.' He and Gamble had a consensual relationship that ended several years ago.CNBC did not respond to DailyMail.com requests for comment. ",
        "Gamble was spurned to speak out about her allegations against the CNBC executives after her contract with the outlet was not renewed this year, sources told Axios.She filed the complaint with NBCUniversal, CNBC's parent company. The parent company of NBCUniversal, Comcast, conducted their investigation using an outside group. It remains unclear whether the organizations have determined whether the executives named in the complaint were guilty of any wrongdoing, according to Axios.Shell, who is married to Laura Fay Shell said he 'deeply regret[s]' his relationship with Gamble. The details of their affair are not known publicly. His firing meant he missed out on a $43million stock award.",
        "Comcast said the reward was 'forfeited and canceled' due to the scandal. NBCUniversal did not say who had made the complaint, but media reports suggested it had been filed by Gamble.Gamble's lawyers subsequently confirmed her identify in a statement, writing 'The investigation into Mr Shell arose from a complaint by my client of sexual harassment and sex discrimination.''Given these circumstances it is very disappointing that my client's name has been released and her privacy violated.'The CNBC anchor moved to front the channel's Middle East coverage in 2018 after it began broadcasting Capital Connection from its new studio in Abu Dhabi.She previously worked for ABC News and Fox News in Washington, DC and also presented CNBC's Access show on the Middle East and Africa.",
        "Gamble grew up in Knoxville, Tennessee, the daughter of a car dealer and teacher, and attended Halls High School in the city.She graduated from the University of Miami in 2003, where she was a member of the famed Delta Gamma sorority, which boasts a number of media personalities among its alumni.Gamble is unmarried and generally tight-lipped about her love life, but told Harper's Bazaar Arabia last year that she was looking for 'trust, transparency, kindness, [and] the chutzpah to tell it like it is' in a companion.",
        "She said that her exhausting work schedule made having a personal life difficult, but that she was open to a relationship with someone who shared her values. 'Every relationship teaches you more about yourself and the whole point of living is to grow and become a better, stronger and hopefully, more interesting person,' she said.It was previously revealed Gamble also had a romantic relationship with California billionaire Tom Barrack.The high profile nature of Gamble's relationship with 76-year-old Barrack, a longtime billionaire friend and 2016 fundraiser to President Trump, led to an internal investigation by human-resources at the CNBC network. The probe was sparked after she managed to secured a high-profile interview with Trump's senior advisor and son-in-law Jared Kushner in August 2020.It was alleged that Barrack was instrumental in securing the interview between Kushner and Gamble which occurred while the pair were dating, reports the New York Post. The Post also shared behind-the-scenes footage of Gamble shooing Barrack out of a Turkish hotel room during summer 2020, as further evidence of their romance."
    ]
}