{
    "articleURL": "/wires/aap/article-12045217/Excavator-needed-stinky-seaweed-stuck-sea-pool.html",
    "content": [
        "Sawtellians are rightly proud of their picturesque rock pool, one of just a few tidal ocean pools to be found along the NSW north coast.",
        "The Sawtell Memorial Rock Pool, just south of Coffs Harbour, has an unspoilt view of the Bongil Bongil National Park stretching to the south.Locals and visitors enjoy the safe spot to swim out of the waves all year round but a recent influx of seaweed has left the pool discoloured and smelly.The problem, unfortunately, is likely to stick around for a while.The pool is regularly cleared of washed-in sand by council, with works undertaken just before the Easter school holidays to get the swimming spot into tip-top shape.But not long afterwards a huge amount of seaweed washed in, choking the pool's valve, clouding the water and giving off a foul smell.The US space agency NASA tweeted in early April that a record amount of seaweed had been spotted from its satellites, with scientists estimating around 13 million tonnes was floating between the west coast of Africa and the Gulf of Mexico.There's been a large amount of seaweed found in the Pacific too, with the waning La Nina weather system bringing large swells along the east coast of Australia.Sawtell's pool was closed for two weeks after locals complained about the seaweed stench, and a City of Coffs Harbour spokeswoman confirmed the piles of soggy weed were a public safety concern.",
        "The pool may now be closed for some time as the council is forced to wait until the rockpool again fills with sand before earth-moving equipment can be brought in.\"To clean the pool out, a 20 tonne excavator is used,\" the spokeswoman said.\"We are currently waiting for tidal action and swells to deposit the requisite amount of sand to allow the excavator to enter the pool and clean out the seaweed.\"Now it seems the only option is to wait until the sand washes in.However, on Thursday some swimmers braved the pungent water.\"I'm just so keen for a swim, I'm holding my nose in the deep end where most of the seaweed is,\" one bather told AAP.\"I try to dodge the seaweed, it's pretty slimy now that it's been in there for a while.\""
    ]
}