{
    "articleURL": "/wires/ap/article-12048305/Colorado-man-stunned-handcuffed-sues-sheriffs-office.html",
    "content": [
        "DENVER (AP) - A man who says he was repeatedly stunned with a Taser while handcuffed, including once in the face, is suing a Colorado sheriff's department, alleging excessive force by two deputies and also a failure by leaders to train and discipline their employees.",
        "Kenneth Espinoza was arrested Nov. 29, 2022, after he stopped to wait when Deputy Mikhail Noel of the Las Animas County Sheriff´s Office pulled over his son, whom he had been following to a car appointment.According to the lawsuit filed in federal court this week, Lt. Henry Trujillo and then Noel ordered Espinoza to leave, saying he should not be near a traffic stop. After initially refusing, Espinoza then started to drive away but Noel pointed his handgun and ordered him to stop.The suit alleges that Noel used a Taser to stun Espinoza directly on his body while he was in his truck, calling them \"drive stuns.\"Body camera video then shows Espinoza being pulled from the truck, handcuffed and squeezed into the back of a patrol car.As the deputies struggle to get Espinoza into the car, video shows, one warns that he is going to use the Taser on him, and uses an expletive.",
        "One device can be seen contacting Espinoza's body along with the wires that carry Taser electrodes, as crackling sounds are heard.Espinoza was hit in the lip after he turned toward the deputies because of the pain of the shocks, according to the lawsuit. The video does not appear to show Espinoza being stunned in the face, but photos released by his lawyer, Kevin Mehr, show him with large scabs on his lip.",
        "Mehr said one probe was lodged 3 centimeters into Espinoza's gum, according to medical records. He estimates Espinoza was hit about 35 times by Tasers, mostly in the \"drive stun\" mode directly to his body.Trujillo and Noel were placed on paid leave during an investigation by an outside agency, Sheriff Derek Navarette said in a statement.He added that the investigation did not start until April 24 because sheriff's officials were waiting to find out whether prosecutors would pursue charges against Espinoza. Prosecutors informed them that day, the same one that Espinoza's lawyer released the body camera video, that they were not going to prosecute. Navarette said prosecutors acknowledged there had been a delay in telling the sheriff's office of their decision.He said he would not comment further because of the lawsuit.A message left at a phone number believed to belong to Trujillo was not immediately returned. A telephone number could immediately not be found for Noel.Nathaniel Espinoza, the plaintiff's son, who joined Mehr at a news conference announcing the lawsuit Tuesday, said he and his father were the only \"cool heads\" during the whole interaction with the deputies, which he thinks helped prevent them from being killed. He added that he does not have a problem with all police, but some are problematic.",
        "\"Cops are people, and there are bad people all over,\" Nathaniel Espinoza said."
    ]
}