{
    "articleURL": "/wires/reuters/article-12053401/Sudans-warring-parties-meet-talks-Saudi-Arabia.html",
    "content": [
        "RIYADH, May 6 (Reuters) - Sudan's warring parties were set to meet on Saturday in the Saudi Red Sea city of Jeddah for talks, Riyadh and Washington said, as international mediators pressed to end a conflict that has killed hundreds of people and sent tens of thousands of refugees fleeing abroad.",
        "Saudi Arabia and the United States welcomed the start of the \"pre-negotiation talks\" between the Sudanese army and its rival, the paramilitary Rapid Support Forces (RSF), and urged both sides to actively engage and come to a ceasefire, a joint statement said.Sudan's Forces of Freedom and Change, a political grouping leading an internationally backed plan to transfer to civilian rule, also welcomed the Jeddah talks on Saturday.The Jeddah initiative is the first serious attempt to end the fighting that has crippled the Sudanese government and endangered the country's political transition following years of unrest and uprisings.The conflict erupted on April 15 between the army of Abdel Fattah al-Burhan and the RSF of commander Mohamed Hamdan Dagalo, a former militia leader known as Hemedti, following the collapse of an internationally-backed plan for a new transition with civilian parties.Sudan's armed forces said it sent a delegation to Jeddah on Friday evening as part of the initiative. The RSF did not immediately confirm its attendance, but both forces have said they will only discuss a humanitarian truce and not an end of the war.Despite multiple ceasefire declarations, the fighting has showed no sign of abating.However, Sudanese broadcasters said there was no exchange of gunfire in and around Khartoum in the early hours of Saturday.",
        "Saudi Arabia has had close ties to Burhan and Hemedti, both of whom sent troops to help the Saudi-led coalition in its war against the Houthi group in Yemen.The kingdom is also focused on security in the Red Sea - which it shares with Sudan - and which has been part of a vast economic plan for tourism called Saudi Vision 2030 and a strategic shipping lane for its oil exports.Saudi Arabia's foreign minister, Prince Faisal bin Farhan, and U.S. Secretary of State Antony Blinken on Friday discussed a plan for the warring parties to reduce tensions, the kingdom said.A group of countries led by Britain, the United States, Germany and Norway is set to request an urgent meeting of the U.N. Human Rights Council on the Sudan crisis next week, a document showed on Friday. (Reporting by Moaz Ab-Alaziz, writing by Aziz El Yaakoubi; Editing by Raju Gopalakrishnan)"
    ]
}