{
    "articleURL": "/wires/pa/article-12054607/Hibernian-strengthen-European-prospects-beating-St-Mirren.html",
    "content": [
        "Elie Youan and Will Fish were on target in the first half as Hibernian boosted their European qualification hopes with a hard-fought 2-1 win at home to St Mirren.",
        "The Easter Road side were well worth their two-goal lead at the break but Saints pulled one back through Alex Greive and cranked up the pressure as they tried to find an equaliser in the closing stages.The victory took fifth-placed Hibs three points clear of their opponents and to within a point of city rivals Hearts.Hibs manager Lee Johnson listed the same team that started the 1-1 draw against St Johnstone a fortnight previously.Saints boss Stephen Robinson made three changes to the side that lost 2-0 to Kilmarnock before the split as Declan Gallagher, Greive and Greg Kiltie replaced Joe Shaughnessy, Tony Watt and Keanu Baccus.The hosts got off to the perfect start when Buddies defender Marcus Fraser was dispossessed by Youan as he tried to control a throw-in from Charles Dunne and the French forward ran clear to slot beyond the exposed Trevor Carson.",
        "The visitors’ first opportunity came after 11 minutes but captain Mark O’Hara screwed a half-volley narrowly over from just inside the box.Hibs doubled their lead in the 23rd minute when on-loan Manchester United defender Fish pounced to head home his third goal in 12 matches from eight yards after Joe Newell’s corner bounced up in front of him.The Edinburgh side were forced into a change in the 29th minute when Jake Doyle-Hayes went off with a head knock and was replaced by Josh Campbell.",
        "Kevin Nisbet then threatened for the hosts with a shot from the edge of the box that tested Carson before Saints wing-back Ryan Strain saw a firm strike held by David Marshall at the other end.Hibs had two good chances in the space of a few minutes towards the end of the first half, with Chris Cadden desperately close to knocking in a Nisbet cross before Campbell fired over the bar from six yards after a Cadden shot rebounded off Carson.The Edinburgh side should have had a third goal in the 56th minute after a lovely flowing move allowed Cadden to cross into the box for Nisbet but the striker blazed over from six yards.St Mirren got themselves back in the game in the 64th minute with a ‘route one’ goal when Curtis Main flicked on Carson’s goal kick and Greive raced clear to drill the ball past Marshall."
    ]
}