{
    "articleURL": "/wires/reuters/article-12052471/DePaul-All-American-Aneesah-Morrow-joins-LSUs-star-packed-team.html",
    "content": [
        "Defending national champion LSU became even more loaded Friday when third-team All-American forward Aneesah Morrow announced she is transferring from DePaul and joining the Tigers.",
        "Morrow joins former Louisville star Hailey Van Lith as recent star additions to the national championship team led by first-team All-American Angel Reese. Morrow will be a junior next season.\"#24 New Home COMMITTED,\" Morrow said on Twitter with a photo showing her in a No. 24 LSU uniform.Reese was named Most Outstanding Player of the NCAA Tournament. LSU defeated Caitlin Clark-led Iowa 102-85 in the national championship game.\"They did talk to me about how much damage we could do,\" Morrow told ESPN of being paired with Reese and Van Lith. \"I kind of feel like I already knew that when you put that much talent together.\"I know I'm hearing a lot about people saying that we won't come together as a team and be able to play because there's so much talent, but I don't feel like that's something that we will struggle with next year at all, or the year after.\"The 6-foot-1 Morrow will supply some big-time production as she ranked fourth in the nation in scoring at 25.7 points per game last season and placed seventh in rebounds at 12.2 while playing 33 games. She was third nationally with 25 double-doubles.Morrow set a DePaul single-season record with 848 points. Her 403 rebounds last season are second all-time behind the 457 she grabbed as a freshman, when she was second-team All-American. She also had 176 steals, 102 blocked shots and 67 3-pointers in 66 games with the Blue Demons.",
        "Morrow and Reese should form a formidable frontcourt tandem. Reese was fifth nationally in scoring at 23 points per game and second in rebounding at 15.4. Reese led the nation with 34 double-doubles in 36 games.Van Lith averaged 19.7 points, 4.5 rebounds and 3.2 assists in 37 games for the Cardinals last season.\"I'm never intimidated by playing against or playing on a team with amazing, talented players,\" Morrow told ESPN. \"That's what I want to be surrounded around. I want to be around players who are going to make me better. I feel like we're going to challenge each other on a day-to-day basis. We all have the same end goal, and that's to win the national championship, to win the conference.\"LSU won the national title in Kim Mulkey's second season as coach. The Tigers are 60-8 in her two seasons after going 9-13 during the 2020-21 season.--Field Level Media"
    ]
}