{
    "articleURL": "/wires/ap/article-12055155/Toyota-riding-momentum-NASCARs-return-Kansas-Speedway.html",
    "content": [
        "KANSAS CITY, Kan. (AP) - Bubba Wallace was surprised in the very best of ways when he learned this week that Legacy Motor Club, the team owned in part by longtime Chevrolet driver Jimmie Johnson, would be joining the Toyota stable next season.",
        "Not quite as good as the feeling he walked out of Kansas Speedway last season.Pretty good, though.\"That was crazy,\" said Wallace, who drives a Toyota for 23XI Racing, when asked about the biggest news to hit the NASCAR Cup Series in a while. \"They're excited because of numbers, right? We have more numbers, more cars to play, especially on the speedways. We're still the minority but it helps for sure.\"Not that Toyota needs much help, especially at Kansas Speedway, where the 23XI cars head into Sunday's race having swept both at the mile-and-a-half track last season. Kurt Busch won the spring race in the No. 45 car on a banner day for the young team, then Wallace jumped out of his No. 23 to take the same car to victory lane in the fall race.Throw in the fact that Martin Truex Jr. drove a Toyota for Joe Gibbs Racing to victory in Monday's rain-delayed race at Dover and the manufacturer, long at a numbers disadvantage to Chevy and Ford, has a groundswell of momentum behind it.",
        "\"I've seen some of that talk that Toyota is the top of the topics,\" Wallace said, \"so that's good.\"The decision by Legacy, which represents the pieces of Petty Enterprises bought out by Johnson and Maury Gallagher, means Erik Jones will be returning to Toyota along with Noah Gragson next season. That means it will have eight full-time cars in field, rather than the six split between Gibbs and 23XI. And that in turn should make all of them more competitive.",
        "\"We're really excited about that,\" said Tyler Reddick, who moved from Chevy to Toyota himself this season when he joined 23XI from Richard Childress Racing. \"The more we have out there on the track helps, especially at the superspeedways, but also having a bigger pool of crew chiefs and minds helps.\"In the meantime, Wallace and Reddick will have each other - and the four Gibbs cars - at Kansas Speedway. And that's been enough lately. Toyota has won five of the last seven races, including two trips by Denny Hamlin to victory lane.\"Obviously it feels really good to get back here to Kansas, and get back to what we did in the fall,\" said Wallace, who held off his team owner Hamlin for his second career win, and first in a race that wasn't shortened by rain.\"I thought that was a really special weekend for us,\" Wallace said.Now, the 23XI team has a chance for another special weekend. With Reddick in the seat of the No. 45 car, it could become the first to win three consecutive races at the same track with a different driver for each of them.\"That would be really cool,\" Reddick admitted. \"But I mean, all that aside, it's about coming here and putting together a weekend and executing. Both teams, the whole organization, is really, really excited, and really wanting to see what we've got a couple of months removed from the last time we were here. Everyone is coming in with a lot of confidence.\"",
        "THROWING IT BACKNext week is \"Throwback Weekend\" at Darlington, where teams bring back modern versions of old paint schemes. But asked what else he would bring back from the 1990s, Kyle Busch had a couple of ready answers: Dale Earnhardt, who died in a 2001 crash on the final lap of the Daytona 500, the Brickyard 400 at Indianapolis Motor Speedway, and the \"No Bull Five,\" which gave drivers an opportunity to race for an extra $1 million. \"Miss Dale, of course,\" Busch said.KESELOWSKI CRUISINGBrad Keselowski is coming off an eighth-place finish at Dover, giving him consecutive top-10 runs for the first time since moving to RFK Racing. Keselowski won twice at Kansas Speedway while driving for Roger Penske.SPLITTER SITUATIONNASCAR put on display the splitter that led to a $75,000 fine and penalty of 60 points for the No. 3 team after its race at Martinsville Speedway. Two nuts and a center coupling on the splitter are supposed to be three different pieces, but they were bonded together, making it possible for Richard Childress Racing to adjust the splitter before or during the race.The team appealed the penalty, which dropped Austin Dillon to 31st in the points race. It was denied earlier this week.ODDS AND ENDS",
        "Kyle Larson is the 4-1 favorite to win Sunday, according to FanDuel Sportsbook. He won the playoff race from the pole in 2021 and finished second in the spring race a year ago. ... The past seven winners on mile-and-a-half tracks have come from the top six starting positions. ... Reddick started on the front row for Richard Childress Racing for both Kansas races last year. He was 30th in the spring race after misfortune with a vinyl wrap on the wall and 35th in the fall after a tire went down.___AP auto racing: https://apnews.com/hub/auto-racing and https://twitter.com/AP_Sports"
    ]
}