{
    "articleURL": "/news/article-12038703/Live-carer-accused-keeping-patient-cash-cow-slave-affair-wife.html",
    "content": [
        "George Webb is accused of 'enslaving' Tom Somerset-How with his wife SarahThe carer and his lover allegedly treated Mr Somerset-How like 'property'A live-in carer accused of keeping his disabled patient as a 'cash cow' while he had an affair with the man's wife has told a court he is 'not a wrong 'un'.",
        "George Webb, 50, said he was 'heartbroken' after it was alleged that he and Sarah Somerset-How, 49, tried to swindle her 'enslaved' husband Tom out of his inheritance.Mr Somerset-How, who has cerebral palsy and required round-the-clock care at his home in Chichester, West Sussex, was barely kept alive while his wife and her lover treated him 'like a piece of property' and left him a 'prisoner in his own home', a court heard.It is claimed the 40-year-old was only rescued after his family, police and social services staged a rescue in 'an operation that had the marks of extracting someone as a hostage'.Giving evidence last month, the alleged victim's mother, Helen Somerset-How, said she had felt 'threatened' by Webb - but today the carer insisted he had never abused his patient and said he wasn't a 'bully'. ",
        "Somerset-How and Webb are charged with holding a person in slavery and ill-treatment by a care worker.Webb faces a charge of ABH against Mr Somerset-How after an incident in which he is accused of hitting him with a shoe.Somerset-How also faces charges of fraud and theft, but similar charges against Webb were dropped for lack of evidence.Webb, who began caring for the 'intelligent' history graduate in 2016, today told jurors he was 'heartbroken' to hear of the ABH charge upon his arrest.",
        "When asked by his barrister Robert Bryan if he had abused Mr Somerset-How by throwing a football boot at him, Webb said 'absolutely not, never ever'.He told the jury: 'I've never abused anyone. I'm not an abuser. Tom knows that. I had no idea about this until I got arrested. I have a good name.'I was kneeling on the floor next to the bed with a cleaning brush, and I didn't realise how close he was to me. There was no way I would have hit Tom even if I was angry.'I have never thrown a football boot at him. I don't remember this situation. When I got arrested, and I was told about it, I was heartbroken.'I am not a bully, especially to a vulnerable person. I am not a wrong 'un. If I had done this, I would have left.'",
        "The court has heard that while the pair bought lingerie and DJ equipment with cash Mr Somerset-How had been given by relatives, he was left as a 'prisoner in his own home'.They allegedly left wheelchair-bound Mr Somerset-How - who is almost blind - in bed for 90 per cent of the time, allowed him a shower once a week and went for a whole year without brushing his teeth.",
        "For food he would be left with only a packet of crisps and a sandwich, the court was told, while Webb and Somerset-How carried out their plan to 'ostracise' him from his family.The pair also discussed Somerset-How's thong and having a 'quickie on the sofa' at the house the three of them shared, the trial heard.The jury was told that eventually Mr Somerset-How managed to raise the alarm about how he was being treated with a friend, who alerted his parents.His mother Helen said in November 2016 she stayed at the specially-adapted bungalow to look after her son and was shocked at the condition of the house.She told Portsmouth Crown Court: 'The bedroom was absolutely disgusting. There were piles of clothes everywhere, and Tom's wheelchair was clearly not being used. There were boxes and clothes on top of it. It was untidy and dirty.'The following week, she came to collect bedding from the house unannounced.She said: 'I rang the door, and George opened it and stood there staring at me, not saying anything. I said, \"I'm Tom's mum\".'He said, \"I know who you are. Sarah told you she would drop your stuff off to you\".'His dog was there barking like mad. He was shouting at me, saying I couldn't just arrive without notice and they needed an hour's notice if I wanted to visit.",
        "'I asked why he was being so aggressive. He said, \"Last time you dressed me down, and since then I have had it in for you. You can't just come round in your fancy car\".'",
        "After he let her into the house, she went to her son's bedroom.She said: 'His room was dirty. His bedside table had layers of dust - it was filthy. My impression was of squalor.'I felt threatened, and George was standing in the bedroom door.'There was no apology from Sarah. Carers have been fired for much less. Sarah said, \"I'm sure it won't happen again\".'She told the jury that was the last time she visited the bungalow.'It was never convenient. I would have to comply with what they wanted.'I continually tried to call Tom, but it was never a good time, sometimes they would not answer at all.'Describing her son after he was 'rescued' from his home, she said: 'He had a beard. His nails were dreadful. His teeth were unclean, they had stuff all over them, and he smelt terrible.' They then staged a rescue with police and social services, 'an operation that had the marks of extracting someone as a hostage', the court heard.Mrs Somerset-How and Webb deny the charges.",
        "The trial continues."
    ]
}