{
    "articleURL": "/wires/afp/article-12038197/US-policeman-held-crowd-convicted-George-Floyd-murder.html",
    "content": [
        "The last of four former Minneapolis police officers charged in the death of George Floyd has been found guilty of manslaughter.",
        "Tou Thao, who held back onlookers as three other officers pinned the 46-year-old Black man to the ground, was convicted by Hennepin County District Court Judge Peter Cahill after a bench trial in the northern US city.Thao opted to be tried by a judge rather than by a jury. Cahill convicted him on Monday and the decision was released on Tuesday.Derek Chauvin, a 19-year veteran of the Minneapolis police force, was captured in a video that went viral kneeling on Floyd's neck for nearly 10 minutes, until he passed out and died.Two other officers helped restrain Floyd, who lay handcuffed face down on the ground complaining he was unable to breathe, while Thao kept away the crowd.\"Like the bystanders, Thao could see Floyd's life slowly ebbing away as the restraint continued,\" the judge said.\"Yet Thao made a conscious decision to actively participate in Floyd's death: he held back the concerned bystanders and even prevented an off-duty Minneapolis firefighter from rendering the medical aid Floyd so desperately needed.\"Floyd's May 2020 death sparked protests against racial injustice and police brutality across the United States.Chauvin, who is white, was convicted of murder in April 2021 and sentenced to 22-and-a-half years in prison.The other two officers who restrained Floyd, Thomas Lane and J. Alexander Kueng, pleaded guilty to second degree manslaughter, the same charge leveled against Thao.",
        "Lane was sentenced to 36 months in prison while Kueng received 42 months.Thao's sentencing was set for August 7.Chauvin, Lane, Kueng and Thao were also convicted of federal charges of violating Floyd's civil rights during his arrest for allegedly using a counterfeit $20 bill.Minnesota Attorney General Keith Ellison called Thao's conviction the \"historic and the right outcome.\"\"It brings one more measure of accountability in the tragic death of George Floyd,\" Ellison said in a statement. \"Accountability is not justice, but it is a step on the road to justice.\""
    ]
}