{
    "articleURL": "/sport/football/article-12048175/Premier-League-fans-hear-VAR-conversations-season.html",
    "content": [
        "Fans have been left mystified by how some VAR decisions have been reachedPGMOL boss Howard Webb wants to reduce confusion over controversial callsThis could lead to VAR conversations being made public from next season Premier League clubs are being consulted over plans to let fans listen to the conversations between referees and VARs after games in the hope of demystifying how and why decisions are reached.",
        "PGMOL boss Howard Webb has been pushing for this since arriving in his post in December, keen to give supporters a glimpse behind the curtain and reduce the confusion that currently surrounds controversial calls.It is felt that fans would gain a new appreciation for the match officials if they can hear the reasoning for their decisions, such as why Liverpool's penalty stood in their 1-0 win over Fulham on Wednesday.Football's lawmakers IFAB have told Mail Sport that they would have no problem with audio recordings being made public, so long as they are published after games and not broadcast live.Premier League clubs are said to be open to the idea - as are the referees and VARs who feel they have nothing to hide - though it is unlikely to be introduced before the end of this season.",
        "According to one source, there is a fear this would 'open up a can of worms' with managers wanting to hear the audio from previous contentious calls that have already gone against them this term.Instead it is likelier to come in for the start of the 2023-24 season if a final agreement can be reached between Premier League shareholders.Fans would not get to hear what is said between referees and players or coaches - such as Jurgen Klopp's conversation with Paul Tierney last week, which is considered confidential - but only between the match officials at the stadium and at Stockley Park.",
        "When Webb was working in the United States, the MLS's refereeing body PRO published audio after each match round and they still do so.",
        "Called 'Inside Video Review', the latest episode on PRO's YouTube channel ran through the weekend's four video reviews.That included a penalty recommended by VAR, who felt Austin's Gyasi Zardes had his shirt pulled by LA Galaxy's Eriq Zavaleta. In the footage, fans can hear the referee Chris Penso discussing the incident with VAR Jair Marrufo while he is at his pitch-side monitor. 'He doesn't let go while he's jumping in the air to get that ball,' says Marrufo, before Penso argues that Zardes is holding on to Zavaleta as well and ultimately decides: 'I understand, but I'm going to keep my on-field decision, Jair.' France's Ligue 1 have been pushing for transparency more than any other nation. Referee Benoit Millot wore a microphone during a game between Nantes and Lyon, with fans praising the footage from this one-off experiment for the insight it provided.Yet IFAB have already denied French football's request to equip Ligue 1 referees with microphones from the start of next season."
    ]
}