{
    "articleURL": "/news/article-12042941/Republicans-demand-know-federal-statute-banning-protests-outside-justices-homes-not-enforced.html",
    "content": [
        "Four GOP senators said 'post orders' show officers were specifically told not to enforce federal statute that bars protests at justices' or federal judges' homesThey were told only to engage with protesters if they directly tried to trespass on private propertyProtesting outside judges' homes is prohibited specifically when it occurs 'with the intent of interfering with ... administration of justice'U.S. Marshals sent out to protect Supreme Court justices in light of the Dobbs leak last year were ordered not to arrest protesters outside justices' homes even though federal law bans such activity, according to internal records obtained by four senators. ",
        "In a letter sent to Attorney General Merrick Garland, the GOP senators said 'post orders' from last spring show that the officers were specifically told not to enforce the federal statute that bars protests at justices' or federal judges' homes. '[A]lthough there may be state and federal laws concerning protest activity around residences the USMS is not in a position to enforce those laws,' read one set of orders, according to the letter led by Sen. Katie Britt, R-Ala.Another set of orders told Marshals they 'should not engage protestors \"unless they attempt to enter private property,\"' according to the letter. ",
        "Britt and three other Republicans said their findings contradict Garland's own testimony before Congress earlier this year that Marshals were told they 'have full authority to arrest people under any federal statute' including Section 1507, the anti-protesting law.Protesting outside federal judges' homes is prohibited specifically when it occurs 'with the intent of interfering with, obstructing, or impeding the administration of justice, or with the intent of influencing any judge, juror, witness, or court officer.' The protests came before the final decision in the Dobbs case. Garland said in a Senate Appropriations subcommittee hearing in March that Marshals had the authority to make arrests 'under any federal statute including that federal [anti-protesting] statue, but they have to make the determination on the ground whether they can do that in a manner that is safe and able to protect their main mission.'",
        "Garland stressed he was 'the first Attorney General who's ever ordered the Marshals to protect the residences of the justices and protect them 24/7.' The attorney general said he did not know details about the instructions to the Marshals until Britt showed him some of them in the March hearing. Britt said her office had obtained the Marshal orders 'from multiple whistleblowers separately.'  'In the aftermath of your appearance before the Senate Judiciary Committee, it became clear that your testimony was misleading and incorrect,' Britt wrote, joined by Sens. Ted Cruz of Texas, Tom Cotton of Arkansas and Mike Lee of Utah.U.S. Marshals are still protecting justices around the clock, though Garland has said he hopes that soon Supreme Court police can handle that work. House Judiciary Committee Chair Jim Jordan has now launched an investigation into directions given to the Marshals. The probe comes one year after the bombshell leak of the Dobbs decision that would overturn Roe v. Wade - which sent shockwaves across the nation and spurred protests in front of justices' homes for a time. Jordan wrote a letter requesting information from U.S. Marshals Service Director Ronald L. Davis about the training materials Marshals were given as they were sent out to justices' homes. ",
        "'The training materials provided to the U.S. Marshals strongly suggest that the Biden Administration is continuing to weaponize federal law enforcement agencies for partisan purposes,' Jordan wrote. ",
        "'While authorities apprehended the man who intended to do harm to Justice Kavanaugh, we are aware of no other arrests or charges for agitators demonstrating outside of the justices' homes—despite the actions clearly violating federal law,' Jordan said in the letter, referencing a July 2022 arrest of a man outside Brett Kavanaugh's home who threatened to kill the justice and was found to be armed. Jordan requested documents and communications between the U.S. Marshals Service and the Department of Justice, the U.S. Attorney’s Office for the District of Maryland, the U.S. Attorney’s Office for the Eastern District of Virginia, and the Executive Office of the President about enforcement of the statute from the day of the leak - May 2, 2022 - to the present. He requested the information by 5 p.m. on May 17. "
    ]
}