{
    "articleURL": "/money/podcast/article-12042543/How-add-value-home-lose-Money-podcast.html",
    "content": [
        "Poor old conservatories. Once they were all the rage and now we are being told they could knock £15,000 off the value of a house.",
        "But how would that happen? Surely, it's better to have something rather than nothing? Meanwhile, a home office in the garden is said to add lots of value, but who has ever longed for once of those in the same way they've dreamed of a swimming pool on a hot day? Yet, the pool is one of the main things that will apparently put off prospective buyers.On this podcast, Georgie Frost and Simon Lambert discuss home improvement snakes and ladders - looking at the things that are claimed to boost your property's value and the ones meant to detract from it. (And whether something supposedly good or bad can ever trump the traditional location, location, location.)Plus, as a mini-banking crisis continues to swirl around, how worried should we be - and is it a good time to pick up some cheap UK bank shares?Simon talks through what happened to the other Woodford fund: Patient Capital Trust - and whether it's an investment holders should show yet more patience and stick with or ditch from their portfolios.The alternative to the risks of stock market investing is now savings deals paying 5 per cent. So should you grab one of those instead?",
        "We publish the podcast every Friday to the player on This is Money, above, and on Apple Podcasts (iTunes), the most popular, Spotify, Audioboom, and so many more.To download the Apple Podcasts app go to the App store. On Android devices, go to the Google Play store to download the podcast app of your choice. You can press play to listen to this week's full episode on the player above, and wherever you get your podcasts please subscribe and review us if you like the podcast.We're now available on YouTube and you can ask your smart device to 'play the This is Money podcast'. If you're not happy using apps, you can also listen to the latest episode and archive on the This is Money podcast page. ",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}