{
    "articleURL": "/money/investing/article-12041621/Dividend-Kings-48-firms-hiked-investor-payouts-50-YEARS.html",
    "content": [
        "Aegon AM reveals the dividend 'Aristocrats', 'Kings' and 'Diamonds'Household names like PepsiCo and Johnson &amp; Johnson make the listJust 48 companies globally can boast a 50-year track record of consecutive dividend increases, according to research compiled by Aegon Asset Management. ",
        "And perhaps surprisingly given the UK market's reputation for big investor pay-outs, every one of the companies is listed in North America.The list includes some major consumer names like Johnson &amp; Johnson and PepsiCo, as well as some less well-known corporates such as Auto Data Processing.But which of the dividend 'Aristocrats', 'Kings' and 'Diamonds' should income-focused investors consider for their portfolios this May?",
        "Global equities investment manager at Aegon AM, Mark Peden, says: 'A Dividend King is a company with at least 50 years of dividend increases.'PepsiCo joined that elite band last year, while Johnson &amp; Johnson and Cincinnati Financial have raised their dividends for over 60 consecutive years, making them Dividend Diamonds. 'Only high-quality businesses can sustain growing dividends over such long periods.'Dividend Aristocrats are companies which have increased their dividend every year for more than 25 years. We own several in the Aegon Global Equity Income Fund, including ADP, NextEra and Air Products.'Here, Peden highlights five stocks that make the grade.  1. Cincinnati Financial",
        "'CINF has a market-leading position with independent insurance agents, which rely on a small number of insurers leading to a high success rate,' says Peden. 'The appointment of 100 new agents per year in recent years should increase revenues, as CINF tends to increase its win-rate with new agents within the first 10 years.",
        "'It has a strong history of dividend growth, which is an investment factor that is working well in the current market environment. 'The firm has a prudent investment policy, with its bond portfolio more than covering their insurance reserve liabilities with a staggered maturity profile.'2. Nucor'Interruptions to steel supply during Covid, followed by the impact of war in Ukraine on global steel markets, have pushed Nucor's sales, operating profits and operating cash flows to all-time highs,' says Peden.'It's true this is intrinsically a cyclical business, and the balance of probability is that supply constraints continue to ease and demand softens slightly, which may well herald a peak for the company.'That being said, Nucor has consistently grown its dividend through the peaks and troughs of the steel cycle – every year since it listed in the early 1970s. Not many companies of this type can boast of that.'3. PepsiCo'PepsiCo is a good defensive name, offering US consumer exposure. The firm is less exposed to restaurant demand than Coca Cola and is US-centric.'It has a balanced portfolio, manageable debt, a strong and diverse line-up of brands and a 2.5 per cent yield, whilst becoming a Dividend King last year. 'While the stock's entry point is not cheap and investors may try to be cute with the entrance price, we think it's worth a start position even at its current levels.'",
        "4. Johnson &amp; Johnson'Johnson &amp; Johnson is a highly defensive business operating in cutting-edge pharmaceuticals discovery, medical equipment and consumer health areas.'This strategy has allowed it to grow the dividend every year for the past 60 years.'5. ADP'Auto Data Processing (ADP) isn't too far away, with 48 consecutive years now, but is still technically just an aristocrat, yet to ascend the throne.''ADP is a market leader in payroll software, growing revenues faster than the market with a clear road map to expand margins. 'The firm's shares have sold off due to fears of rising unemployment, although there are signs now that we're past peak concerns.''The share price has significant potential for re-rating with a solid balance sheet, strong cash flows and consistent execution which have allowed it to increase the dividend consistently for 48 years.'What about London-listed dividend payers? Most UK-based investors will be able to buy shares in some of the biggest names in the list above via their respective trading platforms.However, not all of the companies will be accessible and investors may want to look closer to home for inflation-busting top dividend payers.Here are six listed on the FTSE. ",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}