{
    "articleURL": "/wires/reuters/article-12050553/France-spend-2-billion-euros-boost-bicycle-usage.html",
    "content": [
        "France to double bike network to 100,000 km",
        "State to subsidise second-hand bike purchasesAll primary school children to get bike trainingBy Geert De ClercqPARIS, May 5 (Reuters) - The French government plans to spend two billion euros ($2.2 billion) through 2027 to improve cycle infrastructure and help people buy bikes in an effort to reduce car use and boost cycling, government ministers said on Friday.The aim will be to double the cycle lane network and the government will spend 250 million euros a year on new bike lanes from 2023 to 2027. The rest of the budget will go towards other measures to boost bicycle use.\"The state's bicycle effort is unprecedented and massive,\" Transport Minister Clement Beaune said in a tweet.The government wants to make bicycles an attractive alternative to cars and a means of transport accessible to everyone from the youngest age and throughout their life, Beaune told Le Parisien newspaper.The goal will be to increase the country's bike lane network from 50,000 km (30,000 miles) today to 80,000 km in 2027 and 100,000 km by 2030, with priority given to provincial cities and rural areas, as big cities have already received considerable state funding for cycling infrastructure, Beaune said.About 500 million euros will be allocated towards subsidies to buy bicycles, including for second-hand bicycles.",
        "The government will also increase spending on bike parking facilities in railway stations and in cities, boost spending on anti-theft bike marking and provide bike training for all primary schoolchildren.Cycling organisations welcomed the initiative.\"This visionary initiative will not only transform the way our citizens commute and live but also make France a global leader in promoting cycling infrastructure and culture,\" said Olivier Schneider, president of the FUB cyclists union. ($1 = 0.9069 euros) (Reporting by GV De Clercq Editing by Frances Kerry)"
    ]
}