{
    "articleURL": "/tvshowbiz/molly-mae-hague/article-12058681/Molly-Mae-Hague-shares-sweet-video-baby-Bambi-boyfriend-Tommy-Fury-24th-birthday.html",
    "content": [
        "Tommy Fury celebrated his 24th birthday on Sunday, with girlfriend Molly-Mae gushing over him on social media.",
        "The former Love Island star, 23, took to Instagram to share a sweet video of Tommy and baby Bambi. Alongside the clip, Molly penned: 'Happy Birthday to my dream man. You have no idea how much I love you. Just us, forever and always baby!'The PrettyLittleThing Creative Director spoiled Tommy on his birthday as he woke up to presents, a cake, balloons and a photo display.She then later surprised him with a night away in a lavish hotel which was decorated with more balloons and loved-up snaps of the couple. ",
        "The pair enjoyed champagne during their night away and had a special cake which was decorated with boxing gloves.It comes after Molly shared a heartwarming snap of Tommy Fury 's mum with their little daughter Bambi.The influencer took to her page as she posted a rare picture of his mother Chantal cradling the little one in her arms.Molly - who shares Bambi, four months, with boyfriend Tommy - penned the story: 'Grandma's birthday'.The grandma of Bambi is captured in a sweet moment as she holds Bambi and looks at her.Earlier on Saturday, the influencer also shared a snap showing a bouquet of white roses in the backseat of the car as Tommy drives.She penned it: 'Tommy's mum's birthday.'",
        "The couple appeared to be meeting Chantal at the Trafford Centre in Manchester - as the grandma made one very rare appearance.Chantal - who is of Mauritian descent - has avoided the spotlight as much as possible in the past, but she did appear on the 2019 season of Love Island when her son was starring in the show.Meanwhile, Tommy's shares his father John with WBC heavyweight champion Tyson Fury - who trains him.Tommy and Tyson are also 11 years apart and have three other brothers.Molly-Mae kept delighting followers with sweet snaps of her daughter as shared an adorable photo of her daughter Bambi on Saturday morning .As the influencer celebrated the King's Coronation, she said that their child was a 'happy girl.'",
        "The snap she posted showed Bambi dressed in a comfy brown baby grow as she lay in a bouncer smiling.Molly-Mae wrote: 'Good morning happy girl' as a caption to the sweet Instagram story post.Meanwhile, the reality star revealed that she was watching the Coronation festivities and took a photograph of her television, adding a crown emoji.It comes after Molly-Mae took to Instagram to showcase the stylish outfit she wore earlier in the week, including a £9k Chanel bag and £700 Loewe shirt having previously set tongues wagging over 'flaunting her wealth'.",
        "Captioning her snap, she penned: 'Not everyday tracksuit. Much to my sadness.'While Molly-Mae looked comfortable in her pricey ensemble, she recently divided her social media followers, who accused her of flaunting her wealth by posing in an airport terminal surrounded by her £4,000 designer luggage.Having just returned from a lavish family holiday in Dubai, the star cut a casual figure in a black T-shirt, matching leggings and an oversized blazer as she sat outside a Hermes boutique in a post shared on Sunday.She styled her long blonde tresses pulled back in a claw clip leaving strands to frame her face as she leaned on her hand.The reality star seemed less than impressed in the picture as she sat next to her £2,200 Louis Vuitton suitcase and her matching £1,790 travel bag.Molly-Mae looked ready for her flight as she kept her AirPod Max headphones, which are worth over £500, around her neck. Referencing her surroundings in the accompanying caption, she wrote: '5 star airport shopping.'However the post, shared in the midst of a cost-of-living crisis, prompted an inevitably divided response from followers.Replying to her latest update, one quipped: 'If there ever was a caption to humble the working class.'",
        "Elsewhere a second quickly added: 'Thanks for reminding me to work harder,' while a third remarked: 'the caption is a little controversial ha…'",
        "Another simply added: 'Read the room.'However others defended the influencer, with one fan writing: 'she isn't pictured with Hermes shopping bags though.'She's saying 5* shopping and has a tiny paper bag from purchases... working class can walk round all shops at an airport too... people have a choice how they spend their hard earned money.'While another added: 'Stop taking offence ffs.'"
    ]
}