{
    "articleURL": "/wires/reuters/article-12045885/Novo-Nordisk-U-S-priority-weight-loss-drug-launching-new-markets.html",
    "content": [
        "Wegovy so far launched in U.S., Denmark and Norway",
        "Company had planned ex-U.S. launches of Wegovy for 2023More than 100,000 prescriptions written a week in U.S.- CFONovo to boost production by adding more contract manufacturersPace of obesity market growth 'unprecedented' - Barclays(Adds CFO comments on production and prescriptions in paragraphs 5-8, background throughout, analyst quote in paragraph 11)By Nikolaj Skydsgaard and Maggie FickCOPENHAGEN/LONDON, May 4 (Reuters) - Novo Nordisk is prioritising U.S. supplies of its popular weight-loss drug Wegovy over launching in new markets, a senior executive told Reuters on Thursday, as the Danish drugmaker struggles to keep up with skyrocketing demand there.Wegovy has been flying off the shelves in the United States since its launch in June 2021, but the company has been unable to keep up with demand even as it has added production capacity.Analysts estimate the weight-loss market could be worth as much as $100 billion by 2030, with most of the benefit accrued to early leaders, Novo and rival Eli Lilly.U.S. doctors are writing more than 100,000 prescriptions per week for Wegovy, Chief Financial Officer Karsten Munk Knudsen told Reuters on Thursday.In recent weeks, prescriptions for new patients have exceeded 30,000, he said.He declined to give current production figures, but said prescriptions were a \"good proxy\". One prescription contains four injection pens, equivalent to one month's supply for the weekly injection.",
        "\"We are eager to roll out in ex-U.S. markets, but of course we need to do it in a responsible and sustainable way,\" Knudsen said.\"Any launches including the UK (and elsewhere in Europe) will be based on the uptake in the U.S. and our gradual expansion of supply.\"The comments suggest Novo will likely further delay launching the drug in the UK and elsewhere in Europe, where it had initially planned to roll out in 2022. Other than the United States, it's only available in Denmark and Norway.In February, the company said it hoped to introduce Wegovy in new markets in 2023. On Thursday, Knudsen would not give a timeline for new launches.Earlier on Thursday, the company said it would halve the supply of starter doses of the drug in the United States for several months to ensure supplies for existing patients, after releasing better-than-expected first-quarter results.The pace of growth for obesity drugs is \"unprecedented\" in the pharma industry, Barclays analysts said after Novo's results showed quarterly sales of obesity care products soared 124%.Novo has two contract manufacturers producing Wegovy - one in Europe and one in the United States - and has signed up a third in the United States, which will start producing in the later part of this year, and the company hopes to get more, he said.",
        "\"We continue to scale. It'll not stop there,\" he said.The company produces the active pharmaceutical ingredient for Wegovy and outsources the filling of single-use syringes to manufacturers. (Reporting by Nikolaj Skydsgaard in Copenhagen and Maggie Fick in London; writing by Josephine Mason; editing by Susan Fenton and Mark Potter)"
    ]
}