{
    "articleURL": "/sport/football/article-12056349/Luka-Modric-casts-doubt-future-Real-Madrid-Copa-del-Rey-triumph.html",
    "content": [
        "Luka Modric has left his Real Madrid future up in the air after Copa del Rey winThe 37-year-old's current deal with Los Blancos expires at the end of the seasonMadrid teammate Eden Hazard revealed he will remain at the club this summer Luka Modric has left his future at Real Madrid up in the air after the club captured its 20th Copa del Rey on Saturday.",
        "The veteran midfielder appeared as a late substitute as Carlo Ancelotti's side fought off a spirited challenge from Osasuna to triumph 2-1 at the Estadio de La Cartuja.Speaking with Spanish radio broadcaster Cadena SER following the victory Modric stopped short of confirming that he will continue his career in the Spanish capital.'The idea is to continue at Madrid but... we'll see what happens,' the 37-year-old revealed.Modric also confirmed that he will be fully fit for the club's Champions League semi-final clash with Manchester City on Tuesday, after his involvement was in doubt following a hamstring injury sustained in training last month.",
        "The Croatia captain has won every piece of silverware available to him since joining the club from Tottenham in 2012 but his current deal at the Santiago Bernabeu is set to expire at the end of June.Despite his advanced age, Modric has remained an integral part of Ancelotti's team this season having made 45 appearances in all competitions.Meanwhile Modric's Madrid teammate Marco Asensio may also be set to depart the club this summer.Asensio's contract is due to expire at the end of the season and the 27-year-old admitted that he 'doesn't know' what his future with the club holds when asked following Saturday's final.One player that confirmed he will remain with the club is Eden Hazard. ",
        "Despite finding his opportunities limited in recent years, the club's highest-paid player revealed he will see out the end of the five-year deal that he signed when he joined the club from Chelsea in 2019.'It's been a difficult year, but with a very big team. I have a good relationship with the club and with the players too. I want to play, but I know it's very difficult. I have to work and hope I can play more.'Hazard has been limited to just one league start this season and was an unused substitute as the club captured La Copa."
    ]
}