{
    "articleURL": "/sport/othersports/article-12045207/Barstool-president-claims-parent-company-forced-fire-host-Ben-Mintz-rapping-N-word.html",
    "content": [
        "Ben Mintz said the racial slur, while rapping the song '1st of Tha Month'Barstool President Dave Portnoy claimed Mintz made an 'innocent mistake'DailyMail.com provides all the latest international sports newsPopular Barstool host Ben Mintz was fired from the company after saying a racial slur while reading rap lyrics on a livestream earlier this week.",
        "Mintz, known as Mintzy, received backlash when he said the N-word on his show, 'Wake Up Mintzy,' while rapping the song '1st of Tha Month' by Bone Thugz-N-Harmony on Monday. Two days later, Barstool President Dave Portnoy posted a video to Twitter, announcing that the company had fired the host. Portnoy added that Barstool's parent company, Penn Entertainment, had forced him to fire Mintz, claiming the decision was not his. Dailymail.com has reached out to Penn for comment.He claimed that the call was made, despite him, Barstool CEO Erika Nardini and longtime talent Dan Katz insisting that Mintz had made an honest mistake. ",
        "Portnoy added that the call to fire Mintz was made over concern that the incident could jeopardize regulatory gambling licenses across the country.'I hate the decision. I disagree with the decision. I would not have made the decision. But I don't deal with the things Penn deals with in terms of state regulators etc,' Portnoy told The New York Post.'Penn paid a lot of money for Barstool and they have to make the best decisions to protect their business. I trust and respect [Penn CEO] Jay [Snowden] that he makes what he thinks is the right move and that's all you can ask for. Doesn't mean I'll always agree but again he deals with things I don't have to think or deal with.'",
        "In a video announcing the firing, Portnoy expressed shock and disbelief that Mintz's 'innocent mistake' could have affected the company with regulators.'They believe there's a legitimate chance lots of states could pull their licenses because of this,' said Portnoy.'Penn's a multi-billion dollar company. Without their licenses, they are a zero-dollar company. Investors, families, employees, thousands of people — they believe it's their job to protect all of this and the only answer is to fire Ben Mintz.'I still disagreed with it, and maybe I'm naive, but I'm like, 'There is just no way anybody can look at the clip and think the punishment fits the crime.' 'It makes my skin crawl thinking a guy would lose their job on an innocent mistake. Yes, horrible, but clearly no intent … It's everything I've stood against for 20 years.'",
        "Mintz himself had previously apologized for the slur, insisting he meant no harm in his actions. 'This morning, I made an unforgivable mistake slipping on air while reading a song lyric,' Mintz tweeted Monday morning. 'I meant no harm &amp; have never felt worse about anything. I apologize for my actions. I am truly sorry &amp; ashamed of myself.'Penn paid about $388million for the remaining stake in Barstool Sports that it doesn't already own, the sports and entertainment company announced in February.",
        "Penn and Barstool Sports first announced an exclusive sports betting and iCasino partnership in early 2020. Penn took a 36 percent stake of Barstool Sports in February 2020 for approximately $163m, comprised of about $135m in cash and $28m in non-voting convertible preferred stock.The initial deal included a path for Penn to gain full ownership of Barstool Sports.Barstool was founded in 2003 by Portnoy as a free sports and gambling newspaper. It is now a digital platform that covers sports, lifestyle, and entertainment with more than 200 million followers."
    ]
}