{
    "articleURL": "/wires/reuters/article-12055957/Rubber-game-line-Orioles-Braves.html",
    "content": [
        "A pair of right-handers will be on the mound Sunday morning when the visiting Baltimore Orioles and Atlanta Braves play the rubber game of their three-game series.",
        "The Orioles won the first game 9-4 on a pair of homers from Anthony Santander and the Braves evened the score with a 5-4 win on Saturday thanks to a pinch-hit home run from Kevin Pillar.The finale features Atlanta's Bryce Elder (3-0, 1.75 ERA) against Baltimore's Tyler Wells (2-1, 3.34).Elder will be making his seventh start of the season and has been a pleasant surprise since being added to the rotation when Max Fried went on the injured list after straining his hamstring on Opening Day. Elder has pitched at least five innings in every start and has not allowed an earned run in four of them.In his most recent start on Tuesday at Miami, Elder threw a season-high seven innings and allowed no runs on three hits and six strikeouts without a walk.\"I thought it was pretty good,\" Elder said. \"My misses, even the ones that were a full 58 feet, were down and that's where I shoot to miss. I was pleased with it.\"Atlanta manager Brian Snitker said, \"The movement on his sinker was just crazy. And he's efficient, put the ball on the ground.\"This will be his first career appearance against Baltimore.Wells will be making his seventh appearance and sixth start of the season. In his most recent outing against Boston on Tuesday, Wells pitched six innings and allowed four runs on three hits, three walks and four strikeouts. It was his first start with more than one walk, and he surrendered a season-high three home runs.",
        "\"It's definitely nice this year, being able to let him go pitch,\" Baltimore manager Brandon Hyde said. \"Limiting him was something we needed to do last year and had to do and should do. But this year the leash is longer and it's fun to watch him go out there and go as long as he can.\"Wells has made one career appearance against the Braves. That came in relief in 2021 and he retired both batters he faced.The Atlanta offense continues to roll behind right fielder Ronald Acuna Jr. He went 1-for-3 with an RBI on Saturday and has reached base in 25 consecutive games, the longest active streak in the major leagues. He is four games shy of reaching his career best, set from June 25, 2021, to May 22, 2022.Baltimore's Santander was 2-for-4 with two doubles in the loss. Over his last five games, the right fielder is batting .435 (10-for-23). And in the eight games played on the road trip, he is hitting .382 (13-for-34) with three doubles, four homers, nine runs and 10 RBIs.Ryan Mountcastle went 2-for-4 on Saturday and has reached base in 15 consecutive games, the longest streak by a Orioles player this year and the second-longest of his career. He has hit safely in eighth straight and is hitting .351 (13-for-37) during that stretch.",
        "--Field Level Media"
    ]
}