{
    "articleURL": "/tvshowbiz/article-12059537/Neil-Morrissey-Line-Duty-star-Adrian-Dunbar-enjoy-playful-night-two-ladies.html",
    "content": [
        "Men Behaving Badly star Neil Morrissey and Line Of Duty star Adrian Dunbar let their hair down on Sunday night. ",
        "The cheeky duo were pictured leaving Park Theatre's 10th anniversary party in Finsbury Park where they enjoyed some  female company. Neil, 60, was pictured having a very animated conversation with one pretty brunette outside the venue as he moved in for a friendly kiss goodbye. The lady in question is Melanie Bond, the Co-founder and Creative Director of the theatre. Neil was previously married to Amanda Noar from 1989 - 1991 but it's not known if he is currently in a relationship.",
        "Adrian, 64, could be seen leaving the party with a bottle of champagne in hand, which was gifted to all guests that evening. He too was pictured larking around with a female friend who he linked arms with to help guide her outside as she carried a glass of champagne in hand. While outside, Adrian gave her a friendly kiss goodbye before heading home. There is nothing to suggest the pair are anything other than friends - Adrian has been married to Anna Nygh, an Australian actress and casting director, since 1986. They have a daughter called Madeleine together and Adrian once praised his wife for being the only person who could 'handle' him. Speaking on Radio 4 in 2021, Adrian opened up about how lucky he felt to meet Anna.",
        "He said: 'I don't know anyone else I could have hooked up with who could have handled me. I've got my woman and she's a very good one.The actor then said: 'I wouldn't let her down.'In another interview with the Daily Telegraph, Adrian - who plays Detective Ted Hastings, said his wife 'laughs' at his sex symbol status.",
        "He said: 'Everyone likes a man in a uniform, don't they? I was blindsided by that. I thought there would be a lot of things that would come off the back of this part, but definitely not being a sex symbol.' Tickets to the party were £500 each, which included food and drinks, as well as a  souvenir programme.Or guests could pay £15,000 and have the same experience but with Sir Ian McKellen hosted your table.And it looked like they were having a great time.  "
    ]
}