{
    "articleURL": "/femail/food/article-12057713/Home-bakers-obsessed-mums-incredible-two-ingredient-Coles-Nutella-cake.html",
    "content": [
        "Mum makes a delicious Nutella cake using only two ingredientsRead more: Bakers are going crazy over this 90c cake hackA mum has revealed how to make a delicious cake using just two ingredients - and it's left bakers everywhere 'obsessed'. ",
        "Claudia recently decided to spice up her son's lunchbox and decided to experiment with some ingredients in her pantry.The mum-of-three simply used Coles own-brand Nutella and four eggs to make the 'gooiest, chocolatiest, yummiest' cake ever.'This is so good,' she said as soon as she tasted a bite of the cake, which she admitted wasn't healthy.'So, so good. I'm not exaggerating.'The mum revealed that many urged her to try baking the cake, but she did not have a jar of Nutella at home. ",
        "'I'm a big believer in using what you have, but a few people said \"check this out,  make this, it's delicious\" so I just had to,' she said in a video.'I did go and buy the Coles one, and it was very cheap, and I'm sure a lot of people do have Nutella in their cupboard.'In order to make the cake, Claudia used one cup of the Coles hazelnut smooth spread and four eggs.She mixed the two ingredients in a bowl together to create a gooey consistency.'If 'trust the process' had a cover photo, it would be this,' she said. 'It is safe to say I won't be trying any of this cake mix.'The Queensland mum then put the mixture in the oven at 180C for 20-25 minutes.",
        "Claudia was immediately in awe of the cake's enchanting scent.'This smells so good,' she said",
        "Ingredients:1 cup Nutella (or a similar chocolate hazelnut spread)4 eggsMethod:Mix the hazelnut spread and eggs in a bowl and combine to form a mixture Place in a cake pan lined with baking paper Bake at 180C fan-forced for 20-25 minutes ",
        "Hundreds of others were wowed by the mum's two ingredient snack hack.'Lunch box mum queen!' a woman wrote. 'Thank you for this.'Another added: 'I'm so trying this - it looks so yummy.''I'm going to make this and eat it with a big scoop of vanilla ice cream,' said a third.But others weren't as impressed by Claudia's simple trick.'That looks like a weird chocolate quiche,' said one man.'I feel like it would taste too egg-y, and it doesn't look like a cake,' added another."
    ]
}