{
    "articleURL": "/wires/pa/article-12057449/Ex-British-Army-chief-uncomfortable-Government-s-Rwanda-policy.html",
    "content": [
        "The former head of the British Army has said he is “uncomfortable” with the Government’s plans to send migrants who enter the UK unlawfully to Rwanda.",
        "General Lord Richard Dannatt pointed to the “dark history” of the east African nation which he said is still cast in the “shadow of the genocide”.He accused the Home Secretary of running “down the remaining political capital of Rishi Sunak’s Government” with the “unpopular policy”. It’s not the sort of environment I would put people from Syria and elsewhere in the world into  Lord Dannatt  “The Government is entitled to bear down on people coming on small boats who are simply seeking a better life,” the crossbench peer told The Independent.“Whether sending people to Rwanda is the right policy, I have my doubts. It seems to be aimed at deterring others from coming, because there is a strong sanction against them. I’m uncomfortable with it.“I’ve been to Rwanda, and the shadow of the genocide there in the 1990s hangs over that country.”",
        "He told the online paper it is “ruled with a very firm hand” by Rwandan president Paul Kagame.“It’s got a pretty dark history, and it’s not the sort of environment I would put people from Syria and elsewhere in the world into.”The UK has agreed a multimillion-pound partnership with Rwanda designed to tackle the number of migrants coming to Britain via unauthorised routes.",
        "The £140 million deal will see some migrants who arrive on small boats via the English Channel sent to Rwanda, if they cannot be deported back to their home country.The plan has so far been stalled by legal action and no flights have taken off.Lord Dannatt said: “It’s somewhat surprising Suella Braverman is persisting with an unpopular policy… I fail to understand why the Home Secretary is continuing to run down the remaining political capital of Rishi Sunak’s Government.”"
    ]
}