{
    "articleURL": "/sport/football/article-12055145/Bernardo-Silva-adamant-Manchester-City-not-fear-Real-Madrid.html",
    "content": [
        "Man City won't be cowed by Real Madrid's Champions League reputationEven though Madrid pipped Pep Guardiola's side 6-5 on aggregate a year agoBernardo Silva insists there won't be any inferiority complex on TuesdayManchester City won't be cowed by Real Madrid's Champions League reputation when they face the Spanish giants again in a repeat of last season's epic semi-final.",
        "Madrid pipped Pep Guardiola's side 6-5 on aggregate a year ago and went on to beat Liverpool in the final for their record 14th European Cup — including five in the past decade.Yet City were the better side over the two legs and Bernardo Silva insists there won't be any inferiority complex when they visit the Bernabeu on Tuesday.'We have a lot of respect for them, yes, but not any fear at all. Why should we fear them?' said the influential Portuguese midfielder.'We'll try to keep the momentum we've built over two months to arrive very confident to beat them, knowing they won the Champions League last season for a reason.'",
        "Madrid's remarkable record in Europe gives them a psychological advantage over many opponents before a ball has even been kicked.But Bernardo dismisses history, saying City's focus will be on the star players Carlo Ancelotti has at his disposal.'It's not about the badge, It's never about the badge,' he insisted.'It's about the players that are on the pitch. If Madrid didn't have Modric, Kroos, Vinicius, Benzema — I could say all of them — they wouldn't win anything because the shirt doesn't do it on its own.'We'd be stupid not to respect them but we have that goal knowing we lost last year in tough circumstances. This time we will try to make it different.'",
        "City have famously never won the Champions League and are also bidding to emulate Manchester United's historic Treble of 1999.",
        "'We're not going to lie. This is definitely a competition we want because it's the only one we haven't won yet,' acknowledges Bernardo.'We're in a very good position to be fighting for all three trophies. The FA Cup final is a derby, it would be lovely for our fans. Then the Champions League is a trophy we'd really love, and the Premier League would be five in six years and we would go down in history.'I wouldn't be able to tell you which one I want the most. I want them all, a lot! And we're going to keep battling away, knowing that, yes, we could win them all, yet we could lose them all too.'The major difference between this year's semi-final and last is that City now have a striker in Erling Haaland to rival Real Madrid's Karim Benzema. The Frenchman scored in both ties against City 12 months ago."
    ]
}