{
    "articleURL": "/femail/article-12041957/Moment-lady-lake-killer-Donald-Robertson-plays-dumb.html",
    "content": [
        "Donald Robertson was charged with murder of Shani Warren in Taplow LakeREAD MORE: Cowardly 'lady in the lake' killer refused to come to court Unseen footage has revealed the moment a serial rapist remained stone-faced as he was told he'd been identified via DNA evidence in the 'Lady in the Lake' murder case. ",
        "Dark Waters: The Murder of Shani Warren, which airs tonight at 9pm on Channel 5, charts how police took 34 years to identify Donald Robertson, who raped the 26-year-old secretary, tied her up and left her to drown in Taplow Lake in 1987. Robertson, 67, was eventually tied to the crime in 2020 when police found his DNA on a cloth that had been used to gag Shani during the attack. He was found guilty and sentenced to life for the false imprisonment, indecent assault and murder of Ms Warren between April 16 and 19 1987 at Reading Crown Court last May, decades after the ordeal. Tonight's documentary has revealed the moment Robertson was told he'd finally  been linked to Shani's murder via a DNA sample, while serving time in jail for another crime. ",
        "In the clip, the convicted rapist showed no emotions as he was told by police that he has been identified as a suspect in the murder of the 26-year-old secretary. The short clip was recorded by an officer's bodycam in 2021, after the case was re-opened in 2020, and its forensic evidence re-examined. It shows a haggard-looking Robertson standing with police officers.  'I'm here on behalf of the major crime review team at Thames Valley Police in Milton Keynes,' an officer told him. ",
        "'Following a re-investigation of the murder of Shani Warren, whose body was found in Lake Taplow in 1987, forensic evidence has now been obtained that identifies you as a suspect.' The clip cut to Robertson as he asked the officer to 'clarify' something for him, before repeating Shani's name several times, as if to suggest he has no idea who she was.He then appeared to pretend to get her name wrong, asking officers: 'Shane Warren?'. Shani's body was found by a dog walker shortly after Easter Weekend 1987 - her wrists having been tied with a car jump lead and ankles bound by a tow rope.It took 34 years to identify her killer, with her parents tragically dying in 2021, before they could find out what had happened to their daughter. At the time the 26-year-old's body was found in Taplow Lake, Home Office pathologist Dr Benjamin Davis put forward the theory that Shani had tied her own hands and feet and taken her own life. ",
        "He failed to take a swab of Shani's mouth, which would have revealed the DNA of her attacker. Because Shani was fully clothed and showed no defensive wounds, police assumed she had not been sexually assaulted, even though her underwear was missing. Shani's family never believed she had taken her own life, with her brother Stephen saying in a voiceover heard in the documentary: 'We knew Shani was the last person you'd ever meet who'd want to commit suicide.",
        "'She was fired up. She was happy. She was looking ahead. She had everything to live for,' he added. ",
        "Due to Davis' oversight, which was later described as a 'significant and culpable omission,' Shani's murder remained unsolved until the gag was scientifically re-examined in 2020 and 2021, revealing Robertson's DNA. Principal investigator Pete Beirne, head of the Major Crime Review Team, admitted last year that 'had mouth swabs been taken it would have caused the investigation to have a different direction potentially'.'Lines of inquiry would have been looked at – people with convictions for serious sexual assaults. Robertson would have fitted in that category,' he said at the time. Dr Davis told an inquest in 1987 that Shani could have loosely bound her own hands and feet and then attempted to strangle herself before falling into the water and drowning. ",
        "Davis also claimed he had come across three other cases of women dying by suicide who had bound themselves, however, these cases were never found. 'I wish Dr Davis was alive today so that we could show him the experience that he got completely wrong. He made a huge mistake,' journalist Chris Cowley said in the programme. 'He brought extra distress to Shani's family. It was just this theory from this pathologist who said within the previous six months, he had witnessed three other cases of women tying themselves up and drowning themselves in a bath. ",
        "1977 – Attempted rape of a 15-year-old girl, jailed for five years but released April 19811981, July – Rape of a 16-year old girl. Arrested but let go1981, August – Rape of a 14-year-old girl. Jailed for eight years but released in October 19861987, April – Murder of Shani Warren1987, June – Rape of a 17-year-old girl1990, April – attempted rape of woman with baby. Jailed for ten years, released after six1997, March – indecent assault of an 11-year-old girl Jailed for five years2011 – Jailed for life with a minimum of eight years for 1987 rape following cold case review2022 – Further cold case review leads to his conviction for the murder of Shani Warren and rape of 16-year-old in 1981",
        "'We never found out who those people were and I still wonder to this day whether that was true,' he addedRobertson was convicted of the false imprisonment, indecent assault and murder of Ms Warren following his trial last year. He was also found guilty of the kidnap and rape of a 16-year-old girl, who cannot be identified, on July 16 1981.Police described 'evil' Robertson as someone with a 'long and horrific list of previous convictions' and said it is 'a regret' there was not enough evidence at the time to charge him with the teenage girl's rape in Farnham Lane, Slough.Just days after being released by police in connection with that offence, Robertson raped a 14 year-old girl who had been riding her bicycle in Farnham Royal, a crime to which he pleaded guilty in October 1981.In a similar vein, less than two months after attacking and killing Ms Warren and only a few miles from Taplow Lake, he raped a 17-year-old girl who was walking home having missed the last train.He is currently behind bars for that crime, having been convicted in 2010 after the incident was reviewed by the police's cold case team.The prosecution said new DNA evidence was the 'cornerstone' of the latest case against Robertson – with traces matching his found on the underwear of both victims as well as on a mouth gag used on Ms Warren.",
        "Police said they were sorry it had taken so long to bring her attacker to justice, but that the case coming to court was down to advancements in forensic science.Thames Valley Police's major crime review team's principal investigator, Peter Beirne, told the PA news agency: 'In relation to Shani's family I'd like to thank them for their support, thank them for their patience.'I'm sorry that it took so long to bring Robertson before the court, but we've only been able to do that as a result of advancements in forensic science. It was not as a result of any lack of effort on behalf of the police.'It was just that unfortunately, at that time, there was not the evidence to enable us to charge Robertson.'Mr Beirne branded Robertson an 'evil and dangerous' man and a 'predator' who had attacked women and girls 'throughout his adult life', subjecting them to 'the most horrendous acts'.He said Robertson's failure to attend his trial 'speaks volumes' to his character, labelling him 'a coward, (who) wasn't prepared to stand up and answer to the charges which were put before him'.He praised the victim of the rape for her 'strength of character' in going to court to give evidence during the trial.",
        "He said: 'I'd like to thank her for her bravery and courage in coming forward when we spoke to her, having to go through the ordeal of giving evidence before a crown court and also having to relive that horrific event which took place all those years ago.'The victim said she can 'finally get some closure' following the conviction, and thanked her family and officers for helping her pursue the case to justice as an adult.'The weeks leading up to the trial have been very traumatic for myself and my family, but with their support I found the courage and strength that I didn't have as a 16-year-old to pursue the case against the monster that put my life in turmoil,' she said.She added: 'Justice has been done and I can finally get some closure. So to anyone that finds themselves in a similar situation, don't be afraid to ask for help, be strong and with your courage and the right support you will get through the trauma.'Robertson did not give evidence in his defence, and his lawyer called no witnesses but claimed another convicted rapist guilty of crimes around that time involving tying women up and attacking them could have been the culprit."
    ]
}