{
    "articleURL": "/sport/nba/article-12057557/Philadelphia-76ers-stave-Bostons-comeback-attempt-beating-Celtics-116-115-overtime.html",
    "content": [
        "James Harden knocked through a late 3-pointer in overtime to win the gameBoston's Marcus Smart couldn't get his game-winning shot off in time DailyMail.com provides all the latest international sports news Despite a strong comeback attempt from the Boston Celtics, the Philadelphia 76ers were able to hold on to win 116-115, tying the Eastern Conference Semifinals up at two games a piece thanks to a James Harden game-winning 3-pointer in overtime.",
        "The Sixers had a lead as large as 16 points at one mark of the third quarter and went through periods of losing momentum and then gaining it right back from the Celtics.However, the fourth quarter started slow for both teams as only one basket was scored in the first three minutes of action. Then Boston went on a dominant run, taking the lead with 3:51 to go. The game stayed close throughout the final four minutes - with a late James Harden floater tying the game at 107. Marcus Smart’s last chance 3-point attempt fell short and the game went to overtime.",
        "There, a Harden 3-pointer from the corner with 18 seconds remaining put the Sixers ahead. Celtics coach Joe Mazzulla chose not to call timeout and Smart's 3-point shot went through the net, but was released too late.It was a strong effort from the Celtics that saw them mount that comeback, but despite Jayson Tatum’s team-leading 24 points, 18 rebounds, and six assists, they couldn’t close out the game. It was a great team effort from Boston, as all five starters managed double digit points. Malcolm Brogdon put up 19 points, eight rebounds, and two assists off the bench.But Philadelphia’s two superstars stole the show. James Harden’s 42 points, eight rebounds, and nine assists led the team while Joel Embiid also finished with 34 points, 13 rebounds, and four assists.",
        "They went to overtime tied 107-all after Smart was short on a 3 at the horn that was one of the few clutch shots Boston missed in the quarter. The Celtics trailed by 15 points with 2 minutes left in the third before they sucked the life out of the Wells Fargo Center.The fun began when Smart and Jaylen Brown buried consecutive 3-pointers and Jayson Tatum attacked the rim for a bucket that wiped out an eight-point hole in 90 seconds. ",
        "Al Horford put them ahead 98-90 - on a possession that started on the other end when Tyrese Maxey had his shot blocked - and shimmied for the crowd as boos rained on him.Yes, the 76ers had home court but fans tensed up as memories all those second-round exits since 2001 stirred inside the building. Smart and Malcolm Brogdon hit consecutive 3s for a 105-100 lead.But it was P.J. Tucker, the heart and guts of the Sixers, who again did the dirty work on a defensive rebound a bucket. He made the free throw with 1:05 left and the tie game gave them new life."
    ]
}