{
    "articleURL": "/wires/ap/article-12044719/Acu-Jr-homers-Braves-deep-6-times-rout-Marlins-14-6.html",
    "content": [
        "MIAMI (AP) - Marcell Ozuna hopes his two-homer outing against the Miami Marlins is the spark that he needs to break out of his early season slump.",
        "Ozuna hit a grand slam among his two home runs, Ronald Acuña Jr also homered and the Atlanta Braves went deep six times to roll past the Marlins 14-6 Wednesday night.\"Sometimes you have to put your head down, but always in your mind you have to keep your head up and keep grinding,\" said Ozuna, who is batting just .111 so far this season. \"For me it's hard, a hard moment starting the season, a hard April for me. I have to go out, new month and say, 'let's go' and do my best.\"Ozuna hit the seventh grand slam of his career - and Atlanta´s first of the season - during a seven-run second in which the Braves sent 12 batters to the plate against starter Braxton Garrett (1-1).Ozuna also had a solo homer in the third and was 3 of 5 with five RBIs.Acuña´s three-run shot to center field in the fifth inning was his sixth home run of the season. It went 461 feet to center field and made it 11-4 before Austin Riley homered to left-center to add two more runs.",
        "Only the Tampa Bay Rays and Los Angeles Dodgers have more home runs so far this season than the Braves (52). Acuña, April´s National League player of the month, has powered Atlanta (21-10) at the plate. He´s hitting .358 and leads the majors with 43 hits and 14 stolen bases.",
        "Michael Harris II had a two-run homer in the second, and Ozzie Albies added an RBI double. Albies was 4 of 5 with two RBIs and had a solo shot in the eighth. He leads Atlanta with eight home runs this season.The Marlins got six hits and four runs off starter Kyle Wright, who left in the third with right shoulder soreness after giving up three straight hits to Yuli Gurriel, Luiz Arraez, and Jesús Sánchez.Garrett allowed 14 hits, 11 runs, four home runs, walked two and struck out three in 4 1/3 innings before Devin Smeltzer replaced him.\"That's one you just want to forget about right away,\" said Marlins manager Skip Schumaker. \"Up and down we just kind of got our butts kicked today.\"Arraez, the league leader in batting average (.432), was 1 for 3 with an RBI double in the third that made it 8-3.Collin McHugh (1-0) replaced Wright and allowed three hits in three scoreless innings.Sánchez hit a two-run shot to center in the seventh.EXTRA RESTSnitker said the Braves plan to have ace Max Fried start against Baltimore at home Friday instead of Thursday at Miami.\"With all these off days, there´s a lot of balls in the air,\" Snitker said. (Atlanta had two games postponed because of rain over the weekend.) \"Just trying to stretch these guys and not give them too much rest - and enough rest.\"",
        "Snitker added that there are no concerns with Fried.ROSTER MOVESThe Marlins recalled OF Peyton Burdick and selected the contract of LHP Devin Smeltzer from Triple-A Jacksonville. RHP Johan Quezada was designated for assignment.TRAINERS ROOMBraves: Harris left after landing awkwardly on his right leg in the sixth. He walked off the field under his own power, and Snitker said he doesn't expect him to go on the injured list.Marlins: INF Garrett Cooper went on the 10-day injured list with an inner ear infection. ... RHP JT Chargois (right oblique) threw a 25-pitch bullpen Tuesday. ... RHP Tommy Nance (right shoulder) threw 20-pitch live bullpen Wednesday.UP NEXTLHP Jesús Luzardo (2-1) will start for Miami in the series finale. Dylan Dodd (1-1) will start for Atlanta.___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}