{
    "articleURL": "/wires/reuters/article-12050451/Investors-irked-Glencores-stance-thermal-coal-AGM-vote.html",
    "content": [
        "Investors seeking more information on thermal coal plans",
        "Glencore calls on shareholders to reject resolutionLGIM's Marks says 'fundamental lack of willingness to engage'By Simon Jessop and Clara DeninaLONDON, May 5 (Reuters) - Investors pushing for more transparency on miner Glencore's thermal coal production said its decision not to support a shareholder resolution on the topic showed a \"fundamental lack of willingness to engage\".Britain's largest asset manager Legal &amp;amp; General Investment Management and the fund arm of lender HSBC were among those to file the request seeking detail on how its output plans aligned with the world's climate goals.In a statement this week, however, Glencore said it opposed the motion, believing it was unnecessary given existing strategy disclosures; lacked clarity and specificity and risked undermining the board's responsibility for its climate strategy.Unlike its peers, Glencore mines and trades thermal coal, the fossil fuel used to generate electricity. It has said it plans to responsibly run down its coal mines by the mid-2040s, closing at least 12 by 2035.Ahead of the May 26 annual general meeting vote, the investor group, with combined assets of nearly $3 trillion, voiced its displeasure.\"There is a fundamental lack of willingness to engage,\" said Michael Marks, LGIM's Head of Investment Stewardship and Responsible Investment Integration.\"It is deeply frustrating for investors that the only meaningful feedback on such a material issue is being conducted via the notice of a meeting, rather than in engagement discussions,\" he added.",
        "Vincent Kaufmann, CEO at the Ethos Foundation, which represents a number of Swiss pension schemes, said getting the extra information was crucial to assess Glencore's role in the transition to a low-carbon economy.\"It is important therefore that all shareholders of the company support this resolution.\"Just 24% of investors voted against Glencore's climate progress report at the miner and trader's 2022 AGM, with some citing slow progress in scaling back coal production. (Reporting by Simon Jessop Editing by Keith Weir)"
    ]
}