{
    "articleURL": "/tvshowbiz/article-12042505/Molly-Mae-Hague-says-daughter-finds-hilarious-shows-bold-dance-moves.html",
    "content": [
        "Molly Mae Hague said that her baby daughter Bambi finds her 'hilarious' as she broke into an energetic dance on TikTok on Wednesday. ",
        "The former Love Island beauty, 23, showed off her head turning dance moves while her 14-week-old bundle of joy watched on adorably giggling from a baby chair. The influencer was seen twerking and moving her arms in the air as she performed for her little girl in the living room of her £3.5m Cheshire mansion.She cut a casual figure in the sweet clip in an oversized brown T-shirt which she teamed with a pair of black leggings and £1,580 mink Louis Vuitton slippers. The mum-of-one pulled her long blonde tresses back into a neat bun and accessorised with a pair of chunky gold earrings. ",
        "Meanwhile, Molly-Mae dressed daughter Bambi, who she shares with boyfriend and boxed Tommy Fury, also 23, in a cute white baby grow.  She wrote: 'My child thinks l’m hilarious. The end.' It comes after Molly-Mae revealed that she spent three days dressed in pyjamas, while enjoying the 'laziest bank holiday ever' with baby Bambi.The former reality star took to Instagram where she uploaded a selfie to her Stories, showing herself dressed in sleepwear.Ever the fashionista, Molly-Mae opted for a chic brown long-sleeved ribbed pyjama set, and sat on the floor with one of her beloved cats for the mirror shot.The new mum captioned the photograph: 'I've been in pjs for 3 days.'",
        "Molly-Mae also shared a sweet snap of her daughter on her play mat, whilst the influencer tucked into an egg and bacon bagel, and an iced coffee.Also posting the shots to her house account, the PLT creative director added: 'Moments from the laziest bank hol ever.'",
        "Still wearing her pyjamas, Molly-Mae then spoke to her followers in a video, where she reiterated that she had enjoyed 'the laziest bank holiday ever.'She admitted: 'For the life of me, I cannot remember the last time I came on my story and spoke, like I actually feel weird about this because it's been so long.'Hope you're all doing well, this has literally been me for three days straight. I have had the laziest bank holiday ever, it's been unreal.'"
    ]
}