{
    "articleURL": "/tvshowbiz/article-12048325/Im-Celebrity-South-Africa-Joe-Swash-compares-Fatima-Whitbread-wife-Stacey-Solomon.html",
    "content": [
        "Joe Swash likened his I'm A Celebrity campmate Fatima Whitbread to his wife Stacey Solomon as they can both order him around without him realising.",
        "During Thursday's episode, Fatima woke up Joe while the campmates were asleep and asked him to put logs on the fire.The former EastEnders actor obliged and got out of bed but admitted in the Bush Telegraph he didn't understand why Fatima couldn't just put the logs on herself if she was already awake.However, soap star Joe said he did as she asked as he has a 'soft spot' for the former Olympic athlete. He said: 'If you're awake, just chuck the wood on the fire? But it's Fatima, she gets away with it. I do feel love for Fatima.'",
        "Fatima later dished out which campmates would handle the daily chores and wrote them all out on a witeboard.The former javelin thrower went around to each campmate and explained why she had given them each task.In the Bush Telegraph, Joe said: 'Stacey's the only other woman who could boss me around in a really nice way and without me realising I'm being bossed around, which is really clever.'It comes as Stacey admitted she forgot to watch her husband's triumphant return to the jungle this year.Speaking on Instagram, she said: 'I will be honest with you both of us forgot he was even in it, so we missed it yesterday.'",
        "However, the star insisted they would catch up soon and watch the show in bed together.She added: 'He filmed it so long ago and we've both got baby brain right now and completely forgot about it.'The actor first appeared on the ITV reality show in 2008 where he was crowned King of the Jungle.",
        "Joe, who shares Rex, three, and Rose, 17 months, with Stacey, 33, as well as Harry, 16, with his ex-partner Emma Sophocleous, is going back in for the sake of his children. Former X Factor finalist Stacey also won 2010's series, beating Shaun Ryder to the top spot, and went on to host the Extra Camp after show with Joe.He said: 'I'm A Celebrity holds a big place in my heart. I won it and I was lucky enough to go on to present the spin-off series on ITV2 for ten years.'I met Stacey whilst I was out in Australia and me and Stacey have now married and we have had kids. Doing the all-stars series is closure. It finishes off the circle.'",
        "'Stacey is over the moon about me doing it. The jungle holds a big part in both our hearts. Without the jungle, we wouldn't have each other.'In a way, we owe it to the jungle to say goodbye. My eldest son, Harry, was one when I did the jungle and he is 16 now!",
        "'I want the kids to watch I'm A Celebrity… South Africa and for both of us to be able to tell them, \"I'm A Celebrity is where mummy and daddy met.\"'The jungle is always going to be a big part of our family.'I can't express enough my gratitude for the fact I met Stacey on the back of it, had my kids and it gave me a whole different direction with my career.'"
    ]
}