{
    "articleURL": "/wires/ap/article-12047177/Italian-minister-scraps-trip-French-officials-remarks.html",
    "content": [
        "MILAN (AP) - Italian Foreign Minister Antonio Tajani on Thursday abruptly canceled a trip to Paris, calling \"unacceptable\" remarks by the French interior minister criticizing the Italian premier´s migration policy.",
        "Italy had demanded clarification of the remarks by French minister Gerald Darmanin to RMC radio blaming Italian Premier Giorgia Meloni for increasing numbers of migrants, notably minors, at the French-Italian border.Darmanin told the broadcaster that Meloni \"is incapable of resolving the migration problems for which she was elected.\" He also accused her of \"lying to the population,\" a \"vice\" he said that was shared by the far-right.The remark was both a dig at Meloni and French far-right leader Marine Le Pen, noting that Meloni was elected by Le Pen´s \"friends.\" The president of Le Pen´s National Rally had visited the border area on Wednesday, seemingly to revive the migration issue.Darmanin's comments came as Tajani was preparing to fly to Paris to meet with his French counterpart. The Italian foreign minister said the \"offenses\" launched by the minister against the Italian government weren't in \"the spirit in which shared European challenges should be faced.\"The French Foreign Ministry backed off of Darmanin´s remarks, saying that French-Italy ties are \"founded on mutual respect, between our two countries and between our leaders.\" The statement said the French government wants to work with Italy on the issue of migration, particularly in the central Mediterranean, in a spirit of solidarity, in a reference to Tunisia.",
        "Italy and France have sparred over migration police since Meloni took office last year as Italy´s first post-war far-right leader. Her government ushered in hardline policies on migration, including standoffs with humanitarian rescue ships. Tensions spiked last fall after Italy forced France´s hand to accept the Ocean Viking with 234 migrants aboard, after Italy had refused it port for weeks.Italy's defense minister, Guido Grosetto, who is one of Meloni's closest associates and a staunch supporter of her emphasis on national sovereignty, insisted Darmanin should apologize to both the Italian government and to Meloni.\"This strange and incomprehensible habit of some exponents of European governments to try to interfere in Italian public life today crossed the alert level,'' Crosetto said in a written statement released by his ministry.The Italian minister added: \"It doesn't take a genius to understand that to damage the relations between founding nations of the EU (European Union) cannot but weaken each of us.\" He said Italy would like to discuss \"even with France\" how to solve immigration problems \"in a serious and common way, not squabble in public to obtain a newspaper headline or one more vote.\"___Elaine Ganley reported from Paris. Frances D'Emilio contributed to this story from Rome."
    ]
}