{
    "articleURL": "/news/article-12045251/Second-teenager-charged-Maryborough-crash-killed-three-people-Queensland.html",
    "content": [
        "On Sunday a three-car crash killed three women Bundaberg teen, 13, accused of causing the crashSecond teen, 13, accused of helping steal car he drove  A second teenager has been charged over the theft of a luxury car later involved in a deadly crash in Queensland that claimed three lives.",
        "Police allege the Mercedes-Benz was stolen from a Maryborough home in Queensland on Sunday before being involved in the horrific collision that killed three women.Nurse Sheree Robertson, 52, Kelsie Davies, 17, and pastor Michale Chandler, 29, were all killed.A fourth woman, Kaylah Behrens, 23, who was in the car with Ms Davies and Ms Chandler, survived the impact but remains in critical condition.",
        "The alleged driver - a 13-year-old boy from Bundaberg - has been refused bail charged with three counts of dangerous driving causing death.Police say a second teenager, also 13, helped steal the car but was not in the vehicle at the time of the fatal crash.The Maryborough teen is expected to face court on charges including unlawful use of a motor vehicle and possessing dangerous drugs later this month.Police have found no evidence a passenger ran from the alleged stolen Mercedes-Benz after the crash.It's alleged the Mercedes-Benz was stolen from a home on Dalhousie Street, 2.5km from the crash site, at 8.40pm on Sunday.CCTV footage showed two hooded figures taking the car.Police believe the car was then driven around Maryborough and Hervey Bay before it collided with a Holden travelling south on Saltwater Creek Road at about 10.45pm.The force of the crash then sent the Holden into a Mazda that was driving in the opposite direction. ",
        "Former Riverside Christian College student Kelsie Davies, 17, and Reach Church pastor Michale Chandler, 29, were in the Holden and died during the crash.Kaylah Behrens, 23, was the third person travelling in the Holden and has been left severely injured. As of Tuesday morning, she remained in a critical condition.",
        "Maryborough Hospital nurse Sheree Robertson, 52, was driving the Mazda home after her shift and was killed. A GoFundMe by Reach Church had raised $59,213 for the four women's families by Thursday afternoon, including a $4,000 donation from another local church.The 13-year-old charged driver was treated for minor foot injuries following the horror crash before he was taken into custody at Maryborough watch house. The tragedy has sparked widespread community outrage as the state government continues to defend the response to youth crime.Currently, Australian children aged between 10 and 14 are subject to criminal law so long as it can be proven they had the capacity to understand their actions.However, a 2020 report from the Standing Council of Attorneys-General found children under the age of 14 do not have this capacity so should not be punished under the same laws as those who do - meaning they are not criminally responsible. "
    ]
}