{
    "articleURL": "/femail/article-12054493/Coronation-style-Celebrity-stylist-MIRANDA-HOLDER-gives-verdict-royal-ensembles.html",
    "content": [
        "Royals and celebrities flocked to Westminster Abbey in stunning ensemblesREAD MORE: King Charles Coronation LIVE: Millions tune into CoronationRoyals and celebrities flocked to Westminster Abbey yesterday, to watch the coronation of King Charles.",
        "As the pageantry of the coronation took place royal fans were drawn to the fashion spectacle. From Camilla's signature silhouette gown to Kate's ancient Greece-inspired ensemble there was plenty of sophisticated style on show. While celebrities such as Katy Perry didn't quite hit the mark with her gown but her hat saved the overall look.Here Celebrity stylist MIRANDA HOLDER gives FEMAIL her verdict on the royal ensembles...The Princess of Wales ",
        "Kate and the Duchess of Edinburgh both wore long white dresses no doubt inspired by the traditional court dresses traditionally worn by Windsor Wives at previous Coronations, topped with patriotic blue and red robes.Kate was singled out as our future Queen, as she was wearing a sparkling ‘crown’ of silver leaves, a nod to the King and Queen’s love of nature perhaps? The look, created by McQueen in collaboration with Jess Collet felt rather ancient Greece-inspired and was no doubt intended to be the least offensive alternative to a real Tiara, Kate also gave us a nod to her late mother in law Diana, by wearing her pearl and diamond drop earrings - a vision in red white and blue.Kate’s dress was by Alexander McQueen, which is probably her favorite designer with Sarah Burton's contemporary meets classic aesthetic the perfect tone for such a historic occasion. ",
        "With much controversy surrounding whether the Princess would or wouldn’t wear a Tiara, I thought this sparking headpiece was the perfect sidestep in reaction to a potentially tricky sartorial situation.I can’t wait to get an even closer look at Kate’s outfit as I have no doubt the work by McQueen will be just as exquisite as her wedding gown.Although Kate looked breathtakingly beautiful at the event, this was not really her moment to shine on the style front and she gracefully stepped back, allowing full focus to be on the newly crowned King and Queen. Despite Kate’s demure approach, I can’t help but get excited about her honouring her favourite British designer who without fail gives us a masterclass in fashion in its purest original essence - as an artform - every time, wearing that glorious gown with such grace and beauty whilst always making it look effortless. Kate fused ancient tradition with the modern world perfectly, keeping her signature style consistent even at the most momentous of occasions.The ingenious bespoke headpiece, that stunning halo of silver leaves, which was another fashion Royal first, together with her simple but striking couture gown, topped with her patriotic garter robes made it a true fashion moment for Kate.Zara Tindall",
        "Zara looked as if she was off to a wedding, stepping out in a feminine pale blue coat dress with coordinating shoes, hat and bag. The ensemble was more feminine and softer than many of Zara’s previous formal occasion looks and somehow felt very grown up. Perhaps the Princess has finally settled on a ‘signature style’ - a style hack that has worked wonders for the late Queen, Camilla and of course Kate. Queen Letizia of Spain",
        "Queen Letizia of Spain looked just fabulous in typical fashionable form, wearing a candy pink peplum suit complete with pencil skirt and dramatic domed hat - one of my absolute favourites so far! The Spanish Monarch is always one to watch and always blends high-fashion with refined regal glamour. Unlike other Royals she is not afraid to dress in younger styles whilst still managing to adhere to the - admittedly more relaxed- Spanish Royal style etiquette - either way, her outfits are always delightfully refreshing.We were treated to some beautiful, eye-catching national dress, the King and Queen of Thailand arrived looking composed, smiling in their richly embroidered blue, the Queen’s tunic brought bang up to date by some sky high silver stilettos - I just loved this fun touch!Princess Beatrice",
        "Beatrice’s outfit was a standout for me, looking radiant in a figure-hugging magenta dress, perfectly complimented her titian hair which positively glowed from her halo of a golden headband which is the second closest we’ll get to a Tiara following Kate’s show-stealing look. ",
        "I really loved this look, after a rocky start in her younger years, the Princess’s fashion sense is growing and she is becoming ever more sophisticated. She proved herself to be the epitome of chic.Queen Camilla  ",
        "Camilla looked nervous but resplendent sitting beside her husband in the carriage, the first glimpse of her gown showed a white fabric embellished with silver embroidery, with her robe of state nestled over her shoulders.The gold embroidery looking glorious against the ornate gold of the State carriage.. The neckline was the perfect depth to showcase the magnificent Coronation necklace which was made for Queen Victoria has been traditionally worn at every coronation by the Queen ever since.Once Camilla enters the Abbey the excitement peaks as the world gets a close up look of her much anticipated gown, designed by Couturier and close friend Bruce Oldfield, who also worked closely with Diana during her time as a working Royal. The Queen looked nothing short of magnificent, the full length gown sitting perfectly on her frame, her added height being 5 ft 7 creating a vision that was positively statuesque. The almost full length central pleat that extends down the front of the garment adding flattering elongation and just a little bit of drama.",
        "The gown was in Camilla’s signature silhouette, a modest neckline, elongated waist which lengthens her torso, softly nipping her in at her middle and extending all the way to the floor with her favourite bracelet sleeves adding a flattering feminine flourish and showing off the slimmest part of her body, her wrists which makes the outfit even more flattering. I thought the Queen looked just glorious and was delighted that she remained faithful to her own personal style - it showed her off perfectly.Princess Charlotte",
        "Princess Charlotte coordinated with her mum in a sweet white McQueen caped dress and floral headpieces, an adorable ‘mini me’ and classic Wales family coordination, presenting that ever-united front to the world. Whilst her behaviour was immaculate, seeing Charlotte so dressed up in her finery gave us all a glimpse of what the third heir in line to the throne may look like as a future Queen, with her look striking just the right balance between girly prettiness and more grown up sophistication.Princess Eugenie",
        "Eugenie, proudly nursing her ever-growing baby bump looked understated in head to toe navy, again opting for the ever-chic monochrome option. The look, despite the smock dress, long coat and glittering diamonds felt a little severe, aged the Princess and on the fashion front left me cold.",
        "The Duchess of Edinburgh",
        "Sophie looked majestic, her blue red garter robes worn over a long white Suzanah gown - no tiara of course, just a relatively modest white hat. This was typical Sophie, dressing as she conducts herself within the firm - no screaming, shouting or drama, just subtle sophistication, modesty and excellence. Sophie is a very classic dresser, her wardrobe being more accessible than that of her Royal counterparts and although perfectly executed it was also instantly forgettable. Katy Perry",
        "Katy Perry looked patriotic but crumpled in a pale pink skirt suit which was a little pale for her complexion but her fabulous globe-like hat saved her look, as did the multi-strand Vivienne Westwood pearl choker finished with an on-brand globe topped with a cross resembling several pieces if the Royal Coronation paraphernalia we will see during the ceremony. She also sported long pink opera gloves, a fashion-forward touch - an accessory which was also controversially worn by Kate at the BAFTAS - overall, I really think she could have done better - maybe I should offer her a styling appointment with me?!Finnegan Biden ",
        "Jill Biden’s Granddaughter Finnegan took a leaf out of the late Queen’s style book, looking stunning in monochrome wearing a dramatic lemon cape dress with matching accessories, if the outfit wasn’t Victoria Beckham it was definitely VB inspired and was unusually elegant."
    ]
}