{
    "articleURL": "/news/article-12059793/Robert-Kennedy-Jr-blames-CIA-assassination-JFK-claims-reasonable-doubt.html",
    "content": [
        "White House contender says there is 'overwhelming evidence' of CIA cover upKennedy has previously cited links between the CIA and Lee Harvey OswaldSaid he was running because he felt his 'party had been stolen' by neoconsDemocratic White House contender Robert Kennedy Jr. has repeated the conspiratorial claim that the CIA assassinated President John F. Kennedy.",
        "The anti-vaxxer said it was 'beyond reasonable doubt' that the agency was responsible for murdering his uncle in Dallas, Texas in 1963.He told John Catsimatidis on WABC 770 AM's 'Cats Roundtable' that 'the evidence is overwhelming that the CIA was involved in the murder and the cover up'.Kennedy Jr., who has previously promulgated false claims about the dangers of Covid vaccines, cited 'JFK and the Unspeakable', a book by James Douglas, as the best distillation of documentary evidence, which he claims proves the CIA's involvement.The agency's website references an article describing the allegation that it orchestrated the assassination as a 'lie'.",
        "The US Government's official investigation into the killing, the Warren Commission Report of 1964, found that Lee Harvey Oswald acted alone and there was no credible evidence linking him to a wider plot.This is not the first time Kennedy Jr. has claimed the CIA was responsible for his uncle's murder. Last year, he cited the theory that Oswald was a 'CIA asset', during an interview with The Megyn Kelly Show.He also retweeted a clip of former Fox News host Tucker Carlson giving his view on the CIA's alleged involvement, alongside the caption: 'The most courageous newscast in 60 years. The CIA's murder of my uncle was a successful coup d'état from which our democracy has never recovered.' ",
        "Researchers examining the JFK assassination last year claimed to have discovered evidence Oswald was involved in an operation by the CIA months before the fatal shooting.Jefferson Morley - an expert on the assassination with the Mary Ferrell Foundation - told reporters that he and attorneys with the foundation had found documents that showed 'the CIA knew far more about the lone gunman than they are admitting even today'.His bold claim came a month before The National Archives released thousands of previously classified documents collected as part of the official investigation into the assassination.The move was a bid to restore faith in the transparency of government following the pandemic and to dispel myths surrounding JFK's killing.Public polling shows a majority of Americans do not believe the Warren Commission's finding that Oswald acted alone.The CIA said in a series of statements that many of its records released in the latest batch post-date Kennedy's shooting and do 'not change the historical record and has no bearing on the assassination or the investigation itself'.'Likewise, we are not aware of any documents known to be directly related to [Lee Harvey Oswald] that have not already been made part of the Collection,' an agency spokesperson said.",
        "The fact that the CIA knew of Oswald is not a smoking gun - as it had already been revealed that the Government knew more about the circumstances surrounding the JFK assassination than it had acknowledged publicly.",
        "And its existence does not prove a CIA plot to kill the president, as some theories have claimed.During the interview with WABC, Kennedy Jr. also laid out the 'fundamental differences' between himself and President Joe Biden, his 'close personal friend' and rival for the Democratic presidential nomination.In particular, he claimed the 46th US President had allowed foreign policy to be dictated by the same neoconservative ideology that plunged the country into the Iraq War, comparing that disastrous campaign to the current war in Ukraine.'I feel like my country is being stolen and my party is being stolen and I feel like I need to speak out against that,' he said.Kennedy Jr. described President Biden's policy in 'expanding' the war in Europe as 'misguided and extremely dangerous'.'We went in there on a humanitarian mission - we were told - and yet that mission has now changed to a broader mission to degrade and exhaust the Russian Army,' he added.'We are playing the Ukraine in a geopolitical proxy war with the Russians…Ukraine lives are being sacrificed.'",
        "The former environmental lawyer also hit out at costly lockdowns and policies that had waged a 'war' against middle class Americans, claiming the Democrats had 'become the party of big corporations'.",
        "Asked about the current border chaos, the 69-year-old argued for 'closed borders' but an expansion of legal immigration.'It's not racist or insensitive to say that we need to close our border and have an orderly immigration policy,' he said.'I would expand legal immigration to this country that is orderly and makes sense to our country. But I would make sure also that our borders are impervious. The humanitarian crisis that we now have on our border is cruel to people who have been drawn there by these open border policies.'",
        "MULTIPLE GUNMEN AND UMBRELLA MAN",
        "Two events in 1976 triggered the reexamination of the Warren Commission's original finding that Oswald acted alone: the Watergate scandal, which shook the public's faith in government, and the release of the Zapruder film showing JFK's assassination itself.A House Select Committee agreed with the Warren Commission in finding no evidence of Soviet, Cuban, or CIA involvement, but it did conclude that there was 'probably' a conspiracy involving a second gunman on the 'grassy knoll'.This was later disproved, but it created doubt in the public's mind.It gave rise to 'Umbrella Man' - a theory claiming a mysterious man holding a black umbrella on the day of Kennedy's assassination had fired a poison dart into the President's neck, paralyzing him before Oswald dealt the fatal blow.Oliver Stone's 1991 film 'JFK' depicted Umbrella Man sending signals to fellow assassins.But in 1978, the Umbrella Man himself, Louie Steven Witt told the House committee that the umbrella was a 'bad joke' aimed at Kennedy's father, Joseph, who had supported British Prime Minister Neville Chamberlain's policy of appeasement in the lead up to WWII.A black umbrella was Chamberlain's trademark.LBJ",
        "It has frequently been claimed that the CIA was involved in the assassination, with some theories even suggesting it had been directed by Lyndon B. Johnson.This also featured in Oliver Stone's film and was the thesis of another Stone, Roger, a political consultant and Trump aide.Experts have dismissed the theory as 'ridiculous' and 'contrived'.THE SOVIETSThere has long been fevered speculation surrounding Oswald's two and a half years in the Soviet Union from 1959 - and his trip to Mexico City two months before the assassination.In 1993, The Washington Post reported that Oswald was in contact with Valery Kostikov, a KGB officer who worked for the agency's Department 13, which was in charge of 'sabotage and assassination'.Some theories claim American intelligence agencies knew of Oswald's Soviet plot to bump Kennedy, but allowed it to happen because they wanted him killed.Experts have countered that the Soviets found President Kennedy easier to work with than Johnson.The CIA, FBI, Warren Commission and House Select Committee all ruled out Cuban or Soviet involvement.",
        "TED CRUZ'S DADDonald Trump's bid to tie his Republican rival Ted Cruz to JFK's assassination took circumstantial evidence to new levels.The former president, who was vying with Cruz for the Republican presidential nomination at the time, referenced a 2016 National Enquirer article headlined: 'Ted Cruz Father Linked to JFK Assassination!'It contained a photo that showed Oswald and Rafael Cruz distributing pro-Castro leaflets in New Orleans in 1963, the tabloid claimed.In an interview with Fox News in 2016, Trump said: 'His father was with Lee Harvey Oswald prior to Oswald being, you know, shot.'I mean the whole thing is ridiculous. What is this? Right? Prior to his being shot. And nobody even brings it up. I mean, they don't even talk about that — that was reported. And nobody talks about it.'"
    ]
}