{
    "articleURL": "/news/article-12043429/Airbnb-axes-junk-fees-App-lets-users-total-price-upfront.html",
    "content": [
        "Airbnb now gives users the option to see the total price of a place upfrontUsers complained about cleaning fees - while also doing the laundry themselves Firm also launched 'Airbnb rooms' service to allow guests to book singular budget rooms in households Airbnb has waged a war on junk fees in a raft of sweeping measures to make its short-term rentals more affordable and convenient.",
        "From today all Airbnb users can switch the app to display the total price of a room upfront so they aren't stung by hidden administration costs right before check-out. Guests have frequently gone viral for complaining they had been made to do chores on their vacation - when they had already paid cleaning fees of more than $100. Under the new changes, hosts will also be forced to state upfront the chores it expects guests to do upon check-out.A spokesman said that tasks would be 'clearly displayed on the listing page before a guest books a listing. ",
        "'Guests are also reminded of the listing checkout instructions the day before departure, and listings with repeated low ratings from unreasonable chores will be removed from Airbnb.'It comes after President Joe Biden announced a crackdown on America's 'junk fee' economy with plans to target surcharges imposed by airlines, hotels and events hosts.Airbnb was created in 2007 when roommates Brian Chesky and Joe Gebbia started renting out air mattresses in their San Francisco living room. Originally it just offered spare rooms in households who needed some extra cash. In 2009 it expanded into full properties. But the firm has come under repeated scrutiny for the explosion in 'hidden fees' and cleaning chores that guests have been subjected to.",
        "Cleaning costs shot up by 28 percent on average due to increased hygiene protocols, according to a study by Forbes Advisor. At the same time hosts have been known to ask guests to strip the beds, do the laundry and even mow the lawn during their stay.  Last November Chesky accepted the criticism of the extensive cleaning fees.'You shouldn’t have to do unreasonable checkout tasks, such as stripping the beds, doing the laundry, or vacuuming.'But we think it’s reasonable to turn off the lights, throw food in the trash, and lock the doors – just as you would when leaving your own home.'",
        "The firm also announced that it was returning to its roots by refocusing on renting out single rooms in homes for budget prices. Its new feature Airbnb Rooms aims to target travelers on a tight budget amid soaring living costs. A new range of filters on the app will let users see how much they would save by renting a room rather than a whole building. More than 80 percent of rooms under its 'Private Rooms' feature are under $100 a night, the firm said. Chesky said the new rooms function was the 'soul of Airbnb.'All in all Airbnb introduced more than 50 new features based on feedback from its users. ",
        "These included: improved maps to show where a property is, a new partnership with Buy Now Pay Later service Klarna for US guests and instant rebooking credits for hosts who cancel on their guests within 30 days of the trip.",
        "Total price display Guests can view the total price with fees, before taxes, across the entire app including in search results, price filter, maps, and listing pages.Transparent checkout instructions Guests can now view checkout instructions on the listing page before booking, and they’ll receive a reminder before they leave the home. During the review process, guests can tell us about any excessive requests. And listings with repeated low ratings from unreasonable chores will be removed from Airbnb.Improved maps Used by more than 80 percent of guests, Airbnb has updated its maps with faster performance, persistent pins when zooming and panning, and more results when searching.Redesigned wishlists Wishlists have been redesigned to include one-tap saving, and an improved calendar that shows availability of wishlisted homes. Guests can also add notes to any wishlisted listing – making it easier to remember why they loved it.Budget stays  For stays over three months, Airbnb is significantly reducing the guest service fee after the third month. Guests in the US can also save for stays over one month when paying with their linked bank account. And when searching, the new Months tab features an all-new design that makes it easy to dial in a range from 1-12 months.New customer service teamAirbnb has created a dedicated 24/7 support team for priority access when you’re on a trip, with a goal of answering 90% of calls in English in two minutes or less.Buy Now Pay Later Through a new partnership with Klarna, guests in the US and Canada can apply to pay for stays in four interest-free installments over six weeks. For bookings over $500, guests can apply to pay monthly (US only). More countries will be added throughout the year.Instant rebooking credit If a Host cancels within 30 days of arrival, most guests will receive an instant credit that can be used to rebook another stay immediately."
    ]
}