{
    "articleURL": "/sport/football/article-12045771/Referees-Sydney-wear-BODYCAMS-vile-attack-official.html",
    "content": [
        "Referees in Sydney's south-west will wear bodycams after an ugly attack A 45-year-old referee was left with a broken jaw after an alleged assaulted A local football authority will trial bodycams for referees at matches Football clubs across New South Wales will take a stand against referee abuse as the sport looks to combat the ugly scenes that unfolded in Sydney's south-west last Friday night. ",
        "Adam Abdallah, 25, is accused of storming the pitch and confronting referee Khodr Yaghi, 45, at the end of a match at Padstow Park. The 45-year-old official was left with a fractured jaw, was missing four teeth and was undergoing surgery where he would need plates inserted into his jawline as a result of the attack allegedly carried out by Mr Abdallah. A magistrate refused bail for the 25-year-old earlier this week, with police raising concerns Mr Abdallah would endanger the safety of the victim and community.And Football NSW is still reeling from the shocking incident and has now called on clubs to put on a united front ahead of this weekend's matches across the state.",
        "In a statement, the governing body said: 'Consistent with our zero-tolerance stance, Football NSW is encouraging Clubs to participate in a pre-match symbol of solidarity with, and in respect for, referees.'Within Football NSW Competitions, this will involve performing a 30-second round of applause prior to kick-off, with both teams standing around the centre circle together with referees positioned on the halfway line intersect.' Local football authority Bankstown District Amateur Football Association has also implemented new safety measures in the wake of the attack, which will come into effect on Friday 5 May.Body cameras will be trialed on Men's Premier League referees while a new hard line stance has been issued relating to abuse from players and coaches. ",
        "The new rules state that registered team officials and spectators will be barred from approaching any official regarding a decision made during a match.In the event of a breach of that rule, the offender will be given a red card and the match will be abandoned. The non-offending team will then be awarded a 3-0 victory or the current score if the margin is beyond three goals.  Police said of last Friday's incident that there had been 'little to no provocation' from the referee, who had asked Mr Abdullah to 'please move away' before Mr Abdallah allegedly became ­aggressive and began 'throwing punches'.",
        "However, the court was told Mr Yaghi used a sideline flag to defend himself, causing Mr Abdallah to fall to the ground ­before his alleged attack began.Defence lawyer Talal Krayem said his client suffered bruising to his head as a ­result of being hit with the 'stainless steel' sideline flag.Friday's incident following the Greenacre Eagles and Padstow Hornets game was filmed by shocked bystanders and quickly circulated on social media.Players can be seen mingling at the conclusion of the game before a verbal argument breaks out over what is believed to be calls made by the referee during the match.A man then runs through the crowd and allegedly charges at Mr Yaghi and punches him multiple times. Mr Yaghi was allegedly pushed to the ground while he attempted to cover his face to protect himself as onlookers screamed 'get off him'."
    ]
}