{
    "articleURL": "/wires/pa/article-12055377/Toto-Wolff-calls-Mercedes-nasty-piece-work-Lewis-Hamilton-13th-grid.html",
    "content": [
        "Lewis Hamilton’s Mercedes was criticised by Toto Wolff as being “a nasty piece of work” after the British driver qualified only 13th for the Miami Grand Prix.",
        "As Sergio Perez took a surprise pole position – with Charles Leclerc’s late crash resulting in a red flag to leave Max Verstappen ninth on the grid – Hamilton endured another sobering evening in his unruly machine.Fernando Alonso joins Perez on the front row following another impressive display by the evergreen Spaniard, with Ferrari’s Carlos Sainz third.Kevin Magnussen qualified fourth for Haas ahead of Alpine’s Pierre Gasly and Hamilton’s team-mate George Russell. Leclerc, who broke his rear wing in the accident at Turn 7, qualified seventh.On Friday, Hamilton described the performance of his lacklustre Mercedes as “a kick in the guts”, and his mood will only have worsened after he was eliminated from Q2, an eye-watering 1.1 seconds off the pace, and two tenths down on Russell.He returned to the pits shaking his head and took aim at Mercedes for leaving him with too much to do by not releasing him early enough for his final attempt in Q2.“We left that way too late, guys,” he said over the radio. Hamilton now trails team-mate Russell 4-1 in qualifying after the opening five rounds.“There is not a lot to say to Lewis because the car is simply not fast enough,” said Mercedes team principal Wolff.",
        "“Putting him in a situation on his out lap where the driver is not able to prepare his tyres makes it even worse.",
        "“We are not trying to make mistakes. We are trying to give the drivers the best position on the track, and we have in the past got it wrong many times, and also got it right many times. But if things go badly, they compound the situation.“I take no enjoyment from finishing sixth (with Russell) and it is the lack of comprehension of what is wrong that makes this car such a nasty piece of work.“The car is not a good car. There are problems everywhere, with the base performance of the car and the lack of understanding of the car. The performance is just really bad. It is not acceptable.”Hamilton, already 45 points behind championship leader Verstappen, started Saturday’s running on the backfoot following a near-miss with Haas driver Kevin Magnussen.The 38-year-old was on his first speedy lap of the afternoon when he was blocked by the Dane under braking at Turn 17. Hamilton was forced to take evasive action, brushing the barriers in the process.“Check the front wing”, said the Mercedes driver, who swiftly dived into the pits for repairs. “I just hit the wall.”Commenting on his lowly grid slot for Sunday’s 57-lap race, Hamilton said: “We knew it would be very hard and there was a 50:50 chance we could get into Q3 so we needed to be better with our timing.",
        "“But it’s done. I’ll try and get my head down tomorrow and see what I can do – 13th to God knows where.”Verstappen looked set to secure pole after dominating practice, but he made a mistake in his first run in Q3.Then, with less than two minutes remaining, Leclerc lost control of his Ferrari and thudded into the wall.The session was red-flagged and did not restart, leaving Verstappen, who leads Perez by just six points in the standings, in the midfield.“F*** sake,” said the Dutchman over the radio after he was unable to complete his final lap.For Perez, his pole comes a week after winning in Azerbaijan, and provides him with the chance to assume control of the world championship.“It has been a bad weekend,” said the Mexican, who had struggled to get up to speed in his Red Bull before qualifying.“But we made a small change and everything came alive. Tomorrow is an opportunity starting from pole and we will go out there and enjoy this amazing crowd.”"
    ]
}