{
    "articleURL": "/money/markets/article-12042297/Reach-says-Facebook-news-content-changes-hit-turnover.html",
    "content": [
        "The newspaper group owns the Daily Express and Manchester Evening NewsReach's turnover fell by 5.9% year-on-year for the four months ending 23 AprilDaily Mirror owner Reach has warned that changes in how Facebook displays news content on its platform are impacting revenues.",
        "The newspaper group, which also owns the Daily Express, Manchester Evening News and OK! magazine, said turnover contracted by 5.9 per cent year-on-year for the four months ending 23 April.Print revenue dropped by only 3 per cent during the period, even though advertising sales from this channel plunged by almost a fifth, which Reach credited to price hikes it made the previous year.",
        "But digital sales tumbled by 14.5 per cent, with bosses blaming a difficult online advertising market and a decline in page views from readers.In April, Facebook owner Meta shut down Instant Articles, a mobile-friendly format that allowed users to read entire articles on the social media website's app without having to leave the platform to access them.It forms part of a broader shift away from news-focused products at Meta.Last year, Meta spokesperson Erin Miller claimed that only 3 per cent of Facebook feed posts contained links to news pieces, adding that 'it doesn't make sense to over-invest in areas that don't align with user preferences.'Johnathan Barrett, an analyst at broker Panmure Gordon, said: 'Only time will tell as to whether this is just part of the ongoing testing designed to optimise [Facebook's] performance or if this is perhaps seeking to improve its bargaining position ahead of commercial discussions with publishers.'",
        "The UK Government recently published a bill that included plans to force social media companies to negotiate cash-for-content deals with UK news publishers.This follows legislation passed two years ago in Australia requiring Google and Facebook to agree deals to compensate media businesses for hosting news content on their platforms.A law in Britain might provide a significant financial boost for Reach, which warned in March that up to 420 employees could be made redundant this year.The firm has not only struggled with weak advertising revenue but also inflationary pressures in its print operations, yet it has noted strong growth in data-driven sales. Jim Mullen, Reach's chief executive, said: 'External factors continue to impact digital revenue, delivery of the customer value strategy is driving a higher quality mix, underpinned by the strength of print. 'Our focus on data means customers are receiving and responding more often to relevant content and a more engaging user experience.' Reach plc shares ended trading 1.4 per cent higher at 83.35p on Wednesday, although they have still lost approximately half of their value in the past 12 months.",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}