{
    "articleURL": "/news/article-12045755/Exact-time-Westminster-Abbey-ceremony-procession-happen-King-Charles-coronation-day.html",
    "content": [
        "MailOnline breaks down all the key timings you need to know for the coronationThe UK is gearing up for one its biggest nationwide events in years, as King Charles' eagerly anticipated coronation ceremony gets underway. ",
        "Having ascended to the throne in September 2022 after the passing of his mother, Queen Elizabeth II, Charles will officially be crowned as King TODAY, Saturday, 6 May, 2023. Thousands of people are expected to be in London to catch a glimpse of the procession, with millions more set to watch coverage of the coronation across Britain. With final preparations being made, and plans finalised, timings have been revealed for the coronation ceremony.  Here is a breakdown of the exact timings for key events on coronation day. ",
        "What time is the procession?The procession will begin at 10.20am. With hundreds of thousands of people set to line the streets of London on the day of the coronation, 11,500 police officers will form a 'ring of steel' around the city. Officers will line the King's procession route from Buckingham Palace to Westminster Abbey on Saturday, 6 May, as part of 'Operation Orb'.Snipers will also be positioned on nearby rooftops, plainclothes police are set to walk among the crowds, blockades will stop vehicles being driven into spectators and pavement barriers running for miles will be erected.Airport-style screenings will be in place as well as armed patrols, a no-fly zone over central London, dog teams and a close protection security operation. Police have also spent weeks on a pre-emptive operation looking at potential threats posed by royal obsessives and looking through social media for intelligence.",
        "What time is the coronation ceremony? Although the procession is scheduled to begin at 10.20am, preparations for King Charles' coronation will begin much earlier, at 5am, as pedestrian restrictions come into force across central London. At 6am, viewing areas will open along the procession route, allowing the public to catch a glimpse of Charles and Camilla either on their way to, or returning from, Westminster Abbey. The congregation are expected to be seated inside Westminster Abbey at 9am. Heads of state, overseas government representatives, Government ministers, First Ministers, former PMs, foreign royals and members of the royal family are expected to take their seats inside the Abbey between 9.30am and 10.45am. Upon Charles and Camilla's arrival, the ceremony is expected to start at 11am.  What time is the King's coronation?At 12pm, King Charles will be crowned. The Archbishop of Canterbury will place the St Edward's Crown on Charles' head. St Edward's Crown, made in 1661, represents the King's vocation before God and is a reminder of the promises and vows he has made to the People, who cry the prayer, 'God, Save The King!' To mark the official coronation of the new monarch, trumpets will sound and gun salutes will be fired across the UK. The service will end at 1pm, after which the newly crowned King and Queen will begin their coronation procession back to Buckingham Palace in the Gold State Coach. ",
        "What time are the Red Arrows on?At 2.15pm, the King, Queen Consort and members of the royal family are expected to appear on the Palace balcony to watch the Red Arrows flypast. However, the Coronation flypast could be scaled back or even cancelled if the weather is too poor. ",
        "The Met Office forecasts grey cloud on Saturday afternoon over London, with rain bursts. Cloud as low as 200 metres above ground is shown on computer forecast models.The grand finale of the Coronation parade - which will soar above the Royal Family on Buckingham Palace's balcony - is set to include Typhoons, Apache helecopters and a Lancaster bomber.A Ministry of Defence spokesperson said: 'As is always the case for flypasts of this type, the latest weather information will be obtained, and weather checks will take place in advance of the main flypast on Saturday.'Depending on the weather there are a number of contingencies in place.'"
    ]
}