{
    "articleURL": "/news/article-12058239/Footage-shows-moment-speeding-Range-Rover-hurtles-crowd-outside-Texas-migrant-center.html",
    "content": [
        "Filmed early Sunday, the clip was released by a local congressman hours after the crash - with the driver in custody and the death toll now reported at eightThe snippet starts seconds before the moment of impact - with a group of at least 17 seen waiting at the stop outside a shelter that houses homeless migrantsSeveral are seen sitting on the curb in front of the stop, while several stand while presumably waiting for a bus before being hit Shocking video footage shows the moment an SUV plowed into a crowded bus stop in a Texas border town, killing eight people and leaving at least 11 injured.",
        "Filmed early Sunday, the clip was released by a local congressman hours after the crash - with the driver now in custody after an eighth victim was confirmed dead on Sunday evening. The snippet starts seconds before the moment of impact where a group of at least 17 can be seen sitting on the curb or standing waiting at the stop outside the Ozanam Center which houses homeless migrants.Suddenly, the unnamed motorist in a Range Rover comes into frame, hurtling toward the group at frightening speeds. The footage - which the DailyMail.com has chosen to censor due to its graphic nature - then shows the crowd being obliterated by the more than a two-and-half ton vehicle, which cops said had run a red light.As of Monday morning, it is not known if the strike was intentional - however, witnesses who survived the strike claimed the driver, identified as an 'uncooperative' Hispanic male by cops, hurled profanities at the group as he raced toward them.Scroll down for video: ",
        "'A woman in a white car came by and told us to move, and another car behind her came toward us at full speed, yelling profanities at us,' the man who was at the bus stop but survived told CBS News, in an interview translated from Spanish.",
        "The man named Luis added it was the second car that 'ran us over.'It is unclear from the newly released footage to confirm the man's account - though a white car can be seen in the shot snippet driving a few feet in front of the suspect's car, in the adjacent lane.Compounding people's suspicions that the strike was premeditated is the fact it  happened three days before a Trump-era immigration restriction making it harder for migrants to seek asylum in the US is set to expire.Dubbed Title 42, the pandemic-era policy allowed border patrol agents to swiftly return migrants to their home countries - something particularly relevant to residents of the Southern Texas city, which is 95 percent Hispanic and Latino.Set less than two miles from the Mexican border, the town is set to see a rise in immigration in the coming weeks, once the Trump-era restrictions are lifted.Cops in the border city, however, have stopped short of saying the crash was intentional, with a Brownsville police spokesperson only confirming the suspect - who was filmed being arrested without a shirt on after the incident - was Hispanic.Spokesperson Martin Sandoval further added during a Sunday news conference that the suspect is 'not cooperating' with local authorities, and has only been hit with a reckless driving charge.",
        "The rep quickly added that will 'more than likely' change as their investigation continues, with both the FBI and Border Patrol participating in the probe.The latter, cops said, is working to confirm the identities of the victims - after Sandoval confirmed Sunday that several migrants were among the dead. In a statement later in the day, he revealed an eighth victim died after being hospitalized.He also said the SUV flipped after running up on the curb where several of the victims has been sitting, and continued moving for about 200 feet before hitting another group on the sidewalk about 30 feet away. Not seen in the footage is the Ozanam Center, a homeless shelter that serves individuals and families in the area.Currently, the shelter houses immigrants while they wait for more permanent housing, and according to director Victor Maldonado, it has not received any threats in the past.However, in the aftermath of the crash, Maldonado said that has begun to change.'I've had a couple of people come by the gate and tell the security guard that the reason that this happened was because of us,' he said.Maldonado added that most of the men who were struck were Venezuelan men - though it remains unclear how many of the victims were migrants.",
        "Maldonado did however, say the group was sitting on the curb waiting for the bus, as the stop does not have a bench.'What we see in the video is that this SUV, a Range Rover, just ran the light that was about a hundred feet away and just went through the people who were sitting there in the bus stop,' Maldonado said. Other emerging footage showed the unidentified suspect being detained by police after the car flipped.",
        "The crash comes as the city of Brownsville deals with an influx of migrants.Last month, the city issued a disaster declaration after 15,000 migrants — mostly from Venezuela — crossed over in a single week, overwhelming border security.In a normal week, only about 2,000 migrants attempt to cross at Brownsville.Tensions flared amid the uptick in migration last month, when some tents housing the immigrants were set ablaze and destroyed.Some migrants blamed cartel-backed gangs, but a government official suggested the fires may have been set by a group of frustrated migrants. The situation may also get worse in the coming week, with the end of Title 42 on Thursday. The COVID-era policy allowed border agents to send migrants back to Mexico.Authorities, meanwhile, have ordered a blood sample from the driver, as well as a toxicology test will be ordered, Sandoval said. It is not yet clear when those results will be released.",
        "The suspect, in the interim, faces the sole reckless driving charge. "
    ]
}