{
    "articleURL": "/news/article-12052563/Prince-Andrew-joins-children-Princess-Anne-Kents-Wessexes-family-dinner.html",
    "content": [
        "A slew of Royals had dinner together at Mayfair club Oswald's on Friday eveningKing Charles Coronation LIVE: Royals at Buckingham Palace as Kate dazzlesThe Royals have united at a massive family dinner ahead of the coronation at a luxury private club.",
        "Prince Andrew joined his children, the Tindalls, Princess Anne and her husband, the Kents and the Wessexes at Mayfair club Oswald's - but there was no sign of the 'outcast' Prince Harry.The club is owned by British entrepreneur Robin Birley, who also owns and runs 5 Hertford Street - where Prince Harry and Meghan Markle had their first date.The longest-serving heir to the throne in British history will be crowned at Westminster Abbey in a ceremony that is steeped in the majesty of his illustrious forebears – but also embraces and emphasises the proud diversity of modern-day Britain.The Coronation will see 7,000 servicemen and women accompanying Their Majesties, making it the country's biggest ceremonial event since 1953. ",
        "Oswald's is the most exclusive of London's private members' clubs, with the Queen Consort and Boris Johnson and his wife Carrie among those who frequent the venue.Named after owner Robin Birley's grandfather, it is a club for both men and women - with a focus on wine.The private members' club is thought to be the best for wine connoisseurs, where guests can either cellar their own wine, or buy in house, before enjoying them in the ground floor restaurant or on the small rear terrace.Zara, 41, who arrived at exclusive Mayfair private members' club Oswald's alongside her husband Mike Tindall, 44, opted for a striking navy blazer and trouser combo, paired with a light blue shirt. ",
        "Her cousin, Princess Eugenie, 33, who is expecting her second child with husband Jack Brooksbank, who was also in attendance at the family occasion, seemingly took inspiration from Zara and donned an Asceno Velvet Athens Robe, costing £575. They were joined alongside Princess Beatrice, 34, dressed in Louis Vuitton's £2,900 chain print asymmetrical long-sleeved frock, as well as other Royal Family members - including the Duke and Duchess of Edinburgh, Prince Andrew and Princess Anne. Tomorrow, they will join King Charles, Queen Camilla and the Prince and Princess of Wales at the coronation in Westminster Abbey. The King, Kate and William attended a Buckingham Palace reception this evening with foreign royals and world leaders. ",
        "Joined by her husband, Eugenie, who already shares two-year-old August with Jack, paired her glamorous red robe with black heels and a matching bag.Coordinating with his wife, Jack opted for a smart suit, white crisp shirt and a red patterned tie.Beatrice, meanwhile, teamed her designer dress with black heels and a matching blazer. She added a touch of glitz to her look with dazzling earrings.Her husband, Edoardo Mapelli Mozzi, 39, who she shares one-year-old daughter Sienna with, looked equally sophisticated in a navy suit and a light blue tie.Meanwhile, Zara - arriving alongside her dapper husband Mike - teamed her look with court heels and dazzling diamond earrings. ",
        "Elsewhere, Sophie, 58, and Prince Edward, 59, were joined by their children, James, Earl of Wessex, 15, and Lady Louise Windsor, 19.Missing from the party was the Duke of Sussex, who to the surprise of gobsmacked passengers flew in from Los Angeles on American Airlines flight AA136, which landed at 11.23am at Heathrow yesterday. Sources told the Mail yesterday that there are ‘no plans’ for him to join the Royal Family at Buckingham Palace or appear in official photos.He will not even be seen with his family on the balcony during the flypast nor will he be joining the procession back from Westminster Abbey today.Instead, the King's youngest son - who is fifth in line to the throne - will be relegated to the third row inside the abbey for the service. He has been, however, invited to lunch at Buckingham Palace today - although it is unconfirmed if he has accepted the invitation.The Prince is only in the UK for 24 hours. This afternoon he will return to his wife and two children who remain in California so he can make back it to celebrate Archie's fourth birthday.As was widely expected, it was confirmed by the Palace this morning that Harry, 38, as well as Prince Andrew, 63, will be mere spectators to the historic Coronation Ceremony given that they are no longer working royals.",
        "The two men will also be absent from the procession behind the Gold State Coach that will carry the newly crowned King and Queen to the Palace after the ceremony.",
        "Buckingham Palace announced last month he would be attending and he was expected to fly in yesterday and spend the night at Frogmore Cottage on the Windsor estate.Insiders last night said they could not rule out him having an unplanned heart-to-heart with his father after he lands in the UK.‘Of course you can never say never,’ said one. ‘Anything is possible, especially with him. And His Majesty loves his son despite everything.’But others felt that this was extremely unlikely.‘To be honest it seems a bit pointless him being there. His place in the pecking order couldn’t be clearer,’ another source told the Mail.‘Attending is probably the right thing for him to do in the long run. He can at least say he came and made the effort to be with his father on his big day... But the red carpet is most definitely not being rolled out and, as it stands, he will just be another member of the congregation.’Buckingham Palace last month announced it was ‘pleased to confirm’ Harry would attend his father’s ceremony. There had been months of speculation over whether he and possibly Meghan would attend.",
        "It came after the Duke and Duchess of Sussex released a six-part Netflix docuseries in December where they suggested William was ‘trapped’ and claimed they were not treated well by the Royal Family.Then in January, the Duke of Sussex published intimate details of his family’s private life in his memoir, Spare. All of this followed the Sussexes’ extraordinary Oprah interview in 2021 where they claimed an unnamed relative had asked what colour skin their baby would have.Despite the continued hostility towards his family, King Charles was keen to extend an olive branch and invited his son to the Coronation.Harry made him wait until the last minute before Buckingham Palace announced he would be attending on his own.It was said to have left royal officials unable to sign off arrangements for seating plans, transport and security, as the duke’s confirmation came after the official RSVP date.Coronation organisers admitted that they were stressed about Harry’s plans and said that it was like ‘trying to communicate with Mars’.Royal insiders told how they were seeking confirmation of ‘when he is coming, when he is going back and whether he is happy with his seating position in the Abbey’.Meghan will stay behind with Lilibet, one, and Archie, who celebrates his birthday today.",
        "In the summer of 2020 following lockdown, Birley, who is known as the ‘king of clubs’ spent millions of his own money to lure members back to his fashionable Mayfair nightspots.Oswald's attracts the likes of Dame Joan Collins, Priti Patel, David Beckham, the Earl of Snowdon, and is where Amber Heard was seen partying during the High Court in Johnny Depp’s libel suit against a paper last year.Prince William, who was seen enjoying a night with friends at the club in November, is also said to be a member of 61-year-old Etonian Birley's secretive member's only club 5 Hertford Street.Joining costs £1,800 a year and members - rumoured to include Harry Styles, Margot Robbie, Mick Jagger and numerous royals - need to be recommended by a proposer and a seconder.The mogul gifted every member of 5 Hertford Street and Oswald’s a free meal up to the value of £500 - an offer which lasted until Christmas, with members allowed to bring as many guests as they like.There are understood to be at least 3,000 members of the two clubs so it could have set Birley back more than £1.5 million.Robin, the son of Lady Annabel Goldsmith and late club owner Mark Birley, opened 5 Hertford Street in 2012 and it soon became London’s most exclusive watering hole.Based in a labyrinthine townhouse, it’s decorated like a bohemian stately home and members are charged fees of about £2,500 a year.Robin Birley bears facial scars left by a tiger that attacked him at a family friends’ private zoo when he was just 12.The businessman made headlines in 2019 after it was claimed that he funded Boris Johnson’s campaign to become prime minister."
    ]
}