{
    "articleURL": "/wires/reuters/article-12049607/league-Marvel-coach-Bennett-hailed-ahead-900th-match.html",
    "content": [
        "By Ian Ransom",
        "MELBOURNE, May 5 (Reuters) - Wayne Bennett was a lanky former policeman in his mid-thirties when he took the reins of the Canberra Raiders with co-coach Don Furner and steered them to victory over the Cronulla Sharks in 1987.Some 36 years on and seven National Rugby League (NRL) titles later, the 73-year-old supercoach will plot the Sharks' downfall again on Saturday when he coaches the Dolphins in his 900th championship match.A big crowd can be expected at Lang Park to pay tribute to the man who delivered six of his seven titles to the local Brisbane Broncos from 1988-2008 and has now lent his nous to the NRL debutants.Emotions may run high during the game, but the famously taciturn Bennett will likely have his usual poker-face on while looking to engineer victory.Tributes from players, fellow coaches and NRL head office have rained down on the luminary this week.\"I can only marvel at the career of Wayne Bennett - what he has done for the game and what he has been able to achieve out of the game is phenomenal,\" NRL boss Peter V'landys said.\"Records may be meant to be broken, but it´s almost certain this one will not be.\"Bennett, in his inimitable style, was having none of the hoopla on Friday and even threatened to walk out on a press conference when asked about the milestone.",
        "\"I´m not talking about my achievements, what I´ve done and haven´t done,\" he said.\"You´ve written about them, had an opinion on them. We´ve all had enough of it.\"No NRL coach has come close to Bennett's tally of games, with second-placed Tim Sheens, the 72-year-old Wests Tigers manager, yet to crack 700.With another three seasons in his contract after the current one, Bennett could yet threaten the 1,000-game milestone.Back in the day, he had never considered coaching as a career option despite success as a player who represented Queensland in the 1970s and toured New Zealand as an Australian international.He wandered into it when asked to mentor a junior side at Queensland's police academy after the team's coach fell ill.The coaching bug stuck and he has now been at the helm of six NRL teams along with international roles with Australia, England and Britain.His wisdom has touched generations of players and nurtured coaches who have themselves become successful rivals.\"Wayne had a little bit of a different way of going about (coaching) and managing people,\" said Melbourne Storm coach Craig Bellamy, a former player under Bennett at Canberra.\"It wasn´t just about footy ... I learned a bit off him about how he managed people, how he got on with people and how he encouraged people.\"",
        "Though a disciplinarian with a capacity to be ruthless in pursuit of success, players credit Bennett for getting the best out of them and in some cases, turning their whole lives around.Winger Jamayne Isaako, who played under Bennett at the Broncos, said the chance to work with the master coach again convinced him to sign up for the new team.\"Coming to Wayne and the Dolphins has taken my game to the next level,\" the 26-year-old told Australian media.\"You don´t want to let Wayne down.\" (Reporting by Ian Ransom in Melbourne; Editing by Stephen Coates)"
    ]
}