{
    "articleURL": "/news/article-12045273/Singer-Linda-Lewis-five-octave-vocal-range-saw-enjoy-solo-success-dies-aged-72.html",
    "content": [
        "Lewis had four top 40 hits in the 70s - the first coming with Rock-a-Doodle-DooMusic stars she worked with including Cat Stevens have paid tribute to herCat Stevens has lead tributes to his 'good soul-friend' singer-songwriter Linda Lewis who has died at the age of 72.",
        "Known for a five-octave vocal range and ability to perform a wide array of genres, she enjoyed solo success in the 1970s with hits 'It's In His Kiss' and 'Rock-a-Doodle-Doo'.Lewis and Stevens worked together in the 1970s, when she became his personal support act during his 1974 Bamboozle Tour and travelled with his troupe across the world, up to Japan.Yusuf/Cat Stevens paid tribute to Lewis saying she was 'an amazing bird that kindly visited the window sill of our earthly house'. During her career, Lewis also provided backing vocals for popular artists such as David Bowie, Sir Rod Stewart and Stevens.",
        "Veteran folk singer Stevens, said on Twitter: 'I'm so sorry to hear of Linda Lewis passing. She was a good soul-friend and fine artist.'Her flat on Hampstead Way was a regular home for artist and musicians in the 70's.'Linda became my personal support act during the Bamboozle Tour of 1974, and travelled with our troupe all over the world, up to Japan. What a voice!'I produced a couple of her records, and she sang the sweetest melody on my ballad, How Can I Tell You as well as the chorus on Angelsea.'The British singer-songwriter, known for hits such as Morning Has Broken and Father And Son, added that Lewis was like 'an amazing bird that kindly visited the window sill of our earthly house for a few days, then flew away back to her garden'.",
        "He added: 'God grant her eternal love and peace in the ever blossoming garden, where her heart belongs.'In a statement on social media, her sister Dee Lewis Clay said: 'It is with the greatest sadness and regret we share the news that our beloved beautiful sister Linda Lewis passed away today peacefully at her home.'The family asks that you respect our privacy and allow us to grieve at this heartbreaking time.'Multi award-winning singer-songwriter Joan Armatrading also paid tribute to Lewis, saying: 'I'm so sad to hear of the death of Linda Lewis.'She had a beautiful voice and was a really lovely person.'",
        "Tributes also came from Tracey Thorn from Everything But The Girl and radio DJ Gilles Peterson.Thorn said: 'Oh I am very sorry to hear the news that Linda Lewis has died.'I met her in a backstage dressing room a few years ago and was able to tell her this is one of my favourite records of all time.'Peterson simply wrote: 'Linda Lewis ... RIP.'Born Linda Ann Fredericks in West Ham, Lewis attended stage school and appeared in a non-speaking role in the British film A Taste of Honey in 1961 and as a screaming fan in the first Beatles film A Hard Day's Night three years later.",
        "A self-taught guitarist and keyboard player, she appeared at the first Glastonbury Festival in 1970. She described taking LSD the night before the festival as 'not a sensible move'.Lewis had four top 40 hits throughout the next decade - the first coming with Rock-a-Doodle-Doo which reached number 15 in the UK in 1973.Her biggest hit came with It's In His Kiss which reached number six in 1975. The song was first popularised by Betty Everett in 1964 and also covered by Cher in 1990.She also toured with Cat Stevens, one of many big names for whom she provided backing vocals, including Bowie - on the Aladdin Sane album - Stewart, Steve Harley and Cockney Revel, Rick Wakeman, Joan Armatrading and Jamiroquai.She dated Stevens on and off for several years, once writing that late at night she asked her then boyfriend who fast asleep: 'Sammy, is it OK if I sleep with Cat Stevens?'She wrote: 'There was no reply, so I took his silence as approval and went ahead.'",
        "In 1977 she married fellow musician Jim Cregan, but they divorced three years later, with Lewis writing: 'We were apart too much – especially after Jim joined Rod Stewart's band – and we were both unfaithful.' In 2004, she married music agent Neil Warnock, who survives her.",
        "Lewis continued to perform for the rest of her life, with her last track Earthling released in March this year.Paying tribute, fellow musician Midge Ure said: 'Really sad to hear this. I had a massive crush on Linda Lewis.'Not A Little Girl Anymore [the title track from her 1975 album] was a great song and beautifully sung by her.'Mike Scott, frontman of Scottish band The Waterboys, said she had been 'fabulous' and that he was 'very sorry' to her death."
    ]
}