{
    "articleURL": "/wires/ap/article-12042741/Police-Man-charged-shot-fired-Memphis-TV-station.html",
    "content": [
        "MEMPHIS, Tenn. (AP) - A man charged after a shot was fired into the lobby of a Memphis television station has faced mental health challenges for much of his life, his mother said.",
        "No one was struck by the shot fired Tuesday into the WHBQ station, the Fox affiliate in Tennessee´s second-largest city, Memphis Police Department Deputy Chief Stephen Chandler said at a news conference. The bullet fired with an \"AR-style rifle\" hit glass and a desk, but it wasn't clear if it was fired intentionally, he said. Crisis negotiators helped take the suspect into custody.\"He wanted to meet with media. He had a message to send out,\" Chandler said. He didn't provide more details.Memphis police later announced that they had arrested Jarrad Nathan, 26, and charged him with aggravated assault and reckless endangerment. It wasn't immediately clear if he had an attorney.Nathan has had mental health issues since he was young, Marsha McKinney told news outlets.\"He´s one of the nicest, kindest (people, but) everybody has another side, too,\" McKinney said. \"I think that my son is crying out for attention because he needs some help.\"",
        "The station said employees were evacuated to a parking lot for about 30 minutes after the shot was fired, while police secured the area.The suspect first approached the station from a vestibule into the lobby of the station that was locked, wanting to talk, the station said. The suspect then showed the employee that he had a gun.",
        "The employee then left before the suspect fired a shot, the station said. According to video, he then kept trying to open the locked door into the station and became angry, stomping his feet.Nathan appeared in court Wednesday. He told a judge that he could not afford to pay for a lawyer. The judge said she would appoint a public defender.He appeared in court on two cases - the station shooting and another aggravated assault. He is being held on $275,000 bond. Nathan said he could not afford bond and he is \"dead broke.\" He appeared in court in a wheelchair. Police said there were no injuries when he was taken into custody.___AP reporter Sarah Brumfield in Silver Spring, Maryland, contributed to this report."
    ]
}