{
    "articleURL": "/wires/ap/article-12045179/Philadelphia-mayoral-race-hones-crime-policies.html",
    "content": [
        "In Philadelphia's first mayoral race since crime spiked during the coronavirus pandemic, the crowded Democratic field is trying to make public safety a campaign cornerstone, advocating approaches that range from mental health interventions and cleaner streets to echoes of \"tough-on-crime\" Republican rhetoric.",
        "Six Democrats are considered serious contenders to succeed term-limited Mayor Jim Kenney. Because Philadelphia weighs heavily Democratic, their May 16 primary will likely determine who leads the nation´s sixth-largest city.They're talking not only about gun violence - 473 people were fatally shot and 1,789 were wounded by gunfire last year, according to city statistics - but also about how they would address other public health and safety detriments, including darkened streetlights and issues with trash pickup.\"A two-year spike in crime leaves deep scars on cities and we´re seeing that in this election cycle,\" said John Roman, director of the nonpartisan Center on Public Safety and Justice, part of the NORC social research organization at the University of Chicago. Roman also serves on the Crime Trends Working Group at the Council on Criminal Justice, a nonpartisan group that develops policy suggestions for tackling crime.The lone Republican running for mayor, former councilman David Oh, took aim at the \"defund the police\" movement - which seeks to tackle crime through modes other than more policing - and called for fully staffing the department. Some of the Democratic candidates have leaned into targeting crime through policing too.Former city councilwoman and state lawmaker Cherelle Parker, who previously fought to stop unconstitutional and discriminatory use of the police tactic known as stop-and-frisk, says police should be able to use their discretion to stop someone when they witness something suspicious.",
        "\"It´s not an either/or - you will be held accountable, we will also have reform, but we will use every tool in the toolbox to ensure that our city is safer and cleaner and greener,\" Parker said in one debate.Also supporting strong policing solutions are candidates Jeff Brown and Allan Domb. Brown, a political outsider who franchises grocery stores, earned the local Fraternal Order of Police endorsement and pledged more officers and funding for police in city budgets. Domb, a former councilman, said he would convene a group of local, state and federal agencies to tackle crime. He said bringing the agencies together could help reduce homicides, crack down on retail theft and prosecute people who obtain guns illegally.State Rep. Amen Brown, whose experience as a gunshot victim has informed his tough-on-crime policy, pledged to \"work with law enforcement, not against law enforcement.\"\"I´m the only candidate who has never flip-flopped on pro-cop or not,\" he said. \"And that´s a fact.\"Rebecca Rhynhart, the former city controller who released a critical review of the police department before announcing her bid for mayor, has rebuked the idea of \"moving backwards to `law-and-order´ policies that were racist\" and pushed for intervention and therapy programming that would help people at risk of becoming violent or committing crimes. She has also backed preventive measures, such as long-term investments in programs that would help to alleviate poverty and provide opportunities for those who don't have them.",
        "In the short term, however, she said what the city needs is \"consequences and rules.\"\"Right now, we have chaos on the street, and that´s not acceptable,\" she said. \"Of course, we need compassion, but we also need consequences.\"Helen Gym, who has been endorsed by progressive organizations in the city and nationally, has proposed radically different solutions to eradicate crime, including funding mental health first responders, guaranteeing employment for young adults and providing effective city services to keep the city´s streets clean. She denounced a \"top-down\" police-heavy focus.\"I think that´s one of our biggest problems that we´ve got,\" she said. \"I´ve been very clear that the violence in our city is directly rooted in disinvestment in individuals and in neighborhoods and communities, and thus a safety agenda really needs to lean into an investment agenda.\"Voters responding to polls tend to agree, listing mental health and substance abuse needs; access to opportunity, education and housing; and getting illegal guns off the street as the primary solutions to crime, said Insha Rahman, vice president of advocacy and partnerships for the Vera Institute of Justice, an organization that works to transform the legal and immigration systems.In fact, the public has become less punitive over the past three decades and their desire to see that shift in public policy is reflected both in the voting booth and how politicians conduct themselves to win approval, said Justin Pickett, a researcher at the University of Albany.",
        "\"They follow the trends in public opinion and in that direction, they look at the policies that have really high support,\" he said.John Fetterman, who won the U.S. Senate race in Pennsylvania last year, appeared to heed that message. During his campaign, he discussed ensuring public safety in a way that never rose to \"tough-on-crime\" rhetoric. It's a route that few Democrats choose, Rahman noted.\"He made crime and safety a kitchen table issue and said, `We can have safety and justice, we deserve it and need both.´ That actually really appealed to voters,\" she said.\"That´s a remarkable sort of change in how voters see Democrats in their handling of crime and safety,\" she said.Progressive Brandon Johnson won Chicago's recent mayoral race after he dialed back his previous support to \"defund the police,\" while also rejecting his opponent Paul Vallas' suggestion that Chicago should hire hundreds more officers. Instead, Johnson called for investing more in mental health care, affordable housing and jobs for young people.The outcome of that race and the contest in Philadelphia could determine how the Democratic Party addresses crime and public safety in future national elections, said Michael Sances, an associate professor at Temple University.\"It tells us about the intraparty politics in the Democratic party - where they stand with policing, how to reconcile with reform,\" he said.",
        "___Brooke Schultz is a corps member for the Associated Press/Report for America Statehouse News Initiative. Report for America is a nonprofit national service program that places journalists in local newsrooms to report on undercovered issues."
    ]
}