{
    "articleURL": "/wires/aap/article-12040523/Youth-Justice-aims-zero-Aboriginal-kids-custody.html",
    "content": [
        "Victorian officials are determined to achieve zero Aboriginal young people in custody, regardless of legislative change.",
        "Youth Justice Commissioner Andrea Davidson on Wednesday revealed the target, telling the Yoorrook Justice Commission the goal was unashamed and something authorities had \"all intention of getting to\".Youth Justice has made significant strides in slashing the number of Aboriginal young people in custody in recent years.Between 2016 and 2017, there were more than 120 Aboriginal young people under Youth Justice's supervision on an average day - a number that dwindled to 42 last year.Despite the progress, Youth Justice deputy secretary Joshua Smith conceded the number was still \"grossly too high\".There were 11 Aboriginal young people in custody as of Wednesday, nine of them on remand and two who were sentenced.\"Once a young person has contact with the Youth Justice system, their chances of re-offending and coming back into contact with the system is increased,\" Mr Smith told Yoorrook, Victoria's first truth-telling inquiry.\"So if we can stop contact with the criminal justice system in that early age, in that 10 to 14 age bracket, statistically it tells us they are then less likely to come into contact with the Youth Justice system down the track, post age 14.\"Yoorrook commissioner Sue-Anne Hunter said the construction of a new youth detention facility at Cherry Creek, west of Melbourne, contradicted officials' mission to keep Aboriginal children out of custody, as well as government plans to raise the age of criminal responsibility to 12.",
        "Ms Davidson acknowledged opening the new facility was \"certainly not cause for celebration\" but said it would be able to provide a more nuanced service and cater to children with complex needs.The addition of the Cherry Creek facility meant 300 beds across the state, while there were about 100 children in the system, Mr Smith noted.Where children were detained was determined case by case.Ms Davidson acknowledged acute staffing shortages in youth custody - particularly over the past six to eight months - had led to lockdowns.Children's education and human rights were consequently being compromised.It was a complex and wicked issue to retain and recruit staff, and Youth Justice was in the process of implementing a workforce strategy, Ms Davidson said."
    ]
}