{
    "articleURL": "/wires/reuters/article-12059493/US-STOCKS-Dow-S-P-500-eye-higher-open-regional-banks-rise-key-inflation-data-awaited.html",
    "content": [
        "Regional lenders extend gains from Friday",
        "PacWest rallies on dividend cut to bolster capitalApril CPI data awaited on WednesdayWarren Buffett's Berkshire Class B shares up after Q1 resultsFutures: Dow up 0.28%, S&amp;amp;P up 0.23%, Nasdaq flatBy Shreyashi Sanyal and Shristi Achar AMay 8 (Reuters) - The Dow and S&amp;amp;P 500 indexes eyed a higher open on Monday ahead of a key inflation reading during the week that will be scrutinized for whether the Federal Reserve's efforts to cool prices were taking hold, while shares of PacWest led a rally among regional banks.Regional lenders' shares stretched gains from a rebound on Friday, with PacWest Bancorp jumping 35.8% premarket after the lender sharply cut its quarterly dividend to boost capital.Peers Western Alliance Bancorp, Comerica Inc and Zions Bancorp rose between 8% and 12.3%. Shares of such banks tumbled for much of last week on worries tied to the collapse of First Republic Bank.At 8:29 a.m. ET, Dow e-minis were up 95 points, or 0.28%, S&amp;amp;P 500 e-minis were up 9.75 points, or 0.23%, and Nasdaq 100 e-minis were down 3.5 points, or 0.03%.The spotlight will be on the Labor Department's inflation data on Wednesday, which is expected to show the consumer price index (CPI) likely climbed 0.4% in April after gaining 0.1% in March, while excluding the volatile food and energy components, the CPI likely increased 0.4% last month.",
        "Producer prices, weekly jobless claims and consumer sentiment data are all lined up through the week.Data points this week will help investors not only gauge whether the Fed's aggressive tightening cycle - including its most recent 25 basis point hike last week - is working towards tamping down inflation but also if fears of stagflation are founded.\"We're in an information vacuum right now, waiting for the next inflation data. And that's why you're seeing some of that uncertainty in the market,\" said Thomas Hayes, chairman at Great Hill Capital LLC.\"You had the 'good news is good news' on Friday and a rally knowing no one wants to go short into the weekend. You also have the debt ceiling working in the background, which is a concern for people. Until some of these things get resolved, we are not going to see a repeat of the rally anytime soon.\"President Joe Biden and top lawmakers from Congress are due to meet onTuesdayto resolve the stand-off over the $31.4 trillion U.S. debt ceiling.U.S. stock indexes staged a late-week rally on Friday, with the Dow Jones Industrial Average posting its biggest one-day percentage gain since Jan. 6 after upbeat results from Apple Inc and U.S. jobs data highlighting a resilient labor market.",
        "Warren Buffett's Berkshire Hathaway Inc's Class B shares rose 1.4% after the company posting a $35.5 billion first-quarter profit, reflecting gains from stocks such as Apple.Dish Networklost 4.5% after the pay TV and wireless communications service provider reported first-quarter revenue below estimates.Tupperware Brands Corp slipped 8.5% after the company said it had engaged investment bank Moelis &amp;amp; Co LLC to explore strategic alternatives.American Airlines Group Inc rose 3.2% after J.P. Morgan raised its rating to \"overweight\" from \"neutral\". (Reporting by Shreyashi Sanyal and Shristi Achar in Bengaluru; Editing by Nivedita Bhattacharjee and Maju Samuel)"
    ]
}