{
    "articleURL": "/news/article-12046051/Trump-hits-green-day-arriving-Ireland-fulfil-long-standing-commitment.html",
    "content": [
        "Donald Trump arrived in Ireland having spent time in Scotland earlier this weekTrump made a number of jabs about his successor Joe Biden during the roundHe also declared that he would be cutting his Ireland trip short due to rape trial Donald Trump today laid into 'incompetent' Joe Biden by claiming he could beat the President 'three times' in the 2024 election during an eventful round of golf in Ireland with his son Eric.",
        "The former president also mocked Biden's golfing ability after teeing off at his Trump International Golf Links &amp; Hotel in Doonbeg, County Clare - where he arrived last night on the back of a visit to Scotland.In a shock turn of events, Trump also revealed he would be cutting his trip to Ireland short so he can return to 'confront' his accuser in a New York civil rape case, which he described as a 'political attack'.His visit to Scotland and Ireland has coincided with the second week of the trial in Manhattan over accusations, denied by Trump, that he raped former magazine columnist E Jean Carroll in a department store dressing room in 1996.Speaking to reporters outside his golf resort, Trump said he would 'probably attend' the hearing - where he has so far let his lawyers fight his ongoing legal battle.",
        "Last night, Trump had expressed confidence in his position in his Manhattan rape trial while touring his golf property. He said he skipped the court date for his 'long-standing commitment' to visit Ireland.But less than 24 hours later, he said: 'I'm going back to New York. I was falsely accused by this woman, I have no idea who she is - it's ridiculous. I'll be going back early because a woman made a claim that is totally false, it's fake.'",
        "The Republican said the rape accusations against him are politically motivated, adding that his accuser is a Democrat and the judge is a 'rough judge' who 'was appointed by Bill Clinton'.'This is a political attack. This is the only way they think they can win the election because Biden is losing,' he said.'He's down by 11 - and my republican opponent is down by 45 - he's disappeared.'He added: 'It's a disgrace that this is allowed to happen.'It's called false accusations against a rich guy. Or in my case, against a famous, rich and political person that is leading the polls by 40 points.'And I have to go back for a woman that made a false accusation about me and I have a judge that is extremely hostile.'Earlier on, the former president attempted to deal a series of blows to Biden as he spoke to reporters on the golf course where a standard membership costs $3,100 per year with a $1,250 joining fee.'You think Biden can do that? I don't think so,' he joked after teeing off and driving away in a buggy which said 'President Trump' on the front of it. Trump, wearing his famed red Make America Great Again cap, added: 'Biden doesn't hit a 280 right down the middle, does he? Biden can't hit an 80 down the middle.'",
        "Asked if he was confident that he could defeat Biden in the next US election, he said: 'I could win it three times.'",
        "When later quizzed about whether he'd be looking for the Irish American vote if he ran again for president in 2024, Trump said: 'I'm looking, right now I'm looking, that's why I'm talking to you.'In another attempted blow to his successor's presidential campaign, Trump added: 'Biden is an incompetent person'.",
        "Trump's visit to Ireland comes just weeks after Biden's four-day trip to the country which ended with a rousing speech celebrating his Irish heritage in front of a boisterous crowd in front of St. Muredach's Cathedral in County Mayo.Following his return home, Biden formally announced his campaign for re-election, possibly setting up a sensational rematch with Trump. Trump continues to be in seemingly good spirits in the public eye as his lawyers fight his ongoing rape trial in New York - where the notorious 'Access Hollywood' tape has been played to the jury.The former president started the week at his Aberdeenshire golf resort after landing in Scotland on Monday where he said 'it's great to be home'.After opening the course at the Menie Estate on the east coast, he then travelled to his Turnberry course on the west coast, where he was pictured teeing off again.",
        "In Ireland today, Trump smiled, pointed and waved at cameras as he made his way around the golf course.Last night, he gave the long-distance thumbs up to the performance of his legal team on a day attorney Joe Tacopina told a judge overseeing the trial the defense team would not call any witnesses in the case, and where a new witnesses provided dramatic testimony that could help his accuser.",
        "Asked why he was in Ireland instead of attending the trial, Trump responded: 'Because we have a longstanding agreement to come here. We've had a tremendous reception, a beautiful reception.''The people of Ireland have been great and we have tremendous respect. And I hear we're doing very well in New York,' he told Sky News. It was his first commentary on how his legal team was faring in the courtroom, although he has blasted the the case as a 'hoax' online and denied magazine writer E. Jean Carroll's accusations against him.Tacopina said the sole witness he had intended to call, an expert witness, wouldn't be there due to a medical problem. Trump's appraisal came on a day when lawyers for Carroll played the infamous 'Access Hollywood' tape, where Trump's comments about grabbing women by their genitals was captured on video.",
        "The emergence of the 2005 video rocked Trump's 2016 campaign, but did not stop Trump from reaching the White House.The court also has heard from two women whose testimony was meant to corroborate Carroll's own statements by speaking of their own experiences with Trump. Former People magazine writer Natasha Stoynoff said Trump forcibly kissed her at Mar-a-lago during an interview for a magazine piece.  The story was about the one-year anniversary of his marriage to Melania Trump.Stoynoff cried as she told of the 2005 encounter, where she said Trump pushed her up against a wall and kissed.She testified Trump 'had his hands on my shoulders, pushed me against the wall and started kissing me.'",
        "'He came toward me again, and I tried to shove him again. He was kissing me and, you know, was against me,' she said. She also said she didn't scream and that 'no words came out of me' – days after Tacopina asked Carroll why she didn't scream during the attack inside a Bergdorf Goodman department store that she alleges happened. Closing arguments could begin Monday, said Judge Lewis A. Kaplan, which could put the case to the jury on Tuesday.After arriving in Ireland, Trump faced questions about taxation at his Doonbeg course.He dodged a question on whether U.S. companies doing business in Ireland should pay taxes in Ireland rather than in the U.S.",
        "'That's an interesting question,' Trump responded. 'But I won't answer that question in your country, but a lot of people would say yes,' he said.",
        "'But Ireland has done a great job, you've lured a lot of companies in. And they love it here, they really love it here, they've been treated well just like I've been treated well. This has been a great success,' he said.Earlier, businesswoman Jessica Leeds testified about her allegations that Trump grabbed her on a 1979 flight from Texas to New York while seated in a first class seat.She said in deposition he started 'grabbing me, trying to kiss me, grabbing my breasts, pulling me towards him, pulling himself on me.'Also in New York on Wednesday, a judge tossed out Trump's suit against the New York Times and ordered him to pay attorneys' fees. Trump's filing accused the paper, reporters, and niece Mary Trump of a plot to get his tax returns."
    ]
}