{
    "articleURL": "/wires/reuters/article-12046681/U-S-weekly-jobless-claims-rise-higher-borrowing-costs-cool-demand.html",
    "content": [
        "WASHINGTON, May 4 (Reuters) - The number of Americans filing new claims for jobless benefits increased last week as the labor market gradually softens amid higher interest rates, which are cooling demand in the economy.",
        "Initial claims for state unemployment benefits rose 13,000 to a seasonally adjusted 242,000 for the week ended April 29. Economists polled by Reuters had forecast 240,000 claims for the latest week.Claims have been stuck in the upper end of their 194,000-247,000 range this year, reflecting a rise in layoffs as the lagged and cumulative effects of the Federal Reserve's fastest interest rate hiking campaign since the 1980s start to be felt beyond the housing market and technology sector. Nevertheless, the labor market remains tight.There were 1.6 job openings for every unemployed person in March, the government reported on Tuesday, well above the 1.0-1.2 range that economists say is consistent with a jobs market that is not generating too much inflation.The Fed raised its benchmark overnight interest rate by another 25 basis points to the 5.00%-5.25% range on Wednesday, and signaled it may pause further increases, though it kept a hawkish bias. Fed Chair Jerome Powell told a press conference that \"the labor market remains very tight,\" but noted there were \"some signs that supply and demand in the labor market are coming back into better balance.\"The number of people receiving benefits after an initial week of aid, a proxy for hiring, fell 38,000 to 1.805 million during the week ending April 22, the claims report showed. The so-called continuing claims remain low by historical standards as some of the laid-off workers are quickly finding employment.",
        "The claims report has no bearing on the government's closely watched employment report for April, which is scheduled to be released on Friday, as it falls outside the survey period.According to a Reuters survey of economists, nonfarm payrolls likely increased by 180,000 jobs last month after rising by 236,000 in March. The unemployment rate is forecast to have climbed to 3.6% from 3.5% in March.A separate report from global outplacement firm Challenger, Gray &amp;amp; Christmas on Thursday showed U.S.-based employers announced 66,995 job cuts in April, down 25% from March. Layoffs, however, jumped 176% compared to April of last year.Layoffs last month were led by the retail industry, where job cuts surged 270% to 14,689 from March. It was followed by the technology sector. (Reporting by Lucia Mutikani; Editing by Paul Simao)"
    ]
}