{
    "articleURL": "/tvshowbiz/article-12052863/Bebe-Rexha-details-struggle-weight-gain-learning-PCOS-Tough.html",
    "content": [
        "Bebe Rexha revealed she has been struggling with weight gain after being diagnosed with polycystic ovary syndrome.",
        "The 33-year-old hitmaker opened up about her hormone imbalance on the Gayle King SiriusXM show this week, explaining that the condition can cause symptoms like ovarian cysts, irregular periods, acne, excess hair growth, infertility, and weight gain.'I definitely struggle with my weight, and I struggle with the way that I look, and it's been tough for me. I just found out recently that I have PCOS, and a lot of women have it. And a lot of women have it and don't know,' said Bebe. The three-time Grammy nominee explained that the side effect of weight gain has been hard for her to deal with as an entertainer.'It's tough. I think for me, I've been definitely struggling with my weight, and I've been struggling with food forever,' she said.",
        "Rexha recalled that upon signing her first record deal, she was told by her label, \"Are you ready to get into boot camp shape? Because you need to lose 20 pounds in order to do this career, like you have to lose weight.\"After years of being overly pressured about her weight, she has learned the importance of controlling the people she keeps close to her.On Friday, the beauty put her curves on display in a short video posted to her TikTok account wearing a plunging back bathing suit while enjoying a boat ride. She captioned the post, 'Thick girl on board.'",
        "The singer opened up about her fluctuating weight last month when she discussed feeling 'discouraged' after discovering she was trending on TikTok under the topic 'Bebe Rexha weight.'The Brooklyn-born Albanian tweeted, 'Seeing that search bar is so upsetting. I'm not mad cause it's true. I did gain weight. But it just sucks. Thank you to all the people who love me no matter what.'Bebe (born Bleta) admitted: 'I've always struggled with my weight. A bi*** likes to eat.'Rexha continued: 'I'm working on myself everyday. Just discouraged a bit right now.' When Twitter user @SugaRboo2054 pointed out that her image was illegally used for a 'fat to flat' VLCC weight loss program advertisement on PornHub, the Call On Me singer responded: 'That's just messed up.'",
        "As far back as June 2021, Bebe has promoted the movement to 'normalize 165lbs' before tearfully confessing six months later she was the 'heaviest I have ever been' and felt 'disgusting in my own body.''I weighed myself just now and I don't feel comfortable sharing the weight because I feel embarrassed,' Rexha admitted on TikTok.'I don't feel good in my skin, and when I don't feel good, I don't want to post. And that's really honestly the reason I haven't been posting in the last year or so as much as I used to.",
        "'I think all the body positivity that stems from me is probably a place of hurt and confusion of like, I don't know how to help myself anymore or how to love myself.'The Heart Wants What It Wants hitmaker slipped her curvaceous 5ft 5in figure into a sparkly blue bustier and matching pants to perform her new single If Only I at the Coachella Valley Music and Arts Festival in Indio, CA. ",
        "Rexha recently released her collaboration with Snoop Dogg called Satellite, which dropped on the stoner holiday 4/20.Satellite and If Only I are featured on the bipolar, sexually-fluid star's self-titled third studio album Bebe, which Warner released April 28. She collaborated with multiple well known artists on the record including, Snoop, Dolly Pardon, Travis Barker, Ty Dolla Sign, Lil Uzi Vert, Doja Cat, and Rick Ross. Bebe is next scheduled to perform on May 11 at Seminole Hard Rock Hotel &amp; Casino's The Guitar Hotel in Hollywood, FL, before kicking off her 20-date Best F*n Night of My Life Tour on May 31 in Phoenix, AZ."
    ]
}