{
    "articleURL": "/tvshowbiz/article-12058563/Drew-Barrymore-accepts-Best-Host-award-2023-MTV-Movie-TV-Awards-dropping-hosting-gig.html",
    "content": [
        "Drew Barrymore proudly accepted the award for Best Host during the pre-taped 2023 MTV Movie &amp; TV Awards on Sunday, after dropping out of hosting the show three days earlier. ",
        "The Charlie's Angels actress, 48, who appeared in a skit that parodied her film, Never Been Kissed, was just one of many celebrities that showed their support for the striking Writers Guild of America. The White Lotus star, Jennifer Coolidge, also gave a shout out to the WGA in a video of her accepting the popcorn award for Comedic Genius. The annual ceremony was notably thrown into chaos due to the strike, with celebrities choosing not to attend and the red carpet being scrapped. Drew, who won the Best Host award for The Drew Barrymore Show, could be seen standing inside a bathroom with a light shining directly above her in a short clip.",
        "BEST MOVIEScream VI (WINNER) BEST SHOWThe Last of Us (WINNER) BEST PERFORMANCE IN A MOVIETom Cruise — Top Gun: Maverick (WINNER)BEST PERFORMANCE IN A SHOWJenna Ortega — Wednesday (WINNER)MOST FRIGHTENED PERFORMANCEJennifer Coolidge — The White Lotus (WINNER) BEST DUOPedro Pascal + Bella Ramsey — The Last Of Us (WINNER)BEST SONGTaylor Swift — Carolina (Where The Crawdads Sing) (WINNER)BEST HOSTDrew Barrymore — The Drew Barrymore Show (WINNER)",
        "A shower with a white and blue-tiled wall was directly behind the mother of two. The Golden Globe winner donned a blue-striped, button up and excitedly stated towards the camera, 'Hello, hello. Thank you so much. I can't believe this.' ",
        "'Thank you for letting me in. Get eyeball to eyeball. Thank you for this whole show. This whole world being - thank you. Thank you so much,' Drew further expressed. The actress then paid recognition to the writers that contribute to her popular talk show, which began airing in 2020. 'Oh, my goodness. Okay. Also I want to thank Chelsey, Christina, Liz, our amazing, amazing writers. This is definitely for them and every single person who makes the show.' 'There is no I in my. Just ours and we. Thank you from us. And me!' she concluded, throwing her hands to her head and letting out a scream of giddiness.Earlier on Thursday, just three days before the awards show, Barrymore dropped out of the hosting gig in order to show her 'solidarity' for the WGA strike. In a statement to Variety at the time, the Scream star explained, 'I have listened to the writers, and in order to truly respect them, I will pivot from hosting the MTV Movie &amp; TV Awards live in solidarity with the strike.' 'Everything we celebrate and honor about movies and television is born out of their creation. And until a solution is reached, I am choosing to wait but I’ll be watching from home and hope you will join me,' Drew added. ",
        "She sent her gratitude to MTV and revealed that she will step into the hosting shoes in 2024 for the awards ceremony. 'And I can’t wait to be a part of this next year, when I can truly celebrate everything that MTV has created, which is a show that allows fans to choose who the awards go to and is truly inclusive.​' After her Best Host win, social media users on Twitter couldn't help but point out the irony regarding the situation. One wrote, 'Drew Barrymore won best host even though she bailed on hosting tonight's MTV's Movie &amp; TV Awards??? How ironic...' followed by a confused gif. Others commented on the location of her acceptance speech: the bathroom. A twitter user penned, 'She accepted her award on the toilet which is quite fitting the way this has gone,' while another added, 'But in the bathroom?' Fans of the star also jumped in, with one adding, 'I love Drew Barrymore and watch her show everyday. it's so light hearted, positive never negative, and has a variety of interests on it. I especially like the cooking segment. Congratulations on winning the mtv Awards! You so deserve it!' Others weren't as enthusiastic, with a Twitter user writing, 'This is definitely rigged,' and another, 'Of course the host wins.' ",
        "Despite not hosting the show and choosing to stay home, the star still appeared in a pre-taped skit where she portrayed her character of Josie from the 1999 movie, Never Been Kissed. ",
        "During the sketch, she showed off her dance skills with choreography from Netflix's Wednesday, and also shared a kiss with Cocaine Bear. Barrymore wasn't alone in voicing her support for Hollywood writers during her acceptance speech. Jennifer Coolidge, who won for both Comedic Genius and Most Frightened Performance for The White Lotus, stated, 'Almost all great comedy starts with great writers.''I just think as a proud member of SAG, I stand here before you tonight side-by-side with my sisters and brothers from the WGA that are fighting right now, fighting for the rights of artists everywhere.' She added, 'I think of the words of Shakespeare where he once said, you know, the play is the thing. Well, I don't want to put words in his mouth or anything but I think what he really meant was it's everything!'Other winners throughout the pre-recorded show included The Last Of Us star, Pedro Pascal, who won the honor for Best Hero to kick off the award announcements on Sunday, as the show also garnered the honors for Best Show and Best Duo for Pascal and Bella Ramsey.",
        "Tom Cruise was named the winner for Best Performance in a Movie for Top Gun: Maverick. Cruise showed off his trademark showmanship as he delivered his acceptance speech from the air in a jet.Scream VI was named the Best Movie of the year, while Wednesday's Jenna Ortega was named the winner of Best Performance in a Show. The Kardashians were named Best Docu-reality Series, and in the category of Breakthrough Performance, Stranger Things star Joseph Quinn was crowned with the honor. ",
        "Vanderpump Rules quartet Ariana Madix, Katie Maloney, Scheana Shay and LaLa Kent was named Best Reality On-Screen Team and Adam Sandler took home the prize for Best Comedic Performance. In the category for Best Fight, the Scream VI conflict between Ghostface and Courteney Cox (as Gale Weathers) prevailed of the nominees.RuPaul’s Drag Race: All-Stars was crowned the Best Competition Series, besting competitors including All-Star Shore, Big Brother, The Challenge: USA and The Traitors.Outer Banks stars Madison Bailey and Rudy Pankow were crowned winners in the Best Kiss category. ",
        "BEST MOVIEAvatar: The Way of WaterBlack Panther: Wakanda ForeverElvisNopeScream VI (WINNER)SmileTop Gun: MaverickBEST SHOWStranger ThingsThe Last of Us (WINNER)The White LotusWednesdayWolf PackYellowstoneYellowjacketsBEST PERFORMANCE IN A MOVIEAustin Butler — ElvisFlorence Pugh — Don’t Worry DarlingKeKe Palmer — NopeMichael B. Jordan — Creed IIITom Cruise — Top Gun: Maverick (WINNER)BEST PERFORMANCE IN A SHOWAubrey Plaza — The White LotusChristina Ricci — YellowjacketsJenna Ortega — Wednesday (WINNER)Riley Keough — Daisy Jones &amp; The SixSadie Sink — Stranger ThingsSelena Gomez — Only Murders in the BuildingBEST HERODiego Luna — AndorJenna Ortega — WednesdayPaul Rudd — Ant-Man &amp; The Wasp: QuantumaniaPedro Pascal — The Last Of Us (WINNER)Tom Cruise — Top Gun: MaverickBEST VILLAINElizabeth Olsen — Doctor Strange in the Multiverse of Madness (WINNER)Harry Styles — Don’t Worry DarlingJamie Campbell Bower — Stranger ThingsM3GAN — M3GANThe Bear — Cocaine BearBEST KISS Anna Torv + Philip Prajoux — The Last Of UsHarry Styles + David Dawson — My PolicemanMadison Bailey + Rudy Pankow — Outer Banks (WINNER)Riley Keough + Sam Claflin — Daisy Jones &amp; The SixSelena Gomez + Cara Delevingne — Only Murders in the BuildingBEST COMEDIC PERFORMANCEAdam Sandler — Murder Mystery 2 (WINNER)Dylan O’Brien — Not OkayJennifer Coolidge — Shotgun WeddingKeKe Palmer — NopeQuinta Brunson — Abbott ElementaryBREAKTHROUGH PERFORMANCEBad Bunny — Bullet TrainBella Ramsey — The Last Of UsEmma D’Arcy — House of the DragonJoseph Quinn — Stranger Things (WINNER)Rachel Sennott — Bodies Bodies BodiesBEST FIGHTBrad Pitt (Ladybug) vs. Bad Bunny (The Wolf) — Bullet TrainCourteney Cox (Gale Weathers) vs. Ghostface — Scream VI (WINNER)Jamie Campbell Bower (Vecna) vs. Millie Bobby Brown (Eleven) — Stranger ThingsKeanu Reeves (John Wick) vs. Everyone — John Wick 4Escape from Narkina 5 — AndorMOST FRIGHTENED PERFORMANCEJennifer Coolidge — The White Lotus (WINNER)Jesse Tyler Ferguson — Cocaine BearJustin Long — BarbarianRachel Sennott — Bodies Bodies BodiesSosie Bacon — SmileBEST DUOCamila Mendes + Maya Hawke — Do RevengeJenna Ortega + Thing — WednesdayPedro Pascal + Bella Ramsey — The Last Of Us (WINNER)Simona Tabasco + Beatrice Grannò — The White LotusTom Cruise + Miles Teller — Top Gun: MaverickBEST KICK-ASS CASTAnt-Man &amp; The Wasp: QuantumaniaBlack Panther: Wakanda ForeverOuter BanksStranger Things (WINNER)Teen Wolf: The MovieBEST SONGDemi Lovato — Still Alive (Scream VI)Doja Cat — Vegas (Elvis)Lady Gaga — Hold My Hand (Top Gun: Maverick)OneRepublic — I Ain’t Worried (Top Gun: Maverick)Rihanna — Lift Me Up (Black Panther: Wakanda Forever)Taylor Swift — Carolina (Where The Crawdads Sing) (WINNER)BEST DOCU-REALITY SERIESJersey Shore Family VacationThe Real Housewives of Beverly HillsFamily Reunion: Love &amp; Hip Hop EditionThe Kardashians (WINNER)Vanderpump RulesBEST COMPETITION SERIESAll-Star ShoreBig BrotherRuPaul’s Drag Race: All-Stars (WINNER)The Challenge: USAThe TraitorsBEST HOSTDrew Barrymore — The Drew Barrymore Show (WINNER)Joel Madden — Ink MasterNick Cannon — The Masked SingerRuPaul — RuPaul’s Drag RaceKelly Clarkson — The Kelly Clarkson ShowBEST REALITY ON-SCREEN TEAM (presented by SONIC®)Mike “The Situation” Sorrentino, Vinny Guadagnino, Pauly D (MVP) — Jersey Shore Family VacationTori Deal and Devin Walker — The Challenge: Ride or DiesRuPaul Charles and Michelle Visage — RuPaul’s Drag RaceAriana Madix, Katie Maloney, Scheana Shay, LaLa Kent — Vanderpump Rules (WINNER)Garcelle Beauvais and Sutton Stracke — The Real Housewives of Beverly HillsBEST MUSIC DOCUMENTARYHalftimeLove, LizzoSelena Gomez: My Mind &amp; Me (WINNER)SherylThe Day the Music Died: The Story of Don McLean’s American PieBEST MUSICAL MOMENT Sofia Carson's Come Back Home from the film Purple Hearts (WINNER) COMEDIC GENIUS AWARDJennifer Coolidge (WINNER)"
    ]
}