{
    "articleURL": "/debate/article-12057541/ROBERT-HARDMAN-Coronation-concert-one-hell-Mummys-flower-beds.html",
    "content": [
        "At jubilee after jubilee, concert after concert, it used to be his happy duty to stand in front of millions and raise three cheers for 'Mummy'.",
        "Last night, it was finally the turn of 'Pa' to be on the receiving end as the Prince of Wales led the nation's salute to Charles III.Three quarters of the way through an extraordinary Coronation concert – spanning Olly Murs, the Royal Ballet, a Tom Cruise skit, choirs galore and a light show stretching from Belfast to Dover – the heir to the throne stepped up to the stage.He had come to deliver a very different sort of homage from Saturday's robed genuflection in Westminster Abbey.Yet it was, in its own way, just as touching. The message was the same: kingship equals service.",
        "Invoking the memory of the late Queen, he added: 'I know she's up there, fondly keeping an eye on us. She would be a proud mother.'",
        "Big cheers from this 20,000-strong crowd of ballot-winners, charity workers and Commonwealth troops. Up in the royal box, the King beamed the fondest of paternal smiles. This really was a hell of a show, broadcast by the BBC across 100 countries, though I am not sure that 'Mummy' would have entirely approved of the state of her lawns and flowerbeds.The East Terrace, the rose garden that was so lovingly created by Prince Philip (he even designed the lotus flower fountain in the middle), looked as if an alien invasion had just landed in a crown-shaped spaceship.",
        "Gangways and catwalks had been erected alongside rosebeds and crenellations (just as well that the cast included Alan Titchmarsh). I hope that the royal gardeners had relocated the resident flock of budgerigars who usually roost at this end of the castle, next to the golf course.For many decades, an arena has been erected down below in the park at this time of year for the Royal Windsor Horse Show.This time, a stadium double the size had been bolted on to ramparts dating back to William the Conqueror. It was a spectacular backdrop for a royal concert quite unlike anything we have seen before. New reign, new celebrations then.The age of the blazing beacon is now over, as indeed is the dear old royal fireworks display.Last night produced a national light show, instead.Interlinked drones took to the skies across the kingdom – red dragons over Cardiff, a giant watering can over Cornwall's Eden Project and so on.Here at Windsor we had a giant flower, a red white and blue butterfly and a blue whale.Seated between Queen Camilla and the Commonwealth secretary-general Baroness Scotland, the King did not appear on stage himself. His own words featured prominently throughout, however.The show began with an extract from his accession pledge. Later on, his reflections about the future of the planet morphed into a new version of the Eighties hit by Simple Minds, Don't You Forget About Me, sung by Zak Abel.",
        "Those very words then went flying across the castle walls, over the giant circular screen above the stage and skywards.Pilots will have been able to read it on their way in and out of neighbouring Heathrow. A confusing night for air traffic control. Music will long remain one of the stand-out memories of the crowning of Charles III.Saturday's Westminster Abbey ceremony was exemplary. To the canon of coronation works by Handel, Parry and Walton, we can now add several more, including Andrew Lloyd Webber's Make A Joyful Noise and the exquisite Sacred Fire, sung by Pretty Yende, composed by Sarah Class and written by Dr Grahame Davies (poet, bard and deputy private secretary to the Prince of Wales).And so it was with last night's musical line-up. The big idea was not big names so much as giant collaborations. Some reports had given the impression that this concert had failed to attract certain stars (who had, in any case, pre-booked 2023 tours before the Queen's death).They missed the point that the King had not asked for a Top 40 chart show. Although there was plenty of that in the form of Lionel Richie, Katy Perry, Paloma Faith and Olly Murs, among others, here, too, was the classical superstar, Lang Lang.",
        "What the King had wanted was a collegiate celebration of British and international creative talent, including his beloved Royal Shakespeare Company, the Royal Academy of Arts and the Royal Opera.This was a bill which included artist Tracey Emin, discussing the King's watercolours, before some were beamed across the castle walls, accompanied by an enchanting recital of Bach's Prelude in C major by piano prodigy Lucy Illingworth. Actor Richard E Grant appeared to discuss Queen Camilla's book club. The organisers had included the King's master of ceremonies, the Earl Marshal (the Duke of Norfolk) and his Master of the Royal Household.I dare say this is what the Royal Variety show might look like if it were left to the royals.So, we had Take That teaming up with the choir of St George's Chapel in Windsor. Birmingham-born Steve Winwood co-ordinated a virtual choir from 40 Commonwealth countries in a rendition of his monster hit, Higher Love.From the world of opera, Sir Bryn Terfel – fresh from the Abbey – and Andrea Bocelli duetted through the Merseyside anthem, You'll Never Walk Alone (take note, Liverpool fans who thought it was clever to boo the national anthem at the weekend).",
        "Gareth Malone marshalled the 300-strong Coronation Choir. Through it all, the Royal Family's in-house talent – the Household Division Orchestra, the State Trumpeters and the Countess of Wessex's String Orchestra – played with the lot of them.",
        "Paddington Bear had been the unlikely star of last year's Jubilee concert. Last night's compere was his cinematic co-star, Hugh Bonneville, who discussed royalty with Kermit the Frog and Miss Piggy.Winnie-the-Pooh and Piglet popped up to discuss the King's lifelong love of Scotland's dwindling red squirrel population. The monarch has, indeed, installed a squirrel flap at his Birkhall home so that Tufty and Co have access to a 24-hour nut supply.By way of something completely different, Tom Cruise reprised his Top Gun role, pre-recording a spoof from the cockpit: 'Pilot to pilot, Your Majesty, you can be my wingman any time' – before saluting and banking off.The mandatory James Bond element was provided by Pierce Brosnan, reminding the audience of the King's youthful 'action man skills'. Cue some grainy shots of the young Charles in various uniforms.The setting grew more dramatic and the crowd livelier the later it went on. By the time Lionel Richie took to the piano to sing 'Easy', we were well into Sunday evening. 'All Night Long' was not going quite that far but it had the entire royal box on their feet and swaying along, waving their flags.Though well past bedtime, Prince George and Princess Charlotte had been allowed to stay up to the end. One day, no doubt, it will be George who appears on a stage like this to honour his own father. Last night, he could see how it is done.",
        "For all the talents and clever gizmos on display, this was – ultimately – a celebration of one man and one family in the back garden. 'God save the King!' concluded the Prince of Wales, and back it came in a chorus of 20,000.The grass may be suffering this morning. But the Prince of Wales was, surely, right. 'Mummy' would have been proud indeed."
    ]
}