{
    "articleURL": "/femail/real-life/article-12049195/Maison-Sabr-dentist-brothers-started-multi-million-dollar-luxury-leather-goods-brand.html",
    "content": [
        "Omar and Zane Sabré were devastated after their father's cancer diagnosisThe dentist brothers started a luxury leather goods brand to pay the billsMaison de Sabré is now a multi-million dollar business sold in over 150 countriesTwo dentists with limited knowledge of the fashion industry founded a multi-million dollar luxury leather goods brand that sells one product worldwide every minute. ",
        "Maison de Sabré is a brand born out of necessity when its founders were forced to put their lives on hold after their father was diagnosed with leukemia.New Zealand natives Omar, 32, and Zane Sabré, 29, launched the label in 2017.At the time, Omar was working full-time as a dentist and Zane was studying dentistry in Queensland, Australia. Zane had no access to government loans as an international student, and the family had already spent over $400,000 on his education when their father was diagnosed.'It was a very difficult time,' Zane told FEMAIL. 'My options were to find a way to pay it off or forfeit all the money and my degree.'",
        "Zane was two years away from graduating from a seven-year-long university course when he decided to put this studies on hold and fly back to be with the family.'It was so devastating,' Omar revealed. 'We'd never dealt with cancer in our family and having to go through our dad's diagnosis was the most heartbreaking and challenging thing we've ever done.'The family spent days on end fixating on what the future would look like and how they could possibly recover if their father died.'As doctors, we tried to be as realistic and possible and have a positive mindset,' Omar said. 'We kept wondering if there were ways we could use our education to help him understand what was happening.'",
        "'It took a lot of mental strength,' Zane added. 'Our parents are our everything, and seeing them like that was very difficult.'",
        "'We were racked with anxiety and stress while also trying to build a brand,' Omar said. And while their parents have always supported their dreams, the family was a bit hesitant about their new career path. 'We come from a very traditional household, our parents wanted us to excel in careers like engineering or medicine,' Omar said. 'They were skeptical at first but there hasn't been a moment our parents haven't supported us on this journey.'",
        "The brand has since grown into a global company adored by consumers in 150 countries.Zane and Omar made Forbes' 30 under 30 list just two years after starting Maison de Sabré.'It's amazing how we pulled off running a full-time business while still working and studying full-time during the first year,' Omar said. Zane was able to resume his studies and graduate from medical school once his father had completed chemotherapy two years later, but both have now quit dentistry all together to focus all their time and energy on Maison de Sabré.The brothers originally pooled $40,000 to begin selling one product: a leather phone case with customisable gold lettering. The brand made several million dollars after their first year and the brothers were able to pay off their loans.",
        "Maison de Sabré sells phone cases, backpacks, handbags, briefcases, wallets, and notebooks.Their bespoke leather backpacks have just overtaken their popular phone cases as best-sellers. The brand was amongst the first to offer easily customisable leather products - with several celebrities like Kara Gerber, Dakota Fanning, and Addison Rae flaunting their beautiful phone cases with gold lettering.'We're really focused on our passions and we're glad we're able to do something that feels so innate,' Omar told FEMAIL. ",
        "1. Do something you are passionate aboutWhen you are passionate about what you do, you are more likely to stick with it and overcome obstacles along the way. Pursuing your passion is crucial when it comes to entrepreneurship because it gives you the motivation, drive, and resilience needed to succeed in a competitive and dynamic world2. Work hard and be persistentSuccess in entrepreneurship requires hard work and persistence, it requires never giving up in the face of adversity. Building a successful startup is a marathon, not a sprint. It takes time, effort, and patience to create something truly valuable and meaningful, and you will likely face many setbacks along the way3. Learn from failureFailure is a natural part of entrepreneurship, you need to view it as an opportunity to learn and grow. Becoming comfortable with failure will allow you to be more comfortable taking risks and innovating within your business4. Take risks and be boldOne of the benefits of being young and in entrepreneurship is that you are more likely to not have the responsibilities that you have later in life. This makes it easier to make bold moves. Taking risks is an essential part of entrepreneurship because it allows you to explore new opportunities and innovate. Extraordinary outcomes don't come from doing things in the same way they have been done in the past5. Become comfortable being a problem solverAs an entrepreneur, every day is about problem-solving. Your role is to be able to find solutions that will progress your team and start-up closer to achieving your vision. Problem-solving is not just about finding the right solution, but also about learning and growing in the process. As leaders, Omar and I focus on building a culture of 1% improvement within our team. This means that we take steps every day to make small improvements that we can sustain and compound over timeSource: Zane Sabré"
    ]
}