{
    "articleURL": "/news/article-12038143/Virginia-Gov-Glenn-Youngkin-says-wont-make-2024-presidential-run-year.html",
    "content": [
        "Virginia's Republican Gov. Glenn Youngkin said he would not be running for president 'this year' He could still jump in the 2024 race later in the campaign cycle, an aide saidYoungkin said Monday that the future of the GOP 'doesn't necessary depend on Donald Trump'  Virginia Gov. Glenn Youngkin said he would not be running for president 'this year' - but could still jump in the 2024 race later in the campaign cycle as he argued that the future of the GOP 'doesn't necesarily depend on Donald Trump.' ",
        "Youngkin, a Republican, was interviewed Monday by The Wall Street Journal's Editor-at-Large Gerard Baker for a Milken Institute event in Los Angeles. When asked if he'd be 'dusting off that fleece jacket' - his trademark campaign trail look when he won the governor's mansion in 2021 - for a presidential run, Youngkin answered in the negative. 'No,' he told Baker. 'I'm going to be working in Virginia this year.'Youngkin explained that until November he would be focused on Virginia's legislative elections, with an aide later telling Politico he could still throw his hat in, it would just be later in the cycle. ",
        "'This was not an announcement or a definite decline,' the aide said. With Baker's question based on Youngkin's 2023 plans, the governor 'was answering the question with that in mind.' As Youngkin explained, 'I have my midterms this year. We're off-cycle.''I want to hold our House, and I'd like to flip our Senate,' he said. 'And I think we're going a really good job in Virginia, and I think this is a chance to bring that to voters.' Youngkin also noted, 'I haven't written a book and I'm not in Iowa' - two things that generally indicate a politician will launch a presidential bid. Iowa generally holds the first presidential contest, a caucus, and that holds true for Republicans in 2024, while Democrats have moved their first contest to South Carolina. ",
        "Youngkin's 2021 win was a bright spot for Republicans after former President Donald Trump lost the White House and Democrats retained control of Congress in 2020. ",
        "Youngkin beat former Democratic Gov. Terry McAuliffe - who was seeking a second, non-consecutive term - by keeping Trump and his MAGA allies at a safe and peaceful distance, allowing himself to make gains in the Washington, D.C. suburbs, which have turned the state blue in recent cycles.In Fairfax County, for example, while President Joe Biden beat Trump 70 percent to 29 percent, Youngkin won 35 percent of the vote to McAuliffe's 65 percent.Early on in his race, Youngkin embraced Trump's false election fraud claims.He was endorsed by Trump after winning the gubernatorial nomination at the party convention and praised the ex-president. Youngkin mostly avoided references to the former president after that. Since then, Trump has sporadically targeted Youngkin as he fends off a handful of 2024 challengers. In November, Trump spelled the governor's name 'Young Kin' and added a racist remark.'Sounds Chinese, doesn't it?' Trump insisted Youngkin only won his gubernatorial race thanks to his endorsement. 'I Endorsed him, did a very big Trump Rally for him telephonically, got MAGA to Vote for him - or he couldn't have come close to winning,' the former president said. 'But he knows that, and admits it.' ",
        "'Besides, having a hard time with the Dems in Virginia - But he'll get it done!' Trump also said, seemingly still supporting Youngkin simply because he's a Republican. So far, Trump has dominated in the 2024 GOP primary polls against both announced and unannounced candidates. Still, on Monday, Youngkin voiced that the Republican Party could leave Trump behind. 'I think there's a future for the Republican Party for sure, and it doesn't necessarily depend on Donald Trump,' he told Baker. 'This is a moment, I believe, as Republicans where the common-sense approach to so many of these challenges resonates, and in Virginia, we've demonstrated that it works.' "
    ]
}