{
    "articleURL": "/wires/ap/article-12060759/Disney-updates-lawsuit-against-DeSantis-add-new-events.html",
    "content": [
        "ORLANDO, Fla. (AP) - Disney on Monday amended its free speech lawsuit against Gov. Ron DeSantis to add recent developments in the tit-for-tat fight between the entertainment giant and the Florida governor, such as a new law granting the state unprecedented authority to inspect a monorail system at Disney World.",
        "Disney's amended complaint filed in federal court in Tallahassee is updated with developments since the entertainment giant almost two weeks ago sued DeSantis and an oversight board for the Disney World governing district that is made up of members newly appointed by the governor.The new complaint references legislation passed last week by Florida lawmakers that rescinds agreements that Disney and a previous oversight board consisting of Disney supporters made earlier this year, giving the entertainment giant control over design and construction at Disney World. The amended lawsuit also includes the new measure passed last week by Florida lawmakers giving the state authority to inspect Disney World's monorail system, which previously had been conducted in-house.Disney is the only company impacted by the new measure and it \"was precision-engineered to target Disney alone, just as Governor DeSantis intended and previewed,\" said the amended lawsuit.The Disney lawsuit asks a federal judge to void the governor´s takeover of the theme park district, as well as the oversight board´s actions, on the grounds that they were violations of company´s free speech rights.Almost a week after Disney filed its lawsuit, members of the oversight board sued Disne y last week in state court in an effort to maintain its control of construction and design at Disney World. It claimed the agreements between the company and previous board members \"reek of a backroom deal.\"",
        "Disney and DeSantis have been engaged in a tug-of-war for more than a year that has engulfed the governor in criticism as he prepares to launch an expected presidential bid in the coming weeks.The fight began last year after Disney, beset by significant pressure both internally and externally, publicly opposed a state law that bans classroom lessons on sexual orientation and gender identity in early grades, a policy critics call \"Don´t Say Gay.\"As punishment, DeSantis took over Disney World´s self-governing district through legislation passed by Florida lawmakers and appointed a new board of supervisors that would oversee municipal services for the sprawling theme parks and hotels. But before the new board came in, the company made agreements with members of the previous oversight board that stripped the new supervisors of their authority when it comes to design and construction.The creation of Disney's self-governing district by the Florida Legislature was instrumental in the company´s decision in the 1960s to build near Orlando. The company had told the state at the time that it planned to build a futuristic city that would include a transit system and urban planning innovations, so the company needed autonomy in building and deciding how to use the land. The futuristic city never materialized and instead morphed into a second theme park that opened in 1982.",
        "Follow Mike Schneider on Twitter at @MikeSchneiderAP"
    ]
}