{
    "articleURL": "/femail/article-12054269/Shes-DOUBLE-Diana-Royal-fans-wild-Charlotte-looks-like-grandmother.html",
    "content": [
        "Royal fans have gone wild over eight-year-old's resemblance to Princess Diana CORONATION LIVE BLOG: Click here to follow live updates throughout the day Royal fans have gone wild over how much Princess Charlotte looks like her late grandmother Princess Diana at the Coronation today. ",
        "The eight-year-old looked incredible as she matched her mother in an Alexander McQueen dresse at Westminster Abbey.The young princess wore a dress and cape in ivory silk crepe with ivory stitch embroidery featuring rose, thistle, daffodil and shamrock motifs, to signify the four nations.Her mum Kate also looked elegant in a similar stunning ivory silk crepe gown, which featured silver bullion and thread work embroidery featuring rose, thistle, daffodil and shamrock motifs also to represent each of the four nations.Despite matching outfits with Kate, followers of the event confessed they were amazed by how similar the little Princess appeared to her late grandmother Diana.",
        "Many shared an image of Charlotte's grandmother, who died in 1996, from when she was aged around 10. One person commented: 'Princess Charlotte looks exactly like Diana, it's insane.' Another wrote: 'Charlotte looks like Diana omg.' A third added: 'Charlotte looks like grandma Diana.' A fourth wrote: 'Her way of smile reminded me her granny Princess Diana, she had the same shy smile.'God bless our little princess and future Princess Royal.'It's not the first time royal fans have spotted the likeness between Charlotte and Diana - with many often commenting the two appeared to share many similarities. At the event today, Charlotte matched her mother in a Jess Collett x Alexander McQueen headpiece with silver bullion, crystal and silver thread work three-dimensional leaf embroidery.",
        "Meanwhile the pair completed their ensembles with white shoes and swept their locks back into chic updos for the historical occasion.In a touching nod to her late mother-in-law, the Princess of Wales wore a set of Diana’s pearl and diamond earrings for the occasion.",
        "The Princess has long chosen to wear Alexander McQueen for significant moments in her life.She worn the fashion brand on numerous occasions, most notably choosing its creative director Sarah Burton to design her wedding dress.The four flowers of the home nations - English rose, Scottish thistle, Welsh daffodil and Irish shamrock - were embroidered on to the dress.Kate donned pearl earrings that were gifted to Diana before her wedding to Prince Charles in 1981.",
        "The mother of three previously wore the jewellery, left to William and Harry, at the Baftas in 2019. They feature a double curve of various cuts of diamond, with a hanging pearl.Diana wore the earrings on various occasions, including at a banquet for the Japanese Emperor Akihito in 1990 - and at a gala at the Palace of Versailles in 1994.Last night, Kate commanded attention at a reception at Buckingham Palace ahead of the big day. She wore a new £360 Self-Portrait wrap midi dress to attend the event in London, hosted by King Charles on the eve of his Coronation.",
        "Earlier today Charlotte was seen sitting alongside her little brother Prince Louis in Westminster Abbey after they arrived alongside the Prince and Princess of Wales.The siblings arrived without their older brother Prince George, nine, who was a Page of Honour for his grandfather. The Prince and Princess of Wales' two youngest children were immaculately behaved during the service, with Charlotte proving a reassuring presence to her younger brother, who couldn't help but stifle a few yawns during the sacred service.Meanwhile, her younger brother Louis - who turned five on St George's Day on April 23rd - looked regal in a bespoke outfit.For the historic occasion, the young Prince is wearing an outfit made by Savile Row tailors Dege and Skinner, which consists of a Hainsworth Garter Blue Doeskin Tunic with specially designed lace work embellishment to the collar, cuffs and fronts. The leg garment is black complete with a Garter Blue stripe."
    ]
}