{
    "articleURL": "/wires/afp/article-12043091/Opposition-candidate-Sierra-Leone-clears-hurdle-election-bid.html",
    "content": [
        "The biggest rival to Sierra Leone's outgoing president in upcoming elections has cleared a key hurdle that could have barred him from contesting the ballot.",
        "Samura Kamara, who was defeated by Julius Maada Bio in the 2018 ballot, has been on trial since February for alleged corruption.His supporters, who say the case is politically motivated, have feared he could be given a fast-track conviction that would bar him from taking part in the June 24 vote.But a spokesman for the electoral commission said Wednesday that Kamara had officially filed his application for the election on Monday, a move that came after his case was ordered adjourned until July 14.Separately, the High Court on Tuesday ordered the release of Kamara's passport, enabling him to attend a meeting of the Commonwealth secretariat in Britain, judicial spokesman Elkass Sannoh told AFP.Kamara, the champion of the All People's Congress (APC), is seen as the main rival to Bio, backed by the Sierra Leone People's Party (SLPP).Bio on Tuesday filed his own nomination papers for re-election, campaigning on his policies of free education and support for agriculture.After defeating Kamara in the second round of the 2018 presidential election, he launched an anti-corruption campaign in the small West African country, where graft is considered to be endemic.Kamara was charged in December 2021 of embezzling more than $2.5 million in public funds earmarked for refurbishing Sierra Leone's consulate in New York, from the time when he was foreign minister.",
        "He is campaigning on a programme to fix the economy.\"It's a shame and a systematic challenge that our country can't feed itself in 62 years, provide electricity and infrastructure,\" he told supporters in Freetown after submitting his bid.Presidential elections in the country of some eight million people will coincide with parliamentary and municipal ballots. Candidates for the presidency have until May 9 to file their bid.Economic problems and concern over inflation stoked protests last August in which six police officers and 27 civilians were killed.On April 3, the authorities banned political street rallies -- time-honoured parades that move through towns.Under the new rules, parties must identify a single venue such as a stadium or community centre in which to hold campaign events."
    ]
}