{
    "articleURL": "/wires/reuters/article-12058887/European-shares-edge-higher-energy-bank-stocks-gain-US-inflation-data-eyed.html",
    "content": [
        "Healthcare, bank stocks lead gains",
        "German industrial production falls in MarchSBB slumps after S&amp;amp;P downgrades to junk(Updates to market close)By Amruta Khandekar and Sruthi ShankarMay 8 (Reuters) - European shares ended higher on Monday, with healthcare and bank stocks in the lead as investors awaited key U.S. inflation data later this week for fresh clues on the Federal Reserve's monetary policy path.The pan-European STOXX 600 index rose 0.4% even as gains on Wall Street faded after a few disappointing earnings reports.The European equities benchmark came under pressure last week when the European Central Bank, unlike the Fed, signalled that more interest rate hikes were on the cards as inflation across the 20 countries that share the euro remains stubbornly high.The focus is now on U.S. consumer prices reading for April due on Wednesday for hints on whether rate cuts in the world's largest economy are coming soon. The Fed raised rates last week in an action that may be the last of its current tightening campaign.\"We expect another month of discouraging CPI prints,\" economists at BNP Paribas wrote in a note.\"Fed officials will likely be wary in acknowledging progress on the inflation front, so as not to be caught off-side by yet another false dawn. Policymakers will likely need to see several more months of sustained improvement before they begin softening their inflation assessment.\"",
        "Additionally, the Fed's Senior Loan Officer Opinion Survey due later in the day will be parsed for clues on the state of lending, given the recent turmoil in U.S. regional banks.Banks and healthcare rose about 0.8% each, leading sectoral gains in Europe, while real estate shares slid 0.7%.Swedish landlord SBB plummeted nearly 20% after S&amp;amp;P Global cut its long-term credit rating to junk on concerns over its liquidity position.Germany's DAX index slipped 0.1%, lagging other regional markets in Europe, after data showed German industrial production fell more than expected in March, partly due to a weak performance by the automotive sector.Stock markets in London were closed for a holiday on Monday following the coronation of King Charles on Saturday.Among other movers, PostNL jumped 10.2% as the Dutch postal firm affirmed its 2023 outlook after reporting a smaller-than-expected drop in first-quarter parcel volumes.Spanish pharmaceutical firm Almirall SA inched up 0.2% after its first-quarter core earnings beat analysts' estimates. (Reporting by Amruta Khandekar; Editing by Sherry Jacob-Phillips, Janane Venkatraman and Christina Fincher)"
    ]
}