{
    "articleURL": "/news/article-12057437/Royal-fans-convinced-opera-star-King-Charles-Coronation-Concert-spitting-image-Ed-Balls.html",
    "content": [
        "Sir Bryn Terfel has sang once again at this evening's Coronation concertHis resemblance to former Labour MP Ed Balls caused a stir with viewers Viewers watching King Charles III's Coronation concert were once again treated to a performance from a Welsh language opera singer - whose startling resemblance to an ex-Labour MP raised eyebrows yesterday.",
        "Sir Bryn Terfel, 57, earned high praise for his rendition of Welsh language piece Kyrie Eleison during the historic service at Westminster Abbey.But it was the bass-baritone's similarity to former Labour frontbencher Ed Balls that got the most comments on social media.As Sir Bryn took to the stage outside Windsor Castle alongside tenor Andrea Bocelli, viewers once again commented on his similarity with the former Labour education secretary, who served under Gordon Brown's government from 2007 to 2010.'Ed Balls has some pipes on him,' quipped one person on Twitter, while another added, 'I didn't realise Ed Balls sang opera'.",
        "The Coronation Concert, beamed onto large screens across the country, saw the Prince of Wales make a speech honouring his father the King before performances by Katy Perry, Take That, Lionel Richie, and Nicole Scherzinger.Stars including Hugh Jackman, Pierce Brosnan, Dame Joan Collins, Bear Grylls OBE, Alan Titchmarsh, and Sir Tom Jones gave pre-recorded video messages in honour of the King throughout the concert, which was hosted by Hugh Bonneville.Top Gun star Tom Cruise delivered a video message from his War Bird plane, saying: 'Pilot to pilot. Your Majesty, you can be my wingman any time,' before saluting and banking off.Muppets stars Kermit and Miss Piggy also gave speeches, with the frog saying he was 'honoured' to have been invited to the coronation.",
        "At the same time, 10 towns and cities across the country were treated to 'spectacular' light displays, while 1,000 drones took to the sky for a UK-first 'multi-location drone show'.",
        "At yesterday's Coronation, as Sir Bryn sang the beautiful Kyrie Eleison - described as a 'cry from the deep soul of the hills and valleys of Wales' - viewers were in stitches over a striking resemblance between him and Balls.One person said: 'Why is Ed Balls singing at the coronation?'A second wrote: 'Lost my glasses and proper thought that was @edballs singing #Coronation'.Another added: 'Fair play to Ed balls . Didn’t know he could sing. #KingsCoronation'.A fourth joked: 'Ed Balls was wasted on Strictly #Coronation'.Meanwhile, another chimed in: ' First dancing on Strictly and now singing at the Coronation, who knew was so talented!!Ahead of the Coronation, the celebrated Welsh bass-baritone said he was looking forward to giving Wales 'a platform' and saw it as an opportunity to promote the Welsh language.Speaking to BBC Cymru Fyw ahead of the occasion, he said: 'The piece is to be sung in Welsh.",
        "'That is my mindset every time I work with the Royal Family, that it is related to Wales.'It's also a platform for the Welsh language once again'.",
        "Sir Bryn, who was born in Gwynedd, Wales, started started singing at eisteddfod competitions from the age of four but his career has taken him all over the world.He won Grammy Awards for his album Opera Arias in 1996 and his crossover CD Simple Gifts a decade later. He became the second recipient of the Queen's Medal for music in 2006 and received a knighthood for his services to music in 2017.In 2019, he married Welsh harpist Hannah Stone who is the former official harpist of King Charles, when he was the Prince of Wales. But the case of mistaken identity appeared not to be the only humorous moment during the King's coronation service at Westminster Abbey. ",
        "US singer Katy Perry also left royal spectators in stitches after being spotted wandering round Westminster Abbey like a lost lamb. The 'California Gurls' singer, who will perform at the Coronation Concert at Windsor Castle tomorrow, was caught by fans searching far and wide for her seat. Unable to see thanks to an impressive fascinator, she can be seen cocking her head and spinning around in circles in desperate search for her place."
    ]
}