{
    "articleURL": "/wires/aap/article-12038743/Warners-Delhi-defy-odds-beat-leaders-Gujarat.html",
    "content": [
        "If captain David Warner and coach Ricky Ponting can haul Delhi Capitals into the Indian Premier League play-offs they will have done it the hard way.",
        "Having given the other nine teams a head start by losing their first five matches they are scrapping their way back into playoff qualifying contention.Facing the leaders and holders Gujarat Titans on Tuesday they were reduced, mainly by Mohammad Shami's brilliant 4-11, to 5-23 after five overs. Yet they managed to haul themselves to 8-130, then to Warner's joy restricted Titans to 6-125 to steal an unexpected five-run win.Capitals remain bottom of the table but have now won three out of four and are within two wins of the qualifying top four with five matches to play.After four fifties in the first six matches the runs have dried up for Warner with 23 in three innings but his captaincy smarts remain.With only five bowlers in his armoury he skilfully juggled his resources and was backed by his bowlers who sent back the dangerous duo Subman Gill (6) and David Miller (0) to leave Titans 32-4 in the seventh over.With Hardik Pandya playing a restrained anchor knock of 59 not out off 53 it came down to 30 off nine balls.The Iceman, Rahul Tewatia, then smashed 145kph South African pacer Anrich Nortje for three successive sixes swinging the odds back Titans way.But veteran Ishant Sharma kept cool conceding six runs and dismissing Tewatia (20 off seven) in the final over to earn Capitals a tense, much-needed win, celebrated by Warner leaping into his arms.",
        "\"That was a nailbiter,\" said Warner. \"Our batters struggled early on but our bowlers were amazing.\"I did think here we go again, we keep finishing ways to lose wickets in clumps. I don't know what's happening with our batting at the moment but we'll take the two points.\"The day had began badly for Capitals Mitch Marsh having to withdraw with illness.Having chosen to bat they then lost England's Phil Salt first ball, caught blasting to Miller at cover.Six balls later Warner was out. Priyam Garg turned the ball towards midwicket and set off, Warner responded only to find, when more than halfway down, that his partner was no longer running as he'd seen Rashid Khan rushing in to field. Rashid grabbed the ball and kept sprinting to the non-striker's end, taking off the bails with Warner stranded.Rilee Rossouw, Marsh's replacement, edged Shami next over and the wily Indian seamer claimed two more wickets in his next over to leave Capitals reeling.To get to 8-130 was a decent feat, and owed much to Aman Khan who made an excellent 51 off 44 balls with good support from Axar Patel (27 off 30) and Ripal Patel (23 off 13).It still did not seem enough. But it was."
    ]
}