{
    "articleURL": "/wires/reuters/article-12043047/Airbus-posts-lower-Q1-profit-delays-new-freighter.html",
    "content": [
        "By Tim Hepher",
        "PARIS, May 3 (Reuters) - Airbus posted a smaller than expected fall in first quarter core earnings as a strong performance at its helicopters segment helped offset the hit from fewer airplane deliveries and negative currency effects.The world's largest planemaker reaffirmed production and financial targets, but said the introduction of a freighter version of its A350 jetliner would slip by a few months to early 2026 and warned of supply chain disruption throughout the year.\"The production ramp-up is difficult for everyone,\" Chief Executive Guillaume Faury said.In an unusual move, he singled out U.S. engine maker Pratt &amp;amp; Whitney for some of its troubles.The supplier is having to juggle between providing enough engines for new jet production while feeding enough spares to airlines to fill a gap left by faster-than-expected engine wear.\"We see more problems on the engine side than we were seeing before, in particular with the...GTF,\" Faury told reporters, referring to the latest-generation Pratt engine for the Airbus A220 and A320neo, which fly on short and medium routes.Pratt &amp;amp; Whitney competes with GE-Safran venture CFM to power Airbus' best-selling A320neo, but has been facing problems with the durability of its GTF engines in hot and dusty climates.India's third-largest airline Go First filed for bankruptcy on Wednesday, blaming problems with Pratt &amp;amp; Whitney's GTF engines. Pratt has dismissed the claim, saying the airline is deflecting attention from deeper financial troubles.",
        "Faury declined to comment directly on the dispute but said Raytheon Technologies unit Pratt was finding it hard to support the airline fleet with enough spare parts and engines.Pratt reiterated earlier comments that engine durability had improved and that it was working on further upgrades.SUPPLY TENSIONThe engine dispute is the latest flashpoint in a post-COVID supply chain meltdown that has seen delays and shortages ripple across aerospace and other sectors.Faury confirmed that seats and aerostructures had joined the list of delayed parts, as reported by Reuters in February.\"We need all suppliers to be delivering on time,\" he said.The comments came as U.S. aerostructures giant Spirit Aero Systems took several charges in the first quarter including $81 million related to the Airbus A220, for which it makes the wings.Faury predicted \"persistent tensions in the supply chain\". But despite a weak first quarter, he said Airbus still estimated it would meet annual delivery targets - albeit with a heavy concentration of deliveries in the last four months.\"We still have a lot of work to do,\" he told analysts.Airbus posted adjusted quarterly operating earnings of 773 million euros ($854 million), down 39%, as revenues dipped 2% to 11.763 billion euros.Airbus hedges about half of its mainly dollar-based revenues but remains exposed to currency fluctuations between the point at which it takes progress payments from airlines and the day a jet is delivered, when the associated accounting is finalised.",
        "Analysts were on average expecting adjusted operating profit, which softens such fluctuations to help gauge the underlying businesses from planes and rockets to helicopters and fighters, of 736 million euros on revenues of 11.37 billion.($1 = 0.9051 euros) (Reporting by Tim Hepher Editing by Elaine Hardcastle, Mark Potter and Deepa Babington)"
    ]
}