{
    "articleURL": "/sport/football/article-12050917/Natalie-Portman-wants-Wrexhams-womens-team-Hollywood-Angel-City-FC-game.html",
    "content": [
        "Wrexham's women's team had their own season of success in Wales this yearIt hasn't gone unnoticed in Hollywood among Angel City FC co-owners  DailyMail.com provides all the latest international sports newsNatalie Portman wants to bring Wrexham's women's team to Los Angeles to play against Angel City FC, after the actress filmed a documentary about her Hollywood soccer side.",
        "Portman, 41, is one of Angel City's founders and the LA team has some star-name investors such as Serena Williams, Eva Longoria and Christina Aguilera.The premiere for Portman's docuseries was held in LA on Thursday night, when the actress opened up on her admiration for Wrexham and the impact of fellow Hollywood stars Ryan Reynolds and Rob McElhenney.'I've been lucky enough to talk to him about his journey, and he's so inspirational for what he's done with Wrexham, and they have a women's team also,' Portman said of Reynolds. 'So, we have talked about kind of having some friendly matches at some point.' Wrexham's women's team also won promotion last year to the highest tier of women's soccer in Wales - an achievement the club's star owners have been thrilled by.",
        "When they secured promotion last April, Reynolds tweeted: 'ABSOLUTELY INCREDIBLE. CONGRATULATIONS @WrexhamAFCWomen!!!!'On May 2, both of the victorious Wrexham teams celebrated this season's successes with open top bus parades around the Welsh town with the Hollywood owners. Reynolds and McElhenney have used their profile in the United States to secure some exciting friendly games for Wrexham's men's team in the offseason.They will play Chelsea in North Carolina on July 19 and Manchester United in San Deigo on July 25. There will also be a game against LA Galaxy's reserve team on July 22. ",
        "Before then, they are having a party - Reynolds and McElhenney have bankrolled a four-day trip to Las Vegas for the men's squad to celebrate its promotion to the fourth tier of English soccer.Angel City shares its 22,000-seater BMO Stadium with LAFC, the current MLS cup holder.Portman's docuseries, meanwhile, details Angel City's first season in the NWSL - where they finished a respectable eighth place in the standings. 'I feel lucky that I had that kind of ignorance or optimism that, of course, this will all work out,' Portman said of her role with the team.",
        "'I believed in it so much. I believed in it because these players are the best players in the world, and it's the most popular sport in the world and I thought, 'there's no way that you don't provide greater accessibility, and this isn't the biggest hit.\"'It was incredible to get the support from all of those friends and it was, it was really moving when people came on board, because it wasn't obvious, and we got a lot of no's before we got yes'. 'And I feel like I didn't realize what a big lift it was, and that might have stopped me from doing it if I understood how hard it was going to be ",
        "Her series begins streaming on HBO from May 16. "
    ]
}