{
    "articleURL": "/sport/football/article-12042463/How-Real-Madrid-beat-Liverpool-Man-City-Jude-Bellingham.html",
    "content": [
        "Jude Bellingham was invited to Zinedine Zidane's Champions League final boxA fee for Dortmund's English teenager is thought to be around £115million Real Madrid are closing in on a sensational deal for the 19-year-old midfielder The fight to secure Jude Bellingham's services has seen the majority of Europe's elite drawn into a race that has seen the 19-year-old become one of the hottest properties in the game, with Real Madrid now set to emerge victorious. ",
        "Bellingham has shot to prominence after another sensational season with Borussia Dortmund, and has become one of his country's most important players, excelling on the world stage in Qatar. But now he finds himself in advanced talks with Real Madrid, as his current side look to end Bayern Munich's dominant hold on the Bundesliga title this season. Interest from England and the Premier League was strong, with Manchester City looking likely to rival any bid after Liverpool ruled themselves out of the running for financial reasons. Though talks between player and club have been progressing to advanced stages, an agreement between Dortmund and Los Blancos over a transfer fee is still yet to materialise.",
        "The fee required to bring Bellingham to LaLiga is estimated to be in the region of £115million, despite the fact that the teenager only has two years left on his current contract. Real chiefs are continuing discussions with their Dortmund counterparts over the final amount and bonuses but believe they are within reach of finalising terms. While Dortmund will of course receive a huge financial boost in any deal, they are not the only beneficiaries, with boyhood club Birmingham City set to earn a 15 per cent cut of any deal.  And then come the player's hefty wages, which are reported to be around £400,000-a-week despite his relative inexperience and youth, so highly is he valued. ",
        "However, Real Madrid have been working on a deal for a long time, and these talks have come after a lengthy courtship. Madrid's Director General Jose Angel Sanchez and chief scout Juni Calafat identified Bellingham as the club's top target at the start of the season and his performances at the World Cup only stiffened their resolve to sign him. A meeting in Chelsea harbour between the Bellinghams and Real's influential chief scout took place in early March, which is thought to have played a role in swaying the decision in the Spanish giants' favour. Reports at the time place the meeting as coinciding with Dortmund's trip to London to face Chelsea in the Champions League - a tie that ultimately saw the German side knocked out of the tournament. ",
        "Laurie Cunningham (1979-84)Real signed the winger from West Bromwich for £950,000 and he did the league and cup double in his first season.Steve McManaman (1999-2003)Won two league titles and two Champions Leagues during four years in Madrid after signing from Liverpool.David Beckham (2003-07)Signed for £25m from Manchester United and won La Liga title in his final season with the club.Michael Owen (2004-05)Joined for £8m from Liverpool, but was often overlooked for Ronaldo and Robinho and moved to Newcastle a year later.Jonathan Woodgate (2004-07)The £13m capture from Newcastle arrived injured, then scored an own goal and was sent off on his debut. Voted Madrid’s worst signing of the 21st century by fans.",
        "Club legend and two-time Champions League winning coach Zinedine Zidane invited the youngster to his own box for the final of last year's European competition in Paris to offer him a glimpse of the success he might enjoy in the Spanish capital alongside one of his childhood idols.The metaphor could surely not have materialised any better if Real had tried, as Bellingham was handed a perfect view to what he might come to expect in the iconic white shirt as Real beat transfer rivals Liverpool to lift the trophy.The player's family played a crucial role in his move to Dortmund three years ago, and have been a key component of discussions with other clubs.His father and agent, Mark, passed his FIFA agent's exam last week, allowing him to operate in that role for the foreseeable future. Several meetings have taken place along the way between the 19-year-old midfielder and Real Madrid, although he has also had a number of discussions with other clubs interested in securing the player's services. They are thought to have sent a representative to meet with Bellingham back in March in Dortmund, with the aim of selling the club to him, with talks leading to another delegation travelling to Germany last week.A move for Bellingham has long been considered a priority, with other extensions and deals thought to have taken a backseat while negotiations are held with the English star. ",
        "Veteran midfielder Luka Modric is out of contract this summer, with talks with the five-time Champions League winner halted until those with his potential replacement are finalised. Likewise, the club's summer business has been put to one side while negotiations continue.  ",
        "Sources in Madrid suggest Bellingham would be offered Modric's £18m basic gross salary in his first season – and, potentially, the Croatian's No 10 shirt. Whether or not the player would take it is a different matter, given his attachment to the No 22 he wore at Birmingham, and now bears in Germany.No England player has donned the iconic white shirt at Real Madrid since 2007, but Bellingham would be joining impressive ranks alongside the likes of David Beckham and Ballon d'Or winner Michael Owen. At the Bernabeu Bellingham would join one of the strongest midfields in world football, with the likes of Modric, Toni Kroos and Federico Valverde in the middle of teh park for the reigning European champions. But he would also join up with the other component parts of what would be a fearsome young three-man unit alongside Aurelien Tchouameni and Eduardo Camavinga, which will surely go on to dominate Europe for years to come.  "
    ]
}