{
    "articleURL": "/wires/ap/article-12041017/Teenage-boy-opens-fire-school-Serbia-capital.html",
    "content": [
        "BELGRADE, Serbia (AP) - A 13-year-old who opened fire Wednesday at his school in Serbia's capital drew sketches of classrooms and made a list of children he intended to target in a meticulously planned attack, police said. He killed eight fellow students and a guard before calling the police and being arrested.",
        "Mass shootings are extremely rare in the Balkan region, although Serbia is awash in guns left over from the wars of the 1990s. No mass shootings have been reported at Serbian schools in recent years.The shooter killed a school guard and then three students in a hallway of the Vladislav Ribnikar school in central Belgrade, according to senior police official Veselin Milic. He then entered a history classroom close to the school entrance and opened fire again, Milic said. Seven girls and one boy were killed, he said.The victims included a girl with French citizenship, French Foreign Ministry spokeswoman Anne-Claire Legendre said in a statement. She provided no other details.Ljiljana Radicevic told The Associated Press that her granddaughter was also killed in the shooting. Ana was near the school entrance when the assailant shot the school guard, \"and then he shot at my Ana,\" Radicevic said. \"As soon as she did not answer, I knew it was over.\" Radicevic did not provide Ana´s full name or age.Six children and a teacher were also hospitalized. Two children remained in serious condition after hourslong surgeries, doctors said later Wednesday.",
        "The assailant called police himself after the shooting was over. Authorities also received a call reporting the shooting two minutes earlier.",
        "\"The child who committed the crime said when he called the police that he shot some people in the school and that ... he is a psychopath who needs to calm down,\" Milic told state television station RTS. \"He said that after committing (the crime) he was caught by fear and panic and funny breathing, and that it was the right thing to call the police and report the event.\"The father of a student said the shooter entered his daughter´s classroom, then fired at her teacher and classmates as they ducked under their desks. Most students escaped through a back door, according to a local official.Milic said the shooter planned the attack for a month, sketching classrooms and writing out a list of children he planned to \"liquidate.\" Authorities said they did not know a motive for the shooting. It was unclear if he shot any of the students whom he named on his list.The rarity of such attacks added to the shock many felt. Commentators on television and officials repeatedly said it was the kind of thing they expected to read about elsewhere, particularly in the United States. In the last mass shooting, a Balkan war veteran in 2013 killed 13 people, including family members and neighbors, in a central Serbian village.",
        "Police identified the shooter as 13-year-old Kosta Kecmanovic, a student at the Vladislav Ribnikar school.He can´t face criminal charges because he is under 14, the Belgrade prosecutor´s office said. Social services will determine what happens to him.He carried two guns belonging to his father - at least one a handgun - and four Molotov cocktails, officials said. Interior Minister Bratislav Gasic said the weapons were licensed and kept in a safe but that the teen apparently knew the code. The father was also arrested but has yet to be charged.It´s not clear how many rounds were fired, but police said the shooter reloaded the handgun.Authorities declared three days of nationwide mourning starting Friday. People left flowers and lit candles at a outside the school.\"Today is one of the toughest days in Serbia´s modern history,\" said the populist President Aleksandar Vucic, who addressed the nation in a somber manner, crying occasionally. \"Unfortunately, Serbia is united in grief.\"Vucic said the shooter was taken to a psychiatric clinic and that the police also detained the teenager's mother. He didn't elaborate.He also listed a set of proposed measures to improve gun control; tighten media and internet restrictions for violent content; and conduct drug tests in schools.TV footage showed a commotion as police officers led the shooter with his head covered to a car. Police sealed off the streets around the school. Authorities later carried body bags to a waiting van.",
        "Police said they received a call about the shooting at around 8:40 a.m., as classes resumed after a long weekend for the May 1 holiday.\"I was able to hear the shooting. It was nonstop,\" said a student who was in a sports class when gunfire erupted. Her mother asked that her name be withheld because of her age. \"I didn´t know what was happening.\"She described the shooter as a \"quiet guy\" with good grades.Milan Milosevic, whose daughter was in the history class where some shooting took place, told N1 television that he rushed to the school when he heard what had happened. His daughter called him to say she had escaped the building and was unharmed.\"He (the shooter) fired first at the teacher and then the children who ducked under the desks,\" Milosevic said his daughter told him.Milan Nedeljkovic, the mayor of the Belgrade area of Vracar where the shooting happened, said most of the students were removed from the school through a back door.\"We have video surveillance, but now this is a lesson, we need metal detectors too,\" he said. \"It is a huge tragedy ... something like this (happening) in Belgrade.\"While such attacks are rare, experts have repeatedly warned of the danger posed by the number of weapons in a highly divided country, where convicted war criminals are glorified and violence against minority groups often goes unpunished.",
        "They also note that decades of instability stemming from the conflicts of the 1990s as well as ongoing economic hardship could trigger such outbursts.Luka Babic, a former student at Vladislav Ribnikar, bemoaned the culture of violence.\"We can´t put the blame on this school or its teachers. ... It's a tragedy of a society that promotes violence,\" Babic said. \"We live in the society of violence, and it has been promoted in media, in public spaces, on social media.\"Education Minister Branko Ruzic was quick to blame \"the cancerous, pernicious influence of the internet, video games, so-called Western values.\" Such criticism is common in Serbia, where pro-Russian and anti-Western sentiment have thrived in recent years.Ruzic said Belgrade schools, which canceled classes after the shooting, will reopen on Thursday. Authorities have not said when classes will resume at the Vladislav Ribnikar school.___Associated Press video journalist Ivana Bzganovic contributed to this report."
    ]
}