{
    "articleURL": "/news/article-12039481/Megyn-Kelly-takes-bite-MSNBC-host-Jen-Psaki-having-no-talent.html",
    "content": [
        "Former Fox News anchor Megyn Kelly has hit out at MSNBC host Jen Psaki and said she has 'no actual talent' in the broadcasting fieldPsaki was President Joe Biden's former press secretary before she left last year and started her own show on the left-leaning network in MarchBut Kelly slammed her during a broadcast of The Megyn Kelly Show on SiriusXM on Monday and said no one wants to watch her showFormer Fox News anchor Megyn Kelly has hit out at MSNBC host Jen Psaki and said she has 'no actual talent' in the broadcasting field. ",
        "Psaki was President Joe Biden's former press secretary before she left last year and started her own show, called Inside with Jen Psaki, on the left-leaning network in March. But Kelly slammed her during a broadcast of The Megyn Kelly Show on SiriusXM on Monday and said no one wants to watch her show. She claimed Psaki had an eye on being a cable news star while she working at the White House. Inside with Jen Psaki drew in roughly 1.1 million viewers when it debuted on March 19 but there was an audience of 765,000 for the April 23 show which was a two per cent drop from the previous week, according to USTVDB. ",
        "'We looked up just the trajectory to see maybe she's just started and she's building [her audience], you know, give her some time,' Kelly said. 'Literally, it's like a downward escalator … the overall and the demo off a cliff.'No one wants to watch Jen Psaki. I mean no one.' She said Psaki, like others who work at the White House press office, wanted to be a cable news star and laid the foundations to become a national personality.Kelly added: 'This is so true of all these people that work at the White House Press Office.",
        "'What they really want is to be a cable news star. And so they lay the foundation while they’re over there trying to make themselves into a national personality.'What they really want is the job of the people they watch on primetime every day.'They’re envious.'",
        "She said Psaki is ‘failing because she has no actual talent in this field'. And Kelly added: 'She had more talent being a professional spinner behind the lectern than she does being a different kind of professional spinner behind the MSNBC mic.'Psaki's show has drawn in larger viewing figures than her competitors on CNN on a consistent basis, despite Kelly's criticism. She beat her rivals at CNN in total viewers during April as well as those in 25-54 age demographic. Inside with Jen Psaki airs every Sunday at 12pm Eastern Time on MSNBC and its program description it reads: 'Jen Psaki breaks down the biggest issues of the week, featuring one-on-one interviews with newsmakers.' "
    ]
}