{
    "articleURL": "/wires/ap/article-12041877/Mother-3-children-fatally-shot-Florida-suspect-sought.html",
    "content": [
        "LAKE WALES, Fla. (AP) - After an hourslong standoff at a motel, police in central Florida fatally shot a man suspected of killing a mother and her three children, authorities said Wednesday.",
        "Al Joseph Stenson, 38, quickly became a suspect Tuesday night after police were called to an apartment complex in Lake Wales where they found the bodies of the 40-year-old woman and children, ages 21, 17, and 11. Their names haven't been released.Investigators say Stenson and the victims knew each other, but did not describe their relationship or release a motive in the family´s killing.After investigators tracked Stenson to the Slumberland Motel, he said \"he would kill himself or force law enforcement to kill him,\" Lakes Wales police said in a news release.Stenson's brother was also staying at the same motel in Sanford, which is about a two-hour drive from Lake Wales, and police there said they learned the suspect was in the room next door.Seminole County Sheriff Dennis Lemma said during a news conference at the motel that investigators convinced Stenson´s brother to come out of the room.Eventually, Stenson also came outside, Lemma said. Authorities convinced him to put down his handgun and step away from it.The SWAT team then shot him with a 40 mm foam projectile \"but it had little effect\" and Stenson \"immediately went for the gun on the ground,\" the sheriff said.Four officers shot him and he died at the scene, Lemma said.",
        "Investigators believe the victims were shot around 5 a.m. Tuesday. Police were called just before 9 p.m. when someone found their bodies in the apartment.Stenson was wanted on four counts of first-degree murder, Lake Wales Police Chief Chris Velasquez said.\"Our hearts are broken\" for the family, Velasquez said.The Florida slayings represent the 21st mass killing of the year, according to a database maintained by The Associated Press and USA Today in a partnership with Northeastern University. That is the most during the first four months of the year since data was first recorded in 2006.The number killed is a fraction of the total number of people who died by homicide for the year. The database counts killings involving four or more fatalities, not including the perpetrator, the same standard as the FBI, and tracks a number of variables for each.A mass shooting in Texas last week also sparked a manhunt, which ended Tuesday when authorities arrested a man suspected of fatally shooting five neighbors. The dead included a 9-year-old boy.Authorities say Francisco Oropeza, 38, had been firing rounds on his property and the neighbors asked him to go farther away because the noise was keeping a baby awake."
    ]
}