{
    "articleURL": "/wires/pa/article-12052683/Local-election-abandoned-death-Tory-candidate-count.html",
    "content": [
        "A local election in Derbyshire has been abandoned after one of the candidates died while counting was under way.",
        "Gillian Lemmon, an incumbent Conservative councillor running for the Hilton ward in South Derbyshire, died on Friday.She was taken ill a few days ago and her condition “suddenly deteriorated”, her Tory co-candidate Sundip Meghani said. Gillian was such a decent, down-to-earth person, and she enjoyed working hard for the people of Hilton  Sundip Meghani, Conservative candidate for Hilton  Mr Meghani was at the count when his co-candidate died at around 12.45pm.“We all gathered outside to be given the news, I think it was around 2ish,” he told the PA news agency.“So many difficult emotions to contend with. On the one hand, obviously the party politics side of things, and then on the other hand of course, something which is far more important, which is the sad demise of our dear friend and the circumstances in which her husband has been left and the family.",
        "“So just a horrific day and so tragic.”Because Ms Lemmon died before the declaration had been made, the district council’s returning officer decided to abandon the count.A by-election will take place later this summer for all three seats in the Hilton ward.The candidates were Ms Lemmon, Mr Meghani and South Derbyshire Conservatives’ group leader Peter Smith.Mr Meghani described Ms Lemmon as “a decent, down-to-earth person, and she enjoyed working hard for the people of Hilton”.",
        "Ms Lemmon moved to South Derbyshire in 2007 with her husband Colin, according to her profile on the local Conservatives’ website.She set up her own financial consultancy and was a member of the UK Royal Volunteer Service.On Thursday, a local election vote in Southampton, Hampshire, was suspended due to the death of Conservative candidate for the Coxford ward, Graham Galton, after the polls opened."
    ]
}