{
    "articleURL": "/news/article-12055119/A-right-Royal-snub-Sydney-worlds-media-reported-Coronation-King-Charles-III.html",
    "content": [
        "Australia said that it would not be lighting up the sails of Sydney Opera HouseOther public buildings were, however, illuminated in royal purpleRepublican France was captivated by the Coronation of Charles III – but Australia’s approach proved more ambivalent.",
        "As in other countries around the world, all major news channels and newspapers across the Channel wiped out their usual schedules to cover the King’s ascension.According to Le Monde newspaper, there was a ‘cascade’ of congratulations for King Charles from Brussels to Washington following ‘a Christian ceremony full of pomp and solemnity’. Le Parisien, the French capital’s leading tabloid, carried the headline: ‘Let the Party Begin!’But Britain’s former colony on the other side of the world said that it would not be lighting up the sails of the Sydney Opera House – as it did last year to mark the death of Queen Elizabeth – on the grounds of cost.‘The New South Wales Government believe it has struck the right balance in terms of meeting community expectations on commemorating the occasion while being mindful of public expense,’ a state government spokesman said.",
        "Other public buildings, including Parliament House in Canberra, were, however, illuminated in royal purple.On the whole, Coronation coverage abroad has been both warm and extensive. As international broadcasters beamed pictures of the pageantry into televisions, most leading news outlets served up live web updates to a global audience hungry for Royal detail.In Germany, the tabloid Bild proclaimed ‘Finally King at 74. This is the crowning glory’, before describing the double Coronation for Charles and Camilla as a ‘sweetheart moment’.",
        "In the United States, the New York Post led its website with a ‘God Save King’ banner, while news channel CNN provided intensive coverage, as did Fox News. The Washington Post offered its readers, ‘memorable moments in photos and videos’, plus an account how the Royal grandchildren had charmed audiences ‘with yawns, waves’.It was left to the New York Times – well-known for bashing Britain – to try to put a damper on things, summing up the Coronation as a ‘cringing discomfort’ and claiming that the whole thing had ‘arrived with little fanfare’."
    ]
}