{
    "articleURL": "/news/article-12053261/Joe-Biden-says-coronation-lot-going-on.html",
    "content": [
        "In his first interview since February, President Joe Biden said he could not attend King Charles III's coronation because he has a 'lot going on'Biden, 80, said that he is a good friend of the former prince and the pair will meet over the summerThe president dispatched his wife, Jill, to attend the ceremony in his place President Joe Biden brushed his decision not to attend King Charles III's coronation on Saturday during a softball interview with MSNBC's Stephanie Ruhle by saying: 'I told him I couldn't be there because I have this going on.'",
        "Biden, 80, said that he told the king that he would be in the United Kingdom during the summer during the NATO conference. 'He's a good acquaintance and we've worked together on environmental issues,' the president said of King Charles III. The president dispatched his wife to represent the US at the celebrations in London. No American president has ever attended a British coronation. First Lady Jill Biden's first stop was a meeting with Akshata Murty, the wife of Prime Minister Rishi Sunak.During the MSNBC interview, his first since February's sit down with PBS Newshour, Biden was asked why voters should choose the octogenarian. 'I have acquired a hell of a lot of wisdom. And know more than the vast majority of people – I'm more experienced than anybody who has ever run for the office. And I think I've proven myself to be honorable as well as also effective,' he bragged. ",
        "Biden's likely opponent in 2024, ex-President Donald Trump, earlier expressed his disgust that the president was not making the trip across the pond. 'Certainly, he should be here as our representative of our country. I was very surprised, I think it's very disrespectful for him not to be here,' the former Apprentice host told GB News. Trump went on to accuse Biden of not being physically well enough to make the journey to the UK. 'He's got a lot of things going, a lot of strange things happened,' the twice impeached president added.",
        "Biden visited Northern Ireland and Ireland last month to commemorate the 25th anniversary of the Good Friday peace pact.The coronation ceremony takes place on Saturday at Westminster Abbey and will be attended by foreign heads of state and dignitaries.The first lady, 71, also visited a local school along with Murty on Friday afternoon, after which she was scheduled to meet staff at the U.S. embassy and King Charles at a reception in Buckingham Palace. 'Have fun tomorrow, I'll be thinking about all of you,' she told children at the school, where students greeted her wearing golden paper crowns and shared a tea-party lunch. During the last coronation of a British monarch, when Charles' late mother Queen Elizabeth was crowned in 1953, then U.S. President Dwight Eisenhower sent a delegation of envoys to represent him.The White House said last month Biden had told Charles he wanted to meet him in Britain at a future date.The president and Charles are hardly strangers. They have chatted each other up at global climate events since Biden took office, and during the queen’s funeral last year. They also spoke in April when Biden called to say he was sending the first lady to the coronation, and the president expressed interest in meeting with the king in the United Kingdom at a future date, the White House said at the time. ",
        "Biden was the 13th and final US leader to meet the queen. They saw each other when he visited England in 2021 with his wife to participate in a Group of Seven world leader summit. At the time, the queen also invited the Bidens to have tea with her at Windsor Castle. ",
        "Meanwhile during his MSNBC interview, Biden defended his scandal-hit son Hunter, 53, amid investigations for alleged tax violations and lying on a gun permit, insisting: 'My son has done nothing wrong.''I trust him, I have faith in him,' he said.'And it impacts my presidency by making me feel proud of him.'Hunter Biden met with U.S. Attorney for Delaware David Weiss at Justice Department headquarters in Washington D.C. last week, in a sign that the federal investigation of him on tax matters and a gun charge are reaching a conclusion.Weiss and his federal prosecutors are weighing four charges against Hunter - three related to tax crimes, and the fourth a felony charge related to a gun purchase, according to the Washington Post.Meanwhile, Congressional Republicans are stepping up their probes of Hunter Biden's finances and what some of them call the 'Biden crime family.'This week, Senator Chuck Grassley of Iowa, 89, and House Oversight Committee Chairman James Comer said they had heard from a whistleblower.",
        "They described being told about a bribery scheme from when Biden was serving as vice president.'We believe the FBI possesses an unclassified internal document that includes very serious and detailed allegations implicating the current President of the United States,' said Grassley.Grassley later said in an interview that he did not know whether the whistleblower's claims were true.He told Newsmax: 'It is a very serious allegation. I wish I could say that I knew it was true or untrue.'"
    ]
}