{
    "articleURL": "/wires/reuters/article-12038641/Tony-Finau-Elevated-events-pretty-dang-cool-game.html",
    "content": [
        "Consider Tony Finau thankful to work through the nuances of altering his tournament lineup to fit the PGA Tour's evolving schedule.",
        "The way Finau sees it, the product is improving the experience for the fans. And, yes, the 33-year-old is certainly reaping the benefits as well.When LIV Golf debuted last year, Finau's name was rarely associated with rumors of players bolting for the rival league. He stayed loyal to the PGA Tour despite having the reputation of an uber-talented golfer who had too often faltered on Sundays throughout his career.Flash forward, and Finau is coming off his second win of the season on Sunday and fourth in his past 19 worldwide starts. He also survived a Sunday push from world No. 1 Jon Rahm.It was the latest in a string of marquee Sunday battles on the PGA Tour this season, with Rahm and Finau the two highest-ranked players at the Mexico Open. Finau pointed to the burgeoning rivalries, many contested in the new elevated events, as the primary reason he is a fan of the new scheduling format.This week's Wells Fargo Championship is also the ninth of 17 \"designated events\" in 2023. With a $20 million purse at stake, the events have been drawing deep fields.\"I think if you look at the leaderboards, you look at the rivalries that it's already created and the pressure-packed moments, I think it's been pretty dang cool for our game,\" Finau said Tuesday. \"I think our last one we had (Jordan) Spieth and (Matt) Fitzpatrick in a playoff. We've had Rahmbo and (Max) Homa, we've had Rahmbo and (Scottie) Scheffler. Rahmbo and (Collin) Morikawa, right?",
        "\"You've had these heavyweights go at it in our game more often, which I think is good for our game.\"I think we have to move toward how the game is going to be more presentable on TV, how it's going to be more accessible, more watchable. I believe that the best way to do it is have the best players play against each other more often and that's what we're seeing.\"While all of the change has fractured the professional landscape, it has certainly worked out well for Finau. The soft-spoken Salt Lake City native has risen to No. 11 in the Official World Golf Rankings and has already topped $5 million in earnings through 13 events this season.Finau was featured in the Netflix docuseries \"Full Swing,\" where he balanced the burden of trying to elevate his game while also traveling with his family on tour for the 2021-22 season.The 2022-23 season has brought further change with the elevated events. This week will already be Finau's 12th tournament of 2023, and the PGA Championship is just two weeks away.This is a transition year of sorts, with the PGA Tour returning to a calendar year-based schedule in 2024. There will be more elevated events and more changes to Finau's schedule, but he's willing to adapt to help improve the end product.",
        "\"It has thrown my schedule a little bit for a loop,\" Finau acknowledged. \"It will do the same next year, but I think these are the sacrifices that I'm willing to make as a player to play these events as elevated events.\"Overall, everybody has to sacrifice a little bit I think as far as their schedule is concerned. Next year we're going to see more of that, and it's just cool to be a part of it.\"--Field Level Media"
    ]
}