{
    "articleURL": "/money/markets/article-12041353/RS-Groups-finance-boss-quits-following-personal-relationship-worker.html",
    "content": [
        "David Egan has stood down as RS Group's CFO after seven years in his roleJane Titchener has been appointed interim finance director of the companyRS Group's chief financial officer has resigned after he engaged in a personal relationship with another employee.",
        "David Egan, who had been finance boss of the blue-chip industrial products supplier for seven years, admitted to 'some shortcomings of judgment' in his behaviour as he announced his departure from the firm with immediate effect.Jane Titchener, the company's vice-president of corporate development, has been appointed interim finance director of RS Group until a permanent replacement is found.",
        "The London-based group did not detail the extent of the relationship, but its chair, Baroness Rona Fairhead, said Egan 'recognises the importance of leaders setting and abiding by exemplary standards'.Australian-born Egan had only just finished serving a six-month spell as acting chief executive following the departure last November of Lindsley Ruth for 'personal reasons'.Annual turnover at RS Group has doubled during Egan's tenure thanks to significant expansion across all regions, market share gains, and the acquisition of smaller rivals such as John Liscombe and Needlers.For the financial year ending March 2022, the company reported that revenue grew by over a quarter to £2.55billion due to solid online trade and demand for industrial products.Trading remained strong throughout the subsequent nine months but has slowed since the start of 2023 amid a broader cost-of-living crisis and declining sales in the Americas and Asia-Pacific regions.Before joining the firm, formerly known as Electrocomponents, Egan was the senior finance official at chemicals producer Alent and Swedish-American welding equipment manufacturer ESAB.",
        "He also held posts at building materials distributor Hanson and its parent company HeidelbergCement, which bought the former in 2007 for £8billion.Egan said: 'Following a detailed review by the board, I recognise that there have been some shortcomings of judgment on my part, and my actions have fallen short of the high standards expected of RS leadership.'Therefore, it is right for me to step down from my role. I would like to thank all the people at RS for their support and commitment during my tenure.'The business is in a position of strength, I am confident in the Group's prospects, and I wish Simon and the rest of the RS team continued success in the future.'RS Group was founded just prior to the Second World War as Radiospares, supplying parts to radio repair shops. During the 1950s, it began selling parts for televisions as the medium quickly gained popularity. Over the coming decades, it transitioned into being a distributor of other firms' electrical and industrial goods, launched into multiple new markets and completed numerous acquisitions.The company now stocks approximately 700,000 products and sells to more than 1.2 million customers per year across 80 countries.RS Group shares closed 2.8 per cent down at 887.4p on Wednesday, although they have still expanded by about 60 per cent in the past three years.",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}