{
    "articleURL": "/wires/reuters/article-12046331/UK-businesses-raise-prices-pass-higher-wage-costs-PMI.html",
    "content": [
        "By Suban Abdulla",
        "LONDON, May 4 (Reuters) - Britain's services sector kicked off the second quarter with its fastest growth in a year, boosted by new orders, but it passed the cost of rising wage bills on to consumers, adding pressure on the Bank of England to keep raising interest rates.The final S&amp;amp;P Global/CIPS UK Services Purchasing Managers' Index (PMI) rose to 55.9 from 52.9 in March, above the 50 threshold for growth and higher than a provisional reading of 54.9.The reading added to a series of improved measures of the economy, which had appeared to be heading for a recession in early 2023. Official mortgage and consumer lending data also surprised to the upside on Thursday.\"A strong rate of service sector growth meant that the UK economy started the second quarter of 2023 in positive fashion,\" Tim Moore, economics director at S&amp;amp;P Global Market Intelligence said.However, prices charged by businesses picked up pace after rising by the smallest amount in 22 months in March, and are still increasing noticeably faster than before the COVID-19 pandemic as firms rebuild profit margins.A BoE survey of companies on Thursday showed expectations for selling prices refused to budge lower in April, although their predictions for wage growth and inflation in the coming year cooled.",
        "The BoE, which is expected to lift its Bank Rate to 4.5% next week, is closely monitoring wage-setting and businesses' profit margins as it attempts to return double-digit inflation to its 2% target.\"The combination of a stronger demand outlook and sticky core inflation are likely to meet the (BoE's) criteria for a rate hike, despite easing in energy prices, input costs, and supply chains,\" said Andrew Goodwin, chief UK economist at consultancy Oxford Economics.Nearly half of the PMI respondents reported a rise in costs, mostly due to strong wage growth and high energy bills.Official data showed average private sector wages in the three months to February were 6.1% higher than a year earlier, while consumer price inflation in March was 10.1%.S&amp;amp;P Global said new services orders grew at the strongest pace since March 2022, just after Russia's invasion of Ukraine, helped by improving domestic demand and overseas sales as well as more foreign tourists.Euro zone services PMI data for April was also robust.Employment rose for the fourth month in a row in the British PMI and improved staff availability helped firms fill vacancies. Business optimism for the year ahead was the strongest in 13 months, with 52% of firms expecting activity to grow.The composite PMI, which combines the services survey with Tuesday's subdued manufacturing PMI, increased to 54.9, up from 52.2 in March. (Additional reporting by Andy Bruce; editing by John Stonestreet and Christina Fincher)"
    ]
}