{
    "articleURL": "/tvshowbiz/article-12040479/Tiffiny-Hall-flaunts-post-baby-weight-loss-photos.html",
    "content": [
        "Tiffiny Hall stunned fans on Wednesday when she shared some before and after photos to highlight her extraordinary post-baby weight loss one year after welcoming her second child. ",
        "The celebrity trainer, 38, looked fit as a fiddle in the 'after' selfie, which showed her posing up a storm in a nude bra and blue pants.Tiff is seen pulling her pants out by the seam to showcase how loose they now are against her trim stomach and muscular frame.The former Biggest Loser star couldn't wipe the smile off her face in the incredible photos.She also posted a before photo taken six months ago of her wearing the same pants - which fit more tightly on her - to showcase how much weight she has lost this year.",
        "The blonde beauty told her fans that weight loss progress shouldn't strictly be measured by how many kilograms they shed and that her own personal results were an 'awesome non-scale victory for me'. Back in August, Tiffiny said she was not putting pressure on herself to bounce back into shape after giving birth to her second child. The 38-year-old welcomed daughter Vada with husband Ed Kavalee in June.Appearing on Sunrise, the fitness expert admitted that she had previously 'broken down' over her postpartum body, but has now accepted she's 'not a gladiator'. 'I used to be gladiator and used to be so fit, so being in a body that's 20 kilos heavier and is unfit is hard at the moment,' she said at the time. ",
        "'It's hard to accept, but that's why I'm rejecting bounce back culture and leading this movement of bouncing forward, which is all accepting where you're at, going slowly and safely in a sustainable way and respecting that fourth trimester of recovery.'",
        "She added that it takes the body a year to recovery after pregnancy and that woman need to be 'kind to themselves' after giving birth. Tiffiny has regularly shared her post-partum journey on Instagram and in June revealed she was struggling to look at herself.'It's not easy. I stand in front of my mirror, looking at my new body with my big bump, Vada's house, and it's really hard to accept that it's going to take time,' she said.The star admitted she was feeling 'super emotional' and accepts that 'healing takes time'."
    ]
}