{
    "articleURL": "/wires/reuters/article-12061005/Palantir-jumps-forecast-turn-profit-quarter-2023.html",
    "content": [
        "By Chavi Mehta",
        "May 8 (Reuters) - Palantir Technologies said on Monday it expects to turn a profit every quarter in 2023, betting on interest \"unlike anything we have seen\" in its new artificial intelligence platform, sending its shares up about 20% in extended trading.The new generative AI platform was launched two weeks ago and works on the same technology that's behind ChatGPT.The data analytics software maker, known for its work with the U.S. Central Intelligence Agency, also beat first-quarter revenue and profit expectations on bigger projects from existing commercial and government clients.\"Investors will be pleased not only with the better-than-expected results for the quarter, but also the guidance for profitability as well as the recent AI initiatives,\" said D.A. Davidson &amp;amp; Co analyst Gil Luria.The first iteration of the AI platform will be made available to some customers this month, Palantir CEO Alexander Karp said, adding the new offering can assist militaries in targeting enemies.The customers include \"one of the largest insurance companies in the world\" and supply chain and security customers, Chief Revenue Officer Ryan Taylor told Reuters.Palantir's first-quarter revenue rose 18% to $525.2 million and adjusted profit stood at 5 cents per share, both above estimates.The strong first quarter was driven by a 26% rise in commercial revenue, rising more than expected, said RBC Capital Markets analyst Rishi Jaluria.",
        "Palantir continues to tighten its cloud spending and is investing in focus areas like AI, said finance chief David Glazer. In February, it said it would cut 2% of its workforce.It remains bullish on demand for its offerings in the United States, but faced challenges in \"certain areas\" internationally, Taylor said, without elaborating.The company forecast second-quarter revenue of $528 million and $532 million, below estimates of $536.2 million, per Refinitiv data. Its full-year revenue forecast, however, was largely in line with estimates. (Reporting by Chavi Mehta in Bengaluru; Editing by Shinjini Ganguli)"
    ]
}