{
    "articleURL": "/tvshowbiz/article-12038897/Steven-Tyler-argues-sexual-assault-accuser-use-memoir-detailing-relationship-lawsuit.html",
    "content": [
        "Tyler's legal team claim the alleged distress Misley experienced in 2011 was not due to his memoirHe is accused of sexual assault and battery as well as intentional infliction of emotional distress in the suit He has denied all claims and asked for the lawsuit to be dropped Aerosmith's Steven Tyler has argued a woman who accused him of sexually assaulting her when she was a minor should not be allowed to use his memoirs recounting their relationship  in a lawsuit against him - reports TMZ.",
        "Tyler, 75, in December was named in a lawsuit from a woman who has publicly identified herself as Julia Misley, who claims he sexually abused her when she was 16 and he was 25 in the 1970s. In the legal filing, Misley accused the Dream On singer of sexual assault and battery, as well as intentional infliction of emotional distress, linked back to when she was a teenager. Misley has claimed she became pregnant by Tyler in 1975 aged 17 and he forced her to have an abortion.Tyler has denied all claims of sexual assault and said his relationship with Misley (who was once known as Julia Holcomb) was consensual.In legal documents obtained by TMZ, Tyler's legal team acting on behalf of the star claim the alleged distress Misley experienced in 2011 was not due to his memoir - Does the Noise in My Head Bother You? - being published, in which he used a pseudonym to detail their sexual relationship.",
        "Tyler claims her distress was sparked by a Star Magazine article published months before his memoir release - and that he 'purposefully' did not name her in his memoir when discussing their relationship.Tyler also states Misley has no problem using their relationship to 'promote herself in the media.'The documents also state  Misley waited 11 years to sue Tyler after the memoir's release - and say Misley is 'barred from suing Tyler for intentional infliction of emotional distress because of a 2-year statute of limitations on such claims.'",
        "The legal documents also state Tyler's memoir is designed to share his own experiences from his own 'newsworthy life' and that Misley's intentional infliction of emotional distress claim is thus barred by the First Amendment.DailyMail.com has contacted Tyler's representatives for comment. Tyler was originally accused of sexually abusing Holcomb in a December 2022 lawsuit. ",
        "Holcomb filed the lawsuit in Los Angeles in the final days of a California law that temporarily lifts the statute of limitations for such claims under a 'look-back' window.The suit, first reported by Rolling Stone, did not name Tyler, identifying him as 'Defendant Doe,' but it quoted directly from Tyler's 2011 memoir describing the relationship. Holcomb has previously spoken publicly about her alleged relationship with the rock star.Holcomb in the lawsuit accused the music legend of sexual assault, sexual battery and intentional infliction of emotional distress, alleging that he plied her with drugs after gaining guardianship from her mother and pressured her into an abortion.Though it did not name Holcomb, Tyler's memoir described his roughly three-year sexual relationship with a teen girl in the 1970s. Tyler wrote in the book he 'almost took a teen bride' and that 'her parents fell in love with me, signed a paper over for me to have custody, so I wouldn't get arrested if I took her out of state.' ",
        "'With my bad self being twenty-six and she barely old enough to drive and sexy as hell, I just fell madly in love with her,' he wrote. 'She was a cute skinny little tomboy dressed up as Little Bo Peep. She was my heart's desire, my partner in crimes of passion.' ",
        "Holcomb's lawsuit alleges that she met him in 1973 shortly after her 16th birthday, when she attended an Aerosmith concert in Portland, Oregon and returned to Tyler's hotel room after the show.The suit claims that after discussing Holcomb's age, Tyler 'performed various acts of criminal sexual conduct upon' her. According to the lawsuit, the relationship progressed and Holcomb 'was powerless to resist' Tyler's 'power, fame and substantial financial ability.'In 1974, Tyler convinced Holcomb's mother to grant him guardianship over her so they could travel across state lines, the suit alleges, echoing Tyler's memoir.Although Tyler had promised to take care of the teen and pay for her education and healthcare, he 'instead continued to travel with, assault and provide alcohol and drugs to Plaintiff,' the suit claims. The following year, Holcomb says she became pregnant with Tyler's son when she was 17, but that he pressured her into an abortion after an apartment fire, claiming the baby might have been injured by smoke inhalation.",
        "Tyler mentions the fire in his memoir, but not the abortion. However, an Aerosmith autobiography from 1997 references a relationship with a teen girl, the apartment fire and an abortionTyler told the court that he was Misley's legal guardian at the time, giving him immunity from related laws, past and present.",
        "The Massachusetts native requested the court dismiss the case in full.Attorneys for Misley said that the rock singer was 'gaslighting' their client and the court with his defense.Misley 'has not suffered any injury or damage as a result of any action by Defendant,' Tyler's attorneys said, 'and if it is determined that Plaintiff has been damaged, then any such damages were not caused by Defendant.'Misley said that following the abortion, she moved back home, wed and embraced religion.Her lawyer Jeff Anderson said that Tyler's responses were instances of 'gaslighting' and that in the 1970s, he used 'a sham legal guardianship to avoid prosecution for sex crimes.'Said Anderson: 'He's heaping more pain on Misley and gaslighting her by falsely claiming that she \"consented\" and that the pain he inflicted was \"justified and in good faith.\"'Never have we encountered a legal defense as obnoxious and potentially dangerous as the one that Tyler and his lawyers launched this week: Their claim that legal guardianship is consent and permission for sexual abuse.'"
    ]
}