{
    "articleURL": "/tvshowbiz/article-12041669/Paul-OGrady-fans-left-tears-posthumous-Love-Dogs-series-continues.html",
    "content": [
        "Paul O'Grady fans were left 'in tears' as a posthumous episode of For The Love Of Dogs was aired on Tuesday evening.",
        "The beloved comedian died aged 67 'unexpectedly but peacefully' on March 28, with his death announced by his husband Andre Portasio, 42.Following his passing, ITV announced the much-loved programme would still return for its eleventh series, which features six episodes.When the third installment was shown, viewers flocked to Twitter, writing: 'Very sad to see Paul O Grady no longer with us. He had a heart of gold #pogdogs.'Another wrote: 'This has been the hardest series to watch so far. I miss you Paul! #pogdogs just seeing him with Murphy.. is why we loved Paul much!'",
        "Someone else added: '#pogdogs Paul O’Grady - what a beautiful soul. Almost in tears watching this lovely man after his passing. He’ll be sorely missed by us and man’s best friend ❤️.'The TV personality filmed the last season late last year and it premiered on April 13.In the first episode, Paul is seen caring for an adorable Newfoundland pooch Peggy who needs life changing surgery on her back legs.Paul works with a team of experts to nurse Peggy through eight weeks of physio, hydrotherapy and walks using a harness ahead of her rehoming.Paul is left devastated at having to say goodbye to Peggy once she's healed, emotionally telling her that he doesn't have the room to adopt her.",
        "The comedian had already given a home to Chihuahua-Jack Russell cross Eddie, Shih Tzu Boycie, Maltese Conchita, mongrels Arfur and Nancy, and a dachshund called Sausage, from Battersea Dogs &amp; Cats Home, where the series is filmed.But Paul was desperate to take Peggy home too after she had a three-and-a-half hour operation at the Royal Veterinary College to repair her back legs.According to The Mirror, Paul told Peggy: 'Oh dear, I wish I was ready for you, Peggy, but I am afraid I can't do it this time, there is just no room at the inn.",
        "'Peggy, it's been a real privilege meeting you, it's not every day you get to meet a special dog like you. You are very beautiful. It's been lovely knowing you, take it easy, Peggy.'As Paul left her, Peggy started to whine, with the star telling her: 'Don't start, Peggy please. I'm going to get a job on the railways. It's too hard to say goodbye.'Elsewhere in the episode, Paul helps a timid Bichon Frisé who has been left terrified by humans after being dumped in the forest.He also meets an excitable Labrastaff who has an obsession with water, with Paul all too happy to get the hose out and keep him entertained.",
        "For The Love of Dogs was filmed at the Battersea Dogs and Cats Home, a place that was close to the late comedian's heart. The final series will be made up of six 30-minute episodes.",
        "However, one of Battersea Dogs and Cats Home's staff members has revealed that many of Paul's scenes 'won't see the light of the day.'Speaking on Thursday's episode of Lorraine, he explained: 'Anyone who knows Paul would acknowledge that probably half of what we filmed was unbroadcastable and will probably never see the light of day.'Recalling one memory, he said: 'This morning I remembered [when we were filming with a bulldog].'I think we were doing a wound check. He'd taken a shine to Paul and over the next ten minutes literally pulled Paul from one side of the kennel to the other and back again.'At the end of the ten minutes, [Paul] was covered in fur and drool, and we realised we'd been filming the wrong dog. Lots of little memories like that.'Paul O'Grady: For the Love of Dogs airs Thursday evenings on ITV1."
    ]
}