{
    "articleURL": "/wires/ap/article-12052967/Mexican-chef-promoter-local-ingredients-celebrated.html",
    "content": [
        "MEXICO CITY (AP) - Years ago, chef Elena Reygadas of the restaurant Rosetta wondered why Mexican cuisine was not more popular internationally and concluded it was due to the ingredients. Now a proud defender of those same ingredients, she has been recognized as the World´s Best Female Chef 2023.",
        "Mexican cuisine was added to UNESCO´s list of Intangible Cultural Heritage of Humanity in 2010 and its popularity has only continued to rise.\"I´m thrilled, I feel like it had taken long enough,\" Reygadas said about the acceptance of her country´s cuisine.Speaking recently inside the mansion that Rosetta inhabits in the capital´s Roma neighborhood, Reygadas said: \"It is so delicious, so vast, I think it´s really lovely ... it makes me really happy that you go to other restaurants around the world and they give you tacos and moles, and their versions.\"The award was announced last month by the list \"The World´s 50 Best Restaurants,\" compiled by the British company William Reed. Rosetta, one of several restaurants opened by Reygadas in the capital, focuses on using seasonal, local ingredients.Reygadas' culinary journey started with her family. \"Honestly, my grandmother was very happy in the kitchen. She put all of her love into it. It was her space, her place,\" she said.",
        "Reygadas studied some philosophy and later English literature at Mexico´s National Autonomous University, but also took cooking classes at the same time.\"I always like to eay I always liked to cook, but I didn´t see it as a profession,\" she said. \"Later, during summers I went to restaurants to learn, but always with the intention of cooking delicious (food).\"",
        "After finishing her thesis on Virginia Woolf, Reygadas thought about devoting herself to art, but on the verge of starting her professional life she felt like something wasn´t quite right. She told her parents her plan to change professions and fortunately they supported her.Days after her final exam she travelled to New York for an eight-month intensive couse at the French Culinary Institute.Later, Reygadas went to London and worked for four years, including with Italian chef Giorgio Locatelli at his Michelin star restaurant, Locanda Locatelli.\"I feel like I trained a lot working. School can give you the foundation, but cooking is something practical,\" she said.She returned to Mexico when she had her first daughter, who she wanted to raise around family and friends and to learn Mexican culture. Her second daughter was born a short time later.\"When I opened Rosetta in 2010, my oldest daughter was 2 years old and the youngest was 6 months. It was a triple birth,\" Reygadas said. \"I felt like they gave me strength, they gave me a lot of order, forcing me to be organized. It was intense. I think being a mother and a chef is my greatest challenge, balancing those two sides. But at the same time I feel that thanks to that I have a lot of discipline.\"",
        "Despite cooking still being largely the domestic domain of women, professional kitchens have historically been male dominated. Reygadas is convinced that can change.\"In the most professional kitchens I am seeing more women all of the time,\" she said. \"But I do believe that many times it gets more complicated when women become mothers ... (H)aving a job, a profession where the schedule doesn´t necessarily line up with schedules for daycare or school is a really complicated challenge, but we hope it will become less so.\"Recognizing that reality and her own experience led her to found the Elena Reygadas Scholarship for female culinary students from rural Mexico. Last year, they started with three and this year with the support of a bank, they plan to expand it to more than two dozen scholarships.\"A career in gastronomy means extra expenses for ingredients, materials, and almost all of the cooking schools are in cities,\" she said. \"I also realized that in the most remote areas families can´t send all of their children to school, and normally they send the men.\"\"I thought of this scholarship really as my grain of sand,\" Reygadas said."
    ]
}