{
    "articleURL": "/sport/formulaone/article-12053727/Lewis-Hamilton-pleads-Formula-One-bosses-make-racing-exciting-fans.html",
    "content": [
        "Lewis Hamilton wants there to be more competitiveness in Formula OneThe Mercedes driver understands frustration from fans who think it is boringRed Bull have dominated the early season by winning every race so far Lewis Hamilton has called on Formula One to give fans 'more excitement' following Red Bulls one-sided domination to the start of the new season.",
        "Max Verstappen and Sergio Perez have shared Grand Prix wins from the four opening events, with the reigning world champion establishing a six point lead over his team-mate.Meanwhile, Hamilton's Mercedes have struggled to comeback from a season of difficulties with similar car problems hampering their efforts to regain their status as the sport's leading force.The 38-year-old is hoping for a more enthralling Miami GP on Sunday following a previously mundane Azerbaijan race last time out that saw Verstappen's off-track clash with George Russell the biggest highlight of the weekend.Speaking in America prior to Sunday's race, Hamilton said: 'It's definitely not boring from my perspective but, as a racing fan, I can understand [the boredom factor] because there's not as much competition as they're used to.",
        "'We need to do better as a sport. They have already tried to bring the teams closer, but it never seems to work. 'All I can say is that we're working as hard as we can to close up and get back to that… and give them some more excitement,' he added.Verstappen's quest to secure a third consecutive world championship title looks set to only be rivalled by his team-mate Perez, with the duo emerging as clear leaders in the standings.Red Bull have also taken a stranglehold of the constructors championship, with four wins placing them on 180 points. ",
        "Aston Martin trail in second on 87 points, while Mercedes sit third with just 76 points from the four opening race weekends.",
        "Hamilton believes that the gap between competing teams is 'unfortunate' and stressed that regulations need to be adapted to increase competitiveness on the grid. 'It's a really negative way to look at it. It's good we're trying to keep doing things to move forward and evolve.'I think the technology has evolved. It is just unfortunate that we still see the same sort of gaps between teams.'I don't know what the solution is for the future, but we're going to have to adapt these regulations moving forward, otherwise it could be the same as it is now for years until 2026 if we don't do a better job, which we're working on doing.'"
    ]
}