{
    "articleURL": "/wires/reuters/article-12042767/World-Bank-board-poised-elect-US-nominee-Ajay-Banga-president.html",
    "content": [
        "By Andrea Shalal and David Lawder",
        "WASHINGTON, May 3 (Reuters) - The World Bank's 25-member executive board on Wednesday is poised to elect ex-Mastercard CEO Ajay Banga as the bank's next president, ushering in an Indian-born finance and development expert charged with revamping the lender to tackle climate change and other global crises.Banga, 63, was nominated for the post by U.S. President Joe Biden in late February and was the sole contender to replace departing World Bank chief David Malpass, an economist and former U.S. Treasury official during the Trump administration.Sources familiar with the process said they expect Banga to win the board's approval handily after several meetings with board members in recent weeks and a formal interview on Monday.Banga is expected to start the new job in early June.One of the sources said Banga had impressed World Bank shareholders in recent weeks as a \"true change maker\" who will help accelerate reforms at the global development bank. It already loans out hundreds of billions of dollars to developing countries but is working to increase its lending to help them address global challenges such as climate change.U.S. Treasury Secretary Janet Yellen told Reuters last month that attracting more private capital for development goals would be a key area of focus for Banga if he is approved.",
        "The announcement of Banga´s candidacy was timed to coincide with Yellen´s participation in a meeting of Group of 20 finance officials in Bengalaru, India, a source familiar with the process said.Once it became public, she and her top traveling aides immediately began selling their counterparts on Banga´s candidacy, the source said.The World Bank has been led by an American since its founding at the end of World War Two, while the International Monetary Fund has been led by a European. Banga, who was born in India and spent his early career there, has been a U.S. citizen since 2007.Banga has met with officials from 96 governments since his nomination, the source said. He visited eight countries during a three-week world tour to meet with government officials, business leaders and civil society groups, flying a total of 39,546 miles. (Reporting by Andrea Shalal and David Lawder; Editing by Mark Porter)"
    ]
}