{
    "articleURL": "/wires/reuters/article-12057805/Talking-points-European-soccer.html",
    "content": [
        "May 7 (Reuters) - Talking points from the weekend in European soccer leagues:",
        "MBAPPE SHINES FOR PSG WITHOUT MESSI AND NEYMARKylian Mbappe can always be relied upon to come up with the goods and he produced again in a 3-1 win at Troyes on Sunday that took the capital side within sight of the title.With Lionel Messi suspended by the club for an unauthorised trip to Saudi Arabia and Neymar continuing his recovery from ankle surgery, it was left for Mbappe to take the limelight.He put PSG ahead to return to the top of the Ligue 1 scoring charts with 24 goals alongside Alexandre Lacazette, who got four for Olympique Lyonnais in a remarkable 5-4 win over Montpellier.With Messi's future uncertain and Neymar sidelined by injury it has been left to Mbappe to lead the line and he rarely disappoints. Holding onto the France striker is a must for PSG.FEYENOORD CLOSER TO DUTCH TITLEFeyenoord moved within two points of a first Dutch league title since the 2016/17 season with a 2-0 win over Excelsior Rotterdam on Sunday and could become champions at home to Go Ahead Eagles next weekend.A double from Mexican forward Santiago Gimenez continued what looks an inevitable march to the trophy and a place in next season´s Champions League.They will likely be joined in Europe's top competition by PSV Eindhoven, whose 1-0 win at Sparta Rotterdam on Saturday was followed by Ajax's 0-0 draw at home to AZ Alkmaar leaving the Amsterdam side behind PSV by five points with three games left.",
        "Ajax have booked a Champions League qualifying spot every season since the 2010/11 campaign but look set to miss out and still have some work to do to earn a place in the Europa League.EINTRACHT WOESOnly 12 months ago Eintracht Frankfurt were flying high with a Europa League title in the bag and Champions League football secured for this season.But following Saturday's 3-1 loss to Hoffenheim, Eintracht, who have reached the German Cup final, have gone 10 Bundesliga games without a win to drop to ninth place and out of contention for a European spot.With their last league victory dating back to February, Eintracht have lost three of their last five Bundesliga matches.\"Stop with this garbage,\" Eintracht coach Oliver Glasner snapped at reporters when asked if his players were committed enough.\"I know how much work the boys put in and sometimes you have to accept that Hoffenheim can win. Stop saying the players have not understood that they are not showing commitment.\"\"Old Makoto (Hasebe) is 39, he played for the third time this week for 90 minutes at the end of a season with 43 matches in all competitions.\"\"He sometimes has blood in his urine because he is so done. But what does he do? He keeps playing.\"",
        "MILAN AND INTER IN BATTLE FOR CHAMPIONS LEAGUE SPOTSWith Napoli crowned Serie A champions the chase for the remaining Champions League spots has intensified and the two Milan-based clubs may have to wrestle between them to get one.Six teams are mathematically still in the picture to secure elite football for next season as eight points separate seventh-placed AS Roma on 58 from Juventus in second on 66.With four games left to play, AC Milan are the side just outside the top four, two points off Inter Milan who they meet in the Champions League semi-final, first leg on Wednesday.\"(It's an) important match, yes, but we won't solve our problems in the league if we don't give continuity to today's victory in the next four games,\" Milan coach Stefano Pioli said after their 2-0 win over Lazio.They face lowly Spezia, Sampdoria and Verona in their remaining league outings and also travel to Juventus.Rivals Inter have trips to Napoli and Torino, while they also host Europe-chasing Atalanta and mid-table Sassuolo. (Reporting by Nick Said, Karolos Grohmann and Anita Kobylinska; Editing by Ken Ferris)"
    ]
}