{
    "articleURL": "/wires/pa/article-12060389/AI-heavy-lifting-teaching-says-Education-Secretary.html",
    "content": [
        "Artificial Intelligence could take much of the “heavy lifting” out of teaching, by marking and making lesson plans, the Education Secretary has said.",
        "Gillian Keegan spoke about the “transformative change” AI could bring to education at the opening of the Education World Forum in London. We have a lot more thinking and learning to do as we understand the potential here.  Gillian Keegan  In her opening address to the forum of education experts and global leaders, she said: “AI could have the power to transform a teacher’s day-to-day work.“For example, it can take much of the heavy lifting out of compiling lesson plans and marking.“This would enable teachers to do the one thing that AI cannot and that’s teach, up close and personal at the front of the classroom.”She likened artificial intelligence to technological innovations of the past, such as calculators and Google, and said people must learn about it and apply it in the same way to maximise positive student outcomes.",
        "Ms Keegan suggested AI could be used to “radically reduce the amount of time teachers spend marking”, or “as an assistive technology to improve access to education”.While she praised the number of schools and universities already using AI, she concluded: “We have a lot more thinking and learning to do as we understand the potential here.“I’m committed to working hand-in-hand with expert educators … as we do that thinking.”",
        "The Association of School and College Leaders (ASCL) called the Government’s approach to education technology “piecemeal and lacklustre”.ASCL general secretary Geoff Barton said: “Artificial intelligence and other digital technologies may well have the potential to help in the classroom in the future, but the Government’s approach to education technology thus far has been piecemeal and lacklustre and it will need to develop a strategy to turn this into reality.“More importantly, ministers must address the immediate problem of the severe teacher recruitment and retention crisis that schools and colleges are experiencing, and which is caused by real-terms pay cuts and workload pressures driven by the Government’s underfunding of the education system.”"
    ]
}