{
    "articleURL": "/news/article-12054637/California-restaurant-owner-says-shell-continue-asking-patrons-stand-national-anthem.html",
    "content": [
        "Jeanene Paulino is the owner of Rainbow Oaks restaurant in Fallbrook, CaliforniaShe said she plays 'The Star-Spangled Banner' every day and 'won't be stopping'She received backlash after a video of patrons singing the national anthem was posted with the caption 'By far the most dangerous situation I've ever been in'The owner of a California restaurant has refused to stop playing the national anthem every day despite getting backlash online after a TikToker blasted her patriotism.",
        "Jeanene Paulino, who has owned the Rainbow Oaks restaurant in Fallbrook for six years, joined 'Fox &amp; Friends First' on Wednesday to defend herself against the online critics. 'I come from a long line of patriots, so I was thrilled to keep the tradition going. No, we won't be stopping,' she said. Video recorded inside the eatery on April 24 and posted to TikTok showed patrons standing with their hands over their hearts for the restaurant's daily rendition of 'The Star-Spangled Banner,' with the caption 'the most dangerous situation I've ever been in.'Paulino slammed the TikToker for seeking attention and said she wished they would recognize their freedom of speech comes from those fighting to preserve the right.",
        "The video racked up millions of views, but Paulino said it's a tradition she will not be stopping. Paulino pays the song in her restaurant every day at noon. Some patrons come in just to hear it.'I feel like, if we take a few minutes out of our day to be grateful for the men and women who have made the sacrifices so that we can stand up and say how we feel and she said how she felt,' Paulino told Fox News. 'And I wish she realized that it's because those men and women who made those sacrifices that she was able to do that,' she added. ",
        "In the video posted to TikTok, comments poured in, with some writing 'that's terrifying' and 'this feels like a horror movie.' Another person claimed this would've been their 'worst nightmare.'Paulino called the online commenters 'privileged' and ungrateful to those who previously served and sacrificed.'I think maybe they're not focusing on gratitude,' she added. 'This particular TikToker had seen a local news post, so she probably did it for attention.'She said the TikToker came in the restaurant after seeing the tradition on the newscast, took her own video and uploaded it to the social media platform.There were even comments from other countries who said the act feels 'dystopian' and wondered why Americans engaged in the strange acts of patriotism.Paulino also slammed the TikToker for her caption, pointing out that they should feel grateful that such a benign incident made them feel threatened."
    ]
}