{
    "articleURL": "/wires/pa/article-12050245/Sean-Dyche-Draw-Leicester-showed-Everton-right-track.html",
    "content": [
        "Sean Dyche believes Everton’s performance in Monday’s 2-2 draw at Leicester has brought the “feel-good factor” back to the squad, even if it did not result in three badly-needed points in their fight against relegation.",
        "Everton remain winless in their last seven games having come from behind to rescue a point at the King Power Stadium, but Dyche was keen to take the positives from a performance in which his side had 23 shots at goal, their most in a Premier League fixture for three and a half years.As they prepare for another Monday away match – this time a much tougher looking fixture at high-flying Brighton – Dyche said the Leicester game had given his players a confidence boost.“The Leicester performance was a mixture of what we want,” he said. “Good energy and good detail, apart from the mistakes from the goals. We looked a real threat constantly and I was pleased with the team performance.“It reaffirms to them that we are on the right track. I know we aren’t in the league and the table, but in the performances we are.“We didn’t get the full reward for it but we did get the reward of the feel-good factor and rightly so. It’s not easy going on the road in the Premier League.”",
        "Everton won three of Dyche’s first seven games in charge but are now winless since the 1-0 victory over Brentford on March 11, since when they have taken four points from the last seven.",
        "“It’s a quality of performance that we want to build,” Dyche said. “We have done that in certain games, particularly against Arsenal when we first got here. It shows it is in there – it’s the consistency I’ve been searching for.”Finding that consistency has been a key theme that Dyche has emphasised to his players this week.“The thing is, it’s parked really quickly,” he added of the Leicester performance. “We have to use it wisely, but then you have to go and deliver it again.“It can’t be once every few games, it has to be consistent. That is what I have been talking about on the training pitch and what I have been talking about through the media about our performances.”Everton go into the weekend stuck in 19th position, albeit only one point behind the three teams above them. Leeds head to Manchester City on Saturday while Leicester and Nottingham Forest are, like Everton, both in action on Monday.“Like everyone in the Premier League, when you’re down, looking up, everything seems different and we have to make sure we take away that feeling and focus on our performance like we did at Leicester,” Dyche said.“That was about us, that wasn’t about Leicester. That is a thing we have been trying to get the players to really grasp – to grip hold of games, but it’s not easy when you’re playing against top sides.”"
    ]
}