{
    "articleURL": "/wires/aap/article-12045333/No-moral-case-not-lifting-JobSeeker-rate-Greens.html",
    "content": [
        "The Albanese government must take action to address poverty in the May budget, a cross-party parliamentary committee says.",
        "An interim report released on Thursday by a committee examining the nature and extent of poverty recommended the government prioritise targeted measures to tackle \"rising inequality and entrenched disadvantage, including through the income support system\".But the committee did not go so far as to recommend a specific rise in the JobSeeker payment.There is speculation the government will lift the JobSeeker rate for over-55s in Tuesday's budget.Greens senator and committee chair Janet Rice said the rise was welcome, but much more was needed, as the inquiry had heard.\"It's hard to understand how the Labor government can morally justify not raising income support,\" she said.\"In opposition, Anthony Albanese is on the record saying that the rate of income support is inadequate.\"It's hard to believe the Labor Party hold any core values if they can so easily call for one thing in opposition and do the opposite while in government.\"The Greens made two recommendations in the party's additional comments in the report, including that the base rate of JobSeeker and other support payments increase to $88 a day, regardless of age, and the government establish a national definition of poverty.The review found that because of the lack of a definition, it was hard to capture the true scale of the crisis in Australia, where resources should be allocated, or how to track whether any substantial progress is made towards addressing poverty.",
        "The committee heard from people from across the country who had directly experienced poverty.A woman called Genevieve said in today's Australia there was a \"huge divide\" between the haves and the have-nots.\"Far from the days when Robert Menzies made housing affordable and accessible for all,\" she said.\"Australia has become a lot harsher for those with less, and the safety net for low-income, single-parent families has all but disappeared.\"The senators acknowledged the recent call by the newly formed economic inclusion advisory committee for the government to commit to a substantial rise in the base rates of the JobSeeker payment and related working-age payments.The Senate committee's final report will be handed down in October."
    ]
}