{
    "articleURL": "/wires/ap/article-12040857/Could-France-protest-fury-spill-years-Olympics.html",
    "content": [
        "PARIS (AP) - Retired and with time to kill, Bernard Gauvain wants to be a volunteer at the 2024 Olympics - but a bad one.",
        "His intention is not to help out, but to gum up the Olympic machine by refusing to turn up for work. If others do likewise in sufficient numbers, he hopes they'll sting the VVIP who stands to gain if the Paris Games run triumphantly like clockwork: French President Emmanuel Macron.The 68-year-old former agricultural consultant in southern France is part of an otherwise mostly hush-hush band of Olympic opponents who call themselves \"un-volunteers.\" Also anti-Macron - the president has ignited a months-long firestorm of French protest with unpopular pension reforms - the anti-Olympic Trojan horses are working to infiltrate and then disrupt next year's Paris Games by signing up as volunteers, posing as willing-to-help superfans when they're anything but.Their surreptitious operation, and other Olympic contestation that is picking up online and starting to spill onto French streets, highlight a growing risk of the Paris Games becoming entangled in unflagging public anger against Macron for raising France's retirement age from 62 to 64. Efforts by Macron's opponents to link protests to Olympic preparations that have otherwise been largely smooth and low-key raise the possibility that the Games themselves could be whacked by demonstrations and strikes if fury pushes into 2024 unabated.HOW MUCH OPPOSITION?So far, protests targeting Olympic preparations have been small and sporadic. Olympic organizers say polling shows enduring strong support for the Games that will showcase Paris' recovery from attacks by the Islamic State group that killed 130 people on Nov. 13, 2015. Athletes will compete against televisual backdrops of iconic landmarks in the French capital's first Olympics in a century.",
        "Other numbers also suggest that opponents remain a minority. Four million applicants signed up for the latest ticket draw. Organizers also say that more than 200,000 candidates put themselves forward to be picked as the 45,000 volunteers who work without pay at the world´s biggest sports event that generates billions from sponsors, broadcast rights, ticketing and merchandise. The deadline for volunteering is Wednesday.But somewhere in the pile are applications from Gauvain and others who want to hinder, not help.Even though Macron has enacted the pension-age increase into law, having used his executive powers to ram it past lawmakers without giving them a vote, Gauvain is among the many in France who aren't giving up the fight. Demonstrators are following Macron and his ministers on their outings around the country, banging pots and pans. And some are leveraging the Olympics to maintain pressure. There are online hashtags that say the Games shouldn't happen if the pension reform stays.\"We don't want to turn the page,\" said Clara Jaboulay, who organized one such demonstration outside a swimming club famous for preparing Olympians in Marseille. The Mediterranean port city will host Olympic soccer matches and sailing competitions in 2024. The dozen or so protesters unfurled a banner reading \"No withdrawal, no Olympics,\" with five kitchen saucepans painted to represent the Olympic rings.",
        "\"The Olympic Games are putting our country in the spotlight. We have to show that the population doesn't feel represented by this government,\" Jaboulay said.Gauvain said it took him 45 minutes to complete the online registration form to be a Paris Games volunteer, which includes 180 personality-test questions. If selected, he says: \"I´ll tell them an hour before that I´m not coming.\"\"The Olympic Games are Macron´s pride and joy,\" he said. \"So it´s a way of stinging him.\"Because he posted about his intentions on Twitter, collecting more than 9,000 likes and retweets, Gauvain acknowledges that he's now unlikely to be picked. But other \"un-volunteers,\" who spoke to The Associated Press on condition of anonymity to avoid torpedoing their chances, are hoping they'll be selected so they can throw spanners in the works. Their view is that the Olympics are socially, financially and environmentally destructive and that the policing around them erodes civil liberties.They're considering an array of possibilities: not turning up to leave organizers short-handed; turning up but working badly and slowly; unfurling banners inside the Olympic perimeter; sabotaging equipment; using the opportunity to lobby other volunteers; or going to a labor court afterward to argue they should have been paid for their help. Gauvain even mentioned that some suggest gluing venue doors shut.",
        "\"There are a thousand ways of being obstructive, of protesting,\" Gauvain said. \"Each to their own imagination.\"WEEDING OUTAlexandre Morenon-Condé, director of the Paris Games volunteer program, says he's confident their screening process \"will allow us to be sure of people´s sincerity\" and that if volunteers pull out, there will be backups \"who´ll be delighted to join.\"\"We have a certain number of methods that allow us to be sure that the people who join the volunteer program are the most committed, the most in tune with our values,\" Morenon-Condé said. A self-described \"absolute fan of the Games,\" he volunteered at the 2004 Athens Olympics and says the experience \"changed my life.\"Games organizers are also working with labor unions that are leading demonstrations and strikes against Macron's pension reform. Veteran labor leader Bernard Thibault is the union representative on Paris organizers' executive board. He expects public fury at Macron \"will have evolved one way or another\" by Games-time, and he's not anticipating protests that would disrupt events.Unless, of course, France's president does something else to rile opponents before the July 26 opening ceremony.\"I can´t imagine President Macron rolling out a new project or a new law that would make a big noise in the country a month or two before the Olympic Games, to the point of provoking another earthquake,\" Thibault said. \"If that was the case, then nothing could be guaranteed.\"",
        "___More AP coverage of the Paris Olympics: https://apnews.com/hub/2024-paris-olympic-games and https://twitter.com/AP_Sports"
    ]
}