{
    "articleURL": "/wires/reuters/article-12055195/Warren-Buffett-says-Berkshire-cautious-banking-sector.html",
    "content": [
        "By John McCrank",
        "NEW YORK, May 6 (Reuters) - Warren Buffett on Saturday said Berkshire Hathaway is cautious around the banking sector, largely because of poor messaging by officials around government-insured deposits, as well as distorted incentives he said were brought on by banking regulation.A crisis of confidence in the U.S. banking sector has led to the failure of three midsized banks since March as depositors fled from smaller banks, with calls for the Federal Deposit Insurance Corp (FDIC) to raise its $250,000 limit guarantee on deposits.The messaging by politicians, government agencies and the media around the safety of the banking system has been poor, the nonagenarian billionaire said at Berkshire's annual meeting in Omaha, Nebraska.\"The U.S. government and the American public have no interest in having a bank fail and having deposits actually lost by people,\" he said.\"We had a demonstration project the weekend of Silicon Valley Bank and the public is still confused.\"In March, startup-focused lender SVB Financial Group (SIVB.O) became the largest bank to fail since the 2008 financial crisis after depositors tried to pull more than $42 billion in a single day, kicking off the deposit flight across other regional banks and prompting the collapse of Signature Bank. While 89% of SVB's $175 billion in deposits were uninsured as of the end of 2022, according to the FDIC, depositors were protected, even those whose accounts exceeded $250,000, through a \"systemic risk exception\" designed to prevent broader contagion to the U.S. banking system.",
        "Berkshire keeps around $128 billion in cash and Treasury bills, Buffett said.\"We want to be there if the banking system temporarily even gets stalled in some way - it shouldn´t - I don´t think it will, but I think it could,\" he said.Part of the reason for that is that incentives in banking regulation are \"so messed up,\" he said.First Republic Bank, the latest regional U.S. bank to fail, disclosed that it was offering non-guaranteed jumbo-sized mortgages at fixed rates in its annual report.\"That´s what First Republic was doing and it was in plain sight and the world ignored it until it blew up,\" said Buffett, who earlier noted his own father lost his job in 1931 because of a bank run. \"The incentives in bank regulation are so messed up and so many people have an interest in having them messed up -- it's totally crazy,\" Buffett said. \"So we are very cautious in a situation like that about ownership.\"Buffett made the comments while sitting behind a sign that said \"Available for sale,\" while his longtime business partner, Charlie Munger, sat behind a \"Held-to-maturity\" sign, referencing how banks account for their securities, which has been at the heart of the regional bank crisis.First Republic, which was seized by regulators and sold to JPMorgan N&gt;, had significant losses in its held-to-maturity investment portfolio, mainly government-backed debt.",
        "Berkshire has sold some bank stocks in the past six months, after having also unloaded some when the pandemic broke out, and now only holds Bank of America, which Buffett said he is happy with.Buffett, the world's sixth-richest person, said he is not personally worried about local banks.\"I´ve got my own personal money, and I´m probably above the FDIC limit, and I´ve got it with a local bank and I don´t worry about it in the least.\"(Reporting by John McCrank; Editing by Chizu Nomiyama )"
    ]
}