{
    "articleURL": "/sport/football/article-12052731/Wrexham-players-enjoy-Day-2-Las-Vegas-trip-MGM-Grands-pool-qualifying-League-2.html",
    "content": [
        "The entire squad posed for a group snap in front of the Wet Republic Ultra Pool On Thursday, Wrexham players hit up the Hakkasan nightclub after their arrivalDailyMail.com provides all the latest international sports news Wrexham players were curing their hangovers by chilling at the pool that's part of a lavish hotel on the Las Vegas strip, before hitting the town once more in the evening, following their first 'monster' night in Sin City. ",
        "The team's entire squad posted for a group picture while holding cardboard signs of the club's letters and logo on a sunny, warm day in 74-degree weather.Forward Elliot Lee was spotted enjoying a beer in a lime bottle by the Wet Republic Ultra Pool at the MGM Grand on Friday with teammate and dragon defender Eoghan O'Connell. Lee scored 12 goals in 45 match this season to help promote the Welsh club back into the fourth tier of the English Football Championship (League Two). Irish midfielder Thomas O'Connor, who was formed at Southampton before enjoying stints at Gillingham and Burton Albion, was seen relaxing and scrolling on his phone on a long chair while taking in the Vegas sun.",
        "'The Kilkenny man taking over vegas,' shared Lee on Instagram. The trio along with their other teammates are believed to be going to Omnia -- a tri-level club inside Caesars Palace, which offers DJs and dancing plus bottle service and incredible views on the Strip. Club winger Ryan Barnett, 23, also shared a snap of himself in the pool with former Premier League goalkeeper Ben Foster. The duo were in for a boozy day with three other teammates, including Welsh midfielder Jordan Davies and English defender Ben Dozer. 'One of our own,' Barnett wrote about Davies. He also described Foster as a 'friggin legend' in his Instagram post. ",
        "Before diving into the pool, the 40-year-old, former Manchester United, Watford and West Bromwich Albion goalkeeper posed for a picture with Wrexham's Irish defender and teammate Anthony Forde, who came through the ranks at Wolverhampton. ",
        "For his part, Forde was part of an Instagram selfie with fellow defender and former Nike Academy player Jordan Tunniclife, 29. The pair showed off their close friendship and massive crowd by the MGM Grand's pools, while wearing similarly colored hats (beige). Wrexham -- this season's National League champions -- have been gifted an all-expenses-paid four-day trip to celebrate their record-breaking 111-point season by their co-chairmen Ryan Reynolds and Rob McElhenney.On Thursday, after landing at Vegas' Harry Reid International Airport, players partied at the Hakkasan nightclub. Earlier in the night, they hit a modern Chinese restaurant at MGM Grand, where the minimum price for a dish is $148. "
    ]
}