{
    "articleURL": "/wires/pa/article-12053815/Marco-Silva-delighted-prove-Fulham-s-doubters-wrong-fine-campaign.html",
    "content": [
        "Fulham boss Marco Silva is feeling smug about his side’s Premier League position after recalling pre-season predictions that they were destined for relegation.",
        "This might be one of the closest survival battles in recent memory, but last season’s Championship winners are not one of the teams worrying about a potentially heart-breaking end to the campaign.Instead, Silva’s men are 10th, maintaining their top-half status despite picking up just seven points in their last 10 league contests.He said: “You have to be pleased. You have to be really proud, because I knew what everyone was saying at the beginning of the season about Fulham. I knew we were the favourites (to be relegated).“Some people even without a doubt said we will be the first ones to get relegated, and of course we have to be pleased. Not because of what the people said, because they have to comment, they have to give their opinions, but much more for ourselves.“Firstly for our fans because the last two seasons in the Premier League they were really tough for them, and they deserve much more, and the other because I believe, and I said from the last days of last season that I felt that this football club belongs in the Premier League and we showed that during the season.”",
        "In Leicester, Fulham face an opponent in a very different fight from leaders Manchester City and Europe-chasing Liverpool, who got the better of Silva’s side in their most recent meetings, but the Portuguese intends to approach Monday’s meeting with the same overall philosophy.",
        "He said: “In terms of preparation nothing is different. We always prepare ourselves the same way, with different strategies, of course.“Against City we knew that we probably wouldn’t have the ball as often as we would like, Liverpool more or less the same thing even if they are slightly different.“And against Leicester of course playing at the Cottage we are going to try to have control of the game even though you know you are going to face a team with a lot of quality around the pitch.“It will be a different game definitely than the previous two matches but it will be a tough game in the same way. The approach will be the same. We are going to prepare ourselves to be at our best level.”"
    ]
}