{
    "articleURL": "/wires/reuters/article-12041751/Kyle-Gibson-looks-help-Orioles-series-Royals.html",
    "content": [
        "Baltimore Orioles right-hander Yennier Cano allowed his first hit of the season in Tuesday's 11-7 win at Kansas City after 11 straight hitless innings to start the season.",
        "The 32 consecutive at-bats without a hit was the longest in the majors to start a season since Milwaukee's Josh Hader retired 35 straight in 2020.Baltimore, which has won all 10 of its series openers this season, looks to capture its seventh consecutive series on Wednesday when the Orioles send veteran right-hander Kyle Gibson (4-0, 3.93 ERA) to the mound.Gibson has a long history against the Royals, including making his major league debut versus Kansas City and building a 10-5 record and 3.79 ERA over 26 games, including 24 starts.He hasn't lost to the Royals since 2018, winning four straight with three different clubs. His most recent decision versus Kansas City came in 2021, when he had 10 strikeouts over seven shutout innings for the Texas Rangers.Gibson has been especially tough on Royals' slugger Salvador Perez, holding him to a .137 average (6-for-44) with 13 strikeouts. Perez hasn't had a hit against Gibson since 2017.Baltimore out-hit Kansas City 15-7 Tuesday and is 15-1 when out-hitting opponents this season.After Ryan Yarbrough retired the first 10 batters, the Orioles collected 11 hits and five walks over the next three frames, scoring 10 runs.Adley Rutschman collected four consecutive hits, his third game this year with at least four hits. Ryan Mountcastle plated five runs with a double and a pair of two-run homers.",
        "\"We just didn't take a great approach early,\" Baltimore manager Brandon Hyde said. \"All of a sudden we did, starting with Adley driving the ball the other way and then Mounty jumping on one.\"Right-hander Zack Greinke (0-4, 6.10) will start on Wednesday for Kansas City.Greinke's 2023 starts have been progressively worse. He surrendered seven runs over 3 2/3 innings-- his most since May 23 of last year -- in a 7-1 loss to the Minnesota Twins.The 20-year veteran is 3-2 with a 4.65 ERA against the Orioles in 12 appearances, including 10 starts. Greinke hasn't lost to the Orioles since his rookie season in 2004.Mountcastle is 5-for-9 with a homer in three games against Greinke.The Royals anticipate being without infielder Nicky Lopez for several weeks after his emergency appendectomy prior to Sunday's game in Minnesota.Kansas City recalled well-regarded infield prospect Maikel Garcia, who had two singles on Tuesday.Additionally, the Royals optioned designated hitter Franmil Reyes to Triple-A Omaha and recalled catcher Freddy Fermin, a move expected to push MJ Melendez to a full-time outfield spot.\"(We're) taking a little bit off of his mind from a preparation standpoint, because these catchers put a lot of work into getting ready for a game,\" Royals general manager J.J. Piccolo said. \"But taking that off of his mind right now and just focusing on the bat we think will pay dividends.\"",
        "Perez left Tuesday's loss in the eighth inning after getting hit on the glove hand by the backswing of Anthony Santander, getting Fermin into the game.Perez was diagnosed with a left middle-finger contusion.--Field Level Media"
    ]
}