{
    "articleURL": "/sport/football/article-12045831/Deco-best-placed-replace-Mateu-Alemany-Barcelonas-director-football.html",
    "content": [
        "Barcelona transfer chief Mateu Alemany will leave at the end of the seasonAlemany is in advanced talks with Aston Villa to work alongside boss Unai Emery Former Barca player turned agent Deco could be chosen to succeed Alemany Former Barcelona star Deco has reportedly emerged as the best placed candidate to succeed the outgoing Mateu Alemany as the club's director of football.",
        "Barcelona confirmed on Tuesday that Alemany, 60, will leave the LaLiga leaders at the end of the season.Alemany is in talks over a move to join Aston Villa according to multiple reports in Spain.The transfer chief has reportedly been offered a large salary increase to move to Villa Park and work alongside boss Unai Emery.Catalan radio station RAC1 has reported that Barcelona could turn to their former midfielder Deco to succeed Alemany.",
        "The former Barcelona midfielder is considered the 'best placed' candidate to fill the position. Deco played 161 times for Barcelona between 2004 and 2008 after joining the club from Porto.The Portuguese international was part of Frank Rijkaard’s Champions League winning Barcelona team in 2006.He later spent two years playing in the Premier League with Chelsea, before ending his career in 2013 after four seasons with the Brazilian side Fluminense.The 45-year-old, who was born in Brazil, founded the D20 Sports Management agency in 2014.Barcelona winger Raphinha and Liverpool midfielder Fabinho are among the agency’s most well-known stars.Deco has reportedly worked as Barcelona's head of recruitment in South America since Joan Laporta was elected as the club's president in 2021.Reports in Spain claim Antonio Cordon is also being considered for the director of football role.",
        "Cordon left Real Betis in February after two-and-a-half years working for the club.",
        "He previously worked as Villarreal's sporting director from 2000 to 2016, before spells with Monaco and the Ecuadorian Football Federation.The 59-year-old has a close relationship with Barcelona sporting director Jordi Cruyff, who briefly became Ecuador manager in 2020.Cruyff's own role at Barcelona is reportedly uncertain with the 49-year-old considering his future amid Premier League interest."
    ]
}