{
    "articleURL": "/wires/aap/article-12060431/Lehrmann-inquiry-examine-police-prosecutor-tensions.html",
    "content": [
        "Police provided Brittany Higgins' counselling notes and recorded interview to her alleged rapist's legal team before he entered a plea regarding the matter.",
        "An inquiry into how the ACT's justice system handled rape allegations against Bruce Lehrmann heard that his lawyers didn't access the impermissible material, but that it continued a perceived pattern of police leaking information against Ms Higgins.ACT Director of Public Prosecutions Shane Drumgold said he was \"shocked\" the Australian Federal Police had served an unredacted brief of evidence before a plea and that he'd never seen it before, adding there were additional concerns with it being a sexual assault brief.Mr Drumgold told the inquiry he believed serving the documents was inadvertent rather than deliberate, but that his main concern was Ms Higgins' health.\"I've already received information the complainant is highly vulnerable and I'm concerned this will aggravate that ... I want to give some solace this is not part of some attempt to derail the prosecution,\" he said.\"I already knew one or more police had taken a particular preliminary view on the brief, and I now knew ... some protected material had been served. Now I'm asking myself if those two things are connected.\"Mr Drumgold is giving his second day of evidence to the inquiry, established after accusations by police and prosecutors about each other's conduct during the case.Former Queensland solicitor-general Walter Sofronoff is leading the inquiry which is examining how territory police, prosecutors and a victim support service handled Ms Higgins' allegations.",
        "Mr Sofronoff said the DPP was \"rightly agitated\" by the service of the impermissible documents, but questioned why counselling records had been accessed by either legal side.He questioned if Mr Drumgold should have disqualified himself from running the case because he'd read the notes, meaning he might see inconsistencies in evidence he'd be duty-bound to report.Earlier, the ACT's top prosecutor denied he'd deliberately withheld documents from the defence team where police wrote \"pejorative comments\" about Ms Higgins.Mr Drumgold was grilled on the department's disclosure of documents to the defence, where they didn't hand over one containing police criticism of Ms Higgins, citing legal professional privilege.He told the inquiry it was \"clearly error\" to rely on legal professional privilege, but maintained he'd relied on those concerns to not hand over the document.\"I held a concern that a senior police officer ... reducing to writing pejorative comments about a complainant, if it falls into the ears of the complainant would be crushing and that would inhibit her ability to engage in trial,\" he said.Mr Lehrmann faced an ACT Supreme Court trial in October 2022 but juror misconduct meant a verdict was not reached.Prosecutors later dropped the charge against Mr Lehrmann because of concerns about the impact a second trial would have on Ms Higgins' mental health.",
        "Mr Lehrmann denies raping Ms Higgins in Parliament House in 2019.A report will be provided to ACT Chief Minister Andrew Barr at the end of July."
    ]
}