{
    "articleURL": "/tvshowbiz/article-12049311/Sam-Rockwell-longtime-girlfriend-Leslie-Bibb-walk-dog-Manhattans-Soho-Neighborhood.html",
    "content": [
        "Oscar winner Sam Rockwell and his longtime girlfriend, Leslie Bibb, were seen walking their dog around Manhattan’s Soho Neighborhood on Thursday. ",
        "Rockwell, 54, wore a scarf around his neck under a black bomber jacket inscribed 'Bruce Lee' with grey jeans and sneakers. Bibb, 48, wore a cream sweater under a blue pea coat and tied a blue top around her neck. The beauty styled her blonde tresses with a side part behind her ears and wore stonewashed jeans, white trainers, and gold earrings.The longtime couple has been together since 2007 when they reportedly met in Los Angeles as he was shooting Frost/Nixon.",
        "The couple starred together in the 2010 Marvel superhero sequel Iron Man 2 and the 2015 comedy film Don Verdean. Rockwell won an Oscar in 2018 for Best Supporting Actor for his performance in Three Billboards Outside Ebbing, Missouri.He also won a Screen Actors Guild Award in 2020 for portraying Broadway legend Bob Fosse in the FX series Fosse/Verdon.After winning the award, Sam thanked Leslie 'for reading scripts with me during the Christmas break,' adding, 'I love you very much.'Bibb scored her first recurring role on TV in The Big Easy (1997). She gained prominence by appearing as Christine Everhart in Iron Man (2008) and Iron Man 2 (2010).In 2019, Leslie starred in Running With the Devil alongside Nicolas Cage and Laurence Fishburne.In 2021, she played the biblical demonic entity of Satan in the Netflix comedy series God's Favorite Idiot alongside Melissa McCarthy.",
        "The series, created by Falcone, consists of 16 episodes and tells the story of Clark, a tech support employee who falls in love with his co-work Amily before he develops the ability to glow after getting struck by lightning.",
        "Rockwell recently appeared as Inspector Stoppard in the whodunnit film See How They Run alongside Adrien Brody.The film takes place in the West End of 1950s London, where plans for a theatrical version of a successful play are halted following the murder of a crew member.Inspector Stoppard and Constable Stalker get involved in the investigation, putting themselves in danger amid their probe.The film was shot at famous venues in London, such as the Dominion Theatre on Tottenham Court Road, the West End's St. Martin’s Theatre, and Waterloo's Old Vic Theatre."
    ]
}