{
    "articleURL": "/news/article-12058651/How-Kings-incredible-Coronation-concert-came-together.html",
    "content": [
        "Royals and 20,000 spectators turned up for the star-studded event last nightFrom the choir to ballet, drone displays, a dazzling light show and guest appearances from Tom Cruise, Winnie-the-Pooh and Kermit the Frog, the star-studded concert celebrating the coronation of King Charles III was an incredible spectacle.",
        "Charles, 74, and Queen Camilla, 75, watched from a royal box in the grounds of Windsor Castle as Lionel Richie, Katy Perry and Take That took to the stage in front of 20,000 spectators.The event, which was organised by the BBC and watched by millions around the globe, featured a 70-piece orchestra, choirs and several unique dramatic performances. But the entertainment was also interspersed with more serious moments - from William's heartfelt homage to his father to tributes to the late Queen and nods to Charles's ongoing campaigns on conservation and environmental issues.Hollywood star Tom Cruise, actress Joan Collins and singer Tom Jones all appeared via video message. A series of pre-recorded sketches also aired, revealing little-known facts about Charles and included moments from The Muppets and beloved literary character Winnie-the-Pooh.A message from Charles on the importance of environmental conservation was played, and the show was accompanied by a light and drone display with a nature theme. Prince William took to the stage to pay tribute to his father, saying that he knew the late Queen would be 'a very proud mother'.At the same time, ten towns and cities across the country were treated to spectacular light displays, while 1,000 drones took to the sky for a UK-first 'multi-location drone show'. ",
        "A host of global superstars, backed by a world-class 70-piece orchestra, came together last night to commemorate the coronation of King Charles and Queen Camilla. The concert was held on a stage that resembled the Union Flag, with catwalks jutting out from the centre and multiple levels.",
        "Among the audience were dozens of winners of the Queen's Coronation Champions Awards, supported by the Daily Mail. The newly crowned monarch and his wife appeared to enjoy the show as Lionel Richie performed 'All Night Long', at one point getting up on their feet and swaying to the music. The musician also played a rendition of Easy.Princess Charlotte, eight, and her mother Kate sang along as Katy Perry, dressed in a gold foil ball gown, performed her pop hit 'Roar'.Take That - appearing for their first show in four years - then took to the stage with Greatest Day, Shine and, to close the show, Never Forget, featuring an intro from The Choristers of St George's Chapel.Several members of the royal family got to their feet during the performance, including the King and Queen, while Prince George, nine, and Charlotte enthusiastically waved their Union flags. ",
        "The 300-strong Coronation Choir, conducted by Gareth Malone, performed an uplifting version of the Emeli Sande song Brighter Days, while Steve Winwood sang his hit song Higher Love, accompanied by the Commonwealth virtual choir, with singers from more than 40 Commonwealth countries.The evening also saw a collaboration between five Royal patronages - The Royal Ballet, The Royal Opera, the Royal Shakespeare Company, The Royal College of Music and The Royal College of Art - who came together for the first time to perform Somewhere from West Side Story.",
        "Other collaborations included Andrea Bocelli and Sir Bryn Terfel, who sang You'll Never Walk Alone, and Lang Lang and Nicole Scherzinger, who performed Reflection from Mulan.Artist Tracey Emin discussed the King's watercolours, before some were beamed across the castle walls, accompanied by an enchanting recital of Bach's Prelude in C major by piano prodigy Lucy Illingworth. Actor Richard E Grant appeared to discuss Queen Camilla's book club. The organisers had included the King's master of ceremonies, the Earl Marshal (the Duke of Norfolk) and his Master of the Royal Household. ",
        "Stars including Hugh Jackman, Pierce Brosnan, Dame Joan Collins, Bear Grylls OBE, Alan Titchmarsh, and Sir Tom Jones gave pre-recorded video messages in honour of the King throughout the concert, which was hosted by Hugh Bonneville.Top Gun star Tom Cruise delivered a video message from his War Bird plane, saying: 'Pilot to pilot. Your Majesty, you can be my wingman any time,' before saluting and banking off.The mandatory James Bond element was provided by Pierce Brosnan, reminding the audience of the King's youthful 'action man skills'. Cue some grainy shots of the young Charles in various uniforms. Muppets stars Kermit and Miss Piggy also gave speeches, with the frog saying he was 'honoured' to have been invited to the coronation. ",
        "Miss Piggy sparked huge laughter from the King after she described host Hugh Bonneville as a 'real Lord' - mistaking the actor for the character he plays in Downton Abbey, the Earl of Grantham.The King then laughed even harder after she referred to him as 'King Charlesy Warlesy' and said he was 'expecting' Kermit the Frog in the royal box.Even Charlotte and George smiled as they watched on intently, while the Prince of Wales laughed along with his father.",
        "Just before Hugh Bonneville introduced the final act of the star-studded concert, Take That, the BBC cut to the royal box, where Kermit waved a Union flag in front of a grinning Duke of Edinburgh.The King looked to his left as he clapped before Bonneville signed off: 'And, of course, thank you your majesties, for allowing us to perform for you here. We sincerely hope you and the frog have enjoyed yourselves.'More reflective moments included Stella McCartney's address about the environment and a Winnie the Pooh skit - which followed Paddington Bear's appearance with Queen Elizabeth II at the late monarch's Platinum Jubilee. Pooh and Piglet popped up to discuss the King's lifelong love of Scotland's dwindling red squirrel population. The monarch has, indeed, installed a squirrel flap at his Birkhall home so that Tufty and Co have access to a 24-hour nut supply. ",
        "As a message from the monarch about the importance of conservation played for the audience, a lights and drone show featuring whales, tigers, and owls lit up the sky over the castle.The evening also featured 'Lighting up the Nation', in which well-known locations across Britain were illuminated using projections, lasers and drone displays.",
        "William also delivered his emotional address that paid tribute to his father, telling him: 'Pa, we are all so proud of you.'The Prince left barely a dry eye in the crowd – let alone the millions watching around the world – as he told them: 'As my grandmother said when she was crowned, coronations are a declaration of our hopes for the future.'And I know she's up there, fondly keeping an eye on us. She would be a very proud mother.'For all that celebrations are magnificent, at the heart of the pageantry is a simple message: service. My father's first words on entering Westminster Abbey yesterday were a pledge of service. It was a pledge to continue to serve.'In a heartfelt homage to his father, with whom he has not always seen eye to eye, William praised the King's legacy on everything from charities such as the Prince's Trust to his pioneering work on the environment and attempts to promote interfaith and cultural harmony.",
        "He also said he wanted to express his 'pride and gratitude for the millions of people who serve, in the forces, in classrooms, hospital wards and local communities', some of whom were in the audience. William said: 'I wish I could mention you all. Your service inspires us. And tonight we celebrate you too.'William concluded with his own stirring pledge to the nation as his father's son and heir, saying: 'I commit myself to serve you all – King, country and Commonwealth. God Save The King!'"
    ]
}