{
    "articleURL": "/wires/ap/article-12052973/Freaky-looking-fanged-fishes-Oregon-beaches.html",
    "content": [
        "Several scaleless fish with fanged jaws and huge eyes that can be found more than a mile deep in the ocean have washed up along a roughly 200-mile (322-kilometer) stretch of Oregon coastline, and it's unclear why, scientists and experts said.",
        "Within the last few weeks, several lancetfish have appeared on beaches from Nehalem, in northern Oregon, to Bandon, which is about 100 miles (161 kilometers) from the California border, Oregon State Parks said on Facebook. The agency asked beachgoers who see the fish to take photos and post them online, tagging the agency and the NOAA Fisheries West Coast region.Lancetfish live mainly in tropical and subtropical waters but travel as far north as areas like Alaska´s Bering Sea to feed. Their slinky bodies include a \"sail-like\" fin, and their flesh is gelatinous - not generally something humans wish to eat, according to NOAA Fisheries.Ben Frable, a fish scientist who manages the Marine Vertebrate Collection at Scripps Institution of Oceanography at the University of California San Diego, said it's not uncommon for lancetfish to wash up on beaches, particularly in California and Oregon and in other parts of the north Pacific.It's unclear what might be behind the deep-sea fish washing ashore, Frable said, calling it an area of \"open research.\" He added that it's not clear if these incidents are happening more frequently or are just noticed more often in the social media age.Reports of finding the \"freaky looking\" lancetfish on beaches date back to the 19th century, he said. The collection he manages includes lancetfish from beaches, including one that wound up on the beach near the institution in late 2021.",
        "In that case, the lancetfish \"shot out of the water,\" where it was mobbed by seagulls, Frable said. It's possible the fish had been chasing prey, such as small fish, and got too close to shore - or that it was pursued by a predator, such as a sea lion, he said.Some have also hypothesized that such incidents could be related to weather or climate patterns in the Pacific Ocean, he said.According to NOAA Fisheries, lancetfish can be more than 7 feet (2 meter) long and swim to depths of more than a mile beneath the surface of the sea.Last week, Miranda Crowell happened across a lancetfish on a beach in Lincoln City, Oregon. At first, she thought it might be a barracuda but that didn´t seem right, so she posted a photo of it on Twitter and asked what it could be. She quickly got a response.The fish, which she saw April 28, was more than 4 feet (1 meter) long and seemed to have just washed ashore.\"I have never seen anything like that on that beach,\" she said.Frable encouraged people to report any sightings, saying it could provide useful information for researchers.He also said that incidents like these provide an opportunity \"to kind of highlight the true diversity of life on the planet and how there are things that you just don´t think about - but they're out there.\""
    ]
}