{
    "articleURL": "/wires/ap/article-12061017/Canes-Stars-need-rebound-losses-Devils-Kraken.html",
    "content": [
        "NEWARK, N.J. (AP) - There used to be a time when Stanley Cup playoff hockey meant close-checking, low-scoring games.",
        "This must be the nouveau NHL, at least if you have been watching the New Jersey Devils play the Carolina Hurricanes, and the Seattle Kraken face the Dallas Stars in the second round.It's goals galore. The four teams have combined for 49 goals in the first three games of each series, or roughly eight goals per game.When the two series resume on Tuesday night, the Kraken and Hurricanes will try to take 3-1 leads in their best-of-seven matchups.Seattle is coming off a 7-2 thumping of the Stars, while the Devils, who lost the first two games in Raleigh, North Carolina, got back in their series with an 8-4 victory at the Prudential Center on Sunday.\"It has been definitely different,\" Hurricanes captain Jordan Staal said, adding he could not remember the previous time he was involved in a 12-goal playoff game.",
        "\"It´s kind of the new NHL, I think, a little bit. Just finding ways to get more goals, I guess.\"Devils coach Lindy Ruff laughed at the idea that playoff hockey was changing, noting his team, the Canes and Stars are all outstanding defensive teams.The constant in this series is taking the lead.\"You put all risk into your game and you know if you get burnt the goals are going to go up,\" said Ruff, whose team was outscored 11-2 in the first two games.",
        "Ruff said the seven-game win over the Rangers was mostly low-scoring games.Devils defenseman Brandon Smith remembers as a youth he watched Wayne Gretzky in the playoffs, and there were some blowouts.Seattle's five-goal second period was the most by any team in one period this postseason. The Kraken had a four-goal first period of their 5-4 win in Game 1.The Kraken have had 16 players score a goal in the first 10 games of the playoffs. It had 13 players score at least 13 goals during the regular season.\"It´s huge,\" said defenseman Carson Soucy. \"It´s just a testament of kind of how we got here in the first place. We had some really good stretches throughout the regular season where everyone was contributing.\"It's happening again in the playoffs.HURRICANES at DEVILS, Carolina leads 2-1 (7 p.m. EDT, ESPN)Ruff held a 25-minute practice Monday and reminded his team that Carolina is going to come back and play a much better defensive game and bring a heavy forecheck, as it did in the first two games.New Jersey has things to clean up, too. The Devils allowed four goals, including three short-handed. Goaltender Vitek Vanecek was not sharp in his first start since Game 2 of the opening-round series.",
        "Defenseman Ryan Graves, who missed Game 3 with an upper-body injury, practiced Monday. Ruff usually does not make lineup changes after a win so expect him to dress Smith as his seventh defenseman.Carolina goaltender Antti Raanta was back on the ice Monday. He did not dress for the past two games because of an illness. The Finn started the first five games in the series against the Islanders. Frederik Andersen started the first three games of this series, giving up four goals on 12 shots in Game 3.STARS at KRAKEN, Seattle leads 2-1 (9:30 p.m. EDT, ESPN)This all feels familiar for Dallas, which gives the Stars some comfort after Game 3. In the opening round series against Minnesota, the Stars split the first two games at home, were routed in Game 3 on the road. They won the next three to oust the Wild.\"We went through this in the Minnesota series. We didn´t panic and overreact, and we worked our way through it,\" Dallas coach Pete DeBoer said Monday. \"And I´m confident we can do the same thing again.\"The biggest question for Dallas is the status of standout defenseman Miro Heiskanen. He was hit in the face with a puck that led to Seattle´s first goal in Game 3. Heiskanen had a bloodied left cheek and did not return.",
        "DeBoer said Monday that Heiskanen has a bad cut but no concerns about a concussion. His status for Game 4 will be decided Tuesday.The Stars are also expecting a better version of Jake Oettinger, who was pulled after two periods and allowed five goals on 17 shots. Oettinger didn´t lose consecutive games in regulation during the regular season.Seattle has an injury concern. Fourth-line forward Daniel Sprong didn´t play in the third period after taking a hit from Jani Hakanpää midway through the second period. Seattle coach Dave Hakstol didn´t have an update on Monday.___AP NHL: https://apnews.com/hub/stanley-cup and https://twitter.com/AP_Sports"
    ]
}