{
    "articleURL": "/wires/pa/article-12054995/Aryna-Sabalenka-gets-revenge-Iga-Swiatek-victory-Madrid-Open-final.html",
    "content": [
        "Aryna Sabalenka turned the tables on Iga Swiatek to win a gripping battle in the final of the Madrid Open.",
        "The world’s two leading female players were meeting in the final for the second event in a row after Swiatek successfully defended her title in Stuttgart.But the top seed had to settle for second best here as Australian Open champion Sabalenka powered to a 6-3 3-6 6-3 victory to claim her third title of the season.Although Swiatek still has a big lead in the rankings, the gap has certainly closed and Sabalenka confirmed her status as the best player in 2023 so far ahead of the French Open later this month.Women’s tennis has been crying out for a rivalry at the top of the game for years and this is shaping up to be a good one, particularly as there appears to be little love lost between the pair.They are contrasting players with very different personalities – Sabalenka bubbly and ultra-aggressive on court, while Swiatek is a self-declared introvert who uses her supreme athleticism to dominate.Sabalenka said: “I’m super happy. It was a great match, super tough battle. I’m just super happy right now with this title.“It was really intense. It’s always tough battles against Iga. She always pushes me to the limits. I really enjoy our battles. Hopefully we can play many more finals this season.",
        "“I definitely respect her a lot. She’s a great player, and what she did last season and what she keeps doing, it really motivates me a lot to improve, to keep working hard, to keep fighting.”Sabalenka said her rivalry was good for the women’s game, adding: “I think women’s tennis needs this kind of consistency to see the world number one and world number two facing (off) in the finals.“It’s more enjoyable for fans to watch and it’s more intense. When people see these kind of finals, it makes them want to see it, you know, like want to see this battle.“That’s something amazing, and hopefully we can keep doing what we are doing this season.”Swiatek felt there was little to separate the two players in Madrid. She said: “Sometimes it was about a few shots that I could play a little bit better. She played some shots in that were risky.“Maybe sometimes I could be more proactive, but honestly, I think we both played good. I don’t have any like big regrets.”Throw Wimbledon and Indian Wells champion Elena Rybakina into the mix, and the WTA can begin to look forward with optimism despite the lack of true household names.Sabalenka was desperate to get revenge over Swiatek and she learned the lessons from Stuttgart with a controlled but relentlessly offensive first set.",
        "The Belarusian looked frustrated after failing to take two break points at 3-2 but did not allow her head to drop and made the breakthrough to lead 5-3 before clinching her first set on clay against Swiatek.The Pole responded impressively by opening up a 3-0 lead in the second set but back came Sabalenka to level with some tremendous power tennis and, had she taken her chance to make it four games in a row, the match might have been over.However, Swiatek dug in and reeled off another three games in a row to level proceedings at the Caja Magica.Both knew how important the start of the decider was and, with the intensity levels increasing still further, Sabalenka produced some of her best tennis of the match to move 3-0 in front.Swiatek rallied again as she looked to maintain her proud record in finals – she had won 14 of her previous 16 – but, having levelled at 3-3, Sabalenka broke once more to lead 5-3 and overcame her nerves to clinch her fourth match point."
    ]
}