{
    "articleURL": "/news/article-12051523/Dylan-Mulvaney-spotted-LA-hotel-sighting-Bud-Light-campaign.html",
    "content": [
        "Mulvaney, 26, was pictured entering a hotel in Los Angeles, California, on ThursdayBosses of Anheuser-Busch claim that the partnership with Mulvaney was 'not a formal campaign or advertisement'Their former chief creative officer branded the decision to work with the trans influencer as a 'calamitous mistake'Transgender influencer Dylan Mulvaney has been spotted for the first time since Bud Light disavowed gifting her a special can, with an LGBT activist saying the brand's latest decision has angered gays as well as conservatives. ",
        "Mulvaney, 26, was seen in a Burberry check outfit she's sported on multiple previous occasions as she arrived at a hotel in West Hollywood, California. She didn't make any comment, with LGBTQ activists now joining right-wingers in boycotting the brand after it disavowed the Mulvaney stunt. Stacey Lentz, who co-owns the famed Stonewall Inn gay bar in NYC, said parent company Anheuser-Busch had 'missed an opportunity to stand by their commitment to the trans community by pandering to and giving into transphobic outcries.'Lentz spoke to the New York Post hours after Anheuser-Busch's CEO Michael Doukaris tried to play down the campaign with Mulvaney.He told an earnings call: 'We need to clarify the facts that this was one can, one influencer, one post and not a campaign.' The drama began on April 1 when Bud Light presented Mulvaney with a commemorative can showing her face to mark her '365 days of being a girl.'",
        "Mulvaney announced her plans to transition last year, and underwent grueling facial feminization surgery in December 2022. The gruesome operation sees bones sliced out of a patient's face and sanded down in a bid to soften male features. But the Bud Light stunt sparked a furious response from conservatives, who accused the brand of meddling in one of the most hot-button culture war issues there is.   ",
        "Stacy Lentz, co-owner of the Stonewall Inn, a LGBT bar in New York City, told Newsweek that the brewery had 'missed an opportunity to stand by their commitment to the trans community'She said: ' As far as marketing, I hope and think they realized that as a brand they will be extinct in a few years if they are not fully on the side of equality, as that is what the Gen Z consumer expects and demands.Lentz expressed sympathy for Mulvaney ‘as this whole thing was not handled well and she was caught in the middle of a horrible fire storm.’In-store sales of Bud Light dropped by 26 percent as a result, according to the latest figures, sparking fears the ongoing boycott could do lasting damage. Investors were also told by Doukeris that Bud Light will triple its marketing spend this summer in a bid to woo customers back to the tarnished brand.Doukeris' comments came as a letter was sent to retailers, bars and restaurants by Grey Eagle – which distributes Anheuser-Busch products around St Louis, Missouri.It read: 'Anheuser-Busch did not intend to create controversy or make a political statement.'In reality, the Bud Light can posted by a social media influencer that sparked all the conversation was provided by an outside agency without Anheuser-Busch management awareness or approval.",
        "'Since that time, the lack of oversight and control over marketing decisions has been addressed and a new VP of Bud Light marketing has been announced.'",
        "It comes after Coors Light and Miller Lite both saw bumps in sales while the Anheuser-Busch-owned brewer saw them plunge.In the week after the campaign launched, April 1, Bud Light dollar sales dipped 6 percent, as Coors Light rose 3.5 percent and Miller Lite 3.1 percent.As the backlash ramped up against Anheuser-Busch, with Kid Rock opening fire on several cases of the beer, their sales dropped 17 percent in the week of April 18.By comparison, Coors Light saw sales rise by 10.6 percent, while Miller Lite scooped up even more profit with sales rising 11.5 percent.Last week sales of Bud Light had risen slightly, with the company seeing just a 6.7 percent dip in sales, with both their rivals seeing a huge increase of 18 percent.Several famous faces slammed the brand for their decision after pro-Trump Kid Rock shot the cans and commented: 'F*** Bud Light, and f*** Anheuser-Busch. Have a terrific day.'",
        "John Rich also publicly denounced the brand, saying he would be removing it from his bar in Nashville.Mulvaney has hit back at her critics over the Bud Light deal, telling Rosie O'Donnell on her podcast: 'The reason that I think I am so…I'm an easy target is because I'm so new to this.",
        "'I think going after a trans woman that's been doing this for like 20 years is a lot more difficult. I think maybe they think that there's some sort of chance with me … But what is their goal?'These people, they don't understand me, and anything that I do or say then somehow gets taken out of context and is used against me, and it's so sad because everything I try to put out is positive.'It's trying to connect with others that maybe don't understand me. It's to make people laugh or to make a kid feel seen.'In the turmoil that ensued after the announcement of the collaboration, Anheuser-Busch issued a statement saying it supported the brand's decision to work with Mulvaney.Bud Light has long been supportive of pride events and even launched LGBT rainbow themed cans and bottles last year in partnership with the National LGBT Chamber of Commerce.",
        "Following the outrage, Anheuser-Busch released a patriotic advertisement for Budweiser featuring its iconic Clydesdale horses, in an apparent attempt to reset following the controversy. The one-minute spot features shots of the iconic Clydesdales galloping across the country, in open fields, and past landmarks including the Lincoln Memorial and the New York City skyline.However, online users slammed the ad as a pathetic attempt to right the ship that was permanently sent in the wrong direction with the Mulvaney partnership."
    ]
}