{
    "articleURL": "/wires/reuters/article-12060561/US-STOCKS-Wall-Street-subdued-bleak-earnings-ahead-inflation-data.html",
    "content": [
        "Gains in shares of regional lenders prove short-lived",
        "April CPI data awaited on WednesdayIndexes: Dow down 0.2%, S&amp;amp;P flat and Nasdaq flatBy Shreyashi Sanyal, Shristi Achar A and Carolina MandlMay 8 (Reuters) - U.S. stock indexes struggled for direction on Monday amid disappointing earnings from Tyson Foods and Catalent, a weak rebound in regional banks, and a shift in focus to a key inflation reading later this week.Shares of Catalent Inc tumbled 25.5% as the contract drug manufacturer saw lower revenue and core profit in 2023, while Tyson Foods dropped 15.9% on a surprise second-quarter loss and a cut in its annual revenue forecast.A rebound in regional lenders ran out of steam by midday trading, with the KBW Regional Banking index falling 1.86% after posting its best single-day performance in seven weeks on Friday.The struggle for a clearer direction comes after a rally on Friday, when U.S. jobs data pointed to a resilient labor market.\"Whenever you have a big up day, people need more good news to keep the market up every day in a row,\" said portfolio manager Moez Kassam of Anson Funds.Also weighing on the main indexes was a 1.1% decline in shares of Microsoft Corp, while Apple Inc was flat after rising 4.7% on Friday when it posted upbeat results.",
        "The spotlight this week, however, will be on the Labor Department's inflation reading on Wednesday, which is expected to show the consumer price index (CPI) likely climbed 0.4% in April after gaining 0.1% in March. Producer prices, weekly jobless claims and consumer sentiment data are all lined up for the week.Data points this week will help investors not only gauge whether the Federal Reserve's aggressive tightening cycle - including its most recent 25 basis point hike last week - is working towards tamping down inflation but also if fears of stagflation are founded.\"The bigger picture is inflation will remain higher for longer and that we are heading into a recession,\" Michael James, managing director of equity trading at Wedbush Securities.\"Whether that's hard or soft remains to be seen, but until there's something to disprove that bigger picture thesis, the overall market is going to remain somewhat range bound.\"The Dow Jones Industrial Average fell 68.99 points, or 0.2%, to 33,605.39, the S&amp;amp;P 500 gained 0.93 points, or 0.02%, to 4,137.18 and the Nasdaq Composite added 10.28 points, or 0.08%, to 12,245.69.A rally in regional banks' shares proved short-lived, with PacWest Bancorp rising 5.6% after gaining as much as about 30% earlier in the session after the lender sharply cut its quarterly dividend to boost capital.",
        "Shares of regional banks tumbled for much of last week on worries tied to the collapse of First Republic Bank.Warren Buffett's Berkshire Hathaway Inc's Class B shares rose 0.9% after posting a $35.5 billion first-quarter profit, boosted by gains from stocks such as Apple.American Airlines Group Inc rose 3.1% after J.P. Morgan raised its rating to \"overweight\" from \"neutral\".Shares of Zscaler Inc rose 3.5% after the cloud security company raised its annual forecast.Declining issues outnumbered advancing ones on the NYSE by a 1.10-to-1 ratio; on Nasdaq, a 1.13-to-1 ratio favored decliners.The S&amp;amp;P 500 posted 11 new 52-week highs and seven new lows; the Nasdaq Composite recorded 54 new highs and 73 new lows.(Reporting by Shreyashi Sanyal and Shristi Achar in Bengaluru; Editing by Nivedita Bhattacharjee, Maju Samuel and Deepa Babington)"
    ]
}