{
    "articleURL": "/wires/pa/article-12060493/Title-winning-Vincent-Kompany-relishing-shot-big-time-Burnley.html",
    "content": [
        "Vincent Kompany ended Burnley’s title-winning season with a 3-0 home victory over Cardiff and revealed why he chose to sign a new five-year contract at the Premier League-bound club.",
        "The former Manchester City captain led the post-match celebrations and Championship trophy presentation having steered his club back to the top flight – where he intends to have “a bit of fun”.It marked a remarkable first season in English management for the Belgian who was appointed following the Clarets’ relegation 12 months ago.The final-day win came 24 hours after the highly-rated 37-year-old signed a new five-year contract that could keep him in charge at Turf Moor until 2028.Kompany’s efforts have attracted the interest of potential suitors, with Chelsea the latest to be linked with interest in him.“I still had three or four years left and it’s not something I went chasing but there is a pragmatic reason for signing the new deal,” said Kompany.“For my pathway, this is the right decision, but it helps when we try and recruit players.“When I’m trying to convince a player to come here it’s easier just after I have signed a new deal.“We have had a massive advantage planning for next season, because we have known about promotion of a long time.“But we were going to lose that if people were waiting for me to come out with a statement.”On a day of rain-soaked celebrations at Turf Moor, former NFL legend JJ Watt, who this week became a minority owner in the club, carried the Championship trophy onto the field for its presentation to Kompany and his players.",
        "The win saw Burnley hit the century mark in points, their 101 the highest recorded by any team in the division since Leicester won the league with one more, in 2014.And it summed up a dominant campaign for a Burnley team who lost just one of their final 26 games and were beaten only three times over the entire league campaign, winning promotion with seven games to spare.",
        "“We faced doubt at the beginning of this season and it will be the same next season,” said Kompany.“It’s for us to use that to rally around. It starts now. The goal for me next year is to make our fans proud and have a bit of fun in the Premier League.”The final-day win was also a fitting send-off for veteran striker Ashley Barnes, after nearly a decade at Turf Moor.He struck after 31 minutes when Josh Brownhill’s cross was met by Cardiff defender Mahlon Romeo who simply chested the ball into the path of Barnes to bury an excellent first-time finish.The visitors, who ended the season five points above the relegation zone, also contributed to Burnley’s opening goal, four minutes earlier.Defender Andy Rinomhota kept the ball in play, as he tried to dispossess Anass Zaroury, by pushing it into his area with his hands.",
        "That enabled Zaroury to cross the ball for Brownhill to score from close range, despite Cardiff protests.Scott Twine wrapped up the scoring on 58 minutes when he lodged a superbly-hit right-foot free-kick from the edge of the box into the Cardiff net.Cardiff manager Sabri Lamouchi is set to meet club owner Vincent Tan to thrash out his and the club’s future direction.“We saw the big gap between them and us,” he said. “It’s about small details; experience, quality. Everything is on the table and we just need to know what the club and the owner want to do.”"
    ]
}