{
    "articleURL": "/news/article-12048641/One-17-homeless-people-California-jobs-fast-food-industry.html",
    "content": [
        "There are over 10,000 homeless people working in California's fast food industry, according to a new studyLow wages and a struggle to secure full time hours mean that many have to choose between eating and paying rent In 2024, Californians will go to the ballot box to vote on a new minimum wage vote that if passed will increase hourly wages from $15.50 to $22.00  There are over 10,000 homeless people in California currently working in the fast food industry, a new economic study says. ",
        "The study, conducted by Economic Roundtable, found that in Los Angeles County alone, there are 3,595 unhoused working for fast food restaurants. The co-author of the study and president of Economic Roundtable Daniel Flaming said that although many unhoused working in an industry that highly profitable, low wages and a lack of full-time positions mean that many employees cannot work their way out of poverty. Flaming estimated that 11 percent of homeless workers in California. His organization used census data to complete the study. A separate study conducted by UCLA in 2020 found that 18 percent of people in Los Angeles' homeless services system were working. The minimum wage for workers in California is $15.50 per hour, in the city of Los Angeles, it's $16.04 per hour. The state now has nearly a third of all homeless people in the United States.",
        "The recent study found that the average homeless person worker in fast food, performing roles such as line cook and cashier, made around $15,000 per annum. Most only work 26 hours per week, 1,300 per year, and struggle to find full-time hours. Those tight economic restrictions mean that many struggle to pay their rent or housing payments. 'Emergencies come up. You have to fix the car that you drive to work to get your income. And that costs you a bunch of money. These are very fragile solutions and they break down easily,' Flaming told LAist. ",
        "'My hours has been cut. I'm only making minimum wage. I'm also getting wage theft, at that. I had got a new promotion, but didn't get paid for the promotion... I feel somewhat ashamed that I work for a company that can't even pay me what I'm owed,' fast food worker and mother-of-six Anneisha Williams told ABC Los Angeles. In California, nearly 80 percent of fast food workers are people of color, more than 60 percent are Latino and two-thirds are women.  Legislation signed in September in the Golden State would have set the state on a path to raise wages for fast-food workers to $22 per hour. The law was met with heavy opposition from restaurant industry groups who led a successful effort to force it into a referendum in 2024. ",
        "The referendum raised more than 623,000 valid voter signatures to be placed on the November 5, 2024, election ballot. The first-in-the-nation law, passed last year, establishes a 10-member council empowered to set minimum wages as well as standards for hours and working conditions for California's fast food workers. It would affect some 550,000 workers statewide.Two industry groups, the International Franchise Association and the National Restaurant Association, promoted the referendum that would leave its fate to voters.Opponents, who raised more than $10 million last year to fund the referendum campaign, argue that the law would burden owners of chain restaurant franchises and drive up the cost of food.",
        "On December 30, a Sacramento County Superior Court judge temporarily blocked the state from implementing the law while ballot signatures were counted and verified.The measure would have raised employee wages to as much as $22 an hour by the end of this year for chains such as McDonald's and Starbucks that have 100 or more outlets nationwide.Labor groups supported the law and the referendum fight could be a bitter and costly one that could see both sides spending hundreds of millions of dollars to entice voters.The Service Employees International Union remained confident that the law will survive the election.'Despite fast food corporations' efforts to distort the referendum process, we know California voters see through their tricks,' SEIU President Mary Kay Henderson said in a statement. 'No corporation is more powerful than half a million workers joining together to demand a seat at the table.'Meanwhile the state of California continues to battle its homeless problem. Last year, Governor Gavin Newsom, a Democrat with potential presidential aspirations, briefly withheld $1 billion in funding from local governments because he was unhappy with their plans to reduce homelessness. In March, the state sued the city of Huntington Beach and accused its leaders of ignoring state housing laws requiring them to build 13,000 new homes over the next eight years. ",
        "The same month, Newsom announced California will spend about $30 million to build 1,200 small homes across the state this year. The homes, some as small as 120 square feet, can be assembled in 90 minutes and cost a fraction of what it takes to build permanent housing. Newsom said the homes can create space to help clear homeless encampments that have sprung up across the state's major cities. Federal courts have ruled cities can't clear homeless encampments if there are no shelter beds available.'We need to focus more energy and precision on addressing encampments,' Newsom said. 'There's no humanity there. People are dying on our watch.'"
    ]
}