{
    "articleURL": "/news/article-12054407/Social-media-praises-Princess-Royal-acted-Kings-personal-bodyguard-Coronation.html",
    "content": [
        "Follow our live blog for all the latest updates on the King's CoronationPrincess Anne held role of Gold Stick-in-Waiting to her brother after CoronationShe earned praise riding on horseback leading security behind Gold State CoachPrincess Anne earned plaudits from fans around the world as she took on a starring role at her brother's Coronation as his bodyguard.",
        "The Princess Royal attended the historic ceremony at Westminster Abbey, accompanied by her husband Sir Tim Laurence. Dressed in full regalia as Colonel of the Blues and Royals, beneath a green velvet robe, the princess upheld the gravitas of the royal occasion.But once the King and Queen were anointed and crowned, the 72-year-old dispensed with her ceremonial robe and got on horseback, in what many said was her finest moment to date.The King's sister rode immediately behind the Gold State Coach, holding the prestigious role of 'Gold Stick-in-Waiting' - leading her brother's security escort until he arrived at Buckingham Palace.And Twitter soon exploded with admiration for the expert horsewoman, who was 'slaying it' according to royal watchers.",
        "Jess Cartner-Morley tweeted: 'Has Princess Anne been the cool one all along? She is actually pulling this look off.'",
        "Lee Hood wrote: 'The Princess Royal looks absolutely amazing today she is a rock in the Royal Family, we love you Anne.'Another person wrote: 'Princess Anne, ready to defeat Napoleon should the need arise.'A fellow fan added: 'OMG Princess Anne!!! Totally Boss Princess!!!'Princess Anne was said to have been 'incredibly honoured' when the King told her he wanted her to carry out the role of Gold Stick-in-Waiting at his Coronation, The Mirror reports.",
        "A source said: 'The direction of the King’s decision is clear for all to see.'He is rewarding the Princess Royal for her loyalty and her unwavering devotion to duty above all else.'The King values his sister as a trusted lieutenant and this is the perfect example of such a relationship.'The Princess Royal wore her Blues and Royals uniform with the dark green Thistle Mantle, and the Thistle Collar, Garter Sash, Garter Star, Thistle Star, GCVO Star, full sized medals, KCVO Star and Companion of the Order of the Bath neck decoration.The Thistle cloak is made from deep green silk velvet with a lining of white taffeta, and features a hand embroidered gold badge and garter blue velvet hood.After the ceremony, the Gold State Coach carrying the King and Queen was in the middle of a household procession of Household Cavalry troopers from the Blues and Royals and Life Guards on horseback. Historically, household troops guarded the sovereign and they performed the role once again today. They were joined by 18 representatives of countries where Charles is King, who flanked the carriage.Upon arriving at Buckingham Palace, the Princess Royal led a royal salute from members of the Household Cavalry",
        "The King and Queen were then joined by working members of the royal family, plus their pages of honour and the Queen's ladies in attendance on the balcony of Buckingham Palace.",
        "The newly crowned couple, who emerged to cheers from tens of thousands of onlookers below, were joined by Charles's heir, Prince William, his wife Catherine, and their three children.Charles's youngest brother, Prince Edward, his wife Sophie, and their two children were also there. His only sister, Princess Anne, also made an appearance.However, the king's younger son Prince Harry and eldest brother Prince Andrew, were notable absentees from the line-up, with the balcony appearances restricted to working royals only.Harry and his American wife Meghan quit royal duties in 2020 and have since unleashed a string of barbed attacks on the monarchy.",
        "Andrew, the king's other brother, has been frozen out over his past association with the disgraced late US financier Jeffrey Epstein and a related sexual abuse allegation which was settled out of court.Those present were treated to a ceremonial fly-past of military aircraft, which had to be pared back due to the wet weather.It featured an assortment of Royal Air Force helicopters, followed by its Red Arrows display team trailing red, white and blue smoke over the palace and central London.After the display had ended and the royals departed the balcony, they reappeared for a briefer second appearance, again to cheers from the crowds.The King and his wife were crowned in a Christian ceremony that dates back 1,000 years on a day dripping with glorious displays of pageantry. The historic two hour service was marked by several poignant moments including Prince William kissing his father with his estranged brother Harry yards away.",
        "The 2,300-strong congregation bowed as the monarch, the 62nd in history, and his wife processed out of the Abbey. Charles and Camilla both smiled as they left and then entered the Gold State Coach, drawn by horses to take them past 2million in the streets and 7,000 servicemen and women marching through the capital with them.Princess Anne followed their carriage on horseback with senior royals following in other state carriages. A smiling Prince Harry left in a luxury car, as did a much more sombre Prince Andrew.  Amid rumours Harry planned to be in and out of Britain in 24 hours, his car was seen leaving London, not going to Buckingham Palace.Queen Elizabeth II's eldest son was crowned King having prayed to be a 'blessing' to people of 'every faith and conviction', and serve his millions of subjects in Britain and around the globe.Charles became the 40th reigning sovereign to be crowned at Westminster Abbey, in a ceremony dating back to William the Conqueror in 1066, when Archbishop of Canterbury Justin Welby placed St Edward's Crown on his head. ",
        "The King then looked emotional as Prince William paid homage to him, in a break with tradition, kneeling to give an oath of allegiance to his father. He said: 'I, William, Prince of Wales, pledge my loyalty to you and faith and truth I will bear unto you, as your liege man of life and limb. So help me God.' He then stood, touched the crown and kissed the King on the cheek. Charles was moved as he nodded to his son, and said 'amen' and 'thank you William'.",
        "The historic crowning, watched around the globe, was a fulfilment of the King's destiny, but followed the death of his mother, Queen Elizabeth II, last September after a 70-year reign. Minutes later Camilla was crowned. As Andrew Lloyd-Webber's coronation anthem was sung, the Queen was officially enthroned. The enthroning of the Queen was a moment in which Charles and Camilla were 'united in their joint vocation before God'.The monarch and his wife Queen Camilla had smiled at each other and to the congregation as they walked through the church.Mr Welby placed Queen Mary's Crown on the Queen's head and said: 'May thy servant Camilla, who wears this crown, be filled by thine abundant grace and with all princely virtues; reign in her heart, O King of love, that, being certain of thy protection, she may be crowned with thy gracious favour, through Jesus Christ our Lord. Amen.'"
    ]
}