{
    "articleURL": "/news/article-12059459/Fears-E-patients-999-workers-South-East-strike-TOMORROW.html",
    "content": [
        "Department of Health and Social Care: Strike will put 'more pressure' on the NHSAmbulance workers in the South East will strike tomorrow sparking fears for A&amp;E patients as Unite escalates its industrial action in a long-running dispute over pay.",
        "It comes after the trade union rejected a five per cent pay deal and offer of a lump sum cash payment to NHS staff in England last month, with Unite general secretary Sharon Graham saying it 'would not cut it'.She said the latest strike action was 'part of Unite's escalation strategy to exert greater pressure on the Government.'A Department of Health and Social Care spokesman said the action would put 'more pressure' on the NHS, and advised patients to still call 999 in life-threatening emergencies.Unite's members employed at South Central Ambulance Service NHS Trust and South East Coast Ambulance Service NHS Trust will strike from 12pm until 10pm. ",
        "The renewed strike action is part of Unite's strategy to increase the pressure on the government to re-open the negotiations to ensure that NHS workers get a fair pay increase.The union is in the process of undertaking a series of industrial action ballots to expand the number of workers able to take industrial action and exert further pressure. ",
        "Tomorrow's strike will see picket lines in Portsmouth, Hampshire and Northfleet, Kent. It comes after the Union, and those in the Royal College of Nursing employed in the NHS in England, rejected the Government's pay deal, which members of most other health unions accepted. ",
        "Unite general secretary Sharon Graham said: 'The Government must reopen negotiations to ensure that a proper wage offer is made to NHS workers.'We have always said that a non-consolidated lump sum for 22/23 would not cut it. So it has turned out.'The current offer does nothing to resolve the recruitment and retention crisis crippling the NHS.'The strike action by our South East ambulance workers is part of Unite's escalation strategy to exert greater pressure on the Government.'The Department of Health and Social care said in a statement: 'It is disappointing some Unite members are continuing strike action this week – these strikes will put more pressure on the NHS and will be disruptive for patients.'Most unions on the NHS Staff Council voted to accept our pay offer and we hope the unions who choose to remain in dispute – despite many of their members also voting to accept this offer – will recognise this as a fair outcome that carries the support of their colleagues and decide it is time to bring industrial action to an end.'People should attend appointments unless told otherwise by the NHS, continue to call 999 in a life-threatening emergency and use NHS 111 online services for non-urgent health needs.'They are working with NHS England to put in place contingency plans to protect patient safety. ",
        "Last month, 14 health unions on the NHS Staff Council told ministers they will collectively accept the government's offer as a majority of their members voted in favour.But representatives failed to reach a unanimous decision, with the Royal College of Nursing and Unite among those who are unhappy with the settlement. Both have threatened further walkouts in pursuit of a better deal — claiming a five per cent rise for this year and one-off bonus of up to £3,789 for last year is not enough.However, despite these objections, all one million NHS staff on the Agenda for Change contract, including nurses, paramedics and physiotherapists, will now receive the boost.More than half a million operations and appointments have been cancelled as a result of crippling industrial action since December, with health leaders warning it has put patients at risk.",
        "Doctors, dentists and senior managers are on different NHS contracts and junior medics remain in dispute with the government as they pursue a 35 per cent pay rise.Health Secretary Steve Barclay said he was 'pleased' that the NHS Staff Council has voted to accept the pay offer, calling it a 'fair and reasonable deal'.Meanwhile, the British Medical Association (BMA) Scotland has asked for a 23.5 per cent increase on top of inflation - taking the total rise to around 35 per cent.",
        "Scotland's Health Secretary Michael Matheson said pay demands from junior doctors were 'simply unaffordable'.Michael Matheson told BBC Scotland's The Sunday Show programme that a pay rise of that scale would result in significant cuts to the NHS budget.But he pledged to do 'everything I can' to avert the possibility of strike action after junior doctors in Scotland voted in favour of their first national walkout over pay.Some 71 per cent of the eligible 5,000 junior doctors voted in the ballot, with 97% backing the walkout, the union said on Friday.It could see junior doctors begin preparations for a 72-hour walkout, with dates to be confirmed, if a 'credible' offer is not submitted.A previous increase of 4.5 per cent has been rejected by BMA Scotland."
    ]
}