{
    "articleURL": "/wires/reuters/article-12051379/Top-four-finish-not-Liverpools-hands-says-Klopp.html",
    "content": [
        "May 5 (Reuters) - A resurgence in form is unlikely to help Liverpool qualify for next season's Champions League as fourth-placed Manchester United are unlikely to slip up on the home stretch, manager Juergen Klopp said on Friday.",
        "Liverpool are on a five-match winning streak that lifted them up to fifth in the Premier League, four points behind United who have a game in hand, but Klopp does not expect their rivals to drop points.\"Other teams are in much better positions, as long as they win games we have no chance,\" Klopp told reporters ahead of Saturday's clash against ninth-placed Brentford.\"We have to keep teams behind us. We have 59 points and United has 63, so we can get 71 maximum (at the end of the season). United needs eight points in five, from 15 (and) I think they will do that.\"We have enough to do with ourselves. Tomorrow, Brentford is a difficult game to play. We can control the whole game theoretically and one set piece can kill you.\"However, Klopp said they will squeeze everything out from the remainder of the season.\"If our performances put pressure on other teams that is not in our hands. The way they played over this season, the top four teams, no one looks like losing more games than they win, Klopp said.\"For us the plan is finishing as high as we can, now that means fifth but that is not given. Sixth is not given. Aston Villa, Tottenham (Hotspur), Brentford are all fighting for that and so are we.\"",
        "James Milner is expected to leave Liverpool after eight years at the end of the season and Klopp described how highly he valued the 37-year-old midfielder.\"He is an incredible part of this team and I would have loved to work together with him even longer,\" Klopp said.\"Nothing will change. Nothing in the last seven-and-a-half years, the positive things, would have happened without James Milner.\"Klopp said Diogo Jota and captain Jordan Henderson will be assessed ahead of the match while Roberto Firmino remains sidelined.The German added that midfielder Thiago Alcantara is expected to be fit for pre-season after his hip surgery. (Reporting by Pearl Josephine Nazare in Bengaluru;)"
    ]
}