{
    "articleURL": "/wires/reuters/article-12049393/Vietnam-boosts-rare-earths-output-tenfold--data.html",
    "content": [
        "By Francesco Guarascio and Khanh Vu",
        "HANOI, May 5 (Reuters) - Vietnam's mined output of rare earths soared tenfold last year, U.S. data showed, as global firms have flocked to the Southeast Asian country with the world's second largest estimated deposits to reduce reliance on China for the key industrial metals.Past attempts to build up Vietnam's rare earth industry have stuttered due to falling prices and regulatory hurdles, but growing sales of electric vehicles (EVs) and firms' efforts to diversify their suppliers has revived interest in Vietnam.Australian Strategic Materials Ltd (ASM) said on Monday that it would buy 100 tonnes of rare earth oxides this year from Vietnam Rare Earth Co and is looking for a longer term supply agreement.ASM said a longer-term agreement with the Vietnamese firm would provide it with a multi-source feedstock option and additional supply security for its processing plant in South Korea.Rare earths are a group of elements that have applications in electronics manufacturing and batteries, making them important for the global transition towards cleaner sources of energy and in defence.Vietnam's rare earth mine production jumped to 4,300 tonnes last year from 400 tonnes in 2021, according to the United States Geological Survey (USGS), a government agency.Its output is a tiny fraction of the amount top producers mined last year. China, the world's biggest producer, mined 210,000 tonnes in 2022, the United States 43,000 tonnes and Australia 18,000 tonnes.",
        "But Vietnam's estimated reserves of 22 million tonnes are half of China's and larger than any other country, according to USGS. Its output growth last year, which turned it into the world's sixth biggest producer up from 10th in 2021, may signal a turning point in the exploitation of its resources.It was also the only major Southeast Asian producer to boost output last year, with its larger regional competitors Myanmar and Thailand reporting lower production, USGS data showed.The main beneficiary of the increased production in Vietnam appears to be China, the world's largest auto and EV market and also a major global manufacturing hub for electronic goods such as smartphones.China's customs data show a doubling of imports from Vietnam of rare earth elements (REEs) and other concentrates that usually contain the strategic metals to nearly 12,000 tonnes last year.What quantity of the imports were processed rare earths and unprocessed ores was unclear.Vietnam also imports rare earths for processing and re-exporting.Vietnam's \"REE-processing infrastructure is rather advanced, and does process not only domestic REE-resources,\" Per Kalvig, a researcher at Denmark's Center for Minerals and Materials (MiMa), said.He said Vietnam was one of the world's biggest importers of raw rare earths compounds in 2021.Vietnam's industry ministry and Vietnam Rare Earth did not reply to requests for comment. (Reporting by Francesco Guarascio @fraguarascio; additional reporting by Khanh Vu, Melanie Burton and Dominique Patton; Editing by Miyoung Kim &amp;amp; Simon Cameron-Moore)"
    ]
}