{
    "articleURL": "/tvshowbiz/article-12046861/Sheridan-Smith-shares-sweet-snaps-pays-tribute-son-Billy-birthday.html",
    "content": [
        "Sheridan Smith shared a series of adorable snaps and gushed over her son Billy as she celebrated his third birthday on Wednesday.",
        "The Cilla and Funny Girl actress, 41, took to Instagram to mark her son's  big day with a touching tribute, telling fans he had 'changed her life'.She also shared a sweet selection of snaps, including throwback photos from when he was only weeks old, and more recently at his lavish Grand Prix-themed birthday party.Alongside the photos, she wrote: '3 years ago today, this little angel changed my life. 'Happy 3rd birthday Billy! You’re my world! 3/5/2020❤️'",
        "In one picture, the star can be seen gazing adoringly at her son as he sings into a microphone - proving that he's just like his famous mother. Sheridan looked radiant in the snap, opting for a white jumper, black trousers and stylish white sunglasses.In another picture taken only days after his birth, Sheridan cuddles up to Billy on the couch after breast-feeding him.This time, the star appears make-up free with her locks tied up into a bun.A beaming Billy also grins from ear-to-ear as he sits down to open his birthday presents. The actress - who is currently starring in the successful West End production of Shirley Valentine - welcomed her son in May 2020, with ex-fiancé Jamie Horn.She announced her split from Jamie in July 2021 after nearly three years together.",
        "And on Sunday, Sheridan shared a glimpse inside her son Billy's epic third birthday celebrations - complete with a winner's podium, ball pits and racing themed chocolates.",
        "Sheridan spared no expense as she decked out her venue in Kent with the help of friends in a perfect Grand Prix-style party.She took to her Instagram to share the lavish set-up, complete with themed balloons, ball pits, slides and inflatables.The actress  crafted an epic experience to celebrate little Billy who just turned three.Sheridan did not leave anything to chance as she displayed racing themed party props in the colours of red, black and white, giving her son a true Grand Prix experience.The lavish birthday celebration even included paper plates in theme with the colours, along with special chocolate lollypops with racing cars on theme and bottles of mineral water.The TV personality shared a sweet picture as she and Billy stood on a place mat with a themed banner behind them saying Billy's Grand Three.The snap captured Sheridan hugging little Billy as they both showed off big smiles.The pit featured also a multitude of balloons in themed colours red, white and black.Sheridan excitedly penned alongside the post: 'Thank you @kids_party_finder for making the best day ever for my boy! What a 3rd birthday! xxxx billy is still buzzing xx.'",
        "Grazing plates and sweet delights were enjoyed by everyone present - as Sheridan enlisted the help of some local businesses to make the epic birthday happen.Finally, Billy was blessed with not one but two themed racing cakes as he donned a cute red racing driver outfit - perfectly embracing his role.Everyone seemed to enjoy the lavish celebration as Billy blew out candles to a chorus of happy birthday from his friends.Adults appeared to be enjoying the party just as much as kids, as Sheridan was captured in high spirits while partying with some friends. ",
        "Kids' Party Finder - the organisation who cured the Grand Prix set up - shared a clip with Sheridan as one of the party organisers said: 'So how did that go?'Sheridan answered excited: 'Amazing. The best party planner... in the world!' The party organiser penned alongside story: 'And with that, Billy's party is done. Thank you for trusting us to bring it all together @sheridansmithster'The actress was quick to repost the video on her story as she gratefully wrote: 'Thank you! You are a genius!'Sheridan reposted more snaps on her Instagram stories as friends complimented her for the party and wished little Billy a wonderful birthday.The Royle Family star also shared a sweet clip from the Kids Party Finder's account capturing the moment when they all singed happy birthday to Billy.",
        "'Happy birthday my boy!', wrote Sheridan."
    ]
}