{
    "articleURL": "/sport/football/article-12046315/Mauricio-Pochettino-offer-Romelu-Lukaku-Chelsea-lifeline-summer.html",
    "content": [
        "The Belgian striker is unlikely to stay at Inter Milan after an inconsistent seasonPochettino's proposed plans would seek to bring out the best in the 29-year-oldChelsea would be unable to command a large sum for the out-of-form player Mauricio Pochettino is set to offer out-of-favour Chelsea loanee Romelu Lukaku a lifeline should he get the nod for the top spot at Stamford Bridge, according to reports. ",
        "The Argentine manager is prepared to share ideas for his project with the striker, who is currently on loan at Inter Milan after a disastrous return to west London in 2021. Chelsea are in desperate need of a goalscoring centre-forward having recorded one of the weakest hauls in the Premier League this season. With only 31 goals to their name, Blues have scored four fewer than the solo efforts of Erling Haaland in the top-flight. The promise of an in-form Lukaku could prove be too good a prospect for the club to pass up, and as per Gazzeta dello Sport, manager-in-waiting Pochettino is keen to see if he can inspire the inconsistent targetman. ",
        "If Pochettino takes the reins at Chelsea, the manager will reportedly present his plan to the player and allow him some time to decide whether he would like to be involved in the club's top-four fightback next season.  Lukaku has struggled to find form upon his return to Inter, a year after his £95.5million move back to Chelsea and has battled with injury for large chunks of the season. But as Inter's prospects have sharpened as the season draws to a close – with Champions League and Coppa Italia titles still in play as well as a fight for a top-four place – the No 90 has found firmer footing, scoring four and assisting four more goals in his last eight appearances. ",
        "The player is said to be unwilling to leave the Nerazzurri due to his preference for life in Milan, but the former Tottenham manager may yet be able to tempt him back to the capital with his plans for relaunching his career at Stamford Bridge. Much of Lukaku's desire to push for a loan move back to Italy at the end of last season stemmed from his dysfunctional relationship with former manager Thomas Tuchel. ",
        "The Bayern Munich coach's relationship with the player was likely irretrievably broken by Lukaku's explosive Sky Sport Italia interview which hinted at his 'unhappiness' at Chelsea working under Tuchel and led to him being dropped from matchday squad as the Blues faced Liverpool in the aftermath. Althought Lukaku later returned to the fore he failed to rediscover the form that had spurred Inter to a Scudetto the previous season and contributed to his club-record price tag. Chelsea's club hierarchy will hope that Pochettino – should he take up the challenge on Fulham Road – is capable of working the striker into his plans, not just to fill a gaping void in their current squad, but as the Blues would receive nowhere near his transfer fee of two summers ago should he be placed on the market. Inter are said to be unwilling to make a move for their loan player despite his wish to stay at the San Siro. "
    ]
}