{
    "articleURL": "/wires/ap/article-12047413/Takeaways-AP-report-Guyanas-nascent-oil-boom.html",
    "content": [
        "ANN'S GROVE, Guyana (AP) - Guyana is poised to become the fourth-largest offshore oil producer in the world, placing it ahead of Qatar, the United States, Mexico and Norway.",
        "But the list of needs is long in this South American country of 791,000 people. Many worry their lives won´t change even as the oil boom will generate billions of dollars for this largely impoverished nation. Bitter fights also are certain over how the wealth should be spent in a place where politics is sharply divided along ethnic lines.Here are the key takeaways:HAS THE COUNTRY SEEN ANY CHANGES AS A RESULT OF THE OIL BOOM?Change is already visible in this country, which has a rich Caribbean culture and was once known as the \"Venice of the West Indies.\" Guyana is crisscrossed by canals and dotted with villages called \"Now or Never\" and \"Free and Easy\" that now co-exist with gated communities with names like \"Windsor Estates.\" In the capital, Georgetown, buildings made of glass, steel and concrete rise above colonial-era wooden structures, with shuttered sash windows, that are slowly decaying. Farmers are planting broccoli and other new crops, restaurants offer better cuts of meat, and the government has hired a European company to produce local sausages as foreign workers transform Guyana´s consumption profile.With $1.6 billion in oil revenue so far, the government has launched infrastructure projects including the construction of 12 hospitals, seven hotels, scores of schools, two main highways, its first deep-water port and a $1.9 billion gas-to-energy project that Vice President Bharrat Jagdeo told The Associated Press will double Guyana´s energy output and slash high power bills by half.",
        "WHEN DID THE OIL DISCOVERY OCCUR, AND HOW MUCH MONEY WILL IT GENERATE?A consortium led by ExxonMobil discovered the first major oil deposits in May 2015 more than 100 miles (190 kilometers) off Guyana, one of the poorest countries in South America despite its large reserves of gold, diamond and bauxite. Production began in December 2019, with some 380,000 barrels a day expected to soar to 1.2 million by 2027.A single oil block of more than a dozen off Guyana´s coast is valued at $41 billion. Combined with additional oil deposits found nearby, that will generate an estimated $10 billion annually for the government, according to USAID. That figure is expected to jump to $157 billion by 2040, said Rystad Energy, a Norwegian-based independent energy consultancy.Guyana now claims one of the world´s largest shares of oil per capita. It´s expected to have one of the world´s fastest-growing economies, too, according to a World Bank report.Despite the oil boom, poverty is deepening for some as the cost of living soars, with goods such as sugar, oranges, cooking oil, peppers and plantains more than doubling in price while salaries have flatlined.Many are still scraping by, like Samuel Arthur, who makes $100 a month selling large, heavy-duty plastic bags in Georgetown and other areas, hauling some 40 pounds of weight every day.",
        "\"All we live on is promises,\" he said of the oil boom.ARE THERE ANY CONCERNS ABOUT THE MASSIVE AMOUNT OF MONEY THE OIL BOOM WILL GENERATE?Experts worry that Guyana lacks the expertise and legal and regulatory framework to handle the influx of wealth. They say it could weaken democratic institutions and lead the country on a path like that of neighboring Venezuela, a petrostate that plunged into political and economic chaos.\"The country isn´t preparing and wasn´t prepared for the sudden discovery of oil,\" said Lucas Perelló, a political science professor at New York´s Skidmore College.Three years after the 2015 oil discovery, a political crisis erupted in Guyana, which is dominated by two main parties: the Indo-Guyanese People´s Progressive Party and the Afro-Guyanese People´s National Congress, which formed a coalition with other parties.That coalition was dissolved after a no-confidence motion approved by a single vote in 2018 gave way to snap general elections in 2020. Those saw the Indo-Guyanese People´s Progressive Party win by one seat in a race that´s still being contested in court.\"That´s why the 2020 elections were so important. Everyone knew what was at stake,\" Perelló said.A USAID report accused the previous administration of a lack of transparency in negotiations and oil deals with investors, adding that the \"tremendous influx of money opens many avenues for corruption.\""
    ]
}