{
    "articleURL": "/wires/pa/article-12047957/RAF-officers-working-clock-perfect-coronation-duties.html",
    "content": [
        "RAF officers have been working around the clock to perfect their part in the King’s coronation this weekend, which will be the largest ceremonial military operation in 70 years.",
        "Saturday’s celebrations will involve more than 9,000 service personnel, more than 6,000 of whom will be on ceremonial duties.",
        "Just under 1,000 members will be representatives of the Royal Air Force, of which King Charles is Commander-in-Chief.RAF personnel have been training at RAF Halton and RAF Northolt since April 27.Along with the ceremonial King’s Colour squadron, regulars and reservists were selected through ballots to join the procession, with a majority coming from units that have a service link to the royal family.",
        "Speaking from RAF Halton in Buckinghamshire, Air Chief Marshal Sir Mike Wigston told the PA news agency: “The ceremony and the procession and the immaculate turn out of our aviators, sailors and soldiers will be something that we will be incredibly proud of.“There are about a thousand people representing the RAF on Saturday, but there are 33,000 more who would give anything to be where they are.”He added: “I feel a huge sense of pride as the head of the service, but every member will be feeling that same sense of pride on Saturday.”",
        "The King and Queen Consort have been described as having a special relationship with the Royal Air Force. Charles began his Armed Services career at RAF Cranwell in Lincolnshire, while Camilla is Honorary Air Commodore of RAF Halton.",
        "“This is an opportunity to show our respect and show our devotion on Saturday as part of this great parade,” Sir Michael said.“Seeing that bond with our sovereign, but also the immaculate turnout, the perfection and the precision, I can’t help but think that it will spark an interest in any young person to consider a military career.”Officer Cadet Benjamin Bellchambers, 24, was due to graduate from his officer training at RAF Cranwell on Thursday, and plans to begin a career as a pilot.",
        "“Thirty of us were chosen to come down from RAF Cranwell, 26 of us are cadets. We’ve been working since we got here on Thursday last week,” he said.“I was definitely tired after the overnight rehearsal on Tuesday, but we’re all pushing through and very excited for the weekend.”Like Officer Cadet Bellchambers, Squadron Leader David Kerrison and Warrant Officer Clare Horler expect that taking part in the King’s coronation procession will be a highlight of their careers — but both joined the RAF more than 30 years ago in 1987, graduating together on the same day.The coronation will be WO Horler’s final day in uniform.“Even the evening practice, the public response was incredible and very uplifting,” she told PA.Squadron Leader Kerrison said that the pride of representing the RAF “at this grand occasion” would be “incredible”.",
        "The march will be led by the Procession Band, which will play a number of arrangements throughout the march.Air Specialist (Class 1) Poppy Ewence has performed as an oboist at a number of high-profile events, including the late Queen’s funeral.“It’s a great privilege to be able to perform at two such monumental ceremonial events in one year,” she said.“My personal favourite piece is Coronation Bells, which has been adapted for the coronation, it’s really exciting and really jubilant, with lots of countermelodies, and this is probably the only time that I will be able to perform it.”But adverse weather conditions could mean that the flypast scheduled to take place on Saturday, which the Royal Air Force has also been rehearsing for, may need to be called off at the last minute.“The weather isn’t looking brilliant, but there’s nothing we can do about it,” Sir Mike said.",
        "“We have to be safe, we have to make sure that we aren’t taking any unnecessary risks.“We’ll make a weather call one or two hours before the actual moment, but if there’s rain and low cloud then it will be almost impossible to get it through.“It’s 50/50 at the moment, but we have lots of options, the decision will be made, at this stage we’re hoping for the best.",
        "“The flypast has required a lot of practising too, there’s been a lot of rehearsing going on out on the North Sea,” he added.“If the flypast does go ahead then it will be as spectacular as the ceremonies on the ground.”"
    ]
}