{
    "articleURL": "/femail/article-12056119/King-Felipe-Spain-takes-Infanta-Sofia-football.html",
    "content": [
        "The King watched the Copa Del Rey final in Seville with his youngest daughterREAD MORE: Queen Letizia of Spain stuns as she arrives at Westminster Abbey King Felipe of Spain was in a hurry to get home following the Coronation yesterday so he could take his daughter to the football.",
        "The King, 55, watched the Copa del Rey Final between Real Madrid and CA Osasuna yesterday at La Cartuja stadium in Sevilla with Infanta Sofia, 16.Just hours earlier he had been celebrating the Coronation of his distant relative King Charles III at Westminster Abbey with an ever-stylish Queen Letizia, 50.As he stood for the Spanish National Anthem in the stands, Felipe looked smart in a navy coloured suit with a white shirt and a blue patterned tie. Meanwhile Princess Sofia, 16, went for a more casual look, sporting a green patterned cropped blouse and some white skinny jeans.The King then presented Real Madrid with the cup after they triumphed in a 2-1 win over the Pamplona club.",
        "The match started at 8.00pm, meaning that the King quickly travelled back to Spain after his fleeting visit to London, where he watched Charles and Camilla crowned King and Queen at Westminster Abbey.Pictures from the stadium show Felipe and Princess Sofia smiling and clapping as they were wowed by the events on the pitch.The King smiled as he presented Real Madrid's captain, French-born Karim Benzema, with the Copa del Rey trophy and gave him a pat on his back.Sofia, who followed in her elegant mother's footsteps in her chic outfit, beamed as she shook hands with players before the trophy presentation. ",
        "He attended the Coronation yesterday with his glamorous wife, Queen Letizia of Spain, 50, who wowed in a stunning pink pencil skirt and a top with a ruffled peplum, which featured an embroidered neckline along with buttons down its centre. The King looked equally sophisticated in a formal suit, with a pair of gloves on hand.Felipe is a distant cousin of Charles: his mother, Queen Sofia, was a third cousin of the Queen and a first cousin once removed of the Duke of Edinburgh.The Mall was packed for the Coronation, as tens of thousands had camped out for days so they can see the extraordinary event unfold. More than 100million watched the first coronation in 70 years on their televisions around the globe.",
        "It's been a particularly busy week for the Spanish royals - with King Felipe and Queen Letizia hosting Colombian President Gustavo Petro and his wife Verónica Alcocer in Madrid.The Spanish royals were also amongst the many foreign royalty who mingled with other VIP guests at the dazzling eve-of-Coronation reception at Buckingham Palace on the eve before Charles and Camilla were crowned.The reception was organised as a chance for the King to greet his guests because there was be no formal event outside the Coronation itself yesterday."
    ]
}