{
    "articleURL": "/wires/ap/article-12048611/Bills-final-OK-Erie-County-build-new-stadium.html",
    "content": [
        "BUFFALO, N.Y. (AP) - Get the shovels out, because the Buffalo Bills can finally begin breaking ground on their 60,000-plus seat, $1.54 billion new stadium after the project received unanimous approval from the Erie County legislature on Thursday.",
        "The 10-0 vote was the final formal step in a lengthy process that was disrupted by the COVID-19 pandemic, and comes some 13 months after the parameters of an agreement were reached with taxpayers committed to funding $850 million of the cost.The new stadium is to be built across the street from the Bills current home in Orchard Park, New York, and on track to be completed in time for the start of the 2026 season.\"Well, we´ve got people working out there today, is that fast enough?\" Bills executive vice president and COO Ron Raccuia told The Associated Press by phone when asked how quickly construction can begin.\"It´s exciting. We´ve concluded successfully one major part of this project and now we get to go and completely turn our attention to construction and opening the new stadium for the 2026 season,\" Raccuia added. \"I don´t know about doubts, but it took its twists and turns. But we were all committed to making this happen.\"The agreement includes a 30-year lease that essentially helps secure the Bills to continue playing in one of the NFL´s smallest markets, something that was a concern in 2014, following the death of Hall of Fame owner Ralph Wilson, who founded the franchise in 1960.",
        "The Bills were sold at a then-NFL-record price of $1.4 billion to Terry and Kim Pegula, who also own the NHL's Buffalo Sabres. Though the Pegulas have shown a commitment to Buffalo and played a role in the city´s downtown revitalization, worries remained about the Bills´ long-term viability while playing in their existing home, which opened in 1973.In recommending a new stadium be built, a state study in November 2021 pegged renovation costs to the existing facility at $862 million, which would include replacing the entire third deck.Governor Kathy Hochul was open to spending additional taxpayer money to have the new facility built downtown, but the Pegulas were firm on having it built near their current home by citing potential delays and concerns over displacing long-established neighborhoods.The combined taxpayer cost - with the state committing $600 million and the county $250 million - was at the time the largest public commitment to an NFL stadium in league history.The projected cost of the stadium has already gone up from $1.4 billion, with the Bills responsible for any over-runs.The NFL, through its G4 loan program, and the Bills agreed to commit $550 million in financing. The Pegula´s share came in at $350 million, with much of that made up by the team introducing seat licenses for season ticket holders.",
        "\"There are many reasons to celebrate today´s vote, including the strong CBA and local labor provisions that are included in the agreement, and everyone is looking forward to getting the project underway,\" Erie County executive Mark Poloncarz said. \"This is a transformational project that not only keeps the Bills here for the next 30 years but will have them playing in a state-of-the-art stadium, and it´s a big win for our community.\"The Bills have been readying for the approval for much of the past year in having already hired contractors and a design firm to produce renderings of the new stadium.The next step - an official groundbreaking ceremony - is already being planned, with Raccuia saying one will take place by June.\"It´s been quite an experience. We were able to accomplish something that´s never been done in Bills history,\" Raccuia said. \"It´s exciting to see what's in the future for the Bills and western New York.\"___AP NFL: https://apnews.com/hub/nfl and https://twitter.com/AP_NFL"
    ]
}