{
    "articleURL": "/wires/ap/article-12048057/Prosecutor-Baltimore-police-officer-sold-pot-clock.html",
    "content": [
        "BALTIMORE (AP) - Two Baltimore police officers were indicted this week in separate cases, including an 11-year department veteran accused of selling drugs on the clock - allegations that come as the agency seeks to rebuild its reputation after the Gun Trace Task Force corruption scandal ruptured public trust.",
        "Officer Cejus Watson was supposed to be working at police headquarters in downtown Baltimore on Sept. 29, but he left during his shift and drove to a Baltimore County tattoo parlor where he sold marijuana, according to a grand jury indictment.Watson had been previously charged with marijuana distribution in Baltimore County, a separate legal jurisdiction, and was suspended without pay as a result; that case, which pertains to the same alleged drug deal, is ongoing with trial scheduled for June.Baltimore State´s Attorney Ivan Bates, who took office as the city´s top prosecutor in January, announced the indictments at a news conference Thursday morning, saying they demonstrate his commitment to holding law enforcement officers accountable for misconduct.The second officer, Alexis Acosta, faces manslaughter and other charges after he struck and killed a scooter rider while responding to a June 911 call.Bates said the indictments call into question the officers´ \"integrity and ability to protect the citizens of Baltimore City.\" He called Watson´s alleged actions \"absolutely mind-boggling.\"\"When I hear there´s evidence that an officer was allegedly selling drugs on the job, I can´t help but think of the notorious Gun Trace Task Force - the shame that was brought on our police department and our city as a whole,\" he said.",
        "That corruption scandal resulted in more than a dozen officers being convicted of criminal charges. It stemmed from the discovery that members of an elite plainclothes squad, created to get illegal guns off the streets, had robbed drug dealers, planted narcotics and firearms on innocent people, and assaulted random civilians.The department also remains under a federal consent decree that mandates a series of court-ordered reforms to root out unconstitutional policing practices.While troubling, Bates said, the charges against Watson likely aren´t representative of more widespread corruption inside the department.\"The consent decree, I do believe is working,\" he said.Watson made $86,000 in 2021, according to public salary records. An attorney representing him didn´t immediately respond to a request for comment Thursday.Acosta was responding to a 911 call about a reported stabbing when he struck Terry Harrell, 58, who was riding an electric scooter. Video footage of the crash showed Acosta driving through a red light with his lights and sirens on. In addition to manslaughter, he´s accused of reckless and negligent driving.Online court records didn´t indicate Thursday whether Acosta has an attorney representing him.A spokesperson for the Baltimore Police Department said Acosta remains on administrative duty.Bates has made other announcements of indictments of Baltimore police officers. However, he also declined to prosecute an officer who fatally shot a fleeing teenage driver last year. That decision, which has drawn criticism from activists, was at odds with an investigative report from state prosecutors who also reviewed the case.",
        "This story has been corrected to state that Acosta was responding to a June 911 call, not a September call."
    ]
}