{
    "articleURL": "/wires/ap/article-12043475/Altuve-cleared-baseball-activities-return-not-set.html",
    "content": [
        "HOUSTON (AP) - Jose Altuve resumed some baseball activities this week, but there still isn´t a timetable for when Houston´s star second baseman will return to the team.",
        "Altuve fractured his right thumb in the World Baseball Classic and had surgery to repair the injury March 22. After his surgery, Astros general manager Dana Brown said he´d be out at least eight weeks.It´s been six weeks so far, and while Altuve was cleared to return to baseball activities this week - including throwing, running and fielding - he hasn´t been cleared to swing .\"I think right now it´s hard to tell,\" Altuve said when asked if he knows when he'll return. \"Anything is possible. I´m working really hard. I want to come back and help these guys to win, but we´ll see.\"I think the next two weeks are really important in my rehab.\"This is the longest the eight-time All-Star and the 2017 American League MVP has ever been sidelined.",
        "\"Obviously, it´s really hard,\" he said. \"It´s something I didn´t plan on, but things happen, and you can´t really do anything about it. I´m just continuing to work hard every day with (trainer) Jeremiah (Randall) and try to come back to the field as quick as I can, but in the meantime, just keep watching these guys play amazing baseball.\"Manager Dusty Baker was glad to see Altuve getting some work in this week, but knows his star has a way to go before he can return to the lineup.",
        "\"It´s been hard on him to not play and not contribute and not to help us win. We just have to temper it some not to rush him as badly as we want to, and it´s probably worse for him because he wants to get back again because he loves to play,\" Baker said. \"We just have to be patient.\"Mauricio Dubón has filled in nicely in Altuve´s absence, entering Wednesday´s game hitting .305 with seven doubles and six RBIs. He also had a career-long 20-game hitting streak.Altuve said it´s \"awesome\" to see Dubón playing so well.\"I´m really happy and proud,\" Altuve said. \"He deserves it. He´s a great kid. He shows up every day and wanted to play ... he´s a team player and just playing amazing. He´s going to keep doing that, and I know he´s going to have a great season and go from there.\"___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}