{
    "articleURL": "/wires/reuters/article-12045315/White-Sox-eye-fourth-straight-win-sweep-Twins.html",
    "content": [
        "An abysmal April has yielded to a far-from-moribund May for the Chicago White Sox.",
        "Clinching its first series victory and first three-game winning streak of the season will change a club's outlook, to be sure.\"We've got a long season ahead. We got time to catch up. I think that's enough,\" White Sox shortstop Tim Anderson said. \"Just try to bring positive energy and have fun. I'm pretty sure the fans don't want to continue to keep hearing me say the same. Hopefully, we go out and try to get some wins.\"Sure, it's a small sample size, but Chicago has done just that since the calendar flipped. Now the team eyes a sweep of the visiting Minnesota Twins in Thursday's matinee.Right-hander Lucas Giolito (1-2, 4.15 ERA) will get the start for the White Sox, who extended their run to three game with a 6-4 victory against the Twins on Tuesday night.The win may have been costly.White Sox third baseman Jake Burger left the win with left side discomfort after taking an awkward swing during a fourth-inning at-bat in which he struck out. Manager Pedro Grifol said after the game that Burger was getting tested for a possible injury to his oblique.Anderson and Yasmani Grandal had three hits apiece for the White Sox. Luis Robert slugged a three-run home run, while Eloy Jimenez had a pair of hits, including a go-ahead RBI single in the seventh inning.",
        "Minnesota has lost two straight and three out of four. After losing on a walk-off in Tuesday's series opener, the Twins struggled against the White Sox bullpen on Wednesday. They loaded the bases with no outs against Gregory Santos in the seventh but couldn't score, and then managed one baserunner the rest of the way.\"There's no one to blame. We can look in the mirror today and say we just needed more from ourselves,\" Twins manager Rocco Baldelli said. \"That's really everywhere you look. You could look at we're walking some guys in some situations and the other team is taking advantage.\"Nick Gordon has homered in two straight games for Minnesota. He hit a pinch-hit home run Tuesday before getting a start Wednesday and going deep again.\"Nick's doing a good job. Nick stays ready as well as anyone for his chances, for his opportunities,\" Baldelli said. \"There have been times when he's played every day for us. There have been times when he's playing sporadically. But whenever you stick him out there and give him at-bats and give him a chance, he's prepared. He's ready.\"Righty Pablo Lopez (2-2, 4.00) gets the call for the Twins. Lopez benefited from plenty of run support to get the win Friday at Kansas City, when he scattered eight runs and six hits in six innings with one walk and seven strikeouts.",
        "Lopez took a no-decision against the visiting White Sox on April 11, pitching 7 2/3 innings of two-run, three-hit ball with 10 strikeouts.Giolito is 8-9 with a 4.03 ERA in 21 career starts against the Twins. He allowed one run and five hits in an April 12 loss at Minnesota. The righty is coming off Friday's no-decision against Tampa Bay, when he scattered two runs and eight hits in 6 2/3 innings.--Field Level Media"
    ]
}