{
    "articleURL": "/news/article-12038041/Subway-closes-500-stores-2022-grapples-expansion-stale-menus.html",
    "content": [
        "Subway has closed thousands of US locations in recent years due to over-expansion, outdated operations and décor, and stale menusThe chain shed another net 571 locations - for 2.7 percent - in 2022. In 2021, it closed 1,000 shops and in 2020, it shuttered the doors to more than 1,600Subway announced early this year that it was exploring a billion-dollar sale. A source told Reuters last week that bids are ranging between $8.5-$10billionSubway closed more than 500 sandwich shops across the US in 2022 due to over-expansion and stale menus as it explores a potential $10billion sale. ",
        "The chain shed another 571 locations - for 2.7 percent - in 2022 after even steeper closings in previous years in the United States, its largest global market, according to the latest disclosure document it provides to franchisees who are interested in buying locations.Subway has closed thousands of US locations in recent years due to an abundance of stores, outdated operations and décor, dated menus and $5 footlong deals that eroded franchisees' profits, according to a disclosure document viewed by Reuters.In 2021, the chain shut down 1,000 stores and more than 1,600 in 2020. At the end of 2022, Subway had 20,576 shops in the United States. That is a sharp decline from 2016, when it had 26,772. It has roughly 37,000 total locations globally. The company attempted to revitalize its favor among fans by introducing a refreshed menu with splashy advertising campaigns featuring A-list celebrities, including Serena Williams and Steph Curry. The role out came under CEO John Chidsey and it could take several years to succeed, said restaurant consultant John Gordon.",
        "Continued closings can also hurt public perception, said franchisee advisor Robert Edwards.'That's baggage that they'll be hard pressed to step away from,' Edwards said.'We have spent the past two years optimizing our footprint by using a strategic, data-driven approach to ensure restaurants are in the right location, image and format,' Subway said in a statement. ",
        "'This includes opening new locations, with quality remaining a top priority, relocating restaurants to maximize guest traffic and closing locations when needed.'The company also said the slowdown in store closure has to do with Subway limiting its market to hot-spot areas. 'The slowdown in closures is a result of the progress we have made to get back to smart growth, which will boost franchisee profitability and protect our position in the market,' Subway said.",
        "'In 2023, our goal is to increase new openings across North America by approximately 35 percent compared to 2022.'Subway announced early this year that it was exploring a billion-dollar sale. A source told Reuters last week that bids are ranging between $8.5billion to $10billion. Subway will soon allow bidders to team up before submitting final offers, and Bain, TPG and Advent have already been in discussions about doing so, the sources added.Although Subway previously shot down speculations that it was preparing for a sale last year, the franchise has seen a big turn following years of controversies regarding its ingredients, including its tuna and bread, and pedophile former spokesperson, Jared Fogle. ",
        "In 2015, Subway faced a public image nightmare when the face of the company, Jared Fogel, was convicted on child pornography charges.It has also faced criticisms over the freshness of its ingredients, with Ireland's Supreme Court ruling that its bread had too much sugar to be called bread.",
        "The company also faced a class-action lawsuit claiming it was misrepresenting its tuna sandwiches, with lab analysis repeatedly showing the meals had no tuna DNA.The tests prove that the ‘tuna’ is actually a ‘mixture of various concoctions that do not constitute tuna, yet have been blended together by [Subway] to imitate the appearance of tuna,’ according to the complaint filed against the company.A judge rejected Subway's request to dismiss the lawsuit in July, with the case being reviewed in the US District Court for the Northern District of California before heading to trial."
    ]
}