{
    "articleURL": "/sport/formulaone/article-12057653/Max-Verstappen-hails-satisfying-win-climbing-ninth-Miami-Grand-Prix.html",
    "content": [
        "Max Verstappen started the Miami Grand Prix in ninth, but won it with ease George Russell was delighted with fourth - and Mercedes' improvements DailyMail.com provides all the latest international sports news Max Verstappen opened up on a 'very satisfying' victory in Miami, after climbing through the field with relative ease to move from ninth to the top step of the podium.",
        "The two-time world champion overtook his Red Bull teammate Sergio Perez in the latter stages of the race to seal a third victory in five, and speaking after the race he was in a jubilant mood in the Miami sunshine. 'It was a good race,' he told Sky Sports. 'I stayed out of trouble at the beginning, had a clean race, picked off the cars one by one and I could stay out really long on the hard tyre.'I think that's where we made the difference today and then a good little battle with Checo at the end.'Yesterday was a bit of a setback, but today we kept it calm and clean, and winning a race from P9 is always very satisfying.'",
        "George Russell, meanwhile, was even happier - despite only managing to bring his Mercedes home in fourth.Such are the issues the Brackley-based team, but Sunday provided much encouragement as they look ahead to the next race in Imola in two weeks' time. 'I am feeling pumped to be honest because it has been a while since we had a good race like that where we made overtakes stick,' Russell said.'The pace, relatively speaking, was strong and I felt good in the car so for sure it was a satisfying one. I would have liked to have been three positions higher but we know the position we are as a team right now and P4 was the maximum today.",
        "'It was a good day at the office and will sit down with everybody tomorrow to see how we can move from here. There is a lot of expectations on Imola but at the end of the day, we finished 30-odd seconds behind the leaders today and we still finished quite a bit behind Fernando.'I am sure it is going to take a step in the right direction but it is not going to transform things. Let's hope it does.'The car is a little unpredictable at the moment so hopefully it exceeds our expectations in the next race but it is going to be a long journey'."
    ]
}