{
    "articleURL": "/news/article-12056387/Car-swallowed-sinkhole-busy-street-forcing-police-shut-road-divert-traffic.html",
    "content": [
        "A car became stuck after a large sinkhole opened on a Nottinghamshire street A sinkhole opened up in a busy street and swallowed a car, forcing police to shut the road.",
        "Most cars drove around the large sinkhole on Carlton Road in Worksop, Nottinghamshire, which opened up on Saturday. Yet one unlucky motorist managed to get stuck in it, leaving his car jutting up in the air.The elderly driver of a black Skoda Fabia driver accidentally wedged the front left wheel of his car in the sinkhole at around 7.45am on Saturday.Police closed the road between Eastgate and Overend Lane and said it would likely be shut for a while, and buses have been diverted from the area.",
        "Russell Gull, the owner of Res Barbers, helped the trapped driver out of his car.He said: 'The first thing I noticed was a man warning us there was a pothole. One car went round it but the next just drove straight ahead and dove right in.'We helped the guy out. He was elderly but seemed okay, just a bit shaken.'No one was injured in the incident.Tom Oxley, 78, who lives in nearby Carlton but grew up in the area, said: 'My son-in-law in Lincoln heard about it this morning so we've come to have a look.'I've been talking to the people on the scene and they've said the hole is 12 feet deep.'I use this road regularly myself to go the gym, but with the hole now you can actually see the thickness of the road and it doesn't look very thick, especially when you consider some of the bigger vehicles that will be going over this.'",
        "Jo Appleby, 45, who lives in Worksop, said: 'It must have been terrifying for the people in the car to realise that there was this huge hole right underneath them.'I feel really sorry for them as well because this car is probably their pride and joy.'I do think the roads are in a bad state at the moment and they've been getting worse over the past few months.'I know that there has been some bad weather so that may not have helped.'",
        "People living in Worksop said the road is prone to random holes forming as it was built on top of an old drain.Most recently, a hole opened up in the Matalan car park last August after heavy flooding in Worksop.",
        "A sinkhole is a hole in the ground created by erosion and the drainage of water.They can range in size from a few feet in diameter to the size capable of swallowing entire buildings.They are a natural phenomenon but the process is often amplified by human interference.",
        "Councillor Glynn Gilfoyle, the Labour county councillor for the area, said: 'My issue is that this is a recurrent problem and we need to get to the bottom of it.'I would say this is the third time in about three years that it's happened and so there needs to be some serious thought going forward.",
        "'Fortunately, nobody was seriously injured, but this could have been a lot worse.'I will definitely be asking questions because this will need some major work.'Councillor Gilfoyle said he understood Severn Trent was taking over the site and that damage had been detected in the foul system, with a team expected to go out on Sunday to assess any damage to pipes.One man, who did not want to be named, said his daughter had fallen victim to a sinkhole in the 'exact same spot' three years ago.He said: 'I saw this and I said that this is the exact same spot where my daughter's BMW went in.'It totally knackered her wheel up and she had to pay £500 for a new one.'Alex Dima, 29, who lives in Worksop and works as a taxi driver, said: 'I can't believe it because I was driving on this road at around 11 last night and everything was completely fine.'I'm always using this road when I'm working, so I was lucky not to be on it at the time.'"
    ]
}