{
    "articleURL": "/sport/football/article-12058753/Wrexham-continue-monster-expenses-trip-Las-Vegas-owner-Rob-McElhenney-joins-them.html",
    "content": [
        "The promotion heroes have been soaking up the best of Las Vegas on their tripSunday saw them joined by co-owner Rob McElhenney at TAO Beach Dayclub Another day… another pool party! Wrexham stars enjoy themselves in the sun Wrexham's promotion heroes continued their Sin City revelery on Sunday at a pool party at TAO Beach Dayclub Las Vegas where they were joined by Hollywood co-owner Rob McElhenney. ",
        "McElhenney and his wife and 'It's Always Sunny in Philadelphia' co-star Kaitlin Olson were pictured soaking up the sun with the players as they posed for a group photo in a cabana. The co-chairman and Olson previously joined the players on night two of their four-day all-expenses-paid holiday in celebration of their historic promotion to League Two at Vegas eatery Spago at the Bellagio. There, the players were greeted in style by an enormous ice sculpture in the shape of the club's badge in one of the many warm welcomes that the National League-winning side have been treated to in the US party capital. Co-owner Ryan Reynolds has stayed away from the celebrations but his 47-goal striker Paul Mullin shared a tongue-in-cheek Instagram story posted by the Deadpool star that suggested that next year's group trip was likely to be a little less raucous. ",
        "'Next year, they're going on a five day meditation retreat in the Faroe Islands,' deadpanned the co-chairman, hashtagging 'Wrexham in Vegas' as he commented on a picture of Mullin and midfielder Elliot Lee posing with DJ Pauly D. The players partied with the 'Jersey Shore' reality star whilst attending his pool party at Marquee on Saturday, where they smoked cigars and chatted to bikini-clad women whilst toasting their astonishing 111-point season. ",
        "Ahead of the afternoon's festitivities, Ollie Palmer hinted that their time in Vegas would soon be drawing to a close, captioning a picture of the entrance to TAO with 'one final push!'Cabanas and daybeds at the opulent Asian-inspired beach club can range from $1,500 to $6,000, and bottles of champagne range from $375 for Tattinger Brut to a staggering $1600 for a bottle of Jay-Z-owned Armand de Brignac 'Ace of Spades'. Wrexham players have enjoyed a well-deserved weekend of luxury, previously dining at Hakkasan as well as Wolfgang Puck's Spago, and partying at Hakkasan nightclub, OMNIA – where they were invited into DJ Steve Aoki's booth – and Marquee Dayclub. The side were promised the trip by their owners as they came closer and closer to their target of promotion, a plan Mullin discussed in an interview with GQ. ",
        "'It became a thing where if we won the league, we'd get a holiday. So we're off to Vegas,' Mullin told the magazine. 'Ryan and Rob told us to leave our cards at home, they're sorting the lot. They sent us a full itinerary just now. 'Part of me doesn't want to go, I might be dead by the end of it! But I'd never go to Vegas by my own accord, so I'm buzzing for it.'",
        "The players previously celebrated on home soil on Tuesday with an open-top bus parade which saw Reynolds and McElhenney jet in to celebrate the promotion successes of both their men's and women's sides.  "
    ]
}