{
    "articleURL": "/health/article-12051531/NHS-launches-probe-child-takes-records-150-patients-school-use-drawing-paper.html",
    "content": [
        "School staff removed the documents from the child and then alerted the NHS Read more: 500 Nigerian nurses and midwives in the UK could be struck offThe NHS has launched a probe after a pupil took printed records containing details of 150 patients to school to use as drawing paper.",
        "Bedfordshire Hospitals Foundation Trust confirmed it is investigating how the child got hold of the personal documents.However, it refused to say if any of the pupil’s relatives worked for the trust.The incident was reported in the trust’s information governance quarterly board report, and revealed by the Health Service Journal.It said the pupil arrived at the primary school with ‘numerous handover sheets’ from various dates in 2022 which they had ‘apparently been using as drawing paper’.",
        "‘Approx 150 patients information was on the sheets. School staff removed these from the child’s possession and IG governance manager visited the school to collect them.’The trust said it was alerted by the school data projection officer over a child having sheets with patient identifiable information.It said the information governance manager went to collect the papers on the same day and they were securely destroyed.Bedfordshire Hospitals FT said the incident was declared as a data breach but was not escalated to the Information Commissioner’s Office as it was contained.David Carter, chief executive of Bedfordshire Hospitals NHS Foundation Trust, said: ‘We are aware of the recent data breach that occurred at our Trust.‘We take all breaches of confidential information very seriously and are currently conducting a thorough investigation into this incident.",
        "‘Additional processes have been put in place to prevent this from happening again.’"
    ]
}