{
    "articleURL": "/wires/reuters/article-12061511/British-investment-minister-visits-Hong-Kong-official-visit-5-years.html",
    "content": [
        "HONG KONG, May 9 (Reuters) - Britain's Minister for Investment Dominic Johnson said he held a series of meetings with government officials and executives in Hong Kong on Monday, the first official visit from a senior British official to the city in five years.",
        "Johnson's visit comes after relations between Britain and Hong Kong have been increasingly strained since 2020 when Beijing imposed a national security law in the former colony.Johnson said he was in Hong Kong to promote the United Kingdom as a leading destination for investment and trade.\"Hong Kong is one of the world's leading international financial centres and we have shared interests from financial services to infrastructure to sustainability,\" he wrote on Twitter.Johnson met with Christopher Hui, Hong Kong's secretary for Financial Services and the Treasury \"to discuss our ongoing work to remove market barriers and increase UK-Hong Kong trade.\"He also met with CK Hutchison Chairman Victor Li and co-managing director Canning Fok to discuss the company's investment plans in Britain, which he said was already \"one of the single largest investors in the United Kingdom.\"Johnson also visited the city´s Cyberport area on Monday, which authorities have been trying to develop as a start up area, according to photos he posted on his feed.Hong Kong´s government did not respond to a request for comment on Johnson´s trip nor did the British consulate provide any details. Johnson´s meetings have all been closed door and not available for media.He is due to leave Hong Kong on Tuesday.",
        "Western governments including Britain's have criticized the security law as a tool to crush dissent.Chinese and Hong Kong authorities say the law, which punishes subversion, collusion with foreign forces and terrorism with up to life in prison, has brought stability after the 2019 protests. (Reporting by Farah Master and Jessie Pang; Editing by Lincoln Feast)"
    ]
}