{
    "articleURL": "/sport/football/article-12057093/Steve-Borthwick-completes-England-backroom-staff-Tom-Harrison-Tony-Roques-join.html",
    "content": [
        "Tom Garrison was acquired by England after Ian Peel opted to stay at Saracens Tony Roques spent time in camp with the team before the last World CupRichard Wigglesworth will also oversee the attack and kicking strategySteve Borthwick has finally completed assembling his England management team for the World Cup, with the recruitment of Leicester scrum guru Tom Harrison and national Sevens head coach Tony Roques.",
        "With the Red Rose squad due to begin tournament preparations next month, it has also been confirmed that Richard Wigglesworth will oversee the attack and kicking strategy, after his end-of-season arrival from the Tigers. He and the East Midlands club’s renowned strength and conditioning expert, Aled Walters, will work with Borthwick and Kevin Sinfield, who swapped Welford Road for Twickenham at the end of last year.Reflecting on the acquisition of Harrison – after Ian Peel opted to stay at Saracens – Borthwick said: ‘Tom is an excellent coach and will have a real impact in an area that will be fundamental to us. Leicester’s scrum is renowned across Europe and Tom has played a leading role in that success. I have full confidence in him.’Roques spent time in camp with England before the last World Cup and will be involved again, with Borthwick adding: ‘Tony has an extensive background in Sevens and is an experienced, specialist contact and skills coach. ",
        "'Individual skill emphasis will be an important part of our work. Having worked alongside him in the 2019 campaign, I know what a good coach he is and he will really contribute to the team.’Assessing the overall make-up of the coaching staff, Borthwick expressed delight and optimism about the chance to surround himself with complementary, familiar figures. ",
        "‘I am pleased with the balance and wide range of experience that the coaching staff will have,’ he said. ‘As a group, we know each other well and we know the areas we will focus on. We know this World Cup will be highly competitive, but we are genuinely excited by what this group of coaches and players can achieve in France.’"
    ]
}