{
    "articleURL": "/wires/reuters/article-12058643/Four-die-fires-rage-swaths-Russias-Urals.html",
    "content": [
        "By Lidia Kelly",
        "May 8 (Reuters) - Raging fires have consumed swaths of Russia's Urals mountains, killing at least seven people, razing hundreds of homes, forcing evacuations and spurring investigations, officials said on Monday.Wildfires are common in late spring and summer across Russia's vast forests and grassy steppes, but some recent blazes have fanned suspicions of \"negligence\".The fires spread to some settlements in the southern region of Kurgan near the border with Kazakhstan, prompting a visit by Emergencies Minister Alexander Kurenkov early on Monday.\"So far six people have died in the fires in the (Kurgan) region, 14 were injured,\" the TASS state news agency said, citing medical officials.A seventh person died in the village of Krasny Yar in the Tyumen region while trying to extinguish a fire, and two others were injured, TASS reported.Investigative authorities in Kurgan have begun a criminal inquiry.\"The spread of the fire became possible due to potential negligence on the part of responsible officials,\" they said in a statement.The authorities will support those affected by the wildfires, Kurenkov said after briefing President Vladimir Putin, adding that they no longer posed a threat to settlements in the region.Massive fires have also engulfed the regions of Sverdlovsk and the Tyumen region in the Urals, to the north of Kurgan.",
        "Authorities managed by late Sunday to contain a gunpowder depot fire that had forced the evacuation of a small village in the Sverdlovsk region.But 53 more fires are still blazing, they said.TASS said more than 54,000 hectares (209 sq miles) of forests were still burning in the Sverdlovsk region on Monday, with about 4,800 responders attempting to douse the flames.Independent news site SOTA blamed explosions and arson for some of the fires. Reuters was not able to independently verify the report.At the end of April, a fire of unknown origin killed one and left hundreds in the area homeless. (Reporting by Lidia Kelly in Melbourne; Editing by Jacqueline Wong and Clarence Fernandez)"
    ]
}