{
    "articleURL": "/femail/article-12050655/The-untold-story-REAL-Queen-Charlotte-18th-Century-royal-inspired-Netflixs-heroine.html",
    "content": [
        "Shonda Rhimes say she 'took inspiration' from the historic figure and 'ran with it'Read More: Critics go wild over steamy period drama spin-off Queen Charlotte Glamorous, powerful and a total gossip. The character of Queen Charlotte won her way into viewers' hearts in the first two series of Netflix's hit series Bridgerton.",
        "much-anticipated prequel to the popular bodice ripperThe show is set decades before the events of Bridgerton and follows the formidable Queen Charlotte, played by India Amarteifio, as she experiences her first throes of passion in Regency Britain. But what viewers of the show might not know is that the character of Queen Charlotte is based on a real 18th Century royal.Born in May 1744, Sophia Charlotte of Mecklenburg-Strelitz was the daughter of a German Duke and a Princess.",
        "According to the Royal Family's website, Princess Charlotte was selected to be George III's wife when he became King in 1760.As such, the 17-year-old German royal had to move away from everything she knew and start a new life in England with a man she hardly knew.When she arrived at her husband's court, historians have noted how the new Queen was seen as an outsider - a theme which is explored in the new Netflix series. But despite their arranged nuptials, Charlotte and George went on to have a exceptionally happy marriage.Over the course of their 57 year marriage, Queen Charlotte gave birth to 15 children over 22 years. Shortly after their wedding, George bought Queen's House for his wife to use - which is known today as Buckingham Palace and used as the Royal Family's main London residence. ",
        "In recent years, the Royal Collection Trust published love letters Charlotte wrote to George when he was away on royal engagements.The 250-year-old correspondence read: 'You will have the benefit by Your voyages to put Spirit in every Body, to be more known by the World, and if Possible more beloved by the People in general. ",
        "'That must be the case, but not equal to the love of her who subscribes herself Your very affectionate Friend and Wife Charlotte.' Although the couple fell madly in love, their marriage wasn't entirely smooth-sailing - and the Queen had to deal with George's mental illness, which is documented in the Bridgerton series, where the King becomes a virtual recluse. King George III suffered his first bout of mental illness in 1765 - just five years into the couple's marriage. Historians believe his 'permanent madness' started around 1810 and he is reported to have become violent during his fits.Although Queen Charlotte remained his devoted companion, she is said to have never visited her husband alone as his condition worsened.In the final 10 years of his reign, the couple's son George IV acted as the Prince Regent.According to the Royal Family's website, some historians believe that George III's illness was caused by a hereditary physical disorder called porphyria - which can cause hallucinations and confusion.",
        "Since her death in 1818, historians have debated Charlotte's ethnicity - as paintings and descriptions of her suggested that she may have been biracial.Although it is impossible to know the late Queen's full heritage, the show's creator Shonda Rhimes told The Guardian: 'We took the idea that Queen Charlotte was from Black Portuguese royalty and ran with it.'Discussing how the royal inspired the character of Charlotte, Shonda added: 'She was outsized, very glamorous, held herself above everyone. There was a lot to mine.' On the show, the character of Queen Charlotte is always dolled up to the nines in glamorous dresses and impressive jewellery.",
        " According to the Royal Collection Trust, the real Charlotte was equally as fond of the finder things in life.They explained: 'Queen Charlotte's tastes were rather less plain than her husband's and she had some very luxurious rooms in the new Queen's House [Buckingham Palace].' During their reign, Charlotte acquired an 'extensive' collection of diamonds and pearls.As well as her Buckingham Palace residence, Queen Charlotte also acquired the Frogmore estate in Windsor in the 1790s.The royal and her six daughters used the estate as their 'rural retreat' and asked Mary Moser - who was a founding member of the Royal Academy - to oversee the interiors.",
        "It was announced in 2021 that there would be a third and fourth series of Bridgerton following the success of the first two. The show is based on the series of romantic novels by American author Julia Quinn.Last year actress Simone Ashley, who portrays Kate Sharma, told how she was 'very happy when reading the scripts. When I receive them, I've got a beaming smile on my face'.She also said that the third series is about to get 'super steamy' and added that it would be 'condensation central'.The new series will be based on the fourth book in the series, called Romancing Mister Bridgerton, and will follow the budding romance between Penelope – played by Nicola Coughlan – and Colin Bridgerton.The pair will embark on a journey that will see them go from friends to lovers.Jonathan Bailey will also reprise his role as Anthony, Claudia Jessie is back as Eloise, Luke Thompson as Benedict and Ruth Gemmell as Lady Violet Bridgerton."
    ]
}