{
    "articleURL": "/wires/reuters/article-12049727/Opera-singer-Yende-excited-nervous-kings-coronation.html",
    "content": [
        "By Matteo Witt",
        "VIENNA, May 5 (Reuters) - South African soprano Pretty Yende first met King Charles when she was invited to sing at Windsor Castle by the Royal Philharmonic Orchestra last year. On Saturday, she will perform solo at his coronation.\"I'm too excited to be nervous,\" she said. \"It's an incredible time of my life as a young girl, as a South African, as an artist, only joy floods my heart.\"Months after singing at Windsor, a phone call interrupted rehearsals at the Vienna State Opera to ask the 38-year-old if she would perform at the coronation in London on May 6.\"This was my audition I guess,\" said Yende, recalling the evening at Windsor during a backstage interview at the opera house.\"That was the first time I met the king,\" she said. \"He was very kind, very warm.\"Yende is the first African national to sing solo at a British coronation. Millions are expected to watch the televised event, likely the biggest audience in Yende's career so far and a \"dream come true\", she said.Yende grew up singing gospel music in church in her hometown of Piet Retief in eastern South Africa. She remembers musical evenings with her family while washing dishes after dinner.But it was during long walks to church with her asthmatic grandmother that Yende, aged five at the time, perfected her pitch.",
        "\"When we took breaks she would open the hymn book from our church and teach me these songs,\" she said, recalling the fear of then being told to perform them for the congregation. \"I was very shy ... but I didn't want to disappoint my grandmother.\"In 2001, aged 16, she discovered opera in a television commercial and begged a school professor to teach her.That passion took her to Latvia and then to Italy, her base for several years. She has starred in theatres across the world and released a debut album in 2016.At the coronation, Yende will perform \"Sacred Fire\", a piece written by composer Sarah Class for the occasion.\"For me, it's a soul's business,\" Yende said. \"Whether you're a king, a princess or just a girl from the tip of Africa singing for the coronation of the king.\" (Writing by Sofia Christensen; Editing by Janet Lawrence)"
    ]
}