{
    "articleURL": "/tvshowbiz/article-12061099/Cancel-culture-eroding-freedoms-fought-1960s-says-Nick-Broomfield.html",
    "content": [
        " The director has just made a film about Rolling Stones legend Brian JonesAcclaimed documentary film maker Nick Broomfield has hit out at woke attitudes, saying they are a new form of judgmental 'puritanism'.",
        "The director, who has just made a film about Rolling Stones legend Brian Jones, said society was now 'at the other end of the spectrum' from the freedoms of the 1960s because of the rise of cancel culture and woke politics.Mr Broomfield's comments came amid growing concerns about the impact that the views are having on the arts and freedom of expression.He touched on the subject while discussing his latest documentary, The Stones and Brian Jones. The film explores the 'relationships and rivalries' within the Stones during their early years. It also looks at the 'iconoclastic freedom and exuberance' of the 1960s and its 'intergenerational conflict'.Mr Broomfield told the Radio Times: 'People suspended judgment in the Sixties in a way and all hell broke loose and there was an amazing plethora of artistic achievements and then everyone got a bit frightened again.",
        "'We're now at the other end of the spectrum with none of those particular kinds of freedoms. The whole 'woke' thing is a different puritanism. It's judgmental in the same way that our parents were.' Mr Broomfield, whose film will be shown on BBC2 later this month, also criticised the TV streaming companies, calling them 'a bunch of p*****s' who wanted 'everything to be authorised' before making a film.",
        "He added: 'They would never have made this film without the permission of Mick [Jagger] and Keith [Richards].'Brian Jones was the leader of the Rolling Stones, with the other band members said to be 'in awe' of him. He was found dead in his swimming pool in 1969, aged 27.Mr Broomfield has tackled many controversial subjects over his documentary-making career on subjects ranging from American serial killer Aileen Wuornos and Hollywood madam Heidi Fleiss to Whitney Houston and US politician Sarah Palin."
    ]
}