{
    "articleURL": "/wires/reuters/article-12058601/Chinese-firms-working-ChatGPT-style-AI-technology.html",
    "content": [
        "May 8 (Reuters) - The global buzz around Microsoft-backed OpenAI's ChatGPT has spread to China, shoring up stocks in artificial intelligence (AI) related firms and prompting a flurry of domestic companies to announce rival projects.",
        "Here is a list of Chinese tech companies that have recently made announcements on AI technology:IFLYTEKChinese AI firm iFlytek on May 6 unveiled a large language model called \"SparkDesk\" and demonstrated it generating texts, solving math problems and critiquing a handwritten essay.The company also said it would carry out a series of updates for the model this year that it hopes would enable it to exceed ChatGPT in understanding Chinese and to reach the OpenAI chatbot's level in English.ALIBABAOn April 11, e-commerce giant Alibaba Group showed off its AI large language model called Tongyi Qianwen, saying it would be integrated into all its apps in the near future.Tongyi Qianwen will initially be integrated into workplace messaging app DingTalk and voice assistant Tmall Genie.It began registrations for Tongyi Qianwen on April 7.SENSETIMEChinese AI firm SenseTime unveiled on April 10 a slew of new AI-powered products, including a chatbot and image generator based off its AI model SenseNova. The company did not detail plans for a product roll-out.HUAWEI TECHNOLOGIESTelecoms giant Huawei Technologies has the Pangu series of AI models whose applications range from drug development to computer vision.BAIDUOn March 16, Baidu Inc unveiled its much-anticipated AI-powered chatbot known as Ernie Bot. It is now available to a limited number of users who apply for access codes.",
        "Tests by Reuters show the chatbot has a good command of the Chinese language but avoids answering some political questions.Baidu plans to use Ernie Bot to revolutionise its search engine, by far the most dominant in China, as well as beef up efficiency in its cloud, smart cars and household appliances businesses.TENCENTTencent Holdings has set up a development team for a ChatGPT-like chatbot to be called \"HunyuanAide\", two people familiar with the matter told Reuters in February. Asked for comment, Tencent reiterated a Feb. 9 statement that it is doing research on ChatGPT-tool technology.FUDAN UNIVERSITY TEAMA team from China's Fudan University launched a ChatGPT-like chatbot called MOSS on Feb. 20. However, the team apologised after a surge in traffic caused the platform to crash hours after its launch, saying it was a very immature model that had a long way to go before reaching the level of ChatGPT.JD.COME-commerce company JD.Com said on Feb. 10 it planned to launch a product similar to ChatGPT, to be called ChatJD and aimed at serving other businesses.CHINA TELECOMChina Telecom Corp is developing an industrial version of ChatGPT for telecoms, which will use AI in some customer service functions, domestic media said on Feb. 18.NETEASEGaming firm NetEase plans to deploy large language models technology to serve its education business, a source familiar with the company told Reuters on Feb. 8.",
        "360 SECURITY TECHNOLOGY INC360 Security Technology Inc said on Feb. 8 it possessed language model technology but could not give a clear indication of when it would launch related products.KUAISHOU TECHNOLOGYShort video app Kuaishou Technology is doing research on large language models, aiming to improve its products, such as AI customer service, the government-backed the Paper said on Feb. 9.INSPUR ELECTRONIC INFORMATION INDUSTRYInspur Electronic Information Industry has long invested in AI-Generated Content technology, it said on its investor relations website. (Reporting by Albee Zhang and Brenda Goh; Additional reporting by David Kirton, Laura Lin, Josh Ye and Shanghai Newsroom; Editing by Edwina Gibbs, Clarence Fernandez and Jamie Freed)"
    ]
}