{
    "articleURL": "/wires/ap/article-12052319/After-attacks-Chinese-Pakistan-pledges-security.html",
    "content": [
        "ISLAMABAD (AP) - The Pakistani president on Friday assured Beijing´s top diplomat that his country will boost security for all Chinese nationals working on multi-billion dollar projects in cash-strapped Pakistan.",
        "China has been demanding more security from Pakistan for its nationals residing and working in the Islamic country since 2021, when a suicide bomber killed nine Chinese and four Pakistanis in an attack in Pakistan's volatile northwest.More recently, a Chinese national working on the Dasu Dam, a Chinese-funded hydropower project and the biggest of its kind in Pakistan, was arrested on blasphemy charges after an angry mob accused him of insulting Islam when he criticized a coworker for taking too much time to pray during working hours.Pakistan's controversial blasphemy laws carry the death penalty, and sometimes even a mere suggestion of blasphemy is enough to entice mobs to violence or lynching. The Chinese man was subsequently released under a court order but it remained unclear if he would face trial or be deported home.President Arif Alvi pledged more security for Chinese workers during a meeting Friday with visiting Chinese Foreign Minister Qin Gang. The two spoke ahead of a mini-summit on Saturday in the Pakistani capital, Islamabad, during which Pakistan´s foreign minister, Bilawal Bhutto Zardari, will host Qin and also Afghanistan´s Taliban-appointed foreign minister, Amir Khan Muttaqi.Muttaqi also arrived in Islamabad on Friday ahead of the three-way meeting the next day. The gathering is also seen as an outreach to the Taliban by Pakistan, which has acted as a mediator with Afghanistan's new rulers, and also China, which is eager to expand its influence in the region.",
        "The Taliban have been shunned by most of the international community for the harsh and restrictive measures they have imposed since they seized power in Afghanistan in August 2021, when U.S. and NATO troops were in the final weeks of their pullout from the country after 20 years of war, particularly banning girls from education beyond the sixth grade and barring women from most jobs and public life.In Pakistan, Beijing is bankrolling the so-called China-Pakistan Economic Corridor, or CPEC - a sprawling package that includes a multitude of mega projects such as road construction, power plants and agriculture. The package is a lifeline for Pakistan's cash-strapped government, currently facing one of the worst economic crises amid stalled talks on a bailout with the International Monetary Fund.CPEC, also known as the One Road Project, is part of China´s Belt and Road Initiative, a global endeavor aimed at reconstituting the Silk Road and linking China to all corners of Asia.Alvi and Qin on Friday \"reaffirmed their resolve to work together to promote regional peace and prosperity as well as jointly cope with external challenges.\" Alvi told the Chinese diplomat that Pakistan-China relations were \"rooted in mutual trust\" and understanding.The Chinese minister was quoted in the statement as saying their nations were \"all-weather friends\" whose friendship \"was as solid as a rock.\"",
        "This is the second time that Muttaqi, the Taliban official, is visiting Pakistan since the Taliban takeover. Pakistan has lately expressed concern over a surge in attacks across the country by the Pakistani Taliban - an independent militant group that is allied with and sheltered by the Afghan Taliban.Islamabad has demanded from the Taliban in Kabul that they do more to rein in anti-Pakistani groups such as the Pakistani Taliban - also known as Tehreek-e-Taliban Pakistan or TTP - which have stepped up attacks on Pakistani security forces in recent months.Muttaqi is also expected to discuss the issue of Afghan refugees living in Pakistan as well as the two nations' border issues. In February, the two sides shut the main Afghan-Pakistan border crossing at Torkham, stranding people and thousands of trucks carrying food and essential items.After a Pakistani delegation travelled to Kabul for talks on the crisis, the border was reopened after a week."
    ]
}