{
    "articleURL": "/wires/pa/article-12050345/Major-transport-operation-cater-coronation-travel.html",
    "content": [
        "Final preparations are being made for a major transport operation ahead of hundreds of thousands of people descending on central London for the coronation.",
        "Roadworks on major roads across England have been lifted and train services will be beefed up to cope with demand.People arriving in the capital on Saturday are being urged to consider walking to viewing areas as public transport will be very busy.",
        "Miles of roadworks lifted (National Highways)",
        "Road closures will be enforced in large parts of central London, affecting motorists and bus users.National Highways has lifted more than 700 miles of roadworks on England’s motorways and major A roads ahead of the weekend, meaning 96% of its network is fully open.These include routes which will be used by thousands of people driving to London for the coronation.Eleven miles of roadworks were lifted on the M1 around Hemel Hempstead and Dunstable, and 12.5 miles of works were removed from the M11 around Cambridge and Harlow.The cones will not be put back until after Monday.Some train operators will run additional services and longer trains.Great Western Railway has added extra services to London Paddington from major stations in South Wales, south-west England and the Thames Valley area on Saturday morning.",
        "Southeastern will run additional trains between Dartford and London Charing Cross, and longer trains on the Maidstone East Line and between London Victoria and Gillingham.Govia Thameslink Railway – which operates Gatwick Express, Great Northern, Southern and Thameslink – said some of its services will have more carriages than normal.",
        "Transport for London (TfL) advised people to “avoid driving in central London if you possibly can”, and “if you travel into London by national rail, consider walking to the viewing areas if you are able to”.It warned that safety measures on London Underground such as queuing, closures, trains not stopping or changes to the way people enter or leave stations “are likely to be necessary, especially in central London” on Saturday.Some Tube stations are expected to be “very busy”, including Westminster, Green Park, Charing Cross, Embankment, Victoria, Hyde Park Corner, Knightsbridge, Leicester Square, Piccadilly Circus, Temple and Marble Arch.St James’s Park station will be closed and Hyde Park Corner station will be exit-only until the crowds disperse.There are no planned London Underground closures or work affecting train services on lines serving the capital on Saturday."
    ]
}