{
    "articleURL": "/wires/ap/article-12057397/76ers-Harden-visits-Michigan-State-shooting-victim.html",
    "content": [
        "PHILADELPHIA (AP) - James Harden sank the overtime 3-pointer that sent the 76ers to a playoff victory and instantly waved over John Hao, a paralyzed Michigan State shooting survivor who developed a long-distance FaceTime bond with Philadelphia's star guard.",
        "Harden had just scored 42 points, removed his sneakers, signed them and handed them to his new friend.\"He brought me good vibes, good energy,\" Harden said.Hao was all smiles as he looked on from the court, a needed respite from looming rehabilitation for the international student from China who attended Game 4 as Harden's guest.Before the game, Harden leaned into Hao and got small pats on the back before resuming his pregame drills.\"You look good,\" Harden told Hao.",
        "The 20-year-old Hao and his parents had been invited by Harden to attend a 76ers game once he was available to travel.Hao recently left a Chicago rehabilitation facility where he´d been since a February shooting on the East Lansing campus that killed three students and injured five others.Hao wore Harden´s No. 1 Sixers jersey and attended the game with his parents. Hao´s father also wore a Harden jersey and posed for pictures as the 76ers warmed up behind him.Harden learned after the shooting that Hao was a fan of his and donated sneakers, money and then called the student to offer encouragement.\"I know it´s tough right now, just gotta be mentally strong,\" Harden said in February in video of the call. \"Just think about the positive things and keep pushing. Keep fighting. I got you.\"",
        "Harden also kept his promise that Hao could attend a game. The family watched the game from a club box at the Wells Fargo Center.\"When I got injured, he read the news about that, he just came to give us all the support we need,\" Hao told The Associated Press. \"I´m so appreciative of that.\"Hao said his spirits were strong and he was now a 76ers fan because of Harden.\"He taught me to keep strong,\" Hao said.The shootings at Michigan State happened in February during evening classes at Berkey Hall and nearby at the MSU Union. Students across the vast campus were ordered to shelter in place for four hours - \"run, hide, fight\" if necessary - while police hunted for Anthony McRae, 43, who eventually killed himself when confronted by police not far from his home in Lansing.Hao said he doesn´t know what´s next for him and still needs additional treatment. Hao said he was committed to graduating from Michigan State, though he may move back with his parents to China.\"I hope to get back to my normal life and rehab as soon as possible,\" he said.___AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP_Sports"
    ]
}