{
    "articleURL": "/wires/reuters/article-12054977/Sounders-vie-season-sweep-Sporting-KC.html",
    "content": [
        "The Sounders will look to complete a season sweep against Sporting Kansas City when the teams meet on Sunday in Seattle.",
        "The Sounders romped to a 4-1 victory at Kansas City on March 25 in a match that illustrated how differently the seasons have gone for these teams.Jordan Morris scored four of his team-leading eight goals for Seattle (6-2-2, 20 points), which entered the weekend atop the Western Conference table.The Sounders have yet to concede a goal at home, even battling defending MLS Cup champions Los Angeles FC to a scoreless draw the week before their win in Kansas City.Meanwhile, Kansas City (0-7-3, 3 points) is the last MLS team still searching for its first win of the season. Most recently, the Sounders lost 2-0 at home last weekend to a CF Montreal side that previously had yet to score or earn a point on the road.Despite all that, Sounders head coach Brian Schmetzer is wary of Sporting Kansas City, who have won on three of their previous four trips to Seattle.\"Look, Kansas City is a dangerous opponent. The longer you keep them around, the more dangerous they're going to (be). They have good attacking players,\" Schmetzer said this week. \"We've got to make sure that we understand we're at home. We want to try and score early, try and control tempo. But it'll be a challenge.\"",
        "Sporting Kansas City also are healthier now. Striker Alan Pulido has returned to the starting lineup after missing all of 2022 and the start of 2023 due to a knee injury. Midfielder Gadi Kinda made his first appearance since 2021 late in last weekend's defeat after being sidelined by a knee injury.And the Sounders have their own injuries.Fullback Nouhou (illness) and midfielder Cristian Roldan (concussion protocol) will sit out this match. And striker Raul Ruidiaz (hamstring) will miss another game, though that could slide Morris back into the center-forward role in which he excelled in Kansas City.\"For sure Jordan's a very good player. But there's so many other players in that group that you have to be aware of,\" Kansas City head coach Peter Vermes said of defending Morris. \"So I think a lot of the game is individual competing. You always have to be ready for service in the box. And you have to try to deny service to a lot of those guys.\"--Field Level Media"
    ]
}