{
    "articleURL": "/wires/pa/article-12045671/Local-elections-2023-The-councils-watch.html",
    "content": [
        "A total of 230 local authorities in England are holding elections on Thursday.",
        "Polls are also taking place to choose mayors in Bedford, Leicester, Mansfield and Middlesbrough.Local elections typically reflect voters’ attitudes about neighbourhood concerns, such as when bins are collected, the state of parks and pavements, or access to libraries and hospitals.But they can also be a verdict on the main political parties and their handling of big issues – which in 2023 is likely to mean the cost of living, the NHS and public services.Many of the seats being contested this year were last up for election in 2019, when the UK was still in the European Union, the prime minister was Theresa May and Labour was led by Jeremy Corbyn.Since then, the UK has had three further prime ministers – Boris Johnson, Liz Truss and Rishi Sunak – and these contests will be Mr Sunak’s first big electoral test.He will hope to keep Tory losses to a minimum, while Labour leader Sir Keir Starmer and Liberal Democrat leader Sir Ed Davey will be judged on whether their parties are able to make gains at the expense of the Conservatives.Across the country, smaller groups such as the Greens, residents’ associations and independents will hope to cause surprises and upsets.Here are some of the key contests to look out for in each region of England.",
        "– North-west EnglandBolton is the one to watch: a key battleground with every council seat up for grabs and both Labour and the Conservatives hoping to do enough to win a majority, though it will be a harder task for Labour, who need 12 gains, than the Tories, who need five (estimated declaration time: 4am, Friday).Labour should have no trouble holding its many north-west bedrocks, including Liverpool (5pm), Manchester (11.45am), Salford (3.30am) and Wigan (5pm), but will look to bump up its numbers in Hyndburn (2pm) and stay in control in Blackpool (3pm).The party will be disappointed if it fails to win a majority at Cheshire West &amp; Chester (7pm), where it currently holds 33 of the 70 seats. Another target is Wirral (5pm), where Labour needs 10 gains to turn minority control into overall control.Elsewhere, the Greens are looking to overtake Labour to become the largest party at Lancaster (5.30pm).– North-east EnglandLabour is keen to retake control of Middlesbrough (3pm) and needs only two gains to achieve this. A strong showing in Darlington (3pm) and Sunderland (1.30am) would also point to a good performance in an area where the party needs to make ground at a general election.Hartlepool (1.30am) could be the most intriguing contest in this part of the country, with both Labour and the Conservatives hoping to take control – and both needing six gains to do it. A win for Labour would have symbolic value, coming two years after the party suffered a disastrous parliamentary by-election defeat.",
        "– Yorkshire &amp; the HumberHull (3am) is a rare Liberal Democrat outpost in northern England. The party won it from Labour in 2022, but has only a wafer-thin majority that would disappear if Labour makes just two gains.In Sheffield (3pm), Labour and the Lib Dems are in power together, along with the Greens. All three parties hope to make gains.Another combination of parties is in power in York (8pm), in the shape of a Lib Dem-Green coalition. Labour is close behind the Lib Dems, however, with all council seats up for grabs, Mr Sunak recently visited the city, perhaps in the hope of increasing his party’s tally of just two seats.– East MidlandsDerbyshire is home to several key contests, including Bolsover (4am), where Labour is defending a slim majority, and Derby (6pm), where every seat is in play and where Labour is hoping to oust the minority Tory administration to become the largest party.South Derbyshire (5.30pm) may also end up another two-way tussle between the Tories and Labour.Independents could do well in this part of the country. In Ashfield (5.30am) in Nottinghamshire, they currently hold almost every seat and will be looking for another big win, while in Boston (3am) in Lincolnshire they could prevent the Tories gaining full control.",
        "– West MidlandsThe Liberal Democrats could pull off an upset in Stratford-on-Avon (1pm). The council has been run by the Conservatives for 20 years, but the party has seen its majority reduced to only two, and the Lib Dems would become the largest party if they take four seats from the Tories.Solihull (12.30pm) is another council where the Conservatives have lost ground in recent years, but here their main challengers are the Greens who may continue their advance.The biggest test in this region for Labour is probably Stoke-on-Trent (6.30am). The area was once a stronghold for the party, but the Tories now have all three MPs in the city and half of its councillors. Progress here for Labour would demonstrate it is winning back support in a former heartland.",
        "– Eastern EnglandThe result from Castle Point (1.30am) will be an early test of the fortunes of independent candidates, who currently have a majority on the council.The Greens could become the largest party in Mid-Suffolk (4pm), where they launched their election campaign, while the Conservatives are facing a strong challenge from the Lib Dems in Brentwood (2am). Labour is hoping for signs of a recovery in Thurrock (2am), though it would be a major upset if the Tories lost control.",
        "Colchester (3am) has seen the Tories, Labour and Lib Dems almost level-pegging in recent years and the outcome of this year’s contest – with a third of its seats in play – could impact on the current Labour-Lib Dem-Green coalition.– South-east EnglandThe Liberal Democrats have high hopes of progress in some of this region’s many Conservative areas. One council in their sights is Dacorum (4.30am), where Sir Ed launched his party’s campaign by driving a yellow tractor through a “blue wall” of painted hay bales.The party will want to tighten its control on Woking (4.30pm), where they won a tiny majority last year, and make some eye-catching gains in Hart (2.30am), where both Lib Dems and Tories are fighting for a majority, and West Oxfordshire (4pm), home to former Conservative prime minister David Cameron. There may also be signs of a Lib Dem advance in places such as Surrey Heath (3pm) and Wokingham (3pm).Elsewhere, in Brighton &amp; Hove (5pm) the Greens will want to maintain their status as the largest party in the face of a possible Labour advance, and Labour and the Tories both hope to do well in the ultra-marginal council of Crawley (1.30pm).– South-west EnglandThere are further chances in this region for the Liberal Democrats, as the party hopes to increase its slender majority in Cotswold (3am) and hold off a Tory revival in Torbay (2pm).",
        "The Forest of Dean (2.30pm) could be fertile ground for the Greens and independents.Sir Keir Starmer paid an early campaign visit to Plymouth (4am), where his party needs five gains to take control. The city is currently run by a minority Tory administration, which faced a backlash after it chopped down 110 healthy city centre trees overnight.Sir Keir launched his party’s campaign in Tory-run Swindon (4pm). If Labour manages to win control here – taking six of the 19 seats up for grabs – it will have had a very good election indeed."
    ]
}