{
    "articleURL": "/sport/nhl/article-12057957/New-Jersey-Devils-throttle-Carolina-Hurricanes-winning-8-4-making-2-1-series.html",
    "content": [
        "Devils center Jack Hughes bagged two goals and two assists in the victory The home team has won every game so far in this competitive series DailyMail.com provides all the latest international sports news Jack Hughes scored twice, collected two assists, and won a fight as the New Jersey Devils took control with a three-goal first period and cruised to an 8-4 victory over the visiting Carolina Hurricanes on Sunday afternoon in Game 3 of their semifinal series in Newark, N.J.",
        "Carolina leads the best-of-seven series 2-1 with Game 4 on Tuesday in Newark. Facing a 2-0 deficit for the second straight series, the Devils ensured the series will return to Raleigh, N.C. The home team has won every game in this series so far.Hughes scored New Jersey's second goal for his first tally since Game 4 of the quarterfinal series against the New York Rangers. He also registered the primary assist when Timo Meier opened the scoring and got the secondary assist with a pass to brother Luke Hughes that led to Damon Severson's goal in the second.Michael McLeod scored a short-handed goal in the first, marking his second straight home game with a goal on the penalty kill. ",
        "Nico Hischier scored a goal and collected an assist while Miles Wood finished off a breakaway early in the third.Dawson Mercer collected three assists while Luke Hughes, John Marino and Jesper Bratt contributed two assists apiece as the Devils scored their most goals in the postseason since a 10-4 win over Washington in Game 3 of the 1988 Patrick Division finals.After Akira Schmid allowed seven goals in two lopsided losses, New Jersey turned to Vitek Vanecek. Vanecek made 26 saves in his first start since Game 2 against the Rangers on April 20.",
        "Sebastian Aho scored for the Hurricanes and Jordan Martinook scored on a penalty shot with 7:42 left in the second when Carolina was short-handed.Jordan Staal and Seth Jarvis netted short-handed goals 50 seconds apart in the third.Frederik Andersen allowed four goals on 12 shots before being pulled. With Antti Raanta held out due to an illness, Pyotr Kochetkov allowed four goals on 22 shots.",
        "Meier opened the scoring 5:58 in when he got a pass from Jack Hughes from behind the net and tucked the puck inside the left post. The Devils took a 2-0 lead nearly five minutes later when Jack Hughes ripped a shot from the lower edge of the left circle by Andersen.McLeod made it 3-0 with 7:29 left when he sped down the left side past Carolina's Brent Burns and Jarvis, stopped in front of the crease and then slid the puck through Andersen's legs.The Devils chased Andersen when Hischier scored 53 seconds into the second after Bratt's backhanded pass caromed off Brett Pesce's skate.PANTHERS 3, MAPLE LEAFS 2  Sam Reinhart scored 3:02 into overtime and the Florida Panthers beat the Toronto Maple Leafs 3-2 on Sunday night to take a commanding 3-0 lead in their Eastern Conference semifinal series.Reinhart dumped the puck off the boards behind the net to set up his game-winner, taking a pass back from Anton Lundell and scoring to give Florida its first 3-0 series lead in 27 years.",
        "Anthony Duclair and Carter Verhaeghe scored for Florida, and Sergei Bobrovsky stopped 22 shots.Sam Lafferty and Erik Gustafsson scored for Toronto. Joseph Woll stopped 18 of the 21 he faced for the Maple Leafs after he relieved starter Ilya Samsonov, who stopped all eight shots he saw before leaving early in the second period with an injury.Game 4 is Wednesday night.",
        "KRAKEN 7, STARS 2The Kraken took a 2-1 lead in their Stanley Cup Playoff series against the Dallas Stars following Seattle's one-sided 7-2 win on Sunday night.Seattle spread the scoring around throughout the night as each of their seven goals was scored by a different player.Mason Marchment and Jani Hakanpaa were the only two players to score goals for Dallas."
    ]
}