{
    "articleURL": "/news/article-12042085/Father-took-children-primary-school-term-time-trip-Disney-World-fumes-480-fine.html",
    "content": [
        " Paul Benson from Redcar says his family break turned into a 'criminal activity' Father-of-three says going on holiday at any other time 'only for super earners' He says fines arrived in the post in December and ruined ChristmasA father who was fined nearly £500 after taking his children on holiday during term time has defended his decision because the trips were £8,000 cheaper.",
        "Paul Benson, 35, and wife Jessica, 34, were ordered to pay a total of £480 for twice taking their two children on holiday to Disney World in Florida.He says his children were 'ostracised' at their primary school, who he says made them feel their family break was a 'criminal activity'.But he said the family was right to jet off for the breaks in September as the price of their two-week stay was £3,700, rather than £12,000 in peak season.Paul says he was shocked by critical comments he received from teachers, adding that going away during holiday periods was now just for the 'super earners'.",
        "He said: 'It wasn't so much the fine that bothered us, but because of the fine, it meant it was a criminal activity to be able to spend time with our family.'Teachers would remind us and say it's affecting their education, and their education would suffer as a result.'But our eldest child was one of the top performers in her SATS. So it contradicted what they were saying all the way along. We just found it a massive blow to us.'My wife said to me it feels like only the privileged people can have a holiday - the super earners who can afford to go. It's not an equal opportunity.'",
        "Paul from Redcar, North Yorkshire, said he had first taken his two children, Ruby and George, out of school in September for a trip to Disney World, Florida, in 2018. He then repeated the trip last year during the same period when the children, now aged 12 and 10 respectively, were accompanied by his new baby, two-year-old Olive.But on both occasions, he said teachers had warned him about taking the time off before informing Redcar and Cleveland Council, who issue fines for non-attendance, about their unauthorised trips.",
        "Paul said his wife, who is an operating department practitioner in the NHS, was limited in the time that she could take off during normal school holiday periods.And he said the time away was also a form of education that gave his children valuable insights into different cultures and experiences.He added: 'My wife works for the NHS, so obviously during the pandemic, there was a massive backlog for operations. It's very competitive when staff want to take holidays. She couldn't really take time off during the holidays.'Paul said it 'wasn't nice' to receive fines for taking his children out of school, which arrived in the first week of December, just before Christmas.",
        "And he called for councils to be more 'fair' with parents after learning that friends of his at different schools had not been fined for doing the same thing.",
        "He said: 'It was a massive sting trying to get Christmas presents, and then you get that massive fine coming through the door.'So I think it needs to be done more fair. I've got some friends with kids at different schools and councils and the teachers have a different approach.'Redcar &amp; Cleveland Borough Council has been approached for comment."
    ]
}