{
    "articleURL": "/wires/ap/article-12048721/Investigator-ordered-client-tracked-Reno-mayor.html",
    "content": [
        "RENO, Nev. (AP) - A Nevada judge ordered a private investigator on Thursday to identify the person who hired him to track Reno Mayor Hillary Schieve and an ex-county commissioner with GPS devices attached to their cars ahead of the November election.",
        "Lawyers for private investigator David McNeely argued that the name of his client was a trade secret and that release of the information would harm his ability to do business in violation of state trade laws.But Washoe County District Judge David Hardy ruled that Nevada trade law provides him no such immunity. He ordered McNeely to produce documents identifying the client and said most of the claims in a lawsuit filed by Schieve and former Washoe County Commissioner Vaughn Hartung could proceed. The lawsuit targets McNeely and his company.Hardy denied McNeely's motion to dismiss the lawsuit. He also dismissed three of eight claims for relief sought by Schieve and Hartung, including one alleging negligence, but said the others would go forward, including allegations of invasion of privacy.\"The use of a GPS tracking device to monitor the movements of a person could be a tortious invasion of privacy because a person has a reasonable expectation of privacy with respect to his or her daily movements in a motor vehicle,\" Hardy wrote in a six-page ruling.\"The identity of a private investigator's single client (in contrast to voluminous customers lists) is not embedded within the definition of a trade secret,\" he wrote.Hardy said discovery in the case could continue. He has not yet scheduled any new court appearances.",
        "Hardy also wrote in a footnote of the ruling that McNeely \"asserted a novel legal theory in good faith.\"The judge acknowledged \"the irreparability of harm if Mr. McNeely's client's identity is disclosed now but an appellate court later reached a different conclusion.\"Therefore, he said he was inclined to grant a stay of proceedings if McNeely chooses to appeal the matter to the Nevada Supreme Court or seek other temporary relief on an emergency basis.The tracking device was on Schieve´s vehicle for at least several weeks and on Hartung´s vehicle for several months, their lawsuit says.Schieve filed suit in December. The suit was amended in February to include Hartung's claims.Both won re-election in November. Hartung since has resigned to accept an appointment as chairman of the Nevada Transportation Commission.Schieve said in court documents she brought the GPS tracking device to neighboring Sparks Police Department after a mechanic noticed it while working on her vehicle last year in the thick of campaign season - about two weeks before she won re-election for mayor. Sparks police were able to determine that it had been purchased by McNeely.The lawsuit alleges that the investigator trespassed onto Schieve's property to install the device without her consent. It says Schieve was unaware until a mechanic noticed it while working on her vehicle.",
        "Hartung said in court documents he discovered the other tracking device after being made aware of records that showed his vehicle locations at his personal residence and other places."
    ]
}