{
    "articleURL": "/sport/football/article-12058711/Brighton-Mac-Allister-DOES-contract-clause-Man-United-Liverpool-alert.html",
    "content": [
        "Alexis Mac Allister, 24, is wanted by the likes of Liverpool and Manchester UnitedThe Brighton and Argentina midfielder won the Qatar World Cup in winter 2022 He has a clause in his deal which may make it easier to exit the club this summerIn-demand Brighton midfielder Alexis Mac Allister has a clause in his contract which could make it easier to leave this summer, according to reports.",
        "The World Cup winner with Argentina at Qatar 2022 is now a key cog in Brighton's midfield as they aim to secure European football next season.Mac Allister, 24, is set to be a wanted man this summer with English giants like Manchester United and Liverpool strongly linked with his signature.The talented playmaker put pen to paper on a new deal keeping him until 2025 in October, with speculation that contract contains a release clause. And as reported by the Athletic, the deal does have a mechanism which interested clubs could use to help grease the wheels of a move this summer.",
        "Though it is not clear what the clause is or how it may be used to facilitate a switch, knowledge of it has put several clubs on alert regarding Mac Allister's future, it is believed. It is not thought to be a simple release clause - where clubs could simply pay a certain amount and Brighton would have to accept the offer; it is reportedly a clause that allows the Seagulls more input and control over the outcome. Given the contract's complexities, it is by no means certain that Mac Allister will leave this summer, and there is no agreement in place yet. Mac Allister scored the only goal of the game as Roberto De Zerbi's men kept their continental dream alive with a 1-0 win against Manchester United on Thursday.",
        "Interest in Mac Allister and fellow midfield star Moises Caicedo may well crystallise into formal approaches or offers soon.But given their push for European qualification, any definite decisions on either player will probably not be made until the end of the season.They host relegation-threatened Everton on Monday evening. "
    ]
}