{
    "articleURL": "/wires/reuters/article-12042965/Russian-US-JV-scraps-plan-build-large-gas-turbines-Russia.html",
    "content": [
        "This content was produced in Russia, where the law restricts coverage of Russian military operations in Ukraine.",
        "MOSCOW, May 3 (Reuters) - A Russian-U.S. joint venture has said it has abandoned plans to build large-capacity gas turbines in Russia under licence from General Electric Co .Russia has for years been trying to start manufacturing its own medium- and large-capacity gas turbines for power plants, or \"localising\" .The joint venture between GE and the Russian state energy holding InterRAO had planned to produce both by 2025-26, making 90% of the components in Russia.But GE suspended operations in Russia last year after Moscow sent its armed forces into Ukraine.The annual financial report from the joint venture, Russian Gas Turbines (RGT), said \"external developments\" had caused \"significant changes to the format and extent of General Electric's involvement in joint projects to localise gas turbine production, with unfavourable consequences for the company\".In the report, RGT said a new localisation plan \"does not include activities in relation to the GT13E2 Gas Turbine Unit Localisation facility\".RGT, in which InterRAO holds about 51%, had in 2020 bought the licensing rights from GE to manufacture both GE 6F.03 turbines producing 79-87 megawatts, and GT13E2 turbines with an output of 181-210 MW.InterRAO had planned to invest up to 45 billion roubles ($570 million) in the joint venture.As of March 31, GE had approximately $0.3 billion of remaining assets in Russia and Ukraine, mainly in the power business, in activity not restricted or subject to sanctions, GE said in its first-quarter report.",
        "InterRAO has an option to buy GE's stake in the joint venture, but it is unclear whether it has been exercised.The Russian holding, which last year bought Siemens Energy's turbine business in Russia, declined to comment.GE did not immediately respond to a request for comment. ($1 = 79.4205 roubles) (Reporting by Anastasia Lyrchikova; additional reporting by Alexander Marrow; Editing by Kevin Liffey)"
    ]
}