{
    "articleURL": "/wires/ap/article-12048445/Soldier-wont-new-trial-sue-police-violent-stop.html",
    "content": [
        "NORFOLK, Va. (AP) - A U.S. Army soldier won't get a new trial for his lawsuit against two police officers after he was pepper- sprayed, struck and handcuffed during a traffic stop in rural Virginia, a federal judge has ruled.",
        "Video of the incident in the small town of Windsor got millions of views after Caron Nazario filed his lawsuit in 2021. For many, the stop highlighted fears of mistreatment among Black drivers and raised questions about reasonable police conduct.Nazario, who was never arrested, sought $1 million in damages in his initial lawsuit. But in January, a jury in Richmond mostly sided with two police officers and awarded the soldier a total of $3,685.Nazario almost immediately requested a new trial, claiming the jury's verdict was against the clear weight of the evidence, among other grounds.U.S. District Judge Roderick C. Young disagreed. In a ruling issued Wednesday, Young wrote that Nazario \"makes no showing that the jury´s findings were not within their discretion.\"\"The jury is at liberty to weigh the credibility of the evidence as it sees fit,\" the judge wrote.",
        "The traffic stop occurred about 30 miles west of Norfolk in December 2020. Video shows Windsor police officers Daniel Crocker and Joe Gutierrez pointing handguns at a uniformed Nazario behind the wheel of his Chevy Tahoe at a gas station.The officers repeatedly commanded Nazario to exit his SUV, with Gutierrez warning at one point that Nazario was \"fixing to ride the lightning\" when he didn´t get out.",
        "Nazario held his hands in the air outside the driver´s side window and continually asked why he was being stopped.Nazario also said: \"I´m honestly afraid to get out.\"\"You should be,\" Gutierrez responded.Nazario stayed in the vehicle. Gutierrez went on to pepper-spray him through the open window. Once Nazario exited the SUV, the officers commanded him to get on the ground, with Gutierrez using his knees to strike Nazario´s legs, the soldier's lawsuit stated.In court documents, Nazario said he developed anxiety, depression and PTSD. A psychologist found that Nazario, who is Black and Latino, suffers from race-based trauma associated with violent police encounters.\"Mr. Nazario recalls that he thought he was going to die that evening,\" his lawsuit stated.Nazario sued Crocker and Gutierrez. Crocker was still on the force. But Gutierrez was fired in April 2021, the same month Nazario filed his lawsuit.The men denied ever threatening to kill Nazario. They contended that Nazario misconstrued Gutierrez´s statement that Nazario was \"fixing to ride the lightning.\" Gutierrez spoke those words while holstering his gun and drawing his Taser and was referencing his stun gun, not an execution, according to court filings.Crocker and Gutierrez argued that they performed their duties within the law after Nazario failed to immediately pull over and refused to exit his vehicle. Plus, a federal judge already found they had probable cause to stop Nazario for an improperly displayed license plate, and to charge him with eluding police, as well as obstruction of justice and failure to obey.",
        "In court filings, Gutierrez questioned the extent of Nazario's mental anguish and pointed out that the solider was still in the National Guard in the months leading up to the trial.During the trial in January, the jury had to consider Nazario's allegations that he was illegally searched, assaulted, battered and falsely imprisoned.The jury found Gutierrez liable for assault and awarded Nazario $2,685 in compensatory damages.The jury also awarded Nazario $1,000 in punitive damages for Crocker's illegal search of Nazario´s SUV. A federal judge had already ruled that Crocker was liable for the search.But the jury found in favor of Crocker and against Nazario´s claims of assault and battery and false imprisonment. The jury also found in favor of Gutierrez regarding the soldier´s claims of battery, false imprisonment and illegal search.While denying Nazario's request for a new trial on Wednesday, the judge acknowledged that \"reasonable persons could find\" for the soldier. But Young also wrote that the weight and credibility of the evidence wasn't enough to \"require the extraordinary step of overturning a jury verdict.\"Young did agree with Nazario on one matter: Based on Virginia law, the soldier was owed compensatory damages on top of the $1,000 in punitive damages the jury awarded for Crocker's illegal search.",
        "Nazario was awarded $1 in nominal damages \"in order to vindicate his rights under the U.S. Constitution,\" the judge wrote."
    ]
}