{
    "articleURL": "/tvshowbiz/article-12044479/Cynthia-Nixon-joins-picket-line-outside-Netflix-office-New-York-support-WGA-strike.html",
    "content": [
        "The 57-year-old actress chanted as she joined the picketing lines in front of Netflix's office in Manhattan in support of Writers Guild of America membersCynthia also shared a video clip telling an interviewer, 'A writer is everything to a show'The HBO star was joined on the picket line in NYC with other stars including Ilana Glazer, Bowen Yang, Michael Rapaport and Jeremy O. Harris Cynthia Nixon showed her solidarity for striking television and film writers by joining the picket line on Wednesday in New York City.",
        "The 57-year-old actress held signs and chanted as she joined the picketing lines in front of Netflix's office in Manhattan in support of Writers Guild of America members.The Sex And The City star shared her pro-union protesting on social media.'I stand with the WGA and visited the NYC picket line today organized by @wgaeast. Without writers there would be no tv or film—they deserve a fair contract now!,' she wrote in the caption for her roughly 1.2 million followers.Cynthia added that she would be sharing upcoming picketing on her Instagram Stories.",
        "She also shared a video clip telling an interviewer, 'A writer is everything to a show.'Cynthia added that 'everything starts with a writer's idea' and noted that television was 'completely writer focused', but the contribution of writers was not reflected in the sharing of the profits.The HBO star told The Hollywood Reporter that the 'spectre' of the last strike 15 years ago was looming as it was resolved after three months.'They were long strikes and I think that that is one reason everybody is pouring onto the picket line to try and make as much noise as possible right at the beginning. We're here. We're not going to be broken. No one's budging. We've got to negotiate,' Cynthia said.",
        "Cynthia was joined on the picket line in NYC with other stars including Ilana Glazer, Bowen Yang, Michael Rapaport, Jeremy O. Harris, Paul Scheer and June Diane Raphael.Zoe Lister-Jones, 40 was also seen picketing, and sported a black leather jacket and grey jeans. The first Hollywood strike in 15 years started on Tuesday as the economic pressures of the streaming era prompted unionized TV and film writers to picket for better pay outside major studios.Some 11,500 film and television writers represented by the union put down their pens and laptops after failing to reach a new contract with the trade association that represents Hollywood studios and production companies.The union is seeking higher minimum pay, more writers per show and shorter exclusive contracts, among other demands — all conditions it says have been diminished in the content boom driven by streaming.",
        "Late-night television was the first to feel the fallout, just as it was during the 2007 writers strike that lasted for 100 days.All of the top late-night shows, which are staffed by writers that pen monologues and jokes for their hosts, immediately went dark. NBC's 'The Tonight Show,' Comedy Central's 'Daily Show,' ABC's Jimmy Kimmel Live,' CBS's 'The Late Show' and NBC's 'Late Night' all made plans for reruns through the week.",
        "NBC's 'Saturday Night Live,' which had been scheduled to air a new episode Saturday, will also go dark and air reruns instead.The WGA strike may only be the beginning. Contracts for both the Directors Guild of America and SAG-AFTRA, the actors union, expire in June. Some of the same issues around the business model of streaming will factor into those bargaining sessions.The actors' union on Tuesday encouraged its members to join the writers' picket lines in solidarity."
    ]
}