{
    "articleURL": "/wires/reuters/article-12050389/Gold-pulls-near-record-levels-eyes-weekly-gain.html",
    "content": [
        "U.S. nonfarm payrolls figures due at 1230 GMT",
        "Gold up 2.3% for the weekGlobal gold demand fell in the first quarter of 2023, WGC says(Updates prices)By Arundhati SarkarMay 5 (Reuters) - Gold prices fell from near-record highs on Friday as investors waited for more economic cues, but banking woes and hopes for a pause in U.S. rate hikes kept safe-haven bullion on course for its best week in nearly two months.Spot gold fell 0.7% to $2,036.74 per ounce by 1138 GMT, which some analysts termed a \"consolidation\", but was up 2.3% for the week. U.S. gold futures shed 0.5% to $2,045.90.Gold hit $2,072.19 on Thursday, just shy of a record high of $2,072.49, after the Federal Reserve hinted that its marathon hiking cycle may be ending.Investors now await data including U.S. nonfarm payrolls figures at 1230 GMT, that could build the case for a rate cut, after Fed Chair Jerome Powell pushed back on such expectations.After a strong performance, gold's in a bit of a wait-and-see mode ahead of U.S. payrolls, and will be sensitive to \"short-term reversals in interest rate expectations, wider reaching deposit guarantees, and U.S. dollar strength\" in the short term, said UBS analyst Giovanni Staunovo.\"But, gold should remain a hedge within a portfolio context.\"",
        "Global stocks eked out small gains as investors focused on bets of central banks pausing rate increases in light of another rout in shares of U.S. regional lenders.Economic uncertainty and lower rates boost demand for zero-yielding gold.\"But if we see further panic around the debt ceiling or U.S. banks, hold onto your hats as I fear price action could get nasty around these highs and punish bulls and bears,\" said Matt Simpson, senior market analyst at City Index, warning that in \"times of severe stress all markets, including gold, can fall.\"Meanwhile, global gold demand fell in the first three months of 2023, the World Gold Council (WGC) said on Friday.Spot silver lost 0.7% to $25.88 per ounce, while platinum rose 0.7% to $1,046.87.Palladium gained 1.4% to $1,468.19.(Reporting by Arundhati Sarkar and Ashitha Shivaprasad in Bengaluru; Editing by Jane Merriman, Shilpi Majumdar and Krishna Chandra Eluri)"
    ]
}