{
    "articleURL": "/sport/formulaone/article-12052351/Its-Miami-nice-Lewis-Hamilton-galaxy-VIPs-blingiest-grid-walk-ever.html",
    "content": [
        "Liberty Media's dream is to stage ‘Super Bowl’ events at destination citiesGalaxy of VIPs expected among a 90,000 crowd at Sunday's race in MiamiPitt will drive a modified F2 car in front of 140,000 fans at British Grand Prix If Formula One could pack Miami’s confection of a venue into a box and carry it for export around the world, they would be tempted. It is the modern incarnation of their star-spangled sport.",
        "And if there is one driver who stands at the edge of this new frontier, he was sitting in the Mercedes motorhome every inch its poster boy with a big white watch and three rings per hand, beaming.Lewis Hamilton, 38, loves being in America, which may have led him to the optimistic conclusion spoken of on Thursday night that he would consider racing into his fifties. ‘Never say never,’ he said.Actually, we cannot yet be sure he will continue into his forties. But he did insist: ‘I’m going nowhere soon.’ Formula One bosses will have squealed in delight at that promise from their main draw.But, first, to the Miami vibe, the drama of which includes Lewis being accompanied by police outriders from the track in the less salubrious Miami Gardens area and along the Biscayne Boulevard to sanctuary in the dramatically sky-lined glamour of the place’s fame.",
        "It was against that backdrop that the Miami Grand Prix was meant to have played out. That was Liberty Media’s dream after they bought the sport in 2017, to stage ‘Super Bowl’ events at destination cities.But there was such a hue and cry from locals about the disruption entailed that a sticking plaster was found at Miami Dolphins’ Hard Rock Stadium 16 miles north of downtown. What a fine sticking plaster it looks this weekend for the second running of the race. Last year, in contrast, the place was buzzing with excitement, but barely ready.",
        "Behind the shiny celebs and the busiest and blingiest grid walk ever, the Paddock Club guests upstairs were suffering severe first-world privations for their £10,000 bill. Food ran out. Staff failed to show up. Emergency meetings were held.This glitch has been rectified, a whole new Paddock Club built, bars and restaurants added outside the garages. The paddock has moved — now ingeniously assembled on the stadium’s AstroTurf playing surface itself.A galaxy of VIPs, including Mike Tyson, is expected on Sunday among a 90,000 crowd. However, Brad Pitt will be here in spirit only, despite being closely associated with Liberty’s push to capture America.The Hollywood A-lister, 59, is starring in F1’s upcoming movie, intended to build on the evangelising work of Drive to Survive and the addition of a race on the Las Vegas Strip in November to sit alongside Miami and Austin on the US footprint.Pitt will even drive a modified F2 car in front of 140,000 fans at the British Grand Prix as filming starts on the weekend of July 9.Filming will then continue around the world for the rest of the season, with Pitt again in the cockpit, though not during sessions.Hamilton, co-producer of the so-far untitled film, is working on the script and says the finished article must be ‘authentic’.",
        "‘I like the direction the sport is all going in,’ he said. ‘I hope we get to Africa soon. It’d be amazing for the whole circus to experience that culture.",
        "‘I love all the older circuits most. Maybe in 20 or 30 years’ time some kid will see Miami as a historic track. But classics like Silverstone, Budapest, Zandvoort and Monza will always be special.’As for the wear and tear of a 23-race season, Hamilton was as unconcerned as you might be with a private jet sitting on the runway, saying: ‘It is not taking me longer to recover.‘When I was 22, I was just going home having a pizza. I didn’t have any specialists around me to help me navigate that. I didn’t have details of what to eat, how to replenish and all those things.’Which is why when asked if he could continue racing until his 50th birthday and beyond, Hamilton said with a smile: ‘Well, Brad is going in the movies in his fifties.’"
    ]
}