{
    "articleURL": "/wires/reuters/article-12044543/Key-moments-King-Charles-coronation.html",
    "content": [
        "LONDON, May 5 (Reuters) - From the religious symbolism of his anointment to the moment the crown is placed on his head, what are the highlights to look out for during the coronation of King Charles on Saturday?",
        "TIMINGSThe coronation ceremony will begin at 1000 GMT following a procession from Buckingham Palace. Unlike the coronation of Charles' mother Queen Elizabeth, which lasted almost four hours, Charles' ceremony will last about two hours.COACH PROCESSIONFor the coronation, Charles and his wife Camilla, who will be crowned queen during the ceremony, will break with tradition and travel from Buckingham Palace to London's Westminster Abbey in the modern Diamond Jubilee State Coach, made to commemorate his mother's 60th year on the throne.They will return in the 'Coronation Procession' in the 260-year-old Gold State Coach which weighs four tonnes and needs to be pulled by eight horses. It has been used at every coronation since King William IV's in 1831 and was first used by George III to travel to the State Opening of Parliament in 1762.The return journey will be much slower as the Gold State Coach can only travel at walking pace - but the distance itself will be 1.42 miles (2.29 km) about a third of the route taken by Queen Elizabeth in 1953 when millions thronged the streets.It will also involve some 4,000 armed forces personnel in a procession one mile long, making it the largest of its kind for several generations.ANOINTINGDuring the service, Charles will be anointed with holy Chrism oil, made using olives from the Mount of Olives and consecrated in Jerusalem.",
        "The tradition dates back to the Old Testament of the Bible which describes the anointing of King Solomon by Zadok the Priest and Nathan the Prophet, and has been maintained to emphasise the spiritual status of the monarch.\"This is often thought to be the most sacred part of the ceremony,\" Charles Farris, Public Historian At Historic Royal Palaces, said. \"It's an ancient and very symbolic ceremony ... historically it was akin to the anointing of priests and bishops.\"CAMILLACharles' second wife Camilla, whom he married in 2005, will be separately crowned queen during the ceremony, and like her husband, anointed by the Archbishop of Canterbury, Justin Welby.She will be crowned using the crown of Queen Mary, commissioned and worn by the consort of King George V for the 1911 coronation. This is being reset with diamonds from Queen Elizabeth's personal jewellery collection as a tribute to her.MUSICThe ceremony will feature 12 new works, which Charles commissioned or selected, including a new coronation anthem by musical theatre impresario Andrew Lloyd Webber.Of the music used at coronations through the centuries, the most notable is \"Zadok the Priest\" which was composed by George Frideric Handel as a coronation anthem for King George II in 1727 and has been sung at every one since.",
        "CROWNINGThe key moment of the ceremony will be when Charles - sitting on a coronation chair dating back more than 700 years - is given regalia, from bejewelled orbs and sceptres to swords and a ring.The culmination sees the 360-year-old St Edward's Crown, weighing in at 2.2 kg (4 lb 12 ounces) and a replacement for an original dating back to the 11th Century, placed onto Charles' head by the Archbishop of Canterbury.BALCONY SCENEHaving returned to Buckingham Palace, the big finale - as it is for weddings, jubilees and other major royal events - is the appearance by the family on the balcony at Buckingham Palace.A fly past by military aircraft including the Red Arrows Royal Air Force aerobatic team and historic planes from World War Two is expected, dependent on the weather.All eyes will also be on whether Charles' younger son Prince Harry appears, and on Prince Louis, the youngest child of heir Prince William, who stole the show during celebrations for Queen Elizabeth's Platinum Jubilee by covering his ears and screaming amid the din caused by the aircraft fly past.GUESTSThere will be about 2,300 guests inside Westminster Abbey, far fewer than the 8,000 in attendance for Queen Elizabeth's coronation in 1953.",
        "Among those will be the British royal family, including Prince Harry but not his wife Meghan, or his two children, with the ceremony taking place on son Prince Archie's fourth birthday.There will also be other foreign royals, officials and heads of state, with U.S. first lady Jill Biden representing the United States and China's Vice President Han Zheng attending on behalf of Beijing. (Reporting by Michael Holden and Sarah Mills, Editing by Angus MacSwan, Kate Holton and Janet Lawrence)"
    ]
}