{
    "articleURL": "/wires/ap/article-12052771/Before-Texas-mass-shooting-locals-felt-abandoned-police.html",
    "content": [
        "CLEVELAND, Texas (AP) - Manuela Lara's Mexican food stand is not far from the house on Walter Drive, the one with the Christmas lights still up, where a man next door with an AR-style rifle walked over and killed five of his Honduran neighbors.",
        "Lara is also an immigrant and has lived for years in the Trails End neighborhood, where residents say law enforcement was slow to respond to frequent gunfire long before the rural sheriff´s department drew scrutiny for taking 11 minutes to get to the scene of the April 28 shooting, and for the ensuing four-day manhunt.\"There aren´t enough patrols. The police don´t come over here,\" Lara said. \"This happened because police didn´t come in here.\"The capture of 38-year-old Francisco Oropeza Tuesday night has not eased concerns in the largely Latino neighborhood about 60 miles (100 kilometers) north of Houston, where many immigrant residents feel disregarded and disrespected by officials from the local level up to the governor.In the arrest's wake, even some law enforcement officials have questioned how the response was coordinated.Authorities have acknowledged it usually takes deputies from 30 minutes up to an hour to respond to calls in Trails End, but say they face challenges that are familiar to law enforcement across rural America, where firearms are common and officers are responsible for vast stretches of terrain. Three deputies were patrolling the 700 square miles (1,800 square kilometers) of San Jacinto County when the first call about the shooting came in as a harassment report at 11:31 p.m., according to the sheriff's office.",
        "\"We´ve got poor roads. We´re understaffed,\" Chief Deputy Sheriff Tim Kean said. \"Welcome to rural law enforcement.\"In the immediate aftermath of the shooting, sheriff's deputies got help searching for Oropeza from several local and state law enforcement agencies. But they didn't formally accept help from the FBI until the next morning, according to the bureau. And an official with the two-man agency that does much of the day-to-day police work in the neighborhood said they were left to learn about the shooting and manhunt the next morning through calls from neighbors and news reports.\"Maybe we could have caught him faster. I can't say that we would have, but when it happens in your own back yard you would hope you´d be the first to be notified,\" said Cpt. Peter Sparta of the San Jacinto County Constable´s Office. The sheriff's office generally doesn't coordinate with the area constable, who lives a 15-minute drive from where the shooting occurred, Sparta added.Oropeza is now in jail on five murder charges and awaiting the appointment of a lawyer. But some residents question whether the shooting will prompt action needed for local law enforcement to show up quicker next time they call. Others remain angry with Gov. Greg Abbott for calling the victims \"illegal immigrants,\" saying immigration status is irrelevant to their being the victims of gun violence.",
        "\"They´re human beings and they just lost their family,\" said Shawn Crawford, 52, who also lives on Walter Drive. \"It had nothing to do with politics, the border, the immigrants.\"Abbott, a Republican, drew widespread backlash for the comment and his office later apologized, acknowledging at least one of the victims was in the U.S. legally.Diana Velásquez Alvarado, 21, will be buried in the United States, according to her father, who said she had recently obtained residency after leaving Honduras eight years ago.Oropeza was a Mexican national who was deported four times between 2009 and 2016, according to U.S. Immigration and Customs Enforcement.Trails End is on the outskirts of Cleveland, a diverse town of about 8,000, and homes there sit on wide lots and under a dense canopy of pine trees. As in other rural places in Texas, the legality of firing weapons in one's backyard can be confusing depending on where one lives but seems to be largely tolerated by law enforcement as long as no one is hurt and nothing damaged. Complaints about such gunfire in the neighborhood were daily, according to the sheriff's office.Nearly 31% of Cleveland's population are Latinos, and their growing presence can be seen in businesses from taquerias to stores that sell products from Mexico and Central America. Some of the Hondurans killed in the shooting had lived in the U.S. for years, according to their families back home.",
        "Authorities say the shooting began after three of Oropeza's neighbors asked him to go farther away if he was going to fire his gun so late because a baby was trying to sleep.At a vigil for the victims a few days before Oropeza's arrest, Krystal Segundo was one of the many residents who complained about law enforcement not responding in the past to calls about gunfire from neighbors.They accused San Jacinto County Sheriff´s deputies of normally not taking any action.\"I told my husband, after this tragedy now we have so many police. Before, I never saw one officer pass or do anything,\" said Segundo, who has lived in the neighborhood for five years with her husband and four kids.Wilson Garcia, whose wife, Sonia Argentina Guzman, 25, and his 9-year-old son, Daniel Enrique Laso, were killed in the shooting, told reporters that people in his house called police five times after Oropeza brushed them off about firing his gun, and that each time a dispatcher told them help was coming.Deputies took 11 minutes to arrive, Sheriff Greg Capers said. That´s \"pretty quick,\" according to Kean. The chief deputy said one of the three working deputies was responding to a robbery at the time of the shooting, but didn´t specify where the other two were.",
        "The exact timeline of the police response to the shooting remains unclear because the sheriff´s office has yet to release call logs, 911 recordings and other records in response to public records requests.\"You got to remember the initial call on this was somebody firing their gun in the yard, all right. At that point, it wasn´t an attack,\" Kean said. \"So the aggravated robbery trumps the guy shooting in the yard.\"But Sparta, the constable´s captain, who said he grew up nearby, suggested the shooting might have been avoided if more resources went to doing routine police work there.\"You need to police these communities where these peoples´ houses are,\" he said. \"It prevents burglaries. It prevents things that just happen like this.\"___Weber reported from Austin and Bleiberg from Dallas. Associated Press videojournalist Lekan Oyekanmi contributed to this report."
    ]
}