{
    "articleURL": "/news/article-12054583/MAUREEN-CALLAHAN-Meghan-America-heart-joyous-coronation.html",
    "content": [
        "What a lost opportunity for the United States.",
        "Had Harry and Meghan the grace to accept largesse and privilege, they would have played a key role at the coronation of King Charles III and Queen Consort Camilla.Surely they would have been front-row.Surely they would have had a place on the balcony.And surely U.S. would have been represented in Great Britain as never before — as part of the monarchy! Never underestimate how awed we Americans are by British pomp and circumstance, the history that dwarfs our own, the displays of military might and national pride.The coronation matters to us, too.Saturday’s ceremony also offered a reassuring display of familial unity, doubtless forged in the crucible of Harry and Meghan’s repeated betrayals.",
        "To watch Charles’s coronation was to be reminded of his kindness towards Meghan at her wedding, of him walking her halfway up the aisle, literally guiding her through her first major royal ceremony. There was a callback to that today, Harry and Meghan’s wedding gospel choir singing ‘Alleluia (O Sing Praises)’ in Westminster Abbey.It seemed a graceful olive branch, though one likely to be swatted away.That tends to happen when one's default setting is grievance. Doubtless we’ll be hearing from Montecito soon about cultural appropriation or some such nonsense.If only Harry and Meghan had the maturity to see what had been right in front of them.",
        "The regret today on Harry’s face, the sheer discomfort as he was made to walk into Westminster Abbey alone, taking a seat in the third row — same as the disgraced Prince Andrew — was all too palpable.And well and truly deserved.Pursing his lips, taking an inordinate interest in reading the program, watching Camilla — who we know Harry despises — take her place in history was all too satisfying.Clearly, he never learned a simple truism: You get what you give.When he wasn’t obscured by Princess Anne’s red-feathered hat — shades of Meghan blocked by the candlestick at Queen Elizabeth II’s funeral, cheers to the Palace Brain Trust! — Harry looked towards William, Kate and their three children (the backs of their heads, anyway) with what seemed like a mixture of longing and regret.Oh, for him to be with them on the front row.",
        "To be the rascally uncle to his youngest rascally nephew. To be in full military regalia rather than a plain black suit — Dior, but still — shoulder-to-shoulder with his brother, the future king, cheered on by nations of millions.Alas, it’s all commercial flights and commoners now.All that lost status. All that supercilious lecturing about ‘unconscious bias’ and institutional racism, and to what end? What greater good?",
        "And here was King Charles, taking the unprecedented step of including leaders from multiple faiths: Jewish, Muslim, Buddhist, Hindu, Sihk.Here is a new King whose ceremony stressed humility, kindness, service and compassion.One can hear the glassware crashing in Montecito.Compassion has always been Meghan's line, hasn’t it? Kindness. Service. Recall, if you will, her clapback to the Queen, insulting the monarch's lifetime of duty with that petty public statement: 'Service is universal.'Meghan Markle always has to have the last word. Until today.The Royal Family sent her a devastating message without saying a thing.No amount of money from Netflix or Spotify, no amount of party invites from Ellen DeGeneres or dubious humanitarian award ceremonies could ever compare to the power Harry and Meghan would have had as working royals.",
        "Meghan’s biracial heritage and Harry’s ability to connect would not only have further modernized the monarchy but underscored the special relationship between the United States and Great Britain.And they burned it all down. Is it any coincidence that Jill Biden, First Lady of the United States, was seated so far back at the coronation? That Joe Biden, who has expressed public support for the Sussexes, opted not to attend? To snub the new king?Harry and Meghan, burning the bridges they purport to build.",
        "So much for taking down the monarchy. They barely even sideswiped it.Spontaneous applause erupted outside Buckingham Palace the moment Charles was crowned King.As for the notion that Meghan didn’t want to be there — please. We all read the reports of the back-and-forth between Buckingham Palace and Montecito, the demands the couple were making in exchange for their presence. Who really believes that Meghan Markle choose to miss such a historically significant event for a fourth birthday party?Think of the ways to monetize this most supreme of royal occassions! Content is king, and it looks like we have a second podcast season to fill.But it seems that someone didn’t get what she wanted. And, quite likely, Meghan wanted to avoid a repeat of last time — a greeting of hearty boos.Meanwhile Catherine, Princess of Wales, looked impeccably regal in her McQueen gown, dazzling headpiece and the late Princess Diana’s earrings – daughter Charlotte adorable in a miniaturized version of the same look.The actress in Meghan must have been dying. The costuming, the pageantry — the fealty on display!",
        "The sheer stagecraft and statecraft. The anointing of Kate as Diana’s successor. Frostbitten todgers, Elizabeth Arden cream and sex next to a box of Diana’s hair be damned!",
        "Hope spilling to Oprah was worth it.To see the thousands of Britons lining the streets in the rain, camped out for days, cheering on their new King and Queen as four thousand troops marched through the streets was to wonder: Do Harry and Meghan get it now?Sorry — that’s a rhetorical question. They’re likely too narcissistic to ever get it. The rest of us do, though.How grievously they miscalculated. How silly Harry was to think he could insult his closest family members in his Netflix series and sundry interviews and his book — and then think they'd welcome him back.This is the father he fantasized about bombing with a jet. There were so many jaw-dropping revelations in Harry's memoir that it's hard to remember them all, but this one has stuck with me: In a bizarre passage praising his father's work ethic — 'his own work was also a kind of religion' — and detailing his pride in sharing a love of piloting with Charles, he writes, in the same breath, of wanting to blow him up.It reads: 'He drove off. As he went down the track I told the Typhoon [aircraft]: New target. Gray Audi. Headed southeast from my position down track...'The Typhoon tracked Pa, did a low pass straight over him, almost shattering the windows of his Audi.",
        "'But ultimately spared him. On my orders.'A joke, clearly. But revealing, possibly.",
        "It’s amazing Charles included Harry or even wanted him there at all.At ceremony’s end, Harry was left to stand outside in the rain while nearly every other senior member of his family climbed into a horse-drawn carriage, led through the streets to their cheering subjects, taking pride of place on the balcony as he got in his little black car and headed straight to Heathrow, where he was seen smiling for the cameras.See? Harry’s happy! Never been happier, in fact.And we the people — Brits and Americans — were never so happy to see the back of him."
    ]
}