{
    "articleURL": "/wires/reuters/article-12047309/Jury-convicts-Proud-Boys-members-seditious-conspiracy-US-Capitol-attack.html",
    "content": [
        "Convictions represent victory for U.S. Justice Department",
        "One of five defendants acquitted on most serious chargeMistrial declared on a few charges jury could not resolve(Adds comments from Attorney General Merrick Garland and defense attorneys)By Sarah N. LynchWASHINGTON, May 4 (Reuters) - A jury on Thursday convicted four members of the far-right Proud Boys militia group including its former leader Enrique Tarrio of seditious conspiracy, finding they plotted to attack the U.S. Capitol on Jan. 6, 2021, in a failed bid to block Congress from certifying President Joe Biden's election victory.The verdicts after a trial lasting nearly four months in federal court in Washington handed another victory to the U.S. Justice Department, which Attorney General Merrick Garland said has secured the convictions of more than 600 people related to the Capitol rampage by supporters of then-President Donald Trump. Members of the Oath Keepers, another far-right militia, including founder Stewart Rhodes were previously convicted.In addition to Tarrio, Proud Boys members Ethan Nordean, Joseph Biggs and Zachary Rehl were convicted of seditious conspiracy - a plot to oppose the government with force - under a Civil War-era law. Conviction on the charge can carry up to 20 years in prison. Dominic Pezzola, the only one of the five defendants who did not play a leadership role in the Proud Boys, was acquitted of the charge.",
        "The 12-member jury, which deliberated about a week, also found Tarrio, Nordean, Biggs, Rehl and Pezzola guilty of other felonies including obstructing an official proceeding, a charge that also can carry up to 20 years in prison. They also were convicted of conspiring to impede Congress from performing its duties and obstructing law enforcement during a civil disorder.U.S. District Court Judge Timothy Kelly declared a mistrial on a few outstanding counts after jurors said they could not reach a consensus.Garland said the convicted men played a central role in setting into motion a \"heinous attack that sought to disrupt a cornerstone of our democracy - the peaceful transfer of power to a newly elected government.\"\"Today's verdict makes clear that the Justice Department will do everything in its power to defend the American people and American democracy,\" Garland added.The rampage occurred on the day when Congress was voting on formally certifying Biden's victory in the November 2020 election, with rioters attacking police with a variety of weapons. Shortly before the riot, Trump gave an incendiary speech to supporters urging them to go to the Capitol and \"fight like hell\" and repeated his false claims that the election was stolen from him throughout widespread voting fraud.Five people including a police officer died during or shortly after the riot. More than 140 police officers were injured.",
        "THE LONGEST CAPITAL RIOT TRIALThe trial of the Proud Boys members was the longest of any of those arising from the Capitol attack, with the jury hearing about 50 days of testimony since January.The jury was unable to unanimously reach a verdict on whether to convict Pezzola for conspiracy to obstruct an official proceeding, though they found the other defendants guilty of that charge. The jury also did not reach a verdict for all the defendants on some other charges related to property destruction at the Capitol and assaults against law enforcement.Attorneys for Tarrio and some of the other defendants vowed to appeal the convictions.\"We're currently working on the appellate process,\" Tarrio's attorney Nayib Hassan told reporters.Rehl's attorney Carmen Hernandez said of her client, \"He's got a little girl. ... And his veterans benefits are on the line in a case where he did not commit any violence.\"During closing arguments, prosecutor Conor Mulroe said the Proud Boys viewed themselves as a \"fighting force lined up behind Donald Trump and ready to commit violence on his behalf\" to overturn his election defeat.Prosecutors told jurors that Tarrio and the other defendants, some of whom led state chapters, purchased paramilitary gear for the attack and urged members of the self-described \"Western chauvinist group\" to descend on Washington.",
        "Defense lawyers told jurors their clients had no plans to attack the Capitol and had traveled to Washington merely to protest. Some defense lawyers sought to blame Trump, saying he was the one who urged protesters to descend on the Capitol.\"They want to use Enrique Tarrio as a scapegoat for Donald Trump and those in power,\" Hassan said of prosecutors during his closing argument.Of the five defendants, all but Tarrio entered the Capitol during the attack. Prosecutors said they were among the first to charge past barricades erected to protect the building. Tarrio was not in Washington that day. But prosecutors said he helped direct the attack from Baltimore after being ordered by a judge to stay out of Washington following his Jan. 4 arrest for burning a Black Lives Matter banner at a church.A sixth defendant, Charles Donohoe, pleaded guilty last year to charges including conspiracy to obstruct an official proceeding.(Reporting by Sarah N. Lynch; Additional reporting by Andrew Goudsward and Costas Pitas; Editing by Will Dunham)"
    ]
}