{
    "articleURL": "/wires/reuters/article-12049091/GRAINS-Corn-set-weekly-gain-Chinas-cancellation-U-S-cargoes-weighs.html",
    "content": [
        "SINGAPORE, May 5 (Reuters) - Chicago corn futures were poised on Friday to end the week with marginal gains, after dropping to a nine-month low on news of cancelled sales to China and strong competition from Brazil.",
        "Wheat is on track for a first weekly rise in three weeks as the market is being supported by uncertainties over a Black Sea export deal, which allows Ukraine to ship grains despite war with Russia.FUNDAMENTALS* The most-active corn contract on the Chicago Board of Trade (CBOT) was unchanged at $5.89 a bushel, as of 0020 GMT, wheat fell 0.2% to $6.44 a bushel and soybeans added 0.1% to $14.18-3/4 a bushel.* U.S. export sales of corn fell to their lowest weekly total on record, government data showed on Thursday, as overseas buyers cancelled purchases made earlier in the year.* Concerns about export demand for U.S. corn have weighed on prices for months and the futures market sank to a nine-month low earlier this week, as a massive crop in Brazil was expected to provide a glut of cheaper supplies.* For the week, corn is up 0.7%, wheat has added 1.7% and soybeans are down 2%.* Markets also had eyes towards the USDA's monthly World Agricultural Supply and Demand Estimates (WASDE) coming on May 12, with an expected decrease in exports.* Technical personnel from Turkey, Russia, Ukraine, and the United Nations will meet on Friday to discuss a deal that allows the exports of Ukrainian grains on the Black Sea, Turkish Defence Minister Hulusi Akar said.",
        "* The evacuation of Turkish-flagged ships and grain shipments from Black Sea ports as part of the deal will be discussed, Akar said.* Ukraine President Volodymyr Zelenskiy said a day earlier that Russia did not appear to be interested in extending the Black Sea grain deal, but that Kyiv was focused on looking for partners to fulfil the deal and was not looking for Russian interest.* Commodity funds were net buyers of CBOT wheat futures on Thursday, traders said. Funds were net sellers of corn, soybeans, soymeal and soyoil futures.MARKET NEWS* A global measure of stocks fell for the fourth consecutive day while the dollar gained some ground as the European Central Bank raised rates on Thursday and signalled the need for more tightening a day after the U.S. Federal Reserve also raised rates.DATA/EVENTS (GMT) 0145 China Caixin Services PMI April 0600 Germany Industrial Orders MM March 0600 Germany Manufacturing O/P Cur Price SA March 0600 Germany Consumer Goods SA March 0830 UK All-Sector PMI April 1230 US Non-Farm Payrolls April 1230 US Unemployment Rate April (Reporting by Naveen Thukral; editing by Uttaresh Venkateshwaran)"
    ]
}