{
    "articleURL": "/news/article-12059391/Utah-woman-discovers-shes-pregnant-hours-husband-23-tragically-killed.html",
    "content": [
        "Jonathan Rodriguez, 23, died from his injuries when the vehicle rolled on top of him as he was cleaning the yard at their home in Santaquin, UtahDespite the efforts of emergency services, the dad-of-two was pronounced dead at the scene. Daisy, his wife, found out she was expecting one day laterA woman has discovered she's pregnant just hours after her husband was killed when one of their sons climbed into his truck, pulled a faulty gear shift and ran him over.  ",
        "Jonathan Rodriguez, 23, died from his injuries when the vehicle rolled on top of him as he was cleaning the yard at their home on May 6 in Santaquin, Utah. Police said their son climbed into the vehicle and pulled on the gear shift, causing the truck to bolt down a slope and hit the dad and grandmother, Sonia.Despite the best efforts of emergency services, father-of-two Rodriguez was pronounced dead at the scene. His mother was airlifted to hospital, where she is still being treated for serious injuries. Just one day after his death, Jonathan's wife, Daisy Rodriguez, was rushed to the hospital too - where she found out she was pregnant with what will be their third child.",
        "The family described the miracle as Jonathan's 'final gift' to his beloved wife. The couple - who were each other's high school sweethearts - didn't know they were expecting another baby when the tragedy happened. They already have two sons, aged 3 and 5.  Jonathan has been remembered by his family as someone who 'loved his wife tremendously.'His sister-in-law Sara Munoz continued: 'Together they raised two young boys who loved their father. He was their role model and best friend. 'Jonathan loved his family and always put them first before anything else.'",
        "Writing on a GoFundMe page, she explained: 'On May 6th 2023 a devastating accident occurred in the home of my sister Daisy Rodriguez. 'My sister along with her husband and his family were fixing up their backyard, when tragedy struck. While working on the yard, a truck that was parked next to the house rolled backwards towards the yard. ",
        "'My sister's husband Jonathan Rodriguez along side his mother Sonia Rodriguez tried to stop the vehicle from continuing to roll down the yard that sits on a slope. 'But unfortunately their efforts cost them to be crushed by the truck. Paramedics arrived and tried to resuscitate Jonathan, but he was pronounced dead at the scene. 'His mother Sonia was life flighted to the hospital due to her extensive injuries and is currently awaiting multiple surgeries.'Jonathan was 23 years young with a full life of dreams and goals ahead of him. Those that knew Jonathan know that he was a great husband and an amazing father to his two boys. 'He worked hard to provide his family the beautiful life they had. His life was drastically cut short leaving behind his wife and his kids ages 3,5. 'His own family has also suffered the loss of a son and a brother while awaiting news of his mother.'",
        "In an update on May 7, Sara wrote on GoFundMe: 'My sister was admitted to E.R. last night due to some complications. 'After running some tests, She was told she is currently pregnant. Jonathan’s last gift to sister and they didn’t even know it.' "
    ]
}