{
    "articleURL": "/sport/football/article-12038017/Erik-ten-Hag-urges-Alejandro-Garnacho-use-new-deal-inspiration-improve-further.html",
    "content": [
        "Erik ten Hag had addressed Alejandro Garnacho and his family at CarringtonThe Man United boss urged the teenager to use his new contract as inspirationGarnacho signed a new five-year deal with Manchester United on SaturdayManchester United boss Erik ten Hag has told Alejandro Garnacho to use his new contract as inspiration to improve further, after the Argentine celebrated signing a five-year deal alongside his family.",
        "Garnacho signed his new contract with the Red Devils on Saturday, with the teenage winger committing his future to United until June 2028.The 18-year-old was joined by his family at United's training ground Carrington, where Ten Hag's offered his congratulations to Garnacho.Ten Hag praised Garnacho his forcing his way into United's team during his breakthrough season.The United boss, addressing Garnacho and his family, suggested the winger has the ability to do 'incredible things' and can help the club's pursuit of the Premier League and Champions League in the future.",
        "'He is improving and he has improved a lot,' Ten Hag said in a video on MUTV. 'That is why we are now here and he deserves this, a new contract. It is deserved by his performance and he has fought his way into the team.'It was a huge step and he did magnificently. Now, I hope and I think this new contract is an inspiration and a motivation to do even better. 'It is a big step and today you deserve it, you have to do some celebrations with your family, they are the ones who are in your heart.'This club needs players who can do incredible things. It is not only about 'we want to win'. Also, we want to win in a certain way. But winning is the most important and then we want to win in a certain way, because we are playing in the Theatre of Dreams.",
        "'And then this club has to win trophies and you want to win trophies, because in the end a contract is great but in the end of a career you want to collect trophies. You want to look back and say \"I won the Premier League, I won the Champions League, I was at the World Cup\".'I think he has the talent to do it but talent has to work, because talent that does not work will not go far. This is the start, a new start, a signed contract, and tomorrow new roles, new aims and go.'Garnacho is currently recovering from an ankle injury which has disrupted the second half of his season.The Argentine had scored four goals and made five assists in 31 appearances before the injury. ",
        "His new deal was announced on the deal it was revealed United had blocked his participation at the Under-20 World Cup in Argentina, which starts on May 20.It is understood that the winger made a personal plea to United boss Erik ten Hag to release him for the tournament, while Argentina youth-team coach Javier Mascherano also met with United officials in an attempt to secure Garnacho.The rising star and his family were shown visiting Old Trafford after he signing his fresh contract.",
        "Garnacho also took Ten Hag's advice to celebrated with his relatives, who he has thanked for supporting him 'every step of the way'.The star took his family to the Italian restaurant Cibo in Hale on Monday afternoon.He was pictured alongside both his Gran, as well as his girlfriend Eva Garcia after leaving the restaurant.Garnacho had revealed he and Garcia are expecting a baby boy, after posting a series of photos from a gender reveal party on Monday.One of the photos showed the couple holding up a Manchester United baby kit with his name on the back. "
    ]
}