{
    "articleURL": "/wires/reuters/article-12057647/Blue-Jays-rout-stumbling-Pirates-complete-sweep.html",
    "content": [
        "Whit Merrifield homered and drove in four runs Sunday as the visiting Toronto Blue Jays completed a three-game series sweep with a 10-1 win over the Pittsburgh Pirates.",
        "Daulton Varsho and Kevin Kiermaier also had home runs, and Danny Jansen drove in two runs for the Blue Jays. Brandon Belt went 3-for-4 with two runs.Toronto starter Yusei Kikuchi (5-0) pitched 6 1/3 scoreless innings, allowing four hits and two walks with three strikeouts.Carlos Santana had an RBI single for the Pirates, whose losing streak reached seven games.Pittsburgh starter Roansy Contreras (3-3) allowed five runs and nine hits in five innings, with four strikeouts and three walks.In the first, Bo Bichette hit a one-out single to right and Varsho moved Bichette to third with a double to the corner in right. After Matt Chapman struck out, Belt walked to load the bases. Merrifield reached on what was ruled an infield hit to second baseman Mark Mathias, whose throw to first was a little high. That brought in Bichette for a 1-0 Toronto lead.In the third, Chapman singled to left with one out and advanced to second on Belt's single to center. Merrifield followed with his homer to left, his first, to boost it to 4-0.Toronto added another in the fifth. Chapman walked, Belt doubled to the wall in center and, an out later, Jansen's dribbler groundout drove in Chapman for a 5-0 lead.Against Yimi Garcia in the eighth, Pittsburgh's Ke'Bryan Hayes singled up the middle and went to third on Connor Joe's double to right-center one out later. Santana broke up the shutout by driving Hayes home with a single to left to make it 5-1.",
        "In the ninth, Bichette singled ahead of Varsho's fifth homer, a shot to right that bounced into the Allegheny River, to increase the margin to 7-1. Jansen added an RBI double later in the inning, followed by Kiermaier's second homer of the year, to right, to make it a 10-1 blowout.The start of the game was delayed about 90 minutes because of rain.--Field Level Media"
    ]
}