{
    "articleURL": "/wires/ap/article-12051793/Kenyan-pastor-suspected-cult-deaths-remain-jailed.html",
    "content": [
        "NAIROBI, Kenya (AP) - A court in Kenya on Friday gave police five more days to hold a pastor facing possible terror-related charges in the deaths of more than 100 his congregants, many of whom are believed to have starved to death.",
        "Police rescued 15 emaciated parishioners from the 800-acre Kilifi County property of Paul Mackenzie last month. Four of them died after the group was taken to a hospital, and survivors told investigators the pastor had instructed them to fast to death before the world ends so they could meet Jesus.A search of Mackenzie's property, located in a remote forested area, found more than 100 bodies and dozens of mass graves dug out, authorities have said. Autopsies on the bodies were ongoing, but completed ones showed some of the buried people had died of starvation, strangulation or suffocation.Mackenzie was arrested two weeks ago for alleged links to cultism. A lower court freed him this week but he was rearrested and presented to a higher court. Police have said their investigations pointed to signs of radicalization.The court that ordered Mackenzie held for five more days is considering an application for a further 90-day detention.The pastor was arrested twice before - in 2019 and in March of this year - in connection with the deaths of children. He was released on bond both times, and those cases are still proceeding through the court system.",
        "Kenyan President William Ruto on Friday formed a committee of inquiry into the deaths.Ruto tasked the committee with establishing the circumstances under which people died and identifying other individuals and organizations that may bear responsibility and making recommendations.",
        "The country's broadcast regulator, the Kenya Film and Classification Board, sounded the alarm in 2017 on content televised by Mackenzie that might promote radicalization. The board´s former chairperson, Ezekiel Mutua, told local media that the content was taken off the air and law enforcement agencies were notified.Another pastor in the same county, Ezekiel Odero, was arrested last week in connection with the deaths of congregants at his coastal megachurch. On Thursday, a court said Odero could be released from jail if he posted a bond in the amount of 3 million Kenyan shillings (about $22,000) or cash bail of 1.5 million shillings ($11,000).Odero´s lawyers acknowledged after his arrest that 15 people died at his church but said the deaths were reported at a police station as required by law. Police have said there was no evidence at the time to suggest a crime was involved.The pastor remains under investigation for his ties to Mackenzie, from whom he bought a television channel in 2019.Kenya´s national communications authority last week suspended Odero´s TV channel for airing inappropriate content on exorcism during hours when adult programming is not allowed. ("
    ]
}