{
    "articleURL": "/sport/football/article-12047337/Will-Lionel-Messi-follow-Cristiano-Ronaldo-Saudi-Arabia-PSG.html",
    "content": [
        "Lionel Messi will leave PSG this summer after being suspended by the club35-year-old has been offered a £320m-a-year megadeal by Saudi club Al-HilalWill the Argentine be tempted to follow in Cristiano Ronaldo's footsteps?  We now know Lionel Messi will be leaving Paris Saint-Germain this summer. The million-dollar question is where will the Argentine star end up.",
        "Or, perhaps more accurately, it is a £320million question of whether Messi will accept the Saudi Arabian gold.That is the eye-watering sum the World Cup winner is reportedly being offered per year to join a club in the Middle Eastern country's Pro League.It doesn't really matter which club - though Al Hilal are the ones linked - because the Saudi government will help subsidise a deal that would make Messi the highest-paid athlete in the world.He would be earning nearly double the £175m-a-year his long-standing rival Cristiano Ronaldo is currently paid at Al-Nassr in the Kingdom.",
        "As Saudi Arabia continues to make power plays to establish itself as a global sports hub, the prospect of the two greatest players of their, or any, generation going head-to-head in their league is a mouth-watering one.At 35, Messi is moving from the autumn to the winter of his astonishing career.While Messi - and his family - may favour a move back to Barcelona, where he emerged from the academy ranks to become their greatest player, the Spanish club's well-documented financial issues are likely to prove a high hurdle.In order to register Messi's contract with LaLiga, who run Spain's top division, Barcelona need to lose around €200m [£175m] from their existing wage bill.",
        "If they re-signed Messi, who currently commands wages approaching £1m-a-week, they would have to sell several existing big earners to stay within the league limits.So while Barcelona fans are beginning to get excited that Messi's two-week PSG suspension after an unsanctioned ambassadorial trip to Saudi will lead him back to the Nou Camp, an awful lot of sacrifices will be required to make it a reality.There is interest from Inter Miami in the United States but in terms of pure financial incentive, the Saudi offer blows everyone else out the water.",
        "Messi already has ties to the country. Last year, he agreed to a £25m-a-year deal to work as a tourism ambassador for the Saudis.His visit with wife Antonella and their children Mateo, seven, and Ciro, five, on Monday of this week saw them pose for a set of nice promotional pictures which the Saudis no doubt plan to use in their holiday brochures.There are snaps of Messi with a falcon perched on his arm, playing board game Carrom, of the family learning the local craft of palm-weaving and everyone playing arcade games at a Riyadh amusement park.The Saudi minister of tourism Ahmed Al Khateeb tweeted: 'I am happy to welcome Messi and his family to Saudi to enjoy the magical tourist destinations and authentic experiences.",
        "'We welcome visitors from all around the world to experience a unique trip to Saudi Arabia and its hospitality.'",
        "Trips to the petting zoo or excursions to Diriyah could become regular occurrences if Messi signs for Al Hilal this summer and for an idea of the lifestyle, he only has to look at Ronaldo.The 38-year-old Portuguese star signed for Al-Nassr at the beginning of the year having left Manchester United by mutual consent following his criticism of the club in an interview with Piers Morgan.Initially, Ronaldo and his family were staying in the luxury Kingdom Suite at the Four Seasons hotel in the Saudi capital Riyadh.The 3,000ft suite, spread over two floors, offers sweeping views over the city and is so expensive there isn't even a cost listed on the hotel's website. Estimates put the cost of the bill for Ronaldo and his entourage at over £250,000.The five-star hotel's website boasts: 'Entertain guests with unparalleled views of Riyadh. Our newest two-storey suite spans the 48th and 50th floors of the hotel, with a soaring living room, a private office, a dining room and a media room.'Ronaldo and his family could enjoy 'the best of dishes from China, Japan, India and the Middle East, with the freshest ingredients to order' delivered directly to their room.",
        "Messi and his family could certainly stay here until they find more permanent accommodation should they arrive over the summer.Ronaldo, partner Georgina Rodriguez and their five children moved out of the hotel and into a new home in February, just in time for a visit from his mother Dolores Aveiro.The new home is said to be in an exclusive compound with state-of-the-art security and all amenities such as gyms, shops and restaurants nearby. It is understood the family are renting the mansion.Ronaldo and his family have also sampled some of the exclusive restaurants on offer in Riyadh, including Miyazo, which offers 'contemporary Japanese cuisine driven by passion.'He also shared a dinner of Lebanese food with Saudi minister of sports Prince Abdulaziz bin Turki al-Faisal in Diriyah.We've also seen Ronaldo attend various events related to his newly-adopted country. He donned traditional dress and posed with a sword to mark the anniversary of the country's foundation back in February.",
        "Messi, of course, would be even better placed to fulfil his ambassadorial role if he moved to Saudi itself but given Ronaldo has 579 million Instagram followers and Georgina 50m, simply posting any kind of picture in the country is priceless advertising.On the pitch, Ronaldo has scored 12 goals in 15 matches so far for Al-Nassr, who are currently second in the Pro League standings, three points behind leaders Al-Ittihad.",
        "With five matches remaining, Ronaldo still has the chance to lead his team to title glory, though it hasn't been entirely smooth.When Al-Nassr lost 2-0 to Al-Hilal last month, rival fans chanted 'Messi, Messi' at Ronaldo, who appeared to grab his crotch as he walked off the pitch. It does at least prove Messi will be a hugely popular addition to the league.The act was heavily criticised in some quarters, with lawyer Nouf bin Ahmed saying it was 'a crime of public dishonour' before calling for Ronaldo to be 'arrested and deported.'",
        "When coach Rudi Garcia left the club by mutual consent, it was reported the reason was that Ronaldo 'wasn't satisfied' with his tactics. It was also speculated Garcia had a 'blazing dressing room row' with the team.But everything Ronaldo has ever done is under the microscope and an insight by Piers Morgan to Tatler magazine earlier this year said the footballer and his family were 'absolutely loving it' in Saudi.When Rodriguez made her social debut at the Joy Awards, she was 'the talk of the city.'Throughout their spectacular careers Messi and Ronaldo have always competed goal-for-goal and trophy-for-trophy. They have always been rivals, though the frostiness has thawed with passing age.We could soon find out if Riyadh is big enough for the both of them. "
    ]
}