{
    "articleURL": "/wires/afp/article-12056019/Opposition-roadmap-undoing-Erdogans-legacy.html",
    "content": [
        "Turkey's multi-faceted opposition alliance wants to undo President Recep Tayyip Erdogan's two-decade legacy of highly centralised and religiously conservative rule.",
        "Here is a look at its plan of action should it win next Sunday's parliamentary and presidential vote.- End 'one-man regime' -Opposition leader Kemal Kilicdaroglu has portrayed his six-party alliance, which includes liberals, nationalists and religious conservatives, as a force for democratic change.The 74-year-old former civil servant has pledged to \"bring democracy to this country by changing the one-man regime\".The alliance vows to abandon the presidential system Erdogan introduced after winning a hard-fought constitutional referendum in 2017.Instead, it wants lawmakers to elect a prime minister and for parliament to have oversight over ministries.The president would be limited to a single seven-year term.\"Changing the political system will not be easy,\" said Bertil Oder, a professor of constitutional law at Istanbul's Koc University.Such changes require a three-fifths majority in parliament, which the opposition will struggle to win on May 14, he pointed out.- Release prisoners -Kilicdaroglu says his first order of business will be to release some of the most high-profile opposition figures jailed under Erdogan.",
        "These include the philanthropist Osman Kavala and the Kurdish leader Selahattin Demirtas, whose freedom has been long-sought by the West.The opposition pledges to restore \"independent and impartial\" courts, which Erdogan stacked with allies after surviving a bloody coup attempt in 2016.",
        "It also wants to revive freedom of expression and give independence to the media, now almost completely controlled by the government and its business allies.\"You will be able to criticise me very easily,\" Kilicdaroglu once quipped, pledging to abolish the criminal offence of \"insulting the president\".- Defend 'all women' -Representing the traditionally secular CHP party of Turkey's founder Mustafa Kemal Ataturk, Kilicdaroglu has worked hard to gain the trust of religiously conservative women who wear the headscarf.Kilicdaroglu has pledged to make the right to stay veiled in public guaranteed by law, to show he has no intention of reversing religious freedoms introduced by Erdogan.\"We will defend the rights of all women,\" Kilicdaroglu said, vowing to \"respect everyone's beliefs, lifestyles and identities\", including those of Turkey's LGBTQ community.Erdogan, by contrast, calls LGBTQ people \"perverse\".Kilicdaroglu also wants to rejoin the Istanbul Convention, a European treaty aimed at combating gender-based violence from which Turkey withdrew under Erdogan's orders in 2021.- Restore economic orthodoxy -The opposition vows an immediate return to economic orthodoxy and a break with Erdogan's \"Turkish economy model\".Erdogan's refusal to fight inflation by raising interest rates -- linked in part to his belief in Islamic rules against usury -- has sparked the worst economic crisis of his rule.",
        "The official annual inflation rate touched 85 percent last year. Independent economists believe the real rate could have been twice as high, erasing gains of a new middle class created during Erdogan's first decade in power.But a return to prosperity might take time, requiring the resuscitation of state institutions that became emaciated during Erdogan's era of centralised control.\"Whoever wins the election, Turkey's economy is unlikely to experience a quick recovery,\" said Erdal Alcin, a professor of international economics at Germany's Konstanz University.- Make peace -The opposition knows that Turkey has irritated its NATO allies by forging a privileged relationship with Russia since 2016. It wants to restore trust with the West while maintaining a \"balanced dialogue\" with Moscow to end the war in Ukraine.Ahmet Unal Cevikoz, the head of international relations in Kilicdaroglu's party, is also pushing for \"full membership of the European Union\", which has long remained on hold.But the priority, said Cevikoz, is on reconciling with Syrian President Bashar al-Assad -- an essential condition for the \"voluntary\" return of 3.7 million Syrian refugees living in Turkey."
    ]
}