{
    "articleURL": "/health/article-12038669/Vermont-Americas-suicide-tourism-state.html",
    "content": [
        "Republican Gov Phil Scott made history in expanding access to euthanasia Vermont is one of 10 states that allows assisted suicide in certain scenarios READ MORE: America appears to be following Canada's euthanasia free-for-all Vermont became the first state in the country to officially approve ‘suicide tourism’ today.",
        "Republican Governor Phil Scott signed a bill that allows terminally ill patients from anywhere in the country to seek end-of-life medicine in Vermont – even if the practice is banned in their home state.Campaigners in favor of assisted dying hailed the move, saying 'a state border shouldn’t determine if you die peacefully or in agony'. The US has been following the lead of northern neighbor Canada in liberalizing its assisted suicide laws in what critics are calling a euthanasia free-for-all.Nine other states allow the practice - Colorado, Hawaii, Maine, New Jersey, New Mexico, Oregon, Vermont and Washington, as well as the District of Columbia.A legal loophole in Oregon has allowed out-of-state patients to travel there to end their lives with a deadly cocktail of drugs. ",
        "Last year, the Oregon Health Authority and the Oregon Medical Board agreed to stop enforcing the residency requirement and to ask the Legislature to remove it from the in its assisted dying law. While the residency requirement is not effectively enforced in Oregon, and people have been able to travel there for end-of-life medicine thanks to the legal gray area, the law has not yet been changed, making Vermont the first state to officially lift the requirement. Operating in that legal gray area is Portland, Oregon doctor Nicholas Gideonse, who has begun advising terminally ill non-residents on travelling to Oregon to end their lives. ",
        "Dr Gideonse, an advocate of 'magic mushroom' therapy, said he was helping a Texan man suffering from Lou Gehrig's disease and a hospice patient on the East Coast, but added that there were not yet 'tons of people coming from all over'. A record number of Oregonians ended their lives with the assistance of doctors last year with 431 people receiving fatal prescriptions under the state's Death With Dignity Act (DWDA), and 278 people using them to end their lives.Kim Callinan, president and CEO of Compassion &amp; Choices, a nonprofit advocacy organization, said about the new Vermont law: 'We are grateful to Vermont lawmakers for recognizing that a state border shouldn’t determine if you die peacefully or in agony.'Patients routinely travel to other states to utilize the best healthcare options. There is no rational reason they shouldn’t be able to travel to another state to access medical aid in dying if the state they live in doesn’t offer it.' Under Vermont's Patient Choice and Control at End of Life Act, patients suffering from an incurable and irreversible disease that would kill them in six months can qualify for assisted suicide. They must be able to self-administer the medication and be capable of making their own healthcare decisions. Interested patients are required to make two requests orally to the physician over a certain timeframe and then submit a written request that they signed in the presence of two or more witnesses who aren’t interested parties.",
        "Then, witnesses must sign and affirm that the patient appeared to understand the nature of the document and was free from duress or undue influence at the time. A move to support assisted dying would on its surface be unexpected for a member of the Republican party, which typically objects to measures that would result in a loss of life. But Gov Scott has proven himself to be somewhat of an outlier in that he enshrined the right to abortion in the state's constitution about six months after the Supreme Court struck down the federal guarantee to abortion. But critics of assisted suicide are concerned that there are not enough safeguards in place to protect people with disabilities, who may be steered toward end-of-life care. Last year, two healthy Arizona women traveled to Basel, Switzerland on February 3, from their home in Phoenix to seek assisted suicide there, where it is fully legal. It is unclear how or where the sisters' died, though. It is claimed that they were helped by a third person who texted friends while posing as them. And in 2022, Dr Jennifer Gaudiani, a Colorado-based doctor who treats eating disorders, stoked controversy by prescribing a lethal dose to a patient with anorexia nervosa — a mental health and body image condition that often sees sufferers starve themselves.",
        "She defended the move by arguing that anorexia, while not as severe as cancer, is brutally lethal for sufferers and that patients with 'terminal' cases should be afforded access to MAiD where it is legal. Dr Guadiani also helped one 36-year-old woman obtain MAiD medications from a palliative care doctor. The woman died after ingesting the drugs.And in 2019, Seattle, Washington native Robert Fuller chose to take advantage of Washington's aid-in-dying law after a doctor diagnosed him with an aggressive cancer at the base of his tongue.In May of that year, he was given two syringes filled with a light brown liquid — a fatal drug combination mixed with Kahlua, his favorite alcohol — through a feeding tube in his abdomen. Major opponents of assisted suicide include the Catholic church and anti-abortion activists. According to the United States Conference of Catholic Bishops: 'Assisted suicide laws typically appear to limit eligibility to terminally ill patients who are expected to die within six months but don't distinguish between persons who will die within six months with treatment and those who will die within six months without treatment.",
        "Record numbers of people ended their lives in Oregon last year in America's most advanced doctor-assisted suicide program. Last year, 431 people received fatal prescriptions under the state's Death With Dignity Act (DWDA).",
        "'This means that patients with treatable diseases (like diabetes or chronic respiratory or cardiac disease) and patients with disabilities requiring ventilator support are all eligible for lethal drugs because they would die within six months without the treatment they would normally receive.'And in New Hampshire, where aid-in-dying bills have repeatedly failed in the legislature, the anti-abortion Right to Life group 'oppose[s] all forms of suicide, assisted or not, because of the self-evident truth that Life is an inalienable right. No individual can have the right to terminate himself or another person because only God, who created that human life, has that authority.' In the US, voluntary euthanasia —  when a patient is administered deadly drugs upon his or her request — is not legal. Only the dispensing of drugs to patients who wish to die and qualify under state stipulations, referred to as physician-assisted suicide, is. Total assisted suicides in the US since the first law was enacted in Oregon in 1997 have reached at least 6,000, though death data reporting varies by state and may be an underestimate. Before Vermont removed its residency requirement Tuesday, it had reached a settlement agreement with a terminally-ill Connecticut woman allowing her to take advantage of Vermont's law, provided she complies with other aspects of it. "
    ]
}