{
    "articleURL": "/tvshowbiz/article-12060153/Angelina-Jolie-47-pens-tribute-late-mothers-73rd-birthday.html",
    "content": [
        "Angelina Jolie has shared a heartbreaking tribute on Instagram.",
        "On Monday morning the Oscar-winning Girl, Interrupted actress posted an old photo with her mother Marcheline Bertrand.Jolie had blonder hair as she wore a white summer dress and beige straw hat while posing with her mom, who passed away in 2007, in the early Eighties.The resemblance of the 47-year-old Maleficent actress to her mother - who was also an actress - is unmistakable.In her caption, the mother of six - who was seen leaving Washington DC last week - penned a sweet message. 'Tomorrow would have been my mother’s 73rd birthday,' began the ex-wife of Brad Pitt.",
        "Jolie then explained that Marcheline passed away 15 years ago.It was 'after a long struggle with breast and ovarian cancer,' noted the humanitarian. 'In June, I will be a month away from the age when she was diagnosed,' she said.'I have had preventive surgeries to try to lessen chances but I continue to have check ups,' wrote the Those Who Wish Me Dead star.Jolie underwent a double mastectomy in 2013 so she would not get breast cancer.It was what is called a prophylactic double mastectomy. That means she had both of her breasts removed even though she had not been diagnosed with breast cancer. She said she did this because she carries a gene, called BRCA1, that significantly increases the odds of developing breast or ovarian cancer.",
        "Jolie then talked about her mother's personality.'My mom loved Hendrix. And would always sign her letters Kiss the Sky,' shared the Salt star.'It took on new meaning after she passed. Sending my love to those who have also lost loved ones and strength to those who are fighting at this very moment for their lives and the lives of those they love. ",
        "'And to other women, please take the time to look after yourself and go for your mammograms and blood tests or ultrasounds, particularly if you have a family history of cancer.'She then said that there was more info in her bio and added '#WOCD2023 #worldovariancancerday.'Beverly Hills, 90210 actress Shannen Doherty, who has cancer, liked the post. Jolie's father is actor Jon Voight whom she acted with in Tomb Raider. The two have had a difficult relationship but do not seem to be estranged.This comes after Jolie and her son Maddox were among the high-profile names to attend the White House state dinner in the nation's capitol in late April.This year, President Joe Biden and First Lady Jill Biden hosted South Korean President Yoon Suk-yeol and his wife Kim Keon-hee in celebration of the 70th anniversary of the U.S.-ROK alliance.Angelina and her eldest child, 21, were dressed to the nines for the lavish affair and had the pleasure of witnessing President Yoon belt out Don McLean's 1971 hit American Pie.",
        "Maddox - who was adopted by the actress from Cambodia in 2002 - is very familiar with South Korea after studying biochemistry at Yonsei University in Seoul.Angelina flew to South Korea to send her son off to college in August 2019.",
        "They first visited the school, as well as other college campuses in South Korea, in late 2018.Although he 'got accepted to other universities,' Maddox ultimately decided that Yonsei was the right fit for him, as reported by PEOPLE at the time.Along with biochemistry courses, the outlet claimed that Maddox was 'studying Korean language.'But Maddox's study abroad was interrupted due to the COVID-19 pandemic which forced him to trade in-person classes for online school.As a result, he returned to his family home in Los Angeles in March 2020, according to Angelina, who opened up about her son's education in an interview with Extra that year.",
        "Because his classes remained on Korea time, the Changeling star revealed that Maddox had no choice but to become a night owl. 'He had to stay back from Korea. He's going online, and so I think he starts at 6pm at night,' she told the outlet.Maddox eventually retuned to South Korea in March of 2021 after a year of remote learning.The Sun reported in 2021 that classes - specifically 'labs, studio and field study courses' - recommenced that April.",
        "Angelina previously gushed over her son's ambitious academic pursuits to PEOPLE in 2019, telling the outlet that she is 'nothing but proud' of him.She added: 'I look forward to all he will do.' It's unclear whether or not Maddox has officially completed his degree at Yonsei."
    ]
}