{
    "articleURL": "/wires/reuters/article-12059743/US-STOCKS-Wall-St-edges-lower-bleak-earnings-overshadow-rise-regional-banks.html",
    "content": [
        "Regional lenders extend gains from Friday",
        "PacWest rallies on dividend cut to bolster capitalApril CPI data awaited on WednesdayIndexes down: Dow 0.13%, S&amp;amp;P 0.07%, Nasdaq 0.24%By Shreyashi Sanyal and Shristi Achar AMay 8 (Reuters) - Wall Street's main indexes were flat on Monday as bleak earnings from companies including Tyson Foods and Catalent clouded a rebound in regional lenders ahead of a key inflation reading this week.Shares of Catalent Inc tumbled 26.0%, the biggest decliner on the benchmark S&amp;amp;P 500 index, as the contract drug manufacturer saw lower revenue and core profit in 2023.Tyson Foods dropped 12.3% on posting a surprise second-quarter loss and cutting its full-year revenue forecast, as prices for its beef and pork declined.On the other end, regional banks' shares stretched gains from a rebound on Friday, with PacWest Bancorp jumping 19.9% after the lender sharply cut its quarterly dividend to boost capital.Peers Western Alliance Bancorp and Zions Bancorp rose 3.9% and 3.2% respectively. Shares of such banks tumbled for much of last week on worries tied to the collapse of First Republic Bank.At 9:49 a.m. ET, the Dow Jones Industrial Average was down 44.29 points, or 0.13%, at 33,630.09, the S&amp;amp;P 500 was down 2.81 points, or 0.07%, at 4,133.44 and the Nasdaq Composite was down 29.59 points, or 0.24%, at 12,205.82.",
        "The spotlight will be on the Labor Department's inflation data on Wednesday, which is expected to show the consumer price index (CPI) likely climbed 0.4% in April after gaining 0.1% in March, while excluding the volatile food and energy components, the CPI likely increased 0.4% last month.Producer prices, weekly jobless claims and consumer sentiment data are all lined up through the week.Data points this week will help investors not only gauge whether the Federal Reserve's aggressive tightening cycle - including its most recent 25 basis point hike last week - is working towards tamping down inflation but also if fears of stagflation are founded.\"We're in an information vacuum right now, waiting for the next inflation data. And that's why you're seeing some of that uncertainty in the market,\" said Thomas Hayes, chairman at Great Hill Capital LLC.\"You had the 'good news is good news' on Friday and a rally knowing no one wants to go short into the weekend. You also have the debt ceiling working in the background, which is a concern for people. Until some of these things get resolved, we are not going to see a repeat of the rally anytime soon.\"President Joe Biden and top lawmakers from Congress are due to meet on",
        "Tuesdayto resolve the stand-off over the $31.4 trillion U.S. debt ceiling.Warren Buffett's Berkshire Hathaway Inc's Class B shares rose 1.2% after posting a $35.5 billion first-quarter profit, reflecting gains from stocks such as Apple.American Airlines Group Inc rose 4.7% after J.P. Morgan raised its rating to \"overweight\" from \"neutral\".Advancing issues outnumbered decliners by a 1.55-to-1 ratio on the NYSE. Declining issues outnumbered advancers for a 1.05-to-1 ratio on the Nasdaq.The S&amp;amp;P index recorded seven new 52-week highs and two new lows, while the Nasdaq recorded 31 new highs and 23 new lows. (Reporting by Shreyashi Sanyal and Shristi Achar in Bengaluru; Editing by Nivedita Bhattacharjee and Maju Samuel)"
    ]
}