{
    "articleURL": "/wires/reuters/article-12051105/Mali-sets-date-delayed-vote-saying-true-word-democracy.html",
    "content": [
        "BAMAKO, May 5 (Reuters) - Mali's military government on Friday set a new date for a delayed constitutional referendum meant to pave the way for presidential elections next year.",
        "The vote, initially scheduled for March 19, is the first in a series of polls meant to restore democracy in the West African country after two military takeovers since August 2020.It was delayed days before that date to give electoral management authorities more time to set up in all of Mali's 19 administrative regions.Government spokesman Abdoulaye Maiga announced on state television on Friday that the referendum would now take place on June 18. He added that the new date showed authorities were true to their word and democratic commitments.Mali's junta has pushed back against regional and international pressure to rapidly return to civilian rule, proposing lengthy transition timelines after failing to hold promised elections in February last year.The region's main economic and political bloc ECOWAS imposed stiff sanctions on the country at the start of 2022 for straying from its commitments.After months of negotiations with its rulers, the bloc accepted a new 24-month transition that was to begin in March 2022. It has lifted sanctions but kept Mali suspended from the bloc.Presidential elections are now scheduled to take place in February 2024.Mali's two coups were spurred in part by anger over the failure of authorities to block a violent Islamist insurgency that has spread through West Africa over the past decade.",
        "Similar frustrations contributed to two military takeovers in neighbouring Burkina Faso last year. Authorities there have pledged to restore democracy by next July.Military rulers in both countries have previously blamed election delays on insecurity, saying it made it difficult to organise polls. (Reporting by Tiemoko Diallo Writing by Sofia Christensen Editing by Nick Macfie)"
    ]
}