{
    "articleURL": "/wires/reuters/article-12057787/Siemens-SAP-say-EU-draft-Data-Act-puts-trade-secrets-risk.html",
    "content": [
        "By Foo Yun Chee",
        "BRUSSELS, May 8 (Reuters) - German business software maker SAP and German engineering company Siemens have joined U.S. tech giants in criticising draft EU laws on the use of data generated by smart gadgets and other consumer goods.EU countries and EU lawmakers are working on the details of the Data Act, proposed by the European Commission last year before it can be adopted as legislation.The draft law, covering EU consumer and corporate data, is part of a set of legislation aimed at curbing the power of U.S. tech giants and helping the EU to achieve its digital and green objectives.U.S. criticisms have included that the proposed law is too restrictive, while the German companies say a provision forcing companies to share data with third parties to provide aftermarket or other data-driven services could endanger trade secrets.\"It risks undermining European competitiveness by mandating data sharing - including core know-how and design data - with not only the user, but also third parties,\" the companies wrote in a joint letter to Commission President President Ursula von der Leyen, EU antitrust chief Margrethe Vestager and EU industrial chief Thierry Breton.\"Effectively, this could mean that EU companies will have to disclose data to third-country competitors, notably those not operating in Europe and against which the Data Act's safeguards would be ineffective,\" they said.",
        "Signatories to the letter dated May 4 and seen by Reuters included the chief executives of the two companies, Siemens Healthineers, German medical technology company Brainlab, German software company DATEV and lobbying group DIGITALEUROPE.The letter called for safeguards to allow companies to refuse requests to share data where trade secrets, cybersecurity, health and safety are at risk and that the scope of devices covered by the legislation should not be extended.Regarding a provision that allows customers to switch between different cloud providers, the companies said the legislation should preserve contractual freedom by allowing customers and providers to agree on contracts that work best for each business case. (Reporting by Foo Yun Chee; editing by Barbara Lewis)"
    ]
}