{
    "articleURL": "/wires/ap/article-12038535/Cap-strapped-Wild-sign-Marcus-Johansson-2-year--4M-deal.html",
    "content": [
        "ST. PAUL, Minn. (AP) - The Minnesota Wild signed right wing Marcus Johansson to a two-year, $4 million contract on Tuesday, securing a key player who was set to become an unrestricted free agent.",
        "Johansson's salary cap hit of $2 million for the next two seasons will give general manager Bill Guerin some valuable certainty in a time of little flexibility because of the dead money the Wild are carrying for the 2021 buyouts of Zach Parise and Ryan Suter.\"I think our players and our coaches deserve a lot of credit, because they´re fighting with one hand tied behind their back because of these cap restraints,\" Guerin said.The 32-year-old Johansson had six goals and 12 assists in 20 regular-season games for the Wild, who reacquired him on Feb. 28 before the trade deadline from Washington for a third-round draft pick. Johansson had two goals in six games in the playoffs for the Wild, who lost in the first round to Dallas. Johansson's presence on a line with Matt Boldy was a big lift down the stretch for the budding star, who had 15 goals and eight assists over his last 19 games.Johansson first came to Minnesota in 2020 from Buffalo in a deal for center Eric Staal. After one season with the Wild, he signed with expansion Seattle. Johansson has played 13 years in the NHL, mostly with the Capitals.The next two seasons of roster construction will be the most painful for the Wild, with more than $14.7 million per year counting against their cap - nearly 18% - for the Parise-Suter buyouts.",
        "Boldy's seven-year, $49 million contract extension kicks in next season. There's only about $8 million left under the cap, with goalie Filip Gustavsson a restricted free agent who will command a big raise after his breakout year. Third-line and fourth-line wings Gustav Nyquist, Ryan Reaves and Oskar Sundqvist will be unrestricted free agents, as will defenseman Matt Dumba.Replacing the 10-year veteran Dumba on Jonas Brodin's blue line pair with rookie Brock Faber, who joined the Wild just before the playoffs after his college career ended, seems like a given despite Dumba's leadership, skill and longevity.\"Things like that are going to be really important for us to have younger players in the lineup for cheaper, or maybe it´s a veteran guy who´s at a cheaper number,\" Guerin said. \"But we might have to make some moves to create space.\"Speaking at his season-ending news conference on Tuesday, Guerin ardently defended the Wild against the criticism they've faced for another first-round ouster - having lost eight straight series since the most recent time they advanced in 2015.\"I´m very disappointed. But I don´t view this season as a failure. Our team played well,\" said Guerin, who has spent four years with the Wild. \"We have a lot of new players. We have a lot of young players who are just getting going, and they weren´t a part of that.\"",
        "___AP NHL: https://apnews.com/hub/NHL and https://twitter.com/AP_Sports"
    ]
}