{
    "articleURL": "/wires/ap/article-12039591/Utah-judge-delays-implementing-statewide-abortion-clinic-ban.html",
    "content": [
        "SALT LAKE CITY (AP) - A state court on Tuesday blocked Utah´s first-in-the-nation ban on abortion clinics from taking effect Wednesday in a ruling in which the judge called the Republican-controlled Legislature´s objective in enacting the ban \"nebulous.\"",
        "The decision allows the state´s four clinics to continue providing abortions while Judge Andrew Stone takes more time to weigh the merits of a lawsuit filed by the Planned Parenthood Association of Utah, which argued the law would \"functionally eliminate\" abortion access by limiting the procedure to hospitals.It's the latest development to shape abortion access in Utah in the year after the U.S. Supreme Court overturned Roe v. Wade. It follows an earlier legal challenge to a Utah law banning most non-emergency abortions. That law remains unimplemented, tied up in court.Utah's abortion clinic ban seeks to stop new facilities from getting licenses and was set to take effect on Wednesday. It would also faze out existing licenses by next year. Stone's decision prevents the state from joining others such as West Virginia, North Dakota and Mississippi, all of which have pushed out abortion clinics.Planned Parenthood argued that the Utah law effectively banned abortion because 95% of the procedures are provided in clinics and hospitals aren't as well-equipped to offer low-cost outpatient care, including the abortion pill. Planned Parenthood said state lawmakers and Gov. Spencer Cox enacted the law to bypass the court system while it weighs challenges to other abortion restrictions.Sarah Stoesz, president and CEO of Planned Parenthood's Utah affiliate, said the ruling \"means that clinics can continue providing essential health care to our patients, who for months have lived in a state of chaos and confusion over the impact of this law on their lives.\"",
        "While welcoming Tuesday's ruling, Stoesz said the threat to Utah residents' health and personal freedom \"remains dire as politicians continue to undermine our judicial process.\"In his ruling, Stone agreed to delay implementing the clinic ban because Planned Parenthood presented enough preliminary evidence to suggest the legislation \"singles out\" abortion clinics without reason. The challenge will now advance through the court system while the law remains on hold.\"There is nothing before the Court to indicate that an injunction would be adverse to the public interest,\" Stone said in his ruling.The office of Utah's Attorney General declined to comment on pending litigation. Republican lawmakers have previously said they designed the law to provide clarity to hospitals and explain parts of the legal code that would no longer be relevant once the state´s abortion restrictions are fully implemented. Clinics could still apply for expanded licenses as hospitals, the lawmakers have said.Utah is one of 19 states to tighten abortion restrictions since the Supreme Court overturned Roe v. Wade, with many relying on \"trigger laws\" passed in the years leading up to the decision. Such laws laid out restrictions that would kick in following any Supreme Court ruling that reversed Roe.In Utah, overturning Roe triggered two pieces of legislation: an 18-week ban passed in 2019 and a 2020 ban on abortions regardless of trimester, with several exceptions to protect maternal health or in cases of rape or incest reported to the police.",
        "Planned Parenthood sued over the 2020 ban, and last July, Stone delayed implementing it until legal challenges could be resolved.Abortion remains legal up to 18 weeks in the state as the court weighs that challenge.When Utah passed its clinic ban in March, it became the first state to adopt such a law in the post-Roe era.___ This story corrects the day the ban was to take effect to Wednesday."
    ]
}