{
    "articleURL": "/wires/reuters/article-12047613/Cinerius-owner-Summit-Partners-explores-stake-sale-Swiss-wealth-manager-sources-say.html",
    "content": [
        "By Pablo Mayo Cerqueiro",
        "LONDON, May 4 (Reuters) - U.S. private equity firm Summit Partners is looking to sell a stake in Swiss wealth manager Cinerius Financial Partners amid increasing consolidation in the sector, two people familiar with the matter told Reuters.The fund has tasked investment bank Houlihan Lokey with gauging investor appetite in the company, which acts as an aggregator of smaller wealth management shops in Europe's German-speaking region, said the people, who declined to be named discussing private matters.Summit intends to bring in another private equity fund to help fund Cinerius' growth, particularly through acquisitions, one of the people said.The sale will include newly issued shares and possibly some existing shares, the person said, adding that the size of the stake is up for discussion.Asset manager BlackRock Inc provides debt financing for Cinerius' acquisitions through its private credit arm, the person added.Formed in 2021 with Summit's backing, Zug-based Cinerius is on track to post earnings of about 30 million euros ($33.07 million) before interest, tax, depreciation and amortization (EBITDA), the people said.Including debt, a business like Cinerius could be valued at a multiple of EBITDA in the teens, according to two independent sector advisers.BlackRock, Cinerius and Summit Partners did not respond to requests for comment. Houlihan Lokey declined to comment.",
        "Private equity has been a driving force behind the consolidation of Europe's fragmented wealth management industry, investing in financial planning and money management groups and adding bolt-on acquisitions to them, often with debt from private credit funds.Markets like the UK have been at the centre of this trend, with groups like Nordic Capital-backed Ascot Lloyd snapping up smaller competitors. Europe's German-speaking region, however, is still behind the curve, one of the people said.Commercial banks have also been pushing into wealth management in a bid to diversify their earnings, with deals such as Royal Bank of Canada's takeover of Britain's Brewin Dolphin last year.Belgian private bank Degroof Petercam is reviewing strategic options after drawing interest from rivals, Reuters reported last Friday. ($1 = 0.9072 euros) (Reporting by Pablo Mayo Cerqueiro in London; editing by Elisa Martinuzzi and Bill Berkrot)"
    ]
}