{
    "articleURL": "/sport/boxing/article-12046013/Eddie-Hearn-reveals-Conor-Benn-set-fight-United-States-June-17.html",
    "content": [
        "Conor Benn was charged by UK Anti-Doping last month over failed drug tests The welterweight, who has protested his innocence, could fight next monthEddie Hearn hopes Benn can make his in-ring return in America on June 17 Conor Benn could be set for his long-awaited return to the ring on June 17, according to Matchroom Boxing promoter Eddie Hearn.",
        "The 26-year-old welterweight was charged by UK Anti-Doping (UKAD) last month, in a move that raises the possibility of a two-year ban for his two positive drug tests.He was provisionally suspended on March 15 by UKAD - preventing him from fighting on any card overseen by the British Boxing Board of Control (BBBC). However, that doesn't stop him from fighting under other governing bodies - though the BBBC could also ask them not to sanction a fight involving Benn.Hearn though has told ProBox TV that he and Benn are proceeding with plans for him to fight in the US on June 17.",
        "'We're looking at him fighting on June 17,' Hearn said. 'But at the same time there's a lot of conversations I'm not a part of - with his legal team and UKAD - that are going through that process.'We can fight, now, but I'm worried about him getting a fair crack of the whip in his hearing.'He went on to add: 'I think people have made up their minds and made a decision.'By necessarily rubbing people up in the wrong way that might not help him either, but his team are talking to UKAD. He's going through that process everybody wanted him to go through and we'll see what happens.'",
        "When asked how likely the prospect of Benn fighting on June 17 is, Hearn replied there was a greater than 50 per cent chance of it taking place.UKAD publicly announced that Benn had been charged following Mail Sport's report that the fighter had begun co-operating with investigators.UKAD, who confirmed Benn was provisionally suspended on March 15, said a charge was issued on April 3 under article 2.2 of their rules around ‘use’ of a banned substance.Significantly, that gives them the option of applying the standard of strict liability to Benn’s case, which makes an athlete responsible for what is found in their system.",
        "In the instance of Benn, who twice provided positive samples for clomifene to the Voluntary Anti-Doping Association, that could amount to a two-year ban, if he is found guilty.Following the charge, Benn will now be required to provide evidence for his defence. He has previously refused to hand over a dossier he used in a more narrow enquiry by the World Boxing Council, citing ‘pride’.But as revealed by Mail Sport, he has since complied, though it is not currently known if he will persevere with claims of a flawed testing procedure, which were rejected by the WBC.Benn has maintained his innocence and attempted to play down his charge, tweeting on Thursday: ‘Another day, another attempt to create a headline with my name.",
        "He holds an unbeaten record over 21 fights, but has not fought since his victory over Chris van Heerden in April 2022.  "
    ]
}