{
    "articleURL": "/tvshowbiz/article-12053141/Jessica-Simpsons-daughter-Maxwell-wishes-Grandpa-Joes-bone-cancer-heal-11th-birthday.html",
    "content": [
        "Jessica Simpson celebrated her daughter Maxwell's 11th birthday with a heartfelt Instagram post on Saturday, where she revealed her father Joe has been battling bone cancer. ",
        "The doting mother, 42, thanked Maxwell for using her birthday wish to hope that Jessica's 65-year-old father's bone cancer treatments would be effective. In her lengthy caption, Jessica wrote, 'Maxwell’s birthday wish was for her Papa Joe’s bone cancer treatment to work. It did. Thank you Maxi Drew for usin’ your wish on our family and most importantly, my Dad.' The I Wanna Love You Forever singer - who introduced her new line of handbags last week - was pictured with her legs wrapped around Maxwell's torso as she held her mother up in the air. Jessica's post appears to be the first time she's publicly spoken about her father's bone cancer diagnosis. ",
        "Joe previously battled prostate cancer in 2016 and 2017.After a successful radiation treatment he was declared to be 'in the clear' at the time, as per Us Weekly.Jessica, who has lost 100 pounds over the past few years, looked slender in skintight leather pants and a lime-green zip up hoody.The entrepreneur opted for a glamorous makeup palette and wore her long blonde tresses down over large hoop earrings. The mother-of-three also shared multiple shots of Maxwell on her Instagram Stories. In the first image, Maxwell smiled as she held a large green balloon on the sidewalk in a yellow button-up shirt.",
        "The second snap showed Maxwell strike a pose with her hand on her chin as she balanced on a log amid a wooded backdrop.Other images showed Jessica's mini-me sitting on a swing, hugging farm animals, and smiling alongside her mother.  Simpson also shared an amusing family photo where everyone was smiling except for her four-year-old daughter Birdie, who was clearly upset. Simpson captioned the hilarious family image, 'Can’t win them all.' The family photo included Simpson's three kids along with her husband Eric Johnson, 43. ",
        "Jessica and her fashion designer husband share three kids: Maxwell Drew, 11, Ace Knute, 9, and Birdie Mae, 4. The happy couple met in 2010 at a party through a mutual friend and married in 2014. Maxwell's birthday post comes after Jessica released her new handbag collection online last week.The former actress modeled her new collection with the caption, 'Ya can’t leave home without a handbag, so I say we might as well adore our shoulder statements! Our exclusive handbag launch is now up on JessicaSimpson.com!' it said in the caption.She also shared an image wearing a yellow floral print dress alongside her 63-year-old mother, Tina Ann Drew Simpson, who helps run her clothing and accessory lines.Tina appears to be aging in reverse and could pass for Jessica's sister. The Dukes of Hazzard star inscribed over the photo that she will appear on HSN soon.",
        "This comes after Jessica looked her thinnest ever in a neon green two-piece from Kim Kardashian's SKIMS swimsuit line. Simpson has very adeptly managed to go from pop singer to reality TV star to fashion designer who steers her own empire.",
        "In March of last year, the blonde bombshell landed on the cover of Entrepreneur magazine.The siren looked slender in a low-cut black suit as she flashed a Mona Lisa smile with her blonde hair parted in the middle and down her back.The Dukes Of Hazzard actress seemed proud in her caption, writing, 'Let them underestimate you! Quite possibly my most meaningful cover headline to date. Thank you @entrepreneur @francesdodds [the deputy editor of the magazine] for giving me a platform to share my Jessica Simpson Style story and seeing me for who I am.' Then she offered some sage advice for her followers. 'Don't put too much pressure on yourself because it's never make-or-break, you know?' wrote the wife of Eric Johnson."
    ]
}