{
    "articleURL": "/wires/reuters/article-12051949/U-S-CDC-chief-Rochelle-Walensky-stepping-June.html",
    "content": [
        "By Ahmed Aboulenein and Julie Steenhuysen",
        "WASHINGTON, May 5 (Reuters) - U.S. Centers for Disease Control and Prevention (CDC) Director Dr. Rochelle Walensky, a top health official who oversaw the agency's contentious response to the COVID-19 pandemic, is leaving the institution at the end of June, the CDC said on Friday.Walensky led the institution for two years while the pandemic was at its height. Her agency was pivotal in ushering in the adoption of vaccine recommendations that slowed the spread of a virus that has killed more than a million Americans and is still killing more than a thousand a week.She, alongside the government's former top infectious disease expert Dr. Anthony Fauci, was the face of the Biden administration's pandemic response and often found herself at the heart of difficult grilling by Republicans in Congress as well as public criticism.\"The end of the COVID-19 public health emergency marks a tremendous transition for our country, for public health, and in my tenure as CDC Director,\" Walensky wrote to President Joe Biden in her resignation letter.The government will on May 11 end the COVID-19 public health emergency that allowed millions of Americans to receive vaccines, tests and treatments at no cost during the pandemic.\"In the process, we saved and improved lives and protected the country and the world from the greatest infectious disease threat we have seen in over 100 years,\" she wrote.",
        "Biden thanked Walensky for her work, saying she had saved lives by marshalling scientists and public health experts to turn the tide against the pandemic.\"We have all benefited from her service and dedication to public health, and I wish her the best in her next chapter,\" Biden said in a statement.In response to criticism of the CDC's pandemic response, including late and confusing public health guidance, Walensky oversaw a revamp of the agency's structure to enable a nimble response to future pandemics.\"For 75 years, CDC and public health have been preparing for COVID-19, and in our big moment, our performance did not reliably meet expectations,\" she told CDC staff last summer.Walensky did not immediately respond to a request for comment.DIFFICULT TENUREHer proposed plans to modernize the agency included giving the CDC new authority to require states to report data as well as changes that would allow the CDC to hire staff more quickly and offer more competitive salaries.Both actions would require authorization from Congress.Public health experts said Walensky wrestled with political and technical challenges during her tenure.\"She faced just extraordinary challenges,\" said Dr. William Schaffner, an infectious disease expert and longtime consultant to the CDC's Advisory Committee on Immunization Practices, which advises the agency on vaccine policies.",
        "Schaffner said Walensky faced the largest pandemic since the 1917 to 1918 global influenza pandemic, and outdated practices of gathering necessary data hamstrung her from the start.Political interference by the previous Trump administration also impeded her tenure, he said. \"There wasn't any doubt that she had to work to restore the CDC's reputation.\"These issues interfered with her ability to effectively lead the agency, said Dr. Amesh Adalja, a senior scholar at the Johns Hopkins Center for Health Security.\"Dr. Walensky was put into place at the CDC at a time when the agency was basically captive to politicians which clearly hampered her ability to lead,\" he said.Dr. Celine Gounder, an infectious disease epidemiologist and an editor-at-large at Kaiser Health News, said the timing of the announcement surprised her.\"She had taken important steps to reform the agency. Her work wasn't done,\" said Grounder. (Reporting by Ahmed Aboulenein in Washington and Julie Steenhuysen in Chicago; Additional reporting by Ismail Shakil in Ottawa; Editing by Tim Ahmann, Emelia Sithole-Matarise and Josie Kao)"
    ]
}