{
    "articleURL": "/money/bills/article-12050843/Million-overpay-mobile-deals-phones-theyve-paid-off.html",
    "content": [
        "Almost all Britons have no idea they could be stuck paying inflated phone billsRegulator Ofcom first spoke out about the practice two years ago Now Virgin Media O2 is calling on other providers to simplify their tariffs Millions of households are overpaying for their mobile phone deals by £530million a year, according to Virgin Media O2.",
        "The telecoms firm said 93 per cent of Britons have no idea their provider can keep charging them for a device they have already paid for.This issue hits older people and those on the lowest incomes hardest, Virgin Media O2 said.The problem is that consumers are often unaware of how two parts of their mobile phone bill work - their device payments and the cost of airtime.Some mobile phone firms bundle the two components together, while others charge them separately. ",
        "Neither is a problem until the device is paid off - normally within 12 to 24 months.After that point, what happens depends on your deal.If you pay for your device and airtime separately, you are free to just pay the airtime - lowering your bill - or your provider may automatically shift you to an airtime-only tariff.But if your tariff bundles together your device and airtime payments, you may be stuck paying for a handset you already own outright.Most people who overpay do so for no more than six months - but many do so for years. However, bundled deals can be initially cheaper than split tariffs, making it vital for consumers to check their monthly payments once their device is paid off.",
        "Virgin Media O2 said this affects millions of people every year.According to the consumer charity Citizens Advice, 58 per cent of the average monthly mobile bill is the cost of the device.In other words, once the device is paid off, more than half of the phone bill for millions of Britons is a form of overcharging.Gareth Turpin, chief commercial officer at Virgin Media O2, said: 'We’re calling time on this half a billion-pound problem and urging the industry to step up for consumers and put an end to the smartphone swindle.'During a cos of living crisis, and with older and low-income households most at risk, I’m asking the other operators to do the right thing.'In 2020, regulator Ofcom brought in new rules ordering mobile phone, broadband and pay-TV providers to warn customers when their current contract is ending, and what they could save by signing up to a new deal.Ernest Doku, telecoms expert at comparison website Uswitch.com, said: 'VMO2’s research around handset overpayments highlights an issue we’ve been talking about for many years and is now more significant than ever. 'Too many people are still overpaying on their mobile bills, and it’s very concerning that older people and those on the lowest incomes are disproportionately affected.",
        "'More work needs to be done to raise consumer awareness around the contracts they sign up to and, importantly, their options when they come to an end.'   A spokesperson for BT, which also owns EE, said: 'We find these claims from Virgin Media O2 to be misleading and unnecessary – designed to chase headlines, at a time when consumers need confidence that the industry is clear and straightforward.'",
        "Airtime-only customers punished with price hikesMobile phone users faced steep price increases of up to 17.3 per cent this year even on airtime-only deals.A quirk of how many broadband and phone deals have worked since 2021 is that prices can be raised mid-contract. Earlier this year Ofcom said consumers do not understand how these price increases work and that it may have to crackdown on mobile and broadband price hikes.However, Ofcom is not looking to make these deals cheaper - just to make sure that consumers understand how the pricing works.How to save money on your mobile phone deal 1) Work out what you REALLY needThese deals vary in terms of what you get and what you are charged. If you are at the end of your contract, or want to take out your first one, think about what you really need from a mobile phone deal.If you have paid off your handset and are happy to keep it, check that you are not stuck overpaying a higher tariff than you need to. ",
        "2) Consider a Sim-only dealIf you already own a mobile phone handset, or can get one cheaply, you may be able to save money with a cheap Sim-only deal.This is because most mobile phone contracts sell you two things - the phone and the cost of using it. If you already have the phone, you just have to worry about the cost of calls, texts and data.Uswitch said customers can save up to £321 by taking out a Sim-only deal.Users will need to make sure they don't exceed the limits stated when they sign up. If they do, extra charges could apply - and these can be expensive.3) Consider a refurbished phoneInstead of buying a brand new phone, see if there is a refurbished one that suits your needs. These are phones that have been overhauled by experts to replace broken parts and improve their operation.They work out considerably cheaper than new phones. For example, an iPhone 13 costs around £600 to £700 for a new handset, whereas refurbished models cost approximately £500.These savings are even greater for less in-demand phones, or older models.Most Samsung Galaxy phones released in the last five years normally cost no more than £200 when refurbished, for example, but cost up to four times that amount new.",
        "4) Be prepared to haggleAs your existing contract comes to an end, haggling with your provider can save you money.Do your research first, and come prepared with some of the best deals you have found elsewhere. Mention any issues you have had with your current provider, as this can give you an edge in any negotiations.If you are not happy with whatever offer your provider makes you, say you are prepared to leave. This can lead to better deals miraculously appearing.5) Be prepared to switchIf you cannot get a deal you are happy with from your current provider, consider switching away.6) Check if you can get a social tariffThere are three social tariffs for mobile phone customers. Sim-only deals may work out cheaper, so even if you are eligible for a social tariff, make sure to look into those too.",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}