{
    "articleURL": "/wires/ap/article-12061033/Illinois-moves-gender-inclusivity-away.html",
    "content": [
        "CHICAGO (AP) - Illinois bills that would update existing laws to be more gender inclusive and add protections for LGBTQ marriages are ready for action by Gov. J.B. Pritzker, who said he will sign them.",
        "The trio of state bills passed last week are meant to move the state in the \"opposite direction\" of those restricting LGBTQ youth, said Sen. Mike Simmons, the bills´ sponsor and the first and only current \"out\" LGBTQ lawmaker in the Illinois Senate.Illinois is one of several U.S. states that have moved to counteract a surge of anti-LGBTQ legislation in mostly Republican-led states.On the same day just a few hours away, Indiana´s governor signed a bill that will require schools to notify a parent if a student requests a name or pronoun change at school, one of several bills this legislative session targeting LGBTQ people in the state.Illinois´ neighbors to the west, Missouri and Iowa, have gone in a similar direction by restricting gender-affirming care and the bathrooms transgender students can use.The Illinois Democratic supermajority passed the bills out of the Senate on Thursday, and the measures now await Pritzker's signature.",
        "\"The Governor is proud to support legislation that creates a more welcoming, affirming, and inclusive Illinois,\" said spokesperson Alex Gough on Friday.\"In the face of rising violence and bigotry toward the trans, nonbinary, and gender non-conforming community, providing support and recognition for those who identify as LGBTQ+ has never been more important,\" Gough said.One bill would replace certain pronouns with the nouns to which the pronouns refer, such as \"minor\" instead of \"he or she,\" and \"person who gives birth\" in place of \"mother\" in some existing laws concerning children in the state´s care.",
        "Before her \"no\" vote, Republican Caucus Whip Sen. Jil Tracy said: \"I gave birth to two boys that weighed over 10 pounds (4.5 kilograms). I think I deserve more dignity that just `a person who gave birth.´ I'm a mother.\"The Illinois Family Institute, a Christian nonprofit, opposes all three bills.David Curtin, the institute's lobbyist, said the bill on pronouns is \"tinkering\" with terms that are legally important, and \"there´s only two genders, and its male and female and him and her. So why not just stay with the program?\"Changing the language of laws \"doesn´t change reality,\" Curtin said.Simmons said that the bill is primarily intended to affirm LGBTQ youth in the child welfare system, which a 2021 audit found that Illinois' Department of Children and Family Services has failed to do.Young people in DCFS' care have \"repeatedly\" relayed to ACLU Illinois lobbyist Nora Collins-Mandeville \"the challenges that they have with folks identifying their family members correctly or their own identities correctly,\" she said.\"Language matters,\" said Collins-Mandeville, who worked with Simmons on the bill. \"Contrary to some of the opposition ... it actually includes more people and allows people to identify themselves.\"Another bill would require state agencies to track employees who identify as non-binary or gender non-conforming to help achieve workforce diversity, and a third bill would make it easier for LGBTQ couples who resided in other states to marry in Illinois.",
        "When the Supreme Court overturned the federal right to an abortion in June, the ruling included a concurring opinion from Justice Clarence Thomas that suggested the high court should review other precedent-setting rulings, including the 2015 decision legalizing same-sex marriage.The marriage bill is meant to serve as fail-safe in case that decision is reversed, Simmons said.\"What we´re trying to do is get ahead of any actions that might be taken to invalidate Obergefell or any of those other cases that would have a direct and disastrous impact on LGBTQ households in the country,\" he said, referring to the 2015 U.S. Supreme Court decision legalizing same-sex marriage.The Respect for Marriage Act, signed by President Joe Biden in December, enshrines the right to same-sex and interracial marriages in federal law.For Chicago lawmaker Simmons, the three Illinois bills are personal. \"There are so many other state legislatures right now that are making a sport of targeting my community,\" he said.\"So many people fought so hard for me to even have the right to exist, to be able to be an out and proud, Black, LGBTQ+ state senator,\" he said. But the current political climate is \"dispiriting at times,\" Simmons said.\"There´s several states that are going light years back on LGBTQ and civil rights.\" he said. \"Everything is going backwards.\" ___",
        "Savage is a corps member for the Associated Press/Report for America Statehouse News Initiative. Report for America is a nonprofit national service program that places journalists in local newsrooms to report on undercovered issues."
    ]
}