{
    "articleURL": "/tvshowbiz/article-12057757/Pregnant-Alexandra-Burke-looks-radiant-star-studded-Eurovision-bash.html",
    "content": [
        "Alexandra Burke cut a glamorous figure as she performed at the National Lottery's Big Eurovision Welcome event outside St George's Hall in Liverpool on Sunday.",
        "The singer, 34, who announced she was expecting her second child with her partner Darren Randolph last month, took to the stage in flowing white dress with tasseled detail along the expansive sleeves and the hem.Former X factor winner Alexandra's garment whipped around as she moved about the stage.The star boosted her height by wearing a pair of open-toed heels and accessorised with gold hoop earrings to match the shade of the straps of her footwear.She wore lashings of make-up to highlight her pretty features and flashed a broad smile as she performed. ",
        "Alexandra was joined at the event by television presenter AJ Odudu, 35, who hosted the event with fellow broadcaster Joel Dommett, 37.AJ dazzled as she walked the red carpet at the event, wearing a gold metallic jumpsuit for the evening.She wore the item partially unzipped at the front to create a plunging neckline.The screen star wore a pair of gold heels to match the rest of her outfit and accessorised with some gold jewellery.She went for a glamorous look with her make-up and confidently posed with her hands on her hips on arrival.Taking to the stage, she stood alongside Joel who looked dapper in a black and white jacket and a pair of black trousers.",
        "AJ was later joined on stage by Strictly Come Dancing host Shirley Ballas, 62, who ensured she caught the eye in a canary yellow suit.She wore a bright jacket and a pair of matching flared trousers as she appeared in front of the crowd.",
        "Former Eurovision winners Conchita Wurst, who represented Austria in 2014, and Ukraine's Jamala, who competed in 2016, were also on the line-up for the gig, presented by AJ Odudu and Joel Dommett.Highlights of the concert will be shown on BBC One on Monday.Eurovision preparations are in full swing in Liverpool, which is hosting the contest instead of Ukraine because of the Russian invasion.The Eurovision Village, at the city's Pier Head, opened on Friday with a performance from last year's winners Kalush Orchestra and Scissor Sisters' Jake Shears performed there on Saturday after a screening of the coronation.The first Eurovision semi-final will take place on Tuesday.Mae Muller has spoken of her nerves ahead of the Eurovision Song Contest at a 'magical' opening ceremony.",
        "The 25-year-old singer met fans as she walked the Turquoise Carpet in Liverpool earlier in the day on Sunday, along with the 36 other acts due to take part in the contest.She told the PA news agency: 'I feel like it's getting real now, but the closer it gets the more excited I am.",
        "'I just feel really honoured to be able to be a part of it and I feel like being able to see everyone that has come out, it just makes it even more magical.'The nerves are there. They're there, they're having a little party inside but I'm just trying to stay focused, focus on the positives and try and enjoy it.'Wearing a powder blue body-con hooded dress, Muller said there was a 'bit of pressure' in deciding what to wear for the occasion.She added: 'But I find it fun. I feel like women, we've got enough pressure put on us so I'm like, we might as well have fun with the outfits.'If I like it, that's all that matters.'",
        "In an interview with The Sunday Times, Muller admitted she is keen to do well in the competition but that it has been 'non-stop for two months', describing it as 'like boot camp'.The London-born singer was confirmed as the UK's Eurovision act in early March and has since been at a number of Eurovision events ahead of the big day including meeting the King and Queen.In the interview, Muller also reflected on how the evolution of the music industry towards streaming and viral moments has added extra strain.",
        "She told the newspaper: 'My label said not to rush. I came just before TikTok was a thing, so I didn't need viral success overnight.'They wanted to develop me and that is a dying idea because after TikTok took over it's all about how fast you can go. That's sad.'The whole point of a label is to give you time, but now they don't sign anyone unless they've had a viral hit already.'",
        "She added: 'It's no longer, \"My song is on the radio. I've made it.\" There are a lot of boxes to tick.'It depends on what your version of success is, but it is weird. I'm sat at home with seven million monthly listeners and think: 'But how well is it actually going?' It can be jarring.'Despite the challenges, she said she does feel that things are changing within the industry to allow women to be more vulnerable.'Music is about what sells and labels are a business. It used to be, \"Sex sells. Nobody wants to hear about crying and feeling.\" But it is changing,' she said.'I wanted to be honest about my vulnerability. Women are told, especially in music, that we have to be a good role model. But you don't have to be that all the time.'",
        "This year's Eurovision Song Contest will see 1,000 litres of hairspray, 150m of costume rails and more than 3,000 make-up brushes used.",
        "The shows at Liverpool Arena will start this week, with semi-finals on Tuesday and Thursday and the final taking place on Saturday.The event, hosted by the UK on behalf of last year's winners Ukraine, is one of the biggest produced by the BBC.According to the broadcaster, the hair and make-up teams will use more than 100 wigs and hairpieces, 1,000 litres of hairspray, more than 3,000 make-up brushes, and 5,000 hairpins to create looks for every performer.Rails measuring 150m - equivalent to three Olympic-sized swimming pools - will hold the 482 costumes which have been made for the shows using 20,000m of thread.The manufacturing of the costumes was done in the UK and Ukraine, which was unable to host the competition due to the Russian invasion.The show will be watched by 160 million viewers worldwide, with over eight hours of live TV and 50 live feeds.",
        "To stage it, there are more than 600 rigging points, 140 tons of steel ground support structure, and 1km of additional steel truss work being added to the arena.The event will feature eight miles of cabling for lighting, sound, video and special effects, more than 2,000 specialist lighting fixtures and 200 custom staging decks.",
        "A total of 950 square metres of staging for the main stage and 500 square metres of staging for the green room will also be used.The lighting design includes 23,700 individual light sources and 2,500 automated colour-changing robotic lights, while sound will be captured by 150 microphones.",
        "BBC director of unscripted Kate Phillips said: 'As these statistics show this is one of the biggest events the BBC has ever produced.'Coming straight after such a significant and spectacular moment in history, we aim to produce an unforgettable and utterly joyful Eurovision, on behalf of Ukraine.'Like the coronation, Eurovision has so many skilled and talented people from across the BBC working on it.'Our brilliant team in Liverpool are making sure that all three live shows are simply must-see TV, for audiences across the UK, Europe and beyond.'"
    ]
}