{
    "articleURL": "/news/article-12054785/National-Police-Association-sues-make-trans-Nashville-shooter-Audrey-Hales-manifesto-public.html",
    "content": [
        "The National Police Association filed the suit on April 28 for release of Audrey Hale's penned manifesto Calls for the release of Hale's manuscript has grown since Hale, 28, opened fire killing 3 three children and three adults at The Convenant School in NashvilleOn Friday, the NPA filed an amended complaint blasting the 'absurd' decision to withhold the manifesto once more because of pending litigationThe National Police Association has filed a lawsuit in a bid to make trans Nashville school shooter Audrey Hale's manifesto public.",
        "Hale's manifesto has remained shrouded in secrecy since the March 27 massacre at Covenant Christian Academy that killed three children and three school workers, with the gunwoman also shot dead by cops. But on April 28, NPA Head Ed Hutchinson and Tennessee investigator Clata Renee Brewer filed the suit with Metropolitan Government of Nashville and Davidson County. They subsequently issued an amended complaint on Friday blasting the 'absurd' decision to withhold the manifesto once more because of pending litigation. Calls for its release has grown in the last few weeks that saw another mass shooting in the nation- 192 mass shootings so far, this year and 647 mass shootings in 2022, according to the Gun Violence Archive, as per The New York Times.  The Tennessee Firearms Association also filed an administrative appeal for the materials, The USA Today Network reported.",
        "The Metro Nashville Police Department officials claimed the release had been paused because their attorneys told them to hold off from any release while the suit was making its way through the courts.That pause came just days after the MNPD and the Tennessee Governor announced that Hale's writings would be released for public consumption.The MNPD Police, who sought their legal counsel blamed the recent litigation for the change, according to The New York Post. ",
        "Attorney John Harris, who is representing former Tennessee Sheriff James Hammond and the Tennessee Firearms Association in the lawsuit told the news outlet it was 'an interesting turn of events.''If there was some plan to release some information … why isn't that information being released?,' Harris said.On April 27, Tennessee Governor Bill Lee reassured the public in a tweet that Nashville authorities would be releasing Hale's writings and documents.No details of the manifesto have been released, and a motive for the shooting remains unclear.  On Friday, the National Police Association (NPA) announced the filing of an amended and supplemental complaint in conjunction with its Tennessee investigator Clata Renee Brewer, against the governments of Nashville and Davidson County for their new refusal to act on a request for records.The Freedom of Information Act request asked for all writings by Hale, to include a manifesto, recovered by the Metropolitan Nashville Police Department (MNPD) relating to the March 27 mass shooting The FOIA also requested all records, including emails, texts, and other communications to and from the MNPD mentioning or regarding the writings of Audrey Hale recovered by the MNPD.'It has been more than a month since the shooter was killed and the officers involved have been praised for their actions in the incident,' Doug Pierce, a lawyer for the NPA, said according to a news release. ",
        " 'Accordingly, there is no criminal case and there is no reasonable likelihood of there ever being a criminal case arising from this incident.''The Metro Nashville Police Department has sought to rely upon a rule of Criminal Procedure to deny public access, but those Rules only relate to a 'criminal proceeding,' Pierce added.'Therefore, the Rules of Criminal Procedure do not provide an excuse to deny public access to the records related to this incident.'Since MNPD now seems to acknowledge there is no criminal investigation there is no remaining excuse for why they have not complied with our request.'",
        "According to the National Police Association, MNPD claimed that a criminal investigation was underway.But the Director of the Tennessee Bureau of Investigations disclosed publicly at least twice there was no ongoing criminal investigation, likely because Hale herself has been killed. Once, on April 5 which addressed a meeting of the Tennessee Sheriff's Association, Tennessee Bureau of Investigations Director David Rausch that had disclosed it had already been established from Hale's writings recovered that Hale 'acted alone'.Again, on April 14, a video interview with PIJN News was published in which Tennessee Bureau of Investigations Director David Rausch was asked: 'What are the next steps' since there will be no trial because the shooter is dead.'",
        "Rausch had responded, 'Unfortunately you're right, this is it.' 'The individual responsible is no longer with us.'On April 27, it was reported MNPD will release Hale's writings in some form at some point. The reported change in posture by MNPD, did not address the NPA's requests for MNPD communications, nor did it indicate an intent to fully comply with a complete release of all the Hale writings, nor did it indicate an intent to conform to a timeline, according to the release.'The NPA believes releasing the complete materials will benefit law enforcement and the public,' the NPA said.'The writings of killers often offer critical insights into the factors that contribute to the development of criminal behavior.''The communications between MNPD and influencers who may have caused the MNPD to not honor the FOIA statute will provide guidance going forward on how other departments can plan for and prevent similar interference.'"
    ]
}