{
    "articleURL": "/sport/us-sport-weekend-features-project/article-12042317/Tori-Bowie-Olympic-champion-grandma-drove-success-foster-care.html",
    "content": [
        "Bowie said grandma Bobbie Smith was 'the role model' in her life after raising herOlympic and world champion died suddenly in Florida on Tuesday aged just 32READ MORE: Tori Bowie was 'seven to eight-months PREGNANT' and had history of erratic behavior, neighbors reveal Tori Bowie, the starlet sprinter became three-time world champion and an Olympic gold medalist after being put into foster care as an infant, has died suddenly aged 32.",
        "The shy athlete never forgot her roots growing up in a tight-knit community in Sandhill, Mississippi, and credited her 'tough' upbringing with making her the winner she was.Her crowning glory was her pivotal role in Team USA winning Olympic gold in the 4x100 relay at Rio in 2016, where she ran the anchor leg and outlasted Jamaica's ten-time world champion Shelly-Ann Fraser-Pryce.'We're devastated to share the very sad news that Tori Bowie has passed away,' Icon Management Inc. said in a statement Wednesday morning.'We've lost a client, dear friend, daughter and sister. Tori was a champion…a beacon of light that shined so bright! We're truly heartbroken and our prayers are with the family and friends.'The statement did not reveal or release what led to Bowie's untimely death. She was found dead at her home in Winter Garden, Florida, Tuesday. ",
        "Born Frentorish Bowie on August 27, 1990, 'Tori' was put into foster care with her sister Tamarra, 11 months her junior, at the age of 2.She retained the name of her mother, which Bowie described as 'unfortunate', while her father, Dennis Smith, was 'in and out' of her life. Her grandmother, Bobbie Smith, fought a fierce custody battle to raise them on her own in the small rural town of Sand Hill, around 25km northeast of Jackson, Mississippi.",
        "Bowie recently said that 'people were not supposed to succeed' where she came from - and it was certainly a crowded field.The 20-strong extended family of cousins, aunts and uncles lived in a group of four houses, with Bowie affectionately describing them as 'so weird'.But she reserved special praise for her grandmother, whom she said had been 'the role model in my life'. 'She ended up fighting for us, got custody of us,' she told People in 2016, as she reflected on her early years ahead of the Rio Olympics. 'We didn't have much, but something she did give was character.'Bowie drove her first car on the highway aged just 12 and owned three cars, the first an old Buick, before she had a license. 'I enjoy where I’m from. That’s me. And my family never let me get far away,' she told Sports Illustrated in 2016. ",
        "Bowie nurtured her competitive instinct playing basketball with her male cousins, whom she said 'never took it easy…never let me win' and 'made me tough'.She and her sister excelled and won back-to-back state basketball championships.But Bowie's love of basketball almost stopped her running career in its tracks, as her first coach, Angie Reynolds, told NBC.'They were so used to wearing the long basketball shorts that they are comfortable in, so when I ordered the track shorts they didn't want to run,' Reynolds said. 'Tori said she is not gonna run.'",
        "Tamarra said she feared the pair 'were too young for our butts to be showing'.But they did run and Bowie immediately stood out as a future star.She won two state high school sprinting championships and three state relay titles, but it was initially the long jump that was her main event.Bowie gained an athletic scholarship at the University of Southern Mississippi and recalled watching the women's 200m final at the London 2012 Olympics, in which Fraser-Pryce finished second.'I said to my grandmother: \"I think I can beat those women [at] running. I really think I can beat those ladies,\"' she said in 2016.In 2014, she came to national attention after clocking 10.91 in the semifinals of the USA Outdoor Track and Field Championships - the top time in her heat.After winning the bronze medal at the 2015 World Championships, Bowie qualified for the US Olympic Team for the Rio Olympics in 2016.There, she won silver in the 100m dash and bronze in the 200m.But she finally won gold alongside fellow sprinters English Gardner, Allyson Felix, and Tianna Bartoletta in the 4x100m relay.A year later at the 2017 World Athletics Championships in London, she was victorious in the 100m and the 4x100m relay.Her last major event was at the 2019 World Championships in Qatar - and she has spent the last four years living quietly in Florida.",
        "Bowie and her family remained close throughout her life, with Tamarra following her compete around the world.'I was that annoying little sister,' Tamarra said in 2016. 'Even when she went to college. I followed her there. But it finally hit her the other day when she was going through processing that she's going to the Olympics. I told her: \"I've been waiting for it to hit you!\"'But reacting to the news of her untimely death, Tamarra hinted at her sister's inner struggles.'People who pretend to be happy have some of the saddest souls and people who do not try to convince the world that they are happy have the most genuine souls, because they are content with just being them for them and nobody else,' she said in a Facebook post. Bowie's sporting greatness brought with it glitzy sponsorship deals, a modeling career and glamorous photoshoots with magazines including Vogue and Sports Illustrated.She once joked that she wanted to 'take on Naomi Campbell on the runway'. ",
        "But the sprint star never forgot her humble beginnings and how her grandmother raised her.'My birth mom dropped me off in foster care when I was two years old, so my entire life has been a struggle.'She added: 'My grandmother told me a long time, ago I don't care if you're sweeping a porch for a living. She said, you need to do your best. So I've lived by that every single day.",
        "'Its not about where you're from. It's just about where we're trying to go and what we're trying to accomplish. And I'm trying to be that person, to show everyone there that it is possible.'"
    ]
}