{
    "articleURL": "/tvshowbiz/article-12058195/Shakira-wows-inaugural-Billboard-Latin-Women-Music-event.html",
    "content": [
        "Shakira wowed in a tiny black dress that showcased her toned frame as she attended the Billboard Latin Women in Music event on Saturday,",
        "The 46-year-old looked typically stunning as she posed wowed in a tiny black dress that showcased her curves while posing with her award - after an emotional speech which saw her reflect on her split from Gerard Pique.The strapless minidress featured a sexy triangular cutout at the top of her left thigh. she paired the slinky leather-trimmed dress with a pair of black heels with four straps running across her food and around her ankles. The Hips Don't Lie singer was honored as the Woman of the Year at the event celebrating the success of Latinas in music.During her speech, she appeared to take a swipe at her ex  Piqué, 36, saying, 'It doesn't matter so much if someone is faithful or not; what really matters is if you continue to be faithful to yourself.'",
        "Shakira added: 'There comes a time in every woman's life when she no longer depends on someone to love or accept herself as she is.''The search for the other is replaced by the search for oneself when the desire to be perfect is replaced by the desire to be authentic,' she said.Shakira continued: 'Women are much stronger than we think.''We are braver than we think we are. I think we are also more independent than we were taught to be,' she added. ",
        "The La La La singer concluded her speech by talking about how music helped her get through the difficult times in her life. 'When I felt most lost, it was music that put me on the path back to myself.'She split from her ex in an acrimonious divorce last year amid rumors that he had cheated on the Grammy winner.The inaugural Latin Women in Music gala airs on Telemundo on Sunday, May 7. ",
        "On Saturday, the Waka Waka songstress was spotted at the Miami International Autodrome in Miami Gardens, Florida for the Formula 1 Grand Prix.She was photographed looking pretty chummy with Tom Cruise, 60. Shakira wore a busty-looking green dress with a plunging neckline and various cutouts that gave flashes of skin.She appeared to be holding hands with the Top Gun: Maverick actor.  "
    ]
}