{
    "articleURL": "/news/article-12049899/Port-Fairy-pool-operator-charged-Cooper-Onyett-drowned-school-camp.html",
    "content": [
        "Cooper Onyett drowned on a school camp Pool operator and Department of Education charged A pool operator and the Victorian Department of Education have been charged two years after a boy tragically drowned while on a school camp.",
        "Year two student, Cooper Onyett, 8, drowned at Belfast Aquatics in Port Fairy, in southwest Victoria, on May 21, 2021.He'd been on his first overnight camp with Merrivale Primary School. WorkSafe on Friday charged both the Port Fairy Community Pool Management Group Inc and the Victorian Department of Education over the incident. Cooper's mother, Skye Meinen, described her little boy at the time of his death as the 'life of the party'.",
        "'He lived every single day of his life with a smile and tried to make everyone around him happy and tried to get them to appreciate everything around them,' she told the Herald Sun at the time.'He brightened up everything.' When recalling the final moment she had with her son while dropping him off, Ms Meinen said she gave him a 'big hug' and told him she'd see him the following day.'All I know is that I had an excited little boy going on his first ever sleepover school camp,' she said.",
        "WorkSafe charged the Port Fairy Community Pool Management Group Inc with three offences under the Occupational Health and Safety Act for failing to ensure the child was not exposed to risk.The pool operator also faces a further three charges under the Act for failing to ensure that the workplace under its management and control was 'safe and without risks to health'.",
        "WorkSafe will allege the pool failed to test the swimming ability of the students before allowing them to use an inflatable obstacle course.It's also alleged qualified lifeguards were not on duty and lifeguards were not instructed on how to use the inflatable course in a safe manner.WorkSafe has also charged the Department of Education, alleging it failed to inform the pool of the children's swimming abilities or ensure their abilities were tested.The matter will be heard at Warrnambool Magistrates' Court on May 29."
    ]
}