{
    "articleURL": "/wires/reuters/article-12042155/US-regional-lenders-mixed-choppy-trading-banking-turmoil-fears-brew.html",
    "content": [
        "By Noel Randewich and Medha Singh",
        "May 3 (Reuters) - Shares of U.S. regional lenders collapsed in extended trade on Wednesday, with PacWest Bancorp losing over half its value after reports the California bank is exploring strategic options, including a sale.PacWest sank 60% and Western Alliance Bancorp tumbled 33% as the U.S. regional banking crisis that started two months ago reverberated across the U.S. financial system.Zion Bancorporation, Comerica and First Horizon each slumped more than 11%, and the SPDR S&amp;amp;P Regional Banking ETF dropped 5%.After a liquidity boost last month failed to inspire investor confidence, PacWest is now considering alternatives that may include a sale or capital raise, a person familiar with the matter said.The late-day drop in regional bank shares added to losses in Wednesday's regular trading session, despite reassurances by U.S. Federal Reserve Chair Jerome Powell that the country's banking system remains resilient.In a press conference after the Fed announced a much anticipated 25-basis hike in interest rates, Powell said the U.S. banking sector remained sound and resilient despite \"strains\" in March that led to tighter economic conditions. The cost of insuring against further losses in regional U.S. bank stocks stood on Wednesday near a one-month high in options markets, Reuters reported. The recent regional bank selloff indicates investor unease over their outlook, Brown Brothers Harriman analysts wrote in a note. \"Because that outlook is still unknown, markets did what they always do in these situations and assumed the worst,\" the analysts said. The exposure of regional banks to the commercial real estate sector, particularly office buildings, has also sparked investor worries, given rising interest rates. (Reporting by Medha Singh in Bengaluru and by Noel Randewich in Oakland, Calif., additional reporting by Niket Nishant and Chibuike Oguh; Editing by Dhanya Ann Thoppil, Sriraj Kalluvila, Deepa Babington and David Gregorio)"
    ]
}