{
    "articleURL": "/wires/reuters/article-12046641/TenneT-sale-talks-slow-Germany-Netherlands-differ-price-offshore.html",
    "content": [
        "Berlin, The Hague still expect deal before 2024",
        "Some Tennet bondholders may see windfallOffshore substations, interconnection rights trickyBy Toby Sterling, Christoph Steitz and Markus WacketAMSTERDAM/BERLIN, May 4 (Reuters) - Talks on a planned sale of Dutch state-owned electricity grid operator TenneT's German unit to Berlin have hit a hitch over price, the company's outstanding bonds and offshore infrastructure, people familiar with the matter said.The sale would be one of Europe's biggest deals this year and highlights the German government's desire to control infrastructure vital for climate change goals and critical energy assets after Russia cut gas supplies to Europe.Dutch government sources estimate the deal at 20 billion euros ($22 billion) or more, but German industry sources say it may be less.Dutch Finance Minister Kaag said in April that opinions differ on price and while TenneT has significant funding needs, the ambition to have the deal approved under European state aid rules before 2024 appears \"tight\".\"Additional investment needs kick in next year so getting a deal done in 2023 is critical,\" one of the people familiar with the matter said.The German government requested the sale of TenneT Germany last year. Despite TenneT being owned by the Dutch State, the German grid makes up most of the company's business.TenneT has a 111 billion euro investment plan for the coming decade, with Germany accounting for 60%, prompting a debate whether Dutch taxpayers should be funding power lines in Europe's top economy.",
        "While The Hague would like to see a deal worth 20-25 billion euros in cash and debt, Germany is seeking a lower price, pointing to investment needs and rising interest rates that make investing in energy grids costly, the sources say.TenneT had a book value of 7.3 billion euros at the end of 2022, on a balance sheet of 38.5 billion euros. TenneT's German grid alone has liabilities of 21.6 billion euros, nearly three times that of the Dutch network.Leaders of the two countries discussed the sale in Rotterdam in March, with Dutch prime minister Mark Rutte saying he expects to receive a \"market price\" for TenneT while Germany's Olaf Scholz said a decision will be made by summer.OPTIONS ON OUTSTANDING BONDSAmong the contentious issues in the discussions are agreements over grid infrastructure in the North Sea that TenneT is building to support wind projects, the sources said.These include joint purchasing, following through on TenneT's 10-year plan, including where substations will be located as well as ownership and usage rights of the interconnection points between the two national grids.The Dutch economic affairs ministry said the governments are aligned but \"still discussing important details\" while a spokesperson for Germany's economy ministry said talks were ongoing. TenneT said the process was on schedule.",
        "TenneT's 19 billion euros of outstanding bonds, issued when interest rates were lower, are another issue, the people said.So-called \"change of control\" provisions mean some classes of bondholders can demand their bonds be repurchased at par or offered other compensation if they are transferred to TenneT Germany - a windfall for bondholders but a cost to Berlin.Another possibility is that the Dutch parent keeps more of the bonds and receives a large cash component, which could lead to a buyback. Dutch pension fund PGGM, one of TenneT's bondholders, expects such an outcome in the event of a sale.Other bondholders, including Norway's sovereign wealth fund and BlackRock, declined to comment. ($1 = 0.9042 euros) (Reporting by Toby Sterling, Christoph Steitz and Markus Wacket, additional reporting by Elisei Chiara; Editing by Emelia Sithole-Matarise)"
    ]
}