{
    "articleURL": "/wires/reuters/article-12051931/US-STOCKS-Wall-St-climbs-Apple-regional-banks-rally-jobs-data-eases-recession-worries.html",
    "content": [
        "Regional banks rebound after bruising selloff",
        "U.S. employers add 253,000 jobs in AprilLyft slumps as lower fares stoke margin concernsIndexes up: Dow 1.20%, S&amp;amp;P 1.42%, Nasdaq 1.74%(Updates prices throughout; adds analyst comment in paragraph 11, Fed data on bank lending in paragraph 12)By Ankika Biswas and Sruthi ShankarMay 5 (Reuters) - U.S. stocks gained on Friday lifted by strong results from Apple and rebounding shares of regional banks, while a stronger-than-expected jobs report eased worries of an imminent economic downturn.Apple Inc gained 4.7% on better-than-expected results, helped by strong iPhone sales and notable inroads in India and other newer markets, fuelling a 2.3% advance in technology stocks.PacWest Bancorp rallied 83.3% and Western Alliance Bancorp jumped 39.7% at the end of a bruising week for regional lenders amid the collapse of First Republic Bank.Meanwhile, investors appeared to take in stride data showing U.S. job growth accelerated in April while wage gains increased solidly, pointing to sustained labor market strength that could compel the Federal Reserve to keep interest rates higher for longer.\"This is a strong report and shows that the labor market is resilient. It bails out the Fed for raising another quarter point,\" said Peter Cardillo, chief market economist at Spartan Capital Securities.\"It's been a tough week for the stock market, the regional banking problems have raised the fear factor, but Apple earnings came in strong. Stocks are coming up from near-term oversold condition.\"",
        "Traders are betting the Fed will start easing the policy rate by September, according to CME Group's FedWatch Tool, compared with July before the release of the jobs data.The U.S. central bank raised its interest rate by 25 basis points as expected on Wednesday, but Chair Jerome Powell noted it was too early to say with certainty that the rate-hike cycle was over as inflation remains the chief concern.The main indexes are set for weekly losses after PacWest's move on Thursday to explore strategic options deepened concerns about the health of regional banks.The KBW regional index gained 4.4% after sharp losses earlier this week, while the S&amp;amp;P 500 Banks index was up 3.1%.\"The Fed data about its emergency lending dropping significantly ... I think the market is feeling better about the banks and their situation,\" said Michael O'Rourke, chief market strategist at JonesTrading.U.S. central bank data showed lending to banks shrunk a bit in the latest week, as money shifted out of a key lending tool.Following upbeat results from megacap companies, analysts expect profits for S&amp;amp;P 500 companies in the first quarter to decline 0.7% from a year earlier, according to Refinitiv data, compared with a 5.1% drop expected at the start of April.At 12:36 p.m. ET, the Dow Jones Industrial Average was up 397.24 points, or 1.20%, at 33,524.98, the S&amp;amp;P 500 was up 57.76 points, or 1.42%, at 4,118.98, and the Nasdaq Composite was up 207.75 points, or 1.74%, at 12,174.15.",
        "Used-car retailer Carvana Co jumped 29.6% as it expects to post a profit in the current quarter and plans to further bring down excess used-car inventory.Lyft Inc slumped 21.1% as the ride-hailing company's strategy to claw back market share from rival Uber Technologies Inc with lower fares stoked concerns about a hit to its profit margins.Advancing issues outnumbered decliners for a 4.82-to-1 ratio on the NYSE and a 2.57-to-1 ratio on the Nasdaq.The S&amp;amp;P index recorded 10 new 52-week highs and three new lows, while the Nasdaq recorded 64 new highs and 83 new lows. (Reporting by Ankika Biswas and Sruthi Shankar in Bengaluru; Additional reporting by Stephen Culp in New York; Editing by Subhranshu Sahu and Shounak Dasgupta)"
    ]
}