{
    "articleURL": "/sport/football/article-12038357/Englands-World-Cup-hopes-blow-Frank-Kirby-ruled-tournament.html",
    "content": [
        "England star Fran Kirby has been ruled out of the World Cup due to a knee injuryKirby will undergo surgery that will keep her sidelined for a 'significant period'She sustained the injury in the Blues' League Cup semi-final against West Ham England's World Cup hopes have suffered another blow with Fran Kirby the latest player to be ruled out of the tournament.",
        "The Chelsea forward will undergo knee surgery that will keep her sidelined for a 'significant period'.Kirby sustained the knee injury in the Blues' League Cup semi-final against West Ham in February and has not played since.The forward, who started every game of Euro 2022, had been receiving Platelet-rich plasma (PRP) injections in the hope of avoiding surgery but they have been unable to solve the issue.A statement from Kirby read: 'Unfortunately after a few months of rehab the decision has been made that I will require surgery on my knee.",
        "'I have been trying my best to not have to undergo this but unfortunately my progress has been limited due to the issue in my knee.'I'm absolutely gutted to announce that this means my season is over and I will not be able to make the World Cup in the summer. 'I'm going to be doing everything possible to be ready for the start of next season and want to wish my team-mates at Chelsea the best of luck for the rest of the season and my Lioness team-mates the best of luck for the summer.'England have already lost captain Leah Williamson to anterior cruciate ligament injury, which she suffered last month, while Beth Mead - who sustained the same injury in November, is also a doubt.",
        "Lucy Bronze and Millie Bright have both recently had surgery on their knees but are expected to be fit in time for the tournament in Australia and New Zealand.England manager Sarina Wiegman has admitted the long-term injuries to captain Williamson and Kirby are ‘devastating’ but insisted the Lionesses cannot dwell on their absences ahead of the World Cup.",
        "But while Wiegman expressed her sadness at losing both players, the manager insisted it provides opportunities for other players to show what they can do.‘It is devastating for the players and they are understandably gutted - it is really sad for the players,’ Wiegman said.‘Leah has done a tremendous job as our captain and she was in good form when it happened. It is horrible for her and sad for the whole team that she will be unavailable – she will be missed.‘And it is the same with Fran. She has been out for longer and it is a different injury but we had hoped she would be able to keep progressing‘It hasn’t worked out how we all hoped and now she will enter another schedule to try to get fit.‘Most of all, it is horrible for her and disappointing for the team. But on the other hand, it gives other players the opportunity to show their quality.",
        "‘That is the tough thing and the ruthlessness thing about top sport, where we have to move on and not focus on who isn’t there but instead concentrate on who will be there and who is available, as we try to reach the highest level that we can.’Kirby has previously suffered with knee injuries but they were successfully treated with PRP injections.Kirby will also miss Chelsea's title run-in as well as the FA Cup final on May 14.A statement from the club said: 'Following an injury sustained during our Continental League Cup semi-final against West Ham, Fran has been reviewed at Cobham by the Chelsea medical team.'Following that review and further discussion with a specialist, Fran is set to undergo surgery and is expected to be sidelined for a significant period.'Fran will begin a rehabilitation programme with support from the club's medical team. Everyone at Chelsea sends their best wishes to Fran in her recovery.'"
    ]
}