{
    "articleURL": "/news/article-12044359/John-Fetterman-blamed-depression-brutal-2022-campaign-against-Dr-Oz.html",
    "content": [
        "Sen. Fetterman insists he's fit to serve in Congress during depression recoveryHe blamed in the decline in mental health on the 'vicious' 2022 campaignFetterman suffered a stroke during his successful run for office and just one month after being sworn in admitted himself for inpatient care at Walter ReedJohn Fetterman blamed his decrease in mental health on the 'vicious' 2022 campaign against Dr. Mehmet Oz and assured he is fit to serve as he recovers from an in-patient hospital stay for depression.",
        "The Pennsylvania senator told KDKA-TV in a Tuesday interview that he is feeling 'fantastic' as questions continue to pepper Fetterman on his health.Fetterman was elected shortly after suffering a stroke in 2021, which he insisted did not affect his ability to be a senator while it did affect his audio comprehension. He admitted during an interview that he had to use real-time transcription programs to make sure he fully understood the questions being asked of him.Just one month after being sworn into office, Fetterman voluntarily admitted himself to Walter Reed Medical Center to be treated for depression.'I feel fantastic, honestly,' Fetterman said after his first week back in Washington, D.C. 'A lot of people have asked, 'Hey, how are you feeling? How's your depression?' Again, it's in remission, and I am just so grateful to be feeling great.' ",
        "Critics have been highly critical of Fetterman, claiming that it was clear he was not medically fit to serve in the Senate after he suffered his stroke. Those assertions were only further exacerbated after Fetterman went to the hospital.Republicans in Pennsylvania claim that he has not been able to fulfill his duties as senator and should resign or be replaced.The Democrat lawmaker claims that attacks on him during the 2022 Senate campaign contributed to his decline and led to his hospital stay.",
        "'It was after the brutality of the campaign,' Fetterman said regarding the onset of his depression. 'Some people believe that it was one of the most vicious political campaigns.'According to OpenSecrets, outside groups aired $84 million in attack ads against Fetterman in his campaign against Republican Dr. Oz, who had the backing of former President Donald Trump.Fetterman assured that despite being hospitalized for depression, he is fully capable of serving in Congress as he recovers.'Hell, yes, and that's why I'm doing it,' Fetterman told KDKA-TV. 'Just the way any Pennsylvanians are working is you take it a day and a day and work hard, and that's exactly what I've been doing here.'Following a successful Senate campaign last year and after being sworn into office in January, Fetterman checked himself into the military hospital in Bethesda, Maryland, just one month after taking office to be treated for clinical depression.He was discharged from Walter Reed at the end of March and returned to work at the Capitol when Congress came back from a two-week recess in April."
    ]
}