{
    "articleURL": "/wires/reuters/article-12041627/Soccer-Leeds-sack-Gracia-relegation-looming-Allardyce-takes-over.html",
    "content": [
        "May 3 (Reuters) - Relegation-threatened Leeds United have sacked manager Javi Gracia and appointed veteran coach Sam Allardyce until the end of the season, the Premier League club said on Wednesday.",
        "With four games left, only a superior goal difference is keeping 17th-placed Leeds out of the relegation zone after taking only one point from their last five games.Allardyce will be the club's third coach this season after American Jesse Marsch was sacked in February.\"We thank Javi and his team for their efforts under difficult circumstances. The remaining four games of the season will be overseen by experienced head coach Sam Allardyce,\" Leeds said in a statement.Former Watford manager Gracia is the 14th manager to lose his job in the Premier League this term.Hiring the 68-year-old Allardyce is a last throw of the dice by Leeds as they seek to stave off relegation in their third season back in the Premier League.He has managed Bolton Wanderers, Newcastle United, Blackburn Rovers, West Ham United, Sunderland, Crystal Palace, Everton and West Bromwich Albion in the top flight, as well as a very brief tenure as England's head coach.Allardyce has a reputation for helping struggling teams to avoid the drop although it did not work at West Bromwich Albion after he took charge midway through the 2020-21 season, the club falling into the Championship.He faces a huge task again with Leeds at title-chasing Manchester City this weekend, before games against Newcastle United, West Ham United and Tottenham Hotspur.",
        "\"I know it's in a lot of trouble, but I've seen a lot of trouble before,\" Allardyce told TalkSport.\"They are obviously very difficult games. We can all point out where the easiest one might be, but of course, there are no easy fixtures in the Premier League.\"I was shocked (to get the job). I never thought at this stage of the season...I thought there would be no jobs. The phone popped up with a name I knew fairly well, I knew what it was, and it took me two seconds to say yes.\"Stopping the goals going in will be Allardyce's first priority as they have conceded almost three times per game in the last 10 league matches.\"That has to stop if we're going to get out of trouble. We're needing to score three goals every game to win. If we're left to do that, that will be impossible,\" he said.\"I'm doing all I can with the staff to try and get the players out of trouble.\" (Reporting by Rohith Nair in Bengaluru and Martyn Herman in London, editing by Ed Osmond)"
    ]
}