{
    "articleURL": "/wires/reuters/article-12041977/Lilly-drug-slows-Alzheimers-progression-35-trial.html",
    "content": [
        "By Julie Steenhuysen and Deena Beasley",
        "CHICAGO, May 3 (Reuters) - An experimental Alzheimer's drug developed by Eli Lilly and Co slowed cognitive decline by 35% in a late-stage trial, the company said on Wednesday, providing what experts say is the strongest evidence yet that removing sticky amyloid plaques from the brain benefits patients with the fatal disease.Lilly's drug, donanemab, met all goals of the trial, the company said. It slowed progression of Alzheimer's by 35% compared to a placebo in 1,182 people with early-stage disease whose brains had deposits of two key Alzheimer's proteins, beta amyloid as well as intermediate levels of tau, a protein linked with disease progression and brain cell death.The study also evaluated the drug in 552 patients with high levels of tau and found that when both groups were combined, donanemab slowed progression by 29% based on a commonly used scale of dementia progression known as the Clinical Dementia Rating Scale (CDR-SB).Using that scale, experts said Lilly's findings were roughly on par with Eisai Co Ltd and Biogen Inc's lecanemab, sold under the brand name Leqembi, which reduced cognitive decline by 27% in patients with early Alzheimer's in a study published last year.The results drove Lilly's shares to a record high, up more than 6% at $429.85.Dr. Ronald Petersen, an Alzheimer's researcher at Mayo Clinic, said Lilly's trial is the third to show removing amyloid from the brain slows progression of the disease, which could put to rest some lingering doubts about the benefits of drugs in the class and the amyloid-lowering theory.",
        "\"It's modest, but I think it's real,\" he said of the benefit, \"and I think it's clinically meaningful.\"Dr. Erik Musiek, a Washington University neurologist at Barnes-Jewish Hospital, said the efficacy looks as good or better than lecanemab.\"The evidence is really starting to build up that these drugs do work,\" he said.Musiek said the findings also offer some of the first evidence for the benefit of earlier treatment. \"It really does suggest that you need to remove these plaques early, before the tau really gets going,\" he said.'RISK THAT NEEDS TO BE CONSIDERED'In the donanemab treatment group, Lilly said brain swelling, a known side effect of drugs of this type, occurred in 24% of participants, with 6.1% experiencing symptoms. Brain bleeding occurred in 31.4% of the donanemab group and 13.6% of the placebo group.In the Leqembi Phase 3 trial, the drug was associated with brain swelling in nearly 13% of its study participants.Lilly said the incidence of serious brain swelling in the donanemab study was 1.6%, including two deaths attributed to the condition, and a third, after an incident of serious brain swelling.A research note by SVB Securities analyst David Risinger was headlined: \"Donanemab Succeeds, But Safety Remains a Concern\".\"Clearly, one saw benefits here, but there is some risk that needs to be considered,\" said Dr. Eric Reiman, executive director of the Banner Alzheimer's Institute, which is running a study of donanemab in presymptomatic patients.",
        "Lilly said it plans to file for traditional U.S. approval by the end of June, and with regulators from other countries shortly thereafter. A company spokesman said a U.S. approval decision should come by year-end or early 2024.Alzheimer's experts said they were eager to see full results of the study, including data on how the drug performs in people who carry an Alzheimer's risk gene known as APOE4, who have been prone to increased risk of side effects in prior trials.Those results are set to be presented at an Alzheimer's meeting in Amsterdam this summer.Study participants received a monthly intravenous infusion of donanemab. At 12 months, half had no evidence of amyloid plaques, the company said.It also said 47% of donanemab patients in the 18-month trial had no disease progression at 12 months, compared with 29% of the placebo group.Lilly's drug is poised to become the third in its class on the market following U.S. approval of two similar medicines developed by partners Eisai and Biogen - Leqembi as well as Aduhelm, which failed to gain traction with doctors or insurers after showing little evidence that it slowed cognitive decline.Both were approved under the FDA's accelerated review program, based on their ability to remove amyloid plaques.",
        "Leqembi is currently undergoing the FDA's standard review process, with a decision due by July 6.Lilly is still working on finalizing the price for donanemab, and plans for it to be in the same range as other similar therapies, CEO David Ricks told CNBC.More than 6 million Americans are living with Alzheimer's, and that number is projected to rise to nearly 13 million by 2050, according to the Alzheimer's Association. (Reporting by Julie Steenhuysen in Chicago and Deena Beasley in Los Angeles, additional reporting by Manas Mishra in Bengaluru; Editing by Bill Berkrot)"
    ]
}