{
    "articleURL": "/femail/article-12052745/Lady-Louise-Windsor-19-Duchess-Edinburgh-join-royals-private-members-club.html",
    "content": [
        "Lady Louise Windsor joined other royals at private members' club Oswald'sREAD MORE: For all the latest Royal news, pictures and video click here How are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.uk Lady Louise Windsor proved she was just like any other teenager after raiding her mother's wardrobe for an outfit to wear this evening. ",
        "The 19-year-old daughter of the Duke and Duchess of Edinburgh opted for a Mary Katrantzou lace cocktail dress as she arrived at the private members' club Oswald's in Mayfair for a royal gettogether on the eve of the King's coronation.Her mother Sophie, 58, wore the frock in 2015 when attending an award ceremony in London - and proving it's still a stylish number, Lady Louise decided to wear it tonight.The Duchess, meanwhile, sported a £1,350 vibrant floral midi dress from Erdem, which she teamed with a cream coat and matching strappy heels. Lady Louise, who often borrows from her mother's wardrobe, and Sophie were joined at the occasion by other British Royal Family members - including Prince Edward, 59, James, Earl of Wessex, 15, and Princesses Beatrice and Eugenie.",
        "Oswald's is the most exclusive of London's private members' clubs, with the Queen Consort and Boris Johnson and his wife Carrie among those who frequent the venue.Zara Tindall, 41, who arrived alongside her husband Mike Tindall, 44, opted for a striking navy blazer and trouser combo, paired with a light blue shirt. Her cousin, Princess Eugenie, 33, who is expecting her second child with husband Jack Brooksbank, who was also in attendance at the family occasion, seemingly took inspiration from Zara and donned an Asceno Velvet Athens Robe, costing £575. ",
        "They were joined alongside Princess Beatrice, 34, dressed in Louis Vuitton's £2,900 chain print asymmetrical long-sleeved frock, as well as other Royal Family members - including Prince Andrew and Princess Anne. Tomorrow, they will join King Charles, Queen Camilla and the Prince and Princess of Wales at the coronation in Westminster Abbey. The King, Kate and William attended a Buckingham Palace reception this evening with foreign royals and world leaders. Joined by her husband, Eugenie, who already shares two-year-old August with Jack, paired her glamorous red robe with black heels and a matching bag.Coordinating with his wife, Jack opted for a smart suit, white crisp shirt and a red patterned tie.",
        "Beatrice, meanwhile, teamed her designer dress with black heels and a matching blazer. She added a touch of glitz to her look with dazzling earrings.Her husband, Edoardo Mapelli Mozzi, 39, who she shares one-year-old daughter Sienna with, looked equally sophisticated in a navy suit and a light blue tie.Meanwhile, Zara - arriving alongside her dapper husband Mike - teamed her look with court heels and dazzling diamond earrings. Elsewhere, Sophie, 58, and Prince Edward, 59, were joined by their children, James, Earl of Wessex, 15, and Lady Louise Windsor, 19.While several royal family members gathered in Mayfair, William, Kate and Charles were at Buckingham Palace, entertaining foreign royals, world leaders and dignitaries who have arrived in London for the coronation. ",
        "Mother-of-three Kate, 41, donned a new £360 Self-Portrait wrap midi dress to attend the lavish event, hosted by King Charles on the eve of his historic event.",
        "Joining foreign royals, world leaders and dignitaries including Queen Letizia of Spain at the glittering reception, the princess completed her ensemble with the Queen Mother's sapphire and diamond earrings.Enhancing her features with a smattering of glamorous makeup, Kate kept her hair in tight curls, with a statement side parting as she chatted to guests, including Crown Princess Mary and Crown Prince Frederik of Denmark and US First Lady Jill Biden.Kate appeared relaxed and at ease as she shared jokes with those invited, while King Charles was seen deep in conversation with the First Lady of Ukraine, President Zelensky's wife Olena Zelenska.Prince William was also on hand to greet guests as final preparations get underway for tomorrow's ceremony.Some 100 heads of state will be in London for the event, with international representatives from 203 countries due to attend.Other European royals enjoying the King's reception included Prince Albert and Princess Charlene of Monaco, Queen Letizia of Spain and Crown Prince Haakon and Crown Princess Mette-Marit of Norway.Jill Biden, who was pictured alongside Kate and Mrs Zelenska of Ukraine, is representing her husband, US President Joe Biden, along with her granddaughter Finnegan Biden."
    ]
}