{
    "articleURL": "/sport/rugbyunion/article-12047689/London-Irish-staff-players-finally-paid-owner-Mick-Crossan-steps-11th-hour.html",
    "content": [
        "Players had resolved to serve notice to their employers at 5pm on ThursdayCrossan belatedly stepped in and confirmed that he would cover payroll costsThe Exiles' final Premiership game of the season against Exeter will go-aheadLondon Irish players have been paid their April wages at last – after an eleventh-hour intervention by owner Mick Crossan averted the threat of squad members submitting breach-of-contract letters to the club.",
        "It is understood that Exiles players had resolved to serve notice to their employers at 5pm that they would be free to leave if the delayed salary instalment was not received within a fortnight. However, amid continuing delays with the transfer of funds from the United States – on behalf of the club's prospective buyers – Crossan belatedly stepped in and confirmed that he would cover payroll costs.There was also clarification that players would be have full medical insurance for their final Premiership game of the season against Exeter in Brentford on Saturday. That had been another contentious issue for Declan Kidney's squad, with captain Matt Rogerson demanding 'tangible evidence' that the cover would be in place.Now that the request for firm reassurance appears to have been met, Irish are set to take on the Chiefs as planned. ",
        "Exeter are believed to have been pushing all day for clarity about the tense situation, given that they are preparing for a journey up from Devon to London, for a fixture which will serve as an emotional farewell for many of their departing players.Irish have continued to train this week – while awaiting confirmation that their April wages would be honoured. The payment was due to arrive last Friday, but players and staff were assured by Howard Thomas – the former Premiership Rugby chief executive who is representing the new buyers of the club – that funds were on their way from the States. ",
        "As yet, the funds have not come through, which is why Crossan had to stump up the payroll money himself, to allay fears of a walk-out.By doing so, he has warded off the immediate crisis, but all involved will be desperate to ensure the take-over process is concluded soon, to disperse the nagging mood of uncertainty which has enveloped the club since late last year."
    ]
}