{
    "articleURL": "/sport/formulaone/article-12051563/Lewis-Hamilton-blasts-Floridas-Dont-Say-Gay-law-drive-Miami-rainbow-helmet.html",
    "content": [
        "The Mercedes driver criticized the state's government for passing the lawHamilton spoke out in favor of abortion rights at last year's Miami Grand Prix DailyMail.com provides all the latest international sports news Mercedes F1 driver Sir Lewis Hamilton ripped the Florida state legislature's anti-LGBTQ+ measures passed by lawmakers in recent months ahead of Sunday's 2023 Miami Grand Prix.",
        "Hamilton, a vocal ally for the LGBTQ+ community worldwide, compared laws approved by Florida's Republican governor Ron DeSantis to oppression seen in countries such as Saudi Arabia. 'It's not good at all,' Hamilton said ahead of the second grand prix held in Miami. 'I stand by those within the community here. I hope they continue to stand firm and push back. I'll have the rainbow on my helmet. It's no different to when we were in Saudi.'As the only Black driver in Formula One, Hamilton is one of the most vocal advocates for social justice, diversity, and human rights.  He has spoken out on issues of inclusion in countries with controversial human rights records and has previously raced with a rainbow helmet in Qatar and Saudi Arabia amongst other countries. ",
        "These words from Hamilton come just days prior to the first of three Grands Prix to be held in the United States - with dates in Austin, Texas as well as Las Vegas coming later this season.Desantis signed the 'Parental Rights in Education Act' - commonly referred to by opponents of the law as the 'Don't Say Gay Bill' - back in March.That law has been expanded and prohibits public school teachers in the state to teach their students about sexual orientation or gender identity. ",
        "While pushing back against the law, Hamilton did not outright say that Formula One should avoid racing in the 'Sunshine State' as a result of these repressive bills.'It's not for me to decide something like that,' Hamilton said. 'I did hear and have read about some of the decisions that have been made in government here and I do not agree with it and I do not support it. 'I really do continue to stand with the LGBTQ community and I'm wearing a rainbow flag on my helmet this weekend and I just really want to continue to support the community here and let them know I stand with them and I hope they continue to fight against it.'Hamilton added, 'It's not the people of Miami that are making these decisions, it's the people in government and that's the issue. 'I think, hopefully, all I can do - the sport is going to be here whether I am or not - but the least I can do is just continue to be supportive and just being here and having that on my helmet, hopefully that speaks well to the subject.'.",
        "This isn't the first time Hamilton has used the Miami Grand Prix to speak out on social justice issues in the United States. ",
        "Prior to last May's Miami GP - the first one ever held at the Miami International Autodrome - Hamilton spoke out in favor of abortion rights in the country.One month after the race, the Supreme Court overturned the decision made in Roe v. Wade that protected an individual's liberties to have an abortion.The resulting reversal of the ruling led to multiple states implementing serious restrictions on the medical procedure - including 14 states which have a full ban on the procedure. Many of those states do not have an exception for victims of rape or incest as a part of those laws.'I love being in the States, but I can't ignore what's going on right now and what some in the government are trying to do to the women who live here,' Hamilton said at the time. 'Everyone should have the right to choose what they do with their bodies. We can't let that choice be taken away.'",
        "The FIA - Formula One's governing body - said before the season started that drivers would be prohibited from speaking their minds on social justice issues at events.After pushback from drivers, the position was clarified that allowed racers to respond to questions.While Hamilton made his comments in response to a question asked by a reporter, he previously indicated that he would not follow the FIA's rule.",
        "Hamilton is the most successful driver in the history of Formula One, with the most wins in the sport's history and is tied with Michael Schumacher for the most world drivers championships ever."
    ]
}