{
    "articleURL": "/wires/reuters/article-12056641/Isolated-protest-eastern-Cuba-sparks-dueling-versions-social-media.html",
    "content": [
        "HAVANA, May 7 (Reuters) - Cubans in Caimanera, a small port town near the U.S. military base at Guantanamo, took to the streets late on Saturday evening, according to social media and official reports, in the first known anti-government protests of the year in Cuba.",
        "Videos posted on social media, many shared by dissidents outside Cuba and by human rights groups, showed what appeared to be men in military uniforms and others in civilian clothing confronting dozens of protesters on a dimly lit street while onlookers recorded the events with cellphones.The videos showed the protesters in the fishing village near the eastern tip of the island voicing anti-government chants and cries of \"freedom.\"Tensions have run particularly high in communist-run Cuba for several weeks as a dire fuel shortage has stressed the country's public transportation, power generation and food supply.The Cuban government did not immediately respond to a request for comment.But state-run radio journalist Mabel Pozo said on social media that the protest began when \"various citizens, some in a state of drunkenness, yelled statements against the Cuban social process and regarding their dissatisfactions.\"Pozo wrote that \"security forces and other people contributed to dissuade people concentrated on the street, who responded and returned to their homes.\"Reuters could not independently verify the reports or video on social media or the official media version of events.Far-flung Caimanera is known in Cuba as the \"first trench of anti-imperialism\" for its proximity to the U.S. naval base at Guantanamo. The town is more than 12 hours overland from the capital Havana.",
        "Protests in Cuba are exceedingly rare but have cropped up more often in recent years as economic crisis racks the island. While the country's 2019 constitution grants Cubans the right to protest, a law more specifically defining that right is stalled in the legislature.Dissidents have accused the Cuban government of blocking internet traffic countrywide when protests flare in a bid to contain anti-government sentiment.Global web watchdog Netblocks showed a sharp drop in web traffic in Cuba on Saturday shortly after the protest was first reported.\"Network data show a collapse in internet traffic in #Cuba amid protests for freedom and human rights centering around Caimanera, Guantanamo; connectivity remains intermittent at present with partial restoration noted,\" the internet monitor said on Twitter.The state-run media version of events appeared to blame the lack of internet access on a spike in web traffic.\"The tranquility of the afternoon was altered this Saturday in Caimanera and of course, the internet nearly collapsed,\" official journalist Pozo said.That message was shared by state-run TV broadcaster Canal Caribe several hours after the first videos were posted, confirming the protest in Caimanera but assuring citizens that \"the streets were calm.\" (Reporting by Dave Sherwood; Editing by Will Dunham)"
    ]
}