{
    "articleURL": "/tvshowbiz/article-12047481/Sophie-B-Hawkins-says-ahead-time-came-omnisexual-1992.html",
    "content": [
        "Sophie B. Hawkins shared in a new interview that she considers herself a forward-looking figure when it comes to her sexuality.",
        "While speaking to People, the 58-year-old singer–songwriter said she was 'ahead of my time' when she came out as 'omnisexual' in 1992.She claims to have 'coined the phrase' — seemingly a precursor to the more common 'pansexual' — when she came out.'The words that I put together and coined are now actually one of the definitions,' she said. 'I was a little ahead of my time on that one.'She explained that she 'took omni and I took sexual and I put them together, and I said, \"This represents me.\"'",
        "The As I Lay Me Down singer recalled a conversation she had with a male journalist around the time of her coming out.'My sexuality is not based on my gender, and it's not defined by your gender,' she told him.Hawkins added that it was a 'very new concept' to be attracted to someone irrespective of their gender.However, she added that a large chunk of the public either did not understand the nuances of her omnisexuality, or they simple refused to believe her.'People did not pick up on it, and they just said, \"Ah, you're gay. You're gay. You're gay.\"'But she sounded proud now that omnisexuality is 'actually a thing.'Her coming out came at a difficult moment in her career, as it was the same year as her debut album Tongues And Tails, which was released in April 1992. ",
        "The album only reached number 51 on the Billboard 200 albums chart, but Damn, I Wish I Was Your Lover was a hit at number five on the Billboard 100 singles chart, while her cover of Bob Dylan's classic I Want You reached number 20 on the chart.Hawkins would go on to be nominated for best new artist at the Grammy Awards in 1993.Hawkins claimed her label at the time, Sony, 'got mad' about her coming out.'I was talking about it on pop radio, on the morning shows, and people were very angry at me, but there were some people who were very grateful to me,' she recalled.Despite the alleged anger from her label, Hawkins said she continued to be vocal about her sexuality, and she also toured with a band featuring multiple lesbians.'[Sony] didn't see that coming, and they pulled a lot of support. And they got very angry at me,' she continued. 'I had a lot of women in my band, and they happened to be gay. I didn't know when I heard them. But it was four gay women on stage, and then some guys.'",
        "Hawkins also defended other 'transgender' and 'intersex' performers at the time, which she mentioned amid a current wave of anti-transgender bills sweeping statehouses in Republican-controlled states.",
        "'In my mind, it was time to start talking about, \"Gender shouldn't oppress us. Gender should free us. It's a creative discussion.\" But in 1992, no one else was talking about it.'Hawkins admitted that she was of two minds about the seeming increase in acceptance in certain parts of the country.'I'm excited and happy that the world is... that you can be who you are now, and you can expect support, and you should get it,' she said, before adding, 'Then there's a part of me that also says, \"If the industry can profit off of it, that's what they're going to do. And that's going to be why they support anything.\"'"
    ]
}