{
    "articleURL": "/news/article-12058145/Federal-Budget-2023-Centrelinks-JobSeeker-dole-payments-increased-40-fortnight.html",
    "content": [
        "JobSeeker may be increased by up to $40 a fortnightCentrelink's JobSeeker payments may be increased by up to $40 a fortnight for all recipients in Tuesday's federal Budget. ",
        "Earlier, the Albanese government had signalled it may only increase unemployment payments for some 200,000 Australians who are older than 55. That sparked anger from the Labor base, particularly given reports Treasurer Jim Chalmers will announce a budget surplus on Tuesday night. Sky News political editor Andrew Clennell claimed on Sunday it is looking increasingly likely all JobSeeker participants should expect a 'modest' boost.'I am told the JobSeeker increase could be up to $40 a fortnight,' he said on Sunday.'To deliver a surplus and not deliver such assistance when JobSeeker is just $49 a day would have really angered the Labor base.' Treasurer Jim Chalmers all but confirmed the policy.",
        "In an interview on ABC Radio on Monday Morning, Dr Chalmers said: 'I've been saying for some days really, since the story about people over 55 first appeared, that the cost-of-living support will be broader than that, and it won't be limited by age.'And I think when people see the package in its entirety, they will see what we've tried to do here is recognised the genuine pressures that people are under, and to do what we can, beginning with the most vulnerable people.'Dr Chalmers has worked hard to create a 'broadly neutral' Budget which won't negatively impact the economy or drive up inflation.",
        "It will be marked by spending restraint and investment in 'drivers of growth'.But there are still areas in which the government find it crucial to spend.On Monday morning, Prime Minister Anthony Albanese confirmed he will raise the age for the single parenting payment in the Budget.",
        "Single parents will now be entitled to financial support on the Parenting Payment (Single) until their child is 14 in a commitment worth $1.9 billion.Mr Albanese said: 'Many single parents - overwhelmingly women - face difficulty balancing caring responsibilities and work. 'Those difficulties do not end when their child turns eight.' The updated plan will come into effect from September 20 of this year.Under the new policy, single parents who are currently on JobSeeker will receive an additional $176.90 per fortnight. In total, some 57,000 single parents (90 per cent of whom are women) will benefit. The payment is $922.10 per fortnight.While the response to reports of an increase to JobSeeker across the board, there are still concerns from some stakeholders that not enough will be done.Greens Senator Janet Rice described the 'modest' upgrade as a 'slap in the face to everyone in desperate need'.'If the reports are true, Labor's planned increase to Jobseeker is less than even the Liberals did under Scott Morrison,' she said. ",
        "'While in opposition, Labor slammed the Morrison Government for its paltry increase and now in government, Labor is doing even less to help welfare recipients than the conservative party.'The Greens want the payment raised to $88 a day. The current base rate is $49.50 per day."
    ]
}