{
    "articleURL": "/tvshowbiz/article-12059037/Sam-Burgess-pregnant-girlfriend-Lucy-Graham-flaunts-macabre-baby-shower-cake.html",
    "content": [
        "Footballer Sam Burgess and his girlfriend Lucy Graham will soon welcome their first child together.",
        "And on Sunday, Lucy was celebrating the impending arrival with a baby shower that came complete with a macabre 'birthing' cake. The WAG proudly showed off the dessert, which featured the head of a plastic newborn doll, and depicted the infant crowning during birth. The baby's head peered from pink folds of icing which was dotted with chocolate sprinkles standing in for pubic hair, and covered in a red, blood-like sauce. Lucy seemed absolutely delighted with the cake, with Instagram Stories filmed on the day showing her sinking her teeth into the baby doll's face and licking sauce from its forehead during a party game. ",
        "The baby shower was arranged at the 'last minute' by her friends and family while she was visiting the UK.The hairdresser, who recently moved from England to Sydney to start a new life with Sam, looked gorgeous as she showed off her baby bump in a skintight dress.The baby shower took place at a venue in Leeds called Poppy's Potting Shed, where she made floral bouquets with her pals.The mother-to-be shared a gallery of photos on Instagram from her special day, and thanked her loved ones for making it everything she 'could have wished for'. ",
        "'Thank you so much to my amazing friends for organising the most wonderful last minute baby shower / wedding I could have wished for,' she wrote in the caption.",
        "'Wedding' was a reference to her throwing one of the bouquets the women made.'I love you all and thank you so much to everyone for coming at such short notice and making the little time we had so much fun. There's no place like home,' she added.In one of the photos, she posed with her bouquet and cake; in others, she smiled alongside her family and friends while showing off her growing bump. ",
        "Sam confirmed in March he was expecting his third child with Lucy.The NRL coach already shares two older children, Poppy, four, and Billy, three, with his ex-wife Phoebe Burgess (née Hooke).'We are so excited and happy to be starting this new chapter together... Happy days,' he said in a statement.Friends said Sam was 'beyond excited' to start a new chapter with Lucy by his side.'He's mad about Lucy. It's been a whirlwind but she is a fantastic woman,' the source said.'They get along so well. All of his friends are so thrilled to see how happy he makes her.'"
    ]
}