{
    "articleURL": "/news/article-12042103/Zelensky-says-Biden-administration-told-classified-docs-leak.html",
    "content": [
        "Ukrainian President said he learned about leaked intelligence from news media'I did not receive information from the White House or the Pentagon beforehand,' Zelensky told The Washington Post in an interview He said the information helped Russia in its invasion of his country'For us, anything that informs our enemy in advance in one way or another is definitely a minus for us. I don't see any advantages here,' he said Ukrainian President Volodymyr Zelensky said he learned about the leak of classified war information from news reports and not from President Joe Biden's administration.",
        "'I did not receive information from the White House or the Pentagon beforehand,' Zelensky told The Washington Post in an interview. 'We did not have that information. I personally did not. It's definitely a bad story.'He blasted the leak as damaging to both his own country but to America's reputation throughout the world. 'It is unprofitable for us,' he said. 'It is not beneficial to the reputation of the White House, and I believe it is not beneficial to the reputation of the United States.'The cache of classified material, posted online through the Discord messaging program by National Guard Airman Jack Teixeira, detailed American national security secrets from Ukraine to the Middle East to China. ",
        "The material originally appeared on Discord - a platform popular with gamers - and then was reposted on Twitter and other social media platforms. The leaks were notably in its timeliness - some of the maps of Ukrainian air defenses were barely forty days old. The revelation of the classified material jarred U.S. intelligence agencies and raised questions about America's abilities to keep its secrets. The documents included information on Kyiv's shortfalls of weaponry - with concern its forces may run out of missiles - and revealed the United States had doubts about Ukraine's chances of success in its forthcoming counteroffensive, assessing it could result in only 'modest territorial gains.'",
        "And they appeared to show the U.S. was monitoring Zelensky's internal conversations. The Ukrainian president wouldn't confirm or deny if the information in the material was accurate and he wouldn't even describe the disclosures as 'sensitive' — because that would acknowledge that the documents are real, he said. 'It is not sensitive,' Zelensky told The Post. 'If I answer you, that means it's sensitive, it means there are real documents. Please, stop playing games with me. I am the president of a country at war.'Ukrainian officials dismissed the documents as being 'fake' or as part of a Russian disinformation campaign. But American officials said some of the documents appeared altered but said that, for the most part, they are real.Much of the information in the documents is 'top secret' and is limited to American officials or to the 'Five Eyes' — the intelligence alliance of the United States, Britain, Australia, New Zealand and Canada.Zelensky called the leaks a 'TV show' and fretted the information could aid Russia in its invasion of the Ukraine.'Somewhere it's a hype, somewhere it's a scandal,' Zelensky said. 'For us, anything that informs our enemy in advance in one way or another is definitely a minus for us. I don't see any advantages here.'",
        "'People ask me, who benefits from this? My answer is very simple: I don't have time to figure out who benefits from this. I'm looking at who doesn't benefit from it,' he noted.Secretary of State Anthony Blinken appeared to walk back some of the claims when he conducted an interview with The Washington Post for World Press Freedom Day.'What was published in in the press in the media reflected a particular point in time. And this is not static. And so where Ukraine might have been a month ago, two months ago, three months ago, is not where it is now in terms of its ability,' he said.He noted the U.S. has helped bring together 50 countries to aid the Ukraine.'I feel confident that they will have success in regaining more of their territory. And I think it's also important to note that for Russia, this is already a strategic failure. Russia sought to erase Ukraine from the map to eliminate its independence to subsume it into Russia. That has failed,' he said.",
        "The leak led to strained relations between Kyiv and Washington. And there are some concerns the Ukrainians could stop intelligence sharing with the Biden administration to prevent further breaches.Zelensky stopped short of saying that relations were damaged between his nation and the United States but said the information in the documents helped Russia and hurt his country.",
        "'For us, anything that informs our enemy in advance in one way or another is definitely a minus for us. I don't see any advantages here,' he said.  'I cannot risk our state,' Zelensky noted.The 45-year-old president of the Ukraine noted it was not the first time he had been caught up in leaks from the White House. Zelensky got entangled in Donald Trump's first impeachment after details from then-president's phone call with him were leaked. 'Do you remember how our conversation with Trump got out? They printed it. Well, to be honest, I didn't give my permission for that either,' he told the Post. Details from Trump's July 25, 2019 phone call with Zelensky were leaked to news outlets, revealing the then-president pressured Zelensky to look into activities by Joe Biden's son Hunter in the Ukraine. Trump threatened to withhold aid to Ukraine and a highly-coveted meeting in the Oval Office. The ensuing scandal led to an impeachment trial where Trump was acquitted by the Senate.  ",
        "Jack Teixeira, a member of the United States Air Force National Guard, was arrested in April in Massachusetts.He held a top secret security clearance and allegedly began posting information about the documents online around December 2022, and photos of documents in January. He faces charges of unauthorized retention and transmission of national defense information and unauthorized removal and retention of classified documents. "
    ]
}