{
    "articleURL": "/sport/football/article-12042797/Viewers-SLAM-coverage-Wrexhams-open-bus-parade-winning-National-League.html",
    "content": [
        "Wrexham won the National League and thus promotion to the Football LeagueTheir parade on Tuesday attracted thousands of fans and mainstream coverageSome viewers criticised the coverage, with the entire parade broadcast liveSeveral football fans have lodged their complaints after Wrexham's open-top bus parade was shown on the BBC.",
        "The Welsh side have gained promotion to the Football League after winning the National League, and paraded their trophy to thousands of fans lining the streets of the city on Tuesday evening.The club's Hollywood owners, Ryan Reynolds and Rob McElhenney, were present on the buses and joined by the squad that will lead the club back into the Football League for the first time in 15 years.Reynolds and McElhenney arranged the victory parade, which got underway at 6.15pm and saw the players head through the city for an hour before finishing up at the Racecourse Ground.Several fans were left bewildered by the coverage of the celebration, however, with the BBC choosing to show full coverage of the fifth tier champions' celebration.",
        "'Absolutely lost for words, BBC national news showing live coverage of Wrexham's open top bus parade?!' questioned one stunned fan on Twitter.'The BBC are showing live coverage of Wrexham’s open top bus parade on their website. The circus is continuing in full swing!' said another fan. 'Can’t imagine they would give that coverage for league sides, let alone non-league.''BBC website doing live coverage and rolling updates of the Wrexham parade? We've officially gone too far,' added a third.",
        "The men's bus read: 'National League Champions' and had to be guided through the fans in the streets as viewers watched on.",
        "It wasn't all bad, however, with some viewers pleased to see the National League receiving more mainstream coverage.'Genuinely astounding to see live BBC News coverage of a National League title parade,' said one user. 'Never thought I'd live to see the day. Congratulations to everyone at Wrexham.'",
        "'Fantastic to see - the BBC News channel provided almost 2 hours of uninterrupted coverage of the parade. Loved it,' said another.Reynolds and McElhenney were spotted waving to the crowd while sitting on the women's team bus as they celebrated their promotion into the Genero Adran Premier. Queen's iconic song 'We are the Champions' was heard blaring out of the speaker on the bus as they made their way along the 3.5-mile route, while supporters let off red flares to create an even greater atmosphere for the parade. Reynolds and McElhenney were brought to tears on the parade as the celebrations continued ahead of the off-season in the English game."
    ]
}