{
    "articleURL": "/news/article-12054991/JAN-MOIR-Huw-Edwards-scrambled-inside-velvet-sack-superlatives-Coronation-justice.html",
    "content": [
        "Rain fell on Coronation Day, and if you think the nation's broadcasters and celebrities were going to let this insolent precipitation pass unnoticed, you were very much mistaken.We are not British for nothing, and there is nothing that we love more than discussing the weather. At length.'It has not been entirely kind,' whimpered Huw Edwards on The Coronation of HM The King (BBC1), as the Diamond Jubilee State Coach sloshed through puddles en route to Westminster Abbey. 'Yesterday this part of London was in a torrential downpour,' he added, because you can always depend on Huw to egg the quiche of despair with an extra portion of double-thick gloom.His colleague Clare Balding was more upbeat. 'Just a light drizzle in the air, nothing more than that,' she said briskly, before turning her attentions, as always, to the horses. 'All of them are trained for ceremonial work,' she said, admiringly.You could say much the same about King Charles.",
        "Over on The Coronation of King Charles III (Sky), Mark Cann did the honours.'The King is the one person I have met in my life who does not mind the rain. He just stands there as if nothing is happening,' said Cann, the director of the British Forces Foundation.At home millions of viewers put down their cups of tea to absorb the news of this mind-blowing regal superpower. A man. Who could stand. In the rain. Simply astonishing. No wonder they are putting a crown on his head!Back on the BBC, presenter Kirsty Young cast her eyes towards the heavens. 'I think the rain has stopped now. Maybe some of those soggy cagoules have dried out?' she wondered.Who cared, but it was lovely to hear her deep Scottish voice again, rumbling away as if she were broadcasting from inside an ancient bronze porridge pot in the depths of Glen McBonny.In the Abbey, Cardinal Welby had the last word on the weather. 'He liveth and raineth supreme over all things,' he said. Amen to that.As the Coronation broadcast rolled on, it became clear that everything we had experienced before on the royal stage had nothing on this.Royal weddings, funerals, investitures and jubilees, platinum or otherwise, simply could not compare to the dazzle and formality of this full-blown, pumped-up pomp.",
        "This was the big one, the real deal; an orgy of carriage riding, orb and sceptre waving, Bible kissing and utterly riveting ancient ritual.There were spurs presented on velvet cushions; assorted hardware including rings and jewel-encrusted swords that the King reached out to touch with his buffed nails. There was Penny Mordaunt in sea green looking more regal than the royals.'May the Lord clothe you with the robe of righteousness,' said Welby, as the King changed in and out of a succession of complicated outfits, helped by his handsome equerry Major Johnny Thompson.'The moment of crowning has arrived,' whispered Huw on the BBC, at the peak of high intensity as King Charles, in the autumn of his life, accepted his destiny at last.There were times when Charles looked emotional and Camilla looked – let's be frank – terrified and no wonder. As they recited their oaths from the script, camera close-ups revealed their individual lines, underscored and highlighted with yellow pen.It was a very human touch on a day loaded with symbolism and teeth-grinding gravity.No wonder that broadcasters scrambled desperately inside the velvet sack of superlatives in attempts, often unsuccessful, to do justice to this great event.",
        "'The beauty and majesty of the Abbey, the imprint of history at every turn,' sighed Tom Bradby for King Charles III: The Coronation (ITV1). 'A thousand years of history and a new chapter begins inside the State Coach,' said his colleague Julie Etchingham, as the freshly anointed King Charles III climbed aboard another, grander golden chariot and trotted past.Still, there were frustrating moments when the cameras failed to focus on what was really interesting. After the ceremony, for the first time in British history, soldiers and military bands massed in the Buckingham Palace garden to salute their new king.'What an astonishing and special sight that is,' said Kirsty Young. Indeed it was, so why did the cameras switch to Sophie Raworth interviewing two female bishops outside Westminster Abbey? Very worthy, but very dull.On Sky it was even worse.Instead of listening to the massed pipes and drums of 18 regiments belting it out at the Palace, we got Kay Burley asking Dame Joanna Lumley how she 'knew the royal couple'.",
        "It was like two old dears gossiping over a garden hedge or a cheeky prosecco, or perhaps even both. 'I knew them separately to begin with,' began Joanna.'I met Mrs Parker Bowles, as she was known then, through Jilly Cooper. Then I met him at a charitable thing. You just get to know these ordinary and extraordinary people they are just like us, but in a complete different arena.'Indeed. And apparently they can even stand in the rain as if nothing were happening! Wonders will never cease.There were some things that were too delicate to mention, but you can depend on Kay to mention them. 'The police have arrested six protesters this morning, they were having none of it,' she said.And as Prince Harry strode into view, she sympathised with him. 'As anticipated, he is going to sit with Beatrice and Eugenie. It must be a very stressful time for him,' she added. They're not that bad, surely?One might have imagined that the solemnity of the day and perhaps even the constraints of decorum might have stopped anyone from commenting on the difficult origins of Charles and Camilla's relationship, but it was not to be.",
        "'Oh this fairy tale of Charles finding the woman he loved and of course the terrible, ghastly tragedy of Diana,' foamed historian Sir Anthony Seldon on Sky.Couldn't someone stop him? No. On and on he went.'Charles clearly loved Camilla all along, it was organic, the 1970s, it would be a different world today if they found their happy place,' he raved. Kirsty Young was more circumspect. 'The day that many people believed we would never see,' was all she said.But her guest Anton Du Beke could barely keep it together.'They are King, Queen, they are husband, wife, they are soulmates, they are romantic. I think they are a lovely couple. Can I say that about the King and Queen? If ever two people were made for each other, it is those two,' he said, almost weeping with emotion.It was that kind of day. Meanwhile, the weather continued to weather. 'The sun is trying to break through the cloud,' said Clare Balding. 'It is a typical spring day in Britain; damp but cool and full of joy.' Was it really?'No, it is still very much raining here on the Mall,' said Anita Rani for the BBC."
    ]
}