{
    "articleURL": "/news/article-12038193/Tinder-quit-Russia-citing-right-protect-human-rights.html",
    "content": [
        "Tinder owner Match Group will quit Russia by June 30 over human rights issuesIt follows other providers such as Spotify and Netflix pulling out of Russia tooMatch, who also own Hinge, say they are taking steps to restrict Russian accessThe owners of dating app Tinder have decided to quit Russia by the end of next month - more than a year after Vladimir Putin's full-scale invasion of Ukraine began.",
        "Match Group, whose brands also include Hinge and PlentyOfFish, have made the decision to pull out of the Russian market in a move they say is to protect human rights.Following in the footsteps of several Western firms to leave Russia since Putin sent troops into Ukraine last year, Tinder will end its time in Moscow by June 30. 'We are committed to protecting human rights,' Match said in an annual impact report published yesterday. 'Our brands are taking steps to restrict access to their services in Russia and will complete their withdrawal from the Russian market by June 30, 2023.' ",
        "Many digital services providers with few staff in Russia, such as Spotify and Netflix, pulled out shortly after Moscow began its military campaign in Ukraine in February 2022.",
        "Tinder's parent company has made few public statements about its Russian operations, but flagged negative impacts on its European business in March last year.Match declined MailOnline's request for additional comment. Match shareholder Friends Fiduciary Corp said Tinder's owner had set an example for others to follow in tying its decision to the human rights risks faced by the Ukrainian people.The European police agency Europol said in September that dating apps were among the online platforms being 'hijacked' by individuals for human trafficking purposes, drawing attention to the plight of Ukrainian refugees.",
        "Jeff Perkins, executive director at Friends Fiduciary, said that a business that trades on trust had good reason to leave Russia.He said: 'It's not a good look for a trusted brand to be continuing operations in a nation where the head of state has been indicted by the International Criminal Court.'The ICC issued an arrest warrant on March 17 against Putin, accusing him of the war crime of illegally deporting hundreds of children from Ukraine.",
        "Moscow denies committing war crimes including forced deportations of children, and says the ICC decision is meaningless as Russia is not a member.Match's decision to pull out of Russia comes after fashion tycoon Paul Smith dropped ties with the nation after being confronted by the Mail.In February, Smith said he has 'ceased all supplies' to the country and intends to close his stores there. There had been a growing backlash over his failure to pull out of the country condemned for their invasion of Ukraine.Brands including Louis Vuitton, Dior, Zara, Coca-Cola, McDonald's, Pepsi and Starbucks all left the Russian market shortly after Putin's invasion."
    ]
}