{
    "articleURL": "/wires/reuters/article-12050127/Mass-shootings-Europe-decades.html",
    "content": [
        "May 5 (Reuters) - After two mass shootings in Serbia this week, here is a timeline of some of the worst shooting incidents in Europe in recent decades:",
        "May 1987 - BELGIUM - Michael Van Wijnendaele, who had injured his own parents-in-law and ran amok in the farming community of Bogaarden, south of Brussels, shoots himself as police try to get him to surrender after he killed six other people.August 1987 - BRITAIN - Michael Ryan, a 27-year-old gun fanatic, rampages through the English town of Hungerford, killing 16 people and wounding 11 before shooting himself. July 1989 - FRANCE - A French farmer shoots and kills 14 people including members of his family in the village of Luxiol, near the Swiss border. He is wounded and captured by police. September 1995 - FRANCE - A 16-year-old youth runs amok with a rifle in the town of Cuers, killing 16 people and then himself after an argument with his parents.March 1996 - BRITAIN - Thomas Hamilton bursts into a primary school in the Scottish town of Dunblane and shoots dead 16 children and their teacher before killing himself. April 2002 - GERMANY - Robert Steinhauser, 19, opens fire in Erfurt after saying he was not going to take a maths test. He kills 12 teachers, a secretary, two pupils and a policeman at the Gutenberg Gymnasium, before killing himself. November 7, 2007 - FINLAND - Pekka-Eric Auvinen kills six fellow students, the school nurse and the principal and himself with a handgun at the Jokela High School near Helsinki. September 23, 2008 - FINLAND - Student Matti Saari opens fire in a vocational school in Kauhajoki in northwest Finland, killing nine other students and one male staff member before killing himself. March 2009 - GERMANY - A 17-year-old gunman kills nine students and three teachers at a school near Stuttgart and another person at a nearby clinic. He is later killed in a shoot-out with police. Two additional passers-by are also killed, bringing the death toll to 16, including the gunman.",
        "June 2010 - BRITAIN - Derrick Bird opens fire on people in towns across the rural county of Cumbria. Twelve people are killed and 11 injured. Bird also killed himself. August 2010 - SLOVAKIA - A gunman shoots dead six members of a Roma family and another woman in the Slovak capital Bratislava before killing himself. Fourteen more people are wounded. April 2011 - NETHERLANDS - Tristan van der Vlis opens fire in the Ridderhof mall in Alphen aan den Rijn, south of Amsterdam, killing six before turning the gun on himself. July 2011 - NORWAY - Anders Behring Breivik kills 77 people when he plants a car bomb that kills eight people at an Oslo government building, then shoots dead 69 more, most of them teenagers, at an island summer camp of the ruling Labour Party's youth wing.November 2015 - FRANCE - Islamist attackers in Paris armed with guns and bombs target the Bataclan music hall, six bars and restaurants, and the perimeter of the Stade de France sports stadium just outside the French capital, killing 130 people - including 90 concertgoers in the Bataclan - and injuring hundreds.July 2016 - GERMANY - An 18-year-old German-Iranian man, who is obsessed with mass kilings, kills at least nine people in Munich.",
        "March 2023 - GERMANY - A gunman in Hamburg shoots dead six people before killing himself at a Jehovah's Witness worship hall. Eight other people were wounded, including a seven-months pregnant woman, who lost her unborn daughter.May 2023 - SERBIA - In a single week, a 13-year-old boy guns down eight fellow pupils and a security guard in a Belgrade school. Two days later, a gunman kills eight people and wounds 14 others in a village near the Serbian capital. Both suspects are arrested.(Compiled by Edmund Blair Editing by Gareth Jones)"
    ]
}