{
    "articleURL": "/wires/reuters/article-12039741/White-House-Fed-rates-having-negative-effect-banking.html",
    "content": [
        "By Andrea Shalal",
        "WASHINGTON, May 2 (Reuters) - A top White House economist on Tuesday said Federal Reserve interest rate hikes aimed at curbing inflation were having a negative impact on the banking sector, and warned Republicans against worsening the situation with their debt ceiling threats.Heather Boushey, a member of the White House Council of Economic Advisers, told Reuters that Republicans should not be \"playing games\" with the U.S. economy, by pegging an increase in the $31.4 trillion debt limit to budget cuts.\"The economy remains, it's been strong. You don't want to be pushing it off of the course that it's on,\" Boushey said, urging Republicans to back a debt ceiling increase without conditions. \"The Fed is raising interest rates in the hope of reducing inflation. That is having this negative effect on the banking sector. Why would we add to that?\"Boushey said Congress could easily remove the risk of default by raising the debt ceiling, while the issue of interest rates and their impact on bank assets was a far more complicated question that no single entity had the power to solve.\"This is terrible. It's scary. We should not be be playing these kind of games with the U.S. economy and with the full faith and credit of the United States,\" Boushey said. \"We need to be focused on how we're going to keep the economy moving.\"",
        "Boushey's comments come as Fed governors are gathered for a two-day policy meeting that analysts expect to result in a 25-basis-point increase in the federal funds rate on Wednesday.House Republicans passed a bill to raise the debt limit last week that includes steep cuts to spending from healthcare to air-traffic controllers, which the Democratic-controlled Senate and President Joe Biden say they will not approve.Biden on Monday summoned the four Senate and House of Representatives leaders - two fellow Democrats and two Republicans - to the White House next week, after the U.S. Treasury warned the government could run short of cash to pay its bills as soon as June 1. (Reporting by Andrea Shalal; Editing by Leslie Adler, Jonathan Oatis and Lincoln Feast.)"
    ]
}