{
    "articleURL": "/wires/reuters/article-12056087/Torrid-Tigers-aim-series-sweep-Cardinals.html",
    "content": [
        "The Detroit Tigers will bid for their second straight series sweep when they face the St. Louis Cardinals Sunday.",
        "After winning three straight games over the New York Mets at home, the Tigers won the first two games of their road series at Busch Stadium: 5-4 Friday night and 6-5 in 10 innings Saturday afternoon.\"These guys are grinding and doing everything they can to contribute,\" Tigers manager A.J. Hinch said. \"They are really buying in to what we're doing and they are coming in and doing their best.\"The Tigers promoted Alex Faedo from Triple-A Toledo to make his first start of the season Sunday.Faedo was 1-5 with a 5.53 ERA in 12 starts for the Tigers last season. He started well, posting a 2.92 ERA in his first seven starts, then he faded with an 11.34 ERA in his final five starts while pitching with a hip injury.Faedo overcame Tommy John surgery earlier in his career. After recovering from hip surgery last fall, he reverted to his three-quarter arm slot he used in college.\"I was a little too stubborn trying to pitch,\" Faedo told the Detroit Free Press. \"Missing two years, I didn't want to be hurt again ... Eventually, it got to a point where I wasn't only hurting myself, but I was hurting the team.\"Faedo was 0-1 with a 2.50 ERA at Toledo in five starts this season. This will be Faedo's first career start against the Cardinals.",
        "St. Louis brings an eight-game losing streak into the game.\"We've been playing a lot of close ballgames, been playing better baseball, but it's tough to say that because we're continuing to lose, eight in a row,\" Cardinals manager Oliver Marmol said. \"But the style of play looks a lot better.\"The Cardinals will start Steven Matz (0-4, 6.39 ERA) Sunday and give him another chance to get his season on track.Matz suffered a 5-1 loss to the Los Angeles Angels in his previous start. He allowed four runs in the first inning of that game, then threw four scoreless innings.\"I got into a rhythm after that first inning,\" Matz said. \"One pitch got me bad there. Not the start I was going for, start of the season or the game. So I've got a lot of things I need to address and look at. Ultimately, I can look at the four innings today, finishing strong, and build off that.\"Matz allowed Taylor Ward's three-run homer on a 2-2 pitch. That was the fifth two-strike homer he has allowed this season.\"I find myself getting to that mindset a lot of trying to be too perfect and too fine, make the perfect pitches,\" Matz said. \"It normally works against me. So that's something where I'm trying to just relax out there and execute pitches, keep it simple and not overthink it.\"",
        "Matz is 0-0 with a 1.50 ERA in two career starts against the Tigers.The Cardinals made two roster moves Saturday. They activated veteran right-hander Adam Wainwright, promoted catcher Tres Barrera and demoted reliever Guillermo Zuniga and designating utility player Taylor Motter for assignment.Marmol indicated that Andrew Knizner and Barrera would do much of the catching moving forward while Willson Contreras will get more of his at-bats at designated hitter.--Field Level Media"
    ]
}