{
    "articleURL": "/tvshowbiz/article-12046427/Tasha-Ghori-reveals-received-surprise-minute-invitation-King-Charles-Coronation.html",
    "content": [
        "Love Island's Tasha Ghouri has revealed she received an exciting last-minute invitation to King Charles' Coronation on Sunday.",
        "The 24-year-old model, who was the ITV show's first deaf contestant, took to her Instagram on Wednesday to share the exciting news.Snapping a picture of the highly-coveted invitation, fans could see that the star had been asked to a reception at Windsor Castle, as well as the Coronation Concert and a reception beforehand.The once-in-a-generation event is set to attract some of the biggest names from the worlds of politics, celebrity and high society.And despite his attempts to 'slim down' the occasion, the guest-list for the Coronation of King Charles III at Westminster Abbey on May 6 is believed to be around 2,000-people strong.",
        "Now, Tasha is set to be rubbing shoulders with the likes of Prince Harry, Katy Perry, Orlando Bloom, David and Victoria Beckham, Dame Joanna Lumley, The Repair Shop's Jay Blades, Amanda Holden, comedic legend Rowan Atkinson and Andrew Lloyd Webber, as well as a host of others.The model and dancer was born 'completely deaf' and was forced to 'overcome a lot of obstacles' growing up with a disability she now calls her 'superpower.'Her parents learned she was deaf when she was 12 months old and she had a cochlear implant, which is an electronic device, fitted aged five, as well as having years of speech therapy.Since exiting the Love Island villa, Tasha has been very outspoken about her disability and raised awareness of her condition.",
        "After receiving the invitation, she shared an emotional post to her social media.  Snapping a photo of her cochlear implant, she wrote alongside it: 'A post dedicated to you.'I've had this in my drafts for a long time and I had filmed another episode for my podcast today and a lot of emotions came out. I know on this page its more to do with my fashion, work etc. ive been more real on my @superpowerswithtasha page.'I don't often talk about the struggles that come with being deaf and wearing a cochlear implant. ",
        "'I deal with social anxiety massively, a lot of that came from the abelist comments i received and still do to this day, common thoughts that run through my head is 'what if i cant hear whoever is speaking to me' 'what if i completely misunderstand' 'what if my voice gets judged' 'what if someone comes over and takes out my implant' and so many more. 'It's something im still coping with and its a journey for sure! Most of the time i'd rather just stay in my lil flat and not face it. 'I also deal with concentration fatigue - i have to lip read, focus in on conversations, by the end of the day i suffer with migraines and headaches, i'll be completely worn out and drained to the point i can't even speak. Hence why i nap alot. napping helps me to recharge and get my energy back! ",
        "'I do have my down days - it's normal to have these days!'but at the same time im so grateful for my cochlear implant. its opened so many doors and opportunities for me. Just because I have a cochlear implant doesn't mean I'm fixed. I have my struggles behind closed doors and so does everyone.'i just wanted to share more of my reality AND everyone's reality that has a cochlear implant / deafness / hearing loss!!! for those that are going through the same thing - you're not alone! Representation is important.'my podcast is coming very soon, thank you all for being patient and I can't wait to share with you all, it really is empowering.'It comes after Tasha hit back at trolls who accused her of having a boob job on Monday.The Ann Summers model had posted some stunning selfies in a sexy blue bikini as she gave a glimpse behind the scenes at her most recent shoot with the brand. Sporting a shorter than usual hairstyle, blonde beauty Tasha captioned the post: 'I think summer is calling for a bob moment.' ",
        "One then commented under the Instagram post 'I so read that as a boob job' - to which Tasha replied: 'Well you're very wrong, all natural.'",
        "Someone else then said: 'I think someone has had a boob job.'In response, Tasha hit back: 'They're natural lmaooooo try to troll on nothing.' Another troll wrote: 'Looks like she's just like the rest of them after all. Those boobs don't look natural to me.'Tasha showed off her slim figure while donning the turquoise bikini with sequin emblazoned patches.As the piece was complete with a cross-over torso strap and silver metal ring detail, she added a matching sarong on top.Putting her model credentials to good use, the blonde beauty flashed a sultry look to the camera while posing poolside in a sunny destination.Her shoulder-length locks were left to fall freely in a tousled style as they were pulled into a deep side parting.Tasha added a pair of silver drop earrings to accessorise the look, alongside a nude lip and soft base over her freckled complexion. Posing for a slew of snaps, the star could also be seen taking a dip as she added a nude bucket hat to the look. While she joined a number of other models for the poolside shoot, as they all showed off the underwear brand's new summer swimwear collection.The dancer and model joined forces with Ann Summers last year and has fronted a number of their campaigns as an ambassador, including the brand's Valentine's Day collection earlier this year."
    ]
}