{
    "articleURL": "/wires/pa/article-12038681/Sudan-evacuees-arrive-UK-Government-arranged-flight.html",
    "content": [
        "Many British nationals arriving on evacuation flights from Sudan have had their lives “turned upside down” by the conflict in the African nation, a charity has said.",
        "More evacuees arrived at Birmingham Airport at 4.58pm on Tuesday, on what had been thought to be the last Government-arranged flight.The Government later said more flights would leave Port Sudan on Wednesday.Some 2,341 people have been evacuated by the Government from Sudan on 28 flights since fighting began three weeks ago. Many are returning home from a holiday after Ramadan or staying with family but there are also people whose lives have been turned upside down by the conflict and have nowhere to go  Madeline Farrar, British Red Cross  Madeline Farrar, emergency response operations manager at the British Red Cross who was at Birmingham Airport to greet evacuees on Tuesday evening, said: “The people we’ve been greeting in Birmingham are genuinely relieved and happy to be here.“Many are returning home from a holiday after Ramadan or staying with family but there are also people whose lives have been turned upside down by the conflict and have nowhere to go.“Our trained volunteers have been on the ground providing practical and emotional support for people’s immediate needs as soon as flights land, including checking if people need something to eat or drink or a friendly listening ear to talk about any worries they may have.“Our dedicated team are also helping with practical things like making phone calls and connecting people online, getting hold of advice, medication and offering short-term cash support.",
        "“We have been working in partnership with Birmingham City Council, RE:Act, Islamic relief and St John Ambulance as part of a multi-agency response, delivering crucial support to people in crisis.”The flight, organised by the RAF, was one of nearly 30 which have carried more than 2,000 people out of the war-torn country, according to the Foreign, Commonwealth and Development Office (FCDO), many of which have landed at London Stansted Airport.A spokesperson for Birmingham Airport said: “Birmingham Airport is supporting Sudanese evacuation flights arranged by the UK Government.“Together with local partner agencies, we will be offering support to passengers who need it.”The RAF has also helped more than 1,000 nationals from over 20 other countries, including the Republic of Ireland, Switzerland and Norway, with the UK’s evacuation effort being the longest and largest of any western nation, according to the FCDO.Earlier on Tuesday, Foreign Secretary James Cleverly told GB News that the conflict in Sudan was “not over yet” and there would still be a UK military and Government presence in the country to assist British nationals, with warship HMS Lancaster off the coast.",
        "He said: “There is still an ongoing humanitarian situation, we still have a presence at Port Sudan, both a military presence and a number of other Government officials, to help British nationals and their dependants leave the country.",
        "“We will ensure that we maintain a presence to support British nationals, because the situation in Sudan, sadly, is still volatile, and it is still dangerous.”"
    ]
}