{
    "articleURL": "/news/article-12061345/Dr-Charlie-Teo-launches-foul-mouthed-rant-against-hearing-foundation-ball.html",
    "content": [
        "Dr Charlie Teo slammed disciplinary hearing at ballHe told rich guests the tribunal was 'f***ing bulls***' His Rebel Ball raised $1million for his foundationOne guest paid $160,000 for two days with Gina Rinehart Brain surgeon Dr Charlie Teo has unleashed on the disciplinary board probing the alleged botched operations that could end his career.",
        "In a speech to guests at his Rebel Ball on Saturday night - which raised $1million for the Charlie Teo Foundation - he slammed the Health Care Complaints Commission.To the cheers and applause of supporters he told them: 'You here tonight have stuck with me and I can't thank you enough for your loyalty.'Everyone's been asking me about the tribunal. I may as well give you the inside story. The tribunal was absolute f***ing bulls***.'The HCCC launched an inquiry into two cases where Dr Teo performed brain surgery on two women who never recovered and died soon after.Dr Teo denies he was negligent but has admitted he was responsible for the tragic outcomes: 'I think in fact I’ve been too aggressive,' he told the hearing in March.",
        "He insisted previous work restrictions put on him by an earlier hearing had potentially cost more lives as they stopped him operating in Australia.'I haven’t been able to save lives that I know I can save,' he insisted outside the hearing in Sydney in March.At Saturday night's ball in Sydney's Crown Casino in Barangaroo, the focus was on raising funds for his charity to research brain cancer.NRL legend Benny Elias helped one un-named guest snap up the star lot at the auction, paying $160,000 for two days with mining magnate Gina Rinehart at the Ayana Estate in Bali.",
        "It was was billed 'An exclusive experience with Gina Rinehart' and will see the winner and a guest whisked away on a private chartered flight to her luxury Bali hideaway in November for a gala dinner with industry giants.The following day, another private flight will then whisk them to Port Hedland in Western Australia for another gala dinner under the stars at the Roy Hill rail site at her mining facility, before another private flight back to Perth.The foundation hailed the deep pockets of the rich guests at the Rebel Ball in a post on Facebook on Monday, celebrating the $1million raised.Supporters at the event included Australian cricket captain Steve Waugh, former Olympic beach volleyball star Kerri Potthurst and Labor powerbroker Graham Richardson.Spin bowler and brain cancer victim Gavin Robertson was also among the guests, as well as brain tumour survivor Beatrice McBride who performed with her dad Slide McBride, including a song she wrote for Dr Teo.Also on stage was Australian rock music legend, Mondo Rock’s Paul Christie who joined The Hindley Street Country Club Band.Previous balls have featured guests including Nine celebrities Karl Stefanovic, Richard Wilkins and Peter Overton. 'Beautiful and heartbreaking stories were shared by Sue-Ellan Vasiliou co-founder of Little Legs Foundation, and our special guest speaker Professor Matt Dun,' said the foundation. ",
        "'The legacy of two little girls lost too soon, Alegra and Josie, means children with DIPG/DMG are now getting a fighting chance. 'Having personally known the hopelessness of hearing that his child’s brain cancer is ‘untreatable’, Matt through his brain cancer research is changing the ‘go home and make memories’ message that DIPG/DMG families currently face.'",
        "'We transformed the future raising over $1 million on the night for game-changing brain cancer research,' said the post.'This is after-event costs, so every dollar goes to the cause. We are blown away by your generosity and spirit!  'Our auctioneer - Australia’s eminent traffic reporter Vic Lorusso - led the charge, with an exclusive international experience generously donated by Gina Rinehart AO reaching a phenomenal $160,000!'A big shout out to NRL Tigers Legend Benny Elias jumping up on the floor to drive the live auction, together with Elliott Shoebridge.'It added: 'Thank you to all guests and contributors for joining the revolution to REBEL against brain cancer! 'We truly value your generosity, kind-heartedness and devotion to this important cause.'Daily Mail Australia has contacted the Health Care Complaints Commission for comment.",
        "Charlie Teo donates $10,000 to attend charity dinner hosted by Mick Gatto - after claiming he'd been forced to drive for Uber to pay his mortgageDivisive neurosurgeon Dr Charlie Teo attended gala dinner He earlier complained of having to drive Ubers to pay billsBy BRETT LACKEY for DAILY MAIL AUSTRALIA Embattled neurosurgeon Dr Charlie Teo has attended a gala charity fundraising dinner organised by colourful Melbourne identity Mick Gatto.",
        "Dr Teo, 62, whose disciplinary hearing with the Health Care Complaints Commission (HCCC) wound up last week, reportedly donated $10,000 to Gatto's Equal Access for Autism charity.Just hours before the dinner on Saturday night, in an interview published in the Daily Telegraph, Dr Teo said he was 'not crying poor' but had been forced to drive for Uber last year to pay his mortgage and legal bills.Temporary restrictions placed on Dr Teo for the last two years while the HCCC investigated his case effectively banned him from working as a surgeon in Australia.He said he had been working outside the country but that 'the majority of work spent overseas is voluntary and often I have to absorb the travelling costs myself'.",
        "Dr Teo, who did not have a single letter of support given to the HCCC by an Australian based colleague during his hearing, was treated like a hero at the gala dinner, according to The Sydney Morning Herald. Joining him among the eclectic cast of attendees at Melbourne's Hyatt were actor Vince Colosimo and former bikie boss Toby Mitchell chowing down on a menu designed by fallen Masterchef judge George Calombaris. At one point singer Kate Cebrano belted out a number and, at another, host Richard Wilkins auctioned off a lunch with controversial AFL figures Ben Cousins and Sam Newman.",
        "Dr Teo and Gatto have known each other for at least a decade, with Dr Teo performing surgery and saving the life of the mother of one of Gatto's friends.Gatto once raised more than $600,000 for cancer research at a previous charity dinner with the help of Dr Teo.The neurosurgeon will have to wait for the decision of the HCCC to see whether he can operate in Australia again. The commission is investigating whether he performed operations on two patients left with brain damage without properly informing them of the risks.But Dr Teo said the damage to his reputation had largely been done.'It is a broken system... The process absolutely needs root and branch reform and it needs it urgently,' he said.He said his colleagues didn't speak up for him because they too were worried about being 'blackballed' by the medical fraternity. 'They knew better than to speak out publicly for their own professional survival... That's why they wouldn't do it and that makes me very sad,' he told the Daily Telegraph."
    ]
}