{
    "articleURL": "/tvshowbiz/article-12040699/Gigi-Hadid-shares-stylish-BTS-snaps-glamorous-Met-Gala-gown.html",
    "content": [
        "Gigi Hadid took to Instagram on Tuesday to share some behind the scenes images of the incredible gown she wore to the Met Gala the night prior.",
        "The model, 28, stunned in a revealing look built around a striking black bustier from Givenchy Haute Couture that emphasized her incredible physique.The runway sensation also shared a closer look at her glamorous makeup from the night, as well as the multi-layer pearl necklace she wore to the event.  'Before the ball ..✨' Gigi captioned the snap, where she also thanked her team and shared her 'love &amp; gratitude.'It comes after she was spotted attending the same Met Gala after party as her rumored fling Leonardo DiCaprio, 48, after reports that the duo are 'still spending time together.'",
        "Another snap saw an assistant fussing over Gigi's dress as she stood against a pale pink background. Gigi also posted a photo that saw her doing her makeup, which featured bold silver eyeshadow and winged liner. The blonde bombshell then shared another post, with an artsy collage showing off her eyelashes and lips.Keeping up with the theme she shared another artistic black and white photo showing off her smooth visage.The star also posted a clip of herself getting ready, going from riding in a car with no makeup, to full on glam at the end. The night prior she thrilled while posing for the shutterbugs at the event is the sultry all-black ensemble. ",
        "Gigi's bustier was enlivened with zipper-like rows of silver sequins running down its front.She paired the sheer look with a matching set of translucent black panties.",
        "Instead of a traditional dress, she wore a long tulle skirt that rested on her hips and featured a long train.The catwalk star wore matching pantyhose over her trim legs, and she elevated her 5ft10in stature with a set of pointy black heels with gold embellishments over the toes.Gigi paid tribute to Karl Lagerfeld - the night's theme - by wearing a short set of sheer gloves. The late fashion designer was famous for often wearing sets of fingerless gloves when out in public.Gigi's appeared to have long black strings that tied them tight around her wrists.She completed her outfit with a sheer black shawl that was draped over one shoulder and wrapped around her torso diagonally.The blond beauty wore her long locks tied back and fanned out across her back in thick waves.She added some glamour to the chic ensemble with a pearl necklace and bracelet, along with a diamond necklace dangling from her throat.Gigi completed her look with some delicate cat-eye makeup.",
        "She met up with several of her model pals at the event, including Kendall Jenner and Cara Delevingne.",
        "However, Gigi's sister Bella Hadid was notably absent from the ceremony, which she has attended several times in the past.And after the bash was over, she was spotted making her way into an after party at Zero Bond in New York, which was also attended by the Titanic actor.She couldn't hide her delight as she flashed a beaming smile while making her way into the same event as her rumored love interest.Gigi concealed her after party look underneath a black leather trench coat, after wowing on the red carpet in an incredible black sheer outfit earlier in the evening as she attended the annual fashion extravaganza.Leonardo made a low-key arrival at the star-studded bash sporting a black face mask and a basketball cap with his suit jacket and dark-wash jeans.It comes following the most recent reports that the rumoured love interests are 'still hanging out together' as they 'enjoy each other's company'.",
        "Sources said Gigi and Leo are still on friendly terms and meet up when 'their busy schedules permit.''Gigi and Leo still hang out and talk when it works with their timing,' the insider said.'They both enjoy each other's company and have fun together when their busy schedules permit. Yolanda and Bella know Gigi is capable of making her own healthy decisions and they’re supportive of her, Gigi’s main priority is her baby girl.'",
        "The source added to Entertainment Tonight: 'Her daughter is always top of mind and at the forefront of everything in her life.'Gigi and Leo's reported romance was previously said to have 'fizzled out'. The model split from Zayn Malik in 2021 after six years. The former pari share a two-year-old daughter named Khai."
    ]
}