{
    "articleURL": "/news/article-12051197/Entitled-teenager-jailed-15-years-stabbing-death-millionaire-grandmother.html",
    "content": [
        "Pietro Addis, 20, avoided a murder conviction but was jailed for manslaughter  Read more: Addict is found not guilty of murdering his millionaire grandmother An entitled cannabis-addicted teenager who abused his ADHD medication has been jailed for 15 years after stabbing his millionaire grandmother to death in a drug-fuelled rampage. ",
        "Pietro Addis, 20, admitted manslaughter by diminished responsibility before a court cleared him of murdering Sue Addis, 69, using kitchen knives to inflict 17 wounds.Millionaire Mrs Addis was a highly successful restaurateur and philanthropist who served celebrities including Tony Blair, Bill Nighy and Katie Price, and was described in court as the heart and soul of Brighton.   A jury accepted Addis experienced a transient paranoid psychosis when he stabbed his grandmother and he has now been sentenced to ten years with an extended term of five years.Addis, then 17, attacked his grandmother with enough force to slice through one of her ribs on January 7, 2021, the court heard, and the judge said she would still be alive if it was not for his drug use. ",
        "Addis was in Covid lockdown when his desperate family tried to get help for his deteriorating mental state, moving him in with his grandmother after a family row about his drug use. His grandmother, Sue Addis, owned popular Brighton restaurants Donatello and Pinocchio, and was well known in the local community for her extensive charitable work.  At Lewes Crown Court, Judge Christine Laing KC told Addis his horrific crime demonstrated the dangers of taking illegal drugs and his inability to avoid harmful behaviour.",
        "Addis was also selling clothes and possessions to buy cannabis.'Use and misuse of drugs was the single biggest factor in the development of the mental state that led to you killing your grandma,' Judge Laing said.His desperation for drugs was demonstrated by taking his grandmother's breast cancer medication.'The negative effects of the ADHD drugs were becoming ever more obvious,' the judge said.Addis experienced a transient psychotic delusion which made him believe his grandmother meant him serious harm, a jury found.The judge said she was satisfied the principle cause was Addis's use of cannabis and abusing Elvanse - his amphetamine-based ADHD medication.",
        "Addis would have been angry at the family trying to stop him getting Elvanse and restricting his use of cannabis, the judge said.She added: 'No family or friends have suggested any difficulties out of the norm.'You chose to smoke a lot of cannabis and deliberately over-use your amphetamine-based ADHD medication.'It was a choice made by you.'It is highly unlikely your grandma would have lost her life had you not done so.'The final moments of Sue Addis's life would have been filled with unimaginable terror and trauma at the hands of her beloved grandson, the judge said.Addis inflicted significant mental and physical suffering in a sustained attack, the judge said.",
        "Tests on his blood and hair showed Addis had taken cannabis, cocaine, ketamine, Xanax and his grandmother's cancer medication in the months before the killing.The court heard he continued to abuse drugs after he was taken into custody.He tested positive for cocaine taken while he was on remand in a secure hospital.He then tried to claim the white powder was flour, the court heard.'The horrific thing you had done should have made you run a mile from any offer of illegal drugs,' the judge said.",
        "Judge Laing said while she accepted Addis was extremely remorseful, he would still present a danger to the public on release.She said he had still not spoken about what happened and had discussed emigrating when he is released, which she described as an attempt to get away from what he had done.She added: 'You have not yet fully appreciated the seriousness of what happened and just how much work is needed.'At this point, I cannot be satisfied you will remain drug-free on your release. You will still be a relatively young man, keen to catch up on lost time.'Sentencing is the only time in a trial to note the tragedy of what you did.'Speaking of Mrs Addis, Judge Laing said: 'She leaves behind loving and understanding children and grandchildren who are prepared forgive you and support you.",
        "'It is impossible to forget the evidence I heard about how much she loved you and how much she did for you.'I accept you loved her very much, but nonetheless you killed her in the most horrific manner imaginable.'In a statement released to the defence, the Addis family said: 'We don't want him to lose most of his life.'The biggest punishment is knowing what he's done. We want him to have a go at life, and Mum would, too.'Addis tried to claim he was hearing voices and experiencing paranoid delusions when he stabbed Mrs Addis 17 times.He then called the police. Officers found his grandmother in a bath full of bloodstained water after he told a 999 operator: 'There's been a murder.'Defence expert Dr Peter Misch said he believed Addis experienced a transient paranoid psychosis at the time of the killing.His first mental health assessment the day after the killing found no evidence of thought disorder, paranoia or delusional thinking.But an expert adolescent psychiatrist described Addis as an unreliable malingerer and said he had been calm and collected when he phoned the police.'In my view, he was an angry young person who felt entitled to take his ADHD medicine,' Dr Duncan Harding said.",
        "Dr Harding told the jury that Addis did not show any signs of psychosis in footage from body-worn police cameras during his arrest.Addis had taken a cocktail of drugs in the months leading up to the killing, including abusing his prescribed ADHD medication.Later evaluation in a secure hospital found no evidence of ADHD or any drug-induced psychosis.Clinical nurse specialist Michelle Hall noted: 'No observed or reported perceptual abnormalities.'Cognition appears intact although not formally tested. Pietro was oriented to time, place and person.'Dr Harding said his drug use 'speaks to the anger, not the psychosis'.The expert, who assessed Addis before he was discharged from hospital back into prison to await trial, described the teen as an unreliable malingerer.Addis was told to move in with his grandmother just after Christmas 2020 as arguments with his dad and step-mother over his ADHD medication escalated.Addis told Dr Harding the ADHD medicine made him feel less paranoid and anxious.The court heard he craved Elvanse - a stimulant prescribed for ADHD.Dr Harding said the drug would not have any effect on psychotic delusions and this showed he was not experiencing a mental illness.He added: 'He had been abusing drugs for many months prior to the killing, including ADHD medicine.",
        "'This was causing great concern to family who refused his access.'",
        "The expert said he saw no evidence of ADHD, psychosis, delusions or obsessions when he interviewed him at a secure hospital.Addis was glib and unconvincing when he described fears about his grandmother, Dr Harding said.'Describing thinking his grandmother wanted to kill him didn't sound authentic to me,' he told a jury.Addis was not given any anti-psychotic drugs to treat his mental health during his time in hospital and was not prescribed any when he was returned to prison, the court heard.Staff at the hospital did not think Addis suffered from ADHD.Dr Harding interviewed him in June, six months after the killing, before he was discharged from secure hospital back into prison.'At that point, I really felt he was malingering, saying something which he knew is not true in interview.'A person who knows he is dishonest.'The expert said he thought the accounts offered by Addis were unreliable.'He did not act in a way consistent with this reported fear his grandmother was going to kill him. He did not report it to anyone else or take steps to protect himself.'He could have left the house at any time or he could have called the police. At the time he was not suffering from an abnormality of mental functioning.'The doctor described a melting pot of risk factors leading up to the killing, adding: 'Seeking drugs the family were withholding, escalating arguments within the family, his grandmother being the matriarch and her searching that night for possible hospital admission for Pietro.'Killing his grandmother in the bath showed a degree of planning, Dr Harding said.'He would have had to take the knives to the bathroom. This provides evidence for a significant degree of planning. Not a frenzied psychotic killing as suggested by the defence.'Addis dialled 999 after changing his clothes and gave details to police.'In my view, it is extremely unlikely he would have had the presence of mind to call police,' Dr Harding said.'Had it been a psychotic breakdown, how would he have known it was a murder and how would he have known his grandmother was dead?'The Addis family were concerned about his drug taking and had withdrawn his prescribed ADHD medication.Sue Addis had searched online to find residential psychiatric help for her grandson.Experts agreed Addis was not experiencing drug-induced psychosis at the time of the killing.Mrs Addis was stabbed 17 times and had no typical defensive wounds, Home Office pathologist Dr Charlotte Randall told a jury.One of the stab wounds to the chest had cut completely through the full thickness of the left seventh rib, Dr Randall said.'A severe degree of force has been used to inflict that wound,' the pathologist said.Four of the 17 wounds would have been fatal on their own, she said.Police found a knife under Mrs Addis, another larger knife next to the bath and a third knife in a jacket belonging to Addis. He will spend two thirds of the custodial sentence in prison before he is eligible for parole when he will be on licence for the remainder of the custodial sentence plus five years."
    ]
}