{
    "articleURL": "/wires/ap/article-12053331/AP-News-Brief-12-04-m-EDT.html",
    "content": [
        "Mage wins star-crossed Kentucky Derby amid 7th death",
        "LOUISVILLE, Ky. (AP) - After seven deaths raised questions about the future of horse racing, Mage earned a surprising Kentucky Derby victory on Saturday, capping a nerve-rattling day that included two more fatalities ahead of the 149th edition of the world´s most famous race.Mage, a 15-1 shot, had only one win in his career, giving little indication that he could triumph against 17 rivals in a race that is not kind to the inexperienced.Still, he made a gutsy stretch run, overtaking Two Phil's to his inside and winning by a length. Mage, who didn't race as a 2-year-old, ran 1 1/4 miles in 2:01.57.Mage joined Justify (2018), Big Brown (2008) and Regret (2015) as Derby winners with just three previous starts.\"He proved today that it didn't matter,\" assistant trainer and co-owner Gustavo Delgado Jr. said.___Multiple people shot at Dallas-area outlet mall; gunman deadALLEN, Texas (AP) - A gunman shot multiple people at an outlet mall in the Dallas suburb of Allen, Texas, on Saturday, killing an unknown number and sending hundreds of shoppers fleeing in panic in the latest gun violence to strike the country, officials said.Calls reporting gunshots came in about 3:40 p.m. from the Allen Premium Outlets.Witnesses told The Associated Press they saw multiple victims, including some who appeared to be children, and that they saw a police officer and a mall security guard who appeared to be unconcious on the ground.",
        "Allen police said in a Facebook post that nine victims had been taken to hospitals. Medical City Healthcare, a Dallas-area hospital system, said in a written statement it was treating eight between the ages of 5 and 61. Their conditions were unknown.An Allen Police officer was in the area on an unrelated call when the officer heard gunshots at Allen Premium Outlets at 3:36 p.m, the police department wrote on Facebook.___King Charles III crowned with regal pomp, cheers and shrugsLONDON (AP) - King Charles III was crowned Saturday at Westminster Abbey, in a ceremony steeped in ancient ritual and brimming with bling at a time when the monarchy is striving to remain relevant in a fractured modern Britain.At a coronation with displays of royal power straight out of the Middle Ages, Charles was given an orb, a sword and scepter and had the solid gold, bejeweled St. Edward´s Crown placed atop his head as he sat upon a 700-year-old oak chair.In front of world leaders, foreign royals, dignitaries and a smattering of stars, the monarch declared, \"I come not to be served but to serve,\" and was presented as Britain´s \"undoubted king.\"Inside the medieval abbey, trumpets sounded, and the congregation of more than 2,000 shouted \"God save the king!\" Outside, thousands of troops, hundreds of thousands of spectators and scores of protesters converged.",
        "It was the culmination of a seven-decade journey for the king from heir to monarch.___Prince Harry an odd man out at father's coronation spectacleLONDON (AP) - In the fairy-tale ending to the ancient pageantry in which King Charles Ill was crowned monarch, he stepped into a gilded horse-drawn carriage with his queen and rode off to his palace.Following closely behind was Prince William, his eldest son and heir, along with his family, including 9-year-old Prince George who is second in line to the throne.The king's youngest son was nowhere to be seen. On his father's biggest day, Prince Harry arrived at Westminster Abbey alone and he left alone. The disgruntled Duke of Sussex was assigned to sit two rows behind his brother.His isolation was likely the result of him quitting his royal duties and, thus, no longer ranking as a senior family member - as well as alienating himself from his father and brother by airing grievances and telling palace secrets in his explosive best-selling memoir, \"Spare.\"If anyone was hoping the coronation would help break the ice between Harry and his brother, who were once so close, they are sure to have been disappointed. The siblings were not seen speaking or even acknowledging each other during the ceremony.",
        "___California reparations panel OKs state apology, paymentsOAKLAND, Calif. (AP) - California's reparations task force voted Saturday to approve recommendations on how the state may compensate and apologize to Black residents for generations of harm caused by discriminatory policies.The nine-member committee, which first convened nearly two years ago, gave final approval at a meeting in Oakland to a hefty list of proposals that now go to state lawmakers to consider for reparations legislation.U.S. Rep. Barbara Lee, D-Oakland, who is cosponsoring a bill in Congress to study restitution proposals for African Americans, at the meeting called on states and the federal government to pass reparations legislation.\"Reparations are not only morally justifiable, but they have the potential to address longstanding racial disparities and inequalities,\" Lee said.The panel´s first vote approved a detailed account of historical discrimination against Black Californians in areas such as voting, housing, education, disproportionate policing and incarceration and others.___Ukraine downs Russian hypersonic missile with US PatriotKYIV, Ukraine (AP) - Ukraine's air force claimed Saturday to have downed a Russian hypersonic missile over Kyiv using newly acquired American Patriot defense systems, the first known time the country has been able to intercept one of Moscow's most modern missiles.Air Force commander Mykola Oleshchuk said in a Telegram post that the Kinzhal-type ballistic missile had been intercepted in an overnight attack on the Ukrainian capital earlier in the week. It was also the first time Ukraine is known to have used the Patriot defense systems.",
        "\"Yes, we shot down the `unique´ Kinzhal,\" Oleshchuk wrote. \"It happened during the night-time attack on May 4 in the skies of the Kyiv region.\"Oleshchuk said the Kh-47 missile was launched by a MiG-31K aircraft from Russian territory and was shot down with a Patriot missile.The Kinzhal is one of the latest and most advanced Russian weapons. The Russian military says the air-launched ballistic missile has a range of up to 2,000 kilometers (about 1,250 miles) and flies at 10 times the speed of sound, making it hard to intercept.___Newton Minow, ex-FCC chief who dubbed TV 'wasteland,' diesCHICAGO (AP) - Newton N. Minow, who as Federal Communications Commission chief in the early 1960s famously proclaimed that network television was a \"vast wasteland,\" died Saturday. He was 97.Minow, who received a Presidential Medal of Freedom in 2016, died Saturday at home, surrounded by loved ones, said his daughter, Nell Minow.\"He wanted to be at home,\" she told The Associated Press. \"He had a good life.\"Though Minow remained in the FCC post just two years, he left a permanent stamp on the broadcasting industry through government steps to foster satellite communications, the passage of a law mandating UHF reception on TV sets and his outspoken advocacy for quality in television.",
        "\"My faith is in the belief that this country needs and can support many voices of television - and that the more voices we hear, the better, the richer, the freer we shall be,\" Minow once said. \"After all, the airways belong to the people.\"___NY jury will have wide latitude to decide civil Trump claimsNEW YORK (AP) - The jury hearing an advice columnist´s claims that she was raped by Donald Trump could begin deliberations as soon as Tuesday, and it will have wide latitude in deciding the truthfulness of the allegations against the former president.The writer E. Jean Carroll, 79, testified that Trump raped her in 1996 inside a dressing room at the luxury Bergdorf Goodman store in Manhattan after they had a chance encounter and shopped together for lingerie.Trump, 76, has said he never raped Carroll and was never with her at the department store. He has been absent from the trial, though jurors saw portions of his videotaped deposition. He has accused Carroll of making up allegations to fuel sales of her 2019 memoir.The jury's decision in the trial - which involves a civil case and not a criminal one - may come down to who they believe more. Here's more on how the jury will reach its verdict:______Texas panel says lawmaker should be expelled for misconductAUSTIN, Texas (AP) - A Texas legislative committee recommended Saturday that GOP Rep. Bryan Slaton be expelled for inappropriate sexual conduct with a 19-year-old intern. Slaton, from Royse City, could face an expulsion vote by the full House as early as Tuesday.Slaton, 45, has declined to comment on the allegations, and did not immediately respond to a phone message left by The Associated Press Saturday afternoon, but his attorney last month called the claims \"outrageous\" and \"false.\" The House General Investigative Committee's recommendation was first reported by The Texas Tribune.In the written investigation report, the committee said Slaton gave the 19-year-old intern and another young staffer alcohol at his home, that he had sex with the intern after she was intoxicated, and that he later showed the intern a threatening email but said everything would be fine if the incident was kept quiet. Slaton also asked a fellow lawmaker to keep his behavior secret, the committee said.\"Slaton's misconduct is grave and serious,\" the committee members wrote in a report, and that he furnished alcohol to a minor, violated employment laws, abused his position of power and engaged in harassment.\"The fact that Slaton has not expressed regret or remorse for his conduct is also egregious and unwarranted,\" the committee wrote. \"It is the Committee´s unanimous recommendation that, considering the factors stated above, the only appropriate discipline in this matter is expulsion.\"___Navy commissions USS Cooperstown; honors war veteran playersNEW YORK (AP) - The U.S. Navy on Saturday commissioned the USS Cooperstown in honor of 70 Major League Baseball Hall of Fame players who served in the military during wartime.The littoral combat ship is named after the village in New York state where the Hall is located.Hall of Famers Joe Torre and Johnny Bench took part in the ceremony, with Torre delivering remarks and Bench presenting a long glass, a nautical telescope.\"It is critical that we honor the legacy of these Hall of Famers,\" Torre said, \"not just for what they did on the field, but for what they sacrificed and what they accomplished off the field. Their legacy lives on with the USS Cooperstown and with the sailors here today and in the years to come.\"The 70 players honored served during conflicts from the Civil War through the Korean War and include some of the sport's biggest names, such as Ty Cobb (Army, WWI); Joe DiMaggio and Jackie Robinson (Army, WWII); Ted Williams (Marines, WWII and Korea); and Willie Mays (Army, Korea)."
    ]
}