{
    "articleURL": "/sport/nrl/article-12041503/Phil-Gould-lashes-Knights-players-escaping-Bali-thrashing-against-Eels.html",
    "content": [
        "Phil Gould has blasted Knights players for taking a holiday on the bye round Wide World of Sports says NRL stars have travelled to Bali this week Gould says he would not have sanctioned the move if he was the coach Phil Gould has launched a brutal spray at Newcastle's players, with the footy boss far from impressed with their trip to Bali during the bye round. ",
        "Wide World Of Sports has revealed that a group of Knights players enjoyed an overseas trip while the rest of the NRL descends on Brisbane for Magic Round, despite suffering a thumping 43-12 defeat to Parra last week.Newcastle have struggled on the field this season and sit in 14th on the ladder - wining just three of their nine games thus far.And Gould - who overseas the football department at Canterbury Bulldogs - revealed his shock to learn that Knights players opted to go to Bali rather than work on the training ground to turn their campaign around. 'It wouldn't happen in my day,' Gould said on Six Tackles with Gus.",
        "'I'd always use the bye round... for me that was always a time to go back and refresh, to look at some things that maybe we're not doing as well as we would have liked, or maybe there's some things we can add to our game, or maybe we need a refresher course.'For me the benefit of the bye was not getting busted on the weekend, was not going out. It gave you two weeks to get ready for your next game instead of one week.'It just wouldn't have happened in my day. For me, it was two weeks to get ready for your next game, and you shouldn't lose if you had the two weeks to get ready.'",
        "The Knights have suffered an alarming decline since the start of 2022. In O'Brien's first two seasons, they registered back-to-back seventh place finishes, but last year only finished 14th with just six wins all season. Even though they are on track to better that record this time around, Gould insists he would not have sanctioned the holiday.  'I couldn't do it as a coach, I couldn't do it as a player,' he added. 'It might turn out to be the best thing, getting over there with some warm weather and sun on their backs. It might be the answer, I don't know. And if they come back (and win) they will say it is the answer.",
        "'But there's three byes this year, you do it three times I guarantee it's not going to help you.'Maybe (O'Brien) thought after what he said after the (Eels loss), maybe they're a bit busted.'It's a time to replenish, to treat your injuries, to get ready for the following week, and it's a refresher course.'I remember when I was a player and we had byes, (coach) Warren Ryan used to flog us. It put steel in your team, it put steel in your attitude.'You are paid to train and play, that's what you are paid to do. Find something else to do, find another job if you don't want this job. '"
    ]
}