{
    "articleURL": "/wires/reuters/article-12055563/Stephen-Ames-holds-3-shot-lead-Mitsubishi-Electric.html",
    "content": [
        "Stephen Ames followed up a first-round 65 with an even more impressive 8-under-par 64 on Saturday to grab a three-shot lead at the Mitsubishi Electric Classic in Duluth, Ga.",
        "The 59-year-old from Canada finished his day with a sizzle, recording three birdies over four holes before polishing off his card with an eagle on 18. That completed a 31 on the back nine, which included plenty of fast greens.\"Yesterday I actually hit a good drive (on 18),\" Ames said. \"It was probably about maybe 20 feet left of where I should have hit it, hit the hill and didn't quite get all the way down, but it's just amazing if you get all the way down there.\"And today I hit it on the proper line, which is a little further right. I actually stood up there and I'm like, wait, 141 front? It was unusual because, yeah, you never hit 9-irons into a par-5. And I hit a great second shot there to get it. I was a little in between yardages and I had to stand on the 9-iron to get it because it was actually 148 yards, but it worked out perfectly.\"Ames, who is 15 under for the tournament, is seeking his second win of the season on Sunday after previously pocketing a victory in February at the Trophy Hassan II in Morocco.\"I don't mind (playing with a lead), it is what it is,\" Ames said. \"At the end of the day, it's still you that you're battling, you and your thoughts and your feelings and your emotions. That's basically at the end of the day what I have to control, and right now I've been doing a very good job of it, and I'm going to continue doing the same thing tomorrow.\"",
        "Three golfers are within five strokes of the lead. At the top of that group sits Ken Tanigawa at 12 under. His round, a 6-under 66, included a bogey on No. 2 and a double-bogey on No. 7. Those were more than counterbalanced by seven birdies and an Ames-matching eagle on 18.\"Well, it makes dinner taste great, right, to finish with an eagle,\" Tanigawa said. \"Yeah, momentum. But it's great, but tomorrow's a new day. Golf, as you know, who knows what it brings ... Yeah, just go play hard tomorrow, whatever, see what happens.\"Sitting in third is Spain's Miguel Angel Jimenez at 11 under for the tournament. He dropped an eagle on 13 as part of his round of 66.Y.E. Yang of South Korea notched a 68 on Saturday to end up five behind Ames in fourth. His day featured seven birdies.David Toms fell into a tie for fifth place after sharing the lead on Day 1. His 2-under 70 was mostly steady, with a pair of bogeys offset by four birdies.Brett Quigley, after a 65, is now tied with Toms.The rest of the Top 10 includes South Africa's Ernie Els and Germany's Bernhard Langer tied for seventh at 8 under, followed by Steve Stricker, Timothy O'Neal, Lee Janzen and Australia's Rod Pampling T9 at 7 under.",
        "--Field Level Media"
    ]
}