{
    "articleURL": "/news/article-12060931/Will-dreaded-weekend-rail-repairs-shunted-off.html",
    "content": [
        "Weekends are now the busiest time to travel due to the rise of homeworking If successful midweek works could be rolled out to other major routes too  Passengers could soon be spared the disruption of weekend engineering works as rail bosses try carrying out projects midweek instead.",
        "Changes to travel patterns after the Covid pandemic mean weekends are now the busiest time to take a train as many people work from home rather than commute Monday to Friday.This has prompted Network Rail to carry out improvements on the East Coast Main Line – one of Britain's busiest routes – next week on Tuesday and Wednesday.If successful, it is believed other lines will follow suit, spelling the beginning of the end for the loathed weekend rail replacement bus services for stations affected by engineering works.A rail industry source said: 'Other long-distance routes are also looking closely at the numbers and keeping a close eye on how this goes.'",
        "The number of weekend rail journeys rose by more than a fifth in February compared with pre-pandemic levels, reveals research by the Government-backed Great British Railways Transition Team.Fridays and Sundays are also the most popular days for travel on the East Coast Main Line between London and Scotland, according to recent data.The trial midweek works will be on the line from Grantham to Doncaster. Services will still run but diversions and longer journey times will be in place with travellers advised to check before setting out.Paul Rutter, route director for Network Rail's East Coast route, said: 'We're really pleased to be carrying out this trial.",
        "'Carrying out the work midweek will mean fewer travellers are impacted.'Anthony Smith, chief executive of passenger group Transport Focus, said: 'The railway must do all it can to minimise the impact, whenever works are planned.'Passengers want clear, timely information and to stay on the train wherever possible. Changing trends mean that doing works during the week could be less disruptive. We will be keeping a close eye on the passenger experience.'A spokesman for train operators on the East Coast line said the trial was 'an example of one way the industry has worked to do something to respond to trends and keep people moving'."
    ]
}