{
    "articleURL": "/tvshowbiz/article-12051509/Victoria-Beckham-holds-peace-sign-Tana-Ramsay-celebrating-close-pals-birthday.html",
    "content": [
        "Victoria Beckham was all smiles as she celebrated a close pal's birthday on Thursday evening with Tana Ramsay. ",
        "The fashion mogul, 49, took to Instagram as she hugged the birthday girl while posing for a fun group snap which looked like a new version of The Spice Girls - in front of a lit lavish cake. She looked effortlessly chic in a black long sleeved number and left her long brunette tresses loose as they cascaded down from a centre parting. Victoria held up a peace sign in the second snap and wrote: 'Love you girls soooo much!!'Meanwhile the wife of Gordon Ramsay, 48, flashed her gorgeous smile as she stood behind Victoria in a pair of black trousers and a sheer short sleeved top. ",
        "It comes after Victoria claimed her husband David has never seen her without her eyebrows drawn on as she showed off her 'bare' look for the first time.The fashion designer took to Instagram last week to share a video make-up tutorial showing her 30.8million followers how she fills in her eyebrows.She kicked the clip off by claiming that nobody has seen her natural eyebrows - not even her footballer husband David, 47, who she has been married to for 24 years.Victoria went on to insist that she had no products in her eyebrows in the video, claiming it is the first time anyone has seen her bare brows.",
        "'This is the first time I have ever let anyone see me without my brows on. Even my own husband never sees me without my brows on,' she confessed.Victoria went on to admit she is 'self-conscious' about her eyebrows, saying she feels the hairs are sparse after years of over-plucking.Back in the 90s, Victoria heavily plucked her eyebrows to make them thinner in line with the fashion trend, but she is now rumoured to get microblading done.She said: 'It's just my thing, it's something I'm almost quite self-conscious about. Over-plucking has left me with quite gappy brows if you can see, a few missing either side.",
        "'Like I said, too much plucking has really left me quite self-conscious about my brows to be completely honest.''I want you to see how gappy my brows really are, I have so many missing hairs. I have nothing on these brows at the moment, but you can see how much I have to fill them in and level them out.'Victoria went on to show her eager fans how she applies her eyebrows as she gave an insight into her beauty regime.The Spice Girl cut a casual figure in a dressing gown as she sat at her dressing table for the make-up tutorial.",
        "She appeared to have mascara and eyeliner on as she started getting glammed-up in the tutorial while promoting products from Victoria Beckham Beauty.In an accompanying caption, she wrote: 'What I like to do with my new @VictoriaBeckhamBeauty BabyBlade is use the ultra-fine pencil to create straight strokes so it gives the appearance of individual hairs.'Discover all six shades of BabyBlade Microfine Brow Pencil now at VictoriaBeckhamBeauty.com. Kisses xx VB.'Victoria frequently shares an insight into her beauty regime and often shares make-up tutorials to her social media pages."
    ]
}