{
    "articleURL": "/femail/article-12040779/What-calling-Coronation.html",
    "content": [
        "King Charles's coronation in London takes place soon - what are you calling it?READ MORE: For all the latest Royal news, pictures and video click hereWhen the Platinum Jubilee festivities were in full spring last year, the public affectionately took to calling the celebration the 'Platty Joobs'. ",
        "But with the coronation of King Charles this weekend, no official nickname appears to have taken hold, with social media calling the ceremony everything from 'The Corribobs' to 'The Cozza' and even 'The Charlie-Hatting'.Taking to Twitter yesterday, one royal observer decided they needed answers once and for all.'Is there a Platty Joobs equivalent for the Coronation?' they wrote, in a quest for suggestions. Dozens chimed in to reply with their own monikers for the long-anticipated event taking place this weekend. ",
        "One movie fan proposed 'King Charles III: The Kingening'. 'I believe it's the Corrie Nates,' a second advised. Elsewhere, a third posited 'Cheeky Corrienandos' whereas another advised that they've seen someone call it the 'Corry Naiche'. Other takes included 'Bank Corriday', 'Corrie Naty', 'Corrie Chaz', 'Chazzle Dazzle' and 'Kingy C's big corrie nay'.Other suggestions took it one step further and even shortened Westminster Abbey to 'Wezzy Abbs'. ",
        "It comes after King Charles was accused of hiding his hands to avoid being mocked for his 'sausage fingers' in portraits released ahead of his Coronation.In the new pictures, the monarch wore a simple pinstripe suit while his wife Camilla, the Queen Consort, posed in a cobalt blue dress.But members of the public realised that one detail appeared to be hidden from the photographer – the King's hands.",
        "In one shot he has them hidden behind his back as he stands alongside Camilla, 75.A second shot shows the 74-year-old with one hand in his pocket.Since taking the throne last September images of his puffy hands – which he jokingly described as his 'sausage fingers' during a 2012 Australian tour – went viral online as many zoomed in on the King's fingers. It was the seventh most searched term on Google at one point this year. ",
        "And so it's perhaps not surprising that Charles may want to keep his digits concealed during official photos, especially during such a celebratory period. But social media users have jokingly remarked that the monarch has been 'bullied' into keeping his fingers off show.'Show us his hands cowards,' one Twitter user commented under the portraits.A second joked: 'We're never seeing them again brother.' 'I want to abolish the monarchy but I do still feel bad that we have gang bullied a grown man into never showing his hands again,' another quipped.  "
    ]
}