{
    "articleURL": "/wires/ap/article-12050475/Ukraine-delegate-hits-Russian-Black-Sea-summit-Turkey.html",
    "content": [
        "ISTANBUL (AP) - Ukrainian and Russian delegates have had to be separated after a scuffle during a meeting of Black Sea countries in the Turkish capital Ankara.",
        "Oleksandr Marikovski, a Ukrainian member of parliament, landed several blows to the head of a Russian official after his Ukrainian flag was ripped from his hands during a summit at the Turkish parliament building on Thursday.A video posted on Marikovski´s Facebook page shows him waving the flag behind Russian delegate Ola Timofeeva as she records a video on her phone. A man approaches, grabs the flag and is chased by Marikovski.During a brief altercation in parliament´s hallway, Marikovski grabs the flag back, pushing the man in the face. Others separate the men and plead \"please, no fighting.\" Marikovski replies: \"It´s our flag. We´re going to fight for this flag.\"In a caption to his Facebook video, Marikovski wrote: \"Paws off our flag, paws off Ukraine, Russian filth!\"The outburst happened at the Parliamentary Assembly of the Black Sea Economic Cooperation, a grouping of 13 countries. It came a day before officials from Russia, Ukraine and Turkey were scheduled to meet in Istanbul to discuss extending the deal for exporting grain and fertilizer through Black Sea ports, which is due to expire on May 18.The deal, which was first agreed last July, has allowed cargo ships to transport millions of tons of food for export safely through the Black Sea, despite the war in Ukraine.",
        "Thursday's summit was earlier disturbed when Ukrainian delegates interrupted a speech to the assembly by Timofeeva, waving Ukraine´s yellow and blue flag by her side as she spoke.Mustafa Sentop, the Turkish parliamentary speaker, condemned the \"provocative and physically offensive actions of some members of the Ukrainian parliamentary delegation\" in a Twitter post.He added: \"I condemn this behavior that disrupts the environment of peace Turkey is trying to achieve.\""
    ]
}