{
    "articleURL": "/news/article-12056847/New-York-Times-mocked-article-claiming-Anglophile-Americans-tucked-Bucks-Fizzes.html",
    "content": [
        "Article, which has since been updated, used some questionable terminologyIt was describing how Anglophile Americans had watched the King's CoronationThe left-wing New York Times has been mocked on social media for a Coronation article claiming Anglophile Americans were dining on 'breakfast pie' and drinking 'non-alcoholic Buck's Fizzes'.",
        "Royal fans across the country have come together today to hold Big Coronation Lunch events marking the second day of the celebrations.But in an article describing how Anglophile Americans had awoken in the early hours of the morning to watch the event, since been updated and corrected, the New York Times used some questionable references towards the food and beverages consumed by Britons this weekend.The newspaper told of how Americans with links to Britain, or those with mere curiosity, had risen in the early hours to watch the historic occasion take place at Westminster Abbey.But the article detailed how people in the UK had 'dined on scones, Scotch eggs and breakfast pie' during the celebrations of King Charles' Coronation.",
        "It also told of how people 'wore gloves and the small headpieces called fascinators', as well as drinking 'Buck's Fizzes' - describing the cocktail as a non-alcoholic version of a mimosa despite it containing champagne.British readers were left perplexed at the terminology, with many confused over the concept of a breakfast pie and its existence in the UK.One reader said: 'Bucks Fizz \"non-alcoholic\"? It's made with champagne for goodness sake...'A second added: 'What is breakfast pie? The entire UK would like to know.'A third said: 'Ha! It’s a masterpiece of mistakes. A comedy of errors.'",
        "Another wrote: 'The words \"dined\" and \"scotch eggs\" should never, ever, be in the same sentence. Ever.'It comes after the newspaper labelled the Coronation a 'cringing discomfort' and claimed it 'arrived with little fanfare', despite news outlets around the globe praising the pomp and pageantry.It is not the first time The New York Times has engaged in some Britain bashing, having previously been forced into an embarrassing apology after publishing an incorrect attack on the Royal Family during coverage of Queen Elizabeth II's funeral last year. ",
        "In an article published ahead of the coronation today, the American paper claimed that 'relations between the British monarchy and its distant realms has come to an end'.On a day when Britain's best was put on display for the world to see - fit with military processions, ancient royal carriages, and traditions that date back ceremonies - the paper then said Britain's 'history tends to be romanticised'.Then, to only add further to it's blotting of Britain, the paper tried to claim that the 'coronation arrived with little fanfare, and some cringing discomfort'."
    ]
}