{
    "articleURL": "/wires/pa/article-12046833/William-pours-perfect-pint-pub-taking-trip-Tube-Kate.html",
    "content": [
        "The Prince of Wales has poured a “perfect pint” during a visit to a London pub.",
        "William and his wife Kate made their first trip on the Elizabeth Line, named after the late Queen, to Tottenham Court Road in Soho.After the roughly 20-minute journey, in which William “confidently” used his Oyster card, they visited the Dog and Duck pub, where they both ordered a pint of cider.They were then accompanied by pub managers Chris Watts and Maria Sojkova behind the bar, where William poured a “perfect pint”, according to waitress Bernie Kidson.It was the first pint of Kingmaker, a pale ale brewed to celebrate the coronation, ever poured.During the visit, William told Mr Watts he likes to visit pubs “out in the sticks” to enjoy watching football in a quieter atmosphere.",
        "Speaking after the visit, which hundreds of fans lined the streets to watch, Mr Watts said William was “enjoying his drink” and “didn’t want to go”.He added: “When we were sat down he said he was happy to sit here a little bit longer.“He was saying he likes to go to the pub – he said he goes out into the sticks where it’s a bit quieter and enjoys watching football, chatting to people and talking.“I don’t think he could do that here – it’d be quite busy.”People in the crowd travelled from as far as Australia, China, Canada and Texas to meet the royals ahead of the coronation on Saturday.",
        "The princess was handed bunches of flowers, as was William, with one woman from Philadelphia saying: “I brought these for Kate but you can have them.”Talking with local businessmen as he sipped a pint in the pub, William said: “You always have the best conversations in pubs – you never know who you are going to meet.”",
        "He also joked that he would have to watch how much he drank and “get back into work mode”.Kate meanwhile said their eldest child Prince George was “excited” about the upcoming coronation and had been taking part in rehearsals.She said the atmosphere in the area was “wonderful” and that excitement for the coronation was “already starting to build”.The royal visit came as London prepared for the historic event on Saturday when the King will be crowned.At around midnight on Wednesday the Diamond Jubilee State Coach was accompanied by hundreds of soldiers on horseback as it travelled along The Mall, while Big Ben was lit up in red and covered with roses as part of a late-night rehearsal.",
        "Across the city, bunting and crowns have appeared on buildings and bus shelters and even scaffolding has been decorated.Meanwhile police are bracing for potential disruption by anti-monarchist protesters after a man was arrested at Buckingham Palace on Tuesday evening for throwing suspected shotgun cartridges into the palace grounds.",
        "Royal fans flocked to the capital throughout the week, with some erecting tents along The Mall.The Grade-II listed Dog and Duck, originally built in 1734, is one of the oldest pubs in Soho.",
        "Its owners claim that the building has hosted several famous faces over the decades – from English poet Dante Gabriel Rossetti to George Orwell and later Madonna.Area manager Mr Watts said he was “honoured” to welcome the prince and princess.“To choose the Dog and Duck is amazing,” he said. “It has a lot of history in a bustling area like Soho, such a quaint pub. It is the perfect place.”"
    ]
}