{
    "articleURL": "/news/article-12041961/Pop-star-Gulsen-handed-ten-month-suspended-jail-term-joking-Turkeys-religious-schools.html",
    "content": [
        "On Wednesday, the court found her guilty of the charge They reduced her sentence from one year to ten months A court in Istanbul has handed Turkish pop singer Gulsen a 10-month suspended sentence after convicting her of 'inciting hatred and enmity' over a joke about Turkey's religious schools, state media reported.",
        "The singer-songwriter was briefly jailed last year for the joke she made during an April concert, when she quipped that the 'perversion' of one of her musicians came about as a result of attending a religious school.The 46-year-old singer, whose full name is Gulsen Colakoglu, was jailed for five days and later spent 15 days under house arrest despite having apologised for any offence she caused to religious school graduates.On Wednesday, the court found her guilty of the charge and initially sentenced her to one year in prison, Anadolu Agency reported.The court later reduced the sentence, citing her 'respectful stance' during the trial.",
        "Gulsen will face prison if she reoffends within the next five years.There was no immediate comment from the singer.Gulsen had vehemently rejected accusations that she aimed to 'incite hatred', insisting that her comment 'was a joke between two people'.She had told the court in her defence that she had teased a band member who was nicknamed 'Imam' but had not attended a religious school.On Wednesday, lawyer Ziya Ilker Goktas reiterated that the comment was a joke and requested her acquittal, insisting 'there was no crime'.Turkish President Recep Tayyip Erdogan and many members of his Islam-based ruling party are graduates of religious schools, called Imam Hatip, which were originally established to train imams.",
        "Turkey's penal code criminalises incitement of hatred and enmity against different groups in society based on class, race, religion or sect, requiring a prison sentence in cases that lead to threats against public safety.Gulsen was previously a target in Islamic circles for her revealing stage outfits and for unfurling an LGBTQ flag at a concert."
    ]
}