{
    "articleURL": "/tvshowbiz/article-12039901/Psychics-shock-prediction-Jackie-O-break-sexual-dry-spell.html",
    "content": [
        "Radio queen Jackie 'O' Henderson was left devastated on Wednesday after a celebrity psychic told her she may not have sex until 2027.",
        "Clairvoyant Georgina Walker was a guest on The Kyle and Jackie O Show and Sandilands, 51, asked her when Jackie's dry spell would finally end.'I see a 27. It could mean the second of July, or 27 weeks or could be the year 2027. But it is going to happen,' Walker responded.Jackie, 48, was dismayed after being told she may have a long wait ahead of her which prompted Walker to reassure her the prediction could mean the second of July.'On that date I will be in Italy,' Jackie said, to which Walker responded: 'Oh really? Let's get a gigolo going!'",
        "'Do I have to pay for it?,' Jackie asked and after being told yes she said she wasn't interested in paying for sex as she was also looking for romance.Back in March, Jackie admitted she loves being single because it means she is responsible for maintaining her own happiness.The radio presenter spoke about being a single woman in her forties during an interview with KIIS FM's Will and Woody on International Women's Day.",
        "'I was just with my best girlfriend and we were talking about how now we are in our forties, we feel mentally and physically better than in our twenties,' she said.Jackie explained her friends and family keep her so busy she doesn't have time to feel 'lonely' about being single.",
        "'I'm always busy, I have great friends, a great job, the most wonderful daughter and I love my life right now,' she told drive hosts Will McMahon and Woody Whitelaw.",
        "'I really feel happy where I am and I don’t really feel the need to find someone to make me happy,' she added.Last month, Jackie said she was so happy being single she could see herself going the rest of her life without being in another long-term relationship.But she did admit to worrying she may regret this decision when she gets older.She discussed her single life on The Kyle and Jackie O Show, saying she 'loves' being in total control of her own life without having to worry about anyone else besides her daughter."
    ]
}