{
    "articleURL": "/wires/ap/article-12041735/CVS-chops-2023-forecast-strong-quarter.html",
    "content": [
        "CVS Health turned in a better-than-expected first quarter as revenue grew from all parts of its business. But the health care giant chopped its 2023 earnings forecast after closing a pair of multibillion-dollar deals that push it deeper into providing care.",
        "The forecast cut on Wednesday came a day after CVS Health said it completed a roughly $10.6 billion acquisition of primary care provider Oak Street Health that it had just announced in February. It also closed in March an approximately $8 billion deal to buy home health care provider Signify Health.Both deals reflect spending priorities for the company. CVS Health runs drugstores, provides insurance and manages prescription drug benefits.But it also has been providing more care as part of a broad push to cut costs and improve patient health. That's something bill payers like insurers and employers want to see. That's especially true with Medicare Advantage plans, which are privately run versions of the federal government's Medicare program for people age 65 and older.After closing the deals, CVS Health said Wednesday that it now expects adjusted earnings of $8.50 to $8.70 per share for the year. That´s down 20 cents on both ends of the range from a forecast it debuted in November and reaffirmed in February.It´s also short of the $8.76 Wall Street had been projecting, according to a poll of analysts by FactSet.",
        "CVS Health runs a drugstore chain with nearly 10,000 locations. It manages prescription drug plans for big clients like insurers and employers, and it provides coverage for more than 25 million people through its Aetna arm.",
        "Insurance enrollment grew by more than 1 million people in the first quarter as the company mostly added customers from state-based individual insurance marketplaces.CVS Health also processed more pharmacy claims in the quarter as it added business and saw more claims from a cough, cold and flu season that turned out worse than last year.A drop in COVID-19 vaccinations balanced those gains.Sales also increased in the business that includes CVS drugstores. But CVS Health also said that segment was affected by a drop in coronavirus testing and continued to feel pressure from tight prescription reimbursement.CVS Health has been adjusting its store count based on factors like population shifts and customer buying patterns. CEO Karen Lynch told analysts Wednesday that the company has shuttered more than 100 locations so far this year.It's on track to close 300 this year and a total of 900 by 2024.In the first quarter, total revenue jumped 11% to $85.28 billion. Earnings adjusted for one-time items came in at $2.20 per share.Analysts predicted earnings of $2.09 per share on $80.79 billion in revenue.CVS Health Corp. also said Wednesday that operating income fell nearly 3% to $3.45 billion in the quarter due to another write-down from its Omnicare long-term care business. Lynch said last fall that the company was exploring strategic alternatives for that business.",
        "Shares of CVS Health, based in Woonsocket, Rhode Island, fell 3% to $70.39 Wednesday morning after markets opened. Broader indexes were climbing."
    ]
}