{
    "articleURL": "/wires/ap/article-12039745/NBA-MVP-76ers-Embiid-wins-leagues-individual-honor.html",
    "content": [
        "Joel Embiid began the long process toward NBA MVP as a towering soccer prospect in Africa who never picked up a basketball until he was a teenager.",
        "Once he changed sports for good, Embiid became a generational - albeit often-injured - talent. And, the affable center quickly became the face of the Philadelphia 76ers´ rebuilding effort more commonly known as The Process.He embraced the nickname and is introduced before every home game as Joel \"The Process\" Embiid.Embiid can now add MVP.The All-Star center and two-time league scoring champion, Embiid, who had long lobbied for the award, earned his first NBA MVP trophy Tuesday night, topping two-time winner Nikola Jokic of the Denver Nuggets.The 29-year-old from Yaoundé, Cameroon, averaged 33.1 points to win his second straight scoring title, averaged 10.2 rebounds and tied a career high with 4.2 assists per game. Embiid has been sidelined with a sprained right knee that cost him one game of the playoff sweep against Brooklyn and the opening game of the Eastern Conference semifinals against Boston, which was won by Philadelphia on Monday night.",
        "Jokic finished runner-up in the MVP voting, and Giannis Antetokounmpo of the Milwaukee Bucks was third. Embiid received 73 first-place votes. Jokic received 15 first-place votes, and Antetokounmpo got 12.\"It's been a long time coming,\" Embiid said. \"A lot of hard work. I've been through a lot. I'm not just talking about basketball. I'm talking about my life. My story. Where I come from. How I got here and what it took for me to be here.\"",
        "The 76ers watched on TV in Boston and erupted in applause and started chanting \"MVP! MVP! \" as the big man buried his head in his hands as he sat in a chair in the team hotel. Embiid was in tears as teammates James Harden, Tobias Harris and Tyrese Maxey mobbed him in celebration.Embiid then vowed \"I'll be back\" for the playoff series against the Celtics.But as for Game 2 on Wednesday night?\"We shall see,\" Embiid said.Play or not, there will be raucous celebration for Embiid once the 76ers return home Friday night for Game. 3.Embiid has been determined to win -- and campaigned for -- the MVP trophy for years. The third overall pick of the 2014 draft, Embiid missed his first two full seasons with injuries before settling in as one of the top big men of his generation. He was at his best this season when he totaled three 50-point games, including a career-high 59 against Utah in November. He had 13 total 40-point games.When Embiid totaled 52 points and 13 rebounds in a win against the Celtics in April, coach Doc Rivers boldly declared, \"The MVP race is over.\"Embiid certainly didn´t argue that night with his coach or Sixers teammates who stumped on his behalf.",
        "\"They´re probably right,\" Embiid said. \"But we have bigger goals in mind.\"His durability played a factor in the vote. Embiid played in 66 games, the second-highest total of his career, even though he has again has been hit with injuries in the playoffs.Embiid is the first 76er to win league MVP since Allen Iverson in 2001. Julius Erving in 1981, Moses Malone in 1983 and Wilt Chamberlain from 1966-1968 are other 76ers to win NBA MVP awards.Embiid´s injury, though, could be the deciding factor in the 76ers´ chase for the NBA championship. The Sixers are trying to win their first NBA title since 1983 and advance past the second round for the first time since 2001 - which was the last time a Sixer won the MVP award.Allen Iverson was named league MVP in 2001. Other 76ers to capture the league's top individual award: Julius Erving, 1981; Moses Malone, 1983; and Wilt Chamberlain, 1966-1968.Embiid, who graduated from a Florida high school and played a season in college at Kansas, has been every bit the dominant force in the NBA over the past seven seasons. Once the poster child for load management, Embiid has played 134 regular-season games the last two seasons and his 30.6 points last season made him the first international player ever to win an NBA scoring title. He´s a six-time All-Star and was runner-up each of the last two seasons to Jokic.",
        "Antetokounmpo won in 2019 and 2020. Jokic in 2021 and 2022.Now, the award belongs to Embiid, who didn´t pick up a basketball until he was a teenager in Africa, when a friend informed him that very few 7-footers succeed in soccer.A few months later, Embiid was lured to a basketball camp in the capital of Yaounde run by NBA veteran Luc Mbah a Moute, one of just two players from Cameroon to have played in the NBA. Mbah a Moute persuaded Embiid´s parents to let him move 6,000 miles to Florida, and helped enroll him at Montverde Academy, one of the best high school programs in the country. He played just 28 games in his lone season at Kansas before leaving for the NBA.\"I am absolutely thrilled for Joel on winning the MVP award. He is the real deal and deserves every bit of recognition that comes his way,\" Rivers said. \"He embodies everything that the honor stands for. His drive to improve is unmatched, and like the saying `a dream doesn´t become reality through magic, it takes hard work´, he´s put in the work.\"Embiid, who became an American citizen last year, was known early in his career for sucking down Shirley Temples but has worked with sports dietitians to develop healthier eating habits and streamlined his workouts.",
        "Sixers fans can enjoy him for years. Embiid´s four-year, $196 million contract extension doesn´t kick in until next season and takes him through 2026-27.Billboards went up around Philadelphia of Embiid with the slogan \"MVPIID\" and Sixers fans serenaded him with \"MVP!\" chants from pregame introductions all the way to his final free throw attempts.Embiid, who shares with his long-time girlfriend a son named in the honor of his late brother, holds career averages of 27.2 points and 11.2 rebounds in 394 career starts. He´s a four-time All-NBA selection and three-time All-Defensive Team selection.This is the fifth consecutive year an international player has been MVP, extending the longest streak in NBA history. It´s also the second time that international players finished 1-2-3 in MVP voting; the first time was last season.Embiid becomes the second winner from Africa, joining Hakeem Olajuwon, the Nigerian who won for Houston in 1994.\"His impact on both sides of the ball places him in rarified air among all-time greats such as Hakeem, Kareem (Abdul-Jabbar) and Wilt,\" 76ers President Daryl Morey said. \"It has been a privilege to watch Joel over the last three seasons and I know this won´t be his last accomplishment as we continue to strive toward our ultimate goal of winning an NBA championship.\"",
        "Philly is enjoying a banner run of elite athletes rising to the moment. Phillies slugger Bryce Harper won the 2021 NL MVP and 2022 NLCS MVP while Eagles QB Jalen Hurts was an NFL MVP finalist and led them to the Super Bowl.They both fell short of the final championship goal.He may be hobbling along in the postseason, but Embiid still has a shot to get his ring.____AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP_Sports"
    ]
}