{
    "articleURL": "/wires/reuters/article-12054685/Urawa-coach-Skorza-sacrifices-principals-claim-Asian-title.html",
    "content": [
        "By Michael Church",
        "SAITAMA, Japan May 6 (Reuters) - Urawa Red Diamonds coach Maciej Skorza admitted he had to sacrifice his football principals to secure their third Asian Champions League title with victory over defending champions Al-Hilal on Saturday.Official statistics recorded Urawa failed to register a single shot on target over the 90 minutes of the second leg and had less then 30% possession but still won - both on the night and on aggregate - through Andre Carrillo's own goal.That strike, which came three minutes into the second half at a packed Saitama Stadium, sealed a 2-1 aggregate win for the Japanese after a 1-1 draw in Riyadh last weekend and delivered another Asian title after previous wins in 2007 and 2017.\"Keeping compact, with good organisation in defence was our target,\" Skorza said of his tactical approach.\"We thought we could play a little more offensively and keep the ball much longer but this is also about the result that we achieved in the first game.\"From the first minute we didn't need to play a very risky game. Generally our target was to win this trophy. That was our target.\"Of course we would like to win scoring three or five goals, that would be fantastic but today playing such a good team like Al-Hilal we had to beat them.",
        "\"To win against Al-Hilal does not happen every day so we should respect today's result.\"The title win was Skorza's first with Urawa and comes less than five months after he was appointed the club's coach.He has led the team to sixth in the current J.League standings with Urawa showing signs of playing a more attacking style of football in the domestic set-up after a disappointing season last year under former coach Ricardo Rodriguez.But that approach was put to one side across both legs of the Asian Champions League final and Skorza felt the result justified his more restrained approach.\"We have to remember who was our opponent today,\" he said. \"We have started our work in a good way and now we have to develop our style, trying to play more offensive. This is our target, what we want to achieve in the future.\"But the question is: are we ready today to play open football against such a good team like Al Hilal?\" (Reporting by Michael Church, Editing by Toby Davis)"
    ]
}