{
    "articleURL": "/money/markets/article-12042203/Paddy-Power-owner-Flutter-sees-revenue-surge-92.html",
    "content": [
        "Flutter Entertainment has been expanding rapidly in the US gambling marketUK White Paper last week said 300,000 at risk of problem gambling Paddy Power owner Flutter Entertainment said it enjoyed a 'very strong' performance in the US during its first quarter, with revenue on the up.",
        "Globally the group claims to have attracted around 12.3million gamblers a month between January and March 2023, up from about 9.5million in the same period year ago. Revenues in the US surged by 92 per cent year-on-year to £908million, with Flutter confident it is Flutter  on track to become the first gambling operator in the country to turn a profit in 2023. ",
        "In the three months to the end of March, total group revenue increased by 46 per cent from the same period a year earlier to £2.4billion. Sports revenue was up 53 per cent to £1.5billion, while gaming revenue was 35 per cent higher at £916million.This included sportsbook revenue growth of 147 per cent as Flutter took sports market share of 50 per cent in the first quarter. iGaming revenue rose by 43 per cent over the period and Flutter said the US division remained 'firmly on track for full year profitability in 2023'.Flutter shares fell today and were down 1.11 per cent or 175.00p to 15,615.00p this afternoon and are about 90 per cent higher than a year ago.Beyond its US operations, the group said it delivered 'good' pro forma revenue growth of 8 per cent, driven by the UK &amp; Ireland, which saw a 17 per cent increase in revenue, and solid growth of 6 per cent in its International business.",
        "In a call with analysts boss Peter Jackson said: 'I said back in March I felt like we had our mojo back and you can see why I was talking about the (UKI) business so positively.' The Paddy Power, Betfair and Sky Bet owner said its performance in Australia, where revenue slipped 4 per cent, remained 'resilient against challenging comparatives with good customer growth'.Boss Peter Jackson said: 'In the US, the combination of the FanDuel Advantage and the Flutter Edge drove further market share gains. 'We added over 1.5million customers in the quarter and we remain the clear market leader. Our US sports betting handle of $10.9billion represented almost 60 per cent of the group's total sportsbook stakes.'Flutter said it was on track to become the first US gambling operator to turn a profit this year following the lifting in 2018 of a nationwide ban on sports betting. The US business made an investment-driven loss of $313million in 2022.The Dublin-based group forecast in November that Fanduel's revenue would jump to around $15billion over the long term, which is twice Flutter's entire revenue last year.Outside of the US, Jackson said revenue growth of 8 per cent 'demonstrated the benefits of diversification of our portfolio'.He added: 'We continued to take share across our UK &amp; Ireland and international businesses while in Australia we did an excellent job defending our leadership position. We remain delighted with the progress of Sisal since the acquisition in August 2022.'",
        "In April a UK government White Paper claimed that around 300,000 people are estimated to be experiencing problem gambling, and another 1.8million are 'gambling at elevated levels of risk'.Last week, Flutter said new UK government plans to fight problem gambling would cost about £50million to £100million in lost revenue from 2024. This is on top of the £150million already forgone due to existing measures.The latest hit will come from a combination of new stake limits on online slot gaming products, a statutory levy on betting firms and the impact of increased affordability checks, depending on the final proposal details, Flutter said.Victoria Scholar, head of investment at Interactive Investor, said: 'Investors have enjoyed very strong share price gains lately with Flutter up over 90 per cent year-on-year and up almost 40 per cent year-to-date, thanks to strong growth in the United States with the acquisition FanDuel as well as its recent takeovers of Sisal and Tombola elsewhere.'Flutter is the star performer in the sector versus rivals Entain and 888 which are both in the red over a twelve-month period.'",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}