{
    "articleURL": "/news/article-12053651/Mr-Crackles-closes-ten-years-Sydneys-Oxford-Street.html",
    "content": [
        "Mr Crackles closes both Syd and Melb venues'Never recovered' from lockdown restrictions A beloved takeaway store with a cult following has unexpectedly shut its doors amid Australia's worsening cost of living crisis. ",
        "Mr Crackles opened on Sydney's Oxford Street in 2013, and then expanded into Melbourne with the opening of a Bourke Street store in 2018. Coined 'king of the midnight pork roast', Mr Crackles was loved for it's iconic pork crackling, juicy rolls and hot dogs, and quickly became a favourite amongst revellers for a late-night feed.However, co-owners Sam Horowitz and Carlos Justo announced the doors of both their venues will be shut for good, citing problems stemming from the Covid pandemic.",
        "'Costs of goods doubled and revenue is still down,' the duo told news.com.au.'We relied a lot of volume which hasn't returned to normal after Covid.'They said that Sydney's nightlife never bounced back to what it was pre-pandemic. 'The juice just wasn't worth the squeeze anymore,' the co-owners said.Mr Crackles' website has been taken down and both stores are marked as permanently closed on Google - even though the official Mr Crackles Instagram shared a photo on its account just last week stating it was 'open late all weekend'.Regulars have been left shocked at the news of the popular takeout's collapse, with several taking to social media to voice their devastations. 'RIP', one wrote, 'been a big fan of you (sic)'. 'Livid,' another customer said.",
        "One regular wrote: 'We're in mourning.'",
        "'Noooo, this is such a great little spot. How heartbreaking,' another shared.'So sad that you left,' said another.'This is just the worst news,' one customer said.Mr Horowitz and Mr Justo also owned fried chicken restaurant Thirsty Bird, with customers noticing both the Newtown and Potts Point stores were 'emptied out' in early 2023.The official Instagram account for Thirsty Bird confirmed the restaurants closure, responding 'yes' to a customer asking in the comment section if the Newtown store was 'closed for good'."
    ]
}