{
    "articleURL": "/wires/afp/article-12038773/Trump-groped-flight-woman-tells-US-civil-trial.html",
    "content": [
        "A woman told a New York civil trial on Tuesday that Donald Trump sexually assaulted her on a flight in the United States in the late 1970s.",
        "Jessica Leeds recounted the alleged attack while testifying in the writer E. Jean Carroll's rape and defamation lawsuit against the ex-president.Trump denies all allegations of sexual assault and has never been criminally prosecuted over any such claims.Leeds told Manhattan's federal court that Trump put his hand up her skirt in the business class section of a flight to New York in 1978 or 1979.\"There was no conversation. It was like out of the blue,\" said Leeds, now 81.\"He was trying to kiss me, grabbing my breasts,\" she added.Leeds first made the allegation in an interview with the New York Times weeks before the 2016 election that sent Trump to the White House.Some dozen women came forward accusing Trump of sexual misconduct in the run-up to the vote.Leeds went public with the accusation after Trump refuted sexual assault allegations during a presidential debate with Hillary Clinton.\"I was furious because he was lying,\" Leeds recalled.Leeds was called to testify by Carroll's lawyers to try to persuade the nine-person jury that Trump has engaged in a pattern of sexual misconduct.Carroll, 79, has sued Trump alleging he sexually assaulted her in a changing room at the luxury Bergdorf Goodman department store in Manhattan in the mid-1990s.",
        "She also claims that Trump then defamed her when he called her \"a complete con job\" after she went public with the allegation in 2019.Trump has repeatedly and strenuously denied the allegations.Carroll filed her lawsuit late last year after a law took effect in New York that gave victims of sexual assault a one-year window to sue their alleged abusers decades after attacks may have occurred.The suit seeks unspecified damages and asks that Trump retract his comments.No criminal prosecution can stem from Carroll's civil case but if Trump loses it will be the first time he has ever been held legally liable for an allegation of sexual assault.The case is one of several legal challenges facing Trump as the 76-year-old Republican seeks a return to the White House in next year's election.Last month he pleaded not guilty in a criminal case related to a hush-money payment made to a porn star just before the 2016 vote.Trump is also being investigated over his efforts to overturn his 2020 election loss in the southern state of Georgia, his alleged mishandling of classified documents taken from the White House and his involvement in the storming of the US Capitol by his supporters on January 6, 2021."
    ]
}