{
    "articleURL": "/sport/mma/article-12056021/Conor-McGregor-revels-winning-bet-Aljamain-Sterlings-UFC-288-win-against-Henry-Cejudo.html",
    "content": [
        "Conor McGregor congratulated Aljamain Sterling after he beat Henry CejudoMcGregor insisted Cejudo barely gave the bantamweight champion a scratch RECAP: 'Funk Master' triumphs in thrilling five-round battle to set up 'Suga' clash Conor McGregor has congratulated Aljamain Sterling after he retained his bantamweight title by beating Henry Cejudo at UFC 288.",
        "Sterling defeated the returning Triple C via split decision after an entertaining five-round battle in Newark, New Jersey in the early hours of Sunday morning.The New Yorker, 33, defended his championship belt for the third time after doing enough damage from range to convince the judges without Cejudo ever really hurting him.And 'The Notorious' Irish fighter McGregor quickly took to social media to hail the 'Funkmaster' and criticise his opponent's performance, hinting he was in the money after betting successfully on the result. McGregor said on Twitter: 'Easiest money I've ever made. Not a scratch on Aljo! Congrats Funkmaster! ",
        "'Good little fighter is Henry but give it a rest with these agendas all the time. The guy is sub 20 fights in his career. 'His little feints an' all ahaha omg please teach me mastermind lol. 'Done the splits like a stripper and got dumped on his a** he did hahaha oh lord it's tasty, @ProperWhiskey.' After the fight, Sean O'Malley called out Sterling in a foul-mouthed rant to tee up a mouthwatering bantamweight bout.Not long after Sterling lifted his arm in the octagon, O'Malley stormed in to confront him in sensational scenes. Social media footage showed 'Suga', 28, wearing a garish red and black jacket, walk up the steps and make his way over to his potential next opponent.",
        "Sterling said: 'Get your a** in the big boy players, baby,' as the pair squared up, talked over each other and shouted in each other's faces before White stepped in to separate the duo.After O'Malley insisted 'You looked like s***', Sterling questioned why he 'ran' by turning down the title shot, continuing: 'That's what I thought. Because I'd drag your a** up and down this octagon. Get the f*** out my cage.'"
    ]
}