{
    "articleURL": "/wires/ap/article-12042551/Ex-FBI-supervisory-agent-arrested-Capitol-riot-charges.html",
    "content": [
        "A former FBI supervisory agent has been arrested on charges that he joined a mob storming the U.S. Capitol, where he cheered on rioters attacking police officers, federal authorities said.",
        "The former agent, Jared Wise, repeatedly shouted, \"Kill ´em!\" as he watched rioters assaulting officers outside the Capitol on Jan. 6, 2021, according to an FBI agent's affidavit.Wise was arrested Monday in Oregon on misdemeanor charges including entering or remaining in a restricted building or grounds, court records show.Wise, 50, worked as a special agent or supervisory special agent for the FBI from 2004 through 2017, according to the affidavit. The FBI didn't respond to a request for more information about Wise's work for the bureau.\"We refer you to the public court documents and don´t have any further comment,\" an FBI statement says.The FBI says security camera video captured Wise inside the Capitol on Jan. 6, when a mob of Donald Trump supporters disrupted the joint session of Congress for certifying President Joe Biden's 2020 electoral victory.",
        "Wise clapped his hands and raised his arms \"in triumph\" after he entered the building through the Senate wing door, the affidavit says. He left the building about nine minutes after entering.Nearly two hours later, police body camera footage showed Wise berating police officers outside the Capitol and repeatedly shouting, \"Shame on you!\"\"You guys are disgusting,\" he told them. \"I´m former law enforcement. You´re disgusting. You are the Nazi. You are the Gestapo. You can´t see it.\"",
        "The FBI says it received a tip in January 2022 that Wise had entered the Capitol on Jan. 6.A federal magistrate judge ordered Wise's release from custody after his initial court appearance in Eugene, Oregon, on Monday.Wise lived in New Braunfels, Texas, until June 2022 before moving to Bend, Oregon, the affidavit says.A lawyer for Wise in Oregon didn't immediately respond to emails seeking comment.More than 100 officers were injured during the Jan. 6 riot. Over 1,000 people have been charged with federal crimes related to the Capitol siege."
    ]
}