{
    "articleURL": "/wires/reuters/article-12059193/Syrians-split-government-readmission-Arab-League.html",
    "content": [
        "BEIRUT/DAMASCUS, May 8 (Reuters) - Syrian factions have given mixed reactions to an Arab League decision to lift the suspension on Syria's membership after more than a decade of isolation, underscoring the deep rifts cut into the country by years of bloodshed.",
        "The decision on Sunday by foreign ministers of Arab League countries consolidates a regional push to normalise ties with President Bashar al-Assad, whose country was suspended from the body in 2011 following his crackdown against the opposition.Since then, hundreds of thousands have died, millions have been displaced both internally and abroad and infrastructure has been ravaged by years of bombardment.Readmitting Syria into the Arab League was a \"shock\" for Syrians and would \"kill the political process\", said Bader Jamous, the head of the opposition's negotiating team in stalled United Nations peace talks.The opposition was for years backed by countries now supporting normalisation, including Saudi Arabia and the United Arab Emirates. Writing on Twitter, Jamous said Assad's opponents had \"not been consulted\" about the Arab League decisions.Swathes of northern Syria are still held by Turkey-backed rebel groups and protests against normalisation with Assad have flared up there in recent months.The Syria Campaign, which campaigns for victims of rights abuses in Syria, said Sunday's move \"sends a chilling message\" and drilled \"a final nail in the coffin of the hopes for freedom and democracy of the Arab Spring.\"Others were more positive. The Syrian Democratic Council, the political body that governs the semi-autonomous regions of northeast Syria, said it \"welcomed\" the decision to lift Syria's suspension in a statement on Monday.",
        "Some Syrian political activists with ties to the government - including former deputy prime minister Qadri Jamil - cautiously encouraged the move in an online statement.They said it allowed for a regional Arab role, which could lead to \"a positive outcome within the Syrian file.\"And a Facebook page publishing news from the campuses of various Syrian universities posted a stock photograph of Syria's seat at the Arab League with the caption: \"After 12 years, the Arab League comes back to life.\"(Reporting by Maya Gebeily in Beirut and Kinda Makieh in Damascus, Editing by William Maclean)"
    ]
}