{
    "articleURL": "/money/markets/article-12043305/MARKET-REPORT-Haleon-shares-slip-Pfizer-stake-sale-plans.html",
    "content": [
        "Shares in Haleon slid yesterday as the consumer health group’s top shareholder plans to trim its stake.",
        "US drugmaker Pfizer, which teamed up with Biontech to create one of the Covid vaccines, is poised to start selling its 32 per cent holding in the Sensodyne toothpaste maker in a bid to reduce its debt and return more money to shareholders.This would begin over the next few months in a ‘slow and methodical manner’ to prevent driving down Haleon’s share price, Pfizer finance boss David Denton told the Financial Times.His opposite number at Haleon, Tobias Hestler, said the stake sale is not a surprise given the US drugs giant has made its intentions known for some time.He said: ‘This will happen every quarter from now until they’re sold off.",
        "‘This is just what’s expected. If I get a courtesy call the evening before they do it then that would be nice but they don’t even have to do that.’ Despite his efforts to shrug off the news, Haleon shares closed down by 3.4 per cent, or 12.1p, to 340.9p yesterday.GSK and Pfizer merged their consumer healthcare arms to create a joint business in 2019.It was spun off in July last year to form Haleon, which floated at 330p a share, valuing the business at about £30.5billion.Pfizer’s 32 per cent stake in Haleon is worth around £10billion. GSK, which is the second-largest shareholder, has a holding of around 13 per cent.",
        "The news overshadowed Haleon’s first-quarter results.Rising numbers of cold and flu cases saw customers snap up painkillers and nasal drops, helping revenues rise 9.9 per cent to £3billion in the first three months of the year.Haleon said a strong start to 2023 meant revenue growth should reach the upper end of the 4 per cent to 6 per cent range it gave in March.",
        "Mirriad jumped 409.1 per cent ,or 4.5p, to 5.6p after the advertising firm which specialises in virtual product placement did a deal with Microsoft.Its technology allows companies to digitally insert objects into content.It has worked with the likes of Lexus to place its cars in music videos without them being there physically and will work with Microsoft’s Azure platform to make it easier for media partners to exchange data and speed up the process of placing brands in videos.",
        "Steve Clayton, head of equity funds at Hargreaves Lansdown, said: ‘Haleon is performing strongly, with a great portfolio of brands. There could be a chance to pick it up at a discount if Pfizer decides it has a more pressing need for the £10billion or so that the stake is currently valued at.’The FTSE 100 rose 0.2 per cent, or 15.34 points, to 7788.37 and the FTSE 250 was up 0.3 per cent, or 51.37 points, to 19,365.60.",
        "The company behind Paddy Power and Betfair revealed 30 per cent more gamblers have used its services since the World Cup.Flutter Entertainment attracted around 12.3m gamblers a month between January and March this year, up from around 9.5m in the same period a year before. The positive update failed to impress investors, however, and shares fell 1.2 per cent, or 190p, to 15,600p. Pearson shares bounced back a day after the education publisher was punished by the market after US peer, Chegg, warned that students were turning to artificial intelligence software such as ChatGPT for help rather than to traditional textbooks. Having fallen 15 per cent on Tuesday, Pearson shares recovered 10.1 per cent, or 76, to 830p.Newspaper publisher Reach has endured a tough start to the year as changes to the way that Facebook displays news hit reader numbers online. The company, whose titles include the Daily Mirror and Daily Express, reported a 5.9 per cent fall in group revenues in the four months to April 23.Digital sales were down 14.5 per cent while print advertising fell 19.2 per cent.The figures come as the group slashes £30million in costs in the face of weaker advertising demand.Reach last month announced plans to put 420 jobs in the UK and Ireland at risk of redundancy, including those of around 190 of its journalists. The shares rose 1.4 per cent, or 1.15p, to 83.35p.",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}