{
    "articleURL": "/wires/reuters/article-12055009/Soccer-Man-City-climb-four-points-clear-Arsenal-title-race.html",
    "content": [
        "Gundogan scores twice as Man City win again",
        "Liverpool clinch sixth win in a rowKane on target in Spurs victoryLampard gets first winBy Lori EwingMANCHESTER, England, May 6 (Reuters) - Manchester City continued their seemingly unstoppable charge towards a third consecutive Premier League title with a 2-1 victory over Leeds United on Saturday that put them four points clear of Arsenal.Ilkay Gundogan scored a brace for Man City, but missed a late penalty that left manager Pep Guardiola enraged after the Spaniard had called for Erling Haaland to take it, with Leeds grabbing a goal back a minute later.Liverpool's faint hopes of a top-four finish continued as they beat Brentford 1-0 at Anfield thanks to Mohamed Salah's first-half strike.Harry Kane scored to lift Tottenham Hotspur to a much-needed 1-0 win over Crystal Palace, their first victory in five games, while Chelsea claimed their first win under interim manager Frank Lampard with a 3-1 victory at Bournemouth.Man City had appeared to be cruising after Gundogan's double strike put them in the box seat at the Etihad Stadium but the German's missed penalty in the 84th minute set up a nervy finish as Rodrigo Moreno pulled a goal back for Leeds moments later.While Gundogan was on a hat-trick, Guardiola was adamant there should be no room for sentiment and Haaland was the designated taker.",
        "\"The performance was excellent. We played really, really good,\" Guardiola said. \"Who knows if Erling takes the penalty and misses it? What happens if Gundo takes the penalty and scores? So the question is 2-0, who is the taker? The taker is Erling.\"City's victory, coupled with an Arsenal loss on Sunday to Newcastle United, would all but clinch the Premier League title for the treble-chasers who stretched their winning league run to 10 games.Liverpool notched up a sixth straight Premier League win to maintain their pursuit of a top-four spot.Salah bagged the only goal of the game in the 13th minute, starting the move before Fabinho crossed to Virgil van Dijk at the back post, and the big Dutchman headed the ball back for the Egyptian to bundle home his 100th goal at Anfield.The win left the Merseysiders in fifth spot on 62 points, one behind fourth-placed United, but the Red Devils have two games in hand.KANE HEADERKane headed Tottenham in front in first-half injury time to move up to second place in the all-time Premier League goalscorers list.The win vaulted Spurs to sixth in the table with 57 points from 35 games, six points behind fourth-placed United, who have played two games fewer. Palace are 12th.",
        "Chelsea snapped a nine-match winless run in all competitions.Late goals from Chelsea's Benoit Badiashile and Joao Felix, after Conor Gallagher's opener was cancelled out by Bournemouth's Matias Vina, helped the London club move up to 11th with 42 points.Bournemouth slipped to 14th, three points behind Chelsea having played a game more.\"It feels great, we just wanted to put in a performance today,\" Lampard said. \"We haven't been good enough recently so this was an important game for us.\"Wolverhampton Wanderers got an early goal from defender Toti and then held on for a gritty 1-0 win over Aston Villa to all but cement a spot in the Premier League next season.It was a welcome win for Julen Lopetegui's side after a 6-0 thumping by Brighton &amp;amp; Hove Albion last weekend.\"Massive result for us,\" said Ruben Neves, whose corner kick led to the goal. \"After the Brighton game, it's all we have talked about.\"Wolves climbed 10 points clear of the relegation zone with 40 points, while Villa remained in eighth after their second consecutive loss.(Reporting by Lori Ewing Editing by Toby Davis)"
    ]
}