{
    "articleURL": "/sport/mma/article-12049059/Father-recently-retired-UFC-star-Jorge-Masvidal-arrested-shooting-someone.html",
    "content": [
        "Jorge Masvidal Sr. has reportedly been taken into custody by Miami policeMasvidal Jr., a recently retired UFC star, is not a suspect at this time DailyMail.com provides all the latest international sports newsThe father of recently retired UFC star Jorge Masvidal has reportedly been arrested in South Florida after allegedly shooting someone at the mixed-martial arts fighter's home.",
        "The younger Masvidal wasn't present and is not a suspect, according to Miami-Dade police, who did not name the suspect, Jorge Masvidal Sr., in Thursday's statement, provided to DailyMail.com. Police were called to Masvidal Jr.'s home around 3pm after a shooting. Upon arrival, officers witnessed an adult male receiving aid from Miami-Dade Fire Rescue. The unidentified victim told police he was in an argument that escalated when the accused produced a firearm and shot the other man, who was transported to the hospital in stable condition. Fox Sports 640 Miami is reporting that the shooter is believed to be Masvidal Sr. ",
        "'All occupants of the residence exited the home where units took the subject into custody without incident,' read the police statement provided to DailyMail.com. 'The relationship between all parties on scene has not been confirmed, however, all parties know each other.'The listed owner of the residence is Jorge Masvidal Jr.. He was not present during the incident and did not have any involvement.'The subject is currently awaiting interview by detectives. Neither his, nor the victim’s identities have been released.Masvidal Jr. retired following April's loss at UFC 287 in his hometown of Miami.The 38-year-old welterweight suffered a lopsided defeat against Gilbert Burns in the co-main event.The loss by unanimous decision was the fourth straight defeat for Masvidal Jr., who retires with an MMA record of 35-17 dating back to 2003.",
        "'I love everybody here,' Masvidal Jr. said after the fight. 'It's been a long 20 years, 50-some fights. Sometimes your favorite basketball player don't have that 3-pointer no more. Your favorite quarterback loses that rifle. I don't feel the same when I get in here no more. It's been 20 long years.'The signature moment of Masvidal Jr.'s long career in the Octagon was his five-second knockout of Ben Askren with a flying knee at UFC 239 in 2019. It remains the fastest win in UFC history."
    ]
}