{
    "articleURL": "/news/article-12041051/Iron-Maiden-frontman-Bruce-Dickinson-caught-270-000-High-Court-battle-speaking-tour-cash.html",
    "content": [
        "Iron Maiden's Bruce Dickinson caught in legal battle over speaking tour agenciesFormer agency said David Daniel and Andrew Leighton-Pope had poached himIron Maiden frontman Bruce Dickinson has been caught up in a £270,000 High Court battle over cash from his lucrative speaking tours.",
        "Dickinson, 64, shot to fame as the lead vocalist of the heavy metal band, famous for their hits including Run To The Hills, The Number Of The Beast and Bring Your Daughter To The Slaughter.The Iron Maiden singer has now been engulfed in a row between rival agents who are fighting over a cut of the takings from his public speaking tours. His shows — 'An Evening With Bruce Dickinson' — are said in online publicity to feature 'fascinating tales and derring-do exploits' from his rock career, as well as giving a 'humorous and often satirical look at the world from his own very personal perspective'.Dickinson's tour agents, David Daniel and Andrew Leighton-Pope, are being sued for allegedly poaching him from his previous agency, Celebrity Speakers.",
        "Dickinson is not a party to the case and has not given evidence.",
        "His new tour agents had previously worked for or been connected with Celebrity Speakers (CSL), but then moved on, taking Dickinson with them, the company's lawyers say.Dickinson is known for his operatic 'air-raid warning' style of singing, but in recent years has forged a side career, filling theatres around the world on a series of spoken-word tours.He was initially vocalist with rockers Samson, joining Iron Maiden for their iconic 1982 album The Number Of The Beast.",
        "He has lived a colourful life in and outside the music industry, including famously qualifying and then working as a commercial airline pilot even after he found fame.Last year, CSL sued over Mr Daniel's and Mr Leighton-Pope's 'misuse' of confidential business data - including contact details for its clients - and won a judgment in its favour when the two men's defences were struck out.But the case reached court again, with Judge Jason Beer KC being asked to order the two men and Mr Leighton-Pope's agency, D&amp;A Associates, to hand CSL at least £270,000 in compensation.The company is claiming the sum for cash it says it lost after Dickinson took his business from them, as well as for the loss of confidentiality of its database.But the two men say it was not any misuse of private data that got the singer to leave CSL, but because he always had a good relationship with them and wanted to stick with them.The court heard Mr Daniel had been a senior director of CSL, while Mr Leighton-Pope had been a sub-agent, particularly in connection with its business with Dickinson.Mr Daniel had worked with Dickinson as a CSL agent for his speaking tours, but the singer subsequently moved to D&amp;A Associates, which CSL say was due to breaches of the terms of Mr Daniel's contract of employment to not divert business away from his former employer.",
        "CSL barrister Mark Stephens said Mr Daniel's contract had also banned him from misusing its confidential database, which included direct contact details of hundreds of its celebrity clients.Mr Leighton-Pope, who also worked with Dickinson as a CSL sub-agent, had been subject to different non-contractual obligations, including to be 'loyal' to CSL and not to exploit its confidential information.The barrister noted evidence of Mr Daniel's computer account being used to trawl its celebrity database, probably to take screenshots of their contact details.",
        "Emails also suggested that Mr Leighton-Pope had encouraged Dickinson's team to cancel events booked through CSL and 'rebook' with the 'new post-Covid company'.But the businessmen's barrister, Francis Hoar, said there was insufficient evidence to suggest that they got Dickinson's business by misusing information from the CSL database.They both had a long-standing relationship with the singer, he told the judge.'Both Mr Daniel and Mr Leighton-Pope had a long-standing relationship with Mr Dickinson and the evidence suggests that Mr Dickinson and the businesses that worked with him wanted that relationship to continue, notwithstanding the termination of his employment with CSL,' said Mr Hoar.'To suggest that their engagement with Mr Dickinson and his agents and businesses with whom he worked was caused by their unlawful retention of CSL's database would, given the nature of their relationship, be absurd.'",
        "The judge reserved his judgment until a later date."
    ]
}