{
    "articleURL": "/wires/reuters/article-12052101/Israel-hoping-breakthrough-Saudis-US-security-advisor-visit-official.html",
    "content": [
        "JERUSALEM, May 5 (Reuters) - Israel is hoping for a breakthrough this weekend in efforts to normalize ties with Saudi Arabia during White House national security adviser Jake Sullivan's visit there, a senior security official said on Friday.",
        "The head of Israel's National Security Council, Tzachi Hanegbi, spoke on Wednesday with his counterpart Sullivan, who is set to travel to Saudi Arabia on Saturday. Sullivan is expected to meet with Saudi Crown Prince Mohammed bin Salman, Hanegbi said.Announcing his trip on Thursday, Sullivan said Washington was working hard to normalize relations between Israel and Saudi Arabia - a major goal set by Israeli Prime Minister Benjamin Netanyahu who briefly joined Sullivan's video call with Hanegbi.\"We are very, very hopeful that there will be a breakthrough during his visit there,\" Hanegbi told Reshet 13 News.Asked whether a breakthrough would be a phone call between Saudi leaders and Netanyahu, Hangebi said: \"There are those who say that there have been more than phone calls between Saudi and Israeli leaders. But what is important is that the United States lead a move adding Saudi Arabia to the Abraham Accords - normalization and peace with Israel. If that happens it will be a historic turning point.\"Former President Donald Trump's administration in 2020 brokered the historic peace deal knownas the Abraham Accords,which included the normalization of diplomatic relations between Gulf allies the United Arab Emirates and Bahrain with Israel, all of which share security fears over Iran.While Saudi Arabia signalled approval of the 2020 accords, it has held off on following suit, saying Palestinian goals for statehood should be addressed first.",
        "Any such prospects have been clouded, however, by Riyadh's strains with U.S. President Joe Biden, its recent fence-mending with regional rival Iran, and the rise of Netanyahu's hard-right Israeli government.(Reporting by Maayan Lubell Editing by Chris Reese and Leslie Adler)"
    ]
}