{
    "articleURL": "/wires/pa/article-12054635/Ross-County-beat-Livingston-pick-valuable-win-fight-against-relegation.html",
    "content": [
        "Ross County picked up what could be a vital three points in their fight to avoid relegation with a 2-0 victory over Livingston.",
        "Going into the weekend four points adrift at the bottom of the table, County knew they could not afford to lose against Livi and goals in either half from Alex Iacovitti and Alex Samuel secured a valuable win.Livingston finished the match with 10 men after substitute Kurtis Guthrie was dismissed following a VAR review with eight minutes to go.The stakes involved for the Staggies perhaps had an impact on how they started the match, as it was the visitors who did most of the probing.Certainly it was Livingston who had more possession across the opening 20 minutes, but without much substance as Ross Laidlaw in the home goal barely got a touch of the ball.Slowly, County then started to find something of a rhythm.",
        "Some neat footwork from Victor Loturi just inside Livingston’s box beat his man, but his low cross was cleared off the line by Morgan Boyes.Bruce Anderson – County’s conqueror the last time these two met in Dingwall – fashioned a shooting opportunity for himself at the edge of the box in response, but could only clip the side-netting.Simon Murray then should have scored for the hosts when he met Yan Dhanda’s cross at the back post, only for a combination of Nicky Devlin and the woodwprk to deny him.",
        "However, a similar ball from Dhanda five minutes before half-time led to the breakthrough, as Iacovitti made the most of being totally unmarked to head into the far corner.County would then make it 2-0 on the hour mark.Just beforehand, manager Malky Mackay made a triple substitution that involved Samuel coming on, and he would score his first goal for the club.Again it was Dhanda who provided the assist, crossing for the Welshman to open his account over 20 months after moving to Dingwall – and having spent 10 months on the sidelines with a cruciate injury.While that gave County a comfortable lead on the scoreboard, things would go from bad to worse for the visitors in Dingwall in the 82nd minute.Guthrie, not long introduced as a substitute himself, was initially shown a yellow card for catching Keith Watson in the face, but on review by VAR it was upgraded to a red for violent conduct.That meant it was a comfortable end to the match for County, who closed the gap at the bottom to a single point with results elsewhere."
    ]
}