{
    "articleURL": "/wires/reuters/article-12050599/Italy-wants-French-apology-migration-insults.html",
    "content": [
        "By Alvise Armellini and Elizabeth Pineau",
        "ROME, May 5 (Reuters) - France must apologise to end a dispute over over what Rome considers insulting remarks, including some over its handling of immigration, Italy's foreign minister said on Friday, while also signalling the spat might be short-lived.The minister, Antonio Tajani, called off a visit to Paris at the last minute on Thursday after French Interior Minister Gerald Darmanin said Italy's right-wing Prime Minister Giorgia Meloni had been \"unable to solve the migration problems on which she was elected\".Darmanin, whose own government is under pressure from the far right over immigration and a deeply unpopular pension reform that will see the French work longer, added that Meloni was \"lying\" to voters that she could end the migrant crisis.Tajani called the remarks \"insults\" against Italy and Meloni.\"If someone offends in a gratuitous manner, the least they could do is apologise,\" Tajani told Il Corriere della Sera newspaper. \"In this case, he offended all Italians, as well as the government and the prime minister.\"Immigration is a hot-button topic between France and Italy, partners in the European Union whose visions of the world were similar under under Mario Draghi's leadership but have diverged since Meloni took office in October at the head of a nationalist, conservative government.",
        "Darmanin is close to French President Emmanuel Macron and lashed out at Rome last November, accusing Meloni's government of being \"selfish\" for refusing to let a charity rescue ship dock in Italy, forcing it to head to France instead.Darmanin on Thursday compared Meloni to far-right French leader Marine Le Pen, a political foe of Macron. \"The extreme right has a vice. That of lying to the population,\" Darmanin said.\"That's typical Darmanin. Macron likes to have someone who can play bad cop on the right so he can play good cop on the European stage, and because it allows him to show centre-right voters that you can be pro-European and hard on immigration,\" said Bruno Cautres of the Sciences-Po university.France was swift on Thursday to issue a statement in which it sought to reassure Rome of its willingness to work closely with Italy, but that was not enough to persuade Tajani to travel to Paris.Government spokesman Olivier Veran sought to defuse tensions, telling CNews on Friday he was sure there had been no desire on the part of the Darmanin to ostracise Italy.Tajani later told RAI public television that Paris appeared to have understood that \"a serious mistake was made\".\"On our part there is no intention to break off relations or have negative relations with France,\" he said. \"I hope this polemic may soon be over.\"",
        "(Reporting by Alvise Armellini in Rome and Elizabeth Pineau in Paris Editing by Robert Birsel and Frances Kerry)"
    ]
}