{
    "articleURL": "/wires/pa/article-12038477/Police-investigate-Just-Stop-Oil-activist-involved-collision-car.html",
    "content": [
        "Police are investigating after a Just Stop Oil protester appeared to have been injured by a car which ran over their foot.",
        "The incident happened at the latest slow march by the group, which has been happening every day for two weeks across London.In a video posted to Twitter, an activist holding a Just Stop Oil banner and wearing an orange high-vis jacket is seen standing in Holloway Road in Islington, north London, in front of a grey Renault, before falling down on to the street.Two other activists are seen helping the injured campaigner, with one repeatedly asking “are you all right?” and the other saying “it’s gone over her foot, it’s gone over her foot”.A fourth Just Stop Oil supporter then calls out the driver’s licence plate using a megaphone.A spokesman for Just Stop Oil told the PA news agency that they received “a lot of support and encouragement” from people who witnessed the incident.",
        "“After weeks of inflammatory language from politicians and right-wing media personalities, a car has finally rammed into a peaceful protester,” the group said.“We understand that the supporter in question is doing OK, and as far as we know has not required medical assistance.“We will get off the road when the Government makes a meaningful statement to end new oil and gas.”Deputy chairman of the Conservative Party Lee Anderson clashed with Metropolitan Police Commissioner Sir Mark Rowley over the force’s handling of the protests when he appeared before the Commons Home Affairs Committee on Wednesday.",
        "Mr Anderson told Sir Mark to “leave his ivory tower” to deal with protesters in Westminster, and he wrongly said the activists could be arrested for obstructing the highway.Sir Mark said he was “making selective comments based on a partial understanding of the law”, adding: “The law is very clear that protest is disruptive, and to a certain extent, that is allowed.”Scotland Yard said in a statement: “Police are appealing for witnesses and dash cam footage after a person was involved in a collision with a vehicle on Holloway Road, Islington, whilst engaged in a protest, at around 10am, today Tuesday May 2.“The incident was brought to police attention after being circulated on social media and shows the person being involved in collision with a grey Renault Megane.“If you were the person or have any information about the incident please report by calling 101, tweeting @MetCC or online at www.met.police.uk.”Slow marches are a disruptive but legal form of protest that the police have little power to break up.However, a number of marchers were removed from roads near Parliament Square on Tuesday after police issued Section 12 conditions, which allows officers to stop public processions where there is a risk of “serious public disorder”.Metropolitan Police Commander Karen Findlay, who leads the force on public order policing, earlier tweeted: “We are aware of a further two groups of Just Stop Oil protestors slow marching in Parliament Square (different group to previous one) and Grosvenor Square. Police are on scene. Sec 12 conditions and directions to get immediately onto the pavement issued.”",
        "Just Stop Oil has been obstructing roads in central London as part of its slow march campaign, launched on Monday April 24, to “demand an end to new UK oil and gas projects”.The Met Police said there have not been any arrests in connection with these protests.The force said it “attended several sporadic demonstrations across central London by Just Stop Oil” on Tuesday, adding that “police continue to monitor the situation and are ready to act should further protests by Just Stop Oil occur”."
    ]
}