{
    "articleURL": "/tvshowbiz/article-12045869/Gwyneth-Paltrow-admits-not-prepared-daughter-Apple-learning-sex-aged-11.html",
    "content": [
        "Gwyneth Paltrow has confessed she was 'not prepared' for her daughter Apple learning about sex, aged 11.",
        "The actress, 50, who shares the 18-year-old as well as son Moses, 17, with her ex-husband Chris Martin, initially welcomed her eldest child's school teaching sex education.But Gwyneth admitted she didn't think teachers would go into as much depth and detail as they did.Speaking to Alex Cooper on the Call Her Daddy podcast, she said: 'I remember my kids both went to this fantastic elementary school here in Los Angeles after we moved back from London. And they taught them sex-ed in the sixth grade.'I was really not prepared for the information they came home with.' ",
        "The Goop founder admitted she will 'never forget' the stunned expressions on Apple and her friend's faces as they struggled to process what they had learned at school.She laughed: 'I will never forget Apple and her best friend Emily sitting at our kitchen banquet in shock, like, the colour drained from their face.'They taught them everything. Everything. Anything you're thinking, they taught like the 11, 12 year olds. They're like, \"Do people do this?\"'Elsewhere on the podcast, the Iron Man star admitted she knew as soon as she met Chris that they would have children together because their connection was like nothing she'd ever felt.She said: 'When I met him, there was a very deep thing there. And I couldn't quite put my finger on it because it felt very different than my other relationships.",
        "'It's not so much that the relationship itself turned out to be healthier than my other relationships. It's just that I think I had this deep calling on some level.'I knew he was going to be the father of my kids, maybe or something. It was a very strong feeling.'Earlier this year, Apple made her Paris Fashion Week debut sitting front row at Chanel's Haute Couture Spring/Summer 2023 show.",
        "She even talked to Vogue magazine, a publication her mother has appeared on the cover of many times.In the story, the Los Angeles based teen described her style as 'a mix of classic '90s and cool grandpa.'The 1990s is when her mom Paltrow was at the height of her movie star fame and when she won the Oscar for Shakespeare in Love.It also also when mom had headline-making romances with Brad Pitt and Ben Affleck.Apple opened up about her relaxed style after wearing a classic Chanel minidress and matching jacket to the prestigious catwalk event.She told Vogue: 'I love sweaters and oversized cardigans, loafers, and a good pair of comfy Levi's.'The most important thing for me is feeling like my genuine self when wearing an outfit; I'm aiming for a mix of classic '90s and cool grandpa,' the high school graduate said.",
        "Apple added: 'My favorite part of the look was the combination of the loafers and the minidress. It's something that felt very true to my own style.'In 2020, Gwyneth enlisted her daughter to model her new G. Label Core Collection clothing line.The Goop founder's teenaged girl modeled the new clothes alongside her mother in pieces that Gwyneth deemed 'comfortable' but 'cool and elegant'.She said: 'It's what G. Label does best. Pieces that feel comfortable but look really cool and elegant.'Speaking about the pair of jeans and skirt, the 'Moonlight and Valentino' star added: 'We made both of these retro styles out of vintage-soft denim that's got a bit of stretch but still holds you in.'The jeans are '90s, the skirt is straight out of the '70s, and the looks are as enduring as it gets. Heels, sandals, or barefoot like my daughter, Apple - you can wear them with anything.'"
    ]
}