{
    "articleURL": "/sport/football/article-12039059/Jamie-Carragher-SLAMS-embarrassing-Chelsea-Arsenal-score-three-goals-half.html",
    "content": [
        "Chelsea conceded three first half goals on Tuesday in their latest poor showingThey lost their sixth successive game under Frank Lampard since his returnThe game finished 3-1, leaving the Blues 12th in the Premier League tablleJamie Carragher has ripped into Chelsea following their first-half capitulation against Arsenal.",
        "The Blues conceded three goals inside the first 40 minutes as their struggles continued under Frank Lampard, with the game finishing 3-1.Martin Odegaard netted twice before Gabriel Jesus added a third to send Lampard's side on their way to their sixth consecutive defeat under the former midfielder.Speaking on commentary during the game on Sky Sports, Carragher branded Chelsea 'embarrassing' as he reflected on how far they have fallen as a side.They are 12th in the Premier League table, nine points ahead of relegation with four games remaining. ",
        "‘Absolutely superb from Arsenal and absolutely shocking from Chelsea,' Carragher said following Jesus' strike. 'This club is an absolute mess. 'This could get an awful lot worse unfortunately for Lampard and his staff and supporters. Ben White puts the ball in, so easy to bring it down at that back post. 'It’s embarrassing from Chelsea. It’s like five a-side. Three of them sat on their backsides. It sums Chelsea’s season up.",
        "'To see how far they have fallen in these last 12 months is astonishing.' Karen Carney had mentioned Chelsea's solid defensive record before the game, suggesting there is a foundation for the club to build on next season despite their struggles.The Blues collapsed, however, and Carney slammed the Blues defence before Carragher slammed Todd Boehly's approach to building the Chelsea squad.",
        "‘I can’t believe at the start we were talking about them being good defensively,' Carney said. 'It has been anything but that.’‘It tells you spending all the money you have is nonsense,' Carragher added. 'You need to create a connection. Todd Boehly, the plans and ideas he had, it doesn’t work doing that.’'They still have quality players on the pitch. To lose six games on the bounce is not acceptable. To think of the success this club has had. Since Arsenal last won the title Chelsea have won 19 trophies. 'Chelsea expect the best, expect standards. This is a million miles away from it.’"
    ]
}