{
    "articleURL": "/wires/aap/article-12055231/A-powerful-voice-bush-CWA-tackles-big-issues.html",
    "content": [
        "When the Country Women's Association met at the Red Rose tea rooms in Bathurst, they condemned the closure of banks, called for more female leaders in the health system and better funding for nurses in remote areas.",
        "\"If any woman from Sydney to Perth or Darwin to Adelaide cried out for help, let us help her,\" one member said in support of bush nurses, to cheers and applause.\"We must raise money to help these noble women.\"It's more than 90 years since a local newspaper captured this stirring scene from a CWA conference in the central western NSW town in 1931.Other than women no longer using their husbands' full names and the end of the Red Rose, little else has changed as the formidable association continues to push for equality in the regions.When the CWA of NSW once again meets in Bathurst on Monday for its annual conference, about 600 members will consider motions like protecting koala habitats and sponsoring international nurses to work in the bush.The Nowra branch is calling on governments to urgently address the national housing crisis, as the Shoalhaven region's rental vacancies dip to distressing lows.Branch president Ellen Jennings said women were under particular strain, particularly First Nations families, those who live with disabilities or who are trying to escape abusive relationships.\"Many women have little or no superannuation, having been carers for a large part of their adult lives, putting them into financial stress, especially as they get older,\" Ms Jennings told AAP.",
        "She said housing had long been neglected by state and federal governments, a source of shame in a wealthy nation.\"When the CWA speaks, governments should listen and take it on board. This is a social justice issue.\"The women of the Collie branch, north west of Dubbo, will put forward a motion for dedicated palliative care units in every regional hospital.Secretary Helen Murray's husband was moved between several wards at Dubbo hospital during the final days of his life one year ago.\"It was horrible, just horrible, and my case wouldn't be an isolated one,\" Mrs Murray said.The Collie branch is made up of about nine women, who cater local events and raise money for the upkeep of their beloved hall.\"The CWA is there for friendship and that's how it was formed, for isolated women way back when.\"Like-minded women could talk over their issues and be comforted, so it's carried on.\"The conference will hear from several keynote speakers, including Sober in the Country founder Shanna Whan and NSW police rural crime boss Cameron Whiteside.Detective Chief Inspector Whiteside said it was a chance to connect with women who often oversee the safety and security of family farms and communities.\"They play such an important role,\" Inspector Whiteside said.",
        "\"The influential voice that women have on the land is quite powerful.\""
    ]
}