{
    "articleURL": "/wires/pa/article-12060599/Joanna-Cherry-threatens-sue-comedy-club-cancelled-Fringe-event.html",
    "content": [
        "Joanna Cherry has threatened to sue a comedy club after it cancelled the Edinburgh Festival Fringe show she was set to appear in because of her views on trans rights.",
        "Lawyers acting for the SNP MP wrote to the The Stand Comedy Club on Monday demanding the venue issue a statement acknowledging it “has acted unlawfully by discriminating against our client”, apologise, and reinstates the August event, and if not legal action would begin.The Edinburgh South West MP said: “I am prepared to take whatever legal action is necessary to vindicate my right to not be misrepresented and not to be discriminated against.”The club had been set to host an event in which the MP was to be interviewed, as part of a series of In Conversation… shows, but the Stand said “key operational staff” had raised concerns about the MP’s views and made clear they did not want to work at the event.Ms Cherry has been a vocal critic of the Scottish Government’s gender recognition reforms.The Stand Comedy Club has been approached for comment.",
        "Announcing the threat to take legal action, unless they agreed to the “reasonable requests”, Ms Cherry said the action was “not about money”.“My primary goal is to have the actions of The Stand acknowledged as unlawful and to ensure the event proceeds,” she said.“I have asked The Stand to apologise to me too. If they don’t agree with my reasonable requests, I intend to ask the court to decide on the issue.",
        "“I hope that my actions in defending myself will give courage to everyone particularly women who wish to express views on legitimate issues of public interest.“That, after all, is the very job of a politician and one of the reasons I entered politics in the first place.”Ms Cherry, herself a King’s Counsel, said she had been “greatly heartened by the support” and that she had “received the opinion of the eminent and leading human rights advocate Aidan O’Neill KC who considers that The Stand have acted unlawfully”.“The actions of The Stand and all that has followed thereon are symptomatic of a wider problem in our society. I am very concerned that those who hold perfectly legitimate views on a variety of issues, including women like me, are regularly being misrepresented, de-platformed and, in some cases, facing damage to or the loss of our livelihoods,” she said.“This is often accompanied by online abuse and threats.“The debate on gender self-identification is a very important one which must be allowed to take place, but I am a woman of many parts who was engaged to talk about my political life in general and I see the cancelling of my one-hour event as the thin end of the wedge.”Last week, the club, co-founded by SNP MP Tommy Sheppard, said: “Further to our previous policy statement on this matter, following extensive discussions with our staff it has become clear that a number of the Stand’s key operational staff, including venue management and box office personnel, are unwilling to work on this event.",
        "“As we have previously stated, we will ensure that their views are respected.“We will not compel our staff to work on this event and so have concluded that the event is unable to proceed on a properly staffed, safe and legally compliant basis.”"
    ]
}