{
    "articleURL": "/wires/reuters/article-12050769/PSG-boss-Galtier-says-not-decision-suspend-Messi-condemns-fan-protests.html",
    "content": [
        "PARIS, May 5 (Reuters) - Paris St Germain manager Christophe Galtier said he had nothing to do with the club's decision to suspend Lionel Messi while he also condemned the Ligue 1 side's fans for staging protests outside Neymar's house.",
        "French media reported that Messi was suspended for two weeks after an unauthorised trip to Saudi Arabia when he was supposed to train with his team following their 3-1 defeat at home to Lorient in the league on Sunday.Messi has received a formal offer to join Saudi Arabian club Al-Hilal next season, a source close to Argentina's captain told Reuters, with a contract renewal at PSG not on the cards for the World Cup winner who turns 36 next month.\"I was informed by the board at the start of the week of the decision to suspend Messi. When I was informed, I had the responsibility of not commenting on it,\" Galtier told a press conference ahead of Sunday's game at Troyes.\"I'm employed by the club and that is my role... The decision was nothing to do with me. I was informed of the decision.\"Leo's suspension has added to poor performances, we can't hide behind that... I can't say it has been a pleasant period. There's a target to achieve, players are working hard. We are focused and committed.\"PSG lead the standings but last weekend's loss has reduced the advantage over second-placed Olympique Marseille to five points with five games left this season.PSG's dip in form this year, especially after they were knocked out of the Champions League in the last-16 in early March, has been a cause for concern for supporters.",
        "Galtier's side were unbeaten in all competitions until December but have since lost nine games, with fans protesting outside Neymar's home this week chanting for him to leave.The Brazilian has been ruled out for the rest of the season after ankle surgery in March but Galtier declined to comment on whether the forward would be at the club next season.PSG condemned the fans' actions while Galtier said it was unacceptable for supporters to protest outside a player's house.\"Regarding the protests in front of a player's home, we have to be careful with that. Private life must remain private,\" he said.\"I can understand the anger, the disappointment of our fans. You may protest at the training ground or at the PSG office or after a match at the Parc des Princes.\"But I cannot accept it at anyone's house - whether it's Neymar or anyone else.\" (Reporting by Rohith Nair in Bengaluru; Editing by Ken Ferris)"
    ]
}