{
    "articleURL": "/wires/ap/article-12038925/Upon-review-Fox-sets-viewer-record-Super-Bowl.html",
    "content": [
        "Upon further review, this year's Super Bowl ended up setting a viewer record.",
        "Nielsen released a revised number of 115.1 million for Fox Sports' broadcast of the Kansas City Chiefs' 38-35 victory over the Philadelphia Eagles in February.The previous record was the 2015 game between New England and Seattle at 114,442,000 viewers, not including streaming. It also supplanted the 2017 Super Bowl between Atlanta and New England (113,668,000) as the most-watched of Fox´s 10 Super Bowls.Nielsen revised this year's original figure of 113.1 million by 2 million after a review that revealed encoding irregularities as well as issues with out-of-home measurement.\"I really appreciate their diligence in conducting the review and coming to the most correct number possible. Super Bowl Sunday is the most difficult day for them because you have not just the scale but people are watching on English and Spanish, in and out of home, online and all of that has to be stitched together into a credible number. I give them credit for acknowledging the issue, being transparent about it and get to the most correct number they can get to,\" said Fox Sports Executive Vice President Michael Mulvihill, who is head of strategy and analytics.The review was initially triggered when NFL Network was credited with over 1 million viewers during the game at a time when their usual number is 80,000. A second review found errors with out-of-home measurement.",
        "The total includes the broadcasts on Fox and Fox Deportes as well as streaming on Fox and the NFL´s digital sites.\"It was a little deflating when it seemed like we didn't get the record but now that we know that we did, it's validating. It gives us pride in the year that we had,\" Mulvihill said.The numbers for Rihanna´s halftime show were also revised from 118.7 million to 121 million.___AP NFL: https://apnews.com/hub/nfl and https://twitter.com/AP_NFL"
    ]
}