{
    "articleURL": "/wires/reuters/article-12053305/Tigers-add-win-streak-opener-vs-sliding-Cardinals.html",
    "content": [
        "Javier Baez hit a two-run homer and Riley Greene added a two-run double to power the visiting Detroit Tigers past the St. Louis Cardinals 5-4 on Friday.",
        "By taking the opener of a three-game interleague series, the Tigers won their fourth straight game. The Cardinals lost their seventh game in a row.Detroit starting pitcher Matthew Boyd (2-2) allowed three runs on five hits in six innings. He struck out six and walked one.Alex Lange struck out three in a scoreless ninth inning to earn his sixth save.Cardinals starter Jordan Montgomery gave up two runs on six hits in six innings. He fanned six and walked one.Reliever Jordan Hicks (0-3) took the loss after yielding three runs in two-thirds of an inning.Cardinals manager Oliver Marmol and bench coach Joe McEwing were ejected in the ninth inning by plate umpire Junior Valentine for protesting balls and strikes.The Tigers jumped to 2-0 first-inning lead when Andy Ibanez hit a one-out double and Baez launched his two-run homer to left field.Andrew Knizner cut Detroit's lead to 2-1 with a homer to left-center in the third.St. Louis' Paul Goldschmidt triggered a two-run rally with a leadoff double in the fourth inning. Willson Contreras dropped a popup single between three fielders in right field, and he took second on the throw to third base.Nolan Arenado drive in Goldschmidt with a groundout, and Dylan Carlson scored Carlson with a fielder's-choice grounder to put the Cardinals up 3-2.",
        "The Tigers retook the lead with three runs in the seventh inning. Hicks walked Zach McKinstry leading off, then he hit with a pitch Matt Vierling with one out. Greene followed with a two-run double to right, and Eric Haase drew a two out walk.Spencer Torkelson greeted reliever Giovanny Gallegos with an RBI double to make it 5-3.With two outs in the eighth inning, St. Louis' Juan Yepez and Paul DeJong hit singles and Lars Nootbaar delivered a ground-rule double to cut Detroit's lead to 5-4.Goldschmidt doubled to lead off the ninth before Lange struck out Contreras, Arenado and Carlson.--Field Level Media"
    ]
}