{
    "articleURL": "/wires/reuters/article-12052857/Wall-St-Week-Ahead-U-S-consumer-price-data-test-feared-stagflation-scenario.html",
    "content": [
        "By David Randall",
        "NEW YORK, May 5 (Reuters) - Fears of stagflation are percolating on Wall Street, as investors await data that could shed light on whether the Federal Reserve is succeeding in tamping down inflation without badly hurting growth.Stagflation - a combination of stagnant growth and persistent inflation that dogged the U.S. in the 1970s - dims the appeal of both equities and bonds, leaving investors fewer places to earn returns.While far from assured, the scenario has loomed large in investors' minds as last year´s inflation surge forced the Fed to launch an aggressive monetary policy tightening cycle that many expect to bring on a recession. Some also believe the recent banking sector tumult will hurt lending and further constrain growth, forcing the Fed to cut rates before inflation is tamed.April´s survey of global fund managers from BoFA Global Research showed stagflation expectations near historical highs, with 86% saying it will be part of the macroeconomic backdrop in 2024.Next week´s consumer price data for April, due on Wednesday, May 10, could offer a clearer picture of whether the Fed´s interest rate increases are cooling inflation. A strong number could weigh on a rally that has lifted the S&amp;amp;P 500 nearly 8% this year.\"Stagflation is a growing concern,\" said Phil Orlando, chief equity market strategist at Federated Hermes. \"Inflation is a lot higher than the Fed thought it would be, and it´s coming down at an extraordinarily slow pace while we think the economy has already hit its high water mark for the year.\"",
        "U.S employment data on Friday showed hourly wages grew in April at an annual rate of 4.4%, too strong to be consistent with the Fed's 2% inflation target. Growth remained robust, however, with job creation accelerating and the unemployment rate falling to a 53-year low.Still, bets in futures markets continued to show traders pricing interest rate cuts later this year. Policymakers have insisted they will keep rates at around current level for the remainder of 2023 after raising them another 25 basis points this week.Jose Torres, senior economist at Interactive Brokers, believes the U.S. will fall into recession later this year. Factors including higher commodity prices and a shift to local supply chains from global ones are likely to keep inflation elevated even as growth declines, Torres said.He has become more bullish on dividend paying stocks in sectors such as utilities, expecting the extra income to buttress returns as inflation weighs on equity valuations and the S&amp;amp;P 500 treads water.\"The Fed made the mistake of being too accommodative for too long,\" Torres said. \"It will take more time than the market expects to get the U.S. back to being a 2% inflation country.\"Consumer prices rose by 5.0% in March, far above levels seen over most of the past decade though down from last June's peak of 9.1%. U.S. economic growth slowed more than expected in the first quarter, while activity in the manufacturing sector remained depressed last month.",
        "Past episodes of stagflation have weighed on stocks. The S&amp;amp;P 500 fell a median of 2.1% during quarters marked by stagflation over the last 60 years, while rising a median 2.5% during all other quarters, according to Goldman Sachs.Quincy Krosby, chief global strategist at LPL Financial, has been buying gold. Prices for the metal, a popular inflation hedge and haven during uncertain times, have surged to a near record high this year, lifted by geopolitical worries and a looming showdown over the U.S. debt ceiling.\"It looks to me that gold is sniffing out a tinge of stagflation,\" said Krosby, who has also added positions to equity sectors she expects to better weather economic turbulence, such as consumer staples.Other investors were more optimistic, believing growth will hold up.Charlie McElligott, managing director of cross-asset macro strategy at Nomura Securities, pointed to the Atlanta Fed's GDPNow estimate, which is projecting a 2.7% growth rate in the second quarter, up from 1.8% on May 1.At the same time, expectations that the Fed is unlikely to raise rates much higher has created a better backdrop for investors, he said.\"Everybody is positioned for the end of the world, but when you know that the Fed is out of the hiking game ... it´s a much sturdier footing for investors than anybody anticipated at this point in 2023,\" he said. (Reporting by David Randall; Editing by Ira Iosebashvili and David Gregorio)"
    ]
}