{
    "articleURL": "/health/article-12050993/The-calorie-party-food-favourites-Experts-warn-buffet-food-packed-nasties.html",
    "content": [
        "Bitesize pork pie snacks contain almost 100 calories and packed with saltOne serving of quiche can have more calories than a McDonalds Cheese Burger Dietitians warn it's easy to over eat picnic food that are high in caloriesHow are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.uk Millions of Brits will be partaking in street parties this weekend.",
        "Supermarkets have reported that quiches, pork pies and scotch eggs are flying off the shelves due to the so-called 'coronation effect'.But you might want to avoid scoffing quite as much buffet food this weekend, as just one serving of quiche can have more calories than a McDonalds Cheese Burger.And a single pork pie is packed with more saturated fat than a large portion of McDonalds fries.On top of being packed with calories and saturated fat, a MailOnline audit found that an M&amp;S Quiche Lorraine also contains more salt than three packs of Walker's Ready Salted Crisps.",
        "This website looked at the nutritional content of hundreds of quiches, pork pies, scotch eggs and sausage rolls sold at the UK's major supermarkets.The audit revealed that, per 100g of quiche, Morrisons goats cheese and caramelised onion option (£3.99) was the worst offender, containing 373 calories.It is also packed with 13.6g of saturated fat — that's around 4g more than in a McDonalds Big Mac. A Picard Lorraine Quiche (£4.50), sold on Ocado, was also one of the most fattening options, containing 267 calories.It also has 1.1g of salt — the same amount as three Mozzarella Dippers at McDonalds.A Higgidy smoked bacon and cheddar quiche (£2.36), sold at Waitrose, has 273 calories and contains 0.76g of salt in just 100g.",
        "¿ Eat at least 5 portions of a variety of fruit and vegetables every day. All fresh, frozen, dried and canned fruit and vegetables count¿ Base meals on potatoes, bread, rice, pasta or other starchy carbohydrates, ideally wholegrain¿ 30 grams of fibre a day: This is the same as eating all of the following: 5 portions of fruit and vegetables, 2 whole-wheat cereal biscuits, 2 thick slices of wholemeal bread and large baked potato with the skin on¿ Have some dairy or dairy alternatives (such as soya drinks) choosing lower fat and lower sugar options¿ Eat some beans, pulses, fish, eggs, meat and other proteins (including 2 portions of fish every week, one of which should be oily)¿ Choose unsaturated oils and spreads and consuming in small amounts¿ Drink 6-8 cups/glasses of water a day¿ Adults should have less than 6g of salt and 20g of saturated fat for women or 30g for men a daySource: NHS Eatwell Guide  ",
        "In a day, adults are advised to consume no more than 6g of salt.The most calorific pork pie on offer was an Melton Mowbray option sold at Waitrose (£1.80), which are 75g and contain 291 calories each.They are also packed with 7.2g of saturated fat and 0.66g of salt. ",
        "It recommended daily calories in take is 2,000 calories for women and 2,500 for men.That means if you at just two of these pork pies you would have consumed about a quarter of your daily intake. While the pork and chroizo pies at Asda (£2.50) are only 25g per tiny pie, they are 95 calories each, making it easy to consume hundreds of calories.For scotch eggs, one of the worst offending products in the audit is sold by Waitrose.The summer scotch egg (£3.50) weighs 140g and contains 438 calories. The snack also has 10.2g of saturated fat, which is more than a third of a man's daily recommended intake of 30g and half of a woman's which is only 20g. Smaller scotch eggs can be about 50 calories per bite size snack.For example, the Tesco mini savoury eggs (£1.35) are 49 calories for a scotch egg that is only 21g. The sausage rolls with the most calories is the Aldi Specially Selected pork, bacon &amp; cheddar sausage rolls (£1.99) with 188 calories for a 47g roll.The Crestwood ready to eat puff pastry cheese and bacon sausage rolls sold at Aldi (£1.29) are only 30g each but contain 93 calories.  However, many of these bitesize treats do not have much sugar, with the Sainsbury's mini sausage rolls (£1.75) containing less than 0.5g of sugars in a 10g bitesize snack. ",
        "Adults should have no more than 30g of sugars a day, according to the NHS. Although some of these small picnic foods may seem like a light snack it's easy to munch on hundreds of calories without noticing. Registered dietitian Dr Duane Mellor, at Birmingham's Aston University, said: 'It is great to be able to celebrate and enjoy party or picnic foods.'However, it can be difficult to know how much we have eaten, especially when a number of our favourite foods like pork pies, scotch eggs and quiche can be high in calories, saturated fat and salt.'But he does suggest topping up your pastry and meat items with some salad, but just not the kind that's covered in fatty mayonnaise. Dr Mellor added: 'It is not always necessary to avoid these foods when partying with others, just think that perhaps only picking up one at a time.'And fill your party plate with vegetables and salad (not just the ones in creamy mayonnaise and oil based sauces with lots croutons) and fruit. 'So, that you can enjoy a range of foods, perhaps going easy on the pastry based items and topping up with fresh fruit and salad.'"
    ]
}