{
    "articleURL": "/wires/ap/article-12044117/Utah-law-requiring-porn-sites-verify-user-ages-takes-effect.html",
    "content": [
        "SALT LAKE CITY (AP) - You may soon be required to prove you´re older than 18 to watch porn in Utah, if adult websites comply with a law that took effect Wednesday.",
        "A new state law requiring adult websites verify the ages of their users took effect on Wednesday, making the state at least the second to enact an age verification law to shield kids from sexually explicit materials that have become increasingly accessible online.\"It´s part of our job as society - and maybe a subset of my job as a lawmaker - to try to protect children,\" state Sen. Todd Weiler, the measure's Republican sponsor, said. \"I´m not gonna blame all of society´s ills on pornography, but I don´t think it´s helpful when a kid is forming their impressions of sex and gender to have all of this filth and lewd depictions on their mind.\"It's currently illegal to show children pornography under federal law, however it's rarely enforced. The law is Utah's latest move to crack down on access to pornography and dovetails with lawmakers' other efforts to restrict how kids use the internet, including social media sites. It comes less than a year after Louisiana enacted a similar law and as additional states consider such policies as filters or age verification for adult websites.Dr. Eleanor Gaetan of the anti-porn National Center on Sexual Exploitation said filters and age verification were \"complementary efforts\" to limit kids' access to pornography. She noted anti-porn sentiment had grown substantially in recent years due to a \"groundswell of parents,\" including ones who have testified in statehouses throughout the country and in front of the U.S. Congress.",
        "\"The wave will continue because the harms are real,\" she said. \"These kids can't unsee what they see.\"",
        "Though heralded by social conservatives, age verification laws have been condemned by adult websites who argue they're part of a larger anti-sex political movement. They've also garnered opposition from groups that advocate for digital privacy and free speech, including the Electronic Frontier Foundation. The group argued earlier this year that it's impossible to ensure websites don't retain user data, regardless of if age verification laws require they delete it.Earlier this week, Pornhub, among the most widely viewed adult websites, blocked access to its content to protest the law. Those in Utah attempting to access the site since Monday have been greeted with a \"Dear User\" letter and accompanying video from adult film actor Cherie DeVille.\"Giving your ID card every time you want to visit an adult platform is not the most effective solution for protecting our users,\" DeVille says, reading from the letter. \"The best and most effective solution for protecting children and adults alike is to identify users by their device.\"The letter says Pornhub will \"completely disable access\" in Utah due to the law, unless a \"real solution\" is offered.It's unclear if other websites will comply.Critics, including Pornhub, argue age-verification laws can be easily circumvented with well-known tools such as VPNs that reroute requests to visit websites across public networks. They also have raised questions about enforcement, with Pornhub saying enforcement efforts drive traffic to less-known sites that don't comply with the law and have fewer safety protocols.",
        "A year after passing an age-verification requirement, Louisiana lawmakers have renewed their efforts to get adult websites to comply with its law. A follow-up measure that would subject the sites to fines for not requiring users prove their age advanced through the state House of Representatives in April.Measures have also been introduced in Arizona and South Carolina. Arkansas passed a similar age-verification law for adult websites that takes effect later this summerThe Utah law attempts to address privacy and internet data harvesting concerns by requiring websites not retain the ID information. It opens adult websites up to lawsuits if they don't verify the age of their users. It offers several age verification methods, including third-party age verification services and digital licenses that states are increasingly offering on mobile devices.It builds off years of anti-porn efforts in Utah's Republican-controlled Legislature, where a majority of lawmakers are members of The Church of Jesus Christ of Latter-day Saints. It comes seven years after Weiler - who describes himself as the statehouse's unofficial \"porn czar\" - led the charge to make Utah the first state to declare pornography a \"public health crisis\" and two years after lawmakers passed a measure paving the way to require internet-capable devices be equipped with porn filters for children. Provisions of the law delay it from taking effect unless at least five other states pass similar measures.",
        "Weiler likened the measure to Utah's first-in-the-nation law prohibiting kids under 18 from using social media between the hours of 10:30 p.m. and 6:30 a.m. and requiring age verification for social media users. He said he understands that, realistically some kids may bypass age-verification controls. But he said he wonders why opponents' arguing enforcement concerns make internet age verification laws useless haven't raised similar concerns about drivers speeding or online gambling.\"The internet was born, but it wasn't born yesterday,\" he said.__AP reporters Sara Cline in Baton Rouge, La. and Andrew DeMillo in Little Rock, Ark. contributed reporting."
    ]
}