{
    "articleURL": "/wires/ap/article-12060167/Wildfires-rage-Russias-Ural-mountains-Siberia.html",
    "content": [
        "MOSCOW (AP) - Wildfires have engulfed large areas in Russia's Ural mountains and in Siberia this week, with authorities promising to swiftly contain them.",
        "A total of over 54,000 hectares of forests in the Sverdlovsk region in the Urals were on fire as of Monday morning, according to local authorities. More than 4,800 firefighters have been battling the blaze, with some 6,000 volunteers helping them.Head of Russia's Federal Forestry Agency Ivan Sovetnikov said Monday he expected \"most major fires in the region to be contained and put out\" within two to three days. It wasn't immediately clear if such a goal was too optimistic: on Sunday night, the area engulfed in flames stood at 33,000 hectares, but it grew significantly overnight.In the neighboring Kurgan region, the fires have already destroyed more than 300 residential houses and 3,900 other buildings, Russia's state news agency Tass reported, citing local emergency officials.Kurgan Governor Vadim Shumkov said a number of people had been killed and injured by the fires, without specifying how many, and called the situation in the region \"very difficult.\" Russia's Emergency Minister Alexander Kurenkov flew out to Kurgan on Monday morning and reported that most of the fires in the region had been contained.In the Siberian region of Omsk, local authorities have declared a regional state of emergency because of the fires. Local media reported that the city of Omsk, the regional capital, has been covered with a thick layer of smoke since Monday morning.",
        "In the neighboring Tyumen region, 12 wildfires raged as of Monday morning. Tyumen authorities also declared a state of emergency on Sunday.\"Every day we register new sources of wildfires and forest fires. All this is exacerbated by very hot dry weather and strong winds,\" Tyumen Governor Alexander Moor said on Sunday.In recent years, Russia has experienced especially widespread forest fires, which experts blame on unusually dry summers and high temperatures.The experts also blame a 2007 decision to disband a federal aviation network tasked with spotting and combating fires. Its assets were turned over to the regional authorities, leading to the force's rapid decline and attracting much criticism.The government later reversed the move and reestablished the federal agency in charge of monitoring forests from the air. However, its resources remain limited, making it hard to survey the massive forests of Siberia and the Far East."
    ]
}