{
    "articleURL": "/health/article-12060295/Could-plastic-beads-banish-tennis-elbow.html",
    "content": [
        "Up to two million people in Britain at any one time have tennis elbowThousands of tiny plastic beads are being used to ease this painREAD MORE: Has Covid created a generation of germaphobes Tiny plastic beads injected into the arm could banish the agony of tennis elbow.",
        "Up to two million people in Britain at any one time have tennis elbow, which is triggered by any repetitive arm movement, including those involved in sports.As blood pours into the troubled joint, it carries inflammatory cells that can worsen any existing swelling and inflammation, aggravating discomfort and pain.In a new approach, thousands of tiny plastic beads —each no wider than a human hair — are being used to ease this pain.When injected into the artery supplying the elbow, the beads clump together, restricting the amount of blood flowing into the joint but not blocking it completely (some blood is needed to deliver oxygen and nutrients to the area to help it heal). The idea is that this partial blockage reduces the amount of inflammatory cells that can get through, dampening down the inflammation and pain.",
        "A trial of the technique involving 25 patients with tennis elbow began in March at the University of California Los Angeles (UCLA).Tennis elbow, or lateral epicondylitis, develops when tendons — tough cords of tissue that connect muscle to your bone — become damaged, often through overuse. The main symptom is pain in the outer side of the elbow, and the condition can be so crippling that it is difficult to carry out everyday activities such as driving. Even in mild cases, the pain can last two to three weeks and can spread to the upper and lower arm.",
        "Treatment includes painkillers and anti-inflammatory drugs. But many people find the pain returns once they resume the activity that caused it.Another option is steroid injections to reduce the swelling in the tendons. This can take a couple of weeks to work, and some people need two to three jabs before it is effective. Furthermore, a study in the BMJ in 2006 showed that the injections were no more effective than exercise and physiotherapy.The new procedure — called arterial embolisation — normally carried out under local anaesthetic, is already widely used for other health problems; to shrink an enlarged prostate (a common problem as men age), starve tumours of the oxygen that they need to grow, and reduce painful growths, such as uterine fibroids.Before the procedure, the number and size of the beads is carefully calculated to reduce the flow but not completely starve the elbow joint of blood. The beads, which are biocompatible (ie they are not harmful to healthy tissue) remain in the artery permanently. Potential side-effects include bleeding, infection or injury to the treated artery.In the new UCLA trial, patients with tennis elbow will undergo an hour-long infusion of tens of thousands of the plastic beads into a blood vessel supplying the elbow and have three and six-monthly checks to monitor them. The trial is expected to run until 2027.",
        "The U.S. researchers hope to replicate the results of a similar 2019 study in Japan, where more than half the 52 volunteers who had this treatment experienced significant reductions in pain and mobility.Philip Conaghan, a professor of musculoskeletal medicine at Leeds University, said blocking blood vessels in this way could also stop adjacent nerves from working properly, interrupting pain signals.'There is some rationale for this therapy but the trial will need to see if there are benefits and how long they last. It will also need to monitor side-effects as there is the potential for blood vessels supplying the skin to become blocked, which may cause the skin to thin or become ulcerated.'Injecting minuscule plastic beads into the knee can also ease arthritis, according to U.S. researchers.When 350 patients underwent the procedure, most experienced almost immediate pain relief that lasted for at least a year after the treatment, reports the journal Cardiovascular and Interventional Radiology.As with tennis elbow, the treatment works to reduce blood flow so that fewer inflammatory cells enter the damaged knee joint.Secrets of an A-list bodyThis week: Catherine Zeta-Jones' shouldersCatherine Zeta-Jones wore a shoulder-baring dress to a photo call in Hollywood last week. The mother of two, 53, stays fit by working out five times a week, with a particular focus on tap dance, ballet and hula-hooping. Her home gym has a treadmill, elliptical trainer, Peloton bike and a pool — 'I don't need anyone to motivate me,' she has said.",
        "What to try: The wall push-up will gently sculpt your shoulders and chest.Stand a few steps away from a wall, facing it, with your feet together (step further away for a greater challenge). Place your hands in a diamond shape on the wall in front of your face. Maintain a plank position, slowly bring your chest towards to the wall. Press back out.Complete ten repetitions daily —and when you feel ready to up the ante, try using one arm at a time.Try this...Dr Vegan Gut Works capsules are 100 per cent vegan and contain six strains of probiotics (with 50 billion live cultures), as well as a prebiotic to 'feed' good bacteria — with no bulking agents. 30 capsules, £26.99, drvegan,comOle drugs new tricks Existing medicines with new uses. This week: Blood pressure pills for dementiaAmlodipine has been used to treat high blood pressure for decades — it works by relaxing and widening blood vessels so that blood flows more freely, reducing the risk of clots.",
        "But in 2021, scientists at Manchester University found the drug could also halt vascular dementia, which affects around 150,000 people in the UK. This is triggered when the brain is starved of oxygen because blood vessels in the head become narrowed over time from high blood pressure.",
        "During tests on mice with vascular dementia, they found amlodipine stopped disease progression, reported the Journal of Clinical Investigation. It's thought to work by boosting activity of a protein, called Kir2.1, found in cells lining blood vessels, which helps keep blood flowing properly.The Manchester team now hopes to trial amlodipine in humans with the condition in the next couple of years. Breathlessness that lasts months after a Covid infection may be due to poor sleep and is not long Covid, reports The Lancet Respiratory Medicine. Researchers at Manchester University tracked over 600 adults who reported suffering long-Covid symptoms such as breathing difficulties and found almost two-thirds also experienced disturbed sleep after catching the virus. They believe targeting sleep disruption by reducing anxiety and improving muscle strength in these patients could alleviate their breathlessness. "
    ]
}