{
    "articleURL": "/sport/football/article-12050295/Plymouth-Arygle-right-party-League-One-promotion.html",
    "content": [
        "Plymouth Argyle secured promotion to the Championship with a win last week Boss Steven Schumacher said he would get a tattoo if they passed 100 pointsThey deserve huge credit for bouncing back from adversity to be top of the tableIt might seem bizarre to start a feature on Plymouth by discussing other teams, but bear with me.",
        "Ipswich have won 13 of their last 14 games, scoring 43 and conceding just two goals in that run to win promotion with a club-record points tally. They are not top.Sheffield Wednesday went on a barnstorming 23-match unbeaten run and can still finish the season on 96 points, a tally that would have won automatic promotion in every League One season in history. They are not top.Plymouth are. In a division populated by some behemoths of English football, Steven Schumacher's Argyle are No 1. That is testament to the young manager, chairman Simon Hallett and an exciting bunch of players thriving on a budget dwarfed by most in the league. ",
        "Sun beamed down on Devon as fans invaded the pitch to celebrate promotion, and the festivities continued into the night, making Plymouth's delightful old Barbican port a sea of Argyle green.'Schuey's at the wheel,' they sang about their boss who has steered them to the Championship against the odds - and one more win, at Port Vale on Sunday, would seal the title and take them to a staggering 101 points. 'I joked with my daughter that if we got over 100 points I would get a tattoo,' laughs Schumacher. 'And I am madly against tattoos! It'll have to be small and somewhere you can't see. These players will go down in folklore - 100 points would mean they will never be forgotten.'",
        "There have been setbacks along the way. Morgan Whittaker had nine goals and seven assists before he was recalled by Swansea in January, while goalkeeper Mike Cooper - a Devon lad tipped for a huge future - looked set to be Player of the Season before a knee ligament injury. Plymouth also suffered a bruising 4-0 thrashing by Bolton Wanderers at Wembley in the Papa Johns Trophy final. It is credit to Schumacher that they rallied so well after those setbacks.On the final day of last season, Plymouth needed to beat MK Dons to secure a play-off spot. They lost 5-0. 'I wanted to cry - it was my birthday,' adds Schumacher. 'I had to drive up to Liverpool the next day to become godfather to my best mate's son. I was devastated.'",
        "A year on, Schumacher spent his 39th birthday on Sunday drinking with family, who came down from Merseyside to celebrate. He once froze, starstruck, when meeting Mike Tyson in Beverly Hills - but knows he will soon share the touchline with household names.As a boyhood Evertonian, he prays he doesn't have to lead Plymouth out at Goodison Park in the Championship. He will, though, come up against his good pal Ryan Lowe, who he succeeded at Plymouth when the fellow Liverpudlian left for Preston in December 2021.",
        "Schumacher agrees with Mail Sport's suggestion that one of his best attributes is helping his players over setbacks. 'It comes down to honesty. We sit down as a group and chat openly. We never get too down. 'We lost Morgan and then Mike, but we never used them as excuses. 'The thing I'm proudest of is the fact that we have not lost back-to-back league games. To do that is a brilliant achievement. Getting up that next day and sticking to your principles after a loss is so important. 'I've got to be a leader and can't be seen to be too down. Keep moving forward.'Off the pitch, finances are healthy - the Pilgrims are one of few EFL clubs to operate sustainably - and chairman Hallett is doing some of the finest work in the country. ",
        "'Our goal is to make ourselves a fixture in the Championship and I think we can do that by spending what's available more smartly than most,' he told The Plymouth Herald.Fundamental to their success is making Home Park a fortress. They have won 61 points there this season - more home points than any team in the top four tiers - and tasted victory in 20 of 23 matches. They also did the double over Devon rivals Exeter.",
        "'Nobody likes coming to Plymouth anyway, but definitely not when you've got 15,000 fans screaming at you every week,' says Schumacher. 'It's been an amazing season and to finish on a sunny day in Devon - the sun's not been down here for weeks - is such a proud moment. To beat a club like Ipswich to the title would be unbelievable. We will do all we can to reach 100 points at Port Vale.'Tattoo artists of Plymouth, it might be your lucky day.NON-LEAGUE ISN'T END OF THE ROAD In the last 20 completed seasons, 37 different teams have fallen out of the Football League - 36 via relegation, plus Bury through expulsion.It is often thought that relegation to the National League is a catastrophe and, in many cases, that is correct. Of those 37, four no longer exist - at least in their original form - and seven more will likely start next season in the sixth tier or below, including Kidderminster, Boston, Chester, Darlington, Yeovil, Scunthorpe and Torquay. But plenty of good clubs have bounced back and are in a much better state now - just look at Leyton Orient, Luton and Stockport. Indeed, 16 of the 37 mentioned started this season in the Football League.",
        "Fans of those clubs will tell you it's a long road back and, while it will not soften the blow for National League-bound Hartlepool and Rochdale, relegation need not always be the end of the road.",
        "Middlesbrough v Coventry (Championship)Monday, 3pm Coventry need just a point to seal a play-off spot against all the odds, amid off-pitch turmoil. But in travelling to Middlesbrough, Mark Robins' side face a daunting task. The league's top goalscorers, Chuba Akpom and Viktor Gyokeres, go head to head.Sheffield Wednesday v Derby (League One)Sunday, 12pmThis could be a dress rehearsal for a two-legged play-off clash, with Derby needing to match Peterborough's result at Barnsley to confirm a top-six spot. Darren Moore's Owls have lost just once at Hillsborough all season.Tranmere v Northampton Town (League Two)Monday, 12.30pmBristol Rovers beat Scunthorpe 7-0 this time last year to win automatic promotion, pipping Northampton on goals scored. This time the equation is simpler for the Cobblers: match or better Stockport's result (at home against relegated Hartlepool) and they are up. But Northampton have injuries and Tranmere are handy at home.",
        "PLAYER IN FOCUS: CHRISTIAN WALTON (IPSWICH) No team has conceded fewer goals in the Football League this season than Ipswich's 33 and no goalkeeper has more clean sheets in League One than Christian Walton's 23.",
        "The Tractor Boys' keeper has shown season-on-season improvement in the last few years but, now 27, seems finally settled at a club after a series of loans.After joining Brighton as a 17-year-old, there was always hope that he'd eventually become the Seagulls' No 1 but ended up loaned out most seasons, to Bury, Plymouth, Luton, Southend, Wigan, Blackburn and eventually Ipswich.",
        "He's one of a string of EFL goalkeepers schooled at Brighton, with Carl Rushworth keeping 18 clean sheets at Lincoln this season and James Beadle, 18, impressing at Crewe before an injury.Walton is now on Ipswich's books permanently and has been scouted by a couple of clubs in the Championship top six after his impressive performances in this promotion campaign.He has a save percentage of 72 per cent and, watching scouting footage, Walton is a commanding presence with smart reflexes and capable with the ball at his feet."
    ]
}