{
    "articleURL": "/wires/reuters/article-12051437/King-Charles-royals-greet-wishers-ahead-historic-coronation.html",
    "content": [
        "King Charles to be crowned on Saturday",
        "Charles, William and Kate meet fans on The MallWorld leaders attend reception at the PalaceAcross Britain, preparations underwayPolls show many apathetic, question cost of lavish event(Updates with detail from Buckingham Palace reception)By Michael HoldenLONDON, May 5 (Reuters) - King Charles greeted excited crowds gathering for his coronation before hosting a reception for world leaders at Buckingham Palace on Friday ahead of what will be the biggest ceremonial event in Britain for 70 years.Charles, 74, and his wife Camilla will be crowned at London's Westminster Abbey in a glittering but solemn religious ceremony with traditions dating back some 1,000 years, followed by a procession, resplendent with pomp and pageantry.Royal fans have already begun camping out on The Mall, the grand boulevard that leads to Buckingham Palace, and they were rewarded when Charles and his eldest son, Prince William, and the heir's wife Kate staged an impromptu walkabout.The royals were greeted by cheers of \"hip, hip, hurrah!\" and \"God save the King!\" as they greeted the well-wishers, many of whom had travelled from across the world.\"There is not much sleeping going on, I hear,\" William told one woman in the crowd, referring to people in tents who have created a party atmosphere despite occasional heavy downpours. \"I pray you guys stay dry.\"",
        "Earlier, Charles met leaders from the Commonwealth of Nations, the voluntary associations of 56 countries which he also heads, and held a lunch for prime ministers and royal representatives from the 14 other realms where he is head of state, including Australia and Canada.Charles automatically became king when his mother Queen Elizabeth died aged 96 in September. The coronation, although not essential, is regarded as a hugely symbolic moment that legitimises the monarch in a public way.The leaders of Australia and New Zealand will pledge their allegiance to Charles at the coronation even though both are life-long republicans who do not shy away from making their positions clear.On Friday evening, world leaders and dignitaries were seen arriving at Buckingham Palace for a reception held by the king and other senior members of the royal family.The Princess of Wales, wife of heir-to-the-throne Prince William, was pictured with U.S. first lady Jill Biden, and Olena Zelenska, the wife of Ukrainian President Volodymyr Zelenskiy, at the event in a photograph released by Kensington Palace.\"It's an honour to represent the United States for this historic moment and celebrate the special relationship between our countries,\" tweeted Biden.The Princess of Wales told crowds she had met earlier that her family were \"excited, a bit nervous\" about the \"big day\".",
        "Well-wishers already camping out to bag the best spots were thrilled by the surprise royal walkabout.\"All the people who said I was mad coming, I don´t care because you can´t get that on television. Words fail me. It was just lovely,\" said Eunice Harstone, 79, after meeting the king.'MIND THE GAP'Across Britain, preparations are underway for the first coronation since 1953 when Queen Elizabeth was crowned. The king has even voiced announcements for the London underground network, using the traditional \"mind the gap\" warning to be cautious getting on and off the trains.Set against the backdrop of a cost of living crisis and some public scepticism, and in a modern era when questions are being posed about the future of the institution, Saturday's event will be on a smaller scale than 1953.Nonetheless it will be a lavish occasion. The St Edward's Crown, which weighs about 2.2 kg (4 lb 12 ounces) and dates back to 1661 and the reign of his namesake King Charles II, will be placed on Charles' head during the ceremony.Among the other historic items involved will be the golden Sovereign's Sceptre with Cross which holds the 530 carat Cullinan 1 diamond, also known as the Star of Africa and the world's largest colourless cut diamond.",
        "After the ceremony there will be a mile-long procession involving some 4,000 military personnel, with the newly-crowned King Charles III and Queen Camilla returning to Buckingham Palace in the four-tonne Gold State Coach, pulled by eight horses.Thousands are expected to line the route and millions more will watch on giant screens erected at 30 locations around Britain or at home, with the event set to be broadcast live around the world.Retailers are hoping for a boost from three days of celebrations and street parties, with the public enjoying an extra holiday on Monday. Buckingham Palace said it expected it would provide an economic lift for Britain's struggling economy.Supermarket Lidl said it had sold enough bunting to line the procession route 75 times over, and Tesco said it expected to sell enough bunting to stretch from Land's End in southwest England to the tip of Scotland. Sainsbury's said its sales of sparkling wines were up 128% year-on-year.But polls suggest far from everyone will be celebrating, with a majority of the public generally apathetic about the event. Critics have questioned the cost at a time when many people are struggling to pay bills.\"They just take everything from me. They never do a day's work,\" said Philip Nash, 68, as he swept the streets in Whitechapel, a more run down area of east London.",
        "(Additional reporting by James Davey Editing by Janet Lawrence and Frances Kerry)"
    ]
}