{
    "articleURL": "/wires/pa/article-12059825/Mixed-emotions-Salford-boss-Neil-Wood-clinching-play-spot.html",
    "content": [
        "Boss Neil Wood had mixed emotions after Salford snuck into the play-offs despite losing 1-0 to Gillingham.",
        "The ambitious Ammies pipped Mansfield to seventh place by a single goal.Cheye Alexander’s late penalty ensured a nervy end for the hosts and it got even worse when the Stags scored a late second at Colchester.But results eventually fell in their favour and they will now face Stockport in a tasty two-legged tie.“It’s difficult to take the defeat because I don’t think it was a penalty at all,” said Wood. “It’s disappointing to concede a penalty to lose the game, but if you’re looking at the overall picture, I’m very pleased.“I’m very pleased with the players for their effort and all the hard work they’ve put in all season. I think they deserve to be in the play-off spots, albeit we’ve just about got in there.",
        "“It wouldn’t be Salford if we didn’t get in that way over the last couple of weeks.“It’s the first time the club have been in the play-offs in League Two and that’s something we need to be proud of.“We’re always making improvements. It would have been nice to finish it with a win.“We were waiting on Mansfield’s result coming in. We were just stood on the pitch and a few of the staff had their apps out looking at the scores.",
        "“You’re just waiting for that full-time whistle to go and there were a few cheers from the crowd and that was the signal that we were in there.”The Gills ended the season in style with a first away win in seven.And boss Neil Harris, who has masterminded a gutsy revival, said: “I didn’t quite know what to expect because it wasn’t us last week, we were flat and lacked energy.“I thought the performance was excellent. We streamlined the squad with the players we expect to have next season and the ones we won’t didn’t travel, and that gave us a real focus.“I want to develop the group and advance the group. The club are going to try and support that with the business over the summer.“I just want us to keep moving forward and be better. I want competition for places and I want us to start well in the summer.“I want us to carry this momentum that we’ve built into the first game next season.“We’ve seen Orient celebrate on our pitch, we’ve seen Salford celebrate today, we’ve seen some good teams recently and we want a taste of that. That’s why we’re in the game.“I don’t want to big up our expectations for next year, that will come naturally. Our form in the second half of the season and the good players we’ll hopefully sign, that expectation will be there.",
        "“I don’t want to put too much pressure on that now. I want us to enjoy what we’ve achieved since January.”"
    ]
}