{
    "articleURL": "/news/article-12050289/Francis-Bourgeois-TikTok-star-counts-Prince-William-Joe-Jonas-fans.html",
    "content": [
        "Francis Bourgeois has amassed millions of followers with his loveable videos   He is the adorable TikTok sensation that shot to fame during lockdown by posting joyous trainspotting videos online. ",
        "Since his first TikTok clip, back in February 2021, excitable Francis Bourgeois has risen to social media superstardom.The 22-year-old now commands a following of millions, with his TikTok account boasting more than 2.9million fans, while his Instagram has 1.8million. On paper, his success makes little sense: trainspotting is hardly a beloved national pastime. The former University of Nottingham engineering student was even mocked for it in school. But, two years into posting, Francis now has his own Channel 4 web series and has even authored his own book about his hobby.And he now counts the rich and famous in his friendship circles, having been joined on his adventures by pop royalty Joe Jonas, French football legend Thierry Henry and most recently, William and Kate, the Prince and Princess of Wales.",
        "The TikTok star - whose real name is Luke Nicolson - lives in Battersea, London having previously hailed from Harlesdon, in the north west of the city.  Despite receiving nasty comments for his hobby while at school, Francis returned to trainspotting during the second national lockdown.  In one particular video, the enthusiastic train fan became so excited about a class 377 locomotive steaming past him that he fell out of his chair. The hilarious clip has since racked up nearly seven million views.",
        "Another video, titled 'tears of happiness' notched up a gargantuan 26.4million views on TikTok and showed the loco enthusiast watching as two rail tours crossed one another 'at exactly the same point'.'I can't quite believe this... for a railway enthusiast it's like finding a pot of gold at the end of a rainbow,' he says with a beaming smile. Francis first started watching trains go by at Willesdon Junction railway station in London.As a lad, he would then return home and draw pictures of them from memory.  ",
        "Speaking about his hobby during an interview with This Morning, he said: 'I was just fixated by these big machines.'Ever since, I've had a passion for trains, cars, planes.'He now endeavours to pursue a career in railway engineering after his success on the social platform.'I love to show how awesome trains can be as well as trying to make you smile, laugh and just try and bring joy,' he said. 'I want to contribute my passion for trains and also engineering to make the railway network a better place for everyone.'But his rise on social media has, perhaps, thrown open the door to a potential career on the catwalk. In January 2022, the 6ft 3ins TikToker was revealed as the face of the new Gucci and North Face campaign. In a clip shared by Highsnobiety,  Francis can be seen acting as a train platform announcer while travellers wearing trendy Gucci x North Face outfits board his service. ",
        "Sharing the advert, the brand wrote: 'It's full steam ahead for @gucci and @thenorthface as they take their second collaboration to the tracks with TikTok star and trainspotter @francis_bourgeois43.⁠",
        "'With the bold collection focusing on exploration and outdoor activities, there's no one better than Bourgeois to bring it all to life.'In the campaign, Francis can be seen taking payments in the ticket office and directing travellers to the platform.Meanwhile speaking to the outlet, Francis said he became interested in trains as he travelled to school each day.He explained: 'I'd be transfixed by everything going on outside the window, and I loved seeing the trains come into the platform.",
        "'From the top of the climbing frames in the playground at school, we had the best view of what is now the North London Overground line, so I remember spending all my break times there.'And while he confessed no one in his family shares his passion for trains, he has long found them fascinating. He explained: 'One of the most gratifying things is hearing about other trainspotters and their experience in school. They've said that people would bully them for their trainspotting hobby, but now they feel more confident and people respect them for it.'That's a really defining thing for me because I experienced the same thing. It isn't a cool hobby, so I didn't make it very public, and I think giving other people the power to feel like they can be confident with it is very special for me.'",
        "The North Face was founded in the US in 1968 to supply climbers and its distinctive logo celebrates a granite dome in Yosemite National Park.However in recent years it has become trendy and is now much-loved by British teenagers.Appearing on This Morning last year, Bourgeois told presenters Holly Willoughby and Phillip Schofield that he's amazed by the outpouring of love he's received on the social media platform.    He admitted to the duo that he has 'plenty of anoraks' in his wardrobe but said there's a new breed of younger, cooler trainspotters to be seen at stations up and down the country.As well as his links with Gucci, Francis has also enjoyed time on the red carpet at the NME Awards at London's O2 Academy Brixton with his girlfriend Amy Linkin.",
        "The social media sensation looked stylish in a pair of grey capri trousers and a white buttoned up shirt. The internet star stepped out in a pair of black leather loafers, while adding a hint of colour with a pair of multi-coloured socks which he wore up to his shins.  Looking ecstatic on the night, Francis found it hard to take the smile off his face as he larked around on the red carpet showing off some impressive moves. ",
        "Meanwhile, his girlfriend Amy, showcased her eye for style in a pair of polka dot tights and a little black dress. She looked elegant in the all-black ensemble as she wrapped up in a black blazer while opting for comfort on their big night, pairing the look with some buckle strap shoes.  Embracing their newfound fame, the loved-up couple went on party the night away at Oscars nightclub in Mayfair for an exclusive gathering.  ",
        "Later that year, Chloe Burrows joined Francis Bourgeois in a new clip shared by Channel Four. During her special appearance, Chloe helped Francis, 'audition' for Love Island after she appeared on the show during season seven. Chloe stripped off into a racy G-string one piece as the pair went for a swim, where Francis strutted his stuff pretending he was on Love Island.  For his bit, Francis stripped off into a pair of Transport For London Budgy Smugglers which made Chloe laugh.'They're really nice, yeah,' Chloe said with a laugh.'I suppose laughing at other people's swimwear is another part of Love Island you  don't see,' Francis said in a hilarious voice over.  ",
        "He asked Chloe if she thought he'd had a 'chance' at getting on Love Island.'I think you have loads of chance, you have to do a sexy strut [to enter the villa],' she said. ",
        "Impersonating the voice over, she said: 'Tomorrow night, a new bombshell enters the villa!' He then said he wanted to jump down from a tree into the lake for his audition. After making a splash, he said: 'Hi girls, my name is Francis, I'm 22.' Earlier on in the day, the pair went trainspotting. ",
        "And on Thursday Francis was joined by his latest fans, the Prince and Princess of Wales as they brushed shoulders with the internet royalty during a hilarious video Francis. Prince William, 40, and Kate Middleton, 41, travelled from Acton to Tottenham Court Road on the Elizabeth Line to visit the Dog and Duck pub in Soho.In attempt to reach a 'younger audience', Palace aides invited the train enthusiast - who lives in Battersea, London, and boasts over 2.9m followers on the video app - to meet the royal couple at the end of their journey.The 22-year-old social media star posted a hilarious video his interaction with Kate and William. ",
        "The short clip opens with Luke walking through the newly-refurbished Tottenham Court Road station wearing his trademark GoPro.He said: 'Have you ever found yourself at Tottenham Court station wanting to go Eastbound and the train you're wanting to get is ready to go?'Well, me too. Pretty much every time.' The TikToker then proceeds to sprint through the station as footage shows a close-up of his face filmed using the fish-eye lens. After making it on to the tube just as the doors close, Luke grabs hold of the handrail before then collapsing into an empty seat.  As he recovers from the sprint, the TikToker spots Kate and William getting ready to leave the tube. Before stepping off the train, Kate - dressed in a bespoke Eponine coat and holding a white Mulberry bag - goes to shake his hand.Beaming at Luke, Kate says: 'Very nice to meet you.' ",
        "After also being greeted by Prince William, a starstruck Luke struggles to get his words out and simply says: 'Hi. Um, nice to meet you.'I hope you enjoyed the Elizabeth Line!'Smiling at his wife, William says: 'We have, it's been good! Have a good day. See you later.'Stunned by the royal interaction, Luke then says 'cheerio' before collapsing in his seat again.Posting the clip on his social media accounts, Luke jokingly captioned the video: 'The Elizabeth line sprint at Tottenham Court Road is quite enjoyable once you get used to it!'"
    ]
}