{
    "articleURL": "/wires/reuters/article-12044045/Union-brief-striking-Hollywood-writers-TV-production-slows.html",
    "content": [
        "By Lisa Richwine and Rollo Ross",
        "LOS ANGELES, May 3 (Reuters) - Striking film and television writers met with union leadership on Wednesday, the second day of a work stoppage that has thrown Hollywood into disarray as the industry deals with changes brought on by the streaming TV boom.Members of the Writers Guild of America (WGA) turned out for briefings from negotiators in New York and Los Angeles after walking picket lines in front of Netflix Inc, Walt Disney Co and other major studios.At the Los Angeles meeting at the Shrine Auditorium, a venue that once hosted the Oscars, leaders of the Directors Guild of America (DGA), acting union SAG-AFTRA and other Hollywood unions voiced support for striking writers, according to attendees.The roughly 11,500 members of the WGA are seeking pay raises from Hollywood studios that are struggling to turn profits from streaming after spending billions in a race to add subscribers.\"Did you tell them to forgo profits for subscriptions?\" director Jon Avnet said to the crowd of writers, according to a post on the WGA's Twitter page.Avnet will be leading negotiations for the DGA, which is scheduled to begin its own talks with studios shortly before its own labor contract expires June 30. SAG-AFTRA will start contract discussions on June 7.",
        "The group negotiating with the WGA on behalf of studios said it had offered \"generous\" increases in compensation but could not agree with other demands.Television production already has been disrupted by the strike.\"Jimmy Kimmel Live\" and other late-night shows aired re-runs, and production was halted in Los Angeles for the rest of the week.Daniel Kwan and Daniel Scheinert, the Oscar-winning directors and writers of \"Everything Everywhere All at Once,\" joined dozens of people walking picket lines in front of Netflix's headquarters in Hollywood on Wednesday.\"What we are asking for is really reasonable,\" said Scheinert, a WGA member. \"So it's exciting to get out here and show that support and try to hurry this process along.\"Outside the Fox studio across town, \"Family Guy\" writer Rich Appel acknowledged anxiety among WGA members about being out of work.\"But there's also something very encouraging about a group endeavor that you believe in,\" he said. \"I don't think anybody who's striking doesn't believe that it's worth it.\"The writers are seeking changes in pay and the formulas used to compensate writers when their work is streamed, among other proposals. The WGA estimated its changes would cost about $429 million a year.The strike hit Hollywood studios at a challenging time. Conglomerates are under pressure from Wall Street to make their streaming services profitable after pumping billions of dollars into programming to attract subscribers.",
        "The rise of streaming has eroded television ad revenue as traditional TV audiences shrink.The last WGA strike in 2007 and 2008 lasted 100 days. The action cost the California economy an estimated $2.1 billion as productions shut down and out-of-work writers, actors and producers cut back spending.The Alliance of Motion Picture and Television Producers (AMPTP), which represents studios, said it had been willing to increase its compensation offer. But the group said it objected to WGA demands that \"would require a company to staff a show with a certain number of writers for a specified period of time, whether needed or not.\"Writers say changes from the streaming TV boom have made it difficult for many to earn a living in expensive cities such as New York and Los Angeles.Half of TV series writers now work at minimum salary levels, compared with a third in the 2013-14 season, according to WGA statistics. Median pay for scribes at the higher writer/producer level has fallen 4% during the last decade.The WGA also wants to prevent studios from using artificial intelligence to generate new scripts from writers' work, or asking them to rewrite material created by AI.If the strike becomes protracted, the networks will increasingly fill their programming lineups with unscripted reality shows, news magazines and reruns. It also could delay the most important season for TV in the fall. Writing for fall shows normally starts in May or June. (Reporting by Lisa Richwine, Rollo Ross and Mario Anzuoni in Los Angeles; Editing by Mary Milliken, Lincoln Feast, Diane Craft and Gerry Doyle)"
    ]
}