{
    "articleURL": "/news/article-12056101/Stan-Grant-ABC-viewers-threatened-switch-channels-King-Charles-Coronation-coverage.html",
    "content": [
        "Viewers expressed anger at 'nonsense' ABC coverage Indigenous suffering under Crown featured on show ABC viewers threatened to change channels during its 'nonsense' coronation coverage due to a panel discussion about King Charles and the monarchy.",
        "The one hour-long program titled The Coronation: A discussion about the Monarchy in 2023, focused on the relevance of the monarch to Australia.On it, the host of ABC's Q+A, Stan Grant said that the British invasion in 1788 was the start of suffering for Indigenous people.The feature, which was aired on Saturday before the Coronation, proved so polarising it caused the journalist's name to trend online during the episode.'The Crown is not above politics to us, because the symbol of that Crown was, it represented the invasion, the theft of land, and in our case, the exterminating war which next year will mark 200 years,' Grant said.'In the name of that Crown, martial law was declared on my people, Wurundjeri people, next year marking 200 years is the declaration of martial law.'A war reported at the time as an exterminating war ... We need to understand what this represents.'",
        "Grant said because of Australia's history with British invasion, Indigenous Australians would view the Coronation as a continuation of the damage created by colonialism.'It (the ceremony) holds weight for First Nations people, because that Crown put a weight on us, and we are still dealing with that,' he said.The program also discussed whether Australia should become a republic, with head of the Australian Republic Movement, Craig Foster who expressed his support for a future referendum that would remove King Charles as Australia's head of state.",
        "'It doesn't represent us culturally, it doesn't work for us, it doesn't work for us internationally, so many of our dutiful international multicultural communities have suffered under this exact colonisation process and the like, and feel deeply uncomfortable as well,' he said.'We also have a right to envision a better future, where Australians actually own our own country, and we see this conversation a lot.'On Twitter, viewers questioned whether the historical event was the right time to initiate discussions around Australia becoming a republic, with some threatening to change channels.'Didn't tune in for coverage of coronation to listen to Stan Grant and Co. to go on a pro Republic rant,' wrote one Twitter user.'Started watching the @abcnews coverage of the Coronation. They've spent ages with Nova Peris and Stan Grant rambling about colonialism and racism. Had to switch to @9NewsAUS coverage. 'A bit of that Republic nonsense, but much better,' another user tweeted.Others shared their appreciation of the coverage, and the range of opinions shared during the Coronation.'Holy s*** this was not what I was expecting from the ABC coronation coverage - Stan Grant and Craig Foster absolutely going OFF on the monarchy and the Empire and its legacy of genocide and pain,' wrote one Twitter user.",
        "'It was impressive and grown up discussion, something we don't get enough of from the media. I'm very impressed even though as a commentator Stan generally annoys me,' wrote another.'Stan grant is ripping into the crown, and it is amazing,' another user tweeted.In the aftermath of Queen Elizabeth's death, Grant was vocal in his anger towards the ABC's rolling coverage of the monarch's reign, and said he felt 'betrayed' by his employer.'When the Queen died I didn't anticipate the response that I would have, which was a visceral anger. How dare you? How dare the Queen just die and this country go into mourning?' he told Patricia Karvelas on ABC Radio National.'And I felt in my own organisation, I'm very honest about this in (my) book, a sense of betrayal.",
        "'Because the ABC, everyone donned black suits, everyone took on a reverential tone, we know that the Prime Minister on down were saying, \"This is not the time to talk about empire and colonisation, this is not the time to talk about the republic.\"'On Saturday morning, the day of the coronation, Grant also penned a brutal protest against celebrating the event.'Dare not think about this too much. Because then this illusion shatters. We would have to think of the coronation regalia and the crown of stolen jewels,' he wrote.",
        "'To take this coronation seriously would be to try to make sense of an Australian prime minister pledging his allegiance to a Crown that tried to exterminate my people.'"
    ]
}