{
    "articleURL": "/wires/reuters/article-12045761/Residents-flee-Ukraines-Kherson-Russian-strikes-warnings.html",
    "content": [
        "City of Kherson under almost constant Russian shelling",
        "Officials say 23 killed in attacks on WednesdaySome residents head to bus station to leave the cityBy Elizabeth Piper and Viktoriia LakezinaKHERSON, Ukraine, May 4 (Reuters) - It was a warning by her daughter that persuaded Alina Fil to leave her home in the southern Ukrainian city of Kherson early on Thursday after another night of Russian shelling.Fil was one of dozens of Kherson residents who headed to the local bus station to catch minibuses out of the city where at least 23 civilians were killed on Wednesday in attacks that hit a train station, a hypermarket and residential buildings.Standing in a long queue, clutching her handbag and her dog Lyalya, Fil said her daughter who lives in Russian-occupied territory in another part of Kherson had advised her to get out.\"She just told me on WhatsApp to either leave the city or sit in a basement on May 5 and May 6,\" said Fil, who is 50. \"She didn't say why, but maybe she's picked up something from the Russians over there.\"Kherson residents have lived under almost constant Russian fire since Ukrainian forces forced Moscow's troops to retreat from the city in November after nearly eight months occupation.The Russian army now bombards Kherson from the opposite side of the River Dnipro, but the announcement of a 58-hour curfew in the city from Friday evening has increased speculation that a Ukrainian counteroffensive is about to start.",
        "Many of those standing in line on Thursday said they did not want to leave as they queued to show their passports and receive passes to board minibuses to cities such as Mylokaiv and Odesa.After first leaving in November, Fil went back to Kherson in early April from Odesa, where she was returning on Thursday.\"And now I leave again,\" she said, though her husband will stay. \"There were just so many explosions last night, it feels like something's coming.\"Nataliya Boiko, 67, had just returned to Kherson to check on her apartment and water her plants. She was heading for nearby Mykolaiv on Thursday, where she says the apartment she stays in has little furniture but \"it's safer there.\"Those leaving plan to return when they can.\"When they hit the train station yesterday, my windows rattled so much and then overnight it felt like it never stopped. I barely slept,\" said Tamara Kostikova, 61. \"When it gets quieter, I will come back.\"(Writing by Elizabeth Piper, Editing by Timothy Heritage)"
    ]
}