{
    "articleURL": "/wires/pa/article-12052157/Matthieu-Pavon-remains-two-shots-clear-halfway-stage-Italian-Open.html",
    "content": [
        "France’s Matthieu Pavon maintained his two-shot lead at the halfway stage of the DS Automobiles Italian Open.",
        "Pavon followed an opening 63, his lowest-ever round on the DP World Tour, with a 70 on Friday to reach nine under par, with compatriot Julien Guerrier and Spain’s Adrian Otaegui on seven under.Poland’s Adrian Meronk is a shot further back after a second consecutive 68.Starting on the back nine at Marco Simone Golf and Country Club, Pavon threatened to leave the field trailing in his wake when he carded a hat-trick of birdies from the 11th, but dropped three shots over the next 13 holes before closing with a 57-foot birdie on the ninth.“Quite an up and down day,” Pavon said. “I started quite fast with a lot of good shots, made some birdies earlier on and that was great, but then I made some mistakes.“Nothing really big but when you miss something here it feels like it is really tough to get the up and down done, so I dropped a few shots.",
        "“I was a bit tired in the end also after a poor night yesterday, so to finish my round under par I am really happy.”Defending champion Robert MacIntyre had earlier been forced out of the tournament due to a back injury less than an hour before he was due to tee off alongside home favourite Guido Migliozzi and Denmark’s Rasmus Hojgaard.",
        "The Scot wrote on social media: “Gutted to withdraw this morning from the @ItalianOpen with a back strain. Hopefully nothing too serious. Now for a week of rest before the PGA Championship.”MacIntyre, who defeated US Open champion Matt Fitzpatrick in a play-off to win his second DP World Tour title last September, had carded an opening two-over-par 73 on Thursday.Ryder Cup captain Luke Donald missed the cut after consecutive rounds of 74 left him six over par.“I wouldn’t have missed this for the world,” Donald said.“Great to be back here again, obviously had a nice dinner with the vice-captains one night and did a lot of work behind the scenes, it was a busy week and a productive week, (but) my game was a little bit off this week.”"
    ]
}