{
    "articleURL": "/tvshowbiz/article-12039535/Waleed-Aly-steps-Batman-T-shirt-throwing-support-Carrie-Bickmores-ex.html",
    "content": [
        "The Project host Waleed Aly modelled a fun item from his wardrobe as he stepped out in Melbourne on Tuesday.",
        "The 44-year-old wore a black Batman T-shirt and a puffer jacket as he made his way to a waiting car.The TV presenter and academic completed his laid-back look with blue jeans and  sneakers as he carried a take-away coffee.The sighting comes after Aly rallied around producer Chris Walker, his old boss at The Project, following his split from the show's former co-host Carrie Bickmore.Aly, who once sat next to Bickmore on the panel of the Channel Ten news program, spent Sunday with her former partner as they watched an AFL game.",
        "Posting to his Instagram Stories, Walker shared a photo of the two men smiling in the grandstands wearing Richmond Tigers merchandise.The mates sported matching grins as they leaned towards each other for the photo. 'Second best Tigers date after Evie,' he captioned the post, presumably referring to the birth of his eight-year-old daughter Evie.It comes three months after Bickmore announced her split from long-time partner Walker in January, saying the pair was focused on co-parenting their three children.She had been in a relationship with him for 11 years.",
        "'It's with immense sadness that Chris and I have decided to separate,' she said.'While this is a tough time, our focus is on parenting, loving and supporting our three children Ollie, Evie and Addie with everything that we've got.",
        "'They are doing great. We won't be making any further comment.'",
        "Bickmore and Walker's love story captured the hearts of Australians.They met as colleagues on The Project - she was a presenter and he was a producer - and they began dating in late 2012, two years after she lost her husband Greg Lange, the father of her eldest child Ollie, 15, to brain cancer.Despite his terminal diagnosis, Bickmore had married Lange in 2005 when she was just 25 years old.After Lange died in 2010 at the age of 35, a widowed Bickmore started the charity Carrie's Beanies for Brain Cancer in his memory.Two years later and Bickmore had found love again with Walker, who became a stepdad to Oliver, and with whom she later had Evie, born in 2015, and Adelaide, born in 2018.",
        "It follows reports Bickmore has grown close to her Hit Network co-host Tommy Little following their respective break-ups. Little rushed to Bickmore's side in January when she confirmed her split from Walker, leading insiders to speculate their friendship could evolve into something more.Their professional relationship began in 2016 when stand-up comedian Little joined Bickmore on the panel of The Project.The pair began co-hosting the Hit Network's drive show a year later, and immediately gained a cult following thanks to their entertaining and organic banter.",
        "In February 2021, it was reported Little had split from his last confirmed girlfriend, Natalie Kyriacou, after a year of dating."
    ]
}