{
    "articleURL": "/wires/afp/article-12044795/What-Artemis-Moon-base-look-like.html",
    "content": [
        "The next time NASA goes to the Moon, it intends to stay. Under the Artemis program, the US space agency plans to maintain a human presence, for the very first time, on a celestial body other than Earth.",
        "But building a lunar base is no small feat. It will need power generators, vehicles and habitats, and the space industry is racing to meet the technological challenges.\"It's the Super Bowl of engineering,\" Neal Davis, lead systems engineer for the Lunar Terrain Vehicle at space company Dynetics, told AFP.Dynetics revealed its prototype design for a Moon rover last month at the Space Symposium in Colorado Springs.But it probably won't be until later Artemis missions -- 7 onwards -- \"where we're starting to look at adding permanent habitations on the surface,\" said NASA associate administrator Jim Free.Artemis 3, the first planned landing, won't happen until later this decade, so habitat building wouldn't start before the 2030s.The base would likely comprise multiple sites, he added, to diversify the targets of scientific exploration and to offer more flexibility for the landings.- Power and communications -",
        "Despite this distant timeline, companies are already chomping at the bit.\"Step zero is communications,\" Joe Landon, CEO of Crescent Space, a new subsidiary of Lockheed Martin dedicated to lunar services, told AFP.\"Think about when you move into a new apartment, you've got to hook up your phone and your internet first.\"Starting out with a pair of satellites, the company wants to become the Moon's internet and GPS provider.",
        "This would relieve the strain on NASA's Deep Space Network, which threatens to overheat in the face of all the upcoming missions, including private ones.Landon estimates the value of the lunar market will be \"$100 billion over the next 10 years.\"Next up: switching on the lights.Astrobotic, with 220 employees, is one of three companies selected by NASA to develop solar panels.They need to be placed vertically because at the Moon's south pole -- the intended destination because it has water in the form of ice -- the Sun barely peeps above the horizon.About 60 feet (18 meters) high, the Astrobotic panels will be connected by cables running several miles (kilometers), said Mike Provenzano, the company's director of lunar surface systems.The solar arrays will be fixed to vehicles that can run them out to different locations.- Vehicles -",
        "For its scientific expeditions, NASA has tasked industry with developing an unpressurized -- that is to say, open top -- rover for two people, ready by 2028.Unlike the Apollo missions' rovers, it will also have to operate autonomously for outings without an astronaut.This means surviving frigid lunar nights, which can last two weeks, with temperatures dropping to around -280 degrees Fahrenheit (-170 Celsius).Many companies have made a start.",
        "Lockheed Martin has partnered with General Motors, leaning on the auto giant's expertise in electric and off-road vehicles.Dynetics, a subsidiary of engineering behemoth Leidos, has joined forces with Nascar.Its prototype, which will achieve a top speed of nine miles per hour (15 kilometers per hour), includes a robotic arm and metal wheels that are braided like textiles to maximize traction on the sandy surface and deal with any rocks they encounter.\"But at the same time, they actually have a lot of openings to the outside so that they don't collect that sand and carry it with us,\" Davis said.Moon dust, or regolith, poses a major challenge because, lacking erosion by water or wind, it is almost as abrasive as glass.NASA has yet to announce the selected company or companies.In the longer term, NASA is working with the Japanese space agency JAXA on a pressurized vehicle, in which astronauts won't need to keep their suits on.- Habitats -Finally, the crew will need a place to hang up their helmets and call home.NASA has awarded a $57.2 million contract to the Texas-based company Icon, which specializes in 3D printing, to develop the technology needed to build roads, landing strips on the Moon, and ultimately, dwellings.",
        "The idea is to use lunar soil as a material. Other companies, such as Lockheed Martin, are developing inflatable habitat concepts.\"The beautiful thing is you can land it on the moon and inflate it and now there's a much larger volume for the crew to live in and work in,\" Kirk Shireman, vice president for the Lockheed Martin Lunar Exploration Campaign, told AFP.Inside would be bedrooms, a kitchen, a space for scientific instruments, etc. -- all mounted on a frame, so the habitat can be mobile.The basic concept behind returning to the Moon under Artemis is to help NASA prepare for much more distant missions to Mars.\"Whatever money we have to spend to go develop these systems on the moon, we want those same systems to be applicable to go to Mars,\" said Shireman."
    ]
}