{
    "articleURL": "/wires/pa/article-12057551/Met-make-64-arrests-charges-four-suspects-following-King-s-coronation.html",
    "content": [
        "The Metropolitan Police made 64 arrests during the King’s coronation day, charging four suspects with public order and drugs offences.",
        "The force said 32 of those detained on suspicion of causing a public nuisance have been bailed, alongside 14 arrested on allegations of breaching the peace.Four charges have been made by police so far, with one suspect accused of a religiously aggravated public order offence and two others accused of possession of class A drugs.",
        "Another suspect is accused of an offence under section 5 of the Public Order Act – with all four due to appear at Westminster Magistrates’ Court later this month.The force came under huge criticism from campaign groups for the detention of protesters on Saturday, with the arrests described as “incredibly alarming”.A total of 11 others were released on bail on suspicion of offences including sexual assault, breaching the peace and harassment, with two breach-of-the-peace suspects released without charge, police said.Before the coronation, the chief executive of anti-monarchy group Republic, Graham Smith, was among those arrested.He said the force should “hang their heads in shame” after he was released on Saturday night following 16 hours in custody.A total of eight members of Republic’s team were arrested as they prepared for “a peaceful and lawful protest”, he added.He told the PA news agency that officers had been “intimidating, heavy-handed, not willing to listen, not willing to co-operate or to engage”.",
        "Mayor of London Sadiq Khan said he had demanded “clarity” from the force’s leaders on the arrests.Culture Secretary Lucy Frazer told Sky News’ Sophy Ridge that police got the “balance right” between allowing protest and enjoyment of the King’s coronation.She defended the Met after the force was heavily criticised by MPs and human rights groups over the arrests, denying that officers had gone too far."
    ]
}