{
    "articleURL": "/wires/ap/article-12057897/Meneses-homer-9th-lifts-Nationals-9-8-win-Dbacks.html",
    "content": [
        "PHOENIX (AP) - The Washington Nationals rallied in the ninth inning to take the lead for the second straight game.",
        "This one ended in elation instead of heartbreak.Joey Meneses hit a three-run homer in the ninth inning off Miguel Castro and had four RBIs, lifting the Washington Nationals to a 9-8 win over the Arizona Diamondbacks on Sunday.\"These guys got a bunch of heart and they´re playing together and they feel like they never out of it,\" Nationals manager Dave Martinez said. \"Today is another good example that. They fought back and put up some big numbers again today.\"The Nationals rallied from a four-run deficit to take the lead in the ninth inning Saturday night, only to lose 8-7 when the Diamondbacks rallied in the bottom half.Arizona took an 8-6 lead into the ninth inning on Sunday behind Lourdes Gurriel Jr.'s two homers and four RBIs.",
        "Luis Garcia opened the ninth inning with a double off Castro (1-1) and Keibert Ruiz followed with a single. Meneses turned quickly on a pitch by Castro and sent it into the seats in left to put the Nationals ahead.Erasmo Ramírez (2-1) didn't allow a baserunner in 1 1/3 innings and Hunter Harvey worked around a walk in ninth for his first save since 2019 at Double-A Bowie to prevent Arizona's first sweep of the Nationals since 2009.\"These kinds of victories help us, give us confidence in a team to keep battling, keep struggling and have great at-bats until the end,\" Meneses said through a translator. \"There´s an opportunity yesterday we were able to do that and unfortunately, we didn´t come out with the victory. But I think that everyone board has a team and it just shows us that we just keep battling the whole game.\"",
        "The Diamondbacks appeared to be in control after another big game from Gurriel. He had four hits, including the tying homer in the ninth inning Saturday night and picked up where he left off, hitting a solo shot off Trevor Williams in second inning.Gurriel followed with a three-run shot off Andres Machado in the fifth and Christian Walker also homered for Arizona.The Diamondbacks just couldn't hold it.Washington trailed by four runs after six innings, cutting the lead to 7-5 against Kevin Ginkel on Ruiz´s fielder´s choice and Meneses´ run-scoring single. Another Washington run came in when Ildemaro Vargas hit into a double play in the eighth.Needing three outs, the Diamondbacks gave up three runs and went down quietly in the ninth to see victory snatched from them after doing it to the Nationals the night before.HARVEY'S TIMEHarvey was a first-round draft pick by Baltimore in 2013, but had his career derailed by a string of injuries.Picked up by the Nationals on a waiver claim, the right-hander finally seems to be healthy and is showing off his potential. By picking up his first big league save against Arizona, he and his father Bryan become the ninth father-son duo in major league history to record saves.",
        "\"I´m proud of him,\" Martinez said. \"He went through a lot of ordeal just getting healthy and we´re going try to keep hit healthy. When he´s healthy, you see what he can do.\"TRAINER´S ROOMNationals: CF Victor Robles was out of the lineup after injuring his back on a slide in the fourth inning Saturday night. Martinez said after the game he will be placed on the injured list so he has time to recover. ... 3B Jeimer Candelario was out of the lineup for the second straight game after being hospitalized briefly for dehydration following Friday´s game. He's expected to start Monday. ... The Nationals reinstated INF Carter Kieboom from the 10-day injured list and optioned him to Triple-A Rochester.UP NEXTNationals: RHP Jake Irvin (0-0, 2.08 ERA) makes his second big league start Monday to kick off a three-game series at San Francisco.Diamondbacks: RHP Zac Gallen (4-1, 2.53) is 2-0 with a 1.53 ERA in two career starts against Miami heading into the opener of a three-game series against the Marlins on Monday.___AP MLB: https://apnews.com/hub/MLB and https://twitter.com/AP_Sports"
    ]
}