{
    "articleURL": "/femail/article-12054353/Princess-Margarets-heartthrob-grandson-Samuel-Chatto-26-attends-coronation.html",
    "content": [
        "Princess Margaret's daughter Lady Sarah Chatto attended the King's coronationCORONATION LIVE BLOG: Click here to follow live updates throughout today Lady Sarah Chatto looked ethereal in a cream dress and matching hat as she attended the King's coronation today alongside her family members.",
        "Princess Margaret's daughter, 59, appeared effortlessly elegant in the frock, which featured a pleated skirt, a V-neck line and was cinched at the waist with a dainty belt.She joined her artist husband Daniel, and their son Samuel, 26, at the historic event at Westminster Abbey in London.Lady Sarah added a touch of glamour to her sophisticated outfit by wearing her mother Princess Margaret's Greville pearl earrings. She also donned a pearl necklace and a diamond bracelet.The mother-of-two is the only daughter of the late Princess Margaret and her former husband, Antony Armstrong-Jones, who passed away in 2017. ",
        "The late Queen was described as a 'surrogate mother' to Margaret's children and was particularly close to Lady Sarah, who is believed to have reminded her of her late sister.Both her parents passed on their artistic eye to their children as Sarah, now a painter, and her brother David were taken around galleries in their youth.Sarah went on to complete a foundation course at Camberwell School of Arts and Crafts, followed by a printed textiles course at Middlesex Polytechnic, paving the way for her training at the Royal Academy Schools.Working as a painter under the professional name Sarah Armstrong-Jones, she has since exhibited at galleries including The Redfern Gallery in London.",
        "Her wedding to Daniel Chatto in July 1994 was such a short, simple affair that chauffeurs were caught by surprise: the Queen, Prince Philip and Princess Diana waited at the City church of St Stephen's Walbrook after the service for their cars to come back.While the Chatto's are not at the centre of the working royals, they have attended major royal events over the years, including the late Queen Elizabeth II's funeral last September, Royal Ascot, Trooping the Colour, as well as the Platinum Jubilee celebrations.Meanwhile, Lady Sarah's eldest son Samuel - who attended Eton college before studying at the University of Edinburgh - was pictured alongside his equally smartly dressed father following the service.The royal, who is 29th in line to the throne, was brought up in Kensington, London. He studied History of Art at university and trained as a yoga teacher before settling on a career in the creative industry - just like his artist father. ",
        "After graduation, he worked in an art market before becoming a craftsman. Explaining that he had put aside his creative ventures while studying, he later set up his own ceramics studio.Speaking to the Daily Mail in 2019, he said: 'I'm working in clay to create functional and sculptural wood-fired ceramics from my home and studio in West Sussex.",
        "'The decision to start selling my work comes from a strong belief in the power of beautiful, well-made objects to enrich and enhance our lives.''I've always had a strong affinity with creating objects, having spent much of my childhood crafting imagined landscapes and sculptural models, which naturally led me to clay during my later years at school.",
        "'My creative practice took a back seat while I studied History of Art at Edinburgh, but was revived, in the summer of 2017, by a visit to North Shore Pottery [in Caithness].'Inspired by what I had seen in Scotland, and completely uninspired by my three-month job in the commercial art market, I spent my weekends setting up a small home studio to rediscover my creativity and built a wood-fired kiln at the bottom of my garden.'The royal is also a trained yoga teacher and underwent 200 hours of training, spending six weeks in India to gain the qualification. He told his followers on Instagram that it was 'an incredibly eye-opening experience which I am so deeply grateful for'.Sam has also shared his close relationship with his younger brother Arthur on social media, posting a picture of the pair on the day of Prince Harry and Meghan Markle's wedding and writing: 'I love you bro (and I'm not just saying that cos you're so big you could squish me).' "
    ]
}