{
    "articleURL": "/sport/football/article-12051069/Gabriel-Magalhaes-undergo-fitness-test-ahead-Arsenals-trip-Newcastle-Arteta-reveals.html",
    "content": [
        "Mikel Arteta believes William Saliba's new deal will be signed when time is rightGabriel's absence may leave Arteta without his first-choice pairing vs NewcastleRecap Mail Sport's LIVE blog for all the latest news and updates from ArsenalMikel Arteta is confident a new deal for defender William Saliba will be signed when the time is right. The Frenchman has only one year left on his current deal, after Arsenal triggered an extension earlier this season. ",
        "The club have been in talks with Saliba's representatives since before the World Cup. No agreement has yet been reached but, ahead of Sunday's trip to Newcastle, Arteta insisted Arsenal are doing all they can to tie down the 22-year-old France international.'Obviously (sporting director) Edu and the board are on top of every negotiation regarding new contracts and now we are doing everything we possibly can to do that in the right moment at the right time,' Arteta said.'The communication and the relationship is super. It is about timing, I think. Nothing else.' Saliba has not signed improved terms since arriving as a teenager in the summer of 2019 for £27million.He is one of a number of young talents that Arsenal have attempted to tie down in recent months. Gabriel Martinelli has already put pen to paper to become of the club's highest earners, while Bukayo Saka is closing in on a lucrative new contract.",
        "'We want to keep our best talent. Especially the players that deserve some recognition,' Arteta said. 'I think he has been incredible since he came back from his loan period and we want to reward him, that is for sure. We will find the right moment to do that.'Defeat at St James' Park last season proved pivotal as Arsenal missed out on the Champions League. This time round, another bad result could kill their Premier League title hopes, with the Gunners likely to arrive at St James' Park trailing Manchester City by four points. ",
        "Meanwhile, Gabriel Magalhaes faces a late fitness test ahead of Arsenal's crucial visit to Newcastle this weekend, with centre back partner Saliba already expected to miss the trip to St James' Park.Saliba has been absent for each of Arsenal's past seven matches since hurting his back against Sporting in March. Gabriel, meanwhile, was taken off towards the end of Arsenal's midweek victory over Chelsea following a kick to his ankle.That prompted fears that Mikel Arteta could be without both of his first choice centre back pairing for Sunday's clash. 'We will have to see tomorrow how he is, but he could not finish the game so that was a big sign,' Arteta said about Gabriel.On Saliba, the manager added: 'There's not a lot of progress. He's feeling better every day but he's not been able to have any activity around the first team so we don't expect him to be with us (against Newcastle).Arteta is, however, still refusing to rule out a return for Saliba before the end of the season. 'We are not there yet because we're always hopeful and players are pushing to play. If that's the case we'll announce it, but hopefully not,' the manager added.'It's about the healing process, painwise and the things he can do off the pitch he's in a good place, but we have to build that capacity with the right load so that he's able to contribute to the team.'"
    ]
}