{
    "articleURL": "/news/article-12058779/Moment-META-billionaire-Marc-Zuckerberg-gets-grumpy-ref-losing-Jiu-Jitsu-bout.html",
    "content": [
        "Mark Zuckerberg entered his first public Jiu-Jitsu competition in Redwood CityVideo has emerged of Mark Zuckerberg looking grumpy with the referee after losing a Jiu-Jitsu bout at his first ever tournament, which took place in Redwood City in California on Saturday.",
        "Video shows the Facebook founder and Meta CEO squaring up to his opponent before they grapple with one another.They can be seen wrestling on the floor as Zuckerberg is held down on the mat as he tries to wriggle free, surrounded by spectators recording the battle on their phones.The two struggle on the mat for more than a minute before Zuckerberg is finally pinned down.Eventually the referee called the match and gave the win to his opponent, believing that Zuckerberg, 38, had 'tapped out'. ",
        "The video shows Zuckerberg standing to his feet with his chest exposed, looking aggravated with the referee and his opponent.Onlookers said he claimed it was an error and the match was eventually re-cast as a 0-0 draw.The video shows the three of them holding a short, heated discussion before Zuckerberg hugs his opponent and locks hands with him affectionately.The world-famous tech giant proved he has serious grappling skills in his first BJJ competition by winning gold and silver medals. The medals were awarded for the Gi and No-Gi disciplines. The Gi is the loose-fitting uniform of heavy fabric tied with a belt that's often worn by competitors.",
        "It was revealed in September last year that Zuckerberg had taken up mixed martial arts (MMA), with his trainer describing him as a 'silent killer' in the ring. ",
        "He proudly shared photos from the tournament on his official Instagram account but did not divulge the name of the competition.'Competed in my first jiu jitsu tournament and won some medals for the Guerrilla Jiu Jitsu team,' Zuckerberg wrote. 'Thanks to @davecamarillo @khaiwu @intense0ne for training me!'He was referring to Guerrilla Jiu-Jitsu founder Dave Camarillo, martial artist Khai 'The Shadow' Wu, and owner of Guerrilla Jiu Jitsu Pleasanton James Terry. Zuckerberg told Joe Rogan in 2022 that he became very interested in mixed martial arts during the Covid-19 pandemic, and has since been training in the various aspects of the combat sport.",
        "'I really like watching UFC for example, but I also like doing the sport,' Zuckerberg said on the podcast.'There's something so primal about it, I don't know … Since then I've just introduced a bunch of my friends to it. We train together, and we like, wrestle together, and there's a certain intensity to it that I like.'The Meta boss has also been seen sitting ringside at UFC events and seems to have developed a friendship with UFC boss Dana White. In 2022, Zuckerberg posted footage of himself sparring with Khai 'The Shadow' Wu ahead of the fighter's UFC debut.The video, which attracted hundred of thousands of likes, quickly went viral and drew comments from many big names in the fighting world.",
        "'This is great!' Rogan commented. 'I'm so happy to see this. Training looks solid too!'Brazilian Jiu Jitsu practitioner Bernardo Faria said: 'Amazing!!! Half guard, arm-bars, triangle! Super cool!''That's dope,' UFC grappler and three-time World Jiu-Jitsu champion Gilbert Burns wrote.",
        "Zuckerberg has explained that training is 'really important' to him and helps to maintain his 'energy level and focus'.'It's because I have a connection to it,' he said. 'Since COVID, I got super into surfing and foiling, and then really into MMA. I know a lot of people who do it.'MMA is like the perfect thing because it's like, if you stop paying attention for one second, you're gonna end up on the bottom.'Brazilian Jiu-Jitsu has become very popular with celebrities in recent years, with the likes of Tom Hardy, Russell Brand, Henry Cavill and Guy Ritchie posting about their interest in the sport.Guerrilla Jiu-Jitsu is a system of grappling that integrates the Olympic sport of Judo with Brazilian Jiu-Jitsu.Founder Dave Camarillo is a Judo and Brazilian Jiu-Jitsu black belt, though he moved away from Ralph's academy to form his own style of grappling which he branded Guerrilla Jiu-Jitsu. Camarillo is now a mainstream name as a coach after many of his students became big stars in the world of MMA, names such as Jon Fitch, Josh Koscheck, Mike Swick, and Cain Velazquez."
    ]
}