{
    "articleURL": "/news/article-12046771/Married-teacher-girl-pupil-pay-Travelodge-rooms-pair-meet-sex.html",
    "content": [
        "Dr Iain David Bryant is found to have had a relationship with a pupil in 2017A married teacher who had an 18-month affair with a pupil and met her for sex with her in Travelodge hotel rooms has now been struck off.",
        "Dr Iain David Bryant taught chemistry at Levenmouth Academy in Leven, Fife, when he is alleged to have struck up a relationship with the student - referred to as Pupil A - in October 2017.The General Teaching Council for Scotland (GTCS) removed the 55-year-old from the teaching register today following an investigation into his actions, which saw all allegations found proved.The disgraced former teacher kissed the pupil - who was under 18 at the time - whilst at school, and had purchased a burner phone to communicate with her, using the codeword 'Delilah'.The pair would also meet several times in desolate car parks and garages where the two would engage in sex acts.",
        "Bryant, who now works as a celebrant, also met the pupil for sex on several occasions after she turned 18 at a local Travelodge in Glenrothes, Fife - that she paid for.The three-person GTCS panel had sat for the duration of the scheduled five-day hearing but required only four days to make their decision to issue Bryant with a removal order.Speaking on behalf of the panel today, Michelle Farrell said: 'The panel have found that the teacher's action has fallen significantly short of the standards and therefore he is unfit to teach.'In accordance with rule 2.10.1, as the teacher has been found unfit to teach the panel must direct that the teacher's name be removed from the register of teachers.'",
        "Presenting Officer Lauren Doherty then recommended that the panel impose the maximum of two years before Bryant can reapply. This means once again  apply to be a teacher in two years, but the application does not have to be accepted. The hearing heard evidence from Pupil A and several members of staff at Levenmouth Academy, including head Ronnie Ross who revealed that Bryant had exchanged notes and gifts with the girl.Mr Ross had spoken of how he discovered love notes and a series of 'trinkets and a soft toy' hidden in Bryant's classroom following his suspension in 2019.The GTCS also heard evidence from a friend of Pupil A, who went unnamed to avoid jigsaw identification, who told the panel of how her friend would pay for the pair's hotel trips.",
        "She said yesterday: 'Pupil A told me that they would go to the hotel and she would pay, they would leave together or he would leave and she would stay.'The hotel was pretty much for sex and that was about it. They didn't want anyone knowing about the relationship.'The friend also told of how she had initially thought Pupil A was dating someone in their twenties and when she found out the truth, encouraged the pupil to tell her mother.",
        "She said: 'I can't remember how we got onto the topic but it was after exercise class, before we got into the car she was telling me about it [the relationship] and how her mum would not be too happy.'He didn't have Facebook which threw up red flags for me and then it came out it was her teacher and he was in his 50s.'She got upset that they'd never have a normal relationship, how he wouldn't leave his wife, and we spoke about how what had happened shouldn't have happened.'[We spoke about] How this wasn't a good relationship for her, and that night we went back to her house and told her mum together.'The GTCS heard from Levenmouth Academy headteacher Ronnie Ross on Tuesday, where he claimed that he found a series of hidden notes passed between the pair. ",
        "'Between October 2017 and June 2019 at Levenmouth Academy, it is alleged that the teacher did enter into a relationship with Pupil A, then a pupil at the school and did:'Take Pupil A away from a window and hug her as she was feeling upset.''Say he was thinking about kissing Pupil A the following day.''Kiss Pupil A [who at the time was still at school and under the age of 18].''Engage in an emotional relationship with Pupil A who at the time was still at school and under the age of 18.''Kiss and touch Pupil A in the technician's lab.''Meet Pupil A two or three times a week in parks and walk dogs.''Give Pupil A a mobile phone a few months later, and contact her using a code word Delilah.''Meet Pupil A in a Travelodge and/or other property and engage in sexual activity once she was over 18.'",
        "The GTCS also heard yesterday from modern studies teacher Steven Davies, who overheard pupils on a trip to the Scottish Parliament talking about a teacher being 'overly friendly' with students.He said: 'They [the pupils] were talking about earlier school experiences, we weren't paying attention and I didn't put any importance on it at the time.",
        "'They said the teacher was creepy and a bit too chummy with pupils but I wasn't really listening to be honest.'This comes after the GTCS heard from Pupil A earlier in the week who told of the ways in which Bryant would try to keep their affair secret.The now-23-year-old told the GTCS: 'A month after [we first kissed] he bought a pay as you go phone so we could talk over the Christmas break.'At the beginning it was just me confiding in him, after the kiss it went from there, he would pick me up from school and we would drive about and chat.''It was mostly mutual, I wouldn't put it all on him, we didn't sleep together until March of 2018 when I had turned 18 years old.'From the beginning he would tell his wife he had things on so we could meet, when we met up it was always in secret and in the car.'He had keys to a second house, I think it was his wife's cousin's home so we started meeting there.'Bryant and Pupil A kissed and touched in a science lab in Levenmouth Academy as well as met in cars outside East Fife FC's Bayview stadium.Pupil A said: 'I had never had a relationship like that before so it was all very new to me and I was hesitant to begin with.",
        "'There's a local football ground at Bayview and there is rubble ground which is used as a car park so we would use that a lot.'[We had sex] in the local Travelodge in Glenrothes.'I think it was chosen as it was more accommodating than a car seat and the local Travelodge is only a five minute drive for me but far enough away from where he stays that he wouldn't be caught.'"
    ]
}