{
    "articleURL": "/wires/reuters/article-12041819/Seattle-chases-series-win-As.html",
    "content": [
        "It was Miller Time on Tuesday night at the Oakland Coliseum.",
        "Seattle's Bryce Miller, after retiring the first 16 batters he faced in his major league debut, received a beer shower in the visiting clubhouse following the Mariners' 2-1 victory over the host Oakland A's to open a three-game series on Tuesday.Miller, called up from Double-A Arkansas, allowed one run on two hits in six innings. The right-hander didn't walk a batter and struck out 10. It was just the third debut with no walks and double-digit strikeouts in MLB history, following Johnny Cueto's 10 strikeouts in 2008 and Stephen Strasburg's 14 strikeouts in 2010.\"Unbelievable performance tonight by Bryce Miller. As calm, cool as any young player I've ever seen getting the opportunity to start his first major league game,\" Mariners manager Scott Servais said. \" ... His fastball has all kinds of life on it, and the swing-and-miss that that can bring. Can't ask for much more. That was some kind of shot in the arm. It was just awesome.\"With only 2,583 in attendance on a drizzly night with the Golden State Warriors playing an NBA playoff game against the Los Angeles Lakers across the Bay, the crowd was smaller than some Miller saw in the minors.\"Obviously the stage was bigger, but I think the atmosphere kind of helped me ease into it,\" Miller said. \"I had a lot of fun. I just went out and threw.",
        "\"I threw a lot of fastballs, and they weren't hitting them. So I kept throwing `em.\"Miller didn't earn the victory because Oakland's Mason Miller was just as good. Making his third career start, Mason Miller pitched seven no-hit innings, with four walks and six strikeouts.The A's pulled Miller after he threw 100 pitches.\"It's definitely disappointing to not be able to finish it, but I know that's kind of on me for having those four walks and not being in the zone as much as I should've been early in the game,\" Mason Miller said. \"So I totally understand it and I'd rather throw many more games this season than lay it all on the line for a game in the beginning of May.\"Seattle's AJ Pollock broke up the no-hit bid with a solo homer with one out in the eighth off A's reliever Richard Lovelady and Jarred Kelenic's run-scoring double later in the inning gave the Mariners the lead.Both teams had injury issues.Mariners outfielder Julio Rodriguez (back soreness) was a late scratch and missed his second consecutive game. Athletics infielder Aledmys Diaz (strained left hamstring) was placed on the 10-day injured list, with Nick Allen recalled from Triple-A Las Vegas to start at shortstop.On Wednesday, Mariners right-hander Logan Gilbert (1-1, 4.23 ERA) is scheduled to start against Oakland lefty JP Sears (0-2, 6.23).",
        "Gilbert is 1-0 with a 3.62 ERA in seven career starts against the A's, while Sears is 2-0 with a 0.56 ERA in three career appearances against the Mariners, including two starts.--Field Level Media"
    ]
}