{
    "articleURL": "/tvshowbiz/article-12039411/Camila-Morrone-nails-casual-chic-double-denim-outfit-paired-chunky-black-boots.html",
    "content": [
        "Camila Morrone kept it casual Tuesday in New York.",
        "The actress, 25, stepped out in a double denim outfit just days after channeling Audrey Hepburn's Holly Golightly at a Vogue party.The Daisy Jones and the Six star donned faded straight leg jeans and a oversized jacket for her outing in the Big Apple.She paired them with a simple white T-shirt and tied a black sweater around her neck.The Death Wish actress let her long dark hair hand straight and she appeared to be wearing little makeup, showcasing her natural beauty.",
        "Camila wore thick soled black boots and completed the look with black framed sunglasses and a black Chanel shoulder bag with a gold and black strap. The model looked well-rested after spending a glamorous night at the Met Gala Monday.There she took part in fashion's biggest night, celebrating the legacy of designer Karl Lagerfeld with other A-list stars including Card B, Gigi Hadid, Oscar winner Ke Huy Quan, as well as Kim Kardashian and her younger sisters, Kendall and Kylie Jenner. On Instagram, the fashionista revealed she had a tiny wardrobe malfunction when the seam Rodarte Black Velvet Fluted Gown with Waterfall Train and White Alencon Lace Collar ripped on the way to the party.Co-designer Kate Mulleavey had a needle and thread handy as sewed it as they traveled on a large party but to the Metropolitan Museum.",
        "She and her sister Laura, have designed looks for Saoirse Ronan , 29, and as well as The Little Mermaid star Halle Bailey, 23, and her sister Chloe, 24.Camila has been busy adding to her acting resume after her highly lauded performance in Daisy Jones and the Six. She recently completed the crime drama Marmalade, playing the love interest of a man jailed for robbing a bank who has plans to escape and reunite with her. ",
        "Stranger Things star Joe Keery, 31,  and Black Adam actor Aldis Hodge, 36, co-star. The versatile actress is starring as the title character in Gonzo Girl, about young writer who takes a job working as an assistant to an eccentric novelist.Willem Dafoe and Patricia Arquette co-star in the drama.Patricia was behind the camera, calling the shots in her directorial debut. The film is based on the novel of the same name by same name by Cheryl Della Pietra, who worked at one time as the assistant to gonzo journalist Hunter S. Thompson."
    ]
}