{
    "articleURL": "/wires/aap/article-12045565/Toyota-shows-hydrogen-cars-push-new-green-tech.html",
    "content": [
        "Australia's top-selling automaker has shown off a collection of big and small hydrogen-powered vehicles in an event designed to spark conversation about its potential as mainstream, pollution-cutting transport technology.",
        "The Toyota Hydrogen Showcase, which will tour other Australian capitals over the next two months, ranges from a hydrogen fuel-cell bus and the company's Mirai sedan to a next-generation forklift and a concept van with a working kitchen installed.The exhibition comes days after Toyota's Australian sales boss told AAP the company considered it \"too early\" for the country's motorists to transition to electric vehicles to cut carbon emissions.The company's claim was rejected by other groups in the motoring industry, who pointed to the rising rate of electric car purchases and Toyota's failure to launch an electric vehicle in Australia.Toyota's showcase, to be held over two days at the Brisbane Convention and Exhibition Centre, features a fuel-cell electric bus like those currently used in Europe and the Middle East, a hydrogen-powered forklift, and a HiAce van remodelled to use hydrogen and fitted with fridge, freezer and multiple cooktops.The company is also providing test drives of its second-generation hydrogen passenger car, the Mirai, that promises a range of 650 kilometres.Toyota Australia new business solutions general manager Arie Perzuck said 20 of the hydrogen-powered sedans were already being used by Victorian customers, and the national tour was designed to spread information about the vehicles.\"Our goal for this event is to increase awareness of hydrogen technology through interactive education,\" he said.",
        "\"We are committed to hydrogen and fuel-cell technology as part of our broad-based approach to helping reduce carbon emissions.\"Toyota carbon policy manager Andrew Willis said the company had chosen to lease rather than sell its hydrogen-powered vehicles to companies as hydrogen infrastructure was still rare.Only eight hydrogen refuelling stations were currently available in Australia, he said, but more investments were being made into the technology that could be used to top up small and large vehicles, including buses and trucks.\"When you look at governments, federal and state, they're putting a lot of money towards hydrogen, particularly hydrogen for export and broad-based applications, and one of those will be transport,\" Mr Willis said.\"It's all part of that journey towards lowering emissions across the economy.\"Australia currently has $127 billion of hydrogen investments, including export, blending, refining and mobility projects.Despite investments in the technology, only a small number of hydrogen vehicles are being used worldwide.A recent report from the International Energy Agency found 51,600 fuel-cell electric vehicles had been sold, with more than half used in South Korea and the United States.The popularity of hydrogen-powered vehicles had been hampered, it found, by a lack of refuelling stations and the high price of the fuel.The Toyota Hydrogen Showcase will tour Sydney, Canberra, Adelaide and Perth between May and June."
    ]
}