{
    "articleURL": "/wires/ap/article-12053365/Iran-executes-leader-deadly-2018-parade-attack.html",
    "content": [
        "DUBAI, United Arab Emirates (AP) - Iran executed an Iranian-Swedish dual national Saturday accused of masterminding a 2018 attack on a military parade that killed at least 25 people, one of several enemies of Tehran seized abroad in recent years amid tensions with the West.",
        "Farajollah Cha´ab, also known as Habib Asyoud, had been a leader of the Arab Struggle Movement for the Liberation of Ahwaz, an Arab separatist movement that has conducted oil pipeline bombings and other attacks in Iran's oil-rich Khuzestan province. That group had claimed the 2018 attack in its immediate aftermath.Cha'ab's execution comes as a Swedish court last year sentenced an Iranian to life in prison over his part in the 1988 mass executions in Iran at the end of its war with Iraq. Tehran, which has used prisoners as bargaining chips in negotiations with the West, reacted angrily to that sentence. Meanwhile, tensions also remain high between Iran and the West over its rapidly advancing nuclear program as well - and at least one more prisoner with Western ties faces a possible execution.The Iranian judiciary's Mizan news agency confirmed Cha'ab's execution by hanging in a lengthy statement. It identified him as the leader of the militant group and alleged without providing evidence that he had ties to Swedish, Israelis and U.S. intelligence services. It accused his group of killing or wounding 450 people over the years, including multiple attacks on government offices and other sites.It also included state television interviews with Cha'ab, a feature of many Iranian trials that activists long have described as coerced confessions.",
        "It also clearly identified Iranian intelligence officers as being behind Cha'ab's abduction, saying that its \"unknown soldiers\" captured him in Turkey in November 2019. Iran has used similar ruses to capture its enemies abroad, including the exiled journalist Ruhollah Zam who was executed in 2020.",
        "Swedish Foreign Minister Tobias Billstrom condemned Cha'ab's execution.\"The death penalty is an inhumane and irrevocable punishment, and Sweden, together with the rest of the (European Union), condemns its use under all circumstances,\" he said in a statement.Sweden´s Nordic neighbors Finland and Norway also strongly condemned the execution, underlying their stance against the death penalty. \"I am appalled,\" said Finnish Foreign Minister Pekka Haavisto.The Oslo-based group Iran Human Rights separately condemned the execution, referring to Cha'ab's closed-door trial as \"grossly unfair.\"\"This is an example of the Islamic Republic´s state terrorism,\" said Mahmood Amiry-Moghaddam, the group's director. \"We expect that the EU and Swedish government show adequate reaction to the murder of their citizen. Killing a hostage must not be tolerated.\"Tensions already had escalated between Iran and Sweden over the life imprisonment of Hamid Noury, an Iranian convicted in Sweden of committing grave war crimes and murder during the final phase of the Iran-Iraq war in the 1980s. The end of the war saw mass executions of an estimated 5,000 Iranian prisoners, including those from an exiled opposition group and others.",
        "The 2018 attack in Iran targeted a military parade in Ahvaz in Khuzestan, the chaos captured live on state television. Militants disguised as soldiers opened fire, killing at least 25 people and wounding over 60 others in the deadliest attack to strike Iran in years. A spokesman for the separatist group claimed the assault shortly after in a televised interview. The Islamic State group also claimed the attack, though it offered factually incorrect details about the assault.In recent months, Iran has carried out other executions after the months of unrest over the September death of 22-year-old Mahsa Amini following her arrest by the country's morality police. In January, Iran executed a former high-ranking defense ministry official and dual Iranian-British national accused of spying.Also facing a possible execution is an Iranian-German national who lived in California, a man Iran describes as planning a 2008 attack on a mosque that killed 14 people and wounded over 200 others, as well as other assaults through the little-known Kingdom Assembly of Iran and its Tondar militant wing. His family long has said he was captured by Iranian intelligence in Dubai, the United Arab Emirates.Iran is one of the world´s top executioners.___Associated Press writers Nasser Karimi in Tehran, Iran, and Jari Tanner in Helsinki, Finland, contributed to this report."
    ]
}