{
    "articleURL": "/news/article-12049313/Joe-Rogan-slams-Bidens-refusal-participate-2024-election-debates-not-democratic.html",
    "content": [
        "Biden is being challenged for the Democratic nomination by Robert F. Kennedy Jr, anti-vaxxer and JFK's nephew, and self-help author Marianne WilliamsonBiden will not debate either: neither the Republicans nor the Democrats have ever staged primary debates with an incumbent running for re-election Joe Rogan on Wednesday said he thought the failure to hold a primary was 'not that democratic' Podcast host Joe Rogan criticized Joe Biden for declining to debate his Democrat rivals in a primary, arguing that it was 'not very democratic'.",
        "Biden is being challenged for the nomination by self-help author Marianne Williamson and JFK's nephew, Robert F. Kennedy, a strident anti-vaxxer.No incumbent president of either party has ever held a debate with those seeking to oust them.But Rogan, in a clip obtained by Mediaite, said that Biden should take on Williamson and Kennedy.'I think these people are goofy,' said Rogan, speaking on the Wednesday edition of his podcast.'I think, you know, it's really hard to run a country and most people aren't very good at it. Just how it goes. There's very few people that are actually good at it.'Rogan said the country was 'not being run well,' so there should be an exploration of who would be better suited.",
        "'So you have to go, well, who could do it better? Could it be a Republican? Or it could be a better Democrat?'And if it's not a better Democrat, like how are we gonna get a better Democrat if you don't let the president debate? So they won't let him debate.'Rogan said both Kennedy and Williamson - who ran for the Democrat nomination in 2020 - were 'promising candidates for the Democratic party.'He added: 'But they won't let him debate before the primaries. So it's like, that's not that democratic, like, that's not how it's supposed to do.'",
        "Williamson announced in February that she would run for president a second time, challenging Joe Biden in the Democratic primary. Her announcement speech was peppered with her philosophy of love and light.'We are upset about this country; we're worried about this country,' she said at her campaign kickoff event on March 5.'It is our job to create a vision of justice and love that is so powerful that it will override the forces of hatred and injustice and fear.'",
        "She dropped out of the 2020 presidential race in January of that year, before the primaries had begun in earnest. She had gone through two campaign managers and dozens of staff in her short candidacy.But she had some breakout moments as a candidate, including during a July 2019 Democratic presidential debate when she directly addressed then-President Donald Trump and told him: 'I'm going to harness love for political purposes. I will meet you on that field. And, sir, love will win.' Williamson is the author of more than a dozen books and found fame as a self-help guru. She markets her A Course in Miracles as a way to achieve inner peace. Its foundations stress love and forgiveness. Williamson is less popular than Kennedy, who has been performing better than expected in early polls. ",
        "A survey for Fox News taken between April 21 and 24 put him at 19 percent of the vote in the Democratic primary. It is still way below Joe Biden's 62 percent, but it is also ahead of Williamson, who sits at 9 percent.",
        "Name recognition as the son of assassinated former attorney general Robert Kennedy and nephew of President John F. Kennedy may have gone some way to inflate his standing.  Kennedy, a former environmental lawyer and outspoken anti-vaccine activist, launched his campaign in Boston on April 19 to a packed room of 1,000 supporters.He was cheered on by his wife, Curb Your Enthusiasm actress Cheryl Hines, but he was not accompanied by many of his family who have either publicly disagreed with him for his views, or are working for Joe Biden's White House.Kennedy is the nephew of former President John F Kennedy and son of former US attorney general Robert Kennedy, who was assassinated in 1968 during his own run for the Presidency.For decades Kennedy was a renowned environmental lawyer and worked as a senior attorney for the nonprofit Natural Resources Defense Council among other high profile roles.More recently he has become one of the faces of vaccine skepticism and his anti-vaccine group, Children's Health Defense, has had its accounts removed by Facebook and Instagram for spreading misinformation.",
        "Kennedy said he was running because 'our country is being stolen from us'.'Both political parties are captive to corporate interests,' he said. 'There's this merger of state and corporate power.'I want a Democratic party to act consistently with its traditional values'.Kennedy said he wanted to end political polarization and believed that the 'key is telling the truth to Americans'.He said: 'My father ran in a time of great polarization and he was able to bring people together.'On the last day of his life he won both the most rural state in America and the most urban state and he was able to unify blacks, whites and Hispanics and the entire cross section of the American public.'I think we can do that again'.Were he to win the nomination, Kennedy would take on likely Republican nominee Donald Trump by 'holding him responsible for the lockdowns' during the Covid-19 pandemic, he said."
    ]
}