{
    "articleURL": "/wires/pa/article-12046911/Good-case-party-involvement-BBC-chair-appointment-says-Lord-Patten.html",
    "content": [
        "A former BBC Trust chairman has suggested that there could be merit in reforming how the next chair of the broadcaster is appointed, following the resignation of Richard Sharp.",
        "Mr Sharp’s resignation from the position came after he was found to have broken the rules by failing to disclose he played a part in getting Boris Johnson an £800,000 loan guarantee.Lord Patten, who said that Mr Sharp did the “right and sensible” thing in quitting following a report by barrister Adam Heppinstall KC, was asked on BBC Radio 4’s World At One programme whether the Government should have the last word on who chairs the broadcaster.“I think the case has been made very strongly and very well that the Government should go along with the idea to have a sort of all-party basis for making an appointment.“But on the whole, chairmen of the BBC have done pretty good jobs, even though very few of them have been in a position where they could help secure a loan for the Prime Minister.”The role is currently decided through an open competition of candidates who are interviewed by an advisory panel, but the Prime Minister ultimately has the final say.",
        "On Mr Sharp, the peer said: “I do think that his view of what constituted a perception of a conflict of interest, and the perception that I would have and many others would have, and that the select committee of the House of Commons would have… I think there is a difference there, which would have always been rather difficult to bridge.",
        "“So, I think he did the right and sensible thing.”Lord Patten, who chaired the BBC Trust between 2011 and 2014, said he hoped that the controversy had not damaged trust in the BBC.“One of the things which is most important for the future of an open society, of a liberal society in this country, is to continue to have a world-renowned public service broadcaster, and it’s really important that we continue to defend it and we give it more money to do what is an incredibly important job,” he said."
    ]
}