{
    "articleURL": "/sport/football/article-12055737/Josef-Martinez-sets-scoring-record-100th-MLS-goal-power-Inter-Miami-second-straight-win.html",
    "content": [
        "Prior to Saturday night's game, Martinez had not scored an MLS goal for MIA Martinez scored 98 MLS goals for his former MLS organization, Atlanta United DailyMail.com provides all the latest international sports news Josef Martinez scored twice in his first game against his former team to reach the MLS 100-goal benchmark and lift Inter Miami to a 2-1 victory over visiting Atlanta United on Saturday night.",
        "Martinez's first two goals since leaving Atlanta and joining Miami lifted the Herons to a second consecutive victory following six straight defeats.His first came from the penalty spot in the 59th minute only moments after entering the game as a substitute. His second was a far more difficult sliding, one-touch finish past Atlanta goalkeeper Quentin Westberg after reaching a pass from DeAndre Yedlin.Miami (4-6-0, 12 points) had to hold on from there after Franco Negri received a red card for a studs-up challenge in the 84th minute following a video review.Andre Gutman pulled a late goal back for Atlanta (5-3-3, 18 points) with a near-post header of Brooks Lennon's corner kick in second-half stoppage time.",
        "That helped the visitors avoid their first offensive shutout of the season, but they couldn't avoid a third away defeat and second in a row.Martinez spent six years as a player for Atlanta, starting in the team's expansion MLS season in 2017, scoring his first 98 MLS goals there and helping the club win the 2018 MLS Cup and 2019 U.S. Open Cup.But he tore his ACL in the 2020 season opener, missing the remainder of that campaign, and has not regained his former form since despite scoring 21 times for Atlanta across 2021 and 2022.",
        "Atlanta exercised a contract buyout option this offseason, allowing Miami to sign him as a free agent, but he had lost his starting role once Leonardo Campana recovered from an early season injury.Yet manager Phil Neville opted to insert Martinez in the 57th minute. And he was given an opportunity to get off the mark with his first kick of the game after Atlanta's Machop Chol took down David Ruiz.Martinez stepped up and hammered his penalty past Westberg's dive.His second came when Yedlin took down a high-arcing clearance neatly, turned and saw Martinez running into the penalty area. Yedlin slotted the diagonal pass, and Martinez instinctively slid to poke from a tight angle between the charging Westberg and the far left post.Elsewhere Saturday, the league's most recent Player of the Month, Cristian Espinoza, scored two goals to lead the San Jose Earthquakes to a 2-1 win over Los Angeles FC -- its first loss of the season. Wayne Rooney's D.C. United were beaten 2-1 after Luciano Acosta had a goal and an assist to power the Eastern Conference high-flyers to another three points.An own-goal by Orlando City's Robin Jansson helped CF Montreal went on to post a 2-0 victory. Bobby Wood scored a first-half goal before DeJuan Jones found the net in the second half as New England dispatched Toronto FC 2-0. ",
        "Dániel Gazdag scored a first-half penalty kick as the Philadelphia Union edged the New York Red Bulls 1-0. It was a bad night all round for New York, with NYCFC losing 3-2 after Enzo Copetti scored twice in the first half and Charlotte FC used an own-goal by Richard Ledezma in the second half to win.Hany Mukhtar recorded his third career hat trick, highlighted by penalty kicks on either side of halftime as Nashville secured a dominating 3-0 win vs. Chicago. Colorado climbed further away from the bottom teams with a 3-1 win vs. the rudderless LA Galaxy. Brian White scored a brace as Vancouver toppled Minnesota in a thrilling 3-2 contest. Will Bruin scored a stoppage time equalizer for FC Austin as they grabbed a point away to Portland in a 2-2 game.There was a scoreless tie between the Dynamo vs. Real Salt Lake, while FC Dallas and St. Louis had their game postponed following lightning strikes. The inclement weather sent the two teams off the field in the 50th minute. The match will be resumed where it left off at a date to be determined."
    ]
}