{
    "articleURL": "/wires/pa/article-12040867/Jenson-Button-expects-Lewis-Hamilton-sign-new-Mercedes-deal.html",
    "content": [
        "Jenson Button believes Lewis Hamilton will sign a new deal with Mercedes because he remains “hungry” to win his record eighth world championship.",
        "Speaking before the start of the season, Button, the 2009 world champion, suggested Hamilton will only extend his contract – which expires at the end of the year – if Mercedes can provide him with a winning car.Hamilton finished sixth last weekend in Azerbaijan and already trails championship leader Max Verstappen by 45 after just four rounds, with the Dutchman’s Red Bull team in a league of their own this year.However, Button, 43, said: “I don’t think Lewis is going to walk away from the sport.“As a racing driver, if you have been winning for so long and then you are suddenly not, you want to fight back to winning ways. You are not going to retire.“If you are in a bad car for many years, you want to retire because it just gets you down, but Lewis is not in a bad car. He is just in a car that is not as good as what he has been used to, and I get that.“But he knows the strength of the team, he knows how quick he still is, so he is going to work with this team to get back to fighting with Red Bull, and they will. It probably won't be this year, but in 2024, we will see Lewis on the grid. He is still hungry to win another world championship  Jenson Button  ",
        "“It probably won’t be this year, but in 2024, we will see Lewis on the grid. He is still hungry to win another world championship.”Verstappen remains the overwhelming favourite to win his third consecutive title despite Sergio Perez moving to within six points of his Red Bull team-mate after winning the sprint race and Grand Prix in Baku.And Button said another victory at Sunday’s Miami Grand Prix will fuel Perez with confidence that he can beat Verstappen to the title.",
        "“I’ve been really impressed with Sergio,” added Button.“Max has to be the toughest team-mate because he just goes out there and gets it done.“Consistency is where Sergio has been lacking, but if he can do it in Miami, which like Baku is a street race, too, he has a chance to fight for the championship.“I didn’t think I would be saying that, I really didn’t, but it is good for the sport. Red Bull has an advantage at the moment and we need both of them to be fighting it out.”"
    ]
}