{
    "articleURL": "/wires/pa/article-12050479/Sam-Allardyce-asks-Leeds-season-s-best-Man-City.html",
    "content": [
        "Sam Allardyce has urged Leeds to produce their best defensive display of the season in his first game in charge on Saturday at Manchester City.",
        "The former England boss, 68, has four games remaining to try and preserve Leeds’ Premier League status after replacing Javi Gracia on Wednesday.Allardyce, who will be back in the dugout for the first time since leaving West Brom in 2021, said: “Defensively the team will have to be the best it’s been this season.“Obviously it’s been a bit frail and we’re going to try and put that right while we’ve been here.“In possession I’ve always seen them to be very, very good, so there’s not a lot of work needs to be done from that point of view.“But out of possession recently, as everyone can see by the goals conceded, it’s something that needs most work on in the short time we’ve had.” The sad thing for us is they’re in the best form they’ve been in all season  Sam Allardyce on Man City  Leeds sit above the relegation zone on goal difference and the former Bolton, Newcastle, West Ham, Sunderland and Everton boss said he was delighted with the players’ reaction to his survival plan.“I couldn’t be more pleased,” he said. “The players have aired their views and that’s important for me.“We’ve come together and put a plan together. We’ve analysed the best way we can play on Saturday and listened to a lot of staff already here about players.",
        "“We’ve formulated an idea and we’ll tell them the starting XI later (on Friday) morning.“They’ve got to do the talking on the pitch now. I can talk here as much as I want, but I want the players to go out and show we’ve made a difference and that they’re passionate enough to fight to the very end.”",
        "Allardyce insists Pep Guardiola’s City, who he rates alongside Manchester United’s Treble-winners of 1999 as the best ever in the English top flight, are closing in on their fifth title in six seasons because of how they defend.“Why are Man City top of the league? Because they’ve got the best defensive record,” he said.“City, defensively, are the best at everything. The general public don’t look at that, but that’s why they’re top now.”Allardyce claimed earlier in the week that he was as good a manager as Guardiola, Jurgen Klopp and Mikel Arteta and in response the City boss agreed.Guardiola said the current generation of top managers had all learned off the likes of Allardyce, Roy Hodgson and Neil Warnock.“We’ve always got on,” Allardyce added. “He’s a great guy and his knowledge is fantastic. It’s great to be pitting your wits against him.“His management style over the years has been fabulous and the sad thing for us is they’re in the best form they’ve been in all season because they’ve won nine on the trot.”",
        "Allardyce, who will be without Tyler Adams, Luis Sinisterra and Liam Cooper at the Etihad Stadium, admitted he will be anxious ahead of kick-off.He will return to the dugout for the first time since being relegated from the top flight for the first time in his 30-year managerial career with last club West Brom at the end of the 2020-21 season.Allardyce added: “The nerves carry on until kick-off, then they disappear for me.“After the game, who knows, I’d like to be able to smile. That would be one magnificent result, if we get one.”"
    ]
}