{
    "articleURL": "/wires/pa/article-12051001/No-conspiracy-Ireland-s-new-hate-speech-laws-says-justice-minister.html",
    "content": [
        "An Irish Government minister has insisted there is no conspiracy behind new hate speech laws as he dismissed criticism levelled by Donald Trump Jnr and Elon Musk.",
        "Justice minister Simon Harris said when someone from the Trump family or Mr Musk took a contrary view it was “not a bad day at the office”.Mr Harris said people portraying the new legislation as an attempt to police thought were seeking to misrepresent the intent of the laws. Funnily enough, I don't take my political philosophy from the Trump family or from Mr Musk or his associates  Simon Harris  Earlier in the week Mr Trump Jnr described the Criminal Justice (Incitement to Violence or Hatred and Hate Offences) Bill 2022 as “insane” while Twitter owner Mr Musk said it was “very concerning”.The Bill, which is progressing through the Irish parliament’s upper house, the Seanad, having passed in the Dail, is the first specific legislation to deal with hate crime in Ireland.It is designed to make it easier to secure prosecutions for crimes targeting “protected characteristics” such as race or sexual identity. It includes provisions to prosecute people for hate speech or possessing hateful material.On Friday, Mr Harris was asked about the issue at the opening of a new Garda call-handling facility in Dublin city centre.",
        "“Any time Donald Trump and Elon Musk have a different view to you is not a bad day at the office,” he said.",
        "“And, funnily enough, I don’t take my political philosophy from the Trump family or from Mr Musk or his associates.“The reality here is there’s people trying to overstate things here for whatever reason. That’s fine, we live in a democracy and let people have their debate.“This legislation went to Dail Eireann. There’s not much that the Opposition and the Government agree on, (yet) overwhelmingly the Dail passed this legislation, because it’s not about policing thought, it’s not about stopping freedom of expression.",
        "“What it is about though is keeping people safe and making sure that people can go about their lives and not be discriminated against and have a result of that discrimination seeing them often be physically assaulted, or incitement to hatred in relation to them.”Mr Harris said critics need to “take a little step back” and consider what the Bill contains.“Freedom of speech, freedom of expression – these are protected rights. We have a constitution, and we’re members of the European Union, we’re proud members of the United Nations,” he said. It's absolutely your right to say offensive things... but it's... absolutely not your right to say something that incites hatred or danger towards another person  Simon Harris  “This is a country where only as recently as this week you saw in the new press freedom survey Ireland go up four places. We’re seeing our defamation laws be reformed.",
        "“This is a country that values free speech and indeed I even said myself when speaking at committee stage on this legislation, it’s absolutely your right to say offensive things, that’s absolutely your right in a democracy, but it’s not your right, absolutely not your right, to say something that incites hatred or danger towards another person, absolutely not your right to try and whip up homophobic activity and violence, homophobic violence against people, it’s absolutely not your right.“And when you talk to people who are often subject to such attacks, I think they’ll tell you what they see and what they feel when it comes to hate speech.“So there’s been an attempt by some, for whatever reason, to go about misrepresenting that. Best wishes to them, it’s their right in a democracy to do that.“But when you see Donald Trump, junior or senior, whatever, a member of the Trump family and Elon Musk opposing your legislation, and when you say Fine Gael, Fianna Fail and the Greens (government parties) and Sinn Fein, Labour (opposition parties), all these people coming together to vote in favour of something, you know there’s no conspiracy here.”"
    ]
}