{
    "articleURL": "/wires/ap/article-12048395/Facing-Canes-Devils-erase-bad-start.html",
    "content": [
        "John Marino knew enough to steer clear of social media after the New Jersey Devils' rough start for the second straight playoff series.",
        "Instead, the defenseman focused on figuring out how to get back to the Devils' game, which was good enough to dig them out of a first-round hole against the New York Rangers. And it's needed again now against the Carolina Hurricanes entering Game 2 of the best-of-seven series.\"We don't want to get to that point again, going down 0-2 again for sure,\" Marino said Thursday before the Devils and Hurricanes meet in the lone playoff game on the NHL schedule Friday night.\"There are so many highs and lows, but you want to stay away from what you see online, all the media and stuff like you guys,\" he told reporters with a chuckle. \"You just want to go back to your game and go back to the winning hockey that we were playing.\"The Devils erased an 0-2 deficit against the Rangers, with both of those losses coming by 5-1 scores on home ice, before grinding out a seven-game series win. On Wednesday night, they lost on the road by the same score against a Hurricanes team that edged them for the Metropolitan Division title.Most alarmingly, Carolina's suffocating effort had New Jersey finding little open-ice space and managing a single shot on goal in the opening 20 minutes. The Hurricanes went on to take a 3-0 lead and chase 22-year-old goaltender Akira Schmid less than two minutes into the second period.",
        "It was the kind of start that the Hurricanes admitted couldn't have been scripted better, though one that will demand a relentless edge to repeat Friday night.\"It's going to take every guy,\" Carolina defenseman Jalen Chatfield said. \"It's been like that the whole year. We know what we've got to do: we've got to work here if we want to win. We've got to play hard and be ready.\"The slow start came with the Devils playing less than 48 hours after an emotional Game 7 win against the Rangers. Coach Lindy Ruff originally said he liked the idea of jumping right into the next series to keep rolling, but that was before that anemic first period on the way to a playoff-low 18 shots.\"You can call it a Game 7 hangover, you can call it a tough turnaround, not a lot of time in between,\" Ruff said.The Devils could at least point to the fact they did a better job of establishing possession in Carolina's zone in the second period to create quality scoring chances.Putting more pucks on net in Game 2 to keep the pressure on instead of being what Ruff called \"too cute\" with possessions would help. So too would using the Devils' speed to get Carolina on the defensive instead of building momentum with its aggressive forecheck.",
        "Ruff wouldn't say whether Schmid would start or Vitek Vanecek, who allowed one goal on 11 shots in relief in Game 1. It's also unclear whether trade acquisition Timo Meier is ready to go after missing the opener; Ruff said he remains day-to-day after being knocked from Monday's Game 7 win against the Rangers on a huge hit from forward Jacob Trouba.\"They haven´t seen our best yet,\" Devils forward Miles Wood said. \"Our compete on pucks wasn´t exactly there. From a man to a man, we can get a lot more.\"___Follow Aaron Beard on Twitter at http://www.twitter.com/aaronbeardap___AP NHL Playoffs: https://apnews.com/hub/stanley-cup and https://twitter.com/AP_Sports"
    ]
}