{
    "articleURL": "/sport/nfl/article-12047515/Ex-NFL-star-Taylor-Lewan-sues-Dr-James-Andrews-botched-2020-ACL-surgery-right-knee.html",
    "content": [
        "The 31-year-old sustained the ACL tear in his right knee vs. the Texans in 2020Lewan recently opened up on his struggles since the surgery three years agoDailyMail.com provides all the latest international sports news Ex-Tennessee Titans left tackle Taylor Lewan has claimed that a well-known sports doctor cut his NFL career short by 'negligently failing to properly repair all injuries' during surgery on the ACL in his right knee in 2020. ",
        "The 31-year-old filed a lawsuit against Dr. James Andrews on Monday in Florida, almost three years after going down in a game against the Houston Texans.The three-time Pro Bowler (2016-18) has accused Andrews of damaging cartilage, and going wrong on creating the right tunnel position in his knee among other things in court documents obtained by DailyMail.com. He also claims that the 80-year-old didn't fix all of his injuries during the procedure. Lewan added that he is suffering from permanent pain and disability, which ended his eight-year spell in the NFL, from 2014-2022. ",
        "The 11th pick of the first round of the 2014 NFL Draft is looking for compensation of damages done by Andrews, who's performed surgeries on several sports stars, such as Michael Jordan, Brett Favre and Sharrif Floyd in the past, though the latter sued the doctor for $180million after 'suffering career-ending nerve and muscle damage during knee surgery.'What's more is that Lewin was in the middle of a five-year, $80m contract in 2020 before going under the knife. Andrews is a popular orthopedic surgeon among American athletes and particularly in the NFL too. He has close ties with the Washington Commanders, the Tampa Bay Rays and the Auburn Tigers. ",
        "Earlier in May, Lewan shared a few of his thoughts on the botched surgery, on his podcast, Bussin' With The Boys. The former NFL offensive linesman was released by the Titans in February.",
        "'Since 2020, it's sucked. It's been tough. I would love to sit here and vent… but the reality is, I just can't right now,' he said. 'When I can I will definitely share more when I'm able to.' One of the league's best rookies in 2014, Lewin only played in 15 games following the procedure. He reinjured his right knee in Week 2 last season. The California-native has yet to officially retire, but based on his situation and his recent comments, it only seems like a matter of time until he announces that he's hanging up his cleats for good. "
    ]
}