{
    "articleURL": "/wires/ap/article-12055281/Madrigals-two-run-single-lifts-Cubs-Marlins-4-2.html",
    "content": [
        "CHICAGO (AP) - Nick Madrigal´s two-run single in the eighth inning lifted the Chicago Cubs to a 4-2 win over the Miami Marlins on Saturday.",
        "Jorge Soler hit a solo homer for the Marlins, who´ve dropped five in a row since sweeping the Cubs last weekend in Miami.Madrigal´s go-ahead hit off A.J. Puk (3-1) gave the Cubs their first lead. The next batter, pinch-hitter Miguel Amaya, followed with an RBI single - his first career hit.\"I think any kid growing up dreams of those situations,\" Madrigal said. \"I definitely want to be the guy in those situations.\" Two of the three runs charged to Puk were unearned thanks to Yuli Gurriel´s inning-opening fielding error\"Outfielder Peyton Burdick also made an error in the eighth.\"(Our pitchers) were all good,\" he said. \"They all did their jobs; it just (stinks) I didn´t do mine.\"",
        "Reliever Keegan Thompson (2-2) pitched three innings for the win and Adbert Alzolay worked the ninth for his first save of the season.Marlins reliever Matt Barnes - named the starter a few hours before the game - pitched the first inning before giving way to the bullpen, which hummed along until the seventh, where the Cubs loaded the bases before Huascar Brazoban struck out Seiya Suzuki to end the inning.Puk, the sixth Miami pitcher, wasn´t as lucky.Chicago´s Drew Smyly, who´d won three of his last four starts, gave up both Miami runs in the first 3 1/3 innings. He finished an early day with three hits, three walks and five strikeouts.",
        "CUETO LEAVES EARLYMarlins RHP Johnny Cueto left a rehab start for Triple-A Jacksonville on Saturday after falling while trying to cover first base. It´s not clear if this will delay his return to the big-league club. Cueto, who lasted just an inning in his only start this season, has been on the 15-day injured list since April 4 with right biceps tightness.HAPPY ANNIVERSARYKerry Wood was on the mound to throw out the first pitch exactly 25 years after tying a major-league record by striking out 20 Houston batters at Wrigley Field. Roger Clemens (twice), Randy Johnson and Max Scherzer are the only other pitchers to claim the rare feat. Wood also led the seventh-inning-stretch singalong.TRAINER´S ROOMMarlins: Manager Skip Schumaker said reliever JT Chargois (right oblique strain) felt good after Friday´s rehab outing for Low-A Jupiter but did not speculate when he´d return from the 15-day injured list. ... Barnes made his third career start and first since Aug. 22, 2015, for Boston.Cubs: Kyle Hendricks (shoulder strain) said he felt good after throwing a bullpen session before the game. The right-hander is scheduled to make a rehab start for Triple-A Iowa on Tuesday and expects to do it again five days later.UP NEXT Miami´s Sandy Alcantara (1-3, 5.09) faces fellow right-hander Hayden Wesneski (2-1, 4.45) in Sunday afternoon´s series finale.",
        "___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}