{
    "articleURL": "/wires/ap/article-12048831/F1-star-Lewis-Hamilton-blasts-Floridas-anti-LBGTQ-measures.html",
    "content": [
        "MIAMI GARDENS, Fla. (AP) - Seven-time Formula One champion Lewis Hamilton lashed out Thursday at anti-LGBTQ measures enacted by Florida lawmakers and ripped the state's controversial \"Don´t Say Gay\" law with a reference to oppression seen in Saudi Arabia.",
        "\"It´s not good at all,\" Hamilton said ahead of F1´s highly anticipated race in suburban Miami this weekend. \"I stand by those within the community here. I hope they continue to stand firm and push back. I´ll have the rainbow on my helmet. It´s no different to when we were in Saudi.\"Hamilton, F1´s only Black driver, regularly uses his platform to speak on issues of social justice and race, human rights and protection of the LBGTQ community. The 38-year-old Briton speaks out while racing in countries with questionable human rights records - including Saudi Arabia -- or when an issue arises in which he feels his voice can lend support.The comments come just three days before the first of F1´s unprecedented three stops in the United States this season and amid surging interest in the racing series among Americans. The other stops are in Austin, Texas, and Las Vegas.Hamilton often races with a rainbow flag on his helmet, specifically when F1 stops at venues located in countries with restrictive laws. There was no on-track activity Thursday, and Hamilton wore a Tommy Hilfiger two-piece blue set that had red and white accents to commemorate being in the United States.Republican Gov. Ron DeSantis signed the Parental Rights in Education bill into state law at the end of March. The measure, since widened, prohibits public school teachers to teach pupils about sexual orientation or gender identity. Although Hamilton is against it, the veteran Mercedes driver would not say if F1 should avoid racing in Florida because of its social policies.",
        "\"It´s not for me to decide something like that,\" Hamilton said. \"I did hear and have read about some of the decisions that have been made in government here and I do not agree with it and I do not support it. I really do continue to stand with the LGBTQ community and I´m wearing a rainbow flag on my helmet this weekend and I just really want to continue to support the community here and let them know I stand with them and I hope they continue to fight against it.\"It´s not the people of Miami that are making these decisions, it´s the people in government and that´s the issue,\" he added. \"I think, hopefully, all I can do - the sport is going to be here whether I am or not - but the least I can do is just continue to be supportive and just being here and having that on my helmet, hopefully that speaks well to the subject.\"Before last year's inaugural Miami Grand Prix, Hamilton dipped into the Roe v. Wade debate and hosted former first lady Michelle Obama in his pit for practice and qualifying.\"I love being in the States, but I can´t ignore what´s going on right now and what some in the government are trying to do to the women who live here,\" Hamilton said then, ahead of the Supreme Court decision to end the nationwide right to legal abortion. \"Everyone should have the right to choose what they do with their bodies. We can´t let that choice be taken away.\"",
        "Formula One´s governing body at the start of the year said drivers would be prohibited from speaking out on social justice issues at events. The drivers pushed back and the FIA clarified its position to allow drivers to respond to questions. Hamilton on Thursday was asked about Florida´s laws, but had previously said he wasn't going to be follow the FIA guidance.Hamilton became the first Black race winner in F1 in 2008. Now in the final year of his contract with Mercedes, Hamilton is the winningest driver in series history and is tied with Michael Schumacher with a record seven titles.___More AP auto racing: https://apnews.com/hub/auto-racing and https://twitter.com/AP_Sports"
    ]
}