{
    "articleURL": "/femail/article-12047379/How-OnlyFans-driving-women-insane-dangerous-surgeries.html",
    "content": [
        "There's no denying more people are turning to social media to make a livingMore people are looking to stand out, turning to extreme plastic surgeryA NY plastic surgeon said he was seeing people 'certainly pushing the envelope'There's no denying the rise of more people turning to social media to make a living - with the emergence of not only the influencer, but adult site OnlyFans.",
        "With this market becoming increasingly saturated, more people are looking for a point of difference to set them apart from the crowd - with some turning to extreme plastic surgery procedures to give them larger breasts, lips and even vaginas.One OnlyFans model who has made headlines for her enhancements is Mary Magdalene. The Mexican-born influencer reportedly became so addicted to cosmetic procedures that she was forced to beg fans to help her buy a mobility scooter as her body was breaking down under the weight of her implants.",
        "Mary, who boasts 10kg breast implants and 'the world's fattest vagina', may be wheelchair-bound for life as her ankles and back struggle to support her surgically altered body.Sometimes things can take an even more tragic turn, as was the case of Kim Kardashian lookalike Christina Ashten Gourkani, a 34-year-old model who went by Ashten G online, who died after going into cardiac arrest following a plastic surgery procedure.Dr. David Shafer, who is a New York-based double board certified plastic surgeon, told DailyMail.com that he was seeing people 'certainly pushing the envelope' when it came to cosmetic procedures.'Having over exaggerated features certainly attracts social media attention. Filters don't help the situation as they blur the lines between reality and fantasy,' Dr. Shafer, who is owner and founder of Shafer Clinic Fifth Avenue, said.",
        "'People are certainly pushing the envelope, but this is where the responsibility of the plastic surgeon is important. Sometimes, and more often than you would think, we have to say no to patients.'He said some of the most common procedures requested by his patients were breast and butt enhancements, including the Brazilian butt lift (BBL).Dr. Shafer said a breast enhancement was a great procedure to give 'people confidence they did not have previously,' but added: 'Too much of something is never good.'He also warned people of the dangers of overdoing it.",
        "Breast implants The New York plastic surgeon said 'if the implants are too large or too heavy they can stretch the skin, causing ptosis or drooping of the breast.''If the implants are placed too close together the patient can end up with a \"uniboob\" or one pocket with both implants in it. If the skin is stretched too thin the implants can actually extrude or come out of the pocket.'Butt enhancements If too much fat is placed into an area that's too small, the fat can die and form cysts or lumps.'Patients can end up with asymmetry. If illegal substances are injected in the buttocks such as silicone there can be infection, migration of the filler and deformity which is impossible to fix,' Dr. Shafer added.Fillers A moderate amount for lip and cheek fillers will give people a 'nice and natural appearance,' Dr Shafer said.'However, too much filler can lead to deformity and unnatural appearance,' he added.'The hyaluronic acid fillers such as Juvederm can be melted to remove them. However other fillers and silicone are very difficult or impossible to correct. If fillers are inadvertently injected into a blood vessel it can lead to skin necrosis or a scab over the area.'",
        "'If the implants are too big or heavy, they can stretch the skin or displace and then the patient ends up needing more surgery to replace the implants and remove the stretched skin,' he told DailyMail.com.As for the BBL, he said it was a tougher procedure to perform on 'very thin people' as they had less fat to work with.'The most common procedure is a surgical BBL with liposuction to harvest the fat and then injecting the fat in their buttocks to lift and plump,' Dr. Shafer explained.'The amount of fat and enhancement depends on the patient's anatomy - it's very easy to give a curvy person more curves because they have plenty of fat to transfer.'In the case of a more petite person, Dr. Shafer said patients can be injected with dermal fillers, 'such as Juvederm Voluma, Sculptra or Radiesse.''However, this can sometimes be cost prohibitive as many syringes are required to have an appreciable effect,' he said.'Other anatomical areas people look to enhance are their lips, cheeks and jawline. However, the same rule holds true as a little is good and more is not necessarily better.'Despite a majority of surgeries being successful and a 'very high satisfaction rate' in patients, Dr. Shafer reminded people: 'There are true risks with any surgery.",
        "'As surgeons we are constantly analyzing and discussing and evaluating ways to make procedures safer and the patient experience better. 'Certainly when the limits are pushed or patients are not good candidates or multiple revision surgeries are required then the risks can increase dramatically. 'That is why seeing an experienced board certified plastic surgeon who operates in an accredited facility is of utmost importance.'He also warned people off traveling to overseas to undergo surgery 'at a cheaper rate,' describing the practice as 'dangerous.'",
        "'The credentials of the surgeon and facilities are not certain, the standards of the facility and recovery centers are questionable and the follow up care is very difficult,' Dr. Shafer said.'I often see patients that went to other countries for surgery and then end up in my office looking for revisions or wound care from surgery mishaps.'And what is the most dangerous plastic surgery procedure of them all? 'Statistically the BBL procedure has the highest complication rate... There are new protocols and restrictions in place to help reduce complications,' Dr. Shafer said.'Breast implant surgery does have a higher revision rate than other surgeries as well. Most revisions are due to patient size preference but sometimes due to capsular contracture, asymmetry or drooping of the implants or overlying breast tissue.'",
        "To reduce the risk of complications, Dr. Shafer advises people against being 'wooed' by 'Instagram-famous' doctors who may 'have good social media skills but little surgical experience.''If it seems too good to be true, there is probably something you don't understand,' the plastic surgeon said.'Make sure you meet with your doctor to discuss your goals and risks and benefits of the surgery. Also make sure you understand the recovery required as most surgeries do require specific recovery plans.'",
        "Dr. Shafer also lifted the lid on what precautions he takes to make sure a procedure isn't take too far. 'We have general guidelines of what is acceptable. For breast surgery I use VECTRA 3D computer analysis which uses 3D computer technology to analyze the patient’s anatomy to determine which size implants will work best,' he explained.'We then give the patient a range of options. The technology also allows the patient to see their results on their own 3D image which is very helpful. 'However, I also have the patient try the implant in their bra and walk around so they will know how the added volume and weight will feel. Big implants can get very heavy. 'For the most part, surgeons are going to do their best to achieve the best and safest results for their patients. Patients need to make sure they feel comfortable with the surgeon and office stay and make sure they have asked all their questions and received satisfactory answers before proceeding to surgery. ",
        "'It's also important to not only limit the extent of surgery but also the number of surgeries performed at the same time. It's best to stage procedures to separate dates if too many are requested for if the length of the procedure will extend past six hours.'"
    ]
}