{
    "articleURL": "/sport/mlb/article-12046715/My-ball-Yankees-Harrison-Bader-Isaiah-Kiner-Falefa-smash-outfield.html",
    "content": [
        "Bader dove to make a play on the ball, colliding into Kiner-Falefa and going off Yankees infielder Oswald Peraza was also injured while he was pinch runningDailyMail.com provides all the latest international sports news The already injury-prone New York Yankees could be dealing with two more absences after last night's ten-inning victory over the Guardians.",
        "In the top of the ninth inning with Oscar Gonzalez at the plate and a man on second, the Yankees' closer Clay Holmes delivered on a 1-1 pitch with two outs.Gonzalez popped the ball up to center field and that saw centerfielder Harrison Bader, leftfielder Isaiah Kiner-Falefa, and shortstop Anthony Volpe to run after the ball in shallow left-center field.Volpe backed up as he noticed Bader and Kiner-Falefa making the effort to catch the ball. As Bader dove headfirst to make an effort to catch the ball, Kiner-Falefa slid in and collided with the centerfielder's head.",
        "Neither player was able to catch the ball to end the inning and the runner from second scored to make it 3-2 Cleveland. Meanwhile, Bader stayed down in the outfield - requiring the assistance of the Yankees' medical staff.He was helped off the field by the staff and the Yankees were forced to replace him on defense. IKF was shifted to center field in Bader's place while Oswaldo Cabrera took over fielding duties in left field. New York got out of that inning without any further damage.In the bottom of the ninth inning, down by a run, Anthony Rizzo hit a single for the Yankees and was replaced by Oswald Peraza as a pinch runner.",
        "Peraza stole second, but went into the base awkwardly, trying to make it a stand-up steal instead of sliding into the bag.As Andres Gimenez tried to tag Peraza, he rolled his ankle at the bag and was seen grabbing at it.Peraza was taken out of the game and Aaron Hicks came in as the pinch runner for the team - scoring on a Willie Calhoun single.",
        "The Yankees eventually won the game in extra innings thanks to a Jose Trevino single that scored Cabrera from third base. After the game, Boone said that Bader is expected to be fine after taking Kiner-Falefa's knee to the head. However, Peraza is going to receive X-rays on his ankle to check for further damage.It's yet another injury blow to a Yankees team that has been burdened with injuries all over their roster. Star sluggers Aaron Judge and Giancarlo Stanton are both in the 10-day-IL while starting pitchers Carlos Rodon and Luis Severino are both on the 15-day-list. Other injured Yankees include third-baseman Josh Donaldson.The Yankees travel to Tampa Bay to take on the AL East leading Rays in a three game series this weekend."
    ]
}