{
    "articleURL": "/tvshowbiz/article-12061097/Lala-Kent-says-Kim-Zolciak-split-reinforces-remain-single-signs-CAA.html",
    "content": [
        "Vanderpump Rules star Lala Kent says the split of Kim Zolciak and Kroy Biermann has reinforced her will to remain single.",
        "The 32-year-old reality star took to Instagram Stories on Monday to comment on the breakup of her Bravo peers, saying, 'I just saw the news about Kroy Biermann and Kim getting divorced and I have to say, so devastating, right?'The Salt Lake City native added, 'Never like to see that, especially kids being involved makes me sad.'Kent - who is mother to daughter Ocean, two, with former fiancé Randall Emmett, 52 - said that seeing the split 'just puts another co-sign on what I want in my life - which is no partner; no partner, not happening, not happening.'Kent, whose contentious split with Emmett made headlines in the fall of 2021, said she wasn't interested in any gambles on love moving forward.",
        "'I can control me - I can't control other people, right?' she said. 'When you tell me, \"Here's an intimate partner, you guys get along, maybe you'll last forever, maybe they'll tell you everything all the time,\" that says to me, \"Liability\" - I don't like liabilities.'Kent spoke out amid the news of Real Housewives of Atlanta alum Zolciak, 44, filing for divorce from former Atlanta Falcons defender Biermann, 37, following an 11-year marriage.The Don't Be Tardy star said that she and Biermann - who are parents to Kroy Jagger, 11, Kash, 10, and twins Kane and Kaia, nine - parted ways April 30, TMZ reported after reviewing court docs.",
        "Biermann adopted Zolciak's older children from previous relationships - Brielle, 26, and Ariana Biermann, 21 - when they were minors in the couple's earlier years.The announcement of the parting came after the outlet reported that the couple had a tax debt eclipsing $1,000,000.In related news, Kent inked a contract with the agency CAA, the agency announced Monday, according to Deadline. The business arrangement comes as Kent is in her ninth season of the popular reality series Vanderpump Rules, which chronicles the lives of staffers at establishments owned by The Real Housewives of Beverly Hills star Lisa Vanderpump.",
        "Kent was a part of the group that was named the Best Reality On-Screen Team at the MTV Movie &amp; TV Awards Sunday, along with Ariana Madix, Katie Maloney and Scheana Shay.Kent has also ventured into the beauty and lifestyle business with the brands Give Them Lala Beauty, Give Them Lala Skin and Give Them Lala Baby.In 2021, she came out with the book Give Them Lala, and hosts a podcast of the same name."
    ]
}