{
    "articleURL": "/tvshowbiz/article-12039753/Jock-Zonfrillo-death-curse-MasterChef-Australia-explained.html",
    "content": [
        "MasterChef has been plagued by a string of scandals and tragedies over the years, culminating last week with the tragic death of Jock Zonfrillo from natural causes.",
        "Ever since its inception in 2009, the hosts and contestants of the Channel Ten cooking program have faced dark times and negative headlines.From public spats and courtroom dramas to a failed restaurant empire, Daily Mail Australia takes a look inside the show's troubled legacy.Original hosts sacked in a pay disputeThe MasterChef franchise was plunged into chaos in 2019 when its long-serving judges Matt Preston, Gary Mehigan and George Calombaris were axed.",
        "The trio, who had appeared on MasterChef for eleven years, exited the show after Ten refused to give them a salary increase.The judges were hoping for a 40 per cent pay rise, which would have seen them earn $1.5million each for a 'guaranteed two years', but the network wouldn't budge.Instead, they were replaced by new judges Andy Allen, Jock Zonfrillo and Melissa Leong in 2020. ",
        "Preston and Mehigan  jumped ship to Seven, where they hosted the short-lived cooking show Plate of Origin alongside My Kitchen Rules star Manu Feildel.The announcement followed revelations Calombaris' restaurant empire had underpaid its employees by nearly $8million.George Calombaris' wage scandalEx-MasterChef judge George Calombaris fell from grace three years ago after he lost his hospitality company MAdE Establishment to liquidators.MAdE, which had 22 companies, collapsed in February 2020 after being ordered by the Fair Work Ombudsman to pay workers $7.8million in unpaid penalty rates.",
        "Calombaris was personally hit with a $200,000 penalty for the wage rorts but always insisted the underpayments were simply a mistake he blamed on inexperience.",
        "The ex-hospitality boss said the payment error was detected after the company made a self-report, but the publicity that followed made it impossible to keep his businesses alive.When the matter was still being resolved in the courts in 2017 and his public profile was plummeting, the Melbourne chef was caught on camera shoving a 19-year-old fan who was heckling him at the A-League grand final in Sydney.Calombaris was convicted of assault and fined $1,000, but the damage to his name was so bad his conviction was later overturned.",
        "A District Court judge agreed with Calombaris' lawyer that he had suffered significant financial and personal loss, and was unlikely to reoffend.In July 2019, the West Australian government also suspended its tourism campaign featuring Calombaris over the Fair Work Ombudsman fine.Ben Ungermann charged with sexual assaultQueensland ice cream shop owner Ben Ungermann first appeared on MasterChef's ninth season in 2019, placing runner-up. But it was during his return to the franchise for the Back to Win season in 2020 that the 36-year-old found himself making headlines for all the wrong reasons.",
        "In early 2020, vague reports began surfacing that Ungermann had been arrested and wasn't going to continue appearing on MasterChef: Back to Win. ",
        "Host Zonfrillo addressed the matter briefly on the show, saying Ungermann had left the competition due to a 'personal matter'.However, Daily Mail Australia subsequently revealed the nature of that matter: Ungermann had been charged with sexually assaulting a 16-year-old girl in a hotel room.The chef was staying in Melbourne to film the Channel Ten cooking show at the time of the incident.",
        "Three sexual assault charges against Ungermann were later struck out in the Melbourne Magistrates Court.One charge of common law assault remained, for which Ungermann was sentenced to a diversion program.The diversion order meant there would be no conviction or formal finding of guilt against Ungermann, even though he accepted responsibility for the common law assault.Following his arrest, Ungermann was also wiped from the intro package of MasterChef: Back to Win as if he was never on the show.And virtually every reference to him was deleted from the website of his family's Brisbane dessert parlour the Ungermann Brothers.Sarah Wilson's vanishing actLong-time fans of MasterChef Australia may remember its former host Sarah Wilson, who appeared on first season in 2009 before suddenly vanishing.The 49-year-old, who is now best known for her I Quit Sugar books, didn't return for the second season because Channel Ten felt she didn't have enough to do.",
        "Prior to MasterChef's debut in April 2009, Ten's then-head of programming David Mott described Wilson as a 'natural host'. ",
        "'Sarah Wilson has an addictive passion for food and wine, and a vibrant on-screen presence that makes her a natural host for MasterChef Australia. We have no doubt that Australian viewers will embrace her,' Mr Mott said.But it became clear during season one there was no room for a fourth presenter, with judges Mehigan, Calombaris and Preston able to handle hosting duties themselves.David Knox of industry website TV Tonight told News.com.au in 2019 that while Wilson was 'perfectly lovely' in the role, she became 'ancillary'.'Wilson was left to do little more than read the autocue. Much of the hosting fell to Gary Mehigan, something that would never have happened if other personalities were in the role,' Mr Knox said.",
        "By September 2009, Channel Ten had announced Wilson's departure from the show.'This decision has been a hard one to make, but it became clear the appropriate role for Sarah was not achievable without dramatically changing the format,' Mr Mott said at the time.'Her abilities had outweighed her duties on the show. All parties agree another series that limited her input and expertise was not the best outcome.'In 2017, Wilson reflected on her departure from MasterChef in an interview with The Australian Women's Weekly.",
        "She claimed producers had asked her to wear revealing outfits and she felt her role had been 'reduced to [that of] a vacuous talking head'.At one stage, she supposedly snapped on set and told crew members she felt like 'a broom in a ridiculous dress with a wig'.Wilson then 'punched the wall of' her dressing room in frustration and 'broke two knuckles', before quitting the show the next day.Julie Goodwin's drink-driving arrestMasterChef's first winner Julie Goodwin sparked controversy in April 2018 when she was charged with drink-driving twice over the legal limit.The mother of three, 52, was caught after trying to evade a police breath test in North Gosford, on the Central Coast, and was chased by officers to a nearby side street.Goodwin had been driving home from a 'celebratory function' that she was catering when she was stopped for the RBT.",
        "Goodwin said she felt 'great shame and regret' and said her actions were 'completely out of character' in a lengthy statement following the arrest.After fronting up at court with her husband and acknowledging it was 'an error in judgment' and 'accepting full responsibility', Goodwin was fined $600 and disqualified from driving for six months.She later revealed she had been suffering from depression, and had sought treatment during a five-week stay at a psychiatric facility in February 2020.",
        "Adriano Zumbo's failed dessert empireAustralian pâtissier Adrian Zumbo was launched into the spotlight thanks to his regular appearances as a guest judge on MasterChef.Starting his dessert restaurant business in 2007, the 41-year-old soon became known as 'Australia's answer to Willy Wonka' because of his amazing creations.However, this would come crashing down in 2018 when Zumbo's company was placed in voluntary administration with debts amassing about $10million.",
        "Administrators appointed to companies directed by Zumbo, made up of landlords and trade creditors, confirmed his eight Sydney and Melbourne eateries would remain open.The exact reason for his company's financial collapse is not known. Previously, five disgruntled employees appeared on A Current Affair in May 2017, claiming Adriano withheld superannuation, hadn't paid them proper rates and failed to pay them overtime.Reynold Poernomo's homophobia scandalSeason seven star Reynold Poernomo made headlines in 2020 after Daily Mail Australia exposed shocking homophobic forum posts he had written in 2014. Poernomo, 29, who was competing in MasterChef: Back to Win when the posts resurfaced, had posted a shocking comment in a six-year-old thread titled 'First gay couple featured on the Disney Channel. Do you agree with them?'The then 20-year-old wrote: 'I wish the world made a united decision where they will capture all gay people and put them on a remote island full of gays, that way straight [people] will be happy and the freaks can go on and f**k themselves.'",
        "That comment was followed by another on a thread titled: 'Is homosexuality a mental illness?''Yes end of thread,' Reynold responded.Reynold apologised for his comments shortly after they resurfaced.In a statement to Daily Mail Australia, he said he was 'deeply ashamed' of his remarks.'I would like to offer my sincere and deepest apologies for the comments that I made in 2014. I am ashamed of these comments and I regret them immensely,' he said.",
        "'At the time these comments were made, I was a very immature, close-minded and insular 20-year-old. I have grown and matured a lot in the last six years. I am not the person I was back then.'I have many friends and colleagues that are part of the LGBTIQ+ community. I wholeheartedly support them and care deeply for them. I am truly sorry and apologise for any offence or hurt I caused.'Matt Preston's feud with Marco Pierre White Former MasterChef judge Matt Preston was embroiled in a very public spat with British celebrity chef Marco Pierre White in 2017.White famously vowed 'on his mother's grave' to get back at Preston for comments he made on The Kyle and Jackie O Show about his son Marco Pierre White Jr.",
        "Preston had criticised Marco Jr. after the young man had boasted of his drug binges and sex with prostitutes.'That's that whole rich, London trust fund babe, trustifarian-type stuff - it's another world,' he said.Marco Sr. was so incensed by what Preston had said that he refused to even discuss it during a television interview the following year.",
        "White had previously featured as a guest judge on MasterChef Australia. However, he stopped making appearances after the eighth season due to his feud with Preston and even joined rival program Hell's Kitchen Australia in retaliation.White eventually returned to MasterChef in 2022, after Preston had left the show.Jock Zonfrillo's death The franchise suffered yet another blow when judge Jock Zonfrillo was found dead in a Melbourne hotel room at 2am on Monday, just hours before he was due to begin promotional duties for the show's fifteenth season.He was 46.Zonfrillo is believed to have died of natural causes and nothing unusual or suspicious was discovered in the hotel room where he was found dead, Daily Mail Australia understands. He is survived by his third wife, Lauren Fried, and his four children: grown-up daughters Ava and Sophia, from his first two marriages, and six-year-old Alfie and two-year-old Isla, with Fried.",
        "'With completely shattered hearts and without knowing how we can possibly move through life without him, we are devastated to share that Jock passed away yesterday,' his family said in a statement on Monday afternoon.'So many words can describe him, so many stories can be told, but at this time we're too overwhelmed to put them into words.'For those who crossed his path, became his mate, or were lucky enough to be his family, keep this proud Scot in your hearts when you have your next whisky.",
        "'We implore you to please let us grieve privately as we find a way to navigate through this, and find space on the other side to celebrate our irreplaceable husband, father, brother, son and friend.'Zonfrillo became a host of the popular Channel Ten cooking show in 2019 alongside Andy Allen and Melissa Leong.Zonfrillo, who started his career working under Michelin-starred chef Marco Pierre White in the UK, famously overcame an addiction to heroin during his teenage years in Glasgow before becoming one of Australia's most celebrated chefs."
    ]
}