{
    "articleURL": "/wires/reuters/article-12039609/Aryna-Sabalenka-Maria-Sakkari-advance-Madrid-semis.html",
    "content": [
        "No. 2 seed Aryna Sabalenka of Belarus and No. 9 Maria Sakkari of Greece each bounced back from a first-set defeat to grind out victories in the quarterfinals of the Mutua Madrid Open on Tuesday in Spain.",
        "Sabalenka defeated Egypt's Mayar Sherif 2-6, 6-2, 6-1, and Sakkari got past Romanian 31st seed Irina-Camelia Begu 6-7 (3), 6-4, 6-2. Sabalenka and Sakkari will meet in a semifinal match later this week.Sabalenka struggled with her serve, committing eight double faults with just two aces. But she saved 5 of 9 break points and converted 6 of 9 opportunities to break Sherif.In the first set, Sabalenka lost her serve right away and fell behind Sherif for good.The second set started much the same way, but down 1-0, Sabalenka broke Sherif's serve in the second game. They went back and forth this way until Sabalenka drew even at 2-2, then won the next four games to finish the second set with a bang and change the momentum.\"I just couldn't adjust for her game, and I was really going crazy,\" Sabalenka said. \"I'm really happy that I was able to stop myself, to take a little breath and just like start everything from the beginning. Good that I was keep fighting for every point no matter what the second set. And then in the third set I didn't give her much chances to play her game.\"Sabalenka, ranked No. 2 in the world, has now reached the tournament semifinals in five of her seven starts this season.",
        "\"I think I'm really mentally strong. I had so many matches like that when I was down in the score or when I was down with the match points and I was coming back,\" Sabalenka said.Sakkari led the first-set tiebreaker 3-2 before Begu stormed back to score the final five points. Sakkari found her way back in the match with a comfortable enough second-set victory before cruising in Set 3.Sakkari pushed Begu to break point a whopping 21 times, converting eight.\"I'm glad it was a mental win today because tennis-wise it wasn't as good as yesterday,\" Sakkari said of her performance. \"I'll give myself a chance to play better tennis in a couple of days.\"She is looking forward to her latest showdown with Sabalenka, who owns a 5-3 edge in their all-time series. Their battle on the Madrid clay will be the first time they play one another on a surface other than hard court.\"We all know she's in top form right now,\" Sakkari said of Sabalenka. \"She's the one that is playing the best tennis right now, better than anyone else. Obviously it's not hard court, her favorite surface, but she won this tournament and she's playing very good.\"I believe I can play good on clay court, I believe I can play good here. Let's see how it goes. I'm very curious to see how different it will play compared to other times we've played each other.\"",
        "--Field Level Media"
    ]
}