{
    "articleURL": "/news/article-12060555/Biden-gets-website-WRONG-announces-crack-airline-delays-cancelations.html",
    "content": [
        "President Joe Biden experienced some turbulence during a speech Monday unveiling his newly proposed airline accountability rules when he twice repeated the incorrect URL for the government website meant to inform American air travelers of their rights. ",
        "The president called the new website Flights Right, putting the 's' in the incorrect place of the true website FlightRights.gov.Meanwhile, a poll released Sunday shows that the majority of Americans feel that Biden is not as mentally or physically fit to serve as president than Donald Trump.  The latest jumble came as the president was announcing a new initiative that if put into use would require travelers be reimbursed for hotels, meals, taxis and flight change costs when airlines delay or cancel their flights.Airlines would also be responsible for reimbursing the original cost of the flight if it is canceled.",
        "'American air travelers deserve better and that's what we're doing here today,' Biden said during short remarks alongside Transportation Secretary Pete Buttigieg. 'And I'm proud to announce two critical steps that my administration is taking to protect American air passengers.''First, we just launched a new website – FlightsRight.gov,' he said, repeating the incorrect URL a second time. 'FlightsRight.gov.'Biden then announced that his administration is proposing a rule later this year that would require airlines to reimburse passengers for the cost of hotels, meals, taxis and rideshares and ticket changes if they are stranded for any reasons within the airline's control.The aim of the rules would be, for the first time, to require airlines to pay compensation beyond a ticket refund and to cover expenses that consumers incur, including rebooking on another flight, if the airline causes a cancellation or is at fault for a significant delay or disruption.",
        "Biden and Buttigieg announced the start of the rulemaking process on Monday.The rulemaking pledge continues a push by the Democratic administration to require airlines to improve customer service, and it comes just weeks before the start of the peak summer travel season.'When an airline causes a flight cancellation or delay, passengers should not foot the bill,' Buttigieg said in a statement.",
        "Currently, when an airline cancels a flight for any reason, consumers can demand a refund of the unused part of their ticket and certain extras that they might have paid to the airline, such as fees for checking a bag or getting a seat assignment. Airlines often try to persuade consumers to accept a travel voucher instead of a refund.After widespread flight disruptions last summer, the Transportation Department posted an online dashboard that was designed to pressure the airlines to improve customer service. The site lets consumers check each airline's policy on refunds and compensation when flights are canceled or delayed.Each of the 10 largest U.S. airlines quickly promised to provide cash or vouchers for meals when a cancellation forces passengers to wait at least three hours for another flight. Nine of the 10 - all but Frontier Airlines - also promised to pay for accommodations for passengers stranded overnight.",
        "Questions arose again around reimbursing consumers for out-of-pocket costs after Southwest Airlines canceled nearly 17,000 flights during a December meltdown in service. Desperate passengers were forced to sleep in terminals surrounded by growing mounds of lost luggage after being stranded at airports when the airline canceled over 80 percent of its flight schedule - causing Biden to weigh in.",
        "Distressed travelers - some of whom were not be able to return home for nearly a week - bemoaned the frantic scenes in airport terminals as Biden's administration vowed to 'ensure airlines are held accountable' for the disarray caused by Southwest.The Transportation and Justice Departments are investigating whether Southwest scheduled more flights than it realistically could handle. The Transportation Department says it is working with the airlines to reduce cancellations and delays this summer, when air travel could exceed pre-coronavirus pandemic records.A report last month from the congressional Government Accountability Office blamed airlines for many cancellations, but the Federal Aviation Administration has also created disruptions due to technology outages and staffing shortages. The FAA recently encouraged airlines to reduce flights to and from major New York airports this summer because it doesn't have enough air traffic controllers at a key facility."
    ]
}