{
    "articleURL": "/wires/reuters/article-12044067/Trump-calls-rape-claim-ridiculous-video-testimony-civil-trial.html",
    "content": [
        "By Jack Queen",
        "May 3 (Reuters) - Donald Trump denied raping writer E. Jean Carroll in a deposition video played on Wednesday for a Manhattan federal jury, as the former U.S. president sought to defend himself in a civil trial without testifying in person.Trump, front-runner for the 2024 Republican presidential nomination, said in the October 2022 deposition that the alleged rape in the dressing room of the Bergdorf Goodman department store in New York City decades ago didn´t happen.\"It´s the most ridiculous, disgusting story,\" Trump said in the video, hunched over a conference table as Carroll´s lawyers presented documents to him. \"It´s just made up.\"Although the deposition footage was not released, portions of the transcript have been filed publicly.Trump will not be testifying in person, and his legal team told U.S. District Judge Lewis Kaplan on Wednesday they will not be calling any witnesses.The trial is in its sixth day and is expected to extend into next week.Carroll´s civil lawsuit for battery and defamation alleges Trump raped her in the mid-1990s and then tarred her reputation by claiming in an October 2022 post on his Truth Social platform that the former Elle magazine advice columnist´s case was a \"Hoax and a lie.\"Carroll said during three days of testimony and pointed cross-examination that Trump slammed her against the wall in either 1995 or 1996, put his fingers into her vagina and then inserted his penis.",
        "Denying the allegations, Trump accused Carroll of making up the story to drive sales of a 2019 memoir in which she made her claims public.Trump has not attended the trial.\"I hear we're doing very well in New York,\" Trump said on Wednesday when asked why he was not in court. He spoke to reporters in Scotland where he was playing golf.The trial has also featured testimony from two women who say Trump sexually assaulted them decades ago.Former People magazine reporter Natasha Stoynoff told jurors on Wednesday that Trump cornered her at his Mar-a-Lago club in Florida in 2005 and forcibly kissed her for a \"few minutes\" until a butler interrupted the alleged assault.\"It really had a profound effect on me,\" Stoynoff said through tears, describing the intense shame and self-doubt she said she felt after the encounter.Another woman, Jessica Leeds, testified on Tuesday that Trump kissed her, groped her and put his hand up her skirt on a flight in 1979. (Reporting by Jack Queen; Editing by Howard Goller)"
    ]
}