{
    "articleURL": "/wires/reuters/article-12046537/United-Airlines-use-lower-carbon-fuels-San-Francisco-London.html",
    "content": [
        "By Stephanie Kelly",
        "NEW YORK, May 4 (Reuters) - United Airlines will begin using lower-carbon aviation fuels on flights from San Francisco International Airport and London Heathrow Airport beginning this year, the U.S. carrier told Reuters on Thursday, as the travel industry pursues new efforts to cut climate warming emissions.Sustainable aviation fuel (SAF), which uses feedstocks including used cooking oil and soybean oil, is being embraced in some regions by airlines including Qantas Airways, Lufthansa and Cathay Pacific. United now expects to consume about 10 million gallons of SAF this year.\"This is really about creating a market for sustainable fuels that just doesn't exist right now,\" Lauren Riley, United's chief sustainability officer, told Reuters.SAF accounted for less than 1% of aviation fuel consumed in 2022, but the industry's 2050 goal of \"net zero\" emissions currently relies on SAF accounting for 65% of fuel, according to International Air Transport Association statistics. The airline industry is responsible for nearly 3% of global CO2 emissions and many airlines have a target of SAF accounting for 10% of fuel by 2030.United now uses SAF in its departing flights from Los Angeles International Airport and Schiphol Airport in Amsterdam. With the latest addition, United will fly more miles using SAF than any airline, the company said.",
        "United began receiving SAF deliveries at San Francisco International Airport in April and will receive deliveries at London Heathrow later in 2023.United and partners of its Eco-Skies Alliance will acquire the fuel for San Francisco International Airport from Finnish renewable fuels producer Neste. Members of the alliance include Deloitte, Microsoft and Nike.The Biden administration is targeting at least 3 billion gallons of SAF production per year in the U.S. by 2030 as part of its broader climate change fight.Producers such as Neste and BP make SAF from feedstocks including soybean oil, used cooking oil and animal fat. While it reduces carbon emissions compared to traditional petroleum-based jet fuel, SAF can be two to four times costlier to make.\"It's a challenge of pace,\" Riley said of the SAF rollout to San Francisco and London. \"How do we go faster?\" (Reporting by Stephanie Kelly; editing by Gary McWilliams and Josie Kao)"
    ]
}