{
    "articleURL": "/wires/reuters/article-12050487/Malaysia-talks-bring-1MDB-linked-fugitive-Jho-Low.html",
    "content": [
        "KUALA LUMPUR, May 5 (Reuters) - Malaysia is negotiating with other countries to speed up the return of fugitive financier Low Taek Jho, wanted for his role in the multibillion-dollar 1MDB scandal, Prime Minister Anwar Ibrahim said on Friday.",
        "Low, better known as Jho Low, has been charged in Malaysia and the United States for allegedly masterminding the theft of $4.5 billion from state fund 1Malaysia Development Berhad (1MDB). He has consistently denied wrongdoing.Anwar told reporters Malaysia was committed to bringing back Low as quickly as possible, describing the negotiation process with other nations as complicated.\"It involves many countries, it involves intelligence services, Interpol, et cetera,\" Anwar said. He did not reveal the countries involved in the talks, and declined to confirm Low's whereabouts.Malaysian authorities have previously said Low was believed to be in China, though Beijing has denied it.An associate of Low's who had been on the run since 2018 was repatriated by anti-graft authorities on Wednesday, following cooperation with international law enforcement agencies, Azam Baki, chief commissioner of the Malaysian Anti-Corruption Commission (MACC) confirmed on Friday.The unnamed associate, who is suspected of receiving misappropriated 1MDB funds, arrived on Wednesday in Kuala Lumpur, where they were questioned by MACC and their home was searched, media reported, citing sources.At least six countries have opened probes into 1MDB, in a wide-ranging scandal that has ensnared financial institutions and high-ranking officials across the globe.Former Malaysian prime minister Najib Razak, who co-founded 1MDB, was sentenced to 12 years in prison last year and faces several other trials for corruption and money laundering linked to the scandal.",
        "In 2019, U.S. authorities struck a deal with Low to recoup a record $1 billion in funds allegedly looted from 1MDB, which included a private jet, high-end real estate in Beverly Hills, New York and London, and other assets.(Reporting by Rozanna Latiff; Editing by Martin Petty, Kanupriya Kapoor)"
    ]
}