{
    "articleURL": "/wires/reuters/article-12042419/U-S-services-sector-grows-steadily-April-ISM-survey.html",
    "content": [
        "WASHINGTON, May 3 (Reuters) - The U.S. services sector maintained a steady pace of growth in April as new orders increased amid a surge in exports, but businesses continued to face higher prices for inputs, indicating that inflation could remain elevated for some time.",
        "The Institute for Supply Management (ISM) said on Wednesday that its non-manufacturing PMI edged up to a reading of 51.9 last month from 51.2 in March. A reading above 50 indicates growth in the services industry, which accounts for more than two-thirds of the economy. Economists polled by Reuters had forecast the non-manufacturing PMI ticking up to 51.8.The PMI remains above the 49.9 level, which the ISM says over time indicates growth in the overall economy.But risks to the economy are rising. Credit conditions have tightened and Treasury Secretary Janet Yellen warned on Monday that the federal government could run out of money within a month amid a standoff to raise its $31.4 trillion borrowing cap.The Federal Reserve is expected to raise its benchmark overnight interest rate by another 25 basis points to the 5.00%-5.25% range at the end of a two-day policy meeting on Wednesday before potentially pausing the U.S. central bank's fastest monetary policy tightening campaign since the 1980s.The services sector is being supported by consumers shifting spending from goods, which are typically bought on credit.The ISM reported on Monday that its measure of national manufacturing contracted for a sixth straight month in April, though the pace slowed.A gauge of new orders received by services businesses increased to 56.1 from 52.2 in March. They were likely boosted by a jump in exports orders. A measure of export orders shot up to 60.9 from 43.7 in March.",
        "Services inflation remained strong. A measure of prices paid by services businesses for inputs nudged up to 59.6 from 59.5 in March. Services prices tend to be stickier and less responsive to interest rate increases.Some economists view the ISM services prices paid gauge as a good predictor of personal consumption expenditures (PCE) inflation. The Fed, which has a 2% inflation target, tracks the PCE price indexes for monetary policy.Services sector employment growth slowed further.The survey's measure of services industry employment slipped to 50.8 from 51.3 in March, another sign that the labor market was softening.The government reported on Tuesday that there were 9.6 million job openings at the end of March, the lowest level since May 2021. Still, there were 1.6 job openings for every unemployed person in March, well above the 1.0-1.2 range that economists say is consistent with a jobs market that is not generating too much inflation. (Reporting By Lucia Mutikani; Editing by Chizu Nomiyama)"
    ]
}