{
    "articleURL": "/news/article-12056949/Pr-Trump-Rep-Lance-Gooden-DeSantis-day-come-not-today.html",
    "content": [
        "Rep. Lance Gooden told DailyMail.com why he is supporting Donald Trump over Ron DeSantis after meeting with the Florida governor last monthTexas congressman said U.S. can't afford 'untested leadership' right now, claiming: 'DeSantis' day may come, but it is not today'Gooden met with Trump at Mar-a-Lago on Monday: Scroll for pictures  Donald Trump hosted Rep. Lance Gooden and his family at Mar-a-Lago on Monday after the Texas Republican endorsed the former president the same day he met with Florida Gov. Ron DeSantis at the Capitol.",
        "DeSantis made a trip to Washington, D.C., last month to hold meetings with several lawmakers, including Gooden. Many saw the trip as a way for the popular Republican governor to try and garner support for a potential White House bid.Gooden endorsed Trump just moments after meeting with DeSantis in April, and told DailyMail.com this week that while 'DeSantis's day may come, it is not today.'The Texas lawmaker brought his wife Alexa and their two children Liam, five, and Milla, three, to meet with Trump at his Palm Beach, Florida, estate on Monday, DailyMail.com can exclusively reveal. A person familiar with Gooden's plans says that the congressman intends to serve as a strong voice in D.C. pushing for the reelection of Trump. ",
        "'Now is not the time for untested leadership,' Gooden said when asked about levying his support for the former president over DeSantis.'The American people desperately need a champion in their corner who knows how to both take and give a punch,' the Texas lawmaker added. 'President Trump has planted his feet in the arena, taken the hits, and remained firm.''Ron DeSantis's day may come, but it is not today. 2024 is year one in the march towards a New American Era, and no one other than President Donald J. Trump can lead our nation back to greatness.'",
        "While DeSantis has risen in the national GOP ranks due to his pandemic response in Florida, the governor has recently been sliding in 2024 presidential polling after obtaining an early bump that saw him even beating out Trump, at times.A Washington Post/ABC News poll released Sunday shows that Trump has more than double the support of DeSantis. When respondents were asked about six different announced or potential GOP candidates, 51 percent said they would support Trump in 2024 and 25 percent said they would back DeSantis.No other candidate earned double-digit support.Gooden said that the meeting with DeSantis last month solidified his feelings that 'America's best hope for national renewal' is by electing Trump for another four years.The Texas lawmaker said last month that he had a 'positive meeting' with DeSantis in the nation's capital, but still didn't hesitate to endorse Trump.Rep. Brian Mast of DeSantis' home state of Florida also said he would be supporting Trump's primary run after the former congressman's meetings in April. This brings the total number of endorsements for Trump to seven out of the 20 Republican congressmen from Florida.Trump has 54 endorsements in Congress already.",
        "DeSantis has not yet announced a bid for the White House, but has already garnered three endorsements from members of the House of Representatives.",
        "Gooden brought his wife and two children for the meeting with Trump at Mar-a-Lago on Monday.'The 2024 election cycle is a marathon, and President Trump is relying on strong voices in Washington to cut through the political noise of the establishment and speak directly to the American people,' Gooden said of his meeting with the former president.'I am honored to have his trust and confidence,' he added. 'The best is yet to come; this campaign is just getting started, and change is coming sooner than you think. I am excited to work with the President to spearhead his agenda in Washington.'"
    ]
}