{
    "articleURL": "/wires/ap/article-12045713/Indian-army-helps-defuse-clashes-northeastern-state.html",
    "content": [
        "GUWAHATI, India (AP) - The governor of a remote Indian state issued orders allowing district magistrates to shoot protesters, as soldiers patrolled the streets and enforced a curfew after thousands of people clashed, causing deaths and damage to homes and vehicles, officials said Thursday.",
        "Internet services were also suspended for five days in northeastern Manipur state bordering Myanmar to stop rumors from spreading on social media, according to N. Biren Singh, the state´s top elected official.The army has moved nearly 9,000 people from violence-hit districts to other areas after protesters vandalized shops and businesses, including hotels, and set some homes on fire, said an army officer who spoke on condition of anonymity because he was not authorized to talk to reporters.Violence rocked the area for nearly three hours on Wednesday and was brought under control by the army overnight, the Press Trust of India news agency said.To prevent more violence, state Governor Anusuiya Uikey issued an order on Thursday authorizing magistrates to shoot protesters \"in extreme cases where warnings and reasonable force don´t work.\"District magistrates oversee the police and can act as a judge for minor offenses.\"I appeal for calm and a return to peace as precious lives have been lost and there have been cases of clashes, arson and vandalism in parts of Manipur,\" Singh said in a tweet Thursday.He did not provide further details and police did not say how many people died or were injured in the violence that erupted Wednesday after protests by more than 50,000 Kukis and members of other predominantly Christian tribal communities in Churachandpur and adjoining districts in Manipur state.",
        "They were protesting the majority Meitei Hindu community´s demand for a special status that would give them benefits including the right to farm on forest land, cheap bank loans, and health and educational facilities, as well as a specified quota of government jobs.Mary Kom, India's top female boxer who hails from the state, appealed to the federal and state governments to take quick action to defuse the tense situation.Indian Home Minister Amit Shah spoke to Singh on Thursday and decided to send reinforcements from the federal Rapid Action Force to restore peace in the state.Minority hill community leaders say the Meitei community is comparatively well-off and that granting them more privileges would be unfair.The Meiteis say employment quotas and other benefits for the tribespeople would be protected.Two-thirds of the state´s 2.5 million people live in a valley that comprises roughly 10% of the state's total area. The Meiteis are Hindus while rival groups, including the Kuki and other tribes, are mostly Christian and mainly live in the surrounding hill districts. Ethnic Muslims constitute about 8% of the state population."
    ]
}