{
    "articleURL": "/wires/pa/article-12060051/Mansfield-boss-Nigel-Clough-says-devastating-miss-play-offs.html",
    "content": [
        "Mansfield boss Nigel Clough admitted it was “devastating” to not make the play-offs despite winning 2-0 at Colchester on the final day of the season.",
        "The Stags ended up finishing level on 75 points with Salford, who lost 1-0 at Gillingham, but it was the Ammies who claimed seventh spot due to having a better goal difference of one. Carlisle and Bradford both finished one point ahead after drawing on Monday.Riley Harbottle gave Mansfield the lead in first-half stoppage time when he headed home Davis Keillor-Dunn’s free-kick, after Tom Dallison had controversially been penalised for a foul on Will Swan midway inside the Colchester half.And substitute James Gale wrapped up victory in the seventh minute of stoppage time with a low finish from Lucas Akins’ pass but ultimately it was to no avail for the visitors, who were beaten in last season’s play-off final.Clough said: “It’s devastating. A total of 75 points normally gets you in the play-offs.“We were keeping an eye on what was going on elsewhere but it wasn’t to be.”",
        "Despite the final-day disappointment though, the former Sheffield United and Derby boss insists there is plenty to build on from this campaign and says he knows what areas they will need to work on for next term.He added: “We’ve conceded too many silly goals over the course of the season.“We know exactly where we need to improve.",
        "“There are absolutely tons of positives for us to take into next season.“To get to 75 points in a season and to within one goal (of the play-offs) I think is an achievement in itself.“It gives you so much encouragement when you see what we’ve had to deal with and we just can’t wait to get going again.“It definitely hurts even more, knowing what we could have achieved with a fully fit squad. To get so close, within one goal, is really tough to take.“We can’t wait for the first ball to be kicked, next season.”Colchester finished 20th in League Two, after Ben Garner successfully led them away from relegation danger.Garner said: “I thought we should have got something from the game.“It was another pleasing performance against a side who missed out on the play-offs by a goal, in terms of long terms of the game I thought we were the better side.“I’m really pleased with the effort from everyone since I came in through the door.“I think the season is probably finishing at the right time now, in terms of mission accomplished.“We’ve done what we set out to do when we came in and now we’ve got an opportunity to reshape the squad a little bit, build on the good core players that are here.",
        "“We don’t want to be where we are in the table, next season – we want to be pushing for promotion.“Looking at the teams coming in, both from below and dropping down, it’s going to be a really tough league next season so we have to work hard in the summer to make sure we’re in a strong place.”"
    ]
}