{
    "articleURL": "/news/article-12056155/Clint-Allen-38-fatally-stabbed-wife-outside-Criterion-Hotel-Sale-Victoria.html",
    "content": [
        "Clint Allen was walking home with wife Bek and friendsPolice gave Mr Allen first aid but he died at the scene A 'family man' brutally stabbed to death in front of his wife had been celebrating her 37th birthday at a country pub before the baffling attack unfolded.",
        "Clint Allen, 38, his wife Bek and three others were outside The Criterion Hotel in Sale, Victoria, about 200km east of Melbourne, in the early hours of Sunday morning when they were approached by an 'unknown' knifeman.The group made a frantic call to police about 1am with officers arriving to find Mr Allen severely wounded at the York-MacAlister intersection.Despite desperate efforts to revive Mr Allen while waiting for paramedics to arrive, he could not be saved.Detectives at this stage do not know why Mr Allen was attacked.",
        "His devastated family said he was just walking home after the night out.His distraught stepdaughter, Makala Lister, who is six-weeks pregnant, said the beloved BMX champion and an avid outdoorsman who loved camping, dirt bikes and 4WDs, will be sorely missed.'Clint was an amazing husband, father and grandfather to his unborn granddaughter,' she told the Herald Sun.'He was loved by everyone who met him and was always up for a chat no matter what topic.''He will be forever missed and loved from everyone he came in contact with.' ",
        "One Sale local said the town's main street is 'not safe at night anymore' and that he was also threatened with a knife recently.'I walked home from work the other night at 11pm and there was crazies swearing and waving knives at me in Raymond St near the banks,' Tez Leeson said on social media.",
        "A police spokesperson told Daily Mail Australia on Sunday no arrests have been made over the stabbing but 'investigations remain ongoing.'Anyone who witnessed the incident or has any information is urged to contact police immediately. "
    ]
}