{
    "articleURL": "/tvshowbiz/article-12044539/David-Harbour-brings-stepdaughters-Guardians-Galaxy-Vol-3-New-York-City.html",
    "content": [
        "David Harbour scored some points with his stepdaughters by taking them to an early screening of Marvel Studios' Guardians of the Galaxy Vol. 3.",
        "The 48-year-old actor brought his stepdaughters - 11-year-old Ethel Mary and 10-year-old Marnie Rose - and two of their friends to the advanced screening of the Marvel sequel at the iPic Theater in New York City.The outing comes just hours after the new trailer was released for Harbour's next film, Sony's Gran Turismo, arriving in theaters August 11. Harbour stepped out with a navy blue polo shirt under another dark blue shirt and a navy blue double-zip hoodie.The bearded actor was all smiles while posing on the red carpet with his stepdaughters, just days after his wife and their mother Lily Allen celebrated her 38th birthday in London.",
        "The actor completed his look with dark blue dress pants and shiny black dress shoes for the red carpet screening. While Harbour doesn't star in Guardians of the Galaxy Vol. 3 (barring a secret cameo that is later unveiled), he is no stranger to the Marvel Cinematic Universe.The actor portrayed Alexei Shostakov, a.k.a. The Red Guardian, in the MCU's 2021 adventure Black Widow alongside Scarlett Johansson and Florence Pugh.He will reprise that role in the upcoming movie Thunderbolts, which is in pre-production and set for release July 26, 2024. Harbour is coming off Netflix's We Have A Ghost alongside another MCU regular - Anthony Mackie - which debuted in February.",
        "He plays trainer Jack Salter, who whips a group of video game players into real race car drivers, in this summer's Gran Turismo, based on a true story. ",
        "Harbour will return as Sheriff Jim Hopper in the fifth and final season of Netflix's Stranger Things, though it's unclear when production will begin.The actor also has The Trashers in pre-production, starring alongside Olivia DeJonge, based on the true story of garbage tycoon and gangster Jimmy Galante. He also has My Dentist's Murder Trial, starring alongside Pedro Pascal, which is currently in pre-production.Harbour will also lend his voice to Eric Frankenstein in the upcoming animated TV series Creature Commandos."
    ]
}