{
    "articleURL": "/columnists/article-12055065/SARAH-VINE-Britain-spectacular-Oh-ravishingly-handsome-equerry.html",
    "content": [
        "For a few glorious hours, it was as though none of it mattered. Not the cost of living crisis, not the war in Ukraine, not the local elections, not Brexit, not the endless culture wars or the myriad worries that assail us daily.This was Britain at its best and most optimistic: a spectacular, seamless pageant of who we are and what this country stands for. Even the weather seemed to be on side, raining enough to respect tradition but not enough to ruin everyone's hair.The logistics, meanwhile, were on point, from the precision of the marching bands to the sublime music in the Abbey and the solemn anointing of the King behind his beautifully embroidered screens.It was, despite the naysayers and the cynics and the mealy-mouthed republicans (who failed to get within striking distance of causing any mischief), a thoroughly solid performance.There were so many wonderful moments. In no particular order: the golden Cinderella coach, a glittering rebuke to the grey skies above The Mall; the combined colours of the Armed Forces, emblazoned with the new King's cypher.",
        "Seamus the Irish wolfhound in his smart red coat; the Household Cavalry, positively gleaming; the Pipes and Drums (not a dry eye); the royal-blue bridles; those fabulous drummers on horseback, expertly controlling their huge steeds with their legs to keep their hands free.Penny Mordaunt's magnificent poise (not to mention embonpoint) in managing to hold that sword aloft for the best part of an hour. She may not have made Prime Minister, but she has ensured her place in history – arguably more so than her contender, Liz Truss.Sir Antonio Pappano conducting I Vow To Thee My Country, Sir Bryn Terfel singing Kyrie Eleison (a sound that I must confess stirred my Welsh heart).Prince William whispering something in his father's ear as he placed the sash around his shoulders, making him smile for the first time in the entire ceremony.Andrew Lloyd Webber, spotted by a fellow member of the congregation cheerfully singing along to all his own compositions.The Princess of Wales looking like an exquisite Greek goddess in her floral diamond headdress (very much not a tiara), Charlotte's smaller, matching one and white cape. Her grandmother, Carole Middleton, scene-stealing in Alexander McQueen, just like her daughter.",
        "Princess Anne slipping out a side door afterwards to ride back to Buckingham Palace alongside the troops; the Armed Forces' royal salute and rousing three cheers.Smiling wet faces lining The Mall, the roar of the Red Arrows above. And, of course, the most ravishingly handsome equerry in the history of handsome equerries, Lt Col Jonathan Thompson, buttoning and unbuttoning the King's robes in a way that some of us found slightly distracting.So many incredible sights, such a piece of history in the making.There seemed to be a slight hesitancy as the Royal procession arrived at the Abbey. When his mother ascended to the throne back in 1952, she was a young woman, inexperienced and yet – for all the privations of the recent war – relatively unscathed by life.As the oldest-ever British monarch to be crowned, King Charles is at the other end of that scale. He has a certain melancholic thoughtfulness about him, a degree of life experience that can sometimes lend him a rather wistful air.That familiar pull of the jaw, the furrowed brow: there was a real sense of humility about the King as he entered the Abbey, a definite note of – if not reluctance – then uncertainty. Head down, hands together, he came more as supplicant than sovereign. The congregation seemed to sense his fragility. There were a few curtsies, some more hesitant than others, and a smattering of bows. He looked, at times, on the verge of tears.Queen Camilla, too, seemed nervous: like her husband, perhaps conscious of the great weight of responsibility that was about to be placed, quite literally, on her shoulders.",
        "They hardly looked at each other, focusing instead on the task at hand, seemingly lost in their own thoughts.The soporific, nasal twang of the Archbishop of Canterbury, who has a way of making even the most sublime liturgy sound like reading aloud a tax return, perhaps didn't help.The King looked weary and at times a little peeved as the assembled dignitaries took him through the various necessary motions.The whole thing started to feel a bit pedantic, a bit gluten-free granola. Some of the assembled great and good, who had been in their seats for hours, began to look glassy-eyed.But as the service progressed, the magnificence and meaning began to shine through. The gospel choir, all in white, swinging and singing their alleluias, put a smile on everyone's faces. The de-robing of the King and his private anointing was deeply moving, as was the choir's rousing accompanying rendition of Zadok The Priest.By the time he sat down, clad in splendid robes of gold, clutching the Coronation regalia, it seemed as though the King had entered an altered state.As the Archbishop placed the crown on his head, adjusting it to make sure it was straight, Charles III closed his eyes and swallowed hard, digesting the significance of the moment.All the while, Queen Camilla was by his side, watching and waiting. Her crowning, which has been a matter of some controversy, was swift and relatively low-key. It felt more like a private, personal act of homage from a King to his Queen, rather than a central part of the official ceremony.It was certainly not a threat, constitutional or otherwise.",
        "There was even a slightly comical moment as Camilla shuffled back in her throne, away from the advancing archbishop, as he loomed over her with Queen Mary's heavy crown. In the event, he managed to land it successfully on her head, where it sat looking slightly precarious as she adjusted her hair and smiled with relief at her husband.He was still staring solemnly into the middle distance, clutching his symbols of power. The whole thing was over in less than a minute.After that, the ceremony seemed to take on a much happier, more relaxed tone. Sure, there was still a certain amount of droning on to be done by the archbishop, but from the King and Queen's point of view, it had clearly begun to feel like mission accomplished.Even the participation of Harry, relegated to the third row of the royal section, and largely obscured behind Princess Anne's red ceremonial plume, had gone smoothly. Gin o'clock was surely beckoning.As the King and Queen processed out of the Abbey and into their golden coach, the combined might of the assembled regiments swung into action at a single command from Garrison Sergeant Major Andrew 'Vern' Stokes.The whole thing switched from solemn ceremony to joyous pageantry (not least, one suspects, at the prospect of finally being able to go to the loo).This, for me, was the really spectacular moment: the part of the Coronation that felt most representative of the unique covenant between the Crown and the British people.",
        "The dignitaries and deserving guests, the fine words and solemn oaths are all well and good.But to me, there's nothing as spectacular or inspiring as ranks of handsome naval gunners and other assorted military types in full regalia, all marching in step together.Perhaps the King felt it, too, because inside his gilded horse-drawn bubble, he finally seemed to relax.He even allowed himself a grin or two as he and the Queen waved at the crowds, followed by the Prince and Princess of Wales and their three children.Page of honour George – such an adorably serious little fellow – sat solemnly between his sister Charlotte and naughty younger brother Louis, the latter pressing his nose in excitement against the carriage window. The only tinge of sadness was the absence of the King's younger son and his own family in this happy procession.If only things had turned out differently, Prince Harry too might have been in his own glistening carriage, the Duchess of Sussex by his side, Archie and Lilibet experiencing their own slice of Royal history.It was Archie's fourth birthday yesterday – the same age the King was when he saw his mother crowned all those years ago. He will not share his grandfather's memories.But what's done is done, and we must look to the future. Yesterday's Coronation was really all about that: it marks the start of a new Carolean Age, one that comes at the end of a long period of turmoil for the House of Windsor – but that may yet, just as Charles II's reign did in the 17th Century, herald a new era of restoration.By the time the King emerged on to the balcony of Buckingham Palace, flanked by his close-knit 'squad' of working Royals, he looked not only like a very happy man, but also as though a huge weight had been lifted off his shoulders.The Coronation – so long a source of worry and anxiety for him – was finally completed. They had made it. His mother's legacy is safe, for now at least. Long live the monarchy; long live King Charles III – and, of course, Queen Camilla."
    ]
}