{
    "articleURL": "/news/article-12046289/Keir-Starmer-urged-fess-Sue-Gray-contacts.html",
    "content": [
        "Keir Starmer is facing a fresh storm today after it was claimed he approach Sue Gray to become his chief of staff as long ago as last October.",
        "The Labour leader is being urged to 'fess up' over when he first made contact with the then-senior civil servant. Sir Keir has repeatedly refused to disclose the timeline of the talks, despite concerns being raised that she might still have been involved in Partygate probes.Ministers have suggested that Ms Gray might have breached the civil service code by failing to declare speaking to Labour. Sir Keir has said he is confident no rules were broken. ",
        "Sky News reported that the Labour leader was in touch with Ms Gray about the position in October - at least four months before her appointment was announced.She also received a detailed report in November about a meeting with Harriet Harman regarding the Privileges Committee's investigation into whether Boris Johnson misled Parliament over Partygate, according to The Sun.Labour has insisted all requests from the committee were handled by the Propriety and Ethics Team at the Cabinet Office, and Ms Gray was not part of it. Cabinet minister Michael Gove said Sir Keir was 'avoiding the question' about when he started speaking to Ms Gray.He told ITV's Peston programme: 'The person who can clear this all up is Keir Starmer.'All Keir Starmer needs to do is co-operate, to say what the contacts were that he initiated.",
        "'And I think it is unchivalrous and wrong of Keir Starmer not to fess up.'He should be straight, he shouldn't be sort of 'taking the Fifth (Amendment)' and avoiding the question.'It only reinforces the impression that people have that he is shifty and that he can't be straight with us.'Rishi Sunak's press secretary said yesterday it was 'obviously disappointing' that Ms Gray had chosen not to engage with a Government process looking into her move to a political role.Labour has defended her decision not to contribute to the Cabinet Office probe, dismissing it as a 'political gimmick'.The government has submitted a 'confidential assessment' to the Advisory Committee on Business Appointments (Acoba).The independent appointments watchdog will recommend a cooling-off period of between three months and two years to avoid any conflict of interest once it concludes its own separate review into Ms Gray's exit in March.",
        "While civil servants have to remain politically neutral, former Whitehall officials have questioned how a new job could be taken up without some contact with a new employer — in this case, a political party.Labour accused the Tories of focusing on the Sue Gray row to distract from the local elections today, which could see Mr Sunak's party lose large numbers of seats.",
        "A party spokesman said: 'To be banging on about Sue Gray the day before the local elections shows just how out of touch the Tories are.'Only Labour has a plan to cut crime, cut waiting lists and cut the cost of living.'Sadly for the country, the Tories only want to talk about one former civil servant.'Asked about Sky's claim that contact was first made with Ms Gray in October, Labour said: 'All the information has gone to Acoba and we are not going to comment during an active process.'"
    ]
}