{
    "articleURL": "/wires/ap/article-12043195/Ex-Mastercard-CEO-Ajay-Banga-confirmed-World-Bank-leader.html",
    "content": [
        "WASHINGTON (AP) - Former Mastercard CEO Ajay Banga, an Indian army officer's son with decades of corporate experience, was confirmed Wednesday to lead the World Bank for a five-year term that starts next month.",
        "The U.S.-nominated business veteran succeeds David Malpass, a Donald Trump pick who is ending his tenure early at the 189-nation global poverty-fighting institution after coming under pressure for declining to say whether he agreed with the scientific consensus on climate change.The bank's executive directors said in a statement after Banga's confirmation as president that they looked forward to working with him and on all the bank's \"ambitions and efforts aimed at tackling the toughest development challenges facing developing countries.\"President Joe Biden chose Banga in February, after Malpass announced he would leave by June 30, and praised the nominee for his \"critical experience\" in tackling \"the most urgent challenges of our time,'' such as climate change.Biden said Wednesday that Banga \"will help steer the institution as it evolves and expands to address global challenges that directly affect its core mission of poverty reduction - including climate change.\"The United States is the bank's largest shareholder and traditionally has nominated the organization's president. American leaders have said that taking on climate change will be a major factor in the bank's lending decisions.",
        "Treasury Secretary Janet Yellen said in February that Banga will be responsible for meeting \"ambitious goals for climate adaptation and emissions reduction.\" On Wednesday, she said \"our ambitious goals will not be met overnight, and we remain committed to a staged adoption of reforms over the course of the year to build on the vision we have laid out.\"",
        "Malpass, whose term was to expire in April 2024, ran into criticism last year for comments at a conference that appeared to cast doubt on the science that says the burning of fossil fuels causes global warming. He later apologized and said he had misspoken, noting that the bank routinely relies on climate science.Leaders and activists from poorer nations, especially those vulnerable to the extreme weather made worse by climate change, have called for massive changes in the entire multinational development bank system.A plan known as the Bridgetown Initiative, put forward by Barbados Prime Minister Mia Mottley and embraced by French President Emmanuel Macron, would make it easier and faster for developing countries affected by weather disasters to get money with lower interest rates for both recovery and for building to become more resilient.Banga, who was most recently vice chairman at the private equity firm General Atlantic, has more than 30 years of business experience and has served on the boards of the American Red Cross, Kraft Foods and Dow Inc.He was born in 1959 and educated in some of India´s premier institutions. When India´s economy liberalized in the early 1990s, Banga was able to work and rise through the ranks of multinational corporations breaking into India.",
        "___Associated Press reporter Sibi Arasu in Bengaluru, India, contributed to this report."
    ]
}