{
    "articleURL": "/wires/reuters/article-12051011/China-vows-build-modern-industries-win-global-race.html",
    "content": [
        "BEIJING, May 5 (Reuters) - China's leaders pledged on Friday to build a modern industrial system and achieve technological breakthroughs, in an international race to win the \"strategic initiative\" amid tensions with the United States.",
        "China will prioritise the real economy, improve its industrial policies, and build world-class enterprises, state media quoted the Central Financial and Economic Affairs Commission, following a meeting chaired by President Xi Jinping.China will step up its drive to achieve core tech breakthroughs and \"grasp the wave of new technological revolutions such as artificial intelligence\", state media quoted the commission as saying.\"Accelerating the construction of a modern industrial system supported by the real economy is crucial for us to win strategic initiative in future development and international competition,\" state media said.Washington has moved to ban exports of some advanced chips to China, escalating tensions between the world's two largest economies.China will promote the transformation and upgrading of traditional industries and will not simply exit from low-end industries, according to state media.State media said China will establish a sound birth support policy system, aimed at significantly reducing the cost of having babies, and vigorously develop a universal system of childcare service.\"The current population development in China is characterised by a trend of fewer children, aging, and regional population differentiation,\" state media cited the commission as saying. \"We must have a comprehensive understanding and a correct view of the new situation of population development in China.\"Last year, China's population fell for the first time in six decades, a historic turn expected to usher in a long period of decline in citizen numbers - with profound implications for its economy and the world. (Reporting by Ella Cao, Kevin Yao and Beijing newsroom; Editing by Toby Chopra, William Maclean)"
    ]
}