{
    "articleURL": "/news/article-12046775/Surfer-mauled-shark-South-African-beach-dragged-bleeding.html",
    "content": [
        "The victim was a 50-year-old man from Cape Town, swimming in Jeffrey's BayWARNING: GRAPHIC CONTENT A surfer mauled by a Great White shark was rescued by fellow wave-riders, who dragged him back to shore - just weeks before a world tour event takes place at the same South African beach.",
        "The victim, a 50-year-old man from Cape Town, was swimming in Jeffrey's Bay on South Africa's East Coast yesterday when the predator clamped its jaws around his leg.Fellow surfers were able to pull him to shore and helped care for him while medics rushed to the scene. he was later taken to hospital where he is said to be recovering.The area has been the scene of a series of high profile shark attacks in recent years and the latest incident comes just weeks before the Corona World Tour surfing event at the beach.",
        "According to an eyewitness report, a bystander phoned the National Sea Rescue Institute (NSRI) and was provided with an access code to their shark bite kit to start treating his wounds while they were on the way.Paramedics from the Institute took over his care upon arrival before he was taken to hospital.  Reports from local officials say the man is now 'stable' and in 'good spirits.'The NSRI shared a press release by Craig Lambinon following the incident, which read: 'At 17h30, Wednesday, 3 May, NSRI Jeffreys Bay duty crew were activated following reports of a man bitten by a shark while surfing at Supertubes, Jeffreys Bay.'A bystander had raised the alarm and was requesting and was provided with the access code to the NSRI shark bite kit stationed at that beach.",
        "'On arrival at the scene, NSRI medics assisted public members who had already applied trauma pads to a bite wound sustained by the surfer who was safe out of the water.'The patient, believed to be aged 50, from Cape Town, was in a stable condition and he was in good spirits.'They added: 'NSRI commend the swift action of the public and the good Samaritan fellow surfers.'Jeffrey's Bay is an infamous location, known for its high concentration of great whites. The beach, which sits along a stunning coastline, has been rated the second-best surfing destination in the world before Australia's Gold Coast.However, it has been host to a number of very high-profile shark attacks.The beach has played host to a World Surf League event since 1996 and made headlines in 2015 after a shark attack on three-time world champion Mick Fanning. A 2013 attack on 74-year-old surfer Burgert Van Der Westhuizen also took place at the Bay.Just seven others have been recorded at the beach since 1989 but all the victims survived.Professional surfer Wayne Monk is among those to be attacked after a shark bit him on the foot during a trip to J-Bay in 2004.By far the most high-profile attack was that on Fanning, with TV cameras at the surfing event capturing the moment he punched the shark in the face to escape.",
        "Once again in 2017, Fanning was forced to be pulled from the ocean during his quarter final against Brazilian Gabriel Medina following a shark sighting.Jet skis rushed in to pluck the Australian from the water after a three-metre beast was spotted swimming along the break in the direction of surfers.In 2016, he spoke about the incident to ABC.'It's all part of surfing. There is not a lot anyone can do,' he said.He added: 'I've surfed lots of different places and have seen sharks since then and haven't felt too concerned.'We're not going to go out and put a cage around J-Bay.'"
    ]
}