{
    "articleURL": "/tvshowbiz/article-12041777/Hayley-Atwell-speaks-time-close-bond-Tom-Cruise.html",
    "content": [
        "Hayley Atwell spoke for the first time about her 'close' bond with Tom Cruise as she covered May's Country &amp; Town House issue. ",
        "The actress, 41, - who got engaged to her actor boyfriend Ned Wolfgang Kelly last month - stars with Tom, 60, in Mission Impossible 7 which was filmed in 2020.During the time of filming rumours had swirled that they were in a relationship but in the new interview Hayley shut down the claims.She gushed over the 'courageous and wise' star but said that meeting Tom merely showed her the 'extraordinary power of platonic love'. Hayley said of working with him: 'I see a lot of his courage as a human being – he retains that sort of childlike wonder, which has a wisdom to it, which is, 'I don't know, and I don't know what I don't know'.",
        "On the rumours about their relationship she added: 'I felt like if I ever was worried about it, I could talk to him [Tom]. 'And I know that he would've said, 'People say whatever they want to say, but you know who you are, I know who I am and I want you to feel safe in this environment.'On their love for one another she went on to explain: 'What I feel is the truly extraordinary power of platonic love, which seems to be sometimes under-represented. 'And my love for Tom, my love for the process of this [Mission], and also the people who they keep very close to them and who are very present on set, has a wholesomeness to it. That for me, I just found so beautiful, so, yeah, I can freely say 'I love this group of people.'",
        "It come after last month Hayley got engaged to her actor boyfriend Ned after a whirlwind romance. She was first linked to Ned in July last year, shortly after she was said to have split from Tom for the second time. Ned announced the news on Instagram, revealing he popped the question during a romantic getaway in Venice. ",
        "He gushed: 'Lucky me. Arrived in Venice at 10am, around midday the love of my life and I got engaged in the kitchen of this strange apartment surrounded by ducks, with a bloke outside the window murdering \"My Way\" on the accordion. 'A perfect start to the rest of our lives together. I'd never had any interest in getting married... until I met this extraordinary woman. Happy as a clam.'Hayley and Ned keep their relationship lowkey and have rarely been pictured together.  The London-based artist's Instagram bio reads that he 'doesn't eat animals' and that he has been 'alcohol &amp; drug free for over a decade'.Speaking to The Sun when the couple first got together, an insider claimed: 'Hayley's happiness is written on her face right now.'They get on like a house on fire and make a very handsome couple.'Ned's website says he has produced commercial music for big brands such as Bud Light, Headspace and Samsung.",
        "He has also scored films, worked on the design side of projects, and penned articles.The Country &amp; Town House May/June issue out now. "
    ]
}