{
    "articleURL": "/tvshowbiz/article-12042283/Ashley-Roberts-puts-edgy-display-plunging-cream-waistcoat.html",
    "content": [
        "Ashley Roberts looked stunning on Wednesday while wearing a stylish three-piece tan suit as she departed the Heart FM radio studios after another day presenting.",
        "The radio star and television personality's look from Karen Millen consisted of a plunging waistcoat and matching suit trousers. She also wore a blazer, adding inches to her height with a pair of nude heels and accessorised with brown sunglasses. Ashley used the street as her own personal catwalk as she strutted through a sunny central London. The beauty toted her essentials in a gold Jacquemus bag and took to Instagram to show her outfit off to her 704,000 followers.",
        "She wrote: 'Anyone else confused on what day it is?!' on the Instagram story post as she pouted and posed by a window.Meanwhile, Amanda Holden, who presents alongside Ashley on Heart FM, wore a striking white colour blocked dress dress and a black jumper underneath.  It comes after Ashley looked sensational as she shared racy Instagram snaps earlier this month while enjoying a sun-soaked getaway in Ibiza.The media personality showcased her jaw-dropping figure as she slipped into a green string bikini and wore a matching two-piece co-ord on it.The bombshell flashed her very toned midriff in a tiny triangle bikini top and wore a pair of cosy flared matching trousers of the same design.She toted the stunning look with a matching oversized shirt layered on her shoulders, which she wore opened.",
        "'On the rocks no salt,' she penned her post.The American singer posed on the rocks, where she appeared to be enjoying a sunshine break with a pal.",
        "The former Pussycat Dolls singer appeared relaxed and carefree as she barely donned any make up. The radio presenter kept her blonde tresses in her typical up-do bun, with her fringe and some locks loose down to frame her stunning feature.She kept it comfortable for the beach in a pair of sandals featuring a golden strappy detail.The beauty accessorised her beach ensemble with her trademark pearl pendant necklace.Ashley delighted fans with insights of her luxurious holiday in Ibiza - and shared a racy snap in a tiny black bikini.The former singer looked nothing short of sensational in the skimpy two-piece as she lay by the pool of her luxury rented villa.Ashley covered her face with her hand as she topped up her tan, before showcasing her pert posterior while sauntering towards a day bed in sizzling new Instagram snaps.The Don't Cha hitmaker swept her blonde locks into a loose up 'do for the sunbathing session, while adding a pair of large, black sunglasses.",
        "Ashley didn't appear to have a care in the world as she soaked up the ambience of the stunning historical villa Ink House, set in sprawling private ground and with views of the sea.",
        "Captioning her snaps, Ashley penned: 'Sun buns', with the post garnering plenty of appreciative messages from her followers.Her appearance comes after she showed off her sun-kissed complexion after enjoying a lavish getaway in the US over the Easter break.She displayed her toned figure in a slew of Instagram snaps as she enjoyed some time off in Arizona."
    ]
}