{
    "articleURL": "/sport/formulaone/article-12055077/Felipe-Massa-threatens-sue-Lewis-Hamiltons-title-Bernie-Ecclestone-admission.html",
    "content": [
        "Fernando Alonso's orchestrated win in Singapore cost Massa the crown in 2008He was leading before Renault ordered Alonso's team-mate Piquet Jnr to crashFormer F1 supremo Ecclestone said the FIA knew about the ploy but did not actEverywhere Lewis Hamilton turns, people talk about whether he can win his eighth and presumably final world title. And then along comes someone who wants to quibble about his first.",
        "Enter Felipe Massa, the smiling little Brazilian who nearly triumphed in 2008, only to lose out at the concluding bend of the season in his home city of Sao Paulo as Hamilton passed Timo Glock’s Toyota to finish fifth and take the championship by a single point.All jubilation for Hamilton and McLaren. All long faces and churning stomachs for Massa and Ferrari.Here, ahead of the Miami Grand Prix, Massa is not letting the matter rest. He is investigating whether to take legal action to claim the title 15 years later on the basis that Fernando Alonso’s orchestrated win in Singapore that year cost him the crown.Massa was leading that race before Renault ordered Alonso’s team-mate Nelson Piquet Jnr to crash, bringing out a timely safety car. Ferrari then bungled Massa’s pit stop in a big way (so they can hardly claim to be the perfect victims). Massa missed out on what might have been crucial points.",
        "The 42-year-old is exercised about the skulduggery again after recent remarks by Bernie Ecclestone that Renault’s ploy was known about while that season was still alive but not acted upon by the FIA.‘I was really surprised when I saw the interview with Bernie and other interviews about what [late race director] Charlie Whiting had said and knew in 2008,’ reasoned Massa.",
        "‘What happened with that championship and the decisions that came out were not fair, not right for the justice of the sport. It is not about money.‘I won more races than Lewis and we fought until the last corner of the season. People know what happened in Singapore and it is really disappointing, so I study everything on the legal side. There is not much more I can say for now.’It appears unlikely anything can be overturned at this juncture, so we turn to Massa’s advice to his old rival over what to do next. Hamilton, 38, is unhappy with his car in Miami, calling its shortcoming in practice a ‘kick in the guts’.",
        "Despite that damning verdict, team principal Toto Wolff believes the seven-time world champion will sign again regardless, calling contract negotiations ‘a work in progress’.Given Massa’s eight seasons at Ferrari, could he see Hamilton slip into red overalls for a final tilt at sporting immortality?‘Anything is possible, but I have doubts that it will happen,’ said Massa.‘The relationship Lewis has with Mercedes is strong and to change that for Ferrari he would need to be sure what he is going to get. Ferrari have not proved they have the car to win the championship. Going there would be a bit of a gamble. If he cannot go to Red Bull, which is impossible with Max [Verstappen] there, I would stay at Mercedes.",
        "‘As for Lewis and his age, when I go to run I suffer more than when I was 30 or 25. It will come to Lewis but he still has some years in front of him, and you see what Fernando [Alonso, 41] is doing at Aston Martin. Lewis just doesn’t have the car, but maybe that will change.’",
        "Sooner rather than later, is Hamilton’s hope. He is 45 points behind leader Verstappen after just four races. The Briton’s second-place finish in Australia last month is a distant memory heading into today’s race around a celebrity-encrusted race at the Miami Dolphins’ Hard Rock Stadium. He finished sixth in Baku last week.Hamilton said: ‘It’s the same every week. We have to keep our heads down and see if we can start a new path next race.’That was a reference to a major, long-planned upgrade coming in Imola a fortnight hence, and desperate hopes hinge on that.Despite the gloom, Wolff added: ‘Lewis and Mercedes have been together for 11 years, and every single time when we talk about his contract, it’s six months of “Where are we and what is happening?” And each time, we’re just rolling on.’"
    ]
}