{
    "articleURL": "/tvshowbiz/article-12048337/Paul-OGrady-fans-reduced-tears-watching-late-star-care-dog-injury.html",
    "content": [
        "Paul O'Grady moved viewers to tears once again on Thursday night's episode of For The Love Of Dogs. ",
        "The comedian, who died in March at the age of 67, filmed the last season late last year and it is currently airing on ITV.In his documentary series, which has been running since 2012, Paul visited animals at Battersea Dogs and Cats home to find out about their backgrounds.  And on Thursday, the animal lover became very attached to lurcher Freddie, who arrived at the centre in need of urgent medical assistance. Paul became emotional as he saw the animal suffering due to a deep wound that needed careful surgery and stitches. ",
        "After looking at Freddie and giving him a hug, he said: ‘Oh my god look at the size of the wound. That is shocking.‘Poor thing. How could you let a dog go in that state?’ Viewers became emotional while watching the show - both because of Freddie's suffering and mourning the beloved presenter. One tweeter said: 'Can’t work out if this series is making me cry more because of the specific stories or because Paul is gone. Maybe both.'Another added: 'Oh god, here we go again, more tears for the beautiful pooches &amp; our dear, wonderful irreplaceable Paul. That said, I really hope someone will pick this up &amp; carry on Paul’s truly amazing work with Battersea.' ",
        "A third fan felt similarly, asking: 'Anyone else get all choked up watching #POGDOGS? Still doesn’t feel real that Paul is no longer with us.'After his surgery, Freddie made a miraculous recovery after he managed not to burst his stitches. Paul was ecstatic upon seeing his progress, admitting 'I like this dog' and calling the friendly lurcher 'my little man'. ",
        "The end of the episode showed Freddie moving in with a new family, and thriving as he played and learned new tricks.  Elsewhere in the episode, Paul helped a Cavalier King Charles Spaniel George regain his confidence after being bought on the internet twice and being dumped back at the home both times. He was joined by celebrity pals Diane Morgan and Anna Maxwell Martin as they visited the home and bonded over their love of dogs. Paul was widely known as a big dog lover, having already given a home to Chihuahua-Jack Russell cross Eddie, Shih Tzu Boycie, Maltese Conchita, mongrels Arfur and Nancy, and a dachshund called Sausage, from Battersea Dogs &amp; Cats Home where the series is filmed.In March, Paul's partner Andre Portasio shared that he had passed away 'unexpectedly but peacefully'. He said: 'It is with great sadness that I inform you that Paul has passed away unexpectedly but peacefully yesterday evening.",
        "'We ask, at this difficult time, that whilst you celebrate his life you also respect our privacy as we come to terms with this loss.'He will be greatly missed by his loved ones, friends, family, animals and all those who enjoyed his humour, wit and compassion.",
        "'I know that he would want me to thank you for all the love you have shown him over the years.'     The couple were married during a low-key wedding ceremony in 2017 .During Paul's career, he hosted The Paul O'Grady Show, Blind Date and Blankety Blank, as well as ITV's multi-award-winning For The Love Of Dogs. He also hosted ITV celebrity game show, Paul O'Grady's Saturday Night Line Up."
    ]
}