{
    "articleURL": "/wires/reuters/article-12047159/Top-U-S-intelligence-official-says-Sudan-conflict-likely-protracted.html",
    "content": [
        "WASHINGTON, May 4 (Reuters) -",
        "U.S. President Joe Biden paved the way for new Sudan-related sanctions on Thursday, calling the country's raging power struggle a \"betrayal\" of its citizens.Biden signed an executive order laying groundwork for potential sanctions as his intelligence chief warned that the conflict between Sudan's military and the paramilitary Rapid Support Forces (RSF) is unlikely to end soon.Fierce fighting raged in central Khartoum on Thursday as the army tried to push back the RSF from areas around the presidential palace and army headquarters. A seven-day ceasefire was supposed to be in effect.\"The violence taking place in Sudan is a tragedy - and it is a betrayal of the Sudanese people's clear demand for civilian government and a transition to democracy,\" Biden said in a statement.He said Washington would keep using diplomacy to create a \"durable ceasefire,\" allow humanitarian access, and assist American citizens who remain in the country.\"The United States is already responding to this unfolding humanitarian crisis and stands ready to support enhanced humanitarian assistance when conditions allow,\" Biden said.That may take time. U.S. Director of National Intelligence Avril Haines told members of the Senate Armed Services Committee that fighting in the country is \"likely to be protracted\" because both sides believe they can prevail militarily and have few incentives to negotiate.",
        "The U.N. has warned that fighting, which erupted on April 15, risks causing a humanitarian catastrophe that could spill into other countries.Sudan said on Tuesday that 550 people had died and 4,926 people been wounded so far in the conflict. About 100,000 people have fled Sudan with little food or water to neighboring countries, the U.N. says.\"The fighting in Sudan between the Sudanese armed forces and the Rapid Support Forces is we assess likely to be protracted as both sides believe they can win militarily and have few incentives to come to the negotiating table,\" Haines said.The foes, she continued, both are seeking \"external sources of support,\" which if forthcoming, \"is likely to intensify the conflict and create a greater potential for spillover challenges in the region.\"The ongoing violence, Haines warned, is worsening \"already dire humanitarian conditions\" and forced aid organizations to curtail operations amid growing fears of \"massive refugee flows.\" (Reporting by Trevor Hunnicutt, Daphne Psaledakis, Jonathan Landay and Idrees Ali Editing by Alistair Bell and David Gregorio)"
    ]
}