{
    "articleURL": "/sport/nba/article-12038657/NBA-Memphis-Grizzlies-not-want-Dillon-Brooks-return-season-circumstances.html",
    "content": [
        "The Grizzlies notified Dillon Brooks about decision after losing in six to Lakers Brooks, 27, had spats with LeBron James, Donovan Mitchell and Gary Payton II DailyMail.com provides all the latest international sports newsThe Memphis Grizzlies informed firebrand forward Dillon Brooks that he won't be back with the team next season following their first-round postseason exit, multiple sources revealed on Tuesday.",
        "The 27-year-old pending unrestricted free agent is not welcome back 'under any circumstances,' according to The Athletic.The Grizzlies notified Brooks about their decision to part ways during exit meetings after their Western Conference first-round playoff series loss to the Los Angeles Lakers.That series reportedly was the breaking point for Memphis, with Brooks making headlines for calling LeBron James 'old' and 'tired' and later punching the Lakers superstar in the groin area, earning a Game 3 ejection. He later said that he doesn't regret any of his actions or comments. Following the Grizzlies' lopsided 125-85 elimination loss at Los Angeles in Game 6 on Friday night, Brooks fled the arena without speaking to reporters. ",
        "The NBA fined him $25,000 on Sunday for violating league rules governing media access. Brooks finished Game 6 with 10 points, four rebounds and two assists. For the series, he averaged 10.5 points on 31.2 percent shooting with 3.0 rebounds.The Lakers often left the Canadian forward wide open during the series, daring him to shoot while putting an extra defender to keep Grizzlies All-Star Ja Morant at bay from driving or passing it to sharp-shooter Desmond Bane, who'd be lurking from the perimeter.Brooks helped the Grizzlies earn the West's No. 2 seed by averaging 14.3 points, 3.3 rebounds and 2.6 assists in 73 games (all starts) in the regular season.",
        "Brooks, a second-round pick in the 2017 NBA Draft, averaged 14.5 points, 3.1 boards and 2.1 assists in 345 career games (318 starts) with Memphis.He's only played for the Tennessee-based franchise in his six years in the league and was considered to be the team's longest-tenured player. Brooks was involved in several altercations over the years, earning a suspension for hitting Gary Payton II in the head in the 2022 playoffs, causing him to sit out for a game against the Golden State Warriors in the Western Conference. Earlier this season, he also hit Donovan Mitchell, of the Cleveland Cavaliers, which started an on-court brawl in front off thousands of fans. Brooks rejected a contract extension with the Grizzlies early in the 2022-23 season, which 'led to the end of talks', per Shams Charania, of The Athletic."
    ]
}