{
    "articleURL": "/wires/pa/article-12057289/Let-s-going--Mikel-Arteta-urges-Arsenal-maintain-title-fight.html",
    "content": [
        "Arsenal boss Mikel Arteta has challenged his players to “keep digging” for the Premier League title after a statement victory at Newcastle.",
        "Arteta, who showed his squad video clips of their 2-0 defeat at St James’ Park last season from the Amazon documentary All or Nothing on the morning of the game, is convinced the prize is still there for the taking with leaders Manchester City a point better off with a game in hand.Speaking after Sunday’s 2-0 win on Tyneside, he said: “We are there, now we want to keep digging. The prize is there, not too far.“The only thing we can do is keep insisting and don’t turn our backs and lose the focus on something else, be determined every single day. Let’s keep going and see what happens.”",
        "The Gunners secured the points courtesy of Martin Odegaard’s first-half strike and Fabian Schar’s own goal after the break in a performance of real character as they helped keep the Champions League-chasing Magpies at bay with a combination of excellence and game-management which infuriated the locals.Asked if their display had proved they will fight until the end, Arteta said: “It proves that we’ve done it today. Now we have to prove that we are able to do it against Brighton.",
        "“We’ve done it for eight and a half months and we have to keep doing it. We are there and now it feels very different to 10 days ago and we have to now make sure that the momentum is there.”",
        "Arsenal rather turned the tables on Newcastle, who had annoyed Arteta and his players in January’s 0-0 draw at the Emirates Stadium with their game-management, and the Spaniard was unapologetic.He said: “We have done what we had to to win the game and I’m very happy with that.”A hugely entertaining contest might have panned out differently had Jacob Murphy not been denied by the post, or had referee Chris Kavanagh not been asked to review his decision to award a penalty against Jakub Kiwior after ruling he had blocked Bruno Guimaraes’ goal-bound shot with his hand.The Gunners took full advantage of their reprieve when Odegaard, who along with Jorginho turned in an accomplished performance in the middle of the field, blasted them into a 14th-miute lead and the points were secure when Schar unwittingly deflected Gabriel Martinelli’s cross into his own net.Newcastle head coach Eddie Howe, whose side are now just three points clear of Liverpool in the race for a top-four finish, although with a game in hand, was in philosophical in defeat.Howe said: “At this stage of the season with four games to go for us, absolutely I have to be measured, I have to be, I think, very positive.“I don’t think there’s any time for negativity to creep into my psychology or the players’ psychology.",
        "“I’m proud of the players today. I know the result went against us, but you could see the effort and commitment of what we tried to deliver. It was a high-quality game, it was end-to-end, it was open, but we were just missing that X-factor today, that missing part of our game.“We hope against Leeds in our next game that we deliver that together because we have a tough run of fixtures to come and we need to get some results to get over the line.”"
    ]
}