{
    "articleURL": "/news/article-12056689/Ivanka-Trump-Jared-dress-Miami-style-lavish-dinner-alongside-Jeff-Bezos.html",
    "content": [
        "Jeff Bezos' girlfriend Lauren Sanchez, 53, and Ivanka Trump, 41, both glowed as they dressed up Miami-style for the event on Saturday night They were heading to $3,000-a-night Carbone Beach in Miami on F1 weekend Elon Musk even took a break from his Twitter overhaul weekend to jet down to south Florida for the Miami Grand PrixJeff Bezos, Ivanka Trump and their respective partners stepped out in Miami last night for an exclusive dinner ahead of the Formula 1 Grand Prix race on Sunday.  ",
        "The former First Daughter and billionaire Amazon founder were among the celebrities a A-listers heading to Carbone Beach - an extravagant four-night supper club built to celebrate Miami's racing week. Bezos' girlfriend Lauren Sanchez, 53, and Ivanka Trump, 41, both glowed as they dressed up Miami-style for the event on Saturday night.  The attendees, who forked out $3,000-a-night on reservations, were treated to cuisine from Italian restaurant Carbone and star-studded live entertainment - in an ambiance that has been described as something out of The Great Gatsby. Bezos stepped out in a stylish maroon t-shirt, while his glamorous girlfriend Lauren glitzed in a sparkly ensemble and nude heels.  ",
        "Ivanka Trump brought color to the event - wearing an off-the-shoulder beaded swirl-patterned mini dress, a clutch bag, and red shoes.She walked into the A-list event hand in hand with her husband, Jared Kushner.Kushner kept his look simple yet elegant in blue jeans and a crew neck jumper. Grand Prix globetrotters who descended on Miami this weekend for the race spent Saturday evening eating and partying on the beach, ahead of the fixture on Sunday. The creators of the special F1 pop-up vowed that the exclusive experience would be even more opulent and crazy than 2022 - with a cocktail hour that leads into a seated dinner. ",
        "Mario Carbone, managing partner of Major Food Group, said about the event that Bezos and Ivanka Trump attended: 'Hosting Carbone Beach during Formula 1 in Miami is the ultimate merger of adrenaline, luxury, and hospitality.'It's a spectacle that brings together unparalleled energy and glamour. 'This year will be even bigger and more lavish than our inaugural year. 'We expect to surpass that level of excitement and decadence, creating an unforgettable experience with new performances and indulgences that are truly over-the-top.'Even Elon Musk took a break from his Twitter overhaul this weekend to jet down to south Florida for the Miami Grand Prix.He revealed that he spoke to Bezos on Saturday - billionaire to billionaire - about aero and battery technology in F1.  Ahead of FP3, the Tesla boss was spotted chatting with Red Bull Team Principal Christian Horner on Saturday.Holding his son in his arms, Musk appeared to have been given a tour of the current Constructor Championship leaders garage.The SpaceX chief was seen trying on a pair of headphones, while Horner watched on.Horner revealed that Musk was there at the invite of Larry Ellison, executive chairman of the team's title sponsor Oracle.'We were talking about batteries, regeneration and so on. Great to have them here this weekend,' he told Sky Sports.",
        "However, the 51-year-old wasn't the only billionaire in the paddock. Not to be outdone, Amazon owner Jeff Bezos was also spotted at the Miami International Autodrome.But Bezos wasn't hanging around with the favorites but rather one of the underdogs for the weekend, McLaren.The billionaire was picked up by TV cameras working on the team's pit wall with the McLaren engineers.It appears McLaren CEO Zak Brown even stepped down to allow Bezos a seat at the wall.But some Formula One fans have pointed out that Bezos could have split loyalties with Amazon's IT services company AWS sponsoring Ferrari.However, not everyone was pleased to see the two billionaires barging their way into the sport.'Team bosses pandering to celebs and Elon Musk, Zak Brown fluffing a pillow for Bezos on the McLaren pit wall, empty grandstands, a crap circuit and another boring race seemingly inevitable due to a subpar surface. Welcome to Miami,' another fan ranted."
    ]
}