{
    "articleURL": "/femail/article-12038959/Author-COCO-MELLORS-scored-smash-hit-debut-novel-just-wouldnt-no-answer.html",
    "content": [
        "Coco's debut, Cleopatra and Frankenstein, is being developed into a TV series READ MORE: JENNY JACKSON tells why she knew her debut novel (which sold for a hefty seven-figure sum) would be a hit What I admire most about 33-year-old Coco Mellors isn’t that she’s written one of the most unputdownable bestsellers of the year (over 66,000 copies sold to date). ",
        "It’s not even that said bestseller – Cleopatra and Frankenstein – is already being developed by Warner Bros and Brownstone Productions into a TV series. It’s just that she’s proof of how nothing worth having in life comes easily.‘Writing a first book could be easier for others but for me it was slow,’ she says from her home in Los Angeles where she lives with her husband Henry Simonds, a British brand strategist. ‘I was working full-time as a copywriter, dating and doing a master of fine arts (MFA) degree in fiction at New York University – so I was trying to live my life as well as write a novel.’Thirty rejections later, Mellors remained steadfastly determined. But how? ‘One thing they teach you in the MFA is the difference between a soft and a hard rejection. A hard rejection is when someone doesn’t even read the work, or says straight out: “Sorry, this is not for us.” ",
        "'I definitely got some hard rejections, but I overwhelmingly got soft rejections, when someone really takes the time to say what they love – tantalisingly close to yes.’She knew the book’s chief characters were the draw. Set in New York (where Mellors, originally from London, moved with her family when she was 15), the story revolves around the relationship between Cleo, an ethereal 24-year-old artist, and Frank, a 44-year-old hard-living advertising boss. ",
        "They meet by chance in a lift on New Year’s Eve and rush headlong into marriage.But when Mellors sent early versions of the novel to publishers (after five years of working on it), she kept hearing the same thing: ‘They said they lost track of Cleo and Frank. Luckily there were two editors who were willing to read it again, and that changed my life. They told me what they thought I needed to do in another draft. And then I went and did it and they both ended up buying it!’Most readers assume Cleo must be based on Mellors’s own life, but she says not.‘Like me she has blonde hair, is British and is the same age I was when I started writing the book. But internally, she is the character that remained the most mysterious to me during writing because she deals with things by pushing them down. She was tricky to get close to.’One big problem between the couple is Frank’s drinking, so it’s interesting to learn that a pivotal part of Coco’s life was overcoming the alcoholism that plagued her 20s. ",
        "In her book acknowledgments, she thanks ‘the sober community of downtown New York, who really did love me until I could love myself’.",
        "Although she loved living in New York, and is still torn about leaving it for LA, she has spoken about how lonely it can be and how she found herself out at 3am wishing her nights weren’t blurring into days. Staying away from alcohol is something she works on constantly and Mellors has been sober now for seven years. ‘I take active steps to ensure that it [sobriety] is central. I have a very large network of sober people in my life. Everything good comes from that and I really hope I am still doing that in five years’ time.’She dedicated Cleopatra and Frankenstein to her mother because she was her biggest supporter, reading every rewrite and encouraging her to keep going. Mellors says she would love to be a mother herself in the not-so-distant future but, right now, she is still processing the sadness of a miscarriage last summer. The experience has provided inspiration for her next book. ‘It was such a painful thing to go through. Although it was heartbreaking and remains a part of my life that feels very tender and scary, I feel excited now to write about that, and use my own experience in my third book.'The character I’m exploring is not me, but I am pulling from a chorus of women.’",
        "Before that comes to fruition, however, she is completing final edits on her second book, Blue Sisters, the tale of three siblings – Aidree, a lawyer in London; Bonnie, a boxer in LA; and Lucky, a model in Paris – coming together after the death of a fourth.Apart from writing, Mellors has a passion for fashion. ‘It’s a big joy in my life. Clothes are a powerful sense of self-expression and I really push back against this idea that to be a thinker or a serious creative you shouldn’t care about fashion and beauty. I think that’s a very male attitude towards creativity.’What she really wants to devote more time to, however, is helping other would-be authors. ‘I love meeting readers who want to write, and talking about the craft of writing.'I was very lucky to have a really strong education in this and want to pass some of that on to others.’The idea she would most like to convey to would-be female writers is that other women aren’t necessarily rivals. ‘As a writer, you often encounter feelings of competitiveness. Perhaps you see others get things you would like. As a female writer, particularly, there can be a feeling there isn’t enough to go around.’ The antidote to this, Mellors believes, is to actively reach out to women poised to follow in her footsteps.",
        "‘A lot of the first part of my career was about looking after myself, trying to get my own book deal, and I didn’t have much to offer other people. Now it’s tipped a bit and it’s about putting the ladder down, so others can follow you up.’Speaking of giving new talent a leg up, she thinks it would be terrific if the lead in the TV adaptation of her first book were to be played by an unknown actress. Perhaps the Cleopatra character could jumpstart her career. Just as she did for Mellors.Cleopatra and Frankenstein by Coco Mellors is published by HarperCollins, £9.99*"
    ]
}