{
    "articleURL": "/wires/pa/article-12058971/Man-City-eye-revenge-against-Real-Madrid--Champions-League-talking-points.html",
    "content": [
        "Manchester City travel to the Bernabeu Stadium to face Real Madrid in the first leg of their Champions League semi-final on Tuesday.",
        "Here, the PA news agency looks at some talking points ahead of the game.Revenge for CityThe tie is a rematch of last year’s semi-finals when City left the Bernabeu heartbroken after letting a place in the final slip through their grasp.City had been leading 1-0 on the night and 5-3 on aggregate heading into stoppage time when they suddenly capitulated and conceded twice. Real went on to win in extra time.Pep Guardiola’s men will certainly hope revenge is in the air and they will want to use the fact the home leg comes second this time to their advantage.Momentum with City in treble chase",
        "They are unbeaten in 20 matches – 17 of which they have won – and have a strong chance of winning the Premier League, Champions League and FA Cup.Arguably, the Spanish giants are the toughest obstacle left to clear as they look to win the treble.Copa del Rey joy for MadridThose would be Saturday’s Copa del Rey final against Osasuna, which they won 2-1, and the two City encounters over the coming week.Their triumph at the weekend, secured after two goals from Rodrygo, should certainly have raised confidence levels.Haaland the missing piece",
        "After years of near misses in the Champions League, City are hoping the prolific Norwegian is the last piece of the jigsaw as they look to finally land the big prize.",
        "He has revelled in Europe, not least when he fired five past RB Leipzig in the last 16 and then struck in both quarter-final legs against Bayern Munich. All eyes will be on him to see if he can deliver at the Bernabeu.Bellingham reportsThe England midfielder is widely expected to leave Borussia Dortmund this summer and Manchester City were reportedly among the interested parties.Whether the development would actually unsettle an outfit as composed as Guardiola’s City is debatable, but it certainly adds to the pre-match hype."
    ]
}