{
    "articleURL": "/wires/reuters/article-12053509/Cards-Adam-Wainwright-tries-tame-Tigers-23-debut.html",
    "content": [
        "St. Louis pitcher Adam Wainwright will belatedly start his final major league season on Saturday when the Cardinals continue their three-game home series with the Detroit Tigers.",
        "The Tigers won the opener 5-4 on Friday for their fourth straight victory. The Cardinals took their seventh consecutive loss.\"We've not played a good game, but I would hope that after another month, we've got the excitement back in the city about Cardinals baseball again,\" said Wainwright, who missed the first five weeks of the season while recovering from a groin muscle strain sustained while training with Team USA in the World Baseball Classic.\"I know a lot of a lot of fans are still optimistic and a lot of fans are looking at it realistically going, 'This is going to be very tough.' They're both right. I think this whole city knows that. The guys in this clubhouse have the potential to go out and win just like they did last year and the year before that.\"Wainwright, 41, previously announced his plans to retire after this season. After making three minor league rehabilitation appearances, Wainwright got the green light to return to the St. Louis rotation. He went 11-12 with a 3.71 ERA last season.In his third rehab outing, Wainwright stretched out to 89 pitches and threw 61 strikes in 5 2/3 innings for Triple-A Memphis on Sunday. He allowed four runs on seven hits, including a three-run homer, while striking out nine and walking one.",
        "Now he returns with the Cardinals desperate to gain traction after losing 10 of 11 games. St. Louis fans have expressed audible frustration with the team during the current homestand, which began with a three-game sweep at the hands of the Los Angeles Angels.\"As far as the booing, it's not something I expect from our fans, but I also don't expect to play like we've played,\" Wainwright said. \"With what (booing) we've gotten, I can't say we don't deserve it.\"Wainwright is 1-0 with a 2.00 ERA in two career appearances vs. the Tigers, a 2006 relief outing and a 2009 start.The Tigers' scheduled Friday starter, Spencer Turnbull (1-4, 6.84 ERA), will continue his comeback from Tommy John surgery. He allowed three runs (two earned) in four innings in his last start, a 5-3 loss to the Baltimore Orioles on Sunday.His longest outing this season has been 5 2/3 innings, and his highest pitch count has been 88.\"I'm really hard on myself,\" said Turnbull, who has never faced the Cardinals. \"In some ways, I'm expecting to come back out and be in no-hitter form. But this is still the first chance I've had to build up innings. I didn't have any outings last year to get some of that out of the way.",
        "\"Not trying to make excuses or anything. I'm just trying to be realistic with my expectations of myself and knowing that it's getting there. ... I just have to not look at the results. If I look at the results, I'll get pretty (angry) and start breaking stuff.\"The Cardinals adjusted their roster for this series, putting outfielder Tyler O'Neill (back strain) and right-hander Jake Woodford (shoulder inflammation) on the injured list and calling up infielder/outfielder Juan Yepez and right-hander James Naile from Memphis.--Field Level Media"
    ]
}