{
    "articleURL": "/news/article-12056229/Major-Jonathan-Thompson-handsome-equerry-took-centre-stage-Kings-coronation.html",
    "content": [
        "Major Jonathan Thompson serves the King and is seen constantly at his sideThe kilt-clad equerry part of the 5th Battalion Royal Regiment of ScotlandThe King's handsome kilt-clad equerry who first won over admirers at the Queen's funeral has left hearts racing again after he proudly stood by Charles' side during the Coronation.",
        "Major Jonathan Thompson, of the 5th Battalion Royal Regiment of Scotland, was front and centre yesterday as he stood between Charles and the Pages of Honour during the historic ceremony.The Army officer, 39, known to friends as 'Johnny' but dubbed on TikTok as 'Major Eye Candy', was once the Queen’s most senior bodyguard but now serves His Majesty and has been seen constantly at his side.But outside of his royal duties, Maj Thompson, from Northumberland, is a father-of-one and loving husband to his marketing manager wife Caroline. He and Caroline, 44, have been happily married since 2010 and welcomed their son in 2018. The couple also has two black Labradors called Odin and Piper – a nod to Maj Thompson's military time in Scotland.",
        "Royal fans across the globe were swooning yesterday after the King's trusted official was spotted amongst the congregation at Westminster Abbey.The 'dashing' equerry stood beside the new monarch during the ceremony, which many social media users joked was 'distracting'.'Must admit there were times when I was a bit distracted today,' one tweeted. 'Major Jonathan Thompson is why we watch the coronation,' another added. 'Look at his beauty and his thick calves too.' Other admirers also couldn't help but point out the army officer's striking good looks as another fan wrote: 'Anyone else clocked the dashing chap in the kilt?'",
        "'Good to see the hot Groom of the Robes, Lt Col Jonathan Thompson do some actual disrobing,' tweeted another. ",
        "Maj Thompson is so handsome that some admirers even became a little territorial and warned others to keep their 'hands off'. 'That's the dashing major Johnny. Hands off!!' wrote one Twitter user. The officer became an object of royal watchers' affections last year after he was thrust front-and-centre at historic Royal events following the Queen's death.He was caught on camera calmly and coolly removing a pen tray which was cluttering the King’s desk, as Charles signed the Proclamation which named him as the new monarch.He was also seen in the procession when the Queen’s coffin was escorted from Buckingham Palace to Westminster Hall for the four days of lying in state. He greeted Ukrainian president Volodymyr Zelensky during his trip to the UK back in February and escorted then-Prime Minister Liz Truss to meet the King at Buckingham Palace in October 2022.He was also spotted standing behind Harry and Meghan at the Platinum Jubilee celebration National Service of Thanksgiving at St Paul’s Cathedral last June. ",
        " His role as an equerry, an officer of the royal household who assists members of the royal family, involves assisting the King with his daily duties, standing beside him at public events and looking after the monarch's carriages, coaches, and Rolls-Royces used at state ceremonies.",
        "Maj Thompson has had a relationship with the royal family for several years. He has been one of the 5th Battalion Royal Regiment of Scotland since 2006 and previously served as one of the Queen's most senior bodyguards.Contrary to most people believing he is Scottish, Maj Thompson was actually born in Morpeth, Northumberland, and now lives with his family in Surrey.He joined the Army in 2006 and is a Platoon commander, according to his LinkedIn. He is believed to have been working as an equerry with Charles for at least the last two years.His profile also reveals how he attended Aberystwyth University where he graduated in 2004 with a degree in Economics and politics with international studies and he gave his hobbies and interests as rugby and mountaineering and he was also a member of the undergraduate officer training corps.",
        "Maj Thompson tied the knot with his keen equestrian wife in 2010.Mrs Thompson was reportedly educated at Windsor Girls School and nearby Strodes College where she passed three A levels in media, psychology and photography before obtaining an HND at Southampton Institute in Design Communications.She has worked for Packard Bell, BMW and is also a gym instructor and keen horse rider, and last year with her marketing and design skills helped set up the website for charity Horses4Health.",
        "A biography on the site set up in 2021 said: ’Caroline has been riding for over thirty years and bought her New Forest mare 'Bonnie' as a yearling almost 16 years ago.'The partnership has done a bit of everything over the years from hacking and showing to showjumping and horse trials but since the birth of Caroline's son in 2018 they are now enjoying a slightly less competitive life.​‘Caroline worked in the marketing industry for 11 years before getting married in 2010 to Johnny - a serving member of the Armed Forces. It was this that spurred her on to take the plunge to change careers to become a Personal Trainer and Exercise Referral specialist.",
        "‘This began her interest in mental health and the benefits that exercise can have on it. Her own struggles led her to discover first-hand how both physical exercise and horses can greatly help with mental health and it was this that encouraged her to initially volunteer to help with The Great Horses For Health Relay in January 2021.'She has since got back into working in the world of marketing / project management due to it fitting in better with her other life commitments.‘Caroline was responsible for building the first Horses4Health website as well as being on the main organising committee for the event.'",
        "The pair currently live in Surrey with their son and animals, but have spent time living in various parts of the UK, which Mrs Thompson joked was one of the 'joys of being an Army family!’"
    ]
}