{
    "articleURL": "/wires/pa/article-12052947/George-Charlotte-Louis-join-coronation-procession-Abbey.html",
    "content": [
        "Prince George, Princess Charlotte and Prince Louis will join the grand carriage procession back to Buckingham Palace after witnessing their grandfather being crowned.",
        "The King and Queen will travel in the 261-year-old Gold State Coach, followed by three others carriages carrying working members of the royal family.",
        "The Earl Marshal, the Duke of Norfolk, the man in charge of organising the historic occasion, described the return procession as a “glorious display of pageantry”.Seven thousand troops will be on ceremonial duties, with 4,000 taking part in the procession itself escorting the King and Queen from Westminster Abbey at 1pm.The Princess Royal will ride on horseback behind Charles and Camilla as Gold Stick in Waiting and Colonel of the Blues and Royals, to the rear of the Gold State Coach.",
        "In the first carriage behind the Gold State Coach will be the Prince and Princess of Wales with nine-year-old George, Charlotte, eight, and five-year-old Louis.It is not the youngsters’ first experience of a royal carriage procession, with the trio waving to crowds from a landau during the Platinum Jubilee celebrations last year.The next carriage will contain the King’s youngest brother the Duke of Edinburgh with his wife the Duchess of Edinburgh and their children Lady Louise Windsor and the Earl of Wessex.",
        "The late Queen’s cousin the Duke of Gloucester and his wife the Duchess of Gloucester, and Anne’s husband Vice Admiral Sir Tim Laurence will travel in the third carriage,",
        "Following by car are the Duke of Kent and Princess Alexandra, also cousins of Elizabeth II, and completing the procession of royals.There is no place in the procession for the Duke of Sussex and the Duke of York, who play no formal part in the coronation ceremony, nor for Princesses Beatrice or Eugenie."
    ]
}