{
    "articleURL": "/health/article-12041039/Are-super-memoriser-Scientists-release-game-hunt-Brits-exceptional-memory.html",
    "content": [
        "You may be invited to have a brain scan at the Wolfson Brain Imaging CentreThere are three stages in total and for each test you are given three chancesREAD MORE: Which of your memory lapses are signs of dementia?Scientists are on the hunt for 'super memorisers' to take part in a new study about people with exceptional memories.",
        "Academics from the University of Cambridge are trying to uncover why some people are much better at remembering than others.Anyone who believes they have an exceptional memory is being urged to complete an online survey and take part in memory-based games, which include remembering number sequences and patterns.Based on their performance, some will be invited to Cambridge to have a brain scan so researchers can examine if they have any differences in structure or function.Professor Jon Simons, a cognitive neuroscientist at the university, said: 'Memory is one of the best understood psychological processes in terms of brain networks and yet we still don't really know why some people have exceptional memories. 'That's why we're inviting people to take part in our study.'",
        "The online test is made up of three different games. For each game, you are given three lives to get through as many levels as possible. The first task is called 'Paired Associates', which sees images, such as cars, washing machines and symbols pop up on the screen which are then covered by boxes.The images then appear again in the centre of the screen and you have to click which box that image is inside.There are 24 levels to this game and new pictures and boxes appear each round.",
        "Once you have used all three lifelines, you score is logged and you move onto the next game. Before each one, you are given the opportunity to test your skills and become familiar with the next assessment through a tutorial. The next game is 'Digit Span'. This tests your ability to be remember number sequencing. A series of numbers appear on the screen. Once the sequence has finished you have to push number buttons to recite them in the exact same order in they appeared.",
        "The more numbers you successfully recite in the right order, the higher your score. When you either complete all 25 levels or use all your lifelines, the third and final test will begin.The last game, called 'Spatial Span', compromises of a grid of 12 boxes. A green light will flash in different boxes at different times to form a sequence. After it is finished you must then click the order in which the boxes flashed. After each level, one more box is added and the pattern changes each time. ",
        "After completing the challenges, you may be invited to the Wolfson Brain Imaging Centre in Cambridge for an MRI scan of your brain. At the centre, researchers may ask you to complete several quick cognitive tests on memory, verbal, reasoning and perception. ",
        "You may also be asked to complete memory tests while in the scanner. The researchers are also aiming to discover whether people who are autistic or neurodiverse are more likely to have an exceptional memory. The team have previously worked with writer Daniel Tammet, who is autistic and has synaesthesia and can recall the number pi to 22,514 digits.Professor Sir Simon Baron-Cohen, director of the Autism Research Centre at Cambridge University and lead investigator of the study, said: 'You don't need to have won any competitions to take part or to consider yourself neurodiverse - and you certainly don't need to be able to recite pi to 22,000 digits.'We're looking for anyone who thinks they might be a \"super memoriser\" to try out our memory tests.'Dr Carrie Allison, also from the Autism Research Centre, added: 'We hope that people will enjoy taking part in this study and in the process contribute to helping us understand more about memory and whether exceptional memory is related to autism.'For decades, autism research has focused on disability, but this study is a wonderful opportunity to focus on strengths.'People aged 16 to 60 who wish to take part in the online memory tests can do so by clicking here.",
        "From the right diet to staying active, a few lifestyle tweaks can give your grey matter a new lease of lifeGet those omega-3sOur brains love the omega-3 fatty acid DHA, which is found in oily fish such as salmon and mackerel.One study of more than 2,000 adults found eating fish twice a week appeared to reduce the risk of dementia by 44 per cent.What makes fish – particularly oily or fatty fish like salmon, mackerel and sardines - so beneficial for vascular or brain health is its omega 3 essential fatty acid content. Omega 3 appears to support blood flow to the brain, which helps support memory and reduces the risk of cognitive decline.For vegetarians and vegans, avocados, nuts, seeds and plants oils such as flaxseed and olive oil are rich in omega-3 fats. Don’t stop movingAs if you needed any other reasons to exercise, working out is essential to your grey matter. Getting hot and sweaty increases blood flow to the brain, which is thought to encourage enzymes to break down proteins that can build up into the damaging brain plaques, which are a hallmark of Alzheimer’s.A 2017 review examining the effects of exercise on at-risk people found that aerobic exercise, such as brisk walking and swimming, was three times more beneficial than those who did a mixture of cardio and weights.However, older people who do any sort of exercise at all demonstrated better cognitive ability than people who did nothing.Pop nootropicsNootropics are a new generation of drugs that are thought to help boost cognitive function. The term is used to refer to any natural or synthetic substance that may have a positive impact on mental skills. These can include known natural brain-boosting vitamins and minerals but also lesser-known herbs including ginkgo biloba (said to have neuroprotective effects and thought to help reduce the build-up of amyloid plaque linked to some forms of dementia) and Bacopa monnieri (one clinical trial found taking 300mg of it daily delayed word recall in the over 65s compared to placebo treatment). Caffeine is also classed as a nootropic and having your usual coffee or tea pick-me-up – or even chewing caffeine gum - has been shown to help boost mental alertness, particularly if you are tired.Learn new thingsOur brain loves new things and when we are not exposed to anything new cognitive decline becomes more likely. This doesn’t have to be ultra-challenging or daunting like learning a new language or signing up to an OU course - it can include something as simple as walking on the different side of the road on your usual route to work or brushing your teeth with your left hand when you are right-handed (or vice versa) to give your brain a mini work-out. And it’s not all obviously ‘brainy’ stuff that is beneficial.Eat your greensAccording to a 2018 study from Rush University, just one serving of green vegetables a day for an average of 4.7 years is enough to help to slow cognitive decline, giving the study volunteers the brain of someone 11 years younger.So load up on kale, spinach, broccoli which provide brain-friendly nutrients including vitamin K, lutein, nitrate and folate.Boost your gut bugsUnderstanding of the importance of our gut is growing by the day, particularly the relationship between our gut microbiome and the brain, called the brain-gut axis.The theory goes that the healthier your gut is, teeming with trillions of bacteria, ideally a diverse mix of 'friendly' bugs, the better your brain health is.Research shows that following the Mediterranean diet - primarily plant-based, filled with anti-inflammatory fruit and vegetables, omega 3 fatty acids, fish and extra virgin olive oil - can nurture the ‘good’ bacteria in your gut.Start socialisingLoneliness can take a huge toll on our mental and physical health and it’s particularly stressful for our brains.‘Social connectedness is important not only for our emotional health, but also for cognitive resilience’, says Professor Burianova.‘Research has shown that feeling lonely more than doubles the risk of developing Alzheimer’s.’She advises anyone feeling lonely not to feel bashful but to reach out to others.Drink cocoaA hot chocolate before bed may be doing more than helping you sleep.A small Italian study involving healthy volunteers aged between 50 and 69 found that a specially prepared cocoa drink, containing large amounts of flavanols - powerful polyphenols - showed a decline in memory loss.Researchers think the drink increased the blood flow to a specific region of the brain concerned with memory.Get to bedUnsurprisingly, a good night’s sleep has a huge impact on our cognitive health.A 2017 Greek study showed that a lack of sleep, and poor quality sleep, were associated with poorer memory in men and women over 65.The position you sleep in could also play a part. Researchers at Stony Brook University in New York found that sleeping on your side can more effectively contribute to a night time ‘power cleanse’ helping to remove brain waste, like beta-amyloid proteins, implicated in the development of Alzheimer’s and other neurological diseases."
    ]
}