{
    "articleURL": "/tvshowbiz/article-12061565/Robert-Irwin-shares-adorable-mirror-selfie-niece-Grace-Warrior-two.html",
    "content": [
        "Ever since his niece Grace Warrior was welcomed into the world, Robert Irwin has been relishing in being an uncle. ",
        "And the wildlife warrior, 19, excitedly shared a sweet photo with the tiny tot, two, on his shoulders last week.Robert and Grace both brandished wide smiles as the budding photographer snapped the mirror selfie. 'Uncle life,' Robert captioned the photo. Grace's mother Bindi was first to comment, writing: 'The best!' ",
        "It comes just weeks after Robert flew interstate to Western Australia to continue his romance with new girlfriend Rorie Buckey.  Robert was seen packing on the PDA with Rorie, 18, as they reunited at Perth Airport on April 6. Rorie is the niece of late Hollywood star, Health Ledger. The couple was last pictured together in December during Robert's birthday celebrations at Australia Zoo.They were seen in the crowd during a live crocodile feeding show, with Robert's protective mother Terri awkwardly sat between them.",
        "Terri, 58, had apparently been keeping a close eye on the couple to make sure they 'kept things PG', New Idea reported at the time. 'Terri is really happy for Robert, and she likes Rorie, but she's urging him to take it slow for both their sakes,' a source said.'Terri knows all too well what it's like to be in a relationship in the public eye. She wants to make sure they're ready.'",
        "Robert and Rorie were first spotted together on a romantic beachside date in Queensland on November 18.",
        "The couple have plenty in common; both grew up in the public eye after suffering the devastating loss of a family member.Rorie's uncle Heath Ledger was at the peak of his Hollywood career when he was found dead in January 2008 following an accidental prescription drug overdose.Robert's father Steve Irwin, known around the world as 'the Crocodile Hunter', died aged 44 on September 4, 2006, after being pierced in the chest by a stingray."
    ]
}