{
    "articleURL": "/news/article-12052445/Peter-Thiel-want-frozen-dies-doesnt-think-actually-work.html",
    "content": [
        "PayPal founder Thiel, 55, said that while he still plans to be frozen, he is not convinced it will workThiel revealed his doubts while talking to journalist Bari Weiss on her podcast released earlier this weekHe had previously spoken about his intentions to be frozen when he diesBillionaire Peter Thiel has revealed he still plans to be cryogenically frozen when he dies so he can be brought back, even though he doesn't think it will actually work",
        "Thiel, who is worth over $4 billion, had been speaking to journalist Bari Weiss on her podcast when he confirmed his intentions. Weiss asked: 'Is it true that you're signed up to be cryonically preserved when you die so that you might be brought back to life in the future?'Thiel confirmed it, saying: 'Yes, but I think of it more as an ideological statement.'He continued: 'I don’t necessarily expect it to work, but I think it’s the sort of thing we’re supposed to try to do.'",
        "Thiel's interest in cryogenics has been well documented and he first revealed his plans in The Telegraph in 2014.He said: 'In telling you that I’ve signed up for it [cryogenics], there’s always this reaction that it’s really crazy, it’s disturbing.'But my take on it is it’s only disturbing because it challenges our complacency.'The company Thiel says he has signed up with, Alcor, describe their work as being the 'practice of preserving life by pausing the dying process using subfreezing temperatures with the intent of restoring good health with medical technology in the future.' The minimum cost for being Cryopreserved by the company is priced at $200,000, they also offer the option of just having your brain frozen for $80,000.",
        "German-born Thiel co-founded PayPal and Palantir, and was the first outside investor in Facebook. ",
        "In 2005 he begun Founders Fund, was one of the earliest mainstream investors to buy large sums of bitcoin.He has subsequently been vociferous in his support of digital currency."
    ]
}