{
    "articleURL": "/wires/pa/article-12054849/I-understand-sides--Pep-Guardiola-defends-duo-penalty-miss.html",
    "content": [
        "Pep Guardiola refused to criticise Ilkay Gundogan and Erling Haaland over the missed penalty in Manchester City’s unexpectedly narrow 2-1 win over Leeds.",
        "Regular taker Haaland deferred to Gundogan when City were awarded a late spot-kick at the Etihad Stadium to allow the German a chance to complete a hat-trick.Yet, much to Guardiola’s obvious frustration, Gundogan’s effort came back off Joel Robles’ left-hand post and Rodrigo pulled one back for relegation-threatened moments later.That set up a grandstand finish to what had seemed a straightforward Premier League assignment for the champions after Gundogan’s two well-taken efforts in the first half.",
        "Guardiola seemed quite annoyed at the time and was caught on camera saying he felt Haaland, who did not add to the 51 goals he has scored this season but twice hit the woodwork, should have taken it.The Spaniard, however, had calmed down by the time he undertook post-match media duties.",
        "Guardiola said: “The performance was excellent, we played really good.“I am not going to explain my feelings about the last five, six or seven minutes because in general it was really good. He is incredible and wants to score goals, but at the same time mates are important. He is so nice and generous  Pep Guardiola on Erling Haaland  “Who knows if Erling had taken the penalty and missed? What happens if Riyad (Mahrez) takes it and misses? What happens if Ilkay Gundogan takes the penalty and scores?",
        "“The question is, if it is 2-0 who is the taker? If it is 2-0 Erling or Riyad has to take it.“But (it shows) how Erling is as a person. He is incredible and wants to score goals, but at the same time mates are important. He is so nice and generous.“The game could have been over, but I understand both sides. Ilkay has never scored a hat-trick and he wanted him to do it.“Gundo scored two incredible goals. How good did he play today? He has everything.”Gundogan, who is out of contract at the end of the season, admitted the matter had taken the gloss off the game for him.He said on Sky Sports: “I saw Erling with the ball, looking for me, telling me to take it. I asked him a couple of times, ‘Are you sure?’ and he was quite sure and confident to give me the ball.“I wish I would have scored. The sad thing now, looking back, the disappointment of failing to score the penalty is a bit higher than actually scoring two goals and maybe winning the game.”The frantic finish gave new Leeds manager Sam Allardyce some positives to cling to from what had been a largely poor performance from the relegation-threatened side.",
        "Leeds are outside the bottom three only on goal difference and Allardyce, appointed earlier this week, now has just three games to guide them to safety.He said: “In the second half you would probably think, and rightly so, how many is it going to be?“We were defending with spirit but playing nowhere near the way we needed to.“When we stopped giving the ball to City we grew in confidence. We gave a stupid penalty away.“We scored and then the game was on and they were showing a bit of nerves. When you get Manchester City playing by the corner flag in the last five minutes you know you must still be in with a chance.”"
    ]
}