{
    "articleURL": "/wires/ap/article-12052343/Mayorkas-Border-challenging-asylum-limits-end.html",
    "content": [
        "BROWNSVILLE, Texas (AP) - U.S. Homeland Security Secretary Alejandro Mayorkas said Friday that authorities faced \"extremely challenging\" circumstances along the border with Mexico days before pandemic-related asylum restrictions end.",
        "A surge of Venezuelan migrants through South Texas, particularly in and around Brownsville, has occurred over the last two weeks for reasons that Mayorkas said were unclear. On Thursday, 4,000 of about 6,000 migrants in Border Patrol custody in Texas´ Rio Grande Valley were Venezuelan.Mayorkas noted that Mexico agreed this week to continue taking back Venezuelans who enter the U.S. illegally after asylum restrictions end Thursday, along with Cubans, Haitians and Nicaraguans. Migrants have been expelled from the U.S. more than 2.8 million times since March 2020 under what is known as Title 42 authority.The secretary reaffirmed plans to finalize a new policy by Thursday that will make it extremely difficult for migrants to seek asylum if they pass through another country, like Mexico, on their way to the U.S. border.\"The situation at the border is a very serious one, a very challenging one and a very difficult one,\" Mayorkas said.Illegal crossings tumbled after President Joe Biden announced asylum restrictions in January, but they have risen since mid-April. Brandon Judd, president of the National Border Patrol Council, said this week they have been hovering around 7,200 daily, up from about 5,200 in March.",
        "Border Patrol Chief Raul Ortiz said 1,500 active-duty troops will be dispatched to El Paso, Texas, adding to 2,500 National Guard troops already positioned across the border. Ortiz said El Paso was chosen because it has been a busy corridor for illegal crossings over the last six months. The troop deployment was announced this week but not the location.",
        "Mayorkas, on his second day of a visit to the Rio Grande Valley, said smugglers were deceiving migrants and luring them on a dangerous journey. \"The border is not open, it has not been open, and it will not be open subsequent to May 11,\" he said.Mexican Foreign Affairs Secretary Marcelo Ebrard echoed Mayorkas' sentiment about smugglers spreading misinformation.\"We´re seeing a very significant flow (of migrants) in recent days on the basis of a hoax,\" Ebrard said at a news conference. He said smugglers are saying, \"´Hurry up to get to the United States by crossing Mexico because on May 11 they´re going to end Title 42.´\"\"It´s a trick and they´re at risk,\" Ebrard said.Mexican President Andrés Manuel López Obrador urged those who want to migrate to follow legal pathways, such as applying in U.S. processing centers scheduled to open in Guatemala and Colombia. He said Mexico was not making special preparations for the end of Title 42 because he didn't expect a surge.\"A lot of people won´t let themselves be tricked,\" the president said.Mayorkas touted new legal pathways, which include parole for up to 30,000 Cubans, Haitians, Nicaraguans and Venezuelans a month who apply online with a financial sponsor. But he said the Biden administration could only do so much without Congress.",
        "\"We have a plan, we are executing on that plan,\" Mayorkas said. \"Fundamentally, however, we are working within a broken immigration system that for decades has been in dire need of reform.\"U.S. Customs and Border Protection said Friday that it is raising the number of people admitted to the country at land crossings with Mexico to 1,000 a day from 740 using a mobile app called CBPOne that was extended in January to asylum-seekers. Demand has far outweighed available slots.The administration faced a setback, at least a temporary one, when Colombia said Thursday that it suspended deportation flights from the U.S. due to \"cruel and degrading\" treatment of migrants. Colombia's immigration agency said it canceled returns of 1,200 Colombians after complaints about conditions in U.S. detention centers and on the flights.___Associated Press writer Christopher Sherman in Mexico City contributed."
    ]
}