{
    "articleURL": "/wires/afp/article-12044847/Striking-Hollywood-writers-decry-Uber-ization-trade.html",
    "content": [
        "Television and film writers, on strike over the \"existential crisis\" of a Hollywood dream factory that mistreats the source of its stories, are fed up with seeing their profession become more precarious in the age of streaming.",
        "\"What the studios are trying to do is basically turn our work into gig work, and make it impossible for writers to have a career,\" said Sarah Fischer, on the picket line Wednesday outside major studio Warner Bros.After 10 years working as an assistant on major series such as Marvel's \"Agents of S.H.I.E.L.D.,\" the 30-year-old scribe was only recently admitted into the Writers Guild of America (WGA).The powerful union represents 11,500 screenwriters and ordered a strike this week after talks with Hollywood studios and streaming services over better pay and conditions collapsed.Despite Fischer's coveted membership of the elite group, she has been looking for work since November, and is surviving on savings that are \"dwindling fast.\"Her case is far from unique.The long-standing model of network television, in which writers would be hired for months at a time to work on seasons composed of 20 or more episodes, has been disrupted by streaming giants like Netflix.Today, seasons commissioned by streaming platforms can be as short as six episodes, often all written before filming begins.As a result, work is rarer, writing teams are smaller, and gaining the valuable on-set experience needed to rise up the ranks is even more of a challenge.\"I have friends right now who have come off of hit shows themselves and who are literally driving Uber, walking dogs and getting Instacart, just to make ends meet,\" said Fischer.",
        "- 'Slice of pizza' -Screenwriting as a profession has always had to deal with the intermittent nature of Hollywood productions.But today, \"it is no longer a sustainable career,\" said Brittani Nichols, 34.A writer on the hit ABC television series \"Abbott Elementary,\" Nichols pointed out the industry is seeing a sharp decline in what's paid out in \"residuals\" -- the royalties paid to writers by studios for re-runs of their work.While these can be very high for hit shows on traditional, advertising-driven TV, they are often much lower on streaming services, even when the program is popular, as platforms like Netflix do not share detailed viewing figures.",
        "Residuals traditionally provided a financial cushion for writers during periods when they were not working. But today, even after a decade in the business, the green envelopes she receives for streaming residuals are paltry.\"It's almost nothing. I can maybe go buy a slice of pizza,\" she said.Before striking gold with \"Abbott Elementary,\" Nichols used to live \"paycheck to paycheck, month to month, barely being able to pay my rent\" of $3,900 for a two-bed apartment in Los Angeles, where housing is exorbitantly expensive.\"All of the shows that I was writing were for six weeks, eight weeks, 10 weeks. And that's not enough money to sustain an entire year of living in LA,\" she said.",
        "The minimum salary for a \"staff writer,\" the lowest union rank, is $4,500 a week. But many writers interviewed by AFP cannot find more than a few weeks of work per year.And they all pointed to the hidden costs of their profession. After their agents, managers, lawyers and the taxman have taken their cuts, half of the money has gone.- Tech disrupts Hollywood -In the era of streaming, almost half of TV writers receive only the union-mandated minimum wage, compared to just a third in 2014.",
        "This means even highly experienced writers are feeling the financial pressure.Some, like Adam Pava, say Hollywood has been contaminated by the culture and business practices of Silicon Valley -- home of Uber and Netflix.In recent negotiations with a studio he had worked for previously, the 48-year-old was offered a figure $150,000 below the amount he received for his last film.Tinseltown's unwritten rule that a writer's pay will not regress over time no longer exists, it seems.\"Executives are doing things in a way that is much more inspired by the traditions of the tech world, as opposed to the old Hollywood world,\" he said.\"Everything is much more gig-based. It's based on saving money in every way you can, and it's much less artist-friendly.\"",
        "\"Studios used to be about making great movies. Now they're about appeasing shareholders.\"Writers are infuriated with studios bosses who, blaming the pressure from Wall Street to chase ever-greater profits, are axing jobs -- like the 7,000 being culled at Disney.\"This is a tough time in town... but it's all a product of corporate greed,\" said Danielle Sanchez-Witzel.\"If we got everything we asked for, it's less than two percent of the profits that they make off of these television shows and the movies that we create for them.\"She added: \"We're just looking for our piece of what it is that we create.\""
    ]
}