{
    "articleURL": "/wires/ap/article-12051043/Egypt-presidential-hopeful-says-supporters-uncles-detained.html",
    "content": [
        "BEIRUT (AP) - An Egyptian politician residing abroad and planning to run in the country´s presidential elections next year said on Friday that two of his uncles and a group of friends and supporters have been detained in recent days.",
        "Ahmed Altantawy, a former member of parliament, did not say how many of his supporters were detained, when it happened and whether they were released or were still being held. He said he was worried for the health of his uncles, suggesting they may still be held.Human rights lawyer Khaled Ali said in a social media post that 10 supporters from Altantawy's former constituency were brought in for questioning, most of them accused of joining \"a terrorist group\" - a frequent government reference to the outlawed Muslim Brotherhood, an Islamist group.Ali said both of Altantawy's uncles face charges of joining and funding a terror group but did not elaborate on their current whereabouts.Officials in Cairo did not immediately respond to requests for comment on the claims.Altantawy declared his intention to run for Egypt's highest office in a Facebook post in March. In a video released Friday, he said the arrests come ahead of his announced return to the country on Saturday from Lebanon.The vote has widely been expected be an uncontested race for the incumbent, President Abdel Fatah el-Sissi, whose government has cracked down on political opposition, detaining thousands of suspected supporters of the Muslim Brotherhood but also large numbers of secular activists.Rights groups and former detainees have accused el-Sissi´s administration of human rights abuses, including targeting dissent with brutal tactics - forced disappearances, torture and long-term detentions without trial, often in abysmal conditions.",
        "Human Rights Watch estimated in 2019 that Egypt has at least 60,000 political prisoners.Altantawy, a former journalist, served as a lawmaker in the largely pro-government legislature until 2020 and cultivated a reputation of independence. In announcing his run in March, he said he wanted to offer a \"civil and democratic alternative.\"In the video, he also warned supporters against risking arrest, urging them not to come to the airport to greet him upon his arrival. He denounced what he described as immoral and unlawful government tactics against political opponents.\"This cannot bring stability to a country,\" he said. \"It can only afford a longer period of stability for the powers-that-be, at the expense of a country.\"Egypt's human rights record came under particular scrutiny last year, when it hosted the global climate conference in the Red Sea resort town of Sharm el-Sheikh. Then, one of the country's most high-profile detainees, rights activist Alaa Abdel Fatah, went on an extended hunger strike to draw attention to his detention.Abdel Fatah has spent most of the past decade behind bars because of his criticism of Egypt´s rulers. In 2021, he was sentenced to five years for sharing a Facebook post about a prisoner who died in custody in 2019.El-Sissi has claimed that Egypt has no political prisoners and that detentions are justified on national security grounds. His government tried recently to launch a \"national dialogue\" with token civil society figures but the talks failed to bring in any serious dissenters.",
        "In April 2019, Egyptians approved constitutional amendments, following a three-day referendum, allowing el-Sissi to remain in power until 2030."
    ]
}