{
    "articleURL": "/news/article-12038751/Drunk-driver-killed-bride-hours-wedding-pictured-dressed-BUD-LIGHT.html",
    "content": [
        "Jamie Komoroski, 25, the drunk driver who crashed into two newlyweds on Friday, killing the bride, has reportedly been placed on suicide watch Pictures on Komoroski's Instagram show the young woman drinking frequently and in one picture, she is dressed in a 'Bud Lightyear' costume for HalloweenResults of Komoroski's blood tests are pending, but she remains in jail in South Carolina, where she is being held without bail A drunk driver who mowed down and killed a bride hours after her wedding has been pictured dressed as a bottle of Bud Light, as it's claimed she is now on suicide watch in jail.",
        "Jamie Lee Komoroski, 25, was snapped in the outfit in November 2018 - when she was underage. She had Bud Light logos strapped to her wrists and legs and the word 'year' scrawled on her T-Shirt. The outfit appears to have been a boozy Halloween pun on Toy Story character Buzz Lightyear, with Komoroski also wearing a makeshift pair of wings, similar to those seen on the toy spaceman. That snap is one of many on Komoroski's Instagram that refer to alcohol, or show her enjoying a drink. She is accused of drunkenly killing Samantha Hutchinson, 34, and injuring Samantha's husband Aric, 36.",
        "Her most recent photo - uploaded to Instagram last Tuesday - show her posing on a beach in a white bikini, with the caption 'Did someone say tequila?' Another uploaded on May 22 shows her clutching a can with the caption 'Chin up, butter cup!'.And in October 2018, Komoroski was snapped holding up a bottle of what appeared to be sparkling wine to her mouth, with the caption 'Tailgate Queens.' Hauntingly, Komoroski uploaded a photograph of herself on Folly Beach on March 28 - the same spot where her victims held their nuptials before Friday's tragic crash. ",
        "Meanwhile, Komoroski is now being monitored over fears she'll try to take her own life following the horrific smash, the New York Post reported. ",
        "She slammed her car into a golf cart carrying Samantha Hutchinson, 34, and her new husband Aric Hutchinson, 36, hours after their wedding in Folly Beach.Samantha was killed by the 65mph impact, with Aric and two other passengers left seriously-injured. The tragic bride's mom and sister have since spoken out about how Samantha was having the happiest day of her life hours before her tragic death, and shared poignant snaps of her enjoying life as a newlywed hours before she was killed.  Folly Beach officials said Komoroski was not injured in the deadly smash. She was driving 65mph in a 25mph zone at the time of the crash and smelled of alcohol, but refused a field sobriety test.According to the affidavit, she told first responders that she had consumed one beer and one tequila shot before getting behind the wheel.When asked by officers how she felt on a scale of one to ten - ten being completely sober - Komoroski allegedly said she was an eight.Results from Komoroski's blood tests are still pending, but Charleston County records show that she was charged with three felony DUIs resulting in great bodily injury or death and one count of reckless homicide.She is being held without bail.She could face up to 25 years in prison for the death of the bride, as well of a fine of up to $25,100, and an additional 15 years and $10,100 for the serious injury caused to the men in the buggy.",
        "For the reckless homicide she could be handed a sentence of 10 years in prison, and a fine of up to $5,000 – as well as having her license revoked for five years on her release.",
        "Komoroski was first charged with speeding on 31 May 2018 in Horry County, South Carolina - home of Myrtle Beach and Coastal Carolina University, where Komoroski attended school.She was accused of speeding less than 10 miles per hour over the speed limit, to which she pleaded guilty and paid a $76.50 fine.Later that year, Komoroski pleaded guilty to a count of driving a vehicle at a speed that is unreasonable road conditions. She was arrested in November during a rare freeze warning in the popular tourist area.In 2019, Komoroski was again charged with speeding 10mph or less over the speed limit, to which she again pleaded guilty and paid another $76.50.More recently, she was cited for failure to use a turn signal or stop signal, to which she pleaded guilty on April 5, 2023, and paid a $25 fine.A GoFundMe for Aric and his family has raised more than $390k with Anette, his mother, writing: 'I was handed Aric's wedding ring in a plastic bag at the hospital, five hours after Sam placed it on his finger and they read each other their vows. Aric has lost the love of his life.'"
    ]
}