{
    "articleURL": "/wires/reuters/article-12042993/London-stocks-gain-ahead-Fed-rate-decision-Lloyds-drags.html",
    "content": [
        "Coca Cola HBC AG rises on upbeat forecast",
        "Lloyds falls despite profit beatHaleon drops after missing profit expectationsFTSE 100 up 0.2%, FTSE 250 adds 0.3%(Adds comment, Pearson and GSK shares in paragraph 11 and 13, updates prices to close)By Shristi Achar A and Amruta KhandekarMay 3 (Reuters) - UK stocks steadied on Wednesday, a day after a sharp sell-off, as investors keenly awaited the U.S. Federal Reserve's monetary policy decision, while Lloyds fell following the lender's quarterly results.The blue-chip index ended 0.2% higher, a day after posting its biggest single-day percentage loss in over a month.The mid-cap FTSE 250 climbed 0.3%.While the Fed is widely expected to announce a 25 basis point rate increase at 1800 GMT, market participants will be looking for any signals of a pause in hikes given mounting economic risks, including the failure of several regional U.S. banks.\"If the Fed indicates that it's going to pause, then at least in the short term that might be taken positively,\" said Richard Flax, chief investment officer at Moneyfarm.\"But then the question is also (whether) it's because the Fed sees inflation beginning to normalize or because they're concerned about the state of the U.S. banking system.\"Lloyds Banking Group fell 3.6% despite beating quarterly profit estimates, as the British bellwether lender signalled early signs of stress among some borrowers. The move dragged the banking index 0.8% lower.",
        "Energy stocks fell 0.7%, tracking weakness in crude prices.However, beverage companies rose 1% as Coca-Cola HBC AG added 2.3% after forecasting full-year profit growth at the top end of its previous guidance.Haleon lost 3.3% as the world's biggest standalone consumer health business reported first-quarter profit below analysts' expectations.Pearson, which slumped on Tuesday, jumped 9.3% to the top of the FTSE 100 after a rating upgrade from BofA Global Research.Aston Martin Lagonda lost 3.7% after the luxury carmaker affirmed its 2023 outlook.Shares of drugmaker GSK Plc rose 1.0% after a company executive said a U.S. advisory panel could approve its RSV vaccine for adults. (Reporting by Shristi Achar A and Amruta Khandekar in Bengaluru; Editing by Sonia Cheema, Savio D'Souza and Richard Chang)"
    ]
}