{
    "articleURL": "/tvshowbiz/article-12057329/Pregnant-Laura-Anderson-displays-growing-baby-bump-getting-4D-ultrasound.html",
    "content": [
        "Pregnant Laura Anderson showed off her growing baby bump on Instagram on Sunday as she got a 4D ultrasound.",
        "The former Love Island star, 34, who is currently expecting her first child, was all smiles as she pulled a oversized pink top up to display her stomach. Laura beamed as a 4D picture of her baby girl appeared on the screen beside her.The reality star shared an up close picture of her bundle of joy to her 1.5million Instagram followers as well. ",
        "The TV personality later stripped off to just a grey thong as she shared a look at her pregnancy figure. Laura showed off her prep-pregnancy figure in the before mirror selfie before standing in the same spot months later, this time with her bump. She wrote: 'Swipe for a sleepy 4D bub. Thanks to @bumptobabyscotland for my amazing scan and heartbeat. 'Gayle and the team have created such a personalised and special experience everytime I can’t thank you enough. Ps she doesn’t have my nose #gutted'.Laura is currently expecting her first child with her ex-boyfriend Gary Lucy, who she has had a turbulent relationship with following their split. And last week, she appeared to reference their ongoing drama with a brand new post, which was a quote about how to treat women.The quote read: 'A woman becomes a reflection of how you treat her. If you don’t like how she’s acting look at how you are treating her.'",
        "The former reality TV contestant and the Hollyoaks actor announced they were expecting in February and split shortly afterwards.",
        "And recently, she was said to be is 'shocked and upset' after Gary revealed the gender of their baby after sharing an ultrasound photo.Gary shared a photo of a recent scan to his Instagram Story, and a graphic that read: 'Daddy's girl.' Alongside the snaps, he penned: 'For everyone that's been asking. Let's hope she inherits her mother's looks. Can't wait to meet you baby bear.'But it appears Gary didn't check with Laura if she was happy with him announcing their baby's gender to their legions of social media followers.A source told MailOnline: 'Gary announced the gender news without checking it was ok with Laura. 'She's extremely shocked and upset by this and was hoping to do something special for it later this year.'Laura previously told Goss.ie that she would share the gender of her baby 'in due course'.Speaking at The Gossies 2023, Laura said: 'I know what I'm having and I have a name.'I will share in due course… I've already done a small [gender reveal party], but I've not shared it publicly yet. But I will soon.'",
        "Laura recently revealed that she and ex Gary are 'definitely' not on good terms' amid their recent split drama.",
        "The pair met last year during a stint on Celebs Go Dating and announced that they were expecting their first child together in February.However, the news of their separation followed shortly after as the pair recently parted ways following a whirlwind romance.After the split, the mother-to-be decided to do an Instagram Q&amp;A with her followers where she shed light on their break-up.When one curious fan questioned her on her relationship, Laura quickly shut down any suggestion of them getting back together.The fan asked her: 'Is there any chance that you and Gary can get back together?'.But Laura simply replied: 'No' before saying she 'hopes once baby is here' that she and Gary can co-parent successfully."
    ]
}