{
    "articleURL": "/tvshowbiz/article-12045967/David-Beckham-rings-48th-birthday-mum-sister.html",
    "content": [
        "David Beckham rang in his 48th birthday with his mum and sister on Wednesday as he enjoyed his fourth birthday cake, a Colin the Caterpillar. ",
        "The former footballer appeared to be making the most of his day as he blew out the candles on the iconic M&amp;S dessert after tucking into three others the previous day. Sharing some sweet photos to his Instagram Story, David held up the treat and smiled alongside his mum Sandra and his sister Joanne.He penned: 'Nice surprise in the office today, before adding: 'Mum knows what I like for my birthday present. Love you mum.'Before cutting the cake, the sportsman enjoyed some British pie and mash from cockney hotspot Tony's as he continued his birthday tradition. ",
        "To mark his special day, David and his mum always make sure to visit Tony’s Pie and Mash shop for lunch before picking up a Colin the Caterpillar for dessert. But the Marks and Spencer treat wasn't the only cake that he enjoyed his week, as David was seen tucking into another with his wife Victoria. Elsewhere David gave a glimpse at his family birthday celebrations as he enjoyed a sweet treat presented to him by the fashion designer, 49.He looked delighted as he had the cake put down in front of him and blew out the candles after two previous cakes the same day. David's Instagram was full of happy birthday Stories that he had reposted including from his children, Brooklyn, Cruz and Romeo. ",
        "Alongside his family and friends A-list pal Ryan Reynolds also took to social media to send him well wishes.  Ryan, 46, took to his Instagram Story to give David a special message while he was on top of the bus during the raucous Wrexham promotion parade.Ryan and Rob McElhenney led the victory celebrations after their club Wrexham AFC won promotion last weekend.  ",
        "While on top of the bus Ryan shouted in a message to David: 'David I just wanted to wish you a happy birthday!'He then joked: 'We threw this huge parade for you! We love you so much! Every body came! The camera then panned to the fans he was stood with on the bus as they shouted happy birthday to him. The Deadpool star and Rob are co-owners of the Welsh football team and their goal has been to help the club move back to the English Football League after a 15-year absence. "
    ]
}