{
    "articleURL": "/femail/fashionfinder/article-12050093/How-Kate-Ferdinands-Victoria-Beckham-look-800-less.html",
    "content": [
        "SHOPPING – Contains affiliated content. Products featured in this Mail Best article are selected by our shopping writers. If you make a purchase using links on this page, Dailymail.co.uk will earn an affiliate commission. Click here for more information. ",
        "With the run-up to the Coronation in full swing, the Princess of Wales isn’t the only Kate who has been impressing us in the style stakes this week.Kate Ferdinand wore an incredibly sophisticated black dress by Victoria Beckham, and now we’re fully obsessed with the scalloped trend.  Victoria Beckham Scalloped Semi-Sheer Knit Maxi Dress Is this the best black dress we’ve seen all year? It’s got to be up there! The knitted fabric means it will look just as good styled casually with trainers as with sky-high heels for the evening.  £850 Shop",
        "She dressed to impress to watch her husband Rio being inducted into the Premier League Hall of Fame. The dress design is super simple, save for the scallop edging at the neckline and cuffs, which is enough of a curveball for us!The long sleeves are super sleek, and although it's not a maternity style, it shows off her baby bump perfectly.",
        "Scalloping is never too far from the runway, with labels like Alaia, Prada, Valentino and Chloe making waves over the years. But this year, it’s Victoria Beckham and Saint Laurent leading the way.You can buy Kate’s knitted number for £850, but if you can’t justify splashing quite that much cash, the high street has come up trumps when it comes to this trend.",
        "Do you fancy saving yourself just over £800 by shopping this very VB-esque dress at ASOS instead? Of course, you do! &amp; Other Stories, The Kooples and Oasis can all help you stay ahead of the curve too.Get Kate Ferdinand's look  ASOS DESIGN Scallop Detail Peekaboo Long Sleeve Midi Dress in Black  Somewhere in between the Victoria Beckham and the Saint Laurent, this bargain buy boasts a flattering midi length, peekaboo cut out and sleek long sleeves.  £48 Shop  &amp; Other Stories Crocheted Scalloped Edge Midi Dress  If you’re heading off on holiday, this beachy take on the scallop trend has got your name written all over it. Throw it on over a bikini for a pool party, or add a black slip underneath for dinner.  £95 Shop  Oasis Black Linen Mix Scallop Detail Midi Dress This linen dress looks so much more expensive than its sale price. It’s available in green too if you prefer a pop of colour!  £62.30 (save £26.70) Shop  The Kooples Mesh Scalloped-Detail Maxi Dress  This dress by The Kooples is well worth spending a bit more than you normally might. Just like the VB, the beauty of this is its elegant simplicity.  £315 Shop  Saint Laurent dress  Another splurge option just in case you’re tempted…  £2,365 Shop"
    ]
}