{
    "articleURL": "/wires/reuters/article-12041287/Air-strikes-heard-Sudans-capital-truce-pledges.html",
    "content": [
        "KHARTOUM, May 3 (Reuters) - Air strikes were heard in Khartoum on Wednesday, a Reuters witness said, even as warring factions agreed to a new seven-day ceasefire from Thursday, undermining chances for a lasting truce that would help ease a deepening humanitarian crisis.",
        "United Nations aid chief Martin Griffiths arrived in Port Sudan to \"reaffirm\" his commitment to the Sudanese people. His spokesperson said improving humanitarian access through guarantees of safe passage would be a priority.The conflict has also created a humanitarian crisis, with around 100,000 people forced to flee with little food or water to neighbouring countries, the United Nations said.Aid deliveries have been held up in a nation where about one-third of people already relied on humanitarian assistance. A broader disaster could be in the making as Sudan's impoverished neighbours grapple with the influx of refugees.Previous ceasefire agreements between the army and a paramilitary force, whose power struggle erupted into full blown conflict in mid-April, have ranged from 24 to 72 hours, but none have been fully observed.South Sudan's foreign ministry said in a statement on Tuesday that mediation championed by its president, Salva Kiir, had led both sides to agree a weeklong truce from Thursday to May 11 and to name envoys for peace talks. The current ceasefire was due to expire on Wednesday.It was unclear, however, how army chief General Abdel Fattah al-Burhan and paramilitary Rapid Support forces (RSF) leader General Mohamed Hamdan Dagalo would proceed.Army jets have been bombing RSF units dug into residential districts of the capital region.",
        "Conflict has also spread to Sudan's western Darfur region where the RSF emerged from tribal militias that fought alongside government forces to crush rebels in a brutal civil war dating back 20 years.The commanders of the army and RSF, who had shared power as part of an internationally backed transition towards free elections and civilian government, have shown no sign of backing down, yet neither side seems able to secure a quick victory.Fighting now in its third week has engulfed Khartoum - one of Africa's largest cities - and killed hundreds of people. Sudan's Health Ministry reported on Tuesday that 550 people have died and 4,926 have been wounded.Foreign governments were winding down evacuation operations that sent thousands of their citizens home. Britain said its last flight would depart Port Sudan on the Red Sea on Wednesday and urged any remaining Britons wanting to leave to make their way there.(Writing by Michael Georgy; Editing by Simon Cameron-Moore)"
    ]
}