{
    "articleURL": "/tvshowbiz/article-12049879/Emily-Atack-shocked-discover-connection-actor-turned-football-club-owner-Ryan-Reynolds.html",
    "content": [
        "Emily Atack was shocked to discover her link to actor turned football club owner Ryan Reynolds. ",
        "During an upcoming appearance on BBC ancestry show Who Do You Think You Are? the comedian, 33, finds out that her great-grandfather was the first to put Wrexham on the map. Ryan, 46, and fellow Hollywood star Rob McElhenney purchased the then non-league Welsh football team Wrexham back in 2020 - gaining a promotion into League Two this week.  According to The Sun, Emily finds out how her ancestor Edward Robbins became famed for his involvement in Welsh football. Edward, known as Ted, was the longest serving secretary of the Football Association of Wales, he clashed with the English Football League over their reluctance to free up their players for international duty. ",
        "Through his campaigning, the rule was eventually scraped, meaning Welsh-born players, who were playing for English clubs, could still represent their country. A source told the publication: 'Emily could not believe the link to Wrexham, particularly as the name is now so associated with Hollywood stars Ryan Reynolds and Rob McElhenney, who co-own the club.'She is in no way sporty either, so to hear her family had this pedigree came as a big surprise.'It comes as Wrexham's promotion winners have begun in Las Vegas for their 'monster' party holiday three days after celebrating the club's move up to League Two with an open-top bus parade through the city. ",
        "The National League champions have been gifted an all-expenses-paid four-day trip to celebrate their record-breaking 111-point season by their co-chairmen Ryan and Rob. And after jetting off to Sin City on Thursday, the festivities have well and truly begun.  The team landed at the city's Harry Reid International Airport yesterday afternoon, and throw-in maestro Ben Tozer shared pictures of the group's stop-over in San Francsico ahead of reaching their final destination. He gently mocked the group's matching outfits by taking a picture that he captioned 'school trip'. ",
        "The players started their evening at Hakkasan, a modern Chinese restaurant at the MGM Grand hotel, where prices for the signature Phoenix menu start at $148 and the eatery's standout dish, the Signature HK Peking Duck, can be ordered with a side of Tsar Nicoulai Reserve Ossetra caviar for $188. Bottles of champagne, no doubt ordered to toast their successes, cost an upwards of $200. After dining well, the National League-topping side moved onto Hakkasan nightclub where they were greeted by an enormous presentation commemorating their successes. Huge Wrexham flags were waved and the club's name was spelled out in neon lights as the champions were welcomed into town. Who Do You Think You Are? series 20 will premiere on BBC One in June. "
    ]
}