{
    "articleURL": "/tvshowbiz/article-12061077/Francia-Raisa-says-Selena-Gomezs-fans-threatened-rip-kidney-throwing-shade.html",
    "content": [
        "On Monday, How I Met Your Father star Francia Raisa claimed one of Selena Gomez's fans just threatened to 'rip out her other kidney' after she threw shade at the two-time Grammy nominee over allegedly not feeling appreciated enough by her in the past year.",
        "'The [comments] are pretty bad. I think the one that probably hurt the most was, \"I hope someone goes up your p**** and rips out your other kidney, you f***ing wh***,\"' the 34-year-old LA native told the same Backgrid cameraman she spoke with on April 30.'In no way shape or form does anyone condone bullying especially Selena. She literally has a whole non-profit [Rare Impact Fund] dedicated to mental health. And I believe Rare Beauty just even had an event [Rare Beauty Mental Health Summit] for mental health.'So the fact that now I'm being bullied as I am is messing with me mentally. It's just, to me, it's not what anyone wants for someone, and she's literally out there saying please stop. So I don't understand why this is happening.'Francia continued: 'I'm doing best to not listen, to breathe, I'm very happy, I'm living my life. I'm sending love to everyone. I understand. I've been a hardcore fan of people growing up myself. I totally, totally, totally get it. But, you know, it's not nice. So I would say - not just with me - but for anyone, please stop.'",
        "This, a week after Raisa (born Almendárez) coyly smiled and deflected all of Backgrid's questions about Selena by instead discussing the weather, being from the San Fernando Valley, the Lakers, and avocado trees.",
        "When asked if she regretted donating one of her kidneys to Gomez - who's now in remission from the autoimmune disorder Lupus - in 2017, the flame-haired Latina replied: 'I would definitely speak to someone again about organ donation and the process and stuff.''The other day at the movies I was with my friend Lily and someone came up to me and said, \"Hey my friend is the one that you spoke to a few years back about the kidney donation and she's really grateful,\"' Francia said.'For all of that, it's worth it.'Raisa hasn't been pictured with the 30-year-old 'Texican' pop star since her July 27 TikTok where they pondered different variations of the 'He's a 10, but...' trend.The Grown-ish actress has also wiped all existence of Selena from her Instagram account, and she no longer follows her despite them being close enough to have matching tattoos.But as recent as March 10, Gomez - who still follows Francia - declared that she 'will never, ever, ever be more in debt to a person than Francia,' who got tested to see if she was a match 'three days' after they spoke.'The idea of someone not even second-guessing to be a donor was unbelievably overwhelming,' the Only Murders in the Building producer-star said on the Apple TV+ series Dear...",
        "'I know I was so, so, so lucky. I understand that that doesn’t happen for a lot of people and I know the outcome of some of those situations and how serious they are. So I do not take it lightly that it's happened to me that way.'Raisa found it 'interesting' that Selena told Rolling Stone that 'her only friend in the industry really is Taylor Swift' and she was also allegedly upset over being left out of her Apple TV+ documentary My Mind &amp; Me, which aired in November.Some questioned the timing of the Love and Noraebang star's whole debacle as she's promoting her role as assistant stylist Valentina Morales in the 20-episode second season of How I Met Your Father, which resumes May 23 on Hulu.Francia - who boasts 2.8M social media followers - thanked fans via Instastory for helping connect her and HIMYF castmate Hilary Duff as they both attended the Angel City FC soccer match at BMO Stadium in Los Angeles on Sunday.But it's unclear if Raisa will be back as as Cal U grad Analisa 'Ana' Patricia Torres in the sixth and final season of Kenya Barris and Larry Wilmore's spin-off sitcom Grown-ish, which premieres June 28 on Freeform."
    ]
}