{
    "articleURL": "/femail/article-12048423/Hes-rock-star-ex-heroin-addict-Taylor-Swift-able-tame-wildest-boyfriend-yet.html",
    "content": [
        "She’s the stratospherically successful pop star who has sold almost as many records as she has Instagram followers (more than 200 million) and is reputedly the best paid female singer in the world. And yet Taylor Swift’s romantic instincts could be termed modest, at best — at worst, kamikaze.",
        "Not only do the men she picks tend to be several rungs down the career ladder (British actors Tom Hiddleston and Joe Alwyn, her most recent ex, spring to mind) but the red flags are often visible for all to see.She famously sang that she knew ex-boyfriend Harry Styles was trouble. Well, the same goes — doubly so — for her latest choice, who on paper at least, is perhaps her least auspicious partner yet.Enter Matty Healy, lead singer of British band The 1975, who, as well as having battled heroin addiction, was expelled from school for fighting, smokes fat joints in interviews and is generally better known for sex and drugs than rock and roll.Not long after Healy first met Taylor backstage at one of his gigs in 2014, he crowed to an interviewer: ‘I’ve got proper pop stars wanting to s*** me the whole time!",
        "‘I think if I didn’t harbour my behaviour, I wouldn’t stop until I had s****** everybody.’Some time later, he said — equally unchivalrously — that although he was happy with his long-term model girlfriend, he didn’t want to settle down with her in case it was his destiny to marry ‘someone like Rihanna’.",
        "But now he has indeed gambled upwards and is dating a genuine pop goddess. And many of her fans — or Swifties, as they’re known — are bracing themselves for what they see as the inevitable crash and burn. After all, it has all the hallmarks of yet another doomed pairing.",
        "Matty, 34, the son of Loose Women’s Denise Welch and actor Tim Healy, isn’t anybody’s idea of a Byronic ladykiller. He boasts British teeth, stained by his loves of cigarettes and red wine, hair which is prematurely greying in streaks and pouchy eyes. The Times may have hailed him ‘the only interesting straight white man in rock right now’, but he’s certainly not as pretty as Taylor Swift’s previous long-term love and rumoured fiance, Joe Alwyn.Joe was dumped in February this year, apparently because they were on different pages career-wise.So what does Matty have that Joe didn’t? Having been through rehab for heroin addiction and with a current cannabis habit, you might think he’s far from the best consort for a squeaky-clean superstar pop singer.His last romance, with British singer/songwriter FKA Twigs, broke up because they both had busy schedules. The four-year romance before that, with model Gabriella Brooks, fell apart in 2019 because she despaired of his ‘party habits’, which he had been unable to rein in.A friend of Gabriella’s said at the time: ‘Matty is great when he’s on form, but he isn’t the easiest person to be with and leads a very unconventional life. There has been a lot of strain on their relationship, not helped by him being on tour a lot this year. He parties a lot at home when he’s there and Gabby had just had enough. She doesn’t want to lead her life like that.’",
        "Now, with both him and Swift, 33, in the throes of touring, comes news of their fledgling romance. For Generation Z, ‘Swhealy’ or ‘TayMay’ is probably a more iconic romance than Fleetwood Mac’s Stevie Nicks and Lindsey Buckingham, or Britney Spears and Justin Timberlake, even if it only lasts for the next five minutes.",
        "Swift certainly has a talent for picking men who appear guaranteed to make her unhappy. A cynic would point out that Little Miss Heartbreak lucratively mines the resulting pain in song.For now, though, she is crazy about Healy. A source said: ‘She and Matty are madly in love. It’s super-early days but it feels right. They first dated, very briefly, almost ten years ago, but timings just didn’t work out. Taylor and Joe actually split up in February so there was absolutely no crossover. Both Matty and Taylor have been touring over the past few weeks, so it’s been a lot of FaceTiming and texting but she cannot wait to see him again.‘But as two international megastars, they understand the pressures of one another’s jobs better than anyone, and are incredibly supportive of their respective careers.’The source added: ‘They are both massively proud and excited about this relationship and, unlike Taylor’s last one — which was very much kept out of the spotlight, deliberately — she wants to “own” this romance and not hide it away.",
        "‘Taylor just wants to live her life and be happy. She’s told pals Matty is flying to Nashville, Tennessee, over the weekend to support her on the next leg of the tour.’Fans have already picked up on numerous hidden clues — known as ‘Easter eggs’ — which both she and Healy have been dropping to hint at their romance. Recent speculation about a connection began to circulate after she made a surprise appearance, performing on stage at the O2 in London on the first night of The 1975’s tour in January, when Healy referred to her as ‘The Queen’.His proud mother Denise, a former Coronation Street star, shared a picture of herself cuddling up to Taylor backstage afterwards. One fan remarked: ‘Denise Welch becoming Taylor Swift’s mother-in-law is the plot twist 2023 was waiting for.’By that point, it was known that Healy and Swift were friends again and were working together. He confirmed in November last year that he and the band had collaborated with her on the album Midnights but that their work together had not been used.",
        "Her split from Joe Alwyn was leaked on April 8 — Matty Healy’s 34th birthday. And last month Healy announced that he was going to quit social media, saying: ‘Everything happens in eras. The 1975 is a very eras band. The era of me being a f*****g a**hole is coming to an end.’ Fans noted that Taylor’s current tour is called Eras.",
        "They first met in 2014, after Taylor attended The 1975’s concert with her best friend and fellow pop star Selena Gomez. They quickly struck up a flirtation and she was later spotted wearing the British band’s T-shirt, while Matty returned the favour by performing in a Taylor Swift 1989 album top.Romance rumours immediately began to swirl and, although Matty denied being in a relationship with Taylor, he seemed only too happy to talk about their being in touch.He said on Australian radio: ‘Yeah, we met each other, we exchanged numbers in the same way that a lot of people in this kind of world do and we spoke occasionally.’In an interview with GQ, Matty also gushed over the blonde beauty, saying: ‘Since she came to my show in December of 2014, I would say that 90 per cent of journalists that have interviewed me have asked about either her as a person or what our “interaction” was like.‘I have said on countless occasions that I found her to be one of the most gracious, hard-working, creatively gifted, and beautiful women that I have had the pleasure to meet. I personally have a lot of respect and admiration for her. Why would I not?’",
        "By that point, Taylor had famously dated pop star Joe Jonas, actor Taylor Lautner, singer John Mayer, actor Jake Gyllenhaal and former One Direction star Harry Styles. As she later said: ‘Having the world treat my love life like a spectator sport in which I lose every single game was not a great way to date in my teens and 20s, but it taught me to protect my private life fiercely.’",
        "Two years after meeting Matty Healy, she went on to date The Night Manager star Tom Hiddleston.",
        "Their brief romance was a global sensation, particularly when Hiddleston was photographed wearing an ‘I Heart TS’ singlet while frolicking on a beach with her. Both felt scorched by the fall-out.At this point, in 2016, Healy was once again interviewed about his non-romance with Taylor and appeared to have changed his tune radically: ‘If I had [properly] gone out with Taylor Swift, the first thing I would’ve [thought was]: “F***ing hell I am not being Taylor Swift’s boyfriend.” You know, f*** that. That’s also a man thing, a demasculating, emasculating thing,’ he added.Later that year, Taylor Swift started dating actor Joe Alwyn. In fact they met at the same Met Ball where she met Hiddleston. They shared her homes in Nashville, Los Angeles, New York and London and reportedly bought a house together in Primrose Hill, North London, last year.Healy has a unique take on being famous, having grown up the child of famous — now divorced — parents. His father Tim is best known for his role in Auf Wiedersehen, Pet and his mother was famous when he was growing up for her role in Soldier Soldier.She even had a (brief) singing career, releasing a single which nearly made the top 20. In 1997, she was cast in Coronation Street and the family moved from Northumberland to Manchester.By this point, Welch was suffering from depression, and medicating with alcohol and drugs, although she has been clean for some time.Healy met the rest of The 1975 at Wilmslow High School in Cheshire, where they were all ‘misfits’. They used to rehearse at his house — which was teeming with famous people, including Ringo Starr, Mark Knopfler, Rick Wakeman and AC/DC’s Brian Johnson (his godfather).He told an interviewer: ‘I’d be playing on a guitar in the house, not knowing it was the one from [Dire Straits’] Romeo And Juliet.’One night, after hearing him play, prog rock legend Rick Wakeman pulled him to one side and told him he had ‘it’.His father Tim told him once: ‘Music is in your bones. You’re the reincarnation of John Lennon. It’s in you.’ Despite the backing of his parents, the band struggled to get signed by a label. Healy even toyed with an acting career, making a cameo in the BBC school drama Waterloo Road, in which his mother also starred.",
        "The band released four EPs before releasing their debut self-titled album The 1975 in 2013, which topped the UK Albums Chart.Following this success, they released four subsequent albums, have won four Brit awards and played Glastonbury three times.He missed his mother’s wedding to artist Lincoln Townley in 2013 because the band were supporting the Rolling Stones on tour.By the time he was 25, he was talking about having had a small heroin habit and a larger cocaine one before he was famous, and claimed that they have been overcome.But in the summer of 2017, the rest of the band staged an intervention, and told him to go to rehab for booze, heroin and opiate use.He flew to Barbados and spent eight weeks in rehab, which included equine therapy.He said of his horse mentor: ‘I wanted to impress it more than any human being I’ve ever met. There were so many qualities I envied in this horse. And he had great hair.’More recently, he has been living in West London and having a much quieter life. He has tried yoga, and swimming, and has been trying to get on top of the frequent migraines he suffers.But, having fallen for the world’s most visible female pop star, that has all changed in the blink of an eye. The question is, to quote one of Taylor’s songs, are they Ready For It? Or will it be a swift ending?"
    ]
}