{
    "articleURL": "/sport/nba/article-12039559/Jimmy-Butler-Miami-Heats-Game-2-against-New-York-Knicks-ankle-injury.html",
    "content": [
        "Butler sprained his right ankle in Game 1 of the series late in the fourth quarterRandle suffered an ankle injury against Clev. and Brunson had ankle soreness DailyMail.com provides all the latest international sports news Jimmy Butler won't play for the Miami Heat in Game 2 of the Eastern Conference semifinals against the New York Knicks on Tuesday night because of a sprained right ankle.",
        "Butler was hurt after being fouled with 5:05 to play Sunday in the Heat's 108-101 victory in Game 1. He was able to stay in the game, finishing with 25 points and 11 rebounds. Butler is the leading scorer in the playoffs thus far, averaging 35.5 points per game.Julius Randle and Jalen Brunson were inititally considered game yime decisions for the Knicks but both Randle and Brunson were declared as active just before game time. Randle missed Game 1 after spraining his left ankle again in New York's clinching victory over Cleveland in the first round.Brunson was added to the injury report Monday with right ankle soreness. Coach Tom Thibodeau said there wasn't any specific play where the point guard was hurt.",
        "Butler has appeared to be the best player in the postseason regardless of team this year and willed Miami through their first-round series with Milwaukee.He also led the Heat with 25 points in the Game 1 victory, despite being immobile and standing in the corner for the final few minutes of the game on offense.Brunson on the other hand had one of his worst shooting performances of the season as he shot 0-7 for three and spent a longer than average period of time on the bench during the fourth quarter. ",
        "If Brunson was inactive Immanuel Quickley would be placed back into the starting lineup, while Obi Toppin once again would have filled in for Randle if needed. "
    ]
}