{
    "articleURL": "/tvshowbiz/article-12042739/Heidi-Klum-49-shares-steamy-kiss-snap-husband-Tom-Kaulitz-33-tour-bus.html",
    "content": [
        "Heidi Klum brushed off the fresh controversy surrounding her new lingerie shoot with her 18-year-old daughter Leni.",
        "Although the 49-year-old turned off her Instagram comments in response to the backlash, the criticism did not deter her from continuing to post.She fired up the social media platform this Wednesday and posted a steamy shot of her sharing a passionate kiss with her third and latest husband Tom Kaulitz, 33.The picture was part of an album that showed her accompanying Tom on tour with his band Tokio Hotel, which he started with his twin brother Bill.One of the snapshots showed Heidi and Tom in the tour bus, leaning in to each other across their bed and locking lips between his various European gigs.",
        "She also let fans in on a few snatches of her downtime, including a charming shot of her lying in a field of flowers. Some of the culinary treats she enjoyed were also served up in her album for public view - including Fleischwurst, 'a taste of home.'Tokio Hotel's current tour includes multiple dates in Germany, the country that Tom, Bill and Heidi all hail from originally.Heidi's new album comes after she was forced to turn off her Instagram comments after sharing a post of herself posing in lingerie alongside Leni.The world-famous supermodel took to her social media platform on Tuesday to upload images from their latest Intimissimi campaign. ",
        "But Heidi faced a wave of backlash over the photoshoot which showed herself and her lookalike daughter Leni showing off their figures in lace lingerie. The catwalk queen has since disabled comments after some fans labelled the photoshoot inappropriate. Promoting their new Intimissimi campaign, Heidi took to Instagram to share an array of snaps from the shoot and urged people to tag them if they saw their billboards.",
        "She penned: 'Yiiiipppppiiiiiiii our new @intimissimiofficial campaign is here. You can discover #theartofitalianlingerie online and in all Intimissimi stores. In the photos, German-American model Heidi flaunted her enviable physique in a blue lingerie set decorated with intricate white lace.She styled her golden fringed tresses in a straight fashion across her shoulders and showed off her age-defying features with a high-glamour make-up palette.Leni stood alongside Heidi and sported a white underwear set with a satin shirt, while she posed holding hands with her mother.While Heidi had deactivated comments on her Instagram, Leni has kept hers open and some fans slammed the campaign. One wrote: 'First thing I think of when I want to pose in my intimates: \"my mom should be here!\", with another replying: 'I know, kind of gross.'Another follower typed: 'I would not be proud to show my daughter off in this way. I would feel embarrassed and sad.'",
        "A third fan chimed: 'Somehow it's weird to see mother and daughter in underwear. I mean, how many were photographed like this with their mother.''It just looks weird', another added.",
        " However, other followers gushed over the campaign calling Heidi and Leni 'beautiful' and that they were a 'gorgeous family'. Elsewhere on Tuesday, Heidi also counted down the days until her milestone 50th birthday on June 1 as she shared a host of sexy snaps while visiting London.She showed off her ample assets as she wrapped a white dressing gown around her shoulders while sitting on the side of a bathtub.Heidi let her damp golden locks fall across her shoulders as she pouted and struck a sultry pose while relaxing in the five-star Dorchester hotel.Alongside the snaps, she revealed it was a month until her 50th birthday, writing: '1 Month to my big 50 @tomkaulitz LONDON #timeflieswhenyourehavingfun.'  Her latest campaign with her daughter comes after they received backlash for posing in lingerie together in a previous photoshoot last year. The mother and daughter previously defended one of their campaigns after receiving backlash for posing together for the Italian brand.",
        "They featured alongside each other for a campaign last November, which was branded as 'weird' and 'disturbing'.But when asked about the criticism of the campaign by social media users, Leni insisted it didn't influence her positive feelings about the photoshoot.",
        "'I honestly didn't look at a lot of the reactions,' she admitted. 'I am overall happy with the campaign and I had an amazing day with my mom.'Leni insisted she doesn't 'pay any attention' to negative feedback and is grateful to work on a shoot with her mother, who she described as her 'inspiration'. 'Just the advice she gives me, the way she works, everything about her, I can go on and on,' the teen told Page Six at her mom's annual Halloween party. 'I love shooting with her.' Leni's biological father is Heidi's ex Flavio Briatore. But singer Seal legally adopted her in 2009 after tying the knot with the Making The Cut star in 2005. After nearly seven years of marriage, Heidi filed for divorce in 2012, which was finalized two years later in 2014.Her daughter has followed in her mother's footsteps and made quite the name for herself in the modeling world.She recently stunned in a magazine cover for Hunger and has featured in Vogue Germany and Glamour Germany, as well as walking in Milan Fashion Week."
    ]
}