{
    "articleURL": "/wires/reuters/article-12039779/No-writers-No-TV-Hollywood-scribes-strike-pay.html",
    "content": [
        "By Lisa Richwine and Rollo Ross",
        "LOS ANGELES, May 2 (Reuters) -Hollywood film and television writers went on strike on Tuesday, shutting down late-night TV shows, and took their demands for higher pay to the doors of major studios in a labor dispute that hinges on how the streaming boom is changing show business.Hundreds of members of the Writers Guild of America (WGA) picketed in New York and Los Angeles in the first work stoppage to hit Hollywood in 15 years.\"We are asking for very fair compensation, and basically the studios laughed at us,\" writer Daniel Talbott, 45, said as guild members protested outside the Paramount film studio in Hollywood, one of more than a dozen picket sites. \"We are trying to fight for our rights.\"A group representing Walt Disney Co, Netflix Inc and other studios said it had offered \"generous\" compensation but the sides were unable reach an agreement in last-minute talks on Monday.Some actors turned out to back the 11,500 striking writers.\"I support the writers because as actors we are only as good as the writing we get,\" said Rob Lowe, who was picketing with his son, writer and actor John Owen Lowe.In New York, WGA members marched and chanted \"No writers. No TV\" outside a building where Comcast Corp's streaming service Peacock was holding a presentation for advertisers.",
        "Writers got creative with their picket signs. One read \"What would Larry David do?\" while another threatened \"Pay your writers or we'll spoil 'Succession.'\"\"Jimmy Kimmel Live,\" \"The Tonight Show Starring Jimmy Fallon\" and other late-night shows canceled new episodes and were set to air re-runs after being left without their teams of writers to pen timely jokes.Sketch show \"Saturday Night Live\" also shut down indefinitely.On Monday night, the WGA said its leadership unanimously supported a strike against the studios. \"The companies' behavior has created a gig economy inside a union workforce,\" the WGA said in a statement.The guild is seeking changes in pay and the formulas used to compensate writers when their work is streamed, among other proposals. The WGA estimated its changes would cost about $429 million a year, according to a negotiations summary shared on Twitter and verified by Reuters as authentic.'BOTH SIDE ARE DUG IN'The strike hits Hollywood studios at a difficult time. Conglomerates are under pressure from Wall Street to make their streaming services profitable after pumping billions of dollars into programming to attract subscribers.The rise of streaming has eroded television ad revenue as traditional TV audiences shrink.The last WGA strike in 2007 and 2008 lasted 100 days. It cost the California economy an estimated $2.1 billion as productions shut down and out-of-work writers, actors and producers cut back spending.",
        "California Governor Gavin Newsom said the current strike would have \"profound consequences, direct and indirect.\"\"We're very concerned about what's going on because both sides are dug in and the stakes are high,\" the Democratic governor said at a Milken Institute conference.The Alliance of Motion Picture and Television Producers (AMPTP), which represents studios, said it had proposed \"generous increases in compensation\" and was willing to increase its offer.But it said it objected to WGA demands that \"would require a company to staff a show with a certain number of writers for a specified period of time, whether needed or not.\"In Washington, the White House encouraged \"both sides to stay at the table,\" press secretary Karine Jean-Pierre said.Writers said they were willing to walk off the job because changes from streaming have made it difficult for many to earn a living in expensive cities such as New York and Los Angeles.Half of TV series writers now work at minimum salary levels, compared with a third in the 2013-14 season, according to WGA statistics. Median pay for scribes at the higher writer/producer level has fallen 4% over the last decade.Artificial intelligence (AI) is another issue at the bargaining table.The WGA wants safeguards to prevent studios from using AI to generate new scripts from writers' previous work, or asking them to rewrite drafts created by AI.",
        "Television production ground to a halt in Los Angeles. Film LA, which issues permits for filming in the city, said it had no shoots for scripted shows scheduled for Tuesday or the rest of the week.The one late-night program set to run new episodes was Fox News's \"Gutfeld!\" which employs non-union writers.If the work stoppage becomes protracted, the networks will increasingly fill programming lineups with unscripted reality shows, news magazines and reruns. It also could delay the pivotal fall TV season for which writing for shows normally starts in May or June.Netflix may be insulated from any immediate impact because of its global focus and access to non-U.S. production facilities.(Reporting by Lisa Richwine, Rollo Ross, Dawn Chmielewski and Danielle Broadway in Los Angeles; Editing by Mary Milliken and Leslie Adler)"
    ]
}