{
    "articleURL": "/wires/reuters/article-12058199/Now-finally-clicking-White-Sox-visit-Royals-road-trip-continues.html",
    "content": [
        "Riding the high of their 17-4 blowout victory against the Cincinnati Reds on Sunday, the Chicago White Sox will continue their seven-game road trip on Monday when they face the host Kansas City Royals in the opener of a four-game set.",
        "The White Sox have won five of their last seven games after a 7-21 start to the season.Chicago will be without outfielder/designated hitter Eloy Jimenez, who underwent an emergency appendectomy Saturday in Cincinnati and is expected to be out of action for four to six weeks.\"It's taken care of now,\" first-year White Sox manager Pedro Grifol said. \"He will be out for a little bit. ... Those things are scary. He'll be back as soon as possible.\"Jimenez owns an eight-game hitting streak, batting .424 (14-for-33) with two home runs and eight RBIs during that stretch.Dylan Cease (2-1, 4.58 ERA) will take the mound for Chicago, opposing Zack Greinke (1-4, 5.25) in a battle of right-handers.Cease went five innings in his most recent outing, when he allowed four runs on five hits with six strikeouts and four walks in a no-decision against the Minnesota Twins on Wednesday. In 12 career starts against the Royals, Cease is 4-3 with a 2.58 ERA.Salvador Perez and Hunter Dozier have seen Cease the most, but the duo has struggled against the right-hander, combining to strike out 20 times in 45 at-bats.Greinke is coming off his first win of the season. He needed just 44 pitches to complete five scoreless innings against the Baltimore Orioles on Wednesday. Greinke allowed three hits, struck out three and did not issue a walk.",
        "The 20-year veteran has a lengthy history against Chicago, going 10-10 with a 3.81 ERA over 31 career appearances (28 starts).Elvis Andrus and Yasmani Grandal have enjoyed success against Greinke throughout their careers, with Andrus hitting .344 (11-for-32) against him and Grandal batting .296 (16-for-54).Kansas City injected a fresh arm into a beleaguered bullpen Sunday, recalling right-hander Max Castillo from Triple-A Omaha. Right-hander Jonathan Heasley was optioned to Omaha in a corresponding move.\"We're in a little bit of a rut these last few days, and we just have to have coverage,\" first-year Royals manager Matt Quatraro said. \"There are guys you want to stay away from in the bullpen, guys that need an extra day. Max provides us length.\"Royals relievers have been taxed for 47 2/3 innings in 11 games since Brady Singer threw Kansas City's last quality start on April 25 at Arizona.Left-hander Ryan Yarbrough, who left Sunday's home game against Oakland after being struck in the head with a 106-mph line drive off Ryan Noda's bat, had swelling on the left side of his head, but was alert after the game and was taken off-site for further testing.\"It was scary. The dugout went silent,\" Quatraro said. \"I can't think of a worse thing to see on the field. Luckily, when we got out there, he was talking and aware of what was going on.\"",
        "--Field Level Media"
    ]
}