{
    "articleURL": "/tvshowbiz/article-12053173/Taylor-Swift-rents-Cornelia-Street-townhouse-fell-love-Joe-Alwyn.html",
    "content": [
        "The townhouse where Taylor Swift formerly lived in NYC went up for rent on FridayThe $11.5 million place was the inspiration behind her song Cornelia Street on her 2019 album LoverIt was reported in early April that Swift and Alwyn ended their relationship after six years of datingTaylor Swift's former Cornelia Street townhouse in New York City is back on the market.",
        "The 33-year-old singer rented the $11.5 million abode — where she penned the song about her ex-boyfriend, Joe Alwyn, 32 — from 2016 to 2017 from real estate broker Laurence Carty.The official listing, photographed by Al Siedman, for the lavish 5,500 square foot place with 4 beds and 7 baths went up on Friday.The current owner, who purchased the property from Carty, is asking for a monthly rent of nearly $50,000 with a 12-month lease, but would consider a sale, according to TMZ.In early April, it was revealed that the 12-time Grammy winner — who is rumored to have moved on with The 1975 frontman Matty Healy, 34 — called it quits with Alwyn after dating for six years.",
        "The songwriter moved into the Cornelia Street townhouse in 2016 — the same year she met the British actor at the Met Gala — and lived there through 2017. The luxurious Manhattan apartment is famously known for being the place where she fell in love with her now-ex and the inspiration behind the song on her 2019 album Lover.On the aptly titled track, the songstress croons, 'I rent a place on Cornelia Street.'In the lyrics, she seemingly alludes to Alwyn:  'And I hope I never lose you, hope it never ends.'I'd never walk Cornelia Street again,' Swift sings in the song. 'That's the kind of heartbreak time could never mend.' ",
        "The three-story townhouse — built in 1899 — is located at the heart of the West Village in Manhattan.The superstar's former abode has not only four grand bedrooms and seven luxurious baths but also an indoor swimmer's pool and multiple fireplaces.The master bedroom features a private patio with a gas fireplace and a sizable walk-in closet.",
        "Two of the guest suites also come with private terraces, and the whole place also has a rooftop with views of the city.Last month, multiple sources revealed Swift and Alwyn ended their relationship after their romance 'ran its course'.At the time, she had just recently embarked on her ongoing, sixth headlining concert tour — The Eras Tour — and the Conversations with Friends star had not been seen at any of her shows.The former couple had been in a relationship for six years before breaking up."
    ]
}