{
    "articleURL": "/wires/pa/article-12039387/Lib-Dems-warn-car-theft-epidemic-Tories.html",
    "content": [
        "The Conservatives are overseeing a “car theft epidemic”, the Liberal Democrats have warned, as the party claimed that around four in five car thefts went unsolved last year.",
        "Lib Dem leader Sir Ed Davey said that criminals are being allowed to act with impunity, as he hit out at the Government’s crime record just a day before the local elections.The party said that an analysis of the latest Home Office figures shows that 100,258 car theft cases across England and Wales were closed in 2022 without a suspect being identified.The Lib Dems also said that police had failed to attend three in four car thefts last year. This Conservative Government has decimated community policing, leaving victims of crime to fend for themselves  Sir Ed Davey, Lib Dem leader  According to its analysis, the Metropolitan Police, West Midlands, South Yorkshire and Essex forces all reported more than 80% of car thefts as unsolved.The Met figure for unsolved car thefts was 87.2%.",
        "Sir Ed said: “There is a car theft epidemic across the country, which Conservative ministers are totally failing to tackle.“Criminal gangs are being allowed to act with impunity while victims are denied justice. The Government is effectively decriminalising car theft by letting these gangs get away with it.“People just want to know that if their car is stolen or house broken into, the police will turn up and properly investigate it. But this Conservative Government has decimated community policing, leaving victims of crime to fend for themselves.",
        "“The Liberal Democrats want to see a return to proper community policing, making our streets safer and ending this free-for-all for criminals.”A Home Office spokesperson said: “Car theft is a truly distressing crime and we are closely working with the automotive industry and police to ensure our response is as strong as it can be.“Recent figures from the Crime Survey for England and Wales show vehicle crime is down 22% since December 2019.“We expect police to take vehicle crime seriously and investigate thoroughly to ensure perpetrators are charged and brought to justice.“Last month we delivered our pledge to put 20,000 more police officers on our streets, and we are supporting police by providing more funding for crime prevention measures, including better street lighting and CCTV.”"
    ]
}