{
    "articleURL": "/news/article-12057137/Texas-mass-shooting-witness-calls-automatic-weapons-ban.html",
    "content": [
        "Steven Spainhouer was one of the first people on the scene at the Allen, Texas shooting on Saturday The gun-loving, former cop said  it is access to automatic weapons, and not a mental health crisis, that is driving the uptick in mass shootingsGovernor Greg Abbott had earlier blamed the rise in mass shootings on a mental health crisis Steven Spainhouer, one of the first people on scene at the mass shooting in Allen, Texas, has called for M4s and AR-15s to be removed from the streets despite admitting he is a 'gun lover.'",
        "The former police and army officer said that it is long pastime automatic weapons were removed from everyday public life, on account of the rising number of mass shootings.'It wasn't mental health that killed these people,' he said. 'It was an automatic rifle with bullets,'  he told MSNBC.'I'm a gun lover, I have guns. But these M4s, AR-15s, they've got to get off the streets or this is going to keep happening, and we've got to stop that at some point,' he continued. The Texas gunman, Mauricio Garcia, 33, used a AR-15 to slaughter eight people, including children, at the Allen Premium Outlets in Allen, a small suburb north of Dallas, on Saturday. ",
        "Spainhouer recalled that at least one of those slain was a child, whom he desperately tried to save after rushing to the H&amp;M - where his own son had been working. His call for a ban on high-powered weapons was, in part, a response to Texas Governor Greg Abbott's statement in the aftermath of the shooting, in which he attributed the rise in mass shooting on a mental health crisis.Abbott told Fox News on Sunday: 'We need to recognize the reality we've seen across the United States over the last year or two, and that is an increased number of shootings in both red states and blue states.'",
        "'We've seen an increased number of shootings in states with easy gun laws, as well as states with very strict gun laws. I think that the state in which the largest number of victims occurred this year is in California, where they have very tough gun laws,' he said.Spainhouer, who received a frantic call from his son on Saturday, telling him shots had been fired outside his workplace, said that he works around people with mental health issues, and argued that easy access to automatic rifles is the more severe threat to public safety.'It could be you, it could be your family,' said Spainhouer. 'I never imagined it would be me, I never imagined it would happen in my community. But it did.''We've got to stop this type of carnage.'  He then took a swing at politicians, Abbott and Texas Senator Ted Cruz among them, who offer 'prayers and condolences' in the aftermath of shooting tragedies.'Prayers and condolences won't bring these people back,' he said. 'We need some action in our legislatures at the federal and state level for better gun control, and I'm saying that as someone who loves guns.'",
        "Garcia, wearing tactical gear and armed with an AR-15 and a handgun, shot dead down eight people, including children, before a hero cop took him out",
        " The cop was on scene for an unrelated call but rushed over when he heard the gunshots.Garcia had fired more than 100 times during his rampage, and he had more ammunition and weapons in his car - which was seen coming out of.Investigators now believe he may have been a white supremacist or new-Nazi who followed extremist ideologies.  Spainhouer, who sped over after receiving the call from his son, explained how he got there before any first responders - and was faced with the monumental task of trying to save lives.'I never imagined in 100 years I would be thrust into the position of being the first first responder on the site to take care of people,' he told CBS News, recalling how a handful of people around him recorded videos of the bodies outside his son's H&amp;M, where the unnamed gunman's assault is believed to have began.'The first girl I walked up to was crouched down covering her head in the bushes, so I felt for a pulse, pulled her head to the side and she had no face,' he said of the first victim he came across, a young girl.Still set on saving the mess of victims, Spainhouer recalled how he then found another child, who survived the barrage of bullets by being covered by his protective mother, who he said was among eight to die by the gunman.",
        "'When I rolled the mother over, he came out,' Spainhouer said, speaking to CBS reporter JD Miles just a few hundred yards from where the carnage was seen only a few hours before.'I asked him if he was OK and he said, \"My mom is hurt, my mom is hurt.\"'Spainhouer described how he attempted to alleviate the boy's mental anguish by taking away from the grisly scene.'Rather than traumatize him any more, I pulled him around the corner sat him down and he was covered from head to toe.'Spainhouer added: 'Like somebody poured blood on him.'In the chaos that ensued, the dutiful dad tried to rescue another victim, but was also unsuccessful. Meanwhile, as important minutes continued to pass, Spainhouer - unaware that the unnamed Allen officer was already on the scene - waited for others to arrive and help him with his efforts.'I was on the phone with 911 and I was telling them we have a mass casualty incident,' the father said, appearing visibly emotional during the TV interview.",
        "Spainhouer further added that as he and others waited for medical help, local police were forced to transport several of the victims to nearby medical practitioners - as their condition was too severe to wait for an ambulance.",
        "'No one can see what we saw today and not be affected by it,' he said, saying the events of the day would stay with him. 'It's not a situation I would wish upon anybody, it's just unfathomable to see carnage.'Audio footage of the shooting also reveals how the unnamed hero officer made a frantic phone call begging for his colleagues to join him on the scene, radioing: 'I need everybody I got.'He bravely ran towards the active shooter - who was armed with 60 rounds and had shot over a dozen people by this point - and killed him.Around two minutes after first calling for backup, the cop said: 'I got him down.'"
    ]
}