{
    "articleURL": "/wires/aap/article-12043289/Budget-funds-meet-record-aged-care-wage-rise-ruling.html",
    "content": [
        "Fears big pay rises for public sector workers will make inflation worse have been shot down by the federal government.",
        "Aged care staff will get a jump in pay after the government announced the federal budget would include an $11.3 billion boost for the sector.More than 250,000 of them will receive a 15 per cent wage increase following on from a decision from the Fair Work Commission to raise the pay rate from July.The Reserve Bank is concerned public sector wages could put more pressure on inflation but Finance Minister Katy Gallagher says the salary increase is sustainable.\"Nothing we have seen in terms of how inflation is tracking and moderating would lead us to believe wages is a contributor,\" she told AAP.\"There's a whole range of other reasons and even when you break down the inflation stuff, it's not being caused by wages.\"Treasurer Jim Chalmers said the pay rise was long overdue and could help attract more staff to the struggling sector.\"This is what's possible when we put the national budget on a more responsible and more sustainable footing,\" he said.\"We've gone out of our way here to make sure we can afford and we can work through in a responsible way this historic pay rise for aged care workers.\"The biggest ever jump in pay for workers including registered nurses, cooks and home care staff follows a royal commission recommendation.",
        "A personal-care worker on a level-four aged care award will take home $141.10 more a week, or more than $7300 a year, under the changes. A registered nurse on a level-2.3 award will pocket an extra $196.08 a week, or more than $10,000 a year.Aged Care Minister Anika Wells called the 15 per cent increase a \"seismic shift\".\"Today's pay rise will bring 10,000 more workers to the sector ... we all know the workforce crisis is the biggest issue facing aged care,\" she said.\"We will continue to work with everybody on this to make sure we do get enough workers not just in aged care but in the broader care economy.\"Patricia Sparrow, from peak aged care body COTA Australia, said the workforce had been undervalued for too long.\"This funding boost will, among many things, help ease workforce pressures and ensure we have nurses available 24/7, which was a key recommendation of the royal commission and something older Australians have long advocated for,\" she said.But she said transparency was needed to ensure the money went directly to workers and was not simply going to providers' bottom lines.United Workers Union aged care director Carolyn Smith said many people had worked double and triple shifts during the COVID-19 pandemic to keep residents safe and the rise would recognise this sacrifice.",
        "The Aged and Community Care Providers Association said the extra money would help stem the exodus from the sector, which was under increasing pressure to deliver more services.Shadow treasurer Angus Taylor said the government's spending was adding to inflation.\"Labor's kept talking a big game about how they're doing all the right things but we have world-beating inflation. Australia loves to be a world-beater but not in this way,\" he said."
    ]
}