{
    "articleURL": "/news/royals/article-12051737/Why-plus-ones-Great-Good-received-Coronation-snub.html",
    "content": [
        "Organisers for the Coronation had to hack the guest list from 8,000 to 2,300Few of those receiving invitations to Westminster were allowed to bring spousesIt's been the biggest headache of all for Coronation organisers – how to hack back the guest list from the 8,000 invitees who attended Queen Elizabeth's service at Westminster Abbey in 1953 to just 2,300 today.",
        "First step was to weed out the dukes and the peers, MPs and anyone else deemed surplus to requirements.But the number was still so high that officials in the Lord Chamberlain's office at Buckingham Palace, who are responsible for organising the occasion, had to cut deeper.As a result, very few of those lucky enough to have a beautifully-inscribed invitation drop through their doormat have been allowed to bring a 'plus one'.The situation is now being referred to in aristocratic circles, only half-jokingly, as 'Slash the Spouses' – and even the wider royal family has been affected.",
        "The Mail understands that Lord Freddie Windsor's actress wife, Sophie, is among those who have not secured an invitation. Lord Freddie is the son of the late Queen's cousin, Prince Michael of Kent and he and his glamorous wife are both normally absolute certainties at royal events.",
        "The Great Lord Chamberlain of England has also made clear he is upset that there is no space for his wife, Daniela.Rupert Carrington is one of the six Great Officers of State, a position that dates back to William the Conqueror. 'I'm very sad it's a dress-down occasion and my wife doesn't get a seat,' he has said.The co-chairman of Queen Elizabeth's Platinum Jubilee Pageant and chairman of the V&amp;A Museum, Sir Nicholas Coleridge, is also understood to have been told that there is no room for his wife, author Georgia Metcalfe.",
        "A source told the Mail: 'There's a lot of chatter about the lack of 'plus ones' in posh circles and a great deal of noses have been put out of joint.'Some members of the aristocracy have already revealed they will not be attending in any capacity, including Queen Elizabeth's godson, George Herbert, 8th Earl of Carnarvon and his wife, Lady Fiona. He said: 'We haven't received anything. You can't always be part of everything.'Lady Pamela Hicks, one of Queen Elizabeth's bridesmaids and the daughter of Lord Mountbatten, King Charles' former mentor, has also famously failed to make the cut – but did get a hurried and call from one of the king's personal secretaries to apologise.However, her daughter, India, insisted that her 94-year-old mother wasn't offended and thought it was 'very, very sensible' to base invitations on 'meritocracy not aristocracy'.",
        "The Mail previously revealed that several Conservative cabinet ministers also were unhappy that they are being denied a 'plus one'. Only Prime Minister Rishi Sunak's wife Akshata Murthy will receive an invitation due to 'extremely limited space', the Mail previously revealed.'Lots of cabinet ministers, and their partners, are unhappy about it,' a government source said.The good news for guests is that the dress code does not stipulate that female guests need to wear hats.",
        "The Mail understands King Charles was keen that guests, many of whom are 'ordinary' members of the public being honoured for their extraordinary national and community endeavours, did not feel they had to shell out on costly headwear in addition to the bill for travel and accommodation in order to attend his coronation.'There's a much more egalitarian feel to everything,' a source said, 'although some feel it's a bit of shame to lose so much of the tradition that people enjoy.'"
    ]
}