{
    "articleURL": "/wires/ap/article-12039771/Corruption-toll-Federal-jury-convicts-4-bribery-trial.html",
    "content": [
        "CHICAGO (AP) - Federal jurors on Tuesday convicted all four defendants of bribery conspiracy at their trial in Chicago that provided an inside look at pay-to-play politics in Illinois that prosecutors said involved the state´s largest electric utility and, at the time, one of its most powerful politicians.",
        "It's a resounding win for U.S. prosecutors in one of the biggest corruption trials in Illinois since former Gov. Rod Blagojevich was convicted in 2011 in the same federal courthouse, including on charges he sought to sell President Barack Obama's vacated U.S. Senate seat.During a month and a half of testimony, prosecutors sought to prove two former ComEd executives, a former utility consultant and a longtime government insider arranged contracts, jobs and money for associates of then-Illinois House Speaker Michael Madigan - once one of the nation´s most powerful legislators - to ensure proposed bills boosting ComEd profits became law.Madigan, 81, has been indicted in the case, though his own trial is scheduled for next year. He wasn't in court during the just-ended trial but featured in much of the key evidence. The across-the-board convictions Tuesday may not bode well for his prospects when he gets to trial.During closing arguments, prosecutor Amarjeet Bhachu called the four defendants \"grand masters of corruption,\" according to the Chicago Sun-Times. Defense attorneys argued their clients were engaged in run-of-the-mill lobbying and never crossed lines into illegality.The defendants were onetime Madigan confidant Michael McClain, former ComEd CEO Anne Pramaggiore, former ComEd lobbyist John Hooker and former ComEd consultant Jay Doherty.Jurors deliberated for several days before returning with the sweeping convictions. Bribery conspiracy, the headline count in the case, carries a maximum five-year prison sentence.",
        "Bhachu likened the alleged conspiracy to a toll that drivers pay to continue their journey on state highways, and suggested Madigan was the gatekeeper. \"It was a corruption toll to make sure that Mr. Madigan was not an obstacle to their legislative agenda,\" said Bhachu, according to the Chicago Tribune. \"And they paid that toll every month, from 2011 to 2019, when they were caught.\"Evidence in the government's case included secret recordings of Madigan and others. Defense lawyers singled out a star government witness, ex-ComEd executive Fidel Marquez, alleging federal agents frightened him into cooperating, which included making secret recordings.\"We are here because the government scared Fidel Marquez to death,\" Hooker´s lawyer, Jacqueline Jacobson, told jurors in her closing.Marquez is awaiting sentencing after pleading guilty to bribery conspiracy.Madigan was indicted in 2022 on charges that included racketeering and bribery. He´s denied wrongdoing. A year earlier, he resigned from the Legislature as the longest-serving state House speaker in modern U.S. history amid speculation that he was a federal target.The indictment accused Madigan, among other things, of reaping the benefits of private legal work illegally steered to his law firm."
    ]
}