{
    "articleURL": "/tvshowbiz/article-12044301/Diddys-girlfriend-Yung-Miami-reveals-shes-bisexual-wouldnt-date-woman.html",
    "content": [
        "Diddy's on/off girlfriend Yung Miami confirmed she's bisexual in a new interview with Hollywood Unlocked's Jason Lee this week.",
        "The City Girls rapper, 29, explained that she has an attraction to women and has admittedly been intimate with women in the past.'I really do like girls. I wouldn't be in a relationship with a girl because I'm not b**ch girl,' she explained with a laugh.Though she's not interested in anything exclusive, Yung Miami does have one woman in the rap game she'd love to spend an evening with: Megan Thee Stallion.'But Megan could get it for a night?' asked Lee, to which the hitmaker - whose collaborated with the WAP tapper in the past - replied: '[She can get it] for a lifetime.'The remarks come just days after Diddy, 53, and Yung Miami surprised fans by being one another's date to the Met Gala despite announcing they'd split two weeks prior.",
        "The female MC confirmed their breakup in April but insisted her and Diddy's friendship is still as strong as ever.While speaking with Lee, Yung Miami gave more insight into their undeniable chemistry but refused to label their relationship.'When you live in your truth and you vibe, how you vibe with who you vibing with, I don't give a f**k what people think,' she explained of their ambiguity.When asked to clarify what she meant by 'vibing,' she replied: 'He doin' him and I'm doin' me. When we together, we together.'",
        "She also revealed that it was Diddy who fell in love with her first.All in all, Yung Miami explained that she sees Diddy as a real 'man' and all around good person. 'Would you give Diddy a baby?' Jason asked, to which she replied: 'Why not?'Diddy is already a father of six with four baby mamas and Yung Miami has two children from past romances.The pair confirmed they started dating last June, though Miami revealed in mid-April that they are no longer together.",
        "'We're still friends! We're still good friends! But we're single. That's not my man. We had our own situation, I'm not gonna put a title on it,' she said.And earlier this week, the exes attended the star-studded Met Gala as friends.Diddy stepped out in an all-black ensemble from his own Sean John fashion brand, which he bought back from its bankrupt owner in late 2021.He stepped out in a black dress shirt with a black and silver necklace under a black coat along with a black floral-laced puffer cape.The music mogul completed the look with black sunglasses, black pants and black shoes for the annual gala.His date Yung Miami opted for a more revealing look with a unique feathered cone that rose from her neckline.",
        "She wore a revealing mesh dress with strands of pearls draped down her body for the red carpet gala.She completed her look with black heels with a fuzzy train trailing behind her for the event.",
        "When asked on the red carpet about their relationship status, Diddy simply said she was his date for the night.'She's my date for the night. … We don't put titles on it. Everybody wants us to put a title on it, we don't put titles,' he said.'This like my best friend in the world, one of the most beautiful people God has blessed me with. And I'm blessed that she's my date tonight,' he added.'We were f***ing with each other hard. We were together every day at one point. He supported me, I supported him. I'll let the internet call it whatever they want to call it,' she added."
    ]
}