{
    "articleURL": "/wires/ap/article-12037973/Crown-comes-Parliament-pre-coronation-Charles-visit.html",
    "content": [
        "LONDON (AP) - Before the glory of his coronation weekend, King Charles III visited Parliament Tuesday, to get a reminder that the monarch´s power has limits.",
        "Charles and Camilla, the queen consort, attended a reception for lawmakers, most of whom haven´t been able to snag a ticket to Saturday's coronation ceremony at Westminster Abbey. The royal couple also had the chance to see a 300-year-old gilded coach that ferried the speakers of the House of Commons to coronations and royal weddings.But not anymore. On Saturday, the carriage will remain in Parliament´s Westminster Hall, where it´s on public display. Commons Speaker Lindsay Hoyle will walk the few hundred yards (meters) to the abbey for the coronation, clad in full ceremonial dress including lace jabot and cuffs, and preceded by a sergeant-at-arms carrying the ornamental mace from the House chamber.Hoyle said the presence of the mace \"shows, this is the elected House, represented.\"\"Constitutionally, it is so important the elected House is represented as we see the monarch being crowned,\" he said ahead of Tuesday's royal visit.While Britain´s elected lawmakers take a back seat during royal events, the monarch faces restrictions in Parliament.",
        "The king can visit Westminster Hall - the oldest part of the Houses of Parliament, remnant of the medieval palace that once stood here - but may not enter the House of Commons. Ever since King Charles I tried to arrest lawmakers in 1642 and ended up deposed, tried and beheaded, the monarch has been barred from the Commons chamber.",
        "The Speaker´s State Coach tells its own story.Built after the 1689 \"Glorious Revolution,\" when Parliament asserted its rights over the monarchy, the coach features a mix of royal and parliamentary symbolism. A painted panel on its side shows the monarch being presented with Magna Carta and the Bill of Rights, pillars of Britain´s democratic system.\"That is a reminder to the royal family and others: That is what we fought for. That is what we expect,\" Hoyle said.While the monarch still formally gives assent to every piece of legislation, Hoyle said he had \"never known the monarch to object to what the House of Commons does.\"\"I never, ever see that happening.,\" he said. \"What I see is a grown-up recognition of democracy in this country, that we still have a monarch that plays his part.\"The speaker´s coach - slightly smaller than the Gold State Coach that Charles will use on coronation day - took previous speakers to the coronations of George V, George VI and Queen Elizabeth II. Its last official outing was for Charles´ wedding to Princess Diana in 1981.It has spent the past decade in a carriage museum in southwest England, and has now returned to Westminster, a reminder of links between Parliament and crown.",
        "Inside the speaker's official residence on the grounds of Parliament is another: the State Bed, where monarchs traditionally slept on the night before their coronations. The last to do so was King George IV in 1821. Hoyle said Charles would be welcome to use it.\"If he wants to stay on the night of the coronation, the bed is made up,\" he said."
    ]
}