{
    "articleURL": "/femail/article-12051687/How-Kate-overcame-minute-nerves-Princess-Wales-took-control-one-walkabout.html",
    "content": [
        "Carole Railton told FEMAIL that Kate showed sign of 'stress' to begin withRead More:  Kate and William meet TikTok royalty! Prince and Princess of Wales film hilarious video with trainspotting internet star Francis BourgeoisThe Princess of Wales was 'stressed and concerned' at times during her Buckingham Palace walkabout this afternoon - but 'took control' of her last-minute nerves with one gesture, a body language expert has claimed. ",
        "Kate Middleton, 41, joined Prince William, 40, and King Charles, 74, as they surprised members of the public who have already lined The Mall this afternoon. Although the royal mother-of-three appeared in high spirits as she shook hands and exchanged pleasantries with fans, body language expert Carole Railton says Kate exhibited some key signs which hinted at her underlying nerves.As Kate approached the crowds with Prince William, Carole says the royal started the daunting task of greeting thousands of fans with 'good intentions'.The expert - who has penned the book The Future of Body Language - noted that Kate appeared 'relaxed in her moves' at the very beginning.",
        "However as the royal began interacting with fans, Carole said there were some subtle shifts in the Princess' demeanor. She explained: 'Kate's shoulders are slightly raised [as she spoke with members of the public]. This is an indicator of stress or tension.' What's more, Carole also highlighted the 'slight stiffness' to Kate's posture.The expert said: 'This indicates there is some concern about what she is doing.'Her head is still slightly tilted forward even when she is at the same level as the people she is interacting with.'Again, this situation shows she is still not as comfortable as she would like to be as she does not have a completely straight back.' ",
        "On top of this, Carole said Kate's nerves were evident from her 'posed smile' during the walkabout. Highlighting another sign of tension, the expert said: 'Her smile is held very tightly.",
        "'When you smile naturally, your teeth aren't touching in this way.' Footage of the Princess posted on Twitter showed Kate hurrying to greet every member of the crowd in one area of the Mall.As Kate tried to shake hands and make eye contact with each person in the group, Carole noted that Princess' decision to 'move quickly' suggests she was in a 'stressful situation'.She said: 'Her voice was a little higher pitched than normal which indicates nerves and stress in a body.'That said, the expert said Kate did settle into the overwhelming task and used one move in particular to regain 'control'.Carole said: 'Kate stretched her arm out and put her hand on a couple of the individuals in the crowd. 'This is unusual, the royals normally shake or hold hands with the public not put their hands on the back of them.",
        "'Taking the lead like this, putting a hand on someone’s shoulder is normally a guiding pose, when you want to lead someone in a certain direction before going through a door for example. ",
        "'It’s a dominant pose, since you are in control when doing this, guiding the other person.'Although it is seen by most people as a comfort pose, you are in fact controlling how the other person moves and where to, or getting them to stay in the position they are in. 'As such, Carole says Kate appeared calmer as she worked her way through the crowds.Carole said: 'Kate got more relaxed as the day went on. The posed smile went and she became more relaxed and genuine with her contact with the public.'Following surprise walkabout this afternoon, the Princess of Wales will attend a glittering reception at Buckingham Palace this evening - which is being attended by foreign royals, world leaders and other overseas dignitaries. Some 100 heads of state will be in London for the ceremony tomorrow, with international representatives from 203 countries due to attend.Among the global leaders seen arriving at the palace on Friday was the First Lady of Ukraine, President Zelensky's wife Olena Zelenska. She will represent Ukraine at the Coronation while her husband remains at home, leading efforts against Putin's illegal invasion. She is joined by Prime Minister of Ukraine, Denys Shmyhal."
    ]
}