{
    "articleURL": "/wires/reuters/article-12040817/Stellantis-Q1-sales-14-better-chip-supply-supported-shipments.html",
    "content": [
        "Q1 revenue up 14% to 47.2 bln euros, above estimates",
        "BEV sales rose 22% in Q1Consolidated shipments up 7% in Q1 to 1.48 mln unitsShares trades lower in MilanTotal inventories up 230,000 to 1.3 mln at end-March(Recasts, updates share price)By Giulio Piovaccari and Gilles GuillaumeMILAN, May 3 (Reuters) - Stellantis said on Wednesday improvements in chip supply and price rises boosted its revenues in the first quarter, but was cautious on the outlook for the rest of the year as its vehicle inventories were growing.CFO Richard Palmer, who will leave the world's third-largest carmaker by sales at the end of June to be replaced by Natalie Knight, said the company expected mid-single digit growth for the market this year.\"It is a bit early to change any of our full-year forecasts,\" he said. \"Clearly the macro situation is still complex.\"Stellantis shares were down 1.8% by 1030 GMT, placing it among the worst performers of Italy's blue-chip companies.Total inventories at Stellantis rose to around 1.3 million units at the end of March, as logistic problems that hit Europe in particular last year were still being resolved by the owner of brands including Fiat, Peugeot, Jeep and Dodge.\"In Europe ... we have some challenges transforming company's stock into dealer stock and therefore getting orders fulfilled with customers, which is still a challenge for our market share,\" Palmer said.",
        "Banca Akros analyst Gabriele Gambarova said average selling prices for Stellantis vehicles in North America fell 0.7% in the first quarter, the first year-on-year decline in 10 years, adding this \"can pose some doubt on the sustainability of margins in this important area\".Analysts at RBC said Stellantis inventory levels were higher compared with peers in North America, the group's largest market.In the first quarter, Stellantis' net revenue rose 14% to 47.2 billion euros ($52 billion) on higher shipments, lifted by an improvement in semiconductor supply, and an ability to raise prices to buyers.Consolidated shipments were up 7% to around 1.48 million units.Stellantis confirmed its forecast for a double-digit margin on adjusted operating profit and for positive cash generation this year. ($1 = 0.9074 euros) (Reporting by Giulio Piovaccari and Gilles Guillaume; Editing Federico Maccioni, Alexander Smith and Barbara Lewis)"
    ]
}