{
    "articleURL": "/debate/article-12039179/LORD-ASHCROFT-King-Charles-secure-Britain-future-abroad-certain.html",
    "content": [
        "Yesterday I wrote about how people in Britain see their monarchy as they prepare to witness the Coronation of the new King.",
        "Despite some challenges, the institution looks secure for now. But my research found that in the Commonwealth realms – the 14 other countries in which the King is head of state – the picture is much more mixed.In six of these countries – Antigua and Barbuda, the Bahamas, Canada, Jamaica and the Solomon Islands – more voters said they would choose to become a republic than would opt to stay with the Crown. The question is not settled – in all but two, the proportion saying they didn’t know or would not vote was bigger than the gap between the two sides – but it shows the balance of forces and perhaps the direction of travel.(Visit www.lordashcroftpolls.com to see each country’s results on our interactive map.)In the eight countries that would stay with the monarchy, the margins ranged from tight (five points in Belize, six in Papua New Guinea) to comfortable (29 points in St Vincent and The Grenadines, 45 points in the Pacific nation of Tuvalu).",
        "At first glance, this suggests a division of varying magnitude as to what people think about the Royal Family, or how they see the institution of the monarchy. In fact, it has more to do with how they see themselves, and what, if anything, they think they gain from their relationship with Britain and having the King at the apex of their political system.",
        "In other words, and as I always remind politicians – it’s not about you (Your Majesty), it’s about them.For republicans, the objection to the Crown is not that it stops them doing what they want but that it feels irrelevant to their country and their allegiance to it seems an anachronism.Some, especially in Canada and Australia, felt it was incompatible with what they considered their inclusive and egalitarian national character. Britain’s cultural influence was fading, while relationships with partners like the US and China seemed increasingly important.The monarchy’s association with the history of slavery and colonialism was another inescapable factor, especially in the Caribbean. Many in Jamaica (where people said they would vote for a republic by a nine-point margin in a referendum tomorrow) said the fact that they were not only nominally ruled by their former colonial masters but needed a visa to visit the UK added insult to injury.We heard many calls for the King to apologise on behalf of the monarchy and his country for their past misdeeds – calls which were echoed by some at home. But these were strongly resisted by the majority of British voters (‘the Royal Navy freed 150,000 slaves. Why should we apologise to anyone?’ was a typical comment in our focus groups).",
        "While just over half of British republicans thought such an apology should be issued, three quarters of those who would vote to keep the monarchy disagreed. This will be one of the trickiest questions the King has to tackle: appropriately acknowledging the more shameful parts of our history is one thing, but going too far along this road risks upsetting the wider public without ever satisfying activists’ demands. Many around the world were torn between the wish to assert their independence and end the association with historical wrongs on the one hand, and on the other, the stability and reassurance they felt the monarchy offered.",
        "People in Belize spoke of the sense of security they had felt from seeing British soldiers in their ‘nice big trucks’, and said that even though the Army’s presence had been scaled back significantly, they felt the Crown implied a degree of protection in the face of territorial claims by neighbouring Guatemala.Many in more remote countries including New Zealand (which would vote to keep the monarchy by a ten-point margin) felt they had more influence and international standing than they would have on their own ‘down at the bottom of the world’ – not to mention generous visa arrangements with the UK.Elsewhere, even some who were doubtful about the monarchy were even more reluctant to trust their own political elites (‘a president would become a dictator and control everything,’ warned a man in Papua New Guinea). Around the world, a substantial proportion of those voting to keep the monarchy said this was because the alternative would be worse, or the process of changing too disruptive. Few were attracted to the idea of a US-style executive president, but nor could they see the point of elevating one of their own citizens to the position of ‘phoney monarch’ or ‘head ribbon cutter’, as they described the idea of a home-grown ceremonial head of state.",
        "Indeed, one of the biggest advantages the monarchy has in this debate is its seeming irrelevance to most people: the cost of living, crime, violence, corruption, the environment, poverty, healthcare, education and jobs were all more pressing.In every country leaning towards voting for a republic tomorrow, large majorities also agreed that ‘in an ideal world we wouldn’t have the monarchy, but there are more important things for us to deal with’. As they told us in Jamaica, they could get rid of the King but ‘the price of rice remains the same’.The line from the Palace is that the monarchy’s place in the Commonwealth realms is a matter for the people in those countries.That is as it should be. But there is a fine line between not campaigning and not seeming to care. Understandably, some want to leave. But others want to feel that they are taken seriously and that they benefit from their bond with Britain. Much of this is down to His Majesty’s Government, rather than the King himself. How much do these relationships matter, and are we willing to invest in them?Lord Ashcroft is an international businessman, author, philanthropist and pollster. You can follow him on Twitter/Facebook: @LordAshcroft. Uncharted Realms: The Future of the Monarchy in the UK and Around the World is available at LordAshcroftPolls.com"
    ]
}