{
    "articleURL": "/wires/reuters/article-12055691/Enzo-Copetti-scores-twice-Charlotte-slips-past-NYCFC.html",
    "content": [
        "Enzo Copetti scored two first-half goals and Charlotte FC's winning tally came on an own goal by visiting New York City FC for a 3-2 victory Saturday night.",
        "NYCFC's Richard Ledezma was charged with a tie-breaking own goal in the 74th minute off a delivery on a free kick from Charlotte's Karol Swiderski. The ball skipped in off Ledezma's head.The game marked the season debut for Charlotte goalkeeper Kristijan Kahlina, who collected four saves.Gabriel Pereira and Santiago Rodriguez each scored for NYCFC.Kahlina, who had back surgery in January, appeared in 31 games as Charlotte's primary goalkeeper last season. The 30-year-old Croatian's return to action seemed to bring an emotional lift given off-field issues that have dogged the Charlotte club in recent weeks.NYCFC goalkeeper Luis Barraza was credited with one save.It was a good start to May for Charlotte (3-5-3, 12 points), which won only one of five April games, going 1-2-2.New York City (4-4-3, 15 points) remained winless in road games this year (0-4-2).Copetti scored in the eighth minute for his third goal of the MLS season and his first since mid-March. He had a shot from just a couple of yards from the goal line, set up wonderfully by Orrin McKinze Gaines II's cross from the right side. Gaines had broken free and sent a pinpoint pass into the box.Pereira's third goal of the season came in the 37th minute on a shot from the middle of the box. The assist came from Ledezma on a through ball.",
        "Copetti got his second goal just two minutes later on a header. That came on a pass from Justin Meram, who was in his second game with Charlotte since a trade from Real Salt Lake late last month.Rodriguez's penalty kick in the 57th minute pulled NYCFC even again.In addition to Copetti's goal, the opening 15 minutes involved some emotion as three yellow cards were issued, including two on the home team.--Field Level Media"
    ]
}