{
    "articleURL": "/news/article-12047083/CDC-employee-39-killed-Atlanta-gunman-23-opened-hospital.html",
    "content": [
        "Amy St. Pierre, 39,  was shot and killed in the mass shooting at Northside Hospital Medical Midtown on Wednesday The Centers for Disease Control and Prevention employee was shot alongside four other womenDeion Patterson, 24, was taken into custody Wednesday night after a manhunt across the city of Atlanta that lasted for several hours The woman killed in the mass shooting in an Atlanta medical center waiting room has been identified as 39-year-old Amy St. Pierre, an employee of the Centers for Disease Control and Prevention.",
        "St. Pierre, a public health advisor, died after Deion Patterson, 24, allegedly opened fire Wednesday at Northside Hospital Medical Midtown, where his mother had taken him for an appointment.The CDC confirmed St. Pierre's death in a statement that read: 'CDC is deeply saddened by the unexpected loss of a colleague killed today in the Midtown Atlanta shooting. Our hearts are with her family, friends, and colleagues as they remember her and grieve this tragic loss.'Patterson, whose mugshot has now been released, allegedly shot four other women - aged 25, 39, 56 and 71.",
        "Hospital officials confirmed that three of the injured people underwent surgery - one was shot in the arm, one in the face, and a third in the abdomen. Three of the victims were in critical condition at nearby Grady Memorial Hospital.Patterson fled the scene on foot and became the subject of an hours-long citywide manhunt. He was captured at about 8pm 'without incident' at a condominium complex in suburban Cobb County.Atlanta Mayor Andre Dickens expressed relief that Patterson was taken into custody alive so that he can be prosecuted.'Right now, we've had a successful end to a traumatic day,' Dickens said Wednesday night. 'I hope the city, the region, rests easy that he is in custody, but I also hope that we will stay vigilant to continue to look at a future where individuals who shouldn’t have a gun in possession won’t have one, and also that individuals are brought to justice, and also that we deal with these things that are mental health or easy access to guns,' he added. ",
        "Charles Hampton Jr., the Atlanta Police Deputy, did not discuss details of the investigation or a possible motivation for the rampage.'Why he did what he did, all of that is still under investigation,' he said. The suspect's mother, Minyone Patterson, is a nurse and accompanied her son to his medical appointment on Wednesday.",
        "She told the Associated Press that her son, a former Coast Guardsman had 'some mental instability going on' from medication he'd received from the Veterans Affairs health system, which he had begun taking on Friday.Minyone said that he had wanted an Ativan prescription to deal with anxiety and depression but that the VA wouldn't give it to him, citing its addictive quality.She claimed her son would have taken the proper dosage of the medication because 'he listened to my in every way.'Crying, she went on, 'Those families, those families. They're hurting because they wouldn't give my son his damn Ativan. Those families lost their loves ones because he had a mental break because they wouldn't listen to me.' The Coast Guard has confirmed that Patterson was enlisted with them in 2018, before being discharged from active duty in January 2023. It is unclear why he was discharged. ",
        "'Our deepest sympathies are with the victims and their families. The Coast Guard Investigative Service is working closely with the Atlanta Police Department and local authorities in the investigation,' the said in a statement.",
        "'Mr Patterson entered the Coast Guard in July 2018 and last served as an Electrician's Mate Second Class.'Patterson has had several run-ins with the law, including in 2017, when he was charged with driving under the influence, leaving the scene of a crash, and a number of other traffic violations.In 2015, he was arrested on a charge of marijuana possession, and in 2020, he was again cited for several traffic violations."
    ]
}