{
    "articleURL": "/wires/reuters/article-12041513/Union-brief-Hollywood-writers-strike-disrupts-TV-production.html",
    "content": [
        "By Lisa Richwine and Rollo Ross",
        "LOS ANGELES, May 3 (Reuters) - Striking film and television writers are set to meet with union leadership on Wednesday to discuss the work stoppage that threw Hollywood into disarray as the industry deals with changes brought on by the streaming TV boom.\"Jimmy Kimmel Live\" and other late-night shows aired re-runs on Tuesday night after the Writers Guild of America (WGA) went on strike, leaving them without teams to craft topical jokes based on the day's news. Production for scripted series in Los Angeles was halted for the remainder of the week.Hundreds of WGA members were expected back in front of the offices of Walt Disney Co, Netflix Inc and other studios in New York and Los Angeles, where they marched on Tuesday and voiced demands for higher pay and safeguards around the use of artificial intelligence.\"I just want to make sure that we're all getting our fair due. We create these stories,\" 28-year-old writer Maya Houston said on a picket line outside the Paramount film studio. \"It comes from the brains of these writers and I feel like we should be paid and compensated for it.\"The group negotiating on behalf of studios said it had offered a \"generous\" increase in compensation but was unable to agree to other WGA demands in last-minute talks on Monday.",
        "Negotiators for the WGA, which represents roughly 11,500 writers, were scheduled to meet with members in New York and Los Angeles on Wednesday evening to provide details of the talks and the decision to order a strike.The writers are seeking changes in pay and the formulas used to compensate writers when their work is streamed, among other proposals. The WGA estimated its changes would cost about $429 million a year.The strike hit Hollywood studios at a challenging time. Conglomerates are under pressure from Wall Street to make their streaming services profitable after pumping billions of dollars into programming to attract subscribers.The rise of streaming has eroded television ad revenue as traditional TV audiences shrink.The last WGA strike in 2007 and 2008 lasted 100 days. The action cost the California economy an estimated $2.1 billion as productions shut down and out-of-work writers, actors and producers cut back spending.The Alliance of Motion Picture and Television Producers (AMPTP), which represents studios, said it had been willing to increase its compensation offer. But the group said it objected to WGA demands that \"would require a company to staff a show with a certain number of writers for a specified period of time, whether needed or not.\"Writers say changes from the streaming TV boom have made it difficult for many to earn a living in expensive cities such as New York and Los Angeles.",
        "Half of TV series writers now work at minimum salary levels, compared with a third in the 2013-14 season, according to WGA statistics. Median pay for scribes at the higher writer/producer level has fallen 4% over the last decade.The WGA also wants to prevent studios from using artificial intelligence to generate new scripts from writers' previous work, or asking them to rewrite material created by AI.If the strike becomes protracted, the networks will increasingly fill their programming lineups with unscripted reality shows, news magazines and reruns. It also could delay the most important season for TV in the fall. Writing for fall shows normally starts in May or June. (Reporting by Lisa Richwine; Editing by Mary Milliken and Lincoln Feast)"
    ]
}