{
    "articleURL": "/tvshowbiz/article-12040703/Real-Housewives-stars-Melissa-Gorga-Joe-Gorga-Dorinda-Medley-support-author-Rori-Sassoon.html",
    "content": [
        "Stars of two of Bravo's Real Housewives reality shows came out in force to support author Rori Sassoon at the launch of her new book The Art of Marriage.",
        "Real Housewives of New Jersey stars Melissa Gorga, Joe Gorga, Margaret Josephs and her husband Joe Benigno were joined by Real Housewives of New York star Dorinda Medley at the event, held at T Bar NYC in Manhattan.They were joined by Divorce Court bailiff Nick Barrotta, Tom Ierna, Brian Atwood, Dr. Jake Deutsch, Franco Lacosta and Amy Rosenblum.Melissa Gorga stepped out in a sleeveless peach mini-dress with a number of gold necklaces dangling from her neck.She also wore a black leather jacket at times during the event with a gold watch and a number of rings.",
        "Gorga completed her look with a pair of black knee-high heeled boots while carrying a black leather Christian Dior purse.She posed with the author Rori Sassoon, who wrote The Art of Marriage with Dr. Errol Gluck, who opted for a black and silver Dolce &amp; Gabbana halter top under a black coat and wide-legged black pants.Gorga's RHONJ co-star Margaret Josephs, who opted for a white blouse with gold link necklace and large hoop earrings, with a black skirt and gold platform heels.Josephs also posed with her husband of 10 years Joe Benigno, who opted for a powder blue t-shirt under a blue plaid coat.Benigno also posed with another Joe - Melissa Gorga's husband Joe Gorga - who rocked a black shirt with a silver chain under a white coat, while posing with Nick Barrotta, clad in a black suit.",
        "Real Housewives of New York star Dorinda Medley also stopped by, donning a black suit coat, black pants and black heels, while holding a black YSL clutch.The author also posed with Tom Ierna, Franco Lacosta and Amy Rosenblum at the launch party.Sassoon and Dr. Errol Gluck were also seen signing copies of their new book at the launch event. Gorga and Tom Ierna also posed with guests Brian Atwood and Dr. Jake Deutsch at the book launch.",
        "Bravo is currently airing the 13th season of Real Housewives of New Jersey, which airs Tuesday nights.Real Housewives of New York City is getting ready to kick off its 14th season on Sunday, July 16. Both Melissa and Joe Gorga were focal points of Tuesday night's episode of Real Housewives of New Jersey.The married couple were surprisingly excluded from Teresa Giudice's pre-wedding dinner during the episode. "
    ]
}