{
    "articleURL": "/sport/football/article-12059071/Newcastle-send-scouts-monitor-Blackburn-Rovers-starlet-Adam-Wharton-18.html",
    "content": [
        "Newcastle are continuing to send scouts to watch Blackburn's Adam Wharton The 18-year-old midfielder has caught the eye in 21 appearances this campaign Eddie Howe's Magpies are also monitoring 23-year-old defender Hayden CarterNewcastle United are continuing to send scouts to watch Blackburn Rovers, with teenage midfielder Adam Wharton of particular interest.",
        "Sporting director Dan Ashworth and scout Mick Tait have both been to Ewood Park in recent weeks to check on the 18-year-old, who has caught the eye in his 21 senior appearances this season.However, we understand Blackburn are determined to keep Wharton at the club until that number reaches closer to 100 and they believe his development is best served playing regular football with them.That has not stopped the likes of Newcastle returning reports on the ball-playing left-footer, who has been described to Mail Sport as a 'taller Jack Wilshere, who can play and tackle'.Arsenal, Leicester, Tottenham and West Ham have also had scouts at Blackburn fixtures of late, and Wharton is the name they're all talking about.",
        "We understand Newcastle are keeping tabs on Blackburn defender Hayden Carter, too. The right-sided centre-back, 23, has enjoyed a breakthrough campaign after loan spells in League One and the Magpies are monitoring his improvement. Rovers tied the academy graduate down to a new four-year contract in March.Last week, Carter rescued Rovers' play-off hopes with a last-gasp equaliser against high-flying Luton.In April, Mail Sport reported that more than 30 representatives from different clubs watched Jon Dahl Tomasson's side draw 1-1 with Coventry, with Wharton of particular interest. The 18-year-old England U19 midfielder was the stand-out performer in the 1-1 stalemate between the play-off rivals.",
        "Tomasson and Co staged a dramatic comeback to beat Millwall 4-3 at The Den on the last day of the Championship season.Blackburn finished the season outside the play-off places in seventh on goal difference, with Sunderland earning the final spot.Millwall had held a 3-1 lead in the match, but their second half collapse led to the hosts slipping to eighth in the table. "
    ]
}