{
    "articleURL": "/wires/reuters/article-12040019/Suspect-killings-5-people-Texas-arrested-days-long-manhunt-NBC.html",
    "content": [
        "By Daniel Trotta",
        "May 2 (Reuters) -Police on Tuesday captured a man suspected of shooting five Texas neighbors to death and leading multiple agencies on a four-day manhunt, after a tip led them to a home in a nearby town where he was caught hiding beneath laundry, officials said.The bloodshed erupted on Friday after neighbors asked the suspect to stop firing his semiautomatic rifle in his yard because it kept their baby awake. Instead, the man reloaded and entered the next-door home of Honduran immigrants, killing five, including an 8-year old boy, officials said.The suspect had been identified as Francisco Oropesa, 38, a Mexican national who immigration officials said had been deported from the United States four times since 2009.San Jacinto County Sheriff Greg Capers told reporters that officials acted on a tip from an unidentified person who would now be eligible for an $80,000 reward offered for information leading to his arrest.\"He is behind bars, and he will live out his life behind bars for killing those five,\" Capers said, adding that Oropesa would be held on $5 million bail for five counts of murder.The victims were killed in the town of Cleveland, Texas, and the suspect arrested in the town of Cut and Shoot, Texas, roughly 17 miles (27 km) due west. Both are about 50 miles (80 km) north of Houston.",
        "The arrest came as the FBI said it was working with law enforcement agencies nationwide and in Mexico in an expanded, four-day manhunt.As of Sunday, the suspect's trail had grown cold, but multiple agencies rapidly mobilized, joining the sheriff's department and the FBI, upon receiving the tip.Officers from the U.S. Marshals Service, the Texas Department of Public Safety and the U.S. Border Patrol Tactical Unit carried out the arrest about an hour and 15 minutes after receiving the tip, said FBI Assistant Special Agent in Charge Jimmy Paul.Most of the victims were shot in the head. All were from Honduras and among the 10 people living at the address but were not all family members, Capers said.The victims were identified as Sonia Argentina Guzman, 25; Diana Velazquez Alvarado, 21; Julisa Molina Rivera, 31; Jose Jonathan Casarez, 18; and Daniel Enrique Laso, 8. (Reporting by Daniel Trotta in Carlsbad, California; Additional reporting by Steve Gorman in Los Angeles; Editing by Gerry Doyle)"
    ]
}