{
    "articleURL": "/femail/fashion/article-12056953/How-dress-like-grown-Shane-Watson.html",
    "content": [
        "UK style expert Shane Watson says how you can rock the footwear this summer READ MORE: Penny Mordaunt (and her brolly carriers) lead the fashion parade This is the time of year when a woman's thoughts turn to the tricky question of summer footwear.",
        "Winter footwear is a doddle comparatively. You've got trainers. You've got boots. You've got block midi-heels with opaque tights.Summer is always harder and it's getting harder still because we're no longer prepared to compromise on comfort — so no more flimsy sandals.We need shoes that can do more than one job (an espadrille is nice, but not for work) and we want footwear that hits the fashion bullseye because, whatever the season, shoes are the best short cut to nailing an outfit in the present.It's a lot to ask of one pair of shoes, but that's the way we roll these days and this summer, the sandal that's going to get us where we want to be is the chunky black sandal.",
        "Feel free to wear it with a midi dress or trousers, khakis or an LBD — it's what will give any of the above 2023 attitude.Walking past a parade of shops in London yesterday, I noticed that Ba&amp;Sh — a brand known for its floaty boho dresses and rock-chick suede boots — had 'Look at our Chunky Sandals' painted on the window in giant letters, and that's because this summer even dreamy rock chicks need a pair.Black and solid sounds the opposite of summery — and in some ways that's the point: the Chunky Black Sandal has just the right amount of toughness to counterbalance floral dresses and pretty colours and make them wearable for everyday; just the right amount of edge to sharpen up trousers and ankle-grazing skirts, and just the right degree of support, plus aeration, to make it a pleasure to wear in warm weather.",
        "It comes in many guises ranging from footbed two straps to gladiator styles, only this time with extra padding.And although some are heavy duty, most are available in streamlined foot-flattering versions.If you avoid the soles with exaggerated deep treads, you're looking at shoes we can all do business with and that will make the difference.There's nothing new about a footbed sandal or sliders, they're just getting sleeker and suitable for the office and after dark.The most desirable of the current batch are Birkenstock's patent one-strap Madrid sandals with the extra big gold buckle (£115, birkenstock.com/gb), which are chic enough to wear with trousers or a midi dress at night.",
        "I still like the double strap Arizona (£115, johnlewis.co.uk), but the High Street is coming up with designs to look extra smart and luxey — from Massimo Dutti's soft two-strap sandals (£119, massimodutti.com) to Zara's extra-chunky metal-studded style (£59.99, zara.com).These sandals look like the shoe you need on holiday but glossed up, and with a pedicure (crimson nail polish helps this look) will transform cropped black trousers, your nearly long skirt, and look great with those silky print co-ords in August.And for those worried about losing their heel height you can always go for a thick sole, like the Trini flatform (£19.99, schuh.co.uk).",
        "Keep them flat and blackGet a pedicureStick to glossy leatherWear with longer dresses",
        "Most brands have a version of the 'Dad sandal' — two chunky straps plus a back strap (the originals were on the Chanel catwalk pre-pandemic) so you can take your pick, but my tip is to stick to a glossy-look leather.Arket has a mock-croc shiny leather pair that are both chunky and smart (£81, arket.com).These score high on the cool-ometer and the heel strap makes them easier to wear.Otherwise, the hip sandal of two summers ago that again is now firmly mainstream is the 'fisherman' sandal, a cross between a roman sandal and a jelly with a buckled ankle strap and a rubber sole.For me, this is just too close to the shoes I wore at primary school, but I've seen women looking good in them with tailored trousers, specifically the Kin at John Lewis Lilibet sandals which are reasonably priced (£55, johnlewis.com).I'm more tempted by the gladiator styles. I like the look of Hush's (£99, hush-uk.com) and Marks &amp; Spencer does a good version (£45, marksandspencer.com) with a 20mm sole so you get some extra height, too."
    ]
}