{
    "articleURL": "/news/article-12058261/Party-invite-Tom-Fennells-Playboy-50th-Ivy-penthouse-Sydney.html",
    "content": [
        "Socialite Annabelle Price celebrated her partner's wild 50thThe 'Playboy' themed party had strict no phones rule  Meanwhile her financier ex was spotted with mystery woman Their trainwreck marriage was the talk of Sydney's social circles for the better part of 2021, but it seems disgraced financier Freddie Blencke and his bombshell ex-wife Annabelle Price have finally moved on from their failed relationship. ",
        "The one-time model celebrated her partner Tom Fennell's 50th birthday on Saturday night at The Ivy penthouse, where 100 of the couple's closest friends dusted off their tuxedos, silk pyjamas and bunny ears for 'A Night at the Playboy Mansion'.Daily Mail Australia can exclusively reveal the strict social media and photo ban Mr Fennell had in place, reminding guests via email on the eve of the party.While it was strictly black-tie for men, it's likely there were more than a few bunnies on the loose on Saturday night.'You can only imagine the outfits, or lack there of, some of the wives and girlfriends were in,' a well-placed source told Daily Mail Australia. ",
        "'No doubt that vacuous spa was on high rotation too,' the source said, referring to the venue's infamous hot tub. Meanwhile, her private wealth advisor ex also appeared to enjoy his weekend.He was spotted outside Hotel Revesis in Bondi on Sunday, deep in conversation with a mystery brunette. It's the very same celebrity hotspot where he assaulted a police officer back in 2021 after being asked to leave by security, After pleading guilty to assaulting a police officer, causing bodily harm and staying in the vicinity of licensed premises after being asked to leave, Blencke was sentenced in Waverley Local Court to a 12-month community corrections order and fined $750. ",
        "It's been three years of hell for the businessman, who last year was cleared of assaulting his wife and breaching an apprehended violence order.The father-of-three even traded in his Ralph Lauren shirts for prison greens for a month during the 2021 Christmas break.But the 50-year-old finally caught a break when Sydney magistrate Jacqueline Milledge allowed him to life at a luxury private residence in the northern NSW town of Federal.He was ordered to report to Byron Bay police station three times a week and was banned from drinking any alcohol, or attending any licensed venue.'Not even a Chinese restaurant, Mr Blencke,' Magistrate Milledge warned him at the time. Mr Fennell is the Managing Director of Tama Capital Partners and was previously married to Vanessa Fennell, who has recently joined the rebooted cast of The Real Housewives of Sydney. "
    ]
}