{
    "articleURL": "/wires/pa/article-12044341/Tributes-paid-teenager-killed-Cardiff-car-crash.html",
    "content": [
        "Family members have paid tribute to a 15-year-old girl with a “beautiful smile that would light up a room” after she died in a car crash in Cardiff.",
        "Keely Morgan was hit by a vehicle in Heol Trelai, Caerau, in the west of the city just after 9.30pm on Monday and she was later declared dead at the scene.A 40-year-old man was arrested on suspicion of causing death by dangerous driving and the investigation is ongoing, South Wales Police (SWP) said.In a joint statement, the teenager’s mother Sian Morgan and step-father Liam Coulthard said they are “devastated at the sudden loss of Keely”, who will “never be forgotten”. In such a short time in this world, she had touched so many people and she had so many plans that have now been so cruelly taken away  Family statement  They said: “Our hearts are broken, and we never imagined anything like this would ever happen to us.“Keely always had such a beautiful smile that would light up a room.“She was sensible, kind and not one person ever had a bad word to say about her.“In such a short time in this world, she had touched so many people and she had so many plans that have now been so cruelly taken away.”Ms Morgan and Mr Coulthard said they have “been overwhelmed with the outpouring of love and support from our community” and thanked people for their support.",
        "“Finally, to anyone at the scene who tried to help Keely and to all the emergency services who tried their best, again as family we are grateful for your efforts,” they added.“Rest in peace Keely. You will never be forgotten.”Martin Hulland, headteacher at Cardiff West Community High School, said his students and staff were “absolutely devastated to learn of the tragic passing of Keely Morgan from Year 10”.Mr Hulland praised her as “an exceptional student who loved school” and said “we will all miss her terribly”.In a statement, he said: “There was an enormous sense of shock and a huge outpouring of grief as we received the terrible news yesterday.",
        "“Keely was an exceptional student who loved school.“She was a good friend to many students and had a real passion for drama.“Her family were outstanding supporters of the school.“Keely demonstrated high levels of resilience to overcome serious health issues and was a superb role model to so many.“She was described as an ‘absolute star’ by her head of year, and we will all miss her terribly.“Our thoughts are with her family and friends, and we will do all we can to provide care and support at this incredibly difficult time.”The force has said the incident involved Ms Morgan, who was a pedestrian, and a black Vauxhall Astra.",
        "Witnesses or anyone with dashcam or CCTV footage of the incident or of either Ms Morgan or the car prior to the collision are being asked to make contact with police quoting reference *140268.Ms Morgan’s family are said to be being supported by a family liaison officer and have asked to be allowed to come to terms with their grief in private.A spokesperson for SWP said: “Our thoughts remain with Keely’s family at this time.”"
    ]
}