{
    "articleURL": "/wires/reuters/article-12053767/Girl-wounded-Serbia-school-shooting-critical-condition-RTS-state-TV-reports.html",
    "content": [
        "BELGRADE, May 6 (Reuters) - A girl who was shot in head in a school shooting in Serbia that killed eight pupils and a guard is still in critical condition, while two boys who were in the same hospital were released, RTS state TV reported on Saturday.",
        "The country is in shock and mourning after two mass shootings - the school massacre in Belgrade on Wednesday and a rampage outside the city on Thursday that killed eight people. The suspects in both incidents are in custody.Four of the slain pupils and the guard killed in the school shooting and five young men killed in the second rampage were due to be buried on Saturday.Following the shootings, the government introduced a set of measures aimed at preventing violence in schools and reducing the number of weapons held by civilians.Despite strong gun controls, Serbia and the rest of the Western Balkans are awash with military-grade weapons and ordnance that stayed in private hands after the 1990s wars.Opposition parties, which blame the government of Prime Minister Ana Brnabic for failing to prevent the two shootings called on supporters to an anti-government march on Sunday evening in Belgrade.Serbia is holding three days of mourning, with flags at half mast and no entertainment programmes on television.Flowers were laid and candles lit for the third consecutive day on Saturday in front of the Vladislav Ribnikar school in Belgrade. Vigils have been held in other parts of Serbia, including the central town of Cacao and Novi Sad in the north.",
        "In the countries throughout the region - Bosnia, Croatia, Kosovo, Montenegro and North Macedonia - people have also paid their respects, lighting candles in main squares.Bosnia and Montenegro are also holding days of mourning on Friday and Sunday, respectively.The suspect in the school shooting is a 13-year-old boy who police said surrendered on Wednesday after taking two of his father's handguns to carry out the shooting.The suspect in the rampage outside the capital is a young man who authorities said was wearing a T-shirt with neo-Nazi symbols. He was arrested after being caught hiding at his grandfather's house.(Reporting by Ivana Sekularac Editing by Frances Kerry)"
    ]
}