{
    "articleURL": "/tvshowbiz/article-12045135/Robin-Thicke-fiancee-April-Love-Geary-match-black-step-shop-Malibu.html",
    "content": [
        "Robin Thicke and his fiancee April Love Geary enjoyed a sunny shopping day out in Malibu on Wednesday.",
        "The Blurred Lines singer, 46, sported a black t-shirt and grey jeans, along with a pair of sturdy black boots for the trip.The hitmaker - who recently went on a sun-soaked holiday with April - shielded his head from the sun with a dark hat, and finalized his look with a pair of sunglasses.Meanwhile April, 28, matched in a black hoodie, a pair of athletic leggings, and white Nike sneakers. Like her beau she sported a hat over her lustrous black tresses, which cascaded down her shoulders.  ",
        "Thicke's ex-wife Paula Patton, 47, was also spotted out in Malibu on Wednesday.The beauty was seen on a grocery run at Whole Foods.The Mission Impossible 4 star looked radiant as ever, wearing a gold tracksuit over a white tee.Patton paired the outfit with chunky Gucci sneakers and wore her golden tresses down for the outing.The actress let her natural beauty shine through, going bare-faced for the day.Paula and Robin met in 1991 at age 15 and started dating in October 1993.They got married in June 2005 and announced their split in February 2014.The former pair share 12-year-old son Julian together.",
        "Robin and April started dating in September 2014, just months after he split from  Paula. They would welcome their first child, a daughter Mia, four, in February 2018, and then 10 months later got engaged on Christmas Eve that very same year.",
        "Thicke and Geary would add two more children to their family over the next few years: a second daughter, Lola, three, and a son Luca, one.But despite nearly reaching the 10-year point in their relationship the couple still appear to be enjoying their honeymoon stage as they put on a very public display of affection in recent snaps. April shared a few raunchy photos from the couples' holiday to her Instagram page last month. The snaps saw her straddling over Robin as he sat up on a sun lounger, while grabbing onto her peachy backside.She donned nothing but a skimpy leopard printed bikini top and thong bottoms which left very little to the imagination.She opted for no makeup and added a cowboy-style beige woven sun hat.",
        "Another picture shared showed April looking all glammed up and wearing a figure-hugging pink strapless dress which complimented her curves perfectly. She captioned the post at the weekend: 'Baecation', and also posted some other intimate moments of her trip on her stories to 179,000 followers. Robin is the son of late actor Alan Thicke, who died at age 69 in 2016 after he collapsed while playing hockey with his son Carter, 25, in Burbank, California.His mother is the singer and actress Gloria Loring, 76, who was married to Alan from 1970 to 1986."
    ]
}