{
    "articleURL": "/sport/football/article-12041737/Oleksandr-Zinchenko-hopes-Arsenals-win-Chelsea-reignite-title-fight-Man-City.html",
    "content": [
        "Arsenal returned to winning ways after a run of four matches without victoryMikel Arteta's side moved back to the top of the Premier League ahead of CityArsenal travel to Newcastle on Sunday looking to avenge defeat last seasonOleksandr Zinchenko hopes Arsenal's 3-1 win over Chelsea can kickstart their final push for the title, with the Ukrainian urging his team-mates not to give up on their pursuit of Manchester City.",
        "'If you don't believe, there is no point playing,' Zinchenko said after Mikel Arteta's side moved back to the top of the Premier League. 'We need to keep fighting.'Arsenal returned to winning ways in Tuesday's London derby after a run of four matches without victory that included defeat at the Etihad and saw them cede control of the title race.'It was an important three points for us obviously,' Zinchenko said. 'We bounced back quite well after the last couple of games where we dropped a lot of points. 'Today's win is so important for us to be back in a routine, for the mood in the dressing room and in terms also for our league position. So, let's keep going.'",
        "The left back added: 'I hope the energy is back and let's see what is going to happen in the next games.'Arsenal are looking for their first title in nearly two decades and Arteta's side currently lead City by two points.But the holders, who face West Ham on Wednesday night, have two games in hand on their rivals.'Unfortunately it is not in our hands, but you never know what can happen in this league,' Zinchenko said. 'We need to be focused on our performances. That's it.'",
        "He added: 'We worked so hard this season and we were doing so well, we were top of the league for a while, and then suddenly, in this league, anything can happen.'We dropped some points. Of course everyone is frustrated, until today's game.'Arsenal travel to Newcastle on Sunday looking to avenge defeat last season, which proved so costly in their pursuit of Champions League football. Another setback this year could prove fatal for their title chances.'We know how strong they are, we know the season they've had and what form they're in,' Zinchenko said.'When I had just arrived I said the quality everyone has here is incredible, the energy as well. 'So I said everything is possible in this life if we're going to work so hard. And that's what we're trying to do.'He added: 'Everything is possible in this league. You never know. We need to keep fighting, because we worked so hard during this season. ",
        "'Our fans deserve everything. The way how they push us, that's like an extra motivation for us to keep going, to keep fighting, and to give everything on the pitch.' Victory over Chelsea was Arsenal's eighth successive game without a clean sheet, after Noni Madueke slipped in behind Zinchenko to score a consolation at the Emirates.",
        "'The manager has already said to us a couple of things we've done badly, what we've done good and of course it's not acceptable at this level to concede so many goals,' Zinchenko said.'We need to improve on that. But we're human beings, we're still learning and we're such a young team as well so I hope for the future we're going to do much better.'"
    ]
}