{
    "articleURL": "/wires/reuters/article-12041769/Go-First-gone-engine-troubles-COVID-bring-Indias-largest-airline.html",
    "content": [
        "By Arpan Chaturvedi and Tanvi Mehta",
        "NEW DELHI, May 3 (Reuters) - Before the COVID-19 pandemic, Go Airlines (India) Ltd said it was one of the few profitable airlines in a country that is known for its staunchly price-conscious customers, a market where two big players have collapsed in the last 11 years.The company's ultra-low-cost model and near-total reliance on one aircraft type helped it make money, until engine issues that began about five years ago worsened and it reported heavy losses in the last three fiscal years.The cash-strapped carrier, India's third-biggest and best known as Go First, filed for bankruptcy on Tuesday, blaming \"faulty\" Pratt &amp;amp; Whitney (P&amp;amp;W) engines for the grounding of about half its fleet.It owes financial creditors 65.21 billion rupees ($798 million), and has now \"exhausted all financial resources\", according to its filing with the National Company Law Tribunal (NCLT) seeking insolvency proceedings.The move comes as its bigger domestic rival IndiGo is pitting Boeing against Airbus in record jet order talks to meet surging post-COVID demand. Go First's plight is also a blow to Prime Minister Narendra Modi's goal of turning India into a global aviation hub like Dubai or Singapore.IndiGo has also had to ground planes because its P&amp;amp;W engines faced problems, but its bigger fleet with diverse engines, and its deeper pockets, meant it could overcome the troubles better than Go First.",
        "GROUNDEDBy April, Go First had to ground more than 50% of its 54 Airbus 320neos fitted with P&amp;amp;W engines, up from 31% in 2020, according to the filing seen by Reuters. Engine failures have cost Go First 108 billion rupees in lost revenue and expenses, it said.The airline cancelled 4,118 flights in the past month, affecting 77,500 passengers, and it warned of more cancellations \"if urgent actions are not taken for its survival and resolution\", according to the filing.\"The deterioration in the company's financial performance was also accentuated by the outbreak of COVID-19 which resulted in crippling restrictions on air travel and use of public transport,\" the filing said.P&amp;amp;W, which is owned by Raytheon, said in a statement late on Tuesday it was committed to the success of its customers and that \"we continue to prioritize delivery schedules for all customers\".The airline started operations in 2005 and is owned by bed sheets-to-biscuits Wadia Group, one of India's oldest conglomerates.The Wadias will not exit the airline and are looking for a resolution with P&amp;amp;W, Go First Chief Executive Kaushik Khona said in an interview, adding the insolvency proceedings were aimed at reviving the airline and not selling it.The Wadia family has pumped 32 billion rupees ($391 million) into the airline in the past three years, 75% of that in the past year, Go First said.",
        "\"The Wadia Group, in particular (chairperson) Nusli Wadia, has always tried to see that the company and the airline operations go on, on a normal basis,\" Khona said.\"There is no question of Wadia Group having any intention to exit or move out.\"Mark Martin, CEO at aviation consulting firm Martin Consulting LLC, said Go First's troubles would cost others, too.\"Go First and IndiGo have been let down severely by Pratt &amp;amp; Whitney. And that will cost India, travellers, and banks severely,\" he said.($1 = 81.8080 Indian rupees)(Additional reporting by Kevin Krolicki, Chris Thomas and Dhanya Skariachan; Writing by Krishna N. Das; Editing by Kim Coghill)"
    ]
}