{
    "articleURL": "/wires/ap/article-12044849/Yanks-rally-past-Guardians-4-3-10-Bader-Peraza-hurt.html",
    "content": [
        "NEW YORK (AP) - Willie Calhoun and Jake Bauers, afterthoughts when the season began, have become pinstriped stopgaps for a struggling New York Yankees team missing a string of starters.",
        "\"With the big guys down right now, we´ve got to find ways to manufacture runs,\" Isiah Kiner-Falefa said after an unheralded trio propelled the Yankees over the Cleveland Guardians 4-3 in 10 innings Wednesday night. \"When we get the big boys back, everybody will have a role, understand what the job is, and it should be that much easier to win ballgames.\"Calhoun and Bauers homered against former Cy Young Award winner Shane Bieber as the Yankees overcame a 2-0 deficit.After Cleveland took a 3-2 lead in the ninth on pinch-hitter Oscar Gonzalez's bloop RBI single off Clay Holmes, Calhoun hit a tying single in the bottom half off All-Star closer Emmanuel Clase, and the Yankees won it in the 10th.Bauers drew a leadoff walk with the automatic runner on second, Kiner-Falefa sacrificed and pinch-hitter Jose Trevino - the last non-pitcher on the Yankees bench - singled over the drawn-in infield on an 0-2 pitch from Trevor Stephan (1-1), the reliever's third straight slider.\"These are the true Yankees fans right here,\" Trevino said in an interview broadcast on the Yankee Stadium public-address system, working the crowd on a cool and rainy night.",
        "After losing seven of 10 and dropping 8 1/2 games back in the AL East as Aaron Judge joined Giancarlo Stanton and Josh Donaldson on the injured list, the Yankees (17-15) took two of three from the Guardians by coming from behind for the second consecutive night.",
        "Center fielder Harrison Bader, back from the injured list just a day earlier, l eft after a ninth-inning collision with Kiner-Falefa. Oswald Peraza limped off after hurting his right ankle as a pinch runner.\"I think Harrison is going to be fine,\" manager Aaron Boone said.Josh Bell and Andrés Giménez hit RBI singles in the first off Clarke Schmidt after Yankees second baseman Gleyber Torres threw past first trying to complete a double play and Anthony Rizzo let José Ramírez´s grounder to first bounce off his glove for an error.Calhoun homered for the second straight night, a leadoff drive to right on a cutter in the fifth that was snagged by a fan with a backhand catch.\"It's a dream,\" said Calhoun, limited to 62 big league plate appearances with Texas and San Francisco last year. \"I don't think I would imagine doing that.\"Two outs later, Bauers pulled a slider into the right-field short porch for his first Yankees home run - his first in the majors since Sept. 19, 2021, with Seattle.\"I think I blacked out rounding the bases,\" said Bauers, who got the ball back from a fan.Bauers started in right, his first game since bruising his right knee crashing into the wall while making a catch during the first inning of his Yankees debut Saturday at Texas.",
        "\"I don't really find anything too hard to believe anymore,\" Bauers said. \"You really never know what's going to happen tomorrow. All you've got to do is enjoy the day.\"Ron Marinaccio had gotten five straight outs to preserve a 2-2 tie when Clay Holmes relieved with two outs in the ninth as some fans booed Boone. Myles Straw hit a liner to left-center that Kiner-Falefa, in left for the first time since 2015 at Double-A, lost in the lights and fell for a double.Gonzalez blooped an RBI single that dropped among Kiner-Falefa, Bader and shortstop Anthony Volpe, landing 240 feet from home plate. Bader collided with Kiner-Falefa and was undergoing postgame concussion protocol.Rizzo's leadoff single against Clase led to Peraza pinch-running and stealing second only to roll an ankle. Aaron Hicks ran for him and scored on Calhoun´s single.Clase blew a save for the third time in 13 chances. His cutter velocity is 97.7 mph this year, down from 99.5 mph last season and 100.2 mph in 2021.\"It's small mechanical things,\" he said through a translator.Albert Abreu (1-0) got Josh Naylor to ground into an inning-ending double play in the 10th.Cleveland has lost five straight series and 11 of its last 16 games. Bieber allowed five hits in eight innings, throwing 93 pitches.",
        "\"Kind of a weird night,\" manager Terry Francona said. \"They were obviously trying to get early contact.\"TRAINER´S ROOMGuardians: RHP Daniel Espino will miss the rest of the season after surgery to repair an anterior capsule in the 22-year-old´s shoulder. ... RHP Aaron Civale threw off a mound in Cleveland, his first time pitching since straining his left oblique on April 7. ... RHP Triston McKenzie, who hasn´t pitched in a game since a spring training outing on March 26 because of a right teres major muscle strain, threw 30 pitches off a mound at Yankee Stadium on Tuesday.Yankees: LHP Carlos Rodón (strained left forearm) will see a doctor Thursday to have his back examined. ... RHP Luis Severino (strained right lat) is to pitch in a controlled game on Friday in Tampa, Florida.UP NEXTGuardians: RHP Peyton Battenfield (0-2) starts Friday in the opener of a home series against Minnesota and RHP Bailey Ober (1-0).Yankees: RHP Jhony Brito (2-3, 5.56 ERA) will start Friday´s series opener at first-place Tampa Bay and be followed by Domingo Germán and Gerrit Cole. Nestor Cortes, coming off strep throat, was pushed back to Monday at home against Oakland. The Yankees and Rays play seven times in 10 games.___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}