{
    "articleURL": "/wires/ap/article-12039045/UN-chief-urges-nations-stop-targeting-media-truth.html",
    "content": [
        "UNITED NATIONS (AP) - The United Nations chief warned on the eve of World Press Freedom Day that the media is under attack in every corner of the world and urged all nations to stop the targeting of truth and those who report it.",
        "Secretary-General Antonio Guterres called the 50% increase in the killing of media workers in 2022 \"unbelievable,\" stressing that freedom of the press \"is the foundation of democracy and justice\" and it is under threat.At least 67 media workers were killed in 2022. In addition, digital platforms and social media have made it easier for extremists to push false narratives and harass journalists.\"Truth is threatened by disinformation and hate speech seeking to blur the lines between fact and fiction, between science and conspiracy,\" Guterres said in a video message for the U.N. commemoration of 30th anniversary of World Press Freedom Day. It was first proclaimed by the U.N. General Assembly in December 1993 and authorized to be held every May 3.Guterres said the collapse of the media industry, which has led to closures of local news outlets and consolidation of media \"into the hands of the few,\" is threatening freedom of expression.So are threatening new laws passed by governments worldwide, such as Russia´s 2022 law that anyone publishing information about its military that Moscow deems to be false could face up to 15 years in prison.",
        "Russia detained Wall Street Journal reporter Evan Gershkovich in late March, accusing him of spying. Journal publisher Almar Latour vehemently denied the accusation at Tuesday´s commemoration.",
        "He said the Journal is \"tremendously grateful\" that President Joe Biden is personally working to secure Gershkovich's release. He added that his Russian lawyers have said, \"Evan is thankful and reading every letter that he´s getting at the moment.\"Former journalist and Pulitzer Prize-winning author Samantha Power, who now heads the U.S. Agency for International Development, accused Russian President Vladimir Putin of not only wrongfully arresting Gershkovich but of targeting journalists elsewhere, including Ukraine, \"where his forces have shelled broadcasting towers, seized editorial offices, and killed nine journalists\" since the invasion on Feb. 24, 2022.Secretary-General Guterres strongly criticized the targeting of media workers both on and offline, saying they are routinely harassed, intimidated and detained. He added that nearly three-quarters of women journalists have experienced violence online and one-quarter have been threatened physically.The secretary-general said the world must unite to stop threats, attacks and imprisonment of journalists for doing their jobs, and stop the lies and disinformation.\"As journalists stand up for truth, the world stands up with them,\" he said.Audrey Azoulay, director-general of the U.N. Educational, Scientific and Cultural Organization, which organized the commemoration, said the advent of the digital era has changed the entire information landscape.While digital platforms have provided new ways for expression and information, she said, \"they are also proving fertile ground for those who sow disinformation, hate speech and conspiracy theories.\"",
        "\"We find ourselves at a new crossroads,\" Azoulay said. \"Our current path is leading us away from informed public debate ... towards even more polarization,\" she warned. \"The other path is one we must imagine together, to ensure information can remain a public good, accessible to all.\"Azoulay said UNESCO in 2021 launched a model curriculum for teachers on media and information literacy \"to develop critical mindsets to navigate these new flows.\"Given that the business models of digital platforms are based on the number of clicks, she said, they \"all too often favor sensationalism over truth.\"That´s why UNESCO in February organized a global conference aimed at ensuring that technology promotes human rights and shared values \"rather than harming them,\" which was attended by over 4,000 interested parties, Azoulay said. UNESCO plans to publish a set of guidelines later this year on the moderation and selection of online content - just as it did for broadcasting nearly 20 years ago, she said.UNESCO media expert Guilherme Canela De Souza Godoi told a news conference that Tuesday´s commemoration is a kickoff for more than 60 events in 60 countries and over 40 events in New York City to highlight World Press Freedom Day and the unacceptable trend of declining media freedom and increasing attacks.",
        "He cited UNESCO statistics released last year that 85% of the world´s population experienced the downsizing of their freedom in the last five years.A recent UNESCO survey found that journalists covering protests in 65 countries in all regions have been attacked, Canela said.Other recent data shows that judicial systems increasingly harass journalists in all regions, \"with 160 countries still keeping freedom of expression under criminal codes\" which can lead to journalists´ imprisonment, he said.The presidents of the U.N. General Assembly, Economic and Social Council, UNESCO General Conference, and Human Rights urged governments and all organizations to ensure \"a safe and enabling environment for journalists to perform their work independently and without undue interference.\"The Wall Street Journal´s Latour said that while the risks for journalists are increasing, \"we cannot withdraw from reporting about the world.\"\"There´s probably no better answer to autocracies that are trying to squash and diminish journalism than to offer great journalism to the world,\" he said. \"It is not just press freedom that´s at stake. ... The fight for Evan´s release is the fight for everybody´s freedom.\""
    ]
}