{
    "articleURL": "/femail/article-12041107/A-call-arms-shoulders-athletic-Princess-Diana-inspired-new-sleeveless-fashion-trend.html",
    "content": [
        "Diana was regularly spotted in sleeveless tops and dresses in the ninetiesFor all the latest Royal news, pictures and video click here Read more: Princess Diana's jaw-dropping collection of jewellerySleeveless fashion is having its moment, from the catwalk to the high street. And, as with so many modern trends, it has roots in royalty.",
        "Princess Diana helped pioneer the sleeveless statement - notably when snapped in a black waistcoat, sunkissed arms on display, while on holiday in Barbuda in 1997.She was frequently spotted in halter neck dresses and tank tops, showing off toned nineties triceps in a look that exuded strength and glamour. Today, the look has reappeared thanks to the likes of Jodie Comer and Zendaya. Other celebrities are opting for strapless tube dresses and slinky waistcoats.",
        "Diana's former personal trainer, Jenni Rivett, said that the Princess was 'incredibly dedicated' to their three workout sessions a week at The Harbour Club in Chelsea, which began in 1991.'She knew after every session she would feel amazing,' she told Yahoo News' series The Royal Box.Athleisure looks became one of Diana's trademarks - showing muscular legs in lycra cycling shorts, for example.So did her shoulder and arm-baring outfits, which she adorned for the most glamorous of occasions.Her selection of nineties gowns ranged from floor-length pieces to figure-flattering midi dresses that made a virtue of her arms.",
        "Many were designed by Catherine Walker, including a black halter neck dress, adorned with sequins and finished off with Diana's South Sea pearl earrings to accentuate her bare neck and shoulders.She made a bold statement opting for a midnight blue gown with a plunging neckline by the same designer for the CFDA Awards in 1995.",
        "Accessorising with her show-stopping sapphire choker, Diana slicked back her hair  to reveal her shoulders in  another stunning sleeveless halter neck.After her separation from Charles in 1992, the sleeveless tank dress became a prominent item in Diana's wardrobe.She wowed in a blue midi dress by Jacques Azagury for a performance of Swan Lake at the Royal Albert Hall on 3 June 1997.",
        "The Princess even chose to not wear sleeves for her more relaxed outfits, which still managed to leave an impact.For her renowned trip to Angola in 1997 where she met victims of landmine explosions, Diana changed from a white shirt to a sleeveless blue shirt, for pictures that became definitive of the Princess' work.Diana was a princess who often broke royal protocol with her fashion choices and many of her sartorial looks have been replicated over the years.As the procession of Hollywood stars in waistcoats shows, Diana's arm-baring statements are the latest favourite. "
    ]
}