{
    "articleURL": "/wires/ap/article-12045447/Spains-Juan-Carlos-I-offers-cautionary-tale-Charles-III.html",
    "content": [
        "MADRID (AP) - A playboy past that was once brushed under the carpet, a popular son whose telegenic family threatens to eclipse his own star, and endless leaks about his private life: Spain´s Juan Carlos I can empathize with the lot of Britain´s Charles III.",
        "The former Spanish head of state abdicated in disgrace in 2014. His story serves as a warning for any European royal who wants their achievements on the throne, rather than torrid gossip, to be their lasting legacy.\"What he lives is sex, money and power, the three dimensions of all the problems of humankind,\" said Álvaro de Cózar, an investigative journalist who wrote and directed \"Ex-Rey\" (Ex-King) a popular podcast that delved into the 85-year-old Juan Carlos´ troubled life. \"It´s a very Shakespearean plot.\"The former king has become an object of open hostility in some quarters of Spanish society following his recent second visit home from exile in Abu Dhabi. Gone are the days of a pliant press covering up his long history of affairs and indiscretions, as some even ask whether it is time for Spain's third republic of the past 150 years.Juan Carlos I will not attend Charles III's coronation, the Spanish royal house has confirmed, and a publicly announced lunch with the British monarch last month was quietly dropped.Charles' own family drama also threatens to overshadow the event, with his younger son´s tell-all autobiography crowning decades of tabloid divulgences about his siblings and the difficulties of his own two marriages.",
        "Juan Carlos' relations with the Spanish public began to crack in 2012, when the former patron of the World Wide Fund for Nature injured himself on an elephant hunting trip in Botswana while his subjects back home were living through a full-blown economic crisis.",
        "This was echoed last month with the sudden appearance of a guerrilla statue of Juan Carlos in the Puerta del Sol, a central Madrid square. The metallic likeness of the ex-king portrayed him aiming a rifle at a separate statue of a bear with an apple tree, a traditional symbol of Madrid.\"He is an icon of power,\" sculptor Nicolás Miranda told The Associated Press, saying it was a comment on the impact of where an artwork is displayed. \"In another setting, it could be an homage,\" he added.In 2020, revelations of payouts of more than $100 million to Juan Carlos I from Saudi Arabia, linked to public contracts for Spanish companies, burst onto newspaper front pages and cable news tickers. This forced his son to publicly renounce his inheritance. Swiss and Spanish prosecutors declined to bring any charges against the former monarch.But there was to be no respite from the torrent of bad news. Later that year, Danish socialite and businessperson Corinna Larsen, also known as Corinna zu Sayn-Wittgenstein, sued Juan Carlos in a London court. She alleged he caused her \"great mental pain\" by sending Spanish intelligence agents to spy on her and harass her after their relationship ended.Larsen accompanied the monarch on his fateful 2012 hunting trip, and alleges she received a good chunk of the Saudi payments. The court ruled Juan Carlos was protected by sovereign immunity for events that occurred during his reign.",
        "The waves of revelations complicate life for Felipe VI, who took over in a muted ceremony in 2014 without the presence of other royal families. The antithesis of his exuberant father, the current king is a reserved family man and a former Olympic sailor who speaks five languages. He is tasked with keeping what De Cózar calls the \"disastrous\" Spanish House of Bourbon on the throne, aided by his glamorous wife Queen Letizia, a former TV anchor, and their two teenage daughters, Leonor and Sofía.Due to the exile caused by dictators, republics, civil war and bad behavior in Spain's tumultuous modern history, not a single Spanish monarch has died on home soil since Alfonso XII in 1885.In the years following the Botswana scandal, the Spanish king´s reputation fell so low that the state polling body stopped asking citizens about their perception of the monarchy. Private polls suggest these numbers have recovered somewhat under Felipe VI´s time on the throne.United We Can, the far-left partner in Spain´s governing coalition, called last month for the former king´s likeness to be scrubbed from Spain´s parliament, following a new round of scandal linked to the publication of an upcoming book, \"King Corp.\" Party spokesman Pablo Echenique openly referred to Juan Carlos I as a \"criminal\" who \"stole public money.\" Conserving his portraits in the heart of Spanish democracy would \"humiliate the dignity of the chamber, Echenique argued.",
        "The party is unabashedly republican, though its more centrist Socialist coalition partners are not.It's a precipitous decline for a king so popular that many Spaniards used to say they were \"not monarchists, but Juan Carlists.\" Those who remember him in his younger years recall the key role he had in ensuring Spain's safe transition from decades of authoritarian rule to a modern constitutional monarchy.The former king was groomed by Spanish dictator Francisco Franco to succeed him while the rest of his family lived in exile in Portugal. But when Franco died in 1975, Juan Carlos supported a transition to democracy instead, and he stood firm against an attempted military coup in 1981 that aimed to derail the process.\"He, as the head of state, was the motor of change,\" said William Chislett, an author and expert on Spain who interviewed Juan Carlos I in 1977. \"I think he will go down in the history books as having done the best job he could have done in the circumstances.\"But Chislett recognized that younger people, in Spain, as in the U.K., don't value such past glories in the same way. \"Young people have a different view towards the monarchy than the generation over 50 or 60,\" he said. \"Like the British, the younger generation are not pro-monarchy.\"",
        "While Juan Carlos lives out his sunset years in the Gulf, Charles' head will bear the crown from Saturday. However, both British and Spanish royals alike have struggled with the realities of open public scrutiny - and the bar set by Charles´ mother.\"Queen Elizabeth was the boss of all the royals in Europe. It's a really difficult standard that she established,\" De Cózar said.___This story has been corrected to show that the year when Corinna Larsen began legal proceedings against Juan Carlos I was 2020, not 2021."
    ]
}