{
    "articleURL": "/wires/reuters/article-12042975/GRAINS-Wheat-rallies-tensions-rise-Russia-Ukraine.html",
    "content": [
        "Russia accuses Ukraine of drone attack on Kremlin",
        "Eyes on talks on Black Sea grain export dealRecent rains may not be enough to save U.S. wheat-traders(Recasts, updates prices, adds quotes, changes dateline from previous SINGAPORE/PARIS)By Cassandra GarrisonMEXICO CITY, May 3 (Reuters) - Chicago wheat rebounded on Wednesday after hitting its lowest in 25 months as tensions escalated between Russia and Ukraine, putting in doubt the future of the Black Sea grains deal, analysts said.Corn also gained and soybeans fell as rapidly progressing U.S. planting weighed on prices.Russia accused Ukraine on Wednesday of attacking the Kremlin with drones overnight in a failed attempt to kill President Vladimir Putin.Later, Ukraine President Volodymyr Zelenskiy said Russia did not appear interested in extending theBlack Sea grain deal, but that Kyiv was focused on looking for partners to fulfil the deal and was not looking for Russian interest.Talks were due to be held in Moscow onMay 5, but it was unclear whether all parties were in agreement.\"It's a combo of being oversold, heavily short by the funds, the Russia Ukraine issue escalation, the tactic to negotiate the Black Sea and people coming out and saying the rains that happened in the Plains may not have helped the Kansas City wheat, that the damage is done,\" said Craig Turner, commodities trader at Daniels Trading.",
        "The most-active wheat contract on the Chicago Board of Trade (CBOT) gained 3.86% to $6.32-3/4 a bushel, as of 1002 CDT (1502 GMT), after dropping to its lowest since April 2021 at $6.03-3/4 a bushel earlier in the session.Corn gained 0.73% to $5.84-1/4 a bushel and soybeans gave up 0.73% to $14.00-1/2 a bushel.Favourable weather conditions across top suppliers - the United States, Russia and Europe - are driving hopes of ample supplies in the second half of 2023.Meanwhile, Ukraine'sgrain exports could fall to around 26 million tonnes in the 2023/24 season as harvest has sunk, largely due to Russia's invasion, a senior ministry official said.Commodity funds were net sellers of CBOT grain and soy futures contracts on Tuesday, traders said. (Reporting by Cassandra Garrison in Mexico City, Naveen Thukral; Editing by Sherry Jacob-Phillips, Sohini Goswami, Eileen Soreng and Deepa Babington)"
    ]
}