{
    "articleURL": "/wires/ap/article-12042133/Turkey-closes-airspace-Armenian-flights-monument.html",
    "content": [
        "ANKARA, Turkey (AP) - Turkey has closed its airspace to flights by Armenian aircraft in retaliation for the erection of a monument in the Armenian capital that Ankara says honors people responsible for the killings of Turkish officials, Foreign Minister Mevlut Cavusoglu said Wednesday.",
        "In an interview with NTV television, Cavusoglu warned that Turkey would take further measures if the monument in Yerevan is not removed.The move comes as Turkey and Armenia, which have no diplomatic relations, had been engaged in talks to normalize ties and put decades of acrimony behind. They appointed special envoys who have held several rounds of talks. Their discussions had resulted in an agreement to resume charter flights between Istanbul and Yerevan.The two countries have a more than century-old bitter relationship over the deaths of an estimated 1.5 million Armenians in massacres, deportations and forced marches that began in 1915 in Ottoman Turkey.Historians widely view the event as genocide. Turkey vehemently rejects the label, conceding that many died in that era but insisting that the death toll is inflated and the deaths resulted from civil unrest.Cavusoglu said the monument aimed \"to glorify\" Armenians involved in plans to assassinate Ottoman and Azerbaijani officials in the 1920s and Turkish diplomats in the 1970s and 1980s.\"It is not possible for us to accept this. We can clearly see that their intentions are not good,\" Cavusoglu said.The monument is dedicated to members of \"Operation Nemesis\" - the codename for a covert operation to avenge the killing and deportation of Armenians by Ottoman Empire forces, with seven assassinations carried out by the Armenian Revolutionary Federation between 1920 and 1922.",
        "Operation Nemesis represented \"a record of the fact that throughout history, crimes do not go unpunished regardless of how the international community treats it,\" Yerevan Deputy Mayor Tigran Avinyan told state news agency Armenpress on the April 25 unveiling of the monument, on which the names of 16 Operation Nemesis members are engraved.Armenia´s central aviation committee claimed that it didn't receive official notification from the Turkish side about the airspace closure.Turkey shut down its border with Armenia in 1993, in a show of solidarity with its close ally Azerbaijan, which was locked in a conflict with Armenia over the Nagorno-Karabakh region.In 2020, Turkey strongly backed Azerbaijan in the six-week conflict with Armenia over Nagorno-Karabakh, which ended with a Russia-brokered peace deal that saw Azerbaijan gain control of a significant part of the region.Meanwhile, Armenian parliamentary president Alen Simonyan arrived in Ankara on Wednesday to attend the 30th anniversary of the Parliamentary Assembly of the Black Sea Economic Cooperation. According to Simonyan´s press secretary, the parliamentary president is set to also meet with the president of the Turkish parliament.___Elise Morton contributed to this report from London."
    ]
}