{
    "articleURL": "/sport/othersports/article-12043097/Tori-Bowie-revealed-dreamed-Naomi-Campbell-runway-2018-clip.html",
    "content": [
        "The 32-year-old died on Wednesday though her cause of death is not yet knownTori Bowie was proud of track achievements and described them as 'humbling'DailyMail.com provides all the latest international sports news Tori Bowie opened up on her personal struggles though she defiantly said she would not 'let anything defeat her' in a 2018 interview, adding that her ultimate goal was to be 'up there' with Naomi Campbell on the runway. ",
        "Five years ago, the 32-year-old, who died on Wednesday, told Now This: 'I come from a small town called Sand Hill, Mississippi with no stop lights. Where I come from, I feel like people just don't -- we're not supposed to succeed, just because of where we come from. 'It's been a struggle since day one. My birth mom dropped me off in foster care when I was two years old, so my entire life has been a struggle.'Bowie was taken in by her grandmother as an infant after growing up through foster care. She often played basketball in her childhood days and was not keen on being involved in track until she was in her late teens. Bowie, however, learned the ropes of the sport pretty quickly, even becoming a state champion in the 100, 200 and long jump before going to college at the University of Southern Mississippi.    ",
        "At only 25, the American ran the anchor leg in the women's 4x100 team with fellow compatriots Tianna Bartoletta, Allyson Felix and English Gardner to capture the gold medal at the 2016 Rio de Janeiro Olympics. She also won the silver medal in the 100 meters and bronze in the 200. 'It's amazing hearing because it's something that I always dreamed of, and it's a title that I always wanted so it's humbling,' the athlete said of her success in Brazil, seven years ago. ",
        "'I feel like I have been through so much and I haven't let anything defeat me yet. I feel like I'm a champion in that sense -- not just because of track,' she added.Aside from fulfilling her dream of not only competing but also winning several races  at major international sporting events, such as the Olympics, Bowie had aspirations to take the fashion world by storm. 'I want to be up there with Naomi Campbell on the runway, you know? Taking over the runway as well,' she further told Now This in 2018. 'Not just sports, but taking over the runway, too.' Bowie's cause of death has yet to be revealed. She raced at the 2019 World Championships in Qatar but was not in the US squad for the delayed Tokyo Olympics that took place in 2021. ",
        "Responding to the news, two-time world 200m champion and US record holder Noah Lyles wrote on Twitter: 'This breaks my heart to hear and I will keep the family in my prayers.'Jamaica's three-time Olympic champion Shelly Ann Fraser-Pyrce wrote: 'My heart breaks for the family of Tori Bowie. A great competitor and source of light. Your energy and smile will always be with me. Rest in peace.'International Olympic Committee president Thomas Bach said in a statement on Twitter: '(I am) shocked and deeply saddened to learn of the sudden passing of Olympic gold medalist Tori Bowie.",
        "'In this moment of grief, let me express my heartfelt condolences to her family and friends. The sports world has lost a true champion.'"
    ]
}