{
    "articleURL": "/money/cars/article-12045937/UK-auto-industry-body-cuts-2023-sales-outlook-battery-electric-vehicles.html",
    "content": [
        "The number of new car registrations rose for the ninth month in a row, jumping 11.6 per cent in April from a year earlier, industry figures show.",
        "There were 132,990 new cars registered, according to the Society of Motor Manufacturers and TradersThe number one for registrations in April was the Ford Puma, followed by the Vauxhall Corsa and the Kia Sportage.Meanwhile, the number one seller for the year is the Corsa, with Nissan Qashqai second and Puma third.",
        "The 132,990 registrations compares to 141,583 cars in April 2021 and remains 17.4 per cent down on 2019 volumes.But the SMMT says supply chain pressures are easing and the overall market is now up 16.9 per cent in the first four months compared to 2022 – the best start to a year since the pandemic with growth worth £3.2billion.This in turn has led to an upward revision of the quarterly market outlook, the first positive revision since 2021, with 1.83 million new car registrations expected in 2023, up from 1.79 million forecast in January. That puts expected market growth this year at 13.5 per cent, which would be the best percentage gain since 1983, according to the SMMT.Mark Oakley, director of AA Cars, said: 'After nine straight months of accelerating sales figures, the new car market's extraordinary recovery still has more miles left in the tank.'Thousands of buyers visited forecourts in March, keen to snap up a car with one of the first new registration plates of 2023, and this momentum continued into April as dealers raced to complete customers' orders.",
        "'The big question now is how demand will hold up in the face of stubbornly high inflation and rising interest rates, which make the cost of financing a new car more expensive.'Sales of battery electric vehicles in 2023 are expected to take a hit from inflationary pressures and lack of charging points.The SMMT has downgraded its forecast for battery electric vehicles' (BEVs) market share to 18.4 per cent of sales for the year, from a previous estimate of 19.7 per cent.While SMMT's outlook for BEVs softened, the sector recorded strong performance in April, with year-on-year deliveries of BEVs up 59.1 per cent annually to 20,522 vehicles.Mike Hawes, SMMT chief executive, said: 'The broader economic conditions and charge point anxiety are beginning to cast a cloud over the market´s eagerness to adopt zero emission mobility at the scale and pace needed.'So far in 2023, new car registrations for petrol make up 42.6 per cent of market share, compared to 43.3 per cent last year.Battery electric vehicles make up 15.4 per cent, compared to 14.4 per cent at this point last year.Diesel market share was down to 4.1 per cent from 5.7 per cent in 2022.  ",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}