{
    "articleURL": "/wires/aap/article-12040267/NSW-premier-backs-National-MP-upper-house-president.html",
    "content": [
        "NSW Premier Chris Minns is backing a push to put Nationals MP and friend Ben Franklin in a lucrative role, making passing laws easier for his Labor government.",
        "Mr Minns gave his backing after reports Mr Franklin has \"gone rogue\" and was considering running for president of the parliament's upper house, to the chagrin of Nationals' colleagues.The role would offer a $143,000 pay rise, more staff and reduces the number of crossbenchers the government needs to pass legislation in the upper house, to six.Mr Franklin, known for strong friendships across the parliament, kept mum publicly on Wednesday but was meeting with Nationals colleague Adam Marshall and former Labor MP Adam Searle at a bar near parliament.One of those at the meeting denied the upper house presidency role was discussed.Mr Minns said he would recommend Labor back a non-government member for the role and would personally vote for Mr Franklin. Independent MP Greg Piper is expected to be voted in as speaker of the lower house.\"We don't have majorities in either of those houses,\" the premier told reporters on Wednesday.\"We do have to pick the person who's best able to manage what's a complicated and difficult job.\"The premier and Nationals MP have long been close friends and Mr Franklin is godfather to Mr Minns' son Nicholas.When asked if the appointment was a case of \"jobs for the boys\" the premier urged people to consider the government's decision to back Mr Piper.",
        "\"He smashed Labor candidates in his electorate ... and we chose to support him,\" Mr Minns said.Mr Franklin, a former arts and tourism minister, was left off an interim shadow ministry announced by Opposition Leader Mark Speakman late on Wednesday.Notably, former finance minister Damien Tudehope has been appointed shadow treasurer and former treasurer Matt Kean will be opposition health spokesmanPaul Toole (police, regional NSW), Bronnie Taylor (regional health), Sarah Mitchell (education) and Natalie Ward (roads) have stuck with roles they held in the former Perrottet government.Alister Henskens will be shadow attorney-general and manage opposition business in the lower house.\"We will continue to fight for NSW families and businesses, to ensure they have the economic settings and support to succeed and prosper, and weather the current cost-of-living challenges,\" Mr Speakman said.\"We will make sure that the Labor government is held to account and doesn't compromise our economic security to satisfy the demands of union bosses.\"Mr Speakman is expected to announce a full ministry after the Liberal party room votes on whether to allow Ms Ward to run for the deputy leadership.Upper house Liberal MPs are currently banned from taking the position. Overturning the rule requires a two-thirds majority."
    ]
}