{
    "articleURL": "/news/article-12056195/Tory-deputy-chair-Lee-Anderson-tells-republican-protesters-emigrate.html",
    "content": [
        "Tories have lined up behind the police's tough response to anti-monarchy protests at the coronation.",
        "Amid anger at attempts to disrupt the historic day, the party's deputy chairman Lee Anderson told demonstrators to 'emigrate' if they did not like the UK's system.And Culture Secretary Lucy Frazer insisted that police got the 'balance right' to stop Britain being embarrassed on the 'world stage'.  Scotland Yard has faced a backlash after more than 50 people were arrested for alleged affray, public nuisance and breach-of-the-peace offences.The force said it received information that protesters were 'determined to disrupt' the Coronation procession - including defacing public monuments with paint, breaching barriers and disrupting official movements. Three were reportedly detained over a plot to throw rape alarms at horses.But human rights organisations branded the action 'a dangerous precedent for us as a democratic nation'.",
        "In a furious retort to the protesters on Twitter yesterday, Mr Anderson wrote: 'Not My King?'If you do not wish to live in a country that has a monarchy the solution is not to turn up with your silly boards.'The solution is to emigrate.'Asked whether police had gone too far, Ms Frazer told Sky News' Sophy Ridge On Sunday programme: 'No. The police are operationally independent from Government.'What they had to do was to police an international event on the world stage and I think they took that into account in their policing.",
        "'What they have to do is balance the right to protest, which is important in a democracy. At the same time there's the right of all those other people to enjoy what was a fabulous day.'I think, overall, they managed to get that balance right.'Home Secretary Suella Braverman has also praised the police, saying she was 'incredibly grateful' for all their 'hard work'.Shadow health secretary Wes Streeting told the BBC's Laura Kuenssberg on Sunday programme that he would 'wait and see' whether the police had struck the right balance.He said while he did not agree with the views of the anti-monarchists it was 'legitimate' for them to protest. Shadow home office minister Jess Phillips tweeted: 'Our nation and our King is not so fragile as to not be able to take harmless protest of a different view.'Among those arrested was Patrick Thelwell - who tried to egg the King in a visit to York on November 9 last year.",
        "The 23-year-old was convicted of threatening behaviour at York magistrates court last month and sentenced to a 12-month community order with 100 hours of unpaid work and ordered to pay £600 in court costs.He said he was arrested yesterday 'on suspicion of carrying eggs'. Protesters from the anti-monarchy group Republic, including its chief executive Graham Smith, were apprehended during the day - as well as demonstrators from Just Stop Oil and Animal Rising.",
        "Smith, who is now out of prison, declared the arrests show 'there is no longer a right to peaceful protest in the UK.'He continued: 'I have been told many times the monarch is there to defend our freedoms. Now our freedoms are under attack in his name.'Mr Anderson recently clashed with Metropolitan Police Commissioner Sir Mark Rowley over the force's handling of protests, telling him to 'leave his ivory tower' to deal with demonstrators in Westminster.Under the controversial new Public Order Act, protesters who have an object with the intention of using it to 'lock on' are liable to a fine, with those who block roads facing 12 months in prison."
    ]
}