{
    "articleURL": "/wires/ap/article-12042999/Rays-acquire-minor-league-RHP-Anderson-Reds-cash.html",
    "content": [
        "ST. PETERSBURG, Fla. (AP) - The Tampa Bay Rays acquired right-hander Chase Anderson from the Cincinnati Reds on Wednesday in a minor league deal for cash.",
        "The Rays later selected Anderson's contract to the major league roster. Tampa Bay also placed closer Pete Fairbanks on the 15-day injured list with right forearm inflammation and designated right-hander Zack Burdi for assignment.Anderson went three scoreless inning in relief of MLB's first six-game winner, Shane McClanahan, to get his first major league save in the Rays' 8-1 win over the Pittsburgh Pirates.The 35-year-old Anderson went 2-1 with a 4.30 ERA in five starts this season for Triple-A Louisville. He had been scheduled to start Wednesday's game at Omaha.\"It's an 11 a.m. game, so I'm glad I missed it,\" Anderson said with a smile. \"It worked out good.\"Fairbanks said the issue with his arm is near the wrist. It's a separate problem from a recurrence of Raynaud's syndrome that forced him out of a game Friday night against the Chicago White Sox with finger numbness.",
        "Raynaud's can affect blood flow to the hand and fingers in cold weather. Fairbanks' medication has been adjusted to address it.\"It's something that's not bouncing back to the extent I expected it to,\" Fairbanks said of his forearm injury. \"Nothing towards the elbow. Not feeling exactly right towards the end of the delivery.\"Rays manager Kevin Cash expects Fairbanks to miss only a couple of weeks.",
        "Anderson was informed about the deal late Tuesday and got up around 4:30 a.m. for a flight out of Omaha, with a layover in Atlanta. He arrived at Tropicana at about 2 p.m.Anderson last pitched in the majors last season, going 2-4 with a 6.38 ERA in nine appearances, including seven starts for the Reds. Over parts of nine big leagues seasons, he is 58-50 and has a 4.25 ERA in 199 appearances.\"A veteran guy that had a pretty busy travel day,\" Cash said. \"He's got a lot of pitches. He'll just cover us in any capacity in the bullpen.\"His best season came in 2017 with Milwaukee, posting a 12-4 record.Anderson spent a month with the Rays' Triple-A Durham club in 2022. He was assigned there on July 26, with nine of 10 outings coming out of the bullpen, including one of his four minor league saves. TThe Reds signed Anderson to a minor league deal last Aug. 27, two days after being released by Durham.Tampa Bay left-hander Josh Fleming, who left Tuesday's game against Pittsburgh after getting hit on the left foot by Ke'Byran's Hayes hard-hit infield single, had an MRI exam and CT scan on Wednesday, and both were negative. He hopes to play catch on Thursday.",
        "\"When I put a lot of pressure on my heel, I feel it more,\" Fleming said. \"It's truly day to day. Hopefully I don't have to miss my next outing. We'll see.\"Cash said it will be a couple of days before Fleming's status will be determined.Rays starter Tyler Glasnow, who hasn't pitched this season because of a left oblique strain, is scheduled to pitch Friday for Durham. He is expected to make several minor league appearances before rejoining the Rays.___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}