{
    "articleURL": "/wires/reuters/article-12050485/Shares-waver-rate-pause-bets-Apple-earnings-clash-U-S-bank-rout.html",
    "content": [
        "US futures rise as markets eye Fed summer rate cuts, Apple earnings",
        "Dollar set for seventh weekly decline of last eight weeksUS jobs growth expected to have slowed last month(Updates comment on U.S banks and economy)By Naomi RovnickLONDON, May 5 (Reuters) - Global stocks hovered in a tight range on Friday, still on course for a weekly loss, as investors balanced bets of central banks pausing rate increases with the latest rout in shares of U.S. regional lenders.MSCI's broad index of global equities edged 0.1% higher following a four-day losing streak, while Europe's Stoxx 600 share index rose 0.2%.The mood on Wall Street appeared rosier, with futures contracts on the benchmark S&amp;amp;P 500 share index adding 0.5% following better than expected earnings from Apple Inc .Contracts on the tech-heavy Nasdaq 100 gained 0.6%, although analysts warned all this could change if U.S. jobs data were stronger than expected, complicating the Federal Reserve's job of soothing banking sector worries while battling still-high inflation.On Thursday, Los Angeles-based PacWest Bancorp's said it was exploring a sale, deepening falls for U.S. regional banking stocks.Shares in this troubled sector have dropped 11.5% this week, following the collapse of First Republic Bank over the weekend that renewed fears of a financial sector crisis.Markets are pricing for the Fed, which raised its main funds rate by 25 basis points (bps) to a range of 5%-5.25% on Wednesday, to pause at its next meeting in June and begin rate cuts from July.",
        "\"There will be concerns about credit quality and how that ripples through the banking system,\" said Gerry Fowler, head of European equity strategy at UBS.The Fed's recent hiking cycle, started early last year, has been its most aggressive since the 1980. Bets of a pause have risen since the collapse of Californian lender Silicon Valley Bank in March.\"The time-frame for monetary policy (tightening) to impact the economy is around 16 months,\" Fowler said. \"We're only just entering the phase where monetary policy is having its maximum impact.\"Later on Friday, the U.S. non-farm payrolls report for April is expected to show the slowest jobs growth in almost 2-1/2 years. Economists polled by Reuters expect to see that U.S. employers added 180,000 new workers, in the smallest gain since December 2020, with the unemployment rate edging up to a still historically low 3.6%.\"We think further (rate) hikes are off the table,\" said Emmanuel Cau, head of European equity strategy at Barclays. But he cautioned that only a \"quick drop in inflation\" or a \"sharp weakening\" of economic growth would lead the Fed to start cutting borrowing costs.In government debt markets, U.S. Treasuries pared back some price gains after a strong performance all week. The yield on the two-year Treasury note &amp;lt;US2YT-RR&gt;, which tracks interest rate expectations, added 10 bps to 3.823%. The benchmark 10-year Treasury yield, which sets the tone for borrowing costs and asset pricing worldwide, was 5 bps higher at 3.4%. Bond yields move inversely to prices.",
        "Germany's 10-year bund yield, which reflects euro zone borrowing rates, rose 6 bps to 2.26% after falling for three straight sessions.The European Central Bank raised its main deposit rate for the seventh time in this cycle on Thursday, to 3.25%, but markets pared back bets of how long it would continue hiking in its fight against high inflation.Against a basket of currencies, the dollar eased 0.1%, heading for its seventh weekly decline out of the last eight weeks.Sterling was last trading at $1.261, up 0.3% on the day, while the euro firmed 0.1% to $1.1027.Spot gold was at $2,037.58 an ounce, not far from its all-time high of $2,072.49.Brent was at $73.75, up 1.7% on the day.(Reporting by Naomi Rovnick. Additional reporting by Ankur Banarjee in Singapore. Editing by Jacqueline Wong, Robert Birsel and Keith Weir)"
    ]
}