{
    "articleURL": "/tvshowbiz/article-12052075/Singer-pulls-King-Charles-Coronation-concert-minute.html",
    "content": [
        "Freya Ridings has pulled out of the Coronation Concert 'due to being unwell', the BBC has announced.",
        "The Lost Without You singer, 29, was supposed to perform a duet with classical-soul composer Alexis Ffrench during the concert on Sunday to celebrate the crowning of the King and Queen Consort.The BBC has said she will be replaced by British singer-songwriter Zak Abel, who has collaborated with Gorgon City, Kygo and Tom Misch in the past.The 28-year-old said: 'I am honoured and overwhelmed to be included in the Coronation celebrations.'To have the opportunity to be part of such a historic moment is something I will forever be humbled by and will never forget.'",
        "In a statement, the broadcaster said: 'The BBC has announced that British singer-songwriter Zak Abel is stepping in to perform at Sunday's Coronation Concert at Windsor Castle, replacing Freya Ridings, who has had to pull out, due to being unwell and therefore unable to perform.'Having being diagnosed with otosclerosis, overgrowth and brittleness of the stapes bone in the ear, which can lead to hearing loss, when he was just 21, Zak has overcome a number of hurdles in order to achieve success in the competitive world of music, which has led him to the opportunity to perform at this once in a lifetime event.'Abel joins a star-studded line-up which includes Take That, Katy Perry and Lionel Richie, as well as including Italian opera singer Andrea Bocelli and Welsh bass-baritone Sir Bryn Terfel.",
        "The event, which will take place on Sunday in the grounds of Windsor Castle, will be in front of a crowd of 20,000 members of the public and invited guests and broadcast across BBC television and radio stations.As a special honour in return for her performance, Katy will be allowed an exclusive stay in the royal residence of the 1,000-year-old castle.Lionel is also set to perform, with the legendary singer admitting that the offer came as a shock to him.He recently shared: 'I mean, you don't get in the business and say, \"You know what? I'll be at the King's Coronation.\" You know, that just never comes up.'[It's] A, a surprise. B, what an honour. And C, the fact of all the names that are out there that he could have had for this, he called my name.' ",
        "A number of choir groups will also join forces as an official coronation choir, including refugee, NHS and LGBTQ+ singing groups.According to the BBC, the concert will 'celebrate a new chapter in the nation's history' and will have 'themes of love, respect and optimism' while celebrating the 'four nations' and the Commonwealth.Landmarks and locations around the UK will also be lit up with lasers, drone displays and illuminations, the BBC said last week while announcing the celebration line-up.",
        "Charlotte Moore, BBC chief content officer, said: 'We have a world-class line-up of performers to look forward to for what promises to be a very special night of celebration and entertainment.'"
    ]
}