{
    "articleURL": "/tvshowbiz/article-12040095/Kylie-Jenner-glams-attend-Jean-Paul-Gaultier-launch-party-NYC-daughter-Stormi-Webster.html",
    "content": [
        "Despite attending the Met Gala the day before, Kylie Jenner showed no signs of slowing down as she glammed up for another fashion event in Midtown Manhattan on Tuesday.",
        "The 25-year-old Kylie Cosmetics CEO was joined by her adorable daughter Stormi, five, as they strolled hand in hand out of The Ritz-Carlton hotel. Opting for complementary colourful ensembles, all eyes were on the pair as they headed to the Jean Paul Gaultier x The Webster launch of the ready-to-wear Flowers Collection, which drops Friday at noon. The mother-of-two fronted the French luxury house's latest campaign, which was photographed by Elizaveta Porodina and creative directed by Florence Tétier. Kylie - who relies on stylist Jill Jacobs - flashed her bra and corset beneath a sheer Jean Paul Gaultier floral frock and white ankle-strap heels.",
        "Hairstylist Jesus Guerrero coiffed Kylie's updo and make-up artist Ariel Tejada fully contoured her complexion and applied her glossy pout. Little Stormi - who Kylie shares with Travis Scott - was equally colorful in her ruched long-sleeve top and floral leggings, which she paired with white low-top sneakers.Kylie is also mother to 15-month-old son Aire during her on/off five-year relationship with 32-year-old Travis (born Jacques Webster), which ended in December. The Kardashians star made sure to tag Jean Paul Gaultier guest designer Haider Ackermann, whose best friend/collaborator just so happens to be her rumored flame, Oscar nominee Timothée Chalamet.There have been unconfirmed reports that Kylie and Timothée, 25, met as far back as 2019 at Nobu Malibu before ringing in the New Year in Aspen, attending Paris Fashion Week in January, and dining on Tito's Tacos in LA as recent as April 14.",
        "Also joining Kylie at the soirée was her momager Kris Jenner, 67, who brought along her toyboy Corey Gamble, 42.The  grandmother-of-12 opted for a monochromatic pastel yellow ensemble and snakeskin purse while her former tour manager boyfriend donned a white suit over a grey shirt.",
        "Kris (born Kristen Houghton) reportedly met Corey in August 2014 while attending Riccardo Tisci's 40th birthday bash in Ibiza hosted by her former son-in-law Kanye West.Just one month later, Jenner decided to file for divorce from Kylie's father - two-time Olympic gold medalist Caitlyn Jenner - after 22 years of marriage.On Monday night, Kylie was denied entrance to Diddy, Doja Cat, and Richie Akiva's Met Gala after-party at the Box because it was 'over capacity' - according to Page Six.Celebrities who were not turned away from the bash included Gisele Bündchen, Emily Ratajkowski, Mary J. Blige, Lil Nas X, Paris Hilton, Naomi Campbell, Jared Leto, Chris Rock, and Teyana Taylor.Kylie and her famous family will next compete for the best docu-reality show trophy at the 2023 MTV Movie &amp; TV Awards, which air next Sunday.The Kardashians face heavy competition against Jersey Shore: Family Vacation, The Real Housewives of Beverly Hills, Family Reunion: Love &amp; Hip Hop Edition, and Vanderpump Rules.",
        "In the trailer for season three - premiering May 25 on Hulu - the Kylie Skin CEO surprisingly told her sisters: 'All of us just need to have a bigger conversation about the beauty standards that we’re setting.'Kylie - who's only ever admitted to having lip fillers - cryptically said she didn't want her daughter 'to do the things I did' seemingly to adapt the same hip and rear-boosting tactics as her half-sisters Kim and Khloé Kardashian.",
        "Jenner - who's also an executive producer - admitted to her similarly-enhanced gal pal Anastasia 'Stassie' Karanikolaou in the preview: 'I wish I'd never touched anything to begin with.' The Sierra Canyon School alum told Homme Girls on April 18 that her precious princess Stormi is 'perfect the way that she is' and would only advise her to 'always be confident in herself.''I think a big misconception about me is that I've had so much surgery on my face and that I was some insecure person, and I really wasn't!' Kylie told the mag.'Yeah, I love full lips and wanted full lips, but growing up I was always the most confident person in the room. I was the girl performing for everyone. I had my one lip insecurity thing, so I got lip filler, and it was the best thing I've ever done. I don't regret it. But I always thought I was cute.'"
    ]
}