{
    "articleURL": "/health/article-12052167/Everything-need-know-weight-loss-drugs-Ozempic-Wegovy.html",
    "content": [
        "Game-changing drugs have helped people lose about 15% of their bodyweight More than 5 million prescriptions for the drugs were doled out in 2022 alone READ MORE: The VERY bizarre (and scary) side effects of top weight loss drugsAnti-obesity drugs could be the pharmaceutical industry’s biggest golden ticket yet - with analysts forecasting over $100 billion in profits in the coming decade. ",
        "An estimated one in 60 US adults currently has a prescription for one of the industry’s breakout stars — Wegovy, Ozempic, or Mounjaro. Those figures are only growing too, with Mounjaro seeking regulatory approval as a weight loss drug and Wegovy manufacturer Novo Nordisk announcing last week it would have to start rationing the drug to cope with rocketing demand.Already an estimated 40 percent of American adults are obese — which qualifies them for one of the blockbuster drugs — and the majority of us are projected to be too fat by 2030, expanding the market even further.The active ingredients in the drugs mimic the actions of hormones in the brain that govern appetite and feelings of fullness, which can help people cut the number of calories they consume. So, what do they cost, who qualifies for them, and how successful are they? DailyMail.com breaks it all down:",
        "How many people are taking them?Wegovy and its sister drug Ozempic, which is approved to manage type II diabetes but prescribed off-label for obesity, have taken the US by storm in recent years.In 2022, more than five million prescriptions for Ozempic, Mounjaro, Rybelsus (for another Novo drug that uses semaglutide), or Wegovy were written for weight management.This is compared with just over 230,000 in 2019 — an increase of more than 2,000 percent over three years.",
        "Among the bevy of effective weight loss medications currently on the market, the Danish Novo's Wegovy is the only one approved specifically to treat obesity.Already in 2023, doctors have doled out more than 832,700 prescriptions for Wegovy.",
        "The company said this week that it would halve the supply of starter doses of Wegovy in the US market as demand outpaces the company’s manufacturing capacity.Novo said: ‘These trends indicate that demand for Wegovy in the US will exceed our current supply capacity… We anticipate that many patients will have difficulty filling Wegovy prescriptions at these doses through September.’How do they work?Wegovy and Ozempic are the same medication – semaglutide – but they are not interchangeable.Wegovy is a higher-dose version that’s approved for weight loss in people who have a body mass index of at least 30, or in overweight people with a BMI of 27 or greater, who also have a weight-related medical condition.Ozempic is approved to treat Type 2 diabetes, but it is being prescribed 'off-label' for obesity. Semaglutide spurs weight loss by mimicking the actions of GLP-1, or glucagon-like peptide-1, a hormone in the brain that regulates appetite and feelings of satiety.",
        "Mounjaro, developed by Eli Lilly which uses the active drug tirzepatide, has risen as Wegovy's top competitor. ",
        "In clinical studies, Mounjaro was shown to be marginally more effective at spurring weight loss than Wegovy.The drug is similar to its competitors but works slightly differently. In addition to working on GLP-1 receptors, it works on the hormone glucose-dependent insulinotropic polypeptide (GIP), which compounds the positive effects.Both hormones help curb food cravings make a person feel full for longer after they eat. Overweight people who took Mounjaro weekly, and adopted a healthier lifestyle, lost 34lbs (15.6kg), on average, over 72 weeks. This was the equivalent of around 16 percent of their body weight.In comparison, patients who stuck to just diet and exercise only lost 3.3 percent of their weight.People prescribed weekly Wegovy injections start out at a dose of 0.25 mg once a week, increasing the dose every four weeks until you reach the full 2.4 mg dose.Mounjaro patients will typically start with a 2.5 mg-dose injection once per week for four weeks. Then, their doctor may bump up the dose by another 2.5 mg every four weeks until the patient begins noticing results. The highest dose of Mounjaro that has been studied is 15 mg, so that will likely be the maximum dose a doctor will prescribe. How much do they cost?The wildly popular medications mark a seismic win in the field of weight and obesity research.",
        "It comes while society is increasingly adopting an acceptance of obesity as a medical condition rather than a failure of one’s willpower or dedication to certain ‘healthy’ lifestyle choices.",
        "NovoNordisk, the maker of Ozempic and Wegovy, said it will ration the popular weight-loss drugs to cope with demand. ",
        "But access to drugs is not equal, and the cost is prohibitive for millions of people who would benefit from them.Wegovy and Ozempic are weekly injections that cost a little more than $1,300 per package, which breaks down to nearly $270 per week or about $16,190 per year. The price of Mounjaro is similar, hovering around $1,087 for a supply of 2 milligrams.Insurance coverage would typically make a sizable dent in the amount a patient would have to pay for medication.However, most major healthcare payers have not added the obesity medicines to their formularies yet, meaning millions of people will have to pay in cash.The lack of uniform insurance coverage or means of alleviating some of the cost burdens means many Americans who would benefit from the medications — roughly 40 percent of adults who are classified as obese ; will get them.Dr Shauna Levy, an obesity medicine specialist at Tulane University, in New Orleans, told DailyMail.com: ‘People who can only go through their insurance have limited access to weight loss medications. A minority of employer-based insurance plans cover anti-obesity medication, so it's a really tricky thing.",
        "‘When you're like, Okay, well, I know these diet programs don't work. I understand that now. But I also don't have access to medication because I can't pay for it. So it's even more discouraging for a certain portion of the population.’What are the side effects?",
        "Nothing good ever comes for free, and that includes groundbreaking medications to treat obesity.The most common adverse effect of semaglutide and tirzepatide are stomach issues— primarily nausea, vomiting, and diarrhea.There have also been reports of more startling adverse effects such as feeling repulsed by your favorite foods, having vivid or even disturbing dreams, tasting metal, and hair loss.For instance, Staci Rice, 40, a marketing professional from Georgia, lost nearly 50 pounds when she went onto Ozempic.While she can now fit into jeans she last wore 16 years ago,  she was surprised to find that she had developed an aversion to ground beef and Chick-fil-A while on the drug.An American TikToker who lost 60lbs while on Ozempic claims her hairline has receded so much she now has to cover it with makeup.Meanwhile, Jamie Walters, 35, from the US said she had the 'most gross metal taste ever' in her mouth one morning when she woke up.",
        "Experts say the condition may be because the drug is affecting the mouth's taste receptors.",
        "And some users are complaining of an effect that has been playfully dubbed 'Ozempic face' and 'Ozempic body'. It is caused by rapid weight loss that happens so quickly that the skin does not have time to adjust to the new body size. As a result, it hangs down in folds.Dr Simon Ourian, a cosmetic dermatologist in Beverly Hills, California, revealed the effect, saying: 'If you lose a lot of weight quickly, your skin gets saggy, everything from the face to the buttocks is deflated.'Many successful users of one of the drugs are also likely aware of the belief that stopping the injections will lead to the weight piling back on, likely because they have not addressed the underlying issues driving their overeating.A study by the University of Liverpool, in the UK, published in April found that patients who used Wegovy dropped 18 percent of their body weight in 68 weeks.But, after dropping the weekly injections, the 336 users included in the trial would put back on two-thirds of the weight within the next year. Chinese researchers published a report earlier this year warning the drugs may cause a person's small intestine to become enlarged, which puts them at high risk of a potentially deadly obstruction in their digestive system.In experiments performed on mice, the enlargement of the intestine occurred at around 20 months of taking GLP-1 drugs. The team points out that clinical trials for Wegovy only went up to 16 months, meaning this significant long-term side-effect may have been missed. And in some cases, Mounjaro has been linked to thyroid cancer. The European Medicines Agency (EMA) said research on rodents has suggested the artificial hormones packaged in tirzepatide could raise the risk of medullary thyroid cancer.As such, it has ruled that a monitoring study of patients taking the drug is required to explore the potential of a raised cancer risk in humans.How much does Big Pharma stand to gain?  In short, billions. The nascent obesity medication industry is growing fast, and analysts at Barclays estimate it could be worth as much as $200 billion within the next decade. Novo Nordisk owns a staggering majority — 94 percent — of the branded obesity medicine market in the US.The weekly Wegovy injections have proven so popular that Novo has struggled to keep up a consistent supply as weekly prescriptions being doled out has surpassed 108,000.Novo's value has soared to 2.3trillion Danish kroner ($336billion), making it Europe’s second-most valuable company. It has even knocked the 160-year-old Swiss conglomerate Nestle into third place. Its market value has more than doubled since the debut of Wegovy in 2021. Eli Lilly, the maker of Mounjaro, is also staking out its position in the obesity drug space. According to analysts at Morgan Stanley Research, Lilly's tirzepatide, assuming it clinches the green light from the FDA — could make around $5.4 billion by 2030. For Novo, obesity revenues are projected to exceed $11 billion in 2030. The massive windfall brought on by the blockbuster fat loss drugs resembles those enjoyed by Pfizer-BioNTech and Moderna in the wake of debuting groundbreaking Covid-19 vaccines. But as the pandemic has ebbed and the enthusiasm for still more booster doses has waned, those profit margins are expected to shrink. Pfizer sold $37.8 billion of its Covid vaccine in 2022, up just slightly from the year before. Moderna brought in about $18.4 billion in 2022 and projects about $5 billion in 2023. While leading authorities indicate that the pandemic is on its way out, obesity is not. The problem will remain for years to come, all while people are having more frank discussions with their doctors about difficulties with overweightness. Dr Levy told DailyMail.com: 'Obesity has never been so hot. Everybody's talking about it, and so it gives people like me the opportunity to educate the public. I see in the people around me. They're asking more questions, they're more interested, and it isn't so taboo, hush-hush.' The development of the once-a-week injections has facilitated a cultural shift in the way that society views obesity, increasingly seeing it as a medical disease and an urgent public health threat rather than the result of laziness or lack of discipline. "
    ]
}