{
    "articleURL": "/tvshowbiz/article-12050333/Ed-Sheerans-new-album-Subtract-reveals-depths-depression.html",
    "content": [
        "Ed Sheeran's sixth album Subtract was released on Friday to extremely positive reviews.",
        "The lyrics give an insight into the depression and grief he has experienced in the last two years after the loss of his close friend Jamal Edwards, his wife Cherry Seaborn's health woes and a plagiarism court case. In a recent interview Ed said the collection of new songs was a 'trapdoor into his soul' with many of the lyrics using maritime metaphors to explain his depression. Highlights include his song Eyes Closed where in the music video he turns his grief into a huge blue monster.Ed sadly lost his best friend Jamal last February. He was just 31 years of age when he passed from cardiac arrest from alcohol and cocaine abuse.",
        "The Eyes Closed chorus includes lines such as: 'Every song reminds me you're gone, and I feel the lump form in my throat coz I'm here alone.'As well as losing Jamal, his wife Cherry was diagnosed with a cancerous tumour when she was pregnant with their second child and was told she couldn't have surgery on it until she gave birth.Elsewhere he was involved in a copyright lawsuit over one of his songs. He broke down in tears after a jury found his hit song Thinking Out Loud did not copy Marvin Gaye's classic Let's Get It On on Thursday. ",
        "Another song Boat delves further into his depression as he sings about 'not knowing if his scars will heal'. A different track Life Goes On uses more water metaphors as he describes his mental health struggles as like 'waves tumbling down around him'. Next, in another song Vega the same theme continues as he describes feeling like he is 'fighting the tide' Dusty further examines how he processed his pain as he tells how amid personal turmoil he felt like he was 'lost in a stormy ocean'.Another track Life Goes On describes how he felt like he had been 'hit by a train' as he battled numerous difficulties. In a slight change of theme End Of Youth then goes to detail how he has grappled with the realities of adulthood.",
        "It includes lyrics such as: 'It's been a long year and we're not even halfway there... I guess it's all part of life, but I can't help feel low.'No Strings adds a level of optimism as he sings that: 'If we make it through this year, then nothing can break us'. The reviews for the new album have been overwhelmingly positive, with the Daily Mail giving it four stars and noting in particular the 'real emotional punch' that it packs.",
        "The Guardian also gushed over the album, giving it four stars and branding it easily 'his best ever album'. The Independent gave it three stars and said it 'includes some beautifully pared-back musicianship, and Sheeran at his most vulnerable'.Elsewhere The Telegraph gave it a raving five-star review saying it was a 'raw, powerful balm for suffering souls'.Similar to The Guardian they added: 'Inspired by his depression, Sheeran has made his best album yet'.NME gave the album three stars.They said: 'For an artist initially pegged as an acoustic troubadour - albeit one with a foot in the g​​rime world - Ed Sheeran has displayed an impressive ability to expand and remodel his sound.'",
        "The i gave it four stars, saying that on a record that 'chronicles the hardest time in his life, Sheeran finally ditches the formula and engages with real emotion'. It comes after on Thursday Ed broke down in tears after a jury found his hit song Thinking Out Loud did not copy Marvin Gaye's classic 'Let's Get It On'.As the jury at Manhattan federal court cleared Sheeran, 32, of infringing copyright, he briefly put his hands over his face in relief before standing and hugging his lawyer.His co-writer Amy Wadge said she and Sheeran 'had a few tears' of relief after winning the $100million case.",
        "The Daily MailRating:- 'Most of these songs pack real emotional punch'The GuardianRating:- 'Easily his best album' The IndependentRating:- 'It includes some beautifully pared-back musicianship, and Sheeran at his most vulnerable' The TelegraphRating:- 'A raw, powerful balm for suffering souls'NME Rating:- 'Ed Sheeran has displayed an impressive ability to expand and remodel his sound' The iRating:- 'On a record that chronicles the hardest time in his life, Sheeran finally ditches the formula and engages with real emotion'",
        "Speaking outside the court, Sheeran said: 'I'm just a guy with a guitar who loves writing music for people to enjoy. I am not and will not allow myself to be a piggy bank.'Sheeran vehemently denied allegations that his song stole fundamental musical elements from Gaye's song. The singer had staked his whole career on the case, vowing that he would be 'done' with music if found guilty.Sheeran added: 'I'm obviously very happy with the outcome of the case and it looks like I'm not having to retire from my day job after all.'At the same time I'm unbelievably frustrated that baseless claims like this are allowed to go to court at all.'We've spent the last eight years talking about two songs with dramatically different lyrics, melodies and four chords which are also different and used by songwriters every day all over the world.",
        "'These chords are common building blocks which were used to create music long before Let's Get It On was written and will be used to create music long after we are all gone.'They are in a songwriter's alphabet, our toolkit, and should be there for all of us to use.'No one owns them or the way they are played, in the same way that no one owns the color blue.'He added that if the verdict had gone the other way 'we might as well say goodbye to the creative freedom of songwriters' and that artists need to be able to create original music 'without worrying at every step on the way that said creativity will be wrongly called into question'.'It is devastating to be accused of stealing someone else's song when we put so much work into our livelihoods,' he added.The singer also said he missed his grandmother's funeral in Ireland because of the trial, and that he 'won't get that time back'.Juror Sophia Neis, 23, said a key factor in swaying the verdict Sheeran's way was his performance of the song during the trial.'It's obviously cool to have anyone play music in front of you live,' Neis said. 'So that was an interesting surprise decision because you're comparing music to a sheet. But it was very cool to hear Sheeran play in court.'",
        "The lawsuit was brought by the heirs of Gaye's co-writer, Ed Townsend.His attorney, Ben Crump, told jurors at the start of the trial that Sheeran himself sometimes performed the two songs together.The jury saw video of a concert in Switzerland in which Sheeran can be heard segueing on stage between 'Let's Get It On' and 'Thinking Out Loud.' Crump said that was 'smoking gun' proof he stole from the famous tune.When Sheeran testified, he repeatedly picked up a guitar resting behind him on the witness stand to demonstrate how he seamlessly creates 'mashups' of songs during concerts to 'spice it up a bit' for his sizeable crowds.In closing arguments, Sheeran's lawyer Ilene Farkas said similarities in the chord progressions and rhythms of Marvin Gaye's Let's Get it On and Sheeran's Thinking Out Loud were 'the letters of the alphabet of music'.She added: 'These are basic musical building blocks that songwriters now and forever must be free to use, or all of us who love music will be poorer for it.'Jurors were sent home shortly after closing arguments Wednesday and returned Thursday morning to deliberate.Keisha Rice, who represents Townsend's heirs, said her clients were not claiming to own basic musical elements but rather 'the way in which these common elements were uniquely combined'.'Mr Sheeran is counting on you to be very, very overwhelmed by his commercial success,' she said, urging jurors to use their 'common sense' to decide whether the songs are similar.Lawyers for Townsend's heirs have not responded to a request for comment after the verdict.Their defeat means they may have to pay Sheeran a 'reasonable sum' to cover his legal fees, which intellectual property lawyer Mike Gilbert said would likely be a seven-figure sum due to the length of the case.As jurors left the courtroom Thursday, Sheeran quietly mouthed 'thank you' in their direction. He then spoke for about 10 minutes with the plaintiffs, including the daughter of Ed Townsend, who co-created the 1973 soul classic with Gaye. They hugged and smiled with each other.Sheeran said before the verdict that if he had lost the $100million suit, it could be the end of his music career.'If that happens, I'm done, I'm stopping,' Sheeran said when asked during the trial about the toll the case has taken.He added: 'I find it really insulting to devote my whole life to being a performer and a songwriter and have someone diminish it.'Townsend's heirs in 2017 sued Sheeran, his label Warner Music Group and his music publisher Sony Music Publishing, claiming infringement of their copyright interest in the Gaye song.Sheeran and Wadge both testified during the trial that they did not copy 'Let's Get It On'. Sheeran said he had only passing familiarity with the song and that 'Thinking Out Loud' was inspired by Irish musician Van Morrison.Wadge told CNN the verdict was 'the most unbelievable relief and like seven years of stress just leaving my body', adding that she and Sheeran 'had a few tears'.'I think it even goes beyond music and the idea that it just comes down to the building blocks of anything — if it was a painting or a film — and for a musician who has just relied upon very little musical knowledge for my whole career, it was terrifying to even contemplate that this could even happen,' she said.",
        "Gaye, who died in 1984, collaborated with Townsend, who died in 2003, to write 'Let's Get It On,' which topped the Billboard charts in 1973. 'Thinking Out Loud' peaked at No. 2 on the Billboard Hot 100 in 2015.Sheeran is also facing claims over Thinking Out Loud in the same court from a company owned by investment banker David Pullman that holds copyright interests in the Gaye song.Sheeran won a trial in London last year in a separate copyright case over his hit 'Shape of You'.Gaye's heirs in 2015 won a $5.3million judgment from a lawsuit claiming the Robin Thicke and Pharrell Williams song 'Blurred Lines' copied Gaye's 'Got to Give It Up.'"
    ]
}