{
    "articleURL": "/tvshowbiz/article-12059749/Heartland-actor-Aidan-Moreno-believes-gay-guy-play-gay-characters.html",
    "content": [
        "Aidan Moreno believes straight actors should 'step aside and let the gay and trans community represent themselves'. ",
        "The actor, who plays the first LGBTQ+ character Rick on the hit Netflix show Heartland, said he doesn't think it is 'authentic' for a show to have a straight individual play a gay role. He explained he understands when a 'big lead actor' takes on a gay role because it can 'bring awareness' to the LGBTQ+ community.  In an exclusive interview with MailOnline, Aidan revealed how he feels about straight actors playing gay roles. He said: 'I would say I'm leaning towards a gay guy should play a gay guy. This is a weird one because I understand how some characters need a straight actor because it adds more of a platform and focus to gay stories.",
        "'But now I think we are in a place where we should step a side and let gay and trans represent their own community through their own voice. 'Same with any minority its all well and good having diversity but if its a straight white man at the top making those decisions and writing the script its still coming through from a straight white man's lens. 'We have to try and make sure every level, for whatever group we are representing, is involved so whether that is a gay actor playing the gay role I think they need to be as much involved as possible. ",
        "'Otherwise you're playing a stereotype and it wont be authentic which I think in this day and age it needs to be.' Following Aidan joining Heartland four seasons ago, his role has introduced storylines such as gay marriage and adoption. The Netflix series has received lots of positive feedback from fans but these important storylines have unfortunately raised homophobic commentary which has been difficult for Aidan to stomach. He said: 'It was really hard at first but I think I've built up such a tough skin from my background of growing up on a council estate in the Midlands. It wasn't until I was 19 or 20 years old I came out, so I'm used to the homophobic comments anyways.' The actor added that he found it a struggle to 'separate himself from the character' due to his role being similar to his real life. He continued: 'It made the experience very difficult reading the comments because I love social media and interacting with the majority of the show's fans but I couldn't separate myself from the character.'Even though I'm playing a character, a lot of that role is who I am and represents me and that is how I know it is so important for any gay kid watching the show. ",
        "'When people attack Rick they are attacking the entire LGBTQ community they are saying you are not accepted. 'It is such a shame and it is surprising it still exists. I really thought we had come so much further. 'I'm trying to remain better not bitter but it is very hard and it does get to me. It's so easy to focus on the negatives sometimes and I think we all do that on social media but we have to learn to flip that switch and focus on the positives.'Netflix is set to drop season 16 of Heartland later this month and Aidan revealed fans will see a 'more vulnerable side' to his role. The actor said he thinks 'it is pretty iconic for the writers to take such a risk' with his character in the new series.  He said: 'I'm really excited for it to come out because we shot it last summer, my mum and grandparents are like, \"when can we see it?, I think half of my friends don't believe I'm actually on the tele. 'I think fans are definitely going to see a more vulnerable side to my character this season. With him being the first LGBTQ+ character in the shows 16 years history I think it is pretty iconic for the writers to take that risk with my character. ",
        "'I think with the first two or three seasons that I've been in it's been a caricature leaning into the general queer characters we see on TV its there for comedy and its never the hero story. 'This year they have wanted to show the more humanity level of Rick, we will see him possibly adopting a baby.'We are going to be introduced to his on screen husband because that has been alluded for two years and it's been like \"well where is he?\" We will see a different side of him there and he will take charge in the work place as well.'When he first landed the role, Aidan thought it was just 'a throw away character' but he now sees it as a 'responsibility to use his voice' to allow families watching the show to have open conversations about sexuality. He believes that the show network 'is very inclusive and diverse' but the reason it took so long to introduce a gay character to Heartland was down to the 'very toxic masculine environment' of rodeos, cowboys and cowgirls. Aidan explained: 'I think the network is very inclusive and diverse but this show in particular is specific to a western culture that is a very masculine and also a toxic masculine environment, so I think they had to tread very very carefully. ",
        "'Also I think people in those communities who are part of LGBTQ have never had many characters they could draw upon.'More and more we need to push to be able to see us in every situation so people feel comfortable and safe coming out in those communities. We've come a long way but people still need to do a hell of a lot better.'Heartland officially started filming season 17 on Monday and Aidan added that he hopes Rick will develop further 'to be the hero in that gay kid's living room instead of the side piece or best friend'. Heartland Season 16 will be released on Netflix across the UK, Ireland, and Australia on May 17. "
    ]
}