{
    "articleURL": "/tvshowbiz/article-12060961/Alessandra-Ambrosio-celebrates-sons-11th-birthday-visit-Disneyland.html",
    "content": [
        "Alessandra Ambrosio treated her son Noah to a fun day in California this weekend.  ",
        "The Vogue model was seen with her boy - born Noah Phoenix Ambrosio Mazur - as well as several of his friends at the Star Wars: Galaxy's Edge section of Disneyland Park in Anaheim this weekend.It was his 11th birthday. The leggy bikini model was dressed for comfort as she treated her only son, whom she shares with former partner Jamie Mazur, to a day of rides, Disney meet and greets, and cotton candy.The 42-year-old cover girl also has a daughter named Anja Louise, 14. ",
        "Alessandra looked French chic in her navy and ivory striped crew neck sweater.She added ripped acid washed blue denim jeans and white lace up sneakers as she had a white top tied around her waist.The GAL Floripa designer wore her highlighted hair down over her shoulders as sunglasses were perched on top of her head.Her boy wore a print T shirt that said May the 4th Be With You, adding dark shorts. He too had a top tied around his waist.Noah went for comfort in white Crocs worn with light gray socks.The mother and son duo were seen holding lightsabers - his Jedi blue and hers Sith red - outside Han Solo's famed Millennium Falcon aircraft.In another snapshot, Alessandra and her boy were seen hugging Wookiee Chewbacca who raised his furry arms in the air. ",
        "And in another image, Alessandra put her arm around her so as they stood next to the Mandalorian named Din Djarin, who was dressed - as always - in full armor and helmet.Around his chest was his little green sidekick, Grogu - or Baby Yoda - in a brown linen crossbody bag.Alessandra shared a blurry photo of wide-eyed Grogu in the sack as she wrote 'Cutie' over the image in green.  Noah's buddies were also seen standing around The Mandalorian for their snapshot.The Mandalorian is an American space Western television series created by Jon Favreau for the streaming service Disney+. It premiered in 2019. 'Happy birthday to my baby boy,' she also wrote over a photo on social media as she added a link to Disneyland. ",
        "Alessandra last turned heads in late April.She flaunted her incredible figure while attending The Daily Front Row's 7th annual Fashion Los Angeles Awards.The CAA Model - who enjoyed a spring break holiday in Brazil - showcased her toned physique in a sheer maxi wrap dress with a high slit that featured a long trail that dragged behind her.The mother-of-two slicked her brunette tresses back with a center part and slipped into a pair of open-toed, silver heels to match her HIBOURAMA x MVP Wardrobe Diamond Bag and chunky necklaces. ",
        "The 5ft 9.5in beauty wore light makeup with a bronze shadow around her eyes, a touch of mascara, and lipgloss for a glammed-up touch. The former Victoria's Secret angel was joined on the red carpet by many other A-listers, including Kim Kardashian, Meghann Fahy, Keanu Reeves, Brie Larson, Elle Fanning, and Gwyneth Paltrow.",
        "The Daily Front Row Awards welcome celebrities in the fashion and entertainment world to honor stylists, gurus, fashion icons and more. The description of why she was receiving the honor on the The Daily Front Row's website read: 'Oscar-winning actress turned wellness world poster girl, everything Gwyneth Paltrow tries her hand at turns to gold. 'Her in-house fashion line, G. Label by goop, is no exception, delivering everything from GP-approved luxe leather tanks and fine-knit henleys to eveningwear, closet essentials, jewelry, and elegant collaborations.'"
    ]
}