{
    "articleURL": "/news/article-12051979/Full-list-pubs-risk-closure-released-favourite-drinking-spot-facing-chop.html",
    "content": [
        "The full list of Wetherspoon pubs that are under off has been revealed The pub giant revealed last year it would be selling dozens of its beloved boozersFans of a cheap pint may have to find a new local as the full list of even more at-risk Wetherspoon pubs has been released.",
        "There are currently 19 of the pub giant's boozers under offer, while twenty have already closed for good.Last November, Wetherspoons announced it was in the process of selling 39 of its pubs due to its inability to match its pre-pandemic performance. It was revealed in September that 32 of its pubs would close, before a further seven sites got set for the axe in November.Pubs such as The General Sir Redvers Buller in Crediton and The John Masefield in New Ferry are under offer, while the likes of Plough and Harrow in Hammersmith and Wrong 'Un in Bexleyheath are still up for sale, according to The Sun.",
        "The pubs that are under off could still remain open if a sale doesn't complete, as this means the seller is considering the offer.Other Wetherspoon establishments have already started to close, with 20 so far having shut their doors. These include The Worlds Inn in Romford, Chapel an Gansblydhen in Bodmin and The Sir John Stirling Maxwell in Glasgow.The list of Wetherspoon pubs up for sale and under offer can be found on the JD Wetherspoon Disposals website. In January, the pub chain said sales jumped at the end of 2022 but it is still struggling to keep up with its pre-pandemic performance.Like-for-like sales rose 18 per cent in the last quarter of 2022 at the firm's 844 pubs, but are still 2 per cent behind 2019 levels.",
        "Wetherspoon also noted that costs were far higher than three years ago, especially for labour, food, energy and maintenance.",
        "Its chairman Tim Martin said: 'The aftermath of the pandemic and lockdown restrictions have been far more difficult than anyone thought. That is the picture for the whole pub and restaurant industry.'People thought that after lockdown there would be a boom in people suffering from cabin fever but, instead, it has almost been the opposite situation as people have got in the habit of staying in.'But the crisis extends further than just everyone's favourite bargain boozer. Hospitality businesses across the country have been forced to shut in the past year due to crippling inflation costs and energy prices. In January to March of this year alone, 756 hospitality venues shut their doors for good. New research by industry experts CGA by NIQ and AlixPartners has revealed that almost 4,600 venues closed across all corners of the country from March 2022 to 2023 at a staggering rate of 12 a day. Profits have further been impacted by the changing behaviour of consumers, specifically families, who are eating out less due to their pockets being squeezed amid the cost of living crisis. ",
        "The full list of pubs that are under offerWrong ‘Un, Bexleyheath Jolly Sailor, Hanham The Moon and Bell, Loughborough ",
        "The Widow Frost, Mansfield Resolution, Middlesbrough The Rising Sun, Redditch Sennockian, Sevenoaks Admiral Sir Lucius Curtis, Southampton Lord Arthur Lee, Fareham Plough &amp; Harrow, Hammersmith Coronet, Holloway, London Colombia Press, WatfordThe World's Inn, RomfordLast Post, LoughtonChristopher Creeke, BournemouthThe Alfred Herring, Palmers Green Silkstone Inn, Barnsley The John Masefield, New Ferry The Cross Keys, Peebles The Saltoun Inn, Fraserburgh The General Sir Redvers Buller, Crediton The Bank House, Cheltenham The Butlers Bell, Stafford The Percy Shaw, Halifax Foxley Hatch, Purley Asparagus, Battersea Millers Well, East Ham Hudson Bay, Forest Gate Angel, Islington The Billiard Hall, West Bromwich Capitol, Forest Hill The Bankers Draft, Eltham Moon on the Hill, Harrow The Bank House, CheltenhanThe full list of pubs that have already closedThe Worlds Inn, Romford The Colombia Press, Watford The Malthouse, Willenhall Thomas Leaper, Derby The Cliftonville, Hove The Tollgate, Turnpike Lane Harvest Moon, Orpington Alexander Bain, Wick Chapel an Gansblydhen, Bodmin Moon on the Square, Basildon Coal Orchard, Taunton Running Horse, Airside Doncaster Airport Wild Rose, Bootle Edmund Halley, Lee Green The Willow Grove, Southport Postal Order, Worcester North and South Wales Bank, Wrexham The Sir John Stirling Maxwell, Glasgow The Knight's Templar, London Christopher Creeke, Bournemouth"
    ]
}