{
    "articleURL": "/tvshowbiz/article-12045909/Married-Sights-Domenica-Calarco-doesnt-look-like-anymore.html",
    "content": [
        "Domenica Calarco has gotten a new glamorous hair makeover to fix her 'jungle mane' after exiting the I'm A Celebrity... Get Me Out Of Here! jungle.",
        "Many saw the Married At First Sight star as a frontrunner for the win, but she was booted out of the South African jungle almost a week before the final.When she landed back in Australia this week, the 30-year-old didn't waste any time in getting back her glamorous appearance after spending three weeks in the jungle without any of her beauty items. On Thursday, she posted several stories on Instagram showing off her new hairdo with her over 500k followers. The reality star opted for a long bob with some soft blonde highlights and a swoopy side fringe. ",
        "Posing outside with her new hair, Dom captioned the snap: 'Fixed my jungle mane'. She also posted a video to her Instagram grid of her full salon experience, as she was gifted the treatment. Dom captioned it: 'A week back in the real world post jungle life called for a glow up.'",
        "She continued: 'Today I had the @wellapro_anz #shinefinityanz treatment done @valonzhaircutters. 'Safe to say I'm obsessed with the shine, my hair really needed it!'Many fans loved her new look, with one commenting: 'Woww, this colour looks amazing on You!'While another said: 'Looking Gorgeous as always'. And a third wrote: 'So beautiful &amp; natural!'The 2023 series of I'm A Celebrity... Get Me Out Of Here! Australia came to an end last Sunday. ",
        "The final two contestants were former netballer Liz Ellis and boxer Harry Garside in the nail biting finale.In the end, Liz walked away victorious, winning $100,00 for her chosen charity, Share The Dignity, and the title of Queen of the Jungle.A thrilled Liz couldn't believe her luck, and looked truly moved and stunned as she took her seat on the throne.'Oh, my gosh. Finally, I'm a queen!' she joked before making her way out onto the podium."
    ]
}