{
    "articleURL": "/wires/ap/article-12047581/Kenyan-court-sets-bail-pastor-parishioner-death-probe.html",
    "content": [
        "NAIROBI, Kenya (AP) - A court in Kenya ruled Thursday that one of two pastors under investigation for the deaths of more than 100 of their congregants, many of whom are believed to have starved to death, could be released on bond or bail.",
        "Pastor Ezekiel Odero was arrested last week in connection with the deaths of dozens of his congregants at his coastal megachurch, which draws thousands of people from across the country. Police closed the church, but lawyers have filed an application, scheduled to be heard Monday, to have it reopened.Odero's parishioners turned up outside the court Thursday to pray for his release, which was granted on condition that he post a bond in the amount of 3 million Kenyan shillings (about $22,000) or cash bail of 1.5 million shillings ($11,000). The court said there was no sufficient reason to keep the pastor in custody.Odero´s lawyers acknowledged after his arrest that 15 people died at his church but said the deaths were reported at a police station as required by law. Police have said there was no evidence at the time to suggest a crime was involved.Odero is also under investigation for his ties to Paul Mackenzie, the pastor of another church in Kilifi county. Mackenzie was arrested after emaciated parishioners were found in his property and his followers said he had instructed them to fast to death before the world ends in order to meet Jesus.Police have been searching his 800-acre (324-hectare) property located in a forested remote area where dozens of mass graves were dug out and more than 100 bodies found.",
        "Autopsies on the bodies were ongoing, but completed ones showed some of the buried people had died of starvation, strangulation or suffocation.A lower court freed Mackenzie this week but he was rearrested and presented to a higher court. Prosecutors requested more time to pursue possible terrorism-related charges. Police have said their investigations pointed to signs of radicalization.Mackenzie is due to appear in court Friday, when an application to hold him for a further 30 days pending will be heard.Mackenzie sold Odero a television channel in 2019 when he closed his church and moved with some congregants to his property in the forested area.Kenya's national communications authority suspended Odero´s TV channel for airing inappropriate content on exorcism during hours when adult programming is not allowed."
    ]
}