{
    "articleURL": "/wires/reuters/article-12050555/PBF-Energy-beats-quarterly-profit-estimates-strong-margins.html",
    "content": [
        "By Sourasis Bose",
        "May 5 (Reuters) - PBF Energy Inc boosted its share buyback authorization to $1 billion after soaring margins helped the U.S. refiner to beat first-quarter profit estimates.The company expects to continue and potentially increase shareholder returns. Shares rose 2% in the morning trade.PBF's gross refining margin, excluding special items, soared 65% to $1.41 billion in the reported quarter, joining larger rivals Marathon Petroleum Corp and Valero Corp in posting upbeat results.Refining margins have risen after pandemic-related closures and Western sanctions on Russia crimped global supplies amid rising demand.\"We are seeing stable to growing demand for our products at our refinery gates, which continues the call for high utilization from our assets,\" said outgoing Chief Executive Officer Tom Nimbley on a call.PBF said its first-quarter production rose 1.8% to 859,200 barrels per day (bpd), and expects 900,000 bpd to 960,000 bpd throughput in the ongoing quarter.The company also conducted extensive turnaround work across 75% of its regions during the January-March quarter, and said it would continue extensive maintenance and multiple turnarounds across its systems.U.S. refiners increased maintenance activities during the first quarter after running at breakneck rates last year to meet rising demand.\"PBF's balance sheet is in great shape, and we continue to expect 2023 above mid-cycle levels, even as estimates have been moderated since the beginning of the year,\" said RBC Capital Markets analyst TJ Schultz.",
        "The New Jersey-based refiner also re-purchased about $346 million of equity, including $22 million in April and May, together, this year.Excluding items, PBF earned $2.76 per share in the first quarter, beating analysts' average estimate of $2.58, according to Refinitiv data.The refiner also said its 50-50 renewable diesel project joint-venture deal with Italian energy group ENI is expected to close in the second or third quarter. (Reporting by Sourasis Bose in Bengaluru; Editing by Shilpi Majumdar and Subhranshu Sahu)"
    ]
}