{
    "articleURL": "/wires/ap/article-12060029/Matthews-takes-Giro-3rd-stage-Evenepoel-keeps-lead.html",
    "content": [
        "MELFI, Italy (AP) - Michael Matthews won a wet and long third stage of the Giro d´Italia on Monday while pre-race favorite Remco Evenepoel extended his overall lead.",
        "Matthews, who rides for Team Jayco-AlUla, edged out Mads Pedersen and Kaden Groves in a bunch sprint on the final kick up to the line. It was the Australian cyclist´s third Giro stage win and a first since 2015.\"They (his team) were fully committed for me to win the stage,\" Matthews said. \"It´s been such a roller coaster this year. Now already on stage three with a stage win. That´s more than I could ever dream of.\"I heard that Pedersen was dropped on the climb so I was hoping he would be a little bit pinned for the sprint. I just knew I needed to go a bit early, get the jump on them, and it worked out.\"The drizzle, especially on the second half of the 213-kilometer (132-mile) route south from Vasto to Melfi, caused several crashes but nothing that appeared too serious.Evenepoel finished safely in the peloton and gained bonus seconds in the intermediate sprint - edging Primoz Roglic - to extend his lead to 32 seconds over João Almeida, who moved into second despite being involved in a crash.",
        "\"We were just there, we wanted to take the downhill in the first positions because the rain made the roads wet and tricky,\" said Evenepoel, who rides for Soudal Quick-Step.",
        "\"If the seconds are there to grab, we should not be afraid to grab them. One more second on Primoz and three on the rest is good, especially after quite an easy day and a hectic final.\"Evenepoel has worn the pink jersey since storming to victory in the opening time trial on Saturday.Roglic, who is considered Evenepoel´s strongest challenger, moved up to third but was still 44 seconds behind the Belgian.The stage was one of the longest and flattest of the Giro, along with two categorized climbs towards the end.In contrast, Tuesday´s fourth stage has hardly any flat sections on the 175-kilometer (109-mile) route from Venosa to Lago Laceno. There are also three category two climbs, including one just before the finish.The Giro ends in Rome on May 28.___More AP sports: https://apnews.com/apf-sports and https://twitter.com/AP_Sports"
    ]
}