{
    "articleURL": "/home/books/article-12048113/A-new-history-cricket-reveals-not-gentlemanly.html",
    "content": [
        "No other sport has tours like cricket tours, which were long, action-packed and often gossip-filledREAD MORE: England cricket's biggest star since WG Grace was bornBOOK OF THE WEEKThe Tour: The Story of the England Cricket Team Overseas 1877-2023 By Simon Wilde (Simon &amp; Schuster £25, 580pp) ",
        "It's funny to think that if Britain hadn't been a small island nation, cricket might never have broken the bonds of being a quirky ball game virtually unheard of by the rest of the world.An island nation maybe, but with its long maritime tradition it achieved a reach way out of proportion to its size. And of all the evidence of Britain's loitering in foreign parts, cricket has to be one of the few things it left behind that is both highly visible and distinctive and, even to the most woke, hard to knock.No other sport has tours like cricket tours — long, action-packed and often gossip-filled, too — which is why Simon Wilde's comprehensive history of the English cricket team abroad is so packed with interest.England's first major overseas tour to Australia and New Zealand in 1876 lasted 254 days; their most recent triumphant visit to Pakistan was just 30. Grand tours have morphed into package holidays.",
        "Wilde is the veteran cricket correspondent of The Sunday Times, and this is a companion volume to his biography of the England cricket team.As you would expect, all your favourite anecdotes are here — a well-lubricated Andrew Flintoff being rescued by St Lucia police from his late night pedalo, David Gower in flying gear buzzing his team-mates in Australia in a Tiger Moth, Geoff Boycott nipping off for a round of golf rather than watch his colleagues play in a Test match and, of course, the first blows to apartheid-era South Africa when they refused to accept Basil D'Oliveira because he was mixed race.",
        "Brits might not be so popular overseas these days, but our cricketers abroad are like a goldmine for the hosting country.The very first match played by an England team in Australia in 1862 was such a pull that all the costs of the tour were covered by one fixture alone.When England first toured India in 1933-34, the Delhi government closed its offices, and Bombay declared a public holiday: unsurprisingly the average gate for that Test match was 100,000.A seven-month tour of Australia in the 1880s would have turned a profit but for the £3,000 offered by the sponsor to W. G. Grace, then the most famous cricketer in the world, to skipper the team. That's the equivalent of half a million today, proving that the vast sums offered by the Indian Premier League have always been around in one form or another.The pressure on the captains can be immense. Doug Insole, a former Essex captain and Peter May's deputy on tour, said the skipper needed to be a 'public relations officer, agricultural consultant, psychiatrist, accountant, nursemaid and diplomat, as well as selector and tactician, while also having some ferociously hostile bowlers trying to knock your block off'.Wilde opens the bowling with a riveting chapter called Staying Sane, which gives the lie to the idea that touring is one long jolly in the sunshine for the cricketers, who are miles away from home and cocooned in the company of people they may not always get along with. ",
        "Some players sail through any number of tours seemingly unscarred: unflappable Alastair Cook notched up centuries all over the world, while others cracked — Marcus Trescothick famously, as well as Jonathan Trott. Graeme Fowler and Steve Harmison in the modern era also struggled.Graeme Swann, the great off-spinner, once said: 'Touring before you've got kids is the best thing you'll ever do. You spend time with some of your best mates, [in] five-star hotels, playing cricket for your country. It's amazing.' The flipside is, of course, once you've got kids it isn't so much fun.It's true to say that English cricketing authorities — and indeed much of the game's more traditional support — have not, until very recently, been especially sympathetic to partners and families. The thought of wives, girlfriends and even children sharing breakfast with the team would have been enough to induce apoplexy in many of the residents of the Lord's Long Room. Women were only admitted to the MCC in 1998.The class structure of the game was like an open sore. In 1962-63, the men running the team on the Ashes tour of Australia couldn't have been more old-school. The manager was the Duke of Norfolk and, while the old amateur status had been abolished, the captain and vice-captain, Ted Dexter and Colin Cowdrey, were both public school and Oxbridge. Dexter's wife, Susan, took the chance to join the tour and do some modelling work.",
        "This didn't go down too well with Fred Trueman, a hugely illustrious — if combative — Test player and cricket professional. He told an Aussie journalist he wasn't sure 'whether we were supposed to be playing under Jockey Club rules for Dexter Enterprises, or engaged on a missionary hunt' (a spiky reference to the Rev David Sheppard, another senior player and later Bishop of Liverpool). Dexter fined Trueman £50 for not contributing to team spirit. He was incensed and vowed never to play for England again, though public opinion was massively on his side. He did play again, though never again went on a major tour.Even Ray Illingworth, later a successful captain of England and influential figure within the game, couldn't stand it. 'None of the professionals were ever invited to dinner . . . not that we would want to go anyway, but all the amateurs dined with the Duke of Norfolk and that created divisions. I never felt at ease in the set-up.'Thank heavens, you feel, for 'Bazball', the aggressive, high-octane batting style of the England team after the appointment of current coach Brendon 'Baz' McCullum and captain Ben Stokes, all tatts and shades, and not much to do with the Duke of Norfolk.",
        "It was Trueman's first wife, Enid, who articulated the misery of the life of the touring widow. 'When you're married to a famous person, everyone expects it to be marvellous. You can also be very lonely on your own while your husband is thousands of miles away.",
        "'And you won't miss me half as much as I miss you because you have got all the contacts, the parties, the dinners. I just have the telephone, the reporters and the menace.'So no fun then being stuck at home and, within weeks, they had separated.There were huge opportunities for womanising and, er, infidelity, which Wilde tactfully skates over in his accounts of modern tours.England's first overseas cricketing visit was to Canada and the U.S. in 1859. The manager, Fred Lillywhite, was much taken with the ladies of Philadelphia: 'If any additional incentive had been required to induce the English XI to exhibit their skill to the greatest advantage, it was afforded by the presence of so large and beautiful an assemblage of the fair sex.'An incentive which it is fair to say has probably had the same effect on many touring cricketers through the years.The great batsman and England captain Wally Hammond, described by his biographer as 'a philanderer on the grand scale', was well known for his enthusiastic pursuit of women at home and abroad.More recently, Frances Edmonds, wife of the England spinner Phil, didn't mince her words: 'It is pointless to pretend that three and four month tours are not going to involve a fair amount of hanky-panky,' she wrote.",
        "Someone who knew a lot about that was Denis Compton, a hugely glamorous figure, dazzling cricketer and an impossibly handsome man, who received many approaches. 'My first two marriages did not really have a chance,' he reflected. 'Test cricketers have the hardest job of all to hold their marriages together because of all the touring.'Still there were compensations. 'The temptations were always there. When a beautiful blonde [on the ship to Australia] asked me to autograph her menu, she pushed her napkin into my hands.'Written in lipstick was the number of her cabin.'"
    ]
}