{
    "articleURL": "/wires/pa/article-12050887/Erik-ten-Hag-confident-Manchester-United-bounce-seal-four-place.html",
    "content": [
        "Erik ten Hag is confident Manchester United will bounce back from their latest setback and go on to seal “vital” Champions League qualification over the coming weeks.",
        "This has largely been a season of improvement and promise under the Dutchman, but the Red Devils’ away form against the better sides has been wretched.United have not won a Premier League game at any of the top nine teams, with Thursday’s last-gasp defeat at Brighton meaning they have collected just one point from a possible 27 on the road against those sides.Alexis Mac Allister’s stoppage-time penalty sealed Brighton a 1-0 win that leaves Ten Hag’s men just four points above fifth-placed Liverpool, albeit with a game in hand.",
        "Thursday’s loss was a blow but United have proven adept at recovering from them this season, with the manager confident of Champions League qualification.“We have every time in this season when we had a defeat, we bounce back,” Ten Hag said ahead of Sunday’s trip to West Ham. “So, I count on my players, I count on my team. We have to do it again.“There is no time to stay in this (disappointment), so in one hour we go onto the game against West Ham United. All focus on that.“We prepare for them, we make a good plan, the players have to take responsibility and they will do. I count on them.“They have to do it and they can do it because we have the evidence in the season. Every time when we had disappointments, they bounce back.”",
        "Pushed on the top four race, the United boss said: “We had a quite good run from the last five – four wins and a draw (before Brighton).“We have everything in our hands, so we have to focus on our performance. I trust my players, so I am quite convinced about that.”Ten Hag has never shied away from the importance of qualifying for the Champions League and recently stressed there can be “no misunderstanding” about their need to return to Europe’s top table.Reiterating that stance after the loss at Brighton, he said: “Manchester United, of course, we need to be there in the Champions League.“We want to be there because we want to challenge with the best teams in the world, so we do everything that’s in our power to get that done.“I think it is always vital that we have to be in the Champions League.“It’s a battle because in the Premier League many clubs are competing for it and they have the power to fight for that as well. We want to be there. We do everything to get there.”",
        "Ten Hag says there are no fresh concerns as their Champions League qualification quest continues at the London Stadium, where they could be boosted by Alejandro Garnacho’s return.",
        "The talented 18-year-old winger has been out for eight weeks with an ankle injury and Ten Hag said that “maybe he can be involved but we have to see”.One player that is perhaps fortunate to be available on Sunday is Antony, who received only a booking for a frustrated challenge on Mac Allister.Asked about channelling the Brazil international’s passion, Ten Hag said: “Yeah, but I think his passion is his strength.",
        "“Of course, until a certain level you have to control it. But you need passion and desire to win your games and to win battles in the game.“It’s true, it’s very strong with him. He is very ambitious.“As I say, don’t go over the top, stay focused on your game and what the game needs. If he is doing that, he is a great player.“I think his performance, his improvement is quite obvious and clear.”"
    ]
}