{
    "articleURL": "/tvshowbiz/article-12052321/ALISON-BOSHOFF-Alice-Evans-moves-2M-home-ex-Ioan-Gruffudd-poor-pay-it.html",
    "content": [
        "Tough times for actress Alice Evans, who is moving out of the $2million home she shared with actor husband Ioan Gruffudd this weekend.",
        "The actress, 54, is bound for a rented house with their two daughters Elsie, 11, and Ella, seven, after Gruffudd pleaded with a court to allow the home to be sold saying he didn't have the money to keep up with mortgage payments for his family following their split in 2021. The three-bedroom house in La Jolla is the only home his children have ever known.Gruffudd, 49, is now living in Los Angeles with girlfriend Bianca Wallace, 29. ",
        "A friend says: 'Alice is packing up and it's been a devastating period. She is very sad that she and the children have to move out, but there was no option.'The Fantastic Four star told a court in a document filed last year that neither he nor Evans could afford the $6,750 a month in mortgage payments, insurance and property tax.He said he'd had just one paid job in the past year and was so poor he was relying on handouts from his young girlfriend. 'The rent for my apartment is $3,400 per month; I live there with my girlfriend, who has been paying the majority of our living expenses, and all of our rent, since September 2022 due to my financial circumstances,' he said.He added: 'I have explained these financial circumstances to Alice and have asked her numerous times since we separated, through counsel, to help financially and to agree to sell the La Jolla residence . . . but Alice has not agreed to my requests.'",
        "Ioan filed for divorce in March 2021 after Alice revealed on social media that her husband of 14 years was walking out on her and their two daughters.In September he went public with Bianca, an Australian actress who was an extra on TV drama Harrow — which Ioan starred in.Evans's Instagram bio reads: 'I am so disappointed in so many people now that my life has suddenly changed for the worst.'",
        "It comes after Ioan opened up on what it has been like for him to navigate the ramped-up public scrutiny in the wake of his split from estranged ex Alice.Speaking to The Radio Times in January, Ioan was asked about how he dealt with the publicness of their break-up.He said he was able to handle it because he had been working in showbusiness from the age of 11 and added that dealing with that scrutiny was contractually part of being an actor.Ioan said: 'It's experience of having lived in the public eye from an early age. I was in the Welsh language soap opera Pobol y Cwm from the age of 11, so people knew who I was in that community. 'You can't train for that scrutiny as an actor, but it's been part and parcel of what it is to be an actor. It's a contract.'"
    ]
}