{
    "articleURL": "/news/article-12050989/DailyMail-coms-eve-coronation-poll-shows-new-UK-king-got-slow-start-US.html",
    "content": [
        "A DailyMail.com/TIPP Poll reveals what Americans really think about the royalsKing Charles is keeping his crown above water, but Camilla is gasping for airSome US royalists are in London for the pomp, others have hit the snooze buttonFor a few Americans, the chance to be in London for a British monarch's coronation is worth the transatlantic flight.",
        "For others, it'll take place too early on Saturday morning to bother waking up and switching on the television.Those are the findings of DailyMail.com/TIPP Poll on the popularity of King Charles III, his second wife Camilla, and a centuries-old institution that's had a tough few years and lost some of its luster.Charles has gotten off to a slow start this side of the pond.Only 36 percent of Americans see him favorably, while a similar share — 31 percent — have an unfavorable view.",
        "The incoming Queen Camilla fares worse. She's underwater by 6 percentage points.That puts them far behind Charles' heir, Prince William, and his wife Kate Middleton, the royal family's superstars.Even Prince Harry and Meghan Markle, his American wife, get better popularity scores in our survey of 1,109 US adults, which was carried out this week.The king also trails far behind his mother, Queen Elizabeth II, who got a popularity bump to 71 percent in the US after her death last year, according to YouGov surveys.Americans also appear lukewarm on Charles' performance, 239 days into the job.Overall, 41 percent of adults say he's performed well, against 13 percent who give him a thumbs down.That's drowned out by the nearly half of US respondents who are unsure, haven't formed an opinion — or aren't watching his reign closely enough to say.",
        "The popularity of Charles and Camilla doubtless suffers from the legacy of Diana — Charles' photogenic younger wife who died in a car crash in Paris in 1997 after their acrimonious divorce.",
        "The lingering controversy surrounding Diana's death has been followed by a series of royal outrages, including Prince Andrew's sex scandal and Harry's decision to quit and publish a tell-all memoir, Spare.Prince Andrew ranks as the least popular royal in our poll — underwater by 9 percentage points among US respondents.He's especially tarred in the US by his ties to US financier Jeffrey Epstein, a convicted sex offender who died in a New York jail cell in 2019, and a related sex assault allegation.Reputedly the former queen's favorite son, Andrew was stripped of most of his titles and cut from royal duties over the ensuing scandal.The monarchy's reputation was battered further in the US by Harry and Meghan's decision in 2020 to split from the family and move to California.In an interview with Oprah Winfrey, Meghan, who is mixed race, alleged racism in the British establishment.In our survey, Americans were divided over whether Harry and Meghan's exit hurt the royal family.Some 39 percent said they had weakened the institution, 34 percent said they hadn't, and 26 percent were unsure.",
        "Likewise, respondents were split on whether it's time to call time on the monarchy.Nearly half of respondents said it was time to cut them loose, 21 percent disagreed, and more than a third were unsure.Republicans, despite the name of their party and its historical connotations, were bigger backers of the British monarchy, and more supportive of Charles' job performance, than were Democrats.Still, the lackluster support for the royals in the US has not dented Donna Werner's enthusiasm.The American travelled from Connecticut to London and plans to secure a front-row seat to watch events around Saturday's coronation of King Charles III.'This is such a once-in-a-lifetime experience,' Werner, 71, told Reuters as she set off from her hotel towards Buckingham Palace.'Nobody does it like the British — the pomp and the circumstance. We don't have anything like this in the States.'Americans who stayed at home will be able to watch the regalia-heavy event, but will have to wake up early.The king's procession to Westminster Abbey will begin at 5am Eastern time, which is 2am on the West Coast. ABC, CBS, NBC, CNN, and Fox News will feature live coverage, but many Americans will sleep in and catch the highlights later in the day."
    ]
}