{
    "articleURL": "/sport/nrl/article-12058853/NRL-star-Nicho-Hynes-gets-life-changing-news-mum-jailed-drug-supply.html",
    "content": [
        "Nicho Hynes' mother will be released from jail on Tuesday She was taken into custody in February after being found guilty of drug supplyA family friend died of heroin overdose at her home in New South Wales in 2021NRL star Nicho Hynes says he's looking forward to his mother living with him 'forever' when she's released from jail on Tuesday.",
        "Julie Hynes, 50, was taken into custody in February after a jury found her guilty of drug supply when a family friend died of a heroin overdose at her NSW home in 2021.'She's going to stay with me forever now,' the Cronulla Sharks player told Judge David Wilson during his mother's sentence hearing on Monday.Judge Wilson flagged he intends to release Hynes on strict conditions, after an almost three-hour-long hearing.'I'm just telling you so you can sleep well tonight and for the peace of mind of your family,' he said to the offender who appeared via video link.",
        "Hynes was charged with drug supply when Luke Murphy, 29, was found dead in her living room covered in white powder.The matter was due to wrap up on Monday. However, Hynes began the hearing by denying evidence found to be true in trial.'I was prepared to accept that she had a support network and to release her into the community,' Judge Wilson said.'But she appears to lack insight into her offending. It's regrettable she felt the need to give evidence that was contradicted by very persuasive facts.'The jury in her trial was told a red hydraulic press marked with her fingerprints was found in her bathroom.",
        "Hynes returned to the stand after two judge-ordered breaks and admitted knowing the hydraulic press existed and turning a blind eye to the drugs being pressed in her bathroom.'You put your head in the sand and let it happen?' her lawyer asked.'Yes,' she replied.",
        "The details of her strict conditional release will be established on Tuesday, though one of the conditions will include living in Nicho Hynes' granny flat for at least two years.Outside court, he said he's keen to put his mother's troubled history behind him.'I'm very happy to move past this now and bring my mum home and look after her, and put her into a community that looks after me and will look after her,' he said.'I'm really looking forward to her being the generous and loving person I know she is.'"
    ]
}