{
    "articleURL": "/tvshowbiz/article-12061001/Emily-Ratajkowski-enjoys-beach-day-son-joking-picking-husband-F1.html",
    "content": [
        "Emily Ratajkowski loves to show off her pert bottom on Instagram. ",
        "And on Monday, the 31-year-old socialite was at it again as she shared a 10-image carousel with her 30 million followers that highlighted moments from her trip to Miami this week. The former Nickelodeon actress - who donned a show-stopping look at the Met Gala last week - began her post with an image from behind wearing tight red and white shorts over a green thong bathing suit pulled up over her hips.The second snap in the carousel also showed Ratajkowski's backside in an open-back orange dress. In the third image, Emily held her adorable two-year-old son, Sly, on her hip as the duo enjoyed a beach day together. ",
        "Sly seemed to be enjoying his time in the sun as he smiled from ear to ear while holding on to his mom. The media personality showed off her slender frame in a red two-piece and posed with her eyes closed and tongue out amid the backdrop of blue skies, clear water, and white sand. The sultry brunette also showed off her best pouty face in a few snaps wearing a black corset top with a purple and white skirt in a restaurant and bathroom.She also posed in a red corset top with a friend in the back of a car as they rode around town.",
        "On Sunday, Ratajkowski joked about 'picking out a husband' at the Formula 1 Grand Prix. The model shared a TikTok video of herself lip-syncing and dancing as she walked alongside billboards plastered with the handsome faces of Formula 1 racers.She captioned the video: 'Picking out a husband at #F1 #Miami.'A little over a month ago, the High Low with EmRata podcast host was first romantically linked to Styles when they were spotted making out passionately on the streets of Tokyo, Japan.Two weeks prior, she he had introduced her son to her on/off beau DJ Orazio Rispo, around the time she was also linked with Pete Davidson, and Brad Pitt.Last year, Emily filed for divorce from her ex-husband Sebastian Bear-McClard after four years of marriage, however the divorce is not finalized. The beauty recently responded to claims that Harry's ex, Olivia Wilde, had confronted her about the kiss as Olivia dated Harry from January 2021 to November 2022.",
        "'I’m definitely still not thinking about guys. Although, yeah. You know, sometimes things just happen,' Emily explained.A source told DailyMail.com in March, 'Olivia and Emily were friends and that Wilde felt 'betrayed' by Ratajkowski and simply does not want to be dragged into any drama. In response, Emily told Vogue Spain she 'feels bad' for the Don't Worry Darling director about her steamy make-out session with the British pop star, 29.",
        "Following the interview, an insider told DailyMail.com that Wilde wants Ratajkowski to 'keep her name out of her mouth' and 'focus on being a mom instead of dating everyone she sees.'"
    ]
}