{
    "articleURL": "/wires/reuters/article-12055599/Steven-Kwan-powers-Guardians-past-Twins-4-3.html",
    "content": [
        "Never known for his power, Steven Kwan broke a tie with his first home run of the season as the Cleveland Guardians leveled up their three-game series with a 4-3 victory on Saturday against the visiting Minnesota Twins.",
        "The 5-foot-9 Kwan ripped an off-speed pitch off Twins reliever Jorge Alcala, just recalled from Triple-A earlier in the day, 402 feet to right center.Kwan's solo shot was enough to overcome the Twins, who scored all their runs on home runs from Max Kepler and Carlos Correa.The Guardians had gone 13 straight innings without scoring before finally breaking the drought in bizarre fashion in the bottom of the fourth.With runners on the corners, Josh Naylor's chopper was booted by Twins third baseman Jose Miranda, and Amed Rosario scored from third base on the error. Meanwhile, Jose Ramirez raced from first to third, appearing to stray well out of the baseline on his way to a sprawling slide into third.Twins manager Rocco Baldelli raced from the dugout to argue that Ramirez had run out of the baseline only to be ejected by third base umpire Dan Iassogna.The Guardians tacked on two more in the inning on an RBI single by Josh Bell before Twins ace Sonny Gray, who entered the game with baseball's lowest ERA, walked Myles Straw with the bases loaded for a 3-0 lead.The Twins struck back in the top of the sixth when Kepler homered for the second straight game.The blast added to a franchise-record streak of 18th straight games with home runs for the Twins. It also added to Kepler's personal dominance in Cleveland's park, where the outfielder now has 16 homers and 35 RBIs.",
        "The Twins' Correa tied things up at 3-3 in the top of the seventh, when he turned on a fastball from Trevor Stephan and drove it 407 feet into the seats beyond the left-field wall.Stephan (2-1) earned the victory in relief, while Alcala (0-1) took the loss. Emmanuel Clase pitched a 1-2-3 ninth for his league-leading 11th save of the season for Cleveland.--Field Level Media"
    ]
}