{
    "articleURL": "/wires/pa/article-12042667/Opposing-views-heard-says-Yousaf-Cherry-s-Fringe-event-axed.html",
    "content": [
        "Humza Yousaf has said he hopes a compromise can be found which will allow SNP MP Joanna Cherry’s Edinburgh Fringe show to go ahead.",
        "An event due to be held at the Stand comedy club in which Ms Cherry was to be interviewed as part of a series has been cancelled.The club said “key operational staff” had raised concerns about the MP’s views and made clear they did not want to work at the event.Ms Cherry has been a vocal critic of the Scottish Government’s gender recognition reforms, an issue which has put her at odds with the party’s leadership.She claims many colleagues agree with her but are “afraid to speak out”.The Edinburgh South West MP, who is also a KC, indicated she is keeping her options open around taking legal action over the cancellation of the show.",
        "Mr Yousaf said on Wednesday that he has not spoken to the MP about the situation.He said: “I really do hope that Joanna’s show can go ahead.“I hope there’s a way there can be a compromise found in terms of Joanna’s show going ahead.“Joanna and I have a difference on a number of issues, including for example the GRR Bill that was passed by the Scottish Parliament.“I do think it’s important that those views are heard.”He said it is not the First Minister’s role to “tell comedy clubs and other venues what shows they must and must not put on”.",
        "In a statement on Monday, the club said: “Further to our previous policy statement on this matter, following extensive discussions with our staff it has become clear that a number of the Stand’s key operational staff, including venue management and box office personnel, are unwilling to work on this event.“As we have previously stated, we will ensure that their views are respected.“We will not compel our staff to work on this event and so have concluded that the event is unable to proceed on a properly staffed, safe and legally compliant basis.”"
    ]
}