{
    "articleURL": "/wires/reuters/article-12050423/White-House-hopeful-Nikki-Haley-takes-calculated-risk-abortion.html",
    "content": [
        "By Gram Slattery",
        "HENNIKER, New Hampshire, May 5 (Reuters) - While other Republicans running for president assiduously avoid discussing abortion, Nikki Haley, a former U.N. ambassador with 20 years in American politics, is trying a novel approach: talking about it.Days ago, Haley, the only woman in the 2024 White House race, gave a lengthy speech stating she opposed abortion personally but, breaking with her party's right flank, she called for a national consensus. In a Tuesday television interview, she asserted a need for a broad middle ground.People around the 51-year-old former governor of South Carolina, the daughter of two Indian immigrants, say her willingness to discuss the topic represents a calculated risk while other candidates dodge it.\"She's someone who does tackle tough issues like abortion, foreign policy and entitlement reform. She doesn't shy away from things just because they're uncomfortable,\" said Nachama Soloveichik, Haley's communications director.As governor, Haley gained national attention in 2015 when, following a white gunman's murder of nine black men and women in a church, she helped lead the push to remove the Confederate battle flag from the South Carolina Capitol grounds, relegating a divisive symbol of the South's pro-slavery legacy to a museum.She also has foreign affairs experience. As U.N. ambassador under then-President Donald Trump from 2017 to 2018, she pitched herself as a stalwart defender of U.S. interests abroad. On the stump, she frequently emphasizes the need to support Ukraine, a position that divides the Republican Party.",
        "In interviews, several people close to Haley or her campaign described her decision to focus on divisive issues as a way to differentiate herself in a crowded field, while earning more media coverage than she otherwise might.They say it is in part a deliberate bid to seize some attention away from front-runners Trump and Florida Governor Ron DeSantis. Opinion polls show her at about 4%, while about half of Republicans support Trump.Strategists say Haley's decision to address abortion head-on has also underlined a harsh truth for Republicans: There is no position that will satisfy everyone.\"It's easy to lose a lot more voters than you gain by talking about it,\" said Whit Ayres, a longtime Republican strategist.Some 59% of Republicans said they were more likely to vote for a politician who supports banning or enacting severe restrictions on abortion, according to a Reuters/Ipsos poll released in March. The remaining 41% were less likely.Supporters, donors and some party stalwarts praised Haley for her speech addressing an issue that divides the party. But some activists and strategists criticized the speech, which was largely devoid of policy suggestions, for not taking an unequivocal stance.Susan B. Anthony Pro-Life America released a statement on Twitter after Haley delivered her speech at the anti-abortion organization's headquarters in Virginia, praising her for her commitment to supporting a nationwide ban on abortions after 15 weeks of gestation.",
        "But Haley's campaign denied even mentioning an abortion ban after 15 weeks. As South Carolina governor from 2011 to 2017, she signed a ban on most abortions after 19 weeks.\"I think that where Ambassador Haley falls the shortest is that candidates can't lead with compromise,\" said Noah Brandt, vice president of communications at Live Action, a major anti-abortion group.OTHER REPUBLICANS FOCUS ON OTHER ISSUESThe challenges facing Haley - and her Republican opponents - were on display during a recent town hall her campaign hosted in Henniker, a town of 6,000 people in New Hampshire.In interviews, several attendees said they opposed abortion rights while others said it was an issue best left out of politics.\"I don't believe anybody should tell me what to do with my body,\" said retired nurse Claudia Roberts, one of the attendees.Roberts said she hoped New Hampshire's Republican governor, Chris Sununu, a self-described supporter of abortion rights, jumps into the race.Faced with a damned-if-you-do, damned-if-you-don't dilemma, Republican candidates have focused on other issues.The party's underwhelming performance in the 2022 midterm election was seen inside and outside the party as voter backlash against the U.S. Supreme Court's overturning of its landmark 1973 Roe v. Wade decision that had recognized women's constitutional right to abortion.",
        "Trump has barely mentioned abortion, though advisers have said he believes it is best left to each U.S. state.Governor DeSantis, Trump's closest rival who is expected to announce a run within weeks, signed a ban on abortions after six weeks in Florida last month. He has barely mentioned it since.Finding a way to differentiate herself will be particularly crucial as DeSantis and South Carolina Senator Tim Scott enter the race, said one of the people around Haley.Emphasizing the need for generational change - a theme of Haley's campaign so far - may no longer be as potent, that person said. DeSantis at 44 is younger than Haley, while Scott is only six years older at 57.There are limits nonetheless to Haley's raising of thorny matters, and she dedicates plenty of time on the stump to Republicans' more traditional red meat issues.At the town hall in New Hampshire, she spoke for roughly 30 minutes, hitting on topics as varied as immigration and the Chinese spy balloon that floated over the U.S. this winter.Among the topics she did not mention? Abortion. (Reporting by Gram Slattery; Editing by Howard Goller)"
    ]
}