{
    "articleURL": "/tvshowbiz/article-12042745/Emily-Atack-debuts-new-tousled-hair-fringe-models-leggy-denim-shorts.html",
    "content": [
        "Emily Atack debuted a new hair cut as she modelled some leggy denim shorts from her latest clothing collection with New Look. ",
        "The presenter, 33, rocked her tousled blonde hair with a shaggy full fringe as she playfully stuck out her tongue for the photoshoot. Sharing the photos to Instagram on Wednesday, she slipped into a white vest top and a light khaki coloured jacket. Emily accessorised with a pair of tortoiseshell sunglasses and opted for a bronzed makeup look as she got summer ready. Leaning against a door, the comedian then offered the camera a sultry stare for a second snap.  ",
        "It comes after Emily appeared to channel 1950s Hollywood icon Marilyn Monroe on Saturday as she celebrated Keith Lemon's birthday at Soho House in White City.The actress, 33, looked glamorous in a white off-the-shoulder dress with a thigh-high split and a matching wrap which she draped over her shoulders.She boosted her height in a pair of white strappy heels and accessorised with pearl drop earrings. Emily, who was a team captain on Keith's ITV2 show Celebrity Juice before it ended in December last year, wore a curled blonde wig and lashings of make-up, including a bold red lip.She arrived with a friend who wore a glamorous red dress and purple loves, having done herself up as Jessica Rabbit for the night.Many of the stars took to their Instagram pages to share pictures of themselves in their costumes at the star-studded movie-themed 50th birthday celebration of comedian Leigh Francis.",
        "Emily was seen posing with her arm around Leigh, also known as Keith Lemon, with the funnyman dressed as Star Wars character R2-D2.Keith took to Instagram ahead of his birthday to joke about his age, jesting he was as old as some retro items.",
        "Emily recently decided to shelve her self titled ITV2 series favour of her starring role in raunchy new Disney+ show Rivals, which is an adaption of Jilly Cooper's steamy 1988 novel.A TV insider told MailOnline: 'The show means so much to Emily, but she felt it was the right time to move on, there are no plans to make another one.'It takes a lot of work and dedication and other commitments this year meant it would be hard to give another series her all.'She'll always be proud of it as not many female stars have been able to make their own stand-up comedy show.' "
    ]
}