{
    "articleURL": "/money/markets/article-12049937/IHG-boss-step-Holiday-Inn-owner-unveils-bumper-results.html",
    "content": [
        "Keith Barr, 52, who took up the top job in 2017, will leave on 1st of JulyHe will be replaced by IHG's current Americas CEO Elie MaaloufThe group reported a 33% surge in revenue per available room, with UK up 12% Intercontinental Hotels Group has announced that its chief executive will step down at the end of June after 30 years at the company.",
        "The departure of Keith Barr, 52, who took up the top job in 2017, was revealed alongside a set of bumper quarterly results at the hotel chain. The owner of Holiday Inn and Crowne Plaza said it benefited from the lifting of pandemic restrictions in China and was able to bump up room prices by more than 10 per cent.",
        "Revenue per available room, which is calculated by multiplying average daily room rates by occupancy rates, surged 33 per cent in the first three months of 2023 compared to the same quarter last year and was up 7 per cent versus 2019.IHG's hotels in China did particularly well, with revenue per room jumping 75 per cent compared to last year thanks to Beijing's removal of its anti-Covid lockdown measures - though it still remains down 9 per cent compared to 2019.In the UK, revenue per room rose 12 per cent. It was up 18 per cent in the Americas, but Japan saw a 9 per cent fall. The group, which has more than 6,100 hotels across the world, said its average daily room rate rose 11 per cent, with occupancy levels up 10 per cent and close to what they were before the pandemic.Departing boss Mr Barr said: 'We've seen a good start to the year, with continued strong trading in both the Americas and EMEAA, and an excellent rebound in demand in Greater China since the lifting of travel restrictions. ",
        "'Leisure demand has remained buoyant, and there has been further return of business and group travel as expected.",
        "'The guest appeal of our brands has continued to support pricing, with rate up 10 per cent versus 2019 and occupancy now almost back to pre-Covid levels.'However, he also flagged 'ongoing economic uncertainties' and said that 'financing challenges' for the wider commercial real estate industry were holding back new hotel developments.IHG shares fell 3 per cent to £53.56 in morning trade on Friday, reflecting the boss' departure, though they have enjoyed a strong performance since the start of the year, rising by around 11 per cent.Mr Barr, who recently claimed London is 'not a very attractive place' for firms to list shares, will be replaced by IHG's Americas chief executive, Elie Maalouf, on 1 July, though he will remain available to support and advise the business until the end of the year.IHG shares have surged 25 per cent since he took over as chief executive in July 2017.Over his tenure, Barr oversaw the expansion of the hotel chain, 'broadening the portfolio with the addition of seven brands in six years' and 'significantly investing in IHG's digital capabilities and loyalty offer'.Incoming new boss Mr Maalouf, who has been running the Americas division for the past eight years, 'led the delivery of record profits' and 'oversaw the launch of new brands and formats', IHG said.",
        "Chair Deanna Oppenheimer, added: 'His significant industry experience and deep understanding of our business makes him extremely well placed to take on the role of CEO and ensure we continue to progress and execute against our successful strategy.'",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}