{
    "articleURL": "/wires/aap/article-12040619/Mainland-invasion-not-biggest-concern-minister.html",
    "content": [
        "Despite talk of the region's worst strategic environment since World War II, Australia's defence minister says a mainland invasion is not the primary concern.",
        "\"An invasion of Australia is not up there,\" Richard Marles said on Wednesday.\"Obviously, we need a capability and we need to think about the defence of the country and the continent. But that's not really the threat that is being identified.\"A recently released defence strategic review says Australia needs to focus on shoring up its northern bases and increasing the range at which it can strike enemies, putting a particular focus on long-range missiles.Mr Marles said it was this assessment that led to the recommendations to scrap infantry fighting vehicles and focus on long-range ability and landing craft that could transport Australian firepower.The defence minister said while infantry fighting vehicles and tanks would still play an important role in Australia's capability, they had to be balanced against the ability to deploy them.\"In terms of the numbers of infantry fighting vehicles we were looking to procure before the defence strategic review, we didn't have the craft which would be able to transport them,\" he said.\"So you would be talking about a significant number of vehicles which would only ever be in Australia.\"Australia is also working with allies to shore up its northern defences, with talks about expanding Singapore's training presence throughout the country.All of Singapore's fighter pilots are trained at the air force base north of Perth and a large amount of infantry training is conducted in Queensland.",
        "While avoiding specifics, he said Singapore may invest more in the facilities it relies on, including the joint training facility at Greenvale in Queensland.\"That's great for them but it's obviously great for us,\" the minister said.Further co-operation with Japan including through trilateral exercises with US marines based in Darwin has also been slated.Mr Marles also said the deterioration of the situation in the Indo-Pacific in light of a more aggressive China is forcing the government to review its relationship with risk in order to get new capabilities into the defence force faster.\"The environment is not as benign as it has been,\" he said.\"That does imply something in terms of what we need to do around the acceptance of risk, and therefore, the pace with which we move.\"He added that further parts of the defence review's 100 recommendations, many of which have been kept secret, could be declassified in coming years."
    ]
}