{
    "articleURL": "/wires/afp/article-12053995/54-dead-ethnic-clashes-Indias-remote-northeast.html",
    "content": [
        "The death toll after ethnic clashes in India's remote northeast rose to 54 on Saturday, with fresh violence overnight despite authorities rushing in troops to restore order.",
        "Thousands of soldiers were sent to Manipur state after a protest march by a tribal group turned violent on Wednesday.Authorities imposed an internet blackout and issued shoot-at-sight orders in \"extreme cases\" in an effort to contain the unrest.The situation remained tense after a fresh bout of violence on Friday night, hours after the state's top police officer warned that rioters had stolen arms and ammunition from police stations.Hospital morgues in the state capital Imphal and Churachandpur district further south had reported a combined total of 54 dead, according to local media.\"16 bodies were kept in the morgue of the Churachandpur district hospital while 15 bodies were in Jawaharlal Nehru Institute of Medical Sciences in Imphal East district,\" Press Trust of India news agency reported, citing an unnamed local official.\"The Regional Institute of Medical Sciences at Lamphel in Imphal West district reported 23 dead.\"Manipur director general of police P. Doungel told reporters Friday that security forces were bringing the situation under control.Army patrols had \"gone a long way to quell the thing off\", he said.But he added that some police stations had been overrun by \"miscreants\" who stole arms and ammunition, and issued a public appeal for their return.Security forces and the Manipur government have yet to issue an official death toll for this week's violence.",
        "India's law minister Kiren Rijiju told reporters Saturday that \"many lives have been lost\" after days of clashes alongside damage to property.The internet blackout has impeded the flow of information from Manipur and details of the latest clashes remain sparse.An Indian army unit based in neighbouring Nagaland state said 13,000 people had sought shelter from the violence.- 'Fled for our lives' -\"My sons convinced me to escape to safety,\" Pishakmacha Thokchom, 53, told AFP from one of the relief centres set up in Imphal East district.\"But they stayed behind and I'm now deeply worried for them,\" she added.Vijaya Thingaijam, 47, sheltering at the same centre, told AFP he had fled in a panic after a group began firing guns.\"We abandoned all our belongings and fled for our lives,\" he said.On Thursday, security forces fired tear gas in Imphal to disperse protesters, some of whom had set alight vehicles and houses in parts of the city.Burnt out vehicles were seen on streets otherwise empty due to the imposition of a round-the-clock curfew.Defence officials said Friday that additional troops had been brought into the state by road and air.Tribal groups were protesting against demands by the state's majority Meitei community to be recognised under the government's \"Scheduled Tribe\" category.",
        "Indian law gives tribes falling under that designation reserved quotas for government jobs and college admissions as a form of affirmative action to address structural inequality and discrimination.Manipur is part of India's remote northeast, a region linked to the rest of the country by a narrow land corridor that has seen decades of unrest among ethnic and separatist groups.The northeast is home to dozens of tribal groups and small guerrilla armies whose demands range from greater autonomy to secession from India.At least 50,000 people have lost their lives in the conflicts since the first insurgency broke out in Manipur in the early 1950s.Over the years these conflicts have waned, with many groups striking deals with New Delhi for more powers."
    ]
}