{
    "articleURL": "/wires/reuters/article-12060025/Shares-rise-dollar-slips-ahead-U-S-inflation-data.html",
    "content": [
        "Dollar under pressure",
        "Global equity indexes edge upFocus on U.S. inflation, banking surveyBank of England seen hiking again this weekBy Herbert Lash and Amanda CooperNEW YORK/LONDON, May 8 (Reuters) - Global share indexes edged up while Wall Street skidded and the dollar slid on Monday as debt ceiling talks in Washington raised concerns and investors await U.S. inflation data this week that should provide more clarity on Federal Reserve monetary policy.Treasury yields rose on increased optimism that the worst stresses in the U.S. regional banking system may be over, while gold rose as the dollar eased and crude oil advanced about 2%.U.S. President Joe Biden and top Republicans and Democrats from Congress are set to sit down this week to try to resolve a three-month standoff over the $31.4 trillion U.S. debt ceiling and avoid a crippling default before the end of May.Biden is due to meet at the White House on Tuesday with Republican House of Representatives Speaker Kevin McCarthy for the first time since Feb. 1.\"Unfortunately it's probably market turmoil that's going to create the political cover for Biden and McCarthy to come up with some kind of a deal,\" said Jack Ablin, chief investment officer and founding partner at Cresset Wealth Advisors.",
        "\"My sense is it may mean some market disappointment and volatility in order to make that happen,\" he said.In Europe, the broad pan-regional STOXX 600 index rose 0.34% on expectations non-U.S. stocks will outperform in the months ahead. MSCI's gauge of stocks across the globe , which is tilted toward U.S. assets, gained 0.20%\"We're already at our year-end target right now\" for U.S. stocks, Ablin said. \"There isn't a lot left, at least for U.S. equities, for the remainder of this year.\"On Wall Street, the Dow Jones Industrial Average fell 0.2%, the S&amp;amp;P 500 lost 0.03% and the Nasdaq Composite dropped 0.18%.The dollar remained relatively weaker against most of its major peers. The dollar index fell 0.049%, while the euro fell 0.03% to $1.1015.Sterling, which has gained 4.4% against the dollar this year, earlier hit a 12-month high of 1.2668 ahead of an expected Bank of England rate increase on Thursday.Friday's robust U.S. payrolls report has prompted investors to dial back their expectations for the timing and size of the Fed's first interest rate cut. Wednesday's consumer price data is expected to show core inflation slowed moderately.\"The market is ready for a good slowdown here, despite the jobs number we saw on Friday,\" said Tom di Galoma, co-head of global rates trading at BTIG in New York.",
        "\"The Fed is probably done. I don't think they're going to be tightening any further,\" he said. \"There was enough last week to tell me that the Fed is in a pause.\"The two-year Treasury yield, which typically moves in step with interest rate expectations, was up 5 basis points at 3.972%.The gap between yields on two- and 10-year notes , seen as a recession harbinger when the short end of the yield curve is higher than longer-dated securities, was inverted at -47.8 basis points.Money markets show investors expect U.S. rates to have now peaked and could end this year at about 4.35%.The dollar has fared better on the yen as the Bank of Japan remains the only central bank in the developed world to not have tightened policy.The dollar rose 0.01% against the yen.Later on Monday, the Fed's survey of loan officers will draw attention as markets seek to gauge the impact of regional banking stress on lending.\"The survey should point to further broad-based tightening in bank lending standards,\" said Bruce Kasman, head of economic research at JPMorgan.\"Continued stress in the banking system does, of course, increase concern that a disruptive financial market event is on the horizon,\" he added. \"Though our analysis suggests that the impact of a credit tightening against an otherwise healthy backdrop tends to be limited.\"",
        "Bullion regained ground after a sharp retreat in the previous session, ahead of the inflation data that could shed light on the outlook for U.S. interest rates.Spot gold added 0.4% to $2,023.81 an ounce.Oil rose as U.S. recession fears eased and some traders took the view that crude's recent price slide was overdone with three straight weekly declines for the first time since November.U.S. crude recently rose 2.52% to $73.14 per barrel and Brent was at $76.94, up 2.18% on the day.(Additional reporting by Wayne Cole; Editing by Alison Williams, Christina Fincher and Jonathan Oatis)"
    ]
}