{
    "articleURL": "/wires/pa/article-12045561/Zelensky-visits-The-Hague-denying-Kremlin-drone-attack-claims.html",
    "content": [
        "Ukrainian president Volodymyr Zelensky has made a surprise visit to the International Criminal Court, which has issued an arrest warrant for Russian president Vladimir Putin for alleged war crimes in Ukraine.",
        "Mr Zelensky’s visit to The Hague, which hosts the ICC and the United Nations’ top judicial organ, the International Court of Justice, came a day after he denied that Ukrainian forces were responsible for what the Kremlin called an attempt to assassinate Mr Putin in a drone attack.On a visit to Helsinki on Wednesday, Mr Zelensky told reporters: “We didn’t attack Putin. We leave it to (the) tribunal.”Ukraine’s Air Force Command said on Thursday that Russian forces attacked multiple Ukrainian regions overnight with Iranian-made drones. Air raid sirens sounded across Ukraine overnight and explosions were reported in the southern city of Odesa and the capital, Kyiv.Ukraine’s military said that in Odesa, three drones — inscribed “for Moscow” and “for the Kremlin” referencing the alleged Ukrainian attack on Wednesday — hit a dormitory of an educational facility but the fire was quickly put out and there were no casualties.Kyiv was targeted with drones and missiles, its military administration said, in what was the third airborne attack on the capital in four days. All of them were shot down.The ICC said in a March 18 statement that Mr Putin “is allegedly responsible for the war crime of unlawful deportation of (children) and that of unlawful transfer of (children) from occupied areas of Ukraine to the Russian Federation”.",
        "But the prospect of Mr Putin being sent to The Hague is a remote one as the court does not have a police force to execute warrants and the Russian president is unlikely to travel to any of the ICC’s 123 member states that are under an obligation to arrest him if they can.ICC prosecutor Karim Khan has made repeated visits to Ukraine and is setting up an office in Kyiv to facilitate his investigations in the country.However, the ICC does not have jurisdiction to prosecute Mr Putin for the crime of aggression — the unlawful invasion of another sovereign country.The Dutch government has offered to host a court that could be established to prosecute the crime of aggression and an office is being established to gather evidence.",
        "The new International Centre for Prosecution of the Crime of Aggression should be operational by summer, the European Union’s judicial cooperation agency, Eurojust, said in February.Mr Zelensky’s visit to The Hague came as questions continued to swirl around Russia’s claim that it foiled an attack by Ukrainian drones on the Kremlin early on Wednesday. Moscow branded it an unsuccessful assassination attempt against Mr Putin and promised retaliation for what it termed a “terrorist” act.Mr Putin was not in the Kremlin at the time and was at his Novo-Ogaryovo residence outside Moscow, his spokesman Dmitry Peskov told Russia’s state news agency RIA Novosti.",
        "There was no independent verification of the purported attack, which Russia authorities said occurred overnight but presented no evidence to support it.Questions also arose as to why it took the Kremlin hours to report the incident and why videos of it also surfaced later in the day.White House press secretary Karine Jean-Pierre said the US was “unable to confirm the authenticity” of Russia’s claims of a Ukrainian attack on Moscow.",
        "Asked whether the US believed Mr Putin was a lawful target of any potential Ukrainian strike, Ms Jean-Pierre said that since the start of the conflict, the US was “not encouraging or enabling Ukraine to strike beyond its border”.Asked whether the US was concerned that the accusation might have been a false flag operation by Russia to serve as a pretext for more aggressive military action on Ukraine, Ms Jean-Pierre said she did not want to speculate, but added: “Obviously Russia has a history of doing things like this.”The Netherlands has been a strong supporter of the Ukrainian war effort since Russia’s invasion last year.Among military equipment Prime Minister Mark Rutte’s government has promised are 14 modern Leopard 2 tanks it is buying together with Denmark. They are expected to be delivered next year.The Netherlands also joined forces with Germany and Denmark to buy at least 100 older Leopard 1 tanks for Ukraine.",
        "Among other military hardware, it also sent two Patriot air defence missile systems and promised two naval minehunter ships as well as sending military forensic experts to assist war crime investigations. Mr Zelensky’s visit came on the day the Dutch remember their war dead."
    ]
}