{
    "articleURL": "/femail/article-12043151/Steal-style-crown-street-party.html",
    "content": [
        "Celebrate the Coronation in clothes that hark back to an era that embraced modesty, femininity and a touch of glamourREAD MORE: JO ELVIN's got red, white and blue Coronation style covered Fashion has gone all-out retro crazy — and that’s great news for this weekend, for there’s no occasion more retro than that of a coronation.",
        "I’m not talking about the recent resurgence in 1990s and 2000s style, either. Yes, it looked for a moment like we’d all be celebrating in ripped jeans and bandeau tops, but the style gods have smiled on us with an influx of street-party-ready dresses that hark back a few decades beyond.After seasons of shapeless midis, this summer sees the return — hallelujah — of more structured, feminine shapes. Designs that are built for your bust, which cinch you in at the waist, and generally support a more regal posture. Designers are having great fun creating elegant curves: A-line skirts, corseted waists and exaggerated peplums, harking back to an era that embraced modesty, femininity and a touch of glamour.On the Spring/Summer catwalks, waists were whittled, skirts swished. But on the High Street, the leaders in this field include LK Bennett, whose kitsch, ladylike designs were made for this moment. ",
        "Its bright blue-and-white gingham shirtdress (far right) comes with tie-detail sleeves and a flattering, flared midi skirt. It’s worth noting that the brand’s occasion wear now goes up to size 20.Less is more at Samantha Cameron’s Cefinn. The pink shirt-sleeve midi dress (centre) with detachable belt — great for highlighting that waist — and striking red stitching is a piece worth investing in. Oh, and as a bonus, it’s machine washable.",
        "If you’re on a budget, make a beeline for Karen Millen (third from right), whose fabulous blue lace midi dress is currently on sale. Scared of spaghetti straps? Simply shoulder-robe a knit cardigan, dahling. Very Royal.And make sure you check out Hobbs’ occasion wear; this red-and-pink full-skirted design (third from left) could be straight off the catwalk at Erdem.To get that retro look, opt for polka dots, stripes, checks or florals — but don’t succumb to kitsch clichés such as Union Jacks, regardless of how fun they are.Save them for tablecloths, bunting and comedy hats, rather than buying a dress you’ll never wear again.Now somebody pass me the Pimm’s!"
    ]
}