{
    "articleURL": "/wires/pa/article-12048879/TSB-warns-scams-platforms-Facebook-WhatsApp-Instagram.html",
    "content": [
        "TSB has issued a warning on the scale of social media scams taking place through services such as Facebook, WhatsApp and Instagram, as the bank says a significant proportion of the cases it sees have been coming through these platforms.",
        "The bank said that its own internal data indicates scams that come through these Meta-owned companies account for around 80% of fraud cases within the three biggest fraud categories at TSB.TSB analysed its customer fraud data from January 2021 to December 2022 to make the findings. The data relates to cases where the platform has been recorded.Purchase, impersonation and investment fraud are the three biggest fraud categories at TSB by case load/volume.TSB fraud experts are urging people to watch out for unsolicited messages claiming to be from family, or close friends. They advise contacting the person directly, if possible, before ever sending a payment.They are also urging potential investors to stick to recognised investment platforms and to steer clear of social media “get-rich-quick” schemes.",
        "TSB launched its own fraud refund guarantee in 2019 and it said 97% of fraud cases it sees are reimbursed through this.The guarantee covers customers who are innocent victims of fraud on their TSB account. Under the guarantee, customers are not reimbursed if, for example, they are found to have been involved in the fraud themselves or deemed to have abused the guarantee.Paul Davis, director of fraud prevention, TSB, said: “Social media companies must urgently clean up their platforms to protect the countless innocent people who use their services every day.",
        "“In the meantime, we are urging the public to remain cautious to potential scam content – and to spread the word to help protect those around you. Social media companies must urgently clean up their platforms to protect the countless innocent people who use their services every day  Paul Davis, TSB  “It’s high time that social media and telephone companies took financial liability for the rising levels of fraud taking place on their platforms.“Our fraud refund guarantee continues to play a vital, often life-changing role in returning money to innocent victims of fraud, who fall foul due to vulnerabilities in other sectors.”Meta is working with Stop Scams UK to help victims and remove scams at the source.It recently launched Stop. Think. Call., a scams awareness campaign by WhatsApp and the National Trading Standards’ Friends Against Scams campaign, with support from Citizens Advice.It also recently rolled out a new process requiring financial services advertisers targeting users in the UK to be authorised by the Financial Conduct Authority. We don't want anyone to fall victim to these criminals which is why our platforms have systems to block scams, financial services advertisers now have to be FCA authorised and we run consumer awareness campaigns on how to spot fraudulent behaviour  Meta spokesperson  ",
        "A Meta spokesperson said: “This is an industry-wide issue and scammers are using increasingly sophisticated methods to defraud people in a range of ways including email, SMS and offline.“We don’t want anyone to fall victim to these criminals which is why our platforms have systems to block scams, financial services advertisers now have to be FCA authorised and we run consumer awareness campaigns on how to spot fraudulent behaviour.“People can also report this content in a few simple clicks and we work with the police to support their investigations.”Earlier this week, the Government unveiled a new fraud strategy, which will include banning cold calls on financial products, such as those relating to insurance or sham cryptocurrency schemes.It also plans to work with Ofcom to use new technology to further clamp down on number “spoofing”, so fraudsters cannot impersonate legitimate UK phone numbers.Under the plans, banks will also be allowed to delay payments from being processed for longer to allow for suspect payments to be investigated.The Government said it will also ban other devices or methods commonly harnessed by scammers to reach thousands of people at once – such as so-called “sim farms” and review the use of mass-texting services to keep these technologies out of the hands of criminals.",
        "Rocio Concha, Which? director of policy and advocacy at consumer group Which?, said: “The Online Safety Bill has been going through Parliament for more than a year and progress has been much too slow, with people still being scammed every day.”"
    ]
}