{
    "articleURL": "/wires/aap/article-12057819/Westpac-hikes-dividend-1H-profit-rises-22pct-4b.html",
    "content": [
        "Westpac is lifting its dividends after increasing net profit 22 per cent in the six months to March 31, as the bank cut operating expenses and paid less in remediation.",
        "Australia's oldest bank on Monday announced a net profit of $4 billion and lifted its dividend 15 per cent.\"Our first-half result reflects the progress we've made in becoming a simpler, stronger bank,\" said chief executive Peter King.\"Disciplined cost and margin management has lifted our return on equity and allowed us to increase dividends to 70 cents per share.\"The bank's net interest margin - the difference between interest earned from lending and interest paid on deposits - was up five basis points to 1.96 per cent, still below historic levels.Its operating expenses of $4.99 billion were seven per cent lower than in the same period a year ago, which Westpac credited to a simpler organisational structure, reduced use of third-party service providers and lower remediation costs.Westpac said that three-quarters of its customers were ahead on their mortgage, with nearly a third being two or more years ahead. But more have been calling to discuss their situation as rates rise, Mr King said. The official cash rate has gone from 0.1 per cent to 3.85 per cent in just 13 months.\"Interest rates are now closer to their forecast peak but we are focused on how long they stay high and what this means for household budgets and discretionary spending,\" Mr King said.",
        "\"We expect to see more stress in the period ahead, particularly in small business.\"As of March 31, 1.39 per cent of Westpac's mortgage customers were 30 or more days delinquent on their mortgages, up slightly in recent months but down from 1.59 per cent in March 2019, before the pandemic. Also, Westpac had 227 consumer properties in its possession, compared to 482 four years ago.David Berthon-Jones, co-chief investment officer of Aequitas Investment Partners, tweeted that the results were \"better than expected across the board\" for Westpac.Similar to ANZ, \"the key was low expectations coming into the results, which both companies hurdled,\" he wrote. That was in contrast to CBA and NAB, which disappointed, he added.At 1103 AEST, Westpac shares were up 2.2 per cent to $21.82."
    ]
}