{
    "articleURL": "/wires/ap/article-12045191/In-latest-abortion-law-chapter-Bill-signings-court-rulings.html",
    "content": [
        "Courts this week blocked abortion restrictions from taking effect in two states, while lawmakers in a third are forging ahead with a plan for a new ban that's less stringent than most.",
        "Those are some of the latest developments in an abortion landscape that is being crafted by lawmakers, governors and courts across the country in the aftermath of last year's U.S. Supreme Court ruling that overturned Roe v. Wade and the nationwide right to an abortion.Some things to know:NORTH CAROLINA GOP LAWMAKERS GET ON SAME PAGENorth Carolina lawmakers announced this week that they had agreed to new new abortion restrictions that would be among the least onerous adopted since last year.By Thursday, the Republican-controlled House and Senate had passed the bill, setting up a veto showdown.",
        "The bill would ban abortions after 12 weeks of pregnancy with exceptions in cases of rape, incest or fetal abnormality. Current exception for cases when the life of a pregnant woman is in danger would remain. The state currently bans abortion in most cases after 20 weeks of pregnancy.Democratic Gov. Roy Cooper has indicated that he would veto the measure, which he called \"an egregious, unacceptable attack on the women of our state.\"But after one state lawmaker flipped from the Democratic Party last month to become Republican, the GOP has veto-proof majorities in both legislative chambers.COURTS REBUFF NOVEL RESTRICTIONSMontana Gov. Greg Gianforte's administration and lawmakers in Utah were testing some abortion restrictions that are outside what other Republican-led states are doing.",
        "In Montana, a new rule would have required doctors to provide documentation showing that an abortion was medically necessary due to rape, incest or a threat to the health of the pregnant woman before the state's Medicaid program would have paid for it.In Utah, where a ban on abortions at all stages of pregnancy is already on hold as a court considers its legality, lawmakers passed a ban on abortion clinics.Abortion-rights advocates in both states said the restrictions would have gone too far.In rulings this week, judges nixed both ideas, at least while courts decide whether they're legal.MONTANA REPUBLICANS KEEP PUSHINGThe Medicaid rule isn't the only Montana abortion restriction a judge has put on hold. Courts also have blocked enforcement of a ban after 20 weeks of pregnancy.With that on hold, lawmakers have turned to other restrictions.On Wednesday, Gianforte signed a law requiring the same Medicaid preauthorization steps that the blocked rule included, along with four other anti-abortion laws.Among them: a declaration that the state constitution's right to privacy does not include the right to an abortion and banning dilation and evacuation abortions, the most common method used after 15 weeks.PROTECTIONS ADVANCEJust as most Republican-controlled states have enacted bans or deeper abortion restrictions since last year, at least 19 Democratic-dominated states have now taken steps through a law, constitutional amendment or executive order to protect access.",
        "Most of the states where the status quo remains are those where the political leadership is divided between the two parties.On Wednesday, Maryland Democratic Gov. Wes Moore signed laws protecting access to both abortion and gender-affirming care. Like other states, Maryland now protects people from being forced to cooperate with criminal investigations by other states into medial treatments that are legal in Maryland.Additional new laws protect medical and insurance records on reproductive health in electronic health information exchanges and ensure that public colleges and universities have a plan for student access to birth control, including emergency contraception and abortion pills.Also, a constitutional amendment to protect abortion access will be on the ballot in 2024.Democrats took complete control of the executive and legislative branches of state government this year after eight years with a Republican governor.On Tuesday, Oregon representatives passed a similar bill, sending it to the Senate. On Wednesday, Republican senators didn´t show up to work, denying the Democrats who control the chamber a quorum and casting doubt on planned votes later this week the legislation.Also Wednesday, Michigan's House passed a bill that would bar companies from retaliating against employees who obtain abortions, sending it to Democratic Gov. Gretchen Whitmer.FEDERAL GOVERNMENT INVESTIGATESA federal government investigation concluded that two hospitals that refused to provide an emergency abortion violated the law.",
        "The U.S. Department of Health and Human Services is looking at hospitals in Kansas and Missouri that would not provide an abortion for a woman whose water broke early at 17 weeks of pregnancy. Doctors at both said that the fetus would not survive and the woman was at risk of serious infection or losing her uterus. But they wouldn't terminate the pregnancy because a fetal heartbeat was still detectable.The government said that violates a federal mandate that doctors provide abortions when a woman's health is at risk.The government did not issue fines but did tell the medical centers to correct the problems that led to the patient being denied an abortion.LOCAL RESTRICTIONSThe City Council in Danville, Illinois, on Tuesday narrowly passed an ordinance restricting the shipping of abortion pillsA clinic is proposed for the community near the border with Indiana, where a ban on abortions throughout pregnancy was put on hold by courts. Officials in Illinois, by contrast, have tried to position the state as a safe haven for out-of-state abortion-seekers.State officials and abortion-rights advocates said the law is both unlawful and unenforceable.Local restrictions have not done well elsewhere.Five local governments in Democratic-controlled New Mexico passed them. In March, the state´s Supreme Court blocked enforcement for now. And last year, one Ohio town decided to rewrite its restrictions rather than defending them in court."
    ]
}