{
    "articleURL": "/wires/ap/article-12060399/Indiana-judge-deals-blow-states-lawsuit-against-TikTok.html",
    "content": [
        "INDIANAPOLIS (AP) - An Indiana judge has ruled that downloading the free social media app TikTok doesn´t amount to a consumer transaction under state law, dealing a blow to the state attorney general´s lawsuit claiming the Chinese-owned video-sharing platform misleads its users about the level of inappropriate content and security of consumer information.",
        "The decision issued last week denied the request from Republican Attorney General Todd Rokita for a court order preventing TikTok from stating on online app stores that it has \"none\" or \"infrequent/mild\" references to drugs, sexual or other inappropriate content for children as young as 12.Judge Craig Bobay of Allen County Superior Court in Fort Wayne also ruled that state courts don´t have authority over TikTok´s statements to Apple´s app store as both companies are based in California.\"No aspect of the age rating process takes place in Indiana,\" the judge wrote. \"This suit-related conduct is not related to and does not arise out of TikTok´s conduct within or directed to Indiana.\"The lawsuit, which was filed in December, makes arguments similar to those from many state and federal lawmakers and government officials who have claimed the Chinese government could harvest U.S. user data from TikTok and use the platform to push pro-Beijing misinformation or messages to the public. TikTok, which is owned by the Chinese tech giant ByteDance, has said it has never been asked to hand over its data and denied the Indiana lawsuit´s claims.Indiana is among several states and the federal government that have ordered the TikTok app deleted from government-issued devices.Bobay ruled that Indiana´s consumer protection law doesn´t extend to the downloading of free apps as no money was exchanged and that the attorney general´s office was unlikely to win a trial over the lawsuit.",
        "A statement released by the attorney general´s office didn´t address whether it planned to appeal the judge´s ruling while encouraging Indiana residents to remove the TikTok app from their devices.\"At the heart of this case is our fight against TikTok´s ongoing engagement in illegal deceptive consumer practices,\" the statement said. \"Protecting our kids from TikTok´s insidious and invasive content is critical.\"The attorney general´s office has opposed TikTok´s effort to have a companion lawsuit moved from state court to federal court. A federal judge in Fort Wayne is scheduled to hear arguments Tuesday over that request."
    ]
}