{
    "articleURL": "/wires/reuters/article-12049293/NHL-Panthers-beat-Maple-Leafs-grab-commanding-2-0-series-lead.html",
    "content": [
        "By Frank Pingue",
        "TORONTO, May 4 (Reuters) - The Toronto Maple Leafs were considered Stanley Cup favourites when the second round began but now have their backs to the wall and are staring at a 2-0 series deficit following a 3-2 loss to the Florida Panthers on Thursday.Toronto, a talented but long-underachieving club that this year finally won a playoff series for the first time since 2004, were undone by costly turnovers that Florida pounced on to secure a firm grip on the best-of-seven series.The Maple Leafs, who will play the next two games on the road, now face an uphill climb as NHL teams that have won the first two games of a best-of-seven playoff series have advanced 86% of the time.\"We are all obviously disappointed. To be down 2-0 is not what we want but it's a long series and there's lot of hockey left,\" said Toronto forward Ryan O'Reilly. \"We have to keep building our game, get better as we go and I am not worried.\"Toronto got goals from Alex Kerfoot and O'Reilly to grab control five minutes into the game but Florida responded before the first intermission when Sam Reinhart set up Anton Lundell with a brilliant backhand pass from behind the net.\"We knew they were going to come out with a big push and they came out good,\" said Panthers forward Sam Bennett.",
        "\"But we didn't have any panic in our game and we just stayed patient, stuck to our game, stuck to what has given us success all year and we able to ... after that first 10 minutes just play a solid rest of the game.\"Florida then stormed into the lead with two goals in a 66-second span to start the second period when a pair of Toronto turnovers led to goals from Aleksander Barkov and Gustav Forsling that sucked the energy from the home crowd.\"We obviously had a couple mistakes and just got to do a better job with taking care of the puck and making sure that we start off the period the right way,\" said Toronto captain John Tavares.\"Obviously put us in a tough spot and its something we have to be better with.\"A desperate Toronto team ramped up the pressure in the third period and threw everything they had at the Panthers but Sergei Bobrovsky was brilliant as he flashed the form that earned him the Vezina Trophy as the NHL's best goalie in 2013 and 2017.Few in the NHL world expected much from a Panthers team that only clinched a playoff berth with two days left in the regular season and then opened the playoffs against a top-seeded Boston team coming off a record 65-win campaign.",
        "But the Panthers roared back from a 3-1 series deficit to eliminate Boston and are now surprisingly in complete control while the Maple Leafs are reeling.Toronto, considered the team to beat among the eight clubs remaining in the NHL's postseason, now must figure things out quickly if they want keep alive their hopes of winning the franchise's first Stanley Cup since 1967.Game Three of the series is on Sunday. (Reporting by Frank Pingue in Toronto; Editing by Robert Birsel)"
    ]
}