{
    "articleURL": "/news/article-12050023/Frightened-locals-prisoners-homes-feral-thugs-beat-child.html",
    "content": [
        "Worcestershire town of Malvern Link has been terrorised for several months  A gang of 'feral thugs' has been terrorising the residents of a sleepy town, threatening to stab people and stealing from families, leaving elderly locals trapped in their own homes.  ",
        "Locals in Malvern Link in Worcestershire say they have been tormented by the group, captured on camera loitering outside a family home, for several months. The yobs, thought to be aged between 12 and 16, have been threatening people with knives and throwing stones at houses, as well as urinating in gardens, stealing and putting burning objects through people's letterboxes.Parents have said they are too scared to let their children play outside after one boy was beaten up by the gang.Elderly residents in the rural town say they have been left 'prisoners in their own homes' as they are terrified that they will be attacked.",
        "One couple living on Cedar Avenue, where house prices average £320,000, caught the hooded youths on their Ring doorbell camera last week.Footage shows the intimidating gang swarming around their driveway before going into the garden and stealing their son's £1,000 bag and £300 bike from a cabin.Celia McCullough, 47, who lives with partner Neil Topping, 49, said they rushed home after watching the theft last weekend unfold when an alert on the Ring app on their mobile phones enabled them to view footage from their doorbell. Mother-of-two Celia later uploaded the footage to social media to raise awareness and catch those responsible - but was told by police to take it down.",
        "She said: 'We saw the group on the footage and we were able to count 21 people that were involved looking at my camera and my neighbours.'It was scary seeing them all at the end of our driveway.'They rushed into our garden and stole my son's bag from our cabin. They also stole an expensive bike as well.'We were driving back home after we found out, but we were told by a neighbour that they had already left and had made their way to Malvern Link station.",
        "'We heard that they were also throwing stones at homes and urinating on properties as well.'Since uploading it to social media I have been told countless other stories from people who have been terrorised by these same kids.'One said they were too scared to let their children play out after a boy was beaten up by them. They have threatened another with a knife.'I've been told they put things on fire through someone's postbox. It's just awful. This is a nice quiet area with a lot of elderly residents.'This isn't a big city where you might sort of expect this thing, although it's unacceptable anywhere, we moved here because it was beautiful and quiet.'They need to be stopped, but when I uploaded the footage I was told by police to take it down because an investigation was ongoing.",
        "'But we haven't seen them do anything to stop them. We understand they come from Worcester by train to purposely target our little town.",
        "'Surely something could be done at either train station to stop them coming here. They have been causing havoc for months and nobody seems to want to act.'I want to make the people of Malvern Link aware of this because things are getting worse here.'We live on such a quiet road and things like this do not normally happen.'We have had so many people on social media telling us of similar incidents involving this group.'They are terrorising people and people are scared. It needs to stop.'Ms McCullough said that the attitudes of the youths towards the police were 'awful'.She said: 'We were on the phone with the police the whole time on the way to the station and they were fantastic when they arrived.'The attitudes of these youths were awful, even when the police were dealing with them. They don't seem to care.'One elderly resident, who did not wish to be named, added: 'We've been too scared to go out because these feral thugs have been running riot.'They just don't seem to care about anything other than being hellbent on causing trouble. We've become prisoners in our own homes.'",
        "Locals say the group was the same that was banned from Malvern Link station by police at the weekend.Eight officers issued five dispersal notices to some of the teenagers, meaning they could not visit the train station for up to 48 hours.A spokesperson for West Mercia Police said: 'Officers in Malvern have issued five dispersal notices for this weekend following reports of youths in the area of Malvern Link on the evening of Saturday, April 29, engaging in anti-social behaviour.'The dispersal order has been imposed under Section 34 of the Anti-social Behaviour, Crime and Policing Act 2014.'Dispersal orders make it an offence for anyone to return to a specific area for up to 48 hours.'Inspector Dave Wise, of West Mercia Police, said: 'We are aware of a number of incidents linked to youth related anti-social behaviour in the Malvern area.'Those responsible for repeated instances of anti-social behaviour are being identified and considered for anti-social behaviour injunctions.'Officers will be carrying out patrols in areas where concerns have been raised and identified individuals can expect to be subject to stop and search wherever it is lawful and proportionate to do so.'We recognise the impact incidents such as the disorder at Cedar Avenue can have on our community and we are listening to those concerns.",
        "'I'd urge anyone with information regarding individuals who may be carrying weapons to report that without delay.'"
    ]
}