{
    "articleURL": "/sport/mma/article-12045601/Jon-Jones-admits-huge-Stipe-Miocic-showdown-fight.html",
    "content": [
        "Jon Jones made a stunning return to beat Ciryl Gane and win vacant title He is set to face Stipe Miocic next and does not plan on sticking around Jones said it is likely to be his final UFC fight unless Francis Ngannou returns Jon Jones has revealed that unless Francis Ngannou comes back to the UFC, a clash with Stipe Miocic will be the last of his career. ",
        "'Bones' made a sensational return to the octagon earlier this year, defeating Ciryl Gane with ease in the first round to win the vacant heavyweight title. His legacy as arguably the greatest fighter of all time is effectively assured and rubberstamped with victory over Miocic, who most regard as the best heavyweight ever. 'I feel like the Stipe fight will be plenty for me,' Jones told Fox Sports Australia.  'I really don't feel like I have much to prove after beating Stipe Miocic. I've been in the game a long time, and in fighter years, I'm an old guy.",
        "'I've got some small injuries and I just really want to be around. 'I want to be around for my family, I want to be around for my kids, I want to be able to play with my kids and have a good head on my shoulders, and joints that work. 'So yeah, I can see it coming to an end really soon.'That said, former heavyweight champion Ngannou, who left the UFC as a free agent in acrimonious circumstances, could yet tempt Jones to stay on. Dana White said unequivocally that Ngannou would not fight again in the UFC, after both parties failed to agree terms to a new deal. Ngannou has not yet announced his next move, which is expected to be either a high profile boxing match or signing for another MMA promotion.  ",
        "'I do believe a Francis Ngannou fight would be worth entertaining not retiring,' Jones explained. 'I think a Francis fight would come with some serious revenue, and that would make it worth my while. ",
        "'Francis is a former champion, he's pretty damn popular [in the U.S.], and across the world. It would bring in a lot of money, and for that, I'd be willing to come back.' Miocic has been out of action since being brutally knocked out by Ngannou back in March 2021. And he would also feel his legacy would be set in stone if he came back to win the heavyweight title by beating Jones. It remains to be seen when the fight would take place but it is thought that it could well be in New York this autumn.  "
    ]
}