{
    "articleURL": "/news/article-12047389/NYC-subway-victim-Jordan-Neely-Michael-Jackson-impersonator-autism-schizophrenia.html",
    "content": [
        "Jordan Neely was a Michael Jackson impersonator who performed around NYCHis mental health declined after at 14 his mother was killed by his stepfatherIn the last decade, he fell victim to homelessness and was arrested 42 times Jordan Neely was a street performer strangled to death by a former Marine who put him in a chokehold on the New York City subway on Monday.",
        "Neely, 30, was a famous Michael Jackson impersonator and often seen across the city dancing in a red Thriller leather jacket and the popstar's quintessential loafers.According to his family, he suffered from autism and schizophrenia and was permanently scarred by the murder of his mother, Christine Neely, in 2007.He was just 14 at the time and in the following years fell victim to homelessness and tried and failed multiple times to live with his father.According to the New York Daily News, he was arrested 42 times in the last decade.'The whole system just failed him. He fell through the cracks of the system,' his aunt Carolyn Neely told the New York Post.",
        "Neely's aunt spoke of her sister's death and described its impact on her nephew.'My sister Christie was murdered in '07 and after that, he has never been the same.'It had a big impact on him. He developed depression and it grew and became more serious. He was schizophrenic, PTSD. Doctors knew his condition and he needed to be treated for that,' Carolyn said.A family friend told the newspaper that Neely 'suffered so much because of what happened to his mother. She was his sole support. His father sure wasn't.'",
        "That friend said he tried to live with his father on multiple occasions but the pair did not get along.",
        "In 2012, Neely was called to testify in the murder trial against the man who murdered his mother in Bayonne, New Jersey, reported NJ.com at the time.According to the testimony, Neely attempted to say goodbye to his mother one morning before going off to school. He said his stepfather Shawn Southerland blocked him from going into the bedroom by padlocking it.The following day, Neely said Southerland moved out of the home and he never saw him again.Neely's father told the Daily News in an interview that his son became a 'complete mess' afterwards. 'After we buried her, he just wasn't the same anymore,' said his father, Andre Zachery. 'They were very close. He loved her so much that he just lost it.'He said in a tribute: 'Jordan was a good man. He was a good person. He grew up good. He always had a (temper), but he never used to hurt anyone... He wasn't bad. He was beautiful.'Zachery said his son began mimicking Michael Jackson at the age of four or five. 'He looked just like him. He used to perform on the block. One day, people were loving him,' he said.He said he had not seen his son for four years and that because he rarely took his autism medication it was difficult for him to find work.",
        "According to the Daily News report, Neely was arrested 42 times over the last 10 years and last arrested in November 2021 for hitting a 67-year-old woman in the face.The last contact Zachery had with his son was a letter sent to him while Neely was in prison. It read in part, 'Dad, I disobeyed you. And I'm sorry.'",
        "Video of the altercation that killed Neely posted online showed a 24-year-old Marine lying beneath him, holding him in a headlock position for several minutes as he tried and failed to break free. Rep. Alexandria Ocasio-Cortez called Neely's death a 'public murder.' Rev. Al Sharpton likened the Marine's actions to that of famed subway gunman Bernie Goetz, referring to the shooting of four black men on a train beneath Manhattan just before Christmas in 1984.'We cannot end up back to a place where vigilantism is tolerable,' he said. 'It wasn't acceptable then, and it can't be acceptable now.'However, NYC Mayor Eric Adams urged caution on Wednesday night.'I don't think that's very responsible at a time when we're still investigating the situation. Let's let the DA conduct his investigation with the law enforcement officials, to really interfere with that is not the right thing to do,' he said.'To interfere with that is not the right thing to do. I'm going be responsible and allow them to do their job to determine exactly what happened.'"
    ]
}