{
    "articleURL": "/wires/afp/article-12044965/Iraqi-Kurds-crossfire-Turkish-army-militants.html",
    "content": [
        "Under an almond tree in his garden, Moustafa Ahmed shows a handful of bullet casings he collected near his home in Iraq's autonomous Kurdish region.",
        "Residents of his village in Iraq's mountainous far north often find themselves caught in the crossfire between the Turkish army and fighters from the Kurdistan Workers' Party (PKK).\"Most of the inhabitants have left,\" said Ahmed, from the Kurdish village of Hiror in a green valley near the Turkish border, an area that for decades has seen fighting between the two forces.Turkish forces hold dozens of positions on the mountain heights while PKK fighters, who are Turkish Kurds, maintain rear bases in the Iraqi territory.\"Our life has become hell, we no longer feel safe at home,\" said Ahmed, aged in his 70s, who said once a shell hit the ground near his home.Ten of Ahmed's 12 children have left the region, he said, a cigarette between his lips.",
        "\"Out of the 50 families in the village, there are only 17 left. The others have abandoned their homes and their land for fear of the bombardments.\"Those who have stayed endure the daily roar of military planes above and the buzzing of Turkish military drones.Armed men are nearby, \"over there, on these heights,\" Ahmed said, pointing to the wooded mountains surrounding Hiror.\"They see us and know what we are doing. We can no longer go to our fields or graze our animals.\"",
        "- 'Gunfire, shrapnel, shelling' -The PKK, designated a \"terrorist\" group by Ankara and its Western allies, has since 1984 waged an insurgency in Turkey in unrest that has claimed tens of thousands of lives.Turkish forces have long maintained military positions inside northern Iraq where they regularly launch operations against the militants.",
        "In early April, Turkey was accused of bombarding the airport at Sulaimaniya, Iraqi Kurdistan's second city.Several days earlier, Ankara had halted flights to and from Sulaimaniya, citing an increased PKK presence at the airport.In Hiror village, 60-year-old Adib Moussa was preparing to drive his pick-up truck to a nearby village that has been spared from the conflict, where he has left his cattle in the care of an acquaintance.\"This is the third year that we have seen this -- Turkey entered our regions and surrounded our village,\" said the moustachioed farmer with a weathered face.\"There are many houses damaged by gunfire, shrapnel or shelling,\" added Moussa, a father of 10 children.His neighbour, father of two Mahvan Ahmed, showed AFP a concrete railing riddled with bullet holes on his roof terrace.\"After dark, we hear gunshots and explosions,\" said the 37-year-old.He said he hopes that Baghdad will intervene to \"solve this problem, so that the Turks leave and we can resume a normal life\".",
        "- 'Gone forever' -Baghdad and Arbil, Iraqi Kurdistan's capital, have long been accused of ignoring the situation to preserve their strategic alliances with Ankara, only offering symbolic condemnations of violations of Iraq's sovereignty and the impact on civilians.Turkey is one of war-battered Iraq's main trading partners and until March Arbil was exporting oil directly to Turkey, independently of the federal government in Baghdad.",
        "In July 2022, nine people died when artillery shells hit a recreational park in the border village of Parakh, with most of those killed holidaymakers from southern Iraq.Iraq blamed Turkey, which denied any responsibility and accused the PKK.Ramadan Abdallah, 70, was seriously wounded in June 2021 when an explosive struck about three metres (10 feet) from where he was standing.He underwent three operations on his lower back and leg.\"The doctors couldn't get some shrapnel out that had lodged in my leg, it still hurts me when it's cold,\" Abdallah said.The burly man with a coarse beard now walks with a cane and has moved into his son's house in Zakho, a small town nine kilometres (six miles) from the border.The old man said he hopes for an end to the region's troubles.\"I dream of one day closing my eyes and reopening them to see all the Turkish soldiers gone forever,\" he said."
    ]
}