{
    "articleURL": "/news/article-12052217/Netflixs-terrifying-horror-series-Marianne-leaving-viewers-scared-lives.html",
    "content": [
        "Netflix's Marianne, a 2019 French horror series, has left even the toughest scary movie fans sleeping with the lights on The series originally aired in 2019 and only lasted one season, but it has recently been revived It follows a novelist named Emma who's fictional witch Marianne becomes real once she returns to her hometown and terrorizes the town  French horror series Marianne on Netflix has resurfaced to terrorize even the toughest horror fans, leaving them 'scared for their lives.' ",
        "The horror series was originally released in 2019 and only lasted one season, but it has recently been revitalized on the popular streaming platform and has left viewers shaking in their boots. Those who watched it back then said it was the most horrifying thing they'd seen since The Conjuring. The series follows a fictional famous horror writer named Emma who returns to her hometown, only to realize the demons she dreamt of as a child are now terrorizing the real world. In the show, Emma has just finished her famous series about a witch named Marianne. With the conclusion of her book, she is hoping to put both horror and the nightmares that haunted her childhood behind her. However, after announcing her retirement, her nightmares get worse and after an encounter with a childhood friend, she heads back to her hometown where she comes face-to-face with her demons - and Marianne. Marianne can use her victims' fears and memories against them, leaving the viewer wondering how on earth they'll be able to escape her terror. ",
        "The terrifying series has left viewers afraid to going to the bathroom alone - with some even taking their pets with them. Amy J wrote on Twitter: 'Marianne on Netflix is so freaking scary. Like I have to take Tinkerbell to the bathroom with me scary. For reals.' ",
        "Chad Homura wrote: 'Just finished watching Marianne on Netflix and it's the scariest thing I've ever watched in my whole f**king life.'  A woman Michelle wrote: 'This Marianne on Netflix is f**king scary af.' 'Not a movie but the scariest show/anything I’ve ever seen in my life was Marianne on Netflix,' a Twitter user revealed. ",
        "'Can’t bring myself to watch Marianne alone, if u like horror, Marianne on Netflix is [okay],' one wrote. David Mack wrote: 'Try Marianne on Netflix, it’s in French but pretty damn scary actually.'  The scary spectacle - which was written by Samuel Bodin and Quoc Dang Tran - dropped on Friday the 13th in 2019. Upon first release, the series gained international popularity, but the show's creator said there wasn't a big enough fan base to pursue a second season. "
    ]
}