{
    "articleURL": "/sport/nfl/article-12051015/Jessica-Alba-gets-Jets-star-Gardner-called-Sauce-didnt-know-was.html",
    "content": [
        "Jets star Sauce Gardner sat near Jessica Alba at the Knicks game TuesdayAnd his confidence evidently left an impression on the A-list actressDailyMail.com provides all the latest international sports newsAfter Jets cornerback Sauce Gardner recalled meeting Jessica Alba Tuesday night at the Knicks game - and learning who she was in real time - the A-list actress responded hilariously Thursday with high praise for the 22-year-old.",
        "Gardner was seated with new teammate Aaron Rodgers courtside as the Knicks beat the Heat in Game 2 on Tuesday, and had to be educated by the 38-year-old quarterback about who he was sitting near.But once the 2022 Defensive Rookie of the Year got up to speed, he was more than comfortable chatting it up with the 'Fantastic Four' star by her own telling.  'Lol,' Alba tweeted in response to a clip of Gardner recalling their meeting. 'I totally see how this kid Sauce got his name, he said to my girl [Lizzy Mathis], \"How can I get caught up when I'm the catch.'\"'But in all honesty he was actually very polite with his elder @AaronRodgers12 and everyone else in the room. It was nice meeting you @iamSauceGardner.'",
        "Both Gardner and his 'elder' Rodgers got involved in the conversation after Alba's lighthearted message. 'Damnn it's been 2 days and you still remember what I said word for word.. I just might be HIM [laughing-crying emoji],' Gardner said. 'Nah, but I had a good time with you, [Mathis], and my chaperone loll @AaronRodgers12.''Chaperone??? Elder???,' Rodgers replied. 'You are funny @iamSauceGardner, glad to be helping you meet new people.'Gardner, who was roughly a kindergartner when Alba starred in her biggest roles, told reporters on Wednesday how Rodgers poked fun at him on Tuesday.",
        "'When we were getting seated, [Rodgers] was just picking on me a little bit for being young,' he said.'We were getting seated and he was like 'we're about to sit by,' what's her name? 'We're about to sit by Jessica Alba,' and I'm just like 'Oh, I don't know who that is.' And he just looked at me, he looked at me like I'm crazy.'Rodgers was officially traded to the Jets last week, and it unsurprisingly looks like he's a hit with his teammates ahead of the 2023 season."
    ]
}