{
    "articleURL": "/wires/ap/article-12039405/State-asks-Montana-judge-reject-Zooey-Zephyr-lawsuit.html",
    "content": [
        "HELENA, Mont. (AP) - Rep. Zooey Zephyr, the transgender state lawmaker silenced after telling Republicans they would have blood on their hands for opposing gender-affirming health care for kids, was barred from returning to the Montana House floor in a Tuesday court ruling that came just hours before the Legislature wrapped up its biennial session.",
        "District Court Judge Mike Menahan said it was outside his authority to overrule lawmakers who voted last week to exclude Zephyr from the House floor and debates. He cited the importance of preserving the Constitution´s separation of powers between the legislative, executive and judicial branches.\"Plaintiffs´ requested relief would require this Court to interfere with legislative authority in a manner that exceeds this Court´s authority,\" Menahan wrote in his ruling.The ruling and lawmakers´ decision to adjourn brought a sudden end to a political standoff that dominated the last days of the Legislature and put a national spotlight on transgender issues and the muffling of dissent in statehouses across the U.S.It leaves bitter feelings on both sides, with Democrats and the transgender community outraged over Zephyr´s treatment, and Republicans indignant over the vehemence of the response.Attorneys for the state of Montana had asked the judge to reject an emergency motion from Zephyr´s lawyers challenging her ouster. The first-term lawmaker was silenced two weeks ago for admonishing Republican lawmakers, then banished from the floor for encouraging a raucous statehouse protest.",
        "Zephyr told The Associated Press that Menahan's decision was \"entirely wrong.\"\"It´s a really sad day for the country when the majority party can silence representation from the minority party whenever they take issue,\" Zephyr said.",
        "An attorney for Zephyr, Alex Rate, said an appeal was being considered. But with the 2023 legislative session ending, a ruling in coming days would be of little immediate consequence.The punishment against Zephyr was through the end of the 2023 session. Since Montana´s Legislature convenes every two years, Zephyr would have to be re-elected in 2024 before she could return to the House floor in two years.Lawyers working under Attorney General Austin Knudsen had cautioned that any intervention by the courts on Zephyr's behalf would be a blatant violation of the separation of powers. They wrote in a court filing that the Montana House of Representatives retains \"exclusive constitutional authority\" to discipline its own members.Knudsen, a Republican, issued a statement through a spokesperson saying the lawsuit was an attempt by outside groups to interfere with Montana´s lawmaking process.\"Today´s decision is a win for the rule of law and the separation of powers enshrined in our Constitution,\" he said.Zephyr and several of her Missoula constituents on Monday filed court papers seeking an emergency order allowing her to return to the House floor. Zephyr and fellow Democrats have denounced her exclusion from floor debates as an assault on free speech that's intended to silence her criticism of new restrictions on gender-affirming care for minors.",
        "But lawyers for the state said the censure of Zephyr by her Republican colleagues was \"for good cause\" following the April 24 demonstration by her supporters.\"One legislator cannot be allowed to halt the ability of the other 99 to engage in civil, orderly, debate concerning issues affecting Montana,\" the state's lawyers wrote.GOP leaders under pressure from hard-line conservatives initially silenced Zephyr from participating in floor debates and demanded she apologize almost two weeks ago, after she said those who supported a ban on gender-affirming care for youths would have \"blood\" on their hands.On April 24, Zephyr raised a microphone in defiance on the House floor as protesters in the gallery demanded she be allowed to speak and refused orders to leave. Seven people were arrested on trespassing charges and two days later lawmakers voted along party lines to oust Zephyr from the floor and gallery for the remainder of the session.She's since been working from a bench in a hallway and, when that's been occupied, at a statehouse snack bar.The actions taken against Zephyr have propelled her into political prominence and made her part of broader conversations about who gets to speak in statehouses. But in Montana, Republicans hope to capitalize on her high profile by painting Democrats as a party of extremists headed into the next election.",
        "The lawsuit seeking to reverse her punishment was filed by attorneys working with the Montana ACLU. It named House Speaker Matt Regier and Sergeant-at-Arms Brad Murfitt as defendants.Regier said in a statement that the court recognized \"that the judicial branch has no power to revise or overrule the power expressly held by the Montana State Legislature.\""
    ]
}