{
    "articleURL": "/wires/ap/article-12040977/Irans-president-lands-Syria-rare-meeting-Assad.html",
    "content": [
        "DAMASCUS, Syria (AP) - The presidents of Iran and Syria signed Wednesday a series of long-term cooperation agreements on oil and other sectors to bolster economic ties between the two allies.",
        "Iran's Ebrahim Raisi, leading a large economic and political delegation, met with his Syrian counterpart, Bashar Assad, after landing in the war-torn country for a two-day visit - an Iranian president's first visit to Damascus since 2010.Tehran has been a main backer of Assad's government since a 2011 uprising turned into full-blown civil war and has played an instrumental role in turning the tide of the conflict in his favor.Iran has sent scores of military advisers and thousands of Iran-backed fighters from around the Middle East to Syria to fight on Assad's side. Tehran has also been an economic lifeline for Assad, sending fuel and credit lines worth billions of dollars.Syrian government forces have regained control of large parts of the country in recent years, with the help of its two main allies - Russia and Iran.With Arab governments that once advocated Assad's downfall now slowly making amends with Damascus, Iran appears to be hoping to reap the rewards for its decades-long support of the Syrian president with investment and economic opportunities to help alleviate its own ailing economy.",
        "Syrian state media said Raisi and Assad signed agreements and memorandums of understanding related to several sectors, including oil, agriculture, railways and free trade zones.Iran's state-owned railway company has long aspired to expand its network through neighboring Iraq and Syria, linking it to the Syrian port of Lattakia on the Mediterranean Sea to boost trade. Syria's opposition and Tehran critics see this as another Iran attempt at growing its political influence.",
        "The deal are important also for Syria, whose economy has hit an all-time low over the past decade, with spiraling inflation, a currency plunge and rampant power cuts.In an interview with pan-Arab television channel Al-Mayadeen ahead of his visit, Raisi called for reconstruction efforts and for Syrian refugees who fled the country's war to return home.\"Syria´s government and people have gone through great hardship,\" Syrian state media quoted Raisi as telling Assad during their meeting. \"Today, we can now say that you have overcome all these problems and were victorious, despite the threats and sanctions imposed against you.\"Raisi was also to visit the Sayida Zeinab and Sayida Ruqayya shrines, both holy sites in Shiite Islam, as well as the Tomb of the Unknown Soldier, a monument dedicated to Syrian soldiers killed in battle.The last Iranian president to visit Syria was President Mahmoud Ahmadinejad in 2010.Raisi's visit comes as some Arab countries, including Egypt and regional powerhouse Saudi Arabia, have been opening up to Assad and their foreign ministers have visited Damascus in recent weeks. Syria´s foreign minister also visited the Saudi capital of Riyadh in April, the first such visit since the two countries cut relations in 2012.In March, Iran and Saudi Arabia, a main backer of Syrian opposition fighters, reached an agreement, brokered by China, to re-establish diplomatic relations and reopen embassies after seven years of tensions.",
        "The Iran-Saudi reconciliation is likely to have positive effects on countries where the two fought proxy wars, including Syria.Syria was widely shunned by Arab governments over Assad´s brutal crackdown on protesters. The breakdown in relations culminated with Syria being ousted from the Arab League in 2011. Syria's civil war has since killed nearly half a million people and displaced half of the country's pre-war population of 23 million.\"America and its allies failed on all fronts against the resistance, and could not achieve any of their goals,\" Iran´s new ambassador to Syria, Hossein Akbari, told Iran´s state news agency on Tuesday.Like Syria, Iran is under Western sanctions, which alongside decades of mismanagement, has plunged its national currency to new lows. Months of anti-government protests failed to unseat the ruling clerics and talks on Tehran's return to the 2015 nuclear deal with world powers, which lifted sanctions in exchange for restrictions on Iran´s nuclear program, have long become stalemated.In 2015, when the nuclear deal was signed, Iran´s currency was trading at 32,000 rials to the dollar. In February, it hit a record low of 600,000 for $1.A week before the Iranian president's visit to Damascus, Iran's minister of road and urban development, Mehrdad Bazrpash, met with Assad in the Syrian capital, where he delivered a message from Raisi supporting the expansion of ties, Iran´s state IRNA news agency said.",
        "Iran´s military presence in Syria been a major concern for Israel, which has vowed to stop Iranian entrenchment along its northern border. Israel has carried out hundreds of strikes on targets in government-controlled parts of Syria in recent years - but rarely acknowledges them.Since the beginning of 2023, Syrian officials have attributed a dozen strikes on Syrian territory to Israel, the latest of which came early on Tuesday and put the international airport of the northern city of Aleppo out of service.___Chehayeb reported from Beirut."
    ]
}