{
    "articleURL": "/sport/nrl/article-12040487/Injured-Melbourne-Storm-NRL-star-Ryan-Papenhuyzen-stuns-teammates-freakish-basketball-kick.html",
    "content": [
        "Star Melbourne fullback kicking up a StormFootage of NRL star punting AFL ball into basketball net Injury not stopping his kicking talentHe may be slowly recovering from a devastating knee injury, but Melbourne Storm fullback Ryan Papenhuyzen has still managed to stun his teammates with a sublime kicking display - on a basketball court.",
        "The wildly talented fullback grabbed an AFL ball and stood at the end of the court while he kicked it at the opposing net in an amazing video posted by the NRL team. It sailed as straight as a shot from a rifle over the 28-metre distance, going through the net without so much as hitting the backboard.The kick could not have been better executed, with the pinpoint accuracy leaving no doubt his knee injury hasn't affected his ability to put boot to ball.Papenhuyzen last played in round 18 last year in the Storm's 20-16 loss to Canberra, when he smashed his right kneecap in a horror injury that required immediate surgery and a very long rehab process.",
        "His extraordinary indoor bucket came off his right foot, showing encouraging signs of recovery.However, Papenhuyzen said he is struggling to get back to full fitness and he doesn't know when he'll be able to return to the field in a recent interview withy Matthew Johns.'It's still a bit complicated,' he said.'I've got a bit of a deficiency in my right quad [quadriceps thigh muscle] which I did my knee on.'It's annoying. I have to be patient, it's frustrating for me as well, but that's the best way to explain it.' ",
        "That wasn't a hinderance as he pulled off the punt of a lifetime with 19-year-old clubmate Sua Fa'alogo watching on in disbelief.",
        "When the video went up on Tik Tok, the reaction was swift. Many AFL fans begged him to switch to their club, while some questioned how many attempts it took to land the shot.As for his return to the paddock, it seems, despite how well his right leg, knee and foot performed with this trick shot, could still be some ways off.He is running at 80 per cent right now.Melbourne Storm fans want him back ASAP but the team is sailing along nicely in fourth spot on the NRL ladder with five wins from eight games played thus far without him.His replacement at fullback, Nick Meaney, has had a stunning start to the season and was man of the match last week. "
    ]
}