{
    "articleURL": "/sport/football/article-12051991/Sunderland-footballer-Jack-Diamond-appears-court-charged-rape-sexual-assault.html",
    "content": [
        "The Sunderland player is charged with one count of rape and sexual assault He appeared in court on Friday to be faced by the charges levelled against himJack Diamond, 23, is expected to plead not guilty to both charges Sunderland footballer Jack Diamond has appeared in court charged with rape and sexual assault.",
        "The 23-year-old was suspended by the club in March after being charged with one count of rape and sexual assault following two incidents in May last year.The incidents were said to have occurred on May 6 and May 9 2022 in an address in Washington, Tyne and Wear.Diamond's defence indicated that he will plead not guilty to both charges, following his statement in March in which a spokesperson for the player said he 'strenuously denies' both allegations. Arriving at South Tyneside Magistrates' Court on Friday, Diamond wore a dark suit for his appearance in front of the judge.",
        "He spoke only to confirm his name and address before being granted unconditional bail by the court. His next court appearance is set for June 2.'Jack Diamond strenuously denies the allegations which have been made against him,' a statement put out by a spokesperson for the player in March read.'Jack is looking forward to clearing his name in court.'Following the charges, Sunderland announced his immediate suspension, while his loan with Lincoln City was terminated with immediate effect. A Sunderland spokesperson said: 'Sunderland AFC has been notified that criminal charges have been brought against Jack Diamond by the Crown Prosecution Service.",
        "'The player has been suspended with immediate effect, pending the outcome of the judicial process, and his loan agreement at Lincoln City Football Club has also been terminated.",
        "'As this matter is subject to a legal process, the club will not be making any further statement at this time.'Diamond made 45 appearances for Sunderland, including as a substitute when they won the Papa John's Trophy at Wembley in 2021. He had scored eight times from 36 matches for League One Lincoln this season. "
    ]
}