{
    "articleURL": "/wires/reuters/article-12043675/WHO-dismisses-lead-COVID-origins-investigator-sexual-misconduct.html",
    "content": [
        "By Emma Farge",
        "GENEVA, May 3 (Reuters) - The World Health Organization said on Wednesday that it has dismissed a senior scientist, known for his role as the head of an international mission to China to probe the origins of COVID-19, for sexual misconduct.The U.N. agency said Peter Ben Embarek, a Danish scientist who previously headed up its 'One Health' initiative on diseases jumping from animals to humans, was removed from his post last year. In a response to Reuters, Ben Embarek said he contested the accusation of harassment and was challenging the sanction.\"Peter Ben Embarek was dismissed last year following findings of sexual misconduct against him that were substantiated by investigations, and corresponding disciplinary process,\" said WHO spokesperson Marcia Poole.Poole said the cases that led to the dismissal occurred in 2015 and 2017. The agency was first made aware of them in 2018. The WHO did not provide further details of the misconduct allegations.Ben Embarek said that a single incident in 2017 \"was settled immediately in a friendly way.\" He said he could not comment further as both he and the WHO are bound by confidentiality agreements until a resolution is reached.\"I am not aware of any other complaints and no other complaints have ever been brought to my attention,\" Ben Embarek said in a digital message. \"I duly contest the qualification of harassment and I am quite hopeful in the defense of my rights.\"",
        "Ben Embarek is the most senior WHO official known to have been dismissed since the U.N. agency launched a series of reforms to improve its response to sexual misconduct. He has often been quoted in the media about the origins of the pandemic. His dismissal can be appealed through the U.N. internal justice system.He was the lead WHO representative on a trip to China in 2021 that aimed to investigate where COVID-19 came from. The team made global headlines with their conclusion that bats were the most likely initial hosts, eventually leading to a pandemic in humans. They had also determined that a leak of the virus from a laboratory in China was \"highly unlikely,\" despite calls from various scientists to probe that possibility.Ben Embarek later said that there had been some political pressure on the team, including from outside China, but that nothing in the report had been changed as a result. He did not identify the source of such pressure.The WHO has overhauled its handling of sexual abuse and misconduct cases after a 2021 inquiry found that dozens of aid workers, including some from WHO, had been involved in sexual abuse and exploitation during an Ebola crisis in the Democratic Republic of Congo.The agency said that people are more willing to come forward about sexual misconduct and that it is taking action where allegations are substantiated. It has started a monthly report on disciplinary action taken. (Reporting by Emma Farge, writing by Jennifer Rigby in London Editing by Alistair Bell)"
    ]
}