{
    "articleURL": "/news/article-12060107/Prince-Harry-moaned-fed-way-treat-lip-reader-claims.html",
    "content": [
        "A lip reader has claimed Prince Harry said he was 'fed up' with how he is treatedREAD MORE:  Prince Harry lands at LAX after just over 28 hours in the UKPrince Harry complained he was ‘fed up’ as he prepared to watch his father’s Coronation, it was claimed today.",
        "A lip reader said the King’s youngest son moaned ‘I’m fed up with the way they treat me’ as he took his position in the third row at Westminster Abbey.The Duke of Sussex was speaking to his cousin Princess Eugenie’s husband Jack Brooksbank, during his brief trip to Britain for the Coronation.Harry, 38, was sitting between Mr Brooksbank and Princess Alexandra, a first cousin of the late Queen, and behind Princess Anne and her husband Sir Timothy Laurence.It was not clear who was the target of his ‘fed up’ complaint, although there has been speculation he could have been speaking about the Royal Family, following ongoing tensions over his decision to quit as a working royal and publish a highly critical memoir.",
        "He may also have been speaking about the media as he is currently embroiled in High Court legal action against several newspaper publishers, including the Daily Mail and The Mail on Sunday.Lip reader Jeremy Freeman told The Sun newspaper that Harry remarked: ‘I’m fed up with the way they treat me’ and later commented: ‘It’s not an ideal situation.’Mr Brooksbank apparently replied: ‘If I can make you feel any better, and even I can do it. It’s not the quiet life, is it.’Harry appeared to shake his head before responding: ‘They don’t care.’",
        "Princess Eugenie’s husband said: ‘I haven’t time for that, not if it’s over...’Harry added: ‘It’s an eventuality.’",
        "The duke, who remains fifth in line to the throne, could be seen joining the homage to his father during the service, saying: ‘God save King Charles. Long live King Charles. May the King live for ever.’Lip readers also spotted Harry telling Mr Brooksbank he was due on a flight later that afternoon, and he left within minutes of the service ending.Harry has remained closest to Eugenie and her husband following the acrimony over his decision with wife Meghan to quit as working royals.His relationships with his older brother the Prince of Wales and his father the King have come under unprecedented strain following the publication of his highly critical memoir, Spare.Harry’s appearance at Westminster Abbey followed months of speculation over whether he and Meghan would attend, amid ongoing tensions with senior royals.The Duchess of Sussex chose to remain at their £11million home in Montecito, California, with their two young children Archie and Lilibet.",
        "Their son Archie celebrated his fourth birthday on Saturday and Harry left Britain immediately after the Coronation service to fly back to the US.He had spent less than 29 hours in Britain after flying in on Friday morning.",
        "But the Mail told today how Charles raised a glass to Prince Archie’s birthday at a private family gathering following the Coronation.The King toasted William’s three children George, Charlotte and Louis, who all attended the service in the Abbey.He then made a point of toasting ‘those that weren’t there’ and wishing his other grandson a very happy birthday ‘wherever he was’, a source told the Mail."
    ]
}