{
    "articleURL": "/news/article-12043417/New-Florida-law-gives-DeSantis-12M-fly-migrants-Democrat-run-cities.html",
    "content": [
        "Florida's new law expands a program transporting migrants to Democratic areasComes as Biden sends 1,500 troops to the southern border as Title 42 endsREAD MORE: Fox News host says he 'can tell' who is an 'illegal immigrant' - just by looking at them Ron DeSantis now has at his disposal $12 million to fly migrants to Democratic enclaves after the Florida legislature passed on Tuesday a new measure that helps fund the controversial program.",
        "In September, the Florida governor flew four dozen migrants from Texas to the swanky Massachusetts island of Martha's Vineyard. The stunt caused an uproar from immigration advocates and Democrats after the migrants had to find ways off the island.DeSantis is expected to announce a run for president in coming months.Meanwhile, the Biden administration is deploying 1,500 troops to the southern border to help with any impending surges that could happen with the end of pandemic-era Title 42 on May 11.Republicans lament that President Joe Biden and Democrats have long ignored the crisis at the southern border because it is only affecting red states like Texas, Arizona and Florida.",
        "This has led to governors, including those from Texas, Arizona and Florida, sending migrants from their states to so-called sanctuary cities like Washington, D.C., New York City and Chicago.Florida's Republican supermajority legislature signed-off on sweeping new legislation to appropriate millions for this initiative of transporting migrants.DeSantis and his allies argue the bill sends a message to the administration that they won't stand idly by while southern states are overrun by illegal immigrants and drug and human traffickers.The law mandates medium and large-sized employers in the state to use E-Verify, a federal system that checks the citizenship status of applicants and new employees.",
        "It also requires hospitals to inquire about the legal status of their patients and prohibits illegal immigrants from driving cars in Florida – even if they have a license from another state.S.B. 1718 allocated $12 million for DeSantis' administration to transport migrants from outside the state to Democratic areas – just as he did when flying migrants from Texas to Martha's Vineyard last year.Legislators also agreed to roll-back a 2014 measure that allowed undocumented immigrants to be admitted to the Florida Bar.Florida House lawmakers debated for 90 minutes before approving the measure.'The price of illegal immigration cost us everything,' said bill sponsor Rep. Kiyan Michael, whose 21-year-old son was killed in a car accident with an illegal immigrant. 'There is not an ounce of malice in my heart … I just want it to stop.''It has to stop and it is insane if we are waiting on Washington, D.C. to do something,' said Michael, who won a GOP primary last year with DeSantis' endorsement.The number of migrants who are sent to Democratic jurisdictions by Florida's governor could increase exponentially with the end of pandemic-era Title 42 next week.",
        "Title 42 allowed for the instant deportation of certain asylum-seekers during the public health emergency. Without any program to replace the program when it ends on May 11, reports claim that thousands of migrants could cross the border in the days following.",
        "DeSantis is among the GOP politicians who have been highly critical of Biden's immigration policies, blaming the president for the surge and denouncing the handling of the influx.But Democrats in his state say this shouldn't excuse the governor's push to fly migrants out of Florida to other areas of the country.Florida Democratic Rep. Susan Valdes, from Tampa, says that the bill 'demonized marginalized people.''Immigrants are people just like us except they did not have the fortune to be in the United States,' said Valdes, whose parents immigrated from Cuba.Democrats have already threatened to challenge the law in court, with some calling measures in the legislation 'racist.'"
    ]
}