{
    "articleURL": "/wires/reuters/article-12049567/Diamondbacks-open-homestand-against-surging-Nats.html",
    "content": [
        "Coming off what Arizona manager Torey Lovullo called \"a statement outing,\" right-hander Merrill Kelly takes the mound Friday night when the Diamondbacks open a 10-game homestand against the Washington Nationals in Phoenix.",
        "Kelly (2-3, 3.06 ERA), who is 2-0 with a 5.25 ERA in two career starts against Washington, bounced back from a 5-3 loss to San Diego that saw him walk five batters in five innings on April 22 to allow one run on six hits over six innings while striking out five in a 9-1 victory at Colorado on Friday.Perhaps the most important stat, however, was that Kelly walked just one. He had at least four walks in four of his five previous starts and has 18 in just 32 1/3 innings this season.Kelly also retired the final 10 batters he faced, no easy accomplishment at hitter-friendly Coors Field.\"To finish his outing (like that), I thought that was a statement,\" Lovullo told the Arizona Republic. \"We had a little discussion about it and I think he wanted to show me and the rest of the staff that, 'I can do what you want me to do consistently,' and he did that.\"I think Merrill had a lot to prove after that (loss to the Padres). I don't think he was very satisfied. It didn't sit well with him. I know what motivates him, excellence, and he went out there and did a great job.\"Kelly went 13-8 with a 3.37 ERA in 2022, when he struck out 177 batters and walked just 61 in 200 1/3 innings.",
        "\"I don't know man, that's baseball,\" Kelly said of his up-and-down start to 2023. \"Sometimes you go out there and feel great and give up seven runs and sometimes you go out there and feel like crap and give up zero. I think that's kind of the beauty of baseball.\"Right-hander Josiah Gray (2-4, 2.67) will start for the Nationals, who are kicking off a six-game western road trip that concludes with a three-game set at San Francisco.Gray, who is 1-0 with a 1.69 ERA in one career start against the Diamondbacks, has bounced back from an 0-4 start to the season with back-to-back wins over the Mets and Pirates. He allowed just one earned run and seven hits over 12 innings in those two games while striking out 15.Washington brings a three-game winning streak into the contest, including a dramatic 4-3 victory over the visiting Chicago Cubs on Thursday afternoon.Rookie outfielder Alex Call hit the first pitch in the bottom of the ninth by reliever Brad Boxberger into the seats down the left field line for the first walk-off home run of his career. It also gave the Nationals their fourth win in their last five games and their first series win at home this season.\"It's probably the best feeling on a field that I've ever had,\" Call said. \"I've dreamed about that so many times. It's something that you dream about. You see all the celebrations with the teammates. ... To be in that situation and actually be able do it ... it's amazing.\"",
        "\"We beat a pretty good team with a pretty good lineup,\" Washington manager Dave Martinez said. \"It feels good. It's awesome for these guys to have that feeling because we're so young. It's great to see those guys smile and having fun.\"--Field Level Media"
    ]
}