{
    "articleURL": "/news/article-12039073/74-say-Biden-engage-debt-ceiling-negotiations.html",
    "content": [
        "A majority of likely voters in both parties believe President Joe Biden should negotiate over the debt ceiling New polling from Echelon Insights found that 74 percent of respondents said they believed that Biden should agree to negotiations Even a majority of those who lean Democratic - 58 percent - believed Biden should get to the negotiating table A majority of likely voters in both parties believe President Joe Biden should negotiate over the debt ceiling - something that he has, so far, refused to do. ",
        "New polling from Echelon Insights found that 74 percent of respondents said they believed that Biden should agree to negotiations and find some common ground, which would likely include spending cuts. Even a majority of those who lean Democratic - 58 percent - believed Biden should get to the negotiating table. On Tuesday's briefing White House press secretary Karine Jean-Pierre stood firm.'This is not an issue that we will negotiate on,' she said. 'Given the limited time Congress now has, it is clear that the only practical path to avoid default is for Congress to suspend the debt limit without conditions.'",
        "House Republicans narrowly passed a bill last week that would raise the debt ceiling, but broadly slash spending. Biden and the Democrats want the debt ceiling raised and then a seperate negotiation of the budget and appropriations.  Some movement has been made, with Biden inviting the top four Congressional leaders: House Speaker Kevin McCarthy, Senate Majority Leader Chuck Schumer, House Minority Leader Hakeem Jeffries and Senate Minority Leader Mitch McConnell to the White House next Wednesday for a meeting. However, Jean-Pierre said that president planned to stay firm during the gathering. 'During his meeting with the leaders, the president will discuss initiating a separate process to address the budget and appropriations,' she said Tuesday.",
        "She used the top of her briefing to call attention to Treasury Secretary Janet Yellen saying the U.S. could default by June 1 if the debt ceiling issue isn't settled.  'The updated projection should be a wake up call to Congress,' the press secretary said. 'It is time for the speaker and the Maga Republicans to stop the brinksmanship and act to prevent default, which would have devastating consequences in our economy and the American people.''It is Congress's constitutional obligation to act, not hold the full faith and credit of the United States hostage unless we allow them to make cuts to programs hardworking Americans rely upon,' she continued. Jean-Pierre said that McCarthy's 'entire agenda isn't just unreasonable, it's dangerous.' 'That's why the president called each of the four leaders yesterday and asked that they come to the White House on May 9, to discuss the urgency and importance of avoiding default,' she said. "
    ]
}