{
    "articleURL": "/news/article-12053751/Now-Just-Stop-Oil-protesters-arrested-Mall-police-crackdown-activists.html",
    "content": [
        " Royal fans clash with Just Stop Oil activists on The Mall as rival chants break outHow are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.uk CORONATION LIVEBLOG: Click here to follow live updates throughout today Angry royal fans drowned out Just Stop Oil protesters on The Mall by singing 'God Save the King' as police arrested 13 activists who were planning on targeting Charles' Coronation.",
        "Rival chants broke out between well-wishers and eco activists on the procession route, as royalists sang the national anthem over demonstrators who shouted messages about climate change and their right to protest.Police appear to be clamping down on protesters targeting the Coronation after warning they would have an 'extremely low threshold' in dealing with anyone who tried to disrupt the day. Not far away, in Trafalgar Square, Republic supporters were met with a similarly unwelcome reception by royalists who retorted back 'He is My King' to their anti-monarchy chants.Six people, including Republic's chief executive Graham Smith, were arrested on suspicion of 'breaching the peace' and said they had seized a number of lock-on devices. Just Stop Oil activists said no disruptive action was planned and supporters were not intending to jump the barrier but 'merely reveal their T-shirts and hold flags'.",
        "The group insisted they had no intention of locking onto anything, which carries a punishment of up to six months in jail and unlimited fines under the Public Order Bill.Just Stop Oil held 'slow marches' to Parliament Square every day in the week leading up to the Coronation and there were fears they were plotting to graffiti attack a monument on The Mall.",
        "As thousands of royal fans and well-wishers crammed onto The Mall to catch a glimpse of the King on his way to Westminster Abbey, they were joined by a small group of Just Stop Oil activists. ",
        "Demonstrators were seen in handcuffs surrounded by police and backed up against railings on The Mall, as one shouted he was being arrested for wearing a Just Stop Oil T-shirt.Some members of the public approached protesters who were wearing handcuffs and told them to 'shut up', while onlookers heckled the group and shouted 'see you later' as they were being removed from the Mall. Another tried to argue he was there to make people aware of climate change and was exercising his freedom of speech but was shouted down. Officers were seen carrying protesters from the area while crowds heckled and booed them, while some royal fans could be heard saying 'what a waste of time'.Just Stop Oil protester Ben Larsen said: 'I wanted to see the coronation and peacefully protest on the sidelines, in a respectful manner.'All we had was a Just Stop Oil t-shirt and an orange flag and that's enough to be detained by the police and searched.'He claimed that police found him using AI facial recognition cameras that they were trialling at the coronation. He only appeared to be carrying a book and some nuts.Mr Larsen said: 'We saw a line of police in front, turned around, saw a line of police behind, they dragged me away, even though I said I didn't want to go with them.  They searched me, they found nothing on me.'",
        "He added: 'I've been told repeatedly that I'm being detained as long as it takes.'",
        "Protesters were mostly ignored by the crowds who kept their focus on The Mall as marching bands paraded down the route from Buckingham Palace. Several people have been arrested on suspicion of offences including breaching the peace and conspiracy to cause public nuisance close to the coronation, Scotland Yard said.In a statement on Twitter, the force said: 'A significant police operation is under way in central London.'We have made a number of arrests in the area of Carlton House Terrace. The individuals have been held on suspicion of breaching the peace.'Earlier today, police were seen arresting crying anti-monarchist protesters and scouring a van full of 'Not My King' banners amid attempts to foil a peaceful protest by thousands of Republic demonstrators at the King's Coronation.",
        "They received a similar reception to that of Just Stop Oil protesters, after being booed and chanted over by royalists who tried to drown them out.Republic supporters dressed in yellow and waving placards stood shoulder-to-shoulder with royal fans bedecked in Union flags as thousands of people lined the procession route.But things threatened to get a bit heated when one defiant royalist shouting 'He is My King' allegedly threwan object at Republic supporters, before being arrested by officers.  ",
        "Following the arrests, anti-monarchy activists blasted police for arresting those taking part in the peaceful protest, including Republic's chief executive Graham Smith.Group director Harry Stratton, who witnessed the arrest of his six colleagues, denied any megaphones or locking chains were being carried or seized, and that they had not broken any rules laid out by the force in a series of meetings.",
        "Mr Stratton accused police of 'intentionally picking them out', while another campaigner claimed straps holding their placards had been 'misconstrued' as something that could be used for locking on. Footage on Twitter showed officers using their powers under the new Public Order Act, with a number of demonstrators in yellow 'Not My King' T-shirts having their details taken.In one video an officer said: 'I'm not going to get into a conversation about that, they are under arrest, end of.'Meanwhile, an anti-monarchist and royalist were seen trading insults during the procession with one shouting, 'You're a traitor!'Royalist Dan Peters, 31, from Southend told Salman Al Khadi, originally from Kuwait: ‘You are an embarrassment to this country.’But Kahdi hit back saying: ‘He is an idiot wearing a British flag who talks rubbish.’",
        "Mr Peters, a stock trader who is married and has a six-year-old son, told MailOnline: ‘I don’t know why this man came here, with all his mates to spoil an enjoyable day for many thousands of people.",
        "‘This is one of the best days our country has enjoyed for so many years and millions of people are watching back home on television.'Mr Al Khaldi said about the newly anointed monarch: 'He’s not my King.’ Campaign group Animal Rising also said a number of their supporters were arrested on Saturday morning while at a training session 'miles away from the coronation'.Arrests were made around 11am as the group ran a non-violent direct action training session at their offices in Dalston, east London.The animal-rights group insists that they had no intention of ever disrupting King Charles's coronation. 'We are sleepwalking into fascism and it is every single person's responsibility to stand up and say 'no more',' a spokesman said.",
        "As crowds started to swell, chants of 'Not My King' could be heard from anti-monarchists, which were met by boos and rivalling chants of 'God Save the King'.The Met Police added: 'Earlier today we arrested four people in the area of St Martin's Lane. They were held on suspicion of conspiracy to cause public nuisance. We seized lock-on devices.A further three people were arrested in the area of Wellington Arch. They were held on suspicion of possessing articles to cause criminal damage.'There will be further updates later today.'",
        "Non-profit campaign group Human Rights Watch said the coronation arrests were 'something you would expect to see in Moscow not London'.",
        "Its UK director Yasmine Ahmed said in a statement: 'The reports of people being arrested for peacefully protesting the coronation are incredibly alarming. This is something you would expect to see in Moscow not London.'Peaceful protests allow individuals to hold those in power to account, something the UK government seems increasingly averse to.'Earlier this week, the Home Office sent official warning letters to a number of protest groups to set out new offences under the Public Order Bill which received Royal assent last week.And human rights campaigner Peter Tatchell, who was with the anti-monarchy protesters, said on Twitter: 'Police arrest peaceful anti-monarchy protesters &amp; have erected giant barriers to obscure pro-republic banners. Right to freely protest suppressed. Shame!' ",
        "Under new legislation, protesters blocking key infrastructure such as roads, airports and railways can face 12 months behind bars.Anyone found 'locking on' or gluing themselves to buildings or objects could get six months in jail and face an unlimited fine.Police can also stop and search anyone they suspect is planning to cause disruption under new measures.",
        "The Home Office contacted a number of protest groups to notify them of new offences which may affect them, but some campaign groups slammed the move which they interpreted as 'intimidatory'.Just Stop Oil said that the 'new policing laws mean we're now living in a dystopian nightmare'. With the huge security operation under way, protesters planning to disrupt the coronation were warned that they could be shot by police if they run out towards a carriage just in case they are carrying a bomb. Former royal protection officer Simon Morgan, now director of operations at security firm Trojan Consultancy, said: 'It's an armed policing operation because of the threat that the UK faces, the threat that the royal family faces, dignitaries that are attending. So we have to be very careful.'Somebody that's going to run out in front of the carriage, fiddling with something in their rucksack, who's to say that's not an IED rather than a banner that's just going to be unfolded.'These demonstrators have to be very careful as to the environment that they're going into, the police are acutely aware of it.' Facial recognition technology will also be deployed to flag to police any individuals on watch lists or who have outstanding warrants. While HMS Diamond, a Type 45 destroyer capable of tracking drones from 250 miles away, will also stand guard on the Thames over the King's Coronation weekend. "
    ]
}