{
    "articleURL": "/wires/reuters/article-12049715/Apple-stakes-future-growth-emerging-markets-starting-India.html",
    "content": [
        "By Stephen Nellis",
        "May 5 (Reuters) - When Apple Inc surprised investors this week with a rise in iPhone sales despite a slump in the global smartphone market, Chief Executive Tim Cook credited emerging markets like India where the company is luring away Android phone users.Cook is betting that those markets will provide more opportunities for growth, with their youthful populations and relatively few iPhones.Apple said iPhone sales rose 1.5% to $51.3 billion for its fiscal second quarter even as global smartphone shipments fell 13% in January to March, according to research firm Canalys, whose data showed Apple gained market share from Android phones.Apple said it set sales records in several countries across South Asia, Latin America and the Middle East.\"We're putting efforts in a number of these markets and really see, particularly given our low share and the dynamics of the demographics, a great opportunity for us in those markets,\" Cook told investors during a conference call.India is perhaps Apple's biggest focus. The company recently opened its first two retail stores there, in Mumbai and Delhi, and while Apple does not disclose revenue for the country, Cook told investors that it set a quarterly record and percentage growth was in very strong double digits year-over-year.\"There are a lot of people coming into the middle class, and I really feel that India is at a tipping point, and it's great to be there,\" Cook said on the conference call.",
        "Apple was the second biggest revenue generating brand in India in 2022, second only to Samsung as it gained 18% of the total value of smartphone shipments, according to research firm Counterpoint.For Apple, selling an iPhone in an emerging market represents more than just the sale of one device - it represents the chance to get consumers hooked on Apple devices and services over time. Customers who start with an iPhone might later add an Apple Watch or AirPods or sign up for subscription services.Cook said he saw opportunities for Apple in India in services but said that average revenue per user - a metric known as ARPU in the subscription business - would take time to catch up to Apple's other markets.USED IPHONE BOOMPart of the reason that Apple has been able to gain market share in both emerging and developed markets is the emergence of a booming market for used iPhones.Sales of refurbished iPhones rose 16% in volume globally during 2022. India led the growth with a 19% jump, according to Counterpoint, with iPhones accounting for 11% of secondary smartphone sales in India.In an interview with Reuters on Thursday, Apple's Cook said little of Apple's direct iPhone revenue comes from refurbished devices. However he said the company has tried to bolster the used iPhone market by offering trade-in deals on its iPhones and building them sturdy enough to last several owners.",
        "\"We encourage the market and it provides us an opportunity to hit some price points that we would not otherwise play in,\" Cook said in the interview. (Reporting by Stephen Nellis in San Francisco; Additional reporting by Munsif Vengattil in New Delhi; Editing by Sonali Paul)"
    ]
}