{
    "articleURL": "/news/article-12041073/Ex-Barclays-boss-accused-abusing-girls-visit-Epsteins-island-retreat-lawsuit-claims.html",
    "content": [
        "JPMorgan Chase Bank was alleged to have facilitated sex trafficking by EpsteinBank has sued its former head of private banking to make liable for any penaltiesStaley alleged to have abused victims while at Epstein's island, document claimsFormer Barclays boss Jes Staley is alleged to have abused victims at late financier Jeffrey Epstein's Virgin Islands retreat, according to a court ruling issued Monday.",
        "The document rejected motions to dismiss complaints claiming JPMorgan and Deutsche Bank were legally liable for their alleged facilitation of Epstein's sex crimes.The ruling instead revealed that Staley was alleged to have 'used aggressive force in his sexual assault of [anonymous victim 'JPM Jane Doe'] and informed [her] that he had Epstein's permission to do what he wanted to her'.Victims claim Epstein agreed to bring valuable clients to JPMorgan in exchange for Staley using his influence with the bank to make Epstein 'untouchable'.Staley has been accused of having 'observed victims personally' and 'visited young girls at Epstein's apartments', exchanging some 1,200 emails with Epstein from 2008 to 2012, said to have included pictures of young women in 'seductive' poses.",
        "James 'Jes' Staley headed JPMorgan's private banking division and started to service Epstein's account around the year 2000.According to Monday's report, Staley is alleged to have developed a close personal friendship with Epstein and was promoted to CEO of the lender's Asset Management division while Epstein was still a client.",
        "Lawsuits brought against JPMorgan allege that Staley had first-hand knowledge of Epstein's operation - and now claim his direct involvement.Suits brought by the US Virgin Islands and an accuser of Epstein also allege that JPMorgan and Deutsche Bank knew about and benefitted from Epstein's sex trafficking.",
        "The Islands' claim that JPMorgan 'knowingly benefitted from participating in a sex-trafficking venture' was not dismissed in a trimming of the suits in March.Staley, who was head of JPMorgan's private banking division from 2000 to 2009, advised Epstein and has admitted to having shared a close professional relationship. District Court judge Jed Rakoff said in Monday's ruling that JPMorgan Chase Bank could be liable to women who accused Epstein of abuse if they can show that Staley had first-hand knowledge that Epstein ran a sex-trafficking venture.The lender has argued that the cases have no merit and that Staley is to blame for the relationship with Epstein.It was reported in March that JPMorgan would sue Staley to make him liable for penalties faced in relation to the bank allegedly helping Epstein.Staley has hit out at his former employer, claiming it to be deflecting blame from his own failures in working with Epstein.He claimed he was being used as a 'public relations shield' and said the bank had no viable claims against him over its relationship with Epstein, and could not plausibly allege he was solely at fault.The opinion published on Monday 1 May summarized allegations that Staley knew about the operation.It noted that plaintiff claims that said Staley had developed a close relationship with Epstein.",
        "Staley allegedly ignore red flags as Epstein grew the operation to 'sexually abuse and traffic countless young women'.The document also notes that 'the complaints do not support the allegation that either JP Morgan or Deutsche Bank acted with the specific intent of benefiting from a sex-trafficking venture', dismissing the plaintiff's claims for attempting to violate the TPVA. ",
        "The suits against the banks claim that they let Epstein withdraw cash to pay women involved in his trafficking ring and that they failed to conduct due diligence in reporting.Palm Beach police started investigating the billionaire financier Jeffrey Epstein in 2005 over allegations he had sexually assaulted a 14-year-old girl. Epstein pleaded guilty and was convicted in 2008 of procuring a child for prostitution and soliciting a prostitute.Over the next decade, a number of alleged victims came forward, claiming Epstein had assaulted them. Epstein was arrested again in New York in 2019 on sex trafficking charges dating back to the early 2000s.Federal court documents claimed that federal agents who had searched his mansion uncovered a 'vast trove of lewd photographs' of young-looking girls.Prosecutors pushed for a trial no earlier than summer 2020, but Epstein died in his jail cell on 10 August 2019.DailyMail.com approached Staley's representatives and JP Morgan Chase for comment. "
    ]
}