{
    "articleURL": "/wires/aap/article-12044509/Higher-coal-royalties-net-Qld-extra-5b.html",
    "content": [
        "High coal prices could net Queensland an extra $5 billion in taxes as the state government defends its royalty regime against a sustained campaign from the mining lobby.",
        "The Queensland Resources Council produced the figure based on its analysis of federal resources and energy forecasts, which predict coal prices will stay high this year amid the war in Ukraine.\"Last year, the Queensland government announced it would add three higher tiers to the state's royalty tax system, costing coal producers an estimated extra $800 million in 2022/23,\" the lobby group said in a statement on Thursday.\"The latest price forecast from the Office of the Chief Economist suggests the amount will be closer to an extra $5 billion, bringing the total amount of coal royalties paid by coal companies this financial year to an unprecedented $13 billion.\"The added tiers targeting record global prices mean mining companies have been paying higher royalties on each tonne of coal sold for more than $175.Treasurer Cameron Dick said he was satisfied with the impact of the higher coal royalties as strong prices delivered good returns for both coal producers and the state.\"The coalmining lobby's $40 million campaign against fair royalties will not have any impact on the government's position,\" he said in a statement on Thursday.Mr Dick said revenue forecasts would be provided through the state budget, due to be released on June 13.QRC chief executive Ian Macfarlane said the change to the state's royalty regime would mean fewer jobs and less investment.",
        "\"The frustrating reality is that before the new tax tiers were introduced, coal companies would have still contributed a record $8.3 billion in royalties to the state budget this financial year because coal prices have been so strong,\" he said.\"When prices are high, the amount of royalties paid by companies increases. That's how the previous system worked and it was working well for Queensland.\"An increase in global steelmaking means prices for metallurgical coal have lifted, but prices are expected to drop in subsequent years, according to the chief economist's report.\"The Australian premium hard coking coal price is estimated to fall from an average US$377 a tonne in 2022 to around US$160 a tonne (in real terms) by 2028,\" it said.While thermal coal prices have eased recently, factors including persistent weather disruptions, fallout from the Russian invasion of Ukraine and difficulty accessing finance and insurance mean they remain relatively high.\"Falling prices are expected to see export values ease from the record $65 billion forecast for 2022/23 to a more typical level of around $19 billion in real terms by 2027/28,\" the report said."
    ]
}