{
    "articleURL": "/tvshowbiz/article-12043573/EastEnders-fans-fear-Sharon-Watts-gets-Ravi-Gulati-arrested.html",
    "content": [
        "EastEnders fans were delighted with Sharon Watts as she watched nasty Ravi Gulati get arrested for the attempted murder of Keanu Taylor on Wednesday - although some predict trouble could be on the way.",
        "Sharon (Letitia Dean) watched Ravi (Aaron Thiara) get handcuffed and put in the back of a police car after Sharon grassed him up to cops following his brutal attack of Keanu (Danny Walters) after a drug deal went wrong during Tuesday's episode.In the dramatic scenes, Ravi attacked Keanu on a dark Bridge Street by Kathy's café after it was hinted he revealed information about Ravi's criminal activities as part of a deal with police.With Ravi working for dark drug lords, he ordered Keanu to do the drop, but when it went wrong, Ravi's bosses ordered him to beat up Keanu.After Keanu was left for dead and rushed to hospital with a collapsed lung, a devastated Sharon called the police on Ravi when she learned it was him behind the attack.",
        "After blue-lighting it to Albert Square, cops grabbed Ravi and handcuffed him, while Sharon looked on and smirked.Viewers were delighted after watching Sharon take charge, with many taking to Twitter to praise her for her actions.However, others expressed their concern for the character, suggesting she could have made herself the target for an attack herself. One person wrote: 'The smirk by Sharon. She's in her boss era I'm here for it.'While someone else shared: '\"Icon\" is now spelt \"Sharon Watts\".'",
        "'No one gives a look quite like Sharon Watts. An absolute master,' wrote another viewer, while someone else shared: 'Sharon got Ravi arrested yas queen. That smirk though.''SHARON IS SUCH A BADDIE YES GIRL,' exclaimed another viewer.While someone else posted: 'Absolutely obsessed with Sharon’s smirk as she watches Ravi being arrested #eastenders.'",
        "Another soap fan tweeted: 'Oh noooo Sharon now I'm more worried ... wasn't the best idea to get Ravi arrested. He will come back to get after you #EastEnders.'While someone else commented: 'Uh oh, Sharon may have made a massive mistake by calling the police on Ravi. Especially if Cristos has a police informant. This could end badly for Sharon, her family and the Taylor family #Eastenders @bbceastenders.''I do like Sharon’s \"don’t mess with me\" look. But I think she’s going to regret that #EastEnders,' remarked another viewer.It comes after EastEnders fans predicted a grave end Ravi as he descended deeper into London's criminal underworld following a drug deal gone wrong during Tuesday's gripping episode.  Ravi left Keanu for dead after brutally attacking him in a dark corner next to the café and devotees of BBC soap insist he is now a frontrunner to be the character killed off this coming Christmas.Just moments earlier, Keanu was sacked from his job as a doorman at Phil Mitchell's (Steve McFadden) nightclub Peggy's after Keanu was arrested when it turned out a drugs delivery job Ravi had booked him for involved cocaine as well as cannabis and he was found out by police.",
        "And, while Keanu was let go by cops after they came to a deal with him to reveal who had ordered him to carry out the job and to dish up further information, it became apparent he wasn't safe when he returned home to Albert Square for his Albie's christening in the Queen Vic.As the residents of Albert Square celebrated in the pub, Ravi was seen on the phone outside, declaring 'there's no need for that' as he appeared to receive orders from a mystery called on the phone.",
        "And, as the episode drew to a close, Ravi was seen dressed in dark clothing with his hood pulled up before he attacked Keanu while Keanu made his way to Sharon Watts' (Letitia Dean) in a bid to make up after they had an argument earlier in the day following his arrest.As Keanu lay bloodied and unconscious on the pavement, Sonia Fowler (Natalie Cassidy) appeared on the street, prompting Ravi to make a dash for it to save himself from being caught.Taking to Twitter during Tuesday's instalment, viewers predicted drug kingpin Christos (Alexander Theo) was pulling the strings behind the scenes, with some soap fans insisting Ravi would be six feet under by Christmas.'So we can agree Ravi will be the dead body at Christmas?', wrote one person.",
        "While someone else posted: 'I think Ravi is the dead man on the floor in the Vic at the Christmas Flash back/Flash forward.'Another viewer wrote: 'Sharon’s found out it was Ravi who set up the drugs deal that got Keanu arrested and she’s fuming! Another one of “The Six” Ravi’s crossed.'And someone else shared: 'Ravi's enemies are growing ahead of Christmas.'One other soap fan commented: 'Probably unlikely but I've just thought all the signs point towards Ravi being the one on the Vic floor at Christmas but what if we're being mislead and he is involved but he's the killer and he's killed Christos.'And someone else wrote: 'Why would Ravi beat up Keanu and then tell him to get up and act like nothing happend? It's clear that Christos has Ravi on a tight leash and is feeding him instructions. Poor Keanu dosnt deserve this.' ",
        "EastEnders made history with an epic end to a February episode when they teased a flashforward of a Christmas murder.In the shocking scenes, Sharon, Kathy Beale (Gillian Taylforth), Denise Fox (Diane Parish), Linda Carter (Kellie Bright), Stacey Slater (Lacey Turner) and Suki Kaur Panesar (Balvinder Sopal) were seen surrounding a dead body, but the identity of the corpse and the killer were kept secret.",
        "Viewers will have to wait months to see exactly what unfolds on the Christmas Day episode, with each woman and the men in their lives set to undergo dramatic storylines that will explain the night's drama.EastEnders airs Mondays to Thursdays at 7:30pm on BBC One and iPlayer. "
    ]
}