{
    "articleURL": "/wires/ap/article-12054215/Profits-jump-Buffetts-company-ahead-annual-meeting.html",
    "content": [
        "OMAHA, Neb. (AP) - Billionaire Warren Buffett said artificial intelligence may change the world but new technology won't take away opportunities for investors and he's confident America will continue to prosper despite its bitter political divisions.",
        "Buffett and his partner Charlie Munger spent all day Saturday answering questions at the annual shareholders meeting for his Berkshire Hathaway conglomerate inside a packed arena in Omaha.\"New things coming along doesn´t take away the opportunities. What gives you the opportunities is other people doing dumb things,\" said Buffett, who had a chance to try out ChatGPT with his friend Bill Gates a few months back.\"The problem now is that partisanship has moved more towards tribalism, and in tribalism you don't even hear the other side,\" he said.Both Buffett and Munger said the U.S. will benefit from having an open trading relationship with China, Both countries should be careful not to exacerbate tensions - the stakes for the world are too high.\"Everything that increases the tension between these two countries is stupid, stupid, stupid,\" Munger said.",
        "The chance to listen to the legendary investors answer questions about business and life attracts people from all over the world to Buffett's hometown. Some shareholders feel a particular urgency to attend because the two men are both in their 90s.\"Charlie Munger is 99. I just wanted to see him in person. It´s on my bucket list,\" said Sheraton Wu, 40, from Vancouver. \"I have to attend while I can.\"",
        "Chloe Lin traveled from Singapore for what she called \"a once-in-a-lifetime opportunity.\"The two capitalists discussed a range of topics, including:- Buffett said bank regulators need to find a way to punish executives and board members who make risky decisions that doom a bank.- The U.S. is carrying a concerning level of debt but it's hard to know how much the country can take on without devaluing the dollar and jeopardizing the world's reserve currency.- Buffett said Apple - Berkshire's biggest stock holding - is a wonderful business because of how devoted consumers are to their iPhones. \"I don´t understand the phone at all,\" Buffett said. \"But I do understand consumer behavior.\"- Elon Musk is a brilliant man who has taken on impossible tasks and succeeded even if he \"overestimates himself.\" Buffett and Munger said, but his approach doesn't appeal to the investors who look for places they can prosper without ridiculous effort.\"We're different,\" Munger said. \"Warren and I are looking for the easy job we can identify.\"- Berkshire isn´t a big player in commercial real estate but they predicted problems ahead. Munger said the \"hollowing out of the downtowns in the United States and elsewhere in the world is going to be quite significant and quite unpleasant.\"",
        "- To avoid the biggest mistakes in life, Buffett said, \"You should write your obituary and figure out how to live up to it.\" Also avoid debt, and in business try to avoid taking on so much risk that a single mistake can wipe you out.- Munger gave similarly simple advice: Spend less than you earn, avoid toxic people and activities, and keep learning throughout your life.In a nod to the longstanding concerns about their age, Berkshire showed video clips of questions about succession from past meetings dating back to the first one they filmed in 1994. Two years ago, Buffett finally said that Greg Abel will replace him as CEO although he has no plans to retire. Abel already oversees all of Berkshire's noninsurance businesses.\"Greg understands capital allocation as well as I do. He will make these decisions on the same framework that I use,\" Buffett said.Abel assured the crowd that he knows how Buffett and Munger have handled things for nearly six decades. \"I don´t really see that framework changing.\"Not everyone in Omaha was a fan.Outside the arena, pilots from Berkshire's NetJets protested over the lack of a new contract and environmental groups questioned why the company's utilities continue to burn coal. Pro-life groups carried signs declaring \"Buffett's billions kill millions\" to object to his many charitable donations to abortion rights groups.",
        "Berkshire Hathaway said Saturday morning that it made $35.5 billion, or $24,377 per Class A share, in the first quarter. That's more than 6 times last year's $5.58 billion, or $3,784 per A share.Three analysts surveyed by data firm FactSet had expected Berkshire to report operating earnings of $5,370.91 per Class A share.However Buffett has long cautioned that those bottom-line figures can be misleading because of wide swings in the value of Berkshire's investments - most of which it rarely sells. Buffett says operating earnings that exclude investments are a better measure of the company´s performance. They grew nearly 13% to $8.065 billion, up from $7.16 billion a year ago.Buffett said he expects operating profits to grow this year although the economy is slowing and most of the company's businesses will sell less. He said Berkshire will profit from rising interest rates on its holdings, and the insurance market looks good.This year´s first quarter was relatively quiet compared to a year ago when Buffett revealed he'd gone on a $51 billion spending spree at the start of 2022, snapping up stocks like Occidental Petroleum, Chevron and HP. Buffett´s buying slowed, aside from a number of additional Occidental purchases.Edward Jones analyst Jim Shanahan said the quarterly report suggests Berkshire may have sold about 35 million Chevron shares, but Buffett appears bullish on oil stocks given his recent Occidental purchases.",
        "Buffett quashed speculation that Berkshire might buy all of Occidental. He said Berkshire won't bid for control of the oil producer although he may buy more shares, and holds warrants to buy another 83.9 million shares.At the end of this year's first quarter, Berkshire held $130.6 billion cash but spent $4.4 billion during the quarter to repurchase its own shares.Berkshire's insurance unit, which includes Geico and a number of large reinsurers, recorded a $911 million operating profit, up from $167 million last year, driven by a rebound in Geico's results. Geico benefitted from charging higher premiums and a reduction in advertising spending and claims.But Ajit Jain, who oversees all of Berkshire's insurance businesses, said Geico still has a long way to go to upgrade its internal technology.CFRA Research analyst Cathy Seifert called those comments \"a pretty candid acknowledgement that Geico has a lot of work to do to catch up to its peers.\"Berkshire's BNSF railroad and its large utility unit reported lower profits. BNSF earned $1.25 billion, down from $1.37 billion. The number of shipments it handled dropped 10% after it lost a big customer and imports slowed. The utility division added $416 million, down from last year's $775 million.Berkshire owns an eclectic assortment of dozens of other businesses, including retail and manufacturing firms like See's Candy and Precision Castparts.",
        "Berkshire shareholders rejected a number of proposals that Buffett opposed. Those would have required the company to disclose more about climate change risks and diversity, split Buffett's job into separate chairman and CEO positions, and silence executives' political views.With Buffett controlling nearly one third of the vote, those proposals never had much chance."
    ]
}