{
    "articleURL": "/tvshowbiz/article-12057675/Fans-rave-Thats-special-rendition-Never-Forget-close-Coronation-concert.html",
    "content": [
        "Fans raved over Take That's special rendition of Never Forget as they closed incredible Coronation concert at Windsor Castle on Sunday night.",
        "The British pop royalty - comprising of  Gary Barlow, 52, Howard Donald, 55, and Mark Owen, 51, - had been invited to close the show with a medley of their greatest hits.They started the performance by taking to the stage with German DJ Robin Schulz as they sing their single Greatest Day.After belting out Shine, the choristers of St George's Chapel, Windsor Castle, sang the opening to Take That's third song, Never Forget, which gave the show an uplifting finale.Fans were loving it as one wrote: 'And THAT is why Never Forget will always be in my heart. Nothing can beat that feeling when everyone is doing the arms and singing at the top of their voices. Spectacular! Huge congrats @takethat.'",
        "Another said: 'Never Forget by Take That is an Anthem though, I won't hear a bad word said about it. #CoronationConcert.'A third wrote: 'Howard absolutely nailed the Never Forget finale for #TakeThat tonight at the #CoronationConcert.' Someone else said: 'What an incredible way to end the #CoronationConcert with one of the best Take That songs of all time. Never Forget WHAT A TUNE!!'A fifth wrote: 'Petition for Take That - Never Forget to be the new national anthem #Coronation #CoronationConcert.'Another said: 'Say what you want but Take That know how to put on a show. Never Forget an absolute classic.'",
        "Someone else wrote: 'I don't care what you say, Take That Never Forget is an absolute BANGER!'Others gushed over Howard's vocal talent as one wrote: 'I am old enough to get genuine enjoyment out of the evolution of Take That's Howard Donald. First employed as dancing eye candy to now being centre stage and arguably being the best singer in Take That. #CoronationConcert.'Another said: 'Really didn't have Howard off of Take That being one of the best vocalists on the night. Class act.'",
        "It came after earlier in the night Coronation concert viewers branded Take That 'unrecognisable' as they chatted in an interview ahead of their performance at the event.Many took to Twitter to remark that the trio were starting to show their age.The pop stars were chatting to presenter Clara Amfo about their hitting the stage later that night. As they spoke one said on social media: 'Can't believe Mark Owen actually looks much older than Gary Barlow and Howard Donald when he is the youngest! #CoronationConcert.'Another said: 'Out of the 3 Gary Barlow has definitely aged the best. Mark Owen OMG! #CoronationConcert.A third joked: 'Always pleasing to know that Gary Barlow has aged faster than me!'A fourth said: 'When did Take That become old?'",
        "Someone else said: 'Take that have gotten really old really quick!'The King and Queen of the royal family joined around 20,000 members of the public at the Coronation Concert to continue the celebrations after their crowning at Westminster Abbey on Saturday.The Coronation Concert saw performances by Paloma Faith, Katy Perry, Lionel Richie and veteran rock guitarist Steve Winwood.The show in Windsor, which was hosted by Downton Abbey and Paddington star Hugh Bonneville, started at 8pm. Buckingham Palace promised 'global music icons and contemporary stars' for the big concert.It was the highlight of the second day of coronation celebrations with around 20,000 members of the public attending.Classical acts including Andrea Bocelli, Welsh bass-baritone Sir Bryn Terfel and Chinese pianist Lang Lang were also on the bill.Hollywood star Tom Cruise, Dynasty actress Dame Joan Collins, adventurer Bear Grylls, singer Sir Tom Jones and former Strictly Come Dancing professional Oti Mabuse also made appearances via video.The series of pre-recorded sketches revealed little-known facts about the monarch and also included moments from beloved literary character Winnie the Pooh - seemingly echoing the famous moment Paddington Bear drank tea with the Queen during her Platinum Jubilee celebrations.Nigerian singer Tiwa Savage, DJ Pete Tong with his Ibiza Classics project, and winner of The Piano TV talent show, 13-year-old Lucy, also performed.",
        "Meanwhile, fashion designer Stella McCartney delivered a spoken word performance with a conservation theme which reflected her and the King's 'shared passion for environmental sustainability'.Her performance was part of a broader nature-themed section of the concert which also included a rendition of a 1980s hit by classical-soul composer Alexis French and London-based singer-songwriter Zak Abel alongside a house orchestra, band and choir.Bollywood star Sonam Kapoor also delivered a spoken-word performance.The Royal Ballet, the Royal Opera, the Royal Shakespeare Company, the Royal College of Music and the Royal College of Art came together for the first time to create a one-off performance featuring Sex Education and Doctor Who star Ncuti Gatwa and Olivier Award nominee Mei Mac.The concert was broadcast on BBC One, BBC iPlayer, BBC Radio 2 and BBC Sounds.",
        "The concert on the castle's East Lawn also saw TV presenter Clara Amfo and Diversity dance troupe member Jordan Banjo speaking to the artists backstage.At Saturday's coronation, King Charles and Queen Consort Camilla were officially crowned by the Archbishop of Canterbury, Justin Welby.King Charles, 74, automatically took the throne following the death of his mother, Queen Elizabeth II, in September last year."
    ]
}