{
    "articleURL": "/tvshowbiz/article-12053585/Bankrupt-Katie-Price-reveals-selling-lip-kisses-fans-45-each.html",
    "content": [
        "Katie Price has revealed that she is selling lip kisses.",
        "On Friday, the OnlyFans star, 44, took to Instagram where she explained how she will kiss a piece of paper card, whilst wearing lipstick, and send it direct in the post. Katie announced that she is flogging the very personalised product to fans for £45 each, and branded them: 'a customer favourite.'The former glamour model also admitted that the idea for the cash-raising project came from fans themselves, who often request kisses from her. In a video, Katie told her followers: 'So here I am, signing these because lots of people are requesting my kiss so I've got my lipstick on.",
        "'Here it goes, this is how I do it,' explained the TV personality, before she planted her lips on each card, holding one up to the camera. Katie was declared bankrupt in 2019. She vowed to pay back £12,000 a month to creditors of the firm through an individual voluntary arrangement. The bankruptcy meant Katie, once worth a reported £45million, faced losing her £2million 11-bedroom mansion.She took out a second mortgage on the property in 2015, but faced monthly payments of £12,300.Katie was hit with a repossession order on the property in November 2021.Sources told The Sun at the time that she has failed to repay a debt of more than £500,000 on the property.",
        "Following years of incomplete renovations, the house was nicknamed the 'mucky mansion' with Katie even showcasing the extent of the mess on her reality series My Crazy Life. ",
        "At the time of the bankruptcy, Katie was said to be £100,000 in arrears on mortgage repayments.She was also believed to have spent £120,000 on housekeepers, gardeners and nannies - and around £25,000 a year on plastic surgery.The star also spent £1,500 a week on manicures and pedicures, £1,000 on hair appointments and £800 on massages every other day, reported the Daily Mirror."
    ]
}