{
    "articleURL": "/wires/ap/article-12047431/EU-team-questions-brother-Lebanons-Central-Bank-governor.html",
    "content": [
        "BEIRUT (AP) - A European judicial team questioned on Thursday the brother of Lebanon´s embattled Central Bank governor who is is being investigated abroad over several financial crimes and the laundering of some $330 million.",
        "The questioning is part of a probe by a delegation from France, Germany, and Luxembourg, which is now on its third visit to Lebanon to interrogate suspects and witnesses in the case.The delegation questioned Gov. Riad Salameh's brother, Raja Salameh, for around seven hours on Thursday, judicial officials said, speaking on condition of anonymity because of the ongoing probe. The brother had been summoned for questioning last week but did not show up, citing an illness.The three European governments in March 2022 froze more than $130 million in assets linked to the investigation. In March this year, the delegation came to Beirut and questioned the governor about the Central Bank´s assets and investments abroad, a Paris apartment owned by Road Salameh, and Forry Associates Ltd, a brokerage firm owned by his brother.Raja Salameh is to appear separately before prosecutors in mid-May in France. France has earlier questioned the chairman of Lebanon´s AM Bank, Marwan Kheireddine, on several charges, including money laundering. Reports in Lebanon say the governor and his associates had used commercial banks to siphon off public money.The European delegation on Thursday also questioned an auditor and is to question Lebanon´s caretaker Finance Minister Youssef Khalil on Friday. Khalil has long been a close associate of the governor.",
        "In related developments, Lebanon´s judiciary´s disciplinary council on Thursday barred public prosecutor Judge Ghada Aoun from work. She had earlier filed charges against the Salameh brothers. She appealed the decision and told reporters she was being targeted because she dared to investigate cases of corruption that others do not.The 72-year-old governor has repeatedly denied all allegations against him, insisting that his wealth comes from his previous job as an investment banker for Merrill Lynch, inherited properties, and through investments. The governor is also being separately investigated by Lebanese authorities.Riad Salameh - who has held his post for almost 30 years - was once hailed as the guardian of Lebanon´s financial stability.However, since Lebanon´s economic crisis erupted in 2019, many have criticized the governor, saying he precipitated the meltdown. The crisis has plunged three-quarters of the Mediterranean country´s population of 6 million into poverty."
    ]
}