{
    "articleURL": "/news/article-12051543/Waitrose-customers-complain-shopping-cold-dimly-lit-aisles.html",
    "content": [
        "System of ‘half-lighting’ being used for first two hours Monday to FridayThe supermarket has turned down the thermostat on the heating in its outletsShoppers at Waitrose are complaining they have to negotiate cold and dimly lit aisles after the retailer made cuts to its energy use.",
        "The chain’s stores have moved to a system of ‘half-lighting’ for the first two hours that the doors open from Monday through to Friday.At the same time the supermarket, which is part of the John Lewis group, has turned down the thermostat on the heating in its outlets, sending a chill through shoppers.John Lewis has turned down the heating in its department stores over recent months, although there have been no changes to the lights.Other stores, such as Morrisons and the Co-op, are taking similar steps in a move designed to cut energy use and bills against the background of spiraling tariffs.",
        "Currys has reduced the number of TVs on display that are switched on in order to make savings.While other businesses and public organisations have resorted to the same desperate measures, not least because many staff now work from home.Many businesses are switching to low energy LED lights which both use less energy and have a longer life.",
        "Customers are unhappy at the changes with some complaining they could even be dangerous.Francine Monks, of Beckenham, South East London, told Waitrose: ‘My 78-year-old frail husband had to sit at the other end of the shop because he felt so unwell in the cold.‘My hands were frozen! Please provide some heat.’ ",
        "A customer complained about conditions in the Milngavie store in Glasgow, saying: ‘What is going in in this store?‘Yesterday I had the misfortune to visit the store and could not believe how cold and dark it was inside! I am noticing it is very chilly in your store compared to other supermarkets. Why is this so?’  A customer in Horsham, West Sussex, added: ‘Won’t be going again any time soon. A company with a death wish?’Another customer tweeted from a dark in-store café and said: ‘This energy saving policy is doing damage to your reputation and your café business.‘Don’t open the café and sell goods until 10am if you don’t switch the lights on till then.’ Waitrose warned in December that it faced an £18million energy cost overspend.The chain suggested at least part of the reason for the changes is to cut energy use as a green policy to reduce climate change emissions.A spokesman insisted that the description of the policy as ‘half-lighting’ does not mean that half the lights are turned down, but rather that they are dimmed slightly.On the reduced temperatures, he said: ‘The thermostat has just been turned down slightly - though naturally the weather is getting warmer, so it’s even less likely to be noticeable.’ ",
        "He added: ‘Saving energy reduces our environmental impact and helps focus our investment on areas that matter for customers - like product innovation and lowering prices.‘The changes have widely been well received; with the very small number of comments we’ve had typically linked to localised issues - like a temporary heating failure - rather than our wider energy-saving plans.’"
    ]
}