{
    "articleURL": "/wires/reuters/article-12053137/Olympics-Australia-chief-calls-govt-funding-Brisbane-success.html",
    "content": [
        "By Nick Mulvenney",
        "SYDNEY, May 6 (Reuters) - Australia's Olympic chief Ian Chesterman on Saturday called for more government funding for sport to ensure that the country puts on a good showing when it hosts the 2032 Summer Games in Brisbane.Chesterman told the Australian Olympic Committee (AOC) annual general meeting national sporting bodies were already financially stretched and that the groundwork for Brisbane success needed to be laid now.\"It is clearly understood that a successful home Games requires a successful home team. But the clock is ticking and the strain within the system is showing,\" the AOC chairman said.\"We come off a hugely successful Tokyo Games, but that is nearly two years ago, and the system that helped to produce those performances is understandably struggling. Everything is going up, except the funds to run the programmes.\"Results also don't come at the flick of a switch, so if Australia is to have a successful team in Brisbane 2032, the system, the people, that took us to that success in Tokyo need nurturing now.\"Funding athletes to qualify for and compete at next year's Paris Olympics would be the most expensive for any Games, he added, with inflation and the rise in the cost of air travel hitting Australia particularly hard.On the thorniest issue currently facing the Olympic movement, Chesterman said the AOC wanted Russia and its ally Belarus to be held accountable for the invasion of Ukraine.",
        "They also, however, shared the Olympic mission of bringing \"the athletes of the world together in peaceful competition\", which led the IOC to lay out a potential pathway for Russian and Belarusians to compete as neutral athletes in Paris.\"Important to note is that the IOC has not yet made a decision regarding the participation of these athletes at Paris 2024,\" he said.\"One senses that there is still much to play out in the coming months and we do not expect this matter to be resolved anytime soon.\"Chesterman also announced that the AOC had decided to back the \"yes\" vote in this year's national referendum on the constitutional recognition of the country's indigenous peoples, known as the \"Voice\".\"We have committed ourselves to pursue reconciliation with Aboriginal and Torres Strait Islander peoples through sport,\" he said.\"We did not take this decision lightly as we know there will be those within the Olympic movement who will vote 'no' and we respect their right to do so.\" (Reporting by Nick Mulvenney; Editing by Stephen Coates)"
    ]
}