{
    "articleURL": "/sport/boxing/article-12050179/Aussie-boxer-Michael-Zerafa-turns-world-title-shot.html",
    "content": [
        "Michael Zerafa has turned down the opportunity to fight for a world title He has agreed to step aside after receiving a 'substantial' financial offer The 31-year-old has already turned down fights v Esquiva Falcao and Tim Tszyu Michael Zerafa has reportedly turned down the chance to fight for a world title, despite being the mandatory contender for Erislandy Lara's belt.",
        "Zerafa, 31, was in line to face the Cuban-American for his WBA middleweight title this year, but has instead elected to take on a warm up fight on the undercard of Lara's bout against Danny Garcia - which will be a voluntary defence.It means that there is the potential danger of Zerafa losing his mandatory world title challenger status if he is to suffer a defeat in his next fight. The 31-year-old has now turned down three major opportunities this year, after his team withdrew from the purse bid for a fight against IBF king Esquiva Falcao in March in order to pursue the Lara fight.Falcao labelled the Australian a 'chicken' for avoiding the fight.",
        "Zerafa also turned down the chance to take on bitter rival Tim Tszyu for his interim WBO super welterweight title.His manager, Elvis Grant, clarified that the Lara decision was influenced by the Australian receiving a 'substantial' financial offer to step aside.'First of all, that fight before Michael was made mandatory was already in process,' Grant told Fox Sports.'They were negotiating it and all of that stuff. When Michael got made the mandatory, they basically were asking would we be OK to let this fight go ahead and for Michael to fight on the undercard and whatnot and then get the next shot.",
        "'In the interest of letting the fight happen and the offer as substantial as it was, we went ahead and let the fight go ahead.'I spoke with Al Haymon (Garcia's manager) about it, I spoke with Luis DeCubas Jr (Lara's manager) about it and they were more than reasonable in working everything out with us. So it worked out very good for Michael.'Grant also provided a sobering analysis of fighter priorities when justifying Zerafa's decision. 'Money talks and bulls*** walks,' he added.",
        "'The money was substantial enough plus the fact he's now going to be trained by Jimmy Montoya, a legendary trainer who's trained 20 world champions, this is going to be their first fight to have an opportunity to work together and gel together.'In that respect, it's good for that as well to give them a chance to really know each other and work together then get ready for the big fight which is looking like November.'It was not a tough decision to make with the financial compensation and everything else.' "
    ]
}