{
    "articleURL": "/news/article-12039417/Hundreds-children-discovered-Kentucky-McDonalds-chain-faces-federal-fines.html",
    "content": [
        "Two 10-year-olds were found to have been working long, unpaid shifts at a Louisville, Kentucky, McDonald'sThey are just two of 305 minors under the age of 16 who the Department of Labor investigators discovered were working illegally at McDonald'sBusinesses across the country have been turning to younger workers to cope with the labor shortageTwo 10-year-old children were found to have been working unpaid shifts at a Kentucky McDonald's, sometimes until 2am.",
        "The children, who have not been named, prepared and served meals at the Louisville McDonald's, worked the drive-thru and cash register and had to clean the floor.One was even allowed to work the deep fryer, a task that is considered illegal for anyone under the age of 16, as it involves 'dangerous equipment.'The two children are just some of 305 children under the age of 16 who the United States Department of Labor's Wage and Hour Division investigators discovered were working illegally at McDonald's restaurants in Kentucky, Indiana, Maryland and Ohio.It comes as businesses across the country have been turning to younger workers to cope with the labor shortage — with some states passing bills to ease child labor laws.",
        "According to the Department of Labor, 62 McDonald's restaurants were found to have violated child labor lawsThey are run by three franchises: Bauer Food LLC, Archways Richmond LLC and Bell Restaurant Group LLC, which were required to pay a total of $212,754 in fines.Officials say Bauer Foods, based in Louisville, employed 24 employees under the age of 16, including the two 10-year-olds who were hired back in August 2022.Those children worked 10 shifts between two to four hours per night, investigators told the Miami Herald.But under US law, the minimum working age is 14, but there are limits on working hours for those under 16 and prohibitions on hazardous jobs for anyone under 18. ",
        "The franchise was fined $39,711 as a result of these violations.Meanwhile, Archways Richmond, based in Walton — about 80 miles northeast of Louisville, employed 242 14- and 15-year-olds who worked either too early or too late in the day. Investigators said the franchise sometimes had teenagers working over three hours on a school day.It was ordered to pay $143,566 in penalties as a result.And Bell Restaurant Group, based in Louisville with additional restaurants in Maryland and Indiana also had 14 and 15 years olds working too early or too late into the night, and longer than allowed under law.Fifty-eight of those teenagers were not paid overtime wages, federal officials say.It was ordered to pay $14,730 in back wages and liquidated damages to the workers. DailyMail.com has reached out to Bauer Foods, Archways Richmond and the president of Bell Restaurant Group for comment. McDonald's Senior Vice President and Chief People Officer Tiffanie Boyd provided a statement after being contacted by DailyMail.com.'These reports are unacceptable, deeply troubling and run afoul of the high expectations we have for the entire McDonald’s brand. It is not lost on us the significant responsibility we carry to ensure a positive and safe experience for everyone under the Arches,' the statement read ",
        "'I know how important it is that every restaurant fosters a culture of safety. As a mother whose teenage son proudly worked at our local McDonald’s, I feel this on a very personal level. We are committed to ensuring our franchisees have the resources they need to foster safe workplaces for all employees and maintain compliance with all labor laws.'",
        "The report comes just one year after a couple recorded two children behind the counter at a Louisville McDonald's.But a spokesperson for the company told WHAS 11 that the minors shown in the video were not actually employees — and were instead the children of some of the employees.'While we are proud to employ many parents and caregivers and understand that sometimes kids may visit a parent's workplace, minors who are not employees are not permitted behind the counter,' the spokesperson said in a statement at the time.'We have taken action to ensure that all of our employees are reminded of our policies regarding visitors.'More recently, federal investigators found a 15-year-old working at a McDonald's in Morristown, Tennessee, suffered hot oil burns when using a deep fryer in June 2022.The franchisee in that case, Faris Enterprises of TN LLC, was fined a $3,258 civil penalty.In total, the Department of Labor issued a total of $4.3 million in penalties for child labor law violations in fiscal year 2022, when 688 minors were found to be employed illegally in hazardous conditions — the highest annual count since fiscal year 2011.",
        "At the same time, a New York Times investigation found an increase in the number of unaccompanied minors arriving in the US and joining the workforce, including middle school students working in meatpacking and roofing. 'Too often, employers fail to follow the child labor laws that protect young workers,' Wage and Hour Division director Karen Garnett-Civils said in a statement.She added that the department is 'seeing an increase in federal child labor violations, including allowing minors to operate equipment or handle types of work that endangers them or employs them for more hours or later in the day than federal law allows.' ",
        "Meanwhile, lawmakers in at least 11 states over the past two years have sought to loosen child labor laws to help employers fill roles.They argue that relaxing the rules would prompt teens to seek out valuable work experiences, and make it easier for them to supplement their family's income. A new law in Arkansas, for example, removed the requirement that children under 16 provide parental consent to work, and a Tennessee law scraps the prohibition on 16- and 17-year-olds working in restaurants that derive more than a quarter of their revenue from alcohol.A bill in Minnesota would also allow 16- and 17-year-olds to work in construction, and one in Iowa would permit 14- and 15-year-olds to work in coolers and meat freezers. "
    ]
}