{
    "articleURL": "/wires/ap/article-12059511/6-tanker-crew-members-seized-pirates-freed-W-Africa.html",
    "content": [
        "COPENHAGEN, Denmark (AP) - Six crew members of a Liberian-flagged tanker held hostage for more than a month by pirates in West Africa have been freed, the Danish shipping company that owns the vessel said Monday.",
        "On March 25, pirates boarded the Monjasa Reformer southwest of Port Pointe-Noire, Congo. The ship was found abandoned five days later by a French navy patrol off the small island nation of Sao Tomé and Principe north of where the attack took place.The pirates left 10 of the 16 crew members on board, kidnapping the remaining six and taking them to shore in Nigeria.In a statement, Monjasa company spokesperson Thorstein Andreasen said that the ordeal of the six crew members had ended Monday and they were \"now safely recovered from an undisclosed location in Nigeria.\"All \"are in a relatively good health condition given the difficult circumstances they have been under in the last more than five weeks,\" Andreasen said in the statement. He added that they had received medical checks and were being repatriated to their home countries to reunite with their families.The Gulf of Guinea is one of the world´s most dangerous places for attacks on ships. This hijacking took place further south in an area that is not typically attacked by pirates.Anders Ostergaard, the CEO of Monjasa, which is based in Fredericia, western Denmark, thanked those who had helped to \"resolve this awful situation.\"After the pirates boarded the tanker, the crew sought refuge in a citadel - a safe area on the ship - in line with the on-board anti-piracy emergency protocol. However, the pirates somehow managed to take some of them hostage.",
        "The nationalities of the crew members has not been announced, nor were details given as to where and how they were held.No damage to the ship or its cargo has been reported. No further details were given.The Danish shipper said that the episode \"clearly demonstrates the need for joint international political action to face these issues once and for all\" and \"urges for safe passage routes and safe zones under an international coalition.\"The Monjasa Reformer is used in West Africa as part of Monjasa´s global marine fuels operations. It was carrying marine gas oil, very low sulphur fuel oil and high sulphur fuel oil products on board, the shipper said."
    ]
}