{
    "articleURL": "/tvshowbiz/michael-flatley/article-12050461/Michael-Flatley-looks-good-beams-Lizzie-Cundy-Eric-Claptons-gig-cancer-surgery.html",
    "content": [
        "Lord Of The Dance icon Michael Flatley looked happy and healthy as he beamed with old time pal Lizzie Cundy on Thursday while attending Eric Clapton's restaurant gig - three months after surgery for an 'aggressive' cancer. ",
        "The Irish-American dancer, 64, donned a chenille black shirt and matching trousers, teamed with white trainers - as he posed for a snap with a big smile.Lizzie took to Instagram as she penned her post: 'Reunited with my ol friend @michealflatleyo258 #carls #birthday,' The Riverdance creator appeared in high spirits - as a sourced revealed he flew from Monaco, where he now lives.The dance icon underwent surgery earlier this year to deal with an 'aggressive' form of cancer.",
        "In January Michael has revealed he has been released from hospital and that he was 'on the mend' following his cancer diagnosis.Taking to Instagram, Michael posted a photo of himself raising his fist to the camera as he headed back home.Alongside the post, he wrote: 'Thank you to everyone around the world for your love and prayers. I am overwhelmed by your kindness. I have been released from hospital and am on the mend.'Former footballer Shay Given wrote: 'Well done Michael, keep fighting,' while actress Victoria Smurift added: 'Good man'.A statement shared to Michael's Instagram page from his team read: 'Dear friends, we have something personal to share, Michael Flatley has been diagnosed with an aggressive form of cancer.'He has undergone surgery and is in the care of an excellent team of doctors. No further comments will be made at this time. We ask only for your prayers and well wishes. Thank you. Teamlord.'",
        "Alongside the message, the team shared a black and white image of Michael looking out to sea while stood on a beach.The Lord Of The Dance star was diagnosed before Christmas with an unspecified type of cancer, it has been reported.",
        "It is unknown if the diagnosis is linked to his previous battle with skin cancer. Michael was diagnosed with a malignant melanoma in 2003, which he revealed eight years ago for the first time.He explained to the Irish Independent at the time: 'It was purely by chance that it was noticed. I had never even noticed it...it can be a frightening place to be.'Michael's melanoma was spotted by an MTV viewer who noticed the symptoms of his condition during a television appearance.Speaking about the experience, he said: 'So many people who surround me have had cancer and so many people I know have died from it.'I was diagnosed with skin cancer myself and it was a very scary time. I sympathise with anybody who is lying on that bed and facing the uncertainty of the future. It can be a frightening place.'It was a malignant melanoma that I was diagnosed with. It was around 2003 and it was purely by chance that it was noticed.'",
        "He continued: 'We were at the fifth anniversary of Lord of the Dance in Las Vegas and I did an interview with MTV.'Somebody watched the interview and brought it to the attention of my personal assistant and said: \"Did you ever notice the brown spot on the side of Michael's face?\" I had never even noticed it.'They advised me to go and have it looked at. I did and the doctor took a sample of it there and then. I was flying to Barbados the next day and he gave me a call and asked me to come and see him.'I said I was leaving for the airport and would he mind if I called him when I got back? He said: \"No, I need you to come in immediately.\"'That was a little scary. I cancelled the flight and went straight in to see him. He said if I had let it go a few more weeks there was probably nothing he could have done for me.'Michael previously spoke about how his 2003 cancer diagnosis changed his outlook on life, specifically his wealth and material possessions.He said: 'If I was in a position to go for everything, that intensified. And the value of friends, the value of loved ones — all of a sudden, material things faded away into the past.'",
        "He told Russell Davies on BBC Radio 2: 'My art and the people that I spend time with are the things that I love most now. Cancer certainly gave me tremendous focus.'Michael is a noted charity campaigner. The Chicago-born dancer has hosted special Christmas parties for vulnerable children at his home in north Cork.In 2003 he received a special award from Prince Rainier of Monaco for his support for various charities, including many dedicated to cancer research.The choreographer shot to fame in the Irish dancing production Riverdance, which was first performed as a seven-minute interval break at Eurovision in 1994.After the success of Riverdance at Eurovision, it was extended into a full-length show and opened at Dublin's Point Theatre in 1995.Michael, who was born into a blue-collar Irish-American family in Chicago, followed up with his own stage show, Lord Of The Dance.He has also created, produced and directed other shows including Feet Of Flames and Celtic Tiger.Michael has also expanded into film, directing and starring in the 2018 spy thriller Blackbird.In the movie, which also stars Eric Roberts, Patrick Bergin and Ian Beattie, Michael plays former MI6 operative Victor Blackley, who is drawn back into the world of espionage he left behind.Last year Michael also launched a Lord Of The Dance tour to raise money for the humanitarian effort in Ukraine. ",
        "The dance icon was in attendance of the celebrity-studded restaurant gig where Eric Clapton played for a six figure sum, along with Lizzie, Ronan Keating and Gary Lineker.The legendary guitarist, 78, who is rumoured to join a slew of A-list stars on stage at the King's Coronation at the weekend, played a number of hits at the champagne soaked soirée.After pocketing a hefty sum for the private gig, Eric played for Simon Cowell's ex Jackie St Clair as she rang in her husband Carl Michaelson's birthday in style.Speaking at the event, a source told MailOnline: 'Eric performed for an hour at the bash, where champagne was flowing all night.'Meanwhile Lizzie Cundy stunned in a red mini dress with a feathered trim and a luxe pink fur coat.She showed off her incredible figure in the fitted number and elevated her frame with a pair of matching red heels.Greeting the guests, Jackie, 63, looked sensational in a dusky pink tiered dress with flecks of silver twinkling in the light.The former model boosted her height with a pair of towering platform heels and styled her brunette locks into glamorous curls.Carl looked suave in a dark blue suit with a crisp white shirt and a pair of suede shoes.",
        "Also in attendance was Gary Lineker, Ronan Keating and his wife Storm, who all posed for photos outside the venue.",
        "Eric's private gig comes head of his rumoured performance at the King's Coronation on Saturday.There'll be dancing all night long as Lionel Richie has been confirmed as one of the names taking centre stage at the concert.Take That, as well as pop singer Katy Perry and global opera star Andrea Bocelli are also signed up to appear at the event in the grounds of Windsor Castle, according to the BBC.Other names unveiled by the broadcaster yesterday include Welsh bass-baritone Sir Bryn Terfel, and singer Freya Ridings who will perform a duet with producer and musician Alexis Ffrench.Some 20,000 members of the public will attend the Coronation Concert on Sunday, May 7, which will be aired on BBC1 and Radio 2 along with catch-up services.According to the BBC, the concert will 'celebrate a new chapter in the nation's history' and will have 'themes of love, respect and optimism' while celebrating the 'four nations' and the Commonwealth.It comes less than a year after the concert to mark Queen Elizabeth II's Platinum Jubilee, which included music by Queen, Duran Duran and Diana Ross.Lionel, whose hits include Hello and All Night Long, became The Prince's Trust's first global ambassador in 2019.He said: 'To share the stage with the other performers at the Coronation Concert is a once-in-a-lifetime event and it will be an honour and a celebration.'The concert will be backed by a 70-piece orchestra and a 'house band' made up of the Massed Bands of the Household Division and the Countess of Wessex's string orchestra.There will also be the support of The Coronation Choir – a diverse group of performers including sea shanty singers, cab drivers, farmers and reggae choirs.Landmarks and locations around the UK will also be lit up with lasers, drone displays and illuminations.Charlotte Moore, BBC chief content officer, said: 'We have a world-class line-up of performers to look forward to for what promises to be a very special night of celebration and entertainment.'"
    ]
}