{
    "articleURL": "/femail/article-12057035/Zara-Tindall-elegant-husband-Mike-attend-Coronation-concert-Windsor.html",
    "content": [
        "Zara Tindall, 41, looked radiant this evening as she attended the King's Coronation concert in Windsor READ MORE: For all the latest Royal news, pictures and video click here Zara Tindall was radiant today as she joined her husband Mike to attend the star-studded Coronation concert.",
        "It's been a busy weekend for the couple so far, after they partied till 2am in London on Friday night before attending yesterday's festivities alongside their fellow royals yesterday.But, despite their packed social calendar, the couple appeared quick to get into the party spirt today as they arrived on the East Lawn of Windsor Castle.  Lionel Richie and other incredible singers took to the stage in Windsor for a musical extravaganza following the King's coronation yesterday.Mother-of-three Zara, 41, looked stunning in green as she arrived at the concert this evening, arm-in-arm with her husband Mike. ",
        "Zara, who is the King's niece, lives on Princess Anne's Gatcombe Park Estate in Gloucestershire with her former rugby player husband Mike, 44. She accessorised her Coronation outfit with some very pricey jewellery yesterday as she joined members of the Royal Family to mark King Charles' Coronation on Saturday.The mother-of-three looked elegant as she was pictured wearing the 18ct White Gold drop earrings from Calleija, which retail for £29,900.Zara wore a smart blue and white custom dress by designer Laura Green as she arrived in London for the historic first Coronation in 70 years at Westminster Abbey.She also donned a pale blue hat with chiffon detailing and wore her golden locks in a stylish updo.",
        "Zara and Mike have no official duties but are regulars at royal events, such as church services and the Jubilee.The king's niece is an accomplished equestrian and Olympian and she has kept a relatively low public profile and often spends her weekends at sporting events.Last week the athlete was across the pond in Lexington, Kentucky for an equestrian competition with her steed, Class Affair.",
        "Tonight's event comes after Buckingham Palace said the King and Queen were 'deeply touched' by the nation's celebration of their coronation.More than 18 million people in the UK tuned in to watch the ceremony on TV, compared with 26.5 million for the late Queen's funeral in September.The concert came after Buckingham Palace issued the first public statement on behalf of Charles and Camilla since they were crowned.A Palace spokesman said the King and Queen were 'profoundly grateful' for all those involved in organising the celebrations and ceremony, and the spectators who attended the day.'Their Majesties were deeply touched by the events of yesterday and profoundly grateful both to all those who helped to make it such a glorious occasion - and to the very many who turned out to show their support in such numbers in London and further afield,' he said.",
        "The King, Queen and royal family joined around 20,000 members of the public at the musical extravaganza.Heir to the throne William took to the stage to deliver a speech during the event in the grounds of Windsor Castle, with Kensington Palace sharing behind-the-scenes footage of the prince during rehearsals.The show, hosted by Downton Abbey and Paddington actor Hugh Bonneville, saw Hollywood star Tom Cruise and adventurer Bear Grylls appear via video message.",
        "The series of pre-recorded sketches revealed little-known facts about the monarch. There were also performances by Paloma Faith, Olly Murs, veteran singer Steve Winwood - whose grandson Arthur Eliot was one of Camilla's pages of honour - and Nicole Scherzinger of The Pussycat Dolls.Classical acts including Andrea Bocelli, Welsh bass-baritone Sir Bryn Terfel and Chinese pianist Lang Lang performed too.The Royal Ballet, the Royal Opera, the Royal Shakespeare Company, the Royal College of Music and the Royal College of Art all came together for the first time to create a one-off performance featuring Sex Education and Doctor Who star Ncuti Gatwa and Olivier Award nominee Mei Mac.Thousands of street parties have been held across the country with people encouraged to come together for the Coronation Big Lunch.Prime Minister Rishi Sunak and his wife, Akshata Murty, hosted a lunch in Downing Street, inviting volunteers, Ukrainian refugees and youth group members.",
        "Meanwhile, Camilla asked for her coronation bouquet of English spring flowers to be placed on the Grave of the Unknown Warrior in the coronation church, Westminster Abbey.The simple posy, including auriculas, the late Queen's favourite lily of the valley, and one of Charles' favourites hellebores, by the King and Queen's go-to florist, Shane Connolly, was laid at the memorial.Royal brides traditionally send their bouquets to be placed there the day after their weddings in a tradition started by the Queen Mother.Camilla did not carry the flowers on Saturday as it was a coronation not a wedding, the Palace said."
    ]
}