{
    "articleURL": "/wires/reuters/article-12052363/Venezuelan-opposition-party-replaces-Guaido-candidate.html",
    "content": [
        "CARACAS, May 5 (Reuters) - Venezuelan opposition party Voluntad Popular on Friday named a new candidate for a key presidential primary in October, replacing formerly anti-government leader Juan Guaido who left Venezuela unexpectedly in late April.",
        "At a news conference, Voluntad Popular named political coordinator Freddy Superlano, a 46-year-old engineer and critic of President Nicolas Maduro, as its nominee, explaining Guaido could not represent the party from \"exile.\"Voluntad Popular member Desiree Barboza said the decision to name Superlano the party's candidate was unanimous. Superlano will be up against at least a dozen other figures seeking to lead the opposition in the presidential contest, expected in 2024.Guaido arrived in Miami on April 25 from Bogota, where he had gone intending to join an international conference on Venezuela's political future. He said Colombian authorities forced him to leave despite his appeal for protection citing new threats by Maduro's government.From 2019 to December 2022, Guaido served as acting president in a shadow government challenging Maduro until the opposition dissolved it.Like Guaido, Superlano is barred by judicial and administrative rulings from running for public office.Other candidates seeking nomination in the October primaries have also been disqualified, an issue the government and opposition have been negotiating.Speaking at Voluntad Popular headquarters, party member Barboza called Superlano a \"man who beat Chavismo\", referring to his 2021 victory in the race for governorship of Barinas state, a former stronghold of the ruling party as the birthplace of late President Hugo Chavez.",
        "The Supreme Court, seen by critics as an arm of the government, invalidated the result and Superlano did not take office. (Reporting by Vivian Sequera and Mircely Guanipa, Writing by Isabel Woodford; Editing by Cynthia Osterman)"
    ]
}