{
    "articleURL": "/news/article-12039261/Queensland-firefighter-Izabella-Nash-dies-blaze-Slacks-Creek-Brisbane.html",
    "content": [
        "Female firefighter has died after factory fire in BrisbaneIt's feared Izabella Nash's breathing apparatus failed A female firefighter has died overnight after she became 'trapped' and ran out of air' in a factory fire at Slacks Creek, Brisbane, early yesterday morning.",
        "Izabella Nash, 46, died after entering the inferno with two colleagues about 2.30am on Tuesday before the three were all feared missing in the flames.Her two fellow firies were found and pulled from the flames but it is believed Ms Nash ran out of oxygen, amid fears her breathing apparatus failed.She is understood to have fallen unconscious inside the blazing building before being discovered and carried out by other firefighters. A second firie, senior Firefighter Lia Drew, remains in hospital in a serious but stable condition, suffering burns and smoke inhalation. ",
        "Both were described as veteran firefighters with around 25 years of experience between them. The third male firefighter escaped without injury.The two women are said to have been trapped on the second storey of the building as they tried to tackle the inferno.'They were upstairs for a while. The crews went to rescue them, they had to find them,' United Firefighters Union Queensland secretary John Oliver told the Courier-Mail.'We will look into every aspect of what went wrong - communications, whether the breathing apparatus failed or not, the types of areas that were posted to them.'It will all come out. I’m concerned for the fireys that have gone down. I’m very concerned for the firefighters that rescued those firefighters.'",
        "Ms Nash was declared dead at 9.15pm on Tuesday at the Royal Brisbane and Women’s Hospital, where she was taken by rescue workers.Tributes have been posted to the fallen firefighter online, with one commenting: 'RIP Izzy, your shift is over.' Another added: 'Rest easy Izabella, thank you for your service.'Former colleague Rob Boniwell revealed he had met Ms Nash when she was bidding to become a firefighter in 2014.'I interviewed Izzy for her role as a permanent firefighter and was proud to see her graduate from the school several years ago,' he posted on Facebook. 'In my 29 years of service I have never experienced a fellow firefighter from my own agency or service pay the ultimate sacrifice to protecting their communities. 'Until now.  My thoughts and prayers are with our Fire and Rescue friends, families and colleagues today and the immediate future. We are all feeling this sad loss. 'Rest in peace Izzy. You will be sadly missed.'An investigation has now been launched into the condition and operation of Ms Nash's breathing apparatus, while a probe is also underway into the cause of the fire.'It is very rare that our firefighters are injured in this way,' Queensland Fire and Emergency Service Deputy Commissioner Michael Wassing said. 'That's because of the enormity of the training and professionalism of our firefighters.'",
        "Ms Nash joined the Fire and Rescue Service in 2014 and served as a First Class Firefighter.'The thoughts of all QFES members are with Izzy's and Lia's families, friends and fellow crew members,' said a QFES spokesman.",
        "Queensland Premier Annastacia Palaszczuk said the tragedy brought home the dangers faced by emergency services personnel every day.'She was clearly devoted to her job, on the front line supporting her fellow Queenslanders,' said the premier. 'Izabella's passing is a terribly sad and poignant reminder of the dangers our front-line staff face on a daily basis.'Federal Treasurer and local MP Dr Jim Chalmers also paid tribute to Ms Nash, calling her an 'incredible young woman'.He added: 'The news has come through this morning that Isabella Nash lost her life protecting our community in that horrible fire in Slacks Creek.",
        "'This is another reminder of the courage, the selflessness and the commitment of people who are first responders.'That fire two nights ago was a dangerous fire. We've lost an incredible young woman. Selfless, committed and courageous.'Her loved ones and her work mates will be incredibly sad today and our community is heartbroken too.'State fire and emergency services minister Mark Ryan added: 'So sad to hear of the passing of firefighter Izabella Nash. With Izzy's passing, Queensland has lost a hero.",
        "'The thoughts of our entire state are with her family, friends and the broader fire and emergency services family,' Mr Ryan posted on Twitter."
    ]
}