{
    "articleURL": "/sport/football/article-12043985/THE-NOTEBOOK-Man-City-chance-sign-Bellingham-years-ago-home-fans-test-Peps-patience.html",
    "content": [
        "Bellingham opted against a transfer to Etihad when in Birmingham's academyAlvarez was everywhere again and is providing a real selection headacheMan City 3-0 West Ham: Guardiola's side go back to the top of the table Manchester City's Erling Haaland scored his record-breaking 35th Premier League goal of the season to help secure a 3-0 victory against West Ham United that sent his side back to the top of the table on Wednesday.",
        "Nathan Ake made the breakthrough five minutes after the interval with a header from a free kick.Haaland then eased the tension around the Etihad Stadium as he latched on to Jack Grealish's through ball to beat Lukasz Fabianski and move past the 34 goals of Andy Cole and Alan Shearer with five games still to play.With the points secured, substitute Phil Foden then made it 3-0 with a superbly-struck volley in the 85th minute.Mail Sport's JACK GAUGHAN has a look at some of the things you may have missed. ",
        "City had chance to sign Jude years agoThe news coming out of Spain on Wednesday that Jude Bellingham was closing in on a move to Real Madrid will not have gone down well at Manchester City.It is no secret that Pep Guardiola — who wants a new central midfielder ahead of next season — hoped Bellingham would be the fresh impetus required should Ilkay Gundogan depart once his contract expires.City were tight-lipped, although Mail Sport understands that Bellingham has previously opted against a transfer to the Etihad.When in Birmingham City’s academy, and trailed by pretty much everybody, Bellingham — and his father, Mark — visited City but were not taken by what was on offer. ",
        "He remained at Birmingham, quickly progressed to the first team, and a few years later looks set to become the most expensive midfielder in history.",
        "Alvarez was everywhere againJulian Alvarez is still learning the No 10 position, often coached through specific movements by Pep Guardiola during this encounter.It’s not natural just yet but the Argentine was everywhere again, just as he was at Fulham on Sunday, and is providing the manager with a real selection headache for the remaining weeks of the season.Fans miss midweek trip There were an unusually large number of empty seats in the away end. West Ham sold out their allocation of just under 3,000 before this game was rearranged in March due to the FA Cup.It’s hard to blame them for not turning up on a Wednesday night — or perhaps the sickness bug that saw Declan Rice, Tomas Soucek and Nayef Aguerd sent home at 2pm went further than the squad? Yet those who did turn up made themselves heard, chanting: ‘How s*** must you be, we’re drawing away,’ in the first half.Home fans test Pep's patienceThis stadium has been absolutely rocking recently — not least during last week’s thrashing of Arsenal, when it was alive. The atmosphere has generally improved this year, which could be partly down to the exploits of Erling Haaland.",
        "But just after the hour, with City one-goal ahead but West Ham threatening, the Etihad went quiet and it is fair to say that Guardiola looked rather displeased.He turned to the Colin Bell Stand, shaking his head at supporters behind him, before the ground rose to cajole their side on. Guardiola returned some big theatrical applause.",
        "City's healthy initiativeCity announced that their community arm have launched a new fundraising initiative — Healthy Goals — that will create new spaces for youngsters in Manchester.The club said they would be matching all donations made before September.Two refurbished pitches are set to open soon and the club are scaling up outreach projects.",
        "Morrison likes a treble Andy Morrison, the former City defender and now manager of Sri Lanka, does monthly predictions for the club’s online magazine. It may shock you, reader, to know that Morrison has City winning all of their remaining Premier League matches — thus clinching the title — beating Real Madrid over two legs in Europe and also lifting the FA Cup. Easy, right?"
    ]
}