{
    "articleURL": "/sciencetech/article-12038355/ChatGPT-create-new-religion-writing-sacred-texts-historian-claims.html",
    "content": [
        "Yuval Noah Harari said AI like ChatGPT could attract worshippers to a new faithAcademic said AI had crossed new frontier by 'gaining mastery' of our languageThe world is on the verge of a new religion created by artificial intelligence, the historian Yuval Noah Harari has claimed.",
        "The academic – known for his bestselling book Sapiens – said software such as ChatGPT could attract worshippers by writing its own sacred texts.Speaking at a science conference, he said AI had crossed a new frontier by 'gaining mastery' of our language and was now capable of using it to shape human culture.Dr Harari used the event to add his voice to growing calls for urgent regulation over the sector, which experts have warned is amid a 'dangerous' arms race.He said: 'In the future we might see the first cults and religions in history whose revered texts were written by a non-human intelligence.",
        "'Of course, religions throughout history claimed that their holy books were written by unknown human intelligence. This was never true before.",
        "'This could become true very, very quickly, with far-reaching consequences.'Speaking at the Frontiers Forum event in Switzerland, he warned machines now had the tools to 'cocoon us in a Matrix-like world of illusions', referring to the 1999 sci-film film.The Hollywood blockbuster depicts a dystopian future in which humanity is unknowingly trapped inside a simulated reality that intelligent machines have created to distract humans while using their bodies as an energy source.He said: 'Contrary to what some conspiracy theories assume, you don't really need to implant chips in people's brains in order to control them or to manipulate them.",
        "'For thousands of years, prophets and poets and politicians have used language and storytelling in order to manipulate and to control people and to reshape society.'Now AI is likely to be able to do it. And once it can... it doesn't need to send killer robots to shoot us. It can get humans to pull the trigger.'Calling for tighter regulation, he said: 'We need to act quickly before AI gets out of our control. Drug companies cannot sell people new medicines without first subjecting these products to rigorous safety checks.'He added: 'Similarly, governments must immediately ban the release into the public domain of any more revolutionary AI tools before they are made safe.'",
        "Elon Musk wants to push technology to its absolute limit, from space travel to self-driving cars — but he draws the line at artificial intelligence. The billionaire first shared his distaste for AI in 2014, calling it humanity's 'biggest existential threat' and comparing it to 'summoning the demon.'At the time, Musk also revealed he was investing in AI companies not to make money but to keep an eye on the technology in case it gets out of hand. His main fear is that in the wrong hands, if AI becomes advanced, it could overtake humans and spell the end of mankind, which is known as The Singularity.That concern is shared among many brilliant minds, including the late Stephen Hawking, who told the BBC in 2014: 'The development of full artificial intelligence could spell the end of the human race.'It would take off on its own and redesign itself at an ever-increasing rate.' Despite his fear of AI, Musk has invested in the San Francisco-based AI group Vicarious, in DeepMind, which has since been acquired by Google, and OpenAI, creating the popular ChatGPT program that has taken the world by storm in recent months.During a 2016 interview, Musk noted that he and OpenAI created the company to 'have democratisation of AI technology to make it widely available.'Musk founded OpenAI with Sam Altman, the company's CEO, but in 2018 the billionaire attempted to take control of the start-up.His request was rejected, forcing him to quit OpenAI and move on with his other projects.In November, OpenAI launched ChatGPT, which became an instant success worldwide.The chatbot uses 'large language model' software to train itself by scouring a massive amount of text data so it can learn to generate eerily human-like text in response to a given prompt. ChatGPT is used to write research papers, books, news articles, emails and more.But while Altman is basking in its glory, Musk is attacking ChatGPT.He says the AI is 'woke' and deviates from OpenAI's original non-profit mission.'OpenAI was created as an open source (which is why I named it 'Open' AI), non-profit company to serve as a counterweight to Google, but now it has become a closed source, maximum-profit company effectively controlled by Microsoft, Musk tweeted in February.The Singularity is making waves worldwide as artificial intelligence advances in ways only seen in science fiction - but what does it actually mean?In simple terms, it describes a hypothetical future where technology surpasses human intelligence and changes the path of our evolution.Experts have said that once AI reaches this point, it will be able to innovate much faster than humans. There are two ways the advancement could play out, with the first leading to humans and machines working together to create a world better suited for humanity.For example, humans could scan their consciousness and store it in a computer in which they will live forever.The second scenario is that AI becomes more powerful than humans, taking control and making humans its slaves - but if this is true, it is far off in the distant future.Researchers are now looking for signs of AI  reaching The Singularity, such as the technology's ability to translate speech with the accuracy of a human and perform tasks faster.Former Google engineer Ray Kurzweil predicts it will be reached by 2045.He has made 147 predictions about technology advancements since the early 1990s - and 86 per cent have been correct. "
    ]
}