{
    "articleURL": "/femail/article-12050881/Christina-Applegate-reveals-devastating-reality-living-day-day-MS.html",
    "content": [
        "Christina, 51, said with MS, 'it's never a good day. You just have s***ty days'She also revealed her struggles to watch the third and final season of Dead To Me'I see this person and I'm like, \"Who is this person with 20 chins?\"' Christina saidChristina Applegate has shared what it's like living day-to-day with multiple sclerosis (MS) in a candid new interview, revealing: 'It f***ing sucks.'",
        "The 51-year-old Dead To Me actress said she was scared of having a shower and had a friend stay with her on weekdays to assist her in looking after her 12-year-old daughter, Sadie, with a caretaker coming on the weekends.'With the disease of MS, it's never a good day. You just have s***ty days. People are like, \"Well, why don't you take more showers?\" Well, because getting in the shower is frightening,' Christina told Vanity Fair.'You can fall, you can slip, your legs can buckle. Especially because I have a glass shower. It's frightening to me to get in there. There are just certain things that people take for granted in their lives that I took for granted. ",
        "'Going down the stairs, carrying things — you can't do that anymore. It f***ing sucks. I can still drive my car short distances. I can bring up food to my kid. Up, never down.'Christina also revealed she kept her contact with other people to a minimum as she was immunocompromised and to keep her nervous system in check she liked to keep her life as 'quiet and as mellow as possible.'Of having visitors, she said: 'It's exhausting. Imagine just being in a crowd of people and how loud that is. It's like 5,000 times louder for anyone who has lesions on their brains.'",
        "The Hollywood actress - who also starred in Married... With Children, Anchorman and View From The Top - spoke out about her struggles with watching the third and final season of Dead To Me - the series she was filming at the time of her 2021 diagnosis.'It's just that sometimes I get cringey about the way I look. It's so hard to look at myself as this other person and I don't look like myself anymore, obviously,' Christina said.'And it's really, really hard for me because so much of my life was my image and then I see this person and I'm like, \"Who is this person with 20 chins?\" To be really brutally honest, that's kind of what's really hard about it for me to watch.'Christina said the series may be the last time she would ever be in front of the camera after being diagnosed.She also said it was helpful to have friends such as Selma Blair, which she starred with in The Sweetest Thing, and Jamie-Lynn Sigler, who both have MS, as it was 'impossible' for people understand what they were going through.",
        "'It is imperative for me to have people who say, \"It's 80 degrees. What the f*** are we gonna do?\" People don't understand that heat makes us sicker,' Christina added. ",
        "This is not the actress's first major health battle after undergoing a double mastectomy to treat her breast cancer in 2008. She explained she wanted the surgery to help ensure that she wouldn't have to deal with the risk of the disease spreading in the future.'It came on really fast. It was one of those things that I woke up and it felt so right,' Christina told CNN of her decision to have a mastectomy.'It just seemed like, \"I don't want to have to deal with this again. I don't want to keep putting that stuff in my body. I just want to be done with this,\" and I was just going to let them go.'",
        "MS is a condition that can affect the brain and spinal cord, causing a wide range of potential symptoms, including problems with vision, arm or leg movement, sensation or balance. The immune system attacks the protective sheath (myelin) that covers nerve fibers and causes communication problems between your brain and the rest of your body.It's a lifelong condition that can sometimes cause serious disability, although it can occasionally be mild.Nearly one million people are living with the condition in the United States, according to a National Multiple Sclerosis Society study conducted in 2019.Of this number, about 74 per cent were female and about 26 per cent were male.'Research has demonstrated that MS occurs in most ethnic groups, including African Americans, Asians and Hispanics/Latinos, but is most common among white people of northern European descent,' the society said.'Susceptibility rates vary among these groups, with recent findings suggesting that African American women have a higher than previously reported risk of developing MS.'",
        "Then in 2018, she had both of her ovaries and her fallopian tubes removed in order to 'take control' of her health and reduce the risk of another cancer diagnosis.'Two weeks ago, I had my ovaries and [fallopian] tubes removed,' she told the Today show at the time. 'My cousin passed away from ovarian cancer in 2008. I could prevent that. That's how I've taken control of everything.'She added that she felt 'relief' after undergoing the procedure, having tested positive for the BRCA1 gene mutation - which greatly increases a woman's risk of breast and ovarian cancer - back in 2008 when she received her breast cancer diagnosis.Following her double mastectomy, Christina revealed that she had completely overhauled her lifestyle in order to eliminate as many chemicals as possible from her diet, while also focusing on reducing her daily stress."
    ]
}