{
    "articleURL": "/femail/relationships/article-12056921/How-ace-lifes-Second-Act-admit-all.html",
    "content": [
        "Remember melancholy Ria, played by Wendy Craig, from the TV sitcom Butterflies in the late 1970s?",
        "One day in my late 40s, I woke up and found I'd turned into her. Minus the 'will she, won't she' affair with dashing businessman Leonard.All of a sudden I felt overwhelmed by my life. Sometimes, I would be gripped by an inexplicable rage at the small regularity of things. The same biscuit tin staring at me from the same shelf every day; the same shopping list at the same supermarket each week.And sometimes, out of the blue, I couldn't summon the energy to care about anything. I just wanted to 'drip' around the house all day, like a sad midlife goth. Taking clean laundry slowly up and down the stairs. Answering emails with one word. Out of the blue I couldn't sleep, I couldn't remember anything and I was exhausted all the time.'What's wrong with me?' I kept muttering under my breath, just like my increasingly independent daughters, who said the same thing to me every time I appeared, in that brutally dismissive way of teenage girls.",
        "And yet, in all my WhatsApp friendship groups, other women were saying it, too — experiencing the same confusion, the same midlife sense of loss and a looming identity crisis.What was wrong with us?I have built my whole career as a journalist on understanding the lives of the women of Generation X. As editor of Cosmopolitan and Elle, in the newspaper features I've written and commissioned, and in the podcast I now co-host, Postcards From Midlife, I have examined, discussed and forensically investigated our experience as women. My generation are 'copers'. Women born to Baby Boomer parents handle stress well; we push on through with a smile.",
        "But as we head out of our mid-40s, many of us are ambushed by the sudden disappearance of our mojo. We stand in front of the mirror and wonder who we're looking at.Well, now I am 54 and feel that I'm almost through that confusing part of life, and I bring you good news: this unravelling is temporary. Gen X has simply reached the messy middle and needs guidance navigating it physically and mentally.Yes, some of the emotional turbulence is general to everyone as they get older, but some is quite specific to us: to Gen X women born between 1965 and 1981, the first generation to charge up the career ladder and yet still battle the restrictions and expectations imposed by an unforgiving sexist world.I know exactly what you are going through not only because I have been through this panic-ridden, confidence-sapping bit myself, but because I have made a lifetime's study of women like you.So here are my six lessons for emerging from this identity crisis intact, and preparing yourself for a calmer, but no less brilliant, Second Act.What is wrong with us? Nothing we can't handle — with just a little bit of help.",
        "THE MYTH OF BEING ABLE TO 'HAVE IT ALL' ",
        "A year after I was made editor-in-chief of British Cosmopolitan, aged 31, I found myself in the Bahamas for a conference with all the Cosmo editors from across the globe.After a day of presentations, we stood in the blistering heat watching Helen Gurley Brown — the founder of the magazine and the woman who, in 1982, wrote the best-selling manual for women entitled Having It All — hurtling down a perilously high waterslide in a skimpy red swimsuit. She was almost 80.By then, Helen and Cosmo had shaped a long-lasting cultural narrative, which had helped define my generation: the idea that women could aspire to have it all on their own terms — work, love, family and financial independence.I adored her spirit. I admired this pencil-thin powerhouse so much I could ignore her obsession with dieting and dating, and her bizarre habit of valuing women primarily for their looks. Instead, I focused on her rallying cry for abortion rights and female financial independence.And yet, with hindsight, I see how burdensome 'having it all' really was. It was, I now think, an exhausting and even ruinous concept that placed a hideous pressure on the Gen X women who grew up during the 1980s and 1990s.The problem was, society wasn't set up for us to 'have it all'. It had been constructed by men who didn't envisage us standing alongside them at work, or them alongside us at home.",
        "In trying to have it all, we were forced to change the schedule. We stayed in education longer. We gave birth later, which meant some of us still had a young family in our later 40s and early 50s, just as we were supposed to reach the peak of our careers.I had four children a decade apart: my first at 33 and my last at 43. Mine was the main salary for our family, and I'd invested a huge amount of time and effort into my career. I wasn't prepared to step out, so I did both: work and motherhood.But at what cost? Cosmo helped define the narrative of my generation. But with hindsight, it was a ruinous concept  School pick-up schedules didn't serve us well, and flexible and remote working was unheard of. But we couldn't be in two places at once, so we constantly felt we had to choose one or the other.Society didn't celebrate the notion of blending work and family — we even called it the 'struggle to juggle', as many men stepped aside, watching us instead of supporting us.When I once quizzed a male boss of mine, who also had four children, about how he managed to balance his career and domestic life, he looked perplexed at the question: 'My wife does all that,' he replied, failing to see the irony of who he was talking to.",
        "Successful women told us to lean into it and dream big. But they didn't offer us ways of doing that, so we struggled with the set-up.Having it all was impossible, and it was unforgivable that sometimes we tried to make it look easy so other, younger women didn't get frightened off from giving it a go. We had an endurance mindset around life.In the end, something has to give, and for me it was full-time work. I continued to work five days a week after my first child, then I did a nine-day fortnight, and finally a four-day week when my fourth was born. My husband and I paid for a part-time nanny, too.If the world had been built as a more equal, better-balanced place (constructed by women, even) then 'having it all' would have meant something else. Instead, it was — and is — a mess.It's why so many of us feel burnout in midlife, and why those feelings are peculiar to our generation. If you're wondering why you can't endure 'it all' any more, then take into account that Cosmo mindset and whether it has played a conscious or subconscious part in your life.TIP: Make a decision to step back for a while. Actively do less, not more.",
        "Release yourself from your emotional responsibilities and leave spaces in your day for nothing if you can. Delegate stuff, drop the ball, leave stuff undone. Saying 'no, thank you' is a new habit to embrace. You don't have to give a reason; saying no is enough.",
        "DON'T TRY TO REINVENT YOURSELF — YETMy attempt at having it all came to an end when I lost my job editing on a national newspaper supplement three years ago. Suddenly, I lost the status and routine — and money —that came with a career at the top of my industry.I was at home all day, untethered from — and yet still itching for — the predictable regularity of the glamorous office life I had had before. Anna Wintour (editor-in-chief of American Vogue and a magazine contemporary) wasn't watching A Place In The Sun of an afternoon, was she?I was a self-made, working-class, comprehensive school-educated woman who had worked intensely hard to get where she was for more than 30 years. And now I felt lost. My identity had been tightly wrapped into my career.The untelling of our life stories as we age and our transition into new places is a fascinating revelation in midlife.Slowly, slowly, I realised I needed to replace the manic busy-ness of my previous life with a softening; to replace my ambition for future goals with a more present mindset. To sit in a void of nothing for a while. It was a midlife reckoning where I looked back over decisions I had made and came to terms with my feelings.Many women around me of my age were also either stepping out of big jobs, or being pushed, and what I've learned is that — if you're lucky enough to be able to — it's good to pause and wait before chasing an exhausting reinvention. An evolution is better than a rebirth. That can come later.For now, don't feel guilty about looking back to your past successes, re-evaluating your purpose and caring more thoughtfully for yourself.TIP: I hate to go all woo-woo on you, but at one point during my post-redundancy wobbles, I began journalling (bear with me). I wrote a list of 'non-negotiables' that had to happen daily to keep me grounded and less anxious about life. 'Mood regulators', as therapists call them.A hot coffee alone first thing with the kitchen window open, a cold swim once a week, cuddles with my youngest at bedtime, a glass of water on waking. These became the small daily habits that helped sooth me neurologically. You may roll your eyes reading this because it sounds so simple and throwaway but, you know what, it works.",
        "JOIN THE POST-50 SEXUAL REVOLUTION Now let me talk to you about one of the big silver linings of midlife: the liberation of your sex life.As the former queen of Orgasm HQ (i.e. Cosmo), I can tell you there is a sexual revolution taking place right now among women in their 40s, 50s and beyond.It is all so different from the line we were sold in the ladette culture of the 1990s. We were told that youth, hot bodies and good sex were inextricably linked. And the subliminal narrative around women seemed to be either a man-pleasing one, or that sex was something that was 'done to us'.Those women who were having sex because they loved it were seen as rampant. There was no grey area for us normals, who liked sex and were happy to say so, but didn't want to do it all the time in all the positions.Perhaps our brains were addled by growing up around all that Benny Hill humour and those sexy-nurse outfits as Halloween costumes, and that's why we generally accepted these narratives. With hindsight, it was very disturbing and toxic. But now rebellious Gen X has hit midlife, and we find ourselves at a sexual checkpoint — erotically restless and vocal about it. Sex is on our to-do list, and the rise in sex toy sales tells you it's reached the top of it.I hear about this new sense of sexual liberation all the time —particularly from women over 40 who are having a lot of sex with men under 40. Younger men, it seems, are becoming the playground for our midlife desires.I am bombarded (and I don't use that word lightly) with stories of women in their 50s and 60s who are sleeping with men three decades their junior on a regular basis. (I have interviewed them —they are not anomalies.)In fact, I think society should perhaps be a little scared about the rising sexual power of midlife women today (especially as so many women's libidos are being super-fuelled by HRT). A generation is getting its lust mojo on, and good sex fuels good confidence.Indeed, I think it is the missing part of the jigsaw for women, and I, for one, am going to enjoy watching this sexual revolution unfold.TIP: If your libido is dipping, or you are suffering one of the 40 or more symptoms of perimenopause, ask your GP about body identical hormone replacement therapy to fire it up again, as recommended by NHS guidelines.",
        "DON'T BE AFRAID TO LOOK IN THE MIRROR Midlife is not for the faint-hearted when it comes to looking in the mirror.You can, of course, attempt to fight this by going full high-maintenance on the body front with intensive exercise, or throwing money at all the modern 'tweakments'. But you are still going to grow and look older, and the entrenched ageism in our society means you probably won't feel great about it.That's why the best line of defence is to shift your mindset around ageing. Forget all those magazine quizzes and diet books, that Bridget Jones debit-credit attitude to eating and drinking.One of the best strategies is to stop giving time to your own negativity. I started cold water swimming and found a group of women who care far less about their looks and much more about the spirit of a person.After my lifetime in the fashion industry, they helped me reframe my attitude to body image and to stop talking about the changes I was observing and feeling disappointed with when I looked in that mirror. Quit the negative self chatter — your looks are the least important thing about you at this stage of life.Try to put your worries about what your body or face looks like on that list of things you refuse to think about in midlife, like the leaking tap in the loo or Christmas cards before mid-December.TIP: Exercise, eat well and sort out your sleep — and if you are going to spend money, spend it on your hair and nails. And wear that bikini if it makes you happy.PREPARE FOR THE EMPTY NEST My eldest daughter left home two years ago. I had no idea that one minute we'd be walking to school hand-in-hand, stopping to check for ladybirds on our front garden wall, and the very next we'd be in Sainsbury's arguing about saucepan quality for shared kitchens at uni.'Shall we take brownies for the other students in halls?' I asked her, so desperate for her love and attention I was shamefully trying to please her every minute of every day in the hope she would realise she was making a terrible mistake and stay at home with me.'Oh, for God's sake, Lorraine, what's wrong with you?' she replied. 'I'm not going on a playdate. I'm not nine.'I had no idea that the empty peg where her giant puffer coat had hung for many years in our hall would reduce me to tears every time I left the house.For those of you with adolescent children, don't underestimate the impact of the goodbye. Don't be surprised when your family life, and your relationship with your partner, take on a new dimension. It's another midlife loss, another emotional hill to climb.TIP: Be sensitive to your teens that last summer before they go; ease off on moaning about dirty laundry or mucky cups under the bed for this last part of your parenting ride. Cherish every second.EMBRACE YOUR SECRET WEAPON My life is filled with people. Even though my children are slowly leaving one by one, our hall is still lined with giant trainers and huge coats.I am never alone — and yet, at times, these midlife years have been profoundly lonely for me. Nothing prepared me for this surprising, sudden sense of not belonging anywhere as I grappled with my perimenopause.But I found one thing helped more than anything else: the unstoppable power of female friendship. It is the lifeline you hold on to as you flail around in this wobbly, ever-changing middle bit; the rope that pulls you through. Let go of it at your peril, because even the scientists agree: loneliness is dangerous for your health.I have surprised myself hugely by making new friends in midlife — women I have largely met through swimming clubs, yoga classes and my podcast — and the openness and vulnerability I've shown to them feels quite out of character for me.These new mates lighten the load of older, more complex friendships. They are the shock-absorbers of my life, and I of theirs. Maybe this is Gen X's 'girl power' mantra coming of age?TIP: I would not have found out about the perimenopause (the ten years or so before menopause) without seeking the help of female friends. Nourishing those friendships is your secret weapon for a happy midlife. Go out of your way to make these relationships good, and find new ones to guide you forward.Adapted from What's Wrong With Me?: 101 Things Midlife Women Need to Know, by Lorraine Candy, published by Fourth Estate on May 25 at £16.99. © Lorraine Candy 2023.To order a copy for £15.29 (offer valid to May, 2023; UK P&amp;P free on orders over £25), visit mailshop.co.uk/books or call 020 3176 2937."
    ]
}