{
    "articleURL": "/tvshowbiz/article-12045407/Natalie-Roser-turns-heads-poses-skimpy-pink-miniskirt.html",
    "content": [
        "Natalie Roser turned heads as she posed in a skimpy pink top for the open casting ahead of Afterpay Australian Fashion Week. ",
        "The former Guess model, 32, looked resplendent as she flaunted her toned midriff and back in the glamorous top and body-hugging mini-skirt. The star offered a sultry gaze to the camera as she leaned against her arm while posing against a white wall for the casting.Natalie wore her trademark blonde tresses and a matte makeup which accentuated her natural beauty during the shoot.It comes after Natalie posed on the cover of Maxim New Zealand for the March edition of the racy magazine. ",
        "A natural in front of a camera, the blonde beauty looked cool and comfortable as she posed in a triangle mesh black bra and a matching thong.The model posted the magazine cover to Instagram with the caption: 'Coming back online after a few days disconnecting to my new @maxim_newzealand cover.'She also shared two other photos from the shoot where she is seen posing proactively on a cream couch in the same black lingerie set.The bikini model recently spoke out about her 'unconventional first year of marriage' with her former Home and Away actor husband Harley Bonner.",
        "Last September, she confirmed that they were no longer living together in their Newcastle home.She told the Daily Telegraph that Harley, 31, had moved to Thailand shortly after their wedding in February last year to study energy healing and meditation.",
        "While Natalie admitted that she 'doesn't understand' that world, she still supports Harley as he 'fulfills his dreams'.'He is so happy. It is definitely an unconventional first year of marriage,' she said.",
        "'He is fulfilling his dreams and who would I be to stand in his way of doing something that he has wanted to do for so long?'Natalie said letting Harley travel solo in their first year of marriage was preferable to him doing it later down the track when they have children.On Valentine's Day, the model posted a carousel of photos of her and Harley to celebrate their love.One photo shows them on facetime as he fulfils his dream abroad."
    ]
}