{
    "articleURL": "/wires/ap/article-12052375/Proud-Boys-1-6-verdict-boosts-Justice-Dept-Trump-probe.html",
    "content": [
        "WASHINGTON (AP) - Proud Boys leader Enrique Tarrio wasn't even in Washington when members of his extremist group, angry over Donald Trump 's election loss, stormed the U.S. Capitol on Jan. 6, 2021. Yet federal prosecutors, using his words, won a conviction on the most serious charge levied in the insurrection.",
        "The seditious conspiracy guilty verdicts of Tarrio and three lieutenants handed down Thursday - after a contentious and erratic trial that lasted more than twice as long as expected - bolster the Justice Department's record in its historic prosecution of the Capitol attack. The investigation has now led to convictions against two top extremist group leaders on a legally complex charge that's rarely ever brought and can be difficult to prove.The verdicts could further embolden the Justice Department and special counsel Jack Smith as they dig into efforts by Trump and his allies to undo President Joe Biden´s victory.Mostly in private, Smith's work is proceeding apace. Just last week, a federal grand jury - meeting in the same courthouse where the Proud Boys trial was held - heard hours of testimony from former Vice President Mike Pence, who has publicly described a pressure campaign by Trump aimed at getting him to halt Congress' certification of the election results.In the Proud Boys case, prosecutors secured a conviction by relying on Jan. 6 rhetoric and a legal theory alleging that Tarrio and his lieutenants mobilized a loyal group of foot soldiers - or \"tools\" - to supply the force necessary to carry out their plot to stop the transfer of power from Trump to Biden on Jan. 20.",
        "Could the Justice Department follow a similar path with Trump? After all, just before the riot erupted he urged his supporters to go to the Capitol and \"fight like hell.\" The House committee that investigated the insurrection recommended Trump be prosecuted for \"assisting and providing aid and comfort to an insurrection.\"",
        "\"Who inspired them to do that? Who directed them to do that? Who was the person telling his followers to `fight like hell´? Of course, that´s former President Trump,\" said Jimmy Gurulé, a University of Notre Dame law professor. \"He´s not silent. He´s not oblivious to what´s going on. He´s leading the charge. He´s encouraging them to act.\"But some experts say the successful prosecution of the Proud Boys may not make it any easier to bring a case against Trump.\"Tarrio wasn´t there, but he was responsible because he was the one who was an organizer and leader,\" said Laurie Levenson, a former federal prosecutor now a professor at Loyola Marymount Law School. \"People might say `Well, wouldn't that apply to Trump?´ It might,\" she said.\"But you have to again have the very direct evidence that Trump calling people to storm the Capitol, he was calling them to violence. And I´m not sure we have the answer to that yet, although I think the special counsel is getting closer, putting people like Mike Pence in the grand jury,\" she added.",
        "Attorney General Merrick Garland alluded to the wider investigation after Tarrio's conviction, declaring, \"Our work will continue.\"\"Today´s verdict makes clear the Justice Department will do everything in its power to defend the American people and American democracy,\" Garland said.Trump loomed large over the monthslong Proud Boys trial at the U.S. Courthouse in Washington, where the Capitol can be seen in the distance from the windows. Lawyers for one of Tarrio´s co-defendants at one point said they wanted to call the former president to the witness stand, although the idea went nowhere.Prosecutors argued that the Proud Boys saw themselves as \"Trump´s army\" and were prepared to do whatever it took to keep their preferred leader in power. Messages displayed throughout the trial showed Tarrio warning that the Proud Boys would become \"political prisoners\" if Biden were to become president. As the riot proceeded, he gloated about his group´s role, writing in one message, \"We did this.\"Tarrio´s lawyers, however, sought to use Trump as part of his defense, claiming the former president was to blame and that prosecutors were trying to use Tarrio as a scapegoat for the president - an argument jurors appear to have roundly rejected.Trump has denied inciting any violence on Jan. 6 and has argued that he was fully permitted by the First Amendment to challenge his loss to Biden.",
        "This was the third seditious conspiracy trial stemming from the riot, which left dozens of police officers injured and sent lawmakers dashing for safety and into hiding. Stewart Rhodes - the founder of the Oath Keepers, another far-right extremist group - was convicted in November, and the Justice Department in a court filing Friday recommended he be sentenced to 25 years in prison. Four other Oath Keepers were convicted in a second trial.Tarrio was at a hotel in Baltimore when the chaos unfolded on Jan. 6, having been kicked out of the capital city after being arrested two days earlier on allegations that he defaced a Black Lives Matter banner. Law enforcement later said that Tarrio was picked up in part to quell potential violence.Three Proud Boys members were convicted of the sedition charge alongside him: Ethan Nordean, Joseph Biggs and Zachary Rehl. A fifth defendant, Dominic Pezzola, was acquitted of seditious conspiracy, but convicted of other serious crimes.It´s not clear how closely special counsel Jack Smith and his team of prosecutors were tracking the trial or taking stock of the verdicts. Smith has his own team of prosecutors - separate from Justice Department lawyers working on more than 1,000 Jan. 6 cases who are probing efforts by Trump and his allies to subvert the election results.",
        "Since his appointment in November, Smith has cast a broad net in demanding interviews and testimony related to fundraising, Trump's rally that preceded the riot on Jan. 6, and communications between Trump associates and election officials in battleground states. Separately, Smith is investigating the presence of classified documents at Trump's Florida Mar-a-Lago estate and Trump's potential efforts to obstruct the government's work to get them back.In Georgia on Friday, the attorney for eight Republican fake electors who signed a certificate falsely saying Trump had won the state said they had agreed to immunity deals in Georgia´s investigation into Trump´s actions.As for the Proud Boys, George Washington University law professor Stephen Saltzburg, who used to work in the Justice Department, said he believes Thursday's verdict will have \"zero impact\" on Smith and his team. There hasn´t been any evidence of communications between high-ranking Trump White House officials and the Proud Boys, he noted.\"If that sort of thing does exist, then it wouldn´t matter what the jury did in this (Proud Boys) case because there would be independent evidence that other people were conspiring,\" Saltzburg said. \"If there´s not similar evidence involving the president and people around him, then it´s a harder case.\"One of the hallmarks of a conspiracy charge is that prosecutors don't have to allege a defendant took every action themselves, said Randall Eliason, another former federal prosecutor now a GW law professor.",
        "\"So someone like Tarrio doesn´t have to actually participate in the riot itself and can still be held accountable,\" Eliason said. \"The same is true of people in the White House\" and anyone else who could reasonably be considered to have been part of the conspiracy without having set foot in the Capitol, he said.Still, Eliason downplayed the impact the verdict could have on Smith´s charging decisions, noting that it´s hardly a revelation that conspiracies can wrap up a broad range of defendants and not just direct participants.\"I wouldn´t say personally that this verdict is going to embolden him to do something he might otherwise have worried about doing,\" he said.___Richer reported from Boston. Associated Press reporter Lindsay Whitehurst in Washington contributed to this report.For more on Donald Trump-related investigations: https://apnews.com/hub/donald-trump."
    ]
}