{
    "articleURL": "/wires/pa/article-12057201/Seven-dead-car-hits-migrants-waiting-bus-stop-Texas.html",
    "content": [
        "Seven people have been killed and up to 10 injured after they were struck by a car while waiting at a bus stop outside a migrant shelter in the border city of Brownsville, Texas.",
        "Victor Maldonado, director of the Bishop Enrique San Pedro Ozanam Centre, said he reviewed the shelter’s surveillance video on Sunday morning after receiving a call about the crash.The city bus stop is across the street from the shelter and is not marked. There was no bench and people waiting there were sitting along the curb, Mr Maldonado said. He said most of the victims were Venezuelan men.“What we see in the video is that this SUV, a Range Rover, just ran the light that was about a 100ft away and just went through the people who were sitting there in the bus stop,” Mr Maldonado said.He said the car flipped after driving up on the curb and continued moving for about 200ft. Some people who were walking on the pavement about 30ft away from the main group were also hit, Mr Maldonado said.The Ozanam shelter is the only overnight shelter in the city of Brownsville and manages the release of thousands of migrants from federal custody.Brownsville has long been an epicentre for migration across the US-Mexico border, and it has become a key location for next week’s ending of the pandemic-era border restrictions known as Title 42.Brownsville police investigator Martin Sandoval said the crash happened at about 8.30am.",
        "“It can be three factors,” Mr Sandoval said. “It could be intoxication; it could be an accident; or it could be intentional. In order for us to find out exactly what happened, we have to eliminate the other two.”The driver was taken to the hospital for injuries sustained when the car rolled over.Mr Sandoval said: “He’s being very uncooperative at the hospital, but he will be transported to our city jail as soon as he gets released. Then we’ll fingerprint him and (take a) mug shot, and then we can find his true identity.”Mr Maldonado said the centre had not received any threats before the crash but they did afterwards.“I’ve had a couple of people come by the gate and tell the security guard that the reason this happened was because of us,” Mr Maldonado said.The shelter can hold 250 but many who arrive leave the same day. In the last several weeks, an uptick in border crossings prompted the city to declare an emergency as local, state and federal resources coordinated the enforcement and humanitarian response.“In the last two months, we’ve been getting 250 to 380 a day,” Mr Maldonado said.While the shelter offers migrants transport during the week, they are also free to use the city’s public transport.",
        "“Some of them were on the way to the bus station, because they were on their way to their destination,” the director said."
    ]
}