{
    "articleURL": "/news/article-12058483/One-dead-two-injured-shooting-Dallas-gunman-opens-fire-onboard-DART-train.html",
    "content": [
        "The altercation unfolded around 4:30pm Sunday onboard a train in South DallasIt happened on a northbound Green Line train near the city's Hatcher stationThe incident reportedly stemmed from a disagreement between two passengersAnother Dallas shooting has left one person dead and two people injured just a day after eight people were killed at a mall in Allen - this time onboard the city's high-speed DART train.",
        "The fatal altercation unfolded around 4:30 pm Sunday in South Dallas aboard a northbound Green Line train near Hatcher Station, and reportedly stemmed from a disagreement between two passengers.In total, two people were shot, a spokesperson for the light rail system said Sunday evening, including a bystander, DART spokesperson Gordon Shattles told CNN. They were both taken to a Dallas hospital where one of them died.Cops added that a third victim, believed to have been struck by shrapnel, was treated at the scene. The police force that presides over the DART system's four lines and 65 stations are now leading the search for the suspect - who is still at large.It happened one day after mall shooter Mauricio Garcia left eight dead in the small Dallas suburb of Allen, at an outdoor outlet when the 33-year-old unleashed more than 100 rounds of ammunition from his AR-15 style rifle.",
        "Dashcam footage from Saturday's shooting showed Garcia pulling up to the store in a Dodge Charger, before opening fire, striking and killing right people including children. The footage - as well as photos of the late shooter after he was subdued - showed him to be dressed in full tactical gear, with an additional handgun and multiple magazines.He was eventually killed by the unnamed police officer - who was on the scene for an unrelated call but rushed over when he heard the gunshots outside the H&amp;M. ",
        "Garcia was a security guard, but it is unclear if he worked at Allen Premium Outlets - or if had any connection to them at all.On Sunday, sources told WFAA that Garcia had experience in US military, serving in the U.S. Army in 2008  before being removed over mental health concerns. Garcia also apparently had several social media accounts active before the shooting, that have seeming been scrubbed amid state and federal officials' ongoing investigation.The profiles, the sources said, showed the Dallas citizen's preference for neo-Nazi and white supremacist content, as officials have still yet to release the names of his eight victims, or the condition of at least seven others injured.One of the eight victims, 20-year-old Christian LaCour, was identified Sunday by a post to relative's Facebook.",
        "A Farmersville resident who also worked as a security guard, LaCour was mourned by his grandmother Sandra Montgomery who said she was 'so proud of him'.'My beautiful grandson, Christian LaCour, was the security guard killed in the shooting at Allen Texas. He was such a beautiful soul,' she wrote.LaCour's sister’s mother-in-law also wrote: 'Words can not even begin to describe the devastation that our family feels,' she said in the post. '[There] will forever be a void.'At least one of the others killed by Garcia was a child, according to witness accounts, before he was shot dead himself at the crowded outlets sometime after 3pm."
    ]
}