{
    "articleURL": "/news/article-12041269/Swedens-second-largest-party-says-time-evaluate-EU-status.html",
    "content": [
        "Party leader Jimmie Akesson said the country should seek more EU exemptionsHe stopped short of a call for 'Swexit' but said EU was heading in wrong directionThe leader of Sweden's second largest party has said it's time to 're-revaluate' the country's membership of the European Union, raising the possibility of 'Swexit'.",
        "Echoing criticism from eurosceptics across the continent, Jimmie Akesson said the EU's ever-expanding power meant 'German, Polish or French politicians, in practice decide what car you can buy, how expensive petrol should be and which tree you can cut down on your own property'.The leader of the Sweden Democrats - an informal part of the government - said the country should seek more exemptions from EU laws as part of a reset in relations with the 27-member group.Akesson, whose anti-immigration party has a big influence over Sweden's right-of-centre government, stopped short of directly calling for 'Swexit' - a vote on whether to leave the European Union as British voters did in 2016.But he said the EU was heading in the wrong direction.",
        "'Today, there are good reasons to seriously re-evaluate our membership in the union,' Akesson wrote in the daily newspaper Aftonbladet. 'Our general elections in Sweden will soon cease to have any significance in Sweden's development. Naturally, we can't allow that to happen.'Akesson warned the EU might impose more liberal immigration policies on Sweden, which has taken an increasingly tough line in recent years on asylum applications.Swedes are among the most positive in Europe regarding EU membership, with 68 per cent in support, according to a survey by Gothenburg University in March. ",
        "The country applied last year to join the Nato military alliance, which includes most EU members - including Finland which officially joined on April 4.Sweden's own bid has so far been blocked by objections from Turkey and Hungary.The Sweden Democrats' EU-sceptic stance was long seen as an obstacle to their acceptance into the political mainstream and the party dropped that demand in 2018 to win over more voters.",
        "In last year's general election, it got 20.5 per cent of the vote. Its support was crucial in enabling the minority Moderate, Christian Democrat and Liberal coalition to take power.As part of the deal, the Sweden Democrats have exercised considerable influence on policy, pushing for tougher immigration rules and watered-down ambitions on climate change.The party has threatened to bring down the coalition if it doesn't cut taxes on fuels and stand up to the EU over asylum quotas."
    ]
}