{
    "articleURL": "/tvshowbiz/article-12056691/Nicole-Scherzinger-teases-stunning-gowns-performance-Coronation-concert.html",
    "content": [
        "Nicole Scherzinger has teased an array of stunning gowns ahead of her performance at King Charles's Coronation concert on Sunday evening.  ",
        "The former Pussycat doll, 44, will be taking to the stage alongside performances by Paloma Faith, Olly Murs, Katy Perry, veteran rock guitarist Steve Winwood, and Take That. The King and Queen and other members of the royal family will join around 20,000 members of the public at the Coronation Concert at Windsor Castle to continue the celebrations after their crowning at Westminster Abbey on Saturday.  Nicole sent temperatures soaring as she posted a reel to her Instagram feed on Saturday, offering fans a glimpse into her potential outfits. The singer sizzled in plunging gowns and one with two racy cut-outs - all in vibrant and bold colours. ",
        "She said, posting to her 5.7 million followers: 'Feeling like an absolute princess at my fitting for the King’s #CoronationConcert this weekend! 'Can you guess what dress I chose? Tune in to #BBC #iPlayer to find out.'Fans clearly had a preference for one of the dresses in particular.One said: 'All fab, but feelin the blue one!' while another added: 'Oooo I love the blue one!!'But fans will have to wait until 8pm to find out which of the gorgeous dresses she decided to settle on. The first ensemble Nicole modelled was a white maxi dress, embellished with feather detailing. As she twirled, she changed into a navy dress with a glittery top, offering fans a glimpse of her skin due to two racy cut outs at the side and a large slit up her leg. ",
        "She then put on a very busty display in a yellow plunging number with high shoulders and streaks of glitter. Fourth was an off-the-shoulder white dress while number five was a strapless dress with a corset top and a wrap-around bottom. Her other options included a white gown with ruffled trims at the base, an extremely flowy black-and-white frock and a silver one with a sheer top by the neckline. The Coronation concert will air from 8pm on the BBC.  "
    ]
}