{
    "articleURL": "/femail/article-12038523/Jenna-Bush-Hager-admits-afraid-wouldnt-able-save-virginity.html",
    "content": [
        "Bush Hager, 41, opened up about her diary on the Today show last weekShe recalled how she wrote that she hoped she'd be able to 'save' her virginityThe host said she was 'worried' she 'wouldn’t have the wherewithal to hold it'Jenna Bush Hager confessed that she used to be 'worried' she wouldn't be able to 'save' her virginity in the ninth grade while looking back on her embarrassing diary entries. ",
        "The Today host, 41, had her co-star Hoda Kotb and their guest Amy Poehler in hysterics on the morning show last week when she recalled writing about her secret teenage fear. 'I had [an entry about] looking at myself in the mirror and hoping I’d be able to save my virginity,' she admitted, unable to hold back her laughter. 'Wait, what?' Kotb, 58, asked. ",
        "'I was just worried in ninth grade that I wouldn’t have the wherewithal to hold it, you know?' Bush Hager explained, shrugging her shoulders. Poehler, 51, couldn't hide her amusement, joking, 'Your journals were like, \"You can do it! You can hold it.\"''What if you’re not able to do it, Jenna?' the former first daughter chimed in, prompting even more laughter. Bush Hager, who was born and raised in Texas, wrote the cringe-worthy diary entry years before her father, former President George W. Bush, took office in 2001. The Read with Jenna founder is typically not one to hold back, but she refrained from sharing when she actually lost her virginity. ",
        "'Who knows what happened,' she said, without going into further detail, 'but it was an embarrassing post to look back at.'Bush Hager went on to meet her future husband, Henry Hager, during her father's 2004 presidential campaign, and they married in 2008. ",
        "They have three children, Mila, Poppy, and Hal.  ",
        "Poehler said Bush Hager's story was 'much better' than her own 'super embarrassing' journal entries, which she opened up about earlier on in the segment. 'I think a lot of mine is about relationships, and I think a lot of mine is just, you know, the amount of love I gave to a person that was maybe not the right person to give [it to],' the Parks and Recreation alum recalled. Bush Hager latest confession comes seven years after she opened up about how she found her fourth-grade diary while staying at her parent's home in Texas over the holidays. She explained on the Today show that she was shocked to see that her 10-year-old self had vowed to shed four pounds on January 1, 1991. 'That broke my heart,' she admitted. 'And my sister [Barbara Bush] told me that she found it four years before, but she never told me because it broke her heart.'"
    ]
}