{
    "articleURL": "/news/article-12050297/Royal-beekeeper-fears-Charles-bees-fly-away-theyre-placed-security-Coronation.html",
    "content": [
        "John Chapple has taken measures to try to stop the bees from swarming He is prevented from visiting them at Buckingham Palace and Clarence HouseThe royal beekeeper has concerns for the welfare of the King's bees after they were placed under lockdown for the Coronation – meaning he is unable to visit to stop them from flying away.",
        "John Chapple, 80, has looked after the bees on behalf of the Queen and now the King for the last 15 years. He came to global attention last September when he carried out the arcane tradition of informing the bees of Her Majesty's death.Mr Chapple has no ceremonial role at the coronation, but is concerned that many of the bees may swarm off while he is prevented from visiting them at Buckingham Palace and Clarence House.He told MailOnline today: 'We're praying the bees are going to be okay.'Mr Chapple visited them last Saturday and has taken measures to try to stop them from swarming, flying off to start a new hive, until he can return after the coronation.",
        "Mr Chapple says the bees are happy with their new owner, The King, after he performed a ceremony in the days following the death of Queen Elizabeth II. But there is no corresponding ceremony for the coronation.He told Mailonline: 'There's no pink ribbons, nothing like that. We just carry on. It's very difficult to get to visit them at the moment. It's like getting into Fort Knox at present as you can imagine.'We're praying the bees are going to be okay. The last time I could get there was on Saturday and I'll be back there on Tuesday.",
        "'I've done everything I know to make sure they don't swarm but bees are bees and I can only do my best.'He added: 'As far as I know the bees have taken to their new owner pretty well. In Clarence House there are two hives and in Buckingham Palace there are five.''I'm retired. It's my hobby, beekeeping, and now I look after a few hives for important people. Number one is the Queen, or rather was, the Queen and now it's the King.'The old Queen knew I existed because I used to get messages when she asked about the bees but I have had nothing from the new King. I imagine he's pretty busy, wouldn't you?'I certainly wouldn't want to swap my job for his for all the tea in China.'",
        "But Mr Chapple says he does have one thing in common with the King, he talks to his bees in the same way that the young Prince Charles revealed many years ago that he talked to plants, leading to widespread ridicule.'He was so far ahead of his time, wasn't he?' Mr Chapple said. 'All those things we are currently ranting about he had said years ago and they all thought he was a nutter.'I talk to my bees. I know it sounds silly but I do. I don't know if they understand me but I'm in my own world when I'm talking to my bees and when I am with my bees.",
        "'I can forget about all my other troubles if you know what I mean. I'm in another world and it's their world that I'm privileged to visit.'At the height of summer, Mr Chapple takes care of over a million bees though by late summer their numbers have dropped.He explained: 'They swarm due to their normal reproduction. When they get big enough in terms of numbers in a hive they decide there are too many of us in this box and half of us ought to go and start another hive somewhere else.'They leave with the old Queen but before they go they leave what's called Queen cells for a new Queen to emerge in a few day's time to start the old hive off again.'It has fascinated me all my life. Beekeepers have to conduct a form of birth control by slowing them down. We do that with a lot of manipulation.'If you split the hive in half yourself it stops the bees from doing it. We do that by creating another hive or having another box on top of the other one.'After the Queen's death, MailOnline reported how the royal beekeeper, in a tradition thought to date back centuries, informed the hives kept in the grounds of Buckingham Palace and Clarence House of the Queen's death.",
        "In hushed tones, the bees were told that their new master is now King Charles III.Mr Chapple travelled to both locations where the royal bees are kept following news of the Queen's death to carry out the ritual.He placed black ribbons tied into bows on the hives, home at the time to tens of thousands of bees, before informing them that their mistress had died and a new master would be in charge from now on.He urged the bees to be good to their new master. The ritual is underpinned by an old superstition that not to tell them of a change of owner would lead to the bees not producing honey, leaving the hive or even dying.At the time, Mr Chapple told MailOnline: 'The person who has died is the master or mistress of the hives, someone important in the family who dies and you don't get any more important than the Queen, do you?'You knock on each hive and say, '\"The mistress is dead, but don't you go. Your master will be a good master to you\".'Telling the bees is a traditional custom of many European countries in which bees would be told of important events in their keeper's lives, such as births, marriages, or departures and returns in the household.",
        "If the custom was omitted or forgotten and the bees were not 'put into mourning' then it was believed a penalty would be paid, such as the bees leaving their hive, stopping the production of honey or dying.The custom is best known in England, but has also been recorded in Ireland, Wales, Germany, Netherlands, France, Switzerland, Bohemia and the United States."
    ]
}