{
    "articleURL": "/news/article-12059773/Its-official-Charles-slimmed-monarchy-unveiled-official-Coronation-portraits.html",
    "content": [
        "CORONATION LIVEBLOG: Click here to follow live updates throughout todayKing Charles III's first official portrait following the Coronation show him as a 'monarch who knows his own mind', surrounded by 'the people he can depend on', a royal expert last night declared.",
        "Monday saw the sovereign's opening set of Royal photos unveiling the King's new 'slimmed down' monarchy, with his 'hard-working and respected' sister, Princess Anne and loving wife Queen Camilla firmly by his side.And to mark his reign as head of state, the 74-year-old sovereign was unveiled in a striking new solo portrait to commemorate his historic crowning.   'This one is a strong forceful portrait of a monarch who knows his own mind and is very experienced,' royal expert Richard Fitzwilliams told MailOnline last night.  Mr Fitzwilliam said Princess Anne's proximity to the King in the group portrait 'is no accident', adding the fact she is 'experienced and hard-working' will have been noticed by Charles.He added Queen Camilla looked 'more relaxed and comfortable' wearing the crown in her solo portrait than she did in Westminster Abbey, during the coronation ceremony that was watching by millions world wide. ",
        "Mr Fitzwilliams said the group portrait of the working royals signified 'the people who the King can depend on', adding: 'The absentees, everyone knows the reasons for that'.Noting the family shot included only four people under the age of 70, Mr Fitzwilliams said this will be a 'challenge' for the King in the future, who will need to decide 'how slimmed down he wants the monarchy to be'.",
        "Mr Fitzwilliams said Anne, the Princess Royal, being positioned next to her brother King Charles is 'most significant' and 'shows much he appreciates her and will be relying on her'.He said: 'Princess Anne's proximity to the sovereign, that's no accident. She's experienced and hard-working.",
        "'Anne's been at it a long long time, she knows the ropes. The King knows how popular she is, so it's no accident his sister is next door to him.'It shows much how much he appreciates her and how much he will be relying on her, she is extremely popular and has a high profile. People know who she is and respect her, that's very important.'And photographer Hugo Burnand, who took the portraits at Buckingham Palace on Saturday, said the photos were a 'family moment', saying that 'we keep it nice and cosy', when talking to the Telegraph.Mr Burnard has been shooting royal portraits for more than two decades and also took the photographs at the weddings of Charles and Camilla at Windsor Castle in 2005 and of Prince William and Kate Middleton at Buckingham Palace in 2011 King Charles yesterday hailed the outpouring of celebration for his Coronation as 'the greatest possible gift' as he expressed his 'heartfelt thanks' to the nation for making it 'such a special occasion'.",
        "The King and Queen pledged to rededicate their lives to service as Charles expressed gratitude for the nation's support throughout the historic celebrations, and as the weekend of festivities draw to a close he issued a written message, saying: 'We thank you, each and every one.'He said: 'As the Coronation weekend draws to a close, my wife and I just wanted to share our most sincere and heartfelt thanks to all those who have helped to make this such a special occasion.'We pay particular tribute to the countless people who have given their time and dedication to ensuring that the celebrations in London, Windsor and further afield were as happy, safe and enjoyable as possible.'He added: 'To those who joined in the celebrations - whether at home, at street parties and lunches, or by volunteering in communities - we thank you, each and every one.'To know that we have your support and encouragement, and to witness your kindness expressed in so many different ways, has been the greatest possible Coronation gift, as we now rededicate our lives to serving the people of the United Kingdom, the Realms and Commonwealth. The special Bank Holiday weekend to mark the King's Coronation was the first in 70 years, since the crowning of his mother, the late Queen Elizabeth II in 1953.",
        "Among the official portraits to be released on Monday was one of the King was captured in his full regalia, wearing the Imperial State Crown, holding the Orb and Sceptre with Cross.The official portraits show King Charles III and Queen Camilla in all their majesty in the Throne Room at Buckingham Palace, and surrounded by their fellow 'working royals'.The King and Queen can be seen both separately and together, both the very picture of calm dignity despite the strain of the day.Echoing the famous 1953 coronation portrait of his late mother, Queen Elizabeth II, Charles is seated and wearing the Imperial State Crown. In his right hand he hold the Sovereign's Sceptre with Cross featuring the magnificent Cullinan I diamond and in his left The Sovereign's Orb, representing that his power is derived from God.The Imperial State Crown, the centrepiece of the crown jewels, is formed from an openwork gold frame, mounted with three very large stones, and set with 2,868 diamonds, 17 sapphires, 11 emeralds and 269 pearls. ",
        "The Orb, which weighs a staggering 1.3kg, usually sits in the Tower of London as part of the Coronation Regalia and has played a central part of the crowning of monarchs for hundreds of years. Meanwhile, the Sovereign's Sceptre with Cross dates back to 1661 and comprises a gold rod and huge drop-shaped diamond, Cullinan I, or the Star of Africa, which weighs 530.2 carats.",
        "The King also is wearing his Robe of Estate, made of purple silk velvet and embroidered in gold that was first worn by his grandfather King George VI in 1937. He has his collar of the Order of the Garter and the historic diamond-set 'Lesser George' suspended from it first worn by George III. St George's helmet is defined in sapphires and his cloak and dragon with rubies.On his purple Coronation Ede and Ravenscroft tunic he wears a 1893 Garter Star set with diamonds. The final part of his outfit are his Royal Naval Trousers.His Majesty is seated on one of a pair of 1902 throne chairs that were made for the future King George V and Queen Mary for use at the Coronation of King Edward VII.These throne chairs were also used in the background of the 1937 Coronation of King George VI and Queen Elizabeth and by His Majesty The King Charles III and Queen Camilla at Westminster Hall to receive addresses from the Speakers of both Houses of Parliament last year.In her sloop portrait, taken in the Green Drawing Room, Her Majesty is wearing the Queen Mary's crown, which is set with 2,200 diamonds, with her Robe of Estate, hand embroidered with the national emblems of the United Kingdom, as well as flora and fauna reflecting Their Majesties love of nature and flowers of personal significance to them.",
        "It is now possible to see clearly the astonishing level of detail on her stunning Bruce Oldfield dress which includes embroidered depictions of her two Jack Russell Battersea Dogs and Cats Home rescue dogs, Beth and Bluebell, and the names of her children and grandchildren.",
        "For the first time many of the senior royal women - the Princess of Wales, The Duchess of Edinburgh, Princess Alexandra and the Duchess of Gloucester - have removed their mantles to display their exquisite white gowns.It means we can now also see for the first time the spectacular George VI Festoon Necklace worn by the Princess of Wales that was previously hidden under her cloak.A great favourite of Queen Elizabeth's, it was created in 1950 by her beloved father King George VI, using 105 loose collets that were among the Royal Family's private collection of gems.It was originally strung across three strands, suspended between two diamond triangles, by Garrard, the royal jewellers and given to the then Princess Elizabeth.",
        "The King has issued a coronation message at the end of the weekend's celebrations.Here is his message in full:'As the coronation weekend draws to a close, my wife and I just wanted to share our most sincere and heartfelt thanks to all those who have helped to make this such a special occasion.'We pay particular tribute to the countless people who have given their time and dedication to ensuring that the celebrations in London, Windsor and further afield were as happy, safe and enjoyable as possible.'To those who joined in the celebrations - whether at home, at street parties and lunches, or by volunteering in communities - we thank you, each and every one.'To know that we have your support and encouragement, and to witness your kindness expressed in so many different ways, has been the greatest possible coronation gift, as we now rededicate our lives to serving the people of the United Kingdom, the realms and Commonwealth.' ",
        "In 1953 she removed 10 of the diamonds to shorten the length and was subsequently seen wearing it on dozens of occasions including state occasions.Another portrait released showed the working royal family made up of the the Prince and Princess of Wales, the Edinburghs, the Princess Royal and Vice Admiral Sir Tim Laurence, the Duke of Kent, the Gloucesters and Princess Alexandra - stood alongside the King and Queen.Neither the Duke of York nor the Duke of Sussex were included as they are no longer working members of the royal family.The new photographs come as the King released a statement through Buckingham Palace vowing that he and his wife would now 'rededicate their lives' to this nation, his Realms and the Commonwealth.The pictures were taken by celebrated society photographer Hugo Burnand at Buckingham Palace shortly after the Coronation ceremony on Saturday.It comes after a bank holiday weekend of national celebrations which saw up to two million people line The Mall on Saturday for the King's Coronation, a day full of pomp and pageantry.Royal well-wishers had travelled from across the UK and the world for the historic occasion, with the most die-hard fans setting up camp on The Mall days before official celebrations began in order to secure front-row positions.On Saturday, swelling crowds began to emerge in central London from around 5am for their chance to glimpse the King and Queen on the procession route - with crowds either side of The Mall around 15-deep by 7am.A 'ring of steel' had been placed around the capital, with a 11,500 police officers on duty while a further 10,000 military personnel took part in the ceremony.Waving their Union Jack flags, fans who managed to bag a prime spot at the front of the metal barriers erupted in applause as King Charles and Queen Camilla travelled in the Diamond Jubilee coach to Westminster Abbey.In true British fashion, the millions who flocked to the capital were undeterred by the British weather, putting up their brollies and donning raincoats as they celebrated. Pomp and pageantry were to the fore, with the Armed Forces staging the biggest ceremonial military operation since Queen Elizabeth's 1953 coronation, culminating in a 4,000-strong coronation procession of servicemen and women from across the globe, that wound its way through the heart of the capital. ",
        "After the royal procession from Buckingham Palace, King Charles and Queen Camilla were anointed at Westminster Abbey in front of 2,300 attendees including world leaders, royal dignitaries, celebrities and everyday heroes.",
        "Global popstars Lionel Richie and Katy Perry were part of the congregation, as was French President Emmanuel Macron, actresses Dame Judi Dench and Oscar-winner Dame Emma Thompson, presenters Ant and Dec and King Willem-Alexander and Queen Maxima of the Netherlands. During the service, which saw the first-ever Welsh language performance sang at a Coronation by Sir Bryn Terfel, Charles pledged to be a 'blessing' to people of 'every faith and conviction', and serve his millions of subjects in Britain and around the globe. The historic moment came a few minutes past midday, when the Archbishop of Canterbury Justin Welby placed St Edward's Crown on Charles' head and he became the 40th reigning sovereign to be crowned at Westminster Abbey, the nation's coronation church since 1066. The Coronation was a spiritual and deeply personal event for the King, a 'committed Anglican Christian', who was anointed, seen kneeling at the abbey's high altar and received homage from his son and heir, the Prince of Wales.William's interaction with his father, where he touched St Edward's Crown then kissed the King on the right cheek, appeared a poignant moment for the head of state.As William knelt before Charles, who held his son's hand between his palms, the future monarch said: 'I, William, Prince of Wales, pledge my loyalty to you and faith and truth I will bear unto you, as your liege man of life and limb. So help me God.'The King's estranged son the Duke of Sussex was among the congregation, sitting two rows behind his brother with the Duke of York's family, and he was seen intently watching the crowning.And when a few minutes later the congregation was invited pay homage to the new monarch, Harry spoke, along with the other royals around him, the words: 'God save King Charles. Long live King Charles. May the King live forever.'Charles delivered a King's Prayer, the first time a monarch has spoken words to God aloud during a coronation, and he prayed to be a 'blessing' to people of 'every faith and conviction'.In his sermon the archbishop told the nation's new monarch 'we crown a King to serve'.Mr Welby spoke of how 'Jesus Christ was anointed not to be served, but to serve' - adding: 'The weight of the task given you today, Your Majesties, is only bearable by the spirit of God.'The ceremony had five main elements: the Recognition; the Oath; the Anointing; the Investiture and Crowning; and the Enthronement and Homage, as well as the Queen's coronation.",
        "Tracing it roots back to the medieval period the Christian ceremony, not witnessed for 70 years when Queen Elizabeth was crowned, saw the King dressed in a series of garments signifying a symbolic journey which concluded with him anointed with holy oil during its most sacred moment and crowned.It reflected the diversity of the of UK, with representatives from the nation's faith communities playing an active role in the coronation of a monarch for the first in history.But in a change, the controversial 'Homage of the People' element of the service was toned down after there was widespread criticism.Mr Welby 'invited' a show of support from the congregation rather than a 'call' to those in the abbey and elsewhere to swear allegiance to the King.",
        "Charles' grandson Louis, who turned five a few weeks ago, lighted the mood as he yawned and fidgeted during the ceremony, while big brother George was a page of honour helping to hold the long train of the King's robe.The historic crowning, watched around the globe, was a fulfilment of the King's destiny, but followed the death of his mother, Queen Elizabeth II, last September after a 70-year reign. Minutes later Camilla was crowned. As Andrew Lloyd-Webber's coronation anthem was sung, the Queen was officially enthroned. The enthroning of the Queen was a moment in which Charles and Camilla were 'united in their joint vocation before God'.The monarch and his wife Queen Camilla had smiled at each other and to the congregation as they walked through the church before and after the Christian ceremony that dates back 1,000 years on a day dripping with glorious displays of pageantry.They then rode back in the Gold State Coach to Buckingham Palace where they received a royal salute from members of the military across the Commonwealth on the lawn of Buckingham Palace, as they stood on the balcony in their glittering crowns.",
        "At the end of the day 'unsuitable weather conditions' meant the planned flypast was curtailed to just the Red Arrows and a helicopter display which still enthralled the royals, who included the Princess Royal, Duke and Duchess of Edinburgh and their children and the King and Queen's pages of honour.Charles who wore the Imperial State Crown and Camilla Queen Mary's Crown, were among the last to leave the balcony during an appearance which lasted almost 10 minutes and saw the crowd sing along when the national anthem was played.More than 18 million people in the UK tuned in to watch the ceremony on TV, compared with 26.5 million for the late Queen's funeral in September. Once official events had ended, Charles and Camilla enjoyed a private family gathering at the palace and were then whisked away from London in preparation for another packed day of events.Festivities continued on Sunday with Big Lunches attended by royals, including a surprise walkabout by Prince William and Princess Kate in Windsor.Thousands of street parties were held around the country with people encouraged to come together for the Coronation Big Lunch. ",
        "Prime Minister Rishi Sunak and his wife, Akshata Murty, hosted a lunch in Downing Street, inviting volunteers, Ukrainian refugees and youth group members.The Duke and Duchess of Edinburgh attended a Big Lunch in Cranleigh, Surrey, the Princess Royal and Vice Admiral Sir Tim Laurence were guests at a community street party in Swindon, Wiltshire, and Princesses Beatrice and Eugenie visited a Big Lunch in Windsor.Meanwhile, as part of the Coronation Concert, choreographed lasers, projections and drone displays were radiated over historic bridges and buildings.Ten locations involved in the event, Lighting Up The Nation, included Blackpool seafront in Lancashire, where people could enjoy a viewing party from Blackpool Tower.Sheffield Town Hall also showcased a display in the Peace Gardens, while Newcastle's Tyne Bridge and Gateshead's Millennium Bridge lights cast riverside reflections for an audience stretching between the quays.Meanwhile, a drone show lit up the sky above the Eden Project in Cornwall, with other light shows also brightening up Belfast, Edinburgh and Cardiff at various locations.The highlight of the day however was the star-studded concert at Windsor Castle, which saw Lionel Richie, Katy Perry and Take That among the headliners of the music extravaganza held in the grounds of the castle.",
        "The King and Queen were joined by around 20,000 members of the public at the musical extravaganza where, along with other family members including the wider royal family, they also enjoyed performances by Paloma Faith, Olly Murs, veteran rock guitarist Steve Winwood, and Nicole Scherzinger of The Pussycat Dolls.It was a huge operation organised by the BBC, featuring a 70-piece orchestra, choirs and several unique dramatic performances.Stars including Hugh Jackman, Pierce Brosnan, Dame Joan Collins, Bear Grylls OBE, Alan Titchmarsh, and Sir Tom Jones gave pre-recorded video messages in honour of the King throughout the concert.Top Gun star Tom Cruise also delivered a video message from his War Bird plane, saying: 'Pilot to pilot. Your Majesty, you can be my wingman any time,' before saluting and banking away. ",
        "Musical collaborations included opera stars Andrea Bocelli and Sir Bryn Terfel, who sang You'll Never Walk Alone, and classical pianist Lang Lang and pop star Nicole Scherzinger, who performed Reflection from Mulan.The Royal Ballet, the Royal Opera, the Royal Shakespeare Company, the Royal College of Music and the Royal College of Art came together for the first time to create a one-off performance featuring Sex Education and Doctor Who star Ncuti Gatwa and Olivier Award nominee Mei Mac.There were also reflective moments included Stella McCartney's address about the environment and a Winnie the Pooh skit.During one especially poignant moment, Prince William, who is next in line to the throne, paid a moving tribute to his father, telling him: 'Pa, we are all so proud of you.'He also told King Charles that he had no doubt the late Queen Elizabeth, his 'very proud mother', would be 'fondly' looking down from heaven.",
        "The concert was considered by many to be a crowning touch on the magnificent weekend, after joyous Big Lunch celebrations and a surprise walkabout by the Prince and Princess of Wales.Later, the King and Queen made a surprise virtual appearance on American Idol, as judges Lionel Richie and Katy Perry appeared on a livestream from the Coronation concert to speak to the singing contest's host Ryan Seacrest.All Night Long singer Richie, 73, said: 'What a party, it was unbelievable. We're trying to figure out what can we do to bring something different to the show, so I have a surprise.'Katy Perry, wearing a green off-the-shoulder silk dress with matching pearl earrings and necklace, appeared shocked when Charles and Camilla strolled into the royal room.Charles, wearing a navy suit and a light blue tie, joked: 'I just wanted to check how long you'll be using this room for.'He later said: 'Thank you so much for your brilliant performance, it's a pleasure to have you both here. It's a great treat to have you both here.'Camilla, wearing an electric blue jacket, said of their performance: 'Fantastic, absolutely fantastic.'Events to mark the Coronation culminated on Bank Holiday Monday with a 'day of service' dubbed the Big Help Out as senior royals join volunteers around the country. ",
        "King Charles and Queen Camilla encouraged people to come together in communities and volunteer as part of the initiative on Bank Holiday Monday.The scheme, which aims to inspire a new generation of volunteers by giving people a taster of what they can achieve, has been backed by celebrities across the country.More than 1,500 charities have signed up. The Big Help Out has been organised by The Together Coalition and leading charities.The day saw Prince Louis take part in his first public engagement, where he turned into a labourer as he joined Prince George, Princess Charlotte and the Prince and Princess of Wales by shovelling dirt, pushing wheelbarrows and operating a digger.The Waleses had gone to help out at a Scout Hut in Slough as part of the national volunteering drive to mark the coronation. To round off the celebrations, the traditional official portraits marking the crowning of Charles III and Queen Camilla."
    ]
}