{
    "articleURL": "/wires/pa/article-12046527/Woman-killed-random-stabbing-wouldn-t-hurt-fly--says-family.html",
    "content": [
        "The family of a woman who was randomly stabbed to death in a “senseless crime” in south London have said that she “hasn’t got one bad bone in her body”.",
        "Johanita Kossiwa Dogbey’s family described the 31-year-old as a “smart, dedicated and loving girl who always helped anyone” and that they are “devastated” in a statement released on Thursday.Ms Dogbey was fatally attacked in Stockwell Park Walk, Brixton, at about 4pm on Monday, and was pronounced dead at the scene.In their statement, released by the Metropolitan Police, her family said: “We are devastated by the news of the passing of our daughter. Our hearts are completely broken and will not understand why someone would take our beautiful girl away from us. She will forever be in our hearts as we will carry on living life as gracefully and beautifully as she did  Family of Johanita Kossiwa Dogbey  “Johanita was a smart, dedicated and loving girl who always helped anyone.“She hasn’t got one bad bone in her body. She wouldn’t hurt a fly.“We can’t believe a senseless crime like this has happened as we can’t imagine who would do this to her.“Our hearts are completely broken and will not understand why someone would take our beautiful girl away from us.“She will forever be in our hearts as we will carry on living life as gracefully and beautifully as she did.”",
        "A 33-year-old man remains in custody after being arrested on suspicion of murder on Tuesday, with police given more time to interview him by Croydon Magistrates’ Court on Wednesday.",
        "Police have said initial inquiries suggest that Ms Dogbey was approached from behind and attacked. It is not believed her attacker was known to her.The Met said her family are being supported by specialist officers and that the investigation has involved detectives from the Met’s Specialist Crime Command reviewing CCTV from the area and speaking to several witnesses.Anyone with information is asked to call 101, quoting CAD 4728/01May, or submit any information online."
    ]
}