{
    "articleURL": "/wires/reuters/article-12046007/Russia-launch-Friendship-Games-40-year-gap--sports-minister.html",
    "content": [
        "May 4 (Reuters) - Russia plans to relaunch the multi-sport Friendship Games next year, 40 years after its first edition, Sports Minister Oleg Matytsin has told President Vladimir Putin.",
        "Matytsin said the event would be held after the Paris Olympics, which will run from July 26-Aug. 11 next year.\"We propose to intensify the practice of holding competitions in an open format with the invitation of partner countries,\" The Kremlin's official website reported Matytsin as saying.\"We continue to fulfil your (Putin's) instruction to organise the World Friendship Games in the autumn of 2024.\"We consider it necessary to use the resources of both Russian and international public and state organisations to the maximum for the successful holding of the Games, which should be held on a regular basis in the future.\"Athletes from Russia and its ally Belarus have been largely frozen out of international competition by federations in the wake of the Russian invasion of Ukraine, which Moscow calls a \"special military operation\".Some Olympic sports such as archery, canoeing, cycling, fencing, judo, modern pentathlon, table tennis, taekwondo and triathlon have readmitted athletes from the two countries but athletics has not.The International Olympic Committee has recommended that Russian and Belarusian athletes be allowed to return to international competition as neutrals though it has yet to take a final decision on their participation at the Paris Games.FRIENDLY TIESLast year, Russia held a competition called the Solidarity Games with the aim of \"strengthening of international friendly ties between states\".",
        "The Friendship Games were first organised in 1984 in the Soviet Union and eight other socialist states which boycotted the 1984 Summer Olympics in Los Angeles.Around 50 countries took part with the Soviets dominating with 126 golds followed by East Germany with 50.In 1986, Ted Turner, the billionaire founder of cable news channel CNN, created the Goodwill Games in response to the political troubles surrounding the Olympics of the 1980s.The Soviet invasion of Afghanistan in 1979 led the United States and other Western countries to boycott the 1980 Summer Games in Moscow.Four years later, the Soviet Union and the Eastern Bloc countries, except Romania, boycotted the Los Angeles Games.The first edition of the Goodwill Games was staged in Moscow in 1986 and the last in Brisbane in 2001. The event was eventually cancelled due to poor television ratings. (Reporting by Manasi Pathak in Bengaluru; Editing by Ken Ferris)"
    ]
}