{
    "articleURL": "/sport/football/article-12040865/A-triple-Champions-League-winner-Manchester-United-outcast-Sam-Allardyce-names-best-XI.html",
    "content": [
        "A total of six Bolton players make Sam Allardyce's best XI of players he managedHis side includes a former AFCON champion and a legendary Spanish midfielder Follow Mail Sport's LIVE blog for all the latest as Allardyce is named Leeds boss Sam Allardyce's shock agreement to takeover at Leeds until the end of the season brings about an end to his two-year absence from the Premier League in dramatic fashion. ",
        "As one of the top-flight's most notorious fire-fighters, 'Big Sam' has made a name for himself in steering beleaguered sides away from the drop after years of success with the likes of Bolton, Blackburn Rovers, Crystal Palace and West Ham - among many others.But it has not always been at the foot of the table that the 68-year-old has plied his trade, guiding Bolton to a historic European adventure in 2005-06 after putting together a team including one of the Premier League's all-time appearance makers. It is with Wanderers that Allardyce is perhaps best associated, and when it came to putting together an all-time best XI of players he has worked with on his No Tippy Tappy Football podcast, it is perhaps no surprise that Trotters players dominate. A total of six players from the 68-year-old's infamous spell at Bolton are included, but with only five more spaces up for grabs in the line-up, how many from the likes of Palace, West Ham, Newcastle, Sunderland and Blackburn make the cut?",
        "GoalkeeperJussi Jaaskelainen (Bolton/West Ham)Only Kevin Nolan has played more games under Allardyce than Finnish goalkeeper Jussi Jaaskelainen. In 368 appearances under the English manager, Jaaskelainen kept an impressive 117 clean sheets, with his reliable and stable presence at the back a key component of Bolton's European charge. ",
        "So highly thought of was he that Allardyce later brought him to West Ham on a free transfer having earned promotion back to the Premier League with the Hammers. 'We had a goalkeeping coach (at Bolton) who said he was going to be a really good goalie, and he was right. We had Keith Branagan and Steve Banks, and when they left Jussi came through to take us back in the Premier League and keep us there, and he did!'I signed him again at West Ham - one of my bargain buys - on a free. We got a goalkeeper who didn't cost us anything, and has years and years of Premier League experience, probably 34 or 35, but he did a great job for the three seasons that he was there.'For his goalkeeping and his longevity - it's Jussi.' ",
        "DefendersRight back - Habib Beye (Newcastle)French-born Senegal right back Habib Beye only played under Allardyce for 17 games, but earns his place in the 68-year-old's all-time best XI after the impact that he made at Newcastle, after 'Big Sam' had chased him for 'a long time' at Bolton.'I chased this lad for a long time when I was at Bolton, I couldn't afford him but I could at Newcastle. He was Marseille captain and he made a big impact - even though I lost my job in January at Newcastle he was player of the year that year.'",
        "Centre back and captain - Ryan Nelsen (Blackburn)Blackburn centre half Ryan Nelsen takes the armband in Allardyce's team, after his stalwart performances for Rovers, keeping 21 clean sheets in 70 appearances. His former boss was full of praise for his character and temperament at the heart of defence.'A great lad, fantastic human being. Not just as a footballer but his intelligence was part of the reason why he was so good as captain, and played for Blackburn for many years. 'Consistent reliable, dependable, leader, kept the squad together, he was very, very good indeed.'",
        "Centre back - Phil Jones (Blackburn) Phil Jones' career may have stalled at Manchester United, but it was under Allardyce at Ewood Park that he firs appeared on the radar for England's elite. As a teenager at Rovers he managed 10 clean sheets in 31 games with Allardyce before the Red Devils snapped him up, but it didn't take long for his talent to become apparent.'Phil Jones, at 18 in the Premier League at centre-back, won Man of the Match in his second game against Chelsea at home, marking the incredible Didier Drogba - I think we got a 1-1 draw. 'Blackburn knew - I'd gone by the time he left - that it wasn't going to take long. You knew all the big boys were going to be in for him. Sadly his career has been disrupted too much with injuries and he hasn't achieved the things he should have with Manchester United.",
        "'Phil has sadly not lived up to the level that I expected, but I think that's down to injuries. There's not many that make it and play on a regular basis (at 18).' Left back - Patrick Van Aanholt (Sunderland/Crystal Palace)When Allardyce inherited a Sunderland side battling against relegation, the Dutch left back was not the best defender in the side but needed little encouragement to get forward. The 32-year-old - now at PSV - played 38 games for 'Big Sam' at the Black Cats and Crystal Palace, scoring seven goals. 'He had more trainers than anyone I'd ever seen in my entire life before. He had a room dedicated to his trainers I had to tell him \"Please don't put it on your Instagram!\"'Taught him how to defend, and going forward he was outstanding. I took him to Crystal Palce as soon as I could when they asked me to go there and save them from relegation. He was a major part at Sunderland and got into the international side.' ",
        "MidfieldersRight midfield - Jay-Jay Okocha (Bolton)A two-time BBC African footballer of the year, seven-time winner of Nigerian player of the year, AFCON winner in 1994 and the tournament's Best Player and Top Scorer 10 years later. Jay-Jay Okocha is widely regarded as one of the greatest African stars to ever play the game. ",
        "At Bolton, the Nigerian quickly endeared himself as something of a cult hero in his first season after joining from PSG, before taking the armband in his second. Under Allardyce he scored 18 goals from attacking midfield in 144 games, although he is surely best remembered for his dazzling array of skills that thrilled fans and neutrals alike. 'He's so good they named him twice! The Bolton fans printed some t-shirts with that on. Even the non-Bolton supporters enjoyed watching Jay-Jay Okocha.'Centre midfield - Fernando Hierro (Bolton)Even at 36, the arrival of three-time Champions League winner Fernando Hierro - a Real Madrid legend - at Bolton raised some eyebrows, and although he only played a season at the twilight end of his career, Allardyce wasted no time in picking a man he describes as 'the best passer in the Premier League'.'The best passer in the Premier League was Fernando Hierro. He and Paul Scholes were on a par, he could pass it onto a six-pence. That's how good he was.'My whole coaching technique changed when watching him get the ball and get the players on the front line running in the right areas because he could deliver a pass like nobody else could. 'He was applauded when he left in his last game at home, the whole stadium applauded him! I'd never experienced that before, but that's how not just me but everybody else appreciated him.'",
        "Centre midfield - Gary Speed (Bolton)Gary speed joined in the same window as Hierro, with both going straight into the Trotters' midfield. The Welsh icon's career in the Premier League was legendary - at one time being the only player to have reached 500 league appearances and scoring in every single season in the competition in 2006-07. He played under Allardyce for three seasons, notching up 121 games in all competitions, and featured heavily in the club's European campaign. When Allardyce left Bolton, Speed had managed 11 goals and eight assists from the heart of the midfield.  'He played like a 25-year-old, but with the head of a 35-year-old and was an example to youngsters. He used to tell them off if he saw them slacking or not trying as hard as they could. Speedo was at the front of everything. 'It was great to have managed to get him from Newcastle and it was a big moment for us to bring in a player with that experience and blend a British player with a foreign import (Hierro) and it was a great period at that time.'Left midfield - Youri Djorkaeff (Bolton)A World Cup winner in 1998 and European Championship victor in 2000, France's Youri Djorkaeff arrived at Bolton from Kaiserslautern in Germany in 2002, and over the next two years would score 21 times in 81 games for Allardyce, assisting a further eight.  'His agent rang me and said \"He needs to play to get into the World Cup squad\" so I asked \"Will he come to Bolton?\". So we jumped on the plane and we took a few clips of the stadium to sell it to him - because he didn't have a clue where Bolton was.'He said \"We can help each other\" and I said \"But you haven't played for-\" and he goes \"Don't worry about me I'll be alright\". January, he went straight in the side, scored seven or eight goals and kept us up that year comfortably, went to the World Cup and asked if he could come back. He stayed three more years.'More players would look at Bolton and we had a World Cup winner, a European Championship winner, and other players would think \"It must be alright going there\" and there you go!' ",
        "StrikersNicolas Anelka (Bolton)Former Arsenal, Real Madrid, PSG, Liverpool and Manchester City striker Nicolas Anelka came to Bolton as Allardyce's most expensive signing at £8million, and brought with him 12 goals in 37 games under 'Big Sam' as the out-and-out striker that the club needed. 'He was the goal scorer we needed, the most money I spent at Bolton. I managed to persuade the board to finally get their hands in their pockets and he took us to another level. 'I didn't have long enough with Nicolas because I left myself, but they sold him - I wouldn't have done this - to Chelsea for £15m and lost one of the best goal scorers in European football, certainly in the Premier League. It was a pleasure to work with him.'",
        "Jermain Defoe (Sunderland) England international Jermain Defoe is perhaps best known for his goal scoring exploits at Tottenham, but he had a fruitful spell at Sunderland under Allardyce in which he managed 13 goals in 27 matches and helped Sunderland fend off relegation with a game to spare. 'When people talk about me just playing long balls up to a big centre forward, this was a five-foot eight-inch player, who played up the middle on his own for us at Sunderland in desperate times. 'The goals he scored, the times he scored them and when he sored them in a side that - when I got there - could barely make a chance, without those goals we would never have survived. 'To score that many goals when you're sitting in the bottom six all season is no mean feat. Whoever is the leading goal scorer in the Premier League is getting three or four times more chances than we created for Jermain.'"
    ]
}