{
    "articleURL": "/news/article-12040299/Acting-PM-Richard-Marles-heckled-defence-summit-Four-Seasons-Sydney.html",
    "content": [
        "'Polite' heckler demands hospitals and public housingActing PM Richard Marles was speaking at a defence summitHe was pressed on cost of AUKUS nuclear submarine deal A 'polite' heckler has interrupted Richard Marles' speaking event at a defence summit to press him on the massive cost of the AUKUS nuclear submarine deal.",
        "The Deputy Prime Minister, who is acting prime minister with Anthony Albanese in London, was mid-conversation with former Liberal defence minister Christopher Pyne at the Four Seasons hotel in Sydney.He was then abruptly interrupted by the protester on Wednesday morning.Vision and images of the event shows Mr Marles and Mr Pyne were seated on stage discussing defence policy in front of an audience when an unidentified man shouted from the crowd: 'No nuclear submarines, Marles.''We want hospitals and public housing. We don't want those nuclear submarines,' the man continued.",
        "Mr Pyne, who was MCing the event hosted by online publication Defence Connect, was filmed trying to regain control, saying loudly: 'Thank you, we can have both. Lovely, thank you.'Mr Marles also responded from the stage to suggest the Albanese government would fund hospitals and public housing as well as the multi-billion dollar AUKUS security pact.'We'll do that too,' he said.Mr Marles continued by saying: 'That was polite, anyway, as (far) as protesters go'.Mr Pyne appeared to run with Mr Marles' lighthearted response, making a joke about the way Labor managed the economy and public spending.'Under Labor governments we can have everything,' he said.Mr Marles burst out laughing as Mr Pyne continued with the joke: 'We've got money coming out of our ears'.",
        "Mr Marles' office was contacted for comment but said it had nothing more to add to what was said on the stage.Mr Marles, who also holds the defence portfolio, has previously said he accepts there will be critics of the AUKUS security agreement with the United States and the UK but staunchly defended the pact.Under the trilateral deal, which was signed in 2021 by the former Morrison government and which Labor and the Coalition support, Australia will purchase and manufacture nuclear-powered submarines to replace its own ageing Collins-Class fleet of conventional vessels.Under the 'optimal pathway' revealed by the Prime Minister in March, the AUKUS endeavour is forecast to cost Australian taxpayers between $268bn to $368bn over the next 30 years by increasing annual defence spending from 2.05 to 2.20 per cent of GDP.",
        "The federal government says the project, which has bipartisan support, will create 20,000 local jobs over the next three decades and budget offsets mean it won't drive up Defence spending until the 2026-27 financial year.But the revelation of the plan's enormous price tag has triggered questions about how an already under-strain budget will handle the cost as the government weighs up how to fund other vital public services.AUKUS will cost $9bn over the next four years, but the government says this will be offset by $6bn that had been allocated to the cancelled Attack-class submarine program and $3bn in savings from other Defence programs.",
        "Additionally, the government has also committed to funding some of the recommendations made in a landmark review of the Australian Defence Force in the upcoming federal budget.The Defence Strategic Review will cost $19bn over the next four years, which includes the $9bn in spending already announced to fund the AUKUS submarines.Around $7.8bn of that will come from savings made through the gutting, delaying or cancelling of a number of projects, with the rest to come from a pot of money already within the defence budget.Australia's yearly defence spending was already one of the biggest strains on the federal budget at $48.7bn.The government has routinely named defence as one of the five biggest pressures facing the budget which it must figure out how to balance with the cost of government programs such as healthcare and the National Disability Insurance Scheme.The Albanese government's second federal budget will be handed down on Tuesday."
    ]
}