{
    "articleURL": "/wires/reuters/article-12047703/China-slams-Canada-PM-Trudeaus-slave-labor-comment-threatens-consequences.html",
    "content": [
        "By Doina Chiacu and Ismail Shakil",
        "WASHINGTON/OTTAWA, May 4 (Reuters) - China sharply criticized Canadian Prime Minister Justin Trudeau's comment that linked Chinese-produced lithium to slave labor, and warned Canada could face consequences if it continues \"denigrating maliciously\" the human rights situation in China.Trudeau, during his visit to the U.S. last week, linked the production of lithium in China to \"slave labor\" without elaborating as he discussed Canada's efforts to ramp up production of the metal used in electric vehicles and other batteries.\"His words disregarded facts and confounded black with white. The Chinese side expresses its strong dissatisfaction and resolute opposition to this,\" the Chinese Embassy in Ottawa said in a statement late on Wednesday.The embassy accused Trudeau of \"political manipulation under the pretext of human rights\" and seeking to undermine China.\"We urge Canada to take a hard look at itself in the mirror, deeply repent its wrongdoing, and take concrete steps to address its own serious human rights problems,\" the embassy said.\"The Canadian side should respect facts, set aside prejudice, and stop denigrating maliciously the human rights situation in China, otherwise Canada will certainly take the consequences.\"Trudeau's office said it did not have anything to add to his comments from last week.Relations between Canada and China have soured for various reasons in recent years, most recently over allegations that Beijing tried to meddle in Canadian affairs in 2021 by targeting a lawmaker and his family.",
        "Canada's Foreign Minister Melanie Joly told a parliamentary committee on Thursday that Ottawa had summoned China's ambassador over the allegations of threat against Michael Chong, a member of parliament with Canada's main opposition Conservative party.The move came after the Globe and Mail newspaper reported on Monday thatChina sought informationabout Chong in a likely effort to \"make an example\" of him and \"deter others from taking anti-PRC positions.\" The Chinese consulate in Toronto denied the report.(Reporting by Doina Chiacu in Washington and Ismail Shakil in Ottawa; Editing by Josie Kao)"
    ]
}