{
    "articleURL": "/wires/pa/article-12039719/Drivers-face-fined-unfairly-using-yellow-box-junctions--report.html",
    "content": [
        "Drivers risk unfair fines for using most yellow box junctions which councils want enforcement powers over, according to a new report.",
        "Problems with the boxes include poor visibility and being too large, research commissioned by the RAC found.Yellow boxes are used in an attempt to ensure traffic flows smoothly through busy junctions. Fining people can have real financial consequences  Simon Williams, RAC  Motorists should not enter them unless their exit is clear or they are waiting to turn right.The RAC said to avoid inadvertently breaking the rules, drivers must be able to clearly see boxes and where they end.In England outside London, only police forces have the power to punish motorists over their use of yellow box junctions.",
        "But 27 councils have put forward proposals to enforce 111 boxes under legislation introduced by the Government in May 2022.Successful applicants will be able to issue penalty charge notices (PCNs) to offending drivers.On Transport for London’s (TfL) red routes, PCNs are £160, reduced to £80 if paid within 14 days. I haven’t seen a single proposal that reviews the visibility of the box from a driver’s point of view  Sam Wright, chartered engineer  Chartered engineer Sam Wright was commissioned by the RAC to analyse the 111 boxes which councils have put forward proposals to enforce.The RAC said there are issues with 90% of the boxes which are “likely to lead to drivers being fined unfairly”.",
        "Forty boxes were found to pose visibility difficulties such as faded road markings, while 18 extend beyond junctions.Mr Wright, who was formerly responsible for the design and approval of yellow boxes on TfL’s road network, said: “I haven’t seen a single proposal that reviews the visibility of the box from a driver’s point of view.“If you also factor in bad weather, poor light and other vehicles, then the poor visibility situation is exacerbated.“This is all very concerning, especially as enforcement is carried out via cameras high in the air.",
        "The number of councils that have put forward proposals to enforce 111 boxes under legislation introduced by the Government in 2022",
        "“Many of the boxes have been around for years, perhaps decades.“It appears that many authorities have simply assumed that the boxes already on the ground are suitable for enforcement without carrying out a fresh assessment as is recommended in Government guidance.”RAC roads spokesman Simon Williams said: “Fining people can have real financial consequences for those on the receiving end.“Enforcing yellow boxes means that the driver of a vehicle overhanging a box by any amount for just a moment can get a ticket.“Yet many drivers end up stopped or trapped in these junctions through no fault of their own.",
        "“It is not only imperative, but a moral duty to ensure that fines are fair, justified and that the appeals process is consistent across the country.“We urge the Government to carry out an urgent review of its yellow box junction guidance and clarify what is and isn’t enforceable.”"
    ]
}