{
    "articleURL": "/wires/ap/article-12046173/Shell-posts-9-6-billion-profit-energy-prices-slide.html",
    "content": [
        "LONDON (AP) - Global energy giant Shell said Thursday that it earned nearly $10 billion in the first quarter, becoming the latest fossil fuel company to post strong financial results despite sliding oil and natural gas prices.",
        "London-based Shell Plc reported adjusted earnings of $9.6 billion in the first three months of 2023, up 5.7% from a year ago.The company said it faced headwinds from higher taxes and lower prices for selling oil and natural gas, as energy prices have eased after spiking following Russia's invasion of Ukraine last year. Shell said those factors were offset by cutting operating expenses and better trading results.In the first quarter, \"Shell delivered strong results and robust operational performance, against a backdrop of ongoing volatility,\" CEO Wael Sawan said in a statement.The company, whose annual profits doubled to a record high last year, also will reward shareholders by buying back an additional $4 billion in shares.Shell is the second U.K. energy company this week to post stronger-than-expected earnings, with rival BP reporting that it earned $5 billion in the first quarter.",
        "The financial earnings have become a political flashpoint in Britain, spurring calls from opposition politicians and campaign groups for oil and gas companies to do more to help consumers burdened by soaring energy bills that have contributed to decades-high inflation. Critics have called for higher taxes on energy giants' windfall profits.Oil and gas companies around the world have been reporting bumper earnings in the wake of Russia´s invasion of Ukraine in February 2022, which sent energy prices soaring and curtailed some of Moscow´s supplies to the world.",
        "Last month, U.S. company Exxon earned a record $11.4 billion in the first quarter, while Saudi Aramco reported that it earned $161 billion in 2022, the highest-ever recorded annual profit by a publicly listed company."
    ]
}