{
    "articleURL": "/femail/article-12050969/How-eat-nationwide-chip-survey-throws-surprising-results.html",
    "content": [
        "Do you like yours drenched in salt and vinegar? Dunked in ketchup, mayo – or both? Loaded with cheese, gravy or curry sauce? And do you eat them for dinner, lunch… or maybe even breakfast?",
        "We are a nation of chip lovers, tucking into two billion kilos – or 30kg a head – of them every year.We'll find any excuse to eat our favourite type, and thanks to McCain, Britain's best-loved oven chips, there's a chip out there for everyone: from Crinkle-Cut to Crispy French Fries, and Straight-Cut to Smiles.",
        "So, in the spirit of celebrating all things chips, we've done a nationwide survey, asking people up and down the country about their chip habits, preferences, opinions – and their favourite ways to eat them.The South East is home to the biggest chip-lovers, with 94 per cent of households surveyed there eating chips every week, closely followed by 88 per cent in the Midlands and Wales, and another 88 per cent in the North and Scotland.Seventy-nine percent of people in the Midlands reckon chips go with anything (we agree!) and 66 per cent say they're part of their favourite meal. Sixty-nine per cent of Southerners agree, as do 61 per cent of Northerners.McCain's chips are a real family staple – crowd-pleasing, quick-and-easy to cook, as well as filling for tummies both big and small.Eighty-five per cent of those surveyed say their families love to eat them, with chips proving most popular with families from the South (90 per cent of households).",
        "Just over half of those we asked in the North – 58 per cent – say their kids would eat chips every day if they let them, while this rises to 73 per cent in the Midlands and 75 per cent in the South.But that's no bad thing: most McCain products are made from just potatoes and oil, making them an energy-rich carbohydrate. Forty-two per cent of Southerners say they eat chips because they're a good source of Vitamin C.When it comes to Britain's favourite chips, it really does depend on where you live.In Wales and the Midlands, it's all about Straight-Cut Home Chips (29 per cent), closely followed by Chunky Cut Home Chips (19 per cent).In London and the South East, however, they prefer French Fries (26 per cent), and in the North and Scotland, Straight-Cut (28 per cent) and Chunky Cut (24 per cent) come out top again.French fries are the chips we eat most at home, except in the North, where ovens are busy crisping up Straight-Cut Home Chips for family meals.",
        "And when it comes to toppings, it seems, it's all about salt, salt, salt.Two-thirds of us like salt on our chips: Northerners most of all, where this rises to 71 per cent – and a whopping 80 per cent of chip-lovers in Yorkshire.",
        "Ketchup comes a close second (54 per cent of us use it to top our chips), followed by vinegar (48 per cent) and mayonnaise (36 per cent).Curry sauce is extremely popular in Wales, where 90 per cent of households like to drench their chips in the stuff. They're not so keen in the East Midlands, though, where it's just 52 per cent.In Scotland and the South East, it's all about cheesy chips (71 per cent of people love cheese as a topping) and the North West is home to the biggest fans of gravy on their chips (74 per cent).",
        "Controversially, 17 per cent of people surveyed like to sprinkle pepper on their chips (this rises to a fifth in the West Midlands), 15 per cent enjoy brown sauce and 21 per cent prefer garlic mayo.But we all have our limits. Nineteen per cent of people surveyed (and a third in Scotland) say they'd never eat chips with mushy peas.Breakfast is another divisive subject. Sixty-four per cent of chip-lovers in the Midlands and the North say chips have no place on a cooked breakfast, and 58 per cent of Southerners agree.That said, a fifth of Londoners (and 19 per cent of Welsh households) have eaten chips for breakfast in the past month.",
        "Almost half (49 per cent) of us have tucked into chips at lunchtime, and 28 per cent of people say they've eaten chips as a snack. The biggest snackers are in London (where 45 per cent of people have snacked on chips) and the West Midlands (43 per cent).We like to cook them in different ways, too. Sixty-nine per cent of us have eaten oven chips in the last month, with the biggest fans in the East Midlands (76 per cent) and North West (74 per cent).The air fryer – which makes McCain products extra-crispy and delicious, not to mention cooking them in a fraction of the time – is used by 44 per cent of those surveyed (and as many as 62 per cent of households in Wales, and 58 per cent in Scotland).We also cook our chips in the microwave: 22 per cent of us have eaten microwave chips – most popular in London (34 per cent) and the North East (31 per cent) – in the last 30 days.",
        "So – once you've digested all that data, what does our great chip survey say about us?Well, we're a nation of chip lovers (some might even say obsessives) – and there's a reason for that.",
        "Chips make us happy: more than three-quarters of people surveyed say so, and another third say eating chips fills them with joy.Londoners are the cheeriest chip-eaters (86 per cent say chips make them happy), closely followed by the South East, Wales, North East and Scotland (all 81 per cent).So, next time you tuck into a plateful of your favourite fries, remember they don't just taste good – they make you feel good, too.Read on for more tasty nuggets, cooking tips – and a mouth-watering recipe you'll want to make for tea tonight…",
        "It's official! The results of our survey reveal a clear winner for the nation's favourite chip recipe: Southern-fried chicken, served with McCain's Straight-Cut Home Chips, spicy Cajun seasoning and a side of garlicky green beans.A whopping 76 per cent of those surveyed said it would make a yummy mid-week meal, with the dish proving most popular among chip-lovers in the Midlands and Wales.Not only is it a guaranteed crowd-pleaser, but it's cooked from start to finish in an air fryer – meaning you can have it on the table in just 20 minutes.Be warned – it's seriously good!",
        "Prep time: 5 minutesCooking time: 15 minutesDifficulty level: EasyServes: 4Ingredients:500g Straight-Cut Home Chips500g chicken breast mini fillets110g panko breadcrumbs1 tbsp oil1 tsp each of:- smoked paprika- garlic granules- onion granules1/4 tsp cayenne pepper2 eggs, beaten300g green beans3 cloves of garlic, crushedSalt and peppercooking spray1 tsp Cajun seasoning (optional)1 lime, cut into wedgesMethod:Preheat both baskets of your air fryer to 200C.Put the breadcrumbs, oil and spices in a large shallow bowl and mix to a crumbly texture.Put the beaten eggs in another bowl.Dip the chicken fillets in the egg and shake off any excess.Next, press each one into in the breadcrumb mixture, ensuring all sides are well-coated.Lay them in the air fryer basket. A single layer is best – so you may need to do this in batches if you have a smaller air fryer.Tip the chips into the other basket. Cook both for 8 minutes.While they cook, wash and trim your beans. Place in a bowl with the garlic, salt and pepper, and some cooking spray.Carefully remove the chicken fillets from the air fryer, spoon the beans into the basket and return the chicken on top, other side up. Shake the chips.Cook both for another 7 minutes. If using the Cajun seasoning, sprinkle it over your chips 2 minutes before the cooking time is finished.Check the chicken is cooked all the way through – not pink in the middle – before serving. Thicker fillets may need an extra few minutes.Serve the chicken, chips and beans with lime wedges on the side.*Recipe written for a dual basket 24000W air fryer with 7.2l capacity",
        "So what do YOU like on your loaded chips? Here's what our survey reveals:1. CHEESE: Cheese came first in our nationwide poll, with 40 per cent of people surveyed saying melted cheddar or gooey mozzarella is their favourite thing to eat on top of chips.Southerners liked it most (44 per cent of people), closely followed by chip-lovers up North (41 per cent) and in the Midlands (36 per cent).2. BACON: The nation's second-favourite topping, preferred by 27 per cent. Whether it's bits or rashers, that salty bacon flavour goes so well with crispy potato.3. BBQ SAUCE: It might not be the sauce you'd expect, but BBQ sauce comes a close third in our survey as one of the nation's favourite chip-toppers.Twenty-two per cent of people asked say they like BBQ sauce on their chips, with the biggest fans in the West Midlands (32 per cent) and the North East (31 per cent).",
        "4. FRIED ONIONS: Fried onions are another top topper, with 22 per cent of households nationwide enjoying sprinkling them on their fries.The biggest appetite for crispy shallots is in the Midlands and Wales, where they're liked by 26 per cent of chip-lovers.5. GRAVY: There's no North-South divide when it comes to pouring gravy on your chips, with exactly a fifth of both Southerners and Northerners saying it's their favourite topping.Gravy is particularly popular in Wales, where 38 per cent of people surveyed like it on chips – but in the North East, astonishingly, not a single person named it as a topper.6. DIPS: Plenty of people like to drizzle dip on their chips, whether it's sour cream, guacamole or aioli. Sour cream is the most popular, appealing to 12 per cent of chip-lovers, while 11 per cent enjoy guacamole or avocado on top, and 7 per cent opt for aioli.7. CHILLI: Jalapeños and hot peppers were named a go-to chip-topper by 15 per cent of people surveyed, with those in the North East (31 per cent) the biggest fans of spice. Households in the East Midlands also love chips with a kick: 24 per cent of people chose jalapeños.Sriracha (or hot sauce) is also popular: 8 per cent of people say they drizzle it on their chips.",
        "Using our survey to tap into the nation's favourite chip styles, toppings and traditions, here's how to cook the ultimate plate of chips:1. USE YOUR AIR FRYERAlmost all of McCain's products – including Home Chips, French Fries, Smiles, Wedges and Hash Browns – can be cooked in the air fryer, as well as an oven, and you'll find cooking instructions on the back of the packet.2. DON'T FORGET TO PREHEATFor extra crispiness, preheat your air fryer for around 5 minutes before adding your chips. This ensures they go into a piping hot basket, so the outside instantly starts to cook.3. COOK STRAIGHT FROM FROZENDon't take the chips out of the freezer until you're ready to use them. Cooking them straight from frozen gives them the best shape, texture and taste.4. SHAKE, SHAKE, SHAKEShake your air fryer basket halfway through cooking to make sure your chips are crisp, golden and fluffy on all sides.5. BE INSPIREDExperiment with different times and temperatures to get your air fryer chips just right. And test out toppings, spices and flavour combinations: for inspiration, check out McCain's air fryer recipe collection here."
    ]
}