{
    "articleURL": "/wires/ap/article-12043637/Wrongfully-convicted-Massachusetts-man-gets-13M-settlement.html",
    "content": [
        "BOSTON (AP) - A Massachusetts man who spent 32 years in prison after he was wrongfully convicted of setting a fire that killed eight people will receive $13 million from the city where he was arrested.",
        "Victor Rosario, 65, said Wednesday he has forgiven those who put him behind bars.\"One of the things for me to be able to continue moving forward is basically to learn how to forgive,\" he said at a news conference the day after the Lowell City Council voted to settle a $13 million civil rights lawsuit he brought against the city.Rosario was 24 years old when he was convicted of arson and multiple counts of murder in connection with the 1982 fire in Lowell, Massachusetts. Three adults and five children died in the fire.Rosario tried to help the victims escape the flames, his attorneys said.But investigators identified Rosario as a suspect, and then fabricated evidence and hid evidence that the fire was actually an accident, attorney Mark Loevy-Reyes said.",
        "\"They brought Victor Rosario for questioning; They coerced a confession after keeping him up all night,\" Loevy-Reyes said. \"Victor was traumatized because he had tried to save children from the burning fire. He heard their screams.\"He was told if he signed a piece of paper, he could go, Loevy-Reyes said. It was in English, and Rosario didn't understand it because his native language is Spanish. He signed it anyway and ended up with a life sentence.Rosario missed all the highwater moments in his four children's lives. But the worst thing about being wrongfully imprisoned, Rosario said, was not being there for his mother when she died in 2007.",
        "\"Thirty-five years, more than half of my life, I spent behind the wall of a Massachusetts state prison,\" Rosario read from a written statement at the news conference outside Boston's federal courthouse. \"Today this chapter is ended and a new chapter begins. Nothing can ever compensate me for those years taken from me.\"Rosario's attorneys, with assistance from the New England Innocence Project and the Committee for Public Counsel Services, persuaded a judge to vacate the convictions in 2014 and set him free pending a new trial. After the state´s highest court upheld the ruling in 2017, Middlesex County prosecutors said they would not retry him, citing the passage of time.In 2019, he filed a federal lawsuit against the city of Lowell as well as about a dozen police officers and firefighters involved in the investigation, alleging constitutional violations. The settlement was announced just a couple of weeks before the trial was scheduled to start.The lawsuit said investigators used \"outright lies, coercion, threats, mistreatment, and sleep deprivation\" and took advantage of Rosario's \"obvious mental health breakdown\" to get their client to sign a confession.There was pressure to quickly solve a high-profile tragedy, his lawsuit said.Prosecutors said at trial that Rosario and two brothers, who have since died, set the fire by throwing Molotov cocktails at the building. The brothers were never tried because Rosario refused to testify against them.",
        "Locke Bowman, another of Rosario's attorneys, credited the Lowell City Council for settling the case.\"$13 million does not begin to compensate Victor for all that he has lost but it reflects the acknowledgement of the city of Lowell that what happened wasn´t right,\" he said.The settlement covers all of the police officers and firefighters named individually in the lawsuit.Messages seeking comment were left with the Lowell mayor's office, the city manager's office and the city's legal department.Since he's been freed, Rosario has started helping prisoners still behind bars and even competes in marathons.\"I ask the criminal justice system, the universities preparing lawyers, prosecutors and investigators, to do their very best to not let what happened to me be the future of one more wrongfully convicted individual,\" he said in his statement."
    ]
}