{
    "articleURL": "/wires/ap/article-12043875/In-Oppenheimer-Cillian-Murphy-leads-Nolan-epic.html",
    "content": [
        "The day Christopher Nolan called Cillian Murphy about his new film, \" Oppenheimer,\" Murphy hung up the phone in disbelief.",
        "The Irish actor, though a regular presence in Nolan films going back almost two decades, had always been a supporting player. This time Nolan wanted him to lead.\"He´s so understated and self-deprecating and, in his very English manner, just said, `Listen, I´ve written this script, it´s about Oppenheimer. I´d like you to be my Oppenheimer,´\" Murphy, 46, told The Associated Press recently. \"It was a great day.\"For Murphy, it is never not exciting to get a call from Nolan. It´s just hard to predict if he´s going to. He knows there are some movies he´s right for and some movies he isn´t.\"I have always said publicly and privately, to Chris, that if I´m available and you want me to be in a movie, I´m there. I don´t really care about the size of the part,\" he said. \"But deep down, secretly, I was desperate to play a lead for him.\"Murphy first met Nolan in 2003. He was brought in to screen test for Batman -not just the movie, the character. Murphy knew he wasn´t right for the Dark Knight, but he wanted to meet the man who´d directed \"Insomnia\" and \"Memento.\" They hit it off and Murphy got to tap into a sinister intensity to play the corrupt psychiatrist Dr. Crane/Scarecrow, who would go on to appear in all three films. Nolan would also call on Murphy to be the conflicted heir to a business empire in \"Inception\" and a traumatized soldier in \"Dunkirk.\"",
        "\"We have this long-standing understanding and trust and shorthand and respect,\" Murphy said. \"It felt like the right time to take on a bigger responsibility. And it just so happened that it was a (expletive) huge one.\"Soon after the phone call, Nolan flew to Dublin to meet Murphy to hand him a physical copy of the script, which he devoured right there in Nolan´s hotel room in September 2020. It was, he said, the best he´d ever read.Then the scale of it started to sink in.This would be a film about the charismatic and controversial theoretical physicist who helped create the atomic bomb. Oppenheimer and his peers at Los Alamos would test it on July 16, 1945, not knowing what was going to happen. Then several weeks later the United States would drop those bombs on the Japanese cities of Hiroshima and Nagasaki, killing tens of thousands of people and leaving many with lifelong injuries.As Nolan said last week in Las Vegas, \"Like it or not J. Robert Oppenheimer is the most important person who ever lived.\"\"Oppenheimer,\" which opens in theaters on July 21, features a starry cast including Emily Blunt as Oppenheimer´s wife Kitty, Matt Damon as Leslie Groves Jr., Robert Downey Jr. as Lewis Strauss, Gary Oldman as Harry S. Truman, and many more rounding out the pivotal players in and around this tense moment in history.",
        "\"You realize this is a huge responsibility. He was complicated and contradictory and so iconic,\" Murphy said. \"But you know you´re with one of the great directors of all time. I felt confident going into it with Chris. He´s had a profound impact on my life, creatively and professionally. He´s offered me very interesting roles over and I´ve found all of them really challenging. And I just love being on his sets.\"Murphy continued: \"Any actor would want to be on a Chris Nolan set, just to see how it works and to witness his command of the language of film and the mechanics of film and how he´s able to use that broad canvas within the mainstream studio system to make these very challenging human stories.\"Over the years, Murphy has come to appreciate that with Nolan there´s always something deeper to discover than what´s literally on the page. \"Dunkirk,\" he recalled, was only 70 pages and there wasn't much to his character, not even a name.\"He said, ´Look, let´s figure it out together and you and me can find an emotional journey for the character. And we did it. We did it out in the water on that boat. That comes from trust and respect,\" Murphy said. \"I´m really proud of that performance.\"",
        "As with all Nolan endeavors, secrecy around \"Oppenheimer\" is vitally important. Murphy loves the \"old fashioned approach\" that builds interest and anticipation.The difference with \"Oppenheimer\" and other Nolan originals, though, is that this is rooted in historical fact. You can read the book it´s based on, Kai Bird and Martin J. Sherwin´s Pulitzer Prize-winning \"American Prometheus: The Triumph and Tragedy of J. Robert Oppenheimer.\" You can watch the 1981 documentary \"The Day After Trinity\" on The Criterion Channel.And you can try to parse Nolan´s words for clues. He´s talked about recreating the Trinity Test, the fascinating paradoxes, the twists, turns and ethical dilemmas and that the story is cinematic and both dream and nightmare. But ultimately, it´s something that just needs to be seen.\"The question will be how Chris presents it,\" Murphy said. \"I think people will be very surprised and wowed by what he does. Anything I say will just seem a bit lame as compared to seeing this in an IMAX theater.\"The time for discussions will be after the movie comes out.\"There´s an awful lot to talk about when we can talk freely,\" Murphy said with a smile.He did offer up that they worked hard to get Oppenheimer´s look right, from the silhouette to the pipe to the porkpie hat. The man, he said, \"seemed aware of his own potential mythology.\" But, again, those conversations will have to wait.",
        "\"I´m really proud of the movie and I´m really proud of what Chris has achieved. This was, for sure, a special one, certainly because of the history with me and Chris. We were not walking around the set high fiving, but it did feel special.\" Murphy said. \"It´s an event every time he releases a film, and rightly so. Whether I´m in them or not, I always go to see his movies.\""
    ]
}