{
    "articleURL": "/wires/aap/article-12045279/Indigenous-musicians-shine-light-caring-country.html",
    "content": [
        "Emily Wurramara is a proud Anindilyakwa woman from Groote Eylandt in the Northern Territory whose country is surrounded by water.",
        "Wurramara told AAP she wanted to write a song that honoured the sea and captured the essence of her beauty.\"It is a reminder that the sea is just as important as the land and we have to look after her and take care of all the beings and songlines that run through her,\" she said.The song Lady Blue has earned Wurramara a place in the finals of the 2023 Environmental Music Prize.The prize aims to amplify the voices of artists who are inspiring climate and conservation action.Other First Nations finalists are Kutcha Edwards, MO'JU, Troy Cassar-Daley, Wildfire Manwurrk and Wildheart.For Wurramara, connection to country is about preserving, honouring and respecting all living things that have been around far longer than humans.\"Looking after country and connection to country is more than just connection, it is about healing, (being) reflective and remembering.\"It is not our birth-given right but rather it is a privilege to be on country and we need to look after country so that our future babies can experience it,\" Wurramara said.Environmental Music Prize founder Edwina Floch said that the quality of music submitted shows that artists want to use their voices to encourage action for the planet.\"They each have their own voice and style, but what unites them is the desire to make a difference,\" Ms Floch said.",
        "Each song and music video on the shortlist was selected based on its ability to connect to nature and reflect the hopes, fears and ambitions of the environmental movement.Climate scientist Dr Joelle Gergis said she was excited to hear about the Environmental Music Prize, because the songs invite people to have a conversation about the things we collectively value as a society.\"It isn't up to the scientific community to drive cultural change. We need our musicians, our artists, our teachers to use their communication skills and platforms,\" said Dr Gergis.Winners of the prize will be announce in June."
    ]
}