{
    "articleURL": "/wires/ap/article-12049007/Rays-beat-Pirates-best-start-1984-Tigers.html",
    "content": [
        "ST. PETERSBURG, Fla. (AP) - Zach Eflin pitched seven scoreless innings, Randy Arozarena hit one of three Rays homers and Tampa Bay beat Pittsburgh 3-2 on Thursday to finish a three-game sweep of small-budget teams off to outstanding starts.",
        "Taylor Walls and Yandy Díaz also homered for Tampa Bay, which at 26-6 is off to the best start through 32 games since the 1984 World Series champion Detroit Tigers went 27-5.Eflin (4-0) scattered three hits and struck out 10. The right-hander allowed just one baserunner to reach scoring position, when Carlos Santana hit a two-out double in the seventh. Jason Adam gave up Santana´s two-run, two-out double in the ninth before getting his second save and completing a four-hitter.The Rays have scored a major league-best 210 runs and allowed an MLB-fewest 96. Tampa Bay also tops the big leagues with 67 homers, while allowing the fewest with 20.Vince Velasquez (4-3) left after just three innings and 54 pitches due to elbow discomfort for the NL Central-leading Pirates (20-12), who have lost a season-high four straight.TIGERS 2, METS 0",
        "DETROIT (AP) - Justin Verlander gave up back-to-back home runs in his New York Mets debut and Eduardo Rodriguez threw eight scoreless innings as Detroit completed a three-game sweep.Riley Greene and Javier Baez hit solo homers off Verlander in the first inning and that was enough offense for Detroit.Rodriguez (3-2) gave up just two hits and one walk while striking out nine. Alex Lange pitched the ninth for his fifth save.",
        "Verlander (0-1) settled in after his rough start. The 40-year-old right-hander gave up two runs and five hits and a walk while striking out five in his 79-pitch outing. He started the season on the injured list with a muscle strain in his upper back.New York has lost nine of its last 11, while Detroit has won three straight.RED SOX 11, BLUE JAYS 5BOSTON (AP) - Masataka Yoshida and Rafael Devers each homered to help Boston complete a four-game sweep of Toronto.Boston won its sixth straight overall to jump over Toronto for third place in the AL East. It´s the first time the Sox have swept the Jays in a four-game series since 2002.Brayan Bello (1-1) picked up his first win of the season after allowing four runs - two earned - and six hits in five innings. He struck out five and walked one.Vladimir Guerrero Jr. homered and drove in two runs for Toronto, which has lost five straight. Kevin Gausman (2-3) allowed eight runs and 10 hits in 3 1/3 innings. His ERA soared from 2.33 to 3.86.NATIONALS 4, CUBS 3WASHINGTON (AP) - Alex Call hit a game-ending homer leading off the ninth inning, and Washington recovered after blowing a 3-0 lead to beat Chicago and take three of four from the skidding Cubs.",
        "Call lofted the only pitch from Brad Boxberger (1-1) just inside the left-field foul pole and was greeted at the plate by exuberant teammates, who dumped a bucket of blue Gatorade on his head.Lane Thomas hit a three-run homer for Washington, which got seven near-flawless innings by starter Patrick Corbin. The veteran left-hander had given up only one hit - a popup by Cody Bellinger that shortstop CJ Abrams lost in the sun - before allowing back-to-back singles to start the eighth. Manager Dave Martinez pulled him for Hunter Harvey, who quickly allowed the Cubs to tie it.Kyle Finnegan (1-1) gave up a walk and a double to start the ninth, but retired the next three batters.The Cubs went 1-6 on their East Coast trip and fell below .500 (15-16) for the first time since April 4.ANGELS 11, CARDINALS 7ST. LOUIS (AP) - Luis Rengifo homered, drove in four runs and finished a triple shy of the cycle as Los Angeles beat St. Louis to complete a three-game sweep.The Angels won for the fourth straight time to improve to four games above .500. The Cardinals lost their sixth in a row and have dropped nine of their last 10.Griffin Canning (2-0) gave up five runs in five innings to earn his second-straight decision for the Angels. Canning allowed six hits, struck out three and walked three.",
        "Tommy Edman hit a three-run homer in the fourth and Paul Goldschmidt added a two-run double in the sixth for St. Louis, which at 10-22 is off to its worst start since the 1973 squad opened the season 8-23.Cardinals starter Jack Flaherty (2-4) gave up a career-high 10 runs in just 2 1/3 innings. The Angels went 7 for 10 with two strikes against Flaherty, who left after getting hit by a Rengifo comebacker.BRAVES 6, MARLINS 3MIAMI (AP) - Marcell Ozuna homered for third time in two games, Ronald Acuña Jr. stole his league-leading 15th base, and Atlanta beat Miami to complete a three-game sweep.Acuña went down in the sixth after fouling a ball off his left knee. He remained on the ground and grabbed at his leg for several minutes, but finished the at-bat and returned to right field in the bottom of the frame. He was eventually removed out of precaution.Matt Olson also homered for the Braves, winners of five of their last six.Dylan Dodd (2-1) allowed eight hits, three runs, walked three and struck out one in six innings. A.J. Minter struck out two in the ninth for his seventh save of the season.Jorge Soler, who finished a triple shy of the cycle, gave Miami a 2-1 lead in the first with his sixth home run. Jesús Luzardo (2-2) allowed six hits, four runs - three earned - walked three, including an intentional pass to Acuña, and struck out three in 5 2/3 innings.",
        "ORIOLES 13, ROYALS 10KANSAS CITY, Mo. (AP) -- Ramon Urias hit a go-ahead, two-run single in the eighth inning, then added a two-run double in the ninth, helping Baltimore overcome a blown seven-run lead in a win over Kansas City.Gunnar Henderson and Anthony Santander hit homers, and Cedric Mullins also drove in three for the Orioles, who led 8-1 before their bullpen allowed Kansas City to come back.The Royals pulled ahead on Bobby Witt Jr.´s single in the seventh when Aroldis Chapman (1-2) walked the first two batters in the eighth. Adam Frazier moved up on a balk and joined Jorge Mateo in stealing bases before Urias entered as a pinch hitter and ripped a single through the left side of a drawn-in infield to give the Orioles the lead again.Yennier Cano (1-0) pitched two scoreless innings for Baltimore.Freddy Fermin hit his first career homer, Salvador Perez added a two-run shot and Kyle Isbel went deep for Kansas City.TWINS 7, WHITE SOX 3, 12 INNINGSCHICAGO (AP) -- Carlos Correa drove in a run during a five-run 12th inning, and he and Byron Buxton homered as Minnesota beat Chicago to avoid a three-game sweep.The AL Central-leading Twins had lost three of four. Correa spurred Minnesota to victory hours after downplaying remarks from Chicago reliever Keynan Middleton, who called Correa \"a cheater.\"",
        "Eloy Jiménez homered for the White Sox, whose three-game winning streak ended.Chicago shortstop Elvis Andrus misplayed Jose Miranda´s leadoff grounder in the 12th and Trevor Larnach scooted in from second to give Minnesota the lead for good. Nick Gordon and Correa added RBIs later in the inning and Jorge Polanco broke the game open with a two-run double.Emilio Pagán (2-0) worked the 11th to get the win. Alex Colomé (0-1), the fifth Chicago reliever, took the loss.ROCKIES 9, BREWERS 6DENVER (AP) - Charlie Blackmon had two hits and two RBIs, and Colorado used a five-run eighth inning to earn a come-from-behind victory against Milwaukee.With the victory, the Rockies extended their season-best win streak to four games and won for the sixth time in their past nine games after starting the season 6-17.Brad Hand (1-1) threw one shutout inning to earn the win for Colorado.Christian Yelich, Rowdy Tellez and Tyrone Taylor each hit solo homers for the Brewers, who suffered their fourth consecutive loss, their longest drought of the season. It was also their seventh defeat in their past 10 games following a 15-6 start.Peter Strzelecki (2-2), who gave up five runs in one-third of an inning, took the loss for Milwaukee.MARINERS 5, ATHLETICS 3OAKLAND, Calif. (AP) -- Taylor Trammell homered for the second time in five days since coming off the injured list and drove in three runs as Seattle beat Oakland to extend its winning streak to four games and complete a series sweep.George Kirby (3-2) pitched seven mostly strong innings for Seattle. Kolten Wong added two hits and two RBIs.JJ Bleday hit his first homer of the season for Oakland. A´s starter Drew Rucinski (0-2) took the loss.The A´s lost for the eighth time in nine games and fell to 6-26 (.188), the lowest winning percentage in the majors. They are 3-15 at the Coliseum.AP MLB: https://apnews.com/hub/MLB and https://twitter.com/AP_Sports"
    ]
}