{
    "articleURL": "/wires/pa/article-12056837/William-Kate-sip-cocktails-wishers-ahead-coronation-concert.html",
    "content": [
        "The Prince and Princess of Wales sipped homemade cocktails with royal fans as they soaked up the atmosphere in Windsor ahead of Sunday’s star-studded coronation concert.",
        "William and Kate surprised well-wishers when they went on a 40-minute walkabout in the town’s famous Long Walk, and also came across special coronation ale dedicated to the King.",
        "The unannounced appearance came as Buckingham Palace said the King and Queen were “deeply touched” by the nation’s celebration of their coronation on Saturday.More than 18 million people in the UK tuned in to watch the ceremony on TV, compared with 26.5 million for the late Queen’s funeral in September.With a few hours to go before Take That, Katy Perry, Lionel Richie and others take to the stage in Windsor for a musical extravaganza, William and Kate chatted to picnicking families who were enjoying the summer sunshine.",
        "When the couple stopped to talk to Sue Watson and her friends, who all wore knitted yellow crowns and coronation T-shirts, they offered the future King a drink.Ms Watson told BBC News: “We’ve got a homemade cocktail with us called Purple Rain, which we made ourselves out of gin and blue curacao and lemonade and grenadine, I think.“We offered him some, we gave him a cup and he poured himself a little drink and had some. He liked it, said it was really nice and he offered some to Kate, she had some and thought it was very nice as well.”",
        "The prince was fascinated by cans of Return Of The King coronation ale which the group had brought, and holding one asked: “That’s from Windsor?”During the walkabout the public swarmed around the couple and William and Kate crouched down to talk to children with their parents, and they both posed separately for group photographs and selfies.At one point, Kate comforted a little girl who appeared overcome with emotion at meeting her.She gave the teary youngster, who was wearing a headband with union flag deely boppers and a navy dress covered in patriotic motifs, a long hug and the girl burst into tears.The princess, who had crouched down to speak to her, continued chatting to the girl, who nodded her head and gave a small shrug as Kate patted her back.",
        "One woman in the crowd complimented Kate on the headpiece, by Jess Collett x Alexander McQueen, she wore for the coronation, telling her: “I loved your headpiece.”The item featured silver bullion, crystal and silver thread work three-dimensional leaf embroidery, and in response Kate touched the woman on the shoulder as if to say “thank you”.Before they left William told one group of well-wishers: “Enjoy the concert tonight.”The walkabout came shortly after Buckingham Palace issued the first public statement on behalf of Charles and Camilla since they were crowned.",
        "A Palace spokesman said the King and Queen were “profoundly grateful” for all those involved in organising the celebrations and ceremony, and the spectators who attended the day.",
        "“Their Majesties were deeply touched by the events of yesterday and profoundly grateful both to all those who helped to make it such a glorious occasion – and to the very many who turned out to show their support in such numbers in London and further afield,” he said.The King, Queen and royal family will join around 20,000 members of the public at the musical extravaganza.Heir to the throne William is to take to the stage to deliver a speech during the event in the grounds of Windsor Castle, with Kensington Palace sharing behind-the-scenes footage of the prince during rehearsals.The show, hosted by Downton Abbey and Paddington actor Hugh Bonneville, will see Hollywood star Tom Cruise, Dynasty actress Dame Joan Collins, adventurer Bear Grylls and singer Sir Tom Jones appear via video message.",
        "The series of pre-recorded sketches will reveal little-known facts about the monarch and include moments from beloved literary character Winnie the Pooh – seemingly echoing the famous moment Paddington Bear drank tea with the Queen during her Platinum Jubilee celebrations.There will also be performances by Paloma Faith, Olly Murs, veteran singer Steve Winwood – whose grandson Arthur Eliot was one of Camilla’s pages of honour – and Nicole Scherzinger of The Pussycat Dolls.",
        "Classical acts including Andrea Bocelli, Welsh bass-baritone Sir Bryn Terfel and Chinese pianist Lang Lang will perform too.The Royal Ballet, the Royal Opera, the Royal Shakespeare Company, the Royal College of Music and the Royal College of Art will come together for the first time to create a one-off performance featuring Sex Education and Doctor Who star Ncuti Gatwa and Olivier Award nominee Mei Mac.Thousands of street parties have been held across the country with people encouraged to come together for the Coronation Big Lunch.Prime Minister Rishi Sunak and his wife, Akshata Murty, hosted a lunch in Downing Street, inviting volunteers, Ukrainian refugees and youth group members.",
        "Meanwhile. Camilla asked for her coronation bouquet of English spring flowers to be placed on the Grave of the Unknown Warrior in the coronation church, Westminster Abbey.The simple posy, including auriculas, the late Queen’s favourite lily of the valley, and one of Charles’ favourites hellebores, by the King and Queen’s go-to florist, Shane Connolly, was laid at the memorial.Royal brides traditionally send their bouquets to be placed there the day after their weddings in a tradition started by the Queen Mother.Camilla did not carry the flowers on Saturday as it was a coronation not a wedding, the Palace said."
    ]
}