{
    "articleURL": "/sport/rugbyunion/article-12048171/SIR-CLIVE-WOODWARD-Glaring-mistake-not-appoint-female-coach-England-womens-team.html",
    "content": [
        "John Mitchell will take over as England women's head coach later this year Simon Middleton stepped down following the Six Nations triumph Sarah Hunter and Lou Meadows will be part of Mitchell's coaching staff The appointment of John Mitchell as head coach of the Red Roses is a huge missed opportunity by the RFU.",
        "They have not only let their women’s team down, but also women’s sport by not choosing a female successor to Simon Middleton. Once again, it shows the RFU’s lack of vision.I’m the longest-serving member of the International Olympic Committee’s Athletes’ Entourage Commission. A couple of years ago, I was asked to set up and lead a working party to improve the percentage of accredited female coaches at the summer and winter Olympics. It had fallen to below 10 per cent, which just isn’t acceptable.There were several reasons why women weren’t being appointed and it made me question why we have never had a female coach in charge of the England women’s rugby side.We identified multiple barriers which stopped women from reaching top coaching jobs: the fact that women were expected to adapt to the ‘old boys’ coaching culture, outdated stereotypes that only high-performance coaches were male, and a lack of opportunity. The list went on and on.",
        "What was obvious was that across Olympic sports, there is an unconscious bias towards men for the big coaching roles. That’s because the ones doing the appointing are, with a few exceptions, male.This is what has happened with the RFU’s staggering decision to go for Mitchell, a call that everyone involved with English rugby should be very disappointed with.",
        "The RFU have done so much right with women’s rugby, including being first to hand out professional contracts. There’s been success on the pitch and off it too with a world-record crowd watching last weekend’s Grand Slam win over France. But just when you want to applaud the RFU, they score an own goal.There should have been two criteria for the Red Roses top job. First, the appointee must be female. Second, that person would, ideally, be English. There are plenty of good female coaches in England right now, Giselle Mather at Ealing springs to mind. Instead, they’ve gone for Mitchell. He has lots of international experience, but when was the last time he was a head coach? It smacks of jobs for the boys, a decision made by male figures at the RFU. This would not have happened at other organisations.Baroness Sue Campbell has rightly received plenty of praise for her decision to appoint Sarina Wiegman as England women’s football boss. Women’s football has exploded in England on the back of the Lionesses winning the Euros and there is no doubt that Wiegman has been responsible for that.If Campbell had been working at the RFU, there would have been absolutely no chance she’d have chosen Mitchell! Lots of organisations today talk about equality and diversity, the RFU among them, but when it came down to actions — not words — they’ve been found wanting.",
        "No doubt those responsible will say they have female representation as part of Mitchell’s coaching staff. Former captain Sarah Hunter — a true England great — will be part of the set-up and so will another woman in Lou Meadows. But, the game-changing role here is head coach and Mitchell is in that position.I wish Hunter and Meadows could have been in a position to turn down their roles but I understand why they haven’t, given the situation women find themselves in elite sport.England have lost the last two World Cup finals to New Zealand and Mitchell’s challenge will be to go one better and deliver global glory on home soil in 2025.Even if that happens there will still be many who will lament the fact a female head coach won’t be lifting the trophy. What a massive missed opportunity."
    ]
}