{
    "articleURL": "/wires/reuters/article-12051871/Emerging-sides-meet-Orlando-City-visit-CF-Montreal.html",
    "content": [
        "Coming off a convincing home victory where they were relentless on offense and defense, Orlando City will head north Saturday for a road game against CF Montreal.",
        "Orlando City defeated the Los Angeles Galaxy 2-0 last Saturday as forward Ercan Kara had a goal and assist, both firsts of the year for him. The win continued a pattern of alternating wins and losses.\"It's important to get consistency,\" Orlando City coach Oscar Pareja said. \"I answered last week as well, but this season is just starting. Teams are looking to, just trying to settle things. It's early in the season, only the first third of the season, and this year we're looking for that consistency because we want to be in the top places. In order to do that, we have to get results.\"Orlando City (4-3-2, 14 points) have scored 10 goals in nine games, tied for the fourth fewest in the Eastern Conference. Facundo Torres scored the second goal Saturday, only his second of the season. SuperDraft No. 6 overall pick Duncan McGuire leads the team with three goals.CF Montreal (3-6-0, 9 points) picked up their first road win with a 2-0 victory over Sporting Kansas City last Saturday.Midfielder Bryce Duke scored his first goal since being acquired from Inter Miami just ahead of the MLS transfer deadline in April to give Montreal the lead. Mathieu Choiniere assisted Duke's goal and then added a second in first-half stoppage time.",
        "\"The hard work is starting to pay off and everyone is putting in a great effort,\" Montreal coach Hernan Losada said. \"Having the ball isn't the only thing that matters, the quality of your possession is much more important.\"Montreal has won consecutive games by shutout. The team hasn't kept opponents scoreless in three straight games in league play since April 2019.Goalkeeper Jonathan Sirois made 10 saves across those two shutouts and has started every game except the season opener, when he replaced James Pantemis due to injury.--Field Level Media"
    ]
}