{
    "articleURL": "/tvshowbiz/article-12041311/Amazon-reveals-plans-revive-iconic-BBC-celebrity-panel-show.html",
    "content": [
        "A beloved BBC panel show is set to return less than a year after it was sensationally axed, after being picked up by Amazon.",
        "Mock The Week aired for 21 series before bosse announced they were scrapping the show to 'make room for other programmes' on the channel last November.The programme is now being given a run in the U.S. and will receive a new lease of life after the streaming service bought the rights to the show.The all new Mock The Week will air on the free streaming platform, Amazon Freevee, when it debuts on the service next year.  Comedian and former host of The Daily Show, Trevor Noah, has been confirmed to executive produce the show but no host has been announced yet.",
        "Although a host for the remake is yet to be announced, comedian and former host of The Daily Show, Trevor Noah, has been confirmed to executive produce the reboot.In the hopes of making it as successful as the BBC version, the shows creator Dan Patterson will be involved in making the reboot. Discussing his involvement in the show, Trevor said: 'Two things I'm most passionate about in life are paying my landlord and making people laugh.'We could all use a little bit more laughter as we continue to navigate today's crazy world. By bringing Mock The Week to America with the talented Dan Patterson, I'm looking forward to doing just that.'",
        "Mock The Week was cancelled after 17 years on air in order to 'create room for new shows', it was announced in August.The comedy series hosted by Dara O'Briain, first aired on BBC Two in 2005.Viewers have seen more than 200 episodes over 21 series' and a variety of personalities on the panel including Hugh Dennis, Chris Addison, Frankie Boyle, Rory Bremner and Russell Howard. ",
        "The panel show sees two teams of three compete to make the best jokes about current affairs but Dara confirmed that the news was already 'silly.'The host said: 'That's it folks, the UK has finally run out of news. The storylines were getting crazier and crazier - global pandemics, divorce from Europe, novelty short-term prime ministers. It couldn't go on.'And so, regretfully, we are closing the doors on Dara and Hugh's Academy for Baby Comedians. We just couldn't be more silly than the news was already.'",
        "He concluded: 'Huge thanks to all our guests over the years, so many of whom went on to huge successes of their own, and never write or call. It was a joy!'A statement by the BBC confirmed: 'The next series of Mock The Week will be the last, we are really proud of the show but after 21 series we have taken the difficult decision in order to create room for new shows.",
        "'We would like to thank Angst Productions, host Dara O'Briain, panellist Hugh Dennis and all the guest comedians involved in the show across the 21 series.'",
        "Angst Productions, the company behind the programme, said: 'We're naturally hugely disappointed that Mock The Week is coming to an end and hope that we will be able to resurface somewhere some day in the future.'However, the last 17 years on BBC Two have been an absolute blast. It's been a great privilege to work closely with scores of truly incredible performers and we'd also like to take the opportunity to thank the BBC and all our many fans around the world for their support over the years.'The series was created by Dan Patterson and Mark Leveson, the duo behind comedy improvisation show Whose Line Is It Anyway?, which ran in the UK before becoming a hit series in the United States."
    ]
}