{
    "articleURL": "/wires/reuters/article-12044405/US-Senate-repeals-solar-panel-tariff-suspension-Biden-expected-veto.html",
    "content": [
        "By Nichola Groom and Moira Warburton",
        "WASHINGTON, May 3 (Reuters) - The U.S. Senate on Wednesday voted to repeal President Joe Biden's suspension of tariffs on solar panels from four Southeast Asian nations, a measure aimed at supporting the small domestic manufacturing industry.Biden has vowed to veto the legislation, which passed the House of Representatives last week. It is not expected to have enough support to override a presidential veto.The United States has been trying to strike a tricky balance between supporting the creation of a domestic solar supply chain while keeping cheap imports flowing to projects needed to move the U.S. away from its reliance on fossil fuels.Biden, a Democrat, waived tariffs on solar imports from Malaysia, Cambodia, Thailand and Vietnam for two years last June after solar project developers said they would increase their costs and freeze development.Panels from the four nations, which host manufacturing facilities owned by Chinese companies, account for about 80% of U.S. supplies. Domestic producers say they cannot compete with the cheap products made overseas.The House resolution that passed the Senate was introduced under the Congressional Review Act (CRA), a law that allows Congress to reverse federal agency rules. A CRA bill expires if it is not passed within 60 days of its introduction.Proponents of the measure say the two-year suspension allows Chinese producers to avoid U.S. trade laws and prolongs an unfavorable market for domestic businesses.",
        "\"Developing our solar manufacturing industry is crucial to combating climate change, but we can't do it if we don't enforce the trade laws on the books,\" Democratic Senator Tammy Baldwin said on Wednesday.Top clean energy trade groups had called on members of Congress to oppose the measure. The Solar Energy Industries Association projected that its passage would result in cancellation of 14% of the industry's planned new capacity this year and the loss of $4.2 billion in investment.Repealing the suspension would \"deal a devastating blow to the American solar industry, which will kill jobs, raise energy costs, and decrease our ability to achieve clean energy independence,\" a group of senators led by Democratic Senator Jacky Rosen wrote in an open letter published on Tuesday.The final Senate vote was 56-41, with nine Democrats voting in favor. (Reporting by Moira Warburton in Washington; Editing by Leslie Adler and Jamie Freed)"
    ]
}