{
    "articleURL": "/sport/football/article-12056645/Hearts-0-2-Celtic-Ange-Postecoglous-secure-Scottish-Premiership-titles.html",
    "content": [
        "Hearts were reduced to 10 men after Alex Cochrane saw red in the first halfCeltic struck twice after the break through Kyogo Furuhashi and Oh Hyeon-GyuWin secures back-to-back Scottish Premierships for Ange Postecoglou's sideIt felt only fitting and right that the decisive, title-winning breakthrough should come from the boot of Kyogo Furuhashi. Celtic’s 30-goal talisman has come to define the era of Ange Postecoglou.",
        "Of all the imaginative, value-for-money signings made by the Australian, the Japanese striker has proven the most effective. The player who spearheads their dominance of the Scottish game.Needing a single win to secure their eleventh Scottish Premiership title in 12 years the Parkhead side were never quite at their flowing best here. Celebrating with the 1303 fans in a small corner of Tynecastle at time up, it barely mattered.As so often Furuhashi made the difference, nicking across a defender to score his seventh goal in nine wins over Hearts.The last time the Tynecastle side beat Postecoglou’s team was the opening day of season 2021/22, when the £4.5million signing was introduced to teammates in the team hotel before kick-off. How sick Hearts must be of the sight of him now.",
        "His last act of the game, Kyogo made way for Hyenongyu Oh seconds later. The South Korean tucked away the goal which secured their 53rd Scottish league title with four games to play.The Parkhead side now travel to Ibrox for the final Old Firm meeting of the season next weekend determined to add insult to the injury of their bitter rivals. Already holders of the Viaplay Cup and league championship, victory over Inverness in the Scottish Cup Final would secure a domestic treble; their fifth in seven years.",
        "Jousting with Aberdeen – and now their city rivals Hibs – for third in the league, this was a game of two halves for Steven Naismith’s Hearts.A charged, frantic affair was changed beyond recognition by a debatable red card for Hearts defender Alex Cochrane before half-time. While the rules – and their application by VAR - might be to not to everyone’s taste, they remain the rules nonetheless.For 43 minutes Hearts did everything but score. The complexion of the game altered completely when Daizen maeda, chasing a long ball into the home penalty area, was pulled back by the out-paced left-back.Awarding the free-kick, referee Nick Walsh was content – at first – to settle for a yellow card. After a word of advice from VAR official Willie Collum the referee made the now familiar trot towards the pitchside monitor. Everyone knew what came next.",
        "The yellow card cancelled and upgraded to a red, the only saving grace for Hearts was the offside flag when Anthony Ralston strayed offside before turning the free-kick into the net from close range.By necessity the red card forced Steven Naismith to make a change.Stephen Kingsley arrived to shore up the backline, with Yutaro Oda. A crying shame for Hearts, Oda had been the best Japanese player on the pitch. In that instant much of the fire went from the home team. The spirit, the running, the guile they showed in the early stages diluted.",
        "HEARTS (4-2-3-1): Clark 6; Hill 7, Rowles 6, Sibbick 6, Cochrane 4; Haring 5, Devlin 6 (Kio 74) ; McKay 5 5 (Grant 81 1), Ginnelly 5 (Humphreys 81 1), Oda 5 (Kingsley 43 4); Shankland 5Subs: Stewart, Atkinson, Halliday, Forrest, TaitBooked: N/ARed Card: Cochrane 43CELTIC (4-3-3): Hart 6; Ralston 6, Starfelt 7, Kobayashi 7, Taylor 7; McGregor 7, Hatate 5 (Iwata 86) , O’Riley 5 (Mooy 70 4) ; Jota 6 (Haksabanovic 79 2), Furuhashi 6 (Oh 70 4) , Maeda 5 (Abada 79 3).Subs: Bain,, Turnbull, Bernabei, LawalBooked: O’RileyReferee: Nick WalshAttendance: 18000Star Man: Callum McGregor (Celtic)",
        "Ange Postecoglou’s first league game as Celtic manager ended in a 2-1 defeat at this temple of football. Since then the champions have now won their last nine games against Hearts. Handed the manager’s job until the end of the season, Hibs breathing his neck in the league, Steven Naismith faced the biggest test of coaching credentials so far.The red card was a bitter pill after a first half when he threatened to pass his biggest managerial test so far with flying colours. Employing a high press, the home team aggressively showed no sign of rolling out the welcoming mat for a party,",
        "Chased Celtic down blind alleys the Jambos were relentless in their tackling. Players in green and white looked visibly discomfited.The loss of Cameron Carter-Vickers provided an opportunity for Celtic’s January signing Yuki Kobayashi to forge a new central defender partnership alongside Carl Starfelt. You could hardly blame Steve Naismith for targetting the new bhoy ruthlessly in the opening stages. The tactic almost worked.Making his 100th appearance for Celtic Joe Hart tipped a Lawrence Shankland header over the crossbar after two minutes. While the effort was offside, it felt like a declaration of intent.Making their voices heard over the 1303 Celtic fans herded into a small section of Tynecastle, Hearts supporters sensed something in the air when Kye Rowles skimmed the outside of the upright with a skidding low shot after Celtic defended a corner unconvincingly.It took 25 minutes for Celtic to settle. Even then they never looked liable to blow their opponents away, as they had so often as this old ground. Captain Callum McGregor’s driving run finally got the Parkhead side up the pitch. A long range Hatate drive never troubled Zander Clark.Until the offside flag rightly denied Ralston the opener from a McGregor knockdown the Hearts keeper had an unexpectedly quiet afternoon. With Cochrane gone and Hearts down to ten men the second half threatened to be a more testing experience. Or not, as the case may be.",
        "It’s actually hard to remember a Celtic display as lacking in tempo as this. A performance so lacking in attacking menace.Yet, all it takes with Postecoglou’s side is one chance. One fleeting moment of predatory finishing from Kyogo Furuhashi to transform the complexion of a game completely.After 67 minutes the talisman claimed his goal against Hearts. As so often it came from a darting run across the face of goal, the top scorer flicking Hatate’s weighted cross past a sprawling Zander Clark after a perfectly weighted ball over the top from Callum McGregor.The spit and fire gone from Tynecastle the final minutes were played out like a training game. There was no stopping Celtic now.With 10 minutes to play any lingering doubt was removed by two of Postecoglou’s substitutes. Similar to the first the goal stemmed, this time, from the left. Aaron Mooy slotted the ball low across the face of goal for Oh Hyenongyu to turn the ball into the net for his fourth Celtic goal."
    ]
}