{
    "articleURL": "/wires/ap/article-12041947/Don-Giovanni-unredeemable-Ivo-van-Hoves-US-opera-debut.html",
    "content": [
        "When Ivo van Hove first discussed his \"very dark\" vision of Mozart´s \"Don Giovanni\" with his cast at the Metropolitan Opera, the leading man had doubts.",
        "\"He said, `But is there no hope?´\" the Belgian director recalled of his conversation with Peter Mattei.\"And I said, `Yes, but only when you´re dead,`\" van Hove added. \"Once you´re dead, then the world can start anew.\"He said Mattei \"listened to it and absorbed it, and then he started to work with it. He´s that kind of opera singer.\"The Swedish baritone has sung the title role all over the world (including nearly 40 times at the Met), often in productions that portrayed the Don as a charming albeit amoral rake.Van Hove is having none of that.",
        "\"There´s such a misunderstanding that was created in the 19th century that Don Giovanni is a romantic hero,\" he said. \"But in the first seven minutes of the opera you have a rape attempt and a murder happening. When a woman screams for her life and tries to escape, there´s no fun, no joy about it.\"The opera opens with the Don attempting to force himself on Donna Anna and then killing her father, the Commendatore. The libretto calls for the older man to die in a duel, but van Hove turns the Don into a cold-blooded killer who casually shoots his opponent.\"The original title was `Il dissoluto punito ossia il Don Giovanni,´ (The Libertine Punished, or Don Giovanni),\" van Hove pointed out. \"Mozart couldn´t have been clearer about his intention.\"",
        "Depicting the Don as a \"sociopath\" may surprise Met audiences who are used to a somewhat more appealing portrayal, but general manager Peter Gelb thinks it will resonate.\"His confident take on the unredeemable Giovanni seems just right for the times in which we live,\" Gelb said.The director allows just one hint of something better in the Don´s nature, and that´s when he encounters the peasant girl Zerlina and woos her in the famous duet \"La ci darem la mano\" (\"There you will give me your hand.\")\"There´s a beautiful scene where he gets intimate with her,\" van Hove said. \"I have directed it as tender, not like a rape. It´s a moment you think, oh, this could be a man who could be in a normal relationship with a woman.\"But that also goes wrong pretty quickly,\" he said. \"He cannot hold back his real urge, like a predator.\"Set and lighting designer Jan Versweyveld - van Hove´s partner and longtime collaborator - has framed the action on a street shadowed by buildings inspired by brutalist architecture.\"The houses have very rough skin, and they are drained of color,\" van Hove said. \"It´s kind of as if you enter into a very dark place which reminds you perhaps of hell.\"",
        "A more explicit version of hell appears at the opera´s climax. Van Hove has reserved his most spectacular effect for the scene in which Don Giovanni is condemned to an eternity of agony by the ghost of the Commendatore.\"It´s kind of a surprise, I think,\" he said. \"Let´s not spoil it.\"The production, which originated in Paris in 2019, marks van Hove´s U.S. debut directing opera, but he is well-known to New York theater audiences for productions such as Arthur Miller´s \"The Crucible\" and \"A View from the Bridge,\" as well as the musical \"West Side Story.\"If the \"Don Giovanni\" production seems a bit conservative for a man known for his inventive use of video and projections, his next Met assignment promises to be different. He´s opening the new season in September with the company premiere of Jake Heggie´s \"Dead Man Walking.\"Gelb said that production \"utilizes Ivo´s signature live camera work, so in that sense it will more closely resemble some of his other stage works.\"\"Don Giovanni\" opens May 5 for eight performances, with the May 20 matinee to be broadcast in movie theaters live in HD. Besides Mattei, the singers include sopranos Federica Lombardi as Donna Anna, Ana Maria Martinez as Donna Elvira and Ying Fang as Zerlina. Tenor Ben Bliss is Don Ottavio, bass-baritone Adam Plachetka is Leporello, bass-baritone Alfred Walker is Masetto and bass Alexander Tsymbalyuk is the Commendatore.",
        "The orchestra is conducted by Nathalie Stutzmann, who is making her Met debut. She is also conducting a new production of another Mozart opera, \"Die Zauberflöte,\" which opens just two weeks after \"Don Giovanni.\""
    ]
}