{
    "articleURL": "/tvshowbiz/article-12053633/Halsey-treats-new-Chanel-shopping-LA-announcing-split-partner.html",
    "content": [
        "Halsey was seen for the first time since announcing her split from her baby daddy Alev Aydin after five years of dating last week.",
        "On Wednesday, the singer, 28 - who uses she/they pronouns - treated herself to some retail therapy in Los Angeles.Specifically, the Bad At Love hitmaker popped into a nearby Chanel store to add some new additions to her designer wardrobe.For their shopping trip, Halsey showed off their legs in an oversized white T-shirt dress and stylish knee-high black boots.She layered up with a purple denim jacket and had a white heart-shaped Chanel purse slung across her body.",
        "The singer-songwriter's cropped brunette hair was swept off their face with a pair of sunglasses.Halsey appeared makeup-free and kept accessories to a minimum.They were captured exiting the Chanel store with two black shopping bags in one hand.She also juggled a Celsius drink, her iPhone and another object in the same hand. ",
        "She returned to social media last Wednesday following news of her and Alev's breakup.They shared an eight-photo slideshow to Instagram that included several portraits of themself along with some artistic imagery.The post kicked off with a smoldering selfie taken in the driver's seat of their car.She posed with one hand against her glam visage and her lips pursed.Another photo showed Halsey posing braless in a white bathtub with their legs hanging over the side.She had on just a white spaghetti strap tank top, white knee socks and black ballet flats that had straps with silver rivets.",
        "In another vehicle selfie, Halsey photographed their face up-close to showcase their flawless, grunge-inspired makeup.They gazed out of the window and kept their mouth slightly agape for the front-camera shot.Halsey threw in a photo that showed the bottom of her white linen sundress and her legs.The remainder of the slideshow consisted of random photos, one of which appeared to showcase a painting done by the star.There was also a close-up image of a piece of musical equipment, a television sitting beside religious wall hangings and a clay figurine of a naked woman in a bathtub.  They captioned the post with a bathtub emoji.Halsey is said to have 'amicably split' from Alev. She filed legal documents for full physical custody of their 21-month-old son Ender Ridley Aydin, but she wants to split legal joint custody with the Turkish 40-year-old, according to The Blast.Halsey (born Ashley Frangipane) requested that Alev have 'reasonable visitation' as they begin to establish a legal custody schedule for their curly-haired toddler.The New Jersey native - who is reportedly worth $20M - wants to split the costs of establishing paternity and attorney fees with Aydin, but there was no word on child support.The Small Shots co-creator's most recent IMDb-credited gig was directing their So Good music video last June. ",
        "Halsey - who boasts 70M social media followers - last posted about Alev on Valentine's Day when she shared an Instagram snap of them kissing.",
        "But the Die 4 Me singer hasn't been publicly seen with Aydin since their taco date at Tere's Mexican Grill in Los Angeles on October 27.Halsey famously met the HipMen: Los Angeles director in 2018 when he was hired to write their Sony Pictures biopic which never materialized.Before Alev, the biracial bisexual belter previously romanced Evan Peters, Yungblud, G-Eazy, Machine Gun Kelly, and Lido.On April 14, Halsey announced she'll be performing three summer concerts (June 24 in Florida, June 30 in Indiana, and July 2 in California) to benefit the global LGBTQ+ community.The About-Face Beauty founder also has upcoming acting roles in Ti West's 1985-set three-quel MaXXXine and Tony Tost's indie action crime drama Americana."
    ]
}