{
    "articleURL": "/wires/reuters/article-12045797/Ukraine-says-Russian-drones-downed-Kyiv-Odesa-university-campus-hit.html",
    "content": [
        "May 4 (Reuters) - Russia fired two dozen combat drones at Ukraine early on Thursday, striking a university campus in the Black Sea city of Odesa and attacking the capital Kyiv for the third time in four days.",
        "Russia has stepped up attacks as Ukraine prepares for a counteroffensive to try to retake Russian-occupied land in the south and east. Russian shelling in the frontline southern region of Kherson killed at least 23 civilians on Wednesday.Air Force Colonel Yuriy Ihnat said Russia's military was using \"kamikaze\" drones, which fly towards their target before blowing up, to weaken Ukrainian air defences.\"They know the (drones) will be destroyed, we are currently destroying 80%, that's how they are exhausting our air defence so much, forcing them to expose their positions,\" he said on television.No casualties were reported in the overnight strikes.In Kyiv, the city administration said that missiles, probably ballistic missiles, had also been used in the attack but were shot down along with all the drones over the capital.Ballistic missiles are difficult to shoot down, and their downing could indicate Ukraine used sophisticated Western-supplied air defence systems against them.Kyiv authorities said \"enemy aerial objects\" had been downed over three districts in the capital's centre and that debris had fallen around 10 buildings.\"As a result of the falling debris, parked cars ... and the road's surface were partially damaged,\" said Serhiy Popko, head of the city's military administration.In total, air defences shot down 18 of 24 \"kamikaze\" drones in the pre-dawn attack, officials said. Of 15 drones fired at Odesa, 12 were downed but three struck a university campus, the southern military command said.",
        "Shelling in the Donetsk region damaged a power station owned by electricity company DTEK Energo, but no casualties were reported, DTEK and the Energy Ministry said. (Reporting by Aleksandar Vasovic and Pavel Polityuk; Writing by Tom Balmforth; Editing by Timothy Heritage)"
    ]
}