{
    "articleURL": "/femail/article-12060675/Princess-Anne-King-Charles-III-portrait-significant.html",
    "content": [
        "Buckingham Palace portraits show closeness of King and his sister, expert saysREAD MORE: For all the latest Royal news, pictures and videos click hereThe Princess Royal being placed next to her brother in the King's latest portrait is a 'most significant' signal that he will be relying on his sister as he begins his reign, a royal expert has said.",
        "The photograph, which shows Charles, 74, and Queen Camilla, 75, alongside other senior members of the royal family sees Princess Anne, 72, smiling next to the newly-crowned monarch as she dons her military uniform - and he, his ornate Robe of Estate.The positioning is 'no accident', public relations pro Richard Fitzwilliams told MailOnline, explaining that the gesture shows how much Charles 'appreciates' his sister - often dubbed 'the hardest working royal'.'Anne's been at it a long long time, she knows the ropes,' he explained.'The King knows how popular she is, so it's no accident his sister is next door to him.",
        "'It shows much how much he appreciates her and how much he will be relying on her, she is extremely popular and has a high profile.'People know who she is and respect her, that's very important.'Richard added that the portrait of the working royals signified 'the people who the King can depend on'.'The absentees, everyone knows the reasons for that,' he continued.Noting that the group portrait included only four people under the age of 70, Richard said that this will be a 'challenge' for the King in the future, who will need to decide 'how slimmed down he wants the monarchy to be'.Of the King's solo portrait, he said: 'This one is a strong forceful portrait of a monarch who knows his own mind and is very experienced'.",
        "Queen Camilla looked 'more relaxed and comfortable' wearing the crown in her solo portrait than she did in Westminster Abbey, he added.It is perhaps no surprise that Charles wanted Anne by his side during the weekend's Coronation festivities, as the pair are known to have been close since their childhood.",
        "Following the death of their mother - the late Her Majesty - in September, Anne had emerged as a key confidante to the new King.Alongside his mother, she has been a mainstay in his life – and insiders have in recent months said they are closer than ever.The brother and sister were born just 21 months apart and grew up the closest of the siblings – both were teenagers by the time their parents’ third child Prince Andrew started primary school.Inevitably, given the Royal Family’s protected environment, they forged a special bond above and beyond those that followed with their younger brothers.They are known to revel in each other’s company, sharing the same sense of humour, love of the countryside and affection for all things Scottish.Yet, in adulthood, Anne has also respected their different roles and her elder brother’s constitutional destiny.",
        "The brother-sister banter common in so many families has, in her case, been underpinned by a quiet respect.",
        "Their relationship has been compared to that of Queen Elizabeth II with her younger sister Princess Margaret.Now Charles, as was once the case with his mother, is an inexperienced Monarch in need of a trusted ear, someone with whom to share confidences – and, increasingly, seek advice.Neither the King nor his sister would surely have wished to be the only siblings present at the bedside of their mother as she passed away at Balmoral Castle, but it is understood Andrew and Edward, travelling in a car driven by Prince William, were not able to reach the castle in time.The fact that Charles and his sister were the only siblings present meant they could briefly mourn privately together, further strengthening their unique relationship.It comes after a weekend of national celebrations which saw up to two million people line The Mall on Saturday, May 6 for the King's Coronation, a day full of pomp and pageantry.Royal well-wishers had travelled from across the UK and the world for the historic occasion, with the most die-hard fans setting up camp on The Mall days before official celebrations began in order to secure front-row positions.On Saturday, swelling crowds began to emerge in central London from around 5am for their chance to glimpse the King and Queen on the procession route - with crowds either side of The Mall around 15-deep by 7am.",
        "A 'ring of steel' had been placed around the capital, with a 11,500 police officers on duty while a further 10,000 military personnel took part in the ceremony.",
        "Waving their Union Jack flags, fans who managed to bag a prime spot at the front of the metal barriers erupted in applause as King Charles and Queen Camilla travelled in the Diamond Jubilee coach to Westminster Abbey.In true British fashion, the millions who flocked to the capital were undeterred by the British weather, putting up their brollies and donning raincoats as they celebrated. Pomp and pageantry were to the fore, with the Armed Forces staging the biggest ceremonial military operation since Queen Elizabeth's 1953 coronation, culminating in a 4,000-strong coronation procession of servicemen and women from across the globe, that wound its way through the heart of the capital. After the royal procession from Buckingham Palace, King Charles and Queen Camilla were anointed at Westminster Abbey in front of 2,300 attendees including world leaders, royal dignitaries, celebrities and everyday heroes. Global popstars Lionel Richie and Katy Perry were part of the congregation, as was French President Emmanuel Macron, actresses Dame Judi Dench and Oscar-winner Dame Emma Thompson, presenters Ant and Dec and King Willem-Alexander and Queen Maxima of the Netherlands. ",
        "During the service, which saw the first-ever Welsh language performance sang at a Coronation by Sir Bryn Terfel, Charles pledged to be a 'blessing' to people of 'every faith and conviction', and serve his millions of subjects in Britain and around the globe. ",
        "The historic moment came a few minutes past midday, when the Archbishop of Canterbury Justin Welby placed St Edward's Crown on Charles' head and he became the 40th reigning sovereign to be crowned at Westminster Abbey, the nation's coronation church since 1066. The Coronation was a spiritual and deeply personal event for the King, a 'committed Anglican Christian', who was anointed, seen kneeling at the abbey's high altar and received homage from his son and heir, the Prince of Wales.William's interaction with his father, where he touched St Edward's Crown then kissed the King on the right cheek, appeared a poignant moment for the head of state.As William knelt before Charles, who held his son's hand between his palms, the future monarch said: 'I, William, Prince of Wales, pledge my loyalty to you and faith and truth I will bear unto you, as your liege man of life and limb. So help me God.'The King's estranged son the Duke of Sussex was among the congregation, sitting two rows behind his brother with the Duke of York's family, and he was seen intently watching the crowning.And when a few minutes later the congregation was invited pay homage to the new monarch, Harry spoke, along with the other royals around him, the words: 'God save King Charles. Long live King Charles. May the King live forever.'",
        "Charles delivered a King's Prayer, the first time a monarch has spoken words to God aloud during a coronation, and he prayed to be a 'blessing' to people of 'every faith and conviction'.In his sermon the archbishop told the nation's new monarch 'we crown a King to serve'.Mr Welby spoke of how 'Jesus Christ was anointed not to be served, but to serve' - adding: 'The weight of the task given you today, Your Majesties, is only bearable by the spirit of God.'The ceremony had five main elements: the Recognition; the Oath; the Anointing; the Investiture and Crowning; and the Enthronement and Homage, as well as the Queen's coronation."
    ]
}