{
    "articleURL": "/news/article-12057911/Queensland-roundabout-rule-divides-Aussie-motorists.html",
    "content": [
        "A simple traffic question about indicating at roundabouts has baffled Australian motorists and sparked online debate.",
        "The Royal Automobile Club of Queensland sent social media into meltdown with its weekly Facebook quiz testing Australians' knowledge of the road rules:The blue car is approaching the roundabout and intending to take the third exit - which indicators should it use?a) No indicator on approach and driving in the roundabout, right indicator when leavingb) Right indicator on approach and driving in the roundabout, left indicator when leavingc) Right indicator on approach and driving in the roundabout, no indicator when leavingd) No indicator on approach, right indicator when in the roundabout and left when leaving.",
        "The correct answer is of course B.If the driver is leaving the roundabout more than halfway around it, the driver must give a right change of direction signal on approach to the roundabout and while driving on the roundabout, and a left change of direction signal when leaving the roundabout.While the majority who answered were correct, many others who live interstate were stumped by the answer.' C...because if it was a normal cross intersection, you would only indicate Right Turn &amp; that doesn't confuse anyone. If I see that right blinker going on a roundabout, I know that you're either turning right or doing a U-turn. Simple,' one man wrote.",
        "A driving school added: 'When I read Vic road rules it doesn't actually say you are required to put your left indicator on when exiting. The rules say 'if possible '. Other states and territories must use your left indicator as does the ARR.A third wrote: 'Is the law different in Queensland? In the ACT it is indicate left when exiting 'if practicable'.'",
        "The question also sparked furious debate about motorists' use of indicators.'No indicator at all seems to be the rule where I live,' one woman wrote.Another added: 'So many drivers do not know when and where to indicate or even get in the right lane!'The RACQ runs a weekly quiz on its Facebook page to educate motorists so they can become safer road users. "
    ]
}