{
    "articleURL": "/wires/ap/article-12044491/Muncys-walk-slam-gives-Dodgers-10-6-win-Phillies.html",
    "content": [
        "LOS ANGELES (AP) - Max Muncy hit a game-ending grand slam and the Los Angeles Dodgers rallied from an early five-run deficit to beat the Philadelphia Phillies 10-6 on Wednesday, extending their winning streak to a season-high six games.",
        "Bryce Harper doubled to start a four-run third inning and reached base five times in his second game of the season for the Phillies, who lost their fourth straight.Los Angeles swept the three-game series, outscoring the defending NL champions 36-11 and reaching double digits in every game.\"The makeup is really starting to show itself,\" said Dodgers manager Dave Roberts, whose team entered the six-game homestand with a .500 record. \"I really love the culture of the guys. As the season has started to progress, they´re absolutely willing to concede playing time or at-bats or innings for their teammates. ... Just guys playing for each other, so for me, it´s coming together the way it´s supposed to.\"Pinch-hitter Austin Barnes gave the Dodgers a 6-5 lead with a two-run single in the eighth, but Philadelphia tied it in the ninth. Harper singled, Nick Castellanos walked and Bryson Stott delivered an RBI single against Brusdar Graterol (1-1).Chris Taylor singled leading off the bottom half against former Dodgers reliever Craig Kimbrel (1-1) and stole second. Mookie Betts struck out before Freddie Freeman was walked intentionally. Will Smith drew a walk that loaded the bases, and Muncy launched the next pitch into the right-field seats for his major league-leading 12th home run.",
        "\"That´s really all it was, trying to hit something hard and not wait around,\" said Muncy, in the midst of a revival after some inconsistencies in 2022 following an elbow injury. \"There´s no point waiting to see a pitch when you´re in that situation, so the first pitch you get up in the zone, let it rip.\"Dodgers rookie Miguel Vargas had a two-run homer and Gavin Stone gave up five runs - four earned - on eight hits over four innings in his big league debut.Aaron Nola pitched six solid innings for the Phillies, who completed a 2-4 road trip. They took two of three at Houston in a World Series rematch.After he went 0 for 4 with three strikeouts Tuesday in his return from Tommy John surgery, Harper was 3 for 3 with two walks. But the Phillies collapsed after building a big early lead.\"That can´t happen,\" Harper said. \"We just gave that game away. That cannot happen. With the way we want to do it this year and the way we want to play this year, every year, that can´t happen. That´s a really good team over there, but a 5-1 game ... we´ve got to do better. We´ve got to be better.\"Harper's double in the third was followed by an RBI double from Castellanos for a 2-0 lead. Philadelphia scored three more times in the inning on RBI singles by Alec Bohm, Edmundo Sosa and Garrett Stubbs, who bunted toward third to reach base.",
        "The Dodgers got on the scoreboard in the bottom half with an RBI single from Betts. In the fourth, rookie James Outman had a one-out double and Vargas followed with his second homer of the season.Los Angeles pulled to 5-4 on a sacrifice fly from Freeman in the seventh.SIXTH SENSEStone was effectively dropped into the Dodgers´ rotation as a sixth starter for the week. The move allowed them to adjust their rotation for an upcoming three-game series at rival San Diego.Clayton Kershaw will stay on regular rest and pitch the series opener Friday, with Dustin May pushed back to Saturday from his scheduled start Wednesday, giving him additional rest after a career-high 104 pitches last Friday.A day off Thursday will keep lefty Julio Urías on regular rest Sunday, and right-hander Noah Syndergaard will be moved into next week´s series at Milwaukee.TRAINER'S ROOMPhillies: LHP Ranger Suárez (elbow) is scheduled to make another rehab start Sunday and could be ready to return to the rotation next week, with LHP Matt Strahm then expected to move back into the bullpen. ... RHP Nick Nelson (hamstring) is set for another rehab outing Sunday.UP NEXTPhillies: RHP Zack Wheeler (3-1, 3.86 ERA) starts Friday´s series opener at home against Boston.",
        "Dodgers: Kershaw (5-1, 1.89 ERA), the NL pitcher of the month for April, goes Friday in San Diego.___AP MLB: https://apnews.com/hub/MLB and https://twitter.com/AP_Sports"
    ]
}