{
    "articleURL": "/sport/football/article-12046349/Roma-willing-sell-Tammy-Abraham-40m-amid-Man-United-Spurs-PSG-interest.html",
    "content": [
        "Tammy Abraham left the Premier League in 2021 after being sold by Chelsea The Roma star has been the subject of scouting missions from several  clubsMan United are keeping tabs on Roma's Abraham as an alternative to Harry KaneRoma are willing to listen to offers for striker Tammy Abraham just two years after his arrival from Chelsea, according to reports in Italy. ",
        "The English forward flourished in his first term in the Italian capital, netting 27 times in 53 appearances in 2021-22, drawing the eye of several European clubs including Manchester United. However, a dip in form this term has seen him notch just nine strikes all season, and the Serie A outlet are now thought to be willing to let him go. Jose Mourinho's side are however set to hold out for a fee of around £39.5million, having purchased him from the Blues for around £35m in 2021. The 25-year-old himself acknowledged back in November that there has been a drop in output this term, but has attributed it to a lack of 'confidence' despite a stellar first term in Serie A.",
        "'I know I haven't been the real me, I know I haven't been playing the best I can be, but I am human at the end of the day,' he revealed.'I've been low in confidence, but today I had to show the fans I'm still me and I am still willing to fight for the team and do as much as I can for the team.'We have one more game to go before the break and after the break, you will see a better and stronger me.'His ninth - and most recent - goal for the Giallorossi this term came in the 1-1 draw with AC Milan in late April, and Italian outlet Calciomercato report that it came under the watchful eye of a number of clubs. ",
        "Scouts from Manchester United, Tottenham and PSG were believed to have been in attendance, taking in the England international's strike as rumours swirl around his future. He has long been linked with a return to the Premier League after finding game time abroad, with United among those most frequently attributed with an interest in his services. Erik ten Hag's side are in the market for a new No 9 to relieve some of the goal scoring responsibility that currently rests on Marcus Rashford's shoulders. The Red Devils have also been linked with fellow Serie A star Victor Osimhen, who leads the way in the Italian top-flight's race for the golden boot with 21 goals in 26 appearances. ",
        "However, the Nigerian is expected to cost any suitors a much larger fee than that Roma are willing to consider for Abraham, making the England striker a more cost-effective option. Chelsea do have a buyback option agreed in their deal to sell the player to Roma, which they could exercise should they wish to bring him back to Stamford Bridge. Yet the fee stands at around £70.3m, and the Blues are believed to be considering alternative options this summer. Aston Villa - where Abraham spent the 2018-19 season on loan - are also rumoured to be interested in the centre-forward, with Unai Emery's side eyeing up a Europa League campaign next season. "
    ]
}