{
    "articleURL": "/wires/pa/article-12045899/Anya-Shrubsole-Number-professionals-women-s-cricket-growing.html",
    "content": [
        "Southern Brave captain Anya Shrubsole predicts women’s cricket is on a path to full professionalisation within a few years.",
        "The former England bowler took six for 46 against India to steer her side to a thrilling nine-run World Cup victory in front of a sold-out Lord’s in 2017, arguably the most memorable moment in her impressive 14-year international career.The women’s game has accelerated exponentially since then, particularly with the debut of The Hundred in 2021 and, this year, the inaugural Women’s Premier League in India.“The professionalism is the biggest change,” Shrubsole told the PA news agency.",
        "“Previously you would only be a professional cricketer if you played for England, and then apart from that it was semi-professional, almost a hobby, but you’re asking these players to train as if they’re professional.“So to have the eight regional teams all with a minimum of 10 professionals, you add the England girls to that, that’s 100 professional female cricketers in this country, all in the last three years, which is just incredible really in such a short space of time and that will keep growing.“I think it will probably only be a couple of years until we see a fully professional squad across all the regional teams. That’s the thing that’s been the real big difference.”The two-time World Cup and Ashes winner, 31, stepped down from international duty in April 2022 after earning 173 caps for England across all formats and taking 227 wickets.",
        "The pace bowler still plays domestically for Berkshire, Southern Vipers in the Rachael Heyhoe Flint trophy as a player-coach, and is set to skipper Southern Brave in The Hundred for a third straight season.Last Saturday saw a world record crowd for a women’s international rugby fixture, 58,498, turn out to watch the Red Roses at Twickenham, two days before Arsenal played their Women’s Champions League semi-final in front of a sold-out 60,063 at the Emirates – a record audience for a women’s club match in England.On Wednesday, it was announced this month’s women’s FA Cup final will be played in front of a sold-out Wembley for the first time.Cricket looks to be the next to benefit from the trend driving people to box offices for women’s sport in unprecedented numbers.",
        "More than 66,000 tickets have been snapped up for England women’s fixtures in 2023, already exceeding the total attendance for all 2022 matches, while sales for July’s Ashes have already surpassed figures for the previous two women’s series against Australia combined.The series finale at Taunton is already sold out, with England hoping to secure the trophy for the first time since 2014.Shrubsole said: “Yes, you look at the record number of ticket sales but that’s at big grounds as well that England women haven’t played at for a long time.",
        "“The Test match at Trent Bridge, playing at the Oval, playing at Lord’s, the girls are really looking forward to that opportunity to show what they can do on the big stage. I think it will probably only be a couple of years until we see a fully professional squad across all the regional teams. That's the thing that's been the real big difference  Anya Shrubsole  “It’s going to be really hard fought. It’s obviously an England team that’s probably still transitioning a little bit in certain areas, obviously a new coach that’s only been in the role six months, quite a young but very exciting bowling attack. They’re going to have to be at their best.”ECB organisers hope the Ashes enthusiasm spills over to The Hundred when its third season opens on August 1.This is the first year the hugely popular women’s Hundred implemented a draft like the men’s competition – something Shrubsole, who was relieved to find herself back in a Brave uniform, agreed was another step forward.She said: “I think where women’s cricket is going, how much it’s grown, all of those kind of things are just incredible.“To be in a position to be able to do a draft for the women’s Hundred, to be able to do an auction for the WPL, it’s really incredible and it adds a different dimension. It’s all really exciting.”"
    ]
}