{
    "articleURL": "/news/article-12056771/Planet-Fitness-offering-free-summer-gym-pass-high-school-students.html",
    "content": [
        "Planet Fitness gyms are offering a free membership to teens during the summerThe High School Summer Pass is open to teens aged 14 to 19 Officials say the plan will help with teens' physical and mental health  Planet Fitness is offering a free pass to teens throughout the summer to help boost their mental and physical health while away from the classroom. ",
        "The High School Summer Pass launches on May 15 and offers students across the nation the opportunity to get their bodies moving for three months at no cost. Program participants can go take advantage of the pass at any of Planet Fitness' more than 2,200 locations in the third year of the program. The goal, Planet Fitness executives say, is to help teens manage both their physical and mental health in a productive and cost-effective way. 'Research shows that teens are struggling with overall wellness, and this is one of the many reasons why the High School Summer Pass program is so important,' said Planet Fitness CEO Chris Rondeau.",
        "In addition to the free gym membership, Planet Fitness is giving away $200,000 to high schools and students.    The gym franchise will give away $10,000 scholarships to ten students who submit themselves through a TikTok video contest describing their High School Summer Pass experience. The top 10 schools that take advantage of the pass will also win $10,000 to fund athletic equipment, physical fitness classes and health and wellness initiatives. The pass comes at a time when experts say teens' mental and physical health is A recent Wired Research survey commissioned by Planet Fitness found 75 percent of teens said they are 'ready and willing' to start working out.",
        "The study also found that 61 percent say they face mental health struggles. According to the Centers for Disease Control, nearly one in five U.S. children are considered obese. Just under 20 percent - roughly 15 million children - fall into that category. Harvard researchers found that in 1970, that number was just 5 percent. ",
        "The CDC currently recommends that children ages six to 17 get at least 60 minutes of aerobic exercise per day. The High School Summer Pass was first launched in 2019 and was originally called the Teen Summer Challenge. In 2022, the program had more than 3.5 million high-school aged students signed up, officials said.  Those students took part in more than 17 million workouts. sign up"
    ]
}