{
    "articleURL": "/sport/football/article-12046205/What-Sam-Allardyce-needs-Leeds-Premier-League.html",
    "content": [
        "Sam Allardyce has returned to management with Leeds after two years awayLeeds face a tough end to the season and are in danger of being relegated Mail Sport takes a look at what Allardyce needs to do to keep Leeds safe Sam Allardyce's return to top-flight management could not get much tougher, as he arrives at a Leeds side who are in disarray.",
        "The 68-year-old has been out of work since failing to beat the drop as West Brom boss in 2021, though Leeds have looked to his previous body of work which helped Crystal Palace, Blackburn and Sunderland avoid relegation. Leeds are safe as things stand, but only just, with only goal difference keeping them above 18th place Nottingham Forest.Allardyce starts life with a daunting trip to title-chasing Manchester City, before tricky matches against Newcastle, West Ham and Tottenham to conclude the season.  Mail Sport takes a look at what Allardyce needs to do to help keep Leeds in the top-flight for a fourth consecutive season. ",
        "PLUG THE LEAKSLeeds have conceded 67 goals this season which is more than any other top-flight side.In April, they lost five out of their seven games while conceding 23 goals - breaking the unwanted record for most goals conceded in a month during Premier League history.Before his spell at West Brom, Allardyce had built a reputation for improving the defences of sides struggling in the lower half of the table.He must tighten up Leeds' defence - but his first two games are against free-scoring Manchester City and Newcastle.Those games are followed by a trip to West Ham and a home clash with Spurs, meaning that Allardyce will have done a hugely impressive job if he is able to keep them up in the top-flight and plug their holes at the back.",
        "CLOSE OUT GAMES His new side have dropped a massive 20 points from winning positions so far this season.Only Leicester City - one place above Leeds in the table - have dropped more. The west Yorkshire side would be ahead of the Foxes and two points clear of the relegation zone, if they had held onto their one-goal advantage last week, before Jamie Vardy struck an 80th minute equaliser in a 1-1 draw.With only four games left to play this season, they can't afford any more slip-ups from winning positions if they are to maintain their Premier League status.",
        "CURE TRAVEL SICKNESSLeeds’ record on the road is abysmal, winning just nine points out of a possible 51.In fact, only Nottingham Forest have taken less points on the road than Leeds with just six. They have just two more away games to play this season, against Manchester City and West Ham.Allardyce realistically would be happy to take any points away from the Etihad on Saturday, but a win at the London Stadium on May 21 could be the difference between staying up or relegation.",
        "GET GNONTO ON THE PITCH One of the biggest surprises under the tenure of Javi Gracia was Wilfried Gnonto being left out of the starting XI.",
        "The talented Italian hardly featured under Gracia and on a podcast last week, Allardyce questioned why the winger was not playing more.Since his debut in October, no Leeds player has provided more assists than the 19-year-old (four).Allardyce's bemusement over the Italian not playing for the Whites would provide a clear indication that he has greater plans to use him in the final weeks of the season.Gnonto has quickly endeared himself to the club's fanbase and his energy and work-rate could be a huge boost for Leeds in their final four matches. ",
        "GET BAMFORD FIRING Though Patrick Bamford found the back of the net in Leeds' 4-1 defeat to Bournemouth on Sunday, it has been an underwhelming season for the striker. He has netted just four times in 25 Premier League appearances - well down on his numbers from the 2020-21 season where he found the back of the net on 17 occasions in the top-flight.Bamford missed the majority of last season with a hamstring injury followed by another one to his foot, and he has not hit the same standards since. Allardyce has backed Bamford to be a key player for the Whites during the final few weeks of the season.If the new Leeds boss can unlock the potential out of Bamford when he plays at his best, they will stand a much better chance of getting the points they need to survive. "
    ]
}