{
    "articleURL": "/news/article-12039415/Barefoot-Investor-Scott-Pape-issues-warning-disturbing-trend-Australia.html",
    "content": [
        "Scammers are using artificial intelligence They can now clone anyone's voice using software The Barefoot Investor has issued an urgent warning to Australians over a terrifying new scam in which fraudsters can use artificial intelligence to clone anyone's voice.",
        "Scott Pape, as he is also known, said in his 20 years of covering finance, he had 'never seen anything like' the skyrocketing number of scams appearing over the last couple of years.'Scams are red hot right now. In fact, they've increased a staggering 80 per cent in the last year alone,' Pape said.But as Australians wise up to the 'run-of-the-mill scammy stuff', as Pape puts it - such as dodgy overseas call centres, romance scams, or fake links - those who want to steal your money are also upping their game.'Don't get too comfy - an army of robots is coming for your money.'",
        "While AI-powered search engines, like Bing's partnership with ChatGPT, have become all the buzz recently, there are a host of other AI programs out there, and many are worrying.'A new artificial intelligence app called VoiceLab can recreate your voice with just a three-second clip,' Pape said.'It can gain this from a spam call when you answer 'Hello, who is this?' or, more likely, from one of your TikTok posts.'Pape said there are several ways this can be used to gain access to a mark's cash.'Scammers have even been using voice-cloning tech to trick parents into believing their kids are calling them in a panic and needing money fast.'",
        "'Yet what the scammers are really after is voice authentication.'Centrelink and the Australian Taxation Office both offer voice authentication to access accounts.Financial institutions are also getting on board, with at least two Australian banks investing in voice ID verification.If scammers can also get hold of some basic information such as an account number, then 'Bingo', Pape said.But it doesn't stop there, with AI programs also being deployed to try and hack old-fashioned passwords.According to Pape, the scammers are moving too fast for the government or even the banks to keep up.'Last year, the Big Four managed to stop just 13 per cent of scam payments. Worse, the banks only compensated their customers for around 2 per cent to 5 per cent of what they lost, according to ASIC.'He suggests having two-factor authentication on all your accounts, which requires verification from a second method such as a mobile phone to gain access.'If you're really concerned, lock down your credit file,' he said.This can prevent scammers applying for credit with your information.",
        "Just this year, I've had the following people email me:A veteran policeman who was scammed out of his life savings.An experienced tech journalist who was swindled for ten grand.And literally hundreds of readers who've lost amounts ranging from $1,000 to $1 million.What the hell is going on?Scams are red hot right now … in fact, they've increased a staggering 80% in the last year alone.Most of it, to be honest, is the run-of-the-mill scammy stuff that you and I try our best to avoid, like taking dodgy calls from dodgy people in dodgy overseas call centres, or romance scams, or clicking on fake links and text messages.Yet don't get too comfy – an army of robots is coming for your money.A new artificial intelligence app called VoiceLab can recreate your voice with just a three-second clip which it can gain from a spam call (you answer: 'Hello, who is this?') or, more likely, from one of your TikTok posts.Scammers have even been using voice-cloning tech to trick parents into believing their kids are calling them in a panic and needing money fast! (Which is horrifying, but also makes me want to try it out on my mum, who complains I never call her anymore.)Yet what the scammers are really after is voice authentication. The Australian Tax Office, Centrelink and many banks give customers the option of using their voice as a way to confirm their ID when they call or want to make a transaction. Bingo!And if that doesn't freak you out, how about the fact that criminals are using machine learning AI to hack your passwords (yes, the same password you've used for every single login since 2015).So, what's the answer?I don't think the government can do much: the tech and the scammers are moving too damned fast.And Aussie banks are lobbying furiously behind the scenes to avoid being on the hook for their customers' losses (as UK banks will soon be forced to be). In truth, the banks are as good as useless. Last year the Big Four managed to stop just 13% of scam payments. Worse, the banks only compensated their customers for around 2% to 5% of what they lost, according to ASIC.So, given the leaves are falling and the nights are getting cooler, one way to warm your cockles is to grab a bottle of wine, take a moment, and make sure you have two-factor authentication set up on all your accounts. And, if you're really concerned, lock down your credit file (though, according to the first question below, telling you this could get me killed).Tread Your Own Path!"
    ]
}