{
    "articleURL": "/news/article-12049917/Loving-grandmother-85-killed-hit-cement-truck.html",
    "content": [
        "Beaumont Police Department officers found her injured on the road upon arrivalShe was pronounced dead by CalFireAn elderly Californian woman died after being hit by a cement truck as she crossed a street in her local neighborhood. ",
        "Pla Khang, 85, was struck by the vehicle on Monday at 8:45am at the intersection of 6th street and Highland Springs Avenue in Beaumont, according to KTLA. As per the Beaumont Police Department (BPD), officers found the woman injured on the road upon arrival. She was pronounced dead at the scene by California Department of Forestry and Fire Protection (CalFire), who also responded to the emergency call. There appears to be no motive behind the incident, with the truck driver remaining at the scene of the collision after officers arrived, and cooperating fully during the investigation. ",
        "Khang's family - who are from Riverside County - have launched a GoFundMe campaign to help cover costs for the funeral. The pensioner's grandson, Che Yang, paid tribute to his 'loving grandmother' in a message on the campaign's web page. He described her as 'a selfless individual who never hesitated to help anyone', that also loved the outdoors, gardening and cooking, Yang wrote. Her daughter, Pang Yang, told the outlet that 'everyone knew who she was' as she would 'cross the street every day'.'Her age never stopped her from getting her daily walks, she would rather walk than be driven in a Ferrari,' added Yang. 'She was always so full of light and joy. We will never forget how warm she made all of us feel. We are so heartbroken to have lost such a beautiful soul but we know she is in a better place.' ",
        "The family added on the GoFundMe page: 'No matter where she went, her beautiful smile and contagious laugh never failed to (light) up a room. 'She loved the outdoors, loved gardening, her chickens, and especially cooking! We will never forget how warm she made all of us feel.'"
    ]
}