{
    "articleURL": "/news/article-12043575/Debt-limit-fight-turns-dirty-Cruz-says-Bidens-mental-faculties-diminished-negotiate.html",
    "content": [
        "'What we're left with is a bunch of young staffers in the White House - radical children who are perfectly willing to risk a default on the debt,' Cruz said Biden 'should be having daily meetings with Kevin McCarthy to figure out how we get this done,' said Sen. Rick ScottSchumer blamed McCarthy for putting forth a 'dead on arrival' spending cut proposal: 'McCarthy and the hard right have made the odds of default go up'The standoff between President Biden and congressional Republicans has turned ugly as the clock ticks down to the nation running out of money to pay its bills. ",
        "Both sides are blaming the other for not committing to take default off the table - as Democrats insist on a lift to the debt ceiling with no strings attached and Republicans say they won't allow the nation to plunge further into debt without spending cuts. Sen. Ted Cruz, R-Texas, said Wednesday that Biden won't negotiate on the debt ceiling because 'his mental faculties are too diminished right now to do what he did in 2011, to sit down and actually work together on a solution to the problems.''What we're left with is a bunch of young staffers in the White House - radical children who are perfectly willing to risk a default on the debt.' In 2011, the U.S. was at a similar point and came within 72 hours of defaulting on its debt. Then-Vice President Biden stepped in to negotiate with congressional Republicans on behalf of the Obama administration and worked out the Budget Control Act - which mandated $917 billion in budget cuts in exchange for a $900 billion initial increase in the spending limit.Reports have said that President Obama and Biden agreed never to negotiate on the debt limit again after that. ",
        "'This should be the biggest issue they're dealing with every day. They should be having daily meetings with Kevin McCarthy to figure out how we get this done,' Sen. Rick Scott, R-Fla., said in a news conference Thursday. ",
        "Cruz accused Biden of trying to 'scare the stock market' by not telling Americans the nation won't default on its payments - a similar accusation to the ones Democrats have been wielding against Speaker McCarthy. Policy makers across the board seem to be in crisis mode after the Treasury warned Monday that the 'X-date' for the nation's debt to be maxed out could now fall as early as June 1. 'It's essential that the debt ceiling be raised in a timely way so that the US government can pay all of its bills when they're due. A failure to do that would be unprecedented,' Federal Reserve Chair Jerome Powell warned as the central bank raised interest rates another 25 basis points Wednesday. 'We'd be in uncharted territory and the consequences to the US economy would be highly uncertain and could could be quite averse. So I'll just leave it there. We we don't give advice to either side. We just would point out that that it's very important that this be done.' On Monday President Biden called Speaker McCarthy to plan a meeting after three months of refusing to meet with the House GOP leader. Still, he insists the debt limit must be lifted before the two can talk about budget cuts.",
        "'There isn't going to be a debt limit increase absent negotiation,' Senate GOP Whip John Thune insisted on Thursday. Senate Minority Leader Mitch McConnell, House Minority Leader Hakeem Jeffries and Senate Majority Leader Chuck Schumer will also be present at the meeting on May 9, though McConnell insists he's taking a back seat to negotiations as McCarthy and Biden hash out an agreement. Schumer back up Biden on Tuesday by insisting a clean debt ceiling bill is the only thing Senate Democrats would agree to. 'The Speaker is giving the American giving the American people two terrible options. Either default on the debt or default on the country with steep cuts to law enforcement, first responders, veterans, seniors, and even cancer research,' Schumer said. 'Speaker McCarthy and the hard right have made the odds of default go up.'House Republicans last week passed a party-line debt ceiling bill that would offer a $1.4 trillion lift to the debt ceiling in exchange for $4.5 trillion in spending cuts. ",
        "But even that bill took aggressive political wrangling to get the conference on board, and the question now looms as to whether McCarthy can get through a less conservative bill negotiated with Democrats. For months, conservatives in both the House and the Senate, many of whom prided themselves on having never voted for a debt limit increase, gathered around the dining room table of Florida Sen. Rick Scott to talk about how to push hard-line budget cuts into the GOP bill. ",
        "'You have to understand how far conservatives in the House had to move to get 217 votes,' Sen. Ron Johnson, R-Wis., said Thursday, signaling there wasn't much wiggle room among the right wing of his caucus for anything less than the House bill. As neither the president nor the speaker show any sign of blinking, some Democrats are looking at alternative options. White House officials are reportedly eyeing whether they can invoke the 14th Amendment. A rarely-used provision states: 'The validity of the public debt of the United States, authorized by law, including debts incurred for payment of pensions and bounties for services in suppressing insurrection or rebellion, shall not be questioned.'Schumer tamped down that idea on Tuesday. 'The way to go is a clean debt ceiling,' he said.Schumer is planning for a vote on a clean debt ceiling bill in his chamber while Jeffries is trying to bring one up in the House via a discharge petition. The discharge petition allows a sizable group of members to go around leadership to get legislation directly to the floor.'We will be in direct contact next week upon our return to Washington in connection with the discharge effort,' Jeffries wrote in a Dear Colleague letter. But Jeffries, of New York, would need the signature of five GOP moderates in the House to bring the bill forward, in addition to all of his members, a highly unlikely scenario. ",
        "For now, all of Congress must wait and see what comes of Tuesday's sit-down at the White House. "
    ]
}