{
    "articleURL": "/femail/article-12053639/Crown-Princess-Mary-Denmark-elegant-attends-Coronation.html",
    "content": [
        "Crown Princess Mary of Denmark looked stunning as she arrived for the Coronation in London earlier today CORONATION LIVEBLOG: Click here to follow live updates throughout today How are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.uk Crown Princess Mary of Denmark looked stunning as she and her husband Crown Prince Frederik of Denmark arrived at King Charles III’s Coronation today.",
        "The 51-year-old royal and her husband are on the exclusive guest list attending the dazzling event at Westminster Abbey to watch Charles and Camilla being crowned. The Australian royal donned an elegant purple ensemble, with a vibrant coat dress and matching gloves and fascinator.  Wearing her long chestnut hair wrapped into a bun without a fascinator, Mary kept her make-up soft and classic with a slightly smokey eye and subtle pink lip, opting for a nude shade on her nails. MailOnline exclusively revealed that guest numbers for the King’s Coronation are so tight many foreign royals and British aristocrats have missed out on invitations to the Westminster Abbey ceremony.The couple were also among the foreign royals who attended King Charles III’s drinks reception at Buckingham Palace.",
        "Arriving at the event with her 54-year-old husband, Princess Mary showed off her impeccable style in a coral pink Andrew Gn dress.The thrifty royal previously wore the garment to celebrate her daughter Princess Isabella's confirmation at the end of April 2022.Mary's coral Andrew Gn dress stood out beautifully against her olive complexion, while she added a pop of colour with a turquoise beaded clutch to tie in with the exquisite brooch on the dress's matching belt. The mother-of-four finished the outfit with nude heels, a thin gold necklace and diamond earrings. ",
        "Mary's pre-Coronation outfit is a much more subtle take compared to how she styled the same dress for her 16-year-old daughter's special occasion last month. Opting to forgo a bag, the royal added a statement headband to her hair that featured a soft pink netted veil. However, the fashionista couldn't help but add a pop of fresh spring colour on her nails by wearing a hot coral pink.Charles III's day of destiny today has arrived as the world prepares to watch the historic first coronation of a British monarch in 70 years at Westminster Abbey where Britain will hail its new King.The monarch had been heir since the age of three, and is now ready to finally embrace his day of destiny with the woman he loves by his side. VIP guests queued for a mile from the Abbey from 6am to get one of the prime 2,300 seats inside.Charles will be crowned in a Christian ceremony that dates back for 1,000 years on a day dripping with glorious displays of pageantry. It will also shine a spotlight on Britain’s place on the world stage.And on the streets of London today, including on a packed Mall, there is huge excitement among tens of thousands who have been camped out for days so they can see the extraordinary event unfold. More than 100million will watch on TV around the globe.",
        "Approaching two million people - from all corners of the UK, Commonwealth and the world - are flowing into Central London, despite rain being forecast. Trains into the capital were packed this morning, with soldiers taking part in the ceremony seen flowing into mainline stations.Guests of the King started arriving at the Abbey from 7am - four hours before the ceremony. Some 100 heads of state are in London, with representatives from 203 countries due to attend.The longest-serving heir to the throne in British history will today be crowned at Westminster Abbey in a ceremony that is steeped in the majesty of his illustrious forebears – but also embraces and emphasises the proud diversity of modern-day Britain.‘There will be all the pomp and ceremony you could dream of, but as little of the “them and us” as possible,’ one senior royal aide said last night.Crowned alongside the King, 74, will be his wife of 18 years – and his love for much, much longer.The once unthinkable has become a reality, and from today the former Camilla Parker Bowles will be known as Queen Camilla as she is anointed and has Queen Mary’s Crown placed upon her head.Yesterday the 75-year-old Queen Consort made only a brief public appearance as she attended a final rehearsal at the Abbey with her husband in the morning. She chose not to attend any of the other public engagements by his side, preferring to ‘pace herself’ and also ensure ‘the day was about her husband’, sources said.",
        "‘She loves him unconditionally and always wants him to shine,’ a friend said.Last night the couple retired to enjoy a private dinner at their London home, Clarence House.‘The calm before the storm – perhaps metaphorically as well as literally’, a friend said with a nod to the dismal weather forecast, something the new King and Queen’s celebrations have in common with the late Queen’s Coronation in 1953."
    ]
}