{
    "articleURL": "/wires/reuters/article-12050807/Air-France-KLM-drops-operational-challenges-weigh-Q1-performance.html",
    "content": [
        "Q1 oper loss at 306 mln euros vs consensus of 282 mln euros loss",
        "Q1 revenue of 6.33 bln euros beats estimates on summer bookingsCuts 2023 capacity outlookLimited hit from French strikesShares down 4.3% at 1133 GMT(Rewrites throughout with quotes from calls, analyst comments and share move)By Federica MileoMay 5 (Reuters) -Air France-KLM on Friday reported a steeper than expected operating loss for the first quarter and trimmed its capacity outlook for 2023 despite strong summer bookings, dragging its shares 4% lower.\"The first quarter is always a loss-making quarter and we were also hold back by the current operational climate,\" finance chief Steven Zaat told analysts in a call.Zaat cited air control strikes in France, the grounding of aircrafts for maintenance at low-cost unit Transavia and ongoing staff issues at Amsterdam's Schiphol airport.Since last year, strikes and staff shortages have forced European airlines to cancel thousands of flights to avoid long queues at major airports.The group said the impact from French strikes was limited, estimating it below 5 million euros ($5.5 million) at Paris-Charles de Gaulle airport and below 10 million euros at Paris-Orly airport.\"After two months of experience, we think we can significantly limit those losses even further\", CEO Benjamin Smith said.Air France-KLM said did not see an impact from the ongoing cost-of-living crisis, pointing to more than 1.5 billion euros in ticket sales over the first quarter and to strong demand across its network.",
        "The carrier, however, narrowed its 2023 capacity outlook to around 95%, against its previous estimate for capacity between 95% and 100%, citing some delays on new aircraft deliveries.Even though its revenue beat estimates at 6.33 billion euros, boosted by a recover in summer bookings, the group's operating loss narrowed less than expected to 306 million euros, while the analyst consensus had expected on average a loss of 282 million euros.Brokerages saw the results as largely positive, but flagged some weak points.Liberum analysts said the first-quarter capacity, at 92% of 2019 levels, was at the lower end of the planned 90-95% range, while ING and JPMorgan noted weakness at Transavia. ($1 = 0.9083 euros) ($1 = 0.9083 euros)(Reporting by Federica Mileo in Gdansk Editing by Matthew Lewis and Milla Nissi)"
    ]
}