{
    "articleURL": "/news/article-12038101/Sen-John-Thune-questions-Schumer-McConnell-join-Biden-McCarthy-debt-meeting.html",
    "content": [
        "Treasury Secretary Janet Yellen's dire warning triggers fresh moves over debtBiden will meet with Democratic and Republican leaders on May 9But GOP Senate number two says Biden and McCarthy are the key figures The number two Republican in the Senate on Monday appeared to kill off any hope that senators could swoop in with a compromise deal to stave off a debt default, saying the only thing that could win 60 votes was something agreed between President Joe Biden and House Speaker Kevin McCarthy.",
        "He gave his view after Biden invited McCarthy for talks at the White House, along with the top Senate Democrat and top Senate Republican.There is added urgency after Treasury Secretary Janet Yellen said the federal government could run out of cash on June 1, weeks sooner than expected. McCarthy has taken a hardline stance, refusing to allow the debt ceiling to be raised or suspended without spending cuts. Yet, if anything, Yellen's warning only hardened negotiating positions. ",
        "Senate Minority Whip John Thune described Biden's invitation as 'good news' but said the Senate GOP stance was unchanged.'The only thing that can get 60 votes in the Senate is something negotiated between the President and the House Republican leadership,' he told Politico.Why even invite the Senate leaders, he added, 'I'm not sure at this point what Schumer or McConnell add to the conversation,' he said. 'I think they're gonna have to work it out.'Soon after Yellen issued her warning, Biden made calls on Monday afternoon to McCarthy as well as the three other leaders.Should the May 9 meeting go ahead, it will be the first time Biden and McCarthy have met for talks over the impending crisis since February.Yellen's warning came in a letter telling Congress it was running out of time to raise the federal government's $31.4 trillion debt ceiling.",
        "'In my January 13 letter, I noted that it was unlikely that cash and extraordinary measures would be exhausted before early June. After reviewing recent federal tax receipts, our best estimate is that we will be unable to satisfy all of the government's obligations by early June, and potentially as early as June 1,' Yellen wrote.Just after Yellen's letter was made public it was revealed Biden had called McCarthy's team to set up a meeting on how to move forward with the nation's borrowing limit.",
        "Biden and McCarthy have been at loggerheads over how to move forward.In the May 9 meeting, it is understood that Biden plans to 'stress that Congress must take action to avoid default without conditions,' a White House official said. But Republicans insist they will not allow the debt ceiling to be raised without spending cuts, and Democrats insist they will only agree to a clean increase.Any agreement over how to move forward would have to first be worked out between the speaker and the president. The GOP-led House and Democrat-led Senate would have to get on board and pass it and send it to the president's desk, all in as little as a month. The House will have four day weeks the week of May 15 and 22, taking Fridays off. Then, the House is out of Washington the week of May 29, returning June 5. The Senate will be out from May 22 to 29 for a state work period. ",
        "'There is very little time on the legislative calendar to reach a deal,' wrote Goldman Sachs Group Inc analyst Alec Phillips in a note to clients. 'The next few weeks are going to be unpredictable.'Although there is plenty of precedent for Congress's scheduled state work visits to be changed, Biden's May travel schedule is less flexible.The Group of Seven leaders' meeting in Hiroshima, which the White House says Biden is attending, starts May 19, and he'll need to leave earlier than that to reach it in time. After that ends on May 21, he will attend the May 24 meeting of the Quad Leaders' Summit in Sydney, Australia, the White House said.While plenty is negotiated in Washington by Zoom, text or over the phone, touchy political compromises are still typically the province of in-room deal-making.",
        "Schumer's office revealed Monday the majority leader scheduled votes on a clean two-year suspension of the federal debt ceiling - past the 2024 elections - and the House-passed debt limit GOP bill, which could be largely amended into a deal. Schumer and Jeffries also released a joint statement emphasizing the need for a clean increase to the borrowing limit.'We do not have the luxury of waiting until June 1 to come together, pass a clean bill to avoid a default and prevent catastrophic consequences,' they said. ",
        "Last week the House passed sprawling debt ceiling legislation that Senate Democrats have insisted is dead on arrival in their chamber. Republicans have said their plan would save $4.5 trillion in exchange for lifting the nation's borrowing cap by $1.5 trillion. Now GOP leadership insists the ball is in Biden's court to come to the negotiating table. Now some House Democrats have even said publicly it's time for Biden to come to the negotiating table. But after the political wrangling it took for McCarthy to get his conference on board with a party-line bill, questions loom over how he would get his caucus on board with a less conservative bill.  Asked how he would next get his caucus to agree to a debt ceiling bill that could actually pass the Democrat-led Senate last week, the speaker demurred. 'Now as the president continues to not negotiate what what I know is I'm confident that one party has taken care of the debt ceiling. We have lifted the debt ceiling so nobody could worry about whether the debt ceiling is gonna get lifted,' he said. 'We did. The Democrats have not. The President wants to make sure the debt ceiling is going to be lifted, sign this bill.'",
        "'Other bills that we passed you say you're going to veto, at the end of the day, you probably end up signing this one as well,' McCarthy said in words directed at Biden. ",
        "Last week Biden said he would meet with McCarthy only if he wouldn't use the debt limit as leverage. 'Happy to meet with McCarthy,' Biden said. 'But not on whether or not the debt limit gets extended. That's not negotiable.'    The new June 1 date is a shorter timeline than forecasters had predicted.The Congressional Budget Office (CBO) issued its own assessment confirming the nation would run out of the funds to pay all of its bills in early June after previously stating the deadline would fall between July and September. 'The extent to which the Treasury will be able to fund the government's ongoing operations using cash balances and remaining extraordinary measures will also remain uncertain throughout May, even if it turns out that the Treasury runs out of funds in early June,'  CBO director Phil Swagel wrote in a Monday statement.If Congress fails to act, some legal experts say Democratic President Joe Biden has another option to avert a crisis: Invoke the 14th Amendment to the US Constitution to ensure the United States can continue to pay its bills. Section Four of 14th Amendment, adopted after the 1861-1865 Civil War, states that the 'validity of the public debt of the United States ... shall not be questioned.'Historians say that aimed to ensure the federal government would not repudiate its debts, as some former Confederate states had done.",
        "But the clause has been largely unaddressed by the courts, and legal experts disagree about what it requires from Congress and the presidency.Some, like Cornell University law professor Michael Dorf, say the 'least unconstitutional' option would be for Biden to act on his own to protect the integrity of the national debt. That would mean borrowing money,' he said.Any action by Biden would surely prompt a lawsuit."
    ]
}