{
    "articleURL": "/wires/ap/article-12057133/SUV-driver-hits-crowd-Texas-bus-stop-near-border-7-dead.html",
    "content": [
        "BROWNSVILLE, Texas (AP) - Police are preparing to arrest the hospitalized driver of an SUV that slammed into a crowd, killing eight people waiting for a bus Sunday outside a migrant shelter in the border city of Brownsville, Texas. At least 10 others were injured, authorities said.",
        "With no bench at the unmarked city bus stop, some of the victims were sitting on the curb around 8:30 a.m. when the driver hit them, surveillance video from the Bishop Enrique San Pedro Ozanam Center showed. Brownsville police investigator Martin Sandoval, who confirmed the latest death Sunday evening, said police did not know whether the collision was intentional.Shelter director Victor Maldonado said the SUV ran up the curb, flipped and continued moving for about 200 feet (60 meters). Some people walking on the sidewalk about 30 feet (9 meters) from the main group were also hit, Maldonado said. Witnesses detained the driver as he tried to run away and held him until police arrived, he said.\"This SUV, a Range Rover, just ran the light that was about 100 feet (30 meters) away and just went through the people who were sitting there in the bus stop,\" said Maldonado, who reviewed the shelter´s surveillance video.Victims struck by the vehicle were waiting for the bus to return to downtown Brownsville after spending the night at the overnight shelter, said Sister Norma Pimentel, executive director of Catholic Charities of the Rio Grande Valley.Most of the victims were Venezuelan men, Maldonado said. Brownsville has seen a surge of Venezuelan migrants over the last two weeks for unclear reasons, authorities said. On Thursday, 4,000 of about 6,000 migrants in Border Patrol custody in Texas´ Rio Grande Valley were Venezuelan.",
        "The driver was taken to the hospital for injuries sustained when the car rolled over, Sandoval said. There were no passengers in the car, and police didn´t immediately know the driver´s name or age, Sandoval said Sunday afternoon.Sandoval said there are three possible explanations for the collision: \"It could be intoxication; it could be an accident; or it could be intentional. In order for us to find out exactly what happened, we have to eliminate the other two.\"He´s being very uncooperative at the hospital, but he will be transported to our city jail as soon as he gets released,\" Sandoval said. \"Then we´ll fingerprint him and (take a) mug shot, and then we can find his true identity.\"Police retrieved a blood sample and sent it to a Texas Department of Public Safety lab to test for intoxicants.The surge in the number of migrants this week has prompted Brownsville commissioners to indefinitely extend a declaration of emergency during a special meeting Thursday.\"We don´t want them wandering around outside,\" Pedro Cardenas, a city commissioner, said Sunday after the crash. \"So, we´re trying to make sure they´re as comfortable as they can be so they don´t have to go out and look for anywhere else.\"Brownsville has long been an epicenter for migration across the U.S.-Mexico border, and it has become a key location of interest for next week's end to pandemic-era border restrictions known as Title 42. The Ozanam shelter is the only overnight shelter in the city and manages the release of thousands of migrants from federal custody.",
        "Maldonado said the center had not received any threats before the crash, but did afterward.\"I've had a couple of people come by the gate and tell the security guard that the reason this happened was because of us,\" Maldonado said.About 2,500 migrants have crossed through the river daily into Brownsville in the past few days, Cardenas said. He said the Border Patrol is aware of the city´s capacity of 1,000 at their processing area near the crossing point and a downtown building where city employees and volunteers guide migrants on how to purchase bus or plane tickets to their final destinations. The city is considering expanding services to accommodate needs in the coming days, Cardenas said.While 80% of people released from federal custody leave the same day, the city´s emergency management official said, a bottleneck has formed over the past few days.\"Most of the people coming across don´t want to stay in Brownsville, but we don´t have enough buses for them to buy their ticket to leave,\" Cardenas said. \"Some are waiting for family members.\"The Ozanam shelter can hold 250, but many who arrive leave the same day. In the last several weeks, an uptick in border crossings prompted the city to declare an emergency as local, state and federal resources coordinated enforcement and humanitarian response.",
        "\"In the last two months, we´ve been getting 250 to 380 a day,\" Maldonado said.While the shelter offers migrants transportation during the week, they also use the city´s public transportation.Rochelle Garza, president of the Texas Civil Rights Project, said in a statement shared Sunday afternoon: \"I hope that today serves as a wake up call, and that state officials will begin investing in a humanitarian response that might have helped the people who were impacted by this morning´s tragedy.\"U.S. Rep. Vicente González said Sunday that local officials are in communication with the federal government about the crash.\"We are all extremely sad and heartbroken to have such a tragedy in our neighborhood,\" he said.___Valerie Gonzalez reported from McAllen, Texas. Travis Loller contributed to this report from Nashville, Tenn."
    ]
}