{
    "articleURL": "/wires/ap/article-12040475/Pollock-homers-break-no-hit-bid-Mariners-beat-A-s-2-1.html",
    "content": [
        "OAKLAND, Calif. (AP) - A pair of pitchers with the same last name and born one day apart took a double no-hitter into the sixth inning Tuesday night.",
        "Neither Mason nor Bryce Miller - who are not related - was around at the end.AJ Pollock homered to break up a combined no-hit bid with one out in the eighth inning and Jarred Kelenic added an RBI double as the Seattle Mariners rallied past the Oakland Athletics 2-1.On a night both teams were held hitless through five innings and just 2,583 fans were on hand at the Coliseum. Oakland´s Mason Miller pitched seven no-hit innings in his third major league start. He was removed after 100 pitches.Mason Miller, born Aug. 24, 1998, made his big league debut on April 19. He struck out six and walked four.\"It´s definitely disappointing to not be able to finish it, but I know that´s kind of on me for having those four walks and not being in the zone as much as I should´ve been early in the game,\" Mason Miller said. \"So I totally understand it and I´d rather throw many more games this season than lay it all on the line for a game in the beginning of May.\"",
        "Richard Lovelady (0-1) took over in the eighth with a 1-0 lead but took his his first loss with the A's.Seattle's Bryce Miller, born Aug. 23, 1998, retired his first 16 batters in his major league debut before Tony Kemp singled on a shoulder-high pitch in the sixth. After a wild pitch and a flyout, Esteury Ruiz hit an RBI double to put Oakland ahead.",
        "Bryce Miller thought about his perfect-game bid at Double-A.\"My last game of the year last year, I think I went into the sixth, as well, but it´s a little different here,\" he said. \"This is probably a little cooler.\"Bryce Miller struck out 10 in six innings, allowing one run and two hits. His 10 strikeouts were the most in a Mariners debut.\"Pretty good way to start off your major league career,\" Seattle manager Scott Servais said. \"Unbelievable performance tonight by Bryce Miller. Calm, cool as any young player I´ve ever seen really getting the opportunity to start his first major league game.\"Gabe Speier (1-0) struck out the only batter he faced for his first big league win. Paul Sewald struck out two in a perfect ninth to remain perfect in eight save chances.Athletics starting pitchers have not gotten a win through 30 games, the longest streak to start a season in big league history, according to the Elias Sports Bureau.ATTENDANCE WOESThe A's drew their smallest home crowd in exactly one year, since 2,488 for a game against Tampa Bay on May 2, 2022. On-and-off rain in the early innings likely contributed to the low number, along with the Golden State Warriors hosting a playoff game against the Los Angeles Lakers in San Francisco.",
        "I BELIEVE IN STEPHEN VOGTFormer Athletics All-Star catcher Stephen Vogt returned to Oakland for the first time as a member of the Mariners coaching staff and received an ovation from the small Coliseum crowd.\"It´s always fun to come back to the Coliseum,\" he said. \"It´s always fun to come back to Oakland and see familiar faces and people you´ve worked with over the last 10-plus years.\"Vogt retired after last season and became Seattle´s bullpen and quality control coach.\"I think just to stay in the game and stay on the field with the guys,\" he said of his decision to go into coaching. \"The biggest impact you can make in this game is being around everybody every day.\"LA STELLA CUTBefore the game, the Mariners designated former All-Star infielder Tommy La Stella for assignment.La Stella, 34, was released by San Francisco on Jan. 5 with one season left in an $18.75 million, three-year contract. Seattle signed him two weeks later for the $720,000 major league minimum, which was offset against the $11.5 million he was owed by the Giants.La Stella appeared in 12 games with the Mariners, hitting .190 (4 for 21) with two RBIs.TRAINER´S ROOMMariners: OF Julio Rodríguez (back soreness) was a late scratch after initially being listed in the starting lineup. Rodríguez took some swings in the batting cage but missed his second straight game.",
        "Athletics: INF Aledmys Díaz was placed on the 10-day injured list with a strained left hamstring. INF Nick Allen was recalled from Triple-A Las Vegas and started at shortstop. ... RHP Trevor May, on the IL due to anxiety-related issues, began a rehab assignment with Triple-A Las Vegas, pitching a scoreless inning at Sacramento. ... RHP Adrián Martínez (strained right elbow) threw a 20-pitch bullpen session and is scheduled to throw a 35-pitch bullpen Friday.UP NEXTRHP Logan Gilbert (1-1, 4.23 ERA) starts Wednesday for Seattle opposite Oakland LHP JP Sears (0-2, 6.23).More AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}