{
    "articleURL": "/wires/pa/article-12042779/Dame-Prue-Leith-reveals-coronation-day-party-plans.html",
    "content": [
        "Dame Prue Leith will be hosting a party to celebrate the King’s coronation featuring a salmon pastry centrepiece stamped with a portrait of Charles in his honour.",
        "The Great British Bake Off judge, 83, said her coronation party is inspired by the idea of the coronation Big Lunch, inviting her family and friends to enjoy the celebrations together.The restaurateur and chef, who previously judged the Great British Menu, told Nick Grimshaw and Angela Hartnett of her plans on the Dish podcast.“I’m having a party,” she said.“I support this idea of the Big Lunch, which is lots of people getting together and street party sort of stuff.“We’re having a Big Lunch, but it’s going to be picnicky food because the grown-ups will all want to watch the telly, and the children will all want to play in the garden.“And my husband is obsessed with children’s toys so we have a collection. I swear that none of my family come down for any other reason than their children get to ride on Segways and scooters.“Little mini bikes and a quad bike and all sorts of stuff – there’s just lots of dangerous toys for children to (play with) while we watch the telly.”Dame Prue spoke about her plans for catering the event on Saturday May 6, which involved “mostly picnic food”.“There’s going to be a centrepiece which will be a coronation portrait of King Charles. And in fact, I did it for Waitrose Food magazine and if you go to their website you can get the recipe, but it’s honestly … so simple, it’s just pastry and salmon inside.",
        "“So it’s like a salmon en croute and a bit of tarragon and nothing else really.”",
        "Dame Prue also said that she was heading up the cooking but if her daughter is around then “she’s really good and handy”.She added: “But otherwise I really like to just get on with it and too much help delays the whole thing.“I like a bit of washing up. If people are only prepared to do what they’re told like commis in the kitchen, then I love them.“But if they … (are) saying they want to do it differently … even my son who really can’t cook at all, always has another idea of the way it should be done.”Last month, Dame Prue gave her stamp of approval to the coronation quiche, made with spinach, broad beans and tarragon, as one of the first people to try the official coronation pastry at a special Big Lunch at Westminster Abbey in London, hosted by the Dean of Westminster and attended by the Duke of Edinburgh.",
        "The quiche recipe was chosen by the King and Queen Consort because it works as a sharing dish, can be served hot or cold, suits a wide range of dietary requirements and can be easily adapted to suit different tastes.",
        "Dame Prue told the podcast: “The Duke of Edinburgh, Edward, turned up with a quiche from the royal kitchens from Buckingham Palace. A quiche.“So I was a bit surprised by this, but actually it’s a really good choice because if you think when I first came to England, quiche was something really posh and French.“Now, a quiche is just so universal. Children have them in their lunch boxes and you buy them in every supermarket and everybody loves a quiche.“So he (Edward) turned up with a quiche that was really delicious. It was very buttery, beautiful crisp pastry, no soggy bottom.“And we all ate it, but he only brought a little one, I said ‘didn’t you realise there were 25 people, not very good catering’.”Listen to the full interview with Dame Prue on the Dish podcast."
    ]
}