{
    "articleURL": "/wires/ap/article-12044497/Suit-targets-Kentucky-ban-gender-affirming-care-youth.html",
    "content": [
        "LOUISVILLE, Ky. (AP) - Several families on Wednesday challenged Kentucky's ban on gender-affirming care for transgender youths, claiming the prohibition interferes with parental rights to seek established medical treatment for their children.",
        "They are asking that a judge block a portion of a sweeping measure passed this year by the state's GOP-dominated legislature. The federal lawsuit was filed by the American Civil Liberties Union of Kentucky and the National Center for Lesbian Rights. Seven Kentucky families with transgender children are listed as plaintiffs.\"Under the Constitution, trans youth in Kentucky have the right to medically necessary care,\" Corey Shapiro, legal director for the ACLU of Kentucky, said in a statement. \"We are filing litigation today to protect against this imminent threat to their well-being and make certain they can thrive by continuing to receive medical care.\"Kentucky Attorney General Daniel Cameron's office said it was reviewing the lawsuit and \"determining next steps\" in defending the law.The Kentucky lawsuit continues a flurry of legal action across the country against laws aimed at transgender people. Nationally, Republican lawmakers have proposed hundreds of such laws, with at least 14 states restricting or banning gender-affirming care for minors.The new lawsuit challenges sections of the Kentucky law that would ban puberty blockers and hormone therapy for transgender youths. It didn't take aim at other sections dealing with school bathroom policies, guidance for teachers regarding student pronouns and rules on teaching about gender identity and sexual orientation.",
        "Democratic Gov. Andy Beshear vetoed the measure, saying it allows \"too much government interference in personal healthcare issues.\" Republican lawmakers overrode the veto.The lawsuit claims that the ban would violate the constitutional rights of Kentucky adolescents and their parents. The prohibition interferes with parents' ability to obtain established treatments for their transgender adolescent children, it said.\"If the ban goes into effect, it will have devastating consequences for the transgender plaintiffs, their families and other transgender adolescents and their families in Kentucky,\" the lawsuit said. \"The ban will deprive the transgender plaintiffs and other transgender adolescents of medical care that their doctors and parents agree is medically necessary.\"The portion of the law being challenged is set to go into effect at the end of June.The measure's supporters have said it protects trans children from undertaking gender-affirming treatments they might regret as adults. Research shows such regret is rare, however.\"We cannot allow people to continue down the path of fantasy, to where they´re going to end up 10, 20, 30 years down the road and find themselves miserable from decisions that they made when they were young,\" Republican state Rep. Shane Baker said at a rally before lawmakers overrode Beshear's veto.Transgender medical treatments have long been available in the United States and are endorsed by major medical associations.",
        "At a rally in late March against the Kentucky measure, Hazel Hardesty, a trans teenager, said the potential discontinuation of gender-affirming health care would mean \"my male puberty would continue,\" which would \"cause a lot of mental distress.\"\"People don´t even understand how it feels,\" the 16-year-old said in an interview. \"Going through the wrong puberty, every day your body is a little bit farther from what feels like you. And eventually you don´t even recognize yourself in the mirror.\""
    ]
}