{
    "articleURL": "/news/article-12045451/King-Charles-III-Coronation-weather-Cloudy-wet-London-Saturday.html",
    "content": [
        "Largely bright and dry conditions today especially in London with 20C highsRain will hit South West this afternoon before heavy downpours tomorrowSaturday set to be cloudy and wet with heavy rain across England and Wales Britons will enjoy sunshine and 20C (68F) highs today – but poor weather could put a damper on Coronation Day celebrations with showers forecast for much of the UK.",
        "Conditions will be largely bright and dry today especially in London, which will see the warmest temperatures – rain will hit the South West in the afternoon.Heavy rain, thunder, lightning and hail will strike tomorrow before Saturday is expected to be cloudy and wet with heavy rain at times across England and Wales.Anyone attending street parties or official events on Saturday might therefore need a raincoat, with downpours predicted across central, eastern and northern areas.These showers will spread to the South East, including London, by early afternoon – and, later in the day, heavier rain is expected to move into the South West.",
        "The poor outlook has raised the prospect that the Red Arrows flypast on Saturday afternoon could be cancelled in what has been described as a 'last resort' scenario.A Ministry of Defence spokesman said: 'Weather checks will take place in advance of the flypast on Saturday. Depending on the weather, there are a number of contingencies in place.'The second flypast of the Platinum Jubilee weekend last June was cancelled due to cloud and poor visibility over London on the Sunday, and bad weather also saw the Diamond Jubilee flypast in 2012 after the River Thames boat pageant called off.The Royal Air Force will assess the forecast until the last minute, and could make a decision about cancelling it only an hour before it is due to begin at 2.30pm.",
        "But the Met Office said there could also be some sunny spells on Saturday, during which it is likely to feel warm and humid.",
        "The highest temperatures of 18C (64F), forecast around the South East, would make Charles III's coronation the warmest on records going back to the start of the 20th century.Met Office deputy chief forecaster Steven Keates said: 'On Saturday we will see some heavy rain moving into the South West in the early hours which will move north eastwards through the morning.'This is likely to bring some rain to London by around lunchtime as it spreads east and north across roughly the southern third of the UK.'Further north in Scotland, northern England and Northern Ireland it will be a day of sunshine and showers before the more persistent rain moves northwards overnight. It will feel humid, especially in the south, with highs of 18C possible in London.'The forecast for later in the weekend is for heavy, possibly thundery showers 'for many parts of central, eastern and southern England, with parts of northeast England and eastern Scotland looking fairly grey and wet'.The driest and brightest weather on Sunday is predicted for western parts of the UK in Northern Ireland, Wales, western Scotland and South West England.",
        "The Met Office added: 'Monday will see another band of rain move east across the UK, followed by sunshine and showers, although there are currently some uncertainties in the timing of this.'But dry, bright and settled conditions are set to return later next week.According to Met Office analysis of coronations since Edward VII in 1902, the current warmest on record was that of George V on June 22, 1911, when temperatures reached 17C (63F).On the late Queen Elizabeth II's coronation, on June 2, 1953, the maximum temperature was just 11.8C (53.2F).Coronations during the 20th Century were also generally dull, with no sunshine recorded on George V or George VI's coronations and only 1.2 hours when Queen Elizabeth was crowned.The Met Office has no earlier records because meteorology is a relatively new science and records do not extend back to coronations in the 19th century and before."
    ]
}