{
    "articleURL": "/wires/pa/article-12054525/Prince-Princess-Wales-joined-church-procession-arriving-late.html",
    "content": [
        "The Prince and Princess of Wales and Princess Charlotte and Prince Louis were forced to join the King’s procession through Westminster Abbey as the coronation service suffered “one or two hiccups”.",
        "William and Kate were late to the service but were unable to overtake to get ahead of the King.Speaking outside St Margaret’s Church next to Westminster Abbey, the Bishop of Chelmsford, Dr Guli Francis-Dehqani, 56, said: “There were one or two things that didn’t go strictly to plan.”",
        "Pushed for details, the bishop said: “I’m not going to embarrass anyone in particular.”During the service, the Archbishop of Canterbury spent several seconds adjusting the crown as the King was officially crowned.As St Edward’s Crown was placed on the King’s head, there was complete silence in Westminster Abbey as the congregation stood for the occasion.The archbishop placed it on the King’s head firmly, before giving it a twist in an attempt to keep it on.But after the twist failed to work he lifted the crown up again, before having another go at securing it in position.After his second attempt the crown tipped forwards on the King’s head.Mr Welby then tilted it to the side before he was happy to remove his hands from the crown. There were one or two things that didn’t go strictly to plan  Bishop of Chelmsford Dr Guli Francis-Dehqani  The archbishop then leaned forward towards the King and carefully inspected the crown before eventually retreating.",
        "The official crowning of the King took about eight seconds in total.The 2,300 guests then heartily echoed the archbishop’s cry of God save the King.The crown is known to be heavy, and the King once commented on how his mother, the late Queen, said goodnight to him while wearing it so she could “get used to its weight on her head” before her coronation in 1953.The official crowning of the late Queen was also not completely smooth, as she raised her hand and appeared to give the archbishop some verbal assistance.Camilla used her index finger to adjust her hair underneath the crown five times."
    ]
}