{
    "articleURL": "/wires/ap/article-12053657/Sudan-envoys-begin-talks-amid-pressure-end-conflict.html",
    "content": [
        "ASWAN, Egypt (AP) - Sudan´s warring sides began talks Saturday that aim to firm up a shaky cease-fire after three weeks of fierce fighting that has killed hundreds and pushed the African country to the brink of collapse, the United States and Saudi Arabia said.",
        "The negotiations, the first between the Sudanese military and the paramilitary Rapid Support Forces, or RSF, since the fighting broke out on April 15, were underway in Saudi Arabia's coastal city of Jeddah, on the Red Sea, according to a joint Saudi-American statement.The talks are part of a diplomatic initiative proposed by the kingdom and the U.S. that aims to stop the fighting, which has turned Sudan´s capital, Khartoum, and other urban areas into battlefields and pushed hundreds of thousands from their homes.In their joint statement, Saudi Arabia and the U.S. urged both parties to \"actively engage in the talks towards a cease-fire and end to the conflict, which will spare the Sudanese people´s suffering.\"The statement did not offer a timeframe for the talks, though it was expected the initial session could last two-three days.The talks come after concerted efforts by Riyadh and other international powers to pressure the warring sides in Sudan to the negotiating table. Saudi Foreign Minister Prince Faisal bin Farhan welcomed the rival sides to Jeddah, saying on Twitter that he hopes the talks would restore \"security and stability\" in Sudan.",
        "Since a 2021 coup that upended Sudan's transition to democracy, the kingdom has been mediating between the ruling generals and a pro-democracy movement. After Sudan's top two generals - commanders of the military and the paramilitary - turned on each other after months of tensions and the latest fighting broke out in April, Jeddah became a hub for those evacuated by sea from Sudan´s main sea port of Port Sudan.",
        "Officials from the military and the RSF said the talks would address the opening of humanitarian corridors in Khartoum and the adjacent city of Omdurman, which have been the centers of the battles.They would also discuss providing protection to civilian infrastructure, including health facilities that have been overwhelmed and suffer from dire shortages of both staff and medical supplies, one military official said.An RSF official they would also discuss a mechanism to monitor the cease-fire, which is one of a series of truces that failed to stop the fighting. The officials spoke on condition of anonymity to discuss the talks in Jeddah.Meanwhile, Sudan's pro-democracy movement said the talks would be \"a first step\" to stop the country´s collapse and called on leaders of the military and the RSF to make a \"bold decision\" to end the conflict.The movement, which is a coalition of political parties and civil society groups, had negotiated with the military for months to restore the country´s democratic transition after a 2021 military coup led by army chief Gen. Abdel-Fattah Burhan, who also chairs the ruling sovereign council, and his deputy in the council Gen. Mohammed Hamdan Dagalo.On Saturday, Dagalo tweeted his first comment on the talks, welcoming the initiative to establish a firm cease-fire and open humanitarian corridors. \"We remain hopeful that the discussions will achieve their intended goals,\" he said.",
        "At least 550 people have been killed, including civilians, and more than 4,900 have been wounded as of Monday, according to the Sudanese Health Ministry. The Sudanese Doctors´ Syndicate, which tracks only civilian casualties, said Friday that 473 civilians have been killed in the violence and more than 2,450 have been wounded.The fighting capped months of tensions between Burhan and Dagalo. It plunged the country into further chaos and forced foreign governments to evacuate their diplomats and thousands of foreign nationals out of Sudan. Hundreds of thousands of Sudanese were displaced inside Sudan or crossed into neighboring countries as the fighting dragged on in urban areas.The U.N. refugee agency estimated that the number of Sudanese fleeing to neighboring countries would reach 860,000, and that aid agencies would need $445 million to assist them.On Saturday, unknown assailants fired on a convoy in Khartoum that included Turkish Ambassador Ismail Cobanoglu, reported Turkey´s state-run Anadolu news agency, citing diplomatic sources. There were no casualties in the shooting, the report said.The Sudanese military and the RSF traded accusations of attacking the convoy.Also, a bus carrying Sudanese fleeing the fighting, overturned in Egypt´s southern province of Beni Suef, leaving at least 36 Sudanese, including women and children, and two Egyptians injured, local authorities said.",
        "Tens of thousands of Sudanese have crossed into Egypt since the fighting broke out.___Associated Press writer Andrew Wilks in Ankara, Turkey, contributed to this report."
    ]
}