{
    "articleURL": "/sport/football/article-12041721/Stephen-Ireland-SNUBS-Lionel-Messi-Cristiano-Ronaldo-best-players-hes-faced.html",
    "content": [
        "Ireland believes he got the better of both Messi and Ronaldo when facing them The 36-year-old named a Chelsea duo as the toughest players he facedFormer Manchester City midfielder Stephen Ireland has sensationally snubbed Lionel Messi and Cristiano Ronaldo as the toughest players he faced in his career.",
        "The 36-year-old played against some of the very best players in world football throughout his career, and has now named his toughest opponents.However, the player he names ahead of Ronaldo and Messi will no doubt surprise many.Speaking to talkSPORT, Ireland revealed that Messi is not the toughest player he has faced, and revealed who is: 'Lionel Messi played [against me], he wasn't good. We won the game. I can't say that Messi is the best player I've played against because my experience in that game was that he wasn't good.'Hence why I said Cesc Fabregas. Every time I played against him, very good. Eden Hazard, very, very good. So that is my opinion based on that question. I think Hazard, he is the first name that comes to mind.'",
        "'Wayne Rooney was ridiculous, absolutely ridiculous. Rooney just had that aura about him where you looked at him and he was glowing.'But for me, Hazard is the first name that pops into my head.'Ireland continued to discuss the times he played against Ronaldo, revealing why he does not believe the 38-year-old was his toughest opponent.'I played against Cristiano Ronaldo four or five times for Manchester City against Manchester United and we won every single game we played against him,' he continued.",
        "'So it is very hard for me to say that Ronaldo is the best player I have played against. I can only go off their performance on the day against me.'Fabregas, who plys his trade for Serie B side Como, lifted the Premier League alongside Hazard twice during their time together at Stamford Bridge.Hazard left Chelsea as a Premier League legend but has since struggled with Real Madrid, while Ronaldo and Messi have left long-lasting legacies with several Ballon d'Or's between them.Ireland's admission has shocked many, with the former Stoke City midfielder adamant that he did not struggle against either of the world-class forwards during his playing career. "
    ]
}