{
    "articleURL": "/money/mortgageshome/article-12046393/Mortgage-approvals-increase-March-ahead-expected-base-rate-rise.html",
    "content": [
        "Number of mortgage approvals increased 18% in March to 52,000 Two-year fixed rate mortgage average is 5.28% and the five-year average is 5%The mortgage market saw an uptick in March as approvals for residential home loans jumped 18 per cent compared to February, according to the most recent data from the Bank of England. ",
        "However, this remains below the monthly average for 2022 of 62,700. Overall mortgage lending fell to net zero in March – the lowest level since July 2011 – down from £0.7billion in February. Mortgage rates have fallen from the 6 per cent-plus highs they reached at the end of last year, but are still more expensive than they were in early 2022.  ",
        "However, some believe they could now be set to rise again.  Hina Bhudia, partner, Knight Frank Finance, says: 'Most indicators suggest that robust levels of activity will continue into summer at least.'At least three of the largest lenders have notched rates up this week and there are now only a handful of sub-4 per cent five-year fixed mortgages left on the market.'It's hard to say whether this constitutes the beginning of a trend of rising rates or is simply the lenders trying to manage service levels by avoiding being the cheapest on the high street.'Activity is rising quite quickly, and borrowers are extremely sensitive to interest rates at the moment, so the cheapest lender on the high street tends to get swamped.' However, Bhudia warns that the Bank of England is likely to raise its base rate next week and mortgage rates may 'have to climb over the medium term' as a result.",
        "Graham Cox, founder of the Bristol-based broker, SelfEmployedMortgageHub.com,  adds, 'We certainly saw a noticeable improvement in buyer interest in March and April. 'The traditional peak buying period in spring and summer should see approvals rise steadily but they are likely to remain 20 to 30 per cent below where they were in the same period last year. 'And with more base rate hikes expected, demand is likely to remain weak for the foreseeable.'The 'effective' interest rate – the actual interest rate paid – on newly drawn mortgages increased by 17 basis points, to 4.41 per cent in March, according to the Bank of England. Mortgage rates have been slowly falling since the start of the year including a brief 'rates war' when fixed deals dropped as low as 3.75 per cent.The current two-year fixed rate average is 5.28 per cent and the five-year average is 5.00 per cent, according to MoneyFacts.",
        "TSB has also repriced its two-year fixed remortgage deals up to 75 per cent loan to value this week, after briefly withdrawing them. The lender said the move was part of a regular review of its products and external market conditions.Recent fluctuations in swap rates, the mechanisms which show what financial institutions think the future holds concerning interest rates, have made it hard for lenders to price their products and insure themselves against the lending through hedging.",
        "Chris Sykes, technical director at the Private Finance mortgage brokerage explains that if a lender is coming to the end of a pot of money it has already hedged, they need to be careful with lending if they don't know the cost of the next hedge. 'Additionally, lenders will have certain targets for subcategories of business, for example they'll want a certain percentage of their business to be remortgage, within that they'll want a certain percentage to be remortgages of 0-75 loan to value. 'If they've got near to a quota on any of these, they'll temporarily remove rates while other business offsets this,' he says. ",
        "Borrowers who need to find a mortgage because their current fixed rate deal is coming to an end, or because they have agreed a house purchase, should explore their options as soon as possible.This is Money's best mortgage rates calculator powered by L&amp;C can show you deals that match your mortgage and property valueWhat if I need to remortgage? Borrowers should compare rates and speak to a mortgage broker and be prepared to act to secure a rate. Anyone with a fixed rate deal ending within the next six to nine months, should look into how much it would cost them to remortgage now - and consider locking into a new deal. Most mortgage deals allow fees to be added the loan and they are then only charged when it is taken out. By doing this, borrowers can secure a rate without paying expensive arrangement fees.What if I am buying a home? Those with home purchases agreed should also aim to secure rates as soon as possible, so they know exactly what their monthly payments will be. Home buyers should beware overstretching themselves and be prepared for the possibility that house prices may fall from their current high levels, due to  higher mortgage rates limiting people's borrowing ability.How to compare mortgage costs The best way to compare mortgage costs and find the right deal for you is to speak to a good broker.You can use our best mortgage rates calculator to show deals matching your home value, mortgage size, term and fixed rate needs.Be aware that rates can change quickly, however, and so the advice is that if you need a mortgage to compare rates and then speak to a broker as soon as possible, so they can help you find the right mortgage for you.&gt; Check the best fixed rate mortgages you could apply for ",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}