{
    "articleURL": "/sport/football/article-12057593/Erik-ten-Hag-insists-wants-David-Gea-extend-Man-United-contract-despite-mistake.html",
    "content": [
        "Manchester United lost 1-0 to West Ham in the Premier League on SundayDavid De Gea allowed Said Benrahma's strike to slip through his handsThe goalkeeper is on £375,000 a week and in talks over a new deal  Erik ten Hag insisted he wants David De Gea to extend his Manchester United contract on the night that the goalkeeper's gaffe cost them at the London Stadium.",
        "De Gea's howler in the 27th minute, when Said Benrahma's hopeful shot from 20 yards slipped over his glove, has cut United's lead over Liverpool to a single point.De Gea, who is paid £375,000 per week, has been locked in talks over a new deal for some time. He must accept a pay-cut to stay at United, according to reports, and Sunday night's mistake led to talk among supporters whether a new goalkeeper is needed instead.The Sports Agenda column reported on Sunday that talks are progressing positively.'We want him to stay and we want him to extend his contract,' Ten Hag said. 'He has the most clean sheets in the Premier League. We would not be here in this position without him.'I believe there are no concerns. It happens. As a team, you have to deal with it, show character, be resilient, bounce back and that's what this team will do.",
        "'We started well, we dictated the game, we created chances, we didn't take them, and then one mistake. In three days, twice individual mistakes makes us lose games.'Ten Hag was referring to Luke Shaw's handball at Brighton which led to United's 1-0 loss. On the race to secure Champions League football, with Liverpool chasing United, Ten Hag added: 'It's not about Liverpool. It's about us. We have everything in our hands.'",
        "This win led West Ham to relative safety in the Premier League. 'It leaves us much better, much harder for the other teams to catch us,' David Moyes said. 'They'll find it very difficult to get the points.'Captain Declan Rice added: 'It's massive. We had our eye on this game as one we could win in front of the home fans. That's our best performance at home this season – front foot, aggressive, one v one, on the ball – everything was a real positive performance.'As a player, the whole world is watching. For me, for the lads, you put on the shirt, you go out there and you want to do it. You're playing against Manchester United. You want to do it and we did it so I'm buzzing.'As players you can't help to look around you. To win this one was big, to give ourselves a gap between ourselves and the bottom. Mathematically, you still need 40. We've got our (Europa Conference League) semi-final on Thursday and then we go to Brentford.'",
        "De Gea's error was seized upon by the BT Sport pundits, with Peter Crouch saying: 'He's had a shocker. We can't dress it up. If you look at De Gea's position, he can't get on the front foot. It's a terrible mistake.'",
        "Former United defender Rio Ferdinand added: 'No you can't (justify the mistake). It's a bad mistake, I think he'll take full responsibility. 'His left foot does slip slightly but that's no excuse. He's got full contact on the ball, a whole hand on the ball, it's not like he's stretching and getting finger tips, he got a whole hand. 'He misses it completely and it's a big, big mistake.'"
    ]
}