{
    "articleURL": "/sport/football/article-12045791/Neymar-likes-Instagram-post-labelling-PSG-SMALL-club-star-appears-hit-fans.html",
    "content": [
        "Neymar posted a message of his own calling to 'bring' people 'into your peace' The Brazilian has been in stunning form this season with 18 goals and 17 assists PSG condemn supporters calling for Neymar's exit outside the player's HOME Neymar has seemingly sent an indirect barb back at PSG fans in apparently liking an Instagram post calling the French side 'a small club'.",
        "The 31-year-old is a somewhat divisive figure in Paris, having received plenty of backlash from the PSG ultras in his period at the club, frequently being booed on the pitch, and his future at the club is still uncertain.The Brazilian forward's popularity at the Ligue 1 outfit has plunged further still in recent weeks, with supporters taking it upon themselves to gather outside his home and chant for him to leave the club.However, it would appear that he has sent a veiled retort to those fans, in liking a social media post decrying the club's stature and claiming that PSG are 'lacking'.'The difference between being great and having greatness!' The caption reads. 'PSG has lacked and is lacking, its fans have lacked and are lacking!",
        "'Having history is not optional, position yourself as great and have the attitude of greatness is within reach! They were SMALL!'Paris Saint-Germain condemned the actions of their supporters in a tumultuous week at the club that has seen them suspend fellow forward Lionel Messi. The Argentine took an unauthorised trip to Saudi Arabia, believed to be part of his £25million-a-year ambassadorial deal with the country, which left the club suspending him for a fortnight, missing two Ligue 1 matches as a result. ",
        "Messi was as such another target of the fans' ire, with fans chanting for the World Cup winner to leave, having recently jeered the Argentine in home matches.And Neymar once more fanned the flames on social media, liking a post suggesting he and Messi were unhappy at PSG, with a picture of the pair smiling and embracing while in Barcelona colours.'I know you think the same thing,' read the caption beneath the post. 'They were VERY happy back then!'The like from Neymar quickly disappeared, but eagle-eyed social media users still picked it up.The Brazilian - an active social media user - also posted a non-too cryptic message on his own account after supporters had visited his home, seeming to suggest he was not put off by the fans' calls.",
        "'Don't let people drag you into their storms, bring them into your peace,' he wrote. While Messi's future is at last certain with confirmation that he will leave the Paris outfit at the end of the season, there is less clarity when it comes to his team-mate. Neymar has been touted as a potential transfer option for the likes of Manchester United and Chelsea in recent weeks, and is still under contract until 2027. So far this season, Neymar has been in scintillating form with 18 goals and 17 assists in just 29 games, but is currently out with a sixth ankle injury after having surgery following the World Cup."
    ]
}