{
    "articleURL": "/wires/reuters/article-12061459/PwC-Australia-CEO-steps-tax-documents-leak-scandal.html",
    "content": [
        "SYDNEY, May 9 (Reuters) - PricewaterhouseCoopers (PwC) said the CEO of its Australian business had stepped down effective immediately after the auditor became embroiled in a scandal that involved leaking confidential government tax plans.",
        "Tom Seymour has resigned, PwC said in a statement late on Monday, and the firm named its assurance leader Kristin Stubbins as acting CEO while it searches for a replacement.\"We are committed to learning from our mistakes, listening to our stakeholders and enhancing our culture to build stronger trust and transparency,\" Stubbins said.PwC Australia has come under intense pressure this year after local media reported a former partner had been banned by the country's tax practitioners board for sharing government tax plans with other staff at the firm.The Australian Financial Review (AFR) reported Seymour last week issued a statement saying that he was one of the partners who had received the sensitive details. A PwC spokesperson told Reuters that information was accurate.The revelations drew a strong rebuke from the Australian federal government, a major client of PwC, with Treasurer Jim Chalmers describing it as a \"shocking breach of trust.\" Some lawmakers have called for a total ban on the auditor getting more government contracts.\"Flogging off the confidential information to make a buck is not consistent with the sort of good faith that we want to see when we consult business on changes, whether it's tax changes or other changes,\" Chalmers said last Friday.PwC received A$537 million ($364 million) in federal government contracts during the past two years, according to the AFR, while a recent audit showed the government had spent just under A$21 billion on external consultants during the financial year ended June 30, 2022.",
        "PwC did not immediately respond to a request seeking details about the contracts. ($1 = 1.4743 Australian dollars) (Reporting by Renju Jose in Sydney; Editing by Jamie Freed)"
    ]
}