{
    "articleURL": "/wires/reuters/article-12060381/US-push-UN-censure-North-Korea-appears-stall-diplomats.html",
    "content": [
        "By Michelle Nichols",
        "UNITED NATIONS, May 8 (Reuters) - U.N. Security Council negotiations on a U.S. push for the 15-member body to condemn North Korea's intercontinental ballistic missile (ICBM) launches appear to have stalled after some diplomats said China and Russia had stopped engaging.Council members have been discussing a U.S.-drafted formal statement, seen by Reuters, that has to be unanimously agreed. U.S. Ambassador Linda Thomas-Greenfield said in February she would pursue a formal presidential statement - one step below a resolution - to condemn North Korea's action and urge diplomacy.\"The Security Council expresses serious concern over the resulting escalation in tensions and strongly urges the DPRK to refrain from conducting ICBM or other ballistic missile launches or a nuclear test,\" the draft statement reads.North Korea's formal name is the Democratic People's Republic of Korea (DPRK). It has been under U.N. sanctions for its missile and nuclear programs since 2006.China and Russia's missions to the United Nations did not immediately respond to a request for comment on the draft. Diplomats said both had initially proposed amendments to the draft, but had now stopped engaging in talks.The United States \"accepted edits from all those who provided them; the very few edits that were not incorporated received pushback from other council members as being unacceptable,\" said a U.N. diplomat familiar with the talks, who spoke on condition of anonymity.",
        "For the past several years the council has been divided over how to deal with Pyongyang. Russia and China, veto powers along with the United States, Britain and France, have said more sanctions will not help and want such measures to be eased.China and Russia blame joint military drills by the United States and South Korea for provoking Pyongyang, while Washington accuses Beijing and Moscow of emboldening North Korea by shielding it from more sanctions. (Reporting by Michelle Nichols; editing by Jonathan Oatis)"
    ]
}