{
    "articleURL": "/sport/cricket/article-12055107/Stirling-named-Irelands-15-man-squad-England-Test-Little-sit-Lords-clash.html",
    "content": [
        "Cricket Ireland had allowed Stirling to concentrate on limited-overs cricketThe 32-year-old returned to the format with a maiden hundred in Sri Lanka Left-armer Little is having his workload managed during the June fixtureIreland have included Paul Stirling in their Test squad to face England next month but have rested Indian Premier League star Josh Little.",
        "Stirling is set to win his fifth cap on his former home ground of Lord’s despite Cricket Ireland previously allowing him to concentrate on limited-overs cricket in 2023.The 32-year-old returned to the format with a maiden hundred in Sri Lanka a fortnight ago after two one-day internationals were replaced by a second Test between the countries.Stirling, who spent a decade representing Middlesex at the ground, appeared against England at Lord’s in 2019 when the away side threatened to pull off an historic win before capitulating for 38 in the final innings of the match.Ireland had opened up credit on England’s first innings with just two wickets down, but could not sustain their dominance and failure to dislodge nightwatchman Jack Leach until he had scored 92 proved the turning point.",
        "Andrew Balbirnie (captain), Mark Adair, Curtis Campher, George Dockrell, Fionn Hand, Graham Hume, Tom Mayes, Andrew McBrine, James McCollum, PJ Moor, Conor Olphert, Paul Stirling, Harry Tector, Lorcan Tucker (wkt), Craig Young. ",
        "Left-armer Little, meanwhile, is having his workload managed during the June 1-4 fixture that opens England’s international summer and warms up Ben Stokes’ team for the Ashes.The 23-year-old, who plays for reigning champions and current IPL leaders Gujarat Titans, is featuring in his country’s ODIs versus Bangladesh in the next few days before returning to India for the tournament finale.",
        "‘Regarding Josh Little, although the IPL will have finished, we are very conscious of the need for Josh to rest, recover and prepare for what will be a busy and important summer for us in white-ball cricket,’ said Ireland’s national selector Andrew White."
    ]
}