{
    "articleURL": "/wires/aap/article-12053797/Heart-bypass-machine-helping-cardiac-arrest-patients.html",
    "content": [
        "A machine originally used during the swine flu and COVID-19 pandemic is revolutionising treatment for some Australian cardiac arrest patients by increasing survival chances from five to 50 per cent.",
        "The heart bypass program uses a portable machine to treat cardiac arrest patients at the scene, Sydney cardiac anaesthetist and lead researcher into the implementation of this approach in NSW, Natalie Kruit, said.Speaking at the Australian and New Zealand College of Anaesthetists conference on Saturday, Dr Kruit said Victoria was the only state where the technology was being used. NSW is still undergoing training.\"We have this technology available to us and we need to provide equity of access to patients, particularly in NSW in western Sydney,\" she said.\"We can't get patients back into hospital in time to be able to use this machine. Only nine per cent of patients are getting to hospital in time.\"Only four major Sydney hospitals are consistently using the technology.\"We need a service that actually goes to the patient. A lot of patients are in western Sydney where it takes them 20 minutes to get to a hospital,\" Dr Kruit said.A roving service would treat 90 per cent of them in the crucial 40-minute window after a cardiac arrest. At 20 minutes survival is less than five per cent.\"If you take them (patients) to hospital to put them on this machine, their survival rates jump up to 30 per cent,\" Dr Kruit said.",
        "\"That's not as much as we want to see and the reason for that is there's a prolonged period to get them to hospital. If we take that machine to patients we can increase that up to 50 per cent.\"So you can take a population of patients that are basically dead and we use this machine to perform this surgery by the side of the road, at someone's work or home.\"NSW ambulances are training emergency doctors to go to the scene in a group of three - two doctors and a paramedic - to undertake the surgical procedure as a pre-hospital treatment.The procedure is used in the US, France, Germany, the Netherlands and England.There have not been any significant advancements in cardiac arrest survival since the introduction of the defibrillator.Dr Kruit said cardiac arrest management was still inadequate but the bypass treatment, as part of a new pre-hospital ECPR (extra-corporeal cardiopulmonary resuscitation) study, was radical.\"It's really had an impact on cardiac arrest survival,\" she said.\"If the heart is not working, a machine that can bypass the heart, giving it time to recover, is the perfect treatment for someone in cardiac arrest. These patients have traditionally had bad outcomes.\"The treatment is veno-arterial ECMO (extra corporeal membrane oxygenation). It basically does the work of the heart when it is not working and provides blood to the brain during cardiac arrest.",
        "\"Perhaps the biggest challenge we are facing is getting these patients on to ECMO in a reasonable time frame,\" Dr Kruit said.\"Patients can then be put on an ECMO machine in hospital that will bypass the heart and protect the brain until the blockage in their heart is fixed.\"Without ECMO, 95 per cent of patients won't make it.\""
    ]
}