{
    "articleURL": "/wires/reuters/article-12059707/EU-Israel-cancels-Europe-Day-event-far-right-ministers-participation.html",
    "content": [
        "JERUSALEM, May 8 (Reuters) - The European Union delegation in Israel on Monday cancelled its Europe Day diplomatic reception over the planned participation of far-right Israeli minister Itamar Ben-Gvir, who criticised the decision as a form of \"silencing\".",
        "\"Regrettably, this year we have decided to cancel the diplomatic reception, as we do not want to offer a platform to someone whose views contradict the values the EU stands for,\" the delegation said in a statement.Brussels marks May 9 as \"Europe Day\", honouring a 1950 French declaration that led to the founding of the body that became the EU. National Security Minister Ben-Gvir was set to represent the Israeli government at this year's reception.The EU reaction, however, underlines the diplomatic upsets facing the religious-nationalist coalition led by Prime Minister Benjamin Netanyahu, whose alliance with Ben-Gvir and fellow pro-settler leader Bezalel Smotrich has caused unease even among Israel's international allies.Ben-Gvir, head of the far-right Jewish Power party, was convicted in 2007 of racist incitement against Arabs and backing a group considered by Israel and the United States to be a terrorist organisation.\"It is a shame that the European Union, which claims to represent the values of democracy and multiculturalism, is engaging in undiplomatic silencing,\" Ben-Gvir said in a statement.\"Friends know how to express criticism and true friends also know how to hear it,\" he said.Netanyahu is himself still waiting for an invitation to visit Washington, and opposition leader Yair Lapid accused the government of \"picking unnecessary fights\".",
        "\"Managing Israel's foreign relations is a complex matter that requires expertise and a smart approach,\" he said in a tweet.Some Israeli human rights groups who said they were invited to participate in the event issued a statement supporting its cancellation.\"We welcome the European Union's decision to refrain from giving a platform and legitimacy to Minister Ben Gvir who promotes racist and discriminatory policies towards the communities we represent,\" the groups said.A separate cultural event for the Israeli public will continue as planned \"to celebrate with our friends and partners in Israel the strong and constructive bilateral relationship,\" the EU delegation in Israel said. (Writing by Henriette Chacar; Editing by Ari Rabinovitch, Nick Macfie, William Maclean)"
    ]
}