{
    "articleURL": "/wires/pa/article-12057573/Steve-Cooper-aware-importance-Nottingham-Forest-s-clash-Southampton.html",
    "content": [
        "Nottingham Forest boss Steve Cooper is in no doubt as to how big Monday night’s clash with Southampton is in his side’s bid to beat the drop.",
        "Forest are currently in the bottom three and the visit of the Saints to the City Ground looks set to go a long way in deciding which division both clubs will be in next season.Victory for Forest would move them out of the relegation zone and virtually condemn their visitors to the drop, while defeat would send them nearer to an instant Championship return.Cooper says everyone at the club knows how important the game is.“Of course we do,” he said. “What’s really important is about ignoring any situations that we’ve found ourselves in throughout the season, whether it was preparing for the return to the Premier League, the initial start and going through a difficult run early on to getting a few points and managing to come out of that, injuries, the run that we went on and the last few weeks.“We’ve always talked about the present, and the present situation is we’re in the last month of the season with four games remaining and be open and have conversations with each other about what’s needed and what’s required so that we can be aware.",
        "“We don’t want any surprises.“We know that Monday is really important, we knew that last Saturday and the Wednesday before that was really important. We have to use that importance as real motivation and real desire, while at the same time really focusing on what it takes to achieve what we want.",
        "“It’s about how we win, that’s what we’re focused on.”If Forest do stay up it will be because of their home form, where they have taken 24 of their 30 points so far.The City Ground atmosphere has played a part in that and Cooper says each matchday has been an event.“It’s an event, a real togetherness,” he said. “I feel it and I mean it, that you feel part of something that’s bigger than a football team, and a player and a coach or whatever.“You feel really proud of what can be achieved on a matchday. It’s a belonging of something big in the city and I think it drip-feeds out of the stadium as well. That’s a good feeling and gives me a lot of joy.“That’s why we’re so desperate to get the performances and more importantly the results because we know the effect it has on everybody connected to the football club and further than that.”"
    ]
}