{
    "articleURL": "/tvshowbiz/article-12044417/Pregnant-Ireland-Baldwin-shares-snaps-fruit-themed-nursery-little-girl-Holland.html",
    "content": [
        "Three days after pranking her pals into thinking she'd given birth, Ireland Basinger Baldwin posted a slideshow of pictures of the fruit-themed nursery for her first child, daughter Holland, arriving any day now.",
        "The expecting 27-year-old's babydaddy - Grammy winner RAC - Instastoried a snap of her strapped into a GE Corometrics 170 Series Fetal Monitor on Wednesday.The couple relocated from Los Angeles to Gearhart, Oregon during the peak of the pandemic for a quiet new life, and are now excited to welcome their first child.'We're naming her Holland. I'm Ireland, so another country name because we wanted to keep that consistent,' Ireland told the Girlboss Radio with Avery podcast on January 31.'And then I love the actress Holland Taylor. I've always loved that name since I was young, I just thought that was such a classy, beautiful name, so we're going with Holland.'Baldwin gave a special shout out to illustrator Jax Ko - who 'killed it' hand-painting the mural featuring watermelon, pineapples, avocados, oranges, strawberries, cherries, dragon fruit, bananas, and lemons.",
        "'I had so much fun styling this fruit-themed nursery for our little girl!' the SoCal native - who boasts 884K Instagram/TikTok followers - gushed.'And of course @rac built [the crib] because if something has more than four instructions, I'm not doing it. I thrifted so many fruit-themed goodies.'The furniture we chose were pieces from my childhood. And of course I spent way too much money on @jellycat stuffies because I had no choice.'",
        "Coincidentally, Ireland's famous father - Oscar nominee Alec Baldwin - voiced a character called Mayor Strawberry in the animated series, The Fruitties Are Back.At 38, the Portuguese-American musician (born André Allen Anjos) is 11 years older than Baldwin, but they've been inseparable as far back as July 2021.The parents-to-be - who've adopted five dogs - hosted their wild March 6th baby shower at Hollywood pasties-only strip club, Jumbo's Clown Room, which was attended by her famous mother, Oscar winner Kim Basinger.The 69-year-old Southern belle and the 65-year-old Long Islander's seven-year marriage bitterly ended in divorce in 2002 after a contentious custody battle.Alec is currently hard at work on the Montana set of his troubled western Rust, which will be executive produced by Matthew Hutchins, whose cinematographer wife Halyna was accidentally shot by Baldwin in 2021.",
        "On April 20, New Mexico prosecutors mysteriously dropped the involuntary manslaughter charges against the fertile father-of-eight after 'new facts were revealed that demand further investigation and forensic analysis.'Ireland and the Antecipação musician officially opened their small-bites and wine restaurant Good Times in Gearhart, Oregon on April 6.Baldwin is also a self-described 'writer' and occasional model who's still represented by DT Model Management in Los Angeles.The heavily-tattooed nepo baby's last gig was appearing in St. Lucia's music video for their song Gimme the Night, which dropped October 7."
    ]
}