{
    "articleURL": "/sport/nba/article-12058411/76ers-hero-James-Harden-reveals-inspired-form-GOSPEL-SONG.html",
    "content": [
        "James Harden was back on top form for the 76ers on Sunday vs. CelticsHe revealed how a song sent to him by Doc Rivers inspired him back to formDailyMail.com provides all the latest international sports newsJames Harden has revealed he was inspired by a gospel song sent to him by his Philadelphia 76ers coach Doc rivers before his 42-point game-winning display against Boston Celtics on Sunday night.",
        "Harden's 42 points in Game 4 were crowned by a three-pointer in overtime for a 116-115 triumph that levels the series between two of the heavyweights of the Eastern Conference.In truth Harden has been in impressive form for weeks but dipped in Games 2 and 3 against the Celtics, who moved into a 2-1 series lead before Sunday's game.It was Rivers who first revealed his message, saying with a smile: 'I sent him a gospel song. The title of it is, 'You Know My Name''Harden then offered a more detailed explanation, saying: 'I'm on my way to the game, and I get a text from Doc.",
        "'It's a gospel song, and I'm like, 'All right, whatever.' So, I just tell my homies, 'Let's play the song.' It's a seven-minute song, but I let the whole song play.'I was like, 'All right, there's got to be some kind of good juju in this song, or however he's feeling, I want to feel like that.' And I guess it worked.'The song is by Tasha Cobbs Leonard and features voals by Jimi Cravity. It was released in 2017.Harden continued: 'I just want to win. No matter how it plays out, I just want to win. 'Quite frankly, today was a do-or-die for us. We found a way to win, and that's all that matters in the postseason.'",
        "His 76ers teammate, P.J. Tucker, said that he thinks Harden is unplayable when he plays the way he did on Sunday.'Nobody can guard Joel one-on-one,' Tucker said. 'There's no way. I'm sorry. 'I've guarded him for a lot of years, and when he's aggressive and assertive, it's impossible.'",
        "MVP Joel Embiid echoed Tucker's comments.'That's what he needs to do every night,' Embiid said of Harden. 'Not think about anything.'It's not about taking a lot of shots. It's just about being aggressive, attacking the rim, finding guys, and he was fantastic tonight.'Game 5 between the 76ers and the Celtics is on Tuesday night, back in Boston."
    ]
}