{
    "articleURL": "/wires/ap/article-12045205/Stock-market-today-Asian-markets-higher-US-rate-hike.html",
    "content": [
        "BEIJING (AP) - Asian stock markets were mixed Friday after Wall Street sank on worries about the health of U.S. banks that are under pressure from interest rate hikes.",
        "Shanghai declined while Hong Kong and Sydney advanced. Markets in Japan and South Korea were closed for holidays. Oil prices advanced.Wall Street's benchmark S&amp;P 500 index lost 0.7% on Thursday as investors worried about the health of banks following three high-profile failures in the United States and one in Switzerland.Shares of PacWest Bancorp, a target of investor scrutiny, tumbled 50.6%. The bank said it was considering options and has been approached by potential partners and investors.Investors are watching what steps authorities might take to \"limit further contagion risks,\" Yeap Jun Rong of IG said in a report. \"Any inaction over the weekend could translate to a more downbeat risk environment to start next week.\"The Shanghai Composite Index shed 0.7% to 3,326.18 while the Hang Seng in Hong Kong gained 0.6% to 20,063.58.",
        "Sydney's S&amp;P-ASX 200 rose 0.3% to 7,213.90. New Zealand and Southeast Asian markets declined.On Wall Street, the S&amp;P 500 fell to 4,061.22. The Dow Jones Industrial Average dropped 0.9% to 33,127.74, putting it in negative territory for the year. The Nasdaq composite fell 0.5% to 11,966.40.Rate hikes by the Federal Reserve and other central banks in Europe and Asia have put pressure on banks by causing the market prices of bonds on their books to decline. Investors worry depositors might pull money out of lenders that are thought to be troubled, worsening their financial pressures.",
        "Shares of Western Alliance Bancorp plunged as much as 61% after The Financial Times said the Phoenix-based bank was considering selling its business. The company denied the report. Its stock ended the day down 38.5%.This week, regulators seized First Republic Bank and sold most of it to JPMorgan Chase.Officials have stressed they see the banking system is sound and secure, but the worries aren´t leaving the market.On Wednesday, the Federal Reserve announced another increase that raised its key overnight rate up to a range of 5% to 5.25% from close to zero early last year.Traders expect at least a brief U.S. recession this year. They expect the Fed to start cutting rates in the second half of the year to prop up economic growth, though chair Jerome Powell said this week he doesn't see cuts coming so early.Investors worry that even without more bank failures, the industry turmoil might lead smaller institutions to reduce lending. That might push up borrowing costs, putting more downward pressure on economic growth.A report Thursday showed the number of U.S. workers filing for unemployment last week accelerated a bit more than expected. A resilient job market is one of the main pillars propping up the slowing economy.A more comprehensive government report on employment is due out Friday.",
        "The Fed indicated Wednesday it might be finished with rate hikes for now, but the president of the European Central Bank, Christine Lagarde, on Thursday said, \"we are not pausing.\" The ECB announced another rate hike but by a smaller margin of one-quarter percentage point.Helping to support stocks despite all the worries has been a largely better-than-feared earnings reporting season.Companies in the S&amp;P 500 are still on track to report a second straight quarter of profit drops, but the results have mostly been better than expected.In energy markets, benchmark U.S. crude rose 43 cents to $68.99 per barrel in electronic trading on the New York Mercantile Exchange. The contract fell 4 cents on Thursday to $68.56. Brent crude, the price basis for international oil trading, added 47 cents to $72.97 per barrel in London. It advanced 17 cents the previous session to $72.50.The dollar declined to 134.01 yen from Thursday's 134.14 yen. The euro gained to $1.1042 from $1.1016."
    ]
}