{
    "articleURL": "/news/article-12058233/Huge-waves-Sydney-beaches-including-Bondi-Coogee-Maroubra-Bronte-Tamarama.html",
    "content": [
        "Severe weather warnings in place in NSWStrong wind gusts created chaos in SydneyBeaches closed, flights cancelled Wild weather and powerful winds smashing Australia's east coast have caused widespread havoc, with dozens of flights cancelled and popular beaches closed as monster waves pounded the coast.",
        "Chilly and gusty southerly winds pummeled the NSW coast on Monday, with Sydney and surrounding regions in the firing line with gusts of 52km/h.A severe weather warning remains in place for the Sydney and Illawarra regions, with damaging winds and hazardous surf warnings along the coast.Up to 50 domestic flights have been cancelled at Sydney Airport since 6 am due to the closure of two of the three runways.Waves of up to six metres lashed the Sydney coast on Monday, prompting lifeguards to close a number of beaches, including Coogee, Maroubra, Bronte, Tamarama and Cronulla due to 'extremely dangerous condition",
        "The massive waves attracted hundreds of curious beach watchers along the coast as brave surfers ventured out in the powerful surf.'It was the biggest swell I've seen at Coogee, there was at least 300 people watching form the dog park,' one local posted.While Bondi and the northern beaches remain open, swimmers and surfers are warned that could change.'The weather forecast indicates strong winds and elevated swell conditions along our beloved coastline. As much as we love the thrill of the ocean, it's crucial to prioritise safety and exercise caution during these conditions,' Northern Beaches Council posted.The mercury dipped to 10.5C at Sydney Airport 4am Monday, but the apparent temperature was a chilly 8C as cold winds blasted the Harbour City.",
        "No international routes were disrupted, but the conditions impacted on other domestic flights across the country heading for Sydney.'This decision is purely weather-related – crosswinds on the parallel runways are up to 56km/h, and stronger gusts are possible,' a Sydney airport spokesperson said.Passengers heading to airport are urged to check with their airline for the latest updates.Parallel runway operations are expected to return later on Monday when wind conditions are expected to ease.Sydney is expected to reach a top of 18C of Monday, but it it will feel much colder due to the blustery winds.It comes after a massive cold front saw temperatures plummet by up to 10C below average across south-east Australia, bringing rain, hail, snow and blustery conditions.Sydneysiders shivered through the city's coldest night in decades as temperatures plummeted to 7.1C, its lowest temperature this early in autumn for 85 years.The return of clear skies and lighter winds will cause frigid overnight temperatures, with frost likely to affect large areas of Queensland, NSW and the ACT.While the cold front is expected to move offshore, a second blast of cold air is expected to come in from the south of the country over the next few days.",
        "'We've seen a narrow band of storm wrapping up the coast, which is an equivalent of a category two cyclone,' meteorologist Tony Auden told Sunrise on Monday.",
        "'Thankfully they're not on the coast but we have a lot of wind over land, warnings for damaging wind gusts up to 100k/h south of Sydney down to Ulladulla with gusty winds up to 50k/h wrapping around up as far as northern NSW and Queensland as well.'Those winds are whipping a huge seas, potentially with wave heights up to 8-9m off NSW coast. As that low moves away, that energy source to move north and away.''We are expecting a fair bit of erosion on beaches and could see inundation in low-lying areas.'Melbourne was also chilly on Monday with a top of 15c expected after the mercury plunged to 7.5C at Melbourne Airport earlier in the morning which felt more like 1.6C.Parts of south-eastern Australia shivered through their lowest May temperatures in years over the weekend.",
        "Temperatures plummeted below the May average by as much as 5C in NSW, 8C in South Australia and 10C in Tasmania.Ski resorts also welcomed falls of fresh powder a month out from the start of ski season.While low pressure systems over the Tasman Sea are not uncommon at this time of year, this one caused a unique set of conditions that resulted in unusually low temperatures, and snow levels, for this early in autumn,' Weatherzone said.",
        "'The combination of cold southerly winds near the surface and abundant moisture in the middle and low levels of the atmosphere allowed a phenomenon known as the 'melting effect' to occur above parts of eastern Vic, eastern NSW and the ACT on Sunday.'",
        "Snow is expected to fall at 600m in Tasmania, 800m in Victoria and as low as 900m in NSW, according to Bureau of Meteorology senior meteorologist Dean Narramore.'We've seen temperatures anywhere from four to eight degrees below average in Tasmania, Victoria and NSW and on Monday that cold air will get up into Queensland,' Mr Narramore said.'We're likely to see widespread inland frosts through northern Victoria, much of NSW. We could even see frosts get up into parts of Queensland on Monday and Tuesday.'Mr Narramore described it as 'a sure sign that winter is on its way.'Another cold front is expected to impact Western Australia on Wednesday, bringing with it rain, storms and strong winds, Mr Narramore said.It's expected to bring wet and cold weather to Adelaide on Thursday, before weakening and moving into Victoria and Tasmania.",
        "PERTH Monday: Min 15, Max 25. Possible shower.Tuesday: Min 15, Max 25. Showers increasing.Wednesday:  Min 15, Max 21. Showers.Thursday: Min 8, Max 19. Partly cloudy. ADELAIDEMonday: Min 8, Max 17. Shower or two.Tuesday: Min 15, Max 25. Showers increasing.Wednesday:  Min 15, Max 21. Showers.Thursday: Min 8, Max 19. Partly cloudy. MELBOURNEMonday: Max 15. ShowersTuesday: Min 9, Max 19. Shower or two.Wednesday:  Min 9, Max 19. Partly cloudy.Thursday: Min 10, Max 21. Mostly sunny. HOBARTSunday: Max 12. Possible shower.Monday: Min 3, Max 15. Shower or two.Tuesday: Min 8, Max 15. Shower or two.Wednesday:  Min 7, Max 15. Cloudy.Thursday: Min 6, Max 16. Mostly sunny. CANBERRAMonday: Min -1, Max 13. Frost, mostly sunny.Tuesday: Min -1, Max 15. Frost, partly cloudy.Wednesday:  Min 0, Max 16. Sunny.Thursday: Min 1, Max 16. Partly cloudy. SYDNEYMonday: Min 9, Max 18. Shower or two, windy.Tuesday: Min 10, Max 20. Mostly sunny.Wednesday:  Min 10, Max 20. Possible shower.Thursday: Min11, Max 21. Shower or two. BRISBANEMonday: Min 10, Max 22. Sunny.Tuesday: Min 7, Max 23. Sunny.Wednesday:  Min 11, Max 24. Mostly sunny.Thursday: Min 13, Max 23. Shower or two. DARWINSunday: Max 33. Sunny.Monday: Min 24, Max 34. Sunny.Tuesday: Min 24, Max 34. Mostly sunny.Wednesday:  Min 22, Max 33. Sunny.Thursday: Min 22, Max 33. Sunny. Source: Bureau of Meteorology"
    ]
}