{
    "articleURL": "/wires/afp/article-12058255/Hong-Kongs-bamboo-scaffolders-preserve-ancient-technique.html",
    "content": [
        "Mo Jia Yu wraps his legs around a pole to balance high above the ground and secure a joint, a skill he must master to become a bamboo scaffolder in Hong Kong.",
        "The metropolis is one of the world's last remaining cities to use bamboo scaffolding in modern construction and building repair.Scaffolders perched on bamboo frames several storeys high are a common sight, and are nicknamed \"spiders\" by Hong Kongers for their agility over the web-like latticework.Mo is among dozens of students who enrol each year at the city's Construction Industry Council (CIC) to learn the traditional method.",
        "\"You have to have a daring heart,\" said Mo, who has been at the school for nearly three months.\"You have to be aware of safety because you are working high up in the air.\"Students learn how to firmly saddle the bamboo frame so that they can free up their hands to work on the scaffolds, which are held together with simple knots tied using nylon strips.\"This basic knot is something we learn first... we practise for an entire week to get it right,\" said another student, Ho Cheuk Wai.\"Then, the instructors will teach us how to put on the safety harness, and step-by-step we learn how to build all the way to the top.\"",
        "Scaffolding using bamboo dates back centuries and was once a widespread practice across China and elsewhere in Asia.Most cities in the region have phased it out to favour materials such as steel and aluminium.",
        "In Hong Kong, intricate bamboo webs are still part of the cityscape, latticed around both old residential flats and glitzy skyscrapers.- 'Courage and skill' -Scaffolding is regulated by strict safety guidelines but is still viewed as a dangerous profession since the work is often done at dizzying heights.",
        "\"You need courage as well as skill to survive,\" said Wallace Chang, a professor at Hong Kong University's architecture department.\"This deters people from going into the industry.\"Despite the perils involved in the craft, Chang hopes Hong Kong will preserve it as part of its cultural heritage.Its popularity in the city is due to both price and efficiency.Bamboo is readily available across the border in southern Chinese provinces. A pole costs around HK$15 (US$2) compared with HK$280 (US$35) for one made of metal.",
        "Lightweight bamboo is also easier to transport through a cramped urban centre.It is flexible, allowing builders to cut poles to desired lengths for different construction sites.\"Bamboo scaffolds are very suited to the odd and tight spaces in Hong Kong,\" explained instructor Kin Kee Wo, who has worked in the construction industry for nearly 30 years.\"It can be built in the most unthinkable places, in the most beautiful ways.\""
    ]
}