{
    "articleURL": "/tvshowbiz/article-12046713/Meg-Ryan-61-looks-unrecognisable-public-outing-six-months.html",
    "content": [
        "Meg Ryan looked unrecognisable as she made a rare public appearance in New York on Thursday. ",
        "The 61-year-old actress - who has not been photographed since November last year - displayed an impossibly smooth complexion as she supported friend Michael J. Fox at a screening for his upcoming documentary, Still. Meg - who has long denied having any plastic surgery or enhancements - boasted a plumper pout and wrinkle-free skin framed by her trademark blonde locks. At the screening, which was held at at the Alice Tully Hall at Lincoln Center, the Sleepless In Seattle star looked in good spirits as she posed for snaps with her friends, including Bill Murray and Elvis Costello. While Meg has been making fewer public outings of late she ensured she was on hand to support Michael, who is releasing an Apple TV+ film about his battle with Parkinson's disease. ",
        "The film, which incorporates documentary, archival and scripted elements, recounts Michael's story in his own words - from being raised on a Canadian army base to achieving stardom in 1980s Hollywood. The account follows his public life alongside his never-before-seen private journey, including the years that followed his secret diagnosis with Parkinson’s disease at 29. Meg looked effortlessly stylish for the documentary screening, teaming a scarlet jacket with brown plaid trousers and chunky black boots. The Golden Globe nominee's appearance has changed a lot over the years, sparking many rumors surrounding what she has or hasn't had done.",
        "'I don't pay a lot of attention frankly,' she told Porter magazine in 2015, when asked about the speculation surrounding her plastic surgery.'There's a lot of hatred in the world today. It's so easy to judge. Imagine being a hater, how stupid.'In 2016, plastic surgeon Mark Youssef analyzed her face to Hollywood Life and said he believed she had 'too many' alterations.'The most obvious thing that she’s had done is some sort of filler or fat transfer to her cheek,' he said.'It’s definitely too much because the apple of her cheek is too full and too large. When she smiles, all of that filler moves up and makes her eyes look smaller. 'The reason she looks masculine is because of the placement of the volume in her cheeks. The volume of the filler should have been placed more laterally to give her a softer look.'",
        "He also theorized that she had a nose job, lip injections, Botox, and even potentially a facelift.'The tip of her nose is narrower than before. The tip looks more pinched, so it’s very possible that she had some sort of rhinoplasty,' he continued. 'There’s definitely volume in her lips as well, and Botox on her forehead. She’s had too much Botox in the forehead, and as a result the eyes look smaller because it drops the position of the eyebrow.",
        "'The surgery that most drastically changes the shape of the face is a face lift. It looks like Meg Ryan may have had one. 'It’s possible because the shape of her face has changed so much. The texture of her face also looks different. It looks like she could have had some sort of laser skin resurfacing procedure.'Last year, it was announced that Meg would be returning to the screen as she plans to star in and direct the forthcoming movie What Happens Later.According to The Hollywood Reporter, the movie is an adaptation of Steven Dietz's play Shooting Star.",
        "The media outlet also revealed that the playwright was penning the screenplay alongside both Kirk Lynn and the actress, herself.The feature is described by the filmmakers as an 'evolved and nostalgic take on the romantic comedy.'What Happens Later hones in on a former couple that examines their romantic past while they're snowed in at an airport.David Duchovny will play opposite Meg, serving as the upcoming feature's male lead.STILL: A Michael J. Fox Movie is in select UK and Irish cinemas, and on Apple TV+, from May 12"
    ]
}