{
    "articleURL": "/tvshowbiz/article-12049039/EastEnders-actor-Aidan-OCallaghan-returns-normal-job-following-stint-playing-rapist-Lewis.html",
    "content": [
        "EastEnders star Aidan O'Callaghan has returned to his 'normal job' after his stint playing rapist Lewis Butler.",
        "The Irish actor, 34, starred on the BBC soap last year, portraying the sexual predator who made Ben Mitchell's life hell after he attacked him.But away from screens, Aidan is a trained pharmacist and is back in the profession, with Aidan recently sharing a surprising photo from his day at workTaking to his Instagram stories, the Cork native snapped a photo of himself holding a baby duck, which he says was abandoned by its mother.Aidan captioned his image, writing 'Meanwhile in my other job a mother duck has abandoned her duckling', alongside crying laughing emojis. ",
        "He looked worlds away from his soap character, sporting trendy silver-rimmed glasses and a curly mop of hair. Aidan studied pharmacy at Trinity College, Dublin and continues to locum as a pharmacist when not on screens.While Aidan documented life at the pharmacy in between acting jobs, he previously starred in The Witcher Blood Origin following his exit from EastEnders. He played the role of Kareg opposite Hollywood star Michelle Yeoh and comedy legend Lenny Henry. Meanwhile, EastEnders is not the first soap role for Aidan, as he has previously starred as Mike in two episodes of Emmerdale back in 2018.The Irish star has also appeared in Sky drama Wolfe and popular thriller The Rook. ",
        "In addition, he's also made appearances in Home Alone, Wolfe and Britain's Deadliest Lovers.And while he hasn't been seen on EastEnders for several months, his character's name was recently mentioned on the soap.",
        "His character Lewis' victim was stunned to learn that Lewis had raped someone else, which sent him on a downward spiral.And in upcoming scenes, Ben continues to struggle as he also has difficulty coping with the financial burden of caring for his terminally ill ex Lola and their daughter Lexi.The character, who is battling with his exhaustion, is set to lash out at Vinny Panesar as things get too much for him."
    ]
}