{
    "articleURL": "/wires/pa/article-12052991/Camilla-officially-known-Queen-Camilla-coronation-day.html",
    "content": [
        "Queen Camilla has completed her transformation from Queen Consort to Queen as her coronation day arrived.",
        "The former Mrs Parker Bowles will be anointed and crowned in Westminster Abbey during a historic ceremony steeped in history and celebrated with great pageantry.The official invitation to the day, the order of service, the Church of England’s prayers and Royal Collection souvenirs all hailed Camilla as the Queen or Queen Camilla.Buckingham Palace tweeted late on the eve of the coronation, using “Queen Camilla” for the first time on the monarchy’s official account.Sharing footage of the floral splendour and scene set in the coronation theatre, the post read: “Westminster Abbey is ready for the #Coronation of King Charles III and Queen Camilla”.Years of debate followed Camilla’s wedding to the then-Prince of Wales in 2005, when aides said she “intended” to be known as “Princess Consort” when her husband became monarch.The late Queen backed Camilla to be Queen Consort in a Jubilee masterstroke, and the former Duchess of Cornwall has been referred to by the Palace as such since the King’s accession.It ended years of debate over what the duchess – Charles’s former mistress – would eventually be called.",
        "The wife of a king automatically becomes a queen and only a change in legislation would have prevented Camilla from being so.“Queen Camilla” appeared officially for the first time on the coronation invitations, with Buckingham Palace saying the May 6 ceremony was the appropriate time to start using the title in an official capacity.",
        "Much has changed in the years since Charles – whom aides once said had no intention of remarrying – wed his long-term love.Camilla was blamed for the breakdown of the prince’s marriage to Diana, Princess of Wales, and, when news of their affair first came to light, she faced vitriolic criticism.But in the decades after the Waleses’ divorce, the untimely death of Diana in 1997 and Camilla’s acceptance into The Firm, the public mood towards the former Mrs Parker Bowles softened.",
        "Camilla has gradually taken on a more prominent position within the royal family, including riding next to the Queen in her Diamond Jubilee carriage procession.She also began to attend the State Opening of Parliament.Through charity work championing literacy, and highlighting the problem of domestic abuse and sexual violence, Camilla has carved out her own royal role.When the new King and Queen returned to Buckingham Palace shortly after Elizabeth II’s death they were greeted with cheers, applause – even kisses for Charles – from well-wishers."
    ]
}