{
    "articleURL": "/femail/article-12045695/Im-female-bodybuilder-earn-five-figures-month-OnlyFans.html",
    "content": [
        "Vladislava Galagan, based in Prague, began training at the gym 11 years ago READ MORE: Want to know if your date is REALLY into you? Relationship expert reveals the 5 body language signs you should look forA female bodybuilder who claims she's been dubbed 'Kendall Jenner on steroids' has revealed how she earns five figures a month on OnlyFans by sharing her arm-wrestling videos.",
        "Model Vladislava Galagan, 27, who is originally from Temryuk, Russia, but now lives in Prague, Czech Republic, began training at the gym 11 years ago to build her impressive physique.In 2018, she began taking part in bodybuilding competitions - growing her muscles to an impressive level - and she started fitness modelling.Vladislava developed a following on social media - posting training videos and modelling shots - and featured on websites specifically for muscly women.In May last year she joined OnlyFans - posting steamy pictures and videos while flexing her impressive physique. The most common comments she said she receives are those telling her she looks just like a shredded Kendall Jenner.",
        "Vladislava said: 'I sell this image of being good looking and muscular and combine it and with a little erotic. When I joined social media, I learnt there are so many men who like tall, strong muscular women with a nice face too.'People tell me my muscles are photoshopped because they can't believe someone who looks like me could be so strong. I am constantly told I look like \"Kendall Jenner on steroids\".'I hit the sweet spot with a mix of my face and my body. But I'm not some vanilla bodybuilder - I'm a fitness model that kicks ass.'",
        "Vladislava has adhered to a strict diet and workout routine since she began competing in bodybuilding competitions.She goes to the gym at least six times per week - working out for around an hour and a half each time - and eats a protein-heavy diet.She eats four meals a day to make sure she eats over 100g of protein - favouring protein-rich foods such as beef, eggs, turkey, chicken and fish.She also takes performance-enhancing drugs to help maximise her efforts - but says there's no 'magic pill' and it must be coupled with a consistent diet and training.She visits the gym six days a week and trains each muscle group twice a week as well as having three cardio sessions a week.",
        "In 2016, Vladislava opened an Instagram account and began sharing her gym progress pictures.She also began doing fitness modelling - and due to her toned physique she fed into a particular 'fetish around muscly women'.As well as contributing to a platform called 'Her Biceps' - specifically for female bodybuilders - she set up an OnlyFans for people to subscribe to her exclusive content.She said: 'I'm muscular and good looking, it sells really well. So many people think it's CGI or photoshop, but it's not. ",
        "'I wear see-through lingerie, leather and latex, but I don't do anything explicit - I just imply. I also do arm wrestling videos - people like those.'As her subscription platforms and her social media grew, there was one particular recurring comment. She said she is told daily that she looks like a muscly version of Kendall Jenner.",
        "On TikTok, examples include one user who commented '@kendalljenner got f***ing jacked' while another said 'she's like a buff Kendall... I'm all for it.'A third commented: 'Face of Kendall Jenner, body of Chris Evans [from Captain America].' She said she receives these comments daily - although she doesn't personally agree.She said: 'I don't really know how they see it. I guess there are some similarities. It's not how I brand myself, but they like a mix of my face and my body.'Thanks to 'hitting the sweet spot' combining looks and physique, she takes home five-figure paychecks each month from her OnlyFans and social media platforms.She added: 'I feel like I won the lottery.'"
    ]
}