{
    "articleURL": "/femail/article-12047029/Gwyneth-Paltrows-diet-guru-DEFENDS-controversial-food-regimen.html",
    "content": [
        "The actress came under fire in March after she shared her 'daily wellness routine'Gwyneth, 50, said she did intermittent fasting and mostly ate soup and veggiesNow, her dietician, Dr. Will Cole, has defended her controversial eating habits Gwyneth Paltrow's diet guru has defended her highly-controversial food regimen - claiming that 'hyperventilating over people intermittent fasting and drinking bone broth' is the reason society is so unhealthy.",
        "Back in March, the actress, 50, came under fierce fire after she dished on her 'daily wellness routine' during an appearance on her dietician Dr. Will Cole's podcast - revealing that she fasts for hours before having a liquid lunch, followed by an early dinner consisting mostly of vegetables.Many people on the web were quick to blast the Iron Man alum for her eating habits, with many slamming her for 'promoting starving.' But now, Will has defended Gwyneth's eyebrow-raising diet, insisting to The Times that Gwyneth is the healthy one - and that society's response to her food choices is what's really causing the problems.'I think hyperventilating over people intermittent fasting and drinking bone broth is why we are faced with a society where the vast majority of people struggle with metabolic issues, type two diabetes - lifestyle-driven things,' Will, 38, an author and senior medicine clinic director in Pittsburgh, Pennsylvania, said.",
        "'Could we imagine this scenario if someone in the public eye said, \"I had fast food for breakfast, lunch and dinner?\"",
        "'We’d get some laughs but it would not be dramatic. I’d assume it wouldn’t irritate people or cause an outrage.'But that [diet] is what’s killing the world. Someone having broths and soups and fruits and vegetables and meats and gluten-free grains is not.",
        "'You can’t really deny obesity is implicated in a shorter, sicker life. We need to have conversations about this - it doesn’t mean people have to be stick thin or a waif, it just means they need to be the healthiest version of themselves.'While speaking to Will on his The Art of Being Well podcast earlier this year, the Goop founder explained that she usually skips breakfast - only consuming things that 'won't spike her blood sugar' in the morning, like coffee - before having her first meal around 12pm, which is often soup. 'I do a nice intermittent fast. I usually eat something about 12 - and in the morning I have things that won't spike my blood sugar so I have coffee,' she explained.'I really like soup for lunch. I have bone broth for lunch a lot of the days. [Then I] try to do one hour of movement, so I'll either take a walk or I'll do Pilates or I'll do my Tracy Anderson.'And then I dry brush and I get in the sauna. So I do my infrared sauna for 30 minutes and then I eat dinner early in the evening.'For dinner I try to eat according to paleo - so lots of vegetables. It's really important for me to support my detox.' ",
        "The paleo diet is based on foods that people ate during the Paleolithic Era - which dates back to 2.5 million years ago - and includes mostly fruits, vegetables, lean meats, fish, eggs, nuts, and seeds, according to MayoClinic.A clip of the interview was shared to TikTok and it quickly went viral, gaining more than one million views and sparking a slew of backlash from online users. One person wrote, 'Is starving wellness?' while another added, 'I feel light headed just listening to this.' And a third simply said: 'I relate to nothing in this video.'While addressing the criticism on Instagram a few days later, the star explained that she switched to the diet after she started suffering from 'very high levels of inflammation' due to long COVID.'I think it's important for everybody to know that I was doing a podcast with my doctor,' she said in a video shared to her Stories.'So, this is a person I've been working with for over two years now to deal with some chronic stuff.'I've been working with Dr. Cole to really focus on foods that aren't inflammatory. So, lots of cooked vegetables, all kinds of protein, healthy carbs to really lower inflammation. It's been working really well.'She added that they came up with the meal plan together after 'extensive testing' and that it 'wasn't meant to be advice' for anyone else.",
        "'It's really just what has worked for me, and it's been very powerful and very positive,' she concluded.'This is not to say I eat this way all day, every day. And by the way, I eat far more than bone broth and vegetables.'I eat full meals, and I also have a lot of days of eating whatever I want. You know, eating French fries and whatever. 'My baseline has been to try to be healthy and eat foods that will really calm the system down.'Will and Gwyneth have been working together for quite some time, and she published both of his books through her multi-million wellness brand Goop.She even wrote the forward for his first tome, called Intuitive Fasting, in which she described Will as her 'dear friend' and gushed over how much he 'changed her life.'Will is a strong advocate for intermittent fasting, and while speaking to The Times, he insisted that his 'theories are not controversial' and that they're 'very well referenced.' 'People just love to pick it apart and be mean for the sake of being mean,' he added of the criticism surrounding Gwyneth's appearance on his podcast. 'It’s like a blood sport. It’s almost like it’s politically correct to be cruel to certain people. It’s a real lynch-mob mentality, it’s horrible.",
        "'Gywneth’s been in this world for decades, I just come in for a book and then go back to my day job, so I don’t have the skill set that she has [to deal with this].'I wish we could have better conversations around these topics. I just want to help people.'"
    ]
}