{
    "articleURL": "/tvshowbiz/article-12058585/Tom-Cruise-mingles-newly-single-Shakira-2023-Miami-Formula-One-Grand-Prix.html",
    "content": [
        "Tom Cruise mingled with single Shakira on Sunday when both stars attended the 2023 Miami Formula One Grand Prix.",
        "The 60-year-old icon – who congratulated King Charles on his coronation while flying a vintage fighter plane – looked like a dashing heartthrob with his tousled mane and white polo shirt.Shakira, 46, wore a sexy green top that showed off her cleavage and seemed to be having a grand time with the Mission: Impossible superstar.The A-list pair took in the thrilling race after Shakira referenced her ex-husband Girard Pique while accepting Billboard's Woman of the Year Award at the Latin Women in Music Gala on Saturday. The Colombian beauty became visibly emotional while discussing her views on love and relationships – one year after her bitter split from the Spanish footballer.",
        "Speaking from the podium, Shakira said: 'It doesn't matter so much if someone is faithful or not; what really matters is if you continue to be faithful to yourself.' The Whenever, Wherever songstress ended her speech by saying that her music helped her get through difficult times in life.She said, 'When I felt most lost, it was music that put me on the path back to myself.' Pique was beset by cheating rumors after his split from Shakira - and has now sparked up a new romance with Clara Chia.Shakira added, 'There comes a time in every woman's life when she no longer depends on someone to love or accept herself as she is. ",
        "'The search for the other is replaced by the search for oneself when the desire to be perfect is replaced by the desire to be authentic,' she said.Shakira then spoke to women everywhere, saying as a group, 'Women are much stronger than we think. We are braver than we think we are. I think we are also more independent than we were taught to be.'What woman hasn't gone through the experience of looking for attention, affection, or approval from others and forgotten about herself? It has happened to me,' she said. ",
        "The couple's 11-year marriage imploded last year and Shakira reportedly left her beloved Barcelona for good after being served an 'eviction notice' by Gerard’s father, Joan Piqué.Spanish media reported it came after she received a demand for her and her parents to abandon the ex-couple’s former family home. It is the same flat where Shakira is said to have set up a witch doll on her balcony, which faces her mother-in-law’s home. The estranged pair share two sons – Milan, 10, and Saha, eight – and the singer eventually posted a lengthy Instagram statement in Spanish asking the media to respect her privacy so that her children can live their lives in peace without the 'constant scrutiny of cameras.'"
    ]
}