{
    "articleURL": "/wires/ap/article-12054439/Kentucky-Derby-runs-obstacles-ahead-big-race.html",
    "content": [
        "LOUISVILLE, Ky. (AP) - After seven deaths raised questions about the future of horse racing, Mage earned a surprising Kentucky Derby victory on Saturday, capping a nerve-rattling day that included two more fatalities ahead of the 149th edition of the world´s most famous race.",
        "Mage, a 15-1 shot, had only one win in his career, giving little indication that he could triumph against 17 rivals in a race that is not kind to the inexperienced.Still, he made a gutsy stretch run, overtaking Two Phil's to his inside and winning by a length. Mage, who didn't race as a 2-year-old, ran 1 1/4 miles in 2:01.57.Mage joined Justify (2018), Big Brown (2008) and Regret (2015) as Derby winners with just three previous starts.\"He proved today that it didn't matter,\" assistant trainer and co-owner Gustavo Delgado Jr. said.The colt was in the skilled hands of Javier Castellano, a Hall of Fame jockey who hasn't been as in-demand lately. The 45-year-old Castellano snapped an 0-for-15 skid in the Derby.",
        "\"I never give up,\" Castellano said. \"I always try hard to do the right thing. It took me a little while to get there. I finally got it.\"Castellano and trainer Gustavo Delgado are from Venezuela. Mage joined Canonero II as Derby winners with Venezuelan ties. Canonero II won the Derby and Preakness in 1971.Going into the backstretch, Mage was ahead of just three horses. Castellano and Mage began picking off the competition and on the far turn launched their run.\"Turning for home, he had a lot of heart,\" Castellano said. \"He's a little horse with a big heart.\"",
        "Two Phil's stormed to the lead at the top of the stretch. Mage swung to the outside and took aim on the leader. Mage passed him at the eighth-pole and went on to victory.\"Everything went according to plan,\" Delgado Jr. said. \"This is the dream I have, a year-and-a-half ago, I wrote a note: `We´re going to win the Derby next year.´\"Forte, the early favorite, was scratched in the morning with a bruised foot, one of five horses that dropped out in the run-up to the race.Mage paid $32.42, $14.58 and $9.08. The colt earned $1,860,000 for the biggest win of his brief career.Two Phil's returned $10.44 and $6.52.\"Man, he tried so hard and ran his heart out,\" said Larry Rivelli, who trains Two Phil's.Angel of Empire, the 4-1 favorite, was another half-length back in third in front of a crowd of 150,335 on a warm and partly cloudy day at Churchill Downs. He paid $4.70 to show.Earlier in the day, Chloe´s Dream, a 3-year-old gelding, and Freezing Point, a 3-year-old colt, were euthanized after being injured in their races, becoming the sixth and seventh horses to have died at the track in recent days.\"It's a very difficult subject to touch upon,\" said Ramiro Restrepo, part of Mage's ownership and a blood stock agent. \"I´m sure there´s going to be some investigations done as to the reason behind that, and hopefully that provides a few more answers.\"",
        "The string of horse deaths was on the mind of some Derby-goers.\"It´s concerning, and I hope they´re quickly trying the best they can to correct whatever´s going on,\" said Michael Freeze, who along with his friend dressed up as jockeys. \"They need to do whatever is best for the horses, and the sport in general.\"Chloe's Dream injured his right front knee, trainer Jeff Hiles told The Associated Press.\"He just took a bad step out there,\" Hiles said. \"They could do the same thing running in the field as they could on the track. So it´s very unfortunate. That´s what we deal with.\"Freezing Point suffered a left ankle injury in the Pat Day Mile, trainer Joe Lejzerowicz told the AP.\"He just got bumped in the backstretch,\" Lejzerowicz said. \"He never took a bad step or bobble. He had a big heart.\"New antidoping and medication rules enforced by a central governing body of the sport are scheduled to take effect May 22.\"All I can say is we do our best to take care of our horses. We treat them better than we treat our children. And we have full confidence in the soundness of our horse,\" Restrepo said. \"We´ve been training here for two weeks, and he actually has been flourishing at this racetrack.\"",
        "The deaths included Derby contender Wild On Ice. Two of the horses were trained by Saffie Joseph Jr. He was indefinitely suspended by the track, although investigators have yet to determine a cause for the deaths of his horses.A relieved Tim Yakteen, who trained Reincarnate to a 13th-place finish, said, \"The most important thing is the horse came out of it OK.\"Hall of Fame trainer Bob Baffert, a two-time Triple Crown winner, is nearing the end of a two-year ban issued by Churchill Downs Inc. One of his horses, Medina Spirit, crossed the finish line first in the 2021 Derby and failed a post-race drug test. The horse was disqualified and Baffert was punished.In 2019, over 30 horse deaths occurred at California's Santa Anita racetrack, rattling the industry and leading to safety reforms. Kentucky Derby-winning trainer Rick Dutrow had his license revoked in 2011 for 10 years by New York officials. Regulators found syringes loaded with unauthorized medication in a desk in his barn. Dutrow served his punishment and re-opened his stable last month.Four horses were scratched - Practical Move, Lord Miles, Continuar and Skinner - in recent days. Practical Move and Skinner had fevers, while Continuar wasn't in peak condition, according to his Japanese trainer. Lord Miles was Joseph's Derby horse.",
        "Disarm was fourth, followed by Hit Show, Japan-based Derma Sotogake, Tapit Trice and Raise Cain, Rocket Can, Confidence Game, Sun Thunder, Japan's Mandarin Hero, Reincarnate, Kingsbarns, King Russell, Verifying, Jace's Road and Cyclone Mischief.___AP Sports Writer Gary B. Graves and AP National Writer Claire Galofaro contributed to this report.___AP sports: https://apnews.com/hub/sports and https://twitter.com/AP_Sports"
    ]
}