{
    "articleURL": "/wires/reuters/article-12044649/Chinas-holiday-tourism-rebound-pre-COVID-levels-boosts-outlook.html",
    "content": [
        "Domestic trips 274 mln during five-day holiday, up 19% from 2019",
        "Domestic tourism spending on par with pre-COVID levelsChina's May Day was first travel season without COVID curbs(This May 3 story was updated on May 4 to add analyst comments on China's economic outlook in para 7-8, bullet points, bylines)By Samuel Shen and Liz LeeSHANGHAI, May 3 (Reuters) - China's tourism rebounded to pre-COVID 19 levels in the May Day holiday as the number of domestic trips rose by more than two-thirds from a year earlier, government data showed on Wednesday, a welcome boost for the world's second-biggest economy.If sustained, a recovery in the service sector could ease worries that China's post-pandemic economic recovery could soon lose momentum with the property market still soft, its vast manufacturing sector weak and exports facing persistent headwinds.Travel-hungry Chinese made 274 million domestic trips during the five-day break that began on Saturday, a rise of 70.8% from a year earlier, and 19% more than during 2019, the Ministry of Culture and Tourism said on its website.During these trips, Chinese tourists spent 148 billion yuan ($21 billion), a 128.9% increase from a year earlier, and on a par with 2019 levels.The figures from this year's May Day holiday - the first travel season since the pandemic without restrictions - are being monitored as a gauge of China's economic health.",
        "Official data on Sunday showed activity in China's non-manufacturing sector grew in April, albeit at a slower pace than in March.\"The strong holiday tourism data, together with the still-solid April services PMI, bode well for consumption and services recovery in coming months, despite the softening in manufacturing growth momentum,\" wrote Goldman Sachs in a note.\"This also adds conviction to our above-consensus 2023 GDP growth forecast (6.0%).\"The next leg of consumption recovery will rely on higher income growth and improved consumer confidence which will make the recovery model more sustainable, Goldman Sachs added.Asset manager Vontobel said it believes China's recovery should accelerate, benefitting companies that cater to domestic consumers across leisure and e-commerce, as well as travel-focused businesses in China and across Asia.Total box office collections of May Day movies this year exceeded 1.5 billion yuan by the end of the holiday period, ranking third in May Day box office receipts in Chinese film history, state television reported on Thursday.The travel boom during the May holiday \"can be seen as a turning point of China's tourism sector\", official Xinhua News Agency said on Wednesday.The China Tourism Academy estimates about 4.55 billion domestic tourist trips will be made this year, up 73% from 2022, Xinhua reported.",
        "($1 = 6.9110 Chinese yuan renminbi) (Reporting by Shanghai and Beijing Newsroom; Editing by Barbara Lewis, Muralikumar Anantharaman and Lincoln Feast)"
    ]
}