{
    "articleURL": "/news/article-12050727/Terrifying-moment-three-assassins-board-school-bus-try-shoot-boy-aged-FOURTEEN.html",
    "content": [
        "Three would-be assassins boarded a Maryland school bus in masks before attempting to shoot their victim at point-blank rangeWhen the gun jammed and bullets fell to the floor, one of the attackers pistol whipped the boy before fleeing the scene Cops believe all three suspects are juveniles, and investigations into the incident are ongoingChilling photos show three would-be assassins board a Maryland school bus to try to shoot a 14-year-old boy dead in what appears to have been a targeted attack. ",
        "The unidentified youngsters burst onto the bus in Prince George’s County, Maryland, on Monday afternoon when their intended victim was the last student on board.They tried shooting the middle-schooler - who has not been named - in the chest at point-blank range with the boy's life only saved after the gun malfunctioned.After failing to shoot the boy, his assailants instead assaulted him and 'pistol whipped' him with the handgun, according to Fox5. The bus's security camera is said to have recorded the entire incident, although only still images of the incident have been released.  ",
        "Cops investigating the case say they found three live rounds on the floor of the bus afterwards. Martin Diggs, head of the local bus drivers' union, told ABC7: 'This was an attempted murder, plain and simple. Call it what it is.'They pulled the trigger three times, but for some reason, by the grace of God, the gun didn’t go off and bullets flew out of the gun.' The victim's mother shared her relief that the shooting was thwarted, revealing that her son was pistol whipped by his attacker when the gun's firing mechanism jammed. 'They tried to kill my son three times and they failed,' she told Fox5. 'And you know what I would say to them? You are cowards. You're gonna forever be a coward. You're not gonna have any good luck. And you will get caught.'",
        "No further details of the victim's injuries or why he might have been targeted have been shared.Investigations into the incident are ongoing, with all three suspects believed to be juveniles. Prince George's County Public Schools say they are working with law enforcement, and in a statement the body said: 'We are horrified by this incident and grateful that no lives were lost. 'Our highest priority is keeping students, staff and families safe inside Prince George’s County Public Schools (PGCPS) classrooms, on school grounds and school buses.' "
    ]
}