{
    "articleURL": "/wires/reuters/article-12041517/Top-US-CEO-pay-rose-7-7-year-outpacing-inflation-study-finds.html",
    "content": [
        "By Ross Kerber",
        "May 3 (Reuters) - Median pay for top U.S. CEOs rose 7.7% last year to a record $22.3 million, a new study found, as big stock awards helped the group stay ahead of inflation while U.S. workers' pay fell behind.Among those receiving big pay increases were the CEOs of Jefferies Financial Group and Prologis Inc according to the study being released on Wednesday by research firm Equilar.The study reviewed the 100 highest paid CEOs at U.S. public companies with revenue of $1 billion or more that reported compensation as of March 31. A similar review last year showed a 31% pay increase for CEOs for 2021.The U.S. consumer price index, a widely-used measure of inflation, rose 6.5% in the 12 months ended Dec 31, down from 7% in the year-earlier period.Pay among the CEOs rose faster than for U.S. workers in 2022 despite tight labor markets. Average weekly earnings for U.S. private sector employees was $1,132 in December, up 3.6% from a year earlier, according to the U.S. Bureau of Labor Statistics. The CEO's higher gains pushed the median \"pay ratio\" at companies led by the CEOs studied by Equilar to 288 times the pay of their median employee, up from 254 times in 2021.The CEO pay gains came during a year when the total return of the S&amp;amp;P 500 was negative 18% as the Federal Reserve's rate hikes slowed economic growth. Total return for the companies whose CEO pay was studied was negative 11%.",
        "Boosting the CEO's pay gains were stock awards that have become a centerpiece of U.S. executive compensation but not as much for employees. The median value of CEO's stock awards rose 20% to $13.8 million for 2022. Equilar director of research Courtney Yu said much of that was awarded at the start of last year, as companies looked to keep their top leaders in place.\"You want stability of leadership to guide you through tough times,\" Yu said. He added that amid the macroeconomic uncertainty, \"There's still a little more of this incentivizing of executives that's leading to the increases in CEO pay.\"HANG ON TO LEADERSOne of the biggest pay increases went to Jefferies CEO Richard Handler, whose $56.9 million received last year was nearly double his total compensation in 2021.Must of the pay, $25 million, reflected a one-time \"leadership continuity grant\" of restricted stock, Jefferies' proxy states. At the company's March 29 shareholder meeting only a slim majority, 59%, of votes cast backed the pay.Asked about the pay, a Jefferies representative referred to a previous company description of actions it took in response to shareholder feedback, including that it would not make further special equity awards.Another big gain went to Hamid Moghadam, CEO of logistics real estate company Prologis, whose $48.2 million total compensation last year was 93% more than the year before, driven mainly by stock awards.",
        "A Prologis spokesperson said last year's awards reflected how the performance of part of its business exceeded three-year goals, creating value for investors. Founder Moghadam for years has taken a salary of just $1. \"Our CEO´s compensation is and will continue to be 100% performance based,\" the spokesperson said.(Reporting by Ross Kerber; Editing by David Gregorio)"
    ]
}