{
    "articleURL": "/news/royals/article-12043763/Red-Arrows-Coronation-flypast-cancelled-poor-visibility.html",
    "content": [
        "The Met Office forecasts grey cloud and rain on Saturday afternoon over LondonIf visibility and cloud base limits cannot be met number of aircraft may  reduceFlypast is set to include Typhoons, Apache helecopters and a Lancaster bomberThe Coronation flypast featuring the Red Arrows could be scaled back or even cancelled if the weather is too poor.",
        "The Met Office forecasts grey cloud on Saturday afternoon over London, with rain bursts. Cloud as low as 200 metres above ground is shown on computer forecast models.The grand finale of the Coronation parade - which will soar above the Royal Family on Buckingham Palace's balcony - is set to include Typhoons, Apache helecopters and a Lancaster bomber.A Ministry of Defence spokesperson said: 'As is always the case for flypasts of this type, the latest weather information will be obtained, and weather checks will take place in advance of the main flypast on Saturday.'Depending on the weather there are a number of contingencies in place.'",
        "If the necessary limits for visibility and cloud base cannot be met the number of aircraft may have to be reduced.Using the latest information from the Met Office and their own helicopters' weather checks, cancellation of the flypast alltogether will only be a last resort.The Coronation flypast will follow the King's Coronation Parade at 2.30pm. The second flypast of the Platinum Jubilee weekend last year was cancelled due to cloud and poor visibility over London on the Sunday.And 2012's Diamond Jubilee flypast after the Thames boat pageant was also called off amid cloudy skies.Met Office deputy chief forecaster Steven Keates said: 'On Saturday we will see heavy rain moving north-eastwards through the morning. ",
        "'This is likely to bring some rain to London by around lunchtime as it spreads east and north across roughly the southern third of the UK.'",
        "More than 30 aircraft took to the skies in late April as RAF Cranwell - where King Charles spent time as a student - stood in for Buckingham Palace for rehearsals of the flypast.  It was only last June that Buckingham Palace saw its last flypast during the Trooping the Colour for the late Queen's Platinum Jubilee.It was a day in which young Prince Louis captured the nation's hearts by dramatically covering his ears to block out the noise from the skies as he stood next to Her Majesty on the Buckingham Palace balcony.The full flypast  will feature more than 60 aircraft, including the Red Arrows and the full Battle of Britain Memorial Flight."
    ]
}