{
    "articleURL": "/tvshowbiz/article-12044593/Big-Brother-star-Reggie-Bird-fears-join-OnlyFans-survive.html",
    "content": [
        "Two-time Big Brother winner Reggie Bird has revealed she may have no other option but to join OnlyFans as the cost-of-living crisis worsens.",
        "The former fish and chip shop manager, 49, shared an Instagram post on Wednesday begging supermarkets to lower the cost of their products.Bird, a mother of two teenage children, admitted she's 'not built' for a career on the adult website, which many Aussies are now using to supplement their income.Despite taking home $250,000 in prize money during the 2003 and 2022 seasons of Big Brother, the TV personality has struggled financially over the years.She is also legally blind after being diagnosed with retinitis pigmentosa, a rare degenerative eye disease that causes severe vision impairment.",
        "'Please lower the cost of groceries. I'm not built for OnlyFans,' she wrote on Instagram, adding a praying emoji.Many of Bird's followers were quick to offer words of support, with Bachelor in Paradise star Mary Viturino commenting: 'I hear you, sis.''You totally are! But yeah, they should reduce the cost of groceries,' one fan wrote.Bird revealed last year she no longer had any of the $250,000 prize money left from when she first won Big Brother in 2003.",
        "She told The Daily Telegraph her windfall was simply 'all gone', adding that her main motivation for returning for the 2022 season was to provide for her children.'I've got to do this for my kids,' said Bird, who is mother to daughter Mia, 16, and son Lucas, 13.",
        "Lucas suffers from has cystic fibrosis, a life-threatening genetic disorder that affects the lungs and digestive system.",
        "Bird was known as the relatable 'Aussie battler' from Tassie when she won Big Brother for the first time two decades ago.She was reportedly 'paid peanuts' to appear on last year's season on Channel Seven, receiving $170 a day rather than an up-front fee.But the Hobart native lucked out by winning the show last July, becoming the first person to ever win Big Brother twice, taking home another $250,000 in prize money."
    ]
}