{
    "articleURL": "/wires/aap/article-12045415/Magic-Round-Auckland-fitting-Kevin-Campion.html",
    "content": [
        "Ex-Warriors forward Kevin Campion has suggested taking Magic Round to New Zealand would be a fitting way to repay the club and their fans for their efforts to keep the NRL competition going through the COVID-19 pandemic.",
        "Magic Round has been a smash hit for the NRL since the inaugural edition in 2019, with all games in the round played at Brisbane's Suncorp Stadium.The 2023 iteration, starting Friday evening, is on track to sell out and 40 per cent of attendees are anticipated to be travelling to Brisbane from interstate or overseas for the festivities.The inaugural edition pumped more than $20 million into the Queensland economy and the event will continue to provide a windfall for both the Queensland Government and NRL until at least 2024, when the current agreement between the two parties expires.The Magic Round concept was borrowed from the English Super League, where the game takes its wares around the United Kingdom with the aim of spruiking rugby league to new markets.Before the latest deal was signed with the Queensland Government, media pundits suggested the NRL could follow suit and take the show on the road.\"It'd work up in Townsville, it'd work definitely in New Zealand, it could even work in Sydney,\" Campion told AAP.\"You've got to have the capacity to hold it but certainly easily over in New Zealand. They love their footy over there.\"It'd be hard for all the fans to get to New Zealand and it'd be very expensive, just accommodating everyone, that'd be the hardest thing.\"",
        "Despite the logistical challenges, Campion suggested Magic Round in Auckland would be a good way for the NRL to make it up to the Warriors after they did it tougher than any other club during COVID-19 pandemic biosecurity restrictions.The Warriors played almost all of their home games in Australia between the 2020 and 2022 seasons in order to keep the NRL going through the pandemic, only returning once restrictions began loosening in July 2022.The club had been hopeful other clubs would volunteer to take home games to New Zealand for 2023 as a showing of gratitude, but only the Wests Tigers put their hands up to do so.\"We got the short end of the stick the last couple of years and it'd be nice to see the NRL repay us for the faith we showed in the competition,\" Campion said.\"That's up to the NRL but (Magic Round) wouldn't be out of place over in Auckland.\"New Zealanders have already proven willing to travel for a showpiece event. Some 17,000 fans attended the annual NRL All Stars game in 77,000-population Rotorua this February.Since the Warriors returned home from COVID-19 limbo, New Zealand crowds have been among the healthiest in the NRL; this season, the Warriors have drawn the fourth-largest home crowds on average.",
        "Super Rugby Pacific is eyeing off a possible shift to New Zealand for their Super Round, a Magic Round equivalent that has been held in Melbourne since its inception last year.The NRL has the chance to beat their rival code to the punch and score another win in the war between codes that has flared up this season with Joseph-Aukuso Suaalii's imminent defection from league."
    ]
}