{
    "articleURL": "/wires/ap/article-12044361/A-look-mom-5-teenagers-killed-rural-Oklahoma.html",
    "content": [
        "HENRYETTA, Okla. (AP) - A woman who would go 100% for her children. A teen set to represent her town in a pageant. An aspiring artist who also wanted to be a doctor. Relatives are remembering five teenagers and a mom who were found dead this week on a rural property near Henryetta, Oklahoma.",
        "Law enforcement said Wednesday that Jesse McFadden, 39, fatally shot them all - his wife, her three teenage children and their two teenage friends - before killing himself.HOLLY GUESSGuess, 35, was a doting parent who worked from home, most recently by selling life insurance, her mother, Janette Mayo, said in an interview with The Associated Press.\"She was a fantastic mother. She loved her children beyond belief. She was overprotective,\" said Mayo, of Westville, Oklahoma, near the Arkansas border. \"She was supportive if they wanted to do something. She´d go out 100%.\"When one of Guess' children wanted to play football, she \"went out 100%, went and bought the family T-shirts and sweatshirts to support the team,\" Mayo said.",
        "Mayo wasn´t sure how Guess met McFadden, but she said he moved in with Guess and her three children just after they moved to Henryetta in 2021. They married in May 2022, she said.Mayo said her daughter was born in El Paso, Texas, and the family moved around a lot.The last time Mayo saw her daughter and grandchildren was the night of April 27, when she made the two-hour drive to Henryetta to see her granddaughter Tiffany sing in her last choir concert of the year, she said.",
        "RYLEE ELIZABETH ALLENRylee, 17, was very artistic, according to her grandmother.\"My baby girl had a talent with a paint brush,\" Mayo said. \"Rylee wanted to be an artist and wanted to be a doctor so she could help people.\"MICHAEL JAMES MAYOMichael James, 15, played football, ran cross-country and track and was an \"all-around fantastic young man\" who shared a birthday with his grandfather, Janette Mayo said.TIFFANY DORE GUESSTiffany, 13, also ran cross-country. The seventh grader was in the choir and had just tried out for the cheerleading squad.\"She was the sweetest, most loving girl you´d ever met,\" Mayo said. \"We called her `Tiffasaurus´ because when she´d get mad at you, she´d growl.\"IVY WEBSTERIvy, 14, a friend of Tiffany, was a great kid who loved animals, according to her mother, Ashleigh Webster.\"She loved softball. She loved people, animals. She was just a genuine good person. She really was,\" Webster said.BRITTANY BREWERBrittany, 16, another of Tiffany's friends, aspired to be a teacher or a veterinarian, according to her father, Nathan Brewer.\"Brittany was an outgoing person. She was actually selected to be Miss Henryetta ... coming up in July for this Miss National Miss pageant in Tulsa. And now she ain´t gonna make it because she´s dead. She´s gone,\" Brewer said.",
        "He told hundreds of people at a vigil Monday night: \"It´s just a parent´s worst nightmare, and I´m living it.\""
    ]
}