{
    "articleURL": "/wires/pa/article-12045579/Royal-Mail-posties-Charles-Camilla-deliver-letters-Coronation-Street.html",
    "content": [
        "Royal Mail postal workers Charles and Camilla have delivered mail to a UK street with a regal title ahead of the coronation.",
        "Mr Paintsil and Ms York, who share first names with the King and Queen Consort, posted letters on Coronation Street in Brighton, days before Charles is crowned at Westminster Abbey on Saturday.There are over 500 highways and byways up and down the country with coronation in their name, according to research by Royal Mail.The postal service company reports that Coronation Road is the most common, accounting for about 26% of all such street names, while Coronation Avenue is the second most used and Coronation Street the third.",
        "Royal Mail added that the most northerly coronation-themed street is to be found at Coronation Place in Castletown, Thurso, while the most southerly is Coronation Road in Redruth, Cornwall.In the UK, it said there are 1,148 street names featuring King and some 805 referencing Queen, while Charles gets 681 uses.There are also 1,398 UK houses featuring the term Crown, while 438 include King, and 347 refer to Coronation, it said.",
        "Of the 4,333 regal-related road names in the country, most are in London, followed by Leeds, Bristol and Birmingham.Street names including the word King are the most common nationwide, accounting for slightly more than 27% of the total, with Queen in second with around 18% of usage, Royal Mail said.",
        "Royal Mail’s director of external affairs and policy David Gold said: “As the country gears up for a weekend of celebrations and street parties, postmen and women will be delivering parcels and letters to thousands of regally named residences.“Perhaps it is an indication of the close bond between the public and the royal family that so many of the places we live have that royal connection.”"
    ]
}