{
    "articleURL": "/wires/ap/article-12039503/Bo-Nix-hoping-improve-season-Oregon.html",
    "content": [
        "EUGENE, Ore. (AP) - Bo Nix has settled in at Oregon, ready for a better outcome in his final year with the Ducks.",
        "The senior quarterback was getting Heisman buzz for a time last season before he got injured and the Ducks derailed.\"This year we've got to start over, go back when we get in fall camp, get into the season, just continue to work to finish those games and make that next step,\" he said.And that next step? Winning championships, he said.Nix is among a large group of experienced returning quarterbacks in the Pac-12, joining Heisman Trophy winner Caleb Williams of USC, Washington's Michael Penix Jr., Washington State's Cameron Ward and Arizona's Jayden de Laura. Utah's Cam Rising could also be on track to start for the Utes after an ACL injury.The return of Nix, along with backup Ty Thompson, bodes well for the Duck.Nix finished with 29 touchdown passes, 14 rushing scores and one TD catch in 13 games last season after transferring to Oregon from Auburn. He threw just seven interceptions and finished with an Oregon-record 71.9 completion percentage. His rushing touchdowns were just one shy of Marcus Mariota's single-season record.There were questions about whether he'd be back for his final year of eligibility, but Oregon announced his return before defeating North Carolina 28-27 in the Holiday Bowl.Oregon, which finished 10-3 last season, was considered a possible playoff contender but an eight-game winning streak was snapped in a 37-34 loss to Washington on Nov. 12. Nix injured his right ankle in that game and struggled with it the rest of the way.",
        "The Ducks still had hopes of a Pac-12 title but they were thwarted by a loss to Oregon State. Oregon ended the season ranked No. 15.\"I just felt like last year we would have finished at times better, and that's something that going into this year we need to do,\" Nix said. \"We were in a great spot last year and then didn't finish. So this year our goal is to be the best we can be. And one of my personal goals is to win a championship.\"Nix, an Arkansas native and former five-star recruit, started the first 34 games of his career at Auburn.He's grown into a leadership role while at Oregon, coach Dan Lanning said following the Ducks' spring game Saturday.Oregon was the last Pac-12 team to stage a spring game this season. The Ducks then wrapped up spring practice on Monday.\"Just the ability to be vocal and know that he doesn´t have to wait for somebody to say, 'Hey go ahead say it, right?´\" Lanning said. \"He´s willing to do that and he´s done a good job of that.\"Nix said he's more comfortable.\"A lot more comfortable,\" he said. \"Just because another year, I know everybody much better and I know where everything is, I know what time and the schedule is set for. You get to meet a lot of new faces and meet a lot of new people. Everybody´s kind of looking at me now so it´s important that I take being comfortable and use it in a good way.\"",
        "___AP college football: https://apnews.com/hub/college-football and https://twitter.com/ap_top25"
    ]
}