{
    "articleURL": "/wires/reuters/article-12050677/India-considering-allowing-foreign-investment-nuclear-power-sources.html",
    "content": [
        "By Sarita Chaganti Singh",
        "NEW DELHI, May 5 (Reuters) - India is considering overturning a ban on foreign investment in its nuclear power industry and allowing greater participation by domestic private firms, two government sources told Reuters, as part of a push for cleaner energy.The measures have been recommended by a government panel, set up by think-tank Niti Aayog which is headed by Prime Minister Narendra Modi.Under India's Atomic Energy Act 1962, the government plays a central role in developing and running nuclear power stations. Domestic private companies are allowed to participate as \"junior equity partners\" by supplying components and helping build them.The panel has recommended changes to the act and to India's foreign investment policies so that both domestic and foreign private companies can complement nuclear power generation by public companies.The aim is to reduce carbon emissions and nuclear is in focus because it can supply energy 24/7, unlike solar energy, said the officials, who declined to be named as they were not authorised to talk to the media.The Department of Atomic Energy has said previously that several foreign companies including Westinghouse Electric, GE-Hitachi, Electricite de France and Rosatom were interested in participating in the country´s nuclear power projects as technology partners, suppliers, contractors and service providers.India does not allow foreign investment in the nuclear power sector.",
        "The officials said the emphasis was on private participation through small modular reactors (SMRs) to fast-track nuclear energy generation, which accounts for 3% of India's total power production. Coal fires three quarters of it.The Department of Atomic Energy, which works directly under the prime minister, and Niti Aaayog did not respond to emails and messages seeking comment.Factory-built and ready-to-shift, each SMR produces up to 300 megawatts (MW) and requires less capital, time and land than conventional reactors. They can also safely be deployed in populated areas, the officials said.State-run Nuclear Power Corp of India Ltd. (NPCIL) and Bharatiya Nabhikiya Vidyut Nigam are the only two nuclear power generators in India. Thermal power company NTPC and oil marketing firm Indian Oil Corp, both government-controlled, have formed partnerships with NPCIL for nuclear power.An Indian minister overseeing atomic energy, Jitendra Singh, said in November the country should explore private players' participation in developing SMRs. In the same month, the atomic energy department held closed-door consultations with domestic and global industry players who showed significant interest, one of the officials said.\"With the right policy push, we see private sector taking up significant deployment in the country,\" said the official.The recommendations will next be submitted to Modi's office, said the officials, without giving a timeline.",
        "The government panel has also recommended replacing old coal-based plants with SMRs, amid a proposal to amend its electricity policy to not add any new coal-fired power plants, sources have told Reuters.India's current nuclear power capacity is 6,780 MW and it is adding 21 more units with a capacity of 7,000 MW by 2031.The country is a signatory to international conventions on nuclear safety and will have to ensure that private companies comply with standards. India imports uranium fuel for nuclear plants from Russia, Kazakhstan, Uzbekistan, France and Canada under bilateral agreements. (Reporting by Sarita Chaganti Singh; Editing by Krishna N. Das and Susan Fenton)"
    ]
}