{
    "articleURL": "/wires/afp/article-12058749/At-8-killed-SUV-rams-group-outside-Texas-migrant-center.html",
    "content": [
        "Police in a Texas border city announced manslaughter charges Monday against a local resident who allegedly plowed his SUV into a crowd at a bus stop killing eight men, including several Venezuelan migrants.",
        "Brownsville Police Chief Felix Sauceda said George Alvarez, 34, ran a red light and lost control of his car Sunday in the southern US city, leaving 10 others injured, some of them in critical condition.Sauceda said authorities were still awaiting a toxicology report on Alvarez, who had a history of run-ins with the law, and had not ruled out any motive for the incident.\"George Alvarez is a Brownsville local with an extensive rap sheet,\" Sauceda said, displaying a long list of previous charges including assault, burglary and driving while intoxicated.The tragedy added to mounting tensions and worries along the southern Texas frontier over a feared surge of migrants across the border as the United States lifts its tough Covid-19 emergency immigration controls on Thursday.After the crash the motorist attempted to flee but was held down by people on the scene until police arrived, according to Sauceda.In addition to the eight counts of manslaughter, Alvarez was charged with 10 counts of aggravated assault with a deadly weapon -- his vehicle.Sauceda did not provide details on the victims, other than confirming that \"several\" were migrants from Venezuela.He said police were in touch with the Venezuelan government and with foreign embassies with regard to the victims.Victor Maldonado, the executive director of the Ozanam Center, a homeless shelter across the street from the crash, said there was a crowd of about 25 people waiting at a bus stop at the time.",
        "Maldonado said the group included Venezuelans who had just eaten breakfast at the facility.He described a grisly scene, with body parts strewn along the street.Witnesses were \"really shocked,\" Maldonado told AFP. \"It was pretty intense.\"- Possible migration surge -",
        "Many thousands of migrants were in Brownsville and waiting across the border in northern Mexico in hopes of making their way into the United States.In the 24-hour homeless center, \"we've been housing individuals coming from Chile, Colombia, Ecuador, China, Ukraine -- and multiple Venezuelans,\" Maldonado said.The accident also came one day after a man killed eight shoppers with an assault rifle at an outlet mall in Allen, Texas, near Dallas in the northern part of the state. The suspected attacker was shot dead by a police officer.Sauceda said he could not confirm reports that Alvarez cursed at the people at the bus stop before his car rushed into the crowd.One witness, 36-year-old Venezuelan Luis Herrera, told AFP that Alvarez accelerated the car with full force.\"It was a matter of moments. The killer came (through) in the car, gesturing at us, insulting us,\" he said.Sauceda said Brownsville police have not ruled out the possibility that the crash was intentional.\"It is an ongoing investigation,\" he told reporters."
    ]
}