{
    "articleURL": "/wires/ap/article-12049485/Biden-sends-wife-Jill-King-Charles-coronation-Saturday.html",
    "content": [
        "WASHINGTON (AP) - Jill Biden has celebrated the athletic grit of wounded service members with Prince Harry, discussed the value of early childhood education with Princess Kate and sipped tea poured by Queen Elizabeth II.",
        "Now the first lady is back in London for another royal engagement. President Joe Biden has dispatched his wife to represent the United States at Saturday's coronation of King Charles III, the late queen's eldest son. No American president has ever attended a British coronation.While in London, she's engaging in a bit of soft diplomacy before the big event. Her first stop in Friday's drizzle was a familiar place: No. 10 Downing St., for her first meeting with Akshata Murty, the wife of Prime Minister Rishi Sunak.Murty greeted Biden with an embrace and a kiss on each cheek. \"Welcome, welcome!\" she said, before turning to shake hands with Finnegan Biden, one of the first lady's granddaughters.Afterward, Jill Biden and Murty met at the Downing Street residence with military veterans and their families participating in a health and wellness program.The sun had come out by the time the pair arrived at the cafeteria at Charles Dickens Primary School in the Borough area of London to meet with students who were wearing golden paper crowns as they participated in coronation-related activities. She told them to \"have fun tomorrow.\"",
        "The first lady also visited the U.S. Embassy to greet staff before she ended her day at a reception the king hosted at Buckingham Palace.",
        "On Saturday, Jill Biden will represent the United States at the coronation at Westminster Abbey, seated among several hundred heads of state, royals from other nations and other guests who were invited to watch Charles and his wife, Camilla, be crowned king and queen. Afterward, she will attend a reception hosted by U.S. Ambassador Jane Hartley.Jill Biden will also mingle at a luncheon Sunday hosted by Sunak and Murty at their Downing Street residence before her flight back to Washington.President Biden has received some criticism for skipping the coronation, though the White House cites the precedent of a U.S. president never attending for his decision.But the president and Charles are hardly strangers. They have chatted each other up at global climate events since Biden took office, and during the queen's funeral last year. They also spoke in April when Biden called to say he was sending the first lady to the coronation, and the president expressed interest in meeting with the king in the United Kingdom at a future date, the White House said at the time.First ladies often stand in for presidents when they can't be present.\"I love seeing the first lady as our representative and I would have been thrilled for any first lady to attend,\" said Lindsay Reynolds, who was first lady Melania Trump's White House chief of staff. \"I don't think it is a slight in any way for the president to not be attending.\"",
        "Jill Biden was just 2 years old when Charles' mother, Elizabeth, was crowned in June 1953. The queen held the throne for seven decades until her death last September at age 96.The first lady tweeted before her flight Thursday that \"it's an honor to represent the United States for this historic moment and celebrate the special relationship between our countries.\"Most modern-era first ladies, including Jill Biden, have engaged with members of the British royal family because the late queen had met every American president since Eisenhower, except for Lyndon Johnson.Biden was the 13th and final U.S. leader to meet the queen. They saw each other when he visited England in 2021 with his wife to participate in a Group of Seven world leader summit. At the time, the queen also invited the Bidens to have tea with her at Windsor Castle.Jill Biden told The Associated Press in a telephone interview after the queen's death that sitting in her living room was like being with one's grandmother.\"And she said, `Let me pour the tea,´ and we said, `No, no, let us help,´ and she said `Oh, no, no, no, I´ll get this. You sit down,´\" the first lady said. \"And it was just a very special moment with a very special woman.\"",
        "During that trip, she and Prince William's wife, Kate, met for the first time at a preschool in southwest England where they participated in a roundtable discussion on the role of early childhood education in life outcomes. They also learned about caring for bunny rabbits.The first lady also has met William´s brother, Prince Harry, several times through their work and support of military veterans. She has joined Harry for the Invictus Games, an athletic competition he founded for wounded or sick military veterans.___Follow the AP's coverage of first lady Jill Biden at https://apnews.com/hub/jill-biden."
    ]
}