{
    "articleURL": "/wires/afp/article-12042121/Zimbabwe-firebrand-opposition-MP-convicted-ahead-vote.html",
    "content": [
        "A popular opposition politician in Zimbabwe was convicted of obstruction of justice in a high-profile trial on Wednesday, a move that bars him from contesting upcoming elections.",
        "In a case that critics said was politically motivated, Job Sikhala was found guilty by a Harare court almost a year after he was first arrested, and after spending more than 300 days behind bars pending the verdict.\"The state has proved its case beyond any reasonable doubt,\" magistrate Marewanazvo Gofa told the court.\"The accused has no defence at all and is hereby found guilty and convicted of the offence\".Later in the day, Sikhala was handed a six-month suspended sentence and a $600 fine, or another six months behind bars if he fails to pay.He will however remain in jail pending other cases against him.Charges against Sikhala were based on a video in which he allegedly demanded justice for the murder of another opposition activist whose mutilated body was found in a well.Prosecutors alleged that by blaming the ruling ZANU-PF party for the death he diverted investigations that were focusing on other suspects.The charge is one of several facing the 50-year-old firebrand.He is accused in other cases of inciting public violence over the same video and of publishing falsehoods. Judges are still to reach a verdict in those cases.Sikhala, who was practising as a lawyer before his arrest, has been held in a maximum-security prison in the capital Harare since June 2022 and unsuccessfully applied for bail 15 times.",
        "- 'Travesty of justice' -The conviction is the first in his long and troubled political career, which includes 67 arrests, according to one of his lawyers.The verdict means Sikhala will be unable to contest presidential and legislative elections which are to be held in August, although no date has been announced yet.\"This is a clear travesty of justice,\" Gift Ostallos Siziba, a spokesman for Sikhala's Citizens Coalition for Change (CCC) party, told reporters outside the court, linking the ruling to the upcoming vote.Critics have accused the government of using the courts to prevent some opposition politicians from running.\"Most of our leaders are in and out of the courts for different concocted political charges,\" said Siziba.Jacob Ngarivhume, leader of a small opposition party, was last week jailed for four years for inciting public violence, a sentence he said was a way to keep him from participating in the next election.Rights groups and opposition parties have complained of an escalating clampdown ahead of the vote.President Emmerson Mnangagwa is struggling to ease entrenched poverty, end chronic power cuts and rein in inflation.Because of his outspoken activism, Sikhala was nicknamed \"Wiwa\" during his university years after Nigerian environmental activist Ken Saro-Wiwa, who was hanged along with eight Ogoni activists in 1995 on a trumped-up murder charge."
    ]
}