{
    "articleURL": "/wires/pa/article-12060699/Mae-Muller-reveals-Harry-Styles-good-luck-charm-Eurovision.html",
    "content": [
        "The UK’s Eurovision hopeful Mae Muller has revealed her “ritual” before going on stage is to drink herbal tea “with a lot of honey in it” from a Harry Styles mug.",
        "The singer, 25, will compete for the UK in the singing competition with her track I Wrote A Song, which features tongue-in-cheek lyrics about a cheating ex-boyfriend and has a propulsive dance beat.The 67th Eurovision Song Contest is taking place in Liverpool after the UK was chosen to host it on behalf of war-torn Ukraine, which won the last contest, marking the first time the competition has been held in the UK for 25 years.",
        "Asked about rituals before performing or if she was taking any good luck charms to Liverpool, Muller said: “I always have to have a tea, any kind of herbal tea with a lot of honey in it, and I have it out of my Harry Styles mug which just gives me the good vibes. I know if Harry’s with me then I know it’s going to be OK.”Muller was working at a pub when she secured her first publishing deal and has since released three EPs and supported Little Mix on their 2019 stadium tour.Her 2021 track Better Days climbed the charts after it became popular on TikTok as part of a challenge and she also performed the song on NBC’s The Tonight Show Starring Jimmy Fallon.The north London-raised vocalist will be hoping to build on the success of last year’s UK contestant Sam Ryder, who topped the Eurovision jury vote in Turin, Italy, but came runner-up to Ukraine’s Kalush Orchestra after a symbolic show of public support saw them take first place with 631 points.",
        "Muller was chosen to represent the UK at Eurovision by TaP Music, the same music company that scouted Ryder, and said she felt it was a “huge honour”.She added: “The fact that we’re hosting this year just feels extra, extra special.”The singer said of I Wrote A Song: “All my music kind of derives from my personal experiences but I just wanted to write something empowering, that would get everyone up off their seats.“I think when we go through negative things like a break-up, or any kind of heartache, it’s really easy to focus on the negatives and get lost in that but I wanted to focus on the empowerment of that and how we can navigate those emotions to come out the other side, feeling confident.”She said to “expect some sass” from her upcoming Eurovision performance, adding: “It’s going to be fun and a big party.”",
        "So far her journey to the Eurovision contest has seen her rub shoulders with the King and Queen, after meeting Charles and Camilla at an event last month in Liverpool, where Charles gave her encouragement, saying: “We will be watching you with great interest – egging you on.”Muller replied: “Thank you, no pressure. No nul points.”And Camilla echoed her words, saying: “No! No nul points.”",
        "This year, 37 countries will take part in Eurovision, with Ukraine automatically qualifying for the grand final as 2022 winners, where they will be joined by the so-called “big five” – the UK, France, Germany, Italy and Spain – who each get a free pass because of their financial contributions to the event.The Eurovision semi-finals will be broadcast on BBC One on Tuesday May 9 and Thursday May 11, with the grand final taking place on Saturday May 13 from 8pm."
    ]
}