{
    "articleURL": "/sport/mlb/article-12054817/White-Sox-pitcher-Liam-Hendriks-pitches-PERFECT-inning-game-cancer-diagnosis.html",
    "content": [
        "Liam Hendriks finished chemotherapy treatment for cancer on April 5And he was back on the mound last night, starring for the Charlotte KnightsDailyMail.com provides all the latest international sports newsWhite Sox pitcher Liam Hendriks was applauded by minor league fans as he returned to the mound on Friday, and went on to pitch a perfect inning in his first action since he was diagnosed with cancer.",
        "Hendriks, who pitched Friday for Triple-A Charlotte, announced he'd been diagnosed with non-Hodgkin lymphoma in January, and shared not long after on April 20 that he was cancer-free.And after being congratulated by a PA announcement and both teams as he warmed up, the three-time All-Star wasted no time in reminding everyone of his talents. 'Both teams got out and started clapping,' Hendriks told reporters after the game. 'Which is, don't get me wrong, it's really, really nice. I very much appreciate it. It made me very emotional.",
        "'I'm a guy who pitches on anger, and it's really hard to get angry when you know the other team is full of nice people. So a little tough to get locked in.'If Hendriks was at all thrown off, it was tough to tell.After entering the game in the seventh inning, he got a popout, strikeout and a groundout. But he knows the one-inning appearance means a lot more than what he contributed on the field.'My wife made me realize how big this is for a lot of people,' Hendriks said afterwards.'She told me it's more about overcoming something extreme and what getting back on a mound so quickly represents to people going through this right now. It's a lot bigger than just me.'",
        "He's set to pitch again on Sunday. A three-time All-Star, Hendriks was third in the majors with 37 saves and made his third All-Star team last season. The Australian led the AL with a career-high 38 saves in 2021, after leaving Oakland to sign a $54million, three-year contract with the White Sox.Hendriks has 115 saves and a 3.81 ERA over 12 seasons with Minnesota, Toronto, Kansas City, Oakland and Chicago.The 34-year-old married his wife, Kristi, in 2013. He thanked her earlier in April for sticking by his side during his three-month long diagnosis. ",
        "'You held my hand every step of the way,' he wrote in a message to his spouse of 10 years. 'You were my voice of confidence and always made sure I felt loved and safe throughout it all.'I love you.' Outside of baseball, the Perth-born righty is an hockey fan, rooting for the Montreal Canadiens. In an interview with NHL network in 2020, Hendriks revealed that he's 'watched every game' and has 'embraced the Habs lifestyle.' The two-time All-MLB First Team nominee is also a fan of the North Melbourne Football Club in the Australian Football League, also known as the AFL."
    ]
}