{
    "articleURL": "/wires/ap/article-12040015/Paraguay-Populist-candidate-fires-protesters-vote.html",
    "content": [
        "ASUNCIÓN, Paraguay (AP) - Hundreds of people protested in Paraguay´s capital for the second straight day Tuesday alleging that this weekend´s presidential elections were marred by fraud, a claim that President-elect Santiago Peña, electoral authorities and international observers dismissed.",
        "Paraguayo Cubas, a far-right populist outsider with the National Crusade Party who came in third in Sunday´s presidential contest with 23% of the vote, called for the demonstrations Monday after he received a larger share of the vote than expected on the back of a strong anti-establishment message.The protests mean Paraguay has become the latest country in the Americas to have a populist candidate call on his supporters to protest the results of an election, alleging fraud without presenting any firm evidence to back up the claims.\"We´re here requesting an audit of all the records,\" said Francisco Soteras, who was a candidate for the lower house of Congress under Cubas' party and joined the protesters Tuesday evening. \"We´re already seeing some signs of fraud in this regard. If there is 10% of fraud, we´re requesting a redo of the elections.\"Peña easily won Sunday´s election with 43% of the vote, a result that shocked analysts who had expected a close race with Efraín Alegre, the second place candidate who represented a coalition of parties that had been described as the best chance in recent history for the opposition to snatch power from the Colorado Party. In the end though, it wasn´t even close as Alegre got 27% of the vote.",
        "Despite the lopsided results, Paraguay woke up with roadblocks in numerous points across the country Tuesday, largely set up by Cubas supporters.",
        "\"This is what the people feel today: discontent, rejection and a bitter feeling that their will was suppressed and the true president of the republic was robbed from them,\" said Cristian Delgado, another legislative candidate for Cubas' party who joined the demonstrations Tuesday.Peña called on the government to assure \"free transit\" in Paraguay´s streets.\"Unfortunately, today many people were unable to reach their places of work, many people arrived late to their workplaces,\" Peña said Tuesday as he dismissed fraud accusations.The Organization of American States, which deployed an electoral observation mission for the vote, said Tuesday that \"there is no reason to doubt the results\" of the election.\"Cubas supporters clashed with police on Monday night outside Paraguay´s electoral court in the capital of Asunción. Some 70 people were detained, prosecutor Fatima Capurro said.The Attorney General´s Office said Tuesday it would investigate the incidents but that didn´t seem to intimidate the protesters who waved Paraguayan flags outside the electoral court later that day.Alegre, the candidate for the Pact for a New Paraguay who came in second, called on Monday for a manual count of votes and an international audit of the country´s electronic voting system. Alegre had conceded shortly after Sunday´s vote and didn´t denounce fraud, although he changed his tune after protests were launched.",
        "Cubas, who openly admires El Salvador´s President Nayib Bukele and his hardline stance against crime, said he would be traveling to Asunción to lead the protests.\"It´s impossible, from my modest point of view, for a weary population to have given victory to these drug traffickers,\" he said in a television interview.Analysts immediately drew parallels to what happened in Brazil last year when supporters of then-President Jair Bolsonaro refused to concede defeat in October elections and his supporters launched protests, which included roadblocks. His supporters later stormed top government buildings to dispute the outcome of the election in a move that recalled the Jan. 6, 2021, assault on the U.S. Capitol by supporters of then-President Donald Trump.\"He´s following Bolsonaro´s playbook by calling for demonstrations,\" said Leandro Lima, a senior political risk analyst at Control Risks, a consultancy.At the same time though, there is a key difference in that Cubas doesn´t enjoy the support from police and military officers like Bolsonaro did. \"This lack of a military component is something that makes the Paraguay case less complex to handle,\" Lima said.The way in which Alegre followed Cubas´ lead on the fraud claims shows how the populist politician will be an important voice in Paraguayan politics despite coming in third in the elections.",
        "That growth in Cubas' influence comes at a time when there is a \"regional trend of an anti-establishment populist discourse against traditional politics and institutions,\" Lima said.In neighboring Argentina, for example, an anti-establishment right-wing populist politician, Javier Milei, is also strengthening and is seen among the favorite candidates ahead of the October presidential election. ------Politi reported from Buenos Aires, Argentina."
    ]
}