{
    "articleURL": "/news/article-12042075/Eleven-men-face-103-charges-historical-sex-abuse-three-teenage-girls-Rochdale.html",
    "content": [
        "The suspects are due before Manchester and Salford Magistrates' CourtGMP said they were charged in connection with investigation Operation LyttonEleven men accused of historical sexual abuse against three teenage girls in Rochdale are set to appear before a court. ",
        "Their combined 103 charges relate to alleged offences against the three girls between 2000 and 2006. Greater Manchester Police (GMP) said they were charged in connection with Operation Lytton - an ongoing investigation into historical sex offences against children. The suspects are due before Manchester and Salford Magistrates' Court on Wednesday. Tahir Rashid, 52, of Hudsons Walk, Rochdale, has been charged with 13 offences, including rape and penetrative sexual activity with an underage girl. ",
        "Mohammad Salim, 44, of Bradley Smithy Close, Rochdale, has been charged with eight offences, including rape and penetrative sexual activity with an underage girl. Suklene Shah, 44, of Crawford Street, Rochdale, has been charged with two counts of penetrative sexual activity with an underage girl. Mohammed Shazad, 42, of Beswicke Royds Street, Rochdale, has been charged with 16 offences, including rape, trafficking persons within the UK for sexual exploitation and penetrative sexual activity with an underage girl. Nisar Hussain, 39, of Newfield Close, Rochdale, has been charged with three offences, including making indecent images of a child and trafficking persons within the UK for sexual exploitation. Naheem Akram, 46, of Manley Road, Rochdale, has been charged with 10 offences, including rape and penetrative sexual activity with an underage girl. Mohammed Zahid, 62, of Station Road, Crumpsall, has been charged with 32 offences, including rape, trafficking persons within the UK for sexual exploitation and penetrative sexual activity with an underage girl, gross indecency with an underage girl, procuring an underage girl to have unlawful sexual intercourse with unknown males. ",
        "Roheez Khan, 37, of Athole Street, Rochdale, has been charged with three offences, including rape and penetrative sexual activity with an underage girl. ",
        "Arfan Khan, 39, of Grouse Street, Rochdale, has been charged with four offences, including rape and penetrative sexual activity with an underage girl. Mustaq Ahmed, 65, of Corona Avenue, Oldham, has been charged with six offences, including rape and gross indecency with an underage girl. Kasir Bashir, 48, of Napier Street East, Oldham, has been charged with six offences, including rape and gross indecency with an underage girl."
    ]
}