{
    "articleURL": "/money/comment/article-12060457/MAGGIE-PAGANO-Dont-let-companies-bully-Britain.html",
    "content": [
        "What should we make of the latest outburst by Revolut chief executive, Nik Storonsky? ",
        "Over the last few days the co-founder of the fintech group has attacked Britain as a lousy place to do business, rebuked the regulators for taking too long in giving him a banking licence, and moaned about high taxes, red tape and a skills shortage.His final shot was to say he would not consider floating on the London markets but head for New York instead.",
        "Storonsky's attack is cleverly timed. It comes at a sensitive moment for Rishi Sunak and Jeremy Hunt who have made a big play of promoting the UK as one of the world's leading tech centres.Only a few months ago the Chancellor name-checked Revolut as a 'shining example from our world-beating fintech sector' during a speech urging tech bosses to help make the country 'the next Silicon Valley'.City regulators are so worried about the number of British companies choosing to float in the US that they have introduced new listing rules aimed at making it more attractive for them to float on the London public markets and not hop to New York.So you can see why Storonsky's biting criticism is causing such a stir at Westminster. But there may be another reason why Storonsky's timing is interesting: his outburst comes as the payments app group is due anytime now to hear the results of its application to be granted a banking licence by the Financial Conduct Authority and the Prudential Regulation Authority.",
        "If that is the case, then it's a bizarre time for Revolut to attack the authorities. Surely he should be sweet-talking them rather than playing the rottweiler? Maybe he knows something we don't.Could it be that Revolut fears it will not get a licence? That wouldn't be much of a surprise: its auditors BDO warned in March that parts of its long-delayed accounts may have been 'materially misstated'.BDO reported that a big chunk of the fintech's revenues in 2021 – £477million out of £636million – may have been misstated because of the design of its IT systems, so was not able to provide 'sufficient appropriate assurances' over revenue streams from foreign exchange to crypto trading. Pretty damning.However, Revolut hit out at media coverage of the report, claiming the BDO audit 'confirmed that the financial statements give a true and fair view' of its books.Questions have also been raised about its lofty valuation. After a funding round in 2021, it boasted of being worth £27billion even though it was only just in profit. Last month Schroders downgraded its value to £14billion, and like many other investors, has written down its stake by about half.If Revolut fears it will not be granted a licence, then this attack looks like a last-minute hard-ball lobbying tactic. ",
        "Or sour grapes. Storonsky is piling the pressure on politicians at a time when he knows how keen they are to improve the business environment and be open to innovative tech savvy companies such as Revolut.Yet neither they nor the regulators should be seduced by the PR machine at work. They must hold their nerve. It's far more important to the reputation of London, and the UK, that all companies which seek a banking licence should be scrutinised with forensic due diligence, and only granted to those beyond reproach.",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}