{
    "articleURL": "/tvshowbiz/article-12038729/Britney-Spears-ex-husband-Jason-Alexander-remarries.html",
    "content": [
        "READ MORE: Britney's ex husband reveals why he crashed her wedding  Britney Spears' ex-husband Jason Alexander has remarried - 19 years after he and the pop queen were married for 55 hours in 2004.",
        "Alexander, 41, and his new wife Rebecca Bell obtained a marriage license before tying the knot on March 27, records obtained by Page Six show. The wedding reveal also comes 11 months after Alexander crashed 41-year-old Britney's June 2022 wedding to Sam Asghari, hours before the nuptials - resulting in his arrest and conviction for trespassing and battery.DailyMail.com has contacted Alexander for further comment. Childhood friends Britney and Jason wed at Las Vegas' Little White Chapel in a 4am ceremony in 2004, but the marriage only lasted a total of 55 hours before annulment.",
        "Alexander has continued to post about Spears in the wake of his own wedding, reposting an article about Spears being allegedly abuse and writing: 'How long does it take for someone to get out of abuse?'It’s not worth it. The money. The status. Pleasing people.'In August 2022 Alexander was convicted of trespassing and battery after crashing her wedding to Asghari and hitting a security guard. Alexander pled no contest to the charges in Ventura County, Calif.Alexander filmed himself crashing the pop star's fairytale wedding armed with a knife and dressed in a white prison jumpsuit.He was initially charged with felony stalking, refusing to leave private property, vandalism and battery.Cops said he gained entry to the private ceremony - whose star-studded guest list included Paris Hilton, Selena Gomez, Madonna and Drew Barrymore - by scaling a fence into the exclusive gated community where Spears' home is situated.",
        "He then climbed down a rocky slope to get onto the singer’s 20-acre property.Running toward Spears’ 12,464-square-foot Italian-style villa while capturing it on his cellphone camera, he screamed: 'I'm Jason Alexander. The first husband. I'm here to crash the wedding.'He would then enter the wedding tent where the nuptials were soon to be held, shouting: 'She's my first wife, she's my only wife.'",
        "After fighting with Britney’s security guards, he was wrestled to the ground and later arrested - an altercation a guest was able to capture on his own cellphone camera.After the attack, Spears was granted a restraining order against her former beau, after she and Asghari told cops that Alexander was carrying a knife when he was arrested.Cops said he gained entry to the private ceremony - whose star-studded guest list included Paris Hilton, Selena Gomez, Madonna and Drew Barrymore - by scaling a fence into the exclusive gated community where Spears' home is situated.He then climbed down a rocky slope to get onto the singer’s 20-acre property.Running toward Spears’ 12,464-square-foot Italian-style villa while capturing it on his cellphone camera, he screamed: 'I'm Jason Alexander. The first husband. I'm here to crash the wedding.'He would then enter the wedding tent where the nuptials were soon to be held, shouting: 'She's my first wife, she's my only wife.'",
        "After fighting with Britney’s security guards, he was wrestled to the ground and later arrested - an altercation a guest was able to capture on his own cellphone camera.After the attack, Spears was granted a restraining order against her former beau, after she and Asghari told cops that Alexander was carrying a knife when he was arrested.In September 2022, Alexander exclusively told DailyMail.com that he crashed wedding as he didn't believe Britney was marrying Asghari and had to see it with his own eyes.'I couldn't let her get married with the conversations we've had over the last two years,' he said. 'I wasn't there to cause harm. I was just there to Speak to Britney and make sure she was okay and this is what she wanted.He said when they spoke just a few days before the wedding she didn't mention anything about getting married to Asghari and he feared she was being forced into it, especially after spending the last 13 years under a conservatorship.'It's all for show. A Hollywood script,' Jason said of the marriage. 'I don't think she looks happy. That whole thing is not real.'",
        "'I spoke to her the Monday leading up to the wedding and she didn't mention anything about getting married,' he says. 'We talked about the people she hangs out with that calls her her friends. Business associates that profit off of her.'",
        "'Most people aren't aware of what's been happening in the background,' he says.The conversation lasted around 30 minutes and Jason tells DailyMail.com that he and Britney agreed that she would reach out to him on WhatsApp, but he became worried when he never heard from her.Upon seeing news of the wedding in the media, he was felt inclined to go to her home to find out himself.'I wanted to see it for myself,' he said.Jason is adamant that he had no intention to hurt Britney and was only looking out for her best interest.He insists that if he actually saw Britney that day, he never would have been arrested and the 'outcome would have been different.'",
        "However, if he had run into Britney's now-husband Sam Asghari, Jason says, 'I don't know what would have happened, but that would have been interesting.''No, I don't think she looks happy. That whole thing is not real,' he says.'It's all for show. A Hollywood script.'Jason admits that his appearance at the wedding was a jarring scene, saying, 'It could look a little scary if you don't know the history.'When asked if he wants too see her perform again, he says without without skipping a beat, 'I want to see her happy.'",
        " It comes as sources close to the singer are now saying that 'all is good' when it comes to her marriage to Asghari after she was seen without her wedding ring a few times. ",
        "Spears sparked rampant speculation that there might be trouble in paradise when she was seen without her sparkler during a recent trip to Hawaii.But the Gimme More hitmaker quickly shot down the rumors in subsequent Instagram videos and soon began wearing her ring once again. A representative for Sam also denied the concerns, saying, 'Sam is not having marital issues. He simply took off his ring because he is filming a movie.'According to IMDb, his project Grand Death Lotto is currently in production, though it is apparently shooting in Atlanta, but he was seen running errands without his ring on late last month."
    ]
}