{
    "articleURL": "/news/article-12055819/Dolly-Diamond-Melbourne-drag-queen-received-death-threats-performed-Mount-Gambier.html",
    "content": [
        "Michael Dalton has opened up about dangers he facesDolly Diamond performer said he won't be intimidated  A drag queen has opened up about the dangers of his job and has vowed to keep performing after receiving death threats for reading to children.",
        "Michael Dalton, who performs under the name Dolly Diamond, performed a reading at Mount Gambier's Library in South Australia in March despite staff at the venue receiving death threats. He has since admitted to being scared during the performance due to 'fear of the unknown'. His comment comes as drag performers come under increasing attack for hosting story-time library events with severe backlash prompting a local council to cancel a reading scheduled for May 19. ",
        "'There's always someone out there that believes it's their right to take it to the next level and do something physical,' he told the ABC.'I'm not going to back down on this, because there is no reason to back down.'Monash Council, in Victoria, announced on Thursday it was cancelling a planned drag story-time library event for babies and preschool children following public outcry.The reading was slated to be held on May 19, which is International Day Against Homophobia, Biphobia and Transphobia. Protesters stormed the council chambers in Melbourne's southeast to try to stop the sold-out event featuring drag queen performer Sam T at Oakleigh Library.Tensions boiled over as protesters yelled abuse at pro-drag and LGBTIQA+ community supporters.They were filmed banging on glass walls and screaming 'shame on you' at councillors.Monash CEO Dr Andi Diamond issued a statement announcing the decision to cancel the event over safety concerns for staff and those attending. ",
        "Mr Dalton, who is based in Melbourne, insisted there is a significant difference in approach to a performance in a nightclub and an all-ages event, such as the one in Mount Gambier, where children are in the audience.'What is delivered to a younger audience must always be age appropriate,' he said.'It shouldn't really matter whether it's a man in a dress or a man dressed as a banana, or as a kangaroo.'Mr Dalton said he believed a lot of people had an issue with the drag queen label.'I've never really viewed Dolly as a drag queen in the [same] sense that Dame Edna was always just Dame Edna,' he says.He said that was because late comedian Barry Humphries was so skilled at building the character up over the years as a woman, not just a man in drag.He posted on Instagram a week ago: 'The fact that we’re having to justify [drag] at all is f***ing ridiculous.'"
    ]
}