{
    "articleURL": "/news/article-12050165/Millner-attack-Bangladeshi-student-Darwin-killed-man-charged.html",
    "content": [
        "A 29-year-old man has been charged with the murder of a Bangladeshi student during a break-in at a Darwin property, with the death prompting an outpouring of condolences as it shocked the university and wider communities.",
        "Md Ishaqur Rahman Sifat, 23, who was enrolled in a masters of engineering course at Charles Darwin University, was left in a critical condition after the early morning attack on Wednesday.Northern Territory Police said a man entered the home at Millner, in Darwin's north, about 4.25am and allegedly assaulted the resident before fleeing the scene.The accused was detained in a vehicle a short time later while the injured student was taken to Royal Darwin Hospital. Mr Rahman died on Thursday as a result of a traumatic brain injury.",
        "On Friday the man detained was charged with murder, aggravated burglary and theft.He was refused police bail to appear in Darwin Local Court on Monday.Northern Territory Acting Police Commissioner Michael Murphy said the alleged attack was a 'serious, senseless, heartbreaking act of violence' and he offered his heartfelt condolences to the Bangladeshi community, including the student's family who were in Darwin.'It's just not the Darwin that we know and I can reassure the Northern Territory community that the police are doing everything we can to ensure that these senseless acts of violence cease,' he told Sky News on Friday.The university said the incident had devastated the community, with students and staff holding rallies in support.'We open our city and university to international students with the promise of a safe and supportive environment characterised by enduring friendships, meaningful education and training and prosperous careers,' the university said in a statement.",
        "'To know that these opportunities have been senselessly ripped away from one of our students is deeply distressing.'",
        "The university's Bangladeshi Student Association said Mr Rahman fought bravely but sadly succumbed to his injuries.'Our whole community is shaken by this tragic loss,' the association said in a statement.'Let us come together in love and support for his family and friends during this time of grief.'NT Chief Minister Natasha Fyles said she extended her deepest condolences to all who knew and loved Mr Rahman'Our thoughts are with his family, the Bangladeshi community, and all our international students,' she said.'We are here for you. And we stand with you, unequivocally. This is not the Northern Territory we know and love.'Police said they would speak with students at the university and were contacting the dead man's family in Bangladesh.Acting Assistant Commissioner Sachin Sharma said he felt 'quite touched' by the incident as he had also come to Australia as an international student.'The impact is quite deep. I don't think it will go away for those family members and friends of the deceased,' he said."
    ]
}