{
    "articleURL": "/tvshowbiz/article-12049159/Sister-Wives-Janelle-Brown-sets-RV-prepares-summer-following-split-Kody-Brown.html",
    "content": [
        "Janelle Brown is getting ready for summer.",
        "The Sister Wives personality, 53, documented the challenges as she prepares for a summer season of RV life in the wake of confirming her breakup with Kody Brown late last year. The TLC star took to Instagram with a clip with her son Gabe, 22, on Wednesday as they prepared their camper for the season ahead.'I came up to hook up my trailer,' Janelle said, adding that she and her son were in the process of 'learning a lot about power adapters connecting your trailer to the power.'Janelle acknowledged she was a novice on the topic, but engaging with full gusto as she took on a new challenge.",
        "'All of you RVers out there are going to be laughing your head off at me,' she said. 'But you know what, this is what's about figuring it out and not getting defeated and just getting it done - you have to just be brave and do this.'In the clip, the reality star was clad in a gray outdoor hat with a chinstrap, and a V-neck dark camouflage shirt in shades of gray and navy blue.Janelle discussed the importance of being willing to explore new areas in life with an open mind in the caption of the social media post.",
        "'Everyone has to start at the beginning!' she said. 'With the basics.'She continued: 'When I was in the RV last time we were boon-docking so everything, even hooking up this trailer to \"hook-ups\" is new.'Janelle explained to her 1 million followers about how she reconciles pushing forward with tough tasks.'I have a sneaky perfectionist inside me that is always yelling at me \"If you don’t look like you know what you are doing, either don’t do it or fake it,\"' she said. 'Do you hear yourself telling stories like that in your head?'Janelle said at that point, she squares her shoulders and tells herself that you you have to start somewhere.",
        "'And everyone had to learn and go through this process,' she said. 'It’s ok to be vulnerable, coachable, teachable and curious. Some day I’ll have this down and can be \"the expert.\"'She added, 'I know many of you who already have learned the lessons, are probably getting a good chuckle. That’s ok!'She wrapped up the post in confirming that the host her son had around his neck was 'brand new and clean.' Janelle received supportive comments in the adjacent thread, as one user told her, 'Of all of the four women in your marriage, I always felt you were the strongest and most independent.",
        "'And yep, you are. I love that you are living your best life and being true to yourself.'Said another, 'Fellow RVer’s have all been though this ... you got this girl!'Janelle revealed she and Brown had split last year, nearly 30 years after they entered into a polygamous marriage. They are parents to adult children Logan, 28, Madison, 27, Hunter, 25, Garrison, 25, Gabe, and Savanah, 18."
    ]
}