{
    "articleURL": "/wires/ap/article-12050757/US-probes-complaint-woman-trapped-flaming-SUV.html",
    "content": [
        "DETROIT (AP) - U.S. safety regulators are investigating possible electrical problems in older Dodge Journeys after a woman was trapped and died when her SUV caught fire in December.",
        "The National Highway Traffic Safety Administration says it's investigating whether inoperative door locks and windows can prevent people from getting out of the SUVs during an emergency.Documents posted Friday on the agency's website say the probe covers more than 82,000 Journeys from the 2009 model year. The investigation was opened after the woman's death on Dec. 9.A complaint filed with the agency says the woman pulled to the side of a road when warning lights started flashing, windshield wipers came on, the horn started honking, windows wouldn't go down and the doors wouldn't unlock. The complaint alleged that fire apparently started in the engine and spread, trapping the woman inside.\"The driver was unable to exit the vehicle, resulting in her death,\" the agency wrote in documents.Stellantis, which makes Dodge vehicles, offered sympathy to the woman's family and said it is cooperating with NHTSA.",
        "Agency documents don't say where the fire happened, but the Wisconsin State Journal reported in January that 73-year-old Mary Frahm died when her Journey caught fire Dec. 9 near Madison.Frahm had called her fiance and told him she pulled to the side of the road after the Journey started having electrical problems. Later she called back and said smoke was coming from the dashboard and she could smell burning, the newspaper said. She called 911, but by the time first responders had arrived, flames had engulfed the SUV, the newspaper reported.",
        "In 2009, Chrysler LLC recalled about 17,000 Journeys because an unused electrical connector could corrode and short circuit, potentially causing a fire, according to NHTSA documents.The Journey owner´s manual says the doors can be unlocked manually by pulling up a plunger on the top of the door trim panel.Michael Brooks, executive director of the nonprofit Center for Auto Safety, says drivers should try to pull up the plunger first to escape if their vehicle's electrical system malfunctions.Beyond that, escape is difficult because many windows now have plastic laminated between two layers of glass and are difficult to shatter. He suggests keeping a metal tool in the car and becoming familiar with which windows are tempered glass and can be shattered with the tool.Laminated glass, he said, helps to prevent people from being thrown from cars in a crash.He said there's a need to standardize a way to unlock doors or somehow escape from all cars."
    ]
}