{
    "articleURL": "/wires/pa/article-12038893/Vapes-public-health-ticking-time-bomb-18s-MPs-told.html",
    "content": [
        "Vaping products are being “illicitly traded” in school playgrounds, MPs have heard, amid fears the devices are a “public health ticking time bomb” for youngsters.",
        "Conservative MP Neil Hudson (Penrith and The Border) suggested the products could be hidden from view in shops to stop the “appealing, colourful, fruit-flavoured” choices appearing “like sweeties on shelves”.His remarks came as he pressed the Government to take further action to discourage vape usage among under-18s.Ministers last month pledged a crackdown on the illegal sale of e-cigarettes to under-18s with an “illicit vapes enforcement squad”.",
        "They are also seeking to identify other ways to reduce the number of children using the products, which allow people to inhale nicotine in a vapour rather than smoke.Speaking in Parliament, Mr Hudson highlighted reports of children having their sleep patterns disrupted.He told MPs: “Setting their alarms for two or three in the morning so they can vape in the middle of the night to avoid withdrawal symptoms the next day.“At school there have been reports of students leaving lessons and even walking out of examinations because they simply cannot last without the use of a vape.“If vaping is having detrimental impacts on the life chances of our young children this is not merely a matter of health but one of social and educational development.“One teacher in my constituency even noted that so widespread is the issue that vapes are being illicitly traded in the school playground.”",
        "Mr Hudson said there is also “flagrant targeting” of under-18s by advertising, including on social media.Pressed on what more the Government should be doing to prevent children from vaping, Mr Hudson replied: “Calling for evidence and having a taskforce is a good starting post, but I think we need to do more. Our message is very clear: vapes should not be used by people under the age of 18 or by non-smokers  Neil O'Brien, health minister  “I think we really need to tackle the advertising, making sure that the labelling is sufficient.”He pointed to “quite alarming” health warnings on cigarette packaging, adding: “They are behind closed cabinets in outlets as well. I think we need to be moving in that direction so that these are not like sweeties on shelves for our young kids.“I think that is the real issue. These are appealing, colourful, fruit-flavoured products that people think, ‘You know what, I want to have a try of this’ and that is where people are slipping into this problem.“I fear that we have a public health ticking time bomb for our young people that we must as a parliament and a society address as a priority.”Health minister Neil O’Brien said there has been a “surge” in the use and promotion of “cheap, colourful” vaping products in the last 18 months.",
        "He said: “We know that vapes are not risk-free. Nicotine is highly addictive and it can be harmful and there are unanswered questions about the effect in the longer-term use.“Our message is very clear: vapes should not be used by people under the age of 18 or by non-smokers.”"
    ]
}