{
    "articleURL": "/wires/pa/article-12056981/It-lifts-heart--Coronation-Big-Lunch-organisers-hail-community-spirit.html",
    "content": [
        "Coronation Big Lunch organisers and guests have hailed the community spirit fostered on Sunday, with one describing such get togethers as “essential”.",
        "The coronation celebrations continued the day after the King was crowned, with thousands of people coming together to enjoy food, drink, games and music up and down the country.",
        "Prime Minister Rishi Sunak was joined by US First Lady Jill Biden at Downing Street’s Big Lunch while the Duke and Duchess of Edinburgh attended an event in Cranleigh, Surrey.But it was community organisers such as Kate Welch, a trustee of The Old Rectory, a grade II listed building in Houghton-le-Spring, Sunderland, who put the effort in to arrange local events for thousands to enjoy.“The whole idea for us is it’s about bringing the community together,” Ms Welch, 65, from Chester-le-Street, told the PA news agency.",
        "“We are a community that is in the old coalfields area, so it’s an area where a lot of people don’t have much money.“A lot of people have struggled, Covid obviously came… so just being able to come out and share together – I’ve been looking around, I can see children in pushchairs, I can see people in wheelchairs and mobility scooters.”Thousands of people were in attendance at Ms Welch’s Big Lunch, enjoying circus skills, dinosaur hunts, hot dogs and a storytelling tent among other things.“It just lifts your heart doesn’t it? It’s amazing,” she said.",
        "“You see the amount of red, white and blue out here, lots of people are definitely here to celebrate the coronation. Some people are here just to enjoy the fun – welcome to all of them.“What’s my favourite? Oh, I’m watching kids blowing giant bubbles. They’re in their waterproof suits, and they’re just having a ball.” It’s an excuse to get people together, whatever your allegiances, however you vote, whatever you think  Sonia Hearld  Meanwhile, residents of Burn, near Selby, have been putting on a Big Lunch since 2009, making it one of the longest running events of its kind.The village’s decorations include a life-size recreation of the Gold State Coach, complete with horses and cut-outs of the King and Queen.Neighbours gathered in a marquee outside the Wheatsheaf pub for a barbecue, royal-themed quizzes and a treasure hunt, with activities for children including royal hopscotch and a throne photo booth.Sonia Hearld, who started organising Burn’s Big Lunch in 2009 in a bid to bring her rural community together and combat loneliness, said: “Whatever you think about the royal family, I think it’s just a great historic event, the like of which many of us will never see again.“It’s an excuse to get people together, whatever your allegiances, however you vote, whatever you think, and as we all know from Covid, Zoom doesn’t take the place of real interaction.”",
        "Sheila Holmes, 79, attended the Coronation Big Lunch in Burn with her husband Gordon, 88, who served on the parish council for 43 years.Mrs Holmes said: “It’s marvellous for such a small village to make such a supreme effort.“I thought the service yesterday was beautiful. It’s what we do best, being British.”Parish council chair Chris Phillipson said: “I’ve lived in the village all my life.“We used to have sports days but as the village got older and children got older and moved away, they stopped, so it’s nice to resurrect some sort of community event.” We've got kids who are 13 or 14 talking to different generations, when normally in the street they might not do that  Nick Pritchard  Nick Pritchard, 39, from Three Cocks in Wales, is the founder of Three Cocks Matters, which aims to bring the local community together after he noticed a lack of connection and communal space.With no community hall, their Big Lunch took place at the local school, with attendees aged from 19 months “right up to 80s if not 90s”, according to Mr Pritchard.“I see it as essential (bringing people together),” he added.“To have events is essential because it’s just giving an opportunity to get people around the table – that whole ‘knowing your neighbour’ situation has definitely been lost over the last 20-30 years.",
        "“Post-Covid people have really started to realise how important that community connection is.“We’ve got kids who are 13 or 14 talking to different generations, when normally in the street they might not do that.”Judith Taylor, 69, from Brighton, started a movement in her area to help people look after and maintain their local spaces, some of which were used to host their Big Lunch event.“It’s just amazing. It is a bit of a proud moment,” she said.“In this community we all live in flats for a start, so we don’t have our own gardens.“When you have flats you tend to have very small families, people living on their own, older people, so it’s so important for them.“It is a bit of an excuse to come together but I would say probably two thirds of people out there are waving their union flags.”"
    ]
}