{
    "articleURL": "/tvshowbiz/article-12051559/Selena-Gomezs-ex-Andrew-Taggart-Chainsmokers-holds-hands-mystery-woman.html",
    "content": [
        "Selena Gomez' ex, Andrew 'Drew' Taggart of The Chainsmokers, was seen flashing a smile as he held hands with a mystery woman as they exited a VIP party in Miami earlier Thursday. ",
        "The Closer hitmaker, 33, who was last romantically linked to the Only Murders In The Building actress, 30, in February, shared a laugh with his guest as they strolled through a parking lot to leave the event hosted by Carbone restaurant. The performer opted for stylish comfort wearing a black, short-sleeved button up which he opted to leave partially unfastened near the top. He also slipped into a pair of loose-fitting, black trousers along with white sneakers for a bit of color contrast to his rather monochromatic look for the night. The mystery woman dressed to impress and put on a leggy display donning a semi-sheer, gold knit minidress with a hem that stopped just a few inches above her knees.  ",
        "The ensemble contained a low-cut bodice and was held up with thin straps that wrapped around her shoulders. She slipped into a pair of nude-colored, open-toed heels to coincide with the color scheme of her dress. Her long locks were parted in the middle, and slicked back into a half ponytail, allowing the strands to fall down straight behind her. A black, crocodile-embossed purse was easily slung over her right shoulder to hold a few items she needed during the festivities. As the pair made their way out of the party, Drew held hands with the mystery woman and guided her through the crowds outside. The two were seen sharing a laugh and flashing cheerful smiles as they made their way out of the venue. ",
        "The Chainsmokers singer was previously linked to Selena Gomez earlier this year in January, and the two stars were seen grabbing dinner in New York City, as well as having a bowling date. At the time, a source informed Us Weekly, 'They aren’t trying to hide their romance by sneaking around at members only clubs.' 'They are so affectionate and having a lot of fun together. Selena can hardly keep her hands off him,' the insider continued. Before dating Gomez, Taggart was linked to Steve Jobs' daughter, Eve Jobs, until their split in late 2022. ",
        "They began seeing each other in summer 2022, but chose to go their separate ways later that same year. A separate source confirmed to Us Weekly that the break up was 'totally amicable.' However, when budding romance rumors between Drew and Selena surfaced earlier this year in January, Jobs deleted all posts of The Chainsmokers singer from her main Instagram page. Later in February, another insider revealed to Us Weekly that both, 'Selena and Drew have an amazing connection,' and added, 'They’re so happy to have gone with their guts and jumped in to give this a try.' The source expressed that Taggart is a 'nice guy' and that the former Disney channel star 'loves that.' ",
        "In March, the Wizards Of Waverly Place alum jumped to her TikTok page, per Us Weekly, and gave her fans and followers a quick update about her relationship status. She chose to lip-sync to an audio track that stated, 'I hate it when girls are like, \"Oh my gosh, my crush doesn’t even know that I exist.\" Girl, my crush doesn’t even exist!' In the caption attached to the clip, the Wolves songstress typed out, 'Still out here lookin for him lol,' hinting that her romance with Drew had come to an end. That same month, speculation arose that she had moved on with former One Direction member, Zayn Malik, after a TikTok user, Karissa Garcia, uploaded a viral TikTok that claimed a friend of hers was a hostess at a restaurant the two stars had dined at. ",
        "In the video, she then showed messages from her friend that claimed Selena and Zayn had shared a kiss while enjoying a dinner date together. 'Selena and Zayn went out in SoHo in New York City last night at around 10:30 pm. They walked in holding hands and were kissing,' an eyewitness later informed Entertainment Tonight. 'Most restaurant staff and restaurant-goers didn't notice them. It seemed like they were comfortable together and it was clear that it was a date,' the source added to the outlet. ",
        "Later in March, she stepped out with Zayn's personal assistant, Taryn Zimmerman, but has not been publicly seen with the Pillow Talk hitmaker since the initial romance rumors.  "
    ]
}