{
    "articleURL": "/news/article-12060007/Fake-1990s-lesbian-pop-duo-Tatu-stage-reunion-ahead-match-Putins-favourite-football-team.html",
    "content": [
        "Russian pop duo Tatu were best known for 2002 track All The Things She SaidIn a steamy music video, 'lesbian' duo Yulia and Lena kissed passionately in rainThey performed for first time in seven years at Putin's favourite football club Fake 'lesbian' pop duo Tatu have staged a reunion at Vladimir Putin's favourite football club despite efforts from his fanatics have the pair cancelled as 'LGBT propaganda'.",
        "Yulia Volkova and Lena Katina, now both 38, rose to stardom in 1999 - the same year the Russian despot first came to power.Tatu were best known for their 2002 track All The Things She Said which caused international controversy for its steamy music video in which Yulia and Lena portrayed an underage lesbian couple.In the video, the pair were seen in schoolgirl outfits, kissing passionately in the rain, while being watched by their peers.ITV even refused to play the clip on Ant and Dec's morning music show CD:UK, insisting: 'It is not really suitable for children.' ",
        "Performing yesterday for the first time since their last reunion in 2016, Tatu sang Not Gonna Get us before Gazprom-backed Zenit St Petersburg's clash with Spartak Moscow which the home side won 3-2, sealing a fifth Russian Premier League title in a row.Tatu came out of retirement as Putin's censors seek to expunge any trace of their band amid a hardline crackdown on LGBT propaganda, part of a wave of repressions in Russia during the war in Ukraine.Speaking ahead of the match in front of thousands of Russian fans, they sang: 'Nothing can stop this, 'Not now, I love you', 'They're not gonna get us'.'Yulia is now a mother of two while Lena, now married to millionaire businessman Dmitry Spiridonov, was visibly pregnant with her second child.",
        "Tatu has not existed since 2011, although they did reunite for a special performance seven years ago.Despite this, they are subjected to a crackdown on Kremlin-obedient VK social media.Ardently pro-Putin MP Tatiana Butskaya, 47, is demanding a full ban on Tatu content, arguing that the duo's creativity 'promoted' same-sex relationships.",
        "'Never in my life in our childhood did it occur to me that a girl could be with a girl, until Tatu popped up,' said Butskaya.Girls began to 'hold hands' and this became normal, said Butskaya, a paediatrician and deputy chairman of the Russian parliament's committee on families, women and children.She told a conference: 'A song is not just a rhythm and words, it's \"Look at me, do as I do, try, it's okay\".'The MP has even compared homosexuality with liver disease and tooth decay. 'A boy should look like a boy, a girl should look like a girl,' she said.'And if you have a disease, then it should be treated, and not bragged about.'A boy should be like a boy, a girl should be like a girl.'Yet her hero Putin used Yulia and Lena at the opening of the Russian Winter Olympics in 2014, when the pair got back together.",
        "The new wave of censoriousness coincides with the war in Ukraine - and they are held to be an example of the West poisoning Russia with alien values.",
        "The pair caused a storm in Britain and elsewhere when they burst onto the international scene kissing and cuddling on stage while wearing scanty school uniforms.Yulia, also an actress, has sought in vain to be elected in Putin's party with an official calling her 'bold' and 'professional'.'Yes, I have sinned, made mistakes, but I always found the way through pain, tears and suffering…,' she said at the time. Yulia has not ruled out a new bid to be an MP.The singer faced backlash after appearing on Russian TV show Lie Detector in 2014 after stating she would condemn her son if he came out as gay.'Yes, I would condemn him, because I believe that a real man must be a real man,' she was translated as saying.",
        "'God created man for procreation, it is the nature. The man for me is the support, the strength of… I won't accept a gay son.'In a bid to justify her opinion, she added: 'And a man has no right to be a f*g. Two girls together – not the same thing as the two men together. It seems to me that lesbians look aesthetically much nicer than two men holding their hands or kissing. In Britain, she enraged Richard Madeley and Judy Finnigan who launched a campaign to ban the All The Things She Said video.",
        "At their height of fame, the pair defied their critics and topped the charts in many Western countries as well as Russia."
    ]
}