{
    "articleURL": "/news/article-12056663/Shocking-moment-grandfather-64-pushed-canal-fishing.html",
    "content": [
        "Wayne Cairns, 64, was pushed into the Shropshire Union Canal while fishingDistressing footage shows the grandfather toppling forwards into the water This is the shocking moment a grandfather was pushed into a canal in a vicious attack. ",
        "Wayne Cairns, 64, from Chester, said he is lucky to be alive after being forced into the Shropshire Union Canal while fishing. Mr Cairns, who suffers from angina and lung problems, claimed he was pushed by a man who was swimming there. Distressing footage shows the man stretching behind the sitting grandfather before waving across the water where distant cheers are heard. He then shoves the victim who tips forward into the canal. ",
        "Speaking to Cheshire Live, Mr Cairns said: 'We were fishing by Telford's Warehouse when this lad jumped in and started swimming where we were fishing. 'I said ''Why don't you go to that side of the canal as we are fishing''.'After he got out of the water he came over to me, put his hands up and pushed me straight in.' The grandfather-of-three added: 'I could have lost my life. It was terrifying.' Mr Cairns was with his wife Ann, 68, when the horrifying incident happened close to Telfords Warehouse, a canalside bar, at around 7pm on April 26. A spokesperson for Cheshire Police told MailOnline: 'At 7.40pm on Wednesday 26 April police were called to reports of an incident on banks of the Shropshire Union Canal near to Telford's Warehouse.",
        "'The caller reported that a 64-year-old man had been involved in a verbal altercation with an unknown man and woman.",
        "'During the incident the man pushed the victim into the canal.'Officers attended the scene and spoke to the victim. They also conducted a search of the area and reviewed CCTV footage, but were unable to locate the offenders.'Enquiries in relation to the incident are ongoing and as part of their investigation officer are keen to hear from anyone who witnessed the incident, the same goes for anyone who recognises the man and woman in the video footage.'Anyone with any information is asked to contact Cheshire police on 101, or at www.cheshire.police.uk/tell-us, quoting IML 1533530. "
    ]
}