{
    "articleURL": "/wires/ap/article-12038647/Toyota-expands-NASCAR-fleet-adding-Jimmie-Johnsons-team.html",
    "content": [
        "Toyota will finally expand its fleet in NASCAR by adding Jimmie Johnson's two-car team next season. The addition of Legacy Motor Club will give Toyota eight Camry TRD's in the Cup Series.",
        "Toyota has long been the smallest manufacturer in NASCAR and also long eager to add new teams to its roster. It backs four cars at Joe Gibbs Racing right now, and two more at 23XI Racing.Legacy, which is the bones of Petty Enterprises bought out by Maury Gallagher who then added seven-time NASCAR champion Johnson as co-owner, will leave Chevrolet. The team fields cars for Erik Jones and Noah Gragson, and occasionally Johnson.David Wilson said Toyota was \"humbled and delighted\" to add Legacy, with the president of TRD, U.S.A. praising where the team is headed in a Tuesday statement.\"Jimmie Johnson and Maury Gallagher have impressed us with their long-term vision and commitment to building a championship-caliber organization,'' Wilson said. \"More importantly, their character and values are aligned with ours and our current Cup Series partners, Joe Gibbs Racing and 23XI Racing.\"Of course, we also look forward to being reunited with our old friends, Erik Jones and Noah Gragson.\"Jones was a Toyota development driver who made it to the Cup Series with JGR before he lost his seat. With not enough teams on the roster to find Jones a new job, Toyota was forced to let go a driver it had invested heavily into throughout his career.",
        "Among the other top drivers Toyota has lost are two-time champion Kyle Busch and Daniel Suarez, the only Mexican driver in NASCAR's top series.Toyota, which is in its 20th season of NASCAR national competition, has succeeded despite its low car count. It has nearly 600 victories across NASCAR´s top three series.\"Maury Gallagher and I are very excited about the partnership with Toyota and TRD beginning in 2024,\" said LEGACY M.C. co-owner Jimmie Johnson. \"We admire and respect the level at which Toyota conducts their business in this sport and look forward to forging a new legacy for the future.\"Johnson also thanked Chevrolet, which was his longtime backer and helped him get to NASCAR. He won seven championships as a Chevy driver.\"I will always be appreciative to Chevrolet and everything we have accomplished together,\" Johnson said. \"I´m so thankful they took a chance on a kid from California so long ago and proud that the history books will forever memorialize our record-breaking success we shared.\"___AP auto racing: https://apnews.com/hub/auto-racing and https://twitter.com/AP_Sports"
    ]
}