{
    "articleURL": "/wires/ap/article-12048219/In-No-Hard-Feelings--comedy-Jennifer-Lawrence.html",
    "content": [
        "LAS VEGAS (AP) - Jennifer Lawrence has wanted to do a big comedy for years. She has always been funny and vibrant in her television appearances. And while she has brought humor and physical comedy to many of her roles for David O. Russell and others, she also hasn´t exactly gotten the big, broad \"Dumb and Dumber\" or \"Anchorman\" experience, to cite some of her favorites (or at least the ones she's memorized).",
        "That changes this summer with \" No Hard Feelings \" (in theaters June 23), a classic, raunchy R-rated comedy that was tailor made for her.\"I´ve always wanted to do a comedy. And I´ve read a lot of them,\" Lawrence told The Associated Press last week in Las Vegas. \"I just didn´t read anything that was funny enough.\"\"No Hard Feelings\" was inspired by a real Craigslist ad posted by parents who were seeking a woman to \"date\" their son to bring him out of his shell the summer before he went to college. There are debates over just how real the \"real ad\" was, but thinking about the woman who might answer an ad like that was a premise funny enough to catch the attention of several producers and writer-director Gene Stupnitsky.Stupnitsky, an Emmy-nominated alum of \"The Office\" who also directed and co-wrote the 2019 hit \"Good Boys,\" knew just who to take it to. He told Lawrence about the idea one night at dinner with friends in which, he estimated, they had had about \"eight or nine martinis between us.\"The two met over a decade ago, through a mutual friend, at Medieval Times of all places. Lawrence, he remembered, was dressed in a full wizard costume. And they soon became actual friends. He even introduced Lawrence to her husband.",
        "\"I owed him one,\" Lawrence said. \"That´s why I did this film.\"Stupnitsky, sitting next to Lawrence, added: \"There´s probably some truth to that.\"With Lawrence attached to star and produce, the movie became a hot commodity, with streaming services and studios vying for the rights to make it. Ultimately, they went with Sony and a traditional theatrical release.\"The reason I wrote this movie for her is because I knew how funny she was and I wanted everyone else to know. I mean, people know she´s funny but they wanted her in a comedy. I thought, yes I know how to do this. I know how to write her voice,\" Stupnitsky said. \"I remember I told her, `I really want you to experience a feeling of sitting in a theater with hundreds of people laughing.´ She´s had many, many experiences in film, but she hasn´t quite had this one.\"In \"No Hard Feelings,\" Lawrence´s character Maddie is having a rough stretch with money. As an Uber driver without a car she´s in a pressing bind. So when she finds this ad with the promise of a Buick Regal as payment, she takes the bait. In a clip that Sony debuted for theater owners at the CinemaCon convention last week, Maddie meets 19-year-old Percy (Andrew Barth Feldman) for the first time wearing a slim, hot pink mini dress and high heels and acting overtly flirty and available.",
        "\"She´s dressed like what she thinks is a 19-year-old´s idea of a sex fantasy. And she´s wrong,\" Stupnitsky said. \"He´s like the one kid who she can´t seduce.\"The situation escalates from there as she tries to give him a ride home. He thinks he´s being abducted and, as anyone who has watched the red-band trailer knows, it ends with her getting pepper sprayed. But there´s a sweet core to the film too.\"He is longing for a connection, which is what she needs as well but doesn´t know it yet,\" Stupnitsky said. \"She wants to get the car and move on with her life. But he´s forcing her to kind of take things slow and get to know him and be intimate, in a way, with him in a platonic sort of way.\"The experience, Lawrence said, was a blast, helped by her connection with her younger co-star.\"We just laughed all day long,\" she said. \"Sometimes I would get in bed after work and just like, giggle before going to sleep, just thinking about the day. I was also sad for making it because I was like, `God, I´m just I´m not going to have one of these again. This is this is so singular.´\"As a producer on the film, Lawrence has already gotten to watch it with an audience and experience that big, communal laughter that Stupnitsky promised.",
        "\"I went to a test screening and sat in back,\" she said. \"It was pretty extraordinary.\"Every film, she knows, is a gamble but she´s pretty confident about \"No Hard Feelings.\"\"You really never know. You might think audiences want this and they don´t. And I´ve certainly had my experiences with that,\" she said. \"It´s a mix of instinct and looking at the information that you have. I knew what we had was the funniest movie that anybody would have ever seen - I have no doubts about that-and I knew that Gene was the one that could do it.\"It´s also Lawrence´s first major theatrical release in a few years, since the 2019 X-Men movie \"Dark Phoenix.\" Her recent films have been primarily streaming releases with Netflix´s \"Don´t Look Up\" and Apple´s \"Causeway,\" which she also produced.\"I think audiences are really going to remember why they love her,\"Stupnitsky said.Lawrence laughed: \"I look much better 12 feet high.\""
    ]
}