{
    "articleURL": "/wires/aap/article-12053555/Australian-student-poisoned-Taiwan-mend.html",
    "content": [
        "The family of a young Australian exchange student flown home after ingesting rat poison says his condition is improving, largely thanks to a medical repatriation flight that \"saved his life\".",
        "Alex Shorey touched down in Brisbane on Wednesday to be treated for ingesting rat poison as Taiwanese authorities continue to investigate the baffling circumstances surrounding the case.The 24-year-old was on a university exchange in Taiwan's capital Taipei when he fell seriously ill several weeks ago.\"I believe his medical repatriation actually saved his life,\" his father Dr Stephen Shorey said in a statement released on Saturday.\"While Alex still has a long road ahead in terms of his recovery, his condition is improving.\"The family from the Queensland city of Toowoomba raised money for a specialist charter flight from Taiwan to Brisbane, where Mr Shorey was immediately transferred to the clinical toxicology unit at the Princess Alexandra Hospital.The university student might have inadvertently ingested food contaminated with superwarfarin, according to an online fundraiser set up by his aunt Elizabeth Shorey-Kitson.Superwarfarins are a potent type of anticoagulant commonly used in rat poisons.Dr Shorey said Australian toxicology specialists confirmed \"very high levels of the toxin\" in his son's body.He also said his son had a partially collapsed left lung, pericardial effusion and adrenal insufficiency from steroids used in his care.The student had been critically unwell in Taiwan where he suffered haemorrhaging and a life-threatening anaphylactic reaction to treatment in hospital.",
        "Dr Shorey said he did not want to prejudice any police investigation by making any further comment but said he was aware the Taiwanese authorities are looking closely at the circumstances surrounding his son's illness.Investigators on Wednesday \"searched the home of a female friend and found relevant evidence\", a Taipei City Police spokesman told the ABC.\"Police questioned this female friend on Thursday and restricted her from leaving Taiwan,\" the spokesman said confirming she is the only suspect.Mr Shorey's flight was secured after raising more than $200,000 through donations online.The specialised medical charter flew at a lower altitude to ensure there were no further medical complications and to support his respiratory system."
    ]
}