{
    "articleURL": "/tvshowbiz/article-12056943/Lizzie-Cundy-Nick-Cave-kick-boozy-Bank-Holiday-street-parties-Coronation.html",
    "content": [
        "Lizzie Cundy and Nick Cave got the party started on Sunday as Bank Holiday celebrations kicked off across the United Kingdom in honour of King Charles' Coronation. ",
        "Street parties will take place up and down the country as boozy Brits make the most of a three-day weekend, capped by a musical extravaganza at Windsor Castle. And as communities come together to honour the historic event, celebrities were keen to get involved with TV personality Lizzie, enjoying a gathering outside her West London home. The former WAG, 55, dressed appropriately in a black blazer with a plunging waistcoat and sequinned Union jack bow tie. Posing for a photo in the road, Lizzie shielded her eyes with a large pair of sunglasses and sipped on a glass of fizz to mark the occasion. ",
        "Sitting on tables behind her, the radio presenter's neighbours filled the bunting lined street as they sliced sponge cakes and quiches. Elsewhere, singer-songwriter Nick, 65, joined in on the fun at Holland Street Coronation party alongside Kensington residents after attending the main event at Westminster Abbey on Saturday. The Australian music icon was one of a just a handful of Aussie representatives invited to take part in the historic event. Partaking in the street party, he smiled for a photo next to the red, white and blue-clad banquet table's and chatted with party goers. The musician slicked his black hair back and wore a smart pinstriped shirt with a black blazer and smart trousers. ",
        "The Coronation Concert will kick off at Windsor Castle on Sunday evening, where the King and Queen of the royal family will join around 20,000 members of the public to continue the celebrations after their crowning at Westminster Abbey on Saturday.The musical extravaganza will see performances by Paloma Faith, Olly Murs and veteran rock guitarist Steve Winwood.The show in Windsor, which will be hosted by Downton Abbey and Paddington star Hugh, will start at 8pm.",
        "Buckingham Palace has promised 'global music icons and contemporary stars' for the big concert.It is certainly set to be the highlight of the second day of coronation celebrations with around 20,000 members of the public are expected to attend.Classical acts including Andrea Bocelli, Welsh bass-baritone Sir Bryn Terfel and Chinese pianist Lang Lang are also on the bill.Hollywood star Tom Cruise, Dynasty actress Dame Joan Collins, adventurer Bear Grylls, singer Sir Tom Jones and former Strictly Come Dancing professional Oti Mabuse will also make an appearance via video.The series of pre-recorded sketches will reveal little-known facts about the monarch and will also include moments from beloved literary character Winnie the Pooh - seemingly echoing the famous moment Paddington Bear drank tea with the Queen during her Platinum Jubilee celebrations."
    ]
}