{
    "articleURL": "/wires/reuters/article-12048731/Orioles-outscore-Royals-series.html",
    "content": [
        "The Baltimore Orioles took the rubber game from the host Kansas City Royals 13-10 on Thursday afternoon to collect their seventh straight series victory.",
        "After mounting an 8-1 advantage in the third, the Orioles surrendered the lead on eight straight Royals runs.Baltimore's Ramon Urias, who came on as a pinch hitter, made the most of his two at-bats, driving in four runs on hits in the eighth and ninth.The Orioles, who lead the American League in stolen bases, swiped four in the top of the eighth, setting up Urias' two-run single to retake the lead. Urias added a two-run double in the ninth.One day after suffering their first shutout loss, the Orioles took quick advantage of a first-inning Royals miscue to race ahead.With two outs, right fielder MJ Melendez dropped Ryan Mountcastle's soft fly near the foul line, then Anthony Santander hammered a 3-0 pitch for his third homer this season and a 2-0 Baltimore lead.The next inning, Cedric Mullins delivered a bases-clearing double to the center field wall for a 5-0 advantage. Mullins is hitting .481 (13-for-27) with runners in scoring position, driving in 25 runs.Rookie Maikel Garcia got Kansas City on the board with an RBI single in the second.Highlighted by Gunnar Henderson's third home run, Baltimore added three in the third and expanded its lead to 8-1.The Royals rallied against Orioles rookie Grayson Rodriguez as Freddy Fermin hit his first career homer and Salvador Perez added a two-run shot, his sixth, cutting the lead to 8-4 in the third.",
        "In the fourth, Kyle Isbel connected for his first homer, knocking Rodriguez out after 3 2/3 innings. The right-hander allowed six runs on eight hits.Kansas City grabbed a 9-8 lead in the seventh as Isbel tied the game on a bunt single and Bobby Witt followed with his third hit, an RBI single.Yennier Cano (1-0) earned the win with two innings of scoreless relief. Aroldis Chapman (1-2) walked three, allowing two runs in the eighth to take the loss.The Orioles complete their season-long 10-game road trip with a three-game set in Atlanta over the weekend.The Royals fell to 2-14 at home and have baseball's second-worst record (8-24). They will begin a three-game home series Friday against the Oakland Athletics, who have the majors' worst record (6-25 through Wednesday).--Field Level Media"
    ]
}