{
    "articleURL": "/wires/reuters/article-12045939/Taiwan-central-bank-raising-rates-minutes-show.html",
    "content": [
        "TAIPEI, May 4 (Reuters) - Taiwan's central bank debated the need for further rate hikes this year to combat persistent inflation, minutes from its last board meeting showed on Thursday.",
        "The central bank, at its quarterly board meeting in March, unanimously decided to raise its policy rate by 12.5 basis points (bps) to 1.875%, a surprise move reflecting concerns about inflation.One board member, whom it did not identify, said economic growth was likely to rebound in the rest of the year following a first quarter contraction, but inflation would likely only drop below 2% in the fourth quarter.\"In this economic context, it would be necessary for the bank to maintain its policy stance with further rate hikes,\" the minutes cited the member as saying.Another board member said that \"if inflation stays elevated, further rate hikes could be warranted\".Taiwan's inflation has been much milder than those of major economies like Europe and the United States, though a third board member said they needed to be aware of public perceptions of the problem.The member \"expressed the view that Taiwan remained under inflationary pressures, noting that the inflation rate was coming down but very slowly and the general public tended to perceive inflation as higher\".The bank, at the March meeting, upped its consumer price index (CPI) forecast for this year to 2.09% from a December prediction of 1.88%.Taiwan's March CPI rose 2.35% year-on-year, slightly exceeding market expectations for a 2.22% rise.",
        "With the export-dependent economy now in recession after contracting for two quarters in a row, the central bank will have to consider at its next scheduled quarterly meeting in mid-June whether to keep tightening, stand pat or begin cutting rates.A fourth board member noted, however, that domestic demand was \"still sound\" in contrast to softening external demand, and that raising interest rates would not affect weakening overseas demand for Taiwanese goods. (Reporting by Liang-sa Loh and Ben Blanchard; Editing by Simon Cameron-Moore)"
    ]
}