{
    "articleURL": "/sport/college-football/article-12037985/Will-Leviss-proud-girlfriend-Gia-Duddy-celebrates-beau-taken-Titans-NFL-Draft.html",
    "content": [
        "Will Levis dropped out of the first round of the NFL Draft last Thursday nightBut he didn't have to wait much longer the next day as he went No. 33 overallDailyMail.com provides all the latest international sports newsAfter a humbling first round of the NFL Draft where he sat in the green room without being selected, Will Levis finally found a home the next day.",
        "And the quarterback's girlfriend Gia Duddy is gushing with pride for him after he was selected by the Titans at pick No. 33. 'It’s hard to put in words what it’s like watching your best friend’s dreams come true,' she wrote on Instagram. 'Proud would be an understatement— I don’t know anyone more deserving. Time to get back to work @will_levis . TITAN UP.'The post included a behind-the-scenes look at Levis' draft celebrations, with him spraying a bottle of champagne outside and happily holding up a Titans flag.",
        "Levis was forced to wait last Thursday in Kansas City for a call that never came, as he surprisingly fell out of the first round.Levis was at one point projected to be the second quarterback off the board, but didn't get to experience the same draft-day moment as his fellow passers Bryce Young, CJ Stroud and Anthony Richardson.But the former Kentucky player says he was 'ecstatic to get the call' from Tennessee on Friday.'I ended up where I was meant to be, and I'm just looking forward to competing and getting started,' Levis said on a Zoom call with reporters.After being the repeated subject of TV cameras during his ill-fated draft night on Thursday, Levis returned home to watch the rest of the proceedings with his family.",
        "'I was very proud of my family and how we composed ourselves last night and you know the cameras beaming down on us the whole time,' he said. ",
        "'I feel like we did a great job of just taking it in stride and trusting that regardless of what happens, that it's going to happen for a reason.'The Titans have a quarterback in Ryan Tannehill, who turns 35 in July and has one year left on his contract with a salary cap hit of $36.6 million.Tennessee also drafted Malik Willis with the 86th overall pick last year, but the Liberty product passed for zero touchdowns and three interceptions in three starts (eight games total).This is the highest the Titans have drafted a quarterback since taking Marcus Mariota at No. 2 overall in 2015."
    ]
}