{
    "articleURL": "/wires/ap/article-12060401/Debt-options-abound-Biden-McCarthy-strike-deal.html",
    "content": [
        "WASHINGTON (AP) - The White House and Congress could strike a deal to raise the debt ceiling in exchange for budget cuts. Or they could agree to a stopgap measure to keep paying the nation´s bills while negotiations continue. They also could let the negotiations unravel, sending the economy into chaos.",
        "As President Joe Biden meets Tuesday with House Speaker Kevin McCarthy and other congressional leaders for the first time over the debt ceiling crisis, the options for easing out of the standoff are many.But the political incentive for compromise is harder to come by. There's no easy endgame ahead of a June 1 deadline to raise the debt ceiling or risk defaulting on the nation's $31 trillion in debt.\"It´s Congress´ constitutional duty to act to prevent default,\" White House Press Secretary Karine Jean-Pierre said Monday. \"That´s what the president is going to be very clear about.\"At Tuesday's first meeting, it's extremely unlikely there will be any quick resolution. Biden and the big four congressional leaders of the House and Senate will convene at the White House with neither side yet signaling a willingness to budge off its opening position.Biden wants Congress to simply raise the debt limit without any strings attached, while Republicans led by McCarthy are insisting on budget cuts in exchange for any votes to allow more borrowing to pay the nation's bills.",
        "More likely, Democratic president Biden and Republican House speaker McCarthy will at least be able to set aside their differences enough to launch a process for negotiations that could begin to form the contours of a deal to avert a true debt ceiling crisis.",
        "But with tensions high and the outcome uncertain, some lawmakers are considering unprecedented proposals, even one that would allow Biden to bypass Congress, invoking his responsibilities under the 14th Amendment to simply raise the nation´s debt limit on his own. That would be certain to face a court challenge.Though the endgame is uncertain, the political terrain is familiar for the White House and Congress. The once routine vote to raise the debt ceiling has increasingly been wielded as powerful political leverage to extract policy priorities that otherwise would not be likely to become law.Republicans have put down their opening bid - a sweeping House-passed proposal that would slash $4.8 trillion off the federal budget over a decade by rolling back spending to fiscal 2022 levels and capping future spending increases at 1% a year, resulting in steep cuts to programs and services.The Republicans refuse to simply raise the debt limit on its own, and are demanding budget cuts and other party priorities. The House Republican-passed bill would drop millions of Americans from health care, food stamps and cash assistance programs by imposing additional work requirements that many would be unable to meet. And it would undo much of Biden's climate change agenda.Senate Republicans are backing up their House Republican colleagues, announcing they will not advance \"any bill that raises the debt ceiling without substantive spending and budget reforms.\"",
        "In a letter from Sen. Mike Lee, R-Utah, and signed by Senate Republican leader Mitch McConnell, the 43 GOP senators said they are \"united behind the House Republican conference in support of spending cuts and structural budget reform as a starting point for negotiations on the debt ceiling.\"Biden and Democrats have also dug in, refusing to debate over the debt ceiling - though they have opened the door to negotiations over spending levels as part of the regular budget process.\"We have to avoid default, period. Full stop,\" the House Democratic leader Hakeem Jeffries said over the weekend.\"We, of course, are open to having a discussion about what type of investments, what type of spending, what type of revenues are appropriate,\" Jeffries said. \"That´s a process that is available to us right now.\"Time is short for any deal. Treasury Secretary Janet Yellen has said that come June 1, there may simply not be enough cash on hand to meet all of the nation's obligations. She noted the U.S. has never defaulted on its debt.\"Every option is a bad option,\" Yellen said Monday on CNBC.The House and Senate arrive back at work Tuesday, but they are in session together just eight days before the Senate breaks for the Memorial Day recess the week of May 22 with the House set to recess the following week.",
        "Both Biden and McCarthy have insisted they will not allow the country to default on its obligations.What's different about this round of talks is that it's being led by McCarthy, debuting after his tumultuous battle to become House speaker.To win the gavel, McCarthy made steep concessions to the hard right Freedom Caucus and other conservatives who make up his slim majority, and who can threaten to oust the speaker if he negotiates a deal they are unwilling to accept.While Biden had a willing partner in past budget showdowns negotiating with McConnell, the Senate Republican leader is keeping a lower profile enabling McCarthy to take the lead. But the threat hanging over McCarthy from his far-right flank could leave him unwilling or unable to strike a compromise with Biden.Congress has been known to push this issue to the brink, but it has also proven its ability to buy time, by voting for stopgap measures to allow negotiations to continue.One solution in the weeks ahead would be for Biden and McCarthy to agree to some smaller measure of budget cuts or changes, say clawing back the unspent COVID-19 funds that Republicans have targeted, in exchange for a vote to lift the debt limit past the June 1 deadline as they keep working on a broader budget deal.",
        "In an earlier debt ceiling showdown a decade ago, Congress agreed to set up a \"super committee\" tasked with coming up with bipartisan spending reductions or facing automatic cuts - an idea that has been mentioned in another form this time.It all means that while June 1 looms as a serious deadline, it may end up being just the first of several to come - a level of fiscal uncertainty that some experts have warned could rock the economy.To stave off a crisis, House Democrats have pushed forward a process that would force a vote on a clean debt ceiling increase they prefer. But it's a cumbersome procedure that would be a longshot in the Senate, where Democrats have only a slim majority and need Republican support to advance most bills.Asked about invoking the 14th Amendment proposal, Biden said in an interview Friday that he´s not there yet.___Associated Press writers Fatima Hussein and Chris Megerian contributed to this report."
    ]
}