{
    "articleURL": "/sciencetech/article-12059975/Is-iPhone-15-Ultra-Dummy-unit-Apples-phone-emerges.html",
    "content": [
        "YouTuber handles dummy unit of Apple's upcoming iPhone 15 Ultra in new videoIt shows a USB-C port, thinner bezels, 'brushed aluminum edges' and much moreDummy unit also has USB-C port reflecting legislation passed in 2022 by the EUApple fans may have been gifted the best view yet of the firm's next smartphone, the iPhone 15, four months before its release. ",
        "A new video claims to show a dummy unit of iPhone 15 Ultra – the most expensive of the upcoming iPhone 15 range that is expected to be released this September. The dummy shows that the new phone has a USB-C charging port instead of a Lightning port, due to legislation passed in 2022 by the European Union. The iPhone 15 Ultra dummy also has a 'matt' back surface, rather than a slick, shiny surface, and what feels like 'brushed aluminum edges'. Previous leaks have already suggested the iPhone 15 family has a thinner bezel, thicker camera bumps and more curved edges, as well as the USB-C port.",
        "Meanwhile, a TikTok video from earlier in the year purported to show a iPhone 15 dummy as well, but the new video, posted to YouTube on May 6 by Unbox Therapy, reveals much more detail about the device. ",
        "- Thinner bezel - No physical buttons- Thicker camera bump - Curvier edges  - USB-C port instead of Lightning ",
        "'I've been told that this is what it's going to look like,' said Unbox Therapy presenter Lewis Hilsenteger, who is seen comparing the dummy unit with last year's equivalent iPhone 14 Pro Max. 'It is backed up by a number of rumours and leaks that you've probably seen floating around.' ",
        "The YouTuber called the new device 'incredible' and 'one of the best-looking models I’ve ever handed or looked at'.It's unclear where the dummy came from or who sent it to him, although Tech Radar speculates that it was put together based on all the known leaks that have already occurred about the iPhone 15. MailOnline has contacted Apple for comment, although the tech giant is notoriously secretive about any upcoming products. As Hilsenteger compares the dummy with iPhone 14 Pro Max, initially the two don't seem that different – they have a similar camera set-up and the same dimensions – but on further inspection there are notable differences. For example, the switch control on the side of the device is no longer a switch that users can toggle on and off, but a press-down button. ",
        "Also, the device's bezel – the border between the screen and the frame – is 'extremely' thin, while there is a USB-C charging port instead of the Lightning port.",
        "However, Dynamic Island – a feature introduced last year with the iPhone 14 Pro and Pro Max – has also been carried over from last year.Dynamic Island is a pill-shaped notch at the top of the screen that hides the front-facing camera but also changes size to show important alerts, notifications and activities. ",
        "A previous leak of iPhone 15 renders already suggested it will be the first iPhone without physical buttons on the side, which are used to turn off the device, control volume, take screenshots, activate Siri and more. Instead of physical buttons that move, iPhone 15 models will have haptic buttons – those that provide tactile sensations such as vibrations when users apply pressure with their finger, the leak suggested. However, the new Unbox Therapy video shows that the physical buttons still remain on the dummy – implying haptic buttons will not arrive after all. Meanwhile, the new phone's volume-up and volume-down buttons on the side will no longer be separate, but be incorporated into one long seesaw-style button, which Hilsenteger refers to as a 'rocker'.One of the biggest changes already expected to arrive with the iPhone 15 will be the lack of a Lightning port in favour of a USB-C port. Apple became legally obliged to fit any iPhones sold in the EU with USB-C ports, due to legislation signed off in October last year that aims to reduce e-waste. ",
        "The law makes USB-C connectors – currently used by Android-based devices – the standard charging technology in the EU. That means Apple has to replace its own Lightning charging technology, discernible by its eight pins, with USB-C in EU countries. ",
        "Technically, Apple still has the choice to sell iPhones that have Lightning ports in non-EU countries – such as the UK and the US.But if it decided to do this it would have to manufacture two different iPhone designs – one with a USB-C port for EU countries and one with Lightning for non-EU countries.Ultimately the rumours and leaks suggest Apple has decided not to do this – possibly due to costs – and reluctantly had to fully embrace USB-C. Apple is expected to release high-end versions of the iPhone 15 called the iPhone 15 Pro and iPhone 15 Ultra, along with the standard iPhone 15 model. ",
        "While the new video only shows a dummy of the iPhone 15 Ultra, the cheaper iPhone 15 models are expected to have the same basic design features.Last September, Apple launched four iPhone 14 models – the standard iPhone 14 model, the iPhone 14 Plus, iPhone 14 Pro and iPhone 14 Pro Max. The standard model retails for £849 and comes with a 6.1-inch screen, while the Plus costs £949 and has a 6.7-inch screen. iPhone 14 Pro has a 6.1-inch screen (same as the standard model) and costs £1,099, while Pro Max has a 6.7-inch screen (same as the Plus) and costs a mammoth £1,199. ",
        "Various sources are divided as to whether prices for iPhone 15 will be higher, although some reports call the iPhone 15 Ultra 'the most expensive iPhone ever' with a price tag of $2,900 (equal to £2,300). ",
        "Apple is less than six weeks away from unveiling a mixed reality headset that could 'replace the iPhone', according to an insider.Expected to be called 'Reality Pro', the headset will transport notifications, messages, directions and more from your iPhone to right in front of your eyes. After nearly eight years of development, it will be unveiled at Apple's annual developer conference in June, according to respected leaker Mark Gurman. But at a rumoured $3,000 (£2,400), the device could be restricted to only the most ardent – and wealthy – of Apple fans. The headset will overlay digital images on real-life surroundings – technology known as augmented realty (AR). But it will also be capable of virtual reality (VR), meaning it will project entirely virtual elements without the real life background.Read more "
    ]
}