{
    "articleURL": "/tvshowbiz/article-12053665/Abbie-Chatfield-reveals-new-monogamous-relationship-disastrous-polyamorous-romance.html",
    "content": [
        "Abbie Chatfield has revealed that she is in a new monogamous relationship after her disastrous polyamorous romance ended last year. ",
        "The reality TV star, 27, broke up with The Bachelorette's Konrad Bień-Stephen last September, who she was in an open relationship with. She has appeared to be single since, but revealed on stage at her Trauma Dump tour in Adelaide this week that she is in a new relationship. And this time, it's not an open one. She told the crowd at Thebarton Theatre: 'I don't get monogamous language. I didn't know what exclusive meant.'",
        "The podcast host said it's a very new relationship, and didn't reveal her new partner's name. Despite appearing single since she broke up with Konrad last year, Abbie did confirm that something romantic happened between her and US rapper Yung Gravy when he was in the country. Talking about rumours that they slept together, Abbie said in a sarcastic tone: 'I certainly didn't spend two nights at his hotel. 'Nothing happened, we just had Maccas.' ",
        "Abbie's relationship news comes weeks after she opened up about maybe being a lesbian.  The radio host is bisexual, but last month questioned her sexuality as she likes to think about women while having sex with men.Speaking on her It's A Lot podcast, the 27-year-old asked: 'So I actually have not come just from feeling except for with women, I have to literally disassociate with men.",
        "'There is still sometimes a man involved in what I'm thinking about, but in my mind I am thinking about the woman and her enjoying the gang bang.'So, my question is, am I just gay?'",
        "Abbie then said that her friends who are lesbians said this is not a normal thing for a bisexual person to do, so she is probably gay.However, the podcast host then wondered if it's down to her ADHD.She added: 'I feel like also it could be an ADHD thing? Where your brain is trying to latch onto something else?'I bought a Cigarettes after Sex record to listen to during sex so that my brain is distracted but there's not many lyrics.' "
    ]
}