{
    "articleURL": "/wires/aap/article-12047903/Star-county-draw-Steve-Smith-wait-bat.html",
    "content": [
        "They were queuing round the corner and up the stairs when the ancient turnstiles clicked into life an hour before play started at Worcestershire's bucolic New Road ground.",
        "It was a two-sweater day with rain forecast but that had not deterred what became a four-figure crowd.The attraction was clear from the conversation; they had come to see Australia's Steve Smith make his debut in England's domestic red-ball championship, 13 years after briefly appearing in its T20 competition.Unfortunately for the huddled masses and the busy press box, Sussex captain Cheteshwar Pujara won the toss on Thursday and put Worcestershire in.The closest Smith got to batting was sitting on the balcony of the Graeme Hick pavilion in his pads before bad light cut short at 1-63 in Sussex's reply to Worcestershire's 264 all out.But Smith, standing at second slip wearing his customary No.49, at least had a good look at Ollie Robinson, who England hope is the heir to Stuart Broad and Jimmy Anderson.He certainly looked a very different proposition now, compared to his wan performance in the 2021-22 Ashes.Bowling to five slips and a short leg, he took 4-21 in a 30-ball spell at the start of the innings, finishing with 7-59. One of those was pouched by Smith in the cordon, a sharp catch to his left.Sussex, for whom Smith is playing three four-day matches this May, have been criticised for giving him advance taste of English conditions - a laughable complaint given he averages around 60 in 16 Tests here.",
        "The county's retort is that having a player of Smith's calibre is good for the competition and the swollen attendance supported that view.\"I get a look at him, he gets a look at me,\" said Robinson. \"I don't think it makes a big difference in the grand scheme of things.\"He's obviously a good player and he'll score runs regardless of whether he faces me or not.\"It's bit surreal. To have the world's best batsman and Pujara in the same dressing room is quite cool. It's nice having him around. It ups my game in training bowling to him and Pujara.\"Smith had earlier gone through the well-worn rituals. He netted with gloves but without pads, getting his eye in with some throwdowns.He was then awarded his Sussex cap in an on-field presentation before joining his teammates in a head-tennis warm-up in which his soccer skills did not look out of place.This tree-lined venue by the River Severn, under the cathedral's gaze, was for decades the traditional opening fixture for touring sides. Don Bradman and Arthur Morris both made centuries here as The Invincibles won by an innings in 1948. Keith Miller made a double-hundred five years later.Modern schedules no longer permit the luxury of a preamble around the county circuit, thus the value for Smith of getting time at the crease.",
        "But the 33-year-old isn't the only member of Australia's Ashes squad tuning up in county cricket.Marcus Harris's Gloucestershire are not in action this week but Marnus Labuschagne made a patient 65 for Glamorgan against Yorkshire at Headingley before becoming one of three catches behind the stumps for Jonny Bairstow in his first competitive match since August.In India, England's gun bat Joe Root is kicking his heels in the IPL, yet to play a match for Rajasthan Royals, while Ben Stokes is nursing his knee injury and Jofra Archer was hit for 56 in four overs on Wednesday on his return from his latest elbow operation.Slowly, the odds are shifting towards the tourists..."
    ]
}