{
    "articleURL": "/tvshowbiz/article-12057673/Christina-Ashten-Gourkani-Kim-Kardashian-lookalikes-cause-death.html",
    "content": [
        "An OnlyFans star who spent thousands of dollars on cosmetic surgery in a bid to look like Kim Kardashian reportedly died of cardiac arrest after having silicone injected into her buttocks by an 'unlicensed' practitioner.",
        "Christina Ashten Gourkani, a 34-year-old American model who went by Ashten G online, died in hospital last month after undergoing the risky procedure.Ms Gourkani hired Vivian Gomez, a Florida woman who does not have a licence to practise medicine, to assist her with the enhancement, reports The Daily Post.Ms Gomez travelled to a hotel in California where she is believed to have given Ms Gourkani 'several injections' of silicone on April 19, according to San Mateo County District Attorney Steve Wagstaffe.Ms Gomez was arrested on April 20 at Florida's Fort Lauderdale Airport, and she will be extradited to Redwood City in San Francisco.",
        "She faces charges of involuntary manslaughter and practising medicine without a licence resulting in great bodily injury.The coroner's office is still investigating Ms Gourkani's death. Last month, Ms Gourkani's heartbroken family started a GoFundMe page to raise funds for her funeral.The page included a lengthy statement expressing their shock and anguish, as well as a brief account of the moments leading up to the model's death.'It is with deep sorrow and an immensely heavy, broken heart that we have to share the most shattering, unfortunate and unexpected passing of our beautiful, beloved daughter and sister Christina Ashten Gourkani,' her family wrote.The statement went on to describe the harrowing moment someone called Christina's family at 4.30am screaming, 'Ashten is dying, Ashten is dying!'",
        "The family spokesperson then described the 'living nightmare' of watching her health decline in hospital following her cardiac arrest.",
        "Fellow OnlyFans model Mary Magdalene paid tribute to Ms Gourkani on Instagram.Ms Magdalene, a fellow plastic surgery addict who once almost died trying to get the 'world's fattest vagina', wrote: 'I don't know her, [but] I would always just randomly see her on Instagram and think she was really pretty but that is so sad she just died from plastic surgery.''It is so scary because you really just never know when you're going to die from [risky surgery],' she added, before expressing her own fears about 'sustaining brain damage' whenever she goes under the knife."
    ]
}