{
    "articleURL": "/wires/ap/article-12051261/Cambodias-brand-new-stadium-hosts-opening-SEA-Games.html",
    "content": [
        "PHNOM PENH, Cambodia (AP) - Tens of thousands of spectators, encouraged by free admission and transport, turned out Friday to watch the opening ceremony for the 2023 Southeast Asian Games, which marks the first time Cambodia has been able to host the regional competition.",
        "The event, also known as the 32nd SEA Games, brings together more than 12,000 participants from 11 countries, with athletes competing in more than three dozen sports, including soccer, gymnastics, golf, martial arts, esports, and aquatics. The elaborate opening ceremony included music and dance, with lighting displays extending to the seating area and fireworks.The games are being held from Friday through May 17 at a newly developed sport complex on the outskirts of the capital, Phnom Penh. Its centerpiece is the Chinese-built Morodok Techo National Stadium, with a capacity of 60,000.The countries taking part are Brunei, Indonesia, Laos, Malaysia, Myanmar, the Philippines, Singapore, Thailand, Timor Leste, Vietnam and host Cambodia. All are members of the Association of Southeast Asian Nations except Timor Leste, which attained independence only in 2002 and is in the process of joining the regional grouping.The games were first held in the Thai capital Bangkok in 1959, and were originally called the South East Asian Peninsular Games. Cambodia was scheduled to host the event in 1963, but financial problems and political instability derailed the games.One sport has drawn special attention this year, reflecting deep-seated cultural enmity between Cambodia and its bigger and richer western neighbor, Thailand, whose Thai boxing team is boycotting the games.",
        "The ill feeling between the two countries has its roots from centuries ago, when they were two large and contending empires. In more modern times, the bad feeling has lingered, as Cambodia´s development, hindered by French colonialism and, in the 1970s, the brutal rule of the communist Khmer Rouge, has fallen well behind Thailand´s.Cambodia on previous occasions had unsuccessfully suggested changing the official name of Thai boxing - a form of kickboxing - from Muay Thai to something with more neutral, less nationalistic connotations. This year, because it is hosting the games, it was able to take more direct action, listing the sport under the name Kun Khmer.The action outraged Thai kickboxing enthusiasts and raised diplomatic hackles, to the extent that Thailand´s Prime Minister Prayuth Chan-ocha stepped in to call, in vain, for an end to the \"pointless\" bickering.Neither country´s sporting council would back down, however, and Thailand decided to keep its kickboxers out of the competition. It said it was justified because the sport is supervised by International Federation of Muaythai Associations, which in turn is recognized by the International Olympic Committee.Cambodia has treated the event as an opportunity to burnish its regional and international image.Prime Minister Hun Sen in late March announced that free tickets would be distributed for all the game's events, for foreigners as well as Cambodians, and international broadcasters would not be charged for live television coverage rights.",
        "He also said that Cambodia will fully cover food and accommodation expenses for the participating sports delegations, declaring that previous host countries had levied a fee of $50 per person per day for such services.___This report has been amended to delete a quote incorrectly attributed to a person identified as Pheng Vannak.___More AP sports: https://apnews.com/hub/apf-sports and https://twitter.com/AP_Sports"
    ]
}