{
    "articleURL": "/tvshowbiz/article-12045163/Roxy-Jacenko-reveals-shes-selling-sprawling-6-5million-Double-Bay-mansion.html",
    "content": [
        "Roxy Jacenko has revealed she and husband Oliver Curtis are selling their sprawling Vaucluse mansion.",
        "The PR queen, 43, shared a picture of the stunning pad on Instagram on Thursday and revealed the surprise news. 'Coming soon via David Malouf and Bill Malouf - Jacenko - Curtis' are on the move,' she captioned the post, mentioning the real estate agents who will list the property. While the home is not yet on the market and a price guide isn't listed, the couple purchased the home for a cool $6.5million back in 2018. The home is believed to have a $14million price tag.The couple extensively renovated the home, which they share with their children Pixie, 11, and Hunter, eight, and added a full gym, a hair salon, a children's playroom, and a room just for her $1million Hermès Birkin collection. ",
        "The home also features a stunning marble kitchen, a fully stocked cellar with a number of pricey wines, a master bedroom and pool.Roxy and Oliver also have a base in Tasmania, where Oliver is based for work. He and his cousin Tim Rosenfield founded a business in Tasmania called FIRMUS a few years ago. 'How do you and your husband manage living in different states?' one fan previously asked her about the long distance. ",
        "'It's probably why he still likes me,' she replied.'He is doing very well with work so I am happy. I've got lots on as do the kids so it works. At least now the borders have opened he can come back on Fridays. Prior [to that] he was in Tassie full time,' she added. ",
        "In March, Roxy revealed she's sold her XRJCelebrations candle business just months after stepping down as director of her Sweaty Betty PR firm.",
        "'Fast forward to today and I have weathered storms one could only assume you would see on a miniseries and heck, I think I've done it with gusto – but now it's time for me to hang my PR shoes up (and no they were never stilettos they were trainers – why? Cause you can't run in them) and say goodbye to my working life as I know it,' she said at the time.'I've lived and breathed Sweaty Betty (in sickness and in health, quite literally) but now it's time to live, continue to build my own brands whilst managing my incredible talent within Ministry of Talent – which I just adore.'The Ministry Of Talent covers social media influencers across fashion, beauty, fitness and more and creates partnerships between bloggers and brands."
    ]
}