{
    "articleURL": "/wires/reuters/article-12041729/Haleon-not-losing-ground-cheaper-rivals-says-CFO.html",
    "content": [
        "By Natalie Grover",
        "LONDON, May 3 (Reuters) - Despite price increases, Haleon's roster of consumer health products have largely kept cheaper private-label competition at bay, Haleon chief financial officer Tobias Hestler said on Wednesday.The world's biggest standalone consumer health company, comprising assets from GSK and Pfizer, sells non-prescription drugs, vitamins and oral care products and reported quarterly profit below expectations as higher costs squeezed margins.\"We've not seen negative reaction from consumers on the pricing,\" he said. \"We believe our products have a higher elasticity, I think probably it has a lot to do with our brand portfolio being all therapeutic.\"Cost inflation has hit Haleon along with other consumer staples, rising initially during the COVID-19 pandemic and then exacerbated by Russia's invasion of Ukraine.Energy costs have since dropped and global prices for some commodities are now rising more slowly.Companies like Nestle, Procter &amp;amp; Gamble, Reckitt Benckiser and Danone continued, however, to raise prices sharply in the first quarter even though input costs eased.The input costs that make a difference to Haleon such as packaging, aluminium and labour are still rising, albeit at a slower pace, Hestler told Reuters. \"There's still cost inflation coming through in the business.\"However, he said the cost of commodities accounted for less than 10% of revenue. \"That number is very different for other (consumer staples) players.\"",
        "Haleon's organic quarterly revenue growth of 9.9% - well ahead of analyst estimates - was driven largely by price hikes alongside an uptick in sales volumes.Barring something unpredictable, the majority of price hikes for Haleon have been implemented for this year, Hestler added.\"Our pricing philosophy has been to price up only as much in order to make up the cost of inflation, and in order to maintain volume gains.\"That strategy was supported by Russ Mould, investment director at stockbroker AJ Bell, who said the damage done by losing volume would be greater in the long term versus slightly sacrificing margins in the short term.(Reporting by Natalie Grover in London; Editing by Louise Heavens, Elaine Hardcastle)"
    ]
}