{
    "articleURL": "/sport/football/article-12056851/Ryan-Reynolds-pokes-fun-Wrexham-stars-Elliot-Lee-Paul-Mullin-party-DJ-Pauly-D.html",
    "content": [
        "Wrexham players continue to party in Las Vegas after winning promotion The stars are on a four-day trip to the US paid for by the club's Hollywood ownersRyan Reynolds shared a photo of Elliot Lee and Paul Mullin with Pauly D Ryan Reynolds took to social media to poke fun at Wrexham stars as Elliot Lee and Paul Mullin as he shared a picture of them partying with Jersey Shore star DJ Pauly D.",
        "The Welsh club were promoted from the fifth-tier National League after securing an incredible 111 points.Owners, Hollywood actor Reynolds and Rob McElhenney, have put on a four-day all-expenses-paid trip to the USA as reward for their efforts this season.And Reynolds took to Instagram to share a photo of Lee and Mullin with Pauly D, writing 'next year they're going on a five day meditation retreat in the Faroe Islands'.They were behind the decks with the Jersey Shore star, who shot to fame on the enormous reality TV show and now has a residency at Marquee. ",
        "The players have also been seen living it up at nightclub Hakkasan, the MGM Grand Hotel and the Bellagio.The National League champions were told a 'monster' party lay in wait if they won the league, something they managed in style with a record 111 points to fire them back into League Two. Hollywood pair Reynolds and McElhenney, true to their word, have sorted a luxury four-day trip to Las Vegas, with a packed itinerary awaiting the footballers. It is set to be the trip of a lifetime and best of all, the players are not picking up the tab. ",
        "'It became a thing where if we won the league, we'd get a holiday. So we're off to Vegas,' star striker Mullin, who bagged 47 goals this season, told GQ.",
        "'Ryan and Rob told us to leave our cards at home, they're sorting the lot. They sent us a full itinerary just now. Part of me doesn't want to go, I might be dead by the end of it! But I'd never go to Vegas by my own accord, so I'm buzzing for it.'"
    ]
}