{
    "articleURL": "/tvshowbiz/article-12045805/Im-Celeb-SPOILER-Carol-Vorderman-SNAPS-Janice-Dickinson.html",
    "content": [
        "Tensions came to a head in jungle as the celebrities reached breaking point and a giant storm rolled into camp. ",
        "In scenes that will air on Thursday's episode of I'm A Celebrity... South Africa the campmates were left in states of anger and upset as the reality of jungle living came to a head. First to lose their cool was Carol Vorderman and Janice Dickinson who began griping at each other in a row about washing up. The pair are set to have an explosive showdown in coming days and it was clear the anger was rising as they clashed over camp chores. As Fatima Whitbread attempted to rally her campmates into doing their daily tasks, Janice was quick to note that she wasn't receiving any help, telling the athlete: 'Carol didn't help with the washing up immediately.'",
        "The supermodel then turned to Carol and said:  'You just plopped those dishes down in the sink. I just went and did all the dishes', prompting Carol to sarcastically quip in response: 'Did you? Oh well. Oh, great. Well done Janice.'Elsewhere in the episode, Helen Flanagan was also losing her cool as she took on a dreaded trial alongside Paul Burrell.  The pair volunteered themselves to represent their Pride in the trial, with Helen reasoning: 'For me personally, I wanted to come back here and I wanted to be able to do the Trials a lot better than I did last time… You change so much in 10 years.'",
        "The move impressed Dean Gaffney who admitted: 'I didn't get to choose who did the Trial today. Helen told me she's doing the Trial today. 'On her journey in the original camp you'd never see her stand up and say, \"I want to do it.\" Helen's got this.' Meanwhile, Paul mused: 'I'd like to do it. I need to prove something.'The pair quickly seemed to regret their decisions, however, as they arrived at the Trial clearing and realised they were taking on an escape room-style challenge.While bombarded with creepy crawlies, critters and slime they had to work their way through a potting shed, bobbing boxes, a wishing well and compost tunnels while competing to get the quickest time. The pair were left shrieking in horror as they attempted to navigate the challenge, with both looking close to having a meltdown. ",
        "Having completed the trial the pair then headed back to camp, where Paul surprised his fellow campmates by flashing a tattoo on his bottom. In a surprise move, the star flashed a dragon and Chinese inking that read 'Made In Britain.' As Joe Swash asked if he'd ever shown the Queen his tattoos, Paul insisted he had not but revealed '[Princess] Diana said, \"Oh, cheeky\"' Yet the fun and frolics couldn't continue all night as the campmates were left cowering from a huge storm. ",
        "Janice was left terrified as she remarked: 'The lightning is cracking right over the head of us! I don't want to sleep out there.'While Georgia Toffolo agreed: 'It's bad. It's a big bad storm!'Helen looked close to tears as the storm rumbled in while the campmates sprang into action to erect sheets to keep their belongings dry. Undeterred by the drama Phil Tufnell remarked: 'It was great fun. We sprung into action. We work very well as a team.'"
    ]
}