{
    "articleURL": "/wires/ap/article-12038137/Ford-cuts-prices-Mach-E-Tesla-raises-Model-Y.html",
    "content": [
        "DETROIT (AP) - Ford is cutting U.S. starting prices on its Mustang Mach E electric SUV, bringing many versions below the cost of its main competitor, the Tesla Model Y.",
        "Ford also said it is reopening the order bank on Wednesday for the Mach E after upgrading a factory in Mexico to increase output.Also on Tuesday, Tesla raised prices by $250 on the Model Y SUV and the Model 3 small sedan, its two top-selling vehicles.The standard range base versions of the Mach E each saw $3,000 price cuts, with the rear-wheel-drive version falling to $42,995 and the all-wheel-drive model going to $45,995. Ford cut $4,000 off prices of the premium standard-range versions, with rear-wheel-drive dropping to $46,995 and all-wheel-drive going to $49,995.The price of the GT all-wheel-drive extended range version also fell by $4,000 to $59,995.By comparison, Tesla's Model Y dual motor now starts at $47,240, while the Y Long Range rises to $50,240, and the Y Performance version starts at $54,240. All have all-wheel-drive.",
        "The Mach E only is eligible for a $3,750 U.S. federal tax credit this year, while the two top-selling Tesla models are eligible for $7,500.Shares of Ford fell 2.7% in trading Tuesday morning, while Tesla shares were up slightly.Ford said in a statement that it was ramping up production of the Mach E in Cuautitlan, Mexico, to reduce customer wait times and use lower costs to cut prices.The company said in March it would increase Mach E production to an annual rate of 210,000 by year´s end. On Wednesday, the company said plant upgrades had been finished and would support a production ramp-up in the second half of the year.",
        "Tesla has cut U.S. prices four times this year, raising concern among investors about the company's profit margins. In April it raised prices of its two older and more expensive models, the S and X."
    ]
}