{
    "articleURL": "/sport/football/article-12038047/Wrexham-travel-Hollywood-summer-face-MLS-reserve-LA-Galaxy-II.html",
    "content": [
        "The club will also play friendlies against Chelsea and Manchester United in July  Reynolds and McElhenney also promised the team a partylike trip to Las VegasDailyMail.com provides all the latest international sports newsNewly promoted Wrexham are taking a trip to Hollywood in July, building on their American fanbase with a friendly fixture against Major League Soccer (MLS) reserve team LA Galaxy II.",
        "The Welsh club acquired by actors Ryan Reynolds and Rob McElhenney in November 2020 got the fairytale ending they craved in April, as they returned to the English Football League as fifth-tier champions with a 3-1 win over Boreham Wood.Wrexham have attracted plenty of attention in the famously soccer-ambivalent United States thanks to their A-list owners' star power and their popular docu-series 'Welcome to Wrexham.''We've enjoyed meeting supporters who have travelled over from America to visit us this season, and it will be a fantastic occasion to play against American opposition in front of more of these new fans,' manager Phil Parkinson said in a statement referring to the July 22 match.Two other U.S. fixtures had already been confirmed, with Wrexham set to take on Chelsea in Chapel Hill, North Carolina, and Manchester United in San Diego, California, on July 19 and 25, respectively.",
        "The celebrity owners will also reportedly jet the team off to Las Vegas as a reward for winning the National League with a record total of 111 points. 'They promised us a big deal at the end of the season,' goalkeeper Ben Foster told CBS Sports in April. 'They promised us a monster one (party) at the end of the season, (that) if we get promoted then they are going to take us away somewhere with a lot of flashing lights.' ",
        "Wrexham's women's team also won promotion in a year of double success for Reynolds and McElhenney. They will also be part of the club's open top bus parade through the city on Tuesday.",
        "Meanwhile, fans have acted swiftly to remove offensive graffiti from a vandalized mural ahead of local celebrations after discovering a message that was believed to be related to the death of life-long fan Neil Williams. Marks of 'CFC' and '125' were scrawled on the mural - located on Crispin Lane - in an apparent reference to Wrexham's arch-rivals Chester FC. '125' is Chester's frontline fan gang, or 'firm'.Eager to remove the graffiti ahead of this week's victory lap around the Welsh city of 135,000 people, supporters worked quickly to paint over the derogatory content. The messages were first covered over with white paint, before fans returned later in the day to add an extra coat with the correct color. Posting an image of the rescued mural on Tuesday morning, one fan shared on Twitter: 'We'll pop back later with a darker top coat. Up the Reds #WelcometoWrexham.'Promotion ended the Wrexham's 15-year absence from the English Football League. "
    ]
}