{
    "articleURL": "/news/article-12038497/Unsolved-murders-set-reach-record-high-year.html",
    "content": [
        "In Chicago, just 33 percent of murders with any type of weapon were solved between 2016 and 2020 The US' rate of solved murders hovers at just below 50 percent - the lowest rate of any developed nation Various police departments across the country blame low clearance rates on different problems, but persistent among them is low staffingThe true toll of crime in Chicago has been revealed, after figures showed just one third of murders are solved in the Windy City.  ",
        "That statistic, shared by NPR, showed that the vast majority of homicides in the Illinois city did not get cleared between 2016 and 2020. It sits below the national average for murders cleared - 50 percent. That statistic in itself is cause for embarrassment, with the United States' having the lowest murder clearance rate of any industrialized country.Professor Philip Cook, a public policy expert at Sanford, said that rate has not risen much in the interim. Germany, by contrast, clears 90 percent of its murder cases. The FBI defines a cleared case as one where a suspect has been identified and arrested. Things are even worse in Oakland, California. It cleared just 36 percent of murders in 2022.But that figure includes cold cases from previous years.If those are stripped out, the number of murders cleared in Oakland in 2022 sits at a paltry 27 percent. ",
        "Professor Cook says that America's abysmal clearance numbers are 'undermining whatever trust there is in the police. And it's a vicious circle.''Communities that are especially impacted by gun violence believe that the police are ineffective or indifferent, and as a result, they're less willing to cooperate and provide information the police need to have successful investigations,' he said.Cook explains that the reasons for the low clearance rate are multi-faceted, but that more people getting away with murder in the US is driving a doom loop that leads to a higher murder rate.",
        "A low clearance rate impedes future investigations, which drive up killings in some communities where a dearth of arrests undermines security and sends the message that police will not or cannot protect citizens.Drennon Lindsey, an Oakland deputy chief, said there are a number of reasons for the for the measly solve rate in Oakland, including an antiquated case management system, and an understaffed department in which 16 detectives are often each handling two dozen or more cases at a time.The biggest reason, however, said Lindsey, is that people are scared to speak with the Oakland Police Department.'People don't want to cooperate, people don't want to come to court and testify. And they're afraid of retaliation, of being labeled in their communities as a \"snitch.\" And we're often left trying to plea and beg for the community to come forward with information to hold this person accountable for committing murder,' she said.",
        "The Oakland Police department remains under federal oversight, which it has been under for more than two decades. The agency has had twelve leaders in that time, the most recent of which was recently fired for an alleged coverup of an officer's misdeeds. Crime rocketed during the COVID pandemic in 2020 - and was compounded by the Black Lives Matter protests and riots of that summer, sparked by Minneapolis cop Derek Chauvin's murder of George Floyd.",
        "That also led to widespread calls from progressives to defund police departments across the United States.Some did just that - or committed to cutting police budgets. Portland cut its police department, and has since seen murder rates hit record highs for two years in a row.San Francisco is also facing a huge explosion in crime and open drug abuse on the city's streets, with many progressives there still resistant to calls to boost its short-staffed police force.  FBI officials say a murder can also be labeled cleared by 'exceptional means.'Exceptional means clearances include when a suspect is found dead, cannot be extradited, or prosecutors are refusing to press charges.Criminologists note that some cities - like Chicago - that are posting marginally improved clearance rates, are really just toying around with their numbers through the exceptional means clause.In Chicago, between 2016 and 2020, the percentage of murders in Chicago with any type of weapon that led to at least one arrest was just 33 percent.  "
    ]
}