{
    "articleURL": "/tvshowbiz/article-12049683/Paris-Jackson-Chrishell-Stause-Olivia-Culpo-attend-Drakes-grand-opening-WeHo.html",
    "content": [
        "Paris Jackson exuded glamour as she joined a number of other stars at Drake's grand opening in West Hollywood on Thursday.",
        "The daughter of Michael Jackson, 25, looked chic in long chestnut-toned dress with a number of cut-outs, and a thigh-high slit as she made her way to the swanky new restaurant.The model - who was accompanied by her beloved Doberman Pincher named Koa at the event - layered the look with a luxurious brown coat featuring a fur-trimmed collar.Also at the grand opening was Selling Sunset star Chrishell Stause, 41, who sizzled in a transparent silver top and black leather pants.Meanwhile model Olivia Culpo, 30, opted for an effortlessly cool look, wearing a white tee tucked into black pants, and a black trench coat. ",
        "Paris added extra height to her look with a pair of black platform heels.The star kept her eyes shielded with oversized brown sunglasses.She wore her brunette tresses parted on the side and styled into bouncy waves.The fashionista wore a burgundy monogrammed Dior purse slung over her shoulder. Chrishell amplified the silver sparkle of her outfit with strappy silver heels and a shimmering purse.The real estate agent wore her blonde tresses in a straight style, gently flowing down her shoulders.As for glam she accentuated her features with a touch of blush and mascara.Olivia wore her brunette locks halfway pinned back, with a few strands framing her face.",
        "The Miss USA 2012 winner sported pointed-toe black heels and a black belt with a gold buckle.Olivia touched up her naturally stunning visage with a bit of blush and pink lipstick.Chrishell's Selling Sunset co-star Emma Hernan was also in attendance, and put on a busty display in a black leather mini dress.She completed the look with knee-high black boots and a black choker necklace.The blonde bombshell wore her platinum strands in bouncy curls.British singer Leona Lewis, 38, was a breath of fresh air in a vibrant pink suit.The Bleeding Love hitmaker coordinated her outfit with a pink Prada bag and strappy silver heels.Leona wore her curls in a ponytail, and accessorized with gold hoops. ",
        "Actress Cierra Ramirez, 28, put on a leggy display in a silver mini skirt and black boots.She completed the outfit with a black motorcycle jacket and a matching black purse.Social media sensation Kara Del Toro looked stunning as ever in a sultry brown mini dress, which she styled up with a chic camel coat. The blonde beauty wore cream leather boots for the occasion.Actress Storm Reid, 19, showed off her youthful style in a white tank top and black pants. Model Shanina Shaik, 32, was joined by partner partner Matthew Adesuyan at the event.",
        "She showed off her fashion credentials in a white mini dress styled with a light grey oversized blazer.The Australian star wore open-toe black heels and further accessorized with a black purse.The mother-of-one wore her shoulder-length black tresses lightly curled at the ends.",
        "Model Jasmine Tookes, 32, was the picture of sophistication in a camel coat and a plunging brown dress.The Victoria's Secret Angel teamed the look with matching heels and a dainty purse.The California-born beauty brushed her tresses back into a sleek bun.She added further glamour to the look with a gold necklace and a pair of chunky gold earrings.cShe was joined by her husband Juan David Borrero, a director of international markets at Snapchat. The good-looking pair have been married since 2021.Drake’s WeHo is the sister to Drake’s Hollywood, a swanky old Hollywood-inspired restaurant and bar in Dallas, Texas. "
    ]
}