{
    "articleURL": "/wires/pa/article-12048189/Sergio-Garcia-pay-DP-World-Tour-fine-joining-LIV-Golf.html",
    "content": [
        "Sergio Garcia is the only one of 17 players sanctioned by the DP World Tour for joining LIV Golf not to have paid his fine, the tour has announced.",
        "The 43-year-old was one of a clutch of players that includes Lee Westwood and Ian Poulter to have been hit with a fine over joining the breakaway Saudi-backed tour.A statement said: “The DP World Tour today confirmed that 16 out of 17 players have paid their fines which were imposed for serious breaches of the Tour’s Conflicting Tournament Regulation last June.“The players were each fined £100,000 – a sanction originally imposed in July 2022 and upheld last month by an independent panel appointed by Sport Resolutions.“Sergio Garcia has not paid his £100,000 fine, nor has he given any indication that he intends to.“We will therefore take appropriate action if he continues not to respect the Sport Resolutions panel’s decision.”Garcia, along with Poulter and Westwood, on Wednesday announced his resignation from the World Tour.Rory McIlroy said it is a shame that the trio will now not get the chance to one day captain Europe’s Ryder Cup team following their decision to quit.Their departure renders them ineligible for inclusion when the match against the United States begins in Rome in September.On Thursday, Westwood spoke out against the DP World Tour following the controversy, seemingly closing the door on any hope of a return in the future.",
        "And McIlroy said: “I think it’s a shame that you’ve got the highest points score ever in the Ryder Cup and two guys that when they look back on their career, that’s probably going to be at least a big chunk of their legacy is the roles that they have played in the Ryder Cup for Europe.“For those three guys to not captain Europe one day, it’s a shame. But as the DP World Tour said in their statement, at the end of the day that was their choice and they knew that these were potentially going to be the consequences of those choices and of those actions and here we are.“Yeah, it’s certainly a shame.”Europe’s captain, Luke Donald, echoed McIlroy’s sentiments and said he is sad that the three will not be available to represent the side.",
        "Donald, who will lead the Europe team as they seek to win the Ryder Cup for the first time since 2018, felt sorry that the situation had come to this.“It’s sad we’ve got to this point but this was always a possibility,” Donald told BBC Sport. “I played with all three and they’ve been stalwarts of, and given a lot to, both the Ryder Cup and European Tour.“I have a little more clarity now. I know they’re not an option to play in, or be any part of my team. It is a shame. They’ve got a lot of history when it comes to the Ryder Cup.",
        "“Ultimately this is their choice and I wish them well. They feel like this was the best choice for them and now I’ve got choices to make that are best for me.“There are generational shifts throughout the history of the Ryder Cup and maybe this is one.“We certainly have plenty of great players to look at and pick from and I’m certainly excited about how everyone has played this year so far.”Donald was made captain in 2022 after Henrik Stenson was dismissed for joining in the Saudi-backed LIV tour.He will be without three of Europe’s most successful performers in the contest, with Westwood having featured as a player a record 11 times and Poulter unbeaten in singles across his seven appearances. Garcia is Europe’s all-time record points scorer.Donald added: “There’s great momentum with European golf. We’ve already had seven winners in the US [this season] and a bunch of people who haven’t played in the Ryder Cup have played great this year on the DP World Tour, so I’m excited about the make-up of this team.”"
    ]
}