{
    "articleURL": "/news/article-12048833/Cat-astrophe-avoided-three-kittens-rescued-firefighters-Shelly-Perth-taken-RSPCA.html",
    "content": [
        "Three kittens rescued after becoming stuck in roof and wallFelines then found new mum at RSPCA shelterThree tiny kittens have been rescued from inside the brick wall and roof of a home after their distress calls drew firefighters to the scene. ",
        "The three-week-old felines were discovered trapped inside the property in the Perth suburb of Shelly on April 25 and April 27. The small animals whose mum was nowhere to be found were removed after painstaking efforts of emergency crews using power tools.It took rescue teams one hour to pry the first kitten - who was named 'Meggsi' - from inside the roof of the property on Anzac Day, Perth Now reported.The kitten emerged cold and dehydrated but otherwise unscathed before being taken into care. ",
        "Then firefighters were again called out to the same home two days later after reports of more distress meows - but this time coming from behind a brick wall. After some time two more kittens - who were called Blaze and Spark - were removed by fire crews after power tools were used to get to them. Pictures of the rescue showed two firemen crouched over as one of them pulls a kitten free by the scruff of the neck from a hole at the bottom of a brick wall. The moggies came out a bit dusty but otherwise unhurt. All three were taken into care by the RSPCA WA in Malaga where the kittens got a vet check and a good meal. The felines were then taken in by a cat at the shelter called Bombora who has added them to her recent litter of five kittens. ",
        "An RSPCA spokesperson said the mum cat was caring and feeding the new additions as if they were her own. Images of the animals were posted to social media showing the nervous and tired-looking felines soaking up the new environment. Animal lovers took to the post cooing over the tiny creatures and praising the RSPCA.'You never miss a beat RSPCA,' one of the charity's members said. 'So in love with the little sandy coloured one,' another said, while a third wrote, 'they are sooo gorgeous and what a super mum taking on the foster mum role'.",
        "'I wonder what happened to their real mother, hope she's OK,' wrote another.  The RSPCA WA said the litter's real mum has not been located.'Our inspectors are working at the property to safely bring any more cats and kittens into care as soon as possible,' an RSPCA spokeswoman told Daily Mail Australia.'The feline family is now in foster care, where they will remain until they are old enough to be desexed, vaccinated and microchipped ready for adoption. Usually this is around nine weeks old.'She added there had been 'lovely responses' from members of the public willing to give the kittens a home.It comes as the RSPCA WA has 125 cats in its care and is desperate for foster carers to take in animals. "
    ]
}