{
    "articleURL": "/wires/ap/article-12054917/Celtics-Nuggets-seek-3-1-series-leads-76ers-Phoenix.html",
    "content": [
        "PHILADELPHIA (AP) - James Harden showed in Game 1 he could still be as great once as he ever was in his prime. The Beard just overall these days isn´t as great as he once was in his halcyon days with Houston.",
        "Harden´s occasional big postseason games for the 76ers - like the 45 points he dropped against Boston in a Game 1 win - now come with immediate fallout.Like Game 2, when Harden shot 2 of 14 in a loss.Or Game 3, when Harden had 3-for-14 shooting for 16 points in, yes, another loss.For those keeping score at home, Harden´s 5-for-28 shooting the last two games is the worst for him over any two-game span in his career - that includes regular season or playoffs - in which he´s attempted at least 20 shots.Yikes.",
        "It´s no wonder the Celtics hold a 2-1 lead in the Eastern Conference semifinals ahead of Sunday´s Game 4 in Philadelphia. It´s also no wonder why the whispers have grown louder that Harden wants to finish his career with the Rockets. Lose Game 4, and it could be the last one in Philly for Harden - and with more games like the last two, would the Sixers really be that crushed to see him go?Harden brushed off concerns about his play, especially his odd Game 3 tendency of passing on open looks.\"I´m pretty good on basketball instincts,\" Harden said. \"I know when to score. I know when to pass, so I´m pretty sure a lot of it was the right play.\"",
        "Harden took a so-called discount (opting out of a $47.4 million deal this season to sign a more team-friendly extension) to chase a championship with reigning MVP Joel Embiid and the Sixers. The 10-time All-Star has a $35.6 million player option for the 2023-24 season and he will likely decline it and chase more riches in another market.Maybe circumstances change if the 76ers get past Boston and make a deep run.\"It´s up to him to figure out how to best help us,\" Embiid said. \"He´s fine. Sometimes you make them and sometimes you miss them. He made a lot of shots in Game 1. The last few games they haven´t been going in. I have the trust in him to keep telling him to be aggressive and keep shooting.\"But history is against Philly. Not just NBA history - teams that win Game 3 when a playoff series is tied 1-1 go on to win the series 73% of the time - but rivalry history. The Celtics eliminated the 76ers in the playoffs in 2020, 2018, 2012, 2002 and 1985. The Sixers haven´t beat the Celtics in the playoffs since 1982 - a year before the Sixers won their last NBA championship.Kevin Durant, Harden´s former teammate during an ill-fated run in Brooklyn, scored 39 points and the Phoenix Suns beat the Denver Nuggets 121-114 to cut Denver´s lead to 2-1 in their Western Conference semifinal series. Devin Booker scored 47 points, shooting 20 of 25 from the field, including 5 of 8 from 3-point range, to keep the Suns alive headed into Sunday´s Game 4 in Phoenix.",
        "CELTICS AT 76ERSCeltics lead 2-1. Game 4, 3:30 p.m. EDT, Sunday, ESPN-- NEED TO KNOW: The 76ers are in trouble. Embiid is still achy, Harden is struggling and the Celtics clearly have Philly´s number. The Celtics went 3-1 against the 76ers in the regular season and seem poised to repeat the feat in the playoffs. Not even the emotional carryover from Embiid´s MVP ceremony helped the Sixers, as they quickly fell behind by 10 and never had the juice to fully recover.- KEEP AN EYE ON: Jayson Tatum. He watched Embiid´s ceremony from the locker room and said it \"kind of got me really ready to play.\" He scored a team-high 27 points after he was held to just seven points in Game 2. Tatum scored eight points only 4 minutes into Game 3. If he continues to play like he did in Game 3 - while teammate Jaylen Brown continues to harangue Harden - it could be another big day for Boston.- INJURY WATCH: Grant Williams said he still hurt from taking an accidental boot from Embiid to the back of his head. Embiid isn´t 100% yet as he plays through a sprained right knee.- PRESSURE IS ON: 76ERS. The 76ers grabbed the early edge with a Game 1 win in Boston that earned them home-court advantage. They gave it right back in two straight losses where they´ve mostly looked out of sorts against the Celtics.",
        "NUGGETS AT SUNSNuggets lead 2-1. Game 4, 8 p.m. EDT, Sunday, ESPN- NEED TO KNOW: The Suns won their first game of the series in Game 3 thanks to another huge effort from Devin Booker, who scored 47 points on 20 of 25 shooting. Kevin Durant added 39. They'll probably need a similar effort to win Game 4 considering 12-time All-Star point guard Chris Paul is expected to be out once again with a strained groin.- KEEP AN EYE ON: The Jokic-Ayton matchup. Denver star Nikola Jokic had another huge game in Game 3 with 30 points, 17 assists and 17 rebounds. On the other hand, Ayton had arguably the worst game of his playoff career with just four points and nine rebounds in 26 minutes. Ayton was so ineffective that the former No. 1 overall pick was benched in favor of Jock Landale in the fourth quarter. The Suns still won but that's a trend that probably can't continue if Phoenix is going to win the series.- INJURY WATCH: Outside of Phoenix's Paul, both teams are relatively healthy.- PRESSURE IS ON: Booker. The three-time All-Star is averaging more than 36 points per game in these playoffs and its fairly clear that he has to continue his Hercules-style production if the Suns hope to advance.",
        "___AP Sports Writer David Brandt in Phoenix contributed to this report.___AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP_Sports"
    ]
}