{
    "articleURL": "/wires/aap/article-12053121/Rebels-look-rein-Super-second-half-blues.html",
    "content": [
        "Taking on one of the best finishing teams in the Super Rugby Pacific competition in the Brumbies, Melbourne are aware they will be punished if they repeat their pattern of second-half fade-outs.",
        "The Rebels host the high-flying Brumbies at AAMI Park on Sunday afternoon, desperate for a win to jump up a spot on the ladder into the top eight.In their past three games Melbourne have led at halftime but fell away to lose two, while their big lead last round against Moana Pasifika evaporated, as did a crucial bonus point, despite holding on for a 10-point win.The Brumbies, ranked second, are proven performers in the final 10 minutes of their games.According to Super Rugby statistics they have scored eight tries in the 71st minute or later - joint second most of any team in the competition this season.They've also conceded only one try during this period, fewer than any other team.Returning Rebels No.8 Richard Hardwick said his team needed to play the full 80 minutes and their bench to deliver, or pay the price.\"The last 40 minutes has been a difficult one for us, because there's a lot of good involvements, there's a lot of effort ... we need to just execute,\" Hardwick said.\"Every week we've learned and built on that and hopefully we can start implementing from this week.\"We know the Brumbies' threats and we've got plans around that but it really comes down to how we play.\"",
        "Former Wallaby and now Namibia international Hardwick was one of Melbourne's best in the first four rounds until sidelined by a calf injury suffered at training.He is still ranked ninth in the competition for turnovers despite only playing a handful of games.No.8 Pete Samu is back for the Brumbies after missing their narrow loss to the Hurricanes last round, and will be joined in the back-row by fellow Wallaby Rob Valetini, while Jahrome Brown earns his first start of the season at seven.Hardwick said stopping their back-row would take a team effort.\"They've got a really good back-row but we don't really focus on the individuals,\" Hardwick said.\"The best way that we can stop those guys is sticking to our team process in defence ... staying on top of them, slowing their breakdown down so that they're not getting front-foot ball.\"They like playing quick and fast and they've got some really fast wingers and they want to get the ball to them and if we can slow that down and let our defence get set that's really going to be the key for us.\""
    ]
}