{
    "articleURL": "/wires/reuters/article-12038291/GRAINS-Chicago-grains-mixed-demand-crop-conditions.html",
    "content": [
        "Wheat reverses gains after earlier recovery from near 2-yr low",
        "Soyoil gets boost from uptick in biofuels demandMarket eyes talks due on Wednesday on Black Sea grain corridor(Updates prices, changes headline, changes bullets, adds quotes, changes byline, changes dateline, previous SINGAPORE/PARIS)By Cassandra GarrisonMEXICO CITY, May 2 (Reuters) - Chicago grains and vegetable oils were mixed on Tuesday as low export demand weighed on wheat futures, while signs of growing soy-based biofuel demand lent support to soyoil.Wheat dipped, reversing earlier gains from bargain buying, as improved crop conditions reported by the U.S. Department of Agriculture on Monday hung over markets.\"The market had expected a bigger improvement than what it got, but it was still an improvement, and that's being considered a little negative,\" said Jack Scoville, analyst with the Price Futures Group in Chicago.Soyoil ticked higher after USDA's monthly oilseed crush report - also released Monday - showed signs of strong demand for soy-based biofuels, Scoville added.The most-active wheat contract on the Chicago Board of Trade (CBOT) lost 0.89% to $6.12-3/4 a bushel, as of 1009 CDT (1509 GMT), after dropping more than 2% on Monday to its lowest since July 2021.Corn lost 0.26% to $5.83 a bushel and soybeans edged down 0.07% to $14.26-1/2 a bushel.Eyes were also on the U.N.-brokered deal that allows safe exports of Ukrainian grain through the Black Sea. A senior Ukrainian source said on Tuesday talks on the corridor including all sides in the negotiations were scheduled for Wednesday.",
        "However, Russia's foreign ministry said it had not received any information about a meeting with Turkey and Ukraine to discuss the Black Sea grain deal, the TASS news agency reported.Ukraine's grain exports could fall to around 26 million tonnes in the 2023/24 season as the grain harvest has sunk, largely due to Russia's invasion, a senior ministry official said.The U.S. Department of Agriculture (USDA) on Monday rated 28% of U.S. winter wheat in \"good-to-excellent\" condition, up 2 percentage points from last week, following much-needed rains in the Plains, but still among the lowest on record for this time of year. (Reporting by Cassandra Garrison in Mexico City, Naveen Thukral; Editing by Sherry Jacob-Phillips, Uttaresh Venkateshwaran, Subhranshu Sahu and Jonathan Oatis)"
    ]
}