{
    "articleURL": "/wires/reuters/article-12044185/Carlos-Alcaraz-rolls-Madrid-semis-straight-sets.html",
    "content": [
        "Defending champion and top-seeded Carlos Alcaraz put an emphatic end to his teen years, defeating Karen Khachanov of Russia 6-4, 7-5 to advance to the semifinals of the Mutua Madrid Open on Wednesday in his native Spain.",
        "Alcaraz hit 31 winners and rebounded from a 2-5 hole in the second set to set up a date with Borna Coric of Croatia in the semifinals. Alcaraz turns 20 on Friday.\"It was pretty tough. The first set as well, it was close,\" said Alcaraz. \"I was in trouble in the second set, a break down and (he had) two break points to have the second break. So it was really tough for me to come back and he had his chances to win the second set.\"Luckily, I knew I was going to have my chances. I just tried to take my opportunities and I'm really happy to get through.\"Alcaraz improved to 27-2 in 2023.The 17th-seeded Coric cruised past Germany's Daniel Altmaier 6-3, 6-3 in one hour and 14 minutes.Coric won 90 percent of his first serves while Altmaier suffered through four double faults. Coric converted 3 of 5 break point opportunities for the win.\"I always love to play here in Madrid. I have very, very nice memories from here and I knew I could play well,\" Coric said. \"I came here very early to prepare myself for the tournament, as it's, I would say, a little bit different to the next tournaments. I'm just very happy to be in the semifinals.\"",
        "Coric hit 25 winners against just six unforced errors while Altmaier connected on just 13 winners against 10 unforced errors.Coric will face Alcaraz for the first time.\"He's absolutely an unbelievable player in unbelievable shape in the moment as well,\" Coric said. \"So he's the favorite and I'm going to just go out there and I'm going to enjoy himself. I like to play here in this stadium and it's going to be a very cool feeling for sure.\"--Field Level Media"
    ]
}