{
    "articleURL": "/wires/afp/article-12040625/East-DR-Congo-fishing-town-struggles-checkpoints-militias-proliferate.html",
    "content": [
        "Even in better times, getting to Vitshumbi was never easy.",
        "The isolated fishing town lies on the shore of Lake Edward in eastern DR Congo, reached at the end of some 150 kilometres (90 miles) of road and track from the city of Goma.But these days, the trek is even more arduous.Conflict between government forces battle and M23 rebels has left the makeshift road overrun with soldiers, militias and checkpoints, cutting off Vitshumbi's economic lifeline.A Belgian colonial-era building, in an advanced state of collapse, serves as headquarters for the local government.In a room with blackened walls, a town official who requested anonymity explained it was the army that was blocking the road to Goma.\"The problem isn't with the M23,\" the representative said.- Extortion -Before, fishermen transported their catch straight from the lake to Goma.Today, they have to load their catch onto canoes that land in the village of Nyakakoma farther east along the shore.The fish then are transported by motorbike to Goma through M23-held territory to avoid army checkpoints.But, a fisherman explained, the rebels slap the equivalent of a $10 charge on each motorbike.Extra transport costs, and extortion on the road, means Vitshumbi's fishery is now barely viable, he said.",
        "The Tutsi-led M23 captured swathes of North Kivu after going on the offensive in late 2021, triggering a massive humanitarian crisis.",
        "The DRC has repeatedly accused its neighbour Rwanda of backing the rebels, a charge Kigali denies.The United States, several other Western countries, as well as independent UN experts, have also concluded that Rwanda is backing the rebels.- 'I earn nothing' -Esperance Matomahini, a fishmonger sitting in a dilapidated shed that serves as the local premises of the Congolese ministry of fisheries, said her children no longer attended school because of the town's economic crisis.\"I earn nothing these days,\" she explained.As the sky turned ominous overhead, a canoe returned to shore.The fishermen had stayed out all night, but had come home empty-handed, its dejected captain said.",
        "Falling fish stocks have added to Vitshumbi's problems.A representative of the town's fishermen explained that some have begun to fish illegally in Lake Edward's spawning grounds.\"Because they pay off (DRC Congo's) naval forces and the Mai-Mai, they're protected,\" he said.The term \"Mai-Mai\" is widely used in the DRC to describe armed groups that claim to represent certain ethnic communities.Delphin Mutahinga, the North Kivu governor's representative in Vitshumbi, said that the town's yearly catch had plummeted from 15,000 tonnes to 400.- 'Madman' -But Vitshumbi is also economically constrained by its position in the middle of Virunga National Park -- a famed wildlife haven home to endangered gorillas.",
        "Rules regarding fishing and agriculture are strict inside the park and watchful rangers ensure that they are respected.Joseph Muhindo, the head of a civil society group in Vitshumbi, said that the only thing locals had the right to do was fish.\"No farming, nothing,\" he explained. \"We have to buy everything\".Basic goods such as flour, cooking oil and soap reach Vitshumbi by road.But the conflict and checkpoints have disrupted the usual supply routes.Goods still arrive, but they take torturous routes from the Ugandan border through shifting frontlines, and over hundreds of kilometres (miles) of mountainous terrain.Taking the direct route from Vitshumbi to Goma -- braving both Congolese army and M23 checkpoints -- is seen as impossible.Mai-Mai militiamen in Vitshumbi laughed when asked about this route, saying that they only knew one man fool enough to try it.\"He must have been a madman. Or he'd smoked weed (marijuana),\" said one.",
        "Serge, a Mai-Mai commander , said that the war against the M23 could have been won with proper support, which he complained was lacking from the Congolese army.\"They promised us ammunition, but didn't deliver even 20 percent of what they said they would,\" he said.As night fell on Vitshumbi, fishermen fastened down boats and the Mai-Mai began to stroll through the streets, chatting about the latest conflict in their region, where militias have roamed for 30 years.",
        "One of them said: \"We were born in war. We grew up in war. We will die in war.\""
    ]
}