{
    "articleURL": "/news/article-12040505/Transwomen-female-sport-critic-Kirralie-Smith-hit-AVO-protect-trans-activist-player.html",
    "content": [
        "Critic of trans women in female sport hit with AVO  Kirralie Smith says she 'has never been violent'AVO issued covers electronic harassment A high-profile campaigner against transgender women competing in female soccer leagues has been hit with a restraining order on behalf of a prominent transgender player.",
        "Kirralie Smith organised a campaign that bombarded Football NSW with 12,000 emails demanding a rethink on trans women playing in female competitions. 'Keep blokes out of women’s sport!', the petition page read.During her lobbying efforts, Ms Smith named a number of transgender players on social media, including a leading goal scorer. On April 1, police came to Ms Smith's home and issued the campaigner with an Apprehended Violence Order preventing her from discussing or approaching the player.The order also covers electronic harassment of the trans activist player, who lives over 300km away.'I was in disbelief,' Ms  Smith said. 'I have been issued with an application for an AVO and I've never been violent in my life.'",
        "The 51-year-old mother-of-three believes this is the first case in Australia where police have become involved over social media posts speaking out against transgender ideology.Ms Smith is required to attend court later this month for the court to decide whether the interim order will be upheld.'I will strongly oppose the accusations in court,' she said. 'I have a very long-standing knee injury. I'm not violent and not capable of violence.'Ms Smith, who is director of Binary Australia, said the decision by the court will have far reaching consequences for freedom of speech, particularly in regard to transgender comments, however she is undeterred by the AVO.",
        "'It's important for women to be able to draw boundaries and speak freely about how males impact their spaces and services,' she said.'I will continue to speak truthfully about matters of biology and how they affect women and children in Australia.'",
        "Ms Smith has been highly vocal around the participation of transwomen in women's sports and the risk of injury to female players.It is believed the government's eSafety Commission, responsible for cyber bullying, has been involved in the case. Ms Smith had her Facebook page with its 47,000 followers removed by the social media company after being contacted by the eSafety Commissioner on February 20.An eSafety spokesperson said: 'Under the Act, eSafety cannot seek removal of entire accounts or pages on social media platforms or other service providers, except in circumstances where impersonation accounts may be involved.'However, we may notify platforms or service providers of harmful material for action under their own terms of service, including impersonation accounts and abusive private messages sent from individual accounts. It is then up to the platform or service provider to determine what action to take, which could include deletion of the harmful material or the suspension or deletion of accounts.'Former Liberal candidate, lawyer and co-founder of Save Women's Sports, Katherine Deeves - who has also been outspoken about the need to keep women's sports for biological women - said she is concerned about the implications of this case.",
        "'The High Court has acknowledged in various decisions that the implied freedom of communication exists under the Constitution in relation to political and government matters,' she said.'The objective of AVOs in domestic violence and personal violence legislation and the eSafety Commissioner legislation, must be compatible with the system of representative and responsible government.Principal Solicitor at the Feminist Legal Clinic, Anna Kerr, also expressed concern that laws intended to keep people safe are increasingly being used to silence women.'Too often we see bullies calling out those who dare to stand up to them,' Ms Kerr stated.'AVOs that are failing to keep women safe from male violence are now being used as weapons against them.'I am concerned that the eSafety Commissioner and law enforcement agencies must take care that their powers are not manipulated to suppress free speech.'Comment has been sought from the eSafety Commission and the Australian Professional Association for Trans Health.The Australian Human Rights Commission has shared guidelines about the inclusion of transgender people in sport in 2019, noting that 'transgender and gender diverse people are sometimes excluded from sport, or may experience discrimination and sexual harassment when they do participate.",
        "Last year, world soccer's governing body FIFA and World Athletics said they were reviewing their transgender eligibility policies after swimming passed new rules that restricted transgender participation in women's events. However reports from earlier this year suggested transgender footballers would compete at the FIFA Women's World Cup in Australia and New Zealand this July and August.FIFA women's program director Sarai Bareman told The Australian in January three transgender players had contacted her about the review process and that she believed there were others.'I think it's very sensitive, and we need to be very careful about how we deal with it. That's something we're taking very, very seriously. 'And we certainly don't want to rush it (the decision on new rules), given the impact that it will have for many generations to come,' she said. Ms Bareman said FIFA had been consulting various groups including human rights groups, non-government organisations, athletes and other sports as well as the International Olympic Committee.'We have to be very careful as you know, we have 211 member associations and essentially what we do seem to blueprint for those member associations, which is why the consultation process is very extensive and we will take our time to ensure that we get it right,'' she said.The Australian Human Rights Commission shared guidelines about the the inclusion of transgender people in sport in 2019, noting that 'transgender and gender diverse people are sometimes excluded from sport, or may experience discrimination and sexual harassment when they do participate. 'While some reported positive experiences of inclusion, others described how they had been excluded from the sports they loved because of their sex or gender identity.'Some spoke of disengaging from sport during their transition journey because of their concern about how their team mates would treat them.' "
    ]
}