{
    "articleURL": "/wires/reuters/article-12047815/EXPLAINER-Parsing-Feds-path-pause.html",
    "content": [
        "By Howard Schneider WASHINGTON, May 31 (Reuters) - Federal Reserve officials may still be fighting an inflation war, but they opened the door at their May policy meeting to the possibility the U.S. central bank's benchmark overnight interest rate won't rise from the current 5.00%-5.25% range. They now have until their next meeting on June 13-14 to choose whether to walk through that door, with upcoming data on jobs, inflation, credit conditions and the health of the banking system informing the decision and public comments from Fed officials shaping the debate. Here's a guide: JOB OPENINGS: Current release on May 31 The number of open jobs for each unemployed job seeker rose in April to 1.78, reversing several months of steady progress towards bringing worker demand and supply into better alignment. Fed Chair Jerome Powell and other policymakers have paid particular attention to the statistic, and they would like to see it back to pre-pandemic levels of around 1.2. Expectations for another rate increase rose following release of the latest Job Openings and Labor Turnover Survey. RETAIL SALES: Current release on May 16 Retail sales rose 0.4% in April, below the 0.8% expected by economists in a Reuters poll, but so-called core sales showed a larger-than-expected 0.7% increase, indicating consumption remains strong. Fed officials at this point give a textbook economics explanation for inflation, blaming it on a mismatch between supply and demand. Regardless of which side of the equation is more to blame, monetary policy at least in the short run works to curb spending: The more it expands, the more Fed officials may feel interest rates need to move higher. INFLATION: Current release on May 26, next release June 13 The Personal Consumption Expenditures Price Index increased in April to a 4.4% annual rate from 4.2% in March, with underlying \"core\" prices excluding food and energy increasing 4.7% versus 4.6% in the prior month. Since the Fed uses the PCE to set its 2% inflation target, that was a blow to hopes of a steady decline in the pace of price increases. Officials will get a final dose of inflation data when May's Consumer Price Index is released on June 13 as their meeting convenes, too late for any public commentary to shape the outlook. JOBS: Current release on May 5, next release on June 2 April jobs growth came in stronger than expected: 253,000 positions added across a broad set of industries, and wage growth remaining at a robust 4.4% annual rate. Continued readings like that could weaken the case for pausing rate hikes given that employment gains, from the central bank's perspective, have been unsustainably strong and labor market \"softness\" seen as necessary to lower inflation. BANK DATA: Released every Thursday and Friday To some degree the Fed wants credit to become more expensive and less available. That's how increases in its policy rate influence economic activity. But recent bank failures threatened both unwanted broader stress in the industry and a worse-than-anticipated credit crunch. Weekly data on bank lending to customers, and Fed lending to banks, shows loan growth is slowing and borrowing by banks remains elevated. FEDSPEAK: Ongoing The Fed's internal communications rules set a \"blackout\" period around each policy meeting. U.S. central bank officials will be able to speak publicly about their policy views through June 2. Fed Chair Jerome Powell, May 19: \"Our guidance is limited to identifying the factors we'll be monitoring as we assess the extent to which additional policy firming may be appropriate to return inflation to 2%.\" Fed Governor Philip Jefferson, May 18: \"History shows that monetary policy works with long and variable lags, and that a year is not a long enough period for demand to feel the full effect of higher interest rates.\" Fed Governor Christopher Waller, May 24: \"I do not support stopping rate hikes unless we get clear evidence that inflation is moving down towards our 2% objective ... But whether we should hike or skip at the June meeting will depend on how the data come in over the next three weeks.\" Fed Governor Michelle Bowman, May 12: \"In my view, our policy stance is now restrictive, but whether it is sufficiently restrictive to bring inflation down remains uncertain.\" Cleveland Fed President Loretta Mester, May 31: \"I don't really see a compelling reason to pause,\" Mester said in a Financial Times interview. Minneapolis Fed President Neel Kashkari, May 22: \"I think right now, it's a close call either way, versus raising another time in June or skipping,\" Kashkari said, adding that \"important to me is not signaling that we're done.\" St. Louis Fed President James Bullard, May 22: Bullard said rates may need to rise by another half of a percentage point this year. \"The risk with inflation is that it does not turn around and go back to a low level ... As long as the labor market is so good, it is a great time to get this problem behind us and not replay the 1970s.\" San Francisco Fed President Mary Daly, May 22: Daly said it is too soon to say what the Fed will do at the June meeting. \"We have to be extremely data-dependent.\" Dallas Fed President Lorie Logan, May 18: \"The data in coming weeks could yet show that it is appropriate to skip a meeting ... As of today, though, we aren't there yet.\" Richmond Fed President Thomas Barkin, May 16: \"You could tell yourself a story where inflation comes down relatively quickly ... with only a modest economic slowdown ... I'm not yet convinced.\" Atlanta Fed President Raphael Bostic, May 16: Businesses \"are telling me 'we think you're close to overdoing it' ... There's a long history of the Federal Reserve overshooting their policy and driving the economy into a more negative place. I would rather avoid that if we can.\" New York Fed President John Williams, May 8: \"We haven't said we are done raising rates ... If additional policy firming is appropriate, we'll do that.\" Chicago Fed President Austan Goolsbee, May 5: \"We know that credit conditions like the ones we are seeing now in the past have been correlated with recessions, credit crunches,\" Goolsbee said. \"It's way too premature to know what to do with monetary policy.\" (Reporting by Howard Schneider; Editing by Dan Burns, Andrea Ricci and Paul Simao)"
    ]
}