{
    "articleURL": "/wires/reuters/article-12048455/Nicaragua-arrests-40-opposition-figures-new-round-critics.html",
    "content": [
        "May 4 (Reuters) - Forty political opponents of Nicaraguan President Daniel Ortega have been arrested and charged with crimes including conspiracy and treason in a new round-up of government critics, relatives of five of the detainees said on Thursday.",
        "The opposition figures were detained on Wednesday night, taken to the capital Managua to be charged, then transferred back home to be placed under house arrest, the relatives told Reuters.The charges against the 40 were registered in the country's online judicial database. The government did not immediately reply to a request for comment.Following violent anti-government protests five years ago, Ortega's government has toughened its stance on critics, jailing dozens of opposition figures that officials have accused of fomenting a coup. Rights groups have denounced the actions as a descent into dictatorship.Among those arrested are journalists, farmers, lawyers, and activists, as well as Maricruz Bermudez, mother of one of the 17 students who died in the 2018 protests. She was taken from her house and beaten by police on Wednesday night before being arrested, relatives told Reuters.The police did not immediately respond to a request for comment on the accusation from Bermudez's relatives.Yonarqui Martinez, a lawyer who has defended imprisoned government critics in the Central American country, wrote on Twitter that hearings had taken place at dawn, leaving \"innocent citizens stripped of their freedom.\"In February, Ortega's government expelled 222 political prisoners to the United States and stripped them of their citizenship. Many had been in prison for almost two years, accused in some cases of spreading false news or undermining national sovereignty.",
        "High-profile prisoner Rolando Alvarez, the Catholic bishop of Matagalpa, refused to board the plane to the United States and was swiftly sentenced to 26 years in prison.A week later, the judiciary announced that 94 more opponents had been stripped of their nationality. (Reporting by Ismael Lopez; Editing by David Alire Garcia and Rosalba O'Brien)"
    ]
}