{
    "articleURL": "/wires/reuters/article-12044477/Led-stars-Lakers-look-sink-Warriors-2-0-series-lead.html",
    "content": [
        "Two teams that began the second round of the NBA playoffs the same way they tipped off the first will duel again Thursday night when the Los Angeles Lakers and Golden State Warriors continue their best-of-seven series in San Francisco.",
        "Riding a big-time performance from Anthony Davis, a productive effort from LeBron James in a complementary role and a scrambling defensive effort on the perimeter, the Lakers stole Game 1 on the road 117-112 on Tuesday night.The seventh-seeded club did the same thing at second-seeded Memphis in the first round, wrestling away home-court advantage from the Grizzlies with a 128-112 triumph in the series opener. Davis had 22 points, 12 rebounds and seven blocks on that occasion.One thing Davis didn't do in Game 1 in the first round was play 44 minutes, which he did against the Warriors as a result of never leaving the court in the second half.Lakers coach Darvin Ham explained afterward the strategy stemmed from a regular season in which Davis played just 56 games and averaged just 34.0 minutes on those nights.\"This is what load management is about,\" Ham noted of the controversial topic. \"We have to manage their loads in the regular season in order to push time a little further during this time of year. Postseason, everything is at its peak. You've got to pare down your rotation and you got to push your big dogs. Your big dogs got to be there early and often.\"Davis made the most of his 44 minutes, accumulating 30 points, 23 rebounds, five assists and four blocks. The 38-year-old James was extended 40 minutes, chipping in with 22 points, 11 rebounds, four assists and three blocks.",
        "The Lakers finished with 10 blocks, effectively discouraging the smaller Warriors from attacking the hoop. Of the 106 shots the hosts took in the game, exactly half (53) were from beyond the 3-point arc.The Warriors made 21 of the 53 (39.6 percent), but rarely got to the free-throw line, going just 5-for-6. Meanwhile, the more aggressive Lakers were rewarded with 29 foul shots, making 25.While Warriors fans were chirping about the 29-6 disadvantage, Golden State coach Steve Kerr accepted it as a reality of the matchup.\"They are going to shoot more free throws than we are,\" Kerr admitted. \"I think they were No. 1 in the league and we were the last or next-to-last. So not a surprise. But that is a huge disparity and we need to bring that down.\"Fittingly, the game came down to a 3-pointer, an open 27-footer that Jordan Poole misfired with 9.7 seconds remaining and Golden State down three.Poole had been the Warriors' most accurate 3-point shooter in the game, making 6 of 10 attempts from deep before his critical miss. Stephen Curry (27 points) was 6-for-13, while Klay Thompson (25 points) was 6-for-16.It was similar to the late 3-pointer Andrew Wiggins missed in Game 1 in the first round against Sacramento, a game Golden State lost 126-123.",
        "The Warriors went on to lose Game 2 of that series on the road as well, before rebounding to take four of the last five to advance. They followed two of their three losses in that series with wins, much like they followed all six of their losses last postseason with victories en route to the NBA title.The Lakers didn't respond well on the road to wins in their first-round series, losing Game 2 in Memphis by 10 points and Game 5 in Memphis by 17.--Field Level Media"
    ]
}