{
    "articleURL": "/wires/reuters/article-12044229/Anxious-night-Guardiola-ends-City-march-on.html",
    "content": [
        "MANCHESTER, May 3 (Reuters) - In the end it was all smiles and back slapping as Manchester City walked off with a 3-0 win over West Ham United in which Erling Haaland became the highest scorer in a Premier League season having notched his 35th goal.",
        "The victory put City back on top of the Premier League table, one point above Arsenal who the previous night had thrown down the gauntlet by outclassing Chelsea.But it was not quite as simple as it appeared and manager Pep Guardiola wore a frown throughout a first half in which his side dominated, twice struck the woodwork but could find no way through West Ham's massed ranks.Anxiety was in the air even after Nathan Ake opened the scoring in the 49th minute but it evaporated when Haaland made it 2-0 in the 70th minute with his 51st goal in all competitions in his devastating maiden season in England.\"Every game is hard. We didn't play bad but our structure wasn't great. We didn't score in the beginning but we pushed on. I'm really pleased with five games left,\" Guardiola, whose side are glimpsing a Premier League-Champions League-FA Cup treble, said. \"This was one of our games in hand and we used it well.\"We tried different combinations down the left and down the right. People kept losing the ball and being anxious and we had to lose that anxiety.\"We dropped a little tonight but we managed to create some chances. It's another three points and we keep going.\"",
        "City looked a little leggy at times during a ninth successive league win and they must now re-group for Saturday's home clash with Leeds United before the first leg of their Champions League semi-final against Real Madrid.Leeds appointed the 68-year-old Sam Allardyce as interim manager on Wednesday after sacking Javi Gracia and the much-travelled coach immediately made headlines by saying he was in the same league as Guardiola and Liverpool's Juergen Klopp.Asked for his thoughts on Allardyce's claim, Guardiola was generous in his praise.\"He is right,\" the Spaniard said. \"It will be tough. He has the charisma and knows exactly what to do.\"Should City beat Leeds it will put them four points clear and within touching distance of a fifth title in six seasons. (Reporting by Martyn Herman Editing by Toby Davis)"
    ]
}