{
    "articleURL": "/femail/article-12041695/US-TikToker-claims-Britons-say-getting-Chinese-sounds-little-racist.html",
    "content": [
        "An American TikToker was baffled by why Brits say they're 'getting a Chinese' READ MORE: Blogger accuses cab driver of racism for asking where she's from An American TikToker sparked a debate on the English language when she asked why Britons say they're going to have 'a Chinese'.",
        "Influencer Soogia (@soogia1) - who has more than 1.7million followers on the app and creates content around her Korean-American heritage - questioned the UK's shorthand in a clip.She also admitted the phrasing felt 'a little' racist to her - although stressing she knows that it isn't.In a more recent follow-up video, Soogia explained that in the US putting 'a' in front of a nationality is often said to dehumanise a person from that background, which is why it 'gave her pause'.'It's like that prompt that's like \"tell me something that isn't racist but feels like it\",' she said in the viral clip from May 1, which has been viewed 2.5 million times. 'It feels like that!'",
        "She continued: 'I find it so strange that they all call it \"a Chinese\". Like here in the United States we call it \"Chinese food\" like we do all other foods...'So do British people also say I'm going out for a Greek or a Mexican or an Italian or is it exclusively when they talk about Chinese food? I find that so odd.'Soogia also questioned the selection of Chinese takeaway classics most Brits were piling up on their plates - including signature picks like chicken balls and curry sauce.She was also baffled by seeing chips in the selection, claiming she has never seen the side dish offered at Chinese eateries in the US. ",
        "The TikToker said she's more used to seeing other dishes considered Chinese cuisine staples in America, such as Mapo tofu, dumplings and bao buns - questioning why she didn't see any of those in the UK videos.However, she admitted it could just be what her algorithm is showing her.Tensions between TikTokers arose on both sides of the pond, as many were quick to criticise Soogia for 'reaching' and senselessly accusing British people of being offensive.Elsewhere, one British creator who filmed herself eating 'a Chinese' admitted she has since been inundated with 'horrible comments'.",
        "In a moment of social media diplomacy, 'born and raised British' creator Olivia Smith (@whalesandfairytales) sat down with her 'born and raised Chinese' boyfriend Derek (@derekjguo_) Guo to explain the situation. 'We think we have enough qualifications to speak about Chinese food in England,' Olivia said in reply to Soogia's video.'Outside looking in, her questions are valid but we can answer them.'The couple first addressed the confusion around whether calling the takeaway 'a Chinese' is offensive. 'They are not racist, they are just English people being lazy,' Derek joked.'It's short for \"I'm gonna have a Chinese for dinner\",' Olivia explained.",
        "'We just shorten it - and - to answer the question, would we do it with a Mexican, a Greek, an Italian - yes, 100%. That's just what we say.'",
        "The pair then stressed that Chinese takeaways in the UK are very different from Chinese restaurants - and don't necessarily reflect the nation's food selection across the whole country. Olivia said: 'All the food you see on your For You page where it's like chips, curry sauce... we personally don't like it - but they're from takeaways.'Chinese takeaways do sell Chinese food in England, but they also are normally the only takeaway in a big area so they have to cater for a lot of different people.' 'It's kind of like a comfort food,' she added. 'You order it when you're 10, you order it when you're hungover and you're 25 as well.'Derek also said that there is a great selection of other Chinese cuisine available in the UK. 'There are actually some good authentic Chinese food [restaurants] around city centres,' he explained.Olivia added: 'Location-wise and money-wise, Chinese takeaways are very popular in like the countryside and they're super, super cheap so it's very accessible.'In cities like where we live, there's actual proper Chinese restaurants because there's a.) Chinese people here who can give an authentic experience but b.) there's actually the money so that the Chinese food that you do get can be of Chinese quality.'UK food TikToker Lauren Griffiths (@laurenkategriffiths) also stressed that the phrase is never meant to cause offence, addressing the Americans who 'flooded' her account over the last few days.",
        "In a video the influencer, who recently made a video about getting 'a Chinese' says viewers from across the pond have been telling her that 'it sounds like we're talking about a person'.'I do just kind of want to clear it up because we are a lazy nation,' she continued. 'It is literally just us removing the word takeaway off the end so we would do it for all cuisines...'It's genuinely not meant offensively in any shape or form and I'm really sorry if it comes across that way... it's just British slang.'We would say the same for a \"full English\". Because I heard a lot of comments being like \"you wouldn't say a British\" but we say \"a full English\" instead of \"a full English breakfast\" or we say \"we're going for a chippy\" which is British.'I completely understand curiosity or not understanding... but over the past 24 hours it's kind of got to a little bit of like a different level, my page is being completely overwhelmed with horrible comments.'In her most recent video, Soogia stressed that she now understands that 'takeaway' works as a singular noun in the UK, and hence makes sense. The influencer then revealed that she herself has also been inundated with racial slurs and comments from trolls following the dilemma. ",
        "She also reiterated that she never called the British creators on her page racist, and insisted that her video did everything in its power not to spread hate regarding her question. "
    ]
}