{
    "articleURL": "/femail/article-12054171/Lip-reader-reveals-King-Charles-Queen-Camilla-said-historic-coronation.html",
    "content": [
        "Follow our live blog for all the latest updates on the King's CoronationCamilla was crowned in Westminster Abbey and acknowledged as The QueenThe Coronation of King Charles will go down in history so it's no wonder the monarch had a few nerves about today's ceremony running smoothly, especially when it came to being on time. ",
        "A lip reader has revealed to FEMAIL what King Charles, 74, and Queen Camilla, 75, were chatting about when they had brief moments to talk to one another at the lavish event at Westminster Abbey in London today. The couple were first spotted leaving Buckingham Palace for the occasion in the Diamond Jubilee Coach, built to commemorate the 60th anniversary of the reign of Queen Elizabeth II in 2012.'Oh look at that,' the monarch appeared to say to his wife as he remarked about the rainy weather. He then pointed to the adoring crowds waving at them on their journey and said: 'Wonderful... marvellous.'The Queen then noted the amount of flags decorating the roads thanks to royal fans, saying: 'It's super, amazing.' ",
        "'It looks wonderful,' added the King as they passed near Trafalgar Square. 'So beautiful,' echoed the Queen.When entering Westminster Abbey, Charles and Camilla largely remained silent - apart from a few brief exchanges. One of those moments came as the Queen asked 'Can you help?' to a man on her right, while tugging on her cloak. 'Thank you,' she added afterwards.   The King was then told to 'go in now' but seemingly wanted to check before doing so, replying: 'Wait here? Now?' Elsewhere, the monarch appeared to admit he was 'worried about the time' following a wait inside the carriage, saying: 'I mean it's been longer this time.'",
        "Charles became the 40th reigning sovereign to be crowned at Westminster Abbey, in a ceremony dating back to William the Conqueror in 1066, when Archbishop of Canterbury Justin Welby placed St Edward's Crown on his head.The King looked emotional as Prince William paid homage to him, in a break with tradition, kneeling to give an oath of allegiance to his father. He said: 'I, William, Prince of Wales, pledge my loyalty to you and faith and truth I will bear unto you, as your liege man of life and limb. So help me God.' ",
        "He then stood, touched the crown and kissed the King on the cheek. Charles was moved as he nodded to his son, and said 'amen' and 'thank you William'.As he was leaving following the ceremony, the King said: 'Thank you very much,' and 'It's been wonderful,' to the guests he passed, according to the lip reader.  The Queen was crowned with Queen Mary’s Crown by the Archbishop of Canterbury in Westminster Abbey, as Buckingham Palace officially confirmed her title.Archbishop of Canterbury Justin Welby placed the 112-year-old crown on Queen Camilla's head following the crowning of her husband. As he did so, he recited an open prayer: 'May thy servant Camilla, who wears this crown, be filled by thine abundant grace and with all princely virtues.",
        "'Reign in her heart, oh king of love. That being certain of thy protection, she may be crowned with thy gracious favour. Through Jesus Christ our Lord.'The Queen was then handed the royal sceptre as the archbishop completed his proclamation.The monarch and his wife smiled to the congregation as they walked through the church for a Christian ceremony that dates back 1,000 years on a day dripping with glorious displays of pageantry.",
        "After she was crowned, Buckingham Palace updated Camilla's biography on its website, with her new title 'The Queen'.Before she died, the late Queen Elizabeth II had suggested Camilla would be known as Queen Consort - paving the way for the title.As Charles' wife, Camilla automatically became Queen when her husband acceded to the throne on September 8 last year, upon the death of his mother - but many speculated whether she would use the titleThe Queen's pages of honour all came from her family. They include her grandsons Gus and Louis Lopes, 13, and Freddy Parker Bowles, 13. Her great-nephew, Arthur Elliot, 10, was her fourth page.The historic crowning, watched around the globe, was a fulfilment of the King's destiny, but followed the death of his mother, Queen Elizabeth II, last September after a 70-year reign. Minutes later Camilla was crowned.",
        "The monarch had been heir to the throne since the age of three, and was ready to finally embrace his day of destiny with the woman he loves by his side. As Andrew Lloyd-Webber's coronation anthem was sung, the Queen was officially enthroned. The enthroning of the Queen was a moment in which Charles and Camilla were 'united in their joint vocation before God'.The Queen's role in the coronation represents a remarkable turnaround in public acceptance few would have thought possible some years ago.",
        "When Charles' divorced first wife, the popular, glamorous Princess Diana, died in a car crash in Paris in 1997, Camilla bore the brunt of media hostility. Some declared the couple could never wed.But marry they did eight years later, and since then she has come to be recognised, albeit still grudgingly by some, as a key member of the royal family, as someone on whom the new king heavily relies, and as the nation's Queen Camilla.'She is his sort of soul mate,' said Robert Hardman, a long-time royal correspondent and author of 'Queen of our Times', pointing out she had been married to Charles longer than Diana.'They're a team. And you've got to be a team.'Born Camilla Shand in 1947 into an affluent family - her father was an army major and wine merchant who married an aristocrat - she moved in social circles that brought her into contact with Charles, who she met on a windswept polo field in the early 1970s.",
        "The pair dated for a time and Charles had contemplated marriage, but felt too young to take such a major step.As he dedicated himself to his naval career, Camilla went on to marry a cavalry officer, Brigadier Andrew Parker Bowles. The couple had two children, Tom and Laura. They divorced in 1995.Charles himself married 20-year-old Diana in a wedding in 1981 that enchanted not just Britain but the world. After having two children, William and Harry, the relationship turned sour and they divorced in 1996 after he rekindled his romance with his former lover.The depth of that relationship was exposed to a shocked public in 1993 when a transcript of a secretly recorded private conversation with hugely intimate details was published in newspapers.'I'd suffer anything for you. That's love. That's the strength of love,' Camilla told Charles in the secretly recorded telephone conversation publicised in 1993.In a TV interview the following year, Charles admitted he had resumed their affair, but said it was only after his marriage had irretrievably broken down.'There were three of us in this marriage - so it was a bit crowded,' Diana, who dubbed Camilla 'the Rottweiler', famously remarked in her own TV interview in 1995.While Diana brought glamour to the stuffy House of Windsor with her glittering gowns, many Britons could not understand why Charles would prefer the country-loving Camilla, usually pictured wearing a scarf and green waterproof riding coat.",
        "'I cannot imagine anyone in their right mind leaving you for Camilla,' Prince Philip, Charles' father and the late Queen Elizabeth's husband, said in a letter to Diana.Amid a public outpouring of grief and anger after Diana's death, Camilla was singled out for harsh criticism. But in subsequent years, royal aides, tasked with rebuilding the tarnished reputation of the royal family as a whole, also slowly began to integrate Camilla into a more public role.From being able to appear in public together, to marriage and last year's approval from Queen Elizabeth to Camilla taking the title Queen Consort, their success is complete.Public relations experts say it was the result of much hard and careful work, although aides said it was mainly due to Camilla's own personality and great sense of humour. 'She is resilient, she was brought up with this extraordinary sense of duty where you got on with it, don't whinge, put your best face on and keep going, and it has stood her in very good stead,' Fiona Shelburne, the Marchioness of Lansdowne, a close confidante of Camilla, now 75, told the Sunday Times last month.However, her rehabilitation has come at a cost. In his memoir, Charles's younger son Prince Harry accused his step mother of leaking stories about him to the press to enhance her own reputation, and that he and his brother had asked their father not to marry her.",
        "Before his crowning moment the King was anointed with holy oil away from public view. He was dressed in a white linen garment called Colobium Sindonis, a golden coat called the Supertunica and has had the coronation girdle placed around his waist.After being sanctified at his anointing, the King was presented with the coronation regalia. Minutes earlier Charles swore on the Bible and kissed it, having taken the oath: 'I, Charles, do solemnly and sincerely in the presence of God profess, testify, and declare that I am a faithful Protestant, and that I will, according to the true intent of the enactments which secure the Protestant succession to the throne, uphold and maintain the said enactments to the best of my powers according to law.'His family were sat closest to him in a 2,300-strong congregation, although Prince Harry was sat in the third row, away from Prince William, his wife and children, and other working royals. In it Charles became the first monarch to pray publicly at a coronation - praying for grace to be 'a blessing to all... of every faith and belief', and to serve after the pattern of Christ.A special personal prayer was written for the King to reflect the 'loving service' theme of the service, and the words were inspired in part by the popular hymn I Vow To Thee My Country.He said: 'God of compassion and mercy whose son was sent not to be served but to serve, give grace that I may find in thy service perfect freedom and in that freedom knowledge of thy truth. Grant that I may be a blessing to all thy children, of every faith and belief, that together we may discover the ways of gentleness and be led into the paths of peace; through Jesus Christ our lord. Amen.'Prime Minister Rishi Sunak read The Epistle - Colossians 1: 9-17 to the congregation.Lambeth Palace said that although Mr Sunak is a Hindu, he is reading as Prime Minister so there is no issue over his personal faith during the Anglican service.",
        "Prince George and the other pages of honour were sitting behind the King in Westminster Abbey as Charles swore the coronation Oath.George's gaze could be seen flitting about the church from his seat behind his grandfather.The prince and his fellow pages then stood behind the kneeling Charles, holding the corners of his trailing robe, as he prayed.The King then signed copies of the Oaths, presented by the Lord Chamberlain, while the choir sang.At the beginning of the coronation service, a Welsh language piece was sung with the choir, together with Sir Bryn Terfel, singing Kyrie Eleison.As the bells of Westminster Abbey rang out, the King and Queen left the carriage. Camilla got out first followed by Charles after a short pause outside the church.The King waved and spoke to his grandson Prince George, a future king, who was among the pages of honour. His parents the Prince and Princess of Wales entered the abbey last before the royal couple arrived.As he arrived for the two-hour service, the Abbey's bells peeled as crowds stood in the rain cheering the arrival of the King and his wife. The entered the Abbey to state trumpeters, with the congregation standing as the royal couple entered.",
        "Prince George was carrying a corner of his grandfather, the King's, trailing robes as the royal party made its way into Westminster Abbey.His siblings Princess Charlotte and Prince Louis were earlier seen peering out of a car window as they arrived outside the church.As his father was cheered through the capital, royals including Prince Harry arrived at the service. The Duke of Sussex walked up the aisle alone, smiling at people as he walked to the front of the church. He grinned at people in the congregation before he took his seat.Stars in the Abbey included Katy Perry, Lionel Richie, Sir Andrew Lloyd Webber, Stephen Fry, Nick Cave and magician Dynamo, while Dame Emma Thompson gave a thumbs up in excitement. First lady Jill Biden was among the last to enter before the service, sitting with First Lady of Ukraine Olena Zelenska. President Joe Biden has stayed at home. The Diamond Jubilee State Coach, drawn by six Windsor grey horses, arrived at Buckingham Palace for the King and Queen at 10am. Members of the Mounted Division of the Household Cavalry have lined up at the entrance to The Mall ahead of the King's Procession to Westminster Abbey.A mile away from the Palace, Westminster Abbey was rammed with the great and good from Britain and around the world as Charles III's day of destiny finally arrived and he will be crowned King today.More than 100million people around the world are about to watch the historic first coronation of a British monarch in 70 years - with an estimated 2million people on the streets of London to watch history unfold. ",
        "Charles and Camilla waved to thousands of spectators lining the street as leading figures began to join members of the congregation in Westminster Abbey.The Prince and Princess of Wales chatted to each other as they waited to walk into the abbey, behind their eldest son Prince George who was one of the King's pages of honour.The couple appeared composed as they walked behind William's father, followed by their daughter Princess Charlotte and their younger son, Prince Louis.Well-wishers near Buckingham Palace were not put off by the rain as the Diamond Jubilee State Coach passed down the Mall.A group of royal fans dressed in Union Jacks sang 'Singing in the Rain' while the service at Westminster Abbey appeared on large screens.Songs from the service were played out over the crowds.People put picnic blankets on the wet floor and sat on steps as they watched cannons being carried along the Mall.The list of 2,300 invited guests reads like a who's who of politics, showbusiness, world leaders and foreign royalty, with a sprinkling of everyday heroes and close family and friends of the King and his wife.French President Emmanuel Macron was attending to show his 'friendship, respect and esteem' for the UK, with US singer-songwriter Lionel Richie, The Repair Shop's Jay Blades, and the Prince and Princess of Wales and their children."
    ]
}