{
    "articleURL": "/wires/pa/article-12038053/Donald-Trump-plays-golf-Turnberry-course-Scottish-visit.html",
    "content": [
        "Former US president Donald Trump enjoyed a round of golf at his Turnberry golf resort in South Ayrshire on the second day of his visit to Scotland.",
        "Mr Trump took the wheel of a golf buggy as he travelled around the resort on Tuesday afternoon.Earlier in the day, Trump Turnberry staff lined the steps and waved hats which said “we make Turnberry great again” as they greeted Mr Trump on his arrival.",
        "Wearing a red baseball cap emblazoned with the words “Make America Great Again”, Mr Trump shook hands and chatted with some of those waiting to welcome him.Mr Trump took a golf caddy around the course before stopping on the third green to ask a waiting crowd for their thoughts on his shot.The former president steered a golf caddy over to waiting media before stopping to engage with the waiting crowd.",
        "After taking a swing, Mr Trump turned to journalists and locals and asked: “That looked good, right? The swing looked good, everything perfect.”But he joked: “Just don’t follow the ball.”He even stopped to retake a shot to allow waiting photographers to get their perfect shot.After which he turned and said: “That’s on the green, thank you very much. Are you surprised to see that kind of power? I think so.”",
        "The former US head-of-state arrived in Scotland on Monday, landing at Aberdeen airport before travelling to his Menie Estate golf course near Aberdeen.",
        "On Monday, Mr Trump attended a ceremony to break ground for a second course at the resort, to be named the MacLeod course – dedicated to his late mother, Mary Anne MacLeod.She was born on Lewis in the Western Isles before emigrating to the US.Following his time in Scotland, he will head to his golf course at Doonbeg, Co Clare, on Ireland’s west coast.The tycoon’s trip to Scotland comes as he faces legal trouble in his native New York over his business practices.",
        "He has pleaded not guilty to charges of falsifying business records to hide damaging information ahead of the 2016 presidential election.Mr Trump spent two days at his Turnberry course while in office in 2018, meeting Theresa May and the Queen during his stay."
    ]
}