{
    "articleURL": "/sport/football/article-12052373/Martin-Tyler-no-plans-follow-footsteps-Stelling-Souness-quitting-Sky.html",
    "content": [
        "Tyler, 77, has been a commentator at Sky for over 30 years and wants to carry onHe commentated on three live games in the last week in the space of four daysStelling and Souness left the broadcaster in the last week after lengthy stays Sky's veteran commentator Martin Tyler has no intention of following Jeff Stelling and top pundit Graeme Souness, who announced his departure last weekend. ",
        "Tyler, 77, demonstrated his remarkable work ethic by commentating on three live Premier League games in the space of four days for Sky this week and is determined to carry on next season.Stelling and Souness both quit their roles in the last week, with neither man retiring but stepping away from working with the broadcaster.Tyler, however, is determined to stay on for as long as he can as he continues to build his legacy as one of the company's greatest ever commentators.He has been with Sky as for over 30 years and is prepared to enter another year with the microphone when the new season starts this summer.",
        "Sky Sports, meanwhile, are planning on making an internal appointment to replace Jeff Stelling as host of Soccer Saturday next season after the veteran presenter announced his departure on last weekend’s programme.Sky are in the midst of a major cost-cutting exercise after losing nine per cent of their UK subscribers last year, with a number of their football reporters facing redundancy, and a big-money recruit from outside the organisation is viewed as inappropriate in the circumstances.Match of the Day 2 host Mark Chapman was approached by Sky to front Soccer Saturday when Stelling considered stepping down last year, but existing staff members Jules Warren and Adam Smith are now viewed as the front-runners.",
        "'I've been at Sky for more than 30 years and loved every moment of my time as part of the Soccer Saturday team,' Stelling told Sky Sports as he announced his departure."
    ]
}