{
    "articleURL": "/wires/reuters/article-12053061/Fox-asks-Dominion-Voting-probe-leaks-Tucker-Carlson-messages.html",
    "content": [
        "By Jack Queen",
        "May 5 (Reuters) - Fox News on Friday asked lawyers for Dominion Voting Systems to investigate whether they leaked controversial internal messages from ousted Fox host Tucker Carlson that were provided in evidence for their recent defamation lawsuit.The requests, which were made in letters released by Fox, came after multiple news outlets published racist and sexist remarks by Carlson contained in leaked internal messages and recordings.Fox News and its parent company Fox Corp said those were given to Dominion as part of the lawsuit, which claimed Fox defamed Dominion by airing false election-rigging claims. The material was to remain confidential per court orders and the terms of the network's $787.5 million settlement with the Denver-based voting technology company last month.Fox requested that Dominion's lawyers at Farnan LLP \"immediately make an investigation into the circumstances surrounding this inexcusable release of confidential discovery material\" and report the findings by the end of Monday.Dominion denied the materials came from the company or any of its lawyers. \"Nobody associated with Dominion shared these confidential materials with the press,\" the company said.In a separate letter to Dominion lawyers at Susman Godfrey LLP and Clare Locke LLP, Fox said the disclosures \"violate the text and spirit\" of the settlement agreement, which \"requires return or destruction\" of all confidential discovery materials.",
        "Fox is seeking to contain the public relations fallout from the leaks. The network on Friday sent a letter to the left-leaning watchdog group Media Matters demanding that it cease publishing leaked footage of Carlson on set.Media Matters President Angelo Carusone said in a statement that \"reporting on newsworthy leaked material is a cornerstone of journalism\" and that it was \"absurd\" for Fox to argue otherwise.Dominion alleged in its lawsuit that Fox knowingly spread false claims that its ballot-counting machines were used to rig the 2020 U.S. election against former Republican President Donald Trump and in favor of Joe Biden, a Democrat.Fox denied the claims but settled the case in Delaware Superior Court. The deal came just before opening statements were set to begin in what promised to be the most closely watched media trial in decades, featuring testimony from Fox Corp chairman Rupert Murdoch.Carlson, a staple of primetime cable news and Fox's biggest star, was abruptly fired just days later. Media outlets including the New York Times reported that the decision came after Fox's board saw Carlson's internal messages.The Times reported on Tuesday that Fox was particularly concerned by a Carlson message - which was redacted in public versions of court filings - in which he criticized Trump supporters for beating up an outnumbered leftist demonstrator because that was \"not how white men fight.\"",
        "The Daily Beast reported on Friday on a text message in which Carlson used a misogynistic slur, the second publicly reported instance of him doing so. (Reporting by Jack Queen in New York; Additional reporting by Helen Coster; Editing by Cynthia Osterman)"
    ]
}