{
    "articleURL": "/wires/afp/article-12044883/Chinas-elders-savour-twilight-years-young-toil.html",
    "content": [
        "At the end of a back alley surrounded by dilapidated buildings, the pitter-patter of ping-pong balls echoes around a cavernous warehouse in a Chinese town north of Shanghai.",
        "The members of this table tennis club in Rudong, a sleepy seaside county with one of the highest proportions of elderly residents in China, gather to exercise and catch up.Rudong once played a pioneering role in the rollout of Beijing's one-child policy. Now, a school lies abandoned and overgrown with vines, while one local university offers courses to retirees.China has officially been overtaken by India as the world's most populous nation, with Beijing recently announcing the population had shrunk last year for the first time in over six decades.\"If elderly people come here and play ping-pong, they feel it's good for them, then they stop playing cards,\" said Fu, a 56-year-old Rudong woman who opened the club in 2011.Fu's one son has moved out of Rudong to find work in a city -- a common tale in recent decades as China transitioned away from central planning in favour of a market-driven economy.\"He's had a kid there,\" Fu said, but when asked if the couple were considering having another child, she said it was unlikely.\"The burden these days is too much.\"Zhu, a club member in his sixties now retired from a career at China Telecom, told AFP the job market was incredibly challenging for China's youth.",
        "\"It's unlike our generation. In those days, we had assigned labour,\" said Zhu. \"Not like today, when people have to rely on themselves to find work.\"- Back to school -AFP found a community grappling with the reality of a shrinking population, offering a stark glimpse of the demographic pressures facing the country as a whole.",
        "The problem is especially pronounced in places such as Rudong, about 100 kilometres (60 miles) from Shanghai, where a surge in the elderly population is coinciding with an exodus of younger people.The last census, published in May 2021, showed nearly 39 percent of people in the area were over the age of 60 -- more than double the national figure of 18.7.The overall population was 880,006 -- down 115,977 from the previous count.China's ruling Communist Party introduced birth control policies in the late 1970s amid concerns over the potential consequences of unbridled population growth as the country emerged from the tumultuous rule of Mao Zedong.While the one-child policy was relaxed in 2016, its impacts are still clearly felt -- last year, China's fertility rate fell to one of the lowest levels in the world at 1.2 births per woman.- 'Life is rich' -The ageing population is piling pressure on younger Chinese forced to take care of elderly family members, as well as the country's welfare system.",
        "It is common in China for older people to move into the homes of young relatives, but some elderly Rudong residents told AFP they maintain their health to alleviate pressure on their children.\"As long as we're healthy, the stress on our kids is less,\" said 67-year-old Wang Jianhua, clutching a wooden mallet for gateball, a game inspired by croquet.\"So participating in these activities is for ourselves, but it's also for them.\"For many elderly Chinese, retirement is better than it has been for generations following decades of economic growth.Walking her bike out of the front gate of a local university and chatting with a classmate, 74-year-old Ping told AFP she was banished to the countryside for five years to learn from rural workers during Mao's Cultural Revolution in the 1960s.\"Because of the Cultural Revolution, we didn't attend school,\" she said.But she now takes classes in literature and traditional Chinese opera.\"We're having fun and studying at the same time,\" said Ping.\"Life is still quite rich.\""
    ]
}