{
    "articleURL": "/femail/article-12045787/My-husband-wants-son-Star-Wars-character.html",
    "content": [
        "A woman asked people's advice on whether to name her child after Darth VaderShe explained on Reddit that they liked the name Anakin but is not Star Wars buffRead More: These are the baby names that are in danger of extinctionA woman asked people's advice on whether to name her second born after Darth Vader in a resurfaced online post.",
        "The anonymous women, believed to be from the UK, took to Reddit to explain that she and her husband named their first born Rowan after the riders in Lord of The Rings.However she admitted they were 'torn' about naming their child Anakin after the villain in Star Wars, despite both liking the name. She explained that it's the connection to the film's villain that bothers her because she 'isn't a huge Star Wars buff.'     The post read: 'Halp! My husband wants to name our baby Anakin. Yup. So we just found out we're expecting again and although we have a girls name picked out, we are torn on boys names. ",
        "'We named our older son Rowan (It was inspired by the riders of Rohan on LOTR) because we wanted something a little less common without being totally unheard of. Which brings us to our current conundrum. 'I really like the name Maxwell although I'm slightly worried it, and other 'Max' variations, are getting too popular. My husband LOVES the name Anakin. I don't mind the name itself, it's what it's connected to that bothers me. 'I feel like our poor kid would go through his whole life hearing how he is named after Darth Vader. 'We aren't even huge Star Wars buffs, but my hubs uses the excuse that we weren't die hard LOTR fans and we named our first after that. He just really likes the sound of the name. I don't know what to do here. Do you namers have any suggestions? ",
        "She later added: 'Thank you all for your advice. So it seems that the general consensus is no matter how much he may like the name it's a bad idea due to the exclusive connection to Star Wars. ",
        "'I'll read some of your responses to him and hopefully we can come up with a better name that we both like... One that won't scar him for life!'Many rushed to the comments to leave their own thoughts on the name, with one person saying it's like calling a baby girl Oprah.One person said: 'The thing is, regardless of how big of fans you are or aren't of either series, Anakin is MUCH more recognizable than Rowan. Rowan isn't going to be asked, \"You mean like from Lord of the Rings?!\" his whole life. Anakin definitely will.'I agree with your husband that it's a great name, but it's like naming a girl Oprah. 'That name already belongs to someone and now nobody can have it... unless their parents don't mind being seen as weirdo superfans and their kids being bugged about it for all eternity.'Mildly related, I know of someone that named their son Hanson Solomon... aka Han Solo. It's embroidered on all his c**p, haha. I actually think that's still better than Anakin since the kid can choose to get away from it when he's older if he wants to.'",
        "Another wrote: 'My name is Annakah (pronounced phonetically-- anna+kuh) and even with a version like that, I hear almost every day at my retail job \"oh, like Star Wars?\" Or a lame joke about the force.",
        "'My advice? Skip the name. Other compromise names like mine will just end in the same references/jokes, unless Star Wars all of a sudden loses it's popularity, which i doubt will happen. Good luck!'Someone else said: 'Anakin, a boy nick named \"Ani\"? Don't do it. I'm a massive Star Wars fan and I think it's a terrible named for a kid.'What about Luke instead, not super common yet still Star Wars related.'While a fourth wrote: 'My 9 year old cousin is named Anakin and I still think it's terrible. His nickname is Annie and I don't like that either. 'That said he is a thriving smart little boy with lots of friends and his name hasn't held him back at all. If you both don't agree with the name you shouldn't use it regardless. I would be a little embarrassed to tell people I named my kid Anakin but to each their own!'"
    ]
}