{
    "articleURL": "/wires/reuters/article-12045903/CEE-MARKETS-Crown-stronger-hawkish-central-bank-message.html",
    "content": [
        "BUDAPEST, May 4 (Reuters) - The Czech crown edged higher on Thursday, hanging around 1% off the 15-year-highs touched last month, as gains continued after the Czech National Bank (CNB) surprised markets with more policymakers in favour of a rate hike. On Wednesday, the CNB came close to raising interest rates, with a slim majority backing continued policy stability while keeping an eye on inflation risks from loose fiscal policy and tight labour markets. At 0812 GMT, the crown traded at 23.488 versus the euro, 0.1% firmer on the day and 0.3% stronger than levels before Wednesday's central bank rate decision, a welcome development for the CNB as it aims to control imported inflation pressures. Short-term rates are pricing in small chances of a June interest rate hike, although forward rate agreements still expect up to 50 basis points in cuts this year. \"For the first time since August last year, there was more than one vote for an interest rate hike and the governor said there is a possibility that the CNB will hike rates at its June meeting,\" economists at ING wrote in a note. \"With two new inflation numbers in hand by then, which should show a big downward slide, we do not think a rate hike will happen. However, the CNB will remain the most hawkish central bank in the region.\" Governor Ales Michl said fiscal policy was a main concern for price pressures, calling for a \"credible\" budget-cutting package, which the government is currently preparing. His remarks earned a reply from Prime Minister Petr Fiala, who said inflation was under the remit of the bank. \"We still think that the main scenario is that the CNB will leave interest rates unchanged for most of the year,\" J&amp;amp;T Banka said. \"If any of the risks (from wages or the budget) materialises, there could be a hike in June.\" The Polish zloty was steady in morning trade ahead of the European Central Bank's meeting, where policy makers are expected to further increase borrowing costs. \"In recent days, expectations regarding a possible move by the ECB have been limited (from 50 bps to 25 bps). In our opinion, the key will be the rhetoric defining the prospects for further increases in the cost of money in the euro zone,\" Bank Millennium wrote in a note. CEE SNAPSHO AT MARKETS T 1012 CET CURRENC IES Latest Previou Daily Change s bid close change in 2023 EURCZK Czech &amp;lt;EURCZK 23.4880 23.5150 +0.11% +2.85% = crown =&gt; EURHUF Hungary &amp;lt;EURHUF 374.100 374.800 +0.19% +6.77% = forint =&gt; 0 0 EURPLN Polish &amp;lt;EURPLN 4.5900 4.5875 -0.05% +2.17% = zloty =&gt; EURRON Romanian &amp;lt;EURRON 4.9270 4.9290 +0.04% +0.31% = leu =&gt; EURRSD Serbian &amp;lt;EURRSD 117.200 117.270 +0.06% +0.09% = dinar =&gt; 0 0 Note: calculated from 1800 daily CET change Latest Previou Daily Change s close change in 2023 .PX Prague 1388.28 1382.86 +0.39% +15.52 00 % .BUX Budapest 46641.7 46518.2 +0.27% +6.50% 4 4 .WIG20 Warsaw &amp;lt;.WIG20 1926.72 1919.24 +0.39% +7.52% &gt; .BETI Buchares 12202.9 12247.8 -0.37% +4.63% t 7 6 .SBITO Ljubljan &amp;lt;.SBITO 1233.65 1225.42 +0.67% +17.62 P a P&gt; % .CRBEX Zagreb &amp;lt;.CRBEX 2246.76 2246.57 +0.01% +755.0 &gt; 3% .BELEX Belgrade &amp;lt;.BELEX 904.15 905.38 -0.14% +9.65% 15 15&gt; .SOFIX Sofia &amp;lt;.SOFIX 611.44 611.81 -0.06% +1.65% &gt; Yield Yield Spread Daily (bid) change vs Bund change in Czech spread Republic CZ2YT= 2-year &amp;lt;CZ2YT= 5.8160 -0.3270 +316bp -30bps RR RR&gt; s CZ5YT= 5-year &amp;lt;CZ5YT= 5.0370 -0.0190 +280bp -1bps RR RR&gt; s CZ10YT &amp;lt;CZ10YT 4.5560 -0.0820 +230bp -9bps =RR 10-year =RR&gt; s Poland PL2YT= 2-year &amp;lt;PL2YT= 5.8490 -0.0430 +319bp -2bps RR RR&gt; s PL5YT= 5-year &amp;lt;PL5YT= 5.8410 0.0050 +360bp +1bps RR RR&gt; s PL10YT &amp;lt;PL10YT 5.8590 0.0410 +360bp +3bps =RR 10-year =RR&gt; s FORWARD 3x6 6x9 9x12 3M interba nk Czech &amp;lt;CZKFRA 7.26 6.93 6.38 7.17 Rep &gt;&amp;lt;PRIBO R=&gt; Hungary &amp;lt;HUFFRA 14.41 12.64 11.28 16.22 &gt;&amp;lt;BUBOR =&gt; Poland &amp;lt;PLNFRA 6.78 6.48 6.07 6.90 &gt;&amp;lt;WIBOR =&gt; Note: are for ask FRA prices quotes ******************************************** ****************** (Reporting by Jason Hovet and Pawel Florkiewicz Writing by Gergely Szakacs Editing by Krishna Chandra Eluri)"
    ]
}