{
    "articleURL": "/femail/article-12059497/Man-reveals-life-changing-relationship-advice-left-TEARS.html",
    "content": [
        "Jake Sutton has shared the touching relationship advice a coworker gave him The Texas native said that he and wife Angelica were in an argument for days His coworker said life was precious and shouldn't be taken for granted A man has revealed the heartwarming relationship advice he received while in an argument with his wife that brought him to tears and reminded him to never take a moment for granted, despite the hard times.  ",
        "Jake Sutton took to TikTok to share the wise words that his unnamed colleague gave him while he was fighting with his spouse, Angelica, that changed his entire outlook. In a viral video, which amassed more than 11.9 million views, the Texas native shared that he and his wife had been struggling since the birth of their two-month-old baby, who has colic - a condition where a newborn has the inability to self-soothe and cries for a prolonged period of time, despite being healthy and cared for. The baby's crying spells have caused tension between the lovebirds, prompting them to have a big argument that lasted for days. ",
        "However, when Jake shared his frustrations with his coworker, he was reminded how precious life is.When Jake said he would attempt to resolve things between him and his wife when he 'got home' that day, the anonymous teammate nudged him to amend things the right away.He explained that the 'biggest assumption that we take for granted is that we are going to make it back home whenever we leave for work in the morning,' adding that he should never forget how precious life is. The advice brought the dad-of-two to tears as he shared the 'vulnerable' story with his more than 82,000 followers. ",
        "'So I'm going to be really vulnerable here for a second, but I really think that this is something that everybody needs to hear,' he said at the beginning of the clip. Before detailing the struggles he and Angelica were facing, he revealed that the guidance 'this guy at work' shared really 'f***ed' him up. 'Me and my wife just had a new baby, she's two months old, and she has been so hard. Our first daughter wasn't this hard, she was an easy baby,' the dad added.'My [new] daughter is colicky and so anybody that has had a colicky baby knows that they will just cry for hours on end, they can be fed, changed, loved, comfortable, they are just work 24 hours a day. 'And she doesn't want to sleep regularly, she doesn't want to be put down, she's just work all the time.'",
        "Jake then said that this led to tension in his marriage. He added: 'And it has completely changed the dynamic of our household. I mean how things run in the morning, when I get home, me and my wife's intimacy, our time together that we get to spend, all of it is changed.' Jake noted that it had driven a 'wedge' between the two of them, causing them to have a big argument that bled over to the next day. ",
        "After their fight, Jake - who is usually 'chipper and fun' - was not his usual self at work. His coworker noticed the difference in behavior and asked if he was okay. Jake shared his feeling about his fight with Angelica with his colleague. Jake said he would sort out the argument whenever he gets 'home' today. The unnamed teammate responded: 'Who told you that you were going to make it home? 'Look, I'm not a relationship counselor and am the last person to tell someone what to do, but the biggest assumption that we take for granted is that we are going to make it back home whenever we leave for work in the morning.'You need to call your wife.' Jake broke down in tears before adding that he was now going to ring his spouse. In a follow-up video, the dad-of-two revealed that he and Angelica had resolved things and were even able to spend some time to themselves while Jake's parents took care of the children. ",
        "He added that they were doing 'much better.' Viewers flocked to the comments section to gush over the touching words. 'Wow. He is exactly right. We don't know if we will make it home,' one person wrote. Another added: 'Thank you for sharing. It takes courage but we all need this reminder. The early days are so hard, especially with a difficult baby. Lots of love.' ",
        "One user said: 'I was not expecting the ending but I'm crying so bad omg.' 'That was excellent advice. My 40-year-old son went to work in 2020 and never made it back home,' another person shared. Someone else wrote: 'I needed to hear this. Thanks for being vulnerable man.' "
    ]
}