{
    "articleURL": "/wires/reuters/article-12046277/Moving-Shell-head-office-not-priority-CEO-says.html",
    "content": [
        "By Ron Bousso",
        "LONDON, May 4 (Reuters) - Relocating Shell's headquarters from London is not on Chief Executive Wael Sawan's priority list, he said on Thursday, as he focuses on narrowing the energy giant's share performance gap with U.S. rivals.Shares of Europe's top energy companies including Shell, BP and France's TotalEnergies have underperformed U.S. rivals Exxon Mobil and Chevron over the past year, even as the companies posting record profits in the wake of a surge in energy prices.The valuation gap has raised speculation that European energy companies could relocate to the United States, where they could benefit from larger liquidity in the stock exchange, or even be an acquisition target.\"This is not on my priority list at the moment, we've just recently moved to the UK,\" Sawan told reporters in response to a question about relocating Shell's head office.\"We're focused on making sure that we actually unlock the significant undervaluation through multiple levers which are directly under our control,\" said Sawan, who took office in January with a vow to improve Shell's performance.Shell reported on Thursday a $10 billion profit in the first three months of the year, driven by strong earnings from fuel trading and higher liquefied natural gas (LNG) sales.\"It was only in 2019 when Shell and Exxon were neck and neck from a valuation perspective ... What we have seen over the past few years is that gulf between the U.S. and Europeans grow,\" Sawan said.",
        "\"We are acting with urgency and good faith to make sure that we continue to high-grade the performance of the company.\" he said.Shell relocated its headquarters to London from the Hague last year after it abolished its dual-listing in the Netherlands.In the run-up to the decision, Shell's board also weighed moving to other locations including New York, Singapore and Switzerland, although those alternatives were discounted at an early stage, company sources told Reuters.The share valuation gap could be explained by the European companies making larger investments than their U.S. peers in renewables and low-carbon energy, which are today significantly less profitable than oil and gas, according to Jefferies analyst Giacomo Romeo.A larger community of climate-focused investors in Europe could further explain the gap with U.S. rivals, he added.\"Since the COVID-19 pandemic, the valuation delta between the two groups has consistently been larger than in the last 20 years,\" Romeo said in a note.(Reporting by Ron Bousso Editing by Mark Potter)"
    ]
}