{
    "articleURL": "/wires/pa/article-12056197/Tottenham-launch-investigation-alleged-racist-abuse-Son-Heung-min.html",
    "content": [
        "Crystal Palace have promised to issue a club ban to a spectator alleged to have racially abused Tottenham forward Son Heung-min during Saturday’s match.",
        "Footage has circulated on social media of a man in the away end at Tottenham Hotspur Stadium allegedly making a racist gesture towards Son.The incident occurred in the 89th minute of Spurs’ 1-0 win when South Korea captain Son was replaced by substitute Arnaut Danjuma but had to walk around the outside of the pitch and past the Palace travelling support.A Palace statement said: “We are aware of a video circulating online (as well as reports made directly to us) regarding an individual in the away end at Spurs yesterday, appearing to make racist gestures towards Heung-min Son.“Evidence has been shared with the police, and when he is identified, he will face a club ban. We will not tolerate such behaviour in our club.”A Tottenham statement read: “We are aware of an allegation of racial abuse towards Heung-min Son during yesterday’s match.",
        "“Discrimination of any kind is abhorrent and has no place in society, our game and at our club.“We are working with Met Police and Crystal Palace to investigate and identify the individual involved.“We will do everything in our powers to ensure that if found guilty, the individual will receive the strongest possible action – as was the case earlier this season when Son suffered similar racial abuse at Chelsea.”",
        "Tottenham supporters’ group Spurs REACH, which stands for Race, Ethnicity and Cultural Heritage, wrote on Twitter: “Why oh, who, oh why, do adults in this day and age think that this is an acceptable way to behave towards another human being? Evidence has been shared with the police, and when he is identified, he will face a club ban. We will not tolerate such behaviour in our club  Crystal Palace statement  “We sincerely hope that Crystal Palace Football Club identify and ban this individual for life!”Kick It Out also released a statement to condemn the behaviour, head of player engagement Troy Townsend said: “Kick It Out are appalled to hear that Heung-Min Son was subject to alleged racist abuse during yesterday’s Premier League fixture between Tottenham Hotspur and Crystal Palace.“This is not the first time that he has been forced to endure such abhorrent discrimination. It is vital that player welfare is always the priority, and we urge football’s stakeholders to examine whether their policy of making players leave the pitch at the nearest point can in certain circumstances risk exposing players to discriminatory abuse, particularly during moments of high tension in the game.“Furthermore, we commend the clubs and the Metropolitan Police for their swift response to this incident and echo Crystal Palace’s stance that any perpetrators must receive a club ban for their actions.",
        "“Kick It Out are here to support all victims of discriminatory abuse and we would encourage anybody who sadly experiences or witnesses abuse of any kind in the game to report it to us.”Son was also racially abused during a match between Chelsea and Tottenham at Stamford Bridge in August.Chelsea banned a season-ticket holder indefinitely after footage emerged on social media of a fan in the home end making a racist gesture towards Son in the 2-2 draw.The Crown Prosecution Service in March issued the Chelsea supporter with an order banning him from attending live football matches for three years."
    ]
}