{
    "articleURL": "/wires/ap/article-12039897/Verlander-Scherzer-returning-mound-Mets-Detroit.html",
    "content": [
        "DETROIT (AP) - New York Mets star pitchers Justin Verlander and Max Scherzer are returning to the mound, perhaps fittingly in Detroit against a team they helped have its last run of success.",
        "\"It´s funny how baseball works,\" Verlander said Tuesday, surrounded by Detroit and New York-area reporters at Comerica Park.The 40-year-old Verlander is scheduled to make his Mets debut on Thursday against the Tigers, who drafted the right-hander No. 2 overall in 2004 and traded him to Houston in 2017.Verlander's season-opening start was delayed due to a back injury.\"Obviously, I wouldn´t like to start the year on the IL at all,\" he said. \"But as baseball always tends to have some funny stories and connections, here I am, my first start as a Met in Detroit.\"The 38-year-old Scherzer (2-1, 3.72 ERA) is due to pitch Wednesday night for the first time since April 19, when he was ejected for violating MLB´s foreign substance policy.",
        "The series-opening game Tuesday night was postponed due to rain, and will be made up as part of a doubleheader on Wednesday. New York left-hander Joey Lucchesi and Detroit left-hander Joey Wentz were scheduled to start in the first game of the doubleheader, with Scherzer and Tigers right-hander Michael Lorenzen on the mound in the second game.Scherzer, who pitched for the Tigers from 2010-14 before signing with Washington, is returning from a 10-game suspension. He initially challenged the punishment before dropping an appeal, per the team's wishes.",
        "The right-hander claimed the stickiness was caused by rosin and sweat, not by a foreign substance, but declined to say what changes he would make moving forward.\"I´m not going to go into the process because if you have a process, that´s cheating,\" Scherzer said.Scherzer was just the third pitcher suspended since baseball´s crackdown on sticky substances started in June 2021.The Mets, who are in the highly competitive NL East, are happy to have the three-time Cy Young winners in the rotation after investing a lot of money in them during the offseason.Verlander signed an $86.67 million, two-year deal after he went 18-4 with a 1.75 ERA in 28 starts last year, helped the Astros win the World Series and won his third Cy Young.The Mets gave Scherzer a $130 million, three-year contract after he went 15-4 - going undefeated after May 30 - with the Nationals and Los Angeles Dodgers.\"Just excited to be back with Max,\" Verlander said. \"We kind of went our separate ways and to come back here at this stage in our career has been such a blessing. We´ve had a lot of talks about pitching and baseball, and reconnecting, it´s been great.\"Verlander and Scherzer led a rotation that lifted Detroit to four straight division titles, the AL Championship Series three years in a row and the 2012 World Series.",
        "\"It was one hell of a run,\" Verlander said.Detroit has been in a rebuilding mode without many signs of improvement since trading Verlander, losing 114 games in 2019 and 96 games last year.\"It doesn´t surprise me,\" Verlander said. \"Everybody kind of saw it coming as pieces started to be traded away.\"The Tigers fired general manager Al Avila during last season and hired San Francisco Giants general manger Scott Harris to lead the latest attempt to get the team winning again.\"I´m always rooting for the best for the organization,\" Verlander said. \"It seems like they´re bringing in some pieces to start turning things around.\"___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}