{
    "articleURL": "/news/article-12044687/Moment-Coast-Guard-rescue-helicopter-blown-sea.html",
    "content": [
        "The crew of a MH60 Jayhawk was dispatched to the Carnival Dream cruise for a medical evacuation on April 29When the helicopter arrived at the scene, the crew confronted dangerous winds and rain that forced the helicopter to back away from the shipIt then tumbled downwards — only coming to a stop several feet above the water as concerned cruise ship passengers yelled 'Get up, get up'Dramatic video posted online captured the moment a Coast Guard helicopter was nearly blown into the sea as its crew tried to rescue a cruise ship passenger.",
        "The crew of the MH60 Jayhawk was dispatched to the Carnival Dream cruise, sailing about 300 miles off the coast of Alabama, in the early morning hours of April 29.The Coast Guard Sector Mobile had received a request for a medical evacuation of a passenger who was experiencing heart-attack like symptoms, officials say.But as the helicopter arrived, weather conditions started to worsen with winds picking up speed. When the crew from the Coast Guard Air Station New Orleans tried to hoist one of the ship's nurses on board, it started teetering back and forth until it was eventually swept away from the ship.Soon, the helicopter tumbled downward — only coming to a stop several feet above the water as concerned cruise ship passengers yelled 'Get up, get up.'",
        "Coast Guard officials said that the incident occurred after the crew lowered a rescue swimmer onto the top deck of the Carnival Dream cruise.They were then trying to hoist the nurse up when a large squall of wind and rain forced it to back away from the ship.A massive gust of wind then forced the roughly 14,500-pound flying machine to 'recover the aircraft close to the water's surface.''During the rescue, the aircrew experienced severe and rapidly deteriorating weather that forced them to abort the mission,' Cmdr. Keith Blair, a commanding officer at the Coast Guard Air Station New Orleans said in a statement.",
        "'Through exceptional real-time risk management, crew resource management and superb piloting, the aircrew was able to safely recover the aircraft and land at the air station without incident.'Another crew was dispatched to the ship later in the day, he noted, and was able to 'recover the patient and rescue swimmer, delivering the patient to University Medical Center for treatment in stable condition.'"
    ]
}