{
    "articleURL": "/wires/pa/article-12051025/Strike-hit-train-firm-run-no-services-Liverpool-Eurovision-final.html",
    "content": [
        "A train operator will run no services from Liverpool after 7pm on the night the city hosts the Eurovision final due to a strike.",
        "TransPennine Express (TPE) said it “will do all we can to help make the event a success” but a walkout by members of the Rail, Maritime and Transport union (RMT) will have a “significant impact” on services.Passengers planning to travel to and from Liverpool for the show on May 13 are being urged to check their travel plans in advance.TPE will run a number of trains to get people to the city that day, such as an hourly service from Manchester Piccadilly between 7.50am and 6pm. Sadly our customers need to be aware that the strike action will have a significant impact  Kathryn O’Brien, TPE  The company also confirmed it will not run any services the day before the final due to a strike by train drivers’ union Aslef.TPE operations and customer experience director Kathryn O’Brien said: “This next week should be a time of celebration for Liverpool and the wider North West region, as we have been given a unique opportunity to host the world’s biggest music competition on behalf of those in Ukraine.",
        "“Whilst we will do all we can to help make the event a success, sadly our customers need to be aware that the strike action will have a significant impact on our ability to run services to and from Liverpool.",
        "“On Friday there will be no services at all, and on Saturday – when we know so many people will want to head into Liverpool to be part of the historic event – we will run all that we can but even this will be a limited timetable, with no trains out of the city after 7pm.”Strike action is being taken by RMT members at 14 train operators in a long-running dispute over pay and conditions.Aslef has also announced strikes on May 31 and the day of the FA Cup Final on June 3."
    ]
}