{
    "articleURL": "/wires/reuters/article-12056489/Padres-Joe-Musgrove-step-season-vs-Dodgers.html",
    "content": [
        "The national television audience for Sunday's rubber match of the series between the host San Diego Padres and the Los Angeles Dodgers probably will learn more than they need to know about Joe Musgrove's feet.",
        "\"This hasn't been a good year for my feet,\" the pitcher said Friday after his scheduled start was pushed back until Sunday due to blisters on the bottom of them.Musgrove's foot problems began in spring training when he dropped a kettle weight on his left foot, fracturing his big toe. That landed him on the injured list for Opening Day.Then last Sunday, Musgrove burned the bottom of his feet while running barefoot across the artificial turf at Estadio Alfredo Harp Helu in Mexico City. It turns out that because of foot and Achilles problems, Musgrove finds it relaxing to run barefoot across the outfield grass during his between-starts workouts.But Musgrove learned there is a difference between trotting across the sea-breeze-cooled lawn at Petco Park in San Diego and the hard artificial surface in Mexico City, where the surface temperature soared into triple digits.Musgrove said he knew he had made a mistake as he was running from the foul line toward center field. It was during the return run that his feet began to blister.Musgrove was scheduled to oppose the Dodgers' Clayton Kershaw in the series opener on Friday. But as a precaution, Padres manager Bob Melvin moved Musgrove back to Sunday for another tough matchup.This will be Musgrove's third start of the season. The right-hander is 1-0 with a 10.80 ERA, bloated when he gave up seven runs in 3 1/3 innings against the San Francisco Giants in Mexico City on April 29.",
        "His Sunday opponent, Dodgers ace Julio Urias, is 4-3 with a 3.86 ERA.But Dodgers manager Dave Roberts, who was absent from his ballclub's 2-1 win Saturday while attending his son's graduation from Loyola Marymount University, said he believes Urias has turned the corner.\"Early in the season, he didn't have full command of his fastball,\" Roberts said. \"It's been a lot different since his fastball came in.\"And now, Urias will face the Padres, a team he has dominated.The 26-year-old has a 6-1 career record against San Diego in 15 games (10 starts), with a 2.19 ERA. He has held the Padres to 16 runs (15 earned) on 39 hits and 22 walks with 59 strikeouts in 61 2/3 innings. And he's getting better with time. Last season, Urias was 3-0 against the Padres with a 1.50 ERA over four starts.Urias held the Phillies to one run on one hit and one walk with 10 strikeouts over seven innings in his most recent start to snap a three-game personal losing streak.Meanwhile, Musgrove's 2023 season debut came April 22 in Arizona. He held the Diamondbacks to three runs on seven hits over five innings to earn the win. Seven days later in Mexico City, Musgrove gave up seven runs on six hits (including three home runs) and a walk in 3 1/3 innings in a game that totaled 11 home runs and 27 runs.",
        "Musgrove was 0-2 against the Dodgers during the regular season in 2022 with a 3.63 ERA, but he held them to two runs on six hits and three walks with eight strikeouts over six innings in the Padres' clinching win in Game 4 of the National League Division Series.--Field Level Media"
    ]
}