{
    "articleURL": "/tvshowbiz/article-12059169/Danniella-Westbrook-details-nightmare-reconstructive-surgery.html",
    "content": [
        "She's waited four years for doctors to fix her nose, which collapsed as a result of her cocaine addiction. ",
        "And actress Danniella Westbrook, 49, revealed her regret over her fifth facial reconstruction in Turkey which left her in agony. Danniella, who cannot take pain relief medication due to her past cocaine addiction, because it contains codeine, said she woke up in agony and was left fearing for her life.The star went under the knife last month for a surgical thread lift (a procedure where temporary stitches are used to produce a 'lift' in the skin) and fat transfer in a bid to fix a past botched surgery. But she told OK! 'I had a surgical thread lift where they put over 1,200 threads into my face. They were also supposed to reconstruct my nose, which is what I went there for, but they haven’t done that. ",
        "Danniella has said she is going back to my surgeon in Liverpool to get her nose fixed - saying they will rebuild all the bridge in her mouth and build up the front of her nose. She said: 'They’ve taken the fat out of my back, my sides and my stomach, and put it into my face to make it more symmetrical. But I feel like they’ve taken too much fat from my stomach. I’ve always had a six-pack, and I’ve woken up, and I’ve lost it.",
        "'I also have big lumps of fluid all over my belly. They’re like big tennis balls. It’s ruined my body. It’s going to take a lot of work to get it back to how I was. I’m 50 this year, and I wanted to be in the best shape ever.'Despite having had surgery in the past, Danniella said that she has never experienced pain like she felt after the two-hour surgery.She also said that she was left crying hysterically but doctors in Turkey were unable to understand what she was saying. Convinced she was going to die, Danniella said she wrote a will. She spent five days recovering in Turkey before flying to Portugal where she now lives. She said that she hates her appearance even more than before now and had wanted to be in the best shape she could be in before turning 50. Vowing to never have surgery abroad again, Danniella, has said she is keeping her spirits up. ",
        "She got engaged to fiancé David, 29, last year, who is currently in jail, but she i looking forward to getting married this year and finally fixing her face.It comes after it was revealed that Danniella is finally getting facial reconstructive surgery on the NHS after private plastic surgeons said it would cost £500,000. ",
        "The star needs five operations to correct her 'collapsing' face due to a previous cocaine addiction and osteoporosis.But she insists that she needs the surgery to 'survive' and that it isn't for 'vanity' but purely for health reasons after her septum collapsed from excessive drug use in 2002.She previously told The Sun: 'I've spent the last seven years trying to get somebody to do it, but they said no in case it failed and they got struck off.'Plastic surgeons wanted £500,000 to change my face, so I thought I was never going to get it done. It was only because I went into intensive care before Christmas.'I couldn't breathe because I had a cold. There was a build up of fluid and after I fell asleep I couldn't wake up properly and ended up in ICU.'I was sent over to Aintree Hospital in Liverpool and it's only because I was put in front of the right doctors, or else I'd still be waiting now to find someone. 'They're doing it for me under the NHS now.'The star recently revealed her plans to have a rib inserted into her face after years of drug abuse caused her nose to collapse.She previously underwent a rib insertion procedure in 2018, after osteoporosis rotted away her cheekbones and gums and, after spending the last year getting lip filler and Botox, in addition to surgery on her face, she is hoping to get back to her best.",
        "The actress' battle with drugs has been well-publicised, and she famously had her nose reconstructed after her septum collapsed from excessive cocaine use in 2002.At the height of her use it was reported she would take up to five grams of cocaine a day, blowing close to £250,000 on the drug.The star has since embarked on multiple rehab stints in order to battle her demons - and revealed she was finally clean in June 2021, after attending a clinic in Mijas, Spain.Danniella first appeared in EastEnders in 1990 at the age of 16 and acted on the soap for three years."
    ]
}