{
    "articleURL": "/femail/food/article-12039887/Bec-Hardgrace-shares-make-Nandos-burger-home.html",
    "content": [
        "Bec Hardgrave shared how to replicate a Nando's burger at home Eight ingredients were used and it contains less calories than the original A qualified fitness coach who's known for sharing healthy recipes has revealed how to make a 'fakeaway' Nando's chicken and haloumi burger. ",
        "Bec Hardgrave delighted fans with her homemade alternative that contains 440 calories - which is 243 less than the original version from the fast food restaurant. And only eight ingredients are required - brioche buns, halloumi, chicken breast, Nando's Peri Peri sauce, aioli, high protein yoghurt, lettuce and onion. Bec, from Brisbane, demonstrated how to make the dish in a video shared with her 109,000 Instagram followers.Scroll down for video ",
        "The delicious burger contains 440 calories, 44.5 grams of protein, 28 grams of carbohydrates and only 19 grams of fat. To make the burger she combined the aioli and yoghurt in a bowl to form a sauce that was spread on the bottom half of the brioche bun. The onion, chicken breast and halloumi were also cooked separately then placed on the brioche bun, along with fresh crunchy lettuce.  The top of the brioche bun was placed on top and Bec took a bite. ",
        "Ingredients:1 x Brioche bun30g halloumi100g chicken breast10g Nando's Mild Peri Peri Sauce20g Aioli and 15g high protein yoghurt for the sauceLettuceOnionMethod:Slice and cook the onion, then grill the chicken breast followed by the halloumi Combing the aioli and yoghurt then spread on the bottom half of the brioche bun Build the burger by placing the onion, lettuce, chicken, haloumi, and Peri Peri sauce Place the other half of the brioche bun on topServe and enjoy  Source: Bec Hardgrave ",
        "The video swiftly caught the attention of other foodies who were amazed with the simplicity of the recipe. 'Easy but yum,' one woman wrote and tagged a friend in the comments, another said: 'Wow I love it!' 'Oh yum! Definitely making this,' a third added.  Previously Bec has also shared how to make the iconic baguette from Emily in Paris at home. ",
        "The McDonalds baguette quickly became famous after featuring in the popular TV show.McDonalds has re-released the sandwich in French branches thanks to its popularity, but as it's not available in Australia yet the homemade version will have to do.In the new season of the show Emily runs the marketing team for McDonalds' latest release - the McBaguette.'Did you know the McBaguette from Emily in Paris is a real thing? But they don't sell it in Australia,' Bec said.To make the recipe the fitness coach prepared a small baguette, shredded lettuce, Bernaise sauce, Jarlsberg cheese and lean beef mince.",
        "Ingredients:* 1 small baguette* 30g pre-made Bernaise Sauce from Coles* 140g Lean Beef (seasoned)* 2 Thin Slices Jarlsberg (available from the deli)* Shredded iceberg lettuce Method:* Season mince with salt and pepper and roll it into balls.* Put them on a hot pan and flatten them with a burger smasher or a plate* Slice a baguette in half and put Bernaise sauce on both sides.* Add lettuce, two slices of Jarlsberg cheese and two burger patties Source: Bec Hardgrave"
    ]
}