{
    "articleURL": "/wires/aap/article-12049621/Forces-try-scoring-star-not-fazed-Crusaders-aura.html",
    "content": [
        "The aura of the Crusaders has loomed large over the Western Force this week, but not for try-scoring machine Zach Kibirige.",
        "The Force will be aiming to post their first away win of the Super Rugby Pacific season when they take on the Crusaders in Christchurch on Saturday.The closest the Force have ever come to beating the competition powerhouse on enemy territory was in 2009, when they escaped with a 23-23 draw.Just two years earlier the Force were crushed 53-0 in Christchurch in what remains the franchise's biggest ever loss.The Force (3-6) sit in 10th spot on the ladder, with all six of their losses coming on the road.It's a record the Force want to rectify, but Christchurch looms as one of the most unlikeliest places to end the away rot.Earlier this week, Force captain Michael Wells spoke of the need to break down the aura of the Crusaders and treat them like any other team.That will be an easier task for Englishman Kibirige, who didn't grow up watching the Crusaders wreak havoc on their opponents on the way to winning 11 Super titles.\"I never really watched a lot,\" said Kibirige, who spent his entire professional career in England before linking up with the Force this season.\"I think the aura has come in very much from the media. We respect who we play against, but we focus on ourselves.",
        "\"Being around the squad, I don't think we're particularly fazed from week to week about who we're playing against.\"Despite the Force's struggles this season, Kibirige has flourished with eight tries - the second most in the league.The acrobatic nature of some of his tries has ensured he's dominated the highlights reels.The 28-year-old joined the Force on a one-year deal after English outfit Wasps went into administration.Kibirige is remaining tight lipped about his plans beyond this season, but said: \"Conversations around the future are still happening. I'm loving living in Perth at the minute, so I'm open to anything.\"The Force will unleash debutant five-eighth Max Burey against the Crusaders, while former Wallabies enforcer Isi Naisarani will don the Force jersey for the first time since dazzling in his debut Super season in 2017.The Crusaders (6-3) have been bolstered by the return of All Blacks star Will Jordan, who has recovered from a migraine-related condition that had grounded him since last September."
    ]
}