{
    "articleURL": "/femail/article-12043831/Anna-Wintour-dotes-grandson-Oliver-Bill-Nighys-rep-DENIES-couple-dating.html",
    "content": [
        "Anna, 73, was pictured cuddling her grandson inside the MET in New YorkRead More:  Anna Wintour surfaces in New York solo amid confusion over her romance rumors with Bill NighyShe's been called the Ice Queen of Fashion because of her steely, no-nonsense image. ",
        "But earlier this week, Anna Wintour, 73, showed off her softer side when spending time with her grandson Oliver.The Vogue editor's daughter Bee Carrozzini, 36, shared a heartwarming image with her 145,000 Instagram followers.The candid snap shows the British fashion editor - who organises the annual Met Gala - happily balancing her grandson on knee.Looking like any other proud grandparent, Anna cuddles Oliver close as he gazes across the room inside the The Metropolitan Museum of Art in New York. ",
        "Appropriately, the toddler’s already showing off his fashion credentials with a stylish red and white hooped jumper paired with jeans and trainers. Meanwhile, Anna looked characteristically stylish in a navy floral dress with a contrasting coat and silver bejewelled boots.Although Bee didn't reveal when the photo was taken, it appears as though the Vogue editor was doing a final check-up of the Met Gala preparations and was sat at one of the tables where her guests would be dining. Her film producer daughter jokingly captioned the image: 'Final Met Meeting.'Bee welcomed her first son with her Italian director Francesco Carrozzini, 40, in October 2021.Earlier this week, Anna walked the red carpet at the Met Gala with British actor Bill Nighy - seemingly confirming rumours that they are  romantically involved.",
        "However, the actor's representative said in a statement the next day: 'Bill and Anna have simply been great friends for two decades. They are not in a relationship.' The pair, both 73, who have been close since 2010, sparked dating rumours once again in 2021 following Wintour's split from her husband of 20 years, Shelby Bryan. ",
        "At the time her second marriage ended in 2020, it was reported that the editor had dumped her Texan husband because she had 'grown bored' with him. By August 2021, rumors began to swirl that Wintour had found a new flame in her long-time friend Nighy after the pair were spotted having dinner together in Rome.Nighy himself has not gone public with a relationship since his split from his long-term partner Diana Quick in 2008, with whom he shares a daughter, Mary.In 2018 Nighy even addressed the speculation that had mounted for nearly a decade, but appeared to brush it off when he said: 'There are a lot of rumors about me and probably about Anna.'And in an interview last year, he refused to be drawn on what he described as 'something very close to gossip'. Wintour's first marriage was to David Shaffer in 1984, who was 10 years her senior. They had two children, Charles and Bee, but by 1999 the couple were divorced and Anna began dating Shelby Bryan. ",
        "The Vogue editor appeared to befriend Nighy around 13 years ago when they began to attend fashion weeks together - something they have done several times throughout their friendship.In 2010 the pair looked close as they sat next to each other at the Nicole Farhi Spring/Summer show at London Fashion Week.",
        "A photo from the event captured the pals sitting very close together as Wintour leaned behind to chat to someone in the second row. They were both smiling as they watched the catwalk show.However at this stage, there was no indication the pair were any more than just friends - and indeed two years later they were joined in the front row at LFW by Nighy's then ex, Diana Quick.The trio looked pally as they sat together to watch another Nicole Farhi show at the Royal Courts of Justice in 2012.As well as fashion shows, the pair also enjoy a mutual love of theatre - and in 2018 were spotted together in London as they watched 'The Jungle', a play about the refugee crisis in Calais, Page Six reported.While Wintour and Nighy have often made public appearances together, it is perhaps their intimate dinners which have caused more speculation that they might be more than just friends.",
        "In 2020, Page Six reported the couple had dined together at Sant Ambroeus on Madison Avenue in New York - and Wintour had even been spotted without her trademark shades.A source told the magazine that Wintour looked 'happier than I have ever seen her'.They added: 'Anna was beaming the whole time. She looked happy and in very good company. She was beautifully made-up and she was smiling so much — she had her sunglasses off the entire time!'"
    ]
}