{
    "articleURL": "/tvshowbiz/eve-gale/article-12054437/Love-Island-Eve-Gale-stuns-skimpy-black-cut-swimsuit-poses-racy-snaps-Ibiza.html",
    "content": [
        "Eve Gale showed off her toned curves as she posed for sizzling snaps in Ibiza on Saturday.",
        "The former Love Island star, 24, posed up a storm as she slipped into a skimpy black cut-out swimsuit from SHEIN.The TV personality - who was in Ibiza to attend the SHEIN fashion show at Ocean Beach - shared a slew of racy pictures from her trip.The bombshell donned a bronze make up palette enhancing their features, with long lashes and filled in eyebrows, finishing off with a nude pink lipstick. Eve looked sensational as she wore her long blonde locks loose, styled with slight waves at their ends.",
        "She gave herself some extra inches with chunky espadrille heels, as she showed off her sun-kissed tan.The Love Island star also shared a sizzling snap with her twin sister Jess in front of the entrance of the TRS Hotel in Ibiza.The twins showed off their toned figures as they posed up while looking at each other and wore a white beach cover-up.Jess showcased her jaw-dropping figure as she stunned in a tiny cream bikini set.Eve also shared another mirror clip as she shows off her hourglass figure as she adjusts her hair.It comes after the twins admitted they sometimes have to give themselves 'pep talks' ahead of racy photoshoots because they don't always feel like the sexy figures fans see in photographs.",
        "In an exclusive interview with MailOnline, the siblings detailed having to put on an air of confidence before going in front of a camera.They said: 'If you look nervous, it's just not going to work!'",
        "Since shooting to fame in the sixth series of Love Island in 2020, the girls have continuously stunned with jaw-dropping modelling shoots.Jess and Eve told how there's an element of 'faking it to make it' as they plaster on a smile and strut out into the studio with self-assurance, despite not necessarily feeling that way inside.Detailing how they tackle this, Eve shared: 'I feel like although we come across very confident on shoots, inside I'm like thinking, 'oh my God, I don't feel it!''I just try and get that across because I don't want to come across like I'm nervous.'While Jess added: 'For the shoot we were literally in the bathroom, and we gave ourselves a pep talk and said 'right let's go out and be confident and just do this!''Because that's the only way you can feel confident doing a lingerie shoot. They gave us these robes to put on as in the studio there's the cameraman, the videographer, the make-up artist, the hair people...'All these people you've never met, and you literally walk out in lingerie! So it is nerve-wracking at first, but we just told ourselves that we need to be confident here.",
        "'If you creep out in your robe and look nervous, it's just not going to work - you have to strut out and put on that face of confidence otherwise it's going to be awkward for everyone!'While the sisters have grown in confidence with their bodies, they've also developed their confidence with their careers as they're no longer the 'naïve' 20-year-olds they were when they strutted into the Mallorca villa almost three years ago.On the lessons they've learned since finding fame, Jess explained: 'When I first came out of the villa, I didn't know the industry, I was just going with the flow and there were other people to rely on to make the decisions for you.'Now, I just think this is my career, it's my choice which direction it goes in. I'm a little bit more inclined to put my foot down, to say no to things I don't want to do and do things I really want to do.'The pair described their time on the show as 'overwhelming' and said their experience in the villa has 'ruined' the show for them.Jess admitted she has 'blurred' memories from her time in the South African villa and said the experience was much more 'intense' than she thought it would be.",
        "She told the Daily Star: 'When we went in there, we were 20, and I was quite naive and when you do go in there it is so much more intense than you think.'Eve admitted that neither of them can watch Love Island in the same way since they appeared on the ITV2 dating show.Eve added: 'It's kind of ruined the show a little bit, I definitely don't watch it how I used to watch it.'Jess, who made it to the show's final, said they were both 'drained' after leaving the villa but admitted she was still glad that she went on the show."
    ]
}