{
    "articleURL": "/wires/ap/article-12043649/Attorney-wants-court-records-sealed-Ralph-Yarl-shooting.html",
    "content": [
        "LIBERTY, Mo. (AP) - The attorney for an 84-year-old man accused of shooting a Black teenager who mistakenly came to his door is asking a court to prevent any new information in the case from being made public.",
        "Andrew Lester is accused of shooting Ralph Yarl on April 13 after the 16-year-old confused Lester's north Kansas City address with a home about a block away where he was supposed to pick up his younger brothers.The shooting drew worldwide attention and prompted rallies and protests in the Kansas City area, with critics saying Lester, who is white, was given preferential treatment when police released him just two hours after he was arrested.Lester has pleaded not guilty to armed criminal action and first-degree assault charges and remains free on $20,000 bond. Yarl was shot in the head and an arm and is recovering at home after being hospitalized for three days.Lester's attorney, Steven Salmon, argued in a legal filing Monday that the court record should be sealed, noting that Lester has been harassed and threatened. Salmon also noted that the publicity could make it difficult to find an impartial jury and that potential witnesses may be reluctant to testify.\"The release of further information will continue to add fodder to oftentimes inaccurate and speculative statements about the case,\" according to the motion. \"This publicity in the case has already caused a widespread adverse and prejudicial reaction against the defendant and prejudice to his case.\"",
        "Salmon said Lester has been forced to live away from his home, which has been egged and spray-painted. He said Lester has sought law enforcement assistance when traveling and his wife had to be moved from her nursing home.",
        "Civil rights attorney Lee Merritt, who is representing Yarl's family, did not immediately return a message seeking reaction to Salmon's request.Clay County Prosecutor Zachary Thompson said previously that there was a \"racial component\" to the case but has not elaborated.Yarl´s aunt, Faith Spoonmore, said on Instagram during the weekend that her nephew has debilitating headaches but is starting to have more good days than bad days and is hoping to start playing the bass clarinet again soon. Yarl is an honor student and band member.Merritt and some civil rights leaders in the Kansas City area say a hate crime charge is warranted and have called for the U.S. Justice Department to investigate.According to a probable cause statement, Lester told police he lives alone and was \"scared to death\" when he saw Yarl on the porch because he thought someone was trying to break in. No words were exchanged before the shooting, but as Yarl got up to run, he heard Lester yell, \"Don´t come around here,\" the statement said.Salmon suggested in his court filing that he planned to argue that Lester acted in self-defense, citing Missouri´s \"stand your ground\" law. Missouri is one of about 30 states with laws that say people can respond with physical force when they are threatened.",
        "Lester is scheduled to be in court June 1."
    ]
}