{
    "articleURL": "/wires/ap/article-12039675/Escaped-Mississippi-prisoner-dead-New-Orleans.html",
    "content": [
        "JACKSON, Miss. (AP) - A man who escaped from a Mississippi jail on April 22 has been found dead at a truck stop in New Orleans, authorities announced Tuesday.",
        "A security guard patrolling the truck stop Sunday morning found Casey Grayson, 34, unresponsive in a white pickup more than a week after he and three other inmates escaped from the Raymond Detention Center near Jackson, Mississippi´s capital, Hinds County Sheriff Tyree Jones said.Grayson is the third escaped prisoner to be found in a multi-agency hunt. Dylan Arrington died after barricading himself in a central Mississippi home and setting it on fire during an armed standoff with deputies on April 26. He is suspected of killing 61-year-old Anthony Watts and stealing his truck after the escape. Jerry Raynes was arrested on April 27 after allegedly stealing a public works vehicle and fleeing to Texas.Investigators recovered drug paraphernalia in the truck where Grayson was found. But his cause of death will not be determined until results from an autopsy report are returned. Investigators have not found any signs of foul play, Jones said.Jones said a family member may have given Grayson access to the pickup truck after the man escaped from jail. He had been incarcerated for grand larceny, possession and sale of a controlled substance and illegal possession of a firearm, according to WLBT-TV.Investigators are still searching for Corey Harrison, 22, the lone escapee who has not died or been arrested.",
        "Raynes has been extradited to Mississippi, but he had not arrived as of Tuesday afternoon. He will be rebooked at the Raymond Detention Center, but it is unclear whether he will stay at the facility for the remainder of his sentence. He will face additional charges for escape and auto theft, Jones said.In July, U.S. District Judge Carlton Reeves ordered a rare takeover of the Raymond jail after he said deficiencies in supervision and staffing led to \"a stunning array of assaults, as well as deaths.\" But before the appointed receiver was scheduled to assume control over the jail on Jan. 1, the U.S. 5th Circuit Court of Appeals stayed the lower court´s order until it ruled on the county´s motion for reconsideration.\"As it relates to the uproar this has caused in the community, I understand the people's concern regarding the facility,\" Jones said. \"We have taken all of the measurements necessary to prevent this from happening again.\"___Michael Goldberg is a corps member for the Associated Press/Report for America Statehouse News Initiative. Report for America is a nonprofit national service program that places journalists in local newsrooms to report on undercovered issues. Follow him on Twitter at https://twitter.com/mikergoldberg."
    ]
}