{
    "articleURL": "/femail/article-12039737/I-diagnosed-autism-22-six-warning-signs-disorder.html",
    "content": [
        "Jennifer Lopez, 23, was diagnosed with autism spectrum disorder (ASD) last yearShe has been sharing her experience on TikTok to raise awareness In a recent video, she outlined some of the more surprising signs of ASD in girlsA 23-year-old who didn't find out she is autistic until adulthood has shared six lesser-known signs of the disorder that are often disregarded in girls. ",
        "Jennifer Lopez, 23, is known as @jenmilo930 on TikTok, where she has been sharing her experience with autism spectrum disorder (ASD) since she was diagnosed last year. 'It's so important to raise awareness because a lot of autistic women are left undiagnosed,' she told Newsweek. 'I'm glad that I can be that person to help others get a diagnosis sooner rather than later.' ASD is a developmental disability characterized by problems with behavior, communication, interaction, and learning, according to the Centers for Disease Control and Prevention. ",
        "Approximately one in 36 children in the U.S. is diagnosed with ASD, and it is nearly four times more common among boys than girls. Lopez told Newsweek that her ASD symptoms started when she was an infant and became more difficult to handle when she entered school.She was overly sensitive to certain sounds, materials, and foods, and would have a meltdown if anyone touched her things. The content creator also recalled being unable to relate to her peers and having to go to speech therapy because of her struggles with language.Lopez believes her ASD symptoms were missed by her parents and teachers because of her gender. In a recent video, she outlined some of the more surprising signs of ASD seen in girls in the hopes of helping others who have yet to be diagnosed.",
        "She explained that a girl with the disorder may 'rely on other children to guide and speak for her during the school day' and only 'have conversations that are limited to her topics of interest.'Girls with ASD may also find it difficult to describe and manage their feelings.   ",
        "'She is called \"quiet\" or \"shy\" in school and other social situations,' Lopez continued. 'She is unusually passive.'She added that 'being unusually attached to objects or toys' is another symptom of ASD that may be overlooked in young girls. Lopez's video has been nearly 30,000 times, and a number of commenters shared that they had similar struggles growing up. 'Right here Bestie,' one person wrote, while another added, 'Yeah being attached to objects and toys is a huge thing for me.''I've had a Minnie Mouse plushie for like 6 years now,' someone else shared. 'I can't let go of her.'",
        "People with autism spectrum disorder (ASD) have trouble with social, emotional, and communication skills.Approximately 1 in 36 children in the U.S. is diagnosed with ASD, and it is nearly four times more common among boys than girls ASD develops before the age of three and last throughout a person’s life.Specific signs of ASD include:  Reactions to smell, taste, look, feel or sound are unusualDifficulty adapting to changes in routineUnable to repeat or echo what is said to themDifficulty expressing desires using words or motionsUnable to discuss their own feelings or other people’sDifficulty with acts of affection like huggingPrefer to be alone and avoid eye contactDifficulty relating to other peopleUnable to point at objects or look at objects when others point to themSource: Centers for Disease Control and Prevention "
    ]
}