{
    "articleURL": "/wires/pa/article-12044307/Alcaraz-beats-Khachanov-to-final-four-Madrid-Open.html",
    "content": [
        "Carlos Alcaraz remains on course to defend his Madrid Open title after he powered past a determined Karen Khachanov to reach the last four.",
        "The top seed eventually prevailed 6-4 7-5 but only after he staged an impressive fight back in the second set to book a third ATP Masters 1000 semi-final of the season.Alcaraz’s clay-court winning streak now stands at nine and he has tasted victory in 19 of his past 20 matches, claiming title triumphs in Indian Wells and Barcelona along the way.A hard-fought opener went the way of the Spaniard, who celebrates his 20th birthday on Friday, but the second set did not initially go to plan.Khachanov built up a 5-2 lead and looked set to force a decider only for Alcaraz to find his A-game with a string of winners and drop shots to eventually earn victory in one hour and 51 minutes.“It was pretty tough. The first set as well, it was close,” said Alcaraz.",
        "“I was in trouble in the second set, a break down and [he had] two break points to have the second break. So, it was really tough for me to come back and he had his chances to win the second set.“Luckily I knew I was going to have my chances. I just tried to take my opportunities and I’m really happy to get through.” Luckily I knew I was going to have my chances. I just tried to take my opportunities and I’m really happy to get through.  Carlos Alcaraz  ",
        "Borna Coric will face Alcaraz for a place in the Madrid Open final on Friday in what will be their first ever meeting.The Croatian got the better of lucky loser Daniel Altmaier 6-3 6-3 with victory achieved in one hour and 14 minutes for the 17th seed.“I always love to play here in Madrid,” Coric said on-court.“I have very, very nice memories from here and I knew I could play well.“I came here very early to prepare myself for the tournament, as it’s, I would say, a little bit different to the next tournaments. I’m just very happy to be in the semi-finals.”After first-round exits at the Miami Open, Monte-Carlo Masters and Madrid Open, Murray was able to return to winning ways with a 6-3 6-3 win over wild-card Monfils.Murray will face another Frenchmen in Laurent Lokoli in the last-16 and aim to build momentum before this month’s French Open at Roland Garros."
    ]
}