{
    "articleURL": "/news/article-12057215/Virginia-teen-dies-sand-dune-collapses-Outer-Banks.html",
    "content": [
        "A 17-year-old died after digging a hole in the sand at a North Carolina beach The hole and the dune surrounding it collapsed on the teen, as he was not found for several hoursA Virginia teenager died Saturday after he became trapped in a dug hole on a North Carolina beach and a dune collapsed in on him. ",
        "The unidentified 17-year-old was found buried under several feet of sand around 2pm in Frisco, North Carolina, after rangers were called to investigate a teen trapped. According to Cape Hatteras National Seashore officials, the teen's family had been looking for him before they stumbled upon him deep in the sand hole. Rangers and family members worked to pull the teen from the hole while simultaneously performing CPR, rangers said. First responders were unable to resuscitate the unnamed victim. An investigation into the collapse and the death is underway. ",
        "According to park rangers, the hole was dug in a back-dune area on the beach. The dune was not visible from the beachfront, a Facebook post read. The National Park Service said it appeared portions of an adjacent sand dune collapsed into the hole. Dare County Emergency Medical Services personnel worked alongside members of the Hatteras Island Ocean Rescue to pull the boy from the hole. Life-saving measures were performed to no avail.Authorities are offering their condolences and warning against the dangers of digging holes in the sand on the beach. 'Cape Hatteras National Seashore offers our condolences to his family and friends,' said David Hallac, superintendent of the National Parks of Eastern North Carolina.'We urge visitors not to dig deep holes on the beach due to the danger they present to beachgoers and emergency response staff,' he continued. ",
        "Under the park's post, commenters were quick to speak out against hole digging on local beaches. 'It's time to start issuing major fines for digging holes. Too many people are dying from digging on the beach,' one person said.   'Put the law in effect..No digging large holes!! Patrol the beaches and enforce it,' wrote another commenter. ",
        "In 2022, Ocean Rescue in the Outer Banks held a press conference urging people to fill in their holes after deaths were reported. 'The holes have become quite a big issue. It's almost as if people didn't hear the advisory or they decided it was a good idea to see what they could get away with,' Ben Battaile, an assistant supervisor with Ocean Rescue, said. Officials were on high alert after TikTok trends showed teens and young adults digging massive holes in the sand on beaches across the U.S. 'We have moms on the beach at night. We have babies going to the water at night,' said Kelly Sloan, the Coastal Wildlife Director at the Sanibel Captiva Conservation Foundation (SCCF). 'They face so many threats already. This is one small thing we can all do to help them,' the woman continued. The rule of thumb, officials say, is that if a hole is dug, it should be no deeper than your knees and it needs to be immediately filled back in afterward. "
    ]
}