{
    "articleURL": "/wires/ap/article-12051767/Heat-Lakers-head-home-seek-2-1-leads-Knicks-Warriors.html",
    "content": [
        "MIAMI (AP) - Miami and New York are wondering who will be able to play. Golden State and the Los Angeles Lakers are wondering which team will land the next punch.",
        "A pair of Game 3s await as the NBA´s conference semifinals continue Saturday - the fifth-seeded Knicks visit the eighth-seeded Heat in the East, while the sixth-seeded Warriors visit the seventh-seeded Lakers in the West. Both series are tied 1-1.Both have followed the same script: The road teams won Game 1, those victories going to Miami and the Lakers, while the home teams won Game 2 to even the series. The Knicks squeaked theirs out 111-105; the Warriors rolled 127-100.\"We´ll be better,\" Lakers big man Anthony Davis said. \"I´ll be better.\"In Miami, all eyes are on Jimmy Butler and his sprained right ankle. It kept him out of Game 2 on Tuesday, and there is some optimism he can play Saturday. Butler took to social media to show that he was putting himself through a shooting workout Thursday night.Butler is listed as questionable for Game 3.",
        "\"Our guys love to compete, any place, anywhere, against any team,\" Heat coach Erik Spoelstra said. \"We have the three days off in between. It definitely helps, or at least in theory helps us gear up. But if we could have played this game (Thursday), our guys would have loved that as well.\"The Knicks have enjoyed road success all season. Including playoffs, they´re 26-18 away from Madison Square Garden this season - only Philadelphia (28-17), Boston (27-17) and Milwaukee (26-17) have been better. Sacramento was also 26-18 away from home.",
        "It´s New York´s best road record since 1996-97, the fourth-best road mark in franchise history and a huge jump from their .306 road winning percentage over the last eight seasons before this one.\"When you go on the road, there´s less distractions,\" Knicks guard Josh Hart said. \"You´re not worried about family, tickets, where you´re going to eat after the game, you have nothing, only basketball.\"Golden State has struggled on the road all season; the Warriors´ 13-32 record away from home is better than that of only three teams' - Detroit, Houston and San Antonio, the franchises that finished at the bottom of the NBA and have the best chance at winning the lottery and right to draft French phenom Victor Wembanyama.But the Warriors won two road playoff games against the Kings in Round 1 and now will try to win another in Los Angeles.\"It´s going to be a whole lot tougher, Game 3 in LA,\" Warriors guard Stephen Curry said after Game 2. \"It´s a big morale boost to give ourselves life and belief that our game can carry on the road. So, I´m excited about the opportunity and the challenge ahead.\"This will be the fifth time the Lakers go into Game 3 of a series tied at 1-1 since LeBron James went to Los Angeles.",
        "In those previous Game 3s, they´re 4-0.\"Give credit where credit´s due. They played exceptionally well and we didn´t,\" James said after Game 2. \"The series is tied 1-1, so that´s where we´re at.\"KNICKS AT HEATSeries tied 1-1. Game 3, 3:30 p.m. EDT, Saturday, ABC- NEED TO KNOW: A three-day break with no games is likely what the doctors (and athletic trainers, massage therapists and everyone else involved in player health for both teams) ordered. Miami got Game 1, New York got Game 2 and the crowd in Miami tends to not be overwhelmingly pro-Heat when the Knicks are in town. There are many transplants from New York in South Florida, and they´ll let their presence be known Saturday.- KEEP AN EYE ON: Bam Adebayo. Miami´s center blamed himself for the Game 2 loss, has struggled from the field by shooting only 43% over his last five games and knows that the Heat need more. If he gets going early, everything else tends to open up for Miami´s shooters and slashers.- INJURY WATCH: Victor Oladipo´s season is over and Tyler Herro is still weeks away from any hope of a return for Miami, which is waiting to see if Butler (ankle) can play and Max Strus has any ill effects from his bruised back in Game 2. For the Knicks, Jalen Brunson was playing on a bad ankle in Game 2, and Julius Randle came back from an ankle sprain. But, neither appeared on Friday's injury report.",
        "- PRESSURE IS ON: Miami. The Heat did what they were supposed to do at MSG, getting a split and taking home-court advantage. If they let it go in Game 3, it´ll be quite an emotional boost for the Knicks.WARRIORS AT LAKERSSeries tied 1-1. Game 3, 8:30 p.m. EDT, Saturday, ABC- NEED TO KNOW: The Warriors have won at least one road game in each of their last 28 playoff series, the longest streak in NBA history. They know they´ve got to win at least one in Los Angeles during this series to keep alive their hopes of a fifth title in nine years.- KEEP AN EYE ON: The foul line, especially the one that the Lakers happen to be shooting from in each half. Game 2 was the 225th time in their four seasons together that the Lakers got more than 37:00 of action from James and/or Davis, and the first such game where they combined to shoot no more than one free throw. They shot one in a combined 61:02 of Game 2.- INJURY WATCH: Golden State´s Kevon Looney was dealing with an illness in Game 2, but other than all the aches and pains that accompany basketball this late in a season, the Warriors and Lakers both seem OK on the health front.",
        "- PRESSURE IS ON: The Lakers. Golden State outscored LA 84-47 in the middle two quarters of Game 2. The defending champs are still powderkeg-level explosive, and if they get a second straight win in this series, they´ll become even more dangerous.___AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP_Sports"
    ]
}