{
    "articleURL": "/tvshowbiz/article-12039637/Moana-Hope-revealed-marriage-troubles-weeks-Isabella-Carlstrom-split.html",
    "content": [
        "Moana Hope and Isabella Carlstrom are at the centre of split rumours after the former AFLW player removed her model wife from her Instagram bio.",
        "Now an interview has surfaced, recorded just weeks ago, of the couple laying bare their marriage troubles after Moana, 35, gave birth to their second child Ahi.In a raw conversation with Dr Golly and the Experts, the Australian Survivor star said her postpartum depression was so severe she almost abandoned her family. 'I just had moments where I felt like I'm not good enough to be [the children's] mum. I need to leave. It was about three occasions all up,' Moana revealed.'I almost got in a car and drove away because I just felt like I wasn't going to be a good enough mom for [Ahi]. It was fear.'",
        "The retired athlete went on to say her postpartum depression went hand-in-hand with her 'anxiety' and 'childhood trauma'.In an emotional moment, she confessed she was 'physically abused' throughout 'a large portion of my childhood'.'My anxiety got so bad that I thought I was going to wake up and inherit [the abuser's] anger. So I always thought, \"I don't want to be around my kids if I turn into [that],\"' she confessed.",
        "Isabella then revealed she knew Moana's childhood trauma would be 'triggered' by the 'trauma' of giving birth and asked her to see a 'psychiatrist' about it. The podcast was released on Wednesday, but Daily Mail Australia understands it was recorded just weeks before their rumoured break-up.",
        "Moana sparked rumours of split with model Isabella just one year after they welcomed their second child together.",
        "The footy star appeared to confirm rumours the couple had called it quits by changing her Instagram bio to an emoji of a single woman and two children.Moana's Instagram bio previously included a mention of her wife.She last shared family photos with Isabella and their daughter Svea on April 17 as part of a Mother's Day campaign for Pandora.The two women tied the knot in an intimate wedding ceremony in August 2019."
    ]
}