{
    "articleURL": "/news/article-12061303/Paul-Browne-Sydney-escort-Celia-Bean-charged-manslaughter-tradie-dead-stairwell.html",
    "content": [
        "Paul Browne, 33, found dead in stairwellHe allegedly died of a drug overdoseSydney escort and man charged over death A Sydney escort has been charged after the body of a construction manager was discovered in a unit stairwell where it had laid for up to 19 hours. ",
        "Celia Bean, 39, has been charged with manslaughter over the death of Paul Browne, 33, who allegedly died of a drug overdose on October 8, 2021. Police allege Mr Browne died after consuming heroin and methamphetamine that Ms Bean and her friend, Shayne Johnson, had organised to be supplied to him. The 33-year-old's body was discovered in the stairwell of Ms Bean's apartment block in Zetland, in the city's inner-south, by another resident. Police believe his body could have been lying there for up to 19 hours.",
        "Johnson, 45, has also been charged with manslaughter, with police alleging he and Ms Bean had contributed to Mr Browne's death. Police have accused the pair of gross criminal negligence after they failed to call an ambulance when the tradie overdosed on the drugs they had supplied. They were arrested last December and remain before the courts. A forensic pathologist previously told Parramatta Local Court that Mr Browne may have survived if medical assistance had been provided earlier. In a text message exchange between Ms Bean and Mr Johnson, police allege the pair tried to distance themselves from the incident and claimed not to be responsible for Mr Browne's death. ",
        "The tradie is believed to have driven to Ms Bean's apartment block from his home in the neighbouring suburb of Rosebery on October 7.",
        "Mr Browne's mate Isaac Parry said in November, 2021 that he's '100 per cent sure' the tradie was partying - a euphemism for shared drug use - with Ms Bean rather than using her sexual services.'I honestly don't think he was there to pay for sex,' Mr Parry told Daily Mail Australia in an exclusive interview. 'He would have been partying with an escort as friends.'He was a good looking boy.'Detective Inspector Phil Hallinan previously said the alleged victim's family were 'devastated' and that he had been a 'fantastic family member'. "
    ]
}