{
    "articleURL": "/news/article-12043103/What-evidence-got-Moment-neighbour-accused-murdering-Nikki-Allan-7-1992-arrested.html",
    "content": [
        "David Boyd, 55, of Stockton, was arrested by investigating officers in 2018Nikki Allan, 7, was found dead in an abandoned building with 37 stab woundsBoyd denies murder and maintains he had nothing to do with her deathA jury has seen video of the moment a former neighbour of seven-year-old Nikki Allan was arrested on suspicion of the 1996 murder 26 years earlier.",
        "David Boyd, 55, is alleged to have lured Nikki to an area of wasteland in Hendon, Sunderland, before stabbing her to death.Nikki was hit over the head with a brick and stabbed 37 times - including eight times in the heart - in a derelict building then dragged, while dead or dying, and dumped in a corner of the basement, the court heard.A body-worn camera captured the moment Boyd asked officers: 'What evidence have you got?' as he was arrested in April 2018, when two officers visited his home.He denies murder and is currently on trial at Newcastle Crown Court.",
        "Shirtless Boyd was told that detectives were reinvestigating Nikki's murder and that they suspected he 'may have had some involvement'.'I've had no involvement in that, like,' he replied.The suspect is put in handcuffs and they discuss which police station he will be taken to and if arrangements can be made to look after his dog.Later, he asked the two officers: 'What evidence have you got, anyway?'Boyd, aged 25 at the time of the killing, and now of Chesterton Court, Stockton, Teesside, was known to Nikki's family as his then-girlfriend was a babysitter for her mother.The footage, shown to the court on Wednesday, showed officers arriving at a house and a topless Boyd answering the door.",
        "Boyd is seen to readily allow the officers into his house, before they informed him they were part of a team reinvestigating Nikki's murder.The officer tells him: 'Part of that investigation has led us to suspect that you may have had some involvement in that.'The court then heard from DC Beth Murphy of Northumbria Police who interviewed Boyd after his arrest.Jurors were also read a repeat of the account Boyd gave officers during their house-to-house inquiries at the time.Boyd had said he saw Nikki playing in the Garths, an area close to where she lived, on the night before she was found dead, the court heard.He said he visited a local fish and chip shop for his friend Terry Clark when he spotted Nikki outside.The court previously heard that Boyd had been to the building where Nikki would be found with 12-year-old Colin Pearson days before her death.",
        "In a transcript of his police interview following the 2018 arrest, jurors heard police ask Boyd: 'David my first question to you, were you involved in the death of Nikki Allan, Nikki Prest?'Boyd replied: 'Nah.'Officers then asked: 'In your statement, you said you knew that (Old Exchange) building and you said you had been in there a week prior to the incident?'",
        "Boyd replied: 'Yes.'He told police he had been there with 'little Colin' to look for wood to build a pigeon hut.When asked how he accessed the building, Boyd said: 'We would have got through the back window.'(We) climbed up on the wall because there was like a wall going around. We climbed up onto that. Just climbed through the gap in the window.'The court also heard how a witness had seen a young girl, who prosecutors claim was Nikki, with a man, walking towards the area where she was killed.The woman told how the child would skip to catch up if she fell behind him as they walked. Jurors were told yesterday examinations of four areas of Nikki's clothing found traces of DNA consistent with that of Boyd's profile.In other samples taken from Nikki's t-shirt, Boyd's profile was described as being a 'potential contributor' to DNA found there from more than one man. Boyd also provided officers with his account of the last time time he saw Nikki.He said he was stood on the veranda of the Garths when he saw her walk away out of sight on the day before she was killed.",
        "Boyd said: 'I wasn't the last one to see her, just because I saw her that night.'",
        "Recalling his account, Boyd told officers he couldn't remember if he saw Nikki before or after his visit to the chip shop.He said it was the day after when he was walking down past one of the Garths that somebody told him Nikki was dead.When asked how he felt after hearing the news, Boyd replied: 'Shock, just pure shock.'Didn't know what was going on. I got back to Clarky's (Terry Clark's). He tells me what's happened.'I said I already knew, someone has told me.'The court heard the interview was terminated after over an hour due to Boyd feeling ill.He was later asked if he could remember what he did for the rest of the day when he found out Nikki had died.Boyd said he spent the afternoon in the house with Mr Clark's girlfriend. The police then asked Boyd if he could remember what they were talking about.He replied: 'It was on the [TV] and everything wasn't it. I can't remember what was said.'I just said I seen her the night before in the Garths and that was it. She just disappeared after that.'He then said the girlfriend told him he should alert the police.The trial continues."
    ]
}