{
    "articleURL": "/news/article-12060369/Biden-administration-enforce-old-migration-policy-Title-42-expires.html",
    "content": [
        "Pandemic-era Title 42 is finally ending on Thursday, May 11Biden unsuccessfully tried to end Title 42 twice in the last yearTitle 8 of Immigration Law will now be in force The Biden administration plans to revert to an even earlier foundation of immigration policy when the Trump-era Title 42 authority runs out this week.",
        "For many of the migrants who have crossed the border and hope to make asylum claims, they will face increased hurdles – and face potential increased penalties if the government determines their claims aren't legitimate.Just how the processing and paperwork will go forward for the for the number of migrants at the border – which could reach 10,000 per day – is still to be determined. Already, Customs and Border protection dealt with more than 26,000 migrants at the border in just three days.With Title 42 gone, the new watchword will be Title 8 of the Immigration and Nationality Act.",
        "The law was enacted in 1952 and its provisions have guided border enforcement for decades.It gives those seeking asylum the ability to participate in a 'credible fear' interview with an officer or judge.If they fail it, they could soon be back on a plane to their home country or Mexico through expedited removal proceedings. Otherwise, they can begin the lengthy process of seeking asylum.Those whose claims don't stand up place potentially more severe consequences, Arizona Central reported. This includes a five-year ban on reentry for those found to have entered the country illegally and potential government prosecution of people who seek to cross the border again and again.",
        "There have already been an estimated 2.8 million expulsions since March 2020 under Title 42 authority.According to a Department of Homeland Security plan for the end of Title 42 in December, 'For noncitizens seeking to evade apprehension, repeat offenders, and those engaging in smuggling efforts, we are increasing referrals for prosecutions.' The government wants people to make asylum claims by making appointments through an app. Those who violate the five-year ban imposed on them face an even harsher penalty – prosecution or a ban of up to 20 years on reentry. Those whose asylum claims remain alive could either be placed in long-term detention facilities or released. They would still need to appear before an immigration judge. The administration has been trying to surge resources to the border amid a severe case backlog. End of Title 42 Title 42 is finally coming to an end on Thursday, May 11 and there are at least 10,000 migrants waiting in Mexico to immediately cross the U.S. southern border once the policy is no longer in use.The public health measure was employed in March 2020 by then-President Donald Trump to quell migration during the COVID-19 pandemic by blocking those caught at those at the border from seeking asylum.Migrants could be rapidly expelled back to Mexico, and since it began Title 42 has been used more than 2.7 million times. In March more than 191,00 migrants were encountered at the border, and many expect crossings to rise from 7,500 to 13,000 a day when Title 42 ends. ",
        "The Biden administration will try and stem the surge by enacting a new rule that will disqualify migrants who have not sought asylum, by increasing deportations and by setting up new processing centers in Colombia and Guatemala.But it is unclear what impact the new rules will have, meaning migrants are already lining up at the border and camping in Mexico to see if they can take advantage of the end of the ruling.Many who have traveled for thousands of miles to try and get into the United States have been told by smugglers that it will be easier to get in when Title 42 expires, but there will be 1,500 troops and more border guards on duty trying to stop them.",
        "For asylum seekers, they will no longer be processed under Title 42, but a different border policy known as Title 8, where migrants who have asked for protection get a preliminary interview or a chance to appear in front of an immigration judge. This means border crossers can be paroled in the United States, could be held in detention centers or held in processing centers while their case is decided.So what is Title 42, when was it enacted and what are authorities and the southern border bracing for when it does end next week?",
        "History of Title 42Title 42 was first enacted nearly eight decades ago as part of the Public Health Service Act of 1944.The policy allows for border and immigration authorities to prohibit the entry of those who potentially pose a health risk or recently visited a country where a communicable disease was present.Specifically, the law is related to stopping those who unlawfully entered the country and therefore were able to bypass any health-screening measures that might be in place.During the coronavirus pandemic, Title 42 was used to immediately deport migrants without processing their asylum claims due to the declared public health emergency.Enacting and attempting to end Title 42Trump put Title 42 to use in March 2020 when the coronavirus pandemic hit the U.S.Not only was the then-president using it as a way to stop migrants from bringing and spreading the virus in the country, but it also helped advance his tough-on-immigration stance.President Joe Biden has tried to end Title 42 on more than one occasion, first attempting to do so in May 2022.Republicans and illegal immigration hawks, however, argued that as long as a health emergency was declared in the U.S., the policy should also remain. They have also argued since then that the program needs to persist because there is nothing to replace it and illegal immigration will massively spike once it ends.",
        "In March 2022, the Centers for Disease Control and Prevention (CDC) decided the pandemic's intensity reduced enough for Title 42 expulsions to be ended.May 23, 2022 was the first date the Biden administration set to terminate the poliocy's use.But just before the expiration date was reached, Louisiana Federal District Judge Robert Summerhays blocked the administration from lifting Title 42 and expulsions continued through the original deadline.",
        "Later in December 2022, Biden tried to once again end Title 42 close to the Christmas holiday as reports and images emerged of migrants freezing on the streets of El Paso, Texas.The second attempt to end the policy came in November when Federal District Judge Emmet Sullivan ruled it as unlawful and created a December 21 end date.The Supreme Court stepped in, however, to pause that ruling on December 19.The policy remained in place while legal proceedings played out.May 11, 2022 serves as the final end date for Title 42 – coming in conjunction to the end of a three-year public health emergency.The declaration of the health emergency gave the president certain authorities that are only able to be used during times of emergency in the U.S., including increased executive privilege.Effects of Title 42 and its imminent end",
        "Since Title 42 was enacted in March 2020, migrants have been expelled in more than 2.5 million instances. It's unclear what rate there are repeated expulsions under the policy.When taking all Title 42 expulsions into account since March 2020, at least 81 percent took place since Biden's inauguration after he twice-failed to end the policy.With the latest deadline of May 11, the Biden administration also announced last week the deployment of 1,500 active-duty soldiers to the U.S.-Mexico border where they will remain for 90 days as border communities brace for massive spikes in crossings.There are fears that the number of migrants that could cross in the days after Title 42's expiration could span between 700,000 and 1 million.",
        "Homeland Security Secretary Alejandro Mayorkas said Sunday morning that it will be a 'tough challenge' to address migration at the southern border with Title 42 ended and said there will be 'unprecedented' immigration throughout the entire hemisphere after Thursday.'There is already reports of Brownsville, Texas right now. Shelters are overwhelmed. The cities of Chicago and New York are already overwhelmed. What's May 12 going to look like if we're already overwhelmed before the expiration of Title 42?' NBC News Meet the Press host Chuck Todd posed.'First of all, this is a really tough challenge and has been, as we all recognize, for years and years. We are seeing a level of migration not just at our southern border, but throughout the hemisphere, that is unprecedented,' Mayorkas replied.'It is, I think, the greatest migration in our hemisphere since World War II,' he added.'Our approach is to build lawful pathways, cut out the ruthless smugglers, deliver lawful pathways so people can access humanitarian relief without having to take the dangerous journey from their home countries. And at the same time, if they arrive at our southern border in between ports of entry, we will deliver consequences.'Mayorkas has assured Congress that the southern border is closed and has refused to call the immense number of illegal crossings a 'crisis.'Republicans have called for Mayorkas' resignation or impeachment, claiming he has lied to Congress and the American people and has engaged in a dereliction of duty.As Title 42 comes to an end, a resident of Brownsville, Texas said she questions if Mayorkas and Biden 'even care' about the people in these border communities.",
        "Asked what her message would be for Mayorkas, the resident told Fox News on Sunday: 'I would ask him if he even cares about us, because I have to take my son to school… and it's cruel to not have a plan in place for all of the people you're supposed to represent.''He keeps talking about 'humanity' and 'being compassionate' and 'cutting out the cartel' — and it's just lip service,' she added.What is Title 8, and how is it different to Title 42?When Title 42 comes to an end, the U.S. will rely more heavily on Title 8 to process asylum seekers.This is the regular process for processing border crossers that was in place before Title 42.Both Title 42 and Title 8 allow migrants to be expelled, but under Title 8 there is more paperwork to file and crossers have a chance to appear for an interview or have their case heard in front of a judge.While they wait, these applicants may be paroled in the U.S., could be held in detention centers or detained in processing centers before their cases are resolved.The Biden administration has insisted that Title 8 has stiffer punishments for trying to get into the country illegally, including a five-year ban on entering the United States.But critics and immigration advocates have warned that it will increase the number of migrants in custody.The switch to Title 8 is seen as a deterrent, but smugglers keep telling migrants heading north that the dropping of Title 42 will make it easier to cross."
    ]
}