{
    "articleURL": "/news/article-12049955/Drivers-hit-roads-queues-airports-Britons-use-extra-Bank-Holiday-escape-UK.html",
    "content": [
        "RAC estimates 14.6million car journeys to be made this Coronation weekendBrits have been advised to plan their journeys and check-in's in advance Millions of Britons are set to hit the roads and airports as they take advantage of the Coronation Bank Holiday weekend.",
        "Queues on the roads and airports have already been reported forming at airports, railway stations, ports and roads.This comes as motoring experts have warned that this joyous weekend could be the case of 'double bank holiday traffic trouble' for drivers, as millions of car trips have been planned. Traffic already started building up this morning on the A38M Motorway in Birmingham as thousands took to the roads. Meanwhile, long delays were reported at Manchester Airport as passengers were pictured waiting in long lines for the check in.",
        "Hundreds of tired looking travelers were pictured standing at the airport's Terminal 2. But ahead of the three-day-weekend, motorists and travelers have been warned to plan their journeys in advance and check-in beforehand. And on the M5 motorway, traffic monitor Inrix reported that there were long 'patches' of traffic between junctions.The RAC has warned drivers that it could be a case of 'double bank holiday traffic trouble'  over the next two weekends - with up to 32million separate leisure trips expected to be taken.As millions of people have enjoyed two bank holiday weekends in a row - Monday 1 May and this weekend, thanks to the King's Coronation this year - the RAC estimates this coming weekend will be the busiest May bank holiday since 2016.According to RAC Breakdown research, around 17.2million individual trips were made on the first May Bank Holiday weekend - marginally more than over the same period last year.",
        "However, the Coronation weekend is forecast to be slightly less busy with 14.6million journeys, as they predict more people will stay at home to watch the event on TV.Accommodation search website Trivago shows that booking trends suggest that many visitors and tourists are shunning London on the weekend of the ceremony. ",
        "Data shows that the searches for the capital over the weekend are 7% lower than for the same weekend a year ago, and down a hefty 18% among searches in the UK only.When compared with 2019 pre-pandemic levels, searches for London in the UK and overseas on Trivago's site are 30% lower that weekend.It has been estimated that drivers are planning 2.3million trips on Friday alone, with Saturday seeing the weekend peak of 2.7million journeys and an extra 7.6million taken at some point over the whole weekend.INRIX is warning drivers to be aware of the potential for long delays on the M5 southbound between J15 Bristol and J23 Taunton this Friday afternoon.They have also warned drivers to be aware of the M6 northbound from J18 Chester to J24 Liverpool around the same time – with queues of at least 30 minutes expected.Therefore, drivers are advised to set out before 11am if possible, or leave their journeys until later on Friday evening, or early on Saturday, to have a better chance of missing the worst of the traffic jams.",
        "RAC Breakdown spokesman Rod Dennis said: 'The weather might still be unseasonably chilly, but this won't stop drivers getting out and about over the double bank holiday weekends to make the most of some extra days off.'While we'd expect more short breaks and day trips to the coast this coming weekend, when it comes to the Coronation it's likely major routes are less likely to be congested. The big variable, as always, is what happens with the Great British weather. If temperatures finally increase and the sun makes more of an appearance, we could well see many more people jumping in the car for a quick trip.'In order to avoid any disappointment caused from cars letting their everyone on board down, we urge drivers to check tyres, oil and coolant levels as matters of priority before they hit the road.'While our teams will be working hard throughout both bank holidays, no-one wants to feel royally fed up by being stuck at the side of the road waiting for help. The more checks drivers can carry out before the head out, the more likely they are to feel like the king, or queen, of the road.'Bob Pishue, transportation analyst at INRIX, said: 'Although delays won't be as severe as Easter, drivers should expect long delays on major roads in and around greater London this weekend.",
        "'Travel times will likely peak on Friday afternoon with some areas seeing double the travel times as holiday travellers mix with commuters, but drivers should be prepared for added congestion throughout the holiday weekend.'"
    ]
}