{
    "articleURL": "/news/article-12042723/Sombrero-hat-Sierra-Tequila-bottles-mind-blowing-uses.html",
    "content": [
        "Twitter users are left blown away by the 'game-changing' uses of the little hats READ MORE:  Weight-loss exprts recommending VODKA to stay summer slimThey're the red and gold sombreros which will be a familiar sight to millions of tequila-loving Britons.",
        "Perched atop bottles of Sierra Tequila, the plastic topper is a nod to the drink's Mexican roots.And at first, it may seem like a simple marketing ploy that is later discarded in the bin after the bottle of cactus-derived drink is finished.But it turns out there is more to the iconic little plastic headpiece than meets the eye - with Brits being left stunned by the sombrero's 'mind-blowing' hidden handy uses. Some people have been so gobsmacked they have even called the revelations a 'game-changer'. ",
        "Amazingly, the tiny hat can be used as a lime squeezer. And it even doubles as a piece to measure out the right amount of tequila for a shot. But most impressive of all its purposes is that the rim of the hat can also be used neatly to salt glass for that classic tequila shot experience. Twitter user @J4CKMULL shared his discovery with his 500,000 followers.Posting a snap of the sombrero salting his shot glass, he said: 'I was today years old when I realised the sombrero on top of the bottle of tequila was so you could salt your glass.'",
        "His post notched up almost 2,000 likes and hundreds or retweets and replies from scores of stunned tequila lovers.  Jack later added: 'Don't even lie, you know you all thought it was just a cute little sombrero for your bottle.",
        "'Game-changer blew my mind.'And Jack was not the only one who was stunned by the little sombrero's many uses. Someone else said: 'EXCUSE ME!? What kind of state secret is this?!' Another commented: 'You have changed everything,' While a third added: 'WHATTTTT NO THIS CHANGES THE ENTIRE GAME.'One user even quipped: 'I thought it was just a cute sombrero to put on your pet rat or something While another simply said: 'I had no idea.'"
    ]
}