{
    "articleURL": "/news/article-12052323/Kroger-Levis-DoorDash-sending-trigger-warnings-customers-ahead-Mothers-Day.html",
    "content": [
        "Brands tell customers they don't want to upset them with ''yay mom' energy'Trend started during pandemic as firms sought to avoid reminders of family lossCritics have said it is overly-sensitive but companies say feedback is positive Big name brands including Kroger, Levi's and DoorDash are sending 'trigger warnings' to customers ahead of Mother's Day due to it being a 'sensitive time'.",
        "Major firms are giving people the opportunity to opt-out of emails about the holiday, with DoorDash noting it 'may be a difficult time for some'.The trend began during the pandemic, with companies keen to avoid reminding customers of loved ones they lost to coronavirus.But the practice now appears commonplace. An email from Levi's sent to customers this year says: 'So Mother's Day is just around the corner and before we start bombarding you with mom-related content we just wanted to check in first.'We know motherhood and all the associated feelings, emotions and memories can be tricky - and even triggering for some people.",
        "'The last thing we want to do is hit you with celebratory \"yay mom\" energy that doesn't match up with your vibe.'So this year, we're giving you the option to opt out of our Mother's Day content by clicking here.'Mother's Day is on May 14 this year, but Kroger-owned Fry's Food Stores are already allowing customers to opt out of Father's Day, which is not until June 18, as well.A message from the firm reads: 'We know Mother's Day and Father's Day can be sensitive times for some.'If you'd like to opt out of our emails and push notifications for these holidays, please tap below. Don't worry, you'll still receive all of our other emails.'",
        "The emails don't explicitly say why these holidays might be a 'sensitive' for people, but - as well as serving as a reminder of bereavements - experts have also suggested they can be a painful time for those with fertility issues or complicated relationships with family members.Conservative critics have said companies are being overly-sensitive or 'anti-family' - even pointing to LGBT flags displayed on the firms' websites. But many on social media and elsewhere have welcomed the initiative, and highlighted how family and fertility issues affect everyone across the political spectrum. One Twitter user wrote: 'I know shortly after my parents died I didn't really want to be reminded about father's and mother's day.'Washington Post columnist Megan McArdle suggested social media sites could do more to avoid upsetting those who have recently lost loved ones by bombarding them with Mother's Day reminders.She tweeted: 'How is it that if I lock myself in the closet and whisper the word ‘wedding’ I will be inundated with ads for wedding and cutlery, but apparently none of the social media sites can figure out how not to show me ads for Mothers [sic] Day fights three weeks after my Mom died?' ",
        "Companies have previously said they have received positive feedback on their approach.",
        "In 2021, luggage brand Away told NPR more than 4,000 subscribers chose to opt out of Mother's or Father's Day emails.The practice appears to have been started in the UK, with British florist Bloom &amp; Wild the first to send out such emails in 2019.It even sparked comment in the Houses of Parliament, with MP Mark Warman stating: 'If other companies were to follow suit, the dread - and I do mean dread - around this day might be mitigated for many people.'"
    ]
}