{
    "articleURL": "/wires/reuters/article-12041317/Ukraines-Zelenskiy-Finland-meet-Nordic-leaders.html",
    "content": [
        "Ukraine's president on surprise visit to Finland",
        "Says did not attack the Kremlin or President PutinBelieves battlefield success could persuade allies to give jetsDiscusses NATO membership in summit with Nordic leaders(Adds Zelenskiy denying attack on Kremlin, comment on grain deal)By Anne Kauranen and Max HunderHELSINKI/KYIV, May 3 (Reuters) - Ukrainian President Volodymyr Zelenskiy rejected on Wednesday Moscow's claim that Kyiv had attempted to attack the Kremlin and said his country would soon start a counteroffensive on its own soil against Russian forces.Russia earlier on Wednesday accused Ukraine of a failed attempt to assassinate President Vladimir Putin in a drone attack on the Kremlin citadel in central Moscow, and threatened to retaliate.Speaking at a press conference in Finland, NATO's newest member, Zelenskiy said his concern was to defend Ukraine's own cities and villages against the Russian invasion launched almost 15 months ago.\"We don't attack Putin, or Moscow, we fight on our territory,\" Zelenskiy said.Asked why it was in Russia's interests to accuse Ukraine of trying to assassinate Putin, Zelenskiy said: \"It's very simple. Russia has no victories. He (Putin) can no longer motivate his society, and he can't just send his troops to their death anymore... now he needs to somehow motivate his people to go forward.\"",
        "The Ukrainian president also said he was sure the West would supply Kyiv with modern war planes if his country was successful on the battlefield, citing prior examples that had led to Ukraine being granted new types of military aid.\"This is why I am sure we will soon have aircraft. Because we will soon conduct an offensive, and after it I am sure we will be given planes. I would rather it was the other way round, as it would be easier for us, but it is like it is, and we are grateful for everything,\" Zelenskiy said.\"We need them. Really need them,\" he said.Finnish President Sauli Niinisto said Finland could not donate its U.S.-made Hornets fighters because they were old and few other countries in Europe had similar models, so it would not make sense to build up a service chain.CASE FOR NATO MEMBERSHIPThe Ukrainian president's visit to Finland, one of only a few journeys he has made abroad since the Russian invasion, was announced only after his arrival amid tight security in the Finnish capital.He reiterated his case for Ukraine to join NATO, the Western military alliance of which Finland last month became the 31st member in direct response to Russia's invasion.\"We need security guarantees today, while we are not in NATO,\" Zelenskiy said.",
        "\"But in any case, our goal is to have full membership in the alliance. This is one of the reasons why I am here today. The second reason, or to be honest the priority, is strengthening our army.\"Zelenskiy held bilateral talks with Niinisto as well as a regional summit that included the prime ministers of Sweden, Norway, Denmark and Iceland, all of which said they supported Ukraine's ultimate goal of becoming a member of the EU and NATO.Hundreds of people gathered in central Helsinki to see Zelenskiy arrive, cheering as he appeared in front of the presidential palace.NO GRAIN?Zelenskiy said Russia did not appear to be interested in extending the Black Sea grain deal that has allowed vital food exports, but that Kyiv was focused on looking for partners to continue the deal due to expire on May 18.Asked about the grain deal and whether the alleged attack on the Kremlin would affect negotiations, he said: \"I don't see interest from Russia to continue the grain initiative, but this happens every time. But we are not looking for interest from Russia. We are looking for the fulfilment of the agreements with our partners.\" (Reporting by Essi Lehto and Anne Kauranen in Helsinki, Olena Harmash and Max Hunder in Kyiv, additional reporting by Nerijus Adomaitis in Oslo, writing by Terje Solsvik, editing by Gareth Jones, Christina Fincher and Angus MacSwan)"
    ]
}