{
    "articleURL": "/wires/ap/article-12042313/Transgender-womans-US-cycling-win-rules-UCI-says.html",
    "content": [
        "The victory for the first openly transgender woman to win an official cycling event should stand after she adhered to the updated policy the organization put in place last year, the global governing body for cycling said.",
        "Austin Killips rode to victory in the fifth stage of the Tour of the Gila on Sunday, one of the few remaining marquee stage races in the United States. That gave her the overall victory by 21 seconds and earned her the polka dot jersey as the race's best climber.But the victory by the 27-year-old American, who began racing in 2019, was met almost immediately by backlash from cycling fans on social media and some former cyclists.Last year, the Union Cycliste Internationale changed its rules to stipulate that athletes must have serum testosterone levels of 2.5 nanomoles per liter or less for at least 24 months before they are allowed to compete in women´s events. That was an increase from past rules, which required levels below 5 nanomoles for 12 months prior to racing.\"The UCI rules are based on the latest scientific knowledge and have been applied in a consistent manner, and continues to follow the evolution of scientific findings,\" the UCI said in a statement, adding that the governing body \"may change its rules as scientific knowledge evolves.\"Former Olympic cyclist Inga Thompson posted on Twitter after Killips' victory that the UCI was \"effectively killing off women's cycling\" with its transgender policy.Other sports governing bodies like World Athletics, which oversees track and field, and World Aquatics, which oversees swimming, prohibit transgender women from competing in women's international events.",
        "The Tour of the Gila, which takes place in New Mexico and is among the lowest levels of UCI events, said in a statement was bound by the governing body's rules and upheld Killips' victory.\"Tour of the Gila recognizes the passionate debate regarding rider eligibility and classifications of riders set by UCI and USA Cycling and encourages UCI and USA Cycling to host an open discussion on the manner,\" the race said in a statement.Killips, who rides for the Amy D Foundation in memory of American cyclist Amy Dombroski, said in a statement posted to social media that she had received an outpouring of support from those within and outside the cycling community.\"After a week of nonsense on the internet I´m especially thankful to everyone in the peloton and sport who continue to affirm that Twitter is not real,\" Killips posted on Instagram on Monday. \"I love my peers and competitors and am grateful for every opportunity I get to learn and grow as a person and athlete on course together.\"___More AP sports: https://apnews.com/hub/apf-sports and https://twitter.com/AP_Sports"
    ]
}