{
    "articleURL": "/sport/cricket/article-12038287/Australia-star-Steve-Smith-plays-claims-Sussex-helping-Ashes-hopes.html",
    "content": [
        "Sussex among 13 counties who will with Australians in their ranks this summer Aussie stars can gain valuable match practice while England players are at IPL Batsman Smith will play three three County Championship matches for SussexSteve Smith, resplendent in his Sussex tracksuit, could not resist smiling when it was suggested the Poms are giving him a helping hand in his quest to win the Ashes.",
        "‘I’m not sure about that,’ said the Australian star batsman who has arrived at Hove for three County Championship matches ahead of the World Test final against India next month and then the biggest series of them all. ‘I’m just excited to play some cricket.‘I’ve seen a lot of talk about me getting used to conditions here but you’ve got to remember I’ve played a lot of cricket in England so conditions aren’t really new to me.‘I’m looking forward to the next couple of weeks, hanging out with some of the young batters, having some good conversations with them and helping them on their journey.’It remains one of the most contentious topics in English cricket. On the one hand there is the argument of Sussex and the 12 other counties with Australians in their ranks this summer who insist their presence is for the betterment of the domestic game.",
        "Then there are those who believe it can only help the likes of Smith and others, including Marcus Harris at Gloucestershire and Marnus Labuschagne at Glamorgan, to get valuable match practice while many England players are otherwise engaged at the IPL.‘I’ve always wanted to play County Championship cricket,’ said Smith, who makes his Division Two debut against Worcestershire on Thursday at Worcester. ‘I’ve played internationally for 13 or 14 years now and never really had the opportunity.",
        "‘Hopefully I can do some really good things in these three matches and players are able to watch me and how I go about the game. I’m also here to talk so if any of the batters want to have a chat with me about cricket I’m all ears.’Trevor Bayliss would point out, when he was coaching England, that you would never see an Australian Sheffield Shield side signing an English player during an Ashes summer.But Smith, sitting next to his new coach Paul Farbrace at Hove, insisted he would have no issues if, say, New South Wales recruited Joe Root ahead of the next Ashes in Australia.‘I think that would be great,’ said the former Australia captain, who was clean bowled by his new team-mate and Ashes rival Ollie Robinson in his first Sussex net session.‘Someone like Joe is a class performer and the young batters in Australia could learn a lot from him. I’d have no dramas if he or any England player played for New South Wales.’The smiles even kept coming when Smith was asked what he thought about Stuart Broad’s comments in Mail Sport last week that caused something of a stir in Australia. That, to his mind, the last Ashes in a Covid environment in Australia should be declared void.",
        "‘That was a little odd,’ said Smith, who will bat at five for Sussex after his captain Cheteshwar Pujara. ‘We were all there and playing. He’s a nice guy and loves throwing out some good banter so it’s all part of it. We couldn’t really complain that much.’"
    ]
}