{
    "articleURL": "/news/article-12053303/ISIS-brides-stuck-Syria-Middle-East-sue-Australian-Government-alleging-detainment.html",
    "content": [
        "Australian ISIS brides could take action against the government There are about 40 women and their children still in Syria They have a team of lawyers who say they're being 'detained' The remaining ISIS brides trapped in north-eastern Syria are looking to take legal action against the Australian Government for leaving them in limbo.",
        "About 40 women, many who were stripped of their Australian passports after travelling to ISIS-controlled Syria, and their children, who are legal Australian citizens, say they feel let down by the government.Prime Minister Anthony Albanese last year brought home the first batch of 'ISIS brides' and promised to return the rest in later batches.However, the Saturday Telegraph revealed no plans have been made for the remaining women's resettlement almost seven months later.",
        "Shayma Assaad, her mother Bessima Assaad, Mariam Dabboussy and Mariam Raad and their 13 children returned to Australia last year under a cloud of controversy.One of their relatives now claims they see the government's inaction for the remaining women as a 'broken promise'.'(The government) have been indicating they want to bring them back but without providing any kind of timeline because now \"is not a good time\",' they said.A team of lawyers with the assistance of Save The Children is looking to help 20 of the children still being held in Syria, as well as their mothers, file an Australia-first lawsuit in the Supreme Court.The case will claim the women are being 'detained' by the Australian Government who have failed to bring them home from Syria.If the case is brought to court, the women would be required to return to Australia to appear. ",
        "'We have assembled a high-calibre legal team to prepare an application for a writ of habeas corpus on behalf of these Australians, who have now been trapped in the camps for more than four years,' Save The Children CEO Mat Tinkler told the Telegraph.'Save the Children has been encouraging the Australian Government at every available opportunity to bring home the remaining Australians, and working to avoid the prospect of legal action.'However, the families have become increasingly desperate, as the risks to their children’s health and safety grow with every day that passes. While litigation is a last resort, continued government inaction means the filing of the case is now imminent.'Similar legal battles have been launched in America and India.Among the women yet to return to Australia is Nesrine Zahab whose extremist cousin, Muhammad Zahab, is understood to have lured the majority of the women into Syria.Nesrine said in 2019 she was forced to marry Sydney-born ISIS fighter Ahmed Merhi after arriving in Syria."
    ]
}