{
    "articleURL": "/news/article-12042925/Nashville-PD-says-pausing-plans-release-transgender-school-shooters-manifesto.html",
    "content": [
        "Police had planned to release Audrey Hale's manifesto from the March 27 mass shooting, but announced Wednesday that it would not be released anytime soonOn Monday, Tennessee Firearms Association filed a lawsuit, requesting a court order to force police to release the 'blueprint on total destruction' The May 1 is not the only one that's been filed, and it's unclear exactly which 'pending litigation' Metro police is referring to in their recent statementNashville school shooter Audrey Hale's manifesto will not be released anytime soon due to a pending litigation that was filed this week.",
        "The Metropolitan Nashville Police Department said in a tweet on Wednesday that they have been advised by counsel to hold in abeyance the release of records related to the shooting at The Covenant School pending orders or direction of the court.It comes just after former Hamilton County Sheriff James Hammond and the Tennessee Firearms Association filed a lawsuit on Monday against the Metropolitan Nashville government over the police department not yet releasing Hale's 'manifesto.'The lawsuit requested a court order to force police to turn over the writings which have been referred to as a 'blueprint on total destruction' detailing why Hale chose to enter The Covenant School on March 27 and kill three children and three members of the staff. The lawsuit on May 1 is not the only one that's been filed, and it's unclear exactly which 'pending litigation' Metro police is referring to in their recent statement. ",
        "Last week, a Nashville police source initially confirmed the release of the document to the New York Post as demands for Hale's writings grew louder on social media and across the country. But that all appears to have changed this week following another lawsuit filed in the Chancery Court of Tennessee, Davidson County, which is against the Metropolitan Government of Nashville and Davidson County, requesting for a court order to force Metro Nashville police to turn over certain records.",
        "The Tennessee Firearms Association had previously filed two open records requests, including the 'manifesto' and also sought disclosure of 'all email communications of MNPD officials regarding the mass shooting committed by Audrey Elizabeth Hale on March 27, 2023, as well as MNPD officials' text messages regarding the same, and copies of the 'manifesto' reported left by Audrey Elizabeth Hale in her vehicle.'Hammond told the Chattanooga Times Free Press that he joined the lawsuit to ensure transparency on how the situation was handled by law enforcement and responding agencies is upheld.'It's just that we want open transparency in regard to a way that case was handled and especially information that may be helpful to police in saying that this doesn't happen again,' Hammond said.Records sought in the lawsuit reportedly contain material including body camera footage, photos, impound and evidence invoices, coroner information, toxicology reports, audio calls for service and surveillance footage.",
        "'We'll take a look at that material and will advise other groups, including law enforcement, of any information that might be germane to keeping citizens safe in their own county,' Hammond explained.The lawsuit filed on Monday came after Nashville authorities denied a public records request by a Washington, D.C.-based nonprofit organization.At that time, a spokesperson for the police department told Fox 17 in Nashville that 'the investigation has advanced to the point that writings from the Covenant shooter are now being reviewed for public release. That process is underway and will take a little time.'",
        "Hale fired 152 rounds from two assault rifles and a handgun, murdering Hallie Scruggs, William Kinney, Evelyn Dieckhaus, all 9, and headmistress Dr. Katherine Koonce, 60, substitute teacher Cynthia Peak, 61, and custodian Mike Hill, 61.No motive for the massacre has yet been given. Officers retrieved the 'manifesto' - along with hand-drawn maps, a suicide note, 20 journals, laptops, phones and several writings, from Hale's home and the Honda Fit she left in the school parking lot.One official with the Metro Nashville Police Department said the contents of Hale's manifesto 'keeps him up at night.'The manifesto has been shared with the FBI's behavioral analysis unit in Quantico, Virginia, and detail Hale's 'planning over a period of months to commit mass murder' at the school, according to police.",
        "For some, Hale's decision to target the Christian elementary school she once attended, together with her changing gender identify, suggest the attack was a manifestation of violent transgender activism.Hale was born female but used the names Audrey and Aiden, together with he/him pronouns. There is a debate over how to correctly refer to her in media reports. She's been described as having 'high-functioning autism.'Reporters have revealed that Hale's conservative, Christian parents could not accept she was gay or trans, which may amount to personal motivations for the attack. She was also grieving the recent death of a friend in a vehicle accident.",
        "On the day of the shooting, Hale attacked the school, which she previously attended, at around 10 in the morning. She sent a suicide note to an old friend before storming into the school.Within minutes, Hale shot and killed six people, including three students. Police entered the school about ten minutes later and gunned her down.Police have previously said Hale mentioned another location in her manifesto, but decided that there was too much security to launch an attack.",
        "9:30am – Metro Police Chief John Drake confirmed that Audrey Hale, 28, left her parents property with a red bag. She was questioned by her mother about the bag but dismissed the question.9:53am — Hale arrives at the Covenant School in her Honda Fit. She is seen in surveillance footage driving around the parking lot, going out of frame and parking at about 9:55 a.m.9:57am – Hale sends a goodbye message on Instagram to Averianna Patton. The message said: 'This is my last goodbye. I love you. See you again in another life.' She then responds, telling Hale that she has so much more to live for.Hale replies again, saying one day, 'this will make more sense' but 'something bad is about to happen.'10:03am - Averianna Patton calls the suicide prevention hotline to try to report the messages that she has been sent by Hale. They tell her to contact the local sheriff's department.10:10am – Hale approaches a side entrance to the private Christian school and shoots through the glass doors to gain entry with her two AR-style rifles and a handgun.10:12am – Patton makes an emotional call to 911 asking them to check on Hale after the disturbing messages. She is told that there is not much officers can do without an address for her.10:13am – First shots-fired call to 911.10:14am – Hale walks through a school hallway and walks around the property for several minutes. She then passes the children's ministry before firing shots at 10:21 a.m. and then walking out of the video frame.10:24am – The first Metro Police officers arrive on the scene, with Officer Englebert unlocking the door and entering the school. The five-member tactical unit enters the school and starts its search for the shooter.10:27am – The team of officers encounters the shooter on the second-floor atrium. Police said Hale had been firing through a window at arriving officers. Englebert, alongside Officer Michael Collazo, shot and killed Hale."
    ]
}