{
    "articleURL": "/debate/article-12054999/Penny-Mordaunt-looked-like-one-fiercest-Roman-goddesses-invite-politicians.html",
    "content": [
        "Was this Coronation a beginning or an end? As I watched its mostly ancient ceremonies, a briefly opened door into the astonishing past, I was often moved. It was full of glory, though rather melancholy glory.The settings by William Byrd of the prayer Prevent Us, O Lord and of the Gloria are among the greatest music ever written.Likewise, Handel's Zadok The Priest seems for a few moments to have discovered the actual heartbeat of the universe.But I was repeatedly reminded of something rather disturbing. It was T. S. Eliot's lines from his poem The Journey Of The Magi: 'I had seen birth and death / But had thought they were different.'To me, this event seemed more like a continuation of the Queen's lying-in-state and funeral than like the start of a new period in our lives.",
        "I kept thinking, especially when I glimpsed the very modern beauty of the Princess of Wales, and when we briefly heard the voice of the heir to the throne (so unlike his father's), 'This can never be done again'.I am an annoying purist, and my view has long been, 'if it is not necessary to change, it is necessary not to change'. I had watched and studied the 1953 service and knew that this event could not equal it.On that occasion, the aged, stooped and wrinkled old establishment – white-haired bishops from the Victorian age, nobles in moth-eaten robes and dented coronets – had acclaimed a beautiful young Queen and imagined that just possibly she could revive a war-damaged and impoverished nation; that, as the service itself says, the monarch would 'restore the things that are gone to decay, [and] maintain the things that are restored'.This time we saw a King, well into his 70s, being crowned and escorted by bishops and officials significantly younger than himself, quietly expecting his reign to end before their active lives finish.The ancient nobles who shouted their allegiance to Elizabeth in 1953 were investing hopes in a future they would not see. The assembly of the modern elite yesterday were indulging the past.Like many who watched, I was fascinated by the majestic central role played by the Lord President of the Council, Penny Mordaunt, looking like one of the fiercer and more demanding Roman goddesses as she bore her sword.What can Ms Mordaunt, born in 1973, have made of a ceremony in which her head of state was anointed into a mystical priesthood and clothed in gold raiment?As a Tory she has to respect it, and she certainly knows how to behave, but does it truly make much sense to her?Rishi Sunak made a very good job of reading from scripture, clearly understanding the words he spoke and not despising them, but what were these politicians even doing there? They never used to play such roles in coronations.",
        "Let us be grateful that the event did not take place under a Labour government. A Labour conference debated the monarchy once, 100 years ago, and decided that it was wiser to keep quiet from then on.Let me put it like this. You can generally get senior Labour figures to declare that they are 'not republicans', at least not at the moment (though Sir Keir Starmer is on the record as an opponent of monarchy). But if you ask them if they are monarchists they become coy and change the subject.We also saw the new King being only slightly indulged by a Church which is generally pretty dismissive of the traditions and practices that Charles loves.I noticed (because I share his view) that the new King did not even manage to get the Archbishop to use his beloved 1662 Book of Common Prayer for the Communion Service. Charles actually belongs to a society dedicated to the continuing use of the 1662 book, but even as King he can't preserve it in his own Coronation. Instead he was forced to endure the sapless, diminished pastiche adopted by the Church of England in 2000.This is part of a long process by which the once-national Church has trashed its most precious possessions: the most moving and poetic prayers ever written in English, and the most magnificent and memorable version of the Bible ever translated.Given full freedom – and a future King may concede this – the Church would probably give us a Coronation featuring drums, electric guitar and perhaps ending with a recording of John Lennon singing Imagine.I was slightly surprised (though not distressed) to see that there were no members of the Beatles or the Rolling Stones invited to the Abbey. They are the nobility of the modern world. Inviting them would make a sort of sense, if modernisation is what you want (it isn't what I want).And then there was the strange feeling that we had all got too close to events. Somehow such ceremonies are more powerful if half-heard from afar while straining your eyes to see. Yet the cameras can now swoop in so close that you can see the stitching and the wiring. To me, it made the whole thing more ordinary, more flat.And no doubt statistics will prove me wrong, but London seemed less crowded than even I, an Olympic-standard pessimist, would have expected. On my way to work around 8am yesterday, I was surprised to find my train was far from full, and there was little sign, in the towns and villages we passed through, of any great celebration. Likewise, London seemed to be going on much as usual.As I watched a crucial part of the ceremony on TV, I was surprised to receive a phone call from a perfectly nice person in her 50s, who was obviously quite unaware that the Coronation was taking place, let alone that it had reached its supreme moment, the anointing. I do not believe this would have happened in 1953.I am sorry about all this. I think that constitutional monarchy is the best form of government ever devised. I think that, if republicans get their way, we will be a poorer, sadder, drearier and less free society, many of us yearning (as do the French) to restore what they so foolishly got rid of. But I just do not think that, as a people, we still have the spirit, the understanding or the religious belief necessary for us to be a kingdom.The first Queen Elizabeth, by far our greatest monarch, knew this above all things, saying soon before she died: 'And, though God hath raised me high; yet This I count the Glory of my Crown, That I have Reigned with your Loves… I do not so much rejoyce, That God hath made Me to be a Queen, as, To be a Queen over so Thankful a People.'Oh, if only we could recover that, then we might be a proper nation again."
    ]
}