{
    "articleURL": "/wires/ap/article-12057477/Mets-fall-500-Doyle-lifts-Rockies-13-6-win.html",
    "content": [
        "NEW YORK (AP) - After spending about nine minutes Sunday absorbing questions about what´s wrong with the skidding New York Mets, Buck Showalter boiled down the debate to a simple bottom line.",
        "\"What I´m concerned with is Ws and Ls,\" Showalter said. \"A lot of that stuff is great fodder for evaluating and analyzing. But it´s about a W or an L.\"There are too many Ls and not nearly enough Ws lately for the Mets, who fell under .500 for the first time since early April as Brenton Doyle´s first big league home run capped a seven-run fifth inning in the Colorado Rockies´ 13-6 win.The Mets are 3-11 since opening 14-7. New York didn´t spend a day under .500 last season on its way to winning 101 games, second-most in franchise history, and their only time with a losing record this year had been at 3-4.\"The old saying when it rains it pours? Things aren´t going the way that we want right now,\" said designated hitter Daniel Vogelbach, whose baserunning miscue ended a three-run first inning. \"The game´s challenging us and we have a lot of baseball to play.\"The six runs were as many as the Mets scored in their previous four games combined, but the 13 runs allowed were a season high. New York is tied for eighth in the NL with 150 runs while its pitching staff - which has received just 27 2/3 innings from co-aces and former Cy Young Award winners Max Scherzer and Justin Verlander - ranks 11th with a 4.74 ERA.",
        "\"Just play better,\" Showalter said. \"Not really quite as difficult as some people may perceive it to be. It´s up to us to identify some of those things and get better at it and get back to things we do well - and have done, not only last season but this season.\"The Mets, who hit .275 in the first inning of games last season, entered Sunday with six first-inning runs this year before mounting an immediate rally against Ryan Feltner. Rookie Brett Baty, whose two-run single gave New York a 3-0 lead, was nearing home plate on Luis Guillorme´s two-out single when shortstop Ezequiel Tovar grabbed a relay throw from right fielder Kris Bryant and tagged Vogelbach, who´d overran second on the hit.\"I think it´s something that Daniel probably wishes he had over,\" Showalter said. \"We did a lot of other things to make that not matter in a bad way.\"Jurickson Profar and Kris Bryant had RBI hits in the third, and Bryant´s two-run homer sparked the big fifth inning against Jimmy Yacabonis (1-2), who allowed five runs while recording one out.The three-RBI game was the first for Bryant since Sept. 22, 2021, when he was with the San Francisco Giants. Bryant was limited to 42 games in 2022 - the first season of his seven-year, $182 million deal - due to back and foot injuries.",
        "\"Kris is a pro,\" Rockies manager Bud Black said. \"That ball was well-struck. He had a good game.\"Tovar had a two-run double and Austin Wynns delivered an RBI single before Doyle´s two-run shot to right field.Doyle hit 78 homers in 292 minor league games before being recalled by the Rockies on April 24.\"I was stoked,\" Doyle said. \"I´ve been waiting for it. Finally came and felt great off the bat. Knew it as soon as I hit it.\"Randal Grichuk homered in the first and Doyle had an RBI infield single in the seventh, his third hit of the game. Wynns lofted a sacrifice fly in the ninth and Doyle raced home on a wild pitch for the Rockies, who have won three of their last four series since a 6-17 start.Jeff McNeil added a pair of RBI singles for the Mets while Guillorme had a run-scoring hit in the fifth. Vogelbach homered leading off the seventh.Brent Suter (1-0) allowed one run in 1 2/3 innings.Feltner gave up four runs but walked six in 3 1/3 innings for the Rockies. Joey Lucchesi, starting on three days rest for the Mets, allowed three runs in four innings.BARTOLO´S HOMER ANNIVERSARYPopular former pitcher Bartolo Colon threw out the ceremonial first pitch to celebrate the seventh anniversary of his lone big league homer, a 365-foot shot off San Diego´s James Shields. The Mets aired the clip of Colon´s homer before the former pitcher, dubbed \"Big Sexy\" near the end of his career, walked to the mound to Justin Timberlake´s \"Sexy Back.\"",
        "Colon, who last pitched in the big leagues in 2017 and turns 50 on May 24, laughed after bouncing a pitch to Francisco Lindor and later hugged Rockies manager Bud Black, his pitching coach when Colon won the AL Cy Young Award for the Angels in 2005.WELL-TRAVELED WYNNSWynns made his first start for the Rockies, the third NL West team he´s played for this season. Wynns appeared in one game for the Giants before he was designated for assignment and was claimed by the Dodgers, his team for five games before he was cut.TRAINER´S ROOMRockies: DH/RF Charlie Blackmon received a planned day off. Manager Bud Black said 1B C.J. Cron will likely get the night off Monday, when Colorado begins a three-game series against Pittsburgh.Mets: RHP Carlos Carrasco (right elbow), whose rehab plans were paused due to a bout with flu-like symptoms, will likely need two minor league starts before returning to the rotation. ... LHP Brooks Raley (left elbow) is expected to make a rehab appearance Wednesday.UP NEXTRockies: A six-game trip continues as LHP Kyle Freeland (3-3, 3.76 ERA) opens a three-game series in Pittsburgh. Freeland has allowed three runs or fewer in five of his seven starts this season.Mets: RHP Max Scherzer (2-2, 5.56 ERA) takes the mound in Cincinnati on Tuesday for the opener of a three-game series. Scherzer´s ERA through five starts is the second-highest of his career, ahead of only 2012, when he began the season with a 7.77 ERA.",
        "___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}