{
    "articleURL": "/tvshowbiz/article-12051281/Jamie-Foxxs-former-costar-Natasha-Blasick-says-hes-recovering-crazy-medical-issue.html",
    "content": [
        "Jamie Foxx is making strides as he attempts to regain his health, his former costar Natasha Blasick claimed on Thursday night.",
        "Blasick revealed that Foxx, 55, was alert enough to be texting with her, and she claimed that a mutual friend who was close with the Oscar winner assured her that he was getting better, according to ET.The actress, who costarred with the recuperating actor in his shelved film All-Star Weekend, was in Los Angels to attend the John Ritter Foundation's 20th Anniversary Fundraiser: An Evening From the Heart.Foxx has been on the mend in an Atlanta-area hospital since he suffered a medical emergency in April during the filming of his upcoming Netflix action comedy Back In Action, which marks the return — and possible final film — of Cameron Diaz.Blasick wasn't the only one to indicate the actor was improving, as his friend Kevin Hart also said he was 'getting better.' ",
        "'I was texting him, and just yesterday I talked to his friend, who's like really in touch with him,' Blasick said. 'I was, like, really freaking out [with] all of the news that he's getting worse. 'So I was texting [his friend], and he's like, \"No, no, no, he's recovering.\" So just hearing that he was recovering made me feel so much better,' she added.'I'm just praying. And my friend yesterday reached out to me, and she's like, \"Let's pray together.\" I mean, it's really crazy,' Blasick continued. 'All we have in this world is our health. Our life. So it's very scary.'",
        "Blasick worked with Foxx on All-Star Weekend, which began filming in 2012.The comedy starred the Miami Vice actor and Jeremy Piven as to basketball-obsessed truck drives who win tickets to the NBA All-Star Game.However, on their way to the game they meet a mysterious woman (Eva Longoria) who threatens to upend their chance at seeing the game.The star-studded movie was intended to be released to coincide with the 2018 All-Star Game, and then the 2019 game, but it was delayed both times, before being shelved indefinitely.Foxx told CinemaBlend last year that the film would no longer be released because Robert Downey Jr. — who is white — played a Mexican character in the movie, which he compared to his controversial portrayal of an white Australian man wearing Blackface in Tropic Thunder.",
        "That earlier role was a critique and satire of the offensive practice, but younger viewers are more likely to find the practice too offensive to even joke about.Kevin Hart recently gave a positive health update on Foxx and revealed that 'there's a lot of progression' during Tuesday's episode of the Impaulsive podcast, which comes three weeks after the actor suffered a medical emergency. Despite his hospitalization, Foxx broke his silence on Instagram earlier on Wednesday to express he was 'feeling blessed' by the love and support he has received.",
        "Hart, 43, explained to host Logan Paul: 'I'm very fortunate to have the relationship that I have with Jamie and to be able to just check on him and stuff like that.' The Me Time actor added that Foxx's family was continuing to be 'tight and for reasons just about where he is, because Jamie's always been a private person to a certain degree.'Kevin stated that the outpouring of love has been a major influence in Jamie's recovery. 'The dope thing is that he's getting better in his situation, and you know, everybody's prayers, everybody's love, energy. All that stuff is seen and felt.' 'So in this case, man, you know, you just want the guy to get out of the situations and then get back home,' the Die Hart star continued. 'You know, I don't know the details, or the exact details to what's going on, but to my knowledge is there's a lot of progression and a world of better, man.' ",
        "The comedian movingly added about his close friend: 'So you know, my love, synergy, energy goes out to him. He's needed, he's necessary. I know that he knows that.'I know that he feels that because there's been an outcry, an outpour of support in this regard. So, I can only hope that it continues,' Hart added about the Oscar winner. ",
        "On Wednesday, Jamie himself took to his main Instagram page to express his gratitude for the overwhelming support he has received after suffering a medical emergency on April 11. 'Appreciate all the love!!! Feeling blessed,' he typed out to his 16.2 million fans and followers. Social media users, including celebrities, jumped to the comment section to continue to send their love to the Ray actor. Jeremy Renner, who spent time in hospital following a snowplow accident earlier in January, penned: 'Sending you strength and love,' followed by a red heart emoji. Backstreet Boys member AJ McLean wrote: 'Hey bro. AJ from Backstreet Boys my man your in my prayers day and night bro. Lets get you better and home.' Fast &amp; Furious star Vin Diesel added a praying hands emoji.Ansel Elgort movingly typed, 'You are the greatest Jamie, please make a speedy recovery. You are a blessing to this world, we need you in it.' ",
        "On April 12, Jamie's daughter, Corinne Foxx, issued a statement on Instagram to announce that her father was in the hospital due to a 'medical complication' but did not disclose further details. 'From the Foxx family: We wanted to share that, my father, Jamie Foxx, experienced a medical complication yesterday. Luckily, due to quick action and great care, he is already on his way to recovery.' ",
        "'We know how beloved he is and appreciate your prayers. The family asks for privacy during this time. Much love, The Foxx Family.' Before his hospitalization in Georgia, Jamie was notably in Atlanta filming his latest project titled, Back In Action, with Cameron Diaz also tackling a leading role in the film. The actress's last big film was the Annie remake which premiered nearly 10 years ago in 2014. While he continues to recover from his health situation, filming for Back In Action has resumed, with stunt doubles taking Jamie's place as of now, reported People.  It was also announced on Wednesday that Nick Cannon will fill in as guest host for Jamie on Fox's Beat Shazam.The series is a music game show where teams of two try to identify hit songs, and the team with the most money then competes against the Shazam app, with the possibility of winning $1 million. Corrine also reposted the statement, which read, 'Beat Shazam has been an unscripted mainstay on the FOX schedule for six seasons and counting.' 'This season, not wanting fans of the game show to miss a minute of fun, Nick Cannon has offered to fill in as guest host for his friends, Jamie and Corinne Foxx. Kelly Osbourne will be filling in as guest DJ.' ",
        "'Everyone at FOX Entertainment wishes Jamie well as he continues his recovery, and we greatly appreciate Nick's willingness to jump in and help this summer.' The sixth season the game show is slated to premiere later this month on May 23.   ",
        "Foxx also reposted the statement that announced Nick filling in on his Instagram stories, and typed, 'Appreciate ya my boy @nickcannon. See u all soon.' Cannon previously sent his love to Jamie while talking to Entertainment Tonight last month, and stated, 'Man, I'm praying.' 'You see, I posted on Instagram. I literally have been saying prayers out loud. Words of affirmation for my big brother.' Other stars have also made statements of their own following the news of Jamie's health status, including Garcelle Beauvais, who penned, 'This an appreciation post for my friend @iamjamiefoxx. J I love you so much!!! I want &amp; need you to get better soon. sending you light love and prayers.'  "
    ]
}