{
    "articleURL": "/wires/ap/article-12055337/Butler-scores-28-Heat-Knicks-105-86-2-1-series-lead.html",
    "content": [
        "MIAMI (AP) - It was one of the worst shooting games of the season for the Miami Heat, by far: 39% from the field, 22% from 3-point range, barely 50% on usually easy shots at the rim.",
        "Didn't matter.Defense - still the Heat staple, even in these high-scoring NBA days - came through, and moved Miami two wins away from another trip to the Eastern Conference finals.Jimmy Butler returned from his sprained right ankle to score 28 points, Max Strus added 19 and the Heat topped the New York Knicks 105-86 on Saturday to take a 2-1 lead in their East semifinal series.\"It's about figuring out how to compete at a really high level,\" Heat coach Erik Spoelstra said. \"What's necessary for that game to be able to win.\"For as poorly as the Heat shot, the Knicks were worse - 34% from the field, 20% from 3-point range, 46% from the restricted area around the rim.",
        "And that was the story.\"You've got to win games different ways,\" Heat guard Kyle Lowry said. \"In the playoffs, like I've said many a time and for many years now, every game is seriously different. And this is one of those games where we held them down. ... To win by half a point, one point, two points, 20 points, it's about winning the game however it happens.\"Jalen Brunson scored 20 for New York, which got 15 from Josh Hart, 14 from RJ Barrett and 12 from Immanuel Quickley - who left midway through the fourth quarter after spraining an ankle that will be evaluated again Sunday. Julius Randle added 10 points and 14 rebounds for the Knicks.",
        "Game 4 is Monday.\"We couldn't get stops early so we couldn't get any easy buckets,\" Knicks coach Tom Thibodeau said. \"So, we paid the price.\"Bam Adebayo had 17 points and 12 rebounds for Miami and Lowry added 14 points as the Heat never trailed. Duncan Robinson opened the second quarter with a 3-pointer, giving Miami an 11-point lead - and the lead remained double digits the rest of the way.\"Hopefully we can get back on the right track and find a way to make some shots next game and come out with a win,\" Randle said.There was even a Heat-Knicks dustup under a basket, just like the good ol´ days of the teams' playoff rivalry - though this one was nothing like P.J. Brown flipping Charlie Ward in 1997 to start a bench-clearing mess that led to suspensions, or Jeff Van Gundy tugging on Alonzo Mourning´s leg in 1998.This one, such as it was, happened with 14.7 seconds left in the third, after a basket by Quickley got the Knicks within 87-70.Randle and Cody Zeller got tangled as they fought for rebounding position. Randle ended up getting shoved to the floor, Isaiah Hartenstein took offense and shoved Zeller, Caleb Martin took offense and shoved Hartenstein, and it took about five minutes to sort out a mess that lasted for about five seconds.",
        "The final tally: offsetting technicals on Zeller and Hartenstein, plus a technical on Martin. Randle missed the free throw. And right after it happened, Butler was dancing a bit, enjoying the aftermath of the show.\"Much ado about nothing,\" Spoelstra said.Butler missed Game 2 with his ankle sprain and limped at times in the second half Saturday, but was effective throughout. He had 10 points in the opening quarter as Miami set the tone on both ends; the Heat made 10 of their first 15 shots, the Knicks missed 13 of their first 17, and it took until midway through the second quarter for New York to make a shot from anywhere other than the paint.\"We always said we can win games when we defend and not make shots,\" Butler said. \"And this is one of those games.\"TIP-INSKnicks: The 86 points were New York's second-fewest of the season. The Knicks had 85 in a loss to Brooklyn on Nov. 9. ... Barrett was whistled for a technical foul early in the second quarter for throwing the ball into the stanchion in frustration.Heat: Miami outscored New York by 13 in Martin's 23 minutes. ... Udonis Haslem (stomach illness) missed the game. It was the 224th Heat playoff game of his 20-year tenure; he´s played in 148 of those, but this was his first postseason instance of being listed as inactive.",
        "SCORING SPREEThe 58 first-half points by Miami were the most for a team by halftime of a Heat-Knicks playoff game. The Heat had 57 in the first half vs. New York on April 24, 1998. New York´s most by halftime in a playoff game against the Heat is 55, set in Game 1 of this series.CLANKThe teams combined to shoot 15 for 72 on 3-pointers - 8 for 40 by the Knicks, 7 for 32 by the Heat. It was the 1,290th game played in the NBA this season and only eight other had a worse combined 3-point percentage than the .208 put together by New York and Miami in this one.EXPERIENCE MATTERSThe Heat have a huge edge in this series when it comes to playoff experience. Lowry played in his 115th playoff game, Butler his 104th, Kevin Love his 71st, Adebayo his 54th and Robinson his 46th. Brunson played his 33rd, which is tops among those in the Knicks' rotation.___AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP_Sports"
    ]
}