{
    "articleURL": "/sciencetech/article-12038915/Underwater-cemetery-Dry-Tortugas-National-Park.html",
    "content": [
        "An underwater cemetery off the coast of Florida has been discoveredOnly one grave has been identified, but records show dozens are thereThe cemetery is the final resting place of soldiers stationed at Fort Jefferson A large slab of rock marked with the name of a man who died in 1861 is one of several graves found in an underwater cemetery off the coast of Florida.",
        "The cemetery holds the remains of soldiers and laborers who died at a 19th-century quarantine hospital on a now-submerged island in Dry Tortugas National Park.Only the grave of John Greer, a laborer who died on November 5, 1861, has been identified, but historical records show dozens of people were laid to rest at the site in the Gulf of Mexico.Many were soldiers stationed and prisoners housed at Fort Jefferson who were treated and died at the hospital. The National Park Service explained there were disease outbreaks, including yellow fever, on the island that killed dozens of people from the 1860s to 1870s - and archaeologists plan to uncover each of the lost graves.",
        "Dry Tortugas National Park is comprised of seven islands, coral protected reefs and is home to the 19th-century Fort Jefferson.The surrounding islands became a naval outpost, a lighthouse station, a naval hospital, a quarantine facility and a site for military training.The risk of infectious diseases, including outbreaks of mosquito-borne yellow fever, increased as the fort's population grew with military personnel, prisoners, enslaved people, support staff and their families.The fort was abandoned in 1873, but the Marine Hospital Service occupied it again between 1890 and 1900, and an isolation hospital was set up on a nearby island.",
        "Josh Marano, a maritime archeologist for the South Florida national parks and the survey's project director, said in a statement: 'This intriguing find highlights the potential for untold stories in Dry Tortugas National Park, both above and below the water.'Although much of the history of Fort Jefferson focuses on the fortification itself and some of its infamous prisoners, we are actively working to tell the stories of the enslaved people, women, children and civilian laborers.'Fort Jefferson was built to protect one of North America's most strategic deepwater anchorages. And remains of the structure are still standing today.Construction of the fort began in 1846 and continued for 30 years - even though it was never entirely finished.",
        "The structure was set up to protect one of North America's most strategic deepwater anchorages during the Civil War.The fort also housed prisoners after the Civil War, with the most famous being Samuel Mudd, who was sent there for his involvement in the assassination of President Abraham Lincoln.Mudd was pardoned in 1869 by President Andrew Johnson, in part for his life-saving work during a yellow fever epidemic at Fort Jefferson.During its time, Fort Jefferson held over 2,500 prisoners. Historical records show the site of the hospital, Key West Quarantine, was approved by Congress on August 2, 1888.",
        "After its use as a prison, Fort Jefferson became a quarantine station for the Marine Hospital Service from 1888 through 1900, during which the location was also used in the Spanish-American War.",
        "'The find also highlights the impacts of climate change on resources in the Dry Tortugas,' the National Park Service said in the announcement.'While the facilities identified in this survey were originally built on dry land, the dynamic conditions caused many of the islands to move over time. 'Climate change and major storm events have even caused some islands to settle and erode beneath the waves.'Archaeologists are now hoping to uncover more about Geer and other indvidiuals buried at the bottom of the Gulf. The remains of the hospital as well as the surrounding cemetery have been documented as an archeological resource and will be routinely monitored by members of the South Florida National Parks Cultural Resources Program. "
    ]
}