{
    "articleURL": "/wires/reuters/article-12046303/PacWest-Western-Alliance-hit-US-banking-concerns-widen.html",
    "content": [
        "By Medha Singh and Chibuike Oguh",
        "May 4 (Reuters) - Shares of PacWest Bancorp plunged on Thursday, dragging other regional lenders down after the Los Angeles-based bank's plan to explore strategic options sparked investor worries of a widening financial crisis.PacWest's stock slumped more than 40% in afternoon trading, dropping to a record low. The bank had confirmed an earlier Reuters report on Wednesday that it was exploring strategic options, including a potential sale or capital raising.Western Alliance shares pared losses after plummeting by nearly 60% following a Financial Times report that the lender was exploring strategic options, including a potential sale of all or part of its business. Western Alliance denied the FT report, calling it \"categorically false in all respects,\" and said it was weighing legal options against the newspaper. The bank's stock was down nearly 35% in afternoon trading.Western Alliance has been seeking to reassure investors about its financial stability. On Wednesday it said it had not seen unusual deposit outflows following the sale of collapsed lender First Republic Bank to JPMorgan Chase &amp;amp; Co on Monday.First Republic's collapse, the third major casualty of the biggest crisis to hit the U.S. banking sector since 2008, rekindled a slide in shares of regional lenders this week despite regulatory efforts to staunch the turmoil that began with the collapse of Silicon Valley Bank in March.",
        "U.S. officials at the federal and state levels are assessing the possibility of \"market manipulation\" behind big moves in banking share prices in recent days, a source familiar with the matter told Reuters on Thursday.\"Nobody knows where these banks should be trading at because what we saw with Silicon Valley Bank is that the fundamentals can change so quickly,\" said Tom Plumb, portfolio manager at Plumb Balanced Fund in Madison, Wisconsin.\"This normally would have been a great opportunity to buy banks with premier regional presence and it may be, but the real concern is nobody knows what the rules are and what they are valued at,\" Plumb added.Zion Bancorp shed 12% and Comerica fell nearly 11%. KeyCorp and Valley National Bancorp were down 7% and 4%, respectively. The KBW Regional Banking index dropped 3.3%.Major U.S. banks were also losing ground on Thursday, with the S&amp;amp;P 500 Banks index falling nearly 3%. JPMorgan's shares fell 1.4%, while Bank of America declined 3%.The common theme among the banking stocks that have sold off sharply is that they reported large deposit declines in the first quarter, said Truist Securities analyst Brandon King, while calling the selloff \"overdone.\"PacWest Bancorp reported a loss of $1.1 billion attributed to shareholders for the first quarter of the year.",
        "Its shares have lost 72% of their value this year, making it one of the worst performers on the small-cap S&amp;amp;P 600 regional banks index, which has lost a third of its value in the same period.In another sign of stress within the regional banking sector, First Horizon Corp and Toronto-Dominion Bank Group announced on Thursday that they agreed to terminate their $13.4 billion merger owing to uncertainty over securing regulatory approvals for the deal.First Horizon shares plunged 32% after the news, while U.S.-listed shares of Toronto-Dominion Bank gained nearly 0.5%.U.S. Federal Reserve Chair Jerome Powell on Wednesday reiterated the banking system remains resilient despite \"strains\" in March, after the central bank delivered a 25-basis- point rate hike and signaled a pause in its tightening cycle. Powell also said bank deposits had stabilized. \"The Fed of course would react if a chaotic outflow of deposits from regional banks resumes,\" Citigroup analysts wrote in a note to investors. \"That risk is more elevated after recent banking developments and can never be fully taken off the table.\"(Reporting by Medha Singh in Bengaluru and Chibuike Oguh in New York, additional reporting by Amruta Khandekar; Editing by Lance Tupper, Devika Syamnath, Rosalba O'Brien and Deepa Babington)"
    ]
}