{
    "articleURL": "/news/article-12043617/How-Feds-latest-rate-hike-hit-wallet.html",
    "content": [
        "Fed on Wednesday raised its benchmark interest rate by a quarter pointMove will have the biggest impact on credit card and auto loan interest ratesOn the other hand, many banks are now finally offering higher yields for saversThe Federal Reserve has raised its key interest rate yet again in its drive to cool inflation, a move that will directly affect many Americans through higher borrowing rates.",
        "On Wednesday, the central bank boosted its benchmark rate by a quarter-point, to a range of 5 percent to 5.25 percent. Rates on credit cards and auto loans, which have been surging since the Fed began raising rates last year, will rise even more, with WalletHub projecting the latest rate hike will add $1.7 billion to US credit card bills over the next year. On the other hand, many banks are now finally offering higher rates on savings accounts, with new names including Apple offering yields of more than 4 percent and giving savers the opportunity to earn more interest.Mortgage rates, which are more dependent on long-term trends, aren't expected to rise much with the Fed's latest move, and could even trend downward. Economists worry, though, that the Fed's streak of 10 rate hikes since March 2022 could eventually cause the economy to slow too much and trigger a recession.",
        "HOW MUCH HIGHER WILL CREDIT CARD BILLS GO? The average credit card annual percentage rate, or APR, has already reached the highest since Bankrate.com began their tracking began in the mid-1980s, and is likely to rise further.According to Bankrate, the current three-month trend is an average APR of 20.24 percent, up from 16.41 percent a year ago.Although the Fed doesn't directly set the interest rate on your credit card, APRs tend to closely follow the central bank's moves, meaning rates will likely rise another 0.25 points. So if your current rate is 20.24 percent, it will likely rise to 20.29 percent.",
        "The Fed's latest rate hike will cost credit card users at least $1.7 billion in additional interest rate charges over the next 12 months, according to a study from WalletHub.That's on top of the $31.7 billion in extra credit card interest charges over the next year that the study attributes to the Fed's prior rate hikes since March of 2022.  Higher rates will only impact people who carry a balance on their credit cards - but the number of Americans with credit card debt is rising, and so are their outstanding balances. ",
        "The most recent data available showed that 46 percent of people were carrying debt from month to month, up from 39 percent a year ago. Total credit card balances were $986 billion in the fourth quarter of 2022, according to the Fed, a record high, though that amount isn't adjusted for inflation.For those carrying large credit card balances, even small increases in interest rates can make a difference over time.Suppose you have a $4,000 credit balance and your interest rate is 20 percent. If you made only a fixed payment of $110 per month, it would take you a bit under five years to pay off your credit card debt, and you would pay about $2,200 in interest.",
        "If your APR increased by a percentage point, paying off your balance would take two months longer and cost an additional $215.For those who don't qualify for low-rate credit cards because of weak credit scores,  higher interest rates are already affecting their balances.WILL MORTGAGE RATES CLIMB? Mortgage rates aren't expected to rise much in response to the latest Fed rate hike, as the mortgage markets have largely already accounted for the move.Mortgages have fixed rates that are priced with a far longer time-frame in mind than other borrowing vehicles, making them less reactive to Fed policy moves.'Although mortgage rates will continue to fluctuate in the following months, the overall trend will continue downward,' wrote Nadia Evangelou, senior economist at the National Realtors Association, in a note last week.Still, mortgage rates have more than doubled since the start of 2022, before the Fed began its aggressive path of interest rate hikes. Last week, mortgage buyer Freddie Mac reported that the average rate on the benchmark 30-year mortgage edged up to 6.43 percent from 6.39 percent the week prior. The NAR projects mortgage rates will fall to 5.8 percent by the end of the year. ",
        "A year ago, the average rate was lower: 5.10 percent. Higher rates can add hundreds of dollars a month to mortgage payments.",
        "Rates for 30-year mortgages usually track the moves in the 10-year Treasury yield. Rates can also be influenced by investors' expectations for future inflation, global demand for US Treasuries and what the Fed does.Most mortgages last for decades, so if you already have a mortgage, you won't be impacted. But if you're looking to buy and already paying more for food, gas and other necessities, a higher mortgage rate could put home ownership out of reach.WILL AUTO LOAN PAYMENTS INCREASE?With shortages of computer chips and other parts easing, automakers are producing more vehicles. Many are even reducing prices or offering limited discounts. But rising loan rates and lower used-vehicle trade-in values have erased much of the savings on monthly payments.Since the Fed began raising rates in March 2022, the average new-vehicle loan rate has jumped from 4.5 percent to 7 percent, according to Edmunds data. Used vehicle loans dropped slightly to 11.1 percent. Loan durations average around 70 months - nearly six years - for new and used vehicles.Largely because of rate increases, the average monthly payment for both new and used vehicles has risen since March 2022, Edmunds says. The average new vehicle payment is up $72 to $729, Edmunds says. For used vehicles, the payment rose $20 a month to $546.",
        "The higher rates will keep out of the market people who have the ability to wait for more favorable terms, said Joseph Yoon, Edmunds´ consumer insights analyst.\"But with inventory levels improving, it´s a matter of time before discounts and incentives start coming back into the equation,\" attracting more buyers, Yoon said.New vehicle average prices are down from the end of last year to $47,749. But they're still high compared with even a year ago. The average used vehicle price dropped 7 percent from last May's peak, to $28,729, but prices are edging back up .Financing a new vehicle now costs $8,655 in interest. Analysts say that's enough to chase many out of the auto market.Any Fed rate increase is typically passed through to auto borrowers, though it will be offset a bit by subsidized rates from manufacturers.WILL SAVINGS ACCOUNTS OFFER HIGHER RETURNS? After years of paying near-zero rates for savers, some banks are finally offering better interest on deposits. Though the increases may seem small, compounding interest adds up over the years.Interest on savings accounts don't usually closely track what the Fed does. But as rates have continued to rise, some banks have improved their terms for savers as well. Even if you're only keeping modest savings in your bank account, you could make more significant gains over the long term by finding an account with a better rate.",
        "The biggest national banks have yet to dramatically change the rates on their savings accounts, clocking in at an average of just 0.23 percent, according to Bankrate.",
        "However, some mid-size and smaller banks have made changes more in line with the Fed's moves.Online banks in particular - which save money by not having brick-and-mortar branches and associated expenses - are now offering savings accounts with annual percentage yields of between 3 percent and 4 percent, or even higher. Last month, iPhone maker Apple unveiled a savings account that will pay a 4.15 percent yield for Apple Card users. The savings account is in collaboration with Apple's consumer banking partner Goldman Sachs - and actually pays out more than the 3.90 percent Goldman pays for deposits under its Marcus brand. Savers can also find rates of 4 percent or higher on one-year Certificates of Deposit (CDs). Some promotional rates can reach as high as 5 percent.A 24-month CD, a common savings product for medium-term savers, is now carrying an average yield of 4.81 percent, according to the Federal Reserve Bank of St. Louis. That´s up from a 1.18 percent yield only a year ago. "
    ]
}