{
    "articleURL": "/wires/reuters/article-12038131/Iran-resorts-security-cameras-ostracism-deter-unveiled-women.html",
    "content": [
        "Iran adopts less obtrusive ways to enforce hijab",
        "Measures have yet to deter opponents of headscarfVans of morality police no longer seen in publicNew measures may worsen economic pressuresSome lawmakers worry about provoking new protestsBy Parisa HafeziDUBAI, May 2 (Reuters) - Wary of re-igniting Iran's worst political turmoil in years, the country's rulers are resorting to new, less obtrusive tactics to punish women who refuse to wear the obligatory Islamic hijab.The methods, introduced following nationwide anti-government protests last year, combine use of security cameras with denial of state services to violators, replacing the morality police whose actions were the flashpoint for the months of unrest.The measures have yet to make much headway against opposition to the hijab, and could worsen economic pressures if they result in the closure of businesses, Iranian activists say.\"Walking unveiled in the streets is now my way of keeping our revolution alive,\" said Roya, 31, a private tutor in the northern city of Rasht, who was arrested during protests in November and detained for three months.\"We are not scared of the regime's threats. We want freedom ... This path will continue until we regain our country from the clerics,\" Maryam, a high school girl in Iran's western Kermanshah city, told Reuters.\"What is the worst case scenario if I walk in the street without hijab? Arrest? I don't care.\"",
        "For decades women who refused to wear the hijab were accosted by morality police operating from vans that patrolled busy public spaces. The vehicles' mixed male and female crew would watch for \"unIslamic dress and behaviour\".But those vans have mostly vanished from streets of cities they used to patrol, residents told Reuters, after the protests confronted Iran's clerical rulers with their worst legitimacy crisis since the 1979 Islamic revolution.Iranian officials have also said morality police patrols would no longer spearhead the campaign against those flouting the dress codes.NOVEL TACTICSIn place of the vans, authorities are installing cameras on streets to identify unveiled women, providing a more discreet method of detecting breaches of Iran's conservative dress code.Another novel tactic is a government order to both private and public sectors not to provide services to \"violators\". Warnings of heavy fines and even imprisonment have been issued.Yet growing numbers of women have defied authorities by discarding their veils in the wake of the protests, which erupted after the death of a 22-year-old Iranian Kurdish woman who was arrested for allegedly violating hijab rules.Security forces violently put down the revolt, and the street demonstrations largely fizzled in February.Her death in September in the custody of morality police unleashed years of pent up anger in society over issues from economic misery to tightening political controls.",
        "Now women show up frequently unveiled in malls, airports, restaurants and streets in a display of civil disobedience.Several lawmakers and politicians have warned that the protests could resume if authorities continue to focus on penalising women who discard the hijab. Parliament speaker Mohammed Baqer Qalibaf drew criticism from economists and politicians when he said on April 14 that pursuing the issue of the hijab did not conflict with developing the economy.Saeid Golkar, an assistant professor of political science at the University of Tennessee at Chattanooga, said enforcing the hijab law was aimed at satisfying \"the authoritarian regime's small social base of conservative and religious people\".Since being freed on bail, Roya has been banned from leaving the country and called in several times for questioning.\"I might be jailed again, but it is worth it. I want my country to be free and I am ready to pay the price,\" Roya said.Like the dozen other women interviewed for this story, Roya asked not to be identified due to security concerns and for fear of the consequences of speaking to foreign media.\"I go out unveiled everyday to show that the opposition to the rulers is still alive, \" said Minou, a 33-year-old woman in the holy Shi'ite city of Mashhad who said she was beaten and her brother was detained by security agents during the protests.",
        "ECONOMIC WOESThe new anti-hijab tactics may worsen Iran's economic woes, according to an Iranian insider close to top decision-makers.Thousands of businesses have been closed for days, including a shopping mall in Tehran with 450 shops, according to state media, because its employees failed to observe the mandatory hijab law and had been serving unveiled women.With an economy hit by U.S. sanctions and mismanagement, Iran has faced nearly continuous protests by workers and pensioners for months over an inflation rate of more than 50%, high unemployment and unpaid wages.Iranian state media have aired footage of women without hijab being barred from using public transportation, while the ministries of health and education have stated that services would not be offered to those flouting the Islamic dress code.\"My grocery shop was closed down for a few days by authorities for serving unveiled women,\" said Asghar, 45, in the central city of Isfahan.\"I must work to take care of my family. I barely make ends meet. I don't care whether my customers are veiled or unveiled.\"For 20-year-old Shadi, attending her classes at a northern Iran university has become \"a daily fight for freedom\".\"I have been threatened by the university authorities with being sacked from school ... But I will not retreat until we are free,\" she said.",
        "(Writing by Parisa Hafezi; Editing by William Maclean)"
    ]
}