{
    "articleURL": "/wires/pa/article-12045031/Final-evacuation-flights-leave-Port-Sudan.html",
    "content": [
        "The last evacuation flights have left Sudan for Cyprus, according to the Foreign, Commonwealth and Development Office.",
        "Two final flights took off from Port Sudan on Wednesday night and Thursday morning, the final one leaving at 1.10am local time – more than two hours later than scheduled.According to Flightradar, the last flight touched down in Larnaca at 6.32am local time with a plane scheduled to leave the Cypriot airport for Birmingham on Thursday afternoon.The evacuation flights were originally due to end on Monday before the extra planes were announced, but the Foreign Office said there would be no further extensions.",
        "A statement on the website said any British nationals in need of assistance should visit the Foreign Office team at the Coral Hotel in Port Sudan, which is being used as a temporary office with the British Embassy in Khartoum closed.Foreign secretary James Cleverly said on Tuesday the evacuation had seen 2,341 leave the war-torn county on 28 flights.Downing Street said 1,195 were British nationals, with other nationalities, including Sudanese dependents of British nationals, also helped to leave.Mr Cleverly tweeted: “We’ve co-ordinated the longest and largest evacuation of any Western country. But the hard work in Sudan has not finished.”The Foreign Secretary earlier said there was still a British military presence at the country’s main seaport on the Red Sea coast with the HMS Lancaster warship off the coast.",
        "A renewed 72-hour ceasefire was due to end at midnight on Wednesday in Sudan with the Foreign Office warning “violence could escalate”.It said: “We are closely monitoring the situation in Khartoum and other parts of Sudan where there are ongoing military clashes.“There is now fighting in various locations across Sudan. Khartoum International Airport is currently closed.”Martin Griffiths, the United Nations under secretary general for humanitarian affairs and emergency relief co-ordinator, arrived in Port Sudan on Wednesday to seek guarantees for the safe passage of aid deliveries.He said: “It’s not as if we’re asking for the moon. We’re asking for the movement of humanitarian supplies and people. We do this in every other country, even without ceasefires.”Speaking to BBC Radio 4’s Today programme, he said it was “unfair” to suggest that the UN did not see the conflict coming, or was slow to respond.“There are a lot of people didn’t see it coming. A lot of people in Sudan who didn’t see it coming.“Maybe we were derelict in our duty. Maybe we were derelict in our responsibility. Fine, that’s yesterday. What we’re talking about today is doing something that is consistent with our values.”The United Nations said Sudanese army chief General Abdel Fattah Burhan and his rival General Mohammed Hamdan Dagalo, the head of a paramilitary group known as the Rapid Support Forces (RSF), have agreed to send representatives to the negotiation table in a bid to establish a more stable truce.",
        "Generals Burhan and Dagalo, both with powerful foreign backers, were allies in an October 2021 military coup that halted Sudan’s fraught transition to democracy, but they have since turned on each other."
    ]
}