{
    "articleURL": "/wires/afp/article-12045825/Benin-orders-probe-violence-kills-15-north.html",
    "content": [
        "President Patrice Talon has ordered an investigation into military operations after deadly violence by \"criminals\" in northern Benin killed around 15 people, a government spokesman said.",
        "Benin officials rarely give details about attacks in the north, where Benin like other Gulf of Guinea nations faces the growing threat of spillover from jihadist conflicts across the border in Burkina Faso.Smuggling gangs and traffickers also operate along the border area.Speaking to reporters on Wednesday, government spokesman Wilfried Houngbedji did not describe any attack or blame any group, but offered condolences to \"bereaved families\" in the \"tragedy\".In a text message to AFP, he later confirmed \"around 15 deaths.\"\"When these criminals try to establish themselves and do not succeed because there is a response (...) from the defense and security forces, they work to demoralize the local population, by carrying out reprisal operations of this nature,\" he told reporters.They want to \"shock people and make them believe that the security response is not up to the task, and that they can only be saved by rallying to their cause\", he said.He said the presidency had ordered an investigation, saying the \"tragedy\" was avoidable and that there had been a problem in the chain of military operations.His comments were the first government reaction to what local residents said was an attack earlier this week in the Kerou area. Seven people had their throats slit while others were still missing, residents told AFP.",
        "A police source said attackers had also killed three more people in the Banikoara area in northern Benin a day later, though officials have made no official comment about that incident.Benin forces say they have faced around 20 incursions from across the border since 2021. Neighbouring Togo has also suffered attacks on its northern frontier area.In a rare acknowledgement, Togolese President Faure Gnassingbe last month said 40 soldiers and 100 civilians have been killed in what he described as jihadist \"war\" in northern Togo.Ghana last month also sent 1,000 more troops and police to the northern area of Bawku to reinforce security after gunmen killed an immigration officer and wounded two others near the border with Burkina Faso.Bawku, in Ghana's Upper East region, faces a simmering ethnic dispute that often flares into violence, as well as spillover risk from the neighbouring jihadist conflict.With Islamist militants controlling large parts of Burkina Faso, the United States and other Western partners are looking to help Ghana, Togo, Benin and Ivory Coast strengthen their defences.Ghana is also pushing the so-called Accra Initiative to bolster security cooperation and intelligence sharing among Gulf of Guinea neighbours and Sahel countries.A French troop withdrawal from Mali in the face of hostility and disputes with the ruling junta has refocused Western partners to aid coastal West African nations battle the Sahel conflict's southward shift."
    ]
}