{
    "articleURL": "/news/article-12054983/TikTok-star-Bobby-Moudys-home-sold-auction-days-suicide.html",
    "content": [
        "TikTok star Bobby Moudy committed suicide due to mounting 'financial pressures', his family said earlier this weekNow it has emerged he took his life just days after his home went up for auction after it went into foreclosureThe National Suicide Prevention Lifeline is 1-800-273-8255. Crisis Text Line can be reached by texting HOME to 741741TikTok star Bobby Moudy sold his home at auction days just days before he killed himself due to 'financial pressure'",
        "TMZ reported that, Rankin County records show a construction company won the auction for Moudy's Mississippi home with a bid of $309,000 after it went into foreclosure.A fundraiser organized by a friend of the family has also now brought in over $70,000. His family earlier revealed that Moudy, 46, had been 'weighed down by financial pressures'Further details of Moudy's money woes have not been shared, although they are said to have left his wife in 'financial crisis.' ",
        "The social media star and 'loving father and husband' garnered 360,000 followers and over 18.6 million likes on TikTok, and shared his last video just two days before his death.Moudy's family said it was 'with great sadness' they shared news of his death.In her own heartbreaking statement, Kaitlyn wrote: 'On April 28th my best friend was able to see our Heavenly Father.'He was the most amazing dad, brother, uncle, and friend. He had such an impact on not only his family but those around him.'He was and is still so loved by so many. He will forever be remembered. I hope you're hugging Louie tight for us. We're counting down the days until we see you again.'His wife Jennifer posted a tribute to her husband following news of his passing, with a montage of images of her late husband alongside the music to Israel Kamakawiwo'ole's version of Somewhere Over The Rainbow.",
        "She wrote: 'My precious Bobby! Go fund me in bio for his 3 babies.' In response to a fan's message about his death, she added: 'I keep thinking he will walk in the door any minute'.",
        "A friend of the family, Mandy Castle, organized a gofundme to help the family.She said: 'Bobby was a loving husband, father, brother and friend. On April 28th, he was a tragic victim of suicide. 'Bobby was full of life and laughs, but also weighed down by financial pressures. His wife, Jennifer and their three children are in an emotional and financial crisis as he was their rock.'If Bobby touched your life in any way, personally or through his fun family TikTok page, please consider helping his family through this devastating time.'Whether you are able to give or not, please cover Jennifer, Kaytlin, Max and Charleigh in your prayers.'",
        "An obituary for the late star described him as 'an avid outdoor enthusiast' who 'enjoyed fishing, hunting and camping.'The obituary said after meeting Jennifer in 1999, the couple married in 2004 and started their family, where he became 'a devoted husband, father and brother'.'He was happiest showing his love and support for his kids,' it continued. 'He was often the loudest voice on the sidelines cheering on his children at their sporting and educational events.",
        "'He approached life with a contagious enthusiasm and a smile.'Moudy leaves behind his wife Jennifer, and kids Kaytlin, Max and Charleigh, who were a regular fixture on his 'day-in-the-life' videos."
    ]
}