{
    "articleURL": "/sport/nfl/article-12048951/New-York-Giants-defensive-tackle-Dexter-Lawrence-25-inks-90million-four-year-extension.html",
    "content": [
        "The deal averages $22.5 million per year - among the top salaries for a DTIn 2022, he was selected a second-team All-Pro and made his first Pro BowlDailyMail.com provides all the latest international sports newsNew York Giants defensive tackle Dexter Lawrence has reached an agreement with the team on a $90million, four-year extension, according to multiple reports.",
        "Giants spokespeople did not immediately respond to DailyMail.com's request for confirmation.Lawrence, who had not participated in the team's voluntary offseason workouts while waiting for the deal, agreed Thursday to the massive contract.The deal averages $22.5 million per year, tying Lawrence with Washington's Daron Payne as the third-highest paid defensive tackle in the league based on annual salary, behind only the Los Angeles Rams' Aaron Donald ($31.7 million per year) and Tennessee's Jeffery Simmons ($23.5 million per year).The Giants picked up the fifth-year option on Lawrence's rookie contract last offseason, and the big D-lineman had a breakout season that included a career-high 7 1/2 sacks. He was selected a second-team All-Pro and made his first Pro Bowl. Lawrence was the 17th overall pick out of Clemson by the Giants in 2019. He has 16 1/2 career sacks, 58 quarterback hits, 21 tackles for loss and four forced fumbles in four seasons.",
        "The move comes one week after Giants GM Joe Schoen made significant additions at cornerback and wide receiver in the NFL Draft, but there remains the lingering question about an extension for Pro Bowl running back Saquon Barkley.The work never stops, but Schoen was feeling good Saturday. Over the previous three days, New York made two trades to move up and got three players Schoen feels have a shot at starting right away: cornerback Deonte Banks of Maryland, center John Michael Schmitz of Minnesota and receiver Jalin Hyatt of Tennessee.",
        "'You never know how it's going to fall,' Schoen said. 'We went through a million scenarios and didn't know who was going to be there.'All three filled immediate needs for the Giants, who surprised many last season by going 9-7-1 and making the playoffs for the first time since 2016.Banks, who was taken with the 24th pick overall after a deal with Jacksonville to move up one spot, is a physical, shutdown cornerback who could play opposite Adoree Jackson.The need for a center developed after Jon Feliciano and Nick Gates were lost this spring to free agency. Schmitz fit the bill after a long career with the Gophers that was extended by the COVID-19 season.",
        "The steal was getting Hyatt in the third round. The speedster caught 15 touchdowns this season, including a Southeastern Conference record five against Alabama.Quarterback Daniel Jones, who signed a four-year, $160 million contract after last season, has not had a deep threat since joining the Giants as the No. 6 pick overall in 2019.'I feel like I'm just dynamic, explosive,' Hyatt said Saturday. 'I feel like I get open 24/7. I think that's what you want in a receiver, and I feel like really with those three attributes, I think that's what separates myself from everybody else.'",
        "The move cost the Giants their fourth-round pick but it seemingly was worth it.Schoen and coach Brian Daboll spent the final three rounds adding depth and special teams help.Oklahoma running back Eric Gray was taken in the fifth round, Old Dominion cornerback Tre Hawkins III was grabbed in the sixth, and Oregon defensive tackle Jordon Riley and Houston safety Gervarrius Owens were chosen in the seventh.While the Giants didn't have a need at running back, they protected themselves by taking Gray in the fifth round. They need to sign Barkley to a multi-year contract extension by July 17 or he will become a free agent after next season.Gray, who started his career at Tennessee, ran for 1,366 yards and 11 touchdowns last season and caught 33 passes. He also could get opportunities as a return man.'Where we are now, I feel good,' Schoen said. 'We still have to get these guys on the field.'",
        "Hawkins started 25 games for Old Dominion, finishing with 134 tackles, two interceptions, three forced fumbles and three recoveries.Riley is a 6-foot-5, 338-pound run stopper with the type of body that's hard to find, Schoen said.Owens is tall, physical athlete who projects well as a depth player and on special teams. New York lost starting safety and leading tackler Julian Love to Seattle in free agency.",
        "The Giants still need more depth at the edge position and at inside linebacker. Signing a punter to push Jamie Gillan might be in the mix because the veteran was inconsistent last season."
    ]
}