{
    "articleURL": "/wires/aap/article-12052055/Workers-real-wage-lift-ahead-schedule.html",
    "content": [
        "Australian workers can expect to see their pay packets growing faster than consumer prices by early next year.",
        "An improvement in real wages, which accounts for the corroding effect of inflation on pay increases, was previously earmarked for midway through 2024.Thanks to surging inflation, workers have been hit with staggering declines in real wages.In the December quarter, the wage price index grew 3.3 per cent through to December - well below inflation of 7.8 per cent.Explaining the shorter wait time for real wage growth as plotted out in new Treasury forecasts, Treasurer Jim Chalmers said nominal wages were expected to grow higher and inflation - now past its peak - was on track to cool off more quickly.He told AAP the cost of living package in the May budget, which will be handed down on Tuesday, was carefully designed to push down inflation rather than fuel it.\"The cost of living package in areas like the energy bill relief will put downward pressure on the consumer price index, because it will make energy cheaper than they would otherwise be,\" he said.The federal government has also thrown its support behind wage rises for minimum and award workers and pushed forward several other policies to drive wage growth, including making it easier for parents to work.Updated forecasts from the Reserve Bank, released on Friday, also suggested wages were going to start outpacing inflation ahead of schedule.",
        "Like Treasury, the central bank foresees inflation easing more rapidly in the near term.But in the meantime, inflation remains extremely high - coming in at seven per cent in the March quarter - and deputy opposition leader Sussan Ley said the only way for the budget to successfully pass the pub test was to address the cost of living crisis head-on.For the opposition, that means restrained spending that does not drive inflation and trigger more interest rate hikes.\"Quite rightly, going into the budget, the government is talking about people on fixed or low incomes,\" she told reporters in Sydney.\"The most important thing you can do for them is help them with the cost of living, but the way to do that is to get inflation under control.\"The treasurer agreed inflation was the number one concern around the country.\"You'll see in the budget, that our efforts to provide cost of living relief, our efforts to clean up the mess in the budget, and our efforts to lay the foundations for future growth, are all influenced in one way or another, by the magnitude of this inflation challenge,\" he said in an interview.While inflation remains top of mind, the Albanese government remains within striking distance of a surplus thanks to better commodity prices, lower unemployment and faster wage growth.",
        "The treasurer said Australians would have to wait until Tuesday to see where the numbers had settled.\"What is already clear, is if we had taken the same approach to revenue upgrades as our predecessors, then we wouldn't be anywhere near having this conversation,\" Dr Chalmers said.\"The budget is improving in the near term for a number of reasons, but our responsible and restrained approach to spending, which sees most of it go to the bottom line, is what's making the biggest difference to the budget.\""
    ]
}