{
    "articleURL": "/wires/pa/article-12061159/Second-whale-two-days-washes-UK-beach.html",
    "content": [
        "A second whale has washed up onto a UK beach in two days after a carcass was found on a shore in north Wales.",
        "Abersoch Coastguard Rescue Team announced on its Facebook page the sighting of a beached whale on Porth Neigwl beach on the south coast of the Llyn Peninsula on Monday morning.Experts believe it was a young sperm whale. We directed a team from British Divers Marine Life Rescue to the cliff top who confirmed the whale was dead and currently thought to be a young sperm whale  Abersoch Coastguard Rescue Team  The rescue team said: “At 8:51 this morning we were tasked to a sighting of a beached whale on Porth Neigwl – thanks to Jess and Matt camping at Treheli for the shout.“Once located (yes we found it Abersoch RNLI) we directed a team from British Divers Marine Life Rescue (bdmlr.org.uk) to the cliff top who confirmed the whale was dead and currently thought to be a young sperm whale.“With a full and very high tide preventing any access to the beach a full assessment and post mortem will be carried out later.“Please do not attempt to approach the whale as this part of the beach is fully cut off at high tide and any contact will impair the valuable results to be gained from a full autopsy.”It follows the discovery of a dead minke whale on North Berwick beach in East Lothian on Sunday morning.",
        "East Lothian Council cordoned off the area and advised people to stay away while arrangements were made to remove the carcass.",
        "The council said in a statement on Facebook: “Unfortunately, a badly decomposed minke whale has been washed up on North Berwick beach this morning.“A cordon will be put in place while arrangements are made to remove it and people are advised to maintain an appropriate distance and to keep dogs away.”The whale carcass was later lifted into a trailer.It is the second whale to wash up on the same beach in recent weeks, with workers spending hours removing the nine-tonne carcass of a minke whale which beached on April 19.Further north, a dead humpback whale was found on a sand bank at Loch Fleet nature reserve in Sutherland on Friday."
    ]
}