{
    "articleURL": "/femail/article-12042713/Princess-Eugenie-pays-tribute-love-Jack-Brooksbank-37th-birthday.html",
    "content": [
        "The Princess posted a series of sweet family photos on her Instagram pageREAD MORE: From bar tender to Royal stalwart - meet Jack Brooksbank, the young businessman who won the heart of Princess Eugenie and plays an influential role at the heart of the Windsors Princess Eugenie has shared a sweet series of photos on Instagram to celebrate her husband Jack Brooksbank's 37th birthday.",
        "The mother-of-one, who is expecting her second child this summer, paid tribute to her 'love' with the previously unseen family photos showing the couple on trips and out and about with their two-year-old son, August.She captioned the photos: 'Happy Birthday to you my love. Here's to another 100 birthdays together', accompanied by four heart emojis.The first photo shows Eugenie, 33, with Jack against a desert-like backdrop at sunset as the pair take a beaming selfie.In another photo which is taken from behind, the mother carries their son August on her shoulders as she walks alongside Jack through the park.",
        "One of the snaps, which appears to have been taken on the same day as the desert selfie, also shows the couple in a tiny boat on holiday as the sun beams down on them.Royal fans commented on the post to send Jack many happy returns and also to praise the couple's closeness.One person wrote: 'Happy birthday, lovely to see how happy you are together.'Another said 'bless you both' while a third said they were a 'cute couple'.The sweet photos come days after the couple were spotted on a family day out in Chelsea as they joined Princess Beatrice, 34, Edoardo Mapelli Mozzi, 39, and their one-and-a-half year old daughter Sienna, to attend the birthday party of Ellie Goulding's son Arthur.",
        "The families were seen heading to the Bluebird Café in Chelsea where the pop star was hosting her son's birthday bash.The brothers-in-law even coordinated their outfits to attend the birthday.",
        "Both Edo and Jack donned dark jeans, which they paired with matching blue shirts and white T-shirts, and even the same navy-coloured baseball caps.Their sisters however, opted for similar but not matching ensembles, as they stepped out ahead of their uncle King Charles's coronation on Saturday.Eugenie, who was glowing as she displayed her baby bump, wore a blue smock dress from Whistles.The royal, who was also accompanied by the couple's two-year-old son August, paired her frock with flat white trainers, and a pair of chic, oversized shades.She wore her brunette hair down, letting it fall in loose waves, and accessorised her outfit with a simple gold necklace.Meanwhile older sibling Beatrice opted for a navy midi dress from Kitri, which she paired with beige trainers. She was pictured carrying carrying the daughter she shares with husband Edo, one-and-a-half-year-old Sienna, as she walked down the London street.Both the couples' children wore touches of blue in their outfits as well.The outing comes just days ahead of King Charles' coronation, which will take place on May 6.",
        "Both Princess Eugenie and Princess Beatrice are expected to attend the event.However, their mother Sarah Ferguson, 63, the Duchess of York, has not been invited to the event.Royal commentator Tom Bower told MailOnline that Sarah had excluded herself because of her previous 'conduct'.He added that her presence would 'provoke critical comment which Charles doesn't need'.And royal expert Richard Fitzwilliams praised the 'extremely wise' decision from the King because she has been an 'embarrassment to the Royal Family for many years'.But the apparent decision has surprised some royal watchers - with Meghan Markle's friend Omid Scobie tweeting: 'If true, this feels kinda cruel, no?'Since the snub, the Duchess was spotted in the passenger seat of a Range Rover being driven by her ex-husband."
    ]
}