{
    "articleURL": "/tvshowbiz/article-12047079/EastEnders-SPOILERS-Staceys-money-woes-spark-visit-bailiffs.html",
    "content": [
        "Stacey Slater's money woes look set to get even worse on next week's EastEnders, as she receives a visit from the bailiffs.",
        "As her debts continue to mount, the desperate mother contemplates posting yet more Secret Cam snaps, with Freddie even offer his own ideas to drum up business for the bap van.In the upcoming episodes, a devastated Stacey (Lacey Turner) and Eve (Heather Peace) receive a visit from the bailiffs who completely clear out her home.Her ex Martin (James Bye) tries to offer additional support, but Stacey insists she can deal with it.Later, Freddie (Bobby Brazier) spots a dejected Stacey and quickly comes up with a money spinning idea to get more customers to the bap van.",
        "Freddie is an instant success, but an overjoyed Stacey is quickly distracted by an offer from a Secret Cam... will she take it?Later, Stacey continues to dismiss Martin’s help as she contemplates her latest Secret Cam offer.Stacey asks Eve to look after the bap van but is later confronted by her when she returns home to find Stacey dolled up... will she come clean?As the week continues, Stacey and Martin are horrified to learn that Lily is bullying a girl at school, but they soon realise that her behaviour was influenced as a result of her own bullying. Later, Martin takes a struggling Stacey for a picnic in the park where the pair share a heart-to-heart.",
        "But, Martin unknowingly gives Stacey the reassurance she needs - will she find a way to solve her money struggles?Last month viewers shared their sympathy for cash-strapped Stacey as she was forced to strip down to her lingerie online to make money.Stacey has been left in debt and owing money and desperate to find away to make serious cash quickly after being threatened to pay up.",
        "She is busy looking after her three children and has a grandchild on the way as her 12-year-old daughter Lily is currently pregnant.At the end of the latest show she was seen logging into a video app and removing a silk black dressing gown. She looked extremely upset as she showcased her figure in a red lace lingerie set while holding the camera to the side hiding her face. Fans quickly rushed to Twitter to say they feel 'sad' for Stacey who is facing 'desperate times'. EastEnders airs Mondays to Thursdays at 7:30pm on BBC One and iPlayer."
    ]
}