{
    "articleURL": "/wires/ap/article-12043029/Elon-Musk-threatens-reassign-NPRs-Twitter-account.html",
    "content": [
        "WASHINGTON (AP) - Elon Musk threatened to reassign NPR´s Twitter account to \"another company,\" according to the non-profit news organization, in an ongoing spat between Musk and media groups since his $44 billion acquisition of Twitter last year.",
        "\"So is NPR going to start posting on Twitter again, or should we reassign @NPR to another company?\" Musk wrote in one email late Tuesday to NPR reporter Bobby Allyn.NPR stopped tweeting from its main account after Twitter abruptly labeled NPR´s main account as \" state-affiliated media \" last month, a term that´s also been used to identify outlets controlled or heavily influenced by authoritarian governments. Twitter then changed the label to \" government-funded media.\"NPR said that both labels were inaccurate and undermined its credibility - noting the nonprofit news company operates independently of the U.S. government. Federal funding from the Corporation for Public Broadcasting accounts for less than 1% of NPR´s annual operating budget, the company said.The last tweets on NPR´s main account are from April 12 - when the news organization shared a thread of other places readers and listeners can find its journalism.Twitter temporarily slapped other news organizations - including the BBC and PBS - with \"government-funded media\" labels. PBS also stopped using its Twitter account in response.",
        "In an article written by Allyn late Tuesday, the NPR tech reporter detailed the messages that the billionaire owner of Twitter sent regarding NPR´s account. Musk pointed to NPR's choice to stop tweeting as justifying possibly reassigning the account.",
        "\"Our policy is to recycle handles that are definitively dormant,\" Musk wrote in one email. \"Same policy applies to all accounts. No special treatment for NPR.\"According to Twitter's online policy, the social media platform determines an account's inactivity based on logging on - not tweeting. Twitter says that users should log in at least every 30 days to keep their accounts active, and that \"accounts may be permanently removed due to prolonged inactivity.\"Musk´s comments and his actions, however, do not always match and it is uncertain if he will actually reassign NPR´s handle, regardless of Twitter's published policy on account activity.When asked by NPR who would be willing to use NPR´s Twitter account, Musk replied, \"National Pumpkin Radio,\" along with a fire emoji and a laughing emoji, NPR reported.It is unknown if NPR has logged into its account, which currently has a blue check without the previous \"government-funded media\" label, since April. The Associated Press reached out to NPR for comment early Wednesday.Musk disbanded Twitter's media and public relations department after the takeover.As of Wednesday, the NPR Twitter handle still appeared to belong to NPR. If Musk does reassign the account to another user, experts warn of misinformation and further loss of credibility.\"Potentially losing access to a handle as a form of pressure is really just a continuation of eroding the credibility of information sharing on Twitter,\" Zeve Sanderson, executive director of New York University´s Center for Social Media and Politics told The Associated Press.",
        "\"For journalism, there´s not only brand safety concerns, but in addition to that, there are a ton of concerns around misinformation potentially being perceived as a lot more credible - because someone (could be) tweeting from from the NPR handle when it´s really not them,\" Sanderson added.It is the latest volley in what many experts describe as a chilling and uncertain landscape for journalism on Twitter since Musk acquired the company in October.In addition to removing news organization's verifications and temporarily adding labels like \"government-funded media\" on some accounts, Musk abruptly suspended the accounts of individual journalists who wrote about Twitter late last year.In response to Musk's Tuesday emails, Liz Woolery, digital policy lead at literary organization PEN America said that it is \"hard to imagine a more potent example of Musk´s willingness to use Twitter to arbitrarily intimidate and retaliate against any person or organization that irks him, with or without provocation.\"\"It´s a purely authoritarian tactic, seemingly intended to undermine one of the country´s premier and most trusted news organizations-one that is especially important to rural communities across the U.S.\" Woolery added in a Wednesday statement to The Associated Press._______AP Technology Writers Matt O´Brien and Barbara Ortutay contributed to this report."
    ]
}