{
    "articleURL": "/news/article-12050935/Man-guns-estranged-brother-doorstep-dies-shootout-cops.html",
    "content": [
        "Jeffrey Roberts, 66, killed his estranged brother and also shot his sister-in-law before setting fire to their home in UtahRoberts, who had traveled 750 miles from his California home, was then killed in a dramatic shootout with policeThe entire incident was recorded in shocking Ring doorbell and police bodycam footage A California man ambushed and murdered his brother on his own doorstep in Utah before he was killed by police in a dramatic shootout that was recorded on a Ring doorbell cam.",
        "Jeffrey Roberts, 66, killed his estranged brother Scott Roberts, 65, and also shot his sister-in-law, Jodi Roberts, before setting fire to their home. Law enforcement officials told DailyMail.com the shooting was linked to a 'family issue' but the full circumstances remain under investigation.Roberts, who traveled 750 miles from his Long Beach home to confront his brother, then fired on police who rushed to the address in a quiet neighborhood in North Ogden before he was shot dead.The Weber County Attorney released a tranche of shocking footage from both the Ring doorbell and police bodycam that showed how the incident on April 27 unfolded.Scott and Jodi's daughter, Kelsey Turner, said on a fundraiser for her mother that Jeffrey was estranged from Scott but the motive for the horrific incident remains unclear.",
        "'My mom is alive because my dad fought my uncle and told my mom to run. Knowing that my dad died a hero is bringing us a small bit of comfort,' Turner said.'Because of the fire, my mom has been left with no clothes or personal items. We will be able to recover some things from the house but have been told most of the house was destroyed.'Footage shows Roberts calmly strolled toward his brother's front door at around 7.11pm while the Scott was having dinner with his wife, Jodi Roberts. There's a brief exchange in which Roberts appears to say he 'came by to see mom'.",
        "His brother says the person isn't there and just moments later - and without provocations - pulls a weapon from the pocket of his hoodie and fires a barrage of shots while barging his way into the home.A man's voice can be heard shouting while the shooting takes place. About two minutes later the motion-sensitive doorbell cam is reactivated as Roberts leaves the property and returns soon after with a pump-action shotgun and a duffel bag, which police later discovered was stuffed with hundreds of rounds of ammo.The camera is activated again when police arrive and a fire alarm can then be heard after Roberts sparked a blaze inside the property. Bullet holes can be seen on the pillars of the porch.",
        "Roberts then rushed out of the property firing a handgun. Police respond with a volley of shots that cause Roberts to fall face first onto the porch, killing him instantly.Bodycam from the aftermath shows flames spreading inside the home, sending up plumes of black smoke which prevented officers from immediately heading inside to aid Jodi Roberts.Homes across the street were also peppered with bullet holes after the shootout.Brandon Miles, the chief criminal deputy in the Weber County Attorney's Office, said the shooting was linked to a 'family issue' which remains under investigation.",
        "Investigators are also thought to be conducting inquiries in California, where Roberts lived. It's currently unclear how Roberts obtained the weapons and ammunition.Miles said Jodi Roberts has now been discharged from hospital but the home is 'uninhabitable' following the fire. No further suspects are being sought, he added.Turner's GoFundMe had raised $37,214 by Friday morning - more than triple its $10,000 goal. The page included dozens of tributes to Scott and messages of support for Jodi.'Scott was an amazing colleague, mentor and friend,' said Marcella Windmuller.Mike Saunders added: 'Scott was a mentor and great friend. I will always remember his stories and his laugh.'"
    ]
}