{
    "articleURL": "/wires/ap/article-12044267/Yanks-GM-Brian-Cashman-says-responsible-teams-state.html",
    "content": [
        "NEW YORK (AP) - Brian Cashman was blunt in his assessment of what has gone wrong in the New York Yankees season.",
        "\"Injuries happen and ultimately we´re getting a lot of injuries right now, and that´s certainly killing us,\" the general manager said Wednesday. \"But I have nothing I can convict others - other than if you want to convict somebody, convict me. This is my responsibility.\"New York began Wednesday 16-15, last in the AL East and 8 1/2 games behind first-place Tampa Bay.Captain Aaron Judge (strained right hip), designated hitter Giancarlo Stanton (strained left hamstring), third baseman Josh Donaldson (strained right hamstring) and starting pitchers Carlos Rodón (strained left forearm and sore back), Luis Severino (strained right lat) and Frankie Montas (right shoulder surgery) are among a dozen players on the injured list.Center fielder Harrison Bader didn't play his first game until Tuesday after recovering from a strained oblique.\"When we´re at full health or close to it - because you're never going to be at full health - I believe we have a championship-caliber team,\" Cashman said. \"We´ve got to be thankful that it´s a long season because we're banged up so bad right now - if it was a short season, we´d be taken out.\"",
        "Seeking their first title since 2009, the Yankees began the season with baseball's second-highest payroll at $275 million, trailing only the New York Mets at $355 million.",
        "New York began 12-7 but has slid with attrition. Judge hasn´t played since Friday, Stanton since April 15 and Donaldson since April 5.Stanton has been on the injured/disabled list 11 times in 14 major league seasons, including seven times with the Yankees, and Judge has made seven trips since his debut in 2016.\"It's not our strength and conditioning department. It's not how we train our players,\" Cashman said. \"I believe we have really good personnel on the health-care side of this thing: the doctors, the trainers, the strength coaches. I think we have players that are wired the right way, that care and compete.\"While fans have directed ire at Aaron Hicks for his .146 batting average, Oswaldo Cabrera is hitting ,198, Kyle Higashioka .195, Isiah Kiner-Falefa .189 and Oswald Peraza .188. New York had scored two runs or fewer in eight of its 12 previous games.Rodón was going to see a doctor Thursday to have his back examined. Severino will pitch in a controlled game on Friday in Tampa, Florida. Judge is expected to be activated Monday, the first day he is eligible.Montas is out until August at the earliest.Cashman admitted the Yankees did little to help themselves at last year's trade deadline, when they acquired Montas and Lou Trivino from Oakland. Trivino will miss the rest of this season following Tommy John surgery.",
        "\"The more recent moves have not worked out,\" Cashman said. \"I wish certainly, especially last year´s trade deadline, to have gone better.\"Following the expansion of the playoffs to 12 teams last year, 86 wins was enough to reach the postseason. That creates less short-term pressure for a quick turnaround.\"Don´t count us out. Don´t give up on us,\" Cashman said. \"We got a good group of people, player-wise, staff-wise, support staff-wise. It´s a championship-caliber operation.\"___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}