{
    "articleURL": "/wires/reuters/article-12059849/China-probes-Capvision-national-security-warning-consulting-firms.html",
    "content": [
        "HONG KONG, May 8 (Reuters) - Chinese authorities have carried out an investigation into consulting firm Capvision Partners, state media CCTV reported on Monday, in a warning to other advisory firms as the country tightens its national security laws.",
        "Capvision, which runs the country's largest expert network group and has offices in eight cities around the world including Shanghai and New York, was singled out in a series of news reports including a 15 minute segment by state broadcaster CCTV.CCTV said that investigations by Chinese national security authorities had found that overseas institutions have used domestic consulting firms to steal state secrets and intelligence on areas key to China.\"According to the findings...Capvision accepted a large number of consulting projects from overseas companies on industries sensitive to China, and some of these firms had close ties with foreign governments, military and intelligence agencies,\" CCTV said during its show, which interviewed staff and consultants hired by Capvision and showed police visiting one of the company's mainland offices.Capvision said in a statement posted to its WeChat account shortly after the CCTV broadcast that it would resolutely abide by China's national security rules and take the lead in ensuring the consulting industry was compliant.Calls by Reuters to its offices in Suzhou, Shanghai and Hong Kong went unanswered after business hours.CCTV did not say whether authorities levelled any punishment against Capvision but that the national security agency had dealt with the company \"in accordance with regulations\".RAIDSThe broadcasts come after a police raid on U.S. due diligence firm Mintz's China office in March, during which local staff were detained, and a separate visit by police to Bain &amp;amp; Co's Shanghai office last month.",
        "Mintz Group is suspected of engaging in unlawful business operations, China's foreign ministry said at the time. Mintz said it was ready to work with authorities to \"resolve any misunderstanding\". Authorities have yet to comment on Bain.As part of steps to strengthen its counter-espionage law, China in April banned the transfer of any information related to national security and broadened the definition of spying.\"Some domestic consulting companies have weak awareness of national security, and frequently walk on the edge of the law in order to seek economic benefits,\" CCTV said.It was unclear from the reports when the Capvision probe took place. Two sources familiar with the matter told Reuters that the company had received at least one visit from police in the second half of last year.Founded in 2006 by former Bain consultants and Morgan Stanley investment bankers in Shanghai, Capvision provided a matchmaking service linking investors such as hedge funds as well as other consulting firms with industry experts.The probe will \"have a direct impact on industry norms,\" said an executive from a rival consultancy who declined to be named citing the sensitivity of the situation.\"There will be more stringent regulations that the contracts signed with experts are compliant, and sensitive industries can no longer be touched.\" (Reporting by Meg Shen, Twinnie Siu and the Shanghai and Beijing Newsrooms; Editing by Hugh Lawson and Louise Heavens, Kirsten Donovan)"
    ]
}