{
    "articleURL": "/femail/article-12058931/McDonalds-announces-three-ways-win-FREE-McNuggets-celebrate-40th-anniversary.html",
    "content": [
        "McDonald’s is offering three ways to get your hands on free McNuggetsREAD MORE: McDonald's slashes price of popular item for Bank Holiday MondayMcDonald’s has announced that they will be offering opportunities to win free McNuggets in celebration of their 40th birthday.",
        "The fast-food chain will be giving UK customers three ways to get their hands on and tuck into the McNuggets later this month on May 30 and 31.They will be taking over a London location to throw an event with everything from McNugget mini golf to ball pits, and you can even get your hands on McNugget-themed summer shirts.The UK's first McNugget-themed event is completely free - all you need to do to attend is book your slot and turn up. However, if you miss out on '#McNuggetWorthy: The Experience', you can still be in with the chance of having the McNugget Van at your own party.",
        "To enter the competition all you need to do is visit the My McDonald’s app from 10th May to find out all the details. The third and final way to win free McNuggets is by taking a look at the McDonald's App. By entering the competition, you will be in with a chance of winning 4,000 McDonald's Rewards Points to redeem on six free McNuggets.But you will need to act fast because only the first 50,000 entrants will receive the reward points and the competition closes on May 23. Meanwhile, in celebration of the McNuggets 40th birthday, McDonald's will also be releasing four dips and a brand new burger.",
        "The fast food chain will be launching garlic mayo, chipotle mayo, mega hot sauce, and creamy ranch for a limited time across the UK and Ireland from May 10.The new dips will be welcomed by fans who have been crying out for new flavours for years.The brand new Mega Hot Sauce and Garlic Mayo dips will be available from next week, with two more to follow on 31 May.The burger joint is also launching the new Spicy Big Tasty which is similar to the Big Tasty but with a fiery kick.",
        "The spicy version is built with a beef patty, made with Emmental cheese, lettuce, bacon, tomato Big Tasty sauce with a jalapeno twist.It is also bringing back old fan favourites including the classic version of the The Big Tasty burger and halloumi fries.The four delicious halloumi cheese sticks will be coated in a light batter and served with a rich tomato dip.And if that wasn't enough the popular Wispa McFlurry will also be making a return.",
        "It's made up of soft dairy ice cream, swirled with Wispa chocolate pieces and a chocolate sauce.Or fans can opt for a Wispa Gold McFlurry which is made with Wispa chocolate pieces and a Cadbury caramel sauce.",
        "These will be available in all McDonald’s restaurants nationwide from May 3 until June 3.To book your place at #McNuggetWorthy: The Experience, click here."
    ]
}