{
    "articleURL": "/tvshowbiz/article-12049499/Entitled-influencer-slammed-complaining-unable-drop-bags-airport.html",
    "content": [
        "Byron Bay influencer Ruby Tuesday Matthews was slammed on Friday for complaining that she couldn't drop her bags off after arriving to the airport late ahead of a flight. ",
        "Ruby, 29, shared a series of Instagram posts from the terminal, showing off her luggage and insisting she was only 'two minutes late' to bag drop.The model said she had already checked in ahead of the flight but couldn't believe airport staff refused to let her drop her bags off as she was travelling with her kids.  Ruby has made headlines before for her airport antics, and in 2020 she famously held up a delayed Jetstar flight as she indulged on oysters in a fancy restaurant - and then complained when she was heckled by frustrated passengers. 'Two minutes late for bag drop and they wouldn't let us drop our bags. Our flight hasn't boarded or left but we're not getting on it even though we're checked in,' she began on Instagram on Friday.",
        "'Surely you'd just let someone travelling with two kids by themselves check in three minutes late but whatever. Especially if the airport is the size of an airport for ants.''Oh and for the record, we already checked in, we just had to bag drop. Update we've been moved free of charge to the next flight by the hostess who is really lovely,' she added. However, Ruby caught the wrath of social media users on Friday after an influencer sleuth account called Influencer Updates Au reposted her stories. ",
        "Journalist Melissa Hoyer wrote underneath: 'Umm. You leave a little earlier. And pop the phone down for a minute. It isn't that hard.''Not hard to get there on time, it's your own fault. Everyone knows with kids things take extra time so she should have been more prepared. Seems like a her problem tbh,' one user added.One airline worker remarked: 'Work for an airline and no! The bags take 25 minutes to be screened and to get out to an aircraft so that delays it and costs an airline a lot of money. That's why bag drop closes at [minus thirty minutes] to any domestic flight departure.' Another added: 'Travelling alone with kids does not entitle you to extra time to check in. Flights have a schedule for a reason, and there is a bag cut off time for a reason too.' However, one follower stuck up for Ruby and said if it had happened to a mum who wasn't an influencer, they wouldn't get the 'entitled tag' and people would 'feel sorry' for them.",
        "In October 2020, Ruby came under fire after she held up a delayed Jetstar flight as she indulged on oysters in a fancy restaurant - and then complained when she was heckled by frustrated passengers. ",
        "She was supposed to be flying from Byron Bay to Sydney in the afternoon but a technical issue caused the flight to be delayed.Jetstar asked travellers to stay at the airport while they flew an engineer over from the Gold Coast and told passengers the new departure time would likely be about 7.30pm that evening.",
        "Ruby and her travel companion decided to leave the airport to grab a bite to eat at a beachside restaurant as others ate at the airport.The mother-of-two later posted a video to Instagram showing her eating oysters with a friend, captioning the footage: 'Flight delayed f*** my life'.She kept frustrated passengers waiting on the tarmac, who heckled her as she boarded 30 minutes after the plane was due to take off.",
        "Video footage shows passengers shouting 'how were the oysters' and 'what a day to be pretty' as she entered the aircraft.While the pair were enjoying their meal, those at the airport were advised the engineer had arrived sooner than expected and the flight would be boarding at 6.20pm instead.But passengers were forced to sit on the tarmac as Jetstar tried to trace a group of missing passengers, including Ruby and her mate.It is understood an employee had to call her to advise her the plane was ready to depart and she needed to return to the airport as soon as possible.",
        "When a passenger asked if the oysters were good, Ruby replied: 'Yes they were'. ",
        "The social media star then argued with the other travellers, telling them it was an 'innocent mistake' and that they were being rude.The influencer later took to social media where she blamed Jetstar for the incident, claiming staff did nothing to help her.Ruby was not the only passenger who had left the airport.Before another late passenger boarded the plane a flight attendant told travellers the other woman would be arriving shortly and asked that everyone remain quiet once she arrived.In her rant, Ruby blamed Jetstar for what had happened and told the other passengers to 'grow up'.'I had a pretty traumatic flight experience, thanks Jetstar, you never cease to amaze me,' she began.'I'm sorry but it really was not my fault... we were told it was going to be taking off at 7.45pm, I had not eaten since my smoothie that morning because I had been in back-to-back meetings.'I was like ''f*** this, I'm going to get food out of the airport, it's two hours until our flight takes off, I'm going to go''.'I walked out, I did not hear the second announcement that apparently said ''do not leave the airport''.",
        "'I didn't hear that, I swear to god, I wouldn't have left the airport, I'm not a d***head, I do have respect for everyone else.'She claimed she was met with 'very personal comments' when she got on the plane.'I was basically bullied by about seven to 10 to 14 people at different times, then they made comments about my children. No Jetstar staff stopped this at any time. I copped it hard for about 15 minutes.'I was scared for myself because number one, I was by myself...number two, no one else who was later than me copped any abuse, it was just me alone.''I can handle it, I literally said ''guys, go for it, I cop this every single day, it's just another fricken thing''. But one day, there is going to be another girl not as strong as me and they're going to hop on that plane and they are going to cop that and they are going to hop off the other end and they are going to kill themselves.'Just be kind people. To the one guy who was kind to me, thank you. To everyone else - grow up.'I missed out on stuff too, I get it, but that was not my fault, it was a genuine mistake there is no reason to pick on me because I have influenza, I mean I'm an influencer.'"
    ]
}