{
    "articleURL": "/wires/afp/article-12049223/Journey-center-world-Hint-California.html",
    "content": [
        "Every morning, Jacques-Andre Istel has breakfast in bed at the center of the world.",
        "Istel is founder, mayor and postmaster general of Felicity, a stretch of California's Sonora Desert where for nearly four decades he has been building a museum of, y'know... the whole of human history.\"This doesn't exist anywhere else on this planet,\" the 94-year-old told AFP.What started in 1986 with two small houses has grown into an amphitheater of Istel's dreams; 2,600 acres (1,052 hectares) where the passage of time is marked by a sundial that uses the arm of God -- as painted by Michelangelo in the Sistine Chapel -- to cast its shadow.Nearby sits a bit of an old staircase that used to be part of the Eiffel Tower, its steps ascending into the void.",
        "The town's post office, which Istel has operated since December 1987, collects and distributes mail for a handful of residents and tourists. The $1 stipend checks sent by the US Treasury every year are uncashed and framed.Istel was elected mayor of Felicity shortly after it was founded in a three-vote landslide.The ballots were cast by Istel, his wife Felicia, after whom the town is named, and the invisible dragon that stars in Istel's storybook about the center of the world.(A supervisor from Imperial County, in which Felicity sits, declared all three ballots valid, noting that a dragon's vote was recognized \"for the first and only time in California history\".)",
        "- The 'center' of the world -Visitors to Felicity -- dozens of tourists stop by every day between October and April -- enter between symmetrical houses and are faced with a pyramid.This is -- officially -- the middle of, well, everything. Honestly. There's paperwork to prove it: Supervisors in Imperial County declared it so.Istel acknowledges with a twinkle in his eye that he's using a bit of creative license.\"The center of the world can be anywhere,\" he smiles.Beyond the pyramid, 723 red granite panels stretch out in thematic branches, exploring history, geography, politics, science, fashion and culture.Here, a panel tells the story of slavery in the United States; there, one examines the life of Alexander the Great.One slab deals with the sacrificial rites of the Vikings, while another logs America's eating habits.- Skydiver -Istel was born in 1929 into a privileged family in the French capital.He left the country as the Nazis were preparing to march on Paris, and wound up in the United States.\"I'm here thanks to the Germans,\" he says.",
        "\"My family fought against them for three generations. My father left for England with [Charles] De Gaulle, my brother left the French Army for Canada and enlisted in the Royal Canadian Air Force and eventually died, and my mother and the rest of us kids came to America.\"",
        "After a degree in economics, the young Istel went into the family banking business on Wall Street.But in a seemingly emblematic bit of topsy-turviness, he wound up as a professional skydiver, the kind of career swap disappointment that usually seems to happen the other way around.Seeking thrills outside of a job he did not really enjoy, he got his pilot's license, and did his first parachute jump.A trip to Europe introduced him to the then-unnamed activity of skydiving, an idea Istel brought back to the United States, where the company he cofounded helped popularize the idea of recreational skydiving, becoming known in some quarters as the \"Father of American skydiving.\"Contracts with the military and a roaring civilian business made the firm a success, and provided the nest egg for what later became Felicity.In a study lined with memories from a very full lifetime -- a diploma from Princeton, pre-war furniture and family photographs -- Istel says his museum is not a legacy for himself, but a gift to all of humanity.Perhaps it will become a place of pilgrimage for generations to come; or maybe in seismically-active California it will be destroyed in a catastrophic earthquake, he muses.\"The silver lining in that case is that archaeologists of the future will unearth a great find,\" he says.",
        "And if they never find it? Well, that's just how things work out sometimes.\"Everything is forgotten,\" he says.Now well into his tenth decade, Istel shows no sign of slowing down (breakfast in bed is a decades-old custom for him, not a sign of old age). He swims daily and skips jauntily up the 49 steps that lead to the chapel in Felicity.There is, after all, still so much to do -- almost 200 panels are yet to be carved. And who knows? There's still all that desert space to fill.",
        "The magnitude of the task might keep a lesser man awake at night.But not Istel.\"I sleep well. But I do think about the next panels,\" he says.\"At Felicity we don't do things by halves. We do them properly or we don't do them at all.\""
    ]
}