{
    "articleURL": "/tvshowbiz/article-12045287/Kanye-West-rocks-leggings-girlfriend-Bianca-Censori-opts-angel-wings.html",
    "content": [
        "Kanye West rocked a rather form fitting look - sans ice fishing boots - while stepping out in Los Angeles with 'wife' Bianca Censori.",
        "The 45-year-old rapper was spotted checking out a warehouse on Melrose Avenue in Los Angeles with Censori, 27, who opted for a pair of angel wings.The outing comes just days after West filed a countersuit against a former business manager, who claims West owes him $5.4 million in unpaid fees. West stepped out in a Sharp Umbro shirt from the popular soccer/football team Manchester United.He also rocked form-fitting black leggings and his own Not Too Sole-ful shoes, one of the first times he hasn't been seen in massive ice fishing boots in many months. ",
        "Censori opted for a tan form-fitting top that slightly exposed her midriff, with a pair of white angel wings strapped to her back.She also rocked a matching pair of tan leggings with black leather boots for the outing with West.After checking out the warehouse, both West and Censori left in separate vehicles, with Censori driving a massive white Humvee. West and Censori were spotted outside the Melrose Avenue warehouse just hours before he hosted his Yeezy Season 10 fashion collection.The show was described by High Snobiety as a, 'an extremely low-key affair that barely revealed any clothing or fashion designs at all.'The show featured, 'bald models donning skin-tight white T-shirts with black pants,' set to the music of Frank Ocean, which played throughout the show.",
        "The warehouse is rumored to be the location of West's first ever Yeezy retail store, though that has yet to be confirmed.It was reported in July 2022 that West filed a trademark for 'YZYSPLY' - short for Yeezy Supply for, 'retail stores, online ordering services and online retail store services.' ",
        "Yeezy Supply is the name of a website the rapper has used to sell various wares in the past, but the trademark category seems to indicate he's moving towards his first brick-and-mortar store.The filing indicates the store could sell items such as, 'G-strings, shirts, socks, hats, visors and tennis wear,' along with headwear, footwear and other accessories.While, at the time of the filing he had deal with the GAP retailer, that deal was terminated in September 2022. It's unclear if West will be launching more Yeezy Season 10 fashion shows, or if he will be opening his first retail store soon. "
    ]
}