{
    "articleURL": "/wires/aap/article-12058339/Tedesco-Walker-great-NRL-halfback.html",
    "content": [
        "Sydney Roosters skipper James Tedesco insists Sam Walker will become a great NRL halfback but has expressed his determination to get the side's new-look spine firing.",
        "Walker was dropped three weeks ago and Joey Manu switched from centre to five-eighth to partner fullback Tedesco, No.7 Luke Keary and hooker Brandon Smith in the spine.They had two wins together but were poor in Sunday's 20-6 loss to North Queensland.Tedesco said after the match the spine members needed to find their combinations in the next month but added he was there to help Manu adapt to his new role.\"I feel we are similar with how we play our footy. We are both runners of the ball but if we can combine and make space for each other that is when we can cause some headaches for the opposition,\" Tedesco told AAP.\"We haven't just started from scratch. There are instincts there from us being around the ruck together when he was at centre where we have combined.\"How Joey runs out the back of shapes and how he runs square, that takes a bit of getting used to. It is all about getting the reps at training. You look at most teams, there is an organising half which for us is Kez (Keary) and a running five eighth ... which I think is going to suit our style.\"Tedesco said Walker had taken his dropping \"really well\".",
        "\"There is still plenty of time on Sammy's hands and we all believe he has all the traits to become a great NRL halfback,\" he said.\"I think it helps that Joey is a Golden Boot winner coming in to replace him and not a new up-and-coming kid.\"Sammy knows he has to go back and work on a few things. You can forget he is only 20 years of age. You look at the great halves now like Nathan Cleary and Daly Cherry-Evans and in the early stages of their career they were still finding their feet, but for our team at the moment we are happy having Joey and Keary steering the ship.\"I feel as though our combinations are going to get better and I am excited to work on it at training and hopefully see results in games.\"The Roosters' spine has been hit and miss, like the team's performances.\"Every year I have been here we don't start a season setting the world on fire. We start very hot and cold and when we hit the Origin period we start to find our feet before ending the year strongly,\" Tedesco said.\"Obviously we wanted to start the year at our best, and we haven't done that, but we know there is a lot of improvement in us.\""
    ]
}