{
    "articleURL": "/wires/ap/article-12055003/Sabalenka-beats-Swiatek-reclaim-Madrid-Open-title.html",
    "content": [
        "MADRID (AP) - In another meeting of the top two players in the world, Aryna Sabalenka finally got the better of Iga Swiatek on clay.",
        "Second-ranked Sabalenka beat top-ranked Swiatek 6-3, 3-6, 6-3 to reclaim the Madrid Open title on Saturday.Sabalenka lost to Stuttgart final two weeks ago and had never previously taken a set against her Polish rival in three clay-court meetings.But the Belarusian held nothing back by aggressively hitting for winners and breaking Swiatek four times in the 2 1/2-hour final.The Australian Open champion claimed her tour-leading third title of the season and 13th of her career, including her second in Madrid after triumphing here in 2021.\"I am just super happy with this win, especially against Iga on clay,\" Sabalenka said.",
        "She told Swiatek on court, \"It is always tough against each other and you always push me to my limits. I hope we will play many more times this season.\"It was the first WTA 1000 final between the top two ranked players since No. 1 Serena Williams beat No. 2 Li Na at the 2014 Miami Open. It was also only the third time in the last 40 years that the top two women met twice on clay in a single season.Swiatek, a three-time Grand Slam winner, entered the match with a 5-2 record against Sabalenka. But she was clearly flustered early on by Sabalenka´s superb hitting. She shook her head and talked to her coach in the stands after costly hitting errors.",
        "After Sabalenka commanded the first set and the start of the second, Swiatek found her composure and leveled the set score.The decisive set could have gone either way.Sabalenka finally tilted the final in her favor after a running forehand cross-court shot clipped the sideline for a winner to break Swiatek and go up 5-3.Swiatek fended off three match points before Sabalenka smashed a forehand to finish her off.On Sunday, defending champion Carlos Alcaraz plays Jan-Lennard Struff in the men´s final.___AP tennis: https://apnews.com/hub/tennis and https://twitter.com/AP_Sports"
    ]
}