{
    "articleURL": "/tvshowbiz/article-12048301/Kym-Marsh-46-splits-husband-Scott-Ratcliff-34-two-years-tying-knot.html",
    "content": [
        "Kym Marsh has reportedly split from third husband Scott Ratcliff - just 18 months after tying the knot.",
        "The former Corrie actress, 46, appeared glum as she was spotted shopping with daughter Emilie, 26, on Thursday in pictures obtained exclusively by MailOnline.Despite reports of the break-up, Kym was still wearing her wedding band when she stepped out for the first time following the news.According to The Sun, Kym and army major Scott, 34, decided to end their marriage due to the strain of work, but 'cracks' had been present in the relationship for some time.The pressures of their careers led to the couple attempting a trial separation earlier this year, before deciding to officially split.While mother-of-four Kym lives in Cheshire, Scott is based in barracks down south meaning the couple struggled to spend quality time together - and Kym's intense Strictly rehearsals last year reportedly put further strain on the marriage.",
        "Kym stars in Waterloo Road and is a regular host of BBC1 daytime show Morning Live as well as appearing in theatre roles. A source told The Sun: 'They both really tried to make it work, but the cracks have been there for a while and they were only getting to see each other for one or two days a week at the very most.'They continued: 'They had a trial separation earlier this year and were hoping to get things back on track but they've decided it's best to go their separate ways.",
        "'It's very sad for all involved, but they've decided it's time to tell their family and friends and focus on the future - which means filing for divorce, they're hoping to keep things as amicable as possible. Hopefully time will help to heal things.'MailOnline have contacted Kym's representatives for comment.  The Former Hear'Say singer - who is also mother to David, 27, and Polly, 12 - cut a very sombre figure as she was spotted out shopping on Thursday. Kym also had a son Archie, but he sadly died at 21 weeks in 2009.She and her eldest daughter stopped by a shoe shop before heading to grab lunch at a bakery.Kym donned an animal print tracksuit which she teamed with a black leather biker jacket and comfy trainers. ",
        "While the former soap star often shares snaps and gushing tributes to her children on social media, however she seemingly has deleted all trace of Scott.Despite this her profile still lists herself as a mother, actor and 'Wife to Scott'.Kym was previously married to EastEnders' Jack Ryder from 2002-2009 and Hollyoaks' Jamie Lomas 2012-2014. Following her and Scott's wedding day in 2021, Kym took to Instagram to post a sweet tribute to her new husband and called him 'love of her life'.",
        "The sweet snap showed the pair dancing together at the wedding which took place at Sandhurst Military Academy.",
        "The pair tied the knot in front of friends and family only four months after announcing their engagement back in July.   The couple had been dating since July 2018 but have had to endure long stints of separation as Scott serves abroad, with Kym admitting last April that they had at the time been apart for seven months.Back in December 2018, Kym revealed she and Scott were facing six months apart as the soldier was due to return to Afghanistan for duty in the Parachute Regiment.Despite the long-distance looming, the star was resolute in her belief that their relationship would survive the strain.  ",
        "Kym split from Matt Baker three months before sparking up a romance with Scott, after a two-year romance.She was first in a relationship with builder David Cunliffe before her rise to fame in 2001's Popstars, and the couple had a son David, 25, and daughter Emilie, 25, during a five-year relationship.  After breaking onto the pop scene as a member of Hear'Say Kym married EastEnders star Jack Ryder, 36, in 2002, but they divorced in 2009 after she admitted having an affair with Hollyoaks star Jamie Lomas, 43.",
        "Kym went onto marry Jamie in 2012, and the couple have a eight-year-old daughter Polly. The couple's first child Archie, passed away shortly after his premature birth in 2009."
    ]
}