{
    "articleURL": "/debate/article-12060839/NADINE-DORRIES-MPs-Coronation-smacked-grubby-deals.html",
    "content": [
        "On big national occasions, my family — like millions of others — want to be together. For jubilees, royal weddings and funerals, the best china is dusted off, tea from Fortnum &amp; Mason ordered, bunting hung (if appropriate) and furniture rearranged to give everyone a good view of the TV.",
        "The Coronation was different. When I received an invitation, I was thrilled — but pondered hard on my response. Would I be taking the place of someone more deserving?I knew hereditary peers had missed out, even those whose forebears had undertaken ceremonial roles at coronations down the generations. There was a feeling that the essence of our heritage was being eroded to make way for some far less worthy to attend — namely, MPs.It took the reassurance of a trusted friend to convince me I should accept. I've been an MP for 17 years, she argued. I worked my way up through the ranks: from committee chairwoman on the Speaker's Panel to junior minister, Minister of State and then Secretary of State at the Department for Digital, Culture, Media and Sport (DCMS).I was not cut from the Oxbridge PPE cloth that gave others automatic ascension during the time of Cameron and Osborne. I've had to prove my worthiness and ability every step of the way, she reminded me.",
        "While at the DCMS, I oversaw both the Queen's Platinum Jubilee celebrations and last summer's Commonwealth Games — while ensuring that preparations for the Queen's eventual funeral were in place before I left.However, the proudest moment of my parliamentary career was the day in September 2021 when I was sworn in by the late Queen as a Privy Councillor. It was in that capacity that I had been invited to the Coronation.",
        "The Privy Council dates back to the 13th century and performs an ancient and ceremonial role, its formal function being to advise the monarch.I am passionate about our history and traditions: what are we without them? As a nation, we punch above our weight on the world stage — and that is in no small part due to the efforts of our working royals, who dedicate their life to service.So I accepted the invitation, and felt humbled to do so. But on the day, I was shocked to see so many backbench MPs from all parties — particularly the more inexperienced from the most recent intakes of 2017 and 2019.Among all the MPs, foreign dignitaries, religious leaders, recipients of the British Empire Medal and those who have assisted the King in his many charitable endeavours, Charles and Camilla could invite only a restricted number of family and friends.According to some reports, among the 2,000 guests, there were only around 40 members of the Royal Family, about 20 relatives of Queen Camilla, plus a smattering of Middletons. That's fewer than many people get to invite to their family wedding!Seeing all those MPs there dismayed me: it made me realise this historic occasion had been politicised. It was obvious to me that invitations had been used to reward certain MPs for grubby political favours to their party leaders. And that jarred horribly with the religious and ceremonial splendour of the day.",
        "As it was, many of the MPs were sitting virtually in the rafters with the pigeons, behind a screen and away from the camera crews.",
        "I'm sure they'd have enjoyed the service more watching at home, but I suppose they will at least be able to tell their grandchildren they were there.What was more disturbing was the presence of MPs and junior ministers in prime seats in the transept. There has never been a role for MPs at past coronations, so why this one? The answer, in my view, is that No. 10 was using a seat at the ceremony to oil the wheels of government.Of course, it wasn't just Tory MPs — Labour members nabbed an invitation, too. I spotted Labour whips there, along with some MPs known to be 'whips' narks' — who do the tale-telling on their colleagues.How could they be there, when Lady Pamela Hicks, our late Queen's childhood friend, bridesmaid and lady-in-waiting — who attended the 1953 Coronation — was not?Lady Pamela accepted her lack of an invitation with grace: something sadly lacking in those MPs who occupied seats that should have gone to others.Will Taylor Swift get Street wise?",
        "Many years ago, I opened a mini department store in an upmarket Cheshire village. I invited a neighbour — the actress Denise Welch — to open it, and she certainly drew the crowds.",
        "The thought that down-to-earth Denise might one day be mother-in-law to Taylor Swift — the mega-star singer is dating Denise's son, Matty Healy, lead singer with The 1975 — does bring a smile to my face.I wonder how long before Taylor gets to watch Denise's most notorious role, as Coronation Street man-eater Natalie Horrocks — and what she'll make of it?And, if music be the food of love — play on, Andrew Lloyd Webber!Let me give a shout-out to the Coronation music, from the arrangement of Psalm 122 by John Rutter to Sir Bryn Terfel singing Kyrie eleison in Welsh, a Byzantine chant and the beautiful new composition Make A Joyful Noise, by the West End legend himself.Lord Lloyd-Webber stirred the emotions, raised the spirits — and almost lifted the roof.Why Eurovision hits right note for Ukraine support",
        " Music is the art which is most nigh to tears and memory  Oscar Wilde",
        "I'm heading to Liverpool this weekend for the Eurovision Song Contest, which the UK is hosting on behalf of Ukraine.This is not what proud Ukrainians wanted: they explored every option, even holding the event on the Polish border. However, the European Broadcasting Union, an alliance of public-service media organisations such as the BBC, ruled it out because of security, transport and accommodation issues.",
        "I know that every effort has been made to ensure Ukraine is involved. And credit where it's due: Tim Davie, director-general of the BBC, whom I introduced to Ukraine Culture Minister, Oleksandr Tkachenko, has acted sensitively and collaboratively.I am sure Eurovision 2023 will be a huge success for Ukraine — and for Britain, as we showcase not only the music but what can be achieved by acting in solidarity with a nation under siege.What on earth are Scout leaders doing asking parents what gender their three-year-old identifies as? Well done to Sarah Heath who, when faced with this question, looked at her little boy, Jonathan, who was wearing an eye patch and carrying a cutlass, and answered: 'Pirate'!",
        "Lucy's win on BBC reviewI am delighted that Lucy Frazer, the new Secretary of State for Culture, Media and Sport, has announced a review of the BBC licence fee.When I held that position, I called for the review in preparation for having a new funding model in place for when the Royal Charter comes up for renewal in 2028.My reasoning was that the licence fee could not continue to rise at the current rate, with a bloated BBC putting even more pressure on the purses of hard-working families.Sadly, our review was blocked by the then Chancellor, Rishi Sunak. ",
        "So I'm delighted to see that Lucy has shown a bit of muscle and managed to get the review past the No. 10 gatekeepers. The excuse I was given at the time was that tax policy could be reviewed only by the Treasury. It was clearly nonsense. Well done, Lucy. I had begun to despair!"
    ]
}