{
    "articleURL": "/tvshowbiz/article-12050497/Lewis-Capaldi-walks-hand-hand-new-actress-girlfriend-Ellie-MacDowall-LA.html",
    "content": [
        "He recently gushed over his new romance with his girlfriend Ellie MacDowall.",
        "And Lewis Capaldi looked more loved-up than ever with the actress as they walked hand in hand in West Hollywood on Friday. The singer, 26, seemed in high spirits as he spent some quality time with the model, 23, while out on the stroll. The Someone You Loved hitmaker cut a casual figure in a oversized white Ace of Hearts T-shirt which he teamed with black trousers and white trainers. Emily looked effortlessly stylish for the outing in a bright green racer cropped top and black trousers. ",
        "The actress - who is set for stardom playing Cary Grant's daughter in an ITV biopic - wrapped a dark jumper around her shoulders and opted for a pair of Nike trainers. She toted her belongings around in a small red crossbody bag and accessorised by layering several gold necklaces. Emily shielded from the sun behind a pair of chunky black sunglasses as she walked holding hands with her new beau. The beauty completed her look by styling her dark tresses pulled back in a neat up do from a centre parting.   Lewis has been in Los Angeles after performing a concert at The Greek Theatre earlier this week. The couple seemed to enjoy some downtime together before the Hold Me While You Wait singer hits the stage at the Arizona Financial Theatre for his sold out concert on Saturday evening. ",
        "It comes after Lewis discussed his new relationship - as well as his new single Wish You The Best - during a recent chat with Radio 1's Scott Mills.Lewis said: 'I have a girlfriend and that’s going really well, I am happy happy, she’s a lovely lady I feel good about everything.'",
        "The hitmaker was first spotted with his new girlfriend back in November, as the pair were pictured on a night out and then a romantic dinner in the early hours of the morning. They were then reportedly seen at the BRITs afterparty in February, where they struggled to keep their hands off each other. It seems they have lots in common as well because Ellie works in the arts too and she's a fellow Scot. She's a triple threat - trained in acting, dancing and singing. This year Ellie will also have a starring role in new biopic Archie focusing on the actor Cary Grant.The four-part drama series will cover his humble beginnings in the UK to his phenomenal rise to success in America. Ellie will be playing the part of his daughter, Jennifer Grant in the series, which will air on ITV's new streaming service, ITVX. It appears that Lewis' new song Wish You The Best - which was released last month - is not a comment on his current happy love life.",
        "Discussing his new song, Lewis said: 'It’s about someone moving on and that feeling where you know it’s the best thing for that person but you want to say to them and all you say is \"good luck I’m really happy for you.\"'He continued, poking fun at his own tendency to write songs about sad situations: 'But actually you are dying inside and want to tell them all the things you miss about them and why they should stay with you, so just a really happy song for the summer.'",
        "Lewis previously dated Love Island winner Paige Turley on and off from 2014 to 2016 after they met at college in Motherwell.She is said to have inspired his smash hit album Divinely Uninspired To A Hellish Extent and his hit song, Someone You Loved.Speaking previously about the inspiration for the record, Lewis said: 'I met a lady. She was very nice. I loved her. I loved the look of her and I loved how she spoke.The singer shot to fame in 2019 after his hit single Somebody You Loved topped the UK Singles Chart for six weeks - and which recently became the UK's most streamed song of all time. He then was reported to have dated student Catherine Halliday for seven months before splitting in September 2020.",
        "Lewis revealed he was on dating app Hinge after being thrown off Tinder and Bumble because people thought he was pretending to be Lewis Capaldi.He has now achieved four number ones and his debut album, Divinely Uninspired To A Hellish Extent, sold over 10 million copies worldwide His second album Broken By Desire To Be Heavenly Sent will be released in May, before he performs at Glastonbury Festival in the summer. "
    ]
}