{
    "articleURL": "/wires/aap/article-12047833/Call-Las-Vegas-NRL-pre-season-games-imminent.html",
    "content": [
        "The NRL will decide in a matter of weeks whether to take two games to Las Vegas next season, with CEO Andrew Abdo insisting the plan is a genuine attempt at growing the game in the American market.",
        "Australian Rugby League Commission chair Peter V'landys flew out on Thursday to begin getting the proposed double-header off the ground in the USA and will be joined by Abdo next week.The matches, envisaged as the 2024 season openers, would be the first played for premiership points outside of Oceania.They would also mark the NRL's first trip to America since taking a State of Origin exhibition match to Long Beach, California in August 1987.South Sydney, Manly, Brisbane, Melbourne and the Sydney Roosters have all been suggested as potential participants in the Vegas extravaganza, which is seen as a potentially lucrative chance to break into the American sports gambling market.The NRL also has the chance to spruik the game to a new audience of fans already enamoured with the similarly gladiatorial NFL.\"It represents multiple opportunities for us to think about new fans but also to create excitement at the start of the season,\" Abdo said.But the logistical challenges are considerable. Moving four teams and support staff safely around the globe to a party hotspot, promoting the fixtures to uninitiated spectators and fitting the matches in with the 2024 draw will require extensive planning on the NRL's part.\"We need to make a call fairly quickly,\" Abdo said.",
        "\"In the next couple of weeks we will know whether or not it's feasible.\"From there, we need to start then working with everyone involved if it's going to happen to make it happen, including of course the impact on the draw.\"The proposed Vegas trip has dominated headlines in recent weeks and captured the attention of local fans and NRL players.But Abdo insisted the matches were an earnest attempt to grow the game in the USA.\"We're not doing this as a once-off PR stunt,\" he said.\"We're taking a long-term, strategic view so we want to make sure that we've got the building blocks necessary to really maximise the event.\"We need to look at stadiums, we need to look at costs and we need to look at making sure we have the right opportunity to engage the right influencers in the American market to really maximise and showcase a game that we're really proud of.\""
    ]
}