{
    "articleURL": "/wires/aap/article-12040617/Melbourne-maintain-two-NRL-teams-Storm-boss.html",
    "content": [
        "Melbourne Storm boss Justin Rodski says Victorian rugby league isn't strong enough to support a second NRL team after the idea was floated by ARL chairman Peter V'Landys.",
        "The Storm are well-supported in Melbourne - they boast the third-biggest club membership in the NRL and last year had the third-biggest average attendance, coming on the back of sustained success since they joined the competition in 1998.V'Landys said the NRL was seriously looking into an 18th team, with Perth, New Zealand or a Pasifika team also possible options.North Sydney Bears, who play in the NSW Cup after being axed as a sole entity from the top grade at the end of 1999, are also rallying for a return.But Rodski didn't believe the game in Victoria was strong enough to sustain two teams.\"We wouldn't a support a second team in Victoria,\" Rodski told SEN on Wednesday.\"The Storm have been in Melbourne for 25 years, we've established a strong brand, loyal membership, great crowds and we think we hold a really special place in the Melbourne sporting landscape.\"But that's taken a lot of hard work plus we've been blessed with unprecedented on-field success that's certainly helped us.\"Rodski said the NRL hadn't done enough to grow the game in the state to make a second team commercially viable like 2023 newcomers the Dolphins, who are located in greater Brisbane.\"The challenge has been around junior development and participation and we share that responsibility with the NRL but we've been disappointed with the lack of funding to put more resources into junior pathways and participation in Victoria,\" he added.",
        "\"As a result of that I don't think the grassroots and the community rugby league is anywhere near strong enough to support (another) team let alone the commercial reality.\"He said AFL-mad Melbourne and Brisbane, where rugby league is No.1, couldn't be compared.He used GWS and Gold Coast in the AFL as examples of teams struggling to build a foundation commercially a decade after they were set up outside their code's heartland.The Dolphins were launched as a bid for inclusion in the NRL by the Queensland Cup's Redcliffe Dolphins, who have produced a swag of star players in their club's 76-year history.\"We are in an AFL market ... in Queensland you're putting a new team in a rugby league heartland with a club that's well-supported commercially so it's a much different equation,\" Rodski said.\"I just don't think Victoria is the place for expansion. I think the NRL should be looking at New Zealand, potentially Perth and even that team around a Cairns team with a Pasifika flavour.\"They would certainly be, in my mind and the Melbourne Storm's view, a much better direction for the NRL to take.\"Skipper Christian Welch said the Storm succeeded in Melbourne because it was a one-team town.\"I think that's why the Storm works well,\" Welch also told SEN.",
        "\"We obviously play second fiddle to the AFL clubs but I think a lot of the AFL people go, 'Oh yeah, I also go for the Storm as well'.\""
    ]
}