{
    "articleURL": "/wires/pa/article-12053835/Serving-King-late-Queen-honour-privilege--says-royal-butcher.html",
    "content": [
        "A royal butcher has spoken of the privilege of serving the King and his late mother as coronation celebrations get under way.",
        "The Royal Deeside village of Ballater – often dubbed one of the most royalist towns in Britain – has bunting and flags on almost every shop window.The HM Sheridan butcher’s shop in the village high street was granted a royal warrant for the late Queen and Charles in 1987 to serve Balmoral Castle and Birkhall, the King’s estate nearby.Co-owner John Sinclair is proudly displaying his specially made coronation sausages, made of pork, plum and ginger, to mark the coronation.",
        "The shop is known for its specialist sausages for the royal family’s famous barbeques at the castle on the nearby Balmoral Estate.The recent births of royal children were also marked with special sausages, including George’s Strathearn Sausage, made of venison and heather herb, while the Dumbarton sausage was made after the birth of Archie in recognition of his father Harry’s Scottish title as the Earl of Dumbarton.Mr Sinclair told the PA news agency: “For the coronation we have produced a coronation sausage. The idea behind it was we’ve never made a sausage with plum before, so we thought it had to be something special to mark the special occasion.”The Ballater butcher’s shop was visited regularly by Elizabeth II and the Balmoral Estate had placed an order a few days before her death.",
        "Mr Sinclair said: “We served the late Queen up until she last year when she died at Balmoral. It has been an honour and a privilege to work with them – and the same with the Prince of Wales (now King) as well.“I hope we can do some work with him in the future.”Mr Sinclair, who was chairman of the Ballater Highland Games, also recalled his times sitting with Charles at the famous event.And after the town became one of the communities impacted when Storm Frank caused millions of pounds of destruction in 2015, the King joined his mother to reopen the butcher’s shop, and took time to speak with people whose homes had been flooded.Mr Sinclair added: “The royals do a hell of a lot for this area, especially Ballater. The King came to visit the shop after Storm Frank and he reopened the shop after it was rebuilt.”"
    ]
}