{
    "articleURL": "/tvshowbiz/article-12044451/Iggy-Azalea-releases-raunchy-sex-tape-joining-OnlyFans.html",
    "content": [
        "Iggy Azalea is taking her career in adult entertainment to the next level.",
        "After joining OnlyFans in January, the rapper has now stepped things up by releasing a sex tape on her official merchandise store. It's unclear if the VHS tape actually contains sexually explicit acts or if it's just a decorative piece of merch, but it has already completely sold out online. Iggy was previously involved in a sex tape scandal back in 2014 following the release of her chart-topping hit Fancy.At the time, the Australian star's ex-boyfriend, Houston hip-hop artist Hefe Wine, was in talks with porn company Vivid about potentially releasing the scandalous video.",
        "However, Iggy denied that she was the woman in the tape and declined Vivid CEO Steve Hirsch's rumoured six-figure offer to release it.According to the Sydney Morning Herald, the rapper's lawyers also threatened to sue Vivid if they marketed the tape off of Azalea's name.These days, Iggy is raking in millions releasing raunchy content on OnlyFans.She previously said that she'd never join the racy platform, declaring in 2021 that she 'didn't want to make that type of content'.However, the Black Widow hitmaker is now one of the biggest celebrity creators on the site and is estimated to have earned well over $4million since launching her account.",
        "She's currently charging subscribers $25 per month, but users have to pay more via upselling to access sexier stuff.",
        "If you tip the star $250, you get to become a 'VIP' for 12 months, which includes one free exclusive photo and some other unknown benefits. The star recently fired back at critics of her OnlyFans venture after some said her content wasn't raunchy enough to justify the $25-per-month subscription fee. Addressing a fan on Twitter, the musician said she does pose nude on the platform, but that subscribers need to pay a lot more than the $25 entry fee to see it.'Iggy, baby, please show more on your OnlyFans,' the fan tweeted. 'I'm tired of people complaining about your platform.'",
        "The Fancy hitmaker responded: 'Anyone saying that is broke and hasn't unlocked the paid content because I pose nude.''It's $25 entry, not $25 for full access. They thought wrong,' she added, before tweeting out a photo of herself baring her famous derrière in lingerie.Iggy is currently one of Australia's wealthiest music artists after selling her entire music catalogue for an eight-figure sum to a private equity firm.Daily Mail Australia can confirm that Iggy's OnlyFans feed contains a number of racy images and short clips of the hip-hop star, although there is no explicit sexual acts. "
    ]
}