{
    "articleURL": "/tvshowbiz/article-12046029/Aidan-Turner-stops-traffic-vintage-car-filming-new-Disney-series-Rivals.html",
    "content": [
        "Aidan Turner looked rather serious on Thursday as he took to the set of his new Disney+ series Rivals. ",
        "The actor, 39, stopped traffic while filming in the Tetbury as he drove a vintage yellow Mini Clubman estate. He looked worlds away from his Poldark character Captain Ross as he was pictured rocking a brand new look, swapping his usual stubble for a handlebar moustache. The Irish star rocked a rather smart ensemble including a khaki blazer, a colourful pink checked shirt and a skinny black tie. Aidan was spotted walking with his hand in his grey trouser pocket and donned a pair of brown lace up shoes. ",
        "The TV star did a U-turn in the vintage car before crew members were seen wiping the rain from the windscreen. Aidan will play intelligent TV presenter Declan O'Hara, whom will be convinced to leave the BBC for independent channel Corinium, only for him to feel let down. His character is married to Maud, played by fellow Irish actor Victoria Smurfit.The upcoming adaption of Jilly Cooper's iconic novel also features Danny Dyer, David Tennant, Emily Atack, Katherine Parkinson, Oliver Chris and Claire Rushbrook.The story is set in 1986 and follows the cut throat world of independent television, including the tense rivalry between Rupert Campbell-Black (Hassell) and Lord Tony Baddingham (Tennant).Following the announcement executive producer and Rivals author Jilly Cooper commented: 'I'm utterly enchanted to be able to announce our all-star line-up for Rivals'.",
        "'Featuring some of the best acting talent that the British Isles has to offer, I couldn't have dreamed of a better ensemble cast'.Before adding: 'I cannot wait to be on set and see them bring the characters I love so much to life. 'The minute we met with Alex we knew he'd perfectly embody my all-time hero, the iconic, racy, ruthless, and devastatingly handsome, Rupert Campbell-Black. Viewers are in for a treat!'.",
        "According to Disney+, Rivals is a 'joyously mischievous rollercoaster ride, steamy in its love stories and packed with larger-than-life characters.'The streaming service continues that it brings a '2020s lens to the 1980s', offering a 'raw exploration of a complicated moment in British history when class, race, sex, wealth, and sexual liberation meant that, for the very privileged few, there were no limits to what they could achieve'.Rivals is being produced by Happy Prince, which is part of ITV Studios, and will air globally on Disney+, on Hulu in the US and on Star+ in Latin America."
    ]
}