{
    "articleURL": "/sport/formulaone/article-12049949/Fernando-Alonso-laughs-Taylor-Swift-speculation-amid-dating-rumours.html",
    "content": [
        "Alonso is reportedly dating singer Swift but the rumours yet to be confirmedHe has previously refused to comment when asked about his relationship statusThe Spaniard was teased on the Miami GP's TikTok account over Swift this weekF1 star Fernando Alonso has been recorded laughing off his rumoured relationship with singer Taylor Swift ahead of the Miami Grand Prix.",
        "There has been speculation regarding a potential romantic relationship between the pair after Swift split from her long-term partner Joe Alwyn last month, around the same time that Alonso and Andrea Schlager split up.The Miami GP official TikTok account has now hinted at the romance as they posed a question to Alonso as he walked past on Thursday.A whiteboard was presented to the F1 driver with the question of the day: 'Favourite Taylor Swift song?', which he laughed off as he continued to walk by. The video caption joked: 'Cannot confirm nor deny if we've got a Swifty here', when referencing Alonso as a fan of the singer.",
        "The Spaniard has earned a reputation for being a playboy due to several high-profile relationships throughout his career, with Swift rumoured to be his latest girlfriend.He most recently dated Schlager, a presenter, but has romantic history with Miss Switzerland runner-up Xenia Tchoumitcheva, Italian lingerie model Linda Morselli and was engaged to journalist Lara Alvarez.The F1 driver was also married to singer Raquel Del Rosaria, as they tied the knot in 2006 before their divorce. Alonso was previously questioned as to whether there was any truth to the rumours about him and Swift, and the 41-year-old delivered a sharp 16-word response.'I usually keep my personal and professional life apart. I prefer not to comment on it,' he said. ",
        "Swift, 33, has also remained coy on the situation as the F1 community are enjoying teasing Alonso over the rumours.Pundit Karun Chandhok referenced Swift several times during Alonso's qualifying lap at the Azerbaijan Grand Prix at the end of April in a hilarious TikTok post. It remains to be seen as to whether either party will officially confirm their romantic situation, but for now the F1 community are having fun teasing the driver. "
    ]
}