{
    "articleURL": "/tvshowbiz/article-12053113/Kandi-Burruss-scores-Emmy-Tony-nominations-ahead-premiere-18th-season-RHOA.html",
    "content": [
        "Kandi Burruss moved closer to achieving 'EGOT' status with two big nominations this week.",
        "The 46-year-old singer, songwriter, and actress received an Emmy nomination on Monday and a Tony nod on Tuesday.Kandi and her husband, Todd Tucker, received a Tony nomination for their work on the production team of the hit Broadway show The Piano Lesson, the day after Kandi received her first Emmy nomination for her work on the Spanish TV show La Musica de La Familia.The Grammy-Award winner - who shot to fame in 1992 as a member of the female vocal group Xscape - expressed her excitement while speaking with The Hollywood Reporter this week, saying, 'I'm overjoyed right now. This is kind of unbelievable.'She added, 'You know how you've been speaking things into existence in your life and praying for it and doing all that? But when it actually starts happening in a major way, you're almost like, \"Whoa, is this happening?\"'",
        "'To have the two nominations happening back-to-back within 24 hours — it was just unbelievable,' she said.This comes as the 15th season of The Real Housewives of Atlanta is set to premiere on Sunday, May 7. Burruss won the Best R&amp;B Song Grammy Award in 2000 for co-writing the TLC hit No Scrubs.Kandi met her husband Todd in 2011 on the set of The Real Housewives of Atlanta.",
        "They married in 2014 and went on to start a family with the arrival of their son Ace, six, in 2016.They brought a baby daughter named Blaze, three, into their lives via surrogate in 2019. The performer previously welcomed a daughter named Riley, 19, with her former partner Russell Spencer. Riley was only seven years old when her mother joined Real Housewives of Atlanta, and Kandi is now the longest-running Housewives star on Bravo. ",
        "Burruss has been vocal about her EGOT aspirations over the past year. In March 2022, while speaking with Revolt, Kandi clarified that it was her 'dream' to win a Tony, an Emmy, and an Oscar to join the exclusive club.Kandi said, 'One day, I'd love to be able to say that I'm an EGOT winner. It's my goal to get them all.'She added, 'Right now, I got a Grammy, but my dream is to get that Oscar, that Tony, and that Emmy.'"
    ]
}