{
    "articleURL": "/wires/ap/article-12040581/Gourde-gets-OT-goal-Kraken-beat-Stars-despite-Pavs-4-goals.html",
    "content": [
        "DALLAS (AP) - Yanni Gourde scored 12:17 into overtime with a quick shot after regathering a loose puck and the Seattle Kraken beat Dallas 5-4 in Game 1 of their second-round series Tuesday night, even as Joe Pavelski scored all four Stars goals in his return to their lineup.",
        "Gourde was on the edge of the circle to the left of the Dallas net when he appeared to try to send a pass to a teammate on the blue line to reset. The puck instead ricocheted off Evgenii Dadonov, and Gourde quickly whipped around for a shot that went into a small gap to the left of goalie Jake Oettinger for the game-winner.\"Got a retrieval, stayed on the puck, and then I was just fortunate,\" Gourde said. \"I turned around and I found the back of the net.\"Pavelski, at 38 years and 295 days old, became the oldest player ever with a four-goal game in the NHL playoffs. It came in in his 170th postseason game - he is one of only five players with that many without winning a Stanley Cup - and after he had missed the last five games in the first round while in concussion protocol.\"Epic. Epic. Ashamed we wasted it and didn´t win,\" Stars coach Pete DeBoer said. \"That´s on our group because, you know, he more than do his part. He tried to drag us to a win.\"The second-year Kraken got goals from five different players after 15 different players scored in their seven-game series win over defending Stanley Cup champion Colorado.",
        "Jaden Schwartz, Justin Schultz, Oliver Bjorkstrand and Jordan Eberle also had goals for Seattle, all in the first period.\"Every win, especially right now, you need everyone going, everyone chipping in and everyone elevating their game,\" Schwartz said. \"We rely on everybody. We need to and we like our depth and we´ve done a good job.\"Pavelski scored twice in the first period. His first goal was a 25-foot wrister only 2 1/2 minutes into the game to put the Stars ahead 1-0. He scored on his first shot, on a pass from Mason Marchment. Max Domi got the secondary assist.About 10 minutes later, after Seattle had gotten even, Pavelski scored again from about the same distance with a redirect of Thomas Harley´s shot. The Kraken then scored three goals in a 68-second span to take a 4-2 lead.But Oettinger then stopped 33 consecutive shots before Gourde got the game-winner right around midnight local time.Seattle has now won three consecutive road games in the playoffs. The Stars, just like in the first round against Minnesota, lost the series opener - they lost that one 3-2 in double overtime before going on to beat the Wild in six games.Game 2 of the best-of-seven series is Thursday night.Pavelski´s fourth goal of the night with 6 1/2 minutes left in the third period tied the game at 4, when he swatted a puck in the net out of mid-air after Jani Hakanpaa's shot ricocheted off the stick of Adam Larsson into the air toward the crease. He had notched his second career postseason hat trick midway through the third period when he knocked in a rebound after captain Jamie Benn´s shot.",
        "\"As soon as they got the third goal, the momentum swings, and they came in waves, the building's rocking,\" Seattle coach Dave Hakstol said. \"But to be able to get through to the overtime, the intermission, settled down a little bit and just get back to our game. We didn´t do anything spectacular out of the ordinary in overtime.\"Philipp Grubauer had 31 saves for the Kraken, one into his chest with 22 seconds left in regulation on a shot by rookie Wyatt Johnston, who also was wide of the net with another in final minute. It was Grubauer's fifth game this postseason with at least 30 saves.Seattle didn´t score first like they did in every game against the Avalanche. Instead, it was Pavelski who got the opening goal at home after a rousing ovation when introduced before the game.Bjorkstrand, who scored the Kraken's only goals in their 2-1 win over the Avalanche in the clinching Game 7 two nights earlier, scored the second of their three quick goals in the first period to put them up 3-2.That came only 11 seconds after Schultz had tied the game, and the Kraken got control of the ensuing faceoff.Seattle's first goal by Schwartz, which was sandwiched by Pavelski's first two goals, was on a shot through Oettinger's legs.",
        "___AP NHL Playoffs: https://apnews.com/hub/stanley-cup and https://twitter.com/AP_Sports"
    ]
}