{
    "articleURL": "/tvshowbiz/article-12046341/Kourtney-Kardashian-poses-bikini-reveals-figure-fertility-treatment.html",
    "content": [
        "Kourtney Kardashian shared a picture of herself wearing a skimpy bikini on Instagram after documenting her fertility journey. ",
        "The reality star, 44, shared pictures as she wished her friend Natalie a Happy Birthday and included an unfiltered snap of herself in the swimwear.It is unclear when the photograph was taken but Kourtney has previously opened up about her long fertility journey as she and husband Travis Barker try to have a child. She wrote on the social media post: 'A little IVF body' as she smiled alongside her friends in the sunshine.  The star, who founded POOSH, put her hair in a bun and wore black sunglasses in the glamorous picture. ",
        "It comes after Kourtney  hit back at a fan who asked if she was pregnant after she posted behind-the-scenes photos from her recent Lemme Purr campaign shoot.The reality sensation attributed her midsection to the 'after affects of IVF' in March.'I only acknowledge this comment bc I do think it's important to know how IVF affects women's bodies and it's not spoken about much,' she wrote.She finished with: 'Also are we still asking women if they're pregnant?', along with a yellow heart emoji.  Kourtney has been open with fans about her attempts to conceive a child with husband Travis Barker through in vitro fertilization. However, she quit IVF a little over a year ago.The comment was made in a post Kourtney shared featuring behind-the-scenes images of her recent Lemme Purr shoot. ",
        "In the photos, Kourtney slipped her body into flirty cropped sweater and matching canary yellow leather pants as she posed with a bottle of her new gummies.The photos captured the reality sensation laying on the floor as her co-star, a cute cat, made their way around the set.",
        "In 2022, Kourtney detailed her struggle with IVF as she attempted to have a child with Travis. In episode two of The Kardashians, we saw Kourtney at her Calabasas home as Kris came to visit, asking how the doctors went, as Kourtney responded: 'Awful.'Kourtney revealed in confession that her and Travis want to have a baby, so their doctor took them 'down this road of doing IVF, and it hasn't been the most amazing experience.'The reality star is mother to Mason, 12; Penelope, nine; and Reign, seven — with her former partner Scott Disick, whom she dated from 2005 until 2015. "
    ]
}