{
    "articleURL": "/wires/ap/article-12048003/WVa-residents-rip-pesticide-facility-plan-hearing-looms.html",
    "content": [
        "CHARLESTON, W.Va. (AP) - A West Virginia logging company hoping to locate a toxic-spewing facility in the picturesque Allegheny Mountains won't be allowed to build in that particular spot due to a zoning issue, a local official said Thursday night.",
        "Allegheny Wood Products wants to construct a fumigation facility in the Hardy County community of Baker to treat logs before they are shipped overseas. The state Department of Environmental Protection's Division of Air Quality has said it tentatively plans to issue an air permit that would let the facility emit up to nearly 10 tons of the pesticide methyl bromide into the atmosphere each year.But during a public hearing, Hardy County Planner Melissa Scott said the proposed location off U.S. Route 48 is zoned for agricultural use, not industrial use. Scott read a letter approved by the county commission on Tuesday that said \"the requirements for Hardy County zoning compliance have not been met.\"Local residents have bombarded regulators with opposition to the facility, saying it would be a threat to their health and the environment. State air quality permit engineer Steve Pursley said meeting air quality thresholds, not public opinion, is what factors into the issuance of the state permit. A final decision on the permit will be made sometime after the public comment period on the proposal ends May 12.But Scott said feedback from residents \"is still the primary point of zoning.\"Obtaining an air quality permit is the first of several regulatory checklists the proposed facility would have to pass.",
        "\"Unfortunately, in West Virginia, the local permitting is the last hurdle,\" Scott said. \"As a former hurdler, I see the DEP's hurdle is probably pretty low. Their regulations are based on a very specific set of technical requirements and they do not necessarily include local opposition as a mandatory consideration.\"The county, on the other hand, is probably going to be a much higher hurdle for Allegheny Wood Products. There are no plans now nor in the future for fumigation to happen on this property.\"In earlier comments posted on the DEP's website, some Hardy County residents invoked the Feb. 3 fiery train derailment in East Palestine, Ohio, and other environmental disasters in asking officials to preserve their health and natural resources.Hardy County, along the Virginia line less than a two hours' drive from Washington, D.C., has about 14,000 residents, considerable poultry and other agricultural operations, and offers tourists an array of river float trips and hiking and cycling trails.\"Please do not let this be another manmade disaster,\" Janet Fisher of Moorefield wrote in a lengthy letter to the DEP. \"Please protect those who are helpless creatures of the water and of the air. They have no voice. We are their only voice. Help us keep this little part of Heaven safe for future generations.\"",
        "Founded in 1973 with one sawmill in Riverton, West Virginia, Allegheny Wood Products has grown to eight sawmills in the state and touts itself as one of the largest producers of eastern U.S. hardwoods.Several residents pleaded with the DEP prior to the hearing to further review the public health and environmental threats from the pesticide´s fumigation use and seek alternative treatments, such as the use of heat or steam for fumigating the logs during their ocean transport.The U.S. Environmental Protection Agency says methyl bromide is an odorless, colorless gas used to control pests in shipping and agriculture. While dozens of countries have stopped most uses of methyl bromide, the countries Allegheny exports the logs to require the pesticide fumigation treatment.Under a three-decade-old international treaty called the Montreal Protocol, the United States and 197 other countries restricted most uses of methyl bromide, including in soil applications for crops, in an attempt to protect the ozone layer. But pre-shipment applications to logs were allowed to continue to help prevent the introduction or spread of pests and diseases. That exemption is valid until an acceptable alternative for methyl bromide is found, but the U.S. Department of Agriculture has not approved one.According to the U.S. Centers for Disease Control and Prevention, methyl bromide also is a neurotoxin that can cause lung disease, convulsions, comas and ultimately death. It is three times heavier than air, can accumulate in poorly ventilated or low-lying areas and remain in the air for days under adverse conditions, the CDC said.",
        "About 20 states now regulate the use of methyl bromide in log fumigation, according to the Southern Environmental Law Center.Allegheny Wood Products owned two fumigation facilities in Moorefield. One opened in 2018 and has met air quality standards, according to the DEP. The other facility closed last year and the company now wants to move it 16 miles (25 kilometers) to Baker."
    ]
}