{
    "articleURL": "/tvshowbiz/article-12061545/Jane-Fonda-Diane-Keaton-stun-alongside-Mary-Steenburgen-Candice-Bergen-Book-Club-premiere.html",
    "content": [
        "Four Hollywood legends looked incredible on Monday night in New York City, as Jane Fonda, Diane Keaton, Mary Steenburgen and Candice Bergen united for the premiere of their film Book Club: The Next Chapter.",
        "Fonda, 85 — who is the 'happiest' she's ever been — stunned in a shimmering black suit and chic silver hair.Keaton, 77, rocked her signature style of a flat-brimmed hat, quirky striped dress and black turtleneck.Steenburgen, 70, was a breath of fresh air in her vibrant floral gown, accessorizing with her dapper husband Ted Danson, 75.And Bergen, 76, looked elegant in her cloud-colored blazer, black pants and royal blue earrings. ",
        "Premiering in theaters Friday May 12th, Book Club: The Next Chapter is a sequel to the hit 2018 film Book Club.The original film centered around the four stars as they read the steamy book Fifty Shades of Grey. Book Club: The Next Chapter will see the ladies head to Italy for a wild bachelorette trip filled with romance and zany hijinks. The first film was a surprise hit at the box office, raking in $104 million on a budget of $14 million. The sequel has been earning solid reviews so far, earning a 65% score on Rotten Tomatoes.  Don Johnson, 73, who plays Fonda's love interest in the film, looked like a debonair leading man at the premiere in his dark blue suit.The event brought out a bevy of Real Housewives as RHONJ's Margaret Josephs attended with her mother, while RHONY stars Luann de Lesseps and Jill Zarin also turned up. ",
        "Other stars in attendance were supermodel Maye Musk, Top Chef judge Gail Simmons, and Brady Bunch alum Eve Plumb. ",
        "During the film's whirlwind press tour, Jane declared in an interview that she is the 'happiest' she's ever been.The star spoke to People magazine about the experience of aging and how she has faced adversity in her life.'There's been tragedy and hard things in my life. But I've never succumbed to them. I've been resilient all my life,' she told the outlet. On getting older: 'A bad thing happens, and you think, \"Well, that's happened before and I'm fine. I'll get over it.\" You know what's important. I spent a lot of time like a canoe with no paddle being carried in the current. As I got older. I learned I'm going to put an oar in the water and steer.' "
    ]
}