{
    "articleURL": "/wires/afp/article-12051849/Covid-no-longer-global-health-emergency-WHO.html",
    "content": [
        "The Covid-19 pandemic, which killed millions of people and wreaked economic and social havoc, no longer constitutes a global health emergency, the WHO said Friday, warning that the threat remained.",
        "It is \"with great hope that I declare Covid-19 over as a global health emergency\", World Health Organization chief Tedros Adhanom Ghebreyesus told reporters.The move came after the WHO's independent emergency committee on the Covid crisis agreed it no longer merited the organisation's highest alert level and \"advised that it is time to transition to long-term management of the COVID-19 pandemic\".But the danger was not over, according to Tedros, who estimated Covid had killed \"at least 20 million\" people -- about three times the nearly seven million deaths officially recorded.\"This virus is here to stay. It is still killing, and it's still changing,\" he said.\"The worst thing any country could do now is to use this news as a reason to let down its guard, to dismantle the systems it has built, or to send the message to its people that Covid-19 is nothing to worry about.\"- Never again -The UN health agency first declared the so-called public health emergency of international concern (PHEIC) over the crisis on January 30, 2020.That was weeks after the mysterious new viral disease was first detected in China and when fewer than 100 cases and no deaths had been reported outside that country.But it was only after Tedros described the worsening Covid situation as a pandemic on March 11, 2020, that many countries woke up to the danger.",
        "By then, the SARS CoV-2 virus which causes the disease had already begun its deadly rampage around the globe.",
        "\"One of the greatest tragedies of Covid-19 is that it didn't have to be this way,\" Tedros said, decrying that \"a lack of coordination, a lack of equity and a lack of solidarity\" meant \"lives were lost that should not have been\".\"We must promise ourselves and our children and grandchildren that we will never make those mistakes again.\"Even though Covid deaths globally have plunged 95 percent since January, the disease remains a major killer.Last week alone \"Covid-19 claimed a life every three minutes\", Tedros said, \"and that's just the deaths we know about.\"\"The emergency phase is over, but Covid is not,\" agreed Maria Van Kerkhove, the WHO's technical lead on Covid-19.- 'We can't forget' -Vaccines, which were developed at record speed and started rolling out by late 2020, remain effective at preventing severe disease and death, despite new and more infectious Covid variants that have appeared.To date, 13.3 billion doses of Covid vaccines have been administered, with 82 percent of adults over 60 having received the initial jabs.However greed and gaping inequities surfaced, as wealthy countries hoarded the jabs and poorer ones struggled for months to get hold of a single dose.",
        "An antivax movement on steroids and massive misinformation campaigns over social media meanwhile turned vaccination into a charged political issue.The pandemic also exposed staggering inequality in access to healthcare and services, from the long lines of Brazilians waiting for oxygen for loved ones gasping for air, to the funeral pyres that crammed New Delhi's sidewalks as the bodies piled up in early 2021.\"We can't forget those fire pyres, we can't forget the graves that were dug,\" Van Kerkhove said, her voice catching with emotion. \"I won't forget them.\"- Origins a mystery -Tedros has warned of the ongoing impact of Long Covid, which provokes numerous and often severe and debilitating symptoms that can drag for years.This condition has been estimated to impact one in 10 people who contract Covid, suggesting that hundreds of millions could need longer-term care, he cautioned.The world is currently striving to put in place measures to help avert future global health catastrophes.But those efforts are being hampered by heated debate around the origins of the pandemic.The virus was first detected in late 2019 in Wuhan China, but it remains unclear how and where it first began spreading among humans.The issue, which has been heavily politicised, has proved divisive for the scientific community, which is split between a theory that the virus jumped naturally to humans from animals and one maintaining that the virus likely leaked from a Wuhan laboratory -- a claim China angrily denies.",
        "WHO and its member states have meanwhile launched discussions about an international treaty or something similar to draw lessons from the mistakes made and ensure the world reacts more effectively and equitably to the next one.The question is not if, but when."
    ]
}