{
    "articleURL": "/wires/pa/article-12056065/Avid-bakers-country-create-bespoke-cakes-coronation.html",
    "content": [
        "Avid bakers and cake business owners across the country have put their skills to the test creating bespoke cakes to celebrate the King’s coronation.",
        "On Saturday, Charles was crowned King and while the UK witnessed its first coronation in more than 70 years, skilled bakers were hard at work to create intricately designed bakes.From crown-shaped cakes to bakes imprinted with the King’s insignia, the sweet treats have garnered interest on social media for their complex designs.Lee McAuliffe, from Shave in Blackburn – who has been baking for 10 years, said his coronation cake took 15 hours to make.“In total, including baking, around 15 hours. This was an order for a client to celebrate (the coronation),” the 46-year-old told the PA news agency.",
        "The two-tiered cake is compromised of a chocolate fudge crown with chocolate fudge buttercream and a gluten-free lemon sponge with lemon curd buttercream for the lower tier.Mr McAuliffe used his “trademark” look whilst incorporating Union flag bunting to accompany the crown-shaped cake.“I knew I wanted a crown to be the main part of the design and obviously, Union flag bunting had to make an appearance,” he said.“My lower tier has become a bit of my trademark look so with the gold this worked well in combining all the elements I thought of.”Catherine Davies, who turns 52 on Sunday, owns her own cake business but is also a teaching assistant in Tunbridge Wells, and created a triple-layered vanilla cake with lemon and elderflower buttercream ahead of the coronation.",
        "The cake was part of a raffle with the winner feeling “delighted” after receiving the sweet treat.",
        "“The drip cake is one of my most popular cakes. The lady who won it wanted a nod to the coronation on it,” Ms Davies, from Crowborough in East Sussex, told PA.“She was delighted to win the cake and was very happy when she saw it, commenting on how beautiful it was.”Ms Davies said the bespoke creation, which dons the official insignia, took around two hours to make.“I thought the insignia on the top was elegant and looked good in gold, matching the drip down the sides,” she said.“The flavour was chosen by the customer after I gave her lots of options. It’s a lovely summery flavour.”The business owner, who has been baking professionally for five years, celebrated the coronation with her son, who is home from university dining on scones with cream and jam."
    ]
}