{
    "articleURL": "/femail/article-12047505/The-terrifying-reason-chainsaws-invented.html",
    "content": [
        "Do you know the gruesome history behind horror's most frightful instrument? We've all seen the image of a wild-eyed killer pulling a chainsaw wire in a slasher movie - wielding the handle with both hands as its jagged blade whirs in suspense.",
        "But how many of us know the true history behind horror's most infamous method of despatch?Perhaps surprisingly, the reason the chainsaw was invented is just as grisly as anything Hollywood - or indeed Hammer studios - could muster.And to find out, we must go back more than 200 years. ",
        "An early contraption known as a 'flexible saw' was championed by doctors John Aitken and James Jeffray in the 1780s to remove damaged bone, as well as for a procedure called a symphsiotomy.The latter was a method to assist women in childbirth by widening the birth canal through excising parts of the pelvic bone.The saw was mentioned in the second edition of Aitken's Principles of Midwifery, or Puerperal Medicine (1785), while Jeffray expanded on its origins in his 1806 paper Cases of the Excision of Carious Joints.He said he came upon the idea of a saw 'with joints like the chain of a watch' and even lent his own model out to other surgeons.The implements themselves would have appeared far smaller than chainsaws today - probably about the size of a kitchen knife - and they were powered by a small hand crank.",
        "Jeffray's invention was superseded by the Gigli twisted-wire saw, before it evolved in a tool with which to chop wood. The device then became larger and more powerful, becoming the tool we recognise today.",
        "Symphsiotomy came to be regarded as an arcane practice and was replaced by later operations such as forceps and the modern caesarian section.However, it can sometimes still happen in countries where C-sections are unavailable.Describing a procedure she had in 1981 in Ireland, a woman told the Guardian: 'They gave me gas and air and an injection, and took me to another room, where they tied my legs up on each side.'There were two nurses on each side of me. I saw this doctor at the end of my bed with a big, long silver thing.'They made a hole in your private parts, and he inserted this silver thing up and cut the pubic bone and pushed it over to widen your pelvis for you to deliver your baby yourself.'So the next time you see a chainsaw, you will be able to tell your friends its curious history. "
    ]
}