{
    "articleURL": "/wires/reuters/article-12059853/Red-Bulls-ways-head-coach-Gerhard-Struber.html",
    "content": [
        "The New York Red Bulls mutually parted ways with head coach Gerhard Struber on Monday after a 1-4-6 start to the 2023 MLS season.",
        "Assistant coach Bernd Eibler also departed the club and fellow assistant Troy Lesesne takes over as interim coach through the end of the season.The Red Bulls have scored the second-fewest goals in the league (seven) and are in last place in the Eastern Conference.\"We thank Gerhard and Bernd for their work and commitment to our club and wish them well in their next endeavors,\" RBNY head of sport Jochen Schneider said in a release. \"I want to especially thank Gerhard for his dedication to this club and for the personal sacrifices that he made, especially being away from his family. He led our players through a difficult time, keeping everyone in good spirits while continuing our playoff streak.\"After many discussions with Gerhard over the past few weeks, we mutually came to the agreement that a change now would be beneficial for both parties.\"Struber, 46, was hired on Oct. 6, 2020, and guided the Red Bulls to the MLS Cup Playoffs in 2021 and 2022. He leaves with a 33-31-23 record across all competitions.\"I enjoyed my time at the New York Red Bulls,\" Struber said, \"It was also clear for me that I wanted to return to Europe at the end of this season, at the latest. It was extremely difficult for me to live here, completely without my family. I informed the club early enough about my wishes and we came to the agreement to part ways.",
        "\"I wish the organization and the players the best of luck moving forward. I've enjoyed getting to know the players, staff and know my relationships I've built will continue. It was an honor to lead this club. I know they are all going to continue to accomplish great things in their careers.\"Lesesne, 39, joined the Red Bulls in January 2022. He previously served as head coach of the New Mexico United from 2018-21 and was named the USL Championship Coach of the Year in 2020.His debut as interim coach will come against rival New York City FC on Saturday night at Red Bull Arena in Harrison, N.J.--Field Level Media"
    ]
}