{
    "articleURL": "/wires/ap/article-12043567/California-state-senator-arrested-drunken-driving.html",
    "content": [
        "SACRAMENTO, Calif. (AP) - A Southern California lawmaker who is running for Congress was arrested on suspicion of drunken driving Tuesday night, according to law enforcement and jail records.",
        "Sen. Dave Min, a Democrat who is running in the competitive 47th congressional district, said in a Facebook post that he was cited with a misdemeanor for driving under the influence. Min was released Wednesday morning after being arrested by California Highway Patrol, the Sacramento Sheriff's Department said. It wasn't clear if he would have to appear in court.\"My decision to drive last night was irresponsible. I accept full responsibility and there is no excuse for my actions,\" Min posted Wednesday. \"To my family, constituents and supporters, I am so deeply sorry. I know I need to do better. I will not let this personal failure distract from our work in California and in Washington.\"A spokesperson for Min's Senate office declined to comment.The Orange County congressional race is shaping up to be one of the most contested races for 2024 and Min´s arrest quickly prompted the National Republican Congressional Committee to condemn his candidacy.\"Voters will rightfully question David Min´s judgement after this incident, but will California Democrats?\" NRCC spokesperson Ben Petersen asked in a statement.",
        "The Democratic Congressional Campaign Committee didn't immediately respond to an email seeking comment.Min was arrested around 10:50 p.m. near the Capitol, according to a police report. He was driving without headlights, then ran a red light, the report says.",
        "Min showed \"signs and symptoms of alcohol intoxication,\" a California Highway Patrol officer noted in the report. Min was booked in the Sacramento County jail.Many state lawmakers stay overnight in Sacramento during the week rather than returning home to their districts.Min is vying for the competitive Congressional seat in Orange County now represented by Democratic Rep. Katie Porter, who is leaving her post to enter a race to replace retiring Sen. Dianne Feinstein. Min, who has secured Porter's endorsement, is the most prominent Democrat in the race. Former Assemblyman Scott Baugh, a Republican, is also running.Min, a Harvard-educated lawyer and a former congressional aide to U.S. Sen. Chuck Schumer, was elected to the state Senate in 2020. He chairs the Senate's Committee on Natural Resources and Water.Senate President Pro Tempore Toni Atkins wouldn't say whether Min would face disciplinary action.\"Like Senator Min, we´re disappointed in his actions, but pleased that he´s taken responsibility and apologized,\" she said in a statement."
    ]
}