{
    "articleURL": "/wires/ap/article-12048609/Board-member-92-year-old-Buffett-wont-replaced-soon.html",
    "content": [
        "OMAHA, Neb. (AP) - Investors shouldn't expect a change of leadership at the top of Berkshire Hathaway anytime soon, even though Chairman Warren Buffett is 92 and his partner Charlie Munger is 99, one longtime board member said Thursday.",
        "Ron Olson told a group of investors gathered ahead of Saturday's annual meeting that after spending a lot of time with both legendary investors, he doesn't think a transition to Greg Abel as CEO is imminent. Buffett has said Abel will one day take over Berkshire and Abel already oversees all of the conglomerate's non-insurance businesses, but Buffett has no plans to retire.\"Charlie at 99? That brain is as good as it ever was,\" Olson said. \"Warren is the same way. His energy is amazing. So don't count on Greg taking over tomorrow.\"The longevity of the two men who have led Berkshire for nearly six decades is always in the back of mind of the shareholders who will pack an Omaha arena to listen to Buffett and Munger spend hours answering questions. Many wonder how the company will fare once those two are no longer at the helm.Olson has been on Berkshire's board since 1997 and has been part of countless conversations over the years about how to eventually replace Buffett. He said the board has total confidence in Abel, who led Berkshire's massive utility unit starting in 2008 before taking his current vice chairman role in 2018.Olson said Abel has had the advantage of spending many years working closely with Buffett and is steeped in Berkshire's unusual culture of letting companies it owns largely run themselves. Olson said he thinks preserving that culture of trust will be the most important part of Abel's job running the company.",
        "\"He has had a lot of what I would call grooming and practice,\" Olson said.Berkshire has said for years that Buffett's job as chairman, CEO and chief investment officer will be split into several parts when he is gone. Berkshire finally designated Abel as the CEO successor two years ago after Munger hinted at it during an offhand comment at the annual meeting.Buffett has said he believes his oldest son, Howard, who already serves on Berkshire's board, would make an ideal chairman to help protect the company's culture.Berkshire has hired two other investment managers who oversee a small part of the company's portfolio now. Olson said Abel will have to decide how big a role those two will play in managing Berkshire's investments in the future.Berkshire owns an eclectic assortment of businesses including Geico and other major insurers, a number of large utilities, BNSF railroad and a range of retail and manufacturing businesses. Berkshire also holds major stakes in companies like Apple, Bank of America, American Express, Coca-Cola and Chinese electric car maker BYD."
    ]
}