{
    "articleURL": "/wires/reuters/article-12042113/Pope-meets-Moscow-Church-official-puzzling-peace-mission-comment.html",
    "content": [
        "By Philip Pullella",
        "VATICAN CITY, May 3 (Reuters) - Pope Francis on Wednesday spoke to a top member of the Russian Orthodox Church (ROC) days after the pontiff made an intriguing though puzzling comment about the Vatican being involved in a mission to try to end the war in Ukraine.Metropolitan (bishop) Anthony, effectively the ROC's number two, was given pride of place at Francis's general audience in St. Peter's Square and then was the first taken to greet the pope at the end. He spent longer chatting with Anthony than with others.On his return from a trip to Hungary on Sunday night, Francis was asked by a reporter whether Hungarian Prime Minister Viktor Orban and ROC officials could accelerate a Ukraine peace process and arrange a meeting between the pope and Russian President Vladimir Putin.\"There is a mission in course now but it is not yet public. When it is public, I will reveal it,\" the pope responded.Francis added that he had spoken about Ukraine with Orban and with Metropolitan Hilarion, the chief representative of the Russian Orthodox Church in Budapest and Anthony's predecessor as head of the ROC's external relations.But his words appeared to take both Kyiv and Moscow by surprise, with both saying they knew nothing about any papal peace initiative in the works.",
        "Neither the pope nor the Vatican press office have elaborated on the comments since. Anthony has had meetings with other Vatican officials but it was unclear if he would have a private audience with the pope during his visit to Rome.Francis, 86, has said previously that he wants to visit Kyiv but also Moscow on a peace mission.The supreme head of the ROC, Patriarch Kirill, is a close ally of Putin and fully backs the Russian invasion of Ukraine as a bulwark against a West he describes as decadent.Ukrainian Prime Minister Denys Shmyhal met the pope at the Vatican last week and said he had discussed a \"peace formula\" put forward by President Volodymyr Zelenskiy. He also said he had repeated a standing invitation for the pope to visit Kyiv. (Reporting by Philip Pullella Editing by Mark Heinrich)"
    ]
}