{
    "articleURL": "/news/article-12046919/Sir-Richard-Branson-reveals-Virgin-empire-lost-1-5billion-pandemic.html",
    "content": [
        "Sir Richard came under fire in 2020 when he asked the government for a loan Sir Richard Branson has defended asking for a Government Covid loan to prop up his Virgin empire after it lost £1.5bn during the pandemic - claiming he feared he would 'lose everything'.",
        "The British entrepreneur, 72, who is thought to be worth £4.2bn and lives on a private Caribbean island, defended requesting the state handout while speaking to Amol Rajan for a BBC documentary. The father-of-three came under fire in 2020 when he asked the Government for help to keep his airline Virgin Atlantic afloat in the form of a commercial loan.He insisted he did not have billions in 'cash in a bank account ready to withdraw' to save the business, as his net worth was calculated on the value of Virgin businesses prior to the pandemic.Speaking in his latest interview, Sir Richard said the fallout from coronavirus 'cost us a big percentage of our net worth', adding that 'there was time where it really looked like we were going to lose everything.'",
        "He added: 'We have 50, 60 planes all on the ground at Heathrow and Gatwick, Sydney, Melbourne and Brisbane. And the health clubs all closed, the hotels all closed.'The worst would have been 60,000 people out on the streets.'He said the group sold shares in companies that were public to save money, which meant 'most jobs were saved as a result'.But he told the BBC the media coverage at the time was 'painful' and re-emphasised that he was not looking for 'gifts from Government, but underwriting loans'.",
        "Virgin Atlantic eventually secured a £1.2bn bailout involving only private funds, including £200m from the wider Virgin Group.Earlier this month, Sir Richard's satellite launch company, Virgin Orbit, filed for bankruptcy and axed 675 jobs - about 85 per cent of its workforce.It came after a rocket failed to complete the first satellite launch from UK soil in January.Other businesses in the Virgin empire have come up against difficulties, with gym chain Virgin Active taking a hit during the pandemic, but raising £88 million from investors last year to help with its recovery.Elsewhere in the BBC interview, Sir Richard said he gives the money he earns to charities and defended his tax status, with his primary residence being on his Caribbean island meaning he does not have to pay some UK taxes.'All I can say is we have paid billions and billions in taxes over the years, and will continue to do so, and our companies pay taxes in whichever country and whichever jurisdiction they're based,' he said.",
        "In April 2020, a furious Twitter row erupted when Dragons' Den star Duncan Bannatyne said the billionaire Virgin Group boss should instead go to a bank for help. And he also hit out at Branson's offer to mortgage Necker Island, his home in the Caribbean, as collateral to help get cash to 'save as many jobs as possible.'",
        "In an open letter to staff Branson insisted he was not asking for a handout, but a commercial loan, after Virgin Australia went into administration.Scottish entrepreneur Mr Bannatyne, who said he had supported his own leisure business during the pandemic with increased bank loans, said in a tweet to a follower: 'Do you think the island [Sir Richard's Necker Island] is worth £500m?He continued: 'I have gone to the bank NOT the UK tax payer. The bank. A viable business will get the money from a bank.'I never slated him (Sir Richard) I said he should go to the bank for a loan not the hard working UK taxpayers that you show so little respect for.' ",
        "In another tweet he added: 'But tell me, why can't he borrow the money from a bank?'In every company in the world the staff pay their taxes. So you are saying government should financially support every company that is in trouble?'  Sir Richard also addressed the fierce criticism he had faced - and continues to face - over his tax situation. Critics have pointed out that Sir Richard has paid no UK income tax since moving to the tax-free British Virgin Islands 17 years ago.But Sir Richard insisted he and his wife 'did not leave Britain for tax reasons but for our love of the beautiful British Virgin Islands and in particular Necker Island'."
    ]
}