{
    "articleURL": "/news/article-12058731/Aldi-introducing-TEN-new-items-8-month-including-alcohol-free-pina-colada-popsicles.html",
    "content": [
        " The products are being launched by the retailer in time for the grilling season List of products was leaked and later confirmed in an article it shared on TwitterAldi is introducing ten new items all under $8 this month, including the alcohol-free pina colada popsicle.",
        "The discount retailer is getting fans excited for grilling season with a broad range of items on sale. Sources at the supermarket recently leaked a list of new products to The Kitchn.The retailer confirmed the rumors when it shared an article on Twitter.The new products are perfect for summer get-togethers, with barbecue season already underway.Here’s what’s new at Aldi for this season.",
        "1. Everything Bagel Smoked Salmon: 3oz pack for $4.39",
        "Aldi has used its popular Who Needs the Bagel? seasoning and has added it to its flavorsome smoked salmon.This take on the classic will enhance meals at breakfast time, as well as at picnics and barbecues.Available May 7.2. Tuscan Garden All-Ranch Seasoning: 5oz shaker at $3.19",
        "Aldi is adding to its spices selection with this new ranch seasoning from the Tuscan Garden brand. Available May 10.3. Deli Cheese or Jalapeno Kolaches at $6.49",
        "Kolaches are small pastries, traditionally packed with fruit. However, a variety filled with sausage is popular in Texas and surrounding states.Now, Aldi is bringing the Czech dish nationwide with two varieties - jalepeño or smoked cheese. They are ready-cooked and take just 30 seconds to heat up, making them a classic appetizer for summer parties.They will be available from May 17.4. Organic Chicken Sausages: 12oz pack of five for $4.99",
        "Two new varieties of organic chicken sausage are ready to grab from the chilled section.Customers can choose from spicy Italian or cajun-style. The sausages can be roasted, grilled or fried in the pan.",
        "They came out in stores on May 3. 5. German-style Pickles: 23.6fl oz jar for $3.49",
        "Pickles are a great fit for barbecues. Aldi has brought in these slightly sweet German-style unsliced pickles from the Deutsche Küche brand.The pickles were made available on May 3.6. Spicy Bacon Cheeseburger Pizza for $6.99",
        "The ready-to-bake Mama Cozzi’s fully-loaded cheeseburger is sure to be a hit for summer get-togethers. Toppings include gouda cheeses, mozzarella, spiced beef patty crumbles, tomatoes, onions, diced jalepeños, bacon and a spicy BBQ sauce.They are available for purchase from May 10.7. Mediterranean Chicken Kabobs: 1lb pack for $5.99",
        "This Greece-inspired item is ideal for barbecuing.The chicken skewers are individually vacuum-packed to stop them from frosting over in the freezer.Available May 24.8. Fusian Asian Inspiration Meal: $5.99 per pack",
        "Aldi is bringing out two more Asian heat-and-eat meals for its freezer section - Mongolian style beef and sweet and sour chicken. The frozen packs include a side of rice and can be spread across two to three meals.Available May 10. 9. Rose Hard Cider: Packs of six bottles for $7.99",
        "Aldi is expanding its selection of alcoholic summer drinks with this rosé hard cider.The beverages have a slightly tart, floral flavor that will go well with fine weather and barbecue feasts. Available May 3.10. Pina Colada or Caribbean Fruit Bars: $2.99 a box",
        "These new ice pops are the perfect solution if you are looking for the full flavor and refreshment of a cocktail without the hangover.Available May 17 in two summer-ready varieties."
    ]
}