{
    "articleURL": "/tvshowbiz/article-12060141/Coronation-Street-SPOILER-Sarah-Damon-caught-steamy-moment.html",
    "content": [
        "Things have been hotting up between Sarah Platt and Damon Hay as the pair become further embroiled in their steamy affair on Coronation Street. ",
        "But as temperatures soar again between the pair in scenes set to air during tonight's episode, they leave themselves at risk of getting caught.Married Sarah (Tina O’Brien) has found it hard to resist bad boy Damon (Ciaran Griffiths) ever since he arrived in Weatherfield.He made it plain it was his sole intention to sleep with her from the outset and after weeks of wearing her down, Sarah eventually fell for Damon’s cheeky charm.However, things became complicated between the pair when Sarah became so consumed with guilt that she tried to push Damon away.",
        "During Monday's episode, things heat up again when Sarah finds herself locked in the Bistro with Damon after going to check on him having heard he’d taken a beating. Having sent all the staff home due to a broken oven, Damon seizes the opportunity and moves in for a kiss.Swept up in the moment Sarah heads into the office with Damon, but when they hear a key in the lock, it’s Nick Tilsley (Ben Price), Leanne Battersby (Jane Danson), Dee-Dee Bailey (Channique Sterling-Brown) and Sarah’s husband Adam Barlow (Sam Roberston) who walk in looking for Damon, prompting Sarah to freeze with fear.In recent weeks, Sarah has betrayed her husband Adam amid her secret affair with criminal Damon, but is desperate for Adam not to learn the truth.",
        "The Underworld worker was recently left squirming in her seat as Damon joined her and Adam at his birthday dinner.As the couple sat down for Adam's birthday lunch, Adam told Bistro owner Nick there had been an issue with his late licence as some residents had voiced their objections. Adam remained clueless as he chatted with the criminal, who'd offered a free bottle of bubbly for the birthday boy. When Maria Connor (Samia Longchambon) then let slip that Sarah was one of those who raised objections about the late licence, Nick and Adam were furious with her. ",
        "Sarah later spoke her mind to Nick and Leanne, informing them she believed their late licence idea was a terrible one. Meanwhile, Sarah's discomfort was further heightened when it was revealed that she had raised objections about the late licence, leaving Nick and Adam furious and Damon reveling in her unease.With Damon continuing to have close links with her husband and family, will Sarah ever be able to shake Damon off? And does she even want to?Coronation Street airs Mondays, Wednesday and Fridays at 8pm on ITV1 and ITVX."
    ]
}