{
    "articleURL": "/femail/article-12050401/Im-doctor-heres-reason-King-Charles-swollen-sausage-fingers.html",
    "content": [
        "The monarch has previously joked about his fingers, calling them 'sausages'READ MORE: Charles 'sets himself 6pm curfew' before the coronationIt's the question the nation has been asking in the run up to the coronation - and now Britain may finally have an answer.",
        "A doctor has explained what may be the root cause behind King Charles' swollen 'sausage' fingers.  GP Chun Tang, Medical Director at Pall Mall Medical in Manchester said: 'There are numerous reasons a person may suffer with \"sausage\" fingers.'Often puffy fingers are a symptom of water retention which can be caused by numerous health conditions. Sausage fingers are officially known as dactylitis. 'This condition arises due to inflammation and can be a result of arthritis, multiple bacterial infections or even TB.'",
        "'Other possibilities include high salt levels, allergic reactions, medicinal side effects, injury and autoimmune diseases. 'Treatment for this condition can be determined when the underlying cause is identified. A blood test should be carried out to determine the underlying issues.'The King has previously joked about the appearance of his hands.And he even dubbed them his 'sausage fingers' in a letter he wrote to a friend when he was describing his newborn son, Prince William.'I can't tell you how excited and proud I am. He really does look surprisingly appetising and has sausage fingers just like mine,' he wrote, as quoted in Charles, The Man Who Will Be King by Howard Hodgson.Discussion surrounding Charles' 'sausage fingers' has been widespread on social media, at one point being the seventh most searched term on Google in the UK, with many questioning what the issue could be.",
        "King Charles has been pictured with swollen hands and feet many times, noticeably after long periods spent flying or travelling to hot countries.But the public only really began to take note when he ascended the throne following the death of Queen Elizabeth II.",
        "He was also seen with painfully swollen hands and feet during the first day of his royal tour in India in 2019 when he removed his shoes to step into a Sikh temple in New Delhi.Observers also pointed out the royals' swollen hands while he sipped a pint in The Prince of Wales pub in Clapham Old Town in 2021.The royal has had large hands from a young age - a feature the Queen wrote about in a letter to her music teacher after Charles had been born.She wrote: 'The baby is very sweet and we are enormously proud of him. He has an interesting pair of hands for a baby. 'They are rather large, but with fine long fingers quite unlike mine and certainly unlike his father's. It will be interesting to see what they become.'The King has never confirmed what the cause of his predicament is.But he is perhaps aware of the nation's interest in his hands as he appears to have started hiding his hands in royal photographs. ",
        "In the most recent royal photo of himself and Camilla, the monarch wore a simple pinstripe suit while his wife Camilla, the Queen Consort, posed in a cobalt blue dress.But members of the public realised that one detail appeared to be hidden from the photographer – the King's hands.In one shot he has them hidden behind his back as he stands alongside Camilla, 75.A second shot shows the 74-year-old with one hand in his pocket.Social media users then jokingly remarked that the monarch has been 'bullied' into keeping his fingers off show.'Show us his hands cowards,' one Twitter user commented under the portraits.A second joked: 'We're never seeing them again brother.''I want to abolish the monarchy but I do still feel bad that we have gang bullied a grown man into never showing his hands again,' another quipped.One person also added: 'I can't believe Twitter has bullied the literal king into never showing his hands.'"
    ]
}