{
    "articleURL": "/wires/ap/article-12060451/Deputies-civil-rights-probe-accused-sexual-assault.html",
    "content": [
        "JACKSON, Miss. (AP) - Mississippi sheriff's deputies already under investigation for possible civil rights violations after allegedly placing a gun in a Black man's mouth and firing it are now also being accused of attempting to assault him and a second Black man with a sex toy during an interrogation, The Associated Press has learned.",
        "The allegations are contained in a letter to the Justice Department written by Michael Corey Jenkins' attorney, who provided a copy to the AP. In it, attorney Malik Shabazz urges federal prosecutors to file civil rights charges against the deputies and to open a broader investigation into what he called the \"unconstitutional customs and practices\" of the entire sheriff´s office.Jenkins has accused six deputies of bursting into a home where he was visiting a friend on Jan. 24, putting a gun in his mouth, and firing after nearly two hours of \"torture.\"\"This extreme case of police brutality warrants enforcement of the civil rights criminal laws on the books,\" Shabazz said in a statement. \"Sheriff Bryan Bailey and Rankin County are covering up the truth of what happened on Jan. 24, and all parties must be held accountable.\"In his Monday letter to Kristen Clarke, assistant attorney general for civil rights at the Justice Department, Shabazz called for an inquiry into a \"pattern and practice of police misconduct and police brutality\" in Rankin County. Neither the sheriff's office nor an attorney representing the office responded to calls or an emailed list of questions about the allegations.In a statement, the Justice Department said the civil rights probe into the Jenkins case is ongoing and declined to comment further.",
        "An AP investigation published in March revealed that several Rankin County deputies had been involved in at least four violent encounters with Black men since 2019 that left two dead and another with lasting injuries. Two of the men, Jenkins included, allege that deputies shoved guns into their mouths during separate encounters.Jenkins and his friend Eddie Terrell Parker said on the night of Jan. 24, six white Rankin County deputies suddenly came into the home where Parker was living and proceeded to handcuff and beat them. They said the deputies shocked them repeatedly with stun guns over roughly 90 minutes and, at one point, forced them to lie on their backs as the deputies poured milk over their faces.Both Jenkins and Parker also informed agents with the Mississippi Bureau of Investigation that deputies stripped the two naked, forced them to take a shower together, and attempted to use a sex toy on them during an hourslong interrogation, according to the letter, which was accompanied by a photo of the toy.Jenkins, who has trouble speaking and eating because of his injuries, said one of the deputies, who has not been named publicly, fired a gun into his mouth. Medical records he shared with the AP show he was treated for a lacerated tongue and broken jaw.",
        "Deputies have said Jenkins was shot after he pointed a gun at them. The Sheriff's Office has not answered multiple inquiries from the AP asking whether a weapon was found at the scene. Shabazz has said his client didn´t have a gun.The AP previously requested body camera or dashcam footage from the night of the Jenkins raid. Jason Dare, an attorney for the sheriff´s department, said there was no record of either. Mississippi doesn´t require police officers to wear body cameras.Jenkins was charged with possessing between 2 and 10 grams of methamphetamine and aggravated assault on a police officer. Parker was charged with two misdemeanors: possession of paraphernalia and disorderly conduct. Agents with the Mississippi Bureau of Investigation told the men they didn't expect the criminal charges against them to proceed, Shabazz wrote in his letter.Meanwhile, \"No deputy has been disciplined or terminated by Rankin County and all the deputies are still roaming the public at large,\" Shabazz wrote.The Rankin County Sheriff´s Office has not said whether any of the deputies were temporarily placed on leave following the incident.A spokesperson for the Mississippi Bureau of Investigation declined to comment, citing an \"open and ongoing investigation.\"Police and court records obtained by the AP show that several deputies who were accepted to the sheriff´s office´s Special Response Team - a tactical unit whose members receive advanced training - were involved in each of the four violent encounters with the Black men.",
        "Such units have drawn scrutiny since the January killing of Tyre Nichols, a Black father who died days after being severely beaten by Black members of a special police team in Memphis, Tennessee. Nichols´ death led to a Justice Department probe of similar squads nationwide.Shabazz said a wider investigation into the Rankin County Sheriff's Office would fit into the Justice Department´s past examinations of other departments around the country, including police departments in Ferguson, Missouri and Louisville, Kentucky.___Michael Goldberg is a corps member for the Associated Press/Report for America Statehouse News Initiative. Report for America is a nonprofit national service program that places journalists in local newsrooms to report on undercovered issues. Follow him on Twitter at https://twitter.com/mikergoldberg."
    ]
}