{
    "articleURL": "/wires/reuters/article-12060379/Erdogan-accuses-opposition-provocations-ahead-tight-Turkish-vote.html",
    "content": [
        "ANKARA, May 8 (Reuters) - Turkey's President Tayyip Erdogan accused the opposition on Monday of provoking disorder and siding with terrorists in a fiery speech days away from close and increasingly fractious elections.",
        "Erdogan appeared to suggest his opponents had incited confrontations a day earlier when crowds threw stones at a key opposition figure in the eastern city of Erzurum, a stronghold of the president's AK Party (AKP).Opinion polls suggest Erdogan faces the biggest electoral challenge of his career in presidential and parliamentary votes due on May 14.On Sunday, protesters threw stones at Istanbul Mayor Ekrem Imamoglu, a member of the main opposition Republican People's Party (CHP) who will be vice president if the opposition's Kemal Kilicdaroglu wins the presidential vote.A day later, across the other side of Turkey during a rally in the western town of Edirne, Erdogan accused the opposition of being \"pro-LGBT\" and \"siding with terrorists.\"Analysts say he has been ramping up rhetoric in a bid to shore up his appeal among conservative and nationalist voters.\"They (the opposition) are trying to defame our cities shamelessly by making a scene with their own provocations,\" Erdogan said, without making direct reference to the events in Erzurum.\"They are looking for a cover for their prospective defeat in the elections by provoking and insulting people,\" he added.Interior Minister Suleyman Soylu also accused the opposition of inciting the violence in Erzurum.Soylu said that Imamoglu's wife had provoked the crowds by making a 'V' sign at another rally last week - a gesture that he said referred to the outlawed Kurdistan Workers Party (PKK).",
        "\"People of Erzurum have high sensitivity on nationalism. If you go to these cities and provoke them over their sensitivities, then God forbid,\" Soylu said in a live broadcast late on Sunday.Imamoglu held another rally on Monday, in the central city of Konya, another AKP stronghold.\"They can throw stones at us, but we'll respond with roses,\" he said.\"The agitators will learn their lesson from the nation at the ballot box first, then they will be tried in independent courts for their wrongdoings,\" Imamoglu added. (Reporting by Huseyin Hayatsever Editing by Ece Toksabay and Andrew Heavens)"
    ]
}