{
    "articleURL": "/femail/lifehacks/article-12061489/Aldi-Australia-snow-gear-sale-2023-Cheap-ski-jackets-pants-snowboards-20-special-buys.html",
    "content": [
        "Aldi Australia is set to bring back its hugely popular snow gear sale The Special Buys sale sees prices slashed on seasonal gear including ski jackets The sought-after products are set to return to shelves on Saturday 20 MayAldi Australia have revealed the ever-popular snow gear sale will go ahead this year after it was spectacularly cancelled in 2022.",
        "The retailer was forced to abandon its 'annual' sale last year, citing 'supply chain issues', and disappointing thousands of fans.The sale is known as the 'best' winter gear sale in Australia - with snow fans often spotted lining up hours before stores open just to get their hands on some gear.This year's May 20 event is expected to be bigger than ever.",
        "Aldi has given FEMAIL a sneak preview into its sale collection which includes more than 100 products priced for $4.99.The retailer claims a family-of-four can be 'completely slope-ready for under $1000' by shopping the sale.The snow jackets - which are often the first item to be snapped up are just $59.95 this year. Matching ski pants available for $49.99. The adult range also includes thermal underwear ($29.99), long sleeve zip tops ($39.99), ski socks ($9.99), thermoboots ($29.99), and more.The children's range was made to accommodate their needs - with the jackets ($39.99) and pants ($29.99) packed with pockets and slots galore to carry snacks and treats.",
        "Aldi's also selling children's ski goggles ($15.99), mittens ($11.99), theromoboots ($19.99), and helmets ($24.99).The new range has been designed to stand up to all extreme weather conditions from The Alps to The Snowy Mountains.Most of the snow gear is filled with DuPont Sorona wadding, which keeps all of Aldi's garments insulated, breathable, moisture resistant and heat retentive in freezing conditions.",
        "'The shredding season is finally upon us and we're back for 2023 with our biggest ever snow gear Special Buy,' ALDI Special Buys buying director Belinda Grice said.'The team in Australia partner with experts in Austria to create products that are of exceptional quality and loaded with innovative tech.''Our high-performance gear is made to suit weather conditions from The Alps to Australia at a fraction of the price of what you'd expect to pay at specialist retailers.'",
        "AdultsSki jacket ($59.99)Ski pants ($49.99)Thermal underwear set ($29.99)Merino long-sleeve zip top ($39.99)Wool ski socks ($9.99)Ski goggles ($15.99)Knitted beanie, snood, scarf ($6.99)Thermoboots ($29.99)ChildrenSnow jackets ($39.99)Snow pants ($29.99)Ski thermal underwear set ($16.99)Merino long-sleeve top ($29.99)Ski goggles ($15.99)Snow gloves or mittens ($11.99)Thermoboots ($19.99)Beanie, scarf, or neckwarmer ($6.99)Ski helmet ($24.99)Single rider snow sled ($9.99)"
    ]
}