{
    "articleURL": "/wires/aap/article-12043281/Cooking-climate-subsidies-gas-producers.html",
    "content": [
        "Upcoming federal and state budgets are expected to fund climate change by adding to record subsidies paid to fossil fuel companies.",
        "The subsidies have increased to an estimated $57.1 billion over the four-year budget papers, up from the $55.3b in 2022, according to an independent report.The Australia Institute research estimated the subsidies will cost 14 times the amount invested in the Australian Disaster Ready Fund, and more than what is spent on the Australian Army.Institute research director Rod Campbell said the Albanese government has kept key subsidies despite winning \"the climate election\".\"Putting billions into petrochemical hubs to assist fracking in the NT, building roads specifically for gas companies, building new gas-fired power stations,\" he said.\"All these Morrison government programs are still on the books, are still costing billions and still cooking the climate.\"Exemptions from the contentious Petroleum Resource Rent Tax still benefit oil and gas companies by an estimated $165 million per year, which could be put to better uses, he said.Mr Campbell said major gas projects including in the NT and the Kurri Kurri power plant in the Hunter region are receiving federal handouts at a time when governments are looking to cut costs and meet climate targets.The Beetaloo Basin approved by the NT government on Wednesday will put 1.4 billion tonnes of emissions into the atmosphere over its lifetime, according to analysis by RepuTex.",
        "At the federal level, the report also questions more than $140 million over 10 years to assist unproven carbon capture and storage (CCS) projects and $129m on upgrading Hunter Valley coal railways.Queensland taxpayers are bankrolling the Kogan North Gas Fields in the Darling Downs, and giving $45m to the incident-prone Callide coal-fired power station and $21m to the Meandu coal mine that supplies generators.Victorians are on the hook for $69m for a CCS project that's not operational 12 years after its establishment and land tax exemptions for coal mining of $1m per year.South Australians are backing a hydrogen hub to the tune of $30m and chipping in $60m to upgrade port facilities used by Santos.NSW was found to have a $65 million \"coal innovation fund\" and spend $200 million per year on a program for mineral and petroleum industries \"generating prosperity, safely\".A separate report released on Thursday said there's no comeback for coal as more big investors commit to getting rid of investments.The independent Institute for Energy Economics and Financial Analysis said it took almost six years for the first 100 financial institutions to adopt coal exclusion policies, but since then the number has doubled in just over three years.\"They see climate risk as a financial risk,\" market expert Christina Ng said.",
        "She said the declining cost of renewable energy only added to the rising risk of being left with stranded, or valueless and unsellable, coal assets.Ms Ng said the market was also learning fast as regulators get tough on \"greenwashing\", to stamp out false claims about investments touted as clean energy."
    ]
}