{
    "articleURL": "/sport/boxing/article-12055855/Australian-boxer-Stevie-Spark-robbed-WBA-world-title-Canelo-Alvarez-undercard-Mexico.html",
    "content": [
        " Aussie boxer 'robbed' in Mexico title fight Spark lost via split decision to local opponent Many fans and experts thought he'd wonQueensland boxer Stevie Spark has missed out on the WBA intercontinental super lightweight title on Sunday in Mexico in very controversial circumstances, with many fight fans insisting he was 'robbed'.",
        "Appearing on the undercard of Saul 'Canelo' Alvarez's undisputed super middleweight title fight against John Ryder, Spark took on local fighter Gabriel Gollaz Valenzuela.Spark, 26, withstood a knockdown and energetic early onslaught from the Mexican to recover and regain control of the heart-stopping ten-rounder.Despite the knockdown, the Aussie had the better moments in the bout, but the judges saw it differently awarding the split  decision victory to the local fighter (96-93, 94-95, 95-94).The two judges that scored the fight for Valenzuela were from Mexico, with the remaining judge from Canada.",
        "The Toowoomba native was shattered with the result and so too were many fans and experts who believed he'd done enough to get his hand raised.Journalist Ben Damon took to Twitter afterwards to write: 'Australia's Stevie Spark has been robbed by split decision in Mexico. Great fight and tough effort from local Gabriel Gollaz Valenzuela but despite the knockdown he did not win the fight. I had Spark 96-93.'Twitter account Boxing Kingdom didn't mince words, writing: 'STEVIE SPARK WAS ROBBED IN MEXICO'.Sports journalist Brendan Bradford was equally outraged by the decision, writing: 'Stevie Spark robbed in Mexico. Loses a split decision to Gabriel Gollaz. Boxing is boxing.'Spark dominated his rival significantly with power punches, landing 176 compared to just 86 for the Mexican - but couldn't put him away in the closing rounds.",
        "Fans were quick to criticise the judges and accuse them of 'home cooking' towards the local fighter.'Clear robbery, wrote one fan on Twitter. 'Some close rounds but no way in the world Spark lost six rounds. Fighting in Mexico... just like the Dennis Hogan robbery.''Absolute joke. Feel gutted for Stevie,' said another.",
        "'Stevie Spark robbed. Expect nothing less in Mexico. Needed to knock him out to get the result - unfortunately you can't leave it to the judges in Mexico,' wrote a third.Before the bout, Sparks told press that he wasn't worried about fighting in Mexico in front of 50,000 passionate locals.'At the end of the day, as loud as the people are on the outside, when me and Gabriel Valenzuela are in the ring it's just me and him and the referee,' Spark told foxsports.com.au.'The people on the outside doesn't really matter to me.'Also when you look at the other side, I'm the type of fighter when everything's stacked against me and when my back's against the wall is when I fight better.'With the controversial loss on Sunday, Spark slips to 16-3 (14 KOs). "
    ]
}