{
    "articleURL": "/sport/football/article-12045661/Chelsea-won-six-points-losing-positions-London-club-comeback-kings.html",
    "content": [
        "Chelsea have only taken points from two games where they had been losingThree other London clubs make the top five for points from losing positions Both Manchester United and Man City however don't even make the top ten  Chelsea have picked up just six points from losing positions this season - the worst record out of any team in the Premier League.",
        "Frank Lampard's side have had a disastrous campaign, with the interim Blues boss losing his first six games in charge and sitting 12th in the Premier League standings.There are many reasons for their downfall this campaign and the fact that they have only come from behind twice in 15 games shows that they have lacked the quality to get out of difficult situations.Another London-based side meanwhile has won more points from losing positions than any team and, surprisingly, it's not title challengers Arsenal.That honour goes to Crystal Palace who have taken 23 points from losing positions, with seven victories and two draws from the 23 games where they have conceded the first goal. ",
        "Only Nottingham Forest, West Ham, Southampton, Leeds and Leicester City have conceded the first goal more in matches than Crystal Palace - which is a big reason why they top this table.However, it is an impressive statistic for a side that before the recent revival since Roy Hodgson's appointment was fearing the prospect of relegation.Those 23 points have proved valuable in helping Palace reach the 40-point mark and at this moment in time, essentially secure their Premier League status for another season.The closest side to Palace is Arsenal, who have taken 16 points from the ten games where they have been behind. ",
        "They have claimed five wins from losing positions - only behind Palace - which has helped keep them in the title race with Man City. This includes victories over the likes of Manchester United, Aston Villa and Bournemouth, though their 3-3 draw against Southampton is one of the results which Mikel Arteta's side will regret if Man City claim the title. Tottenham and Liverpool found themselves in losing positions in 19 and 16 games respectively - perhaps the biggest reason why they currently look set to miss out on Champions League qualification.Both sides sit inside the top five in terms of points claimed from losing positions, with Tottenham claiming 15 points and Liverpool 13. However, the fact that both sides have only claimed points in seven out of those games will worry both sides.",
        "Newcastle also sit inside the top five with 13 points, though more impressively, they have claimed points from seven out of 11 games. This is better than Manchester United who have claimed just eight points out of the 11 games they went behind, while Aston Villa who are challenging for a Europa League spot, have only taken seven points from 17 games and sit just ahead of Chelsea at the bottom.At the bottom of the Premier League table, Southampton are six points off safety, and the fact they have gone behind in a league-high 28 matches this season plays a huge factor.",
        "The Saints have only taken 12 points from those games with three wins and three draws.Everton and Nottingham Forest also sit inside the relegation zone, and both teams have taken just eight points from 23 and 24 games respectively.Leeds and Leicester are just outside the relegation zone, with the difference being that they have taken more points from losing positions than Everton and Forest. Leicester have taken 13 points from 27 games where they have been in losing positions, while Leeds have taken 12 from 24.  ",
        " Crystal Palace - 23 points (23 games, 7 wins, 2 draws, 14 defeats)Arsenal - 16 points (10 games, 5 wins, 1 draw, 4 defeats)Tottenham - 15 points (19 games, 4 wins, 3 draws, 12 defeatsNewcastle - 13 points (11 games, 3 wins, 4 draws, 4 defeats)Liverpool - 13 points (16 games, 3 wins, 4 draws, 9 defeats)Leicester - 13 points (27 games, 3 wins, 4 draws, 20 defeats)Brighton - 12 points (15 games, 3 wins, 3 draws, 9 defeats)Bournemouth - 12 points (21 games, 4 wins, 0 draws, 17 defeats)Leeds - 12 points (24 games, 3 wins, 3 draws, 18 defeats)Southampton - 12 points (28 games, 3 wins, 3 draws, 22 defeats)Man City - 10 points (8 games, 3 wins, 1 draw, 4 defeats)West Ham - 10 points (26 games, 1 win, 7 draws, 18 defeats)Brentford - 9 points (15 games, 1 win, 6 draws, 8 defeats)Man United - 8 points (11 games, 2 wins, 2 draws, 7 defeats)Fulham - 8 points (19 games, 2 wins, 2 draws, 15 defeats)Wolves - 8 points (21 games, 2 wins, 2 draws, 17 defeats)Everton - 8 points (23 games, 1 win, 5 draws, 17 defeats) Nottingham Forest - 8 points (24 games, 1 win, 5 draws, 18 defeats)Aston Villa - 7 points (17 games, 1 win, 4 draws, 12 defeats)Chelsea - 6 points (15 games, 2 wins, 0 draws, 13 defeats) "
    ]
}