{
    "articleURL": "/wires/ap/article-12042871/Penalty-reduced-man-took-leaf-blower-garage.html",
    "content": [
        "COLUMBUS, Ohio (AP) - An Ohio man acted so brazenly when he stole a $500 leaf blower from a residence that it wasn´t a burglary, the state Supreme Court ruled Wednesday.",
        "In their unanimous decision, the justices found that because Donald Bertram did not use \"force, stealth, or deception\" to commit the crime, he should instead be convicted of the lesser offense of misdemeanor criminal trespassing, which could bring him less than a year in jail.According to court documents, a Portsmouth homeowner was working on his property in September 2020 when he heard the loud muffler of a passing car. He went inside the house to get his cellphone and, when he came back outside, he made eye contact with Bertram, the driver of the car.Bertram drove past the home but then turned around and parked on the road near the driveway, then started walking up the driveway to the home's open garage. The homeowner said Bertram was smiling, acting \"very cavalier\" and had \"no sense of urgency\" as he walked into the garage, took the leaf blower and walked back to his car.Bertram ignored the homeowner's demand to put down the blower and instead put it on the passenger seat of his car and attempted to drive off. When the car didn't immediately start, the homeowner took several close-up photos of Bertram before he eventually drove away.Bertram was soon arrested and was convicted of burglary. He appealed the jury's verdict to the Fourth District Court of Appeals, which affirmed the decision, then appealed the case to the state Supreme Court.",
        "In the decision written by Justice Michael Donnelly, the Supreme Court noted that the lower courts determined Bertram engaged in stealth and deception because he calmly and silently walked by the homeowner, giving no indication that he intended to steal anything.Donnelly though, wrote that the evidence \"utterly failed to establish\" that Bertram engaged in any \"secret, sly, or clandestine conduct,\" which must be proven to convict someone of burglary.With Wednesday's decision, the court also vacated an 8- to 12-year prison sentence that had been given to Bertram. The justices also vacated a 491-day sentence Bertram received for violating his probation in an unrelated case. They noted a prison term for violating probation can only be imposed for committing a felony, and in this case that matter was vacated."
    ]
}