{
    "articleURL": "/wires/ap/article-12046471/No-Mow-May-Our-gardening-columnist-says-no.html",
    "content": [
        "If you´re reading this, chances are you´ve heard about the #NoMowMay movement that´s been gaining steam on social media and in eco-conscious circles these past few years.",
        "Started in 2019 by citizen scientists in the United Kingdom, the call for homeowners to abstain from mowing their lawns during the month has spread to other countries, including the U.S.The intention is admirable: Let your grass and weeds grow and bloom to provide food and shelter for essential pollinators like bees and butterflies early in the season, when such necessities may be scarce.Frankly, I think it´s a terrible idea.Some of those pollinators you set out to protect will likely get shredded up with the first mow of the season. Grass will no doubt get shaded by tall weeds, which can lead to fungal diseases. And weeds and invasive plants that take hold during the month won´t simply disappear once the mowing commences. That might lead people to apply chemical pesticides they wouldn´t otherwise use.And what about rodents, snakes and other undesirables that also will likely avail themselves of the shelter?",
        "Perplexed by the seemingly runaway-train popularity of the now-annual event, I called Tamson Yeh, turf specialist with the Cornell Cooperative Extension of Suffolk County in New York. \"Is it me?\" I asked.\"I think it´s a terrible idea, too,\" she said. \"It´s such a nice slogan, but letting the grass grow high and allowing it to do its thing, and then suddenly mowing it back is really counterproductive.\"",
        "Yeh sees the movement as a \"feel-good, stop-gap measure, because if you want to have an impact, you need to establish a permanent cover for insects,\" not merely temporary housing.\"Bees tell each other where the food is, and pollinators (when they discover an unmown lawn) will remember to come back to it again and again,\" Yeh said. \"Then on June 1st, when the food disappears, it´s not good for them.\"Hibernating insects have memories that span not only from day to day but from year to year, Yeh said. So she recommends planting early blooming shrubs, trees and plants to establish a permanent food source they can remember and rely on as adults when they emerge from dormancy.Other problems with the practice, Yeh noted, include \"confusing insects when the grass is suddenly low again. That gives predators the opportunity to take advantage of them.\"There´s also the potential to disturb a nest of bunnies when mowing, she said, calling the discovery \"the most horrible experience you can have.\"An all-or-nothing approach would be better. If you really want to make a difference, consider replacing the entire lawn, or part of it, with native plants or planting a wildflower meadow. Both will provide permanency for birds and pollinators while shrinking or eliminating the lawn, which frankly, has no redeeming value aside from subjective aesthetics, anyway.",
        "When planting for beneficial insects, Yeh advises creating a corridor or path of pollen- and nectar-rich plants for migratory pollinators to travel along instead of spacing plants far apart.Postponing fall cleanup until spring, which spawned another movement called #LeaveTheLeaves, will create safe havens for pollinators to lay their eggs and hibernate within. To allow time for them to emerge from dormancy, wait until after spring temperatures have remained above 50 degrees for an entire week before clearing away last season´s plant debris.For those set on letting their lawns go wild this month, Yeh cautions that \"allowing grass to go to seed will kill it,\" so remove seedheads if they form.It´s also important to reintroduce mowing gradually.\"The best height for grass is 3 inches tall, but if you´re mowing it down from 5 or 6 inches, do it over several sessions,\" she advised, adding that cutting grass by more than one-third of its height at one time can cause it to go into shock.The gradual approach \"also will give insects a chance to realize it´s not a good place for them anymore,\" she said. Hopefully, they´ll take the hint and move on to safer spaces.Jessica Damiano writes regular gardening columns for The Associated Press. She publishes the award-winning Weekly Dirt Newsletter. Sign up here for weekly gardening tips and advice.",
        "___For more AP gardening stories, go to https://apnews.com/hub/gardening."
    ]
}