{
    "articleURL": "/femail/article-12058723/Lady-Louise-Windsor-glow-Coronation.html",
    "content": [
        "Lady Louise Windsor looked elegant in black at last night's Coronation concert READ MORE: For all the latest Royal news, pictures and video click hereThe Duchess of Edinburgh's daughter stunned as she showcased her new sleek hairstyle and glamorous outfit choices as she joined Prince Edward and Sophie at royal events over the Coronation weekend.",
        "Lady Louise Windsor had a number of people on social media talking after wearing her gorgeous blonde locks in a wavy blow dry - a softer look than her usual tight curls.The 19-year-old showcased an elegant black outfit as she took her place in the royal box with the other members of the royal family ahead of the Coronation concert yesterday.The young royal, who is studying English at the University of St Andrews, also stole the show in a flowing white and blue floral gown from Suzannah London at the Coronation of King Charles III on Saturday.Lady Louise accessorized the ensemble with a baby blue hat by Jane Taylor London.",
        "While the dress was certainly a nod to her mother Sophie's chic style, Lady Louise looked radiant and appeared to be a new step in her own fashion choices.  Just like any other teenager, Lady Louise has been no stranger to raiding her mother's wardrobe for an outfit to wear in the past.For a pre-coronation outing on Friday evening, the old daughter of the Duke and Duchess of Edinburgh opted for a Mary Katrantzou lace cocktail dress, which Sophie wore in 2015 when attending an awards ceremony in London.During a visit to Birmingham last year for the Commonwealth Games, Lady Louise wore a £985 Peter Pilotto gown from her mother's wardrobe and paired it with a pair of classic white trainers.",
        "She has also borrowed other articles from her mother's closet, including a classic monochrome dress by Alaïa for the Duke and Duchess of Sussex's wedding in 2018 and a Noble MacMillian plum clutch in 2018 for the Easter Church Service.However, as the young royal steps into a more active role in her family, her sense of fashion is also changing with the times, and many on Twitter were quick to share their praise for Lady Louise's new look.",
        "One person wrote: 'Lady Louise Windsor looks absolutely beautiful tonight.'While another added: 'Lady Louise has turned into a fashion icon!'A third replied: 'She looked fabulous and is really coming into her own as a young woman.'A fourth person said: 'Love her poise and style! Louise is a very cool girl, a lovely presence at royal events.''Love this look. Her best look ever. Finally age-appropriate look. She is shining today,' another comment said.Sophie and Prince Edward wanted to give their daughter and son a 'normal' childhood with school friends and extra-curricular activities.And so Lady Louise was largely kept out of the limelight throughout her childhood, with her first major royal outing coming at the age of nine when she was a bridesmaid at the Duke and Duchess of Cambridge's wedding in 2011.",
        "However, over the last two years, Lady Louise has taken on an increasingly public role as her parents Prince Edward and Sophie have been bumped up the royal food chain following the disgrace of Prince Andrew and the departure of the Duke and Duchess of Sussex.She was front and centre in the Platinum Jubilee celebrations, joined her parents at the Commonwealth Games and made her successful TV debut in a documentary about her beloved grandfather the Duke of Edinburgh.It was also earlier this year reported that the hardworking Louise had over the summer been working at a garden centre, for around the minimum wage, several days a week.She had been earning £6.63 per hour since finishing her A-levels in June - despite living in a £30million mansion in Bagshot Park, Surrey.Meanwhile, she took on a larger role in the events mourning the late Queen last Autumn, appearing emotional yet poised.",
        "She has been described as the 'favourite' grandchild of the former monarch and famously shared a passion for all things equestrian with both her grandmother and the Duke of Edinburgh.It comes after Buckingham Palace said the King and Queen were 'deeply touched' by the nation's celebration of their coronation.After the ceremony, the family appeared on the Buckingham Palace balcony with a select group of senior royals as The Mall was swamped by tens of thousands of cheering supporters.",
        "Lady Louise and James stood beside their royal parents as they waved to crowds before the RAF flypast, which had to be scaled back to just helicopters and the Red Arrows because of the heavy rain in London.",
        "Meanwhile, earlier today Buckingham Palace issued the first public statement on behalf of Charles and Camilla since they were crowned.A Palace spokesman said the King and Queen were 'profoundly grateful' for all those involved in organising the celebrations and ceremony, and the spectators who attended the day.'Their Majesties were deeply touched by the events of yesterday and profoundly grateful both to all those who helped to make it such a glorious occasion - and to the very many who turned out to show their support in such numbers in London and further afield,' he said.The King, Queen and royal family have joined around 20,000 members of the public at the musical extravaganza."
    ]
}