{
    "articleURL": "/wires/reuters/article-12040835/UK-security-no-way-complacent-ahead-coronation-minister.html",
    "content": [
        "By Muvija M",
        "LONDON, May 3 (Reuters) - More than 11,000 police officers will patrol London's streets for King Charles' coronation on Saturday, the biggest ceremonial event staged in the British capital for 70 years, and they are well prepared to handle any incident, officials said on Wednesday.Security forces have spent months preparing for the event, which about 100 heads of state will attend as well as huge crowds of spectators. Thousands of military personnel will take part in a procession.However, demonstartions are also planned by anti-monarchists in Trafalgar Square and along the procession route.Security Minister Tom Tugendhat told Times Radio the event was one of the most important security operations the country has ever mounted.\"The police are, to put it mildly, all over it, and our intelligence and other security forces are extremely aware of the challenge that we face,\" he said.Readiness for the event had been shown by the swift response to an incident on Tuesday evening when a man was detained after throwing what were believed to be shotgun cartridges outside Buckingham Palace, Tugendhat told Sky News. Police carried out a controlled explosion.\"We're in no way complacent\" Tugendhat said.Charles, along with his wife Camilla, will be crowned at Westminster Abbey on Saturday and Deputy Assistant Commissioner Ade Adelekan of London's Metropolitan Police said there was no intelligence of any specific threat to the event.",
        "The biggest issue is likely to be protesters seeking to use the occasion to highlight their causes, although a new law passed this week gives police extra powers to deal with these.Climate activists caused a disturbance during a parade at the start of celebrations for the late Queen Elizabeth's Platinum Jubilee last June, while eggs have been thrown at Charles by protesters at engagements since he became king.\"What we will not stand for and what we will not have is anyone committing criminal acts in the name of protest,\" Adelekan said.\"We will come down very swiftly to intervene, to make sure that people that are going about their normal business that just want to enjoy the coronation are not interfered with.\"The campaign group Republic said it still planned to stage protests despite receiving a letter from the Home Office setting out the new policing powers - a move it said \"could be interpreted as intimidation\".Republic leader Graham Smith said the group had met with the police and were told they had no concerns about its plans.\"Republic will not be deterred and we will be protesting on Trafalgar Square and along the route of the coronation procession on Saturday,\" Smith said in a statement.(Reporting by Sarah Young; writing by Muvija M, editing by Paul Sandle and Angus MacSwan)"
    ]
}