{
    "articleURL": "/sport/nfl/article-12049015/Eagles-round-pick-Jalen-Carter-signs-21-8m-four-year-contract-Philadelphia.html",
    "content": [
        "Carter was a unanimous All-American in 2022 with over 80 career tackles at UGAHe will join a locker room that features numerous old teammates from Georgia DailyMail.com provides all the latest international sports news Philadelphia Eagles defensive tackle Jalen Carter became the initial 2023 first-round draft pick to agree to terms on an NFL contract.",
        "Per the network, Carter and the Eagles reached agreement on a four-year deal worth a fully-guaranteed $21,806,184. All contracts involving first-round selections include a fifth-year team option. He was the No. 9 overall pick in last week's draft.Carter, 22, was a unanimous All-American in 2022 and led Georgia to back-to-back College Football Playoff championships.He totaled 83 tackles (18.5 for loss), six sacks and two forced fumbles in 38 career games with the Bulldogs.",
        "The contract signing likely came as a relief to Carter who had a long and tumultuous summer leading up to the draft itself.Carter's headaches started when he had to leave the NFL combine to turn himself in to be arrested for his involvement in a car accident that killed Georgia staff member Chandler LeCroy and fellow football player Devin Willock. Carter was later charged with reckless driving and racing. He did however return to the combine the following day.His off-the-field issues did not stop there as footage later came out shortly after the incident revealing another time he was pulled over by police for speeding, but he was only given a warn due to the officer not wanting Carter's name to draw headlines.The stressful offseason showed just how much it was affecting him when he absolutely bombed his pro day workout in front of teams.",
        "Not only did Carter weigh in 15 pounds heavier than he did at the combine but he was also unable to complete all of the drills during the workout.Despite this, Carter was never projected to fall out of the top 10 picks. Those predictions proved to be correct after the Eagles moved up from No. 10 to No. 9 to secure Carter's talent last Thursday.",
        "He will now join a locker room that features several of his former teammates at Georgia and the belief is that this will help keep him focused on football and out of trouble.Along with Carter the Eagles drafted fellow Georgia defenders edge rusher Nolan Smith and corner back Keelee Ringo were part of this year's draft class.Last year the drafted linebacker Nakobe Dean and defensive tackle Jordan Davis as well. To top it off Philadelphia traded for another Bulldog in running back D'Andre Swift who previously played for the Detroit Lions.Philadelphia also announced the signings of quarterback Tanner McKee and DT Moro Ojomo. "
    ]
}