{
    "articleURL": "/wires/ap/article-12048787/Rockies-use-5-run-8th-surge-sweep-Brewers.html",
    "content": [
        "DENVER (AP) - Charlie Blackmon had two hits and two RBIs, and the Colorado Rockies used a five-run eighth inning to earn a 9-6 come-from-behind victory against the Milwaukee Brewers on Thursday.",
        "With the victory, the Rockies extended their season-best win streak to four games and won for the sixth time in their past nine games after starting the season 6-17.\"With the talent we have on the field, it´s incredible,\" Rockies infielder Mike Moustakas said. \"Early on in the season, guys are still feeling around, seeing who they are, seeing how the big leagues work. Now, guys are settling in and getting comfortable.\"For the Brewers, it was their fourth consecutive loss, their longest drought of the season, and their seventh defeat in their past 10 games following a 15-6 start. Entering the day, they were 15-1 this season when scoring at least four runs.Trailing 4-0, Colorado tied the game with a four-run seventh inning that was jump-started by Ezequiel Tovar's two-run double that chased Milwaukee starter Wade Miley from the game.Miley had given up just one hit in the first five innings.",
        "After Harold Castro´s pinch-hit, two-run single to left field in the eighth inning gave the Rockies their first lead of the game at 6-4, Elias Diaz brought another run home with a sacrifice fly to right field and Blackmon´s two-run single to center field made it 9-4.\"When I hit it, I saw it right away,\" Castro said of his RBI grounder to left. \"Nobody was playing there.\"",
        "Christian Yelich, Rowdy Tellez and Tyrone Taylor each hit solo homers for the Brewers, with Yelich and Tellez´s shots coming in the first inning.It was Tellez´s seventh home run in the past 18 games. Yelich finished with three hits and two RBIs after entering the game in a slump, with only two hits in his past 22 at-bats.\"I mentioned to them about Catfish Hunter,\" Rockies manager Bud Black said. \"You know what Catfish Hunter said? He said solos don´t beat you.\"Kris Bryant and Mike Moustakas each finished with two hits for the Rockies. Bryant has hit safely in 23 of his past 29 games.Brad Hand (1-1) threw one shutout inning to earn the win for Colorado.Peter Strzelecki (2-2), who gave up five runs in one-third of an inning, took the loss for Milwaukee.\"It wasn´t a good series,\" Brewers manager Craig Counsell said. \"We just pack up and go get ready to play a good one.\"TRAINER´S ROOMRockies: Black said LHP Kyle Freeland \"feels better than he thought he would\" after aggravating a neck injury Wednesday night after he threw five shutout innings in a win against Milwaukee. \"I think he´s going to be fine for his next start,\" Black said.Brewers: OF Garrett Mitchell had surgery this week on labral damage in his left shoulder, an injury he suffered after sliding into a base in an April 18 win at Seattle. Counsell said the time frame for recovery makes it \"unlikely\" Mitchell will return this season, but added \"We´ll see.\"",
        "UP NEXTRockies: RHP Antonio Senzatela will go against the New York Mets on the road in his first start since suffering a torn ACL last August.Brewers: RHP Corbin Burnes (3-1) will face off against San Francisco in a road game.___AP MLB: https://apnews.com/hub/MLB and https://twitter.com/AP_Sports"
    ]
}