{
    "articleURL": "/news/article-12045855/Crystal-Brook-police-stabbing-Best-friend-dead-cop-attacker-says-dont-blame-mans-dog.html",
    "content": [
        "Friend of dead knifeman defends the man's dogSean Ferris was killed after stabbing police  The best friend of a knifeman who was shot dead after attacking police has claimed the his dog Buddy should not be blamed for the horrific ordeal.  ",
        "Sean Ferris, 52, was killed by police at his Crystal Brook home, 200km north of Adelaide, on Wednesday after stabbing Brevet Sergeants Ian Todd, 53, and Jordan Allely, 32.Sergeant Todd sustained life-threatening injuries after being stabbed in the neck, arm and hands, while Sergeant Allely suffered knife wounds to his right leg and arm. Both officers remain in hospital.Police had received complaints about Ferris' husky prompting them to attend his house.Buddy is now in the care of Ferris' best friend, David Wallace, who took the canine in following Wednesday's deadly incident.",
        "Mr Wallace said Buddy was a gentle animal and posed no threat.'He's not aggressive at all. Everyone knows Sean and everyone knows the dog, they know it's friendly,' he told the Adelaide Advertiser on Thursday.'He is quite loud, it hurts your ears, it's annoying, but it's not illegal to have a loud dog.'Mr Wallace said he believes the deadly situation could have been avoided if people hadn't harassed Ferris.'Maybe they should have spoke to Sean about it in a better manner, rather than continuing to have a go at him about the dog,' he said.Footage emerged yesterday of Ferris shouting at people about his dog outside a supermarket in Crystal Brook on Tuesday.",
        "Ferris can be heard telling them he is 'sick of a**eholes like you whinging about my dog and causing me trouble'. ",
        "Mr Wallace said arrangements would most likely be made to return Buddy to Ferris' family.Mr Wallace said Buddy 'knew something was up' after Wednesday's violent ordeal.'He stayed with me last night and he was OK, but he's with Sean every day so that's who he's looking for right now,' he said.Sergeants Todd and Allely had visited Ferris after reports of the disturbance a day earlier outside the store.It is believed Ferris' behaviour had become more erratic over past weeks due to ongoing disputes with locals over Buddy.One shop owner said the dog was 'very aggressive, both in his front yard and when it was tied up out the front of shops in the main street'. Another said Ferris 'used the dog to intimidate people'.",
        "When the officers attended Ferris' home, he stabbed Sergeant Todd in the neck and was then shot, but still managed to stab Sergeant Allely.Ferris was then shot again, before moving back inside his house where he died.On Thursday, Police Minister Joe Szakacs said he had been in contact with the injured officers and their families.'I can't begin to imagine the anxiety and stress their families are going through,' he said at a press conference.",
        "The entire public of South Australia is with them and stands beside them.'He said Sergeant Todd remained in serious condition.It has been revealed Ferris had had a few run-ins with the police previously, having been arrested for refusing to wear a mask in November 2021, according to The Advertiser.On the same day he was arrested for assault and disorderly behaviour and later charged with hindering police.Police eventually dropped the assault charge and Ferris pleaded guilty to breaching Covid restrictions, disorderly behaviour and hindering police.He was ordered to pay costs and had no further penalty imposed after the magistrate took into account the time he had spent in custody following his arrest."
    ]
}