{
    "articleURL": "/wires/ap/article-12047405/Fox-opposes-fellow-journalists-trying-uncover-documents.html",
    "content": [
        "NEW YORK (AP) - Fox News is opposing a renewed effort by three news organizations to unseal documents related to its recently settled defamation lawsuit, saying it would do nothing but \"gratify private spite or promote public scandal.\"",
        "The Associated Press, The New York Times and National Public Radio asked a Delaware judge earlier this week to reveal mostly private text messages and conversations between Fox employees shortly after the 2020 presidential election The information was uncovered during the Dominion Voting Systems lawsuit.Fox lawyer Katharine L. Mowery, in a letter sent to Delaware Superior Court Judge Eric Davis and accepted by the court Thursday, said much of the material its competitors sought wasn't relevant to the issues of the lawsuit.Some material from the vast trove of evidence that Dominion gathered has already been released and proved newsworthy, showing that Fox hosts and executives didn't believe the false allegations about Dominion's voting equipment but still continued to air them. Some messages revealed former Fox host Tucker Carlson's scorn for former President Donald Trump, including one text where he declared, \"I hate him passionately.\"\"They have not been shy about sharing the communications with the most potential to grab headlines,\" Mowery wrote of the media challenging the sealed documents.One of the reasons Fox agreed to settle the case was to \"buy peace and bring an end to the media spectacle,\" she wrote.",
        "David McCraw, senior vice president and deputy general counsel at The New York Times, said the newspaper was disappointed by Fox's continued opposition.",
        "\"Fox's lawyers argue that unsealing the court documents will harm journalism and undermine the First Amendment, when in fact the best interests of the public and journalism are served by judicial transparency, not secrecy,\" McCraw said.While it's standard for journalists to want as much information as possible to be made public, it's also not surprising Fox would want to keep it under wraps, said Lucy Dalglish, dean of the Philip Merrill College of Journalism at the University of Maryland.\"I'd be shocked if Fox said, `sure, let me give it to you, have fun,´\" Dalglish said.Fox may be concerned that some of the hidden information might be fodder for other legal action, she said, and wouldn't want to release it unless under a court order. Fox has said much of the material was redacted because it contained proprietary information about the company.The material's continued relevance was evident this week, when an article in the Times quoted a racist text message from Carlson saying that a group of Trump supporters beating a protester was \"not how white men fight.\" The newspaper suggested that the message may have played a role in Fox's decision last week to fire Carlson.His text was among the cache of Dominion documents that had been sealed from the public. The Times said that the contents of the text were disclosed in interviews with several people close to the defamation lawsuit. Fox's lawyer cited the story in her letter to Davis.",
        "Mowery pointed out that Dominion's lawsuit had reached a conclusion, but lawyers for the news organization said that doesn't make their request for unsealing the information moot.It's not clear when Davis might rule. He has already cited the settlement as the reason for ending an investigation he had ordered into Fox not being forthcoming in producing certain evidence in the case.Fox agreed last month to pay $787 million to end the case. Dominion had accused the network of repeatedly airing bogus claims that its voting equipment rigged the 2020 election against Trump, despite knowing those claims were false."
    ]
}