{
    "articleURL": "/news/article-12042895/Married-father-two-dentist-suspended-gyrated-against-female-staff.html",
    "content": [
        "Kulwinder Virdee, 51, accused of inappropriate touching and lewd commentsHe allegedly told the nurse, 19, his ‘sex addiction’ made him feel ‘horny all day’After weeks of alleged pestering, the trainee secretly recorded one conversationA married dentist accused of being a sex pest has been suspended for 18 months after he targeted a teenage dental nurse just weeks after she began working at his practice.",
        "Father-of-two Kulwinder Virdee, 51, allegedly told the 19-year-old he had ‘a sex addiction’ that made him feel ‘horny all day’.He is accused of inappropriate touching, making lewd comments and bombarding the trainee with WhatsApp messages after work over a three month period.After the woman made a complaint, other female members of staff came forward and the matter was reported to the General Dental Council.Mr Virdee, who was one of three partners at the practice, is alleged to have touched the complainant on a number of occasions, stroking her thigh when she sat beside him and attempting to put his hand on her private parts.",
        "After weeks of allegedly being pestered, the trainee secretly recorded one conversation while the pair were alone in the staff room at Bispham Dental Practice, near Blackpool, Lancs.In the recording played at a disciplinary hearing, Virdee made a series of sexually explicit comments.He said: ‘Can’t a guy sit innocently admiring the view?‘Mmm - just let me know when you’re the most horny yeah.‘When you are the most horny...what time of day?….morning, evening - me all day that’s really good isn’t it?’He added: ‘I think I’ve got a sex addiction that’s what it is I think....have you?‘Now. What’s underneath that? Oh Jesus. I do love your booty. I think a booty rub is innocent isn’t it?",
        "‘I like being with you....I’ve told you before you can’t help who you are attracted to can you?",
        "‘You can’t, you can’t help it… Just look at me. Yep, definitely you would, you would. Yes honestly. I want to f*** you just tell me when.’The hearing was told the complaint began working at the practice last October.Between November 30 and February 23 this year Virdee sent 27 WhatsApp messages and made seven phone calls to the complainant - including one at 11.37pm on 26 January 2023.On another occasion he made four phone calls between 4.16pm and 8.51pm.The hearing was told the complainant responded to the messages asking him to stop.Mr Virdee, had been at the private practice for 23 years and worked alongside dentist partners Robin Caro and Mark Collinson.The hearing was told they employed nine members of staff - all of whom are women.When his partners were alerted to the complaints in February, they commissioned an independent HR consultancy to investigate.Other staff members said they had witnessed Mr Virdee make inappropriate comments of a sexual nature and claimed he had a ‘history of inappropriate behaviour in the workplace’.One trainee dental nurse said he had ‘slapped her thighs’ while another colleague witnessed him ‘rubbing and gyrating’ against a member of staff.",
        "A colleague quoted in the ruling who had worked at the practice for more than two decades, said: ‘Twenty-one years I have worked here and 21 years it has been going on for… I have said you cannot speak to young girls like that. 'He would respond “I know, I’m vile”.’Mr Virdee is also alleged to have discussed topics of a sexual nature ‘such as dogging, cottaging, and prostitution’ in front of colleagues during working hours at the practice.He is alleged to have sent a number of inappropriate WhatsApp pictures to colleagues.Mr Virdee strenuously denies touching staff inappropriately.He said the conversation in the audio recording had been ‘taken out of context’, but admitted he sometimes made ‘sexual jokes or innuendo’ in the presence of his employees.He has not worked at the practice since the allegation was reported on February 6.Last month the dentist, who likes to be known as Kuli, informed patients of his absence.Writing on the practice’s Facebook page he said: ‘After 23 years at Bispham, I am sorry to say that due to circumstances beyond my control, I am unable to see you at this time.‘I know that we have come to know each other well and that it is difficult when you can’t see me.’",
        "He added: ‘I am hoping to have some solution in place but it may be some time before I can return.’The Dental Professional Hearings Service committee made an 18 month interim suspension order ‘for the protection of the public’ while a further investigation is carried out by the General Dental Council.In the committee’s judgement, there would be ‘a real risk of harm to the public’ should Mr Virdee be allowed to continue practising without restriction.The committee said it had taken into regard ‘the substantial imbalance of power which would have existed between you as a dentist and partner at the practice and the complainant, a 19-year-old trainee dental nurse.’The suspension will be reviewed in six months."
    ]
}