{
    "articleURL": "/wires/reuters/article-12047327/Heavy-fighting-Khartoum-US-warns-protracted-war.html",
    "content": [
        "Despite supposed truce, battles continue",
        "Warring sides urged to start peace talksUN seeks safe passage for relief aid(Adds quote from Khartoum businessman on destruction of markets, paragraph 13)By Khalid Abdelaziz and Mohamed NoureldinKHARTOUM, May 4 (Reuters) - Fierce fighting persisted in Sudan on Thursday despite a truce agreement as U.S. intelligence said rival forces were trying to gain the upper hand ahead of possible negotiations and the U.N. warned of the violence's devastating toll on children.Despite multiple ceasefire declarations, the two sides appeared to be battling for control of territory in the capital Khartoum ahead of proposed talks, though the leaders of both factions have shown little public willingness to negotiate after more than two weeks of fighting.The Sudanese army on Thursday sought to dislodge the Rapid Support Forces (RSF) paramilitary force from its positions near central Khartoum in intense battles.\"Both sides believe they can win militarily and have few incentives to come to the negotiating table,\" U.S. Director of National Intelligence Avril Haines told the Senate Armed Services Committee in Washington.With fighting having continued despite ceasefire deals, the White House said it may sanction those responsible for destabilising Sudan.The sudden collapse into warfare has killed hundreds, triggered a humanitarian disaster, sent an exodus of refugees to neighbouring states and risks dragging in outside powers, further destabilising an already restive region.",
        "\"The situation in Sudan is teetering toward catastrophe, and children are increasingly caught in the crossfire,\" Catherine Russell, executive director of the U.N. children's agency UNICEF said in a statement. \"For the sake of Sudan´s children, the violence must stop.\"Saying attacks had limited its ability to provide aid to children across the country, UNICEF said it had received reports of 190 children killed and 1,700 injured in Sudan since the conflict erupted on April 15. Firm numbers were difficult to obtain due to the intensity of the violence, it said.Sudan said on Tuesday that 550 people had died and 4,926 people been wounded.UNICEF called on the battling factions to ensure children were not caught in the line of fire, including by stopping attacks on health centres, schools and water stations.FOOD AID LOOTEDThe conflict has dealt a crippling blow to the heart of the country's economy in the capital Khartoum, disrupted internal trade routes, threatened imports and triggered a cash crunch.Across swathes of the capital, factories, banks and shops have been looted or damaged, power and water supplies have been failing and residents have reported steep price rises and shortages of basic goods.Several large markets have been destroyed, said Saddam Siddig Bashasha, who runs a solar energy and generator business in Khartoum. \"These torched markets supported poor workers and farmers. Thousands of them lost their jobs, which will make conditions really difficult,\" he said.",
        "The fighting results from a power struggle between two rival factions, the army and RSF, that had shared power after a coup in 2021, derailing efforts to bring democracy and civilian rule after a 2019 popular uprising that unseated strongman Omar al-Bashir.U.S. President Joe Biden called the violence a betrayal of the Sudanese people's demands for civilian government and said the U.S. stood ready to offer humanitarian assistance \"when conditions allow\".The sound of bombardment and clashes rang out in Khartoum and its adjoining cities of Omdurman and Bahri on Thursday in violation of the latest, seven-day, truce agreement. The army was trying to push the RSF from positions around the presidential palace and military headquarters.\"Since yesterday evening, and this morning, there are air strikes and the sounds of clashes,\" said Al-Sadiq Ahmed, a 49-year-old engineer speaking from Khartoum.\"We've got into a state of permanent terror because the battles are around the centres of residential neighbourhoods. We don't know when this nightmare and the fear will end.\"The United Nations, meanwhile, pressed the warring factions to guarantee safe passage of aid after six trucks were looted.U.N. aid chief Martin Griffiths said he hoped to have face-to-face meetings with both sides within two to three days to secure guarantees from them for aid convoys.",
        "The World Food Programme (WFP) on Thursday estimated that $13 million to $14 million worth of food destined to people in need in Sudan had been plundered so far.About 100,000 people have fled Sudan with little food or water to neighbouring countries, the U.N. says.The civilian toll has been exacerbated by the warring sides' use of explosive weapons including tanks, artillery, rockets and airstrikes in populated areas, Human Rights Watch said on Thursday, accusing them of reckless disregard for civilian life.(Additional reporting by Tala Ramadan in Dubai and Jonathan Landay and Idrees Ali in Washington; Writing by Michael Georgy, Angus McDowall and Cynthia Osterman; Editing by Gareth Jones, Gerry Doyle, Emelia Sithole-Matarise and Daniel Wallis)"
    ]
}