{
    "articleURL": "/wires/reuters/article-12044879/Western-Alliance-says-no-unusual-deposit-outflows-First-Republic-sale.html",
    "content": [
        "May 3 (Reuters) - Western Alliance Bancorp said on Wednesday it had not experienced unusual deposit outflows following the sale of collapsed lender First Republic Bank to JPMorgan Chase &amp;amp; Co, as the U.S. regional bank sought to reassure investors.",
        "Phoenix-based Western Alliance said its total deposits were $48.8 billion as of Tuesday, up from $48.2 billion as of Monday. As of Tuesday, more than 74% of total deposits were insured, the company said.The statement from Western Alliance came after reports that PacWest Bancorp was exploring strategic options including a sale or capital raising.The news sent shares of several regional lenders tumbling in after-market trading, led by a 52% plunge at PacWest and 23% decline at Western Alliance.The late-day drop in regional bank shares added to losses in Wednesday's regular trading session, despite reassurances by U.S. Federal Reserve Chair Jerome Powell that the country's banking system remained resilient.JPMorgan agreed on Monday to acquire a majority of First Republic's assets in a $10.6 billion deal after regulators seized the lender, which became the largest U.S. bank failure since the 2008 financial crisis.But shares of regional banks have slid through the week as investor worry that the latest turmoil, which began with the failures of Silicon Valley Bank and Signature Bank in March, could spread.Western Alliance, which has more than $65 billion in assets, said in a statement it was releasing the update to reaffirm its financial strength as well as its deposit growth guidance in response to recent industry events.",
        "It said about 88% of its 20 largest deposit relationships were insured, with liquidity coverage of uninsured deposits from on-balance sheet liquidity and available borrowing capacity at about 165%.(Reporting by Ankur Banerjee in Singapore and Jyoti Narayan in Bengaluru; Editing by Sonia Cheema and Jamie Freed)"
    ]
}