{
    "articleURL": "/wires/afp/article-12051809/Messi-says-sorry-Saudi-trip-suspended-PSG.html",
    "content": [
        "Lionel Messi on Friday apologised for going on an unauthorised trip to Saudi Arabia that led to Argentina's World Cup-winning captain being suspended by his club Paris Saint-Germain.",
        "\"I want to apologise obviously to my teammates and to the club,\" Messi said in a video posted on Instagram to his 458 million followers.He was suspended by the Qatar-owned club after failing to turn up for training on Monday, a day after their 3-1 home defeat by Lorient in Ligue 1.Instead, the seven-time Ballon d'Or winner travelled to Saudi Arabia without PSG's permission to fulfil commitments as part of a contract with the country's tourist office.\"I honestly thought we were going to have the day off after the match as had happened in the previous weeks,\" he said.\"I had organised this trip to Saudi Arabia having cancelled it previously. This time I couldn't cancel it. I am sorry for what I did and I wait to see what the club decides to do.\"The affair has made it increasingly unlikely that Messi will remain at PSG beyond this season, when his two-year contract with the club expires.A source with knowledge of the disciplinary procedure told AFP that Messi would be sidelined for \"several days\", and he is therefore set to play no part in PSG's match against Troyes this weekend in Ligue 1.Various media in France said he would be suspended for two weeks, although AFP has not been able to confirm those reports.",
        "PSG, who are five points clear at the top of Ligue 1, will have just four more matches remaining this season following their game against Troyes.\"We will see when Leo comes back. We will see what happens. Obviously there will be discussions with the club as a whole but also with Leo because this concerns him first and foremost,\" PSG coach Christophe Galtier said on Friday when asked if Messi would play for the team again.Galtier also said that the decision to suspend the 35-year-old Messi was not his to take in the first place.\"It wasn't my decision to take. I was informed of the decision and I defer to it,\" he insisted."
    ]
}