{
    "articleURL": "/wires/afp/article-12048143/UN-short-24-mn-prevent-Yemen-oil-spill.html",
    "content": [
        "The United Nations is short nearly $24 million needed to safely remove oil from an abandoned tanker off Yemen's coast, officials said Thursday, urging donors to stump up the remaining funds.",
        "A virtual donor conference on Thursday raised $5.6 million in new contributions towards the $129 million unprecedented rescue operation, in which the UN purchased its own supertanker to remove more than a million barrels of oil from the beleaguered FSO Safer in the Red Sea.\"It is urgent that this gap is closed to successfully implement the operation,\" said Farhan Haq, spokesman for the UN secretary-general.\"While we appreciate the contributions received so far, there's a crucial need for the funds to allow us to complete the task that we have begun.\"After the emergency phase is completed, an additional $19 million will be needed for the second phase, Haq said, which will involve towing the Safer and securing the UN-purchased supertanker, the Nautica.The donor conference was organized by the United Kingdom and the Netherlands.The 47-year-old Safer has not been serviced since Yemen's civil war broke out in 2015 and it was left abandoned off the rebel-held port of Hodeida, a critical gateway for shipments into the country heavily dependent on emergency foreign aid.The Safer's 1.1 million barrels contain four times as much oil as that which spilled in the 1989 Exxon Valdez disaster off Alaska, one of the world's worst ecological catastrophes, according to the UN.Despite the lack of funds, \"we remain confident that the operation on the water will begin before the end of this month,\" Haq told AFP, adding that the UN can rely on \"available internal financial mechanisms\" while awaiting more donor money.",
        "An oil spill from the Safer would not only be devastating for some 1.7 million Yemenis who depend on the fishing industry for their livelihoods, but would affect millions of others if ports used for food deliveries were to close.\"The rationale for action is clear: 20 million dollars now could save 20 billion in potential costs later,\" UN Development Programme administrator Achim Steiner said in a statement.\"The moral case is equally clear,\" he added.The Nautica is en route to the region and is due to first make a stop in Djibouti in early May."
    ]
}