{
    "articleURL": "/wires/pa/article-12045963/Chimpanzees-combine-calls-communicate-new-meaning--study.html",
    "content": [
        "Chimpanzees can combine calls to communicate new meaning and signal when there is a threat, a study has found.",
        "Researchers suggest this ability might be evolutionarily more ancient than previously thought.A key feature of human language is combining words into larger phrases where the meaning of the whole is related to the meaning of the parts.However, where this ability came from or how it evolved has not been clear. Our behavioural observations suggest that chimpanzees combine these calls when exposed to a threat where recruiting group members is advantageous, such as when encountering a snake, but until now experimental verification has been missing  Mael Leroux, study lead  Experts say chimpanzees, our closest-living relatives, are known to produce a number of different vocalisations to manage their social and ecological lives.Under some circumstances, these calls can be combined into larger sequences, particularly when they are in danger and may need the help of others.",
        "By conducting experiments with wild chimpanzees in Uganda, researchers from the universities of Zurich (UZH) and Warwick showed that these combinations are understood by chimpanzees.Mael Leroux, a postdoctoral student at the Department of Comparative Language Science at UZH, who led the study, said: “Chimpanzees produce ‘alarm-huus’ when surprised and ‘waa-barks’ when potentially recruiting conspecifics during aggression or hunting.“Our behavioural observations suggest that chimpanzees combine these calls when exposed to a threat where recruiting group members is advantageous, such as when encountering a snake, but until now experimental verification has been missing.”",
        "In the study researchers presented the animals with model snakes and were able to elicit the call combination.They found that the chimpanzees responded strongest to playbacks of the combination than when hearing either the “alarm-huu” or “waa-bark” alone. Our data therefore indicate that the capacity to combine meaningful vocalisations is potentially at least six million years old, if not older  Professor Simon Townsend  UZH professor and associate professor at the University of Warwick Simon Townsend said: “This makes sense because a threat that needs recruitment is an urgent event and suggests listening chimpanzees really are combining the meaning of the individual calls.”According to the scientists, their findings may shed potential light on the evolutionary roots of language’s compositional nature.Prof Townsend said: “Humans and chimpanzees last shared a common ancestor approximately six million years ago.“Our data therefore indicate that the capacity to combine meaningful vocalisations is potentially at least six million years old, if not older.”The researchers say the study provides an intriguing glimpse into the evolutionary emergence of language.The findings may indicate that combining sounds or phrases to convey a different meaning may have originated prior to the appearance of language itself.However, more research, ideally in other great ape species, would be needed to confirm this.",
        "The research is published in Nature Communications."
    ]
}