{
    "articleURL": "/news/article-12044987/Just-Beautiful-Port-Macquarie-owner-Karine-Hughes-business-Facebook-page-hacked-scammers.html",
    "content": [
        "Business Facebook page stolen by scammersKarine Hughes' customer base rapidly dwindlingShattered business owner shared how easily it occurred A heartbroken wedding make-up artist and beauty store owner has lost thousands of dollars in a matter of weeks after US scammers obtained control of her business Facebook page.",
        "Just Beautiful Port Macquarie owner Karine Hughes fears her reputation is at stake as her hard-fought battle to resolve the ongoing saga continues.Three weeks on, the NSW mid-north coast operator still hasn't regained ownership of her business page, despite reporting the problem to Facebook, cyber authorities and the state's small business ombudsman.She's been unable to post or manage content on the stolen page since April 2.Nor can she access or respond to inquiries from potential clients that usually flood the page's Messenger inbox.She has spoken out about the devastating ordeal in the hope Facebook will finally intervene and to warn other small business owners of how easy a cybersecurity attack can occur.",
        "'Literally all of our leads have gone cold,' Ms Hughes told Daily Mail Australia.'Business has dried up. We used to get a good dozen leads a week about weddings but now, we're getting nothing, even though Port Macquarie is a popular wedding destination.'It's the worst feeling ever and we're heartbroken that someone can do this to us.'Ms Hughes realised something was wrong one morning when hackers had logged onto her personal Facebook overnight and accepted a friend request from Chicago.'An hour later, I went to log into the business Facebook page and couldn't access it,' she recalled.",
        "'The man had put himself as an admin on my business page and had removed me, even though I have two-factor authentication on my phone.''It's very upsetting, scary and has made me very vulnerable as I don't know how they hacked into the page.'It's absolutely devastating as I've worked very hard in the last six years.' ",
        "While Ms Hughes still has control of her business' Instagram page, most client inquiries were generated from Facebook.Her customer base has dwindled rapidly in the wake of the cybersecurity attack.Ms Hughes says pleas to Facebook to give back control of the page have fallen on deaf ears so far.'For such a big organisation, it's been very poor, there's no live chat button and you can't talk to anyone,' she said.'My reputation is at stake here because people think I'm not responding to their messages.'Ms Hughes also issued a desperate plea to cybersecurity hackers.'Leave the small guys alone, we've had enough to deal with in the last few years, especially with Covid,' she said.'We just want to get on with making an income.' 'To other businesses out there, be careful with who you're dealing with online.'",
        "Ms Hughes isn't the only small business that has been targeted. ",
        "'Same thing happened to me too. All to do with Meta now owning it and nobody gets back to you at all. Best to start a new one is your only option,' a Kempsey-based salon operator recently commented.One Port Macquarie beauty salon added: 'Happened to us too!'Daily Mail Australia has contacted Meta for comment. Meta says it's investigating the issue. 'Scammers present a challenge in any online environment, and social media platforms are no exception,' a spokesperson told NewsCorp.'We're committed to safeguarding the integrity of our services, and dedicate substantial resources and technology solutions to protect our community from fake accounts and other inauthentic behaviour. '"
    ]
}