{
    "articleURL": "/sport/formulaone/article-12059387/Verstappen-beats-Perez-Mercedes-struggle-SEVEN-THINGS-LEARNED-Miami-Grand-Prix.html",
    "content": [
        "This weekend's Miami Grand Prix saw more drama in the world of Formula One Red Bull's Max Verstappen won the race from ninth as his dominance continuesBelow, Mail Sport looks at seven things we learned from race weekend in FloridaThis weekend in Florida provided plenty of thrills and spills as the Formula One circus rolled into town in the south-east United States of America.",
        "Max Verstappen triumphed once again, driving brilliantly from ninth on the grid to further underline his dominance over Red Bull team-mate Sergio Perez and the rest of the field.There were yet more woes for Lewis Hamilton and Mercedes, who looked miles off the pace, and for whom the promised upgrades package at Imola in a fortnight cannot come soon enough.While elsewhere, a star-studded line-up of celebrities turned up despite accusations the sport is getting 'boring'. And below, Mail Sport rounds up seven things we learned from the Miami Grand Prix this weekend.",
        "Verstappen underlines dominance over PerezIt's said the only fair and truly accurate comparison you can make between F1 drivers are between team-mates - because they are the only ones who have the same car. In that sense, it's clear to everyone who the top dog is at Red Bull - Max Verstappen.The Dutchman did not have a brilliant start to the weekend after making a mistake in qualifying and then not being able to make amends when Charles Leclerc crashed, curtailing the qualifying session.When Perez started on pole, after beating Verstappen in Azerbaijan last week, there were suggestions that this could be the year to finally mount a serious title challenge.The Mexican started on medium tyres, like the rest of the top seven, but while Verstappen made good progress on the hards, was only 3.3 seconds clear by the time Max had risen from ninth to second.",
        "When 'Checo' pitted and changed to hards, he struggled to extract the same pace, and was so far behind that Verstappen was then able to pit and rejoin only 1.6 seconds behind. It was a mere formality that he then passed Perez. A nonplussed Perez said after the race: 'Max deserves the victory. He was the strongest car out there. I have to understand what went wrong. It's really simple. When you don't have the race pace, it is really hard to win the race.' He now leads Perez atop the world championship rankings by 14 points and is massive favourite to win his third title in a row. More importantly, he has delivered a crucial and likely fatal psychological blow to his nearest (and only) challenger.",
        "But the world champion is booed Despite his near-faultless performance on the track, Verstappen isn't gaining any more fans off it. The build-up to the race was dominated by his bust-up with Mercedes star George Russell, which reflected in the atmosphere in Miami.The pair clashed on track on the opening lap of the sprint race in Baku, causing the world champion to call the Englishman a 'd***head' in an angry confrontation afterwards.The two-time world champion had been largely at fault after refusing to concede space for the British driver and later regaining the lost position, with Russell defending his right to make the move.",
        "That prompted Verstappen to deride his rival as 'Princess George' in a subsequent interview - which seemed both unfair, given his history of attempting borderline and questionable overtakes, and hypocritical, given his history of whining to the media.Russell added: 'It was all a little bit pathetic. I think something you learn as a kid is if you're going to give something you've got to be willing to take it as well. 'He's had his fair share of giving moves like that and being tough and hard at racing and it's a little bit poor to see how he sort of spat his dummy out when it was the first time he probably got something back in the same regard.'It seems most fans agree, with boos ringing around the Hard Rock Stadium during the showbiz-y build-up to the race and then again on the podium. After the race, Verstappen insisted: 'If I would be driving in the back nobody would be doing anything in terms of reaction. It is normal when you are winning and they don't like who is winning. It is fine for me. I get to stand on the top. I take the trophy home and they go back to their houses and they can have a nice evening.'",
        "That response displays a degree of delusion. The 'they hate me because I'm winning' defence doesn't work because Lewis Hamilton didn't receive the same kind of backlash - it's probably more to do with the way he's acting.  ",
        "Don't expect Mercedes to challenge any time soon The signs are not good for Mercedes. Despite fourth- and sixth-placed finishes for George Russell and Lewis Hamilton, it could be a while before we see them genuinely challenge for podiums on a regular basis.After practice on Friday, Hamilton said their lack of pace was a 'kick in the guts' and upgrades were 'desperately' needed.Silver Arrows chief Toto Wolff is hoping a significant upgrade package due in Imola on May 17 will deliver a sizeable improvement, but it's fair to say that is definitely more a hopeful than an optimistic feeling. Hamilton called it a 'new path' and the different design direction could eventually lead to them catching up to Red Bull's race pace. It will need to be fairly drastic to revamp the 'nasty piece of work' of a car the seven-time champion is driving.Wolff said: 'I have never in my 15 years in F1 seen a silver bullet being introduced where you suddenly unlock 0.5 seconds of performance. So I very much doubt this is going to happen here.",
        "'We are introducing new bodywork and a new floor and new front suspension and that's pretty large operation, large surgery, and so it's going to be a lot of learning. In the virtual world it is good lap time.' The Austrian, though, knows translating virtual performance into the real world is a lot easier said than done. ",
        "Concerns over a lack of entertainment Success has many fathers but failure is an orphan, the saying goes. But it is easy to pinpoint why lots of fans - and Wolff - feel the sport is getting 'boring'.Red Bull's giant advantage over every single other car - arguably even greater than Mercedes' dominance when Hamilton was winning title after title - obviously doesn't help.When all the other cars feel so close, too, and tyre fragility is a widespread problem, it doesn't help either.Clearly F1 agrees to some extent, which is why they introduced several technical rule changes for the 2022 season to try to jazz up the spectacle, like the much-maligned sprint races. Verstappen - typically - has been outspoken about his thoughts on those, but Fernando Alonso, for one, thinks we need more time to see how they fare.He said: 'If Red Bull were not so far ahead, it is a very interesting fight with three or four teams within 0.1-0.2seconds. And maybe then we would be saying the rules were a success.",
        "'Maybe this is the story in a few years' time when we have some stability in the rules.'",
        "Kevin Magnussen and Fernando Alonso impress And speaking of Alonso... the Spaniard was brilliant once again in the Aston Martin.Alonso, 41, has been the surprise package of the season and currently lies third in the drivers' standings, with Aston Martin second in the constructors' championship.He kept right on Perez' tail, held off the Ferrari of compatriot Carlos Sainz, before taking an excellent podium.While Magnussen had a long battle with Sainz' team-mate Charles Leclerc, fighting off the Monegasque on several occasions, re-passing him twice after being overtaken, before Leclerc finally managed to pass.The Dane lost a couple of places at the end but to finish in the points in a Haas car, especially given his competition, is pretty impressive. ",
        "Trouble brewing at Alpine Alpine finished fourth in the constructors' last year, almost the 'best of the rest', but now lie sixth overall with just 14 points.French drivers Esteban Ocon and Pierre Gasly have made several mistakes, with CEO Laurent Rossi not holding back in an interview with TV station Canal+ before the Miami race. He said: 'This year we have started with a performance deficit, on one hand, and also an execution deficit. That's a lot - and it shows. We are in a position that is not at all worthy of the resources invested, and we are far - very far - from the final objective of the year.'What I see is, there's certainly a lack of performance, a lack of rigour in the execution, but also potentially a frame of mind that is not at the level of what had been accomplished by this same team in the past.''The last race in Baku looked an awful lot like the one in Bahrain. The right to make mistakes, it is a basic principle. Mistakes are what we learn from. However, when you make the same mistakes twice, it means you haven't learned and that you aren't taking responsibility. And that is not acceptable.'Ouch. There could be major changes coming - whether in the driving duo or behind the scenes. ",
        "F1 going mainstream in America Finally, despite the lack of jeopardy in many of the races, a capacity crowd of 90,766 packed into the Miami arena to watch the spectacle.That began before the race, when iconic rapper LL Cool J introduced the drivers individually, before an orchestra played music written by Will.i.am.Celebrities like Tom Cruise, Shakira, Roger Federer, Serena Williams, Patrick Mahomes and Queen Latifah provided the glitz and glamour.Clearly still interesting enough for them! "
    ]
}