{
    "articleURL": "/wires/ap/article-12038945/Cheggs-stock-plunges-fears-competition-ChatGPT.html",
    "content": [
        "Shares of the education technology company Chegg lost nearly half their value Tuesday after its CEO warned that OpenAI's free ChatGPT service was cutting into its growth.",
        "Chegg CEO Dan Rosensweig told investors on a conference call Monday that early in the year, the company was meeting expectations for new sign-ups for its educational services. But that shifted in recent months.\"Since March we saw a significant spike in student interest in ChatGPT,\" Rosensweig said. \"We now believe it´s having an impact on our new customer growth rate.\"Chegg shares tumbled 48% to close Tuesday at $9.08. The stock traded above $100 in early 2021 as most students were still stuck at home attending class online during the pandemic.Rosensweig said students who normally pay for Chegg's service around midterms or finals were reluctant to pay for subscriptions when there was a free site for them to use.ChatGPT quickly became a global phenomenon after its November launch. Some school districts have blocked access to it because it had sparked a panic among some educators with the ease with which it could answer take-home test questions and assist with assignments.",
        "By the time schools opened for the new year, New York City, Los Angeles and other big public school districts began to block its use in classrooms and on school devices.Early this year, OpenAI tried to curb ChatGPT's reputation as a cheating machine with a new tool that can help teachers detect if a student, or artificial intelligence, did the homework. OpenAI cautioned that the new tool is not foolproof.",
        "Last month, Chegg announced it was launching its own artificial intelligence companion called CheggMate, supported by OpenAI´s latest and most advanced artificial intelligence model, GPT-4.Chegg, which is based in Santa Clara, California, said that the combination of its personalized learning platform, proprietary data set and GPT-4's problem-solving capabilities \"will empower students to learn in real-time more effectively, and with greater accuracy than ever before.\"Rosensweig called Tuesday's stock sell-off \"extraordinarily overblown\" in an interview with CNBC.\"Overall Chegg is an extraordinarily healthy company,\" he said."
    ]
}