{
    "articleURL": "/sport/football/article-12050307/Why-West-Ham-vs-Man-Utd-7pm-Sunday.html",
    "content": [
        "West Ham United host Manchester United at the London Stadium on SundayThe Red Devils come into the game off the back of a 1-0 defeat by Brighton Follow Mail Sport's dedicated LIVE blog for all the latest updates from UnitedWest Ham United host Erik ten Hag's Manchester United in the Premier League, with the game set to get underway at an unusual time of 7pm.",
        "The Hammers come into the game off the back of a 3-0 defeat by Manchester City on Wednesday.David Moyes' side currently sit 15th in the league table and are four points off the drop zone.As for the Red Devils, Ten Hag's side were beaten 1-0 by Brighton and Hove Albion in their last game. United's defeat means they remain in fourth place and are two points behind Newcastle United. But why is West Ham's clash with United taking place at 7pm on a Sunday? Mail Sports provides the answers below. ",
        "Why is the game kicking off at 7pm  on Sunday?Traditionally, the latest game on a Sunday tends to take place at 4.30pm. However, due to King Charles III's Coronation, the clash between West Ham and Manchester United was forced to be moved. Other games have also been affected and were forced to be rearranged due to a lack of police resources and other safety concerns.Five games are set to take place tomorrow, while West Ham's clash with United will be one of two games on Sunday.Three games will take place on Monday, including Brighton and Hove Albion vs Everton. The Premier League apologised for the delay in announcing the latest raft of fixture rearrangements, citing the Coronation in their reasoning.'The Premier League apologises to supporters for the delay in announcing these fixtures and understands their frustrations.",
        "'Finalising these particular selections took longer than expected due to complications around the scheduling on the weekend of the Coronation of His Majesty The King and Her Majesty The Queen Consort.'",
        "How to watch Sunday's clash between West Ham and Manchester United will be shown live on BT Sport 1 and BT Sport Ultimate, with coverage getting underway at 6.30pm.The game between the two teams will also be streamed on the BT Sport app.Highlights will be uploaded to the official BT Sports YouTube channel after the game.Mail Sport will also be providing live coverage of West Ham vs Manchester United, so you can keep up-to-date with all the latest developments here.",
        "What happened in the reverse fixture?The two sides have actually met twice this season, with the first encounter taking place in October. They would meet again earlier this year in the FA Cup.In the first match, a goal from Marcus Rashford was enough to give the Red Devils the win against David Moyes' side.Both teams met again two months again in the FA Cup fifth round. Goals from Alejandro Garnacho and Fred gave United a 3-1 win. "
    ]
}