{
    "articleURL": "/news/article-12053371/DOJ-recommends-25-year-prison-sentence-Oath-Keepers-founder-Stewart-Rhodes.html",
    "content": [
        "Oath Keepers founder and Yale graduate Stewart Rhodes was found guilty in November of seditious conspiracy in relation to the January 6 riotProsecutors in the case are seeking a sentence of 25 years in prison for Rhodes If the sentence his handed down, it would be the longest so far of anyone convicted of playing a role in the Capitol riot  The US Justice Department asked a federal judge on Friday to sentence Oath Keepers founder Stewart Rhodes to 25 years in prison for his conviction on seditious conspiracy and other charges over the January 6th riot.",
        "President Joe Biden's DOJ is also seeking a sentence of 21 years for another Oath Keepers leader, Kelly Meggs, who was also found guilty in November of seditious conspiracy by a Washington, DC, jury.Rhodes and Meggs are among 10 members of far-right groups found guilty of seditious conspiracy - a plot to oppose the government with force - for their roles in the Jan. 6, 2021, attack on the Capitol, which was an attempt to overturn Democratic President Joe Biden's 2020 election win. If fully imposed, the recommended sentences would be the longest so far for anyone convicted in connection with the Capitol riot. Prosecutors said the defendants 'played a central and damning role' in the attack and should be sentenced more severely than other rioters because their conduct was comparable to domestic terrorism.",
        "Earlier on Friday, Peter Schwartz, a Pennsylvania man with a lengthy criminal history, was sentenced to more than 14 years in prison for storming the Capitol, the longest prison term handed down so far.Trump, who is now again seeking the Republican nomination to challenge Biden in 2024, continues to falsely claim that his defeat was the result of fraud.Rhodes' lawyer is expected to file his sentencing recommendation later on Friday.The same Washington jury that convicted Rhodes and Meggs cleared three other co-defendants, Kenneth Harrelson, Jessica Watkins and Thomas Caldwell, of seditious conspiracy. ",
        "But all five were found guilty of obstruction of an official proceeding - the congressional certification of the election results - with mixed verdicts on a handful of other charges.Prosecutors said they were seeking 18 years in prison for Watkins, 15 years for Harrelson and 14 years for Caldwell.A lawyer for Caldwell asked the judge to impose no additional prison time and instead credit time he has served in home confinement.A lawyer for Watkins was due to file a recommended sentence later on Friday. Harrelson was given until Monday to file his recommendation with the court.",
        "The charges of seditious conspiracy and obstruction of an official proceeding each carry a sentence of up to 20 years in prison. Sentences are left to the discretion of federal judges and are typically based on factors like past criminal history and the seriousness of the crime.All five are scheduled to be sentenced later this month.Four other members of the Oath Keepers David Moerschel, Joseph Hackett, Roberto Minuta and Edward Vallejo were convicted in January of seditious conspiracy for their roles in the attack. They are awaiting sentence.The Justice Department also filed sentencing recommendations for that group, requesting prison terms of between 17 and 10 years for the four defendants.",
        "Another federal jury on Thursday convicted former Proud Boys leader Enrique Tarrio and three other members of that far-right group of seditious conspiracy, but acquitted a fifth defendant on that count.Five people including a police officer died during or shortly after the riot and more than 140 police officers were injured. The Capitol suffered millions of dollars in damage.Of the more than 1,000 people who have so far been arrested on charges related to the riot, more than 525 have pleaded guilty and more than 65 have been found guilty, according to the Justice Department."
    ]
}