{
    "articleURL": "/wires/aap/article-12049521/Embarrassing-derby-loss-fuels-Sydneys-finals-fire.html",
    "content": [
        "Sydney FC captain Alex Wilkinson claims the club's \"embarrassing\" humiliation at the hands of rivals Western Sydney was the catalyst for the Sky Blues to revive their A-League Men season.",
        "The two sides square off in a winner-takes-all elimination final at CommBank Stadium on Saturday night, with the Wanderers still riding the high of March's 4-0 thumping of their biggest rivals.Marko Rudan's side have been training all week with the highlights of that derby encounter playing in the gym and meeting rooms of their HQ.Sydney are eager to avoid a repeat of that encounter which left their finals hopes on shaky ground.But since that loss Steve Corica's side are undefeated in their last five games and head west brimming with confidence.\"Those games are the biggest of the year and the ones we enjoy playing the most,\" Wilkinson told AAP.\"We were poor that night, there's no two ways about it and the Wanderers made us pay.\"Quite frankly, it was pretty embarrassing to bid to be part of that.\"And I think really hit a chord with the players and ever since then we've managed to get on a bit of an upward trend.\"We're a much better team than what we showed that night.\"It's not all been doom and gloom for Sydney this season with the club having enjoyed a 1-0 victory over the Wanderers the last time they travelled to Parramatta for a derby game.",
        "Wilkinson, who will rack up a record 28th ALM finals appearance, said that the Sky Blues' experience gave them confidence that they could extend their title hopes beyond the weekend.\"This takes the derby to the next level with it being the biggest game of each club's season,\" Wilkinson said.\"Everything is on the line, the loser will go home.\"I think without a doubt, come the finals series (the experience) gives you a little bit of an advantage if you've been there and played in those important games before.\"We got a core group of players who have been involved in a lot of big games for Sydney FC.\"The more experience you can get into those games where there's going to be nerves, spice and passion is going to be an advantage.\""
    ]
}