{
    "articleURL": "/wires/aap/article-12049003/Federal-minister-cancels-two-Queensland-coal-projects.html",
    "content": [
        "Two proposed Queensland coal mines have been knocked back after failing to prove their environmental credentials, giving green groups hope more projects could be canned.",
        "The China Stone Coal mine project is a proposal by MacMines Austasia to construct and operate a coal mine in Belyando.In 2018, further information was requested about the potential impacts on threatened species and water resources.But more than four years later, nothing has been provided.The project aimed to produce 55 million tonnes a year of coal across 50 years.The Range Coal project is a proposal by Stanmore Coal to construct and operate an open-cut coal mine and processing facilities 25km southeast of Wandoan.In 2013, further information was requested about the impact on threatened species and water resources but nothing has been provided.The two proponents wrote to the government in 2020 indicating they wanted to progress the projects but have not submitted the additional information requested of them.The original material submitted to the government might no longer be current because impacts on the environment, species present in the area, and species considered threatened under the Environment Protection and Biodiversity Conservation Act have changed.\"I've been clear I will have zero tolerance for businesses who refuse to provide adequate information about the impact their projects will have on nature,\" Environment Minister Tanya Plibersek told AAP on Friday.\"If companies aren't willing to show how they will protect nature, then I'm willing to cancel their projects - and that's exactly what I've done.\"",
        "Stanmore CEO Marcelo Matos said while the Range remained in the company's portfolio, it was a legacy thermal coal resource from the 2009 IPO and the current focus was on developing metallurgical coal assets.\"Stanmore's intention is to maintain the asset, including its tenure, and preserve our optionality going forward,\" Mr Matos said.He said the company remained open to resubmitting the project \"at the appropriate time\".Opposition resources spokeswoman Susan McDonald said it appeared both projects were largely halted by their proponents years ago.\"But Tanya Plibersek is treating a chiefly administrative act with the glee she reserves for her ongoing war on coal,\" Senator McDonald told AAP.\"This sort of virtue signalling is why we can expect to see similar reluctance to progress new mines as an anti-jobs and anti-investment culture is clearly now growing under the Albanese government.\"She said demand for coal remained strong and it was important, in terms of global emissions, to provide the world with \"efficient, clean Australian coal\".The Environment Council of Central Queensland, represented by Environmental Justice Australia, launched the Living Wonders legal intervention in July to compel the minister to reconsider 19 coal and gas proposals.Three of the 19 projects have previously been refused by the minister or withdrawn by the companies.",
        "The minister's decision on the China Stone and Range Coal projects means there are now 14 coal and gas proposals subject to legal intervention.Council president Christine Carlisle said the minister should now \"show courage when assessing the remaining coal and gas proposals on her desk\".\"Each and every one of them will have a devastating impact on our climate and our living wonders, so must be properly assessed,\" she said."
    ]
}