{
    "articleURL": "/news/article-12053027/Jock-Zonfrillo-death-Chef-subject-repeated-welfare-checks-year-died-Carlton.html",
    "content": [
        "Jock Zonfrillo, 46, was found dead in his hotel Monday morningWelfare checks had been called before Zonfrillo's shock passingIn the last year they were called on 'a number of occasions' In the year leading up to his shock death multiple welfare checks were carried out by emergency services on celebrity chef Jock Zonfrillo, it's been reported.",
        "Medical response units were called on 'a number of occasions' to check up on Zonfrillo, 46, a source told the The Herald Sun.  The welfare checks were due to ongoing concerns about the late chef's health before he was found dead at Zagame's House hotel at 2am on Monday, May 1 by police. Police were alerted that something might be wrong with him after receiving an anonymous tipoff, which is believed to have come from his concerned wife Lauren Zonfrillo, well-placed sources have told Daily Mail Australia.Zonfrillo was set to star in the latest season of Australia's Masterchef, which had been scheduled to start on the day he was found unresponsive.",
        "Lauren rang police from Rome early on Monday morning when Zonfrillo failed to answer multiple calls from his wife.Officers who attended Zagame's House at Carlton at about 2am found Zonfrillo dead in his bed and saw no signs of anything suspicious or unusual. There was no drug paraphernalia located, no one else in the hotel room and police formed the view the father-of-four had died of natural causes. Mrs Zonfrillo is now left to care for the couple's two young children and the chef's adult daughters from his former relationship, who are understood to have arrived in Australia from Italy on Tuesday night.",
        "Daily Mail Australia previously revealed the 46-year-old had been diagnosed with bowel cancer about May 2021, after an earlier bout with the disease.It is not suggested the cancer killed Zonfrillo, only that he had told friends its return was detected after a routine colonoscopy. A close friend and former neighbour of Zonfrillo told Daily Mail Australia the chef sometimes opened up to him about his 'demons' over a glass of whisky.Stuart Ayer said he and his wife struck up a close relationship with the TV star's family during the three years they were next-door neighbours in Carlton.Speaking about Zonfrillo's relationship with his wife, Mr Ayer said 'they were a really solid couple'.'The kids were the light of his life,' he said. 'They're great kids and it's such a tragedy.'Daily Mail Australia has been told Zonfrillo had been receiving treatment for bowel cancer from at least June 2021, a month after it was detected in a colonoscopy.A source said at the time: 'No one in his circle is aware of what he is going through. Neither colleagues or friends.' 'He has not wanted anyone to know as he deals with this tough journey. He is coping poorly with chemo treatment, and the effects it is having.' In the months that followed Zonfrillo was an out-patient at the Kinghorn Cancer Centre in Sydney and Epworth Oncology in Melbourne as well as seeking treatment in Queensland, the source said.",
        "Zonfrillo underwent chemotherapy while filming his second series of Celebrity MasterChef in 2021.Daily Mail Australia, which has seen evidence of Zonfrillo discussing the diagnosis  with a close friend, contacted the chef and members of his family in August 2021 but received no response. Another source said Zonfrillo had been avoiding hospital and was instead being attended by a doctor who was flown in to treat him.'He claimed that each time he was getting any medical treatment there was a barrage of nurses that keep coming into his room, and he didn't want to be impolite by asking to be left alone,' the source said.Zonfrillo was settling into Italian life when he had to return to Melbourne to undertake promotional work for the latest season of MasterChef from Monday morning.",
        "A source said Zonfrillo kept his health problems from most friends and colleagues, usually receiving treatment including chemotherapy when the hit cooking show was not filming.    It is understood MasterChef co-host Andy Allen had a meeting with Channel Ten executives on Thursday morning, along with third MasterChef judge Melissa Leong, to discuss how publicity for the program would be handled.Zonfrillo, who recently moved to Rome with his family, left his wife and two young children Alfie and Isla in Italy to return for the launch of MasterChef's 15th season.",
        "Network Ten has announced the series, which had been due to begin on Monday, would now premiere on Sunday with the full support of Zonfrillo's grieving family.In his 2021 memoir Last Shot he did not mention suffering from cancer, but did discuss his years of heroin addiction as a young man in Glasgow.An autopsy will now be conducted to determine the celebrity chef’s cause of death."
    ]
}