{
    "articleURL": "/wires/reuters/article-12059089/GRAPHIC-Red-metal-rising-Argentina-sets-lofty-sights-global-copper-10.html",
    "content": [
        "By Lucila Sigal",
        "BUENOS AIRES, May 8 (Reuters) - Argentina, known better for its Malbec than its mining, has its sights set on becoming a top ten copper producer by 2030, with an investor friendly stance luring global players like Glencore and Lundin Mining to its mountainous north.The South American country has a pipeline of copper projects that could produce 793,000 tonnes a year by the end of the decade, government forecasts show, well below neighboring No. 1 producer Chile but near big players like Australia and Zambia.While a lofty goal - Argentina produces no copper currently after its last working mine closed in 2018 - it could position the country as an important new supplier as demand globally for the metal rises along a global electrification push.Leading the way is Lundin Mining's Josemaria project in northern San Juan province, aiming to produce over 130,000 tonnes a year and that is a pre-construction phase.Behind that in the queue are Glencore's $4.5 billion El Pachón; MARA, owned by Yamana Gold Inc, Glencore and Newmont Corp; First Quantum Minerals Ltd's Taca Taca and McEwen Mining's Los Azules.\"With Pachón, Altar and Los Azules we can add immense potential in terms of copper that the world is demanding for the energy transformation that is already underway,\" said Carlos Astudillo, mining minister of key copper province San Juan.",
        "BRIDGING THE DEMAND GAPSan Juan is home to five of Argentina's eight main copper projects that have a total capex of $22 billion, a recent government report shows. Three more are in Mendoza, Catamarca and Salta, all near the north-west Andean border with Chile.Josemaria, Astudillo told Reuters, had its environmental impact statement approved; Los Azules had presented its impact report, and El Pachón, a long-stalled mine, was moving towards production with regional political support for the project.\"(There's) incredible potential that could make the country a key player in bridging the gap between current production and future copper demand in the clean energy transition,\" said Carolina Laumann, Josemaria's communications manager.The mine aims to finish an engineering review, key permits and infrastructure deals this year, she said, and move to a financing stage. Once construction starts it could be 4-5 years to production, she said. The target had been to produce in 2026.Argentina has an estimated 65 million tonnes of copper reserves, according to a 2022 government report, some 3% of the global total. That compares with world No. 2 producer Peru's 9% share and distant leader Chile with almost a third.ELECTRIC VEHICLE DEMANDTo be sure, Argentina is battling an economic crisis with scarce foreign currency reserves, inflation over 100% and tight capital controls which make business complex. But the need for growth has added impetus to sectors such as mining and energy.",
        "The country is already one of the world's top lithium producers, and officials see mining as a strong potential employer and future driver of exports, which could help the indebted country bring in much-needed hard currency.Víctor Delbuono, a mining economist at the Fundar Foundation that worked with the government on its latest mining report, said Argentina had built up a strong copper project pipeline and done well attracting investment in recent years.He added though that the country still needed to improve its complex foreign exchange market and fine tune its tax system for the sector to help ensure strong mining development up to 2030.Franco Mignacco, president of the Argentine Chamber of Mining Entrepreneurs (CAEM), said the global electric vehicle boom would be a key driver. Carmaker Stellantis made a $155 million investment earlier this year in Los Azules.\"The projects we have are of global importance and relevance because it's estimated that demand for copper between now and 2050 could be multiplied,\" he said. Copper demand is forecast to double to 50 million tonnes by 2050 from 2020 levels.\"The projects we have and many more will be needed.\"(Reporting by Lucila Sigal; Editing by Adam Jourdan and Louise Heavens)"
    ]
}