{
    "articleURL": "/wires/reuters/article-12043717/US-criminal-justice-alliance-seeks-erase-trial-penalty.html",
    "content": [
        "By Sarah N. Lynch",
        "WASHINGTON, May 3 (Reuters) - A group of 24 U.S. civil rights and criminal justice groups and advocates on Wednesday launched a coalition aimed at reforming sentencing so people convicted at trial do not face heftier punishments than those who plead guilty to the same crime.The activists are seeking to end what is called the \"trial penalty\" - longer prison terms for defendants who go to trial versus those who accept plea deals arranged with prosecutors, with people convicted at trial on average facing sentences three times longer.The \"End the Trial Penalty Coalition\" brings together organizations from across the ideological spectrum, from the ACLU, the Innocence Project and the National Association of Criminal Defense Lawyers, to Right on Crime.\"I personally believe this will be a watershed moment for criminal justice in this country,\" said Norman Reimer, a coalition co-founder and former executive director of the NACDL, the defense lawyers group.The effort is complicated by the U.S. criminal justice system's diffuse nature, with local, state and federal courts. This means the alliance will need to lobby Congress, state legislatures, courts and local bar associations.It expects to pursue reforms that may include: eliminating or reducing the use of mandatory minimum sentences; giving judges more discretion to \"look back\" and adjust excessive sentences; removing language often used in plea agreements that requires defendants to waive certain legal rights; and requiring prosecutors to give defendants access to all evidence against them regardless of whether they accept a plea.",
        "The U.S. Constitution guarantees the right to a fair trial by a jury of one's peers. But despite popular culture depictions that make trials seem commonplace, they have become far less so than in the past, with prosecutors pushing to make agreements under which defendants plead guilty to a charge in exchange for the likelihood of a more lenient sentence.In 2022, 97.5% of all defendants in federal court pleaded guilty, according to a report by the U.S. Sentencing Commission, which studies and develops sentencing policies for the federal judiciary.\"'Law And Order' is always investigation, prosecution, trial,\" said FAMM President Kevin Ring, whose criminal justice advocacy group is part of the coalition, referring to the popular TV show. \"In the real world, you'd have to watch 100 episodes just to see two to three trials.\"Plea agreements are often touted by proponents as a tool to make the justice system more efficient and less expensive. Defendants who plead guilty typically get credit for accepting responsibility for their crimes and spend less time in prison.Criminal justice advocates point to a downside. Defendants who plead guilty are not given access to all evidence against them and their appeal rights are limited. Some defendants, according to the activists, feel pressure to accept a plea deal even when innocent just to avoid a possible steep sentence at trial.",
        "The National Registry of Exonerations, which collects information about exonerations of innocent criminal defendants, has tracked 3,300 exonerations since 1989.Rodney Roberts, who was arrested in New Jersey in 1996 on a robbery charge, said he experienced that dilemma first hand. While he was in custody, police told him a 17-year-old girl who had been kidnapped and sexually assaulted identified him as her assailant in a photo line-up.In court, a public defender gave him 20 minutes to decide whether to plead guilty to a lesser charge and serve two years of a seven-year term, or go to trial and risk a life sentence. Roberts took the plea deal, but ended up serving 18 years in prison and civil confinement before being exonerated by DNA evidence and released in 2014.\"It felt I had to choose between two evils: Lucifer and Satan,\" Roberts said in an interview arranged by the Innocence Project. \"I felt I was betraying myself.\"(Reporting by Sarah N. Lynch; Editing by Will Dunham and Scott Malone)"
    ]
}