{
    "articleURL": "/tvshowbiz/article-12042167/What-happen-Dune-Two-need-know-Timothee-Chalamets-sequel.html",
    "content": [
        "Since the first Dune movie is based on the first half of the novel, the sequel will likely feature the second halfThe second half of the Dune novel focused on Paul's (Chalamet) rise to power Dune: Part Two premieres in theaters on November 3After Dune's big box office success, fans have been eagerly awaiting the arrival of its hotly-anticipated sequel - and now they have finally had their first look at the upcoming movie with the release of its first trailer.",
        "In Dune, Paul Atreides (Timothee Chamalet) and his parents, Duke Leto (Oscar Isaac) and Lady Jessica (Rebecca Ferguson) travel to the dangerous planet Arrakis to be its new rulers only to realize the emporer, Shadam IV (Christopher Walken), was working the Baron Vladimir (Stellan Skarsgard) and the rest of the Harknnonens to defeat them.Part two is set to pick up where part one left off. Since part one covered the first half of the 1965 novel Dune, part two is poised to cover the second half.As per Warner Bros' official description, the sequel film 'will explore the mythic journey of Paul Atreides as he unites with Chani and the Fremen while on a warpath of revenge against the conspirators who destroyed his family. ",
        "'Facing a choice between the love of his life and the fate of the known universe, he endeavors to prevent a terrible future only he can foresee.'Dune's director Denis Villeneuve has told fans they can expect more action plus a fully IMAX experience for Dune: Part Two. Additionally, Zendaya as well as the rest of the supporting cast from part one will have much more prominent roles in part two. The newly-released trailer proves this. Not only is Zendaya heavily featured, but it also introduces new characters like Princess Irulan (Florence Pugh) and Feyd-Rautha Harkonnen (Austin Butler).",
        "The trailer kicks off showcasing Zendaya's character, Chani, and Paul's close bond. Chani continues to be prevelant throughout the trailer not only fighting by Paul's side but by sharing a steamy kiss with him in the desert.There also seems to be no shortage of action, just as director Villeneuve promises. Some of the villains mentioned in the novel like Shadam IV, Feyd-Rautha and Baron Vladimir are seen preparing for battle against Paul.The trailer clearly depicts that there are two sides - Paul, Chani and their tribe - the Fremen - versus the emperor and the Harkonnens in the ultimate battle for control over the planet. ",
        "As promised, the trailer seemingly picks up where the last movie ends. At the end of part one, Paul and Lady Jessica are forced to flee into the desert after the Atreides home is attacked by the Harkonnens and most of their family members are murdered.After escaping a sandworm, they run into the Fremen run by Stiglar (Javier Bardem) and Chani. When Paul wins a duel against one of the members, Jamis, he and Jessica are welcomed into the tribe.Based on what goes down in the second half of the novel Dune, here is what could happen in Dune: Part Two. What could happen in Dune: Part Two? Book charts Paul's rise to powerPart two is poised to focus on Paul's rise to power.",
        "After winning the fight, Paul and Jessica spend two years in the Freman stronghold Sietch Tabr.In his time there, Paul chooses the name Muad'Dib and works on growing his powers which include predicting the future, being in many places at once and seeing into the past and present of all beings in the universe.Paul helps the Fremen enact a revenge plot against the Harkonnens. He helps the Fremen stop relying on mining spices on Arrakis. Through this, Paul establishes himself as a leader and the tribe declares him as their messiah.",
        "Jessica also help them train in an intense form of combat known as the Weirding Way.During a Freman raid, Paul and Jessica learn that the believed-dead Gurney Halleck is actually alive. Disappointed in his inability to forsee Gurney's survival, Paul drinks the Water of Life which gives him complete access to the full extent of his powers. Jessica also finds herself gaining power as Stilgar encourages her to take on the role of Reverend Mother. In order to do this, she also drinks the Water of Life.However, Jessica didn't know she was pregnant with Paul's father, Leto's, child at the time. When her daughter Alia is born, she realizes the child has been granted the same wisdom.Meanwhile Paul and Chani end up falling in love and have a son, Leto II, whom they name after Paul's father.  ",
        "Paul's time at Sietch Tabr ends when the emperor's troops attack in an attempt to stop his rise to power.While Paul survives, his son Leto II is killed and Alia is captured. This is when Paul begins to plot his revenge. He and the Fremend destroy the shield protecting Arrakis, where the emperor is currently located, and ride into the city on a sandworm.They then unleash an attack against the emperor and the Harkonnens.",
        "Meanwhile, Alia escapes and kills Baron Vladimir Harkonnen, whom she finds out his her and Paul's grandfather and Jessica's father.The attack is successful and Paul takes back the planet. However, his greatest foes, the emperor and the ruler of Arrakis and baron's nephew, Feyd-Rautha Harkonnen (Austin Butler), are still alive.Feyd challenges Paul to a duel. Paul comes out victorious, becoming the new ruler of Arrakis. Because he now controlled the unvierse's main resource gorwn in the city, spice melange, Paul threatens to destroy it if he didn't send his troops home.The emperor then steps down from the throne and secedes the title to Paul. How close will Dune: Part Two be to the novel based on the trailer The trailer definitely contains some sentiments of the second half of the novel. The trailer kicks off showcasing Zendaya's character, Chani, and Paul's close bond. The tranquil moment of them hanging out in the dessert is quickly interrupted as word gets out around the planet that Paul survived the attack on the Atreides house from part one.",
        "Pugh's character gets a big feature in the trailer which is surprising considering her character is named hugely in the plot.However, it doesn't mean she doesn't serve an important role. Her character serves as narrator in the novel. Based on the trailer, her character may have a more influential role in the plot of the movie than she did in the novel.",
        "Lady Jessica is by her son's side, just like in the novel, as she warns Paul that his father wouldn't have wanted him to seek revenge.In the novel, that doesn't seem to stop Paul and the same holds true for the trailer.Paul is then seen riding a sandworm, which is a big feat after his close encounter with one in part one.This is likely the part in the second half of the novel when Paul leads a siege against the city of Arrakis. There are some other action moments from the novel teased like Paul's arrival in Arrakis and his duel with Feyd-Rautha.As for the rest, moviegoers will just have to wait and see how much from the novel applies to the film. What director Denis Villeneuve has said about Dune: Part Two so farVilleneuve has promised plenty of improvements for Dune: Part Two.Even though part one was successful enough, moviegoers can look forward to much more action and featured moments from supporting characters.",
        "Villeneuve shared that all of the sets are a new and that the sequel is filmed entirely in IMAX to THR. 'Part One is more of a contemplative movie. Part Two is an action-packed, epic, war movie,' Villeneuve stated. 'It is much more dense. We went to all new locations... I didn’t want a feeling of repetition. It’s all new sets. Everything is new... This time, it's full IMAX.'Additionally, many fans were disappointed when Zendaya was only in the last few minutes of the film.Villeneuve has promised that Zendaya, as well as the other characters, will be much more prominent in part two. 'There are some characters that are less developed that I'm keeping for the second film — that's the way I found the equilibrium,' Villeneuve told the LA Times in 2021. 'We tried in [Dune: Part 1] to stay as close as possible to Paul's experience. Then, in the second one, I will have time to develop some characters that were left aside a little bit. That's the theory. I hope it will work.'"
    ]
}