{
    "articleURL": "/sport/football/article-12054281/AC-Milan-2-0-Lazio-Theo-Hernandez-wonder-strike-seals-win-Stefano-Piolis-side.html",
    "content": [
        "Milan suffered an early blow when Rafael Leao was substituted with a knee injuryIsmael Bennacer opening the scoring for the hosts after a Lazio defensive errorTheo Hernandez was on hand to double Milan's advantage after 29 minutes AC Milan 2-0 Lazio: Goals from Ismael Bennacer and Theo Hernandez secured three points for the Rossoneri at the San Siro as they continued their push for Champions League football.",
        "Just four days before their Champions League semi-final showdown with rivals Inter, Stefano Pioli's side suffered an early blow when Rafael Leao was forced off injured after just 10 minutes. The visitors attempted to play out from the back but were quickly dispossessed and Ismael Bennacer combined with Olivier Giroud to put Milan in the lead.Milan doubled their advantage on 29 minutes when Theo Hernandez produced a stunning strike from outside the box after carrying the ball almost the entire length of the pitch.Lazio struggled to create chances after the break, and failed to register a single shot on target during the game.",
        "The action settled into a slower pace in the second half, with Milan resting a number of players who are expected to play a part in Wednesday's derby.Ante Rebic replaced Giroud during the closing stages, and the Croatia international looked to have added to the host's tally after he neatly finished beyond Ivan Provedel but his effort was ruled offside.Victory sees Milan return to the Champions League spaces, albeit provisionally with both Inter and Roma having the opportunity to overtake them should they secure three points in their clash on Saturday. Meanwhile, Maurizio Sarri's side have now lost three of their last five games in Serie A and will need to return to winning ways if they are to qualify for the Champions League. "
    ]
}