{
    "articleURL": "/wires/reuters/article-12059135/Standard-Chartered-CEO-says-big-U-S-recession-unlikely.html",
    "content": [
        "By Yousef Saba",
        "DUBAI, May 8 (Reuters) - Standard Chartered Chief Executive Bill Winters said on Monday he sees a big recession in the United States as unlikely, although a period of negative growth was possible.\"I think it's less the question of a massive decline in the U.S. - I think that's very, very unlikely,\" Winters said at conference in Dubai, adding the economy was \"extremely strong\".\"But it's also got a high inflation problem and interest rates that are either going to stay high or maybe even go higher at some point ... until the economy slows down. Now does that lead us into a big recession? I think unlikely. Could we have a period of negative growth? Yes.\"He said Standard Chartered's credit committee is \"not tighter at all\" after the collapse of three regional U.S. banks.\"We were a net receiver of deposits during this period of global angst and we've got a super strong capital position and a very strong liquidity position,\" he said, although the bank needs to keep an eye on how regulation changes.Central banks need \"to make sure that solvent banks - otherwise healthy banks - have access to liquidity,\" Winters said adding that the U.S. Federal Reserve did not do a good job \"in the eye in the storm\".",
        "The \"reactive response in the U.S. was perfect,\" effectively stemming the crisis, he said, adding the ideal would have been to provide liquidity to \"challenged banks\" ahead of time.\"Now they may still end up taking the bank into the FDIC, writing off the equity, imposing losses on the AT1 securities ... that may still have happened, but in a more orderly way that wouldn't have undermined confidence in the broader system.\"\"I'm not concerned about the problems in the banking sector in the U.S. or Switzerland - which is where they've been so far - I'm not really concerned about it spilling over into global economic activity,\" he said, adding he was \"very optimistic about the Gulf.\"First Abu Dhabi Bank, the UAE's biggest lender, earlier this year had considered a bid to take over Standard Chartered, but later said it was no longer doing so.Asked if Standard Chartered's biggest shareholder would stick by it if another Gulf lender \"came after\" it, Winters said: \"We have all the capacity and resources we need to keep on growing and keep on living an independent life.\"\"If somebody wants to come in and talk to us about how they can make us better ... yeah, be my guest, we can always have a conversation. We have that responsibility to our shareholders. But I'm very, very confident that we can deliver this package all by ourselves,\" he added.",
        "On interest rates, Winters said \"I don't know\" when asked about the worst-case scenario, but added that his bank was focused on 5.25% \"for now and for a while.\" (Reporting by Yousef Saba; additional reporting by Tala Ramadan; Editing by Louise Heavens and Alexander Smith)"
    ]
}