{
    "articleURL": "/sport/football/article-12053425/Arsenal-legend-Paul-Merson-claims-Anthony-Martial-shouldnt-playing-Manchester-United.html",
    "content": [
        "United's wretched away record against top sides continued with Thursday's lossAlexis Mac Allister netted Brighton's penalty in the ninth minute of added timeMerson feels Ten Hag needs to replace his striker Martial if United are to improveArsenal legend Paul Merson has claimed Anthony Martial 'shouldn't be playing for Manchester United' and that the Red Devils 'need a Harry Kane up front'.",
        "United's wretched record away to the Premier League's best teams continued with Thursday's late loss to Brighton.The Red Devils have failed to win any of their away games against the current top nine teams, drawing one and losing the other eight.Alexis Mac Allister slammed home Brighton's last-gasp penalty in the ninth minute of added time after Luke Shaw's clumsy handball was punished following VAR's intervention. Reflecting on the match, Merson believes Erik ten Hag needs to replace the French forward if United are to progress. ",
        "'Manchester United's current front three is Anthony Martial, Marcus Rashford and Antony, but I think there will be changes this summer, one million per cent,' Merson, 55, wrote for Sportskeeda.'They are 16 points behind Manchester City at the moment and the same team next season will not get anywhere close to the Premier League title.'They need a Harry Kane up front. Anthony Martial - seriously? He shouldn't be playing for Manchester United, sorry.' Ten Hag made four changes for the visit to Brighton, bringing in Aaron Wan-Bissaka, Fred, Antony and Martial. The 27-year-old has struggled with problems relating to his hip, hamstring, back and Achilles this term. Martial has registered seven goals and three assists in 24 appearances this season.The Frenchman is still under contract until 2024 and is reportedly on wages of around £240,000-a-week.",
        "Ten Hag's team have five league games left, starting with the weekend's trip to West Ham, before they face derby rivals Manchester City in the FA Cup final.",
        "The Dutchman said he is confident United can recover from their 1-0 loss and perform well in the final games of the season but urged the side to show character after a poor result.'We have every time in the season, when we had a defeat, then we bounced back. So I count on my team, we have to do it again,' Ten Hag said.'The players have to take responsibility and I count on them. We have everything in our hands, so we have to focus on our performance... I am quite confident about that.'We need to be there, in the Champions League (next season). We want to be there because we want to challenge the best teams in the world so we do everything in our power to get that done.'"
    ]
}