{
    "articleURL": "/wires/pa/article-12041999/Russian-military-foiled-Ukrainian-drone-attack-Kremlin.html",
    "content": [
        "Russian authorities have accused Ukraine of attempting to attack the Kremlin with two drones in an effort to assassinate President Vladimir Putin.",
        "The Kremlin branded the alleged attack attempt overnight as a “terrorist act” and said Russian military and security forces had “disabled” the drones before they could strike.A statement on the Kremlin’s website said debris from the unmanned aerial vehicles fell on the grounds of the seat of Russia’s government, but did not cause any damage.The statement added that no casualties were reported.If true, the purported drone attack would be a significant escalation in the 14-month conflict, with Ukraine taking the war to the heart of Russian power.The alleged attack immediately prompted calls in Russia from pro-Kremlin personalities to carry out assassinations on senior leadership in Ukraine.A video published overnight on a local Moscow news Telegram channel, which appeared to have been shot across the river from the Kremlin, showed what looked like smoke rising over the Kremlin.According to the text accompanying the video, residents of a nearby apartment building reported hearing bangs and seeing smoke at around 2.30am local time (12.30am BST). It was not possible to independently verify the posted footage.Ukraine presidential adviser Mykhailo Podolyak denied any involvement in the incident.He said: “Ukraine has nothing to do with drone attacks on the Kremlin”, adding the claims would provide a pretext for Russia “to justify massive strikes on Ukrainian cities, on the civilian population, on infrastructure facilities” in the coming days.",
        "The Kremlin did not present any evidence to back up its account as Russia prepares to observe its annual Victory Day on Tuesday May 9.“We consider these actions as a planned terrorist act and an attempt on the life of the president of Russia, carried out on the eve of the Victory Day, the parade on May 9, where foreign dignitaries are expected,” the Kremlin’s statement read.Russia retains the right to respond “when and where it sees fit”, the statement said.Kremlin spokesman Dmitry Peskov told Russia’s state news agency RIA Novosti that Mr Putin was not in the Kremlin at the time and was working from the Novo-Ogaryovo residence.The Kremlin added that Mr Putin was safe and his schedule was unchanged. Mr Peskov said that the parade would take place as scheduled on May 9.Shortly before the news about the alleged attack broke, Moscow mayor Sergei Sobyanin issued a ban on using drones in the Russian capital, with an exception for drones launched by authorities.Mr Sobyanin did not cite a reason for the ban, saying only that it would prevent “illegal use of drones that can hinder the work of law enforcement”.A legislator who represents Crimea in Moscow, Mikhail Sheremet, told Russian state media that the Kremlin should order a missile strike on Ukrainian President Volodymyr Zelenskyy’s residence in Kyiv in retaliation for Wednesday’s alleged incident.",
        "Elsewhere, Russia used Iranian-made drones during its third attack on Ukraine’s capital city in six days.Explosions were heard in Kyiv and elsewhere during the night as Ukrainian air defences shot down 21 of the Russian drones, Ukraine’s Air Force Command said. No damage or casualties were reportedMeanwhile, a massive blaze broke out at an Russian oil depot, local officials said.The depot erupted in flames in Russia’s southern Krasnodar region, located east of the Russian-held Crimean Peninsula, according to Krasnodar governor Veniamin Kondratyev.He did not say what caused the fire, which was described as extremely difficult to put out. But some Russian media outlets said it was likely caused by a Ukrainian drone attack overnight. There was no official comment on that possibility.Local residents heard an explosion shortly before the fire erupted, Russian news site Baza said.Military analysts think Ukraine is targeting supply lines in the Russian rear while gearing up for a possible counter-offensive amid improving weather conditions and as it receives large amounts of weapons and ammunition from its Western allies.Explosions also derailed a Russian freight train and hit a Russian airfield in recent days. Last weekend, a massive fire erupted at an oil depot in Crimea after it was hit by two of Ukraine’s drones, a Russia-appointed official said.",
        "In anticipation of a Ukrainian counter-offensive, Russian forces are focused on destroying logistical routes and centres of Ukraine’s armed forces with long-range strikes, Kyiv military officials say.At the same time, Russia plans to continue talks with the United Nations and other parties to an wartime agreement on facilitating Black Sea agricultural shipments, Mr Peskov said ahead of talks on Friday.Earlier on Wednesday, Russian foreign ministry spokeswoman Maria Zakharova confirmed that a new round of consultations between Russia and the UN on access of Russian agricultural products and fertilisers to the world market would be held in Moscow.Signed last July and renewed twice, most recently in March, the deal unblocked Ukrainian grain shipments that were held up in the country’s blockaded ports last year. The deal will expire on May 18 unless Russia agrees to its renewal.In the latest Ukrainian civilian casualties, three people died and five were wounded when a supermarket in the southern Ukrainian city of Kherson came under fire on Wednesday.According to Ukraine’s ministry of internal affairs, the attack on the “only operating hypermarket in Kherson” happened at around 11am local time.Meanwhile, a round-the-clock curfew is to be introduced in Kherson from 8pm on Friday through 6am on Monday, Kherson governor Oleksandr Prokudin announced.",
        "“During these 58 hours, it is forbidden to move around or stay on the streets of the city. Also, the city will be closed for entry and exit,” Mr Prokudin said.The measure is necessary, he said in a video on social media, “so that law enforcement officers can do their job and not put you in danger”."
    ]
}