{
    "articleURL": "/wires/afp/article-12042451/Russian-captain-2-Georgians-taken-pirates-Gabon.html",
    "content": [
        "The Russian skipper of a US-owned bulk carrier was kidnapped along with two of his officers, both Georgian, when their vessel was attacked by pirates outside a Gabonese port, officials said Wednesday.",
        "The 190-metre (623-feet) Grebe Bulker was attacked on Monday night as it was moored off Owendo, a port on the southern tip of the capital Libreville, a Gabonese judicial source said, speaking on condition of anonymity.Gabon lies on the edge of the Gulf of Guinea, which remains a hotspot for maritime robbery and ransom kidnapping of seafarers despite a global decline in piracy.The captain and the ship's second and third officers \"were taken away by unidentified men,\" the source said.The Grebe Bulker's owner is a US firm, Eagle Bulk Shipping Inc., although the vessel is flagged in the Marshall Islands.Concurring sources said the Grebe Bulker was empty at the time, and was waiting to pick up cargo in Gabon. The West African state is a major exporter of minerals, especially manganese.A Gabonese patrol vessel intervened, saving 17 members of the crew, but the pirates fled with the captain and the two officers, they said.An international maritime official, who asked not to be identified due to \"sensitivities,\" confirmed that three crew members were missing and that the Gabonese police were investigating.The French consulate in Libreville said \"three crew members\" of a ship \"anchored off Libreville were kidnapped on the night of May 1,\" describing it as an \"act of piracy.\"",
        "The latest attack is exceptional for Gabon, given its proximity to the capital.- Vast area -Last month, the International Maritime Bureau (IMB), an agency that monitors piracy, said the number of reported attacks globally in the first three months of 2023 was the lowest for the quarter since 1993.It documented 27 incidents over the first quarter compared with 37 for the same period in 2022.There were five attacks in the Gulf of Guinea in the first quarter of 2023, compared with eight in the same period in 2022 and 16 in 2021.The Gulf of Guinea is a vast shipping route that stretches 5,700 kilometres (3,500 miles) from Senegal to Angola.Many attacks in recent years have been carried out by Nigerian gangs who strike out in speed boats from coastal hideouts to raid vessels close by.But some gangs have also captured larger fishing vessels, using them as a \"mothership\" enabling them to carry out raids further from their base.Their violence and sophisticated tactics prompted pleas from shippers for a more robust foreign naval presence.On March 25, a Danish-owned Liberian-flagged oil tanker named the Monjasa Reformer was boarded by pirates off the Republic of Congo.The vessel was spotted five days later by a French naval drone. It had been abandoned by the pirates, who made off with six of the crew, the French defence ministry said."
    ]
}