{
    "articleURL": "/wires/reuters/article-12057183/Artetas-video-nasty-helped-fire-Arsenal-win-Newcastle.html",
    "content": [
        "NEWCASTLE, England, May 7 (Reuters) - Arsenal manager Mikel Arteta said he played a video of his side's bitter defeat at Newcastle United a year ago before their vital 2-0 Premier League win at St James's Park on Sunday.",
        "The flimsy defeat on Tyneside last May wrecked Arsenal's chances of finishing in the top four as they were squeezed out by arch-rivals Tottenham Hotspur for a Champions League spot.This time, however, Arsenal turned the tables on Newcastle in impressive fashion to stay firmly in the hunt for their first title since 2004 -- Martin Odegaard and a Fabian Schar own goal sealing the points to cut Manchester City's lead to one point.\"We had to feel it. It wasn't enough just to talk about it. Not just the players but the staff as well. That feeling that we didn't do enough that day,\" Arteta, who made his players watch the Amazon documentary All or Nothing, shortly before leaving their pre-match hotel, told reporters.\"The word was pain and then the desire for revenge. When you have question marks you have to resolve them.\"When you have the emotions we had last year you have to feel them again, realise how nasty they are and approach the game differently. The boys did that well.\"Goalkeeper Aaron Ramsdale epitomised Arsenal's steel, making several world class saves at crucial moments.He said the collective memory of what happened at Newcastle last year had been a massive motivation.\"Immense pride and relief, especially after what happened here last year,\" Ramsdale said.",
        "\"It wasn't mentioned up until the meeting before we left the hotel. The manager showed us the video of the documentary and we had a burning desire that it wouldn't be the same today.\"With City winning for the 10th league game in a row on Saturday to open a four-point lead, the pressure was piled on Arsenal ahead of the clash at Newcastle.But the victory means they stay hot on the heels of Pep Guardiola's side, even if they have played a game more.\"Last year here was one of the toughest days of my career, to be honest,\" captain Odegaard said.\"After dropping points against Man City, to win against Chelsea and then come here and win shows the mentality.\"We have to keep going and digging in and fight until the end. It is football, anything can happen. We need to be ready.\" (Reporting by Martyn Herman)"
    ]
}