{
    "articleURL": "/news/article-12038367/Letter-Lucy-Letby-wrote-parents-baby-girl-murdered-shown-court.html",
    "content": [
        "Lucy Letby is accused of murdering seven babies and attempting to kill 10 othersThe ex-neonatal nurse told the court today that she had not harmed any childrenLucy Letby wrote a card to the parents of a baby girl she is accused or murdering, telling them 'there are no words to make this any easier,' her trial heard.",
        "The note, an apparent sympathy card in which she apologised for not being able to be 'there to say goodbye', was shown to Manchester Crown Court today.Photographs of her untidy bedroom in Chester were also shown to the jury during her trial over the alleged murder of seven babies.Letby, 33, was arrested at her three-bedroom home two years after she was moved off the neo-natal unit at the Countess of Chester Hospital, following suspicions she had harmed babies in her care.The court heard officers discovered four notes, in scrawled handwriting, which contained declarations of love for a doctor she worked with, names of some of the babies she is accused of murdering and desperate comments, including 'help me' and 'kill me' inside a handbag and diary in the room.Letby is alleged to have murdered five boys and two girls, and attempted to murder another five boys and five girls, between June 2015 and June 2016. She told the court today that she had not harmed any children. ",
        "Letby wept in the witness box at her trial today as she repeatedly denied murdering seven babies and attempting to murder a further ten while working as a neonatal nurse at the Countess of Chester Hospital.Wearing a black trousers and a fitted blazer, her mousy brown hair lying flat against her shoulders, she occasionally dabbed at her eyes with a tissue. On occasion she sobbed in answer to her barrister, Ben Myers KC, and at times her voice dropped to a whisper.",
        "She estimated she will have looked after 'hundreds' of babies during the 12 month period she is alleged to have turned to murdering some of the infants in her care.Asked whether she had done anything to cause deliberate harm to the babies, she replied: 'I only ever did my best to care for them. That's completely against being what being a nurse is. I'm there to help, not to harm'.Letby, originally from Hereford, is accused of carrying out a spree of murders between June 2015 and 2016.Sitting in the witness box flanked by two women prison officers, she saw her removal from the neonatal unit in the early summer of 2016 as 'a life-changing' moment because it took her away from colleagues she saw as friends.As well as causing her to question 'everything about myself', it drove her to consider taking her own life.Letby said she first learned of the allegations against her in a letter from the Royal College of Nursing – just as she was putting in a grievance against the NHS Trust she had worked for since January 2012.'It was sickening,. I just couldn't believe it. I don't think you can be accused of anything worse than that…Yeah, I was just devastated…I just changed as a person. My mental health deteriorated. I felt isolated from my friends and family on the unit'.",
        "Hospital managers advised her not to communicate with colleagues other than three she identified as two women nurses and a registrar – the man she revealed in her notes as the person she loved.Letby briefly closed her eyes as she revealed that she found it impossible to sleep without medication. She had also been on anti-depressants since the time of her first arrest in July 2018.She went on: 'I didn't want to live…I thought of killing myself'.Mr Myers asked: 'Had you done anything wrong?''No,' she whispered in reply.The nurse broke into a sob as she acknowledged that her mental health had got progressively worse.She was no longer the person she had been, and her life had changed 'completely'. 'The hopes that I had for the future…Everything has just gone'.Letby revealed that she had been detained in four different prisons since her third arrest in November 2020. She had a three-hour return journey on each day of her trial, which is now in its 26th week.The nurse's father, David, was staying with her when police first called at her home – a semi-detached house less than a mile from the Countess of Chester Hospital.'There was a loud knocking at the door at 6 in the morning. They told me I was being arrested for multiple counts of murder and attempted murder. They quickly handcuffed me and took me away'.",
        "She was at her parents' home in Hereford when police next arrested her on June 10, 2019. 'It was a mirror image of the time before, with loud banging at the door. It was the most…the scariest thing I'd ever been through'.She had felt similarly frightened at the time of her third arrest in 2020. The three experiences had left her with a sensitivity to noise. She is also 'easily startled' by 'new things or new people'. Doctors have diagnosed her as having PTSD.",
        "Mr Myers took Letby through some of the notes the jurors have been shown during her trial at Manchester Crown Court.She explained that the way she scribbled down thoughts was something she had always done. 'That's way of dealing with things,' she said. 'I never throw anything away. Everything is just kept'.She said she had written the expression 'Not good enough' because 'that's the overwhelming thought I had about myself at the time, because of the way people had made me feel'.Mr Myers asked whether she had done anything wrong ' to hurt any babies'.'No,' she told him. She felt an immense sense of responsibility, that she might have been 'incompetent or done something wrong that had harmed children'.Letby's notes sometimes appear as a jumble of words crammed onto a single sheet of paper. At one point she read out one particular line, identifying it as 'There are no words…I can't breathe…I can't focus…Overwhelming fear and panic'.",
        "She said she had written it not because she had done anything wrong, but because it was the way she felt at the time.",
        "In another note Letby had written 'I'm an awful person. I pay every day for that right now'.She explained: 'At that time I did feel I must have been awful - to have made any mistakes. I'd been taken away from the job I loved and accused of things I just hadn't done'.Letby was asked about another message in which she writes: 'Never have children or marry. I'll never know what it's like to have a family'.She explained: 'I couldn't see any future for myself…There were times when I didn't have any hope'.In a further note Letby writes the word HATE in capital letters. 'At the time I did hate myself because I was made to feel I had done something wrong – that I had done something incompetent'.Mr Myers referred her to a note in which Letby wrote: 'I killed them on purpose because I'm not good enough to care for them and I'm a horrible evil person'.She insisted it did not mean she had killed them, but that she had 'somehow failed in my duties, in my competencies'.In another note Letby writes that she doesn't deserve either her parents or two cousins she names as Tom and Matt. The world would be better off without her, she adds.",
        "Elsewhere on a crowded sheet of paper Letby writes the phrase: 'I'm evil. I did this'. Again she explained: 'I felt that if I'd done something wrong I must be such an awful, evil person that I'd made some mistakes and not known'.At one point Letby writes 'Why me?' She told Mr Myers that at the time she didn't understand 'why it was happening to me'. Until that point she had always felt competent and that 'I'd always done my best'.Her job as a nurse had been everything to her. It was massive. 'I always strived to go on every course that I could so I could be the best I could'.She said she had written the notes at a time she was 'really struggling'.",
        "Letby told the court that before her arrest she had regularly gone to salsa classes and a gym, and had met friends socially for meals and drinks.She named her closest friends as four nurses and the registrar with whom she frequently shared Facebook messages.Asked specifically about the registrar, she said he had started working at the unit around September 2015.She had got to know him 'just through working together', but later began meeting him socially.Mr Myers asked whether he was anything more than a friend? 'No, she said. But she then agreed it was a 'close' friendship.She went on: 'He was a trusted friend, yes. Sometimes he would come to my house. Sometimes we would go out for a meal or coffee, or walks'.He had left the Countess of Chester Hospital in the autumn of 2016 and their friendship had 'sort of fizzled out'. He was now a consultant elsewhere in the country.Letby said she and other staff would regularly use their phones whilst at work, though there was a general rule not to use them in clinical areas.Asked about her use of Facebook, Letby said: 'I was always on my phone'. She agreed she had looked for parents on Facebook, but was not the only nurse to keep in touch with families after they had been discharged.She would look up many names 'out of curiosity'. These included colleagues and people she had met at salsa classes. They would be people who were 'just on my mind'.Some of the parents she looked up on Facebook were those of babies not named on the indictment.On June 9, 2015 she had searched not only for the mothers of Baby A and Baby B, but also for three social contacts, two colleagues – Ashley Hudson, a nurse, and David Harkness, a paediatrician, and the mother of a child from the neonatal unit of Liverpool Women's Hospital.The social names would be of people she had met at salsa, met socially in some other context, or else were old school friends.In June 2015 she had carried out a total of 133 Facebook searches. The total for July 2015 was 70, for August 175 and for September 209.Letby said she looked up the names of parents out of 'general curiosity'. It was a 'normal' thing for her and she would do it 'frequently'.One search was for a fundraising challenge to raise money for hospital equipment or a new neonatal unit being planned for the Countess.",
        "The court was shown a photograph of Letby's bed at her home in Chester. It is covered by a duvet bearing the motif: Sweet Dreams.Arranged at the pillow end of the bed are four cuddly toys - Winnie the Pooh, Eyor, a rabbit and a light brown teddy bear.Mr Myers observed that someone must have straightened the bed following her arrest, and suggested it was probably her father. 'Yes,' replied Letby.The alleged killer appeared to becoming increasingly distressed as her barrister went through the photographs. At times she cried. Mr Myers tried to reassure her, saying on one occasion: 'I'll do this as quickly as I can, Miss Letby'.Letby had two cats. When the medical record of one of them appeared on the monitor in front of her, Letby momentarily hesitated before almost sobbing their names: 'Tigger and Smudge'.One of the notes shown to the court contained lyrics from a song by Craig David. They included the line 'Love was all we needed' and 'Time let us down'.It also bears the name of Baby O and Baby P, the two identical triplets she is alleged to have murdered, together with that of their surviving brother.Mr Myers asked if there was any reason for their names appearing there. She replied: 'I was thinking of them at the time'.",
        "The name of the male registrar is scrawled a number of times across the pages. 'He wsas a trusted friend at that time,' she explained.She also names Catherine de Berger, 'the lady I was seeing from occupational health'.,In a second reference to the two dead triplets, she writes: their names and adds 'Today is your birthday but you aren't here. So sorry for that'.Mr Myers asked: 'What is it that's making you sorry'.Letby replied: 'I think this was on their anniversary and I was thinking of them'.She also wrote of the two infants: 'I'm sorry that you couldn't have a chance of life, and sorry for the pain that your parents must experience every day.'We tried our best and it wasn't enough. I don't know if many people will be thinking of you today, or any day, but I will. I will always remember'.She said the 'us' in the note referred to herself and the rest of the medical team.How had she been feeling about the dead triplets? She whispered: 'I was distraught, really'.She confirmed the references to O and P written at a time just after she was being blamed for deaths on the unit.Asked to explain the word HELP in capital letters, she replied: 'I just wanted someone to help me, and at that point no one could help me…It was just devastating and it changed my whole life'.Letby said the word B******S in capital letters referred to the two consultants the court has heard became suspicious of her.Mr Myers asked: 'Was that directed at anyone in particular? Who?'Letby replied: 'Ravi Jayaram and Steve Brearey'.Mr Myers: 'Why did you say that about them?'Letby: 'Because of the things they'd been saying about me'.",
        "Elsewhere in her notes Letby wrote the name of Karen Rees, the hospital's director of nursing. The neonatal nurse said of her: 'She was my main support during the time when I was re-deployed'.At one point she has drawn a pink love heart. On the other side of the page is the word 'Love'. Asked why she had written it, she replied: 'I'm assuming it's the love of the people that are important to me'.Letby's 2016 diary includes reference to her having lunch with friends at a Cheshire pub on March 8, and to going to see the singer-songwriter at a concert two days later. She stayed at 30 James Street Hotel.The alleged killer viewed her new house with her parents on March 13, and went to a salsa class on March 19.By March 26 she was in her home town of Hereford, meeting up with old school friends for a meal with old school friends.She moved out of her staff accommodation on the hospital complex on April 5. Three days later she writes: 'LD twins'. The initials denote a long day shift, the second part of the note is a reference to a set of twins in the indictment.Earlier, Mr Myers gave the number of Facebook searches carried out by Letby for the rest of 2015 and for 2016.She made 173 searches in October, 277 in November and 211 in December. In 2016 she made 199 searches in January, 178 in February, 211 in March, 168 in April, 164 in May and 233 in June.Mr Myers said the prosecution was alleging that she made searches for the parents of babies she had hurt. 'Is that what it's about?' he asked Letby. 'No, it's not', she replied.She confirmed that in the whole of May 2016 she had made only one search for the mother of Baby I, and that had been on May 29.Was there any sinister reason for the search? 'No, it's just curiosity', said Letby.There are photographs of Letby's cousins and two god-children in her home. A 'Daily Telegraph'-style novelty card refers to her parents attending the Hay Festival.A rose has been set to climb a trellis in Letby's garden. A second trellis has been adorned with coloured lights.There are heart motifs on the place settings on her dining table, while on the landing she has placed ornaments depicting Snow White and the seven dwarves.",
        "Mr Myers asked Letby if she had ever tried to kill any of the babies she had cared for. 'No, she replied.Had she ever tried to intentionally harm them as was being alleged? 'No, never,' she said.She gave the same responses when asked whether she had introduced air intravenously or else forced it down a nasogastric tube.Had she done so with the intention of killing a baby? 'No,' said Letby.Or for any other reason? 'No', came the reply.The alleged killer also denied having used insulin to harm babies, or to physically assaulting them.Finally, Mr Myers asked: 'What did you want to do for the babies you were looking after'.Tearfully, Letby replied: 'To care for them. To do my best for them. To help them'.The trial is due to resume on Friday."
    ]
}