{
    "articleURL": "/tvshowbiz/article-12058549/Inside-Miranda-Kerr-Evan-Spiegels-son-Harts-fifth-birthday-party.html",
    "content": [
        "Miranda Kerr has shared sweet photos from her son Hart's fifth birthday party. ",
        "The Australian catwalk star, 40, took to Instagram to post pictures of the balloon-filled backyard at the Los Angeles mansion she shares with her husband Evan Spiegel, and a very impressive Lego-themed cake which she baked herself.The balloons featured a rainbow, sun and, of course, a heart. The supermodel paid tribute to her little one in the caption of the snaps, writing: 'Happy 5th birthday to our darling Hart.' She continued: 'We are so proud of what a kind and smart boy you are. We can't wait to see all the wonderful things you will discover and learn this year. Love you with all our hearts.' ",
        "Miranda opened up to Vogue Australia about all things motherhood for the magazine's August issue last year.She admitted she didn't think she'd return to modelling after the birth of her first child Flynn in 2011, but was 'grateful my body was able to come back'.The mother of three added: 'I still don't feel like I'm back to where I was before the babies. But I'm content with that.'My body is different and it has changed, and I'm embracing that.'Miranda and her Evan, the founder of social media app Snapchat, share two sons: Hart, and Myles, three.",
        "She also shares son Flynn, 12, with ex-husband Orlando Bloom.",
        "In the accompanying interview, the couple opened up about their plans to expand their family.'I just love being a mother and I always wanted three boys, so I feel really blessed that I have three healthy boys. I feel like I'm open, so we'll see what God decides,' she said.Miranda and Evan first met at a Louis Vuitton event in 2014.",
        "They were officially dating by 2015 and they got engaged the following year before tying the knot in May 2017.'It was lovely to find someone who appreciated my kind heart and joyful spirit,' she said of her partner in LVR magazine.Miranda was previously married to Hollywood actor Orlando, whom she started dating back in 2007.They married just a month after getting engaged in June 2010, but announced in October 2013 they were getting divorced."
    ]
}