{
    "articleURL": "/wires/reuters/article-12052255/AI-pioneer-says-threat-world-urgent-climate-change.html",
    "content": [
        "By Martin Coulter",
        "LONDON, May 5 (Reuters) - Artificial intelligence could pose a \"more urgent\" threat to humanity than climate change, AI pioneer Geoffrey Hinton told Reuters in an interview on Friday.Geoffrey Hinton, widely known as one of the \"godfathers of AI\", recently announced he had quit Alphabet after a decade at the firm, saying he wanted to speak out on the risks of the technology without it affecting his former employer.Hinton's work is considered essential to the development of contemporary AI systems. In 1986, he co-authored the seminal paper \"Learning representations by back-propagating errors\", a milestone in the development of the neural networks undergirding AI technology. In 2018, he was awarded the Turing Award in recognition of his research breakthroughs.But he is now among a growing number of tech leaders publicly espousing concern about the possible threat posed by AI if machines were to achieve greater intelligence than humans and take control of the planet.\"I wouldn't like to devalue climate change. I wouldn't like to say, 'You shouldn't worry about climate change.' That's a huge risk too,\" Hinton said. \"But I think this might end up being more urgent.\"He added: \"With climate change, it's very easy to recommend what you should do: you just stop burning carbon. If you do that, eventually things will be okay. For this it's not at all clear what you should do.\"",
        "Microsoft-backed OpenAI fired the starting pistol on a technological arms race in November, when it made AI-powered chatbot ChatGPT available to the public. It soon became the fastest-growing app in history, reaching 100 million monthly users in two months.In April, Twitter CEO Elon Musk joined thousands in signing an open letter calling for a six-month pause in the development of systems more powerful than OpenAI's recently-launched GPT-4.Signatories included Stability AI CEO Emad Mostaque, researchers at Alphabet-owned DeepMind, and fellow AI pioneers Yoshua Bengio and Stuart Russell.While Hinton shares signatories concern that AI may prove to be an existential threat to mankind, he disagreed with pausing research.\"It´s utterly unrealistic,\" he said. \"I'm in the camp that thinks this is an existential risk, and it´s close enough that we ought to be working very hard right now, and putting a lot of resources into figuring out what we can do about it.\"In the European Union, a committee of lawmakers responded to the Musk-backed letter, calling on U.S. President Joe Biden to convene a global summit on the future direction of the technology with European Commission President Ursula von der Leyen.Last week, the committee agreed a landmark set of proposals targeting generative AI, which would force companies like OpenAI to disclose any copyright material used to train their models.",
        "Meanwhile, Biden held talks with a number of AI company leaders, including Alphabet CEO Sundar Pichai and OpenAI CEO Sam Altman at the White House, promising a \"frank and constructive discussion\" on the need for companies to be more transparent about their systems.\"The tech leaders have the best understanding of it, and the politicians have to be involved,\" said Hinton. \"It affects us all, so we all have to think about it.\" (Reporting by Martin Coulter, editing by Deepa Babington)"
    ]
}