{
    "articleURL": "/news/article-12039349/Bombshell-report-Hunter-helped-business-team-gain-access-VP-Joe-Biden-2011.html",
    "content": [
        "Emails revealed by Fox show Hunter Biden helped facilitate a meeting in 2011 between his then-Vice President father and three business associates In exchange for the meeting with the associates, one of whom was a foreign national, Hunter and his associates were promised lucrative business deals The latest is another claim of influence peddling by Hunter to enrich the BidensHunter Biden facilitated a meeting at the White House between business associates and his father in 2011, according to newly revealed emails between President Joe Biden's son and his business associates.",
        "Then vice-president Biden and his deputy chief of staff at the time, Alan Hoffman, engaged in a meeting with three business associates of Hunter's, one of whom was a foreign national, according to new emails.The latest revelations is just another in a series of shocking reports involving the president's son and his foreign business deals and influence peddling. Hunter is under several investigations, most stemming from his abandoned laptop, which had slews of damning information that investigators claim could prove he used his father's office to enrich himself and his family.Emails obtained by Fox News Digital shows Hunter Biden organizing the meet-up around the time he was trying to secure a deal with the business associates who attended the White House meeting.If Hunter were able to secure the meeting between the associates and his father – the vice president – it could lead to a bonds deal worth billions.",
        "It is unclear whether the deal was executed after the meeting took place in the summer of 2011 or if they profited from the gathering.White House visitor logs confirm the meeting took place.Hunter Biden, 53, and his business partner Devon Archer, co-founder of Rosemont Seneca Partners (RSP), were in talks in June 2011 with future CNBC 'The Deed' co-host Sean Conlon about a potentially lucrative opportunity.",
        "All Hunter had to do, according to the emails, was set up a meeting with his father and two of Conlon's associates, Andre Lassere and 'Wang,' identified as Xi Wang in White House visitor logs.Conlon forwarded an email from American energy executive David Gamperl with a contract from Nagi Ghawi, who was chairman and president of since-dissolved Mercantile Investment Group in the West Indies, presenting a 'real business model' to make a 'substantial profit.'The contract, Gamperl told Conlon in a June 22, 2011 email, is 'proof of funds' where they could make 'between $230 and $380 million,' which he claimed could 'open up the flood gates on 29 other bonds that have… much more value.'Despite forwarding this email to Hunter and Archer, Conlon told Fox News in a Monday email: 'I know Absolutely nothing about that.'Ghawi told Fox News Digital in an email on Tuesday that he asked Conlon and Gamperl to organize the meeting with then-Vice President Biden or President Barack Obama because it was 'their role as representative of the United States of America and not in their personal capacity.''Mr. Sean Conlon and Mr. David Gamperl have good relation [sic] with Hunter Biden so it was easier for them to organize a meeting with the VP Biden,' he said in the email.",
        "In June 2011 email exchanges, Conlon wrote to Hunter Biden: 'So we have engagement letter if they get other 10 bonds they have a face value of 10b… We need to get these guys to an event or something where they get to just formally meet your Dad. For follow on they can talk to Chief of Staff. Let me know how soon we can do that. [Very] brief. If Nagi gets that done we get more bonds to move.'",
        "That same day, Gamperl emailed Conlon, Ghawi and another Conlon business associate, Benjie Burford, detailing more of the potential profits from the deal.'[T]he face value is over $21 billion, as each bond is worth over $2.1 billion (this could vary as it depends on each bonds series, etc...),' he wrote. 'We can employ a couple of different strategies in generating profits, which would yield revenue of 22% to par of the face value.'Conlon forwarded Gamperl's email to Hunter and Archer.Hunter's first reaction to the suggestion of a meeting was shock.'WTF is he talking about. Mtg with JRB chief of staff????' Hunter said, replying to just Archer and referencing his father by his initials.'I guess,' Archer replied. 'I don't think he understands how this works. I will advise him to stand down.'",
        "'Tell him I'll do the mtg,' Hunter said, quickly changing his tune.'Roger that.'Archer replied to both Conlon and Hunter to say he was interested in the deal, but found it difficult to see working out the meeting with the vice president.'No I agree,' Conlon wrote to Hunter and Archer. 'I ignored them first few times they were introduced to me. Then my friend was holding the first Bond at his bank and he called me to verify it is real. Now that doesn't mean we can get them sold but its a free look.'He added: I guess all we need to figure is a 5 min introduction not a meeting in the next week otherwise the guy who flew over from Paris for event in Chicago will not provide the rest of bonds as he is sulking!'",
        "The same day, Ghawi emailed Conlon to inform him that Lasserre and Wang were in Washington D.C. and it was 'extremely crucial and extremely urgent' to set up a meeting with them and 'the Chief of Staff or VP or Both.''This is the only possible outcome possible for all of us. Let us have a conference call to manage this,' he added.Hunter said there was no 'chance in hell' that the meeting would happen with such short notice and made note that Wang's foreign national status could create even more of a headache to get him through the Secret Service.",
        "'Sorry buddy not a chance in hell either is happening,' Hunter wrote. 'Give me more then hours notice then maybe- but they are in middle of debt ceiling negotiations (I.e. Fate of world economy), defending 'Biden Afghanistan Policy' and whatever else.''Beyond thy (sic) anyone who enters WH for a meeting has to be vetted by Secret Service and WH legal team which typically takes about one week- longer for a foreign national. I can meet with them myself but the other is not happening,' he continued.'Hey fair answer. I am sitting in tuscany with Devon.! I will formally organize thru u. Enjoy your weekend,' Conlon replied.Hunter and Gamperl had a meeting on June 26, 2011 at 'Al Grocery 12 20 Long beach, and appeared to speak several times by phone in following days.Gamperl met with VP Biden's deputy chief of staff Alan Hoffman on July 3, 2011 at an unknown location. It appears Lasserre was also present at the meeting, according to Fox.On July 27, 2011, Hoffman met with Gamperl, Wang and Lasserre at the Old Executive Office Building, according to White House visitor logs.The three business associates were at OEOB for about 30 minutes, arriving shortly before 5 p.m. and leaving shortly before 5:30 p.m., according to the logs, despite Conlon saying they only needed a '5 min introduction.'",
        "While the emails underscored the importance of a speaking with Biden for the deals to go through, Ghawi said he was 'not informed nor briefed' about the White House meeting.He also claimed: 'No business and no transaction was done with Mr. Hunter Biden, nor the VP Biden' even though the emails talk about 'substantial profit.'"
    ]
}