{
    "articleURL": "/wires/reuters/article-12050449/Sterling-hits-one-year-high-Bank-England-decision-nears.html",
    "content": [
        "By Harry Robertson",
        "LONDON, May 5 (Reuters) - The pound rose to just shy of a one-year high against the dollar on Friday, and to a one-month high against the euro, as traders eyed the Bank of England's interest rate decision next week.Sterling was up 0.21% at $1.26 on Friday, after reaching $1.263 earlier in the session, the highest since late May last year.The euro was down 0.14% against the pound at 87.49 pence, after earlier falling to 87.42 pence, the lowest since April 6.The pound has received a boost from the U.S. Federal Reserve meeting this week, analysts said, when the central bank raised rates by 25 basis points but signalled that it may stop there. U.S. employment data, out at 1230 GMT on Friday, will provide clues as to the Fed's likely next move.By contrast, many analysts think the Bank of England will have to keep raising rates, given that inflation is much stronger in Britain - running at 10.1% year-on-year in March, compared with 5% in the United States.\"The Fed dropping some of the hawkish language from its statement this week allowed markets to solidify their view that this is the end of the hiking cycle in the U.S.,\" said Joe Tuckey, head of FX analysis at broker Argentex. \"Sterling has been able to capitalise on this.\"",
        "When interest rates look like they're going to rise in one country but stay flat in another, it can make investments in the former country look more attractive, potentially boosting the currency.A stronger-than-expected, although still lacklustre, economy has also supported the pound. Economists have been on recession watch, but one is yet to materialise, in part because of a drop in energy prices.Meanwhile, a rapid slowdown in U.S. inflation and the Fed approaching the end of its hiking cycle has sent the dollar down against a range of currencies.The dollar index, which measures the U.S. currency against its major peers, was down slightly on Friday and was 0.34% lower for the week.Sterling's perkiness against the euro can also partly be explained by the outlook for central banks, said Chris Turner, global head of markets at ING.The European Central Bank on Thursday raised rates by 25 bps, a step down in the pace of monetary tightening. Euro zone inflation has also cooled quicker than Britain's.\"Sterling is doing better. Part of that owes to the ECB, which was less hawkish than expected and that took some of the steam of the euro,\" Turner said.Traders broadly expect the Bank of England to raise rates by 25 basis points to 4.5% on Thursday next week, according to pricing in derivatives markets.",
        "They then see rates climbing to a peak of around 4.8% later in the year.Dominic Bunning, head of European FX research at HSBC, said the pound could rise to around $1.30 later in the year.\"This is not a story of an absolute positivity,\" he said. \"We're not looking for much, much bigger gains here.\"(Reporting by Harry Robertson, additional reporting by Dhara Ranasinghe. Editing by Jane Merriman)"
    ]
}