{
    "articleURL": "/tvshowbiz/article-12043397/The-TWO-new-Gladiators-REVEALED-ahead-iconic-shows-reboot-23-years.html",
    "content": [
        "The first two new Gladiators of the rebooted series have been revealed.",
        "The iconic show, which originally aired on ITV from 1992 to 2000, is making an epic return to screens after 23 years, with the new series being shown on BBC. And ahead of its big return, Fury and Steel have been announced as the first two 'superhumans' joining the line-up as they prepare to take on the brave contestants.Professional Exeter Chiefs Rugby Player, Jodie Ounsley, has joined the line-up as her alter-ego ‘Fury’, named thanks to her power and passion for competition.And Jodie certainly has the credentials to follow in the footsteps of the mighty Gladiators as she's a former England Women’s Rugby Seven’s player, a Brazilian Jiu Jitsu British Champion and five times World Coal Carrying champion.",
        "While Jodie, who is profoundly deaf and wears a cochlear implant, won the title of Deaf Sports Personality of The Year in 2020.Meanwhile, the sportswoman has Gladiators in her blood as her father was a contender on the show back in 2008, and she has been training to outdo him ever since. Jodie is a longtime Gladiators fan, even dressing up as a Gladiator and practicing the games in her living room! Sharing her excitement at joining the show, Fury said: 'Watching Gladiators growing up I was always in awe of their strength and power and now I am one!",
        "'I hope contenders are ready to feel the Fury!' Meanwhile, joining Jodie's Fury is UK CrossFit star Zack George, who's set to intimidate the contestants as his alter-ego Steel.Like Jodie, Zack is a pretty tough cookie, having won the title of the UK’s Fittest Man in 2020, and also ranked number 26 out of a whopping 126,461 on the global CrossFit leader board! So it's little wonder his unbreakable strength has earned him the name ‘Steel’.",
        "After undertaking his own personal fitness journey as a teenager, Zack was motivated to then help people with their fitness. And as Steel, he hopes that he can inspire a new, young generation of fans to get into fitness as well. Opening up about becoming one of the new generation of Gladiators, Steel said: 'I was inspired by the Gladiators as a child, but never imagined I’d be physically fit enough to be considered a ‘superhuman’! 'I hope a new generation of fans will look up to me as their new strong, unbreakable hero, Steel.'With Fury and Steel ready and geared to showcase what they've got, the contenders had better beware!The two new Gladiators come after the hosts of the reboot show were revealed.Bradley and Barney Walsh will present the BBC show, their latest television project together after The Larkins and travel show Bradley &amp; Barney Walsh: Breaking Dad.",
        "They are taking over the series after it was originally presented by Ulrika Jonsson  and John Fashanu on ITV from 1992-2000.The new series will feature some of the classic challenges including Duel, Hang Tough and The Eliminator as well as some surprise new tasks. Gladiators was always an important show for the Walshes as Donna, Bradley's wife and Barney's mother, used to choreograph the cheerleaders.Chase presenter Bradley even appeared on a celebrities vs jockeys Gladiators special in 1997.The father and son regularly visited the original set- and a young Barney took some of his first steps on the floor of the arena.",
        "Bradley said: 'Wow! I can't believe that I've been asked to be part of this iconic show. I used to sit backstage, or in the audience, every week watching my wife be part of this juggernaut and now I get to co-host a new version of Gladiators!!! 'Saturday night family entertainment at its best...Are you ready?!'",
        "Barney said: 'Gladiators has been a massive part of our family and it's an honour to be asked to co-host this iconic show. 'I'm so excited for everyone to see the spectacle, elite athletes and fantastic family entertainment that is Gladiators.'The show's new logo for the 11-part series keeps all the same elements as the original one, with a metal G in the shape of a triangle behind the title.",
        "But with a pop more colour, the new graphic features a red and blue outline and metallic shining colouring.The BBC has revealed that filming will take place in and around the spring school holidays at the Utilita Arena, Sheffield but has yet to announce the date it will air.Dan Baldwin, the Managing Director of production company Hungry Bear explained: 'Watching Gladiators LIVE in the arena is the perfect day out for all the family. 'Being close-up to the action is going to be an incredible experience like no other.'Plus, we're making the tickets free, so it won't cost you a penny to get in!'The original Gladiators aired on ITV from 1992-2000 and was adapted from American Gladiators which was syndicated between 1989 and 1996.American Gladiators was created by Johnny C. Ferraro and Dan Carr and developed by Johnny C. Ferraro.  "
    ]
}