{
    "articleURL": "/wires/reuters/article-12052687/Heat-upbeat-Jimmy-Butler-practices-ahead-Game-3-vs-Knicks.html",
    "content": [
        "Jimmy Butler's ailing right ankle may be the biggest factor in the lead-up to Saturday afternoon's Game 3 of the Eastern Conference semifinal matchup between the New York Knicks and the host Miami Heat.",
        "Butler sprained his ankle late in the Heat's 108-101 victory in the series opener on Sunday. Butler missed Game 2, and New York took advantage by recording a 111-105 win.By the time Game 3 tips off, Butler will have had five full days of rest and treatment since his injury. He did \"work\" in Friday's practice, Heat head coach Eric Spoelstra said, adding \"We know what his intentions are.\"\"As a guy who knows how competitive (Butler) is, I would be optimistic,\" Heat guard Kyle Lowry said.\"But who knows? We'll see what happens on Saturday.\"In the regular season, the Heat had three players average at least 20 points per game -- Butler (22.9), Bam Adebayo (20.4) and Tyler Herro (20.1). But Herro is out for the rest of the series due to a broken hand, and Butler is injured, putting in doubt the availability of a player who is averaging 35.5 points, 6.8 rebounds and 4.7 assists in the playoffs.Since the injury, though, Butler has been easy to find.\"Every time I've seen him, he's been getting treatment,\" Heat power forward Kevin Love said. \"It's a good sign he's not limping too much.\"Knicks coach Tom Thibodeau was asked if he will prepare for Butler's return on Saturday.",
        "\"You already know the answer to that,\" he said. \"We will.\"Thibodeau said he feels good that he has seen Miami's plan with and without Butler in the first two games of the series. Without him, Miami's offense recorded 10 more attempts from 3-point range in Game 2.As for the Knicks, point guard Jalen Brunson answered a 25-point performance in the series opener with a 30-point effort in Game 2.However, Brunson's 3-point shot has been key. In the Knicks' series-opening loss, Brunson misfired on all seven attempts from beyond the arc. On Tuesday, he made 6 of 10 attempts from 3-point range.\"Jalen was fantastic,\" Thibodeau said. \"It's who he is -- great leader, great toughness.\"New York's top-three scorers during the regular season were Julius Randle (25.1), Brunson (24.0) and RJ Barrett (19.6).Randle missed the opener of this series due to a left ankle injury. In Game 2, he collected 25 points, 12 rebounds and eight assists.Barrett is averaging 25.0 points in this series.The Knicks' group of role players includes Josh Hart, who was spectacular in Game 2 with 14 points, 11 rebounds and a game-high nine assists.Hart fell one assist short of what would've been the Knicks' first playoff triple-double since Walt Frazier in Game 1 of the 1972 NBA Finals.",
        "\"My game is to have fun,\" Hart said, \"to play carefree basketball.\"Guard Immanuel Quickley, New York's sixth man, is just 1-for-8 on 3-pointers in the series.But the Knicks have gotten production at center. In 47 combined minutes in Game 2, Mitchell Robinson and backup Isaiah Hartenstein combined for 14 rebounds, including seven on offense.In fact, New York outworked Miami by nine rebounds in Game 1 and by 16 boards in Game 2.\"Rebounding is always key,\" Hartenstein said. \"But we weren't physical enough in Game 1.\"--Field Level Media"
    ]
}