{
    "articleURL": "/news/article-12052679/Los-Angeles-mansion-tax-frozen-luxury-home-sales-Just-TWO-homes-5-million-sold.html",
    "content": [
        "The newly introduced Los Angeles 'mansion tax' has frozen luxury home sales with just two properties above $5million sold in April, down from 126 in MarchThe policy, which came into effect April 1, sees the city take a four percent cut of home sales above $5million and 5.5 percent on those above $10millionThe two April sales netted the city $528,000 to spend on affordable housing and homelessness prevention programs The newly introduced Los Angeles 'mansion tax' has frozen luxury home sales with just two properties above $5million sold in April which is down from 126 in March. ",
        "The policy, which came into effect April 1, sees the city take a four percent cut of all home sales between $5million and $10million.And for mega mansions that break the $10million threshold, homeowners lose 5.5 percent of their sale price if they decide to cash in on their estate.There were just two homes sold for more than $5million once the new policy was introduced in April, according to the Los Angeles Times. These sales netted the city $528,000 to spend on affordable housing and homelessness prevention programs. ",
        "raced to sell up in MarchThe prices of homes were slashed and frightened sellers offered luxury cars and lucrative bonuses to anyone who could complete the purchase of their properties by the end of March. Now prices have shot back up and there is no longer any incentives to buy the homes, a market slowdown was expected.But the difference between sales in March and April is unprecedented with just two properties worth more than $5million sold in LA last month, according to the Multiple Listing Service.One stunning five bedroom and five bath property in Brentwood sold for $5.7million last week while another five bedroom house equipped with six bathrooms in Venice was bought for $7.5million two weeks ago. The Brentwood home features a private pool, vaulted ceilings and a large flowing indoor-outdoor entertaining space for the ultimate California living.",
        "It includes a living room, family room, and game room with a full bar, two fireplaces, and French doors opening to a private covered patio.And the Venice mansion offers plenty of space for entertaining with a soaring two-story foyer and expansive living, dining, and great rooms, all framed by artful walls of sliding glass.The luxury property contains a fully equipped home theater/media room, wine room, billiard's room, a gym and swimmers pool and spa. The sales from both homes raised $528,000 for the city to use on programs for affordable housing and homelessness prevention as it battles a housing crisis. Measure ULA was once projected to generate roughly $900million per year, based on real estate sales data from 2021 to 2022, when it was on the ballot in November.",
        "But by March, a report from the City Administrative Office lowered estimates significantly down to $672 million from July 2023 to June 2024 in response to the real estate market slowing down due to rising interest rates.And Mayor Karen Bass unveiled her first budget proposal last month with a $13.1billion plan that included $1.3billion to address homelessness although only $150million was attributed to revenue from the new 'mansion tax'. Courts in California are set to rule on to two lawsuits which argue the policy is unconstitutional and if it is found it is, the city will have to pay back all the money it generated from the tax.",
        "Greg Good, a senior advisor on policy and external affairs for the Los Angeles Housing Department, said: 'The $150-million number takes into account the risk of losing litigation, but it’s also reflective of the urgency of the housing and homelessness situation.'This is an amount we feel comfortable that we could refund, if necessary.'We anticipated the market slowing down. It’s logical economic behavior. But it’s still real estate in L.A. Eventually, transactions will get back to normal.' He added that the money brought it can only be spent as it brings in and that the city can't spend any money projected.Those waiting to sell their multi-million dollar homes are hoping the tax rule is scrapped. The Howard Jarvis Taxpayers Association, which is one of the groups which filed a lawsuit against the 'unconstitutional' tax, shared instructions on its website on how to file for a refund if the suit is successful.Compass agent Sally Forster Jones helped a client sell a 1930s mansion in Brentwood for $16.2million before April 1 which saved the seller $891,000.Oron Maher who runs Maher Commercial Realty said most people who are selling properties despite the tax are those who have no choice. He said: 'These are mom-and-pop owners of real estate. People going through death, divorce, partnership dissolutions or retirement who are forced to sell as soon as possible.",
        "'If you don’t need to sell in ULA, you won’t. This will be a tax on people already experiencing difficult situations.'",
        "And he says sellers are raising the prices of homes to cover the tax which is 'leading to less transactions'. Wealthy sellers are reportedly looking at ways to avoid paying the tax altogether including the breaking properties into pieces below the $5million threshold and selling them separately.While Los Angeles officials are hiring six new members of staff to help manage the spending of ULA effectively.The City Council confirmed 15 people will sit on the Citizens Oversight Committee which is a volunteer group that will supervise spending and make program recommendations.LA Community Action Network deputy director Steve Diaz, USC Gould School of Law professor Deepika Sharma and Southern California Association of Nonprofit Housing executive director Alan Greenlee, who worked on the coalition that drafted the policy, are all on the committee. And the group will first convene in early May. Greenlee said: 'I’m excited about the prospect of ULA It creates considerable and ongoing resources that the city can use not only to protect low-income residents so they can stay in their homes, but also creates certainty that there will be resources available for developers to build affordable housing.' "
    ]
}