{
    "articleURL": "/wires/reuters/article-12038293/Tennis-Sabalenka-moves-Madrid-semis-Medvedev-Zverev-ousted.html",
    "content": [
        "May 2 (Reuters) -",
        "Zhang Zhizhen made history at the Madrid Open as he stunned American Taylor Fritz on Tuesday to become the first Chinese player to reach an ATP Masters 1000 quarter-final.The 26-year-old continued his dream run with a 3-6 7-6(5) 7-6(8) defeat of the eighth seed.Women's world number two Aryna Sabalenka survived a scare against unseeded Egyptian Mayar Sherif, losing the opening set before powering back to win 2-6 6-2 6-1.The Belarusian was not at her best and made 37 unforced errors in the match, but the Australian Open champion bounced back midway through the second set to win 10 games in a row.Sherif, who has won one WTA 250 title in her career, was gifted the first game, winning all her points through unforced errors from Sabalenka to break before building a 3-1 lead.The second seed saved a set point at 5-1 but Sherif, playing in her first WTA 1000 quarter-final after beating three seeded players, served out to take the opening set.The Egyptian took the lead in the second set too before Sabalenka, who was a break down, finally found her groove to break four times and force a decider.The 2021 champion then showed no mercy in the third as she raced into a 5-0 lead before Sherif got on the board.",
        "\"Honestly I was just trying to keep fighting and keep playing my game. She played unbelievable tennis. She's a claycourt specialist and I'm very happy with this win,\" Sabalenka said.ZVEREV, MEDVEDEV OUTIn the men's draw, home favourite and defending champion Carlos Alcaraz swatted aside Alexander Zverev 6-1 6-2 in a repeat of last year's final as he surged into the quarters.Top seed Alcaraz was in complete control, especially on serve where he did not face a break point, as he cruised into the quarter-finals where he will face Karen Khachanov.The Spaniard, who turns 20 this week, improved his record on clay to 16-1 this season as he seeks another double on home soil having won theBarcelona Openlast month without dropping a set.But the headlines belonged to 26-year-old Zhang as he made a breakthrough for Chinese men's tennis. The world number 99 said the thought of going so far had not crossed his mind.\"I'll tell you a secret. In practice, I lost 6-0 with (Aslan) Karatsev,\" Zhang said. \"Here everyone is a great player, huge player. They all have some very good results.\"I just try to do the best that I can do.\"Zhang will get another look at Karatsev after he rattled second seed Daniil Medvedev with his powerful groundstrokes to upset his fellow Russian and clinch a 7-6(1) 6-4 win to reach his first Masters 1000 quarter-final.",
        "Karatsev, ranked 121 in the world, has now beaten world number three Medvedev twice in his career with both wins coming on clay. \"I'm feeling great, playing well, I just have to focus every match and be prepared for the next one,\" Karatsev said.After surviving a couple of three-setters, fourth seed Stefanos Tsitsipas made light of Spaniard Bernabe Zapata Miralles in a late-night clash to reach the last eight, the Greek easing through 6-3 6-1. (Reporting by Rohith Nair in Bengaluru and MArtyn Herman in London; Editing by Hugh Lawson and Christian Radnedge)"
    ]
}