{
    "articleURL": "/news/article-12052091/Executives-failed-Republic-face-insider-trading-probe.html",
    "content": [
        "Regulators are probing conduct of First Republic Bank's former executive teamInvestigation reportedly centers on possible insider trading violationsIt's unclear which execs are under scrutiny, and none have been charged Former executives of First Republic Bank are under investigation for their conduct prior to the bank's government seizure and sale to JPMorgan Chase, according to a new report.",
        "The Securities and Exchange Commission is looking into whether any members of the then-executive team of First Republic improperly traded on inside information, Bloomberg News reported on Friday.Regulators seized troubled First Republic Bank early Monday, and JPMorgan agreed to buy majority of its $229 billion in assets, making it the largest US bank failure since the 2008 financial crisis.Although the large stock sales of some former First Republic execs have drawn headlines, was not immediately clear who was under scrutiny in the SEC investigation, and no one previously or currently with the bank has been charged with wrongdoing. An SEC spokesperson told DailyMail.com in a statement: 'The SEC does not comment on the existence or nonexistence of a possible investigation.' ",
        "A spokesperson for First Republic did not immediately respond to a request for comment. Word of the SEC probe came a day after Senator Elizabeth Warren accused First Republic executives of 'mismanagement' in a letter to its former CEO Michael Roffler. The letter raised questions about the failed lender's risk management as well as executive pay and bonuses.'You owe your customers and the public an explanation for the decisions that resulted in the costly failure of your bank,' the Democrat wrote in the letter dated Wednesday, which was made public by her office.",
        "'The primary cause of the collapse...appears to be complacency, incompetency, and mismanagement by you and other bank executives,' Warren said.Roffler has been asked to submit responses by May 17. He could not be reached for comment on Friday.While no First Republic executive has been named as a target of the SEC probe into possible insider trading, the stock sales of several top execs previously drew media scrutiny.In just the past three months, First Republic Bank executives quietly sold nearly $12 million worth of the company's stock, according to the Wall Street Journal.",
        "Executive Chairman James Herbert II sold the most of any of the other insiders, off-loading a whopping $4.5 million worth of shares since the start of the year.In all, four of the struggling bank's top executives sold $11.8 million worth of stock so far this year, at prices averaging just below $130 a share, the Journal found.Some of these sales came just days before the bank started facing liquidity troubles, as panicked investors sought to get their money back following the fall of Silicon Valley Bank and Signature Bank.The Journal found that Herbert made two sales in January and February, worth 7 percent and 5 percent of his holdings in the company, respectively.",
        "At the same time, Robert Thornton, the bank's president of private wealth management sold 73 percent of his outstanding shares for $3.5 million in his first trade since 2021, and CEO Michael Roffler sold nearly $1 million in January after previously offloading $1.3 million worth of shares in November.Chief Credit Officer David Lichtman also sold $2.5 million worth of shares over the course of three sales since 2023 began.The last of those sales came on March 6, just two days before Silicon Valley Bank disclosed it had lost $1.8 billion, triggering a massive bank run that forced SVB to close.",
        "Lichtman and his spouse had already sold another $2.5 million in November and December, the Journal reports, making the most sales over just a five-month period than they ever had previously. None of the filings for the executives' sales indicate they were executed under 10b5-1 plans, which are prescheduled sales designed to protect business executives from accusations of insider trading, the Journal notes.But the trades went largely unnoticed as First Republic is not required to report insider sales to the Securities and Exchange Commission, thanks to a provision of the Securities Act of 1933.Instead, the executives' trades were reported to the Federal Deposit Insurance Corporation, which periodically discloses them on its website. "
    ]
}