{
    "articleURL": "/news/article-12052435/Biden-tells-reporters-hes-holding-major-press-conference-meaning-MSNBC-interview.html",
    "content": [
        "President Joe Biden teased journalists Friday telling them that he would answer their questions later that afternoon at a 'major press conference'The only problem was there was no press conference on the schedule - and nobody in the White House press corps was aware of one was being plannedIt turned out Biden was referring to his sit-down interview scheduled with MSNBC's Stephanie Ruhle later Friday afternoon President Joe Biden teased journalists at the White House Friday telling them that he would answer their questions later that afternoon at a 'major press conference.'",
        "The only problem was there was no press conference on the schedule - and nobody in the White House press corps was aware of one was being planned. In reality, Biden was referring to a sit-down interview scheduled later in the day with MSNBC's Stephanie Ruhle, which will air in full at 10 p.m. Friday night.  While the White House ignored requests for clarification from DailyMail.com and at least two conservative outlets - two 'sources familiar' told The New York Times that Biden was 'referring to his MSNBC interview tonight,' reporter Katie Rogers tweeted.After talking about the job numbers and the debt ceiling stalemate at an Investing in America Cabinet meeting, Biden added, 'I'm doing a major press conference this afternoon, so I love you all, but I'd like to ask you to leave so we can get down to business.' ",
        "'I'll be happy to talk to you about that, but not now,' he answered as reporters shouted questions his way. Acknowledging a question about artificial intelligence he noted 'there are dangers.' 'We'll get a chance to talk about all of those things,' Biden said, dismissing the pool of reporters. After the meeting, he and Vice President Kamala Harris went on a surprise taco run to mark Cinco de Mayo. In the meantime, conservatives on Twitter mocked Biden for confusing an interview and a press conference, as he's been pressed for giving both fewer interviews and press conferences than his predecessors.  ",
        "'The White House is already scrambling to walk this back,' said Republican National Committee Chair Ronna Romney McDaniel. 'Biden's last solo press conference was 172 days ago.' Ruhle's interview with Biden Friday marked his first one-on-one with a television reporter since talking to PBS Newshour in February and the first since announcing his 2024 campaign. ",
        "It's scheduled at a time when many Americans will be out celebrating Cinco de Mayo or going to bed.  A White House official told DailyMail.com that Ruhle's sit-down was 'not a campaign interview.'Instead it was related to the Investing in America Cabinet meeting, which is why it's airing Friday night. The official added that portions of the interview will air earlier on Friday and throughout the weekend. The network said Biden's conversation with Ruhle would be 'wide-ranging.'They will discuss 'the administration's infrastructure agenda, the 2024 campaign and recently announced reelection bid, the shaping GOP field, looming debt ceiling crisis, and more,' a press release from the network said. Biden, 80, made his reelection bid official last Tuesday by releasing a video. Since then, he has yet to hit the campaign trail - and spent most of this week out of the public eye. ",
        "The president and first lady hosted a state dinner for South Korean President Yoon Suk-yeol last Wednesday - where Biden did participate in a traditional bilateral press conference, where leaders answer questions from two chosen journalists from each country. ",
        "On Saturday night, Biden attended the White House Correspondents' Dinner, where he was pressed by White House Correspondents' Association President Tamara Keith to be more accessible to reporters.'Every president privately and sometimes publicly bridles at his news coverage. And yet they invite us in and take our questions,' Keith said. 'Though, sir, maybe not as many as we would like,' she said, turning to Biden, who was seated nearby on the dais. Two weeks ago, The New York Times called Biden's press shyness a 'deliberate strategy' noting that in the 100 years since President Calvin Coolidge took office only Republican Presidents Richard Nixon and Ronald Reagan held as few news conferences as Biden. He's yet to do a sit-down interview with an American newspaper. Overall, before Friday's meet-up with Ruhle, he'll have done 54 interviews.By comparison former President Donald Trump did 202 interviews during his first two years in office, while former President Barack Obama sat down for 275 interview, The Times said. Asked Wednesday what the president was up to, as he hadn't been seen in nearly 48 hours, White House press secretary Karine Jean-Pierre said, 'he's been meeting with - having internal meetings in the Oval Office.' 'I had a meeting with him earlier today with his senior - senior advisers, senior staff, talking about the issues that matter to the American people,' she told reporters. ",
        "'It's not unusual. This is something that he does every day. And like you said, you'll see him later this evening. There'll be press available for the toast the president is going to - is going to give,' she said, referencing a Wednesday night dinner the White House was hosting. 'It's going to be, as you know, an open press avail at the top. And you'll get to see the president then,' Jean-Pierre said. "
    ]
}