{
    "articleURL": "/wires/ap/article-12044121/Ruling-cancel-Alaska-commercial-king-salmon-season.html",
    "content": [
        "SEATTLE (AP) - A ruling from a U.S. judge in Seattle could effectively shut down commercial king salmon trolling in Southeast Alaska - a valuable industry that supports some 1,500 fishermen - after a conservation group challenged the harvest as a threat to endangered killer whales that eat the fish.",
        "Wild Fish Conservancy, the organization that brought the lawsuit, heralded the decision as the most significant government action in decades to provide more food for starving orcas. The group said it would also help recover struggling king salmon populations along the West Coast, as most of the salmon caught in Southeast Alaska spawn in rivers to the south.But fishing organizations condemned the ruling, saying it threatens the region with economic disaster and would do little or nothing to benefit orcas. The state of Alaska quickly announced an appeal.\"If they can't fish 10 months of the year - the two most productive seasons of the year - it's going to be devastating,\" Amy Daugherty, executive director of the Alaska Trollers Association, said Wednesday. \"Southeast Alaska has always been very fish dependent.\"On Tuesday, U.S. District Judge Richard Jones in Seattle ordered the National Marine Fisheries Service to redo a biological opinion that's required for the fishery to take place. The decision threatens to prevent the important summer and winter king salmon seasons; the summer season begins July 1.Officials have known for months the ruling was a possibility, and the agency has been working to draft a new biological opinion, said Linda Behnken, director of the Alaska Longline Fishermen´s Association. The industry is hoping it will be released in time to allow fishing this year or that the judge's decision is put on hold pending appeal.",
        "It remained unclear how likely either scenario was.\"All we can say at this point is that we are reviewing the ruling and considering next steps,\" NOAA Fisheries spokesman Michael Milstein said in an email.Officials in April canceled commercial and most recreational king salmon fishing off California and much of Oregon for the second time in 15 years after the fish returned in near record-low numbers to California´s rivers.Meanwhile, people who work on the boats, as fish processors or even in support businesses such as fuel stations and grocery stores in Southeast Alaska are waiting to see if the season will occur or whether they must find work elsewhere for the summer.\"There is so much stress in the lives of every family that relies on this industry,\" Behnken said. \"We're in a real quandary until we know whether we can have a fishery.\"Emma Helverson, executive director of Wild Fish Conservancy, said she was sympathetic to the communities' plight and hopes the government will make emergency funding available to support them. But she also said the industry had long overharvested the fish, also known as Chinook.\"Chinook populations are crashing coast-wide, and we need a coastal recovery effort,\" she said.King salmon are the largest and priciest of the Pacific salmon species, and the Southeast Alaska troll fishery provides them to restaurants and grocery stores around the world.",
        "They also make up the bulk of the diet for endangered orcas in the waters of the Salish Sea between Washington state and Canada. Due to overfishing, dams, development and pollution, chinook runs in the Northwest are at a small fraction of their historical abundance, and the local orca population has suffered in turn. Just 73 whales remain, inbreeding is a severe problem, and scientists are warning of extinction.While the endangered whales don´t typically venture as far north as Alaska, a huge amount of the Chinook salmon caught in the Southeast Alaska troll fishery originate from rivers in British Columbia, Washington and Oregon. If those fish weren´t caught, many would be available for the orcas to eat as the salmon migrate to their natal rivers to spawn, the Wild Fish Conservancy argued.In 2019, NOAA Fisheries approved the most recent decade-long plan for the commercial troll fishery for Chinook in Southeast Alaska, with harvest limits set during negotiations between the U.S. and Canada.The agency acknowledged the harvest was likely to hurt the orcas and protected Puget Sound and Columbia River king salmon stocks, but it said it would offset the harm by spending about $100 million on habitat restoration and increasing hatchery production of Chinook by 20 million smolts per year, thus providing more food for the whales.",
        "Last year, a magistrate judge who reviewed the case, Michelle Petersen, took issue with that, finding that under federal law, NOAA Fisheries could not rely on hypothetical mitigation measures to offset actual harm to protected species. Because the funding for the restoration efforts was uncertain, because there were no binding deadlines for the mitigation measures and because the agency did not actually study what effect an increase of hatchery production would mean for wild salmon stocks or orcas, that mitigation was legally insufficient.The question then became whether fishing could continue while the agency addressed the legal errors. Under Jones' ruling Tuesday, the answer was no.Tad Fujioka, a commercial troll fisherman from Sitka, said it won't be economical to fish only for other salmon species because Chinook make up over half of the fleet's profits.Paul Olson, a Southeast Alaska troller who lives in Plain, Washington, noted that the fishery has existed for well over a century - evidence that it is sustainable, he said.And, he said, even as the industry has seen catch limits dramatically reduced over the years, the endangered orcas have not recovered - suggesting that the problems plaguing orcas have little to do with a fishery in Southeast Alaska made up of small operators who catch and handle each fish individually, far removed from massive factory trawlers scraping the ocean clean.",
        "\"We should be the poster child of the kind of fishing that everybody wants to have,\" Olson said."
    ]
}