{
    "articleURL": "/wires/ap/article-12039563/Cops-Man-borrows-phone-admits-ex-landlords-2008-murder.html",
    "content": [
        "A New Mexico man, overwhelmed by guilt, borrowed a cellphone to call 911 and confess to the 2008 killing of his former landlord and he also told police where the body was buried, authorities said Tuesday.",
        "Police said Tony Ray Peralta, 37, of Roswell, was booked into the Chaves County jail on suspicion of murder.They said Peralta went to a store Monday afternoon, borrowed a cellphone to call 911 and told a dispatcher that he had killed someone. Officers went to the store and Peralta was detained for questioning.Police investigators then obtained a search warrant for a house where Peralta had been a tenant of 69-year-old William Blodgett. He told them where he buried the body, and they found a boot, bones and dentures after removing plywood floorboards from a detached room on the side of the house.A tearful Peralta told police during an interview that he didn't know why he had killed Blodgett and that he just needed to confess, according to an affidavit filed with the criminal complaint.Peralta told police he decided to come forward because \"his heart hurts\" and that the killing had been eating at him. He told the officer to tell Blodgett's family \"that he was a good man and that he didn't deserve what I did.\"\"I don't have an excuse,\" he told police, according to the affidavit. \"A lot of people have an excuse, I don't have one.\"Peralta was being represented by the major crimes unit within the public defender´s office.",
        "\"We are just beginning to work with Mr. Peralta on this case, and we will make sure Mr. Peralta´s due process is respected as this case starts to move through the court,\" said attorney Ray Conley, who leads the unit.The dentures found at the property were compared with Blodgett´s dental records - obtained in early 2009 after he was reported missing - and that led to a positive identification, according to police.Blodgett´s girlfriend and family had not seen him since late December 2008. She told police that Peralta, who was considered a suspect by police early on, allegedly had some sort or argument or fight with Blodgett, who had tried to evict him.Authorities at the time had talked to Blodgett´s family, friends and neighbors and visited the home the two men shared, which appeared to have been abandoned with personal belongings still in place. Police found no immediate signs of foul play and Blodgett's vehicle was still there, according to the original missing person report.Detectives would periodically drive by the house but never spotted anyone. They also brought a dog trained to sniff for bodies to the property but found nothing.Police said the case went cold after investigators exhausted all leads until Peralta's 911 call.___",
        "Montoya Bryan reported from Albuquerque, New Mexico. Associated Press writers Walter Berry and Terry Tang contributed from Phoenix."
    ]
}