{
    "articleURL": "/sport/nba/article-12058179/Nikola-Jokic-pushes-Suns-owner-Matt-Ishiba-retrieving-ball-stands-receives-technical.html",
    "content": [
        "Nikola Jokic scored a stunning 53 points in defeat to the Phoenix Suns on SundayThere was no official word from the league on further discipline Sunday nightREAD MORE: Suns owner Matt Ishbia insists Jokic should NOT be suspended Denver Nuggets All-Star center Nikola Jokic dismissed claims he could be suspended for Game 5 of the series with the Phoenix Suns after he got a technical foul for pushing Suns owner Mat Ishbia.",
        "The incident was in the second quarter of Game 4 on Sunday when Suns guard Josh Okogie crashed into the seats while trying to save a loose ball. He landed in a group of fans on the baseline that included Ishbia, who grabbed the basketball.Jokic was trying to get the basketball back quickly - apparently so the Nuggets could start their offensive possession - when he tried to take the ball away from Ishbia. who recently bought the Suns for $4billion. The ball flew backward into the crowd, and then Ishbia was knocked backward by Jokic's elbow.Jokic was unapologetic after the game, which the Suns won 129-124 but he scored a brilliant total of 53 points for the Nuggets.'The fan put the hand on me first,' Jokic said. 'I thought the league was supposed to protect us. Maybe I am wrong. I know who he is, but he is sitting on the court so he is a fan, isn't he? He cannot influence the game.'",
        "He was asked if he was worried he risked a fine or suspension for the crucial Game 5 on Tuesday.'Why? His hands are on me,' Jokic said. 'They are not going to protect me? They are going to protect the fan? I'm talking about it as a player. ",
        "'They can do whatever of course, they don't care but I think they are supposed to protect players.'Nuggets coach Michael Malone added: '(Jokic) is going to get the ball and some fan is holding on to the ball like he wants to be part of the game. Just give the ball up, man.'When Malone was told the fan was Ishbia he simply responded: 'I don't give a s***. I really don't care.' There were a few minutes of confusion as officials sorted out the strange scene, and then Jokic was assessed a technical foul. The Suns made the ensuing free throw.Suns star Devin Booker - who finished with 36 points and 12 assists - said he knew it was Ishbia in the middle of the fracas.'He got us a point!' Booker said with a grin.",
        "Ishbia told The Associated Press at halftime that he was 'fine' and more worried about the game than the altercation. He was back in his usual seats in the second half. The incident didn't seem to bother Jokic either - the MVP runner-up finished with 53 points on 20-of-30 shooting.Ishbia has only been the Suns' owner for a few months, purchasing the team from the embattled Robert Sarver in a deal worth around $4bn.",
        "Game 5 is on Tuesday in Denver. The series is tied at two games each."
    ]
}