{
    "articleURL": "/wires/reuters/article-12043835/Rumours-swirl-Messi-Saudi-Arabia-amid-PSG-discord.html",
    "content": [
        "By Simon Jennings and Shady Amir",
        "May 3 (Reuters) - Reports in France that Paris St Germain have decided not to renew Lionel Messi's contract have fueled speculation that Argentina's World Cup-winning captain is closing in on a lucrative transfer to a Saudi Arabian club next season.French sports daily L'Equipe reported on Tuesday that Qatari-owned PSG had suspended Messi for two weeks and decided against exercising an option to renew his contract for a third season after he made an unauthorized trip to Saudi Arabia.Messi is a Saudi ambassador for tourism and his longtime rival, Cristiano Ronaldo, signed for Saudi club Al-Nassr in December in a deal reported to be worth around $220 million per year.Ronaldo's move to Saudi Arabia nearly doubled the Portuguese former Real Madrid great's annual playing salary, making him the world's highest-paid athlete, Forbes reported earlier this week.Any deal for Messi, whose most likely destination is Al Nassr's rivals Al-Hilal, is almost certain to exceed the amount paid for Ronaldo.Al-Hilal fans chanted Messi's name and waved his shirts after the win against Al-Nassr last month.British newspaper the Daily Telegraph reported on Wednesday that representatives of the former Barcelona great were in talks with Al-Hilal over an annual contract worth around 400 million euros ($442.04 million).Al-Hilal did not immediately reply to a request for comment outside of normal business hours.",
        "PSG, who are owned by Qatar Sports Investments, declined to comment on the reports.Messi's trip to Saudi Arabia resulted in him being suspended without pay and banned from training with his team mates by PSG, L'Equipe said.Saudi Minister of Tourism Ahmed Al Khateeb confirmed Messi's trip to the Kingdom.\"I am happy to welcome Saudi Tourism Ambassador Lionel Messi and his family on his second vacation in Saudi,\" Al Khateeb wrote on his Twitter account.\"Welcome Messi to Diriyah, the land of traditions, heritage and history.\"Leo Messi, his wife Antonella and his sons Mateo and Ciro had an enjoyable tour where they learned about the history of Saudi and met its generous and hospitable people in At-Turaif.\" ($1 = 0.9049 euros) (Additional reporting Osama Khairy Editing by Christian Radnedge)"
    ]
}