{
    "articleURL": "/femail/travel/article-12044893/Why-travel-Laceys-Creek-Walking-Track-Djuri-National-Park-short-drive-Cairns.html",
    "content": [
        "Adventures are flocking to Lacey's Creek Walking TrackIt sits in Djiru National Park in Far North QueenslandThe trail winds through a magical rainforest Adventure chasers are heading north to a stunning and 'unforgettable' hiking trail that winds through a magical rainforest. ",
        "Up in the tropics of Far North Queensland in Djiru National Park is the Lacey's Creek Walking Track which can be found less than two hours south of Cairns. The spectacular trail takes visitors along the trickling creek and through the lush forest of ferns and towering palm tress that create a shady canopy. While it is close to the popular Mission Beach and attracts thousands of tourists each year, the area is only sound-tracked by the forest and its wildlife making visitors feel like they've entered a prehistoric fantasy land. At the end of the easy-grade trail travellers can find relief from the region's balmy weather by taking a dip in the refreshing, crystal clear waters of Lacey's Creek. ",
        "Swimmers will be sharing the creek's fresh waters with a variety of fish as well as saw-shell turtles while walkers may be lucky enough to come across the park's resident cassowaries. The well-worn, gentle trail is roughly 1.5km, takes up to 45 minutes for a round trip and is best appreciated when walked in an anticlockwise direction.Half way along the trail there is a viewing platform to take in the enchanting scenery of Lacey's Creek. The area is buzzing with wildlife from pythons to butterflies, bats, kangaroos, possums and even wild cassowaries. ",
        "Lacey’s Creek Walk is approximately 7.5km from Mission Beach Village along the Mission Beach – El-Arish Road.This walk is best appreciated when walked in an anti-clockwise direction. Starting from the Cassowary Information Shelter, here you can learn about cassowaries, which are frequently seen in the area.The track passes through the rainforest and exits at the picnic area near the car park. Source: Mission Beach Cassowaries ",
        "While cassowaries are usually shy and elusive they can be aggressive and dangerous if provoked so hikers should practice caution if they cross paths with one of the birds.Visitors have been raving about their experience treading the Lacey's Creek Walking Track but many advise travellers arm themselves with mosquito repellent before stepping out. 'Wonderful little example of the incomparable North Queensland rain forest. The crystal clear pristine creeks are teeming with native fishes, and there are a few great places for a dip in the cool stream,' one traveller wrote online.'Butterflies everywhere and peaceful running streams as your soundtrack makes this walk unforgettable,' said another.  ",
        "Cassowaries will be aware of you if you are moving around and will stand still assuming you can't see them. Once you are quiet you will easily hear a (cassowary or two) walking around if the ground cover is reasonably dry. Juveniles can be inquisitive. Should you be approached by a bird avoid eye contact. In the very unlikely event a bird persists in approaching you or if you notice it standing very tall, do not look it in the eye, back away very slowly placing a barrier of trees between you and the bird. (Never run away from a cassowary. Like Emus it triggers a response to run also) If a cassowary is ignored it generally loses interest very quickly and goes on its way.If by chance you don't get to see a bird at Mission Beach and you have time to take a trip to Etty Bay you may be lucky to see one of a number of birds that regularly visit the beach. These birds unfortunately are habituated to people. While the adult birds will move on if they know you do not have any food, younger birds can be unpredictable and demanding. We don't recommend taking a picnic onto the beach and if a bird approaches you while eating at a table, cover the food and avoid eye contact.Source: Mission Beach Cassowaries "
    ]
}