{
    "articleURL": "/wires/aap/article-12043275/From-fire-flood-rural-rescuers-honoured-bravery.html",
    "content": [
        "When record-breaking rainfall and flooding devastated NSW communities last year, one emergency services officer stepped in to rescue dozens of people trapped on roofs in his home town.",
        "It was Tim Perry's first day on the job as a paid aviation officer with the NSW Rural Fire Service when flash flooding engulfed Eugowra in the state's central west.The fast-moving deluge hit in the early hours of a November morning with little warning, forcing residents to seek refuge on the rooftops of their homes and buildings.\"I've done rescues in the past but I never knew the people involved,\" Mr Perry told AAP.\"This time it was a particularly unique situation.\"Over the course of the day, the Eugowra local rescued 24 people and one dog - the largest number of rescues performed by RFS rescue aircraft on any single day.The 36-year-old described the water that submerged his home town as \"basically an inland sea\".\"I grew up in Eugowra and have seen floods but this was nothing like I had ever seen before,\" he said.Rooftop rescues required negotiating solar panels, chimneys and power lines going into houses.\"At one point I had to winch down, disconnect from the cable and actually search inside a house through waist deep water because there were reports someone was still inside,\" he said.But it was knowing those he rescued that took the greatest toll.\"All the people I winched out and rescued I knew but I had to put all the emotion aside and realise I was there to do a job,\" Mr Perry said.",
        "He will be awarded the RFS Commissioner's Unit Citation for Service.Mr Perry is one of 80 volunteers, staff and teams honoured for their bravery and exceptional service across a range of emergencies including bushfires, floods and the COVID-19 pandemic.Held on May 4 each year, the award ceremony coincides with the Feast Day of St Florian, the patron saint of firefighters.RFS Commissioner Rob Rogers thanked volunteers and staff for protecting communities across the state and acknowledged their selflessness in often leaving their own families behind to help others."
    ]
}