{
    "articleURL": "/sport/football/article-12047663/Arsene-Wenger-backs-Arsenal-challenge-Premier-League-year.html",
    "content": [
        "Arsenal look set to miss out on the title after losing form in recent weeksFans and pundits have questioned whether they'll be in the mix again next yearArsene Wenger feels his former club will challenge for the league next season Arsene Wenger believes Arsenal will be in the mix to win the Premier League again next season - even if they fail to claim the title this year.",
        "The Gunners have led the way for the majority of this season, but after winning just one of their last five matches they have fallen below Manchester City in the table.Pep Guardiola's men are now heavy favourites to retain their crown, and Arsenal's dip in form at a crucial stage in the season has left some wondering whether they would be able to recover to have another strong campaign next year.Wenger isn't concerned about his former club, though, and feels Mikel Arteta is building a team capable of competing with the best for years to come.'I think we have in every position of the team, a player who has the quality to deliver the trophy,' Wenger told Sky Sports on Wednesday night.",
        "'If it's not this year, it will be maybe next year, but the quality is there, you know, and the team is especially going forward, very young. 'But I like the way they play, they are mobile, they make intelligent decisions around the box, they play well together and all the ingredients are there.'Wenger was speaking at the Premier League Hall of Fame evening in London after being inducted into the 'Class of 2023' alongside Tony Adams, Rio Ferdinand, Petr Cech and his old adversary Sir Alex Ferguson.",
        "Wenger and Ferguson are the first managers to go into the Hall of Fame, and the pair enjoyed an epic rivalry throughout their illustrious careers.The Frenchman won three league titles at Arsenal, but the north London outfit haven't lifted the Premier League trophy since 2004, and their wait for domestic glory could stretch into a 20th year if City go on to finish the job in the coming weeks.  Arsenal are currently one point behind City having played a game more, and face a huge test of their title credentials this weekend when they travel to high-flying Newcastle.A defeat at St James' Park would likely spell the end of their title hopes, with City due to host Sam Allardyce's Leeds United on Saturday. "
    ]
}