{
    "articleURL": "/wires/aap/article-12047825/Universities-call-record-low-research-funding.html",
    "content": [
        "Government spending on research has dropped to its lowest on record, triggering a warning from universities.",
        "New forecasts show spending is on track to be 0.49 per cent of GDP in 2022/23, having never dropped below 0.5 per cent since records began in 1978.Universities Australia chief Catriona Jackson told the Australian Higher Education Industrial Association's annual conference in Hobart on Friday the federal budget is an opportunity fix the nation's research problem.\"In tough fiscal circumstances, we recognise government can't fund everything,\" she said.\"Tough decisions must be made at a time that calls for less public spending.\"But we know that research makes the nation stronger and wealthier.\"Australia has about 81,000 researchers working in universities, undertaking 45 per cent of all applied research and 87 per cent of basic research.Universities are increasingly reliant on international student fees to pay for research activities, which the sector argues is vulnerable to shocks such as when the borders closed because of COVID.\"It's unfathomable that our ability to continue performing fundamentally important research for the good of the nation hinges on people choosing to study in Australia,\" Ms Jackson said.\"No other nation funds their research effort quite like this.\"The sector estimates every dollar invested in research returns $5 to the economy.\"A one per cent lift in spending on research would expand the economy by $24 billion over a decade,\" Ms Jackson said.",
        "Australian researchers were behind the development of wi-fi, the bionic ear, penicillin and printable solar cell technology.A panel of experts is consulting with the sector on a new Universities Accord - a long-term plan for the higher education system - which will report to Education Minister Jason Clare by the end of this year.One of the key areas for review is a new support system for university research that, according to the terms of reference, \"delivers for Australia, securing the future of the Australian research pipeline, from basic and translational research to commercialisation\".Group of Eight chief Vicki Thomson, whose members do 70 per cent of all university-based research in Australia, said it was hoped the new free trade agreement between Australia and the UK would drive investment in innovation and research collaboration.The agreement is the first trade deal to include an innovation chapter.\"The inclusion of the chapter is the first step in examining how our two nations utilise our research universities to drive innovation and commercialisation, with flow-on benefits to increased productivity and growth,\" she said."
    ]
}