{
    "articleURL": "/wires/ap/article-12060887/Vermont-bans-owning-running-paramilitary-training-camps.html",
    "content": [
        "Vermont on Monday made it a crime to own or operate paramilitary training camps in the state after Republican Gov. Phil Scott signed legislation introduced in response to a firearms training facility built without permits that neighbors called a menace.",
        "Violators face up to five years in prison or a fine up to $50,000 or both, according to the law. It prohibits a person from teaching, training, or demonstrating to anyone else the use, application, or making of a firearm, explosive, or incendiary device capable of causing injury or death that will be used in or in furtherance of a civil disorder. It also bans a person from assembling with others for such training, instruction or practice.The gun violence prevention group led by former U.S. Rep. Gabrielle Giffords, of Arizona, who was forced to give up her political career when she was disabled in a 2011 assassination attempt, praised Vermont's law.\"Today, Vermont joins 25 other states that prohibit firearms training for anti-government paramilitary activity,\" said Allison Anderman, senior counsel and the leader of Giffords´ Guns &amp; Democracy project. \"Private paramilitary activity is illegal in Vermont and has been associated with the intimidation of people exercising their constitutional rights across the US,\" she said by email. \"This is a commonsense policy that will help reduce the spread of dangerous, illegal, and anti-government firearms intimidation.\"The Vermont law does not apply to legitimate law enforcement activity or lawful activity by Norwich University or any other educational institution where military science is taught. it also doesn't apply to self-defense instruction or practice without the intent of causing a civil disorder; firearms instruction that is intended to teach the safe handling and use of firearms; and any lawful sports or activities like hunting, target shooting and firearms collection.",
        "In Oregon, which has had the sixth-highest number of extremist incidents in the country in the last 10 years, the legislature is considering a bill that, according to experts, would create the country's most comprehensive law against paramilitary activity. A failed bill this year in the New Mexico legislature that sought to rein in paramilitary patrols created in recent years to halt migrants near the international border with Mexico. A paramilitary patrol in New Mexico appeared at a protest over a statue of a Spanish conquistador.The owner of the 30-acre firearms training center in southern Vermont has until summer to remove all unpermitted structures on the site in Pawlet. Neighbors have complained about the gunfire and what they say are threats and intimidation by owner Daniel Banyai and his supporters.The Vermont Environmental Court said that Banyai was in contempt of court for deliberately flouting a series of court orders issued since the legal case began in 2019 and now faces jail and fines that could exceed $100,000 if he fails to comply by June 23.Banyai did not respond to a text seeking comment.______Rathke reported from Marshfield, Vermont. Associated Press reporter Wilson Ring contributed from Stowe, Vermont.____This story has been corrected to reflect that the New Mexico bill on paramilitary patrols failed."
    ]
}