{
    "articleURL": "/wires/reuters/article-12046815/European-shares-pare-losses-ECB-slows-rate-hikes.html",
    "content": [
        "STOXX 600 index hovering at 1-month lows",
        "ECB hikes benchmark rates by 25 bpsShell up on beating earnings forecastsSkanska drops on sharp fall in earnings(Adds fresh analyst comments, details from Lagarde at ECB press conference, bank stocks; updates prices to close)By Shreyashi SanyalMay 4 (Reuters) - European shares ended Thursday lower after the European Central Bank eased the pace of its interest rate hikes but signalled more tightening to come, while Swedish builder Skanska tumbled as its earnings were hit by soaring inflation and high rates.The pan-European STOXX 600 index closed 0.5% lower, hovering near one-month lows it hit at the beginning of the week.The ECB raised its interest rates by 25 basis points, the smallest since it started lifting them last summer, bringing the benchmark for borrowing costs in the 20-country euro zone to 3.25% from 3.0% earlier.\"We are not pausing - that is very clear,\" ECB President Christine Lagarde told a press conference, highlighting the central bank remained on its path to fight stubborn inflation and suggesting more than one additional rate rise could be on the cards.The small downshift in the ECB comes after the U.S. Federal Reserveraised its key benchmark rateby 25 bps to the 5.00% to 5.25% range on Wednesday, but dropped from its statement that it \"anticipates\" further hikes would be needed.",
        "\"Today's developments leave us thinking that the ECB will probably raise rates a couple more times before pausing, which would mean a peak of 3.75% rather than 4%,\" said Andrew Kenningham, chief Europe economist at Capital Economics.\"And whatever the peak, we think the ECB will leave rates at that level until well into 2024 (in contrast to our view that the Fed may begin rate cuts as soon as September).\"Swedish builder Skanska AB slid 11.1% after it reported a sharp fall in operating earnings for the first quarter.European banks fell 1.5% as worries about turmoil in the U.S. regional banking sector were reignited after PacWest Bancorp slid to a record low on news it was in talks about strategic options.\"Banking stocks have taken another beating today as markets worry that PacWest might be the next domino to fall,\" said Danni Hewson, head of financial analysis at AJ Bell.Shell Plc rose 0.9% after its first-quarter profit dropped slightly from the previous quarter as energy prices cooled, but still beat forecasts.Danish drug developer Novo Nordisk A/S fell 2.6% after it said it would reduce the supply of some dose strengths of its popular Wegovy obesity drug in the United States to cope with high demand.Ferrari NV rose 4.7% on first-quarter core earnings beating forecasts, as demand for its cars stretched into the next two years. (Reporting by Shreyashi Sanyal and Shubham Batra in Bengaluru; Editing by Sriraj Kalluvila and Chris Reese)"
    ]
}