{
    "articleURL": "/tvshowbiz/article-12039903/Rhian-Sugden-looks-stylish-black-blouse-mother.html",
    "content": [
        "Rhian Sugden showed off her chic but casual sense of style as she treated her mother Anita to afternoon tea at The Ivy Spinningfields Manchester on Tuesday.",
        "The model, 36, wore a loose-fitting black blouse adorned with a pattern of white hearts which she teamed with a pair of skinny blue denim jeans.Former Celebrity Big Brother housemate Rhian opted for a comfortable pair of black and white trainers and carried a red Gucci handbag with her.She wore minimal make-up for her outing and appeared in good spirits as she smiled while standing next to her parent.Anita wore a bright pink top for their lunch outing which she teamed with a pair of dark blue skinny jeans. ",
        "She wore a pair of white trainers as she posed-up with her famous daughter outside the restaurant.Rhian revealed her mother was 'cancer free' last summer after being diagnosed with bowel cancer in July 2021.Television personality Rhian shared a sweet photo of her 'absolute warrior' mum to Instagram in June as she broke the happy news to her followers.Taking to social media, she penned a gushing tribute and added that she 'couldn't be more proud of anyone' after the 'toughest year' since she was diagnosed.Rhian wrote: 'The news I've been waiting for... It's been the toughest year with my mum being diagnosed with cancer last July. Today she is cancer free!! She's done it.'Endless hours of chemo, a few organs removed and she's powered through it like an absolute warrior.",
        "'I couldn't be more proud of anyone if I tried! Everyone look at my beautiful Mum!!'Rhian added: 'I will be running #raceforlife for her in July and raising as much money as I can for @cr_uk and @christiecharity they have saved my mum's life and I cannot thank them enough.' ",
        "Rhian later told how she developed an eating disorder due to the stress of IVF treatment and her mum's bowel cancer diagnosis.In March, the glamour model detailed how she was only able to manage half a banana and a square of chocolate a day because eating made her feel like she was 'choking'.Rhian, who has undergone six unsuccessful rounds of IVF, said she dreamt of having 'four or five' little boys running around but would 'now feel lucky to have just one'.The media personality and her husband Oliver Mellor have spent £75,000 trying to conceive, but remain one of the one in seven couples who have fertility struggles.Rhian told her high anxiety around the time of her most recent IVF cycle and her mum's cancer battle last summer led to an eating disorder.Revealing she lost more than two stone after developing a fear of eating, Rhian said: 'Last year was the year from hell.'I'm in a much better place now but in the summer I was so anxious that I felt full all the time and every time I tried to eat I felt like I was being strangled.",
        "'It was a really horrible choking sensation and for about three months I lived on a square of chocolate and half a banana every day.'",
        "Rhian revealed that she now feels on an 'even-keel' after being prescribed anti-anxiety medication to help her cope.On Mother's Day, Rhian posted a candid snap on her Instagram Story as she told of experiencing a 'hard' day amid her fertility struggles.She was in tears in a selfie uploaded to her social media as she penned in the caption: 'The reality of Mother's Day for an IVF warrior. It's hard.'In her Mother's Day snap she was laying down in bed staring up at the camera as tears ran down her cheeks.She was makeup free and had her blonde tresses in loose waves over her shoulders as she was honest and open in her caption.She announced her decision to start the in-vitro fertilisation process in 2019 after she was told by doctors that she has an egg count of someone at least 13 years older.In September 2021 Rhian revealed that her fourth round of IVF had failed and at the time admitted she was struggling to put on a 'brave face'. It is not known if she has tried for a fifth round since.",
        "The beauty showed her vulnerable side as she candidly discussed feeling down on Instagram amid her challenging fertility journey.",
        "And sharing a glamorous photo clad in lingerie, Rhian provided an update: 'Been feeling blue [blue heart emoji]. Had a hell of a tough few weeks…'For those that have been following my journey… IVF round 4 failed ❤️‍but it's now time for me to pick myself up and carry on!'Being in the public eye and trying to keep a brave face on his harder than it looks but I've done it many times before and I will do it again.'It's time to stick on my best undies, get myself back to normal and get back behind that camera doing what makes me happy! Big shout out to my support network. You're the best! ❤️ #ivfwarrior [pineapple emoji].' [sic]In April 2019, Rhian discussed her plans to have IVF after being told she has an egg count of 'a woman over 45' but added that the procedure carries only a 'two per cent' success rate.Rhian explained: 'I was told that I may never be a mum – and I’m heartbroken.'Doctors said I have the egg count of a woman over 45, meaning it's unlikely I would ever conceive naturally.",
        "'It also means the odds of getting pregnant by IVF have gone down from 30 per cent to two per cent – which was pretty devastating to hear.'",
        "In-vitro fertilisation, known as IVF, is a medical procedure in which a woman has an already-fertilised egg inserted into her womb to become pregnant.It is used when couples are unable to conceive naturally, and a sperm and egg are removed from their bodies and combined in a laboratory before the embryo is inserted into the woman.Once the embryo is in the womb, the pregnancy should continue as normal.The procedure can be done using eggs and sperm from a couple or those from donors."
    ]
}