{
    "articleURL": "/news/article-12060253/26-382-apprehensions-Border-crossings-surging-Title-42-set-end-Thursday.html",
    "content": [
        "CBP saw an unprecedented average of 8,794 migrant apprehensions per day in the last 72 hours with the impending end of Title 42 The Texas Tactical Border Force deployed Monday to help manage 'hot spots'Comes as pandemic-era expulsion policy Title 42 is set to expire on Thursday – and is predicted will lead to 13,000 crossings per day up from the 7,700 nowBorder crossings are already spiking in the days leading up to the end of Title 42 with U.S. Customs and Border Protection (CBP) apprehending more than 26,000 migrants in just 72 hours.",
        "The last three days saw an average of 8,794 migrant apprehensions per day, according to figures released by CBP Chief Raul Ortiz.This is a staggering unprecedented figure that is only expected to grow in coming days with Title 42 set to expire on Thursday.Currently, the average number of migrants crossing the southern border each day is 7,700. But the Biden administration estimates that the number could increase to 13,000 every day once Title 42 is no longer in use. Other external estimates have put that number even higher.Smugglers are encouraging migrants to head for the border.",
        "They claim the end of Title 42 will make it easier to cross – even though the Biden administration wants to enact tough rules to speed up deportations and ban re-entry for illegal crossers for up to five years.The health-related immigration policy was first enacted at the onset of the COVID-19 pandemic in March 2020 by then-President Donald Trump. Title 42 allowed immigration and border authorities to immediately expel migrants without hearing their asylum claims during the declared health emergency.In preparation for massive surges at the border come Thursday, Texas Gov. Greg Abbott deployed on Monday the newly formed Tactical Border Force along with the National Guard already in place. In addition, 1,500 active-duty troops were deployed last week by President Joe Biden and expected to be on the border to assist law enforcement by May 10.",
        "Chief Ortiz revealed in a tweet Monday that in the last 72 hours CBP has been able to identify 7,399 'gotaways' and seize 329 pounds of various drugs, including fentanyl, meth and heroin.He also noted that they apprehended one felon, one gang member and three sex offenders over the weekend.The elite Texas National Guard's Tactical Border Force is deploying Monday in preparation for Title 42 to end on Thursday as the state with the most miles of southern border braces for 13,000 migrant crossings per day once the pandemic-era policy expires.  Meanwhile, images emerged with thousands of migrants lining up on the southern side of the U.S.-Mexico border, waiting in anticipation for Title 42 to end on May 11.",
        "'The Biden administration has been a disaster, they ripped apart policies that led to lowest illegal border crossings in decades,' Abbott told Fox &amp; Friends on Monday morning. He went on: 'We are deploying today a new Texas Tactical Border Force made up of elite National Guard who are trained for one thing, and that is to identify areas where illegal immigrants are trying to cross the border and fill that gap and repel them to deny them access to enter into the United States.''They can do it one of several ways – physically turn back those who are trying to come over illegally, and they are building immediate wire border barriers that prevent people from coming across the border,' the Texas governor continued. 'And you saw early iteration of this when you saw long lines of people in El Paso in 24 hours.'",
        "Abbott insists that a border barrier needs to be completed to 'immediately' stop in-flow of migrants.Title 42 was first passed in 1944 and was enacted by then-President Donald Trump in 2020 at the onset of the coronavirus pandemic.The policy allows immigration and border officials to immediately expel migrants without hearing their asylum claims during a public health emergency. Specifically, the original law intends to stop entry of those able to bypass health screenings by crossing illegally.Some reports indicate that there are between 700,000 and 1 million migrants that could cross in the days following the end of the pandemic-era expulsion policy.Abbott noted Monday morning that his state is pressing onward to 'very quickly build as many barriers as possible to turn back as many people as possible.'Texas National Guard soldiers have already been manning the border for the last few years, but the military presence will now be even more prominent as it's all-hands-on-deck for the end of Title 42.",
        "Illegal immigration and unlawful border crossings have reached an all-time high under the leadership of President Biden and Homeland Security Secretary Alejandro Mayorkas.'So as you all, and everybody knows, what Mayorkas has said – he said the border is closed,' Abbott said of his talks with the DHS head.",
        "'So, yeah, I've talked to Mayorkas a couple of times. And every time I've talked to him, he continues to have his head in the sand. He's either lying or really doesn't know what's going on, because the border is not closed.'He added: 'They're doing nothing to stop it and all of the policies that the Biden administration tried to put in place are just going to entice more people to come across the border.'Independent Sen. Kyrsten Sinema, who also represents a border state in Arizona, said Sunday that she has nearly no communication with Mayorkas."
    ]
}