{
    "articleURL": "/wires/reuters/article-12052293/FC-Dallas-home-face-road-savvy-St-Louis-City.html",
    "content": [
        "FC Dallas returns home, where they have played their best this year, and will play host to expansion St. Louis City on Saturday at Frisco, Texas, in the first-ever meeting between the two sides.",
        "FC Dallas (4-3-3, 15 points) has produced three of their victories and 10 of their points at home and heads into the Western Conference matchup after a scoreless draw at Minnesota United on Sunday.It was the second time in 10 games that FC Dallas were held scoreless, with the other a 1-0 loss to Minnesota United in the season opener.Since going unbeaten over their first three games in March, FC Dallas is 2-2-2. Jesus Ferreira leads the team with five goals, while the rest of the teams has found the net a combined seven times.\"Getting the clean sheet against Minnesota was important for our defenders,\" FC Dallas goalkeeper Maarten Paes said. \"It helps us boost our confidence. We were able to defend properly in set pieces. The match against St. Louis is a new challenge, and we are already looking forward to it.\"St. Louis City (6-3-1, 19 points) have cooled after a torrid five-game winning streak to begin their inaugural campaign. St. Louis has won just once in its past five games and travels to Dallas after a 2-1 loss at home to the Portland Timbers last Saturday.Celio Pompeu scored in St. Louis City's setback, his first career MLS goal.\"That's almost a philosophy goal for us,\" St Louis City coach Bradley Carnell said about Pompeu finding the net. \"It was a really good goal. We needed more of those moments in the game against Portland.\"",
        "Despite their recent difficulties, St. Louis City's 19 points are the second most by a first-year side after 10 games in MLS history, behind LAFC's 20 points in 2018. St. Louis still owns the best road record in the Western Conference at 3-1-1.Midfielder Rasmus Alm is questionable for St. Louis with a hip injury. Alm has scored twice for St. Louis City over the past four games.--Field Level Media"
    ]
}