{
    "articleURL": "/sport/boxing/article-12039483/New-details-revealed-Harry-Garsides-alleged-domestic-violence-against-ex-partner-Ash-Ruscoe.html",
    "content": [
        "Harry Garside released on bail following airport arrest Accused of domestic violence against former partner Daily Mail Australia provides all the latest sports news Shocking new details about Olympic boxer Harry Garside's alleged assault of his ex-girlfriend have come to light after he was bailed following his arrest when he touched down in Sydney following his stint on I'm a Celebrity... Get Me Out of Here!",
        "Garside, 25, was stopped by NSW Police on Tuesday after returning from South Africa, where he came a close runner-up to former champion netballer Liz Ellis on I'm a Celebrity... Get Me Out of Here.The Olympic bronze medallist is accused of committing domestic assault against his ex-girlfriend, Ash Ruscoe, at a property in Bondi in March.After spending two hours in a Sydney police station, Garside said he would release a full statement in due course, but told 7News that the arrest was 'very confronting'.He has been charged with domestic-violence-related common assault and will appear at Sydney's Downing Centre Local Court on May 24. Police will allege Garside hit his former partner in the head with his elbow and spat in her face, and that there was a physical clash over a mobile phone, News Corp reported.The fighter was believed to be visiting Ruscoe's Bondi flat to get his possessions after their break-up, according to the publication.  ",
        "The champion men's lightweight boxer won bronze for Australia at the Tokyo 2020 Olympics and has won seven Australian national boxing championships. News Corp has reported that Garside was met by police detectives upon his arrival at Sydney Airport on Monday after his flight from Johannesburg.Garside was travelling with his father, Shaun, who was allowed to continue through customs to collect his bags. ",
        "Garside, on the other hand, was escorted by two NSW Police detectives and two Australian Federal Police officers to a waiting car.",
        "The 25-year-old athlete was then taken to a nearby police station, where he was interviewed over an alleged incident that took place in March with his ex-girlfriend.Ruscoe, a wellness instructor and personal trainer, competed on another Ten reality show, The Amazing Race Australia with former partner Sidney Pierucci. On Wednesday morning she told Seven's Sunrise program she was not surprised by the charges against Garside. NSW Police released the following statement on the matter.'Last month, officers from Eastern Suburbs Police Area Command commenced an investigation into reports of an alleged domestic violence-related incident at Bellevue Hill on Wednesday 1 March 2023,' NSW Police said in a statement.'Following inquiries, a 25-year-old man was arrested at Sydney International Airport about 2.40pm today (Tuesday 2 May 2023). He was taken to Mascot Police Station and charged with common assault (DV). He was granted conditional bail to appear at Downing Centre Local Court on Wednesday 24 May 2023.'Garside recently shared a picture of himself and his father on Instagram, taken in business class on a Qantas flight. He captioned the post: 'Had to upgrade my best mate to business with me. What an experience it has been. Something I will truly never forget, friendships that will last a lifetime.'  "
    ]
}