{
    "articleURL": "/tvshowbiz/article-12060169/Kim-Zolciak-Kroy-Biermann-owe-1-1-million-unpaid-taxes-IRS.html",
    "content": [
        "Kim Zolciak and husband Kroy Biermann allegedly owe $1.1 million in unpaid taxes, penalties and interest to the IRS, according to TMZ.",
        "Kim and Kroy allegedly did not pay in 2013, 2017 and for 2018. The reality stars also reportedly owe the state of Georgia $15,000 in unpaid taxes from 2018. The couple's home in George entered 'foreclosure' in February, per the outlet. In February, Kim took to social media to boast about her ornate living room, complete with a dazzling chandelier - despite it being in reported foreclosure.",
        "'This is definitely one of my most favorite rooms, called the Hollywood room,' the mother-of-six said in an Instagram video, which panned around her parlor. She continued: 'That chandelier is seven — almost eight-feet wide, by seven-feet high.' The TV personality went on to muse about all the 'fun' times that her family shared in that room, before pointing out a shiny gold balloon stuck in the light fixture. Her post comes on the same day a source told People that the reality star 'is telling everyone' that the foreclosure 'is a misunderstanding' and that it 'is being sorted out.''She's not moving,' the insider added.The TV personality and the former professional NFL player, 37, initially bought the home for $880,000 back in 2012.Their property is now priced between $2.5 and $2.6 million, according to the outlet.The lavish estate has been featured on both the Real Housewives and Kim's own reality show titled, Don't Be Tardy, which aired for a total of eight seasons.",
        "Truist Bank has been asked to deal with the foreclosure of the house, and action had reportedly begun to take place back in August when the couple defaulted on their $1.65 million mortgage.According to TMZ, the five bedroom and six and a half bathroom mansion sits comfortably near the 18th hole of the Manor Golf and Country Club located just north of the bustling city of Atlanta.The front of the home has a spacious circular driveway and has an inviting appeal with stunning brickwork on the exterior.On her own reality show, Don't Be Tardy, which first aired back in 2012 with the original title of Don't Be Tardy For The Wedding, Kim gave a tour of the mansion.The mother of six showed off the ornate décor, which included crafted paintwork and glistening chandeliers that offered a feeling of opulence. Large windows offered plenty of natural light to stream inside to brighten up the space.",
        "The 6,900 square foot home also contains a swimming pool with a hot tub, a waterfall spa, a basketball court, and a built-in elevator.Late last year in November, Kim had denied claims that that their Georgia home was auctioned off for just $257,000 in an Instagram Stories video, while claiming that she still owns it and isn't planning on selling anytime soon.",
        "The reality star also claimed the actual worth of her home — located in the city of Alpharetta, Georgia— is $2.5 million, or nearly ten times as much as it was rumored to have been auctioned for.'My house was not sold for $257,000. If you guys think that I would let my home, that we put millions and millions of dollars [into], go for $257,000, you’re an idiot, OK? For real,' said a clearly upset Kim in her video.She didn't appear in the short clip, and instead gave her 3.3 million Instagram followers a brief tour of her home and its grand staircase.Kim also claimed that she wasn't planning on leaving the luxurious home until she was ready to.'So, what are you going to do, haters, when I’m here for Christmas, and I’m here for my birthday, and I’m here for all those amazing dates?' she asked combatively. 'I’m here until I f***ing want to move out. ‘Til I decide I don’t want to live here anymore.'As she finished showing off a portion of her home, she added, 'So enjoy the view, haters, ’cause you’re going to be seeing it for quite some time.'Kim and her family had been beset by online rumors that the home had been foreclosed on and eventually sold at auction for just $257,000.",
        "The rumors may have been sparked partly based on reality, as the house was once threatened with foreclosure back in 2014, according to a report last month by Page Six.",
        "However, Kim and her husband Kroy paid off of their outstanding debts to get their home out of the danger. At the time of the foreclosure threat, they reportedly owed $10,567.67. The foreclosure threat was delivered two years after the home was purchased in 2012.Kim and the former Atlanta Falcons NFL star first met in 2010 after crossing paths at the Dancing With Atlanta Stars charity event. They tied the knot one year later in 2011.They welcomed four children together: Kroy Jagger (KJ), 11, Kash, 10, and twins Kaia and Kane, 9.Upon marriage, Kroy also legally adopted Kim's daughters from her previous relationships, Brielle, 26, and also Ariana, 21, whom the reality star shares with ex-husband, Daniel Toce."
    ]
}