{
    "articleURL": "/wires/reuters/article-12058249/Australias-big-pension-funds-boost-fossil-fuel-investments-activist-group-says.html",
    "content": [
        "SYDNEY, May 8 (Reuters) - Australia's 30 biggest pension funds increased their investments in key coal, oil and gas producers by 50% in 2022 despite the funds' long term commitments to net zero carbon emissions, environmental activist group Market Forces said.",
        "Superannuation or retirement funds raised their investment to more than A$34 billion ($23 billion) in companies most responsible for expanding fossil fuels, Market Forces said.\"Super funds are making a mockery of their own commitments to net zero by buying up wholesale in companies expanding fossil fuels and letting them get away with trashing our climate,\" Market Forces campaigner Brett Morgan said in a statement.Some funds have committed to achieve net zero carbon emissions in their investment portfolio by 2050.Commonwealth Super Corp, AustralianSuper, Australian Retirement Trust, Aware Super and AMP Ltd - operators of the five largest funds cumulatively managing more than A$1 trillion ($675 billion) - did not immediately respond to Reuters requests for comment.Market Forces only named AustralianSuper, which it said had increased its stake in Woodside Energy Group Ltd, Australia's top independent gas producer, by about 19 times in 2022.In an emailed response, AustralianSuper said it had raised its stake as gas was a key part of an \"orderly energy transition\" ahead.\"As an active and responsible owner, we will continue to proactively engage with Woodside to understand how the company plans to transition its operations to deliver long-term value to members in a low-carbon environment,\" a spokesperson said.There has been active interest from shareholders in oil and gas companies after commodity prices shot up due to Russia's war in Ukraine, which could partly explain the funds' move to up their stake in fossil fuel companies, Market Forces said.",
        "It estimated more than A$140 billion of Australians' retirement savings are invested in fossil fuel companies through the funds, which have more than 9% of members' share investments in these firms on average.($1 = 1.4806 Australian dollars) (Reporting by Renju Jose in Sydney; Editing by Christopher Cushing and Sonali Paul)"
    ]
}