{
    "articleURL": "/wires/aap/article-12058167/South-Australia-woos-backers-green-hydrogen-steel.html",
    "content": [
        "South Australian Premier Peter Malinauskas will spruik the state's world-leading green hydrogen project during a four-day trade mission in Europe.",
        "The premier will meet potential investors in Berlin and Rotterdam before giving a keynote speech at the World Hydrogen Summit in the Netherlands.As a global leader behind the new industry, Mr Malinauskas will argue the world must use green hydrogen, ammonia and green steel to reach net zero emissions.Queensland's Gladstone and Townsville are also vying to be hydrogen hubs, while Western Australia has earmarked land in the Pilbara's Port Hedland and Onslow for green hydrogen, ammonia and iron ore projects potentially worth $70 billion.\"The world needs clean energy and South Australia is uniquely positioned to lead the way.\" Mr Malinauskas said on Monday.\"It is vital we make sure we are meeting face-to-face with the key players across both government and private industry to present our vision and maximise the investment opportunities for South Australia.\"In Berlin, the premier will meet some of the biggest players in hydrogen and green steel manufacturing in Germany.Germany is the leader in green hydrogen in Europe as the region tries to decarbonise and wean itself off Russian gas.The premier will also address the World Energy Storage Forum, also in Rotterdam, amid strong investor interest in the state for renewable energy and storage.The state plans to build a world-leading hydrogen power plant, electrolyser and storage facility in Whyalla as a centrepiece of the state's future economy.",
        "The $600m hydrogen jobs is plan part of a $20b pipeline of renewable energy projects.A global market call has attracted 29 proposals, with a detailed and complex evaluation process is under way with a view to awarding contracts early in the second half of 2023.Located close to transmission infrastructure, the new industrial hub is also near high-quality southern and central wind zones - a renewable energy source critical for commercial green hydrogen production.The federal government pledged $25m for developing the deep-sea port to support future industries.Liberty Steel has already announced plans to dump coal-based steelmaking at Whyalla and will instead use natural gas and green hydrogen."
    ]
}