{
    "articleURL": "/tvshowbiz/article-12038747/Sergio-Ramos-glamorous-wife-Pilar-Rubio-stuns-couple-attend-Madrid-Open.html",
    "content": [
        "Former Spain defender Sergio Ramos joined his glamorous wife Pilar Rubio at the Madrid Open tennis championship in Spain on Monday.",
        "The mother-of-four, 45, cut a chic figure for the sun-soaked Caja Mágica Arena event  in a black strapless dress.She completed the look with a matching headscarf and shielded her eyes behind heart shaped shades. Pilar accentuated her gorgeous features with a light dusting of make-up and wore her dark tresses slicked back. Meanwhile hubby Sergio, 37, who is reported to be worth £70M, cut a casual figure in a grey hoodie which he wore with a simple white t-shirt.  ",
        "Teasing a hint of his heavily tattooed arms he slicked his locks into a stylish bouffant and slipped on a pair of dark sunglasses. The couple appeared in high spirits as they chatted with fellows stars in their VIP box before watching Carlos Alcaraz of Spain take on Germany's Alexander Zverev.In February former Spain defender Sergio announced his retirement from international duty.Ramos ended his glittering international career that saw him become his country's most-capped player with 180 appearances across 18 years.After making his debut in 2005, Ramos went on to appear for Spain at seven successive international tournaments from the 2006 World Cup to the 2018 edition of football's showpiece event.He was part of the Spain team that won their first ever World Cup in 2010, while he also won the 2008 and 2012 Euros with La Roja.",
        "However, Ramos fell out of favour under former national team boss Luis Enrique and was left out of their squad for Euro 2020 after struggling with injuries, before he was also omitted for the 2022 World Cup.The centre-back - who is the sixth most-capped player of all-time in men's international football - last played for Spain against Kosovo in March 2021. ",
        "Ramos announced his retirement on Instagram in an emotional post after revealing new Spain boss Luis de la Fuente had told him he wouldn't be a part of his plans for the future.Alongside several photos from his international career, Ramos said: 'The time has come. Time for me to say goodbye to the Spain national team.'This morning, I received a call from the current head coach who informed me that I am not and will not be part of his plans, regardless of how I perform or what I do in my career. 'With a heavy heart, it's the end of the road that I hoped would stretch out further and which would end with a better taste in my mouth.'Ramos then hinted that he felt he had been forced into retiring after his conversations with De la Fuente despite his desire to continue playing for Spain.",
        "He added: 'I honestly believe that this journey deserved to end at my own choosing or because my performances were not at a level worthy of our national team.'Because age in itself is not a virtue or a defect; it's just a number that is not necessarily related to performance or ability. 'I admire and envy players like Modric, Messi and Pepe. Unfortunately, it won't be like that for me because football isn't always fair and football is never just football.'",
        "Ramos continued: 'I come away with unforgettable memories, all the titles we've fought for and celebrated together and the tremendous pride I feel as the most capped Spanish international of all time. 'This badge, this shirt and these fans, all of you, have made me happy. My heartfelt thanks to all of you who believed in me!'The PSG defender was the youngest player to play for Spain in 55 years when he made his debut in a friendly win against China in March 2005 at the age of 18 years and 361 days.This record was broken by Cesc Fabregas a year later, but Ramos played a crucial part in helping his country to win three successive major tournaments from 2008-2012, while he also played in the 2009 and 2013 editions of the now defunct Confederations Cup."
    ]
}