{
    "articleURL": "/wires/afp/article-12058375/Iraqi-Kurdish-bodybuilder-breaks-gender-barriers.html",
    "content": [
        "As a young girl, Iraqi Kurd Shylan Kamal would help her mother knead bread until one day she realised the work was a way to build up muscles -- and she liked it.",
        "Now 46 and herself a mother, Kamal sees her passion for bodybuilding as a matter of gender equality in Iraq's autonomous Kurdistan region.\"Having muscles is good for women too,\" she told AFP during a session at a gym in the provincial capital Arbil, where she spends four hours training every day.\"We can express our beauty through bodybuilding,\" Kamal said.The nutritionist and former photographer returned to Kurdistan from Germany three years ago and found a conservative and patriarchal society where her passion for bodybuilding raised some eyebrows.But she refused to let opinions stop her.\"I don't care at all what people say, I have my own opinions,\" she said, adding that she dislikes the traditional beauty norms society imposes on women.\"I hate that people consider women as inferior beings or sex symbols and that they're expected to look after the children and make themselves beautiful for their husbands,\" she said.\"Why can't women be both beautiful and strong at the same time?\"",
        "Kamal has trained since the age of 22. On Instagram she can be seen posing in a bikini and flexing her muscles at bodybuilding competitions across Europe, sometimes also waving the flag of Iraqi Kurdistan.After a warm-up, she alternates between weight machines, lifting dumbbells and doing pushups, her hair cascading over powerful shoulders.",
        "In recent months, she has competed in three events across Britain and Germany, each time placing third. The most recent was mid-April's FIBO Global Fitness show, in Cologne.\"People here are not used to seeing women in bathing suits showing off their muscles,\" Kamal said, regretting the prejudice in her homeland -- and also coming from people abroad who are surprised to learn she is Iraqi.- 'Full of energy' -Originally from Sulaimaniyah, Iraqi Kurdistan's second city, Kamal emigrated to Germany with her uncle when she was 14.Two years later she married. Her three children are now aged in their 20s.While living in Germany, she went to university and became a photographer, working at a studio in Duesseldorf.Kamal said she has received only support from her family in her endeavours.\"Since I was a kid I've been full of energy, and I need an outlet for that energy,\" she said.",
        "\"When I was helping my mum knead the dough to make bread I could feel my muscles developing -- and that made me happy.\"Acceptance of women's sports is progressing slowly in Iraqi society. Recent years have seen a rise in women playing football, boxing, kickboxing and weightlifting.The relative stability in Kurdistan -- largely spared the ravages of conflict afflicting other parts of Iraq since the 2003 US-led invasion -- has allowed the region to develop sporting infrastructure.",
        "Ranjbar Ali trains in the same gym as Kamal and said he is \"happy\" to see \"women like Shylan breaking down barriers and preconceived ideas to reach world-class level\".Ali, muscles bulging from his black singlet, offered his support to Kamal's efforts to achieve gender equality in bodybuilding.\"Some people think it shameful for women to show off their bodies and their muscles. But why does that not also apply to men?\" the 45-year-old said.For Kamal, her advice to aspiring women bodybuilders, from Kurdistan and beyond, is simple -- hit the gym and practise.\"It's a physically demanding discipline that needs concentration and a healthy diet,\" she said, adding the routine will help physical and mental health.\"I'm convinced that going to the gym is more beneficial than going to the beauty salon.\""
    ]
}