{
    "articleURL": "/wires/reuters/article-12038275/Suns-concerned-latest-Chris-Paul-injury.html",
    "content": [
        "Phoenix Suns point guard Chris Paul might not be ready to return any time soon from the groin injury that knocked him out of Game 2 of the Western Conference semifinals at Denver on Monday night.",
        "Phoenix fell behind 2-0 in the best-of-seven series in a 97-87 loss to the Nuggets on Monday night, finishing the game without Paul in the game -- or at the arena -- due to a left groin injury.The good news for the Suns is a long layoff in the series schedule. Game 3 is Friday in Phoenix, one day before Paul's 38th birthday.\"We're not quite sure what it is right now,\" Suns head coach Monty Williams said.Cameron Payne likely would replace Paul with Devin Booker assuming more point guard responsibilities if the Suns don't have their lead point guard for Game 3.The worry for Phoenix was that Paul couldn't push off his left leg at all, according to Williams, which limited casual movements and all but erased any explosive burst with the ball.The 12-time All-Star exited with 4:32 left in the third quarter after tangling with Denver's Kentavious Caldwell-Pope while trying to get rebounding positioning. Paul quickly grabbed at his groin area when he came down.Paul, in his 18th NBA season, ended the night with eight points, six assists and five rebounds in 25 minutes.In Phoenix's five-game series win over the Los Angeles Clippers in the first round of the playoffs, Paul averaged 13.6 points, 8.2 assists, 6.0 rebounds and 2.2 steals.",
        "He appeared in 59 games during the regular season, putting up 13.9 points, 8.9 assists and 4.3 rebounds per contest.Paul's prime playoff appearances have been hindered by injuries in the past. He hurt his right hamstring with the Houston Rockets leading the Golden State Warriors in the Western Conference finals in 2018, and wrist and finger injuries slowed him down against the Milwaukee Bucks in the 2021 NBA Finals with the Suns.--Field Level Media"
    ]
}