{
    "articleURL": "/sport/football/article-12038447/Sam-Allardyce-paid-500-000-four-game-spell-charge-Leeds.html",
    "content": [
        "Sam Allardyce set to return to the Premier League as manager of Leeds UnitedComes after the club parted ways with Javi Gracia and Victor Orta on Tuesday Former Bolton and West Ham manager set to be paid £500,000 for spellSam Allardyce will be named Leeds United manager on Wednesday on a £3million mission to beat the drop.",
        "The 68-year-old former Bolton, West Ham and England manager will be paid £500,000 to take charge of Leeds for the final four matches of the season as they fight for their Premier League lives.If Allardyce succeeds, he will net a bonus of more than £2.5million.Leeds are yet to announce the departure of manager Javi Gracia, who has been in charge for only two and a half months. But after a fast-moving 24 hours it can be revealed:",
        "Gracia has been fired and follows director of football Victor Orta through the exit door.Allardyce cannot be joined by old sidekick Sammy Lee because the 64-year-old is on jury service and has not been excused by the judge.Former MK Dons and Oxford manager Karl Robinson will be Allardyce's No 2.Allardyce will take training for the first time on Wednesday ahead of Leeds' daunting trip to Manchester City on Saturday.The hope is that Allardyce, who left his last role at West Bromwich Albion after suffering his first top-flight relegation in 2021, will have an immediate impact.Leeds are only outside the drop zone on goal difference and relegation would be hugely costly given a deal is in place with the owners of the NFL's San Francisco 49ers to buy the club.There are concerns about the impact dropping out of the top flight would have on that takeover.After the trip to the Etihad, Leeds host Newcastle before visiting fellow strugglers West Ham. They face Tottenham at home in their final game. Allardyce will hope to have Lee back from jury service before that.",
        "Leeds appointed Gracia on February 22. The Spaniard, who turned 53 on Monday, replaced Jesse Marsch and oversaw wins against Southampton, Wolves and Nottingham Forest in his first six Premier League matches.",
        "However, Leeds have taken just one point from their five matches since then, and conceded 18 goals in the process. On April 9 they went 1-0 up against Crystal Palace who, at the time, were relegation rivals. But on a morale-sapping afternoon, Roy Hodgson's side went on to win 5-1.Palace's equaliser, scored just before half-time by Marc Guehi, is viewed as a turning point by the Leeds hierarchy and the impact 75-year-old Hodgson has made since taking over at Selhurst Park in March has been noted, too.Leeds announced Orta had been sacked amid ongoing tensions between the Spaniard and boardroom figures.Mail Sport revealed on February 10 that Orta's position was under scrutiny following the dismissal of Marsch and difficulties the club found in replacing him. It is understood the Leeds ownership believed Marsch should have been dismissed significantly earlier, due to the team's poor form, but Orta wanted to back him.",
        "Unai Emery is thought to have been the unanimous choice to take over if Leeds had sacked Marsch earlier — but Emery joined Aston Villa in October.Once Marsch had been dismissed in February, Orta embarked on a shambolic pursuit of a new boss, making failed attempts to lure Andoni Iraola from Rayo Vallecano and Arne Slot from Feyenoord. Leeds finally plumped for Gracia, who lasted 70 days in the job.",
        "Chairman Andrea Radrizzani is believed to have pushed for Gracia's departure before the 4-1 loss at Bournemouth on Sunday — but Orta backed him. There were also disagreements over recruitment and transfers.Sources indicate that one of the deals about which Orta and board did not see eye to eye was the club-record £35.5m arrival of striker Georginio Rutter from Hoffenheim in January. Rutter has made just one Premier League start and is yet to score.",
        "Orta was set to leave at the end of the season after six years with Leeds, but he has gone now.In a statement confirming Orta's exit, Radrizzani said: 'I am deeply saddened by the way this chapter closes as Victor has been responsible for some of the best moments of my time as owner of Leeds.'I thank him and his people for all they have done. However, it is clear it is time to change direction and therefore we have agreed that Victor will leave the club. I understand supporters are hurt and upset, but now is a time for unity.'We have four cup finals left to play and, working together, I believe we can survive.' "
    ]
}