{
    "articleURL": "/news/article-12056823/William-tells-royal-fans-George-big-fan-70s-bands-AC-DC-Led-Zeppelin.html",
    "content": [
        "'George is into AC/DC and Led Zepplin', Prince William told royal fan in Windsor CORONATION LIVEBLOG: Click here to follow live updates throughout todayThe Prince of Wales revealed to well-wishers that his son Prince George is a big fan of rock bands AC/DC and Led Zeppelin during a surprise meet and greet.",
        "William and Kate greeted Big Lunch attendees in an unannounced walkabout for around 40 minutes on The Long Walk in Windsor on Sunday.George, nine, who is second in line to the throne, played his first major ceremonial role at his grandfather's coronation as a page of honour yesterday.Caroline Mulvihill, from the Rock Choir in Windsor and Maidenhead, spoke to William during the meet and greet.Recounting their conversation, she said: 'We were talking about the kind of music we do in Rock Choir and Will was telling us in their household they have a very diverse music taste and George is very much into AC/DC and Led Zeppelin.",
        "'It was quite interesting to hear that.'Sam Leckenby, another choir member who spoke to William, added: 'They mentioned they were quite pleased yesterday's ceremony wasn't the original five hours long. They were just really lovely.'",
        "To show their appreciation, William and Kate greeted crowds, shaking hands and chatting to revellers in some welcome sunshine after a rainy Coronation day. It comes hours before a star-studded Coronation concert at Windsor Castle which will see pop icons Lionel Richie, Katy Perry and Take That perform. During the surprise walkabout, Kate wore a light blue blazer paired with a white top, black trousers and white Vega trainers.",
        "Onlookers joked about her white shoes and warned her about the mud in Windsor.In one adorable moment, a little girl burst into tears when she met the princess as she was so overwhelmed.Kate saw the little girl sobbing and appeared to say: 'Do you want a hug?', to which the child, who was wearing a headband, gave an unequivocal: 'Yes!'The princess, who had crouched down to speak to her, continued chatting to the girl, who nodded her head and gave a small shrug as Kate patted her back. William also had a chat with her.The heir to the throne was also asked about how his father is today. He replied: 'I think his neck hurt last night, having the crown…it does weigh a hell of a lot.'Kate was also seen picking up an Union flag for a child who dropped it.Both of the royals posed for pictures with onlookers and stopped to talk to groups.The crowds gave three cheers to the couple and many people crowded round to try to get a selfie with the pair - but security had to intervene when one over-zealous fan grabbed her hair.The princess was also heard telling well-wishers 'I hope you had a good time as well' when they complimented her about how beautiful she looked at the coronation.",
        "William was heard jokingly asking crowds if they had brought bottles of alcohol with them to celebrate.A well-wisher handed the prince a can of 'Return of the King', a specially brewed organic 'Coronation ale'. He looked absolutely thrilled, and Kate smiled as her husband told the well-wisher he'd save it for later. Both royals told crowds how happy they were that the sun had come out for the celebrations at Windsor Castle.One royal fan told Kate: 'Can I just say you looked absolutely beautiful yesterday. Absolutely stunning.' The princess thanked them for their compliments and posed for photos.William was heard asking children who performed in shows at Windsor how it went while Kate asked them what songs they played.The princess also complimented children on their Union Jack face paint.Well-wishers told the pair they had 'done brilliantly' at the coronation.William was later heard telling a crying baby he needed to be 'very happy today' as he spoke to her aunt who had run over to see the future King."
    ]
}