{
    "articleURL": "/news/article-12056243/Culture-Secretary-denies-Met-went-far-policing-Coronation-protests.html",
    "content": [
        "Chairman of Met Police Federation said he was 'flabbergasted' at the backlash52 people arrested for offences such as affray, public order and breach of peaceA police chief has denied claims that officers were too heavy-handed with Coronation protesters after it emerged 52 people were arrested yesterday.",
        "Chairman of the Metropolitan Police Federation Ken Marsh said he was 'flabbergasted' that officers were facing a backlash on clamping down on those he said had sought to 'create havoc' and ruin the historic occasion.He also claimed that officers had 'foiled a number of scenarios' - including defacing public monuments with paint, breaching barriers and disrupting official movements.Officers have been heavily criticised over the arrests, with some campaign groups likening them to 'something you would expect to see in Moscow, not London '.Yesterday it emerged that three people who were detained over an alleged plot to spook military horses on procession route with rape alarms were volunteers for Westminster Council's Night Stars street patrol team.",
        "A 37-year-old woman, a 59-year-old man and a 47-year-old man were stopped by police in Soho at 2am and held on suspicion to commit public nuisance. Among items seized were several rape alarms.",
        "Two women and a man were arrested over a plot to throw rape alarms at horses during the Coronation.They were arrested in the Soho area at 2am yesterday - just eight hours before the procession.It comes just weeks after senior security sources told the Mail on Sunday protesters were plotting to sabotage the Coronation in this way.",
        "Concerns were raised at the highest level of Government last month that the stunt could lead to serious injuries or even deaths if spooked horses bolt into the crowds lining the route. A 37-year-old woman, a 59-year-old woman and a 47-year-old man were taken to a South London police station where they were questioned. The man was also further arrested on suspicion of handling stolen goods. All three have since been released on bail pending further enquiries.It was also reported that the three arrested were members of the Westminster City Council's Night Star volunteer team, who assist vulnerable people on the streets late at night.The council's cabinet member for communities and public protection Aicha Less said she was 'deeply concerned' over these reports.She said: 'We are working with the Metropolitan Police to establish exactly what happened, and in the meantime, we are in touch with our volunteers to ensure they are receiving the support they need.'",
        "However, those acting on their behalf said they regularly carry the alarms to hand out to vulnerable females outside bars and clubs and Westminster Council said it is 'deeply concerned' by the arrests.But denying that police had got it wrong, today Mr Marsh told MailOnline: 'I cannot believe what I'm hearing this morning with all the criticism of the police. I'm flabbergasted.'Did one of the biggest global spectacles we've ever had not go off impeccably without a hitch? Yes it did, and it did so due to the bravery and vigilance of the thousands of my colleagues who kept the public safe yesterday.'We had a huge amount of intelligence piling into us during the run-up to the Coronation and we managed to foil a number of scenarios throughout the day.'That included a plot to spook the horses on the procession route with rape alarms.'Let me ask you this, what do you think would've happened had 100 people decided to pull the pin on a rape alarm at the same time as the horses cantered past? I'll tell you, it would've been carnage, beyond horrific.'The horses would've reared up and potentially thrown their riders and the animals could've run straight into people in the crowd.'There were people out to create havoc yesterday but the intelligence was good. We know what we're doing, I'm not going to go into specifics for obvious reasons but we've got people close to these groups.",
        "'There were heightened levels of anxiety going into the Coronation at what was being by planned by who but it passed off peacefully and without disruption because of quick-thinking police work.'Protesters from anti-monarchy, climate and animal rights groups were arrested for affray, public order offences, breach of the peace and conspiracy to cause a public nuisance around the Coronation.Mr Marsh added that officers had also foiled a plot by eco activists posing as royal super fans to set up camp on The Mall in the days before the Coronation to gain close access to the procession route.Also in defence of the Met was Culture Secretary Lucy Frazer, who insisted that the Met Police got the 'balance right' and that she trusted the police to use new laws to prevent disruptive protests.Asked whether the police went too far, Ms Frazer told Sky News' Sophy Ridge On Sunday programme today: 'No. The police are operationally independent from Government.'What they had to do was to police an international event on the world stage and I think they took that into account in their policing.'What they have to do is balance the right to protest, which is important in a democracy. At the same time there's the right of all those other people to enjoy what was a fabulous day. I think, overall, they managed to get that balance right.'",
        "Among those detained was the head of the anti-monarchy group Republic, who branded the detention of him and dozens of others a 'direct attack on our democracy'.",
        "Graham Smith, who was released on Saturday night after nearly 16 hours in police custody, said officers should 'hang their heads in shame'.The Metropolitan Police confirmed that 52 people were arrested for affray, public order offences, breach of the peace and conspiracy to cause a public nuisance around the coronation.Mr Smith said a total of eight members of Republic's team were arrested as they prepared for 'a peaceful and lawful protest'.",
        "He told the PA news agency officers had been 'intimidating, heavy-handed, not willing to listen, not willing to co-operate or to engage'.He added: 'They clearly made up their mind they were going to arrest us the moment we got there.'They were arrested for being equipped for locking on, a new offence under the controversial Public Order Act.In a statement, Mr Smith said: 'These arrests are a direct attack on our democracy and the fundamental rights of every person in the country.'Each and every police officer involved on the ground should hang their heads in shame.'He said the right to protest peacefully in the UK 'no longer exists' and that the detentions 'destroyed whatever trust might have existed' between campaign groups and the police.",
        "Asked what further action he and other members of Republic face, Mr Smith told PA: 'We don't know. We've all been bailed, that's all we know. So, we will hear about whatever happens later.'Police said they understood public concern but insisted they acted after receiving information that protesters were determined to disrupt the Coronation procession.Under the controversial new Public Order Act, protesters who have an object with the intention of using it to 'lock on' are liable to a fine, with those who block roads facing 12 months in prison.Following the arrests, Labour shadow health secretary Wes Streeting said it was important for police to provide 'accountability' over concerns raised about how protesters at the Coronation were treated.Asked if police got it right when it came to protesters at the coronation, he said: 'I wasn't there, didn't see, not across the details of specific cases yet, and so I don't think it's appropriate for me to provide a running commentary without all of the facts.",
        "'I think it's the accountability that's important and where concerns have been raised, whether that's by Republic, the campaign for an elected head of state, or people more generally just concerned about they've read in the papers or seen on the telly, it's important that the police provide that accountability.'",
        "But Liberal Democrat deputy leader Daisy Cooper said she has 'some concerns' over how the police handled protests at the coronation.Asked on the same programme about whether police got the balance right, she said: 'I've got concerns that they may not have done. We still need to see some more information coming out about what's actually happened.'Some of that information is unfolding. But, on the face of it, I do have concerns.'She added: 'What worries is me is that the Conservative government have now increased these sort of wide-ranging powers... what they haven't done is enshrined the sort of legal responsibility and the duty on the police to actually facilitate peaceful protest.'She also told the programme: 'I think in this country we've got lots of people who are staunch royalists, and some who are sort of staunch republicans, I put myself sort of somewhere in the middle.'",
        "Metropolitan Police Commander Karen Findlay acknowledged concerns about the arrest of protesters but defended Scotland Yard's actions, saying: 'Our duty is to do so in a proportionate manner in line with relevant legislation.'The Met said it received information that protesters were 'determined to disrupt' the coronation - including defacing public monuments with paint, breaching barriers and disrupting official movements.",
        "But campaigners said the protests were 'peaceful', describing the arrests as 'a dangerous precedent for us as a democratic nation'.The force confirmed reports from Just Stop Oil that 13 demonstrators were detained on The Mall and six public nuisance arrests on St Martin's Lane following protests from Republic.Three people were also apprehended in Soho, three at Wellington Arch and five on Whitehall on conspiracy to cause public nuisance, with another in Whitehall arrested for religiously aggravated behaviour likely to cause harassment.The Met said a further 14 people were detained in east London on suspicion of conspiracy to cause a public nuisance.Footage from the Mall showed the Just Stop Oil protesters being handcuffed and taken away by a heavy police presence.Animal Rising said a number of its supporters were apprehended on Saturday while at a training session 'miles away from the coronation'.Nathan McGovern, spokesman for the campaign group, described the arrests as 'nothing short of a totalitarian crackdown on free speech and all forms of dissent'.Human Rights Watch labelled the arrests 'incredibly alarming', adding: 'This is something you would expect to see in Moscow, not London.'Amnesty International's chief executive Sacha Deshmukh also raised concerns after police were reportedly given instructions to apprehend people with megaphones.Meanwhile senior Tory MP Lee Anderson drew ire for telling anti-monarchy activists to 'emigrate'.The deputy chairman of the Conservative Party was commenting on the arrests of protesters from the Republic group.He appeared to side with the police, especially against protesters who were holding up signs reading Not My King near Buckingham Palace.Sharing a MailOnline article about the arrests on Twitter, Mr Anderson wrote: 'Not My King? If you do not wish to live in a country that has a monarchy the solution is not to turn up with your silly boards. The solution is to emigrate.'Critics on social media condemned his 'anti-democratic' remarks and pointed out the right to protest peacefully, while others expressed support for his opinion."
    ]
}