{
    "articleURL": "/wires/reuters/article-12042989/Leonardo-posts-lower-Q1-profits-earnings-orders-rise.html",
    "content": [
        "ROME, May 3 (Reuters) - Italy's state-controlled defence and aerospace group Leonardo on Wednesday posted lower first-quarter profits and earnings, but reported a jump in orders and confirmed financial targets for 2023.",
        "Net profit stood at 40 million euros ($44.2 million) compared to 72 million euros 12 months earlier, while earnings before interest, taxes and amortisation (EBITA) fell year-on-year by 20.5% to 105 million euros.Revenues were flat at around 3 billion euros, while new orders rose by 28.5% year-on-year to almost 4.9 billion euros \"in particular thanks to the excellent performance of helicopters,\" the company said in a statement.The results were below analysts' expectations.In a company-provided consensus forecast, they had expected a quarterly net profit of 48 million euros and EBITA of 120 million euros, but revenues were correctly predicted at around the 3-billion-euro mark.The company provided reassurance on its likely performance for the year as a whole.\"In view of the results achieved in the first quarter of 2023 and the expectations for the coming periods, we confirm the guidance for the entire year,\" Leonardo said in a statement.The 2023 guidance includes a forecast for new orders at around 17 billion euros, revenues in the 15-15.6 billion euro range, EBITA at 1.26-1.31 billion euros and group net debt of about 2.6 billion euros.\"Our very positive commercial performance, programme delivery and growing Top-Line are accompanied by a financial performance showing a strong and continued FOCF (cash flow) improvement and further steps forward in the path of debt reduction,\" CEO Alessandro Profumo said.",
        "The Moody's credit ratings agency upgraded Leonardo by one notch, to Baa3 from Ba1, citing its credible debt reduction path, stable dividends policy and solid growth prospects for the defence industry as a whole. ($1 = 0.9052 euros) (Reporting by Alvise Armellini, editing by Gianluca Semeraro and Keith Weir)"
    ]
}