{
    "articleURL": "/tvshowbiz/article-12042263/Broadchurch-star-Sarah-Parish-pays-tribute-late-daughter.html",
    "content": [
        "Broadchurch star Sarah Parish paid tribute to her late daughter Ella-Jayne on what would have been her 15th birthday on Wednesday.",
        "The actress, 54, took to Instagram to share a picture of the funeral order of service which showed her little one - who passed away at eight months old. In 2009 she and her husband, the actor James Murray, lost Ella-Jayne to a congenital heart defect.In her tribute post Sarah wrote: 'Today you are 15. How lucky we are to have known you. Who knew such a little girl could make such a big difference. 'We love you, forever and always. @thejimmurray @themurrayparishtrust.'",
        "She was sent support from her kind followers on the post including from Amanda Holden who wrote: 'Sending you both a big cuddle x.'In 2014 her and James set up the Murray Parish Trust, dedicated to advancing paediatric emergency medicine in the south of England. Working with another local charity, they've succeeded in raising over £2.5 million for Southampton University Hospital, which the government matched and it paid for a new children's emergency and trauma department. Sarah has previously said that before the death of her daughter she had a 'very easy life' and that the harrowing experience 'made me a better person'. In the aftermath of her death, they went to Cambodia and spent two months working in an orphanage. It turned out to be the first step on a new path and in 2014 they set up the Murray Parish Trust, dedicated to advancing paediatric emergency medicine in the south of England. ",
        "Working with another local charity, they've recently succeeded in raising over £2.5 million for Southampton University Hospital, which the government matched; it paid for a brand new children's emergency and trauma department.'I'd had a very easy life before that,' Sarah said in 2019. 'Nothing awful had ever happened to me. But with something like that, I know it's a real cliché, but it has made us. ",
        "'And the charity – especially running alongside careers as actors – is perfect. It's the ideal thing to do, because as an actor you really do have the space to become an awful person if you want.'Because everything is based around you and what you need. It's a great job and we're very lucky. Then when you work on a charity alongside it, and you see what life is, the really bad side of life, it just makes what you do [for a living] amazing, you know. My job is my holiday and the charity is my job.'Speaking about her relationship with James and the impact the death had on them, she added: 'It changed us as people, definitely. It has to. And actually, the older you get, the more people you meet who have lost children. 'A lot of people lose children in far worse circumstances than Jim and me. Ella-Jayne was only eight months old, she was very poorly anyway, so we were already prepped for what could happen. ",
        "'Whereas I've met people along the way who had a healthy child, everything was good, and suddenly they've gone. ",
        "'I've known people who have lost their children at the age of 16. It's just unbearable. It will always change you as a person. It's changed us for the better, I think.' She and James have a second daughter, Nell, who is now 13 years old. Sarah played the character Dawn Rudge in the ITV drama series Peak Practice in 1993, but more recently starred in the third and final series of Broadchurch as Cath Atwood.She also played Katie Roden in the BBC One series Mistresses between 2008 and 2010."
    ]
}