{
    "articleURL": "/sciencetech/article-12038377/From-unborn-babies-guns-craziest-things-3D-printers.html",
    "content": [
        "3D printing started in the 1980s but has exploded to create unique itemsPeople are using these systems to print homes, food and even unborn babies READ MORE: A cheap 3D printer is all you need to fashion your own firearm 3D printing was once thought of as a futuristic technology to print anything on demand - but companies and ordinary people are using the systems to create everything from fetuses to guns and even homes.",
        "The systems use a computer design to create three-dimensional objects by layering materials on each other. The early beginnings of 3D printers - the first device was released in 1981 - saw people make small figurines and models to make other products.However, 3D printers are revolutionizing the healthcare industry by letting medical professionals print hearts, skin and even ears in hours - eliminating the need for organ donors. Companies are also creating replicas of fetuses using pictures taken during ultrasounds. This allows new parents to hold their babies before birth.Food and homes are also gaining popularity.Researchers can print meats without killing animals and homes can be constructed in days instead of years.  Below are six of the most bizarre things crafted with 3D printers.",
        "3D printing, also known as additive manufacturing, is a process that creates three-dimensional objects layer-by-layer using a computer-created design. Specific materials are developed into inks that the printer layers on top of each other to make the finished product that is based on the computer model chosen by the user. The technology was birthed in the 1980s but has become popular over the last few years due to printers being more accessible. This is also due to the dramatic drop in price, with some as low as $300, and the changes in operation have become so easy that the average person can operate them.",
        "Unborn babies Expectant parents can now get a 3D-printed model of their unborn child.Ultrasound images can build a three-dimensional view of a fetus and recreate its features in stunning detail.The model can be used to give parents an early glimpse at their baby, or it can be used to look for signs of physical abnormalities.One company called Embryo 3D layers MRI scans to create an accurate plastic model of a baby.Brazilian designer and Royal College of Art PhD student Jorge Lopes uses images of fetuses to prepare parents for deformities and, in one case, to allow a blind couple to 'see' their unborn child when they cannot appreciate traditional ultrasound images. Japanese company Fasotec 3-D prints human anatomy for medical applications as teaching tools. Their printers can print with two materials simultaneously, allowing them to distinguish between tissue types in the body.",
        "GunsThe first 3D-printed gun was unveiled in May 2013 using simple blueprints known as the Liberatore.The plastic gun, which cost $8,000 to make, was found to have the power to penetrate several inches of flesh and a human skull.While the State Department demanded the design be taken offline after two days of the gun being online, the Liberator paved the way for people to make at-home guns.",
        "Materials for a 3D-printed gun differ significantly from those used to make jewelry or figurines.3D Printerly suggests using High-Temp or reinforced Nylon, which is strong and durable.Nylon can also withstand the heat and stresses produced by the gun for a more extended period than other materials. ",
        "While it is legal to print a gun, such weapons are surrounded by controversy - mainly due to guns being made available to terrorists. In March 2023, a 30-year-old man was arrested for drug possession and making ghost guns at home with a 3D printer.Julia Fox's brother, Christopher Fox, was arrested last month in a drug and ghost gun bust in their New York City apartment.Prosecutors say police seized three 3D printers, multiple gun parts, a pill press, and fentanyl, cocaine, heroin, oxycodone, buprenorphine, amphetamine, and methadone.Fish fillets and other food itemsScientists worldwide have been working to develop more sustainable foods using the powers of 3D printers.Steakholder Foods unveiled the world's first 3D-printed fish fillet in April, noting the grouper is ready-to-cook once completed.The Israeli company used grouper fish cells to make the printing ink and claims the final product has the same taste and texture as the real thing. Israel-based MeaTech unveiled the world's largest lab-grown steak in December 2021. The steak weighs in at 3.67 ounces and is made from real fat and muscle cells taken from tissue samples of a living cow. ",
        "The printed slab of 'meat' was then matured in an incubator, allowing the stem cells to be differentiated into fat and muscle cells that develop into fat and muscle tissues. ",
        "And in March 2023, engineers at Columbia University the world's first 3D-printed cheesecake.The technology makes the dessert by meticulously layering seven edible inks to form a triangular shape.The foundation ingredient is graham crackers, and the layers consist of peanut butter, Nutella, cherry drizzle, banana puree, strawberry jelly and whipped cream. The team has not shared how the cheesecake tastes - only that it is vegan.Chocolate is a great 3D printing substance because it can be layered, melted, and hardened. Several companies sell 3D-printed chocolate, including chocolate behemoth Hershey. Homes Unlike 3D printers that make food, guns and unborn babies, the devices that create full-size homes are massive.",
        "A 3D-printed house described as America's first 'home built by robots' went on sale for $300,000 in New York in 2021.It was constructed in just 80 hours using a giant 3D printer. The three-bedroom Long Island property made from concrete and comes with two bathrooms and a garage was put together in a computerized process requiring as few as three construction workers on site.In the same year, a Dutch couple moved into Europe's first 3D-printed home built in five days. ",
        "The house comprises 24 concrete elements 'printed' by a machine that squirts layer upon layer of concrete before the finishing touches - such as a roof - are added. ",
        "The layers give a ribbed texture to its walls, inside and out. Mighty Buildings, based in California, claims it can manufacture a 350-square-foot studio unit in less than 24 hours, providing owners with a peaceful hideaway or a holiday cabin to accommodate guests.The firm offers various units on its website, ranging from a dinky studio to a luxury family home, printed with liquid synthetic stone that hardens almost instantly. Human body parts Bioprinting has been birthed from the popularity of 3D printing, which uses a patient's cells to create sheets of artificial skin that can be used during surgeries. The technology was used in 2022 to give a woman the world's first 3D-printed ear. ",
        "The 20-year-old, known only as Alexa from Mexico, was born with a rare birth defect that causes the external part of the ear to be small and misshapen.The woman's chondrocytes — cells responsible for cartilage formation — were isolated from the tissue sample and grown with nutrients to turn them into billions of cells.These cells are mixed with collagen-based bio-ink, which is shaped into an outer ear after being inserted into a specialized 3D bio-printer with a syringe.",
        "A printed, biodegradable shell surrounds the implant to provide early support, but it is absorbed into the patient's body over time.After a while, the implanted ear is supposed to mature, developing a regular ear's natural look and feel, including elasticity, and be a mirror replica of the patient's healthy ear.",
        "The whole printing process took less than 10 minutes.Researchers at Tel Aviv University in Israel unveiled the first 3D-printed heart in 2019, using human tissue and blood vessels.The organ is about the size of a rabbit's heart and can contract like a muscle but cannot make a full pumping motion. Cars 3D-printed cars are gaining ground as different technologies advance.The world's first 3D-printed car debuted in 2011, which was made using a particular printer that built up layer upon layer of bodywork.Called Urbee, the vehicle was designed to last 30 years.",
        "The country's medical review board has given the green light for use of the coffin-like devices, named Sarco Suicide Pods, which have been designed for use in assisted suicide and can be operated by users inside ",
        "It features a gas and electric engine and uses eight times less energy than a similar vehicle.The Urbee, which took 15 years to make, has three wheels, two seats and a combustion engine in case of emergencies. Since 2011, many carmakers have adopted 3D printing in making specific components and designs of vehicles.The process uses less material, designs faster prototypes and saves space in factories. British-based Aston Martin recently employed the technology when designing the DBR22 model.The car features a 3D-printed rear subframe with aluminum parts bonded together to form the finished subframe. A few models will be built for a handful of select Q customers at an undisclosed price of more than $2.2 million.NOWlab unveiled the world's first 3D-printed motorcycle in 2018, called Nera - but it is not yet for sale.The company printed everything on the bike - tires, rims, frame, fork and seat. The motorcycle was 3D-printed using the fused filament fabrication (FFF) process, which feeds a continuous filament of thermoplastic material through a moving, heated printer extruder head. "
    ]
}