{
    "articleURL": "/tvshowbiz/article-12047509/Cara-Delevingne-opts-casual-look-black-sweatshirt-joggers-strolls-NYC.html",
    "content": [
        "Cara Delevingne cut a very casual figure on Thursday as she strolled through New York City with her celebrity pals Samara Weaving and Ashley Cook. ",
        "The model, 30, opted for a very different appearance to her glamorous Met Gala display on Monday. Cara donned a black sweatshirt from Elton John's Welcome To Yellow Brick Road merchandise, which she paired with black joggers as a tribute to the music legend's farewell tour. Her laidback look was emphasised by a tan beanie hat and white sneakers as she enjoyed spending some quality time with her friends. Cara appeared deep in conversation with actress Samara and Selena Gomez's pal Ashley.  ",
        "The Paper Towns star went make-up free to showcase her natural and enviable features. Meanwhile, her hair was back to its normal style in a chic shoulder-length cut, after she displayed a silver wig at the Met Gala.  Her casual appearance came after her dressed-up appearance at the Met Gala earlier in the week, where she paid tribute to Karl Lagerfeld in a silver wig and white caped shirt-dress. When the 'genius' German designer died, age 85, in 2019 from complications of pancreatic cancer - the British 30-year-old wrote that he was 'one of the most interesting and caring men I have ever met.''It is a big night, yeah, a lot of emotions honestly. I cried on the way here a little bit,' Cara - who created a capsule 'Cara Loves Karl' collection last year - admitted to Vogue on Monday.",
        "'It's a wonderful thing to be able to do this and honor such an incredible person - not only in fashion but personally as a friend. I owe him so much and it's an amazing way to remember him.'Delevingne transformed into 'Cara Lagerfeld' by donning a 'silvery blue' short wig by Noah Scott, which was coiffed into textured waves by hairstylist Danielle Priano.Meanwhile, the star's beauty look was created by makeup artists Hung Vanngo - who revealed he prepped the supermodel's skin with Cetaphil products to avoid aggravating her psoriasis. The Carnival Row star donned a white custom Karl Lagerfeld mini shirt-dress, black thigh-high leg warmers, matching stilettos, fingerless gloves, and Chrome Hearts jewelry selected by styling duo Rob Zangardi and Mariel Haenn.",
        "Karl - who first hired Cara in 2012 - was rarely seen without one of his iconic white shirts, of which he's said to have owned 'thousands.'It was Delevingne's 11th time attending the $50K/ticket Costume Institute benefit, and enlisted make-up artist Hung Vanngo and nail artist Thuy Nguyen to complete her special look for the evening.The Tell It Like a Woman actress experienced a wake-up call after 'heartbreaking' images published by DailyMail.com last year compelled her to check herself into $50K/month rehab Cirque Lodge in Utah for mental health and substance abuse issues last December.",
        "On Monday, Cara - who boasts 64.1M social media followers - shared an Instagram slideshow of her Met Gala look captioned: 'This one's for you KL.''She is the It Girl of the moment, because she's not fake,' Lagerfeld gushed of Delevingne back in 2013.'She's a real person. There's something real and caring about her. She's not fake. [I worked with her] when she was unknown, well yeah, because from the second I saw her I knew there was something [special about her].'The Only Murders in the Building star has been hard at work filming her mystery role opposite Emma Roberts in the 12th season of Ryan Murphy and Brad Falchuk's FX horror anthology series, American Horror Story.Cara - who has ADHD - is currently dating singer Minke after her past romances with Ashley Benson, Paris Jackson, St. Vincent, Michelle Rodriguez, Jake Bugg, and Miley Cyrus.",
        "But no one would know Delevingne had she not been the nepotistically-privileged granddaughter of publishing magnate Sir Jocelyn Stevens and goddaughter of Joan Collins.The decision to honour Karl has sparked controversy given the many offensive remarks he has made over the years, from slamming the #MeToo movement to opposing same-sex marriage.'I'm against it for a very simple reason: In the 60s they all said we had the right to the difference. And now, suddenly, they want a bourgeois life,' he told Vice of same-sex marriage.",
        "'It's difficult to imagine—one of the papas at work and the other at home with the baby. How would that be for the baby? I don't know. I see more lesbians married with babies than I see boys married with babies. And I also believe more in the relationship between mother and child than in that between father and child.'While he ultimately showed his support for same-sex marriage at his spring 2013 Chanel haute couture show, he still said he was 'less keen' on same-sex couples adopting children, according to AP."
    ]
}