{
    "articleURL": "/sport/afl/article-12056379/Swans-boss-John-Longmire-SLAMS-Collingwood-fans-loudly-booing-Buddy-Franklin.html",
    "content": [
        "Buddy Franklin was booed by Collingwood fans at the MCGThe Swans superstar finished goalless as Sydney lost  by 29 pointsJohn Longmire questioned the behaviour of Pies fans who jeered Franklin Sydney coach John Longmire has questioned the behaviour of Collingwood fans who booed Buddy Franklin during the Pies' 29-point win over the Swans on Sunday.",
        "Collingwood returned to the top of the ladder with a comfortable 11.11 (77) to 6.12 (48) win over Sydney in the first meeting between the two sides at the MCG in a decade.Franklin, who finished goalless and struggled against the Pies' suffocating defence, was loudly booed and jeered almost every time he touched the Sherrin.Speaking after the game, Longmire admitted being perplexed by the reception and suggested Collingwood fans should have cherished watching Franklin in action.The Swans superstar is under contract until the end of the season, when he is widely expected to bring down the curtain on an extraordinary career.",
        "The 36-year-old has won two premierships, four Coleman Medals and last year became only the sixth player in VFL/AFL history to kick 1,000 goals in his career.'I don’t know why they would [...] why would you boo him?,' Longmire said in his press conference. 'Probably celebrate a 36-year old wouldn’t you, that’s been a champion of the game.'It’s been 10 years since we’ve played Collingwood here, why would you boo one of the champions of the game? It doesn’t make sense to me.' Collingwood boss Craig McRae echoed his stance, insisting he did not want Pies fans to boo opposing players.'I’ve said this before, I’m not a booer and we don’t boo at home,' he said.",
        "'I must admit, I didn’t hear it, I don’t know if [it’s because] we had the headsets on or whatever. But we just don’t boo.'Booing has been an issue in the AFL this season, with Port Adelaide star Jason Horne-Francis singled out in a number of games.",
        "Saints boss Ross Lyon was unhappy at St Kilda fans' treatment of the young gun after he was jeered during the Power' seven-point win in Round 7Power coach Ken Hinkley defended Horne-Francis angrily a fortnight ago and Lyon was unimpressed at fans booing the 19-year-old whenever he has the ball.'People were doing as a mob that they wouldn't do as individuals. Maybe just check yourself [...] there's a lot of mental stress of players,' he said.'If you're doing it to put him off his game [...] well, clearly it doesn't work, which is good for the kid, so maybe don't boo him.' "
    ]
}