{
    "articleURL": "/femail/parenting/article-12045717/My-son-YEARS-younger-grandson.html",
    "content": [
        "Jane McNeice, 47, from Doncaster has nine-year-old boy younger than his niece READ MORE: Man shares how his 106-year-old grandmother has defied the oddsA young grandmother has explained how her granddaughter ended up being older than her son.",
        "Jane McNeice, 47, from Doncaster has a nine-year-old boy and her daughter Laura, now 27, has an 11-year-old girl.To make matters even more complicated, Jane - an author and businesswoman - also has a seven-year-old son, who is the same age as his niece. The author and business woman had first become a grandmother in her mid-30s when her Laura fell pregnant at 15 - deliberately. As an exceptionally young grandma, this resulted in an even more unusual situation when she had her second child, Oliver, now nine, at 37 - making him younger than his niece, Evie, now 11. ",
        "The grandmother-of-four went on to reveal that after Laura's initial pregnancy with Evie and her pregnancy with Oliver - the pair ended up pregnant at the same time just a few years later.This saw Jane welcome Ben and Laura welcome, Bella - both now seven - to the family.'I was heavily pregnant. She was newly pregnant,' Jane said of the experience.Because of that, there were some times where she breastfed her grandchildren. 'I think that's quite extreme and that won't feel comfortable for everyone,' she admitted.'There will be some people who think that is amazing and a complete privilege. And there will be other people who are making sicky noises at that.'",
        "While Jane is now delighted with her family set-up and enjoys being able to spend time with her grandchildren while she's young - Laura's teen pregnancy was initially 'quite a shock' for her.The mother-of-three admits she was 'absolutely devastated' to first hear Laura's announcement, having also chosen to become a young mother herself when she fell pregnant at 18.",
        "She had even initially asked her daughter to have a termination - which Laura didn't go through with.'We had unusual circumstances as Laura was planned even though I had her young,' Jane explained.'But what we learned later was that Laura's pregnancy was also planned.'What we have found out in the last couple of years is reasons why we might have chosen motherhood quite early on. We are both autistic.'Jane, who described having autism as an 'identity', said that she had tried to find this sense of identity in a number of ways prior to her diagnosis. The author, who also has a first-class honours degree in criminology initially seeking her sense of self in the 'criminal fraternity' community - but 'fortunately didn't find it there'.Jane then spent 'the last 15 years searching through her work in mental health'.",
        "The mother-of-three said that, looking back, she spent 'pretty much her whole life' attempting to work out 'what she felt was wrong with her' - and this included her attempts to get a correct diagnosis and 'understanding', which 'failed'.",
        "However, the unexpected answer that she'd been searching for came through Oliver, then six, who displayed challenging behaviour during the first Covid-19 lockdown.Jane's husband then speculated that he was suffering from ADHD, and the parents were directed to various Facebook groups.She said: 'I was scrolling through the page on Saturday morning and I just came across the post titled girls with autism with symptoms listed around, and I literally just went, \"Tick, tick, tick.\"'I knew straight away.'Jane was then formally assessed at the earliest available opportunity, a process that ultimately saw her wait a year to be diagnosed.By this point, Laura, now a mother-of-four, had also began to suspect that she had autism.'I was diagnosed within five minutes of being in the room,' Jane said. 'And then two months after me, my daughter was diagnosed at age 26, and three months after that Oliver was diagnosed.'",
        "The grandma explained this reflects the fact that autism often runs in families, and while she was not initially happy about Laura's teenage pregnancy, over time, she has realised that their life paths were never going to be the same as neurotypical people's.She also admits her initial anxiety over Laura's pregnancy came about because of 'neurotypical ideals' she had 'bought into'.",
        "'Your child does well, they go off to university, and they get a great job. They get married, they have to 2.4 for children, a nice house, a nice car,' she listed.'Now that we know we're autistic, we're able to say what is normal for us? It's a different standard to what is normal for a neurotypical family.'The grandma, who also has grandchildren waiting on an autism assessment, said that there's been some big advantages to their seemingly abnormal, normal, which she now 'sees as a variant not a fault.'For one, her youngest children and grandchildren are 'never without a friend'.'Autistic people struggle to make friends,' she said. 'We are simply different. The biggest challenge is we live in a society that does not accept difference, and is highly judgemental of it in many cases..'For Jane, there's only one real downside to being a young grandmother.And that's not being able to spend as much time with her grandchildren as she'd like to because her own kids are still so young.She wrote a book about her experiences with late-diagnosed autism, The Umbrella Picker.'Look at literature out there, reader other stories and connect with them,' Jane advised for anyone who may curious if they are also neurodivergent.",
        "'If you've got suspicion you are, I generally find that most people are pretty accurate with their own suspicions.'The decision to seek assessment is an individual choice, and for me, one of the best decisions of my life.'",
        "According to the Centers for Disease Control and Prevention, people with autism have trouble with social, emotional and communication skills that usually develop before the age of three and last throughout a person’s life. Specific signs of autism include: Reactions to smell, taste, look, feel or sound are unusualDifficulty adapting to changes in routineUnable to repeat or echo what is said to themDifficulty expressing desires using words or motionsUnable to discuss their own feelings or other people’sDifficulty with acts of affection like huggingPrefer to be alone and avoid eye contactDifficulty relating to other peopleUnable to point at objects or look at objects when others point to them"
    ]
}