{
    "articleURL": "/wires/pa/article-12043939/Erling-Haaland-sets-new-Premier-League-scoring-record-Man-City-return-top.html",
    "content": [
        "Erling Haaland set a new Premier League goalscoring record as title favourites Manchester City reclaimed top spot with a comfortable 3-0 win over West Ham.",
        "The prolific Norwegian raced through for league goal number 35 of the campaign – surpassing the previous best mark held by Andy Cole and Alan Shearer – on 70 minutes as City eased to victory at the Etihad Stadium on Wednesday.His sweet left-footed chip over Lukasz Fabianksi came after Nathan Ake had headed City in front on 50 minutes and before Phil Foden wrapped up victory with a deflected long-range volley.The win took the treble-chasing champions a point above Arsenal at the summit and, with a game in hand, they seem to be cruising towards a fifth title in six years.The victory came 25 years to the day after City were relegated to the third tier of English football in one of the lowest points of the club’s history.The contrast with the team now is remarkable, although City – perhaps with next week’s trip to Real Madrid in mind – were far from their energetic best.Again they were without the dynamism of Kevin De Bruyne through injury and the atmosphere was far more subdued than for last week’s seemingly pivotal win over Arsenal.That lack of spark transmitted itself to the field in a slow start and West Ham may wonder what might have been had a sickness bug not robbed them of key players including Declan Rice and Tomas Soucek.",
        "Yet with Haaland, City always posed a major threat and his strike, his 51st overall this season, was yet another demonstration of his awesome firepower.",
        "Neither side created a clear-cut chance in the opening 30 minutes and West Ham threatened first when Jarrod Bowen got to the byline. Goalkeeper Stefan Ortega, standing in for the rested Ederson, blocked at the near post.City picked up the pace in response with Jack Grealish cutting inside and lashing a shot against the outside of the post from a tight angle.Haaland then combined with Rodri to send the Spaniard through on goal but his low shot struck the base of the post and rolled across goal.The breakthrough came five minutes after the restart as Riyad Mahrez clipped a free-kick to the back post and Ake stole in to head past Lukasz Fabianski.Haaland appealed for a penalty after going down under a Thilo Kehrer challenge but nothing was given.The striker was not to be denied, however, as he was released by the hard-working Grealish and calmly lobbed over Fabianski.With the job done, City eased towards the final whistle and Foden had the final word with a well-struck volley from distance that flew in off Emerson Palmieri.It was City’s 1,000th goal in all competitions under Guardiola and wrapped up an excellent night’s work.",
        "City celebrated Haaland’s achievement by giving him a guard of honour as after the final whistle."
    ]
}