{
    "articleURL": "/sport/football/article-12041301/Sam-Allardyce-admits-never-thought-Leeds-come-calling-interview.html",
    "content": [
        "The Yorkshire club announced the departure of Spaniard Gracia on WednesdayLeeds have lost four in a winless run of five matches and have four games leftThe survival specialist confirmed that Karl Robinson will be on his coaching staff Sam Allardyce has admitted he 'never thought' Leeds United would come calling in his first interview since replacing Javi Gracia.",
        "Having already removed director of football Victor Orta, the Yorkshire club announced the departure of Spaniard Gracia on Wednesday morning, along with his backroom staff, and the appointment of Allardyce.A poor season at Elland Road sees the club languishing in 17th and only goal difference keeping them out of the relegation zone.They have lost four in a winless run of five matches and have brought in Allardyce for the final four games of the season with a remit of keeping the club in the Premier League.The statement from Leeds was published nearly 45 minutes after Allardyce appeared on talkSPORT to confirm he was taking the job.",
        "The 68-year-old told talkSPORT: 'I was shocked. I never thought at this stage of the season… I thought there would be no jobs.'The phone popped up with a name I knew fairly well, I knew what it was, and it took me two seconds to say yes.'I'm here overlooking the training ground and the fabulous facilities and I'm excited to be involved.'A tingle runs through your veins when you take over at a football club. I know it's in a lot of trouble, but I've seen a lot of trouble before.'I could've done with more time, but we've got four games and hopefully I can keep this fabulous club in the Premier League.'",
        "The survival specialist also confirmed that Karl Robinson will be on his coaching staff.Discussing the club's fixtures, he said: 'They are obviously very difficult games. We can all point out where the easiest one might be, but of course, there are no easy fixtures in the Premier League.'We can only do what we can try and achieve, from my point of view, that is stopping the goals from going in.'We've conceded 28 goals in the last 10 or 12 games and that has to stop if we're going to get out of trouble. We're needing to score three goals every game to win.'If we're left to do that, that will be impossible. I'm doing all I can with the staff to try and get the players out of trouble.'Leeds travel to leaders Manchester City on Saturday, before hosting third-placed Newcastle. A trip to West Ham and an Elland Road encounter with European hopefuls Tottenham round out the season. A club statement read: 'Leeds can confirm Javi Gracia will leave the club after 12 games in charge.'Zigor Aranalde, Mikel Antia and Juan Solla, who joined alongside Gracia, will also leave the club.'We thank Javi and his team for their efforts under difficult circumstances.'The remaining four games of the season will be overseen by experienced head coach Sam Allardyce.",
        "'Allardyce has managed over 500 Premier League games in a managerial career stretching 29 years and he brings a wealth of knowledge in fighting for survival, having guided a number of his previous clubs to safety.'His first experience of the top-flight came with Bolton Wanderers, who he would guide into Europe for the first time in the club’s history.",
        "'Following this, he went on to manage Newcastle United, Blackburn Rovers and West Ham United, earning promotion to the Premier League in his first season with the Hammers.'Over the past decade he has successfully helped Sunderland, Crystal Palace and Everton avoid relegation from the Premier League during short-term stints.'Allardyce will be assisted by former MK Dons, Charlton Athletic and Oxford United manager Karl Robinson.'His first game in charge of the Whites will be Saturday’s Premier League away trip at Manchester City.'"
    ]
}