{
    "articleURL": "/wires/pa/article-12049077/What-papers-say--May-5.html",
    "content": [
        "One day before the coronation, many of Friday’s newspapers plump for the coronation on the front pages, along with an array of other stories.",
        "The Daily Express echoes the words of the Dean of Westminster who said the King is “relaxed” ahead of the big day.There is a note of caution in the Daily Mail, which calls China’s decision to send vice-president Han Zheng to the coronation as an “insult to Britain” after his role in restricting freedoms in Hong Kong.The Daily Telegraph focuses on the music at the coronation with Lord Andrew Lloyd Webber saying he hopes his specially composed anthem will be sung in churches.While the Daily Star finds a different slant as it likens the King to football manager Sam Allardyce.“Cheers” is the simple headline in The Sun over a picture of the Prince and Princess of Wales toasting the King during a visit to a pub, while it also mentions 400,000 servicemen, emergency services and royal staff receiving a coronation medal.",
        "William and Kate’s trip to the pub via tube also makes the front of the Metro, which reveals the couple opted for cider at the Dog and Duck in Soho.The Daily Mirror also features the royal couple’s trip to the pub, but it leads on what it calls the “obscene” profits reported by Shell.That story is also the choice of the i, which concentrates on the oil giant installing expensive pre-payment meters in homes while making a £32 billion profit.",
        "The Times features a picture of Kate in the pub while reporting that coronation chicken is outstripping the new royal quiche at street parties, but leads on plans to use prisoners on day release to plug labour shortages.Artificial intelligence takes centre stage on the front of The Guardian which focuses on a review into its growing influence.The only newspaper not to feature the coronation at all on the front is, not surprisingly, the Financial Times which focuses on the European Central Bank raising interest rates and warning the fight against inflation was not over."
    ]
}