{
    "articleURL": "/wires/pa/article-12051225/Alistair-Johnston-make-quick-comeback-play-Celtic-season.html",
    "content": [
        "Celtic full-back Alistair Johnston might play again this season while Cameron Carter-Vickers is expected to be back for the start of next term.",
        "Canada international Johnston joined the post-match celebrations at Hampden on crutches after suffering a lower-leg injury following a challenge on Rangers defender Borna Barisic in Sunday’s Scottish Cup semi-final.Carter-Vickers was the best player on the park despite playing through a knee injury which has ended his campaign but Celtic have received positive news following his operation.Johnston will sit out Sunday’s game against Hearts at Tynecastle as Celtic bid to get a win which will secure a second cinch Premiership title under Ange Postecoglou.But the 24-year-old could be fit ahead of the Scottish Cup final against Inverness on June 3.“He got a significant knock,” Postecoglou said. “We will see. There is still a chance he will be available before the end of the season but it will be a week-by-week thing and we will see how he goes.",
        "“Cameron (Carter-Vickers) will be out until the start of next season and James Forrest is probably a week away.“The only other new one is Stephen Welsh who picked up a knock in training. Everyone else is good to go.”Centre-back Carter-Vickers looks set to be fit to join his team-mates for pre-season training.“He has already had the surgery and the reports are that it went really well and he should be right for the start of the season, to begin the season, which is great news for us,” Postecoglou said.",
        "“It’s something he has carried for a significant part of this year but he was really keen to play, particularly up until last weekend knowing what the game meant for our season.“But it’s fair to say he hasn’t been able to train at the levels he wants to and can sometimes perform, but he has never used that as an excuse.“He was outstanding for us this year and it’s great for him to get it seen to now and know that at the start of the season he will be ready to go.”Japanese central defender Yuki Kobayashi is set for a run in the team after making four appearances since his arrival in January.“He is ready to go,” Postecoglou said. “He has done well for us every time we have called upon him.“We brought him in in January to use this second half of the season to bed him in in terms of our football and how we train, to let him adjust. Yuki is ready to step up and play a significant role.”"
    ]
}