{
    "articleURL": "/news/article-12051507/Jamie-Foxxs-condition-NOT-changed-three-weeks-star-admitted-hospital.html",
    "content": [
        "The actor broke his silence by posting on social media earlier this week Foxx, 55, was taken ill in Atlanta where he was filming with Cameron DiazREAD MORE: Mike Tyson claims Foxx has suffered a stroke Jamie Foxx's condition has reportedly 'not changed' three weeks after the star was rushed to hospital after suffering a medical emergency.",
        "Sources told Page Six on Friday that 'nothing had changed' and the actor was 'still in the same condition', after his health scare last month. It comes days after Foxx, 55, appeared to break his silence by posting on social media. In an Instagram post on Wednesday, his profile said: 'Appreciate all the love!!! Feeling blessed' followed by praying hands, heart and fox emojis.'It's unclear if Foxx himself made the post. No further details on his condition have been shared, leading to speculation about how serious his illness is.  Foxx was filming the action-comedy Back In Action with Cameron Diaz in Atlanta, Georgia, when he was admitted to hospital. ",
        "Foxx, born Eric Bishop, is currently at a medical facility in the state undergoing tests. The Oscar winner's account also gave a shout-out on Instagram to friend Nick Cannon who has filled in hosting duties for him on popular game show Beat Shazam.Jamie's daughter Corinne Foxx, 29, serves as DJ on the program but will also take leave to aid in her famous father's recovery.Resharing a post from Corinne about Nick taking over the presenting mantle, Foxx wrote on his stories: 'Appreciate ya my boy @nickcannon, see you all soon'. Celebrities including AJ McLean, Ludacris and DJ Khaled sent messages of support in response to Foxx's Instagram post.  ",
        "Sources close to the comedian recently told TMZ he 'needs all the prayers and well-wishes his fans can muster'.'He's OK, thank God,' the source said. 'He's still in the hospital and doctors are running tests but he's awake and alert. They're keeping him under observation.'",
        "Fans were initially alerted about the health scare when his daughter Corinne shared a grave statement on social media on April 12.The 29-year-old actress wrote, 'We wanted to share that, my father, Jamie Foxx, experienced a medical complication yesterday.'Luckily, due to quick action and great care, he is already on his way to recovery,' she continued.'We know how beloved he is and appreciate your prayers. The family asks for privacy during this time,' the statement concluded.Since then, the family has shared limited details, and it's unclear what symptoms the comedian may have been suffering from.",
        "It comes after Kevin Hart gave a positive update on Foxx's condition during Tuesday's episode of the Impaulsive Podcast. Hart, 43, explained to host Logan Paul: 'I'm very fortunate to have the relationship that I have with Jamie and to be able to just check on him and stuff like that.' The comedian added that Foxx's family was continuing to be 'tight and for reasons just about where he is, because Jamie's always been a private person to a certain degree.'",
        "He stated that the outpouring of love has been a major influence in Foxx's recovery.'The dope thing is that he's getting better in his situation, and you know, everybody's prayers, everybody's love, energy. All that stuff is seen and felt.''So in this case, man, you know, you just want the guy to get out of the situations and then get back home,' the Die Hart star continued.'You know, I don't know the details, or the exact details to what's going on, but to my knowledge is there's a lot of progression and a world of better, man.'",
        "Earlier this week Cameron Diaz was spotted with her husband Benji Madden and daughter Raddix in New York. Diaz has continued to shoot scenes for Back In Action without Foxx and with a body double. The film has been marketed as the return to acting for Diaz, whom he helped to lure out of retirement.The movie has reportedly suffered from a string of other setbacks - including Foxx having an 'absolute meltdown' while shooting in the UK.He allegedly booted an executive producer from the project, along with two directors and even his own driver.There has been no word yet on when he will be able to leave the hospital or get back to filming."
    ]
}