{
    "articleURL": "/wires/pa/article-12060967/Everton-never-doubted-battle-against-relegation--Sean-Dyche.html",
    "content": [
        "Everton boss Sean Dyche insisted his side never doubted themselves after a thumping 5-1 Premier League victory over Brighton lifted the Toffees two points clear of the relegation zone.",
        "It was Everton’s first away league win in 14 attempts and could not have come at a more opportune time, with just three matches now remaining to secure their top-flight safety.Abdoulaye Doucoure’s strike after 34 seconds laid down what retrospectively ultimately felt like an emphatic opening statement as both he and Dwight McNeil went on to scores braces on either side of the half.",
        "Dyche said: “People will be out there thinking right, OK, there’s life in that team but we’ve never lost sight of that.“It just reminds the players that their work ethic, their commitment to the cause, their commitment to the group is really important because I know there’s quality.“I’ve always believed there’s quality. I’ve said it many times, but talking about it doesn’t win you a game. It’s the collective mentality to go and deliver everything you’ve got.“We were very frustrated not to come away with all three points (against Leicester) but we got a reward for carrying on that mentality in their performances tonight.”Doucoure netted his second when he volleyed the ball home after 29 minutes before McNeil’s cross further buried Brighton, with it deflecting off Jordan Steele, who had stooped to save but instead felt the ball bounce off the back of his leg and in.",
        "Alexis Mac Allister clawed one back before McNeil’s first but the Brighton burial was not complete until McNeil fired home the visitors’ fifth in the embers of second-half stoppage-time.Victory meant Dyche’s side are safe for the time being, with league leaders Manchester City up next followed by encounters with Wolves and Bournemouth.“They’re very high feeling the feel-good factor,” he added. “But it’s only another step. I said that after Arsenal, and sometimes people forget that. There’s three more big steps we’ve got to take.”Brighton head coach Roberto De Zerbi, meanwhile, suggested his side’s performance revealed they were not yet ready to go toe-to-toe with the best in the business, though he was unspecific about whether he was looking at England’s top four or more broadly to the other side of the Channel.",
        "It could still be possible for Brighton to secure European football with a seventh-place finish, but De Zerbi’s men would feel more satisfied with a higher position.He said: “Of course we can lose the game. We can lose against Everton, but I’m disappointed for the first half because it was tough.“We showed we are not ready yet to compete and to achieve the big target. If we want to improve, if we want to fix our target higher, we have to improve very fast  Roberto De Zerbi  ",
        "“But I am speaking about mentality, not other things, not other parts of football.“It’s not easy because playing in the last period, three games in a week is difficult if you are not used to playing so many games.“But if we want to improve, if we want to fix our target higher, we have to improve very fast.”"
    ]
}