{
    "articleURL": "/sport/football/article-12042181/Real-Madrid-verge-agreeing-Jude-Bellingham-deal.html",
    "content": [
        "The future of Jude Bellingham has dominated transfer talk in the last 12 monthsReal Madrid have accelerated their pursuit and are now closing on an agreementHe will add to Real Madrid's young midfield core as they target a squad overhaul Real Madrid are in advanced talks to sign Jude Bellingham from Borussia Dortmund.",
        "A fee is still to be finalised but Madrid are increasingly confident that agreement will be reached for the £130million-rated England midfield star.Bellingham has been the most coveted target for the summer following his outstanding performances both for Dortmund and then England at the World Cup. However, Liverpool, long considered favourites for his signature, declared they were out of the race last month citing escalating costs of the proposed transfer with the Anfield club unwilling to spend so much of their budget on one player.Pep Guardiola's Manchester City, and rivals Manchester United, will continue to watch negotiations as they wait in the wings with lucrative offers for the 19-year-old but Madrid believe the player wants to join them following a series of meetings in recent months.",
        "The Champions League winners have yet to put their bid to Dortmund, and are likely to propose an initial £100m, but do not anticipate any issues over agreeing a final fee and expect to make Bellingham a Madrid player by the end of June.Madrid's hugely influential chief scout Juni Calafat, who is understood to have met Bellingham's father Mark at the Chelsea Harbour Hotel in London last month, wants Bellingham to lead the club into a new era and form a formidable midfield alongside Aurelien Tchouameni and Eduardo Camavinga. ",
        "Toni Kroos has also extended for another year and coach Carlo Ancelotti wants Luka Modric to stay for 12 more months to aid the transition further.Madrid have been off the pace of La Liga leaders Barcelona this season but face Manchester City in the semi-finals of the Champions League, a trophy they have won 14 times. ",
        "Indeed, in what could be seen as part of a long courtship, Bellingham and his family were invited into Zinedine Zidane's private box to view last year's final against Liverpool in Paris.Regarded by many as the most complete midfielder of a generation, Bellingham has made 52 appearances for club and country this season, scored 12 goals and provided seven assists.His transfer will also present a windfall for former club Birmingham City who secured a 15percent sell-on when Bellingham left for Dortmund in 2020.Still a Birmingham fan, Bellingham was in the stands at Coventry City last weekend, alongside pop star Tom Grennan, to cheer on his young brother Jobe who is also set to move this summer.When Jude last turned down overtures from Premier League clubs, it was because he believed he would find a greater pathway to first team football with Dortmund.",
        "Laurie Cunningham (1979-84)Real signed the winger from West Bromwich for £950,000 and he did the league and cup double in his first season.Steve McManaman (1999-2003)Won two league titles and two Champions Leagues during four years in Madrid after signing from Liverpool.David Beckham (2003-07)Signed for £25m from Manchester United and won La Liga title in his final season with the club.Michael Owen (2004-05)Joined for £8m from Liverpool, but was often overlooked for Ronaldo and Robinho and moved to Newcastle a year later.Jonathan Woodgate (2004-07)The £13m capture from Newcastle arrived injured, then scored an own goal and was sent off on his debut. Voted Madrid’s worst signing of the 21st century by fans.BIGGEST TRANSFER FEES PAID BY BRITISH CLUBS Enzo Fernandez £107m (Benfica to Chelsea)Jack Grealis h £100m (Aston Villa to Man City)Romelu Lukaku £97.5m (Inter Milan to Chelsea)Paul Pogba £89m (Juventus to Man Utd)Mykhailo Mudryk £88.5m (Shakhtar Donetsk to Chelsea)",
        "Manchester United thought so highly of him, they rolled out a welcoming committee of Sir Alex Ferguson, Eric Cantona, Bryan Robson and Ole Gunnar Solskjaer in a bid to convince Bellingham to choose Old Trafford but he opted for the Bundesliga instead and that decision has proved a fruitful one.Former England captain Robson remains an admirer and had been hoping United could sign the more mature Bellingham this time around.'He has everything you want from a midfielder,' said Robson. 'He can tackle, go box to box, pass and he has started to add more goals. 'He may not be the quickest but he has got a good football brain and that make him quicker to anticipate actions than others.'I first saw him as a 16-year-old holding his own in the Championship against men. He's still a teenager now but plays like a seasoned professional. His attitude and work ethic means whoever he signs for will be getting a very, very good player.'"
    ]
}