{
    "articleURL": "/wires/ap/article-12053307/Greene-B-ez-spark-Tigers-5-4-win-slumping-Cardinals.html",
    "content": [
        "ST. LOUIS (AP) - Riley Greene hit a two-run double in the seventh inning and Javier Báez added a two-run homer, leading the Detroit Tigers to a 5-4 come-from-behind victory over the reeling St. Louis Cardinals on Friday night.",
        "St. Louis fell to 0 for 11 in series openers this season. The Cardinals became the first team to drop that many series openers since the 1981 Kansas City Royals, who were 0 for 13, according to OptaSTATS.St. Louis lost its seventh straight game and is 3-14 in its last 17 . The Cardinals are 5-12 at home this season and have lost 11 of 14 games at Busch Stadium.The Cardinals, 1-10 in their last 11 games, have the worst record in the National League at 10-23. Detroit has won four games in a row and five of its last six games against St. Louis, dating to 2021. The Tigers are 8-1 in interleague games this season.Matthew Boyd (2-2) pitched a season-high six innings with six strikeouts and no walks. He gave up three runs on five hits.\"Man, it was good,\" said Boyd, who recorded his 800th career strikeout in the win. \"I mixed all four pitches really well. I had really good stuff against a solid lineup. We responded pretty well with the bats. It was a good team win.\"",
        "Alex Lange earned his sixth save after giving up a leadoff double to Paul Goldschmidt, who leads the National League with 13 doubles. He struck out the final three batters.",
        "\"I gave up the hit, but I had to shake it off,\" said Lange, who has not allowed a run in his last 12 appearances. \"I still had three outs to get. Do what you got to do. Get ahead and put guys away.\"Detroit manager A.J. Hinch was impressed.\"I trust Alex to throw his best stuff to their best hitters,\" Hinch said. \"That middle of the order is real. You have to collect yourself and deal with the next hitter. It's one out at a time. It's no more complicated than that.\"The Tigers scored three runs in the seventh to take a 5-3 lead. Reliever Jordan Hicks (0-3) gave up the two-run hit on an 0-2 pitch to Greene, who entered the game in the fifth inning. It was the second blown save this season by Hicks.\"With two strikes, I just tried to bear down and make something happen,\" Greene said. \"I saw the curveball or slider pop and I went after it. We had a pretty good scouting report on him so I knew what he had.\"Hicks gave credit to Greene.\"He put a good swing on the slider,\" Hicks said. \"I mean, it's just execution. I know what I have to do. I have to get guys out.\"",
        "St. Louis manager Oliver Marmol didn't second guess his decision to bring in Hicks.\"He's been pretty darn good the last two weeks,\" Marmol said. \"Unfortunately tonight, it didn't go that way.\"He drove in pinch-hitter Zach McKinstry, who had walked, and St. Louis native Matt Vierling, who was hit by a 100 mph fastball.\"I'm sure it will be sore tomorrow but I'll be fine,\" said Vierling, who's right wrist was heavily wrapped with ice. \"I can play.\"Spencer Torkelson hit a run-scoring double off reliever Giovanney Gallegos.Báez, who went 3 for 4 with a walk, put the Tigers up 2-0 when he hit a 1-2 curveball into the left field seats in the first inning after Andy Ibañez had doubled off starter Jordan Montgomery. It was the 20th homer allowed in a two-strike count this season by a St. Louis pitcher.Catcher Andrew Knizner, who entered the game hitting .138, had his first extra base hit this season with a two-out home run into the left field bullpen in the third inning after Boyd had retired the first eight hitters.St. Louis scored twice in the third for a 3-2 lead. The Cardinals, who left the bases loaded in the seventh, added a run in the eighth. But rookie Mason Englert got pinch-hitter Nolan Gorman to strike out with the bases loaded to end the inning.",
        "\"Englert was unfazed by the moment,\" Hinch said. \"The inning was building for them. He'd never pitched in his environment. He came up with a big strikeout.\"EJECTIONSSt. Louis manager Oliver Marmol and bench coach Joe McEwing were ejected with two outs in the ninth inning by home plate umpire Junior Valentine after questions some pitch calls. \"He ejected our bench coach and I went out there and he ejected me,\" Marmol said. \"ROSTER MOVESCardinals: Recalled OF Juan Yepez from the Triple-A Memphis Redbirds. Yepez played in three games with St. Louis earlier this season, hitting .333 with one homer. ... RHP James Naile also was recalled from Memphis, where he compiled a 3-1 record with a 2.50 ERA in six appearances.TRAINER´S ROOMTigers: OF Kerry Carpenter (right shoulder sprain) will begin hitting this weekend. ... RHP Trey Wingenter (right biceps tendinitis) will be re-evaluated next week to see how he responded to getting a cortisone injection.Cardinals: OF Tyler O´Neill (lower back strain) was placed on the 10-day IL ... RHP Jake Woodford (for right shoulder inflammation) was placed on the 15-day IL. ... RHP Wilking Rodríguez had season-ending arthroscopic shoulder surgery earlier in the week and was moved to the 60-day IL.UP NEXTTigers: RHP Spencer Turnbull (1-4, 6.84 ERA) has only been able to get through four innings in his last two starts allowing a pair of earned runs in both.",
        "Cardinals: RHP Adam Wainwright (11-12, 3.71 ERA) gets his first start of the 2023 campaign on Saturday after recovering from a groin strain. His last appearance against the Tigers was a start at Busch Stadium in June 2009, nearly 14 years ago, and he threw seven innings in an 11-2 win opposing Justin Verlander.___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}