{
    "articleURL": "/wires/ap/article-12055917/For-far-right-activist-lawsuit-one-sided-standoff.html",
    "content": [
        "EMMETT, Idaho (AP) - A far-right activist best known for his showdowns with federal and state law enforcement officials in Oregon and Nevada is waging a one-sided standoff of a different kind after refusing to comply with court orders in an Idaho defamation lawsuit.",
        "The lawsuit by St. Luke's Regional Health was filed more than a year ago, accusing Ammon Bundy and his close associate Diego Rodriguez of making defamatory statements against the hospital and its employees after Rodriguez's infant grandson was temporarily removed from his family and taken to St. Luke's amid concerns for his health.Since then, Bundy has ignored court orders related to the lawsuit, filed trespassing complaints against people hired to deliver legal paperwork, and called on scores of his followers to camp at his home for protection when he learned he might be arrested on a warrant for a misdemeanor charge of contempt of court.\"We can build a defense system from here. ... This is what is going to keep us safe from all the terrible things that are going to come upon us and throughout the world,\" Bundy told dozens of people gathered at his home in late April, according to a video of the speech posted to Facebook.Bundy´s rhetoric is similar to how he spoke during his armed standoffs with federal law enforcement in Nevada and Oregon several years ago. But this time - despite frequent YouTube videos, far-right media interviews and a \"call to action\" text sent to People´s Rights network members - Bundy hasn´t gained the same traction. The initial gathering of dozens appears to have shrunk to a handful.",
        "In 2016, Bundy led a 41-day armed occupation of the Malheur National Wildlife Refuge near Burns, Oregon, to protest the arson convictions of two ranchers who set fires on federal land where they had been grazing their cattle.",
        "The 2014 Nevada confrontation was led by Bundy´s father, rancher Cliven Bundy, who rallied supporters to stop officers from impounding Bundy Ranch cattle over more than $1 million in unpaid fees and penalties for grazing livestock on government land.Ammon Bundy was acquitted of criminal charges in Oregon, and the Nevada criminal case ended in a mistrial.Ammon Bundy and his People's Rights organization next drew attention for a series of protests at the Idaho Statehouse over coronavirus-related measures and he was temporarily banned from the government building in 2020.In the current lawsuit, Bundy seems to be following a \"blueprint,\" using rhetoric similar to that used in the Oregon and Nevada standoffs to escalate the conflict, said Devin Burghart, the director of the Institute for Research and Education on Human Rights. Burghart has been hired by St. Luke´s attorneys to serve as an expert witness in the defamation lawsuit.\"Bundy has attempted to take the lawsuit and make it into something larger. If he´s able to take this trial and turn it into a larger confrontation, that could be very problematic,\" Burghart said.",
        "Fewer people seem willing to put their own lives on hold to stay at Bundy´s property this time, Burghart noted.The in-person response may be dwarfed by online reaction. At least three witnesses in the defamation lawsuit are unwilling to testify against Bundy in court, according to court documents filed by St. Luke´s, because they fear they might be harmed by Bundy´s supporters.One nurse wrote in court documents that she installed a security system in her home and was scared to wear her hospital badge outside of work. Another health professional said she repeatedly lost sleep and was traumatized because Bundy supporters accused her and others of kidnapping or harming children.\"Intimidation, defamation, doxing, trespass, threats of violence, armed `protests´ at homes and businesses and, when all else fails, armed standoffs with law enforcement - these are the weapons of choice for Ammon Bundy and his more than 60,000-member strong militia, People´s Rights Network,\" attorneys for St. Luke´s Health System wrote in a recent court filing.Bundy, meanwhile, recently told followers that he would rather \"go back to Heavenly Father\" than return to jail - though contempt convictions generally carry a maximum jail sentence of five days under Idaho law.Bundy also maintains he won´t stop making the allegedly defamatory statements against St. Luke´s Regional Medical Center regardless of any court ruling, because he claims his liberty is at stake.",
        "\"I believe it´s my absolute right to be able to say those things,\" Bundy told The Associated Press in April. \"The judge doesn´t have the authority to take those away, they´re inalienable rights.\"Sheriff´s deputies stopped by Bundy's property at least twice in recent weeks to serve the arrest warrant, but left when they were told Bundy wasn´t home.St. Luke´s filed the defamation lawsuit in May 2022 against Bundy, his close associate Diego Rodriguez and their various political and business entities, claiming the pair were making false statements against the company, causing millions of dollars in damages and prompting supporters to harass and intimidate staffers.The case arose from an incident two months earlier, when Rodriguez´ 10-month-old grandson was temporarily removed from family custody and taken to St. Luke´s over concerns about his health. The baby was temporarily placed in the care of the state, and returned to his parents after about a week.Bundy and Rodriguez said the child was wrongfully taken from a loving family after he began experiencing episodes of vomiting after trying solid foods. At the time, Meridian Police said medical personnel determined the child was malnourished and had lost weight, but the family maintained the child was healthy and needed to stay with his mother to breastfeed.",
        "Bundy urged his followers to protest the hospital and at the homes of child protection service workers, law enforcement officers and others involved in the child protection case. Rodriguez wrote on his website that the baby was \"kidnapped,\" and suggested that the state and people involved in the case were engaged in \"child trafficking\" for profit.In the lawsuit, the hospital claimed that Bundy, Diego and their various political organizations orchestrated a widespread smear campaign against the hospital in order to raise their own profiles and enrich themselves. The company asked a judge to award millions of dollars in damages and to bar both men from making any statements calling the hospital officials criminals or claiming that they participate in the abuse, kidnapping, trafficking or killing of children.Bundy, who previously said he was ignoring the court documents because he wanted the case to end quickly, has now asked to have the case moved to federal court.___This story was updated to correct the last name of Devin Burghart, who had been erroneously referred to as Burghess."
    ]
}