{
    "articleURL": "/wires/ap/article-12047263/Norway-climber-aims-fastest-scale-14-tallest-peaks.html",
    "content": [
        "KATHMANDU, Nepal (AP) - A Norwegian who just became the fastest female to climb the world's 14 highest mountains is now aiming to become the fastest person to complete the feat by beating the record set by a male climber in 2019.",
        "Kristin Harila, 37, successfully scaled Mount Cho Oyu and Mount Shishapangma in China and arrived in Kathmandu, Nepal's capital, on Thursday, announcing that she will begin climbing in Nepal this month.\"That's the plan,\" Harila said when asked if she is aiming to set a new record for scaling the highest peaks.She hopes to climb the seven highest peaks in Nepal, including Mount Everest, during the current spring climbing season that ends in May, and then complete the remaining peaks in Pakistan within the next four months.\"We have to sit down and have a meeting and discuss if we can do all seven mountains in Nepal in the spring. We have to look at the (weather) forecast and see how it goes,\" she said.She has roughly four weeks to climb the seven highest mountains in Nepal. Most climbers take the entire climbing season to scale just one peak.",
        "\"Now we are going to rest some days and then we will see if we go to Annapurna and Dhaulagiri, depending on the weather and conditions,\" she said.Harila began her attempt to climb all 14 peaks in April 2022 and completed 12 by September. She then had to pause because Chinese authorities did not allow her to climb last year. China restricted access by foreign climbers because of the coronavirus pandemic.",
        "She was able to obtain a permit from China this year and scaled Shishapangma last week and Cho Oyu earlier this week.The current record is held by Nirmal Purja, a Nepal-born British citizen who scaled the 14 highest peaks in 189 days in 2019, beating the previous record of more than seven years set by a South Korean climber. Purja's climbs were later made into a popular Netflix documentary, \"14 Peaks: Nothing is Impossible.\""
    ]
}