{
    "articleURL": "/wires/aap/article-12044455/Nationals-MP-faces-expulsion-plum-parliament-job.html",
    "content": [
        "Nationals MP Ben Franklin's fate hangs in the balance after infuriating his colleagues by considering a tilt at a powerful job in NSW state parliament that would disadvantage the coalition.",
        "Premier Chris Minns is backing a bid to install Mr Franklin, a close friend, as upper house president. It's a move that would make it easier for Labor to pass legislation in the split chamber as the president does not vote on bills.The manoeuvre could lead to the former minister being expelled from the party, amid threats it could be referred to the state's corruption watchdog.The crisis prompted the Nationals to call a snap partyroom meeting on Thursday morning, where they resolved to block all MPs from taking any senior parliamentary roles.The party is also considering referring the matter to the Independent Commission Against Corruption for scrutiny.If Mr Franklin accepts the nomination for president and is elected, the Nationals executive could expel the rogue MP.Party leader Paul Toole described the situation as \"distressing\" and said taking the job would be a betrayal of the coalition.\"I think many people in the party would actually see that as a very concerning situation ... and it could be seen as disloyalty,\" Mr Toole told Sydney radio station 2GB on Thursday.Deputy Premier Prue Car accused the Nationals of misusing the corruption watchdog to mediate political grievances.\"The ICAC is not there to monitor squabbles within the National Party,\" she said.",
        "\"This seems to be the National Party really having a hissy fit because Paul Toole doesn't have control of his own party room.\"If Ben decides to nominate, it's a matter for him personally and the National Party needs to sort that out within itself.\"The prestigious Legislative Council president job comes with a $315,814 annual pay packet, as well as numerous perks, including additional staff, a car and driver.Mr Toole said he had been unable to secure an assurance from Mr Franklin he would not nominate for the role.\"It actually takes us one vote down and that is the most distressing thing here,\" he said.\"When you're talking about every vote in the upper house, it's going to be tight. We need everybody on the floor.\"The Nationals are expected to convene again next week before the parliament sits for the first time since Labor was swept to power in March.Mr Minns endorsed Mr Franklin for the role on Wednesday, saying he would instruct his own party room to elect a non-government member for the job.The Greens, who have four members in the upper house, also favour electing a non-government member.In the lower house, independent MP Greg Piper is expected to take the equivalent role of Speaker.",
        "AAP has contacted the office of the premier and Mr Franklin for comment."
    ]
}