{
    "articleURL": "/femail/real-life/article-12044595/Mum-gym-membership-slams-woman-taking-long-machine-says-kids-home.html",
    "content": [
        "A young woman was berated at her gym by a 'Karen'A mum demanded she get off the shoulder press machineA young gym-goer has shared her shock after a mum rudely tried to kick her off the machine she was using. ",
        "Mikaela Laws was doing sets on a shoulder press machine when a fellow gym member interrupted to ask how much longer she would be occupying the equipment. She demanded Mikaela vacate the machine because she 'pays for a membership' and has to get home to her kids - prompting thousands to slam the mum as 'entitled', 'embarrassing' and a 'Karen'.Mikaela, who is from Utah in the US, joked she is 'never going to a public gym again' after the tense confrontation.The 21-year-old was working out on when the woman approached her asking how many sets she had left to which Mikaela replied she had two.Scroll down for video ",
        "'Literally one minute later' the mum came back to Mikaela and berated her.'I'm going to be honest you've been on this machine for like forever now, I've been waiting,' the woman said before Mikaela assured her she wouldn't be much longer. 'It's just really annoying because I pay for a membership here and I've been waiting like the whole time I've been here,' the mum complained before calling Mikaela's actions 'annoying'. 'I don't have a tonne of time, I have kids at home. I just need to hop on this machine and get it done. Can you please just get off so I can have it?'",
        "Mikaela promised the woman she would only be '30 more seconds' and the machine would be free. 'Okay, whatever,' the mum said before walking away. Mikaela posted the exchange in a video to TikTok which quickly racked up more than 4.2million views and thousands of baffled comments. 'As if you don't pay for your membership too - THE AUDACITYYYY' one woman laughed. 'Baby put the headphones back on. Karen can take her misplaced anger somewhere else,' a second chimed in.''I'm about to go to the front desk' okay, they are gonna tell you to wait your turn,' a third pointed out. Some said the 'entitled' mum could have used other equipment instead of the shoulder press.  'She could use free weights and get her shoulder presses in… like I would never!' one gym junkie wrote. 'LMFAO like girl go on a different machine for God sakes. So embarrassing for her to act like that,' a second replied. Others praised Mikaela for being polite to the 'rude' mum and joked they would refuse to let her on the machine.  'I would have shoulders of steel because I would not move off that machine until she left that gym,' someone quipped.  'I wouldn't get off that damn machine if my life depended on it after that,' a second agreed. ",
        "'WHY were you so nice to her?!?! I literally would've gone off,' a third asked.  "
    ]
}