{
    "articleURL": "/wires/reuters/article-12038531/US-STOCKS-Banks-energy-stocks-lead-Wall-St-slide-ahead-Fed-meeting.html",
    "content": [
        "U.S. debt ceiling worries come to the fore",
        "Uber soars after upbeat forecastChegg slumps as ChatGPT drags on resultsIcahn Enterprises falls as Hindenburg goes shortIndexes down: Dow 1.47%, S&amp;amp;P 1.53%, Nasdaq 1.29%(Updates prices throughout; adds details, comments)By Ankika Biswas and Sruthi ShankarMay 2 (Reuters) - U.S. stock indexes tumbled on Tuesday, led by banks and energy shares, as investors fretted about the impact of further interest rate hikes on the U.S. economy and banking system.The Federal Reserve is widely expected to raise interest rates by 25 basis points to a range of 5% to 5.25%, its highest level in nearly 16 years, when the central bank concludes its two-day policy meeting on Wednesday.Investors are waiting to see if the Fed will signal that this week's rate increase is the last, at least for now.\"The message (that) the market is sending today is the Fed needs to come out with a press conference and (signal a) pause tomorrow, otherwise you're going to see continued turmoil in the banking system,\" said Thomas Hayes, chairman and managing member at Great Hill Capital.U.S. regional banks fell further in the wake of the collapse of First Republic Bank, most of whose assets were bought by JPMorgan Chase &amp;amp; Co in a deal brokered by the Federal Deposit Insurance Corp on Monday.",
        "PacWest Bancorp tumbled 26.4%, while Western Alliance Bank and Comerica Inc dropped 19% and 10.6%, respectively.The KBW Regional Banking index tumbled 6.0%, while the broader S&amp;amp;P 500 bank index declined 3.7%.Adding to the woes, Treasury Secretary Janet Yellen said the federal government could be unable by June 1 to meet all of its payment obligations without legislation to raise Washington's borrowing limit, prompting President Joe Biden to summon four top congressional leaders to the White House next week.Oil prices dropped nearly 5% on worries of a potential U.S. debt default, dragging the S&amp;amp;P 500 energy index by as much 5%.Worries about an economic downturn and concerns about stress in the banking sector have fueled expectations of rate cuts in the latter half of the year.However, with inflation running well over the central bank's 2% target and a still-strong labor market, chances of rate cuts seem less likely this year.\"Recession concerns are very real across the board. You have high inflation with rate hikes chasing it plus strong labor. Despite some lay-offs starting to happen, you really have mixed signals,\" said Alan Lewis, chief investment officer of DiversyFund.\"So, the Fed is just going to continue to hike rates until something in the economy breaks and starts to really return to the 2% inflation target and we're just not there yet.\"",
        "At 12:36 p.m. ET, the Dow Jones Industrial Average was down 501.54 points, or 1.47%, at 33,550.16, the S&amp;amp;P 500 was down 63.74 points, or 1.53%, at 4,104.13, and the Nasdaq Composite was down 157.86 points, or 1.29%, at 12,054.74.Analysts expect first-quarter earnings for S&amp;amp;P 500 companies to fall 1.4% from a year earlier following better-than-expected reports from some technology and growth giants, a sharp improvement from the 5.1% drop expected at the start of April, according to Refinitiv data.Uber Technologies Inc jumped 9.2% as the ride-hailing firm forecast quarterly core earnings above estimates. Smaller rival Lyft Inc climbed 1.7%.Educational services company Chegg tanked 48.4% on a downbeat second-quarter revenue forecast on increasing competition from ChatGPT.Icahn Enterprises LP dropped 17.6% after U.S. short seller Hindenburg Research said it has a short position in activist investor Carl Icahn-controlled energy-to-pharma conglomerate.Declining issues outnumbered advancers for a 5.48-to-1 ratio on the NYSE and a 3.17-to-1 ratio on the Nasdaq.The S&amp;amp;P index recorded 15 new 52-week highs and 13 new lows, while the Nasdaq recorded 32 new highs and 346 new lows.(Reporting by Ankika Biswas and Sruthi Shankar in Bengaluru; Editing by Sriraj Kalluvila, Vinay Dwivedi, Anil D'Silva and Subhranshu Sahu)"
    ]
}