{
    "articleURL": "/sport/football/article-12056899/Haaland-Dixie-Dean-rightly-immortalised-dont-forget-goal-machine-George-Camsell.html",
    "content": [
        "George Camsell was the first man to break the 50 goal barrier in a single seasonMiddlesbrough unveiled a statue in Camsell's honour earlier this campaignCamsell's achievements have barely been mentioned as Haaland chases records He came up one goal short of 60 in the league, although it did not matter for another year, at which point the considerable shadow of Dixie Dean eclipsed George Camsell to the point where, when Erling Haaland threatens the biggest hauls in English football, he barely merits a mention.",
        "Not beyond Middlesbrough, anyhow, because there Camsell's status is secure. They unveiled a new statue in his honour at the Riverside Stadium earlier this season and his 345 Boro goals live on in the footballing folklore upon Teesside.Camsell was an interwar goal machine. The first man to break the barrier of 50 goals in a single English season, in 1926/27. He finished up with 59 league goals in 37 games, including nine hat-tricks as Middlesbrough won the Division Two title and promotion.With four in the FA Cup, he amassed 63 in all competitions. It was a new record by a distance and expected to stand the test of time but this was a fine age to be a forward.The offside law had been relaxed, and Dean smashed in 60 to set a new league record in the very next season. He added three more in the FA Cup to tie with Camsell on 63 goals in all competitions.",
        "Dean's 60 is rightly immortalised. Unlike Camsell's it came in the top flight. It led Everton to a third title. And it is difficult to see it ever being beaten. Not even by City's Haaland, who has been magnificent, but is still 25 goals short with only four to play.",
        "Sixty-three in all competitions remains a live target for him, however, with a dozen required and up to seven games remaining for Manchester City, although he has more chance of getting there if he takes the penalties he is supposed to take.Penalties didn't mean much to Camsell either. He took three in his record season of 1926/27, scoring the first two and missing in the FA Cup against Millwall, after which he refused to take another.Boro were awarded six more that season, taken by others, so he could have been out on this own ahead of Dean.Camsell was Middlesbrough's top-scorer for 10 years in a row and still banging in goals in his late 30s when the outbreak of the Second World War ended his professional playing career.For England, he was no less prolific, with two goals on his debut against France in 1929. With four more against Belgium, two against Ireland and three against Wales, he scored 11 in his first four internationals.Then the 14-man selection committee dropped him without explanation and left him out for four years.In Middlesbrough, they assumed an anti-northern bias, the same conclusion drawn on Merseyside as they wondered why Dean won only 16 caps - and only four after turning 22.",
        "Dean once claimed England had dropped him for a game in Paris because he refused the soup at the pre-match meal. Camsell, who won his first cap in Paris, may have been the beneficiary of Dean's selective palate.Camsell won a belated recall and never failed to score when representing his country. When war ended his England career in 1936, he was on 18 goals in nine appearances and one short of the record of scoring in 10 in a row, set by Steve Bloomer in the 19th century.One short of Dean. One short of Bloomer. Two names that still resonate and good company to keep.Post-war, Camsell returned to Ayresome Park to serve various roles as a scout, trainer and assistant secretary until retirement in 1963. He died at the age of 63, four months before England won the World Cup.His most celebrated achievement as a scout was to discover Brian Clough, a young striker who went on to score 204 goals in 222 games for Middlesbrough and remained grateful for Camsell's influence.'He was reputed to be the bravest centre-forward in the whole Football League,' said Cloughie.Who better to remind us of one of football's forgotten heroes at a time when the enormous goal-hauls are in vogue once more and Boro have eyes on another promotion?",
        "Solanke puts past mistakes behind him to finally fulfil potential Dominic Solanke looks every inch the Premier League striker, begging the question of where he might be had he not lost months of football at such a critical stage of his development while in dispute with Chelsea.Solanke barely kicked a ball once it became clear he wanted to run down his contract and leave on a free for Liverpool in 2017. There were probably mistakes made on all sides but there is surely a duty of care to ensure young players continue developing.There was a similar situation when Sheffield Wednesday refused to play George Hirst as he tried to engineer a lucrative move out of the club.When they did start playing regularly again, both young strikers found it difficult to kick-on and fulfil potential on display in the England youth ranks. Hirst, now 24, has flickered on loan from Leicester in League One at Portsmouth and Ipswich, during the last two years.Solanke moved to Bournemouth in 2019 and spent two years scoring goals and replenishing confidence levels in the Championship. At 25, he has matured into a strong, mobile centre forward who can score and create at the top level.It is a testament to his talent and his attitude.",
        "A season to remember for outsiders Stevenage Stevenage will be a long way from home when the campaign ends at Barrow on Monday but what a fabulous achievement for owner Phil Wallace, manager Steve Evans and everyone at the Lamex.They were 66/1 outsiders for automatic promotion after finishing last season in 21st. Not only did they make it up with a room to spare, they also knocked Aston Villa out of the FA Cup.",
        "Loyal Lewington overshadowed by Dons' dropRelegation was scant reward for the loyalty of Dean Lewington, who ends the season only five short of John Trollope's long-standing record of most league appearances for a single club. Trollope played in 770 games for Swindon Town from 1960 to 1980.Lewington moved clear of Portsmouth's Jimmy Dickinson into second on Sunday, as he played his 765th game for Milton Keynes Dons at Burton, where a goalless draw having failed to score from any of 31 shots at goals, condemned them to League Two next season.Lewington's 29 appearances for Wimbledon before the club's controversial change of identity in 2004 are not included in this total.McKenna's incredible centurions Ipswich Town could not beat Plymouth Argyle to the League One title but will be the only EFL club to celebrate 100 goals in this season. ",
        "Goals by Freddie Ladapo and Marcus Harness in a 2-2 draw at Fleetwood on Sunday saw Kieran McKenna's team close the campaign with 101 goals, with a goal difference of +66.",
        "Coyle could still pull off miracle north of the border If Owen Coyle's Queen's Park are to complete a poetic rise from the ranks of amateur football to the Scottish Premier League, they will have to do it via the play-offs after losing to Dundee on Friday.Some consolation was served for the most casual English observers of Scottish football, however, with the final placings in League Two, north of the border, with East Fife fourth and Forfar fifth.Another blow for Spurs As if to prove the nature of talent cycles, Tottenham, who won the Premier League's U18 and U17 titles this season, were relegated on Sunday from the top flight of the U21 Premier League 2."
    ]
}