{
    "articleURL": "/wires/ap/article-12043645/California-companies-pay-higher-taxes-unemployment-debt.html",
    "content": [
        "SACRAMENTO, Calif. (AP) - One potential consequence of California's ballooning budget deficit: Higher taxes for businesses, with increases possible every year for the next decade.",
        "Business owners pay a tax on each of their workers. The money goes into a fund that states use to pay unemployment benefits when people lose their jobs. During the coronavirus pandemic, so many people lost jobs that many of these funds ran out of money.Twenty-two states borrowed from the federal government so they could keep paying unemployment benefits. Those states must pay that money back, plus interest. Most states have already done this. But California is one of five states that hasn't. The state owes $18.9 billion.If California doesn't pay the money back, businesses have to do it through higher taxes. California was supposed to start paying off the debt this year with $1.5 billion - $1 billion toward the debt, plus another $500 million to help small businesses pay their increased taxes.But that was before California had a $22.5 billion budget deficit. Now, Democratic Gov. Gavin Newsom wants to cancel $1.25 billion of that spending to help cover the state's budget shortfall. That means businesses will have to pay an additional $21 per employee in federal unemployment insurance taxes this year. That tax will keep increasing by $21 every year over the next decade that the debt is not paid off.It could take at least 10 years for businesses to pay off the debt, according to the nonpartisan Legislative Analyst's Office. Meanwhile, the Newsom administration expects California will have a multibillion dollar budget deficit not just this year, but also in each of the next three years - meaning it's not likely the state will start paying off the debt anytime soon.",
        "California could have paid off the debt, or at least a sizeable portion of it, in the past two years when it had a combined general fund budget surplus of $119.4 billion. But state officials didn't do that, to the frustration of business owners like Denise Duncan who are now stuck paying the higher tax.The tax increase won't be a significant burden for Duncan this year because she only has two employees. But she said it angers her she's stuck paying for something that wasn't her fault after the government ordered many businesses to shut down during the pandemic.\"We're getting hit over the head with hammers every time we turn around with increased costs, whether it's gas doubling, whether it's insurance and utilities,\" said Duncan, owner of AT Industrial Products in Pomona. \"They had a surplus. So why didn't they use it?\"One reason is simply the massive size of California´s debt. As the nation´s most populous state, California also has the largest economy and the most workers. It´s $18.9 billion debt is more than twice as large as every other state.Instead of paying off its unemployment debt, the Democrats in charge spent the money on other things. They gave $21.4 billion of it back to taxpayers, sending three rounds of stimulus checks to help people weather the pandemic and offset rising gas prices. The rest of it went to things like public schools, roads and bridges, health care and homelessness programs.",
        "\"The Governor's January budget proposal delays some longer-term debt payments to meet the state's more immediate needs,\" Newsom spokesman Alex Stack said. \"Having said that, we're still allocating $250 million to pay down this debt, which will save businesses money.\"Stack noted the governor will release an updated budget plan next week, adding, \"he looks forward to working with the Legislature and stakeholders on state spending priorities.\"Legislative Analyst Gabriel Petek, whose nonpartisan office advises the Legislature on budget issues, told lawmakers earlier this year that even if the state were to restore the $750 million payment toward the debt, it would not lower taxes for businesses because the the tax rate only changes if the debt is paid in full.\"If the Legislature wanted to make this optional payment a couple of years down the road, it probably wouldn't have a material difference for those paying the tax,\" Petek said.But the business community says paying at least part of the debt will show the state is serious about paying down the debt.\"Yeah, we have the biggest deficit. But you have to start paying it down somewhere,\" said Rob Lapsley, president of the California Business Roundtable. \"It's just like it doesn't exist. I think they're just going to let employers pay it. They just intend to push through a hidden tax increase.\"",
        "In spring budget hearings, Newsom administration officials said their plan was to hope that the federal government would forgive the debt. But Robert Moutrie, policy advocate for the California Chamber of Commerce, said the business community doesn't believe more federal aid will be coming froma divided Congress with Republicans controlling the House and Democrats, the Senate.Democrats in the state Senate last week proposed raising taxes on 2,500 large corporations so the state could cut taxes 25% for 1.6 million business owners. State Sen. Nancy Skinner, a Democrat from Berkeley and chair of the Senate Budget Committee, said the proposal was not specifically in response to higher unemployment insurance taxes.Still, Newsom opposes the Senate's plan. He will update his budget proposal next week."
    ]
}