{
    "articleURL": "/femail/article-12041097/Botticellis-Venus-travel-influencer-bizarre-tourism-campaign.html",
    "content": [
        "Italy's tourism board has come under fire for the bizarre new campaignREAD MORE: Ciao Rishi! Italy's far-right leader Giorgia Meloni greets PM with a kiss (and praise for his plan to cut illegal immigration) as she arrives in London for talks Italians have been left horrified after the country's tourist board created a travel influencer out of a Botticelli's Venus.",
        "The Venere Italia Instagram account, which has 163,000 followers, has jumped on the bandwagon of using computer-generated images to bring historical characters into the modern day with a re-imagining of Venus Anadyomene in a campaign thought to have cost €9 million.The new campaign, called Open to Meraviglia, follows Denmark's foray into the world of AI after the nation's tourist board brought the Mona Lisa and the Girl with the Pearl Earring alive to encourage people to visit its country rather than more classic tourist attractions you might find in Paris, such as the Louvre.Early renaissance artist Sandro Boticelli's Goddess from The Birth of Venus is now donning linen shirts and denim jackets to explore Italy's greatest tourist attractions - and people are less than impressed.As computer-generated images of the travel influencer show her touring the nation in the campaign put together by the Armando Testa group, people have blasted the campaign on Instagram for making Italy 'the laughing stock of the world'.",
        "The Instagram account bio describes the Renaissance traveller as a 'worldwide Renaissance icon and Italy lover' and a 'virtual content creator and testimonial'.In one photo, the 'influencer', who typically resides in Florence's Uffizi Gallery, poses in Polignano a Mare in a white linen shirt and a flowing blue maxi skirt. ",
        "She carries a straw cross-body bag as she 'poses' on rocks with a picturesque background of the shoreline.The caption, translated from Italian into English, reads: 'I've arrived in Polignano by the sea. Land of the \"blue painted blue\". A wonder that will make you... \"Fly away.'In response to the post, people who oppose the campaign have expressed their distaste in the comments section, branding it an 'embarrassment'.",
        "One person wrote: 'We are the laughing stock of the world' followed by an emoji of someone putting their head in their hand.Another image on the page shows Venus outside the Coliseum in Rome, where she has opted for a nautical striped navy and white t shirt and a dark denim jacket and jeans.She is pushing a bicycle with a basket past the ancient landmark as her hair blows in the wind (which is how she is pictured in the original Botticelli painting.The caption reads: 'Rome, you keep getting older! Happy birthday to the Capital, and good luck blowing out the 2776 candles.' One person commented: 'The centrifugal force with which Botticelli is turning in his grave would be enough to produce the energy to illuminate the entire country for years to come.'Others expressed their anguish at how much money had been spent on the campaign to produce what they believed were poor quality images that fell flat in their aim.",
        "A disgruntled person wrote: 'These things not even in the first lesson of the photoshop course. Not even the ones online.'",
        "But it was perhaps the video which launched the character that has caused the greatest offence with Italians, who claimed their tax money was being 'dissolved' by the government.As Venus introduces herself as a 'travel influencer' who is 30 years old, or 'maybe a bit more than that', she is pictured wearing pink flared trousers and fluffy teddy coats. One person said the video was 'all so bad', focusing on 'the voice, the images, the commercial that really leaves you speechless'.Another wrote: 'Not even one positive comment, I would say the sentiment is clear.'A third person joked: 'ITALIA: OPEN TO CRINGE.' Elsewhere the campaign has been mocked for its hasty production as people poke other holes in it - notably, the fact that the tourist board has not bought the rights to the domain name.Marketing Toys has bought the Open To Meraviglia URL in a bid to show up the campaign for its failure to do so.The web page now reads: 'Don't worry, we at Marketing Toys have taken care of it. Marketing is serious business.'The New York Times reported that even members of the Italian government have expressed bewilderment at the €9 million campaign and what it has produced.",
        "The newspaper reported deputy culture minister Vittorio Sgarbi had said he was baffled by the new slogan.Howevertourism minister Daniela Santanche has stood by the campaign, which launched this month.She said during a radio interview: 'One of the objectives of this international campaign is to reach out to young people, so we used the instruments and language close to them.'"
    ]
}