{
    "articleURL": "/news/article-12042971/Essex-pub-refused-remove-golliwog-dolls-forced-close.html",
    "content": [
        "The White Hart Inn in Grays has faced controversy over its golliwog dolls display Landlords Chris and Benice Ryley are closing the pub and retiring to Turkey The Essex pub that refused to remove its display of golliwog dolls has been forced to close after Heineken and Carlsberg told the owners to stop serving their beer and a maintenance firm refused to work on site.",
        "The White Hart Inn in Grays was discovered to have 'golliwog dolls' displayed inside, which landlord Benice Ryley claimed to have collected since childhood. Essex Police raided the pub and seized the offensive dolls following reports of 'suspected hate crime' a month ago. Since then, the pub has been removed from the CAMRA good pubs guide, and been the subject of an ongoing police investigation. Now, following the controversy Mrs Ryley and her husband Chris, have vowed to shut the pub down for good and move home to Turkey.The couple, who have been landlords of the White Hart Inn for almost 20 years, are understood to be 'utterly gutted' by the decision and claim they 'don't understand' the hate they have received over the dolls.",
        "The White Hart Inn shut its doors under its current management, Mrs Ryley confirmed to Thurrock Nub News.She and Mr Ryley will now enter retirement and return to their home in Turkey.'I feel gutted, totally and utterly gutted. Hurt, upset,' she said of the closure. 'We've had a few bits of hate, which I personally don't understand.'The young people these days don't understand, from years ago where did the Gollys originate from, it's such a shame.'Citing opposition from suppliers as a contributing factor to the decision, Mrs Ryley added: 'I've had enough.' ",
        "A Carlsberg spokesperson told MailOnline today: 'We believe pubs should be an enjoyable place for everyone and we will take steps to seek removal of our beers from venues who do not share our values. 'Whilst we do not directly supply the pub in question, after being made aware of the police investigation we contacted our third-party distributor to make our views clear.'Heineken ordered the pub to stop serving its beer on April 20 citing the 'abhorrent display' that allegedly goes 'against everything the company stands for'. ",
        "'We advised the pub owners that we want nothing more to do with them,' a Heineken UK spokesperson told MailOnline. 'We believe pubs should be places of inclusivity and respect for all people, regardless of their race, ethnicity, religion or gender.'We have made it clear that we want all Heineken UK brands removed, and there will be no further contact with the pub from Heineken UK.'CAMRA, which removed the establishment from its Good Beer Guide and Pub of the Year awards display, echoed the sentiment, telling BBC that the organisation believes' pubs are for everyone' and that there is 'never a place for discrimination'.MailOnline has approached CAMRA for comment. The pub reportedly displayed its collection of nearly 30 dolls for the last 10 years after Mrs Ryley had 'received them as gifts' from her late aunt and various customers. ",
        "She previously the dolls were 'part of my childhood history, it's a part of our inheritance. I can't see any harm.'Last month, amid the slew of hate, Mrs Ryley said that if someone is opposed to the display, 'they don't have to come through the door'.Police seized the dolls from the pub on April 4 while investigating an allegation of hate crime that had been reported on February 24. Essex officers 'seized several items in connection with the investigation'.Vandals later targeted the pub on April 16 around 12.40am. They reportedly hurled a brick through the windows and graffitied the building with offensive slogans. The pub had five windows and a door damaged.The White Hart Inn first made headlines after it was reported by MailOnline that Home Secretary Suella Braverman said Essex Police 'should not be getting involved in this kind of nonsense' and instead focus on 'catching criminals'.",
        "Pub landlord Mr Ryley, who spends most of his time in Turkey, came under criticism online after posts emerged in which he made what many have said are racist remarks. He posted: 'Black Chancellors matter' in October 2022 in a reference to former Chancellor of the Exchequer Kwasi Kwarteng. In another from June 2020, a golliwog is pictured with the caption 'Sadiq's new ideas.'",
        "Other offensive messages include a post asking: 'When is White History Month please. Anybody know?' while in another a golliwog is pictured with the caption: 'Hello Great Britain Am I Allowed Back In?'In another post in March 2016, he wrote: 'They used to hang them in Mississippi years ago' alongside a picture of the dolls hanging from his bar.Referring to the hard-hitting 2016 post and his controversial comment, Mr Ryley told MailOnline: 'It was a tongue in cheek remark, but I was just expressing a historical fact. I wasn't trying to offend anyone.'In the 1800s when slaves used to run away in the deep south of America they either beat them or hanged them. My comment was a reference to that. It was not meant to be detrimental to anybody. I was just repeating something that used to happen, you can't accuse me of being racist for that.'Referring to his 'White Lives Matter' post from June 2020 he said: 'Everybody was going on about Black Lives Matter and to be honest, I was getting sick of it. Nobody seemed to care about other lives.",
        "'I don't care if you're black, brown or white because to me, all lives matter. That was the point that I was trying to make. And I would like to know when white history month is because we also have a history to celebrate.'",
        "Mrs Ryley previously hit back at allegations of racism, saying the pub frequently hosts Indian weddings, and said she does not understand how people could be offended by the dolls. 'I think the racist people are the ones who complain - it's their problem, not us,' she said at the time. 'I have so many different cultures come in here, we are definitely not racist. We do many Indian weddings, for example.'As far as we are aware we are not breaking any laws by displaying them. It took six officers to come and remove a shelf full of dollies. What a waste of taxpayers' money.' "
    ]
}