{
    "articleURL": "/tvshowbiz/article-12045127/Pamela-Anderson-55-proves-shes-knockout-flaunts-fit-figure-skimpy-swimwear.html",
    "content": [
        "Pamela Anderson proved she's still a Baywatch babe as she appeared in more promo photos for her collaboration with Frankies Bikinis.",
        "The sex symbol, 55, first flaunted her sculpted frame in a textured white bikini top while hanging out by the pool.The makeup-free beauty posed with her arms up over her head while running her hands through her wet blonde locks.Next, the former Playboy Playmate slipped into a see-through white one-piece as she posed seductively in the sand.She designed her very own swimwear collection with the LA-based brand that will launch on May 4 at 9am PT.",
        "In her post's caption, the called the collaboration a 'dream come true.'More than 11 years into the launch of Frankies Bikinis, founder Francesca Aiello has established herself as a celebrity-endorsed swimwear designer, who regularly collaborates with high-profile stars.And Aiello took the opportunity to model along side one of Hollywood's most iconic beauties.She and Anderson showcased their svelte figures for the cameras in coordinating yellow floral print swimwear.For the images, which were reportedly taken in the Paradise Cove area of Malibu, Aiello sizzled in a bikini while Anderson opted for a skintight, high-legged one piece.The two ladies can be seen posing next to a large tree that's situated near the shoreline.Aiello and Anderson worked their angles for the camera, often flashing seductive stars and the occasional smile. There's also a picture of Aiello and Anderson facing each other, with their hands clasped together just above their heads, while frolicking in the ocean water.",
        "Anderson also shared five images of herself posing in five different swimsuits on her Instagram page on Wednesday, one day ahead of the launch of her Pamela X Frankies Bikinis collaboration.'Tomorrow, my first-ever swimwear collection drops at 9 am pst,' she wrote in the caption, before revealing how this is 'a dream come true' and 'something I've been waiting to do for a long time.''From me to you,' she ended the caption, as a way to tease her 2.7 million fans and followers.On the Frankies Bikinis website it reads: 'We've teamed up with forever icon Pamela Anderson to make history with her first-ever swimwear collection, launching May 4th at 9am PST / 12pm EST.'This collection introduces new micro bikini sets, statement accessories and iconic one pieces, designed in soft fabrics &amp; fun prints that reflect Pamela's love of nature, animals and all things romance. Sign up for early access below to shop the collection an hour early.' The former Home Improvement star posed on the beach at Paradise Cove in Malibu, where she lived for many years with her sons, while also being the hometown of Aiello.Anderson first came to public prominence after being selected as the February 1990 Playmate Of The Month for Playboy magazine.She went on to make regular appearances on the magazine's cover, and kick-start her acting career when she started her run on Home improvement (1991-1993).",
        "The pinup went on to star in the hit series Baywatch (1992-1997), along with several films that included Barb Wire (1996) and Scary Movie 3 (2003).She would also makes headlines with her marriages to rockers Tommy Lee (1995-1998) and Kid Rock (2006-2007),  both of which ended in divorce, along with her two other marriages to Rick Salomon and Dan Hayhurst.",
        "Initially, Aiello teamed up with her mother Mimi and they began designing bikinis out of their Malibu home in 2012. The founder and creative director of the swimwear brand credits model Candice Swanepoel as being one of the first celebrities to post a photo of herself wearing a Frankies Bikinis swimsuit. And from there, 'it started to catch people's eyes from all over, like a domino effect,' Aiello explained to Forbes in May 2019.Since the company's inception, Aiello has expanded product offerings to include ready-to-wear clothing, accessories, athleisure wear and clean beauty. 'I want girls to look at our brand and feel inspired and confident, not body shame themselves or question their appearances,' she maintained. 'We do not airbrush or photoshop our images, in campaigns or on social media. We leave all stretch marks and dimples visible to the naked eye.' Aiello was just 17-years-old when she and her mother started the line 11 years ago."
    ]
}