{
    "articleURL": "/wires/afp/article-12039159/US-troops-ordered-Mexico-border-migrant-surge.html",
    "content": [
        "The Pentagon said Tuesday it will deploy more troops to help provide security at the US-Mexico border as officials fear a surge in migrant crossing attempts when Covid-19 immigration restrictions end on May 11.",
        "Some 1,500 troops will be sent to the border, adding to the 2,500 already there to support Border Patrol authorities in the face of a possible gush of frontier crossings.\"For 90 days, these 1,500 military personnel will fill critical capability gaps, such as ground-based detection and monitoring, data entry, and warehouse support,\" spokesman Brigadier General Pat Ryder said in a statement.On May 11, President Joe Biden's administration will lift Title 42, the strict protocol implemented by previous president Donald Trump to deny entry to migrants and expel asylum seekers based on the Covid pandemic emergency.With the easing of coronavirus regulations -- including Monday's decision to end vaccination requirements for inbound travelers -- the Biden administration can no longer justify using Title 42 to stem migration.Instead, the administration plans to deter undocumented migrants using Title 8, which essentially criminalizes illegal border crossings, making future legal residency impossible.Washington says hopeful migrants and asylum seekers must now register for interviews with immigration officials from their own countries, or countries they pass through to reach the border.The interviews can be arranged on a new smartphone app, CBP One.In addition, the State Department last week announced it was setting up processing centers for hopeful migrants in other countries -- starting with Colombia and Guatemala.",
        "Canada and Spain have agreed to take in some of those who are cleared for emigration by the processing centers, US officials said.\"It's an approach focused on making migration more safe, orderly and humane and advancing the interests of the American people,\" Secretary of State Antony Blinken said.- Border pressure -",
        "Border officials have faced extremely heavy pressure from migrants, mostly from Central and South America and the Caribbean, in the past two years.In the fiscal year to September 30, 2022, officials intercepted nearly 2.4 million people at the border, most of whom were turned back.In March 2023, they intercepted 191,899 people without migration documents.Following a meeting with US Homeland Security Advisor Elizabeth Sherwood-Randall, the Mexican government said in a statement on Tuesday that it would \"continue to accept back migrants on humanitarian grounds\".Sending US soldiers to the border has been controversial, but government officials stress they are not militarizing the frontier.The Department of Homeland Security insisted the troops won't be involved in law enforcement activities, which are handled by US Customs and Border Enforcement.Instead, the soldiers will help in backup activities like border monitoring and IT services.\"This support will free up DHS law enforcement personnel to perform their critical law enforcement missions,\" the department said in a statement.",
        "But Jonathan Blazer of the American Civil Liberties Union still criticized the deployment.\"People forced to flee their homes and embark on arduous, dangerous journeys for the chance to seek legal protection in the US should be met with compassion -- not military troops,\" he said.He accused Biden of imposing what amounts to an asylum ban with his new policies.Biden \"should instead be focused on creating a robust, efficient, and humane system to screen and welcome people in search of safety,\" he said.Warning of a massive surge in border crossings, Republicans in Congress planned to call Wednesday to keep Title 42 in place.\"If President Biden chooses to continue on the ill-advised path of ending Title 42, it will exacerbate what is already a national security and humanitarian disaster on our southern border,\" said a statement from Senator Lindsey Graham."
    ]
}