{
    "articleURL": "/wires/reuters/article-12058131/Motor-racing-Verstappens-tire-gamble-pays-Miami-win.html",
    "content": [
        "By Steve Keating",
        "MIAMI, May 7 (Reuters) - Max Verstappen produced a tire management masterclass to outwit Red Bull team mate Sergio Perez and win the Formula One Miami Grand Prix on Sunday, reaffirming his status as the man to beat for the drivers championship.As the reigning double world champion on F1's dominant team, Verstappen had already been installed as the favorite but coming into Miami all the indicators were trending in his team mate's direction.Perez was riding the momentum from a win in Baku and is regarded as an expert on street circuits and tire management, both factors that would come into play on the 5.41km temporary track around Hard Rock Stadium, the home of the NFL's Miami Dolphins.But in the end it was Verstappen who made all the right calls - from tire selection to race strategy.Starting ninth on the grid, the 25-year-old Dutchman ripped through the pack and was on pole-sitter Perez's exhaust before the race had reached the midway point.Perez, who started on medium tires, pitted first, giving Verstappen an extended run at the front where he squeezed everything he could from his hard tires before finally stopping for a change with just 11 laps to go.The stop handed the lead back to his Mexican team mate, but not for long. On fresher tires, Verstappen was immediately on the prowl and two laps later he was in front of Perez again.",
        "From there it was business as usual, the two Red Bulls easing through the final laps unchallenged for another one-two.\"This is something I wanted already yesterday together with my engineer,\" Verstappen said of his tire selection. \"We were quite strongly opinionated on that already.\"Then you have to discuss with the team, with the team's interest.\"They were like, 'Okay.'\"But when you start on the hard, the risk is a bit higher because we only had one (set).\"So if you have a ... puncture or whatever, then your race is a bit tougher.\"But I was happy to take that gamble.\"Red Bull team principal Christian Horner said that race simulations were against the hard compound but Verstappen and his engineers and strategist wanted to roll the dice.\"Max starting on the hard tire, there was more risk with that,\" said Horner.\"Our simulations were telling us it´s actually a worse race but where it potentially gained was if there was a safety car later in the race.\"So his engineering team wanted to take that chance and he made it work without the safety car.\" (Reporting by Steve Keating in Miami. Editing by Peter Rutherford)"
    ]
}