{
    "articleURL": "/wires/reuters/article-12048885/Braves-sweep-Marlins-Ronald-Acuna-Jr-leaves-knee-injury.html",
    "content": [
        "Marcell Ozuna homered for the third time in two games against his former team as his Atlanta Braves completed a three-game sweep of the host Miami Marlins 6-3 on Thursday afternoon.",
        "Ozuna was hitting just .111 with just two RBIs entering Wednesday. But in the past two games, he went 4-for-9 with those three homers, six RBIs and five runs. Matt Olson added a solo homer for Atlanta.Braves star Ronald Acuna Jr. left the game in the seventh inning due to an apparent sore knee. He fouled a ball off his left knee in the sixth and finished the inning.Jorge Soler, a former Brave, belted a two-run homer for the Marlins. He finished 3-for-5 with three RBIs and finished a triple short of the cycle.Marlins second baseman Luis Arraez, who leads the majors with a .424 batting average, went 1-for-4.The Braves have won eight of their past 10 games. They improved to 6-1 against Miami this year.Miami had won four straight games before getting cooled off by Atlanta.Braves left-hander Dylan Dodd (2-1), who had a 7.71 ERA entering Thursday, gave Atlanta a quality start by allowing eight hits, three walks and three runs in six innings. Dodd filled in for Max Fried back, who was moved one day back in the rotation.A.J. Minter pitched a scoreless ninth to earn his seventh save of the year.Marlins left-hander Jesus Luzardo (2-2) allowed seven hits, three walks and four runs (three earned). He struck out five.",
        "Atlanta opened the scoring in the first inning as Acuna reached on an error by first baseman Yuli Gurriel. Acuna scored from first on Sean Murphy's two-out, opposite-field double off the top of the fence in right.Miami took a 2-1 lead in the bottom of the first. Jon Berti singled and scored on Soler's two-run homer, a 424-foot blast to left-center.The Braves grabbed a 3-2 lead in the second as Ozuna walked, advanced to third on Eddie Rosario's double and scored on Kevin Pillar's sacrifice fly. Acuna's single past Berti at shortstop drove in Rosario.Ozuna's 447-foot homer to left-center in the fourth gave Atlanta a 4-2 lead.Miami cut its deficit to 4-3 in the fifth. Rookie Peyton Burdick walked, advanced on Berti's single and scored on Soler's double down the left-field line.The Marlins held Berti at third on that play, but they couldn't drive him in after that as Arraez and Gurriel hit shallow flyouts, Jean Segura was intentionally walked and Garrett Hampson lined out to second.Atlanta scored twice in the top of the ninth on Olson's homer and Vaughn Grissom's sacrifice fly, and Minter got the final three outs to end the game.--Field Level Media"
    ]
}