{
    "articleURL": "/tvshowbiz/article-12041701/Tony-Blackburn-80-reveals-hes-discharged-hospital-three-weeks.html",
    "content": [
        "Tony Blackburn has revealed he was hospitalised for three weeks and has only just been discharged. ",
        "Last month, the veteran broadcaster, 80, revealed he was struggling to recover from a nasty chest infection that had seen him forced to pull out of his radio shows.In a tweet on Wednesday, Tony revealed that his health had taken a turn from the worse and he needed to be treated at the Wellington Hospital in London. Thanking the team of doctors and nurses that cared for him, the former I'm A Celebrity winner went on to reveal that despite being discharged he would require further outpatient care. Despite his health woes, he seemed optimistic that he would be back at work on his BBC Radio 2 show, writing that he was 'looking forward' to his return. ",
        "Tony penned: 'After three weeks in hospital I have just been discharged and am now at home to have some more treatment by having a daily injection for a few days from a hospital near me. 'Thanks to everyone at the Wellington Hospital in London doctors and nurses , for looking after me. After my treatment and a rest I look forward to getting back @BBCRadio2 and @BBCLOCALRADIO to doing what I love doing. 'Just want to thank all my friends for your lovely messages, you are all so kind to think about me xx'",
        "The presenter went on to share a picture of himself holding his award from the Audio and Radio Industry Awards after being too unwell to attend the event in person. Sharing a snap with his neighbour's dog, he wrote: 'Thanks to⁦ @radioacademy ⁩ #UKARIAS for sending me my Pioneer award which I received last night. 'Here I am sharing it with my friend Brook our next door neighbour.'Last month, Tony told his followers he would be needing more treatment before he is back to his usual self.He announced he would be standing down from his BBC Radio 2 show until he is better and postponing his live Sounds of the 60s gigs. ",
        "He explained: 'I wanted to give a little update on my health and let you know that I won't be on the radio or in theatres for a little while yet.'The infection I have is requiring more treatment than initially thought and it means I am having to reschedule the Sounds of the 60s Tour for the moment in order to recover fully.'All tickets booked will be automatically transferred to the new dates and you will be notified of this change by your ticket provider. I am sorry for the disruption and I really am looking forward to getting back on the road with the band.",
        "'I hope to be back on the radio as soon as possible but it might be a few weeks before I am able to get back in the studio. 'As you know, I am passionate about my radio shows and I will be back as quickly as I safely can. 'I want to thank all of the listeners who have sent their well-wishes and messages of support. I do read them all and it really means a lot.Tony added: 'Finally, to all the nurses, Dr's and support staff at Barnet General hospital who I spent a few days with over the last week, thank you for looking after me. You are brilliant!'Tony was forced to pull out of his BBC Radio 2 show again just a week before and postpone gigs on doctors orders amid an ongoing health issue."
    ]
}