{
    "articleURL": "/wires/pa/article-12050175/Play-offs-promotions-safety--needs-weekend-EFL-season.html",
    "content": [
        "The 72 EFL clubs are set to play their 46th and final league game of a gruelling season this weekend, with promotion, play-off and relegation spots still to be decided.",
        "Here, the PA news agency looks at the state of play across the three divisions.ChampionshipBurnley are champions and Sheffield United have secured automatic promotion in second place.Relegation spots are also confirmed following the Blades’ loss at Huddersfield on Thursday night, with Neil Warnock’s side securing safety at the expense of their final-day opponents Reading. The Royals will join Blackpool and Wigan in dropping down to the third tier.Meanwhile, victories last weekend put Coventry and Millwall in prime position to make the play-offs alongside Luton and Middlesbrough, but there is a cluster of three teams hoping to sneak into the top six on the final day.Sunderland, West Brom and Blackburn can all theoretically qualify should they win. Three points for the Black Cats would virtually guarantee them a play-off place if Coventry lose or Millwall drop points, while – barring a thumping win at Swansea – Albion are likely to need Sunderland to slip up as well.Blackburn face Millwall in the knowledge that a win will see them leapfrog their opponents, but their goal difference of -3 leaves them relying on other results to go their way.League One",
        "Plymouth and Ipswich are promoted but the title race remains undecided. Plymouth have a one-point advantage but Ipswich’s vastly superior goal difference – +66 compared with +33 – means they will be champions if they better Argyle’s result on Sunday.",
        "Sheffield Wednesday, Barnsley and Bolton have qualified for the play-offs and will be joined by either Derby or Peterborough. The Rams travel to Wednesday knowing a draw is likely to be enough for a top-six berth, while Darren Ferguson’s Peterborough must win at Barnsley and hope for a favour from the Owls.MK Dons, Morecambe and Cambridge are in a three-way fight for League One survival. The Dons will stay up with a win at Burton, but a draw or defeat would open the door for their rivals.Morecambe can overtake the Dons by bettering their result against Exeter, while Cambridge can overhaul both teams (should they fail to win) with victory over the already-relegated Forest Green.Accrington, meanwhile, are all but down following defeat against the U’s last weekend. Stanley require a win and an unlikely 16-goal swing to go past MK Dons in 20th place.League Two",
        "Champions Leyton Orient and second-placed Stevenage will be playing in League One next season, but Northampton’s defeat against Bradford last weekend has left them in danger of missing out on automatic promotion for a second successive campaign.Having been denied by an incredible 7-0 Bristol Rovers’ victory on last season’s final day, the Cobblers know that a win at Tranmere this time around will see them go up. Anything less, however, will give Stockport the opportunity to secure promotion with three points against second-from-bottom Hartlepool.",
        "With the Pools already relegated alongside Rochdale, it is only third spot and the play-off places that are mathematically still up for grabs.Turning attention to the play-off picture, a point for Carlisle, Salford or Bradford will guarantee a top-seven finish, while defeat would see eighth-placed Mansfield draw level on points if they beat Colchester.The Stags also need to make up a deficit in goal difference, with Carlisle, Salford and Bradford currently eight, four and three goals better off respectively."
    ]
}