{
    "articleURL": "/news/article-12058027/Jarryd-Haynes-rape-victim-breaks-silence-harrowing-statement-court.html",
    "content": [
        "Jarryd Hayne's victim has statement read to courtEx-NRL star will be sentenced on Friday morning  Jarryd Hayne's rape victim has broken her silence and revealed the 'never-ending nightmare' of her attacker's actions. ",
        "In a devastating victim impact statement read to the NSW District Court by crown prosecutor John Sfinas on Monday, the disgraced football star's victim revealed how her life had been destroyed by the September 2018 rape.  'I still don't know how to put any of this into words,' she wrote. 'From the 30th of September 2018 my life has been launched into what feels like a never-ending nightmare.'",
        "The victim, who cannot be named for legal reasons, said her nerves had been shredded by the lengthy trial process.  The woman said she was hoping she could 'finally try to move on' with her life at the end of the second trial.But she said she hadn't had the chance to 'move on or feel peace' and had to relive the trauma 'over and over'.'Each time I feel like I'm starting to recover mentally a new court date arises and I'm back where I started,' she wrote. ",
        "'Those types of things don't just hurt, the assault was something horrible that happened to me, something I feel that was very private.'She added: 'In September it will be five years since this has happened. I was a 26-year-old with the world at her feet. I am now 31 and I still haven't been able to finish university.'",
        "She said she has been left 'extremely insecure' in her own body by the rape.'I am stronger, I am wiser, but I am damaged and I won't ever be the same person.' Hayne, 35, sported a thick beard and wore prison greens as he appeared in the NSW District Court on Monday.At several stages he leant over and whispered to his defence team. The court heard mitigating factors presented by Hayne's barrister, Margaret Cunneen SC.'It weighs on Mr Hayne very gravely what his wife and family (are going through),' she said.Ms Cunneen said his wife, Amellia Bonnici, who stood by him throughout his trial, was not in attendance at the hearing because of the intense media scrutiny.'What she's had to endure from the media is so bad that she's chosen not to attend today,' she said. She added: 'The media has been extremely negative and the social media has been appalling.'But NSW District Court Judge Graham Turnbull SC interrupted her to say that he had seen one of the children 'in the arms of the offender in their domestic environment'.Ms Cunneen revealed that Hayne is being held at Silverwater's MRRC remand prison in a three foot by four foot cell.   'Rather than an hour a day he is only permitted our 15 or 20 minutes out a day,' she said.",
        "'He can't even get a haircut because he is not allowed to mix with anyone.'The defence barrister revealed that his wife has visited him twice with their youngest child but the other children were being kept away.",
        "'An effort is being made to keep from them the nature of his absence from the family,' she said.  Ms Cunneen argued that Hayne's offences were at the less serious end because they did not involve penile penetration.Ms Cunneen told the court that there was 'unambiguously and mutual sexual context' in the lead-up to Hayne raping the woman.'Not only was there an unambiguous sexual flavour to it … there was talk about f**king by the complainant,' Ms Cunneen told the court.The court was told the victim had sent a text to a friend that said she 'turned down Jarryd Hayne, I'm a f**king idiot'.Ms Cunneen said the act occurred between 'two grown adults'.'The nature of the offences were oral and digital, taking place at precisely the same time for a period of 30 seconds,' she told the court.But Judge Turnbull said of the mitigating factors: 'It's bad enough, if I can put it that way. That's why no one is talking of anything but full-time jail.'The court has received character references from Hayne's wife, sister and four other people. ",
        "Eight friends and family members came to support Hayne in court, including his father, Manoa Thompson.    Ms Cuneen argued that Hayne was a 'very different man to the man who committed these two simultaneous offences back in September 2018'.'Our submission is that there is really no risk in the future of a repetition of this offence, she said.'Not only because he doesn't possess the personality and the thought patterns and sexual arousal patterns of a sexual offender but also because of his life that has turned around considerably since that hiatus in his relationship with his now wife.'She added: 'There is eloquent testament of Mr Hayne's pastor of his commitment to his Christian faith.'Judge Turnbull acknowledged that Hayne's fame had turned into 'infamy'.",
        " 'Previously he would be venerated for his achievements (but now) I would venture people don't want to be seen standing next to him,' he said.   The crown prosector Mr Sfinas told the court Hayne was married to Ms Bonnici and had two children at the time. But Judge Turnbull responded: 'This is not a court of morals, I'll put that to one side'.Later, Ms Cuneen responded to say there was an 'egregious misunderstanding' about the state of the relationship. 'They were not together at the time,' she said. ",
        "The prosecutor later withdrew the submission.  Ms Cuneen also made submissions regarding Hayne's lack of employment prospects following his sentence. 'The difficulty of finding employment in the future is far greater for him because he is so well-known,' she said.  'He can't conceal that (his conviction) and it has the potential to curtail his working life and the ways that he can make a living throughout the rest of his life.' She said her client was now in a 'very steady, dependable, loving relationship and a cohesive family unit'.  Ms Cuneen argued that his re-entry to custody was 'more onerous' than if he had served it all in one go. 'Re-entry to custody is extremely traumatic,'  she said.'The onerousness of entry into custody having been undertaken twice is something we could ask your honour to take into consideration.'Ms Cuneen added: 'It is not a common thing but it is very different thing when it happens because of a failure of the court - a glitching in the criminal justice system for which the offender is not responsible.'Prosecutor Sfinas argued that the 'size differential' between Hayne and the victim would have scared her.'There would have been a significant degree of fear engendered in the victim,' he said.Judge Turnbull agreed, adding: 'There was a fear factor but it was likely enhanced by his conduct not reflecting her expectations of a well-regarded and famous footballer.' ",
        "'She felt dirty and violated which is an inevitable consequence of this offence,' he said. However, he added: 'This is not a knife-point sex attack. This is not one where there has been threats which aggravate these things.'Hayne's barrister asked if he could attend via video link on Friday for his sentencing at 10am. The Judge asked him if he was returning to Silverwater and when his lawyer confirmed that he was the Judge said:  'I'm very sorry to hear that.'The court was told the sentence would be backdated to account for the time he already spent behind bars.After five years, three trials, an appeal and nine months in prison, Hayne was in April found guilty of sexually assaulting the woman at her Newcastle home in 2018.A higher court had previously slapped down Judge Turnbull's decision to allow Hayne to remain at liberty on bail to help his family get sorted for his looming prison sentence.Justice Richard Button said Hayne had 'committed extremely grave sexual offences' and described the initial decision to let him remain at liberty as being one made 'remarkably, in my opinion'. Justice Button said Hayne had 'no special or exceptional logistical problems to be encountered' to prevent him from being locked up immediately, although he noted there would be difficulties for his family.He said that 'whenever a loved person is incarcerated (it causes) enormous heartache'.Hayne was taken from the court down to the cells as his wife Amellia Bonnici sobbed. She hugged her husband for several minutes, repeatedly telling him that she loved him as a corrective services officer waited to take the ex-football player away. The pair rested their heads against one another. After a final hug, Hayne cried and wiped his eyes before being taken down to the cells to wait for a prison van to transport him off to custody.Hayne pleaded not guilty and denied sexually assaulting the then 26-year-old woman at her home at Fletcher, on Newcastle's outskirts, in September 2018.The jury was told the woman refused to consent to sex because the ex-Parramatta fullback had a taxi waiting outside.He had been in Newcastle for a two-day buck's party and had organised to pay a cab driver $550 to take him back to Sydney, where he was required to attend an event at midnight.The victim previously told the court that when she heard the taxi beeping outside her bedroom window she resolved there was 'no way' she was going to consent to sex. While he claimed the sexual encounter was entirely consensual, the jury accepted the woman's version of events that she repeatedly said 'no' and 'stop'.The jury of six men and six women took almost 23 hours to come to their guilty verdict on April 4. Hayne will return to court for sentencing on Friday. "
    ]
}