{
    "articleURL": "/wires/pa/article-12043087/Pub-closes-row-sparked-seizure-golliwog-dolls-police.html",
    "content": [
        "A pub has closed a month after its collection of golliwogs was seized by police, amid a boycott by suppliers.",
        "Five officers removed a collection of the dolls – based on 18th century minstrels and now regarded as racist caricatures – from the White Hart Inn in Grays, Essex, on April 4 after a hate crime allegation.The pub’s leaseholders, Benice Ryley and her husband Chris, reportedly closed the pub to customers from Monday night amid the fallout from the well-publicised dolls row. I feel gutted, totally and utterly gutted  Benice Ryley  In an interview with Thurrock Nub News, Mrs Ryley said “I’ve had enough”, claiming Carlsberg and Heineken had told the pub to stop selling their lager and that maintenance firm Innserve refused to work at the pub.She also criticised the Campaign For Real Ale (Camra) for entering the dispute after it removed the pub from the Good Beer Guide and banned it from receiving its awards.Mrs Ryley had displayed the collection of about 30 dolls, donated by her late aunt and customers, in the pub for nearly 10 years.The pub was graffitied and had five windows damaged on April 16 after the seizure of the dolls.",
        "Mrs Ryley told Thurrock Nub News: “I feel gutted, totally and utterly gutted. Hurt, upset. I’ve had very, very much support from many people about the gollies.“We’ve had a few bits of hate, which I personally don’t understand because it’s part of our life.”",
        "She insisted “young people these days don’t understand” the history of the dolls, saying some of her “collection” are “antiques”.She added: “I want them back. Basically, this is my life now, that they’ve ruined because we’ve got a stigma with our name now and with the pub.“I’m going to miss the pub, I’m going to miss the people. We have had so many laughs in here. We have had so much happiness in here.”She said she “probably would have plodded on with the pub” if the police had not become involved, but claimed “they’ve ruined our name”. We believe pubs are for everyone - there is never a place for discrimination  Nik Antona  An Essex Police spokesperson said: “At this stage our investigation is still ongoing.”The force last month denied being directly reprimanded by Home Secretary Suella Braverman after the dolls were removed.At the time, a source close to the Home Secretary said her unhappiness at the incident had been passed on to the force, as first reported by the Mail Online.The outlet quoted a Home Office source as saying police forces “should not be getting involved in this kind of nonsense” and should focus on “catching criminals”.Mrs Ryley previously previously told the PA news agency: “They’re my childhood history, it’s a part of our inheritance. I can’t see any harm.",
        "“I really am angry because what they’ve taken away is valuable.“I don’t know how they can find it offensive. If they don’t like it, they don’t have to come through the door.” After being made aware of the abhorrent display feature in the White Hart Inn, we advised the pub owners that we want nothing more to do with them  Heineken UK  Camra national chairman Nik Antona said: “Following the announcement that the White Hart in Grays, Essex, has closed, Camra now hopes this heritage venue is preserved as a pub and will provide a warm welcome to all.“We believe pubs are for everyone – there is never a place for discrimination.”A Heineken UK spokesperson said: “After being made aware of the abhorrent display feature in the White Hart Inn, we advised the pub owners that we want nothing more to do with them.“They go against everything we stand for. We believe pubs should be places of inclusivity and respect for all people, regardless of their race, ethnicity, religion or gender.“We have made it clear that we want all Heineken UK brands removed, and there will be no further contact with the pub from Heineken UK.”A spokesperson for Admiral Taverns, which owns the pub building, said: “The licensees have made us aware of their decision to leave the pub.",
        "“We will be looking to reopen the pub under the management of new licensees in due course.”A Carlsberg Marston’s Brewing Company spokesperson said: “We believe pubs should be an enjoyable place for everyone and we will take steps to seek removal of our beers from venues who do not share our values.“Whilst we do not directly supply the pub in question, after being made aware of the police investigation we contacted our third-party distributor to make our views clear.”"
    ]
}