{
    "articleURL": "/news/article-12047023/Hospital-nurse-admits-killing-20-Covid-patients-didnt-want-suffer.html",
    "content": [
        "A nurse in the Netherlands told clinic staff he had killed Coronavirus patientsAn investigation will look at patient deaths between March 2020 and May 2022A nurse in the Netherlands admitted to colleagues that he had killed at least 20 coronavirus patients, the public prosecution department said Thursday.",
        "Theodoor V, 30, was said to have been concerned about the suffering of his victims while working as a pulmonary nurse at the Wilhelmina Hospital in Assen.V was arrested three weeks ago at his home in Veenhuizen after confessing to staff while being treated at a mental health clinic in nearby Drenthe.Prosecutors said he had indicated 'several times' in his conversations with mental health staff that 'as a pulmonary nurse in the WZA, he had prematurely ended the lives of 20 patients during the coronavirus pandemic'.'The suspect allegedly performed medical procedures on patients who, in his view, were terminal and suffering, without instructions from a doctor. 'His statements were taken so seriously by the healthcare organisation that they decided, after extensive collegial deliberation and obtaining both internal and external legal advice, to break the confidentiality obligation and to report it to the WZA.'",
        "The suspect has now been ordered by an Assen court to remain in jail for at least another 30 days of pretrial detention.Authorities will continue to investigate patient deaths between March 2020 and May 2022, with the criminal investigation expected to conclude by June.A spokesperson said: 'Experts are currently looking to see if discrepancies can be found in medical records which could match the suspect's statements.'",
        "Until today, V had only been able to keep in contact with his lawyers.Victim families had been informed about the investigation two weeks ago, lawyer Sébas Diekstra told newswire ANP.Diekstra said: 'They have so many questions at the moment and the uncertainty about how their loved one died torments them enormously. 'Of course, the relatives also want proper research to be done, but at the same time they hope that the desired clarity will come very soon.'A relative of one of the victims said to Dutch media that V was connected to 24 patient deaths. The Wilhelmina Hospital has issued a statement online, dated 20 April.It said that the arrest of an employee on 17 April had 'shocked us'.'The nurse was arrested on suspicion of involvement in the death of patients at the WZA [hospital] during the coronavirus pandemic.'Hans Mulder, a board member of the WZA, confirmed the employee no longer worked for the hospital.Mulder added: 'We immediately took the report seriously and took the necessary steps. 'A first important step was to deactivate the employee who is the subject of the report. In this way, the behavior from the report could not be continued.' After an internal investigation, the hospital took the case to the authorities, who were able to launch a criminal investigation.",
        "WZA said it would not share much information at this stage as to avoid interfering with the investigation.Mulder said: 'We do have an eye for the well-being of our employees and any patients or surviving relatives involved. 'In the coming period, we will mainly focus, together with the police, on collecting facts.'",
        "Speaking to local newspaper Leeuwarder Courant, a spokesperson on behalf of the hospital's employees said the initial reaction shocked colleagues.Sylvia Sanders said: 'The news has hit like a bomb. You still see a lot of emotions among employees.'At the same time, you also feel the drive to go further and to steer the care, which must always continue.' Residents can share information relevant to the case with the Northern Netherlands police via 0900-8844. "
    ]
}