{
    "articleURL": "/wires/pa/article-12038709/Apple-Google-team-combat-unwanted-tracking-Bluetooth-devices.html",
    "content": [
        "Apple and Google are teaming up to thwart unwanted tracking through Bluetooth devices that were created to help people find lost keys, keep tabs on luggage or to locate other things that have a tendency to be misplaced or lost.",
        "The companies behind the iPhone and the software that powers Android phones on Tuesday submitted a proposal to set standards for combating secret surveillance on Apple’s AirTag trackers and similar gadgets.The concept also has the backing of Samsung, which sells the most Android smartphones worldwide, as well as tracking products similar to the AirTag such as Tile, Chipolo, and Pebblebee.The AirTag has become a popular item since its 2021 release, helping users pinpoint the locations of a wide variety of lost property. These new standards will minimise opportunities for abuse of this technology and decrease the burden on survivors in detecting unwanted trackers  Erica Olsen, National Network to End Domestic Violence  But stalkers have also deployed AirTags and similar products to shadow former love interests and other people who do not realise they are being tracked.“Bluetooth trackers have created tremendous user benefits, but they also bring the potential of unwanted tracking, which requires industrywide action to solve,” said Dave Burke, Google’s vice president of engineering for Android.",
        "Apple and AirTag hope to have a plan in place by the end of this year to thwart stealth tracking.The solution would be distributed through software updates to iPhones and Android phones.Erica Olsen, senior director of the National Network to End Domestic Violence’s Safety Net Project, applauded the effort to set an industry standard that she believes will help protect survivors of abusive relationships and other people that have been targets of stealth technology.",
        "“These new standards will minimise opportunities for abuse of this technology and decrease the burden on survivors in detecting unwanted trackers,” Ms Olsen said."
    ]
}