{
    "articleURL": "/wires/ap/article-12040387/Duran-HR-lifts-Rangers-4th-straight-win-beat-Dbacks-6-4.html",
    "content": [
        "ARLINGTON, Texas (AP) - Ezequiel Duran hit a go-ahead, two-run homer in the sixth inning, and the Texas Rangers beat the Arizona Diamondbacks 6-4 Tuesday night to match their longest winning streak of the season at four.",
        "Texas trailed 4-1 in the fifth inning before rallying for its sixth come-from-behind win this season and improving to 4-1 on its homestand. The Rangers reached double-digit hits for the 14th time.\"I think he´s a smart hitter,\" Rangers manager Bruce Bochy said of the 23-year-old Duran. \"I think he sees what they´re trying to do on each at-bat. He´s adjusting on the fly, which is what you like from a young kid. He´s shown good discipline up there. He´s mature beyond his years far as the offensive part.\"Marcus Semien and Travis Jankowski cut the deficit to 4-3 with RBI singles in the fifth off Zac Gallen, who entered the game with a 28-inning scoreless streak, the longest in the big leagues.\"It just goes to show you how good he was when he´s shutting teams down night after night or outing after outing because the big leagues has some good hitters, guys that can do the things we saw the Rangers do today,\" Diamondbacks manager Torey Lovullo said.Scott McGough (0-3) relieved to start the sixth and allowed a two-out single to Jonah Heim. Duran drove a 1-1 fastball 431 feet to center for his third homer this season and a 5-4 lead. Duran finished a triple shy of the cycle.",
        "Kevin Ginkel threw a run-scoring wild pitch in the seventh.Brock Burke (2-0) pitched 1 1/3 hitless innings, and Will Smith got four outs for his fourth save.Rangers starter Jon Gray gave up four runs and eight hits in 5 1/3 innings, raising his ERA to 4.40. Galen allowed three runs and seven hits in five innings with six strikeouts and no walks, failing to pitch six innings for the first time since opening day,.Ketel Marte´s homer and Dominic Fletcher´s run-scoring single gave Arizona a 2-0 first-inning lead. Nathanial Lowe had an RBI single in the bottom half, but Marte´s sacrifice fly in the second and Walker´s homer in the third built a 4-1 margin.TRAINER´S ROOMDiamondbacks: OF Corbin Carroll remains day to day with a bruised left knee after running into the Coors Field wall on Saturday.Rangers: C Mitch Garver took batting practice and expects to return to the lineup soon. Garver has been out with a mild knee sprain since April 8 ... SS Corey Seager (left hamstring) took grounders and participated in other baseball activities. Seager has been on the IL since straining his left hamstring running out a double April 11.UP NEXTDiamondbacks RHP Brandon Pfaadt is to make his MLB debut in Wednesday´s finale of the two-game series. Pfaadt, 24, is Arizona´s No. 1 pitching prospect. He is 2-1 with a 3.91 ERA in five starts for Triple-A Reno. LHP Andrew Heaney (2-2, 4.38) starts for Texas. ___",
        "AP MLB: https://apnews.com/hub/MLB and https://twitter.com/AP_Sports"
    ]
}