{
    "articleURL": "/wires/reuters/article-12050397/GRAPHIC-How-investors-trading-U-S-debt-ceiling.html",
    "content": [
        "LONDON, May 5 (Reuters) - A Washington stalemate on whether to increase the U.S. debt ceiling has raised the risk of a default as early as June and threatens a fresh rout in financial markets.",
        "While analysts reckon a crisis will be averted, just an increased probability of default would send shock waves across markets, said Janus Henderson's global head of fixed income Jim Ceilinski.Veterans of a 2011 standoff, when the U.S. reached the brink of default and suffered a credit rating downgrade, say negotiations may be even tougher this time.\"We're in an environment where the political backdrop is so much more divisive now than it was in 2011, which is making investors that little bit more fearful,\" said Invesco's director of macro research Benjamin Jones.Here's a look at how some are positioning.1/ PLAY T-BILLS, BUY USTSYields on some short-dated Treasury bills have shot up - two-month T-Bills have surged to over 5%, rising for six straight weeks.BlackRock says it's been buying Treasuries in anticipation of an economic slowdown and a protracted debt ceiling fight.Unigestion's head of investments, Olivier Marciot, said he was taking advantage of higher yields on longer maturity T-Bills likely to fall due after the \"X-date\" - when the government would exhaust its cash and borrowing capacity.Marciot said he had been taking advantage of a difference in yields between T-Bills of varying maturities as debt ceiling jitters had created an unmerited gap between bills that fall due before and after the expected X-date. For example, in April, yields on one-month T-bills were as low as 3.34% while six month bill yields approached 5.1%.",
        "\"This was very unusual,\" Marciot said. \"So we've been arbitraging.\"2/ RAINY DAY DEFAULT PROTECTIONCredit default swaps (CDS), which work like insurance against a debt default, are seeing strong demand.Traders most commonly use 6-month CDS, which on Thursday were trading around 241 basis points (bps), double where they stood 14 days ago, according to one market participant.\"Although a default is highly unlikely, the large potential pay out in the event of a CDS trigger on a technical default continues to attract U.S. CDS protection buyers,\" said Voon Kiat Lai, senior portfolio manager at Redhedge Asset Management.Closing in on the X-date, the risk premium on CDS might rise, making this protection more valuable and, therefore, more profitable if sold on to others, he said.3/ BUY THE YENDebt ceiling jitters are good timing for the yen, which slumped 1.6% last week as the Bank of Japan held fast to ultra-loose monetary policy. The safe-haven yen could be one beneficiary.Nomura currency strategist Yusuke Miyairi said another reason to expect yen outperformance if wrangling in Washington escalates is a strong correlation between dollar/yen and five-year Treasury yields.\"If debt ceiling concerns grow we think markets will price in more Fed rate cut expectations, which means 5-year yields would fall,\" said Miyairi.",
        "4/ STIMULUS: SAVE OR SPLURGE?Mikhail Zverev, manager of Edinburgh-based Amati Global Investors' strategic innovation fund, said that around 15% of his fund's holdings were companies broadly exposed to spending related to U.S. President Joe Biden's Inflation Reduction Act, a stimulus scheme now caught in the crosshairs of debt ceiling battles.Republican proposals for spending cuts may effect green investment initiatives signed into law last year.\"In equities, anything exposed to government spending will have a bit of a wobble\" as the X-date approaches, Zverev said.Zverev's fund owns stocks including Hubbell Incorporated , an electricity company, and tech defense contractor Leonardo DRS.5/ ALL THAT GLITTERSDeutsche Bank strategist Robin Winkler says a good hedge may be buying gold against the dollar, as it has the tightest relationship with newsflow around the debt ceiling.Spot gold, seen as a hedge against inflation and banking turmoil, is trading at around $2,040 per ounce, up around 12% so far this year and near record highs. In August 2011, as a debt ceiling crisis prompted a U.S. credit rating downgrade, gold rose 11% that month alone.\"The best hedge against increasing market concern is probably to be long gold against the dollar,\" said Winkler.(Reporting by Dhara Ranasinghe, Naomi Rovnick, Nell Mackenzie and Chiara Elisei in London and Davide Barbuscia in New York; Graphic by Prinz Magtulis; editing by Mark Potter)"
    ]
}