{
    "articleURL": "/wires/ap/article-12044689/Nigeria-evacuates-hundreds-citizens-hard-hit-Sudan.html",
    "content": [
        "ABUJA, Nigeria (AP) - Hundreds of Nigerians fleeing the fighting in Sudan were evacuated and brought back to the West African nation late Wednesday after days of delays that left many of them stranded in the desert and at the Egyptian border.",
        "More than 370 Nigerians, many of them students, arrived in the capital city of Abuja from Egypt at midnight aboard military and local planes. More than 2,000 remain either in Egypt or in Sudan and would be evacuated in the coming days, according to Sadiya Umar Farouq, the country´s minister for humanitarian affairs.The Sudan fighting, which broke out after months of escalating tension between the country´s military and a rival paramilitary group, has so far killed 550 people and displaced hundreds of thousands. Several countries are racing to evacuate their citizens from the troubled nation though millions remain there amid a fragile ceasefire.Both the Nigerian military and a local airline had their aircraft at the Aswan Airport in Egypt since Sunday but the evacuation was delayed because of logistics and documentation challenges at the border, all of which were resolved on Wednesday, authorities said.\"They have gone through a very traumatizing period but we are glad ... no life was lost,\" said Farouq, who received those who returning alongside other government officials at the Nnamdi Azikiwe International Airport, Abuja.The returnees arrived looking fatigued and some with only one backpack which they said contained their most precious belongings. They were then documented before receiving food and 100,000 naira ($216) for transportation back home. At the entrance of the airport, their family members wrapped them in hugs as their worries quickly turned to smiles and laughter.",
        "The returnees spoke of how they were stranded for days in the desert and at the Egyptian border after authorities denied them entry for lack of proper documentation. \"In the desert, there was no place to sleep in the extreme cold and for you to eat, food was expensive,\" said Yahaya Sadiq, one of the returnees.Some others went without food on some days after they ran out of cash and supplies as they escaped gunshots and bombardments. \"I was eating only once a day and it was my friend that was giving me food,\" said 19-year-old Shehu Hifzullah, who was studying medicine at Sudan´s Bayan University.There are more than 3 million Nigerians living in Sudan, according to Abike Dabiri-Erewa, head of the country´s diaspora commission. \"These are students coming back to their families; they are not refugees, they have homes. They went to study in pursuit of knowledge, so when they come home, they go to their families,\" said Dabiri-Ewa. \"The priority is for students, women and children.\""
    ]
}