{
    "articleURL": "/wires/ap/article-12058541/Why-mass-killings-Families-experts-seek-answers.html",
    "content": [
        "More than five years after his son was gunned down in the deadliest mass shooting in modern U.S. history, Richard Berger still asks why.",
        "Why Stephen Berger was killed the day after celebrating his 44th birthday. Why the gunman rained bullets over the Las Vegas Strip in 2017, turning a country music festival into a bloodbath. Why the massacre´s death toll didn´t shock U.S. leaders into doing more to prevent that kind of violence from happening again and again.Why?\"It´s just a hole in our hearts,\" Berger said. \"We just don´t know, and we just don´t know what to say.\"For the Bergers, the families of the other 59 victims in Vegas - and relatives and friends of countless others slain in mass killings across the country in the years since - the questions loom just as large now as when the crimes happened. Yet the carnage continues.Over the first four months and six days of this year, 115 people have died in 22 mass killings - an average of one mass killing a week. That includes the bloodshed Saturday at a Dallas-area mall where eight people were fatally shot.",
        "The total represents the highest number of mass-killing deaths this early in the year since at least 2006, an Associated Press data analysis shows, and the deaths were already happening at a record pace before the horror unfolded in Texas.The atrocities have been driven almost exclusively by gun violence, since all 22 of the incidents in 2023 involved firearms in some way. Mass shootings account for the vast majority of mass killings, though there are examples where the perpetrator used knives or other weapons as well.",
        "Experts point to a few contributing factors: a general increase in all types of gun violence in recent years; the proliferation of firearms amid lax gun laws; the effects of the coronavirus pandemic, including the stress of long months in quarantine; a political climate unable or unwilling to change the status quo in meaningful ways; and an increased emphasis on violence in U.S. culture.Such explanations are little comfort not only to the families ripped apart by the killings but to Americans everywhere who are reeling from the cascading, collective trauma of mass violence.This year's killings have happened in different ways, from family and neighborhood disputes to school and workplace shootings to explosions of gunfire in public spaces. They´ve taken place in rural as well as urban settings. Sometimes people knew their killers; sometimes they did not.The bloodbaths are defined by the FBI as mass killings when the events involve four or more fatalities within 24 hours, not including the perpetrator. The Associated Press and USA Today have tracked and compiled extensive data on these violent attacks in partnership with Northeastern University.The Las Vegas shooter´s motive remains unknown, even now. The high-stakes gambler was apparently angry over how the casinos were treating him despite his high-roller status, but the FBI has never uncovered a definitive reason for the slaughter, which ended with more lives lost than in any single mass killing in decades.",
        "Contributing to 2023's steady drumbeat of death: the grisly murder-suicide in Utah that left five children, their parents and their grandmother dead just days into the new year; the fatal shooting of six people, including three 9-year-old children, at an elementary school in Nashville; back-to-back rampages in California at dance studios and mushroom farms; and the mall shooting in Allen, Texas, on Saturday, when authorities say a gunman stepped out of a car and immediately started firing at people.Yet while these tragic events garner an outsize amount of attention in the news media and the public´s mind, they represent only a tiny fraction of overall gun deaths.Far more frequent are fatal shootings involving fewer than four people and deaths from domestic violence. And then there are the suicides, which make up more than half of the 14,000 gun deaths so far this year, according to the Gun Violence Archive, which monitors news media and police reports to compile data.Still, mass killings spark the deepest fear in most people's hearts.\"People around the country all send their kids to schools - and they worry about if they send their kid to school, are they going to get shot?\" said Daniel Webster, a professor at the Johns Hopkins Center for Gun Violence Solutions.",
        "The fact is, though they are less common than other gun deaths, the mass killings keep happening - 20 years after Columbine, 10 years after Sandy Hook, five years after Las Vegas, and less than one year after massacres at a supermarket in Buffalo, New York, and an elementary school in Uvalde, Texas.Which leads back to the same haunting question: Why?People who study such violence are also perplexed by the sustained pace of the brutality.\"We have plenty of examples of things that seem to be at the breaking point in this country,\" said Katherine Schweit, a former FBI executive who created the agency´s active shooter protocol after Sandy Hook. \"When I was asked to work on this in 2013, I didn´t ever imagine 10 years later I´d still be working on the same thing.\"It will take years - if it's even possible - for researchers to pinpoint what's behind the drastic increase in gun violence. Advocates say there are measures that could perhaps avert such crimes - firearms reform and weapons bans among them - but note there is little appetite on Capitol Hill to implement them.\"I think the United States has a relationship with guns unlike any other country in the world,\" said Kelly Drane, research director for the Giffords Law Center to Prevent Gun Violence. \"These events are a consequence of our failure to put in place prevention measures.\"",
        "President Joe Biden, an ardent advocate of stronger gun control, is frustrated with Congress' unwillingness to pass a ban on some semi-automatic rifles in the face of the powerful gun lobby led by the National Rifle Association. The NRA did not return an online request for comment.Lawmakers did pass what, for them, marked a milestone gun violence bill that toughens background checks for the youngest buyers, keeps firearms from more domestic violence offenders and helps states use red-flag laws that enable police to ask courts to take deadly weapons away from people who show signs they could turn violent. Biden signed the bill into law last year.The legislation and other measures have done little to slow the pace of violence or alleviate the nation's pain, which has been further exacerbated by the pandemic, climate change and the racial reckoning after George Floyd´s murder by police.\"These tragedies compounded one after the other, making it almost too much to bear,\" said Roxanne Cohen Silver, a psychology professor at the University of California, Irvine, who studies coping with traumatic life events.The mass killings, Silver noted, \"are just another tragedy on top of all of these other psychological and emotional challenges.\"Stephen Berger ´s father, Richard, is now 80. He spends his days with his grandchildren - one is a soccer goalie who reminds him of Steve, who had a passion for basketball. Their family awards annual athletic scholarships at Stephen´s high school.",
        "Berger watches the teenagers as they approach the next phase of their young lives, flush with promise and full of life. But his own son is dead, and five years later he´s still left wondering:Why?__Associated Press Writer Darlene Superville in Washington contributed to this report."
    ]
}