{
    "articleURL": "/wires/pa/article-12057799/Small-business-growth-booms-outside-London-Calder-Valley-named-UK-hotspot.html",
    "content": [
        "The Calder Valley has been revealed as the fastest growing area for small businesses in the UK, according to fresh research.",
        "The West Yorkshire area, which was the setting for BBC hit TV show drama Happy Valley, was pinpointed as a hotspot for start-ups by GoDaddy’s venture forward research initiative.Data from more than 2.3 million microbusinesses – companies with fewer than 10 employees – showed its density of new businesses grew by 70% over the past 12 months amid a boom in entrepreneurship.Local business owners said the recent cost-of-living crisis has driven support from local residents for their small, independent businesses. We live in an area made up of small villages, towns and hamlets, people can’t afford to travel miles in their car for services now, so they turn local – which helps our microbusinesses flourish. I would not want to move my business anywhere else  Craig Moffat, business owner  Craig Moffat, founder of Clean Wheels, a bike mechanic and services business in the area, said: “I’m not surprised that Calder Valley came on top of the microbusiness hub list in Britain.“People here have a wonderful entrepreneurial spirit, and the cost-of-living crisis has exacerbated a desire to support local businesses in the community.",
        "“We live in an area made up of small villages, towns and hamlets, people can’t afford to travel miles in their car for services now, so they turn local – which helps our microbusinesses flourish. I would not want to move my business anywhere else.”",
        "The report said this highlighted new business growth outside of London and the south of England, which had represented a majority of locations in last year’s top 10 regions.However, the latest top 10 had no representation from London and the South.Torfaen in Wales was the second, top-performing constituency, followed by Airdrie and Shotts in Scotland, Wirral West in Cheshire and Knowsley, Merseyside.Andrew Gradon, head of GoDaddy UK &amp; Ireland, said: “Venture forward demonstrates the enormous contribution made by Britain’s microbusinesses.“They have the power to add billions to the economy, while providing jobs and opportunity in their local communities. When they thrive, we all do.“It is heartening to see the growth in microbusinesses across Scotland, Wales and the North of England thriving.“Last year’s venture forward study revealed a North-South divide in Britain’s entrepreneurial landscape, but this year’s data suggests that it could be starting to close.”"
    ]
}