{
    "articleURL": "/wires/pa/article-12038635/Sue-Gray-accused-not-operating-inquiry-Labour-role.html",
    "content": [
        "Partygate investigator Sue Gray declined to speak to an inquiry into her discussions with Labour about a senior party role, a Cabinet Office minister has said.",
        "The internal probe into her planned switch from her high-ranking Whitehall position to become Sir Keir Starmer’s chief of staff has been paused “whilst we consider next steps”, Oliver Dowden said.In a written statement to the House of Commons on Tuesday, he said it is up to the anti-corruption watchdog to recommend how long to delay the former senior official’s start date with Labour. Ms Gray was given the opportunity to make representations as part of this process but chose not to do so  Oliver Dowden  Labour insisted that Ms Gray has “fully co-operated” with the Advisory Committee on Business Appointments (Acoba)’s separate review of the terms of her departure and new job offer.Deputy Prime Minister Mr Dowden noted that under Civil Service guidance, any contact between senior civil servants and leading members of opposition parties should be cleared by ministers.But he did not say whether the Cabinet Office deemed her to have broken rules, as had been suggested by several reports.The Cabinet Office has made submissions to Acoba, which will “consider evidence from a range of sources to make a recommendation on any appropriate restrictions on the appointment”, the statement read.The watchdog can set recommendations for when senior people leave government, including calling for a cooling-off period to avoid any conflict of interest.",
        "Mr Dowden said the Cabinet Office process “involved interviewing relevant persons” to establish “further details” on any contact between Ms Gray and Sir Keir.“I can update the House that Ms Gray was given the opportunity to make representations as part of this process but chose not to do so,” he said.“In order to maintain confidentiality towards an individual former employee, I am unable at this stage to provide further information relating to the departure of Ms Gray whilst we consider next steps.”A Labour source told the PA news agency: “Sue Gray has fully co-operated with the Acoba process and is awaiting their outcome. They are the designated channel in cases like this.”Dave Penman, leader of the FDA union which represents senior Whitehall staff, said Ms Gray “has the right” to prioritise the watchdog’s deliberations and stressed that she is no longer a civil servant.He told Times Radio: “Acoba is really the real deal when it comes to this and who’s going to make a decision. And it really should be, because it isn’t doing it for political ends. It’s doing it based on evidence, and I can understand why she’d prioritise that.”The Civil Service Code says officials of Ms Gray’s seniority must wait a minimum of three months before taking up outside employment.",
        "But Acoba could recommend a longer wait, with a maximum delay of up to two years.",
        "The committee does not have the power to block an appointment.Labour has pledged to abide by any Acoba recommendation in relation to the hiring of Ms Gray.In his “update into the circumstances leading to the resignation of a senior civil servant”, Mr Dowden said: “The decision on any recommended restrictions on the appointment is for Acoba.”Earlier, Sir Keir said he was “confident” Ms Gray had not broken any rules.The Labour leader said he “had no discussions with her while she was investigating Boris Johnson whatsoever, I don’t think anyone is suggesting that’s the case”.He accused the Government of “trying to resurrect a story about Sue Gray” because they “don’t want to talk about the cost-of-living crisis” before the local elections.Sir Keir is thought to want Ms Gray in place to help ready his party for power should he win the next general election, which is widely expected to be held next year.Senior Conservative allies of Mr Johnson have previously claimed that her jump from Whitehall to an Opposition political party called the Civil Service’s neutrality into question."
    ]
}