{
    "articleURL": "/tvshowbiz/article-12044225/Frankie-Demi-Sims-looked-glam-mini-dresses-TV-launch.html",
    "content": [
        "Frankie and Demi Sims were dressed to the nines as they stepped out at their House of Sims launch at the Jin Bo Law bar at the Dorsett City Hotel in London on Wednesday.",
        "The new OnlyFans TV reality show gives an intimate insight into the lives of former The Only Way Is Essex star siblings Frankie, Demi, Chloe and Charlie as they try to make it in Los Angeles, California.And Frankie, 28, put on a busty display as she attended the launch party for the series, wearing a low-cut, off-the-shoulder mini dress which featured semi sheer detail at the hem.She wore a long blue denim coat on her lower arms to show off her outfit and wore lashings of make-up to highlight her pretty features.Her sister Demi, 26, looked sensational as she wore a unique grey dress which left her toned stomach on show, with silver wraparound piping connecting the top half to the skirt. ",
        "The short skirt left her long legs on show and she opted for a pair of white high-heeled boots for the evening.Reality star Demi carried a silver bag to match her dress and appeared in good spirits a she arrived at the bash.The Sims family moved to LA in January to film the series and have promised it will be 'the realest show you're ever going to see'.And the Sims sisters signed a deal last year worth £1million to become the new Kardashians on OnlyFans' growing new TV venture.",
        "The girls left ITVBe's reality show TOWIE to pursue their new show House Of Sims which came out on Wednesday.As part of the deal, the family will open OnlyFans accounts, but will feature Instagram-style pictures, with no explicit content.House Of Sims has already racked the family £500,000 before it has even aired. Chloe told MailOnline: 'I get people will want to compare this to TOWIE, but this is a different concept; this will be a fly-on-the-wall insight into our lives as a family, currently calling it House of Sims as a working title.",
        "'It will be completely real, and we're really excited to bring our viewers along on a big unfiltered adventure.'We're proud to be The Sims, but being compared to the Kardashians all the time is a big compliment to us as a family. We want to see where this new show can take us and plan to go global.Chloe, who is also a co-producer of the show, added: 'We want to become one of the best reality TV shows out there. OFTV is fully supporting us with this. We can't wait to get started.'I feel very strongly that we should show ourselves in a natural light, showing all aspects of everything we do.'Frankie and Demi were joined by fellow TOWIE stars Ella Wise, Junaid Ahmed and Dani Imbert who arrived together for the bash.",
        "Dani looked sensational as she posed outside the hotel, wearing a black mini skirt with she teamed with a navy blue coat which featured string ties at the front. She wore a pair of black high-heeled boots and carried a silver handbag with her.Ella opted for a black leather ensemble which featured a tasseled fringe on both the top and the trousers. ",
        "Meanwhile, they were joined by fellow OnlyFans superstar, former Love Island star Megan Barton Hanson, who wore a black dress with a see-through panel at the front.Her toned stomach was visible to onlookers as she posed-up outside the hotel in the UK capital.The top featured a slanted neckline and the satin skirt had an asymmetrical hem, while she wore a black leather coat over the top.Screen star Megan opted for a pair of black heels to complete her look and went for a glamorous look with her make-up, including a bold red lip.Also in attendance was Samie Elishi, who appeared on the winter version of Love Island this year.The reality personality gave a glimpse at her midriff as she wore a caramel ensemble for her outing.She wore a black leather coat over her shoulders and carried a matching bag with her. ",
        "The first official trailer for new reality show House Of Sims has promised an intimate insight into the lives of siblings Chloe, Frankie, Demi and Charlie as they try to make it in LA.",
        "The series, which premiered on Wednesday, May 3 on Only Fans TV will show the former The Only Way Is Essex stars in a Kardashian-esque light.The Sims family moved to LA in January to film the series and have promised it will be 'the realest show you're ever going to see'.In the trailer, released last month, fans were given an exclusive insight into the party-heavy lifestyle of the influencers.'Here's to us and to killing it in LA!' said Chloe at the start, adding: 'In the UK we don't really need to sell ourselves. Here we're completely unknown.'",
        "Meanwhile, Charlie, 30, and his fiancée Georgia Shults, 31, were shown having a serious discussion about the future of their relationship and the family gasps upon seeing their new luxury mansion.The Sims sisters signed a deal last year worth £1million to become the new Kardashians on OnlyFans' growing new TV venture.The girls left ITV's reality show, TOWIE, to pursue their new show House Of Sims which is set to come out in May.The family dressed in leather for promo shots of the show and is expected to be very similar to the iconic reality show, The Kardashians on Disney+."
    ]
}