{
    "articleURL": "/wires/reuters/article-12052971/Motor-racing-Verstappen-Leclerc-crashes-Miami-practice.html",
    "content": [
        "Verstappen sets the pace for Red Bull in Miami practice",
        "Leclerc crashes but still third fastestRed Bull's Perez fourth in second sessionRussell led Hamilton in Mercedes one-two in first session(Adds quotes)By Steve KeatingMIAMI, May 5 (Reuters) - Red Bull's championship leader Max Verstappen was comfortably fastest while Charles Leclerc crashed his Ferrari into the barriers in second practice for the Miami Formula One Grand Prix on Friday.Leclerc went off at turn eight, the car snapping and locking up as it went nose first into the barriers and wrecked the front suspension.The incident brought out the red flags with 10 minutes remaining, the Monegasque stepping out and walking away with his session over.Verstappen had already made it business as usual at the top with a 1:27.930 effort on an improving track after George Russell had led seven times world champion Lewis Hamilton in a Mercedes one-two in the first session.\"I think it was a good day,\" said the Dutch double world champion, whose team have won all four races so far this season with three one-twos.\"Initially I think it was getting used to the track a bit with the new Tarmac, it really was ramping up a lot throughout the day, but I always felt good in the car and we had a good balance in it.\"",
        "Red Bull's Mexican Sergio Perez, second in the championship and six points adrift of Verstappen, was fourth and nearly half a second slower.\"Generally I think we've got a good baseline,\" he said.\"I haven't had the greatest of Fridays but I locked up on the final corner so there's quite a bit to come ... I'm not driving really well today so I think if I'm able to improve my driving and get myself a bit more comfortable it should be alright.\"Russell's best time of one minute 30.125 seconds came after the Briton experienced steering issues that cost him some time in a hot and steamy session.A team spokesperson said the Briton was using a test item that proved too heavy so they changed the steering rack back to the old one.\"Part of the reason we're up there is we were the last car on track doing new tyres and they got clean laps,\" said Mercedes trackside engineering director Andrew Shovlin.\"But we've had races this year where no matter what we did we could never get up near the top of the timesheets. So I think it's encouraging but one to keep in perspective.\"Russell was 15th in the second session and Hamilton seventh.Leclerc was third fastest in both sessions while team mate Carlos Sainz was second in practice two, 0.385 slower than Verstappen.",
        "Aston Martin's Fernando Alonso ended up fifth on the 3.36 mile (5.41km) temporary street circuit around Hard Rock Stadium, the home of the NFL's Miami Dolphins, with McLaren's Lando Norris sixth.Verstappen, the winner of the inaugural Miami Grand Prix last year, was nearly a half-second off the pace in the first session.Perez, six points behind and a double winner last weekend in Azerbaijan with the first sprint of the season, was well down the timing sheets in 11th in that opening practice.Haas's Nico Hulkenberg spun and slammed into the wall, bringing out the red flags in that session.Until then Hulkenberg had been enjoying a lively practice for the U.S.-owned outfit, sitting second behind Verstappen when the session was paused.Logan Sargeant, the only American on the starting grid who grew up in nearby Fort Lauderdale, could not give the fans much to cheer. The Williams rookie finished 19th and 20th respectively. (Reporting by Steve Keating in Miami/Alan Baldwin in London. Editing by Toby Davis and Stephen Coates)"
    ]
}