{
    "articleURL": "/wires/aap/article-12040027/Smacking-ban-urged-protect-childrens-mental-health.html",
    "content": [
        "Experts have renewed a push to ban Australian parents from smacking their children, arguing it can double rates of anxiety and depression in young adults.",
        "Corporal punishment by a parent or carer to a child, within \"reasonable limits\", is still legal in all Australian jurisdictions, despite being banned in 65 countries.Professor Sophie Havighurst from the University of Melbourne's Department of Psychiatry says Australian children should have the same right to protection as adults.\"If it's illegal to hit your neighbour, their child or their dog, why is it legal to hit your child?\" Prof Havighurst said.\"Smacking acts as a model that those closest to you can hit you if they don't like what you do.\"What does that mean for a child when they grow up?\"Many studies show smacking doesn't change children's behaviour, but the disciplinary method is still widely used, according to the first national Australian Child Maltreatment Study published last year.Co-author Daryl Higgins says the study found 60 per cent of 18-24 year olds had experienced more than four instances of corporal punishment in their childhood.\"There are very clear implications that the consequences of corporal punishment are not benign,\" he told Nine's Today show on Wednesday.\"People will excuse what they think is the right way to parent when, in fact, the evidence shows that it's not.\"The study found smacking contributed to worse mental health in young adults and increased children's risk of violence with their peers and later in life.",
        "The researchers are calling for Australian law reform to mirror New Zealand and a public health campaign highlighting the effects of corporal punishment on children.Professor Higgins said the federal government should lead the way.\"This is a public health issue,\" he said.\"We just need to have leadership.\"Lifeline 13 11 14Kids Helpline 1800 55 1800 (for people aged 5 to 25)"
    ]
}