{
    "articleURL": "/wires/reuters/article-12058223/Willson-Contreras-returns-Wrigley-time-Cards-visit-Cubs.html",
    "content": [
        "The addition of Willson Contreras hasn't prevented the St. Louis Cardinals from owning the National League's worst record.",
        "Perhaps a return to Wrigley Field against Contreras' former team will provide some incentive for the Cardinals, starting with Monday night's series opener against the Chicago Cubs.Cubs fans weren't happy when Contreras, who was a three-time All-Star in seven seasons with Chicago, signed a five-year, $87.5 million deal with the club's biggest rival. However, entering this first 2023 meeting, the Cubs are a competitive squad that just took two of three from Miami, while the Cardinals are 11-24 and snapped an eight-game skid with Sunday's 12-6 win over Detroit.Perhaps St. Louis' struggles will make Contreras more receptive to the Wrigley crowd Monday night.\"I'm pretty sure there's going to be a lot of (Cubs) fans that are going to be happy to see me,\" the veteran catcher told the Chicago Sun-Times.\"And there's going to be a lot of fans that think I betrayed them because I'm playing with the Cardinals. ... But it's part of baseball, part of the business.\"However, Contreras likely could not have imagined that his early experience with the Cardinals would be this frustrating.\"I take the losses personally because I came here to win,\" Contreras told the St. Louis Post-Dispatch.Especially since St. Louis manager Oliver Marmol recently announced Contreras, who is hitting .265 with two homers and 14 RBIs, will be mostly used as a designated hitter and outfielder going forward. Catchers Andrew Knizner and Tres Barrera will be used behind the plate to provide familiarity for a Cardinals pitching staff that ranks in the bottom half of the majors with a 4.59 ERA and .273 opponents' batting average.",
        "Monday's scheduled starter Miles Mikolas (1-1, 5.79 ERA) took a no-decision after allowing three runs and eight hits while striking out five without a walk in 5 2/3 innings of Wednesday's 6-4 loss to the Los Angeles Angels.The right-hander has been solid against the Cubs, going 5-3 with a 2.16 ERA in 16 career appearances (14 starts). However, he yielded nine runs (seven earned) in 11 2/3 innings in two 2022 starts at Wrigley.Chicago's Eric Hosmer, Nico Hoerner and Tucker Barnhart are a combined 16-for-41 (.390) against Mikolas. Cody Bellinger is 0-for-7 versus Mikolas but is batting .318 in his last 11 contests for the Cubs, who have gone 6-11 after starting 11-6.Prized Cubs first-base prospect Matt Mervis went 4-for-14 with two RBIs, and played some solid defense, during his first major league series after making his debut Friday.\"He hits it hard, for sure,\" Cubs manager David Ross said of Mervis. \"I liked the way he handled the moments.\"Scheduled Cubs starter Marcus Stroman (2-2, 2.18) has enjoyed a strong start to 2023 and allowed a run with five hits and three walks in six innings while taking a no-decision at Washington on Wednesday. However, the right-hander yielded 14 runs and 21 hits over nine innings in two 2022 home starts versus St. Louis.",
        "St. Louis star Paul Goldschmidt is 8-for-18 with three homers and two doubles versus Stroman. Goldschmidt homered three times Sunday and is 9-for-19 with six RBIs in the last four games for the Cardinals, who haven't won two straight since April 11-12.--Field Level Media"
    ]
}