{
    "articleURL": "/wires/reuters/article-12040239/US-continue-humanitarian-program-Title-42-end-date--joint-statement.html",
    "content": [
        "By Brendan O'Boyle and Kylie Madry",
        "MEXICO CITY, May 2 (Reuters) - The United States will continue to accept migrants from Cuba, Haiti, Nicaragua, and Venezuela under a humanitarian program after May 11, when the COVID-19 health policy known as Title 42 is set to end, the U.S. and Mexican governments said on Tuesday.Mexico, for its part, will continue accepting back migrants returned to the country on humanitarian grounds, both nations said in a joint statement.The announcement comes as the U.S. prepares for the end of the Title 42 policy and a possible subsequent spike in illegal border crossings.The U.S. has said it plans to ramp up deportations after May 11.Mexico has been accepting migrants deported from the United States under the Title 42 policy, which allows the U.S. to rapidly expel migrants including Cubans, Haitians, Nicaraguans and Venezuelans illegally entering the U.S.A U.S. official said last week that the U.S. intends to continue expelling migrants of those four nationalities back to Mexico after the program's end date.The statement came after Mexican President Andres Manuel Lopez Obrador met with White House Homeland Security Advisor Elizabeth Sherwood-Randall earlier in the day to discuss migration ahead of Title 42's impending end.Tuesday's announcement indicates that a U.S. humanitarian parole program providing legal migration pathways for Cubans, Haitians, Nicaraguans, and Venezuelans will continue after May 11.",
        "Sherwood-Randall told Mexican authorities \"that the humanitarian parole program will continue,\" Mexican Foreign Minister Marcelo Ebrard told journalists following the meeting.Mexico also pushed for the further expansion of the program, as well as other legal pathways to entering the United States, Ebrard added.The two countries also said the United States would accept some 100,000 people from El Salvador, Guatemala and Honduras under a family reunification program announced last week, but did not give a time frame for that number.Additionally, the countries agreed to boost efforts to combat human smuggling following a U.S. agreement with Colombia and Panama to curb migration through the dangerous jungle region separating the two nations. (Reporting by Brendan O'Boyle; Editing by Stephen Coates)"
    ]
}