{
    "articleURL": "/news/article-12057269/Business-traveler-wakes-Nashville-hotel-room-manager-sucking-toes.html",
    "content": [
        "David Patrick Neal was charged with aggravated burglary and assaultNeal was the manager at the downtown Nashville Hilton Hotel when he was allegedly caught sucking on a sleeping guest's toes at 5am on March 30The guest is suing Neal, who has a manslaughter conviction, for sexual assault  A business traveler who was spending the night in a Nashville hotel woke up to find the night manager of the property sucking on his toes, court records show.",
        "The victim said he was sleeping at the downtown Nashville Hilton Hotel on March 30 when he woke at about 5am to discover manager David Patrick Neal, 52, indulging in a foot fetish on his lower digits.Startled, the guest said he screamed and called the police. Neal later said he used a cloned key to enter the room because he smelled smoke, though police reports noted he hadn't reported the smells to anybody else at the time.Neal, who has a long rap sheet that included manslaughter for shooting his roommate dead in the 1990s, was arrested Friday and charged with aggravated burglary and assault.The guest, identified as Peter Brennan, has now sued Neal for sexual assault.",
        "He told WKRN that after being awoken in March, he immediately recognized Neal because the manager had visited the room the previous night to fix the television set.When police arrived, Neal admitted he'd used a cloned key to access the room, but he threw it out after being caught.The guest said he was horrified by the incident, and it had shattered his sense of security. 'All my life you just have that sense of security, and that sense of peace, right? It's not like you're camping and you have to kind of keep one eye open,' he told WKRN. 'You have that security that's yours, and when you close your eyes, you feel like you're safe and you're protected and it was a complete violation.'",
        "'I was just so, so shocked. It was, 'Who are you? Why are you in my room?' It was almost like a dream, a sort of nightmare. It just didn't make sense. Why is this person touching me?'He was talking to me but not giving me any substantive answers.'Brennan, who served in the Air Force, obtaining the rank of lieutenant and is also a former intelligence officer, says he is now having trouble in his own bed.'I'm having problems sleeping - going through some PTSD and talking to a therapist,' he explained. When Brennan reported the act to Hilton's security, he claims they 'did not appear to take his complaint seriously.' He then called the local police who are now investigating the incident.Feeling unsafe and vulnerable, Brennan cut his business trip short and returned home to Texas. ",
        "The victim's attorney, Michael Fisher, told WKRN he was appalled the Hilton had hired somebody like Neal into a job where he would have unmitigated access to guests' rooms.'Multiple charges of forgery, drinking and driving, a manslaughter conviction as well, which served prison time,' Fisher said. 'When Hilton hired this person, they had to have known. They have to do background checks to know, and the fact that they would put somebody like that in a position where they have the ability to clone keys, have the ability to get into a guest's room.'",
        "After his arrest Neal was held after he didn't post $27,000 bail. In 1996 Neal was charged with second degree manslaughter for shooting his roommate dead during a fight.Neal said the killing was made in self-defense, but a jury found him guilty of voluntary manslaughter."
    ]
}