{
    "articleURL": "/news/article-12051445/Bill-Clinton-says-knew-matter-time-Putin-invaded-Ukraine-meeting.html",
    "content": [
        "Putin said he did not agree with Boris Yeltsin deal to respect Ukrainian territoryEx-president Bill Clinton made the claims as he urged West to increase support Bill Clinton has revealed that he knew as early as 2011 that it was 'only a matter of time' until Vladimir Putin would invade Ukraine, after the warmonger made a chilling warning to the former US president.",
        "During a tense discussion between the leaders in Davos, Switzerland, three years before Russia invaded Crimea, Putin made it apparent that he did not agree with a deal to respect Ukraine's borders.The US-brokered agreement between Putin's predecessor, Boris Yeltsin, and Kyiv, stated that Ukrainian territory would not be infringed upon in exchange for Kyiv relinquishing its Soviet-era nuclear arsenal.'Vladimir Putin told me in 2011 — three years before he took Crimea — that he did not agree with the agreement I made with Boris Yeltsin,' the FT quoted the former US president as saying at a New York event.'He said... 'I don't agree with it. And I do not support it. And I am not bound by it.' And I knew from that day forward it was just a matter of time.'",
        "The revelation was made during a joint appearance at an investment firm talk with his wife, former Secretary of State Hillary Clinton, which the couple used to urge for greater support of Ukraine.Former Presidential candidate Mrs Clinton also took a swipe at Putin, who she has previously blamed for helping to undermine her election bid against former president Donald Trump.She said Putin 'is in what he views as a righteous struggle to undermine western democracy and reinstitute, as much as he can, the Russian empire. So he's not going to stop.'",
        "The Democrat politicians also reiterated the importance of Western support to Ukraine, saying that continuing to supply arms could help the country win the war.A united Western response, they said, would also work to deter China from its ambitions in Taiwan in the short term - with Mrs Clinton saying that Xi Jinping had paid attention to the stand taken by the US, UK and others.She added that she 'wouldn't trust' Putin at a negotiating table 'under any circumstances', saying the only way the war could end would be if Ukraine secured 'leverage' - either a military defeat or regaining its lost territory.The Clintons' stark warnings come after Kremlin spokesperson, Dmitry Peskov, escalated tensions by claiming that the US was behind a drone strike which Russia said was launched by Kyiv to assassinate Putin.The Kremlin mouthpiece insisted - without providing evidence - that the US was 'undoubtedly' behind the strike that he said was carried out by Ukraine.",
        "The White House has roundly dismissed the claims as 'lies'.'Decisions on such attacks are not made in Kyiv, but in Washington,' a furious Peskov said. 'Kyiv only does what it is told to do. Attempts to disown this, both in Kyiv and in Washington, are, of course, absolutely ridiculous.'",
        "Ukrainian President Volodymyr Zelensky denied Russia's claims Ukraine was behind the drone strike on the Kremlin and British security officials believe the attack was a 'false flag' operation by Russia to distract Kyiv from its anticipated counter-offensive and rally up support back home.",
        "Around 40 explosive-laden drones with 'for Moscow' scrawled on them were fired by Putin's forces at cities that were miles away from the front line, with explosions heard in the capital Kyiv and southern cities of Odesa and Zaporizhzhia. While Ukraine has demonstrated the capability to launch such attacks on the Kremlin, Kyiv is considered unlikely to risk fracturing international support by targeting the dictator directly. A Russian 'false flag' attack appeared a more likely explanation, with the explosion intended to generate support for Putin and further Russian attacks on Kyiv, UK officials said last night. "
    ]
}