{
    "articleURL": "/wires/pa/article-12057731/Katy-Perry-spent-night-Windsor-Castle-ahead-Coronation-Concert.html",
    "content": [
        "Katy Perry has revealed she spent the night in Windsor Castle ahead of delivering a spectacular performance at the King’s Coronation Concert.",
        "The US singer, 38, gave an electric rendition of her hit tracks Roar and Firework at the celebratory event held in the grounds of the castle on Sunday evening, dedicating the latter to the King in honour of the work they do together with the British Asian Trust and their Children’s Protection Fund.Dressed in a glistening, metallic-gold, voluminous ballgown which featured a train and matching sleeves, she made a dramatic entrance by walking out singing the opening lyrics to Roar as a drone projection of a lion’s head graced the sky above her.",
        "The upbeat pop song was enjoyed by Princess Charlotte who could be seen singing along with the American pop star, next to her mother the Princess of Wales, who swayed along to the song.The performance was accompanied by a dazzling light display which lit up the audience and the sky.Regal decoration and the image of a lion were also projected onto the halo-like screen above the stage and the other surrounding monitors.Ahead of her performance of her song Firework, Perry told the cheering crowd of around 20,000 people which included the King and Queen: “I am so happy to be here with you people, I love you so much.“I’m so happy to celebrate this whole weekend. I got to bring my mum, she is so happy to be here and we get to stay in Windsor Castle – no big deal.”",
        "She added: “And thank you for having me at this coronation celebration. I would like to dedicate this next song to the King and to the work that we get to do together for the British Asian Trust and the Children’s Protection Fund.“Thank you for bringing out the firework in so many people young people.”Charles and Camilla could be seen smiling at each other during her dedication and later applauding the performance.As she belted out the pop hit, multicoloured lights danced across the sky and a rainbow was projected across Windsor Castle.The audience excitedly sang along while waving Union flags throughout the song, which ended in dazzling fashion with pyrotechnics.A choir and full orchestra also accompanied the singer throughout her performance.Ahead of her taking to the stage, she posted a video on her Instagram of her asking fashion designer and fellow concert performer Stella McCartney a series of “hard-hitting questions” about British culture.Among the questions was the classic debate: “Do you leave the bag in or take it out before the milk?” to which McCartney voted to take it out before, with a horrified look on her face.She also inquired whether jam or cream should be put on a scone first, as well as asking: what is a Jaffa Cake?",
        "Perry was also among the celebrity guests who attended the King and Queen’s coronation service on Saturday along with fellow performers including Lionel Richie.The global pop star had a number of notable moments from the service including appearing to lose her seat at Westminster Abbey during the event.A video shared widely on social media showed Perry, who was wearing a bespoke lilac skirt suit by Vivienne Westwood, walking in circles as she looks through the crowd to find her seat.The 38-year-old took to Twitter to respond after tens of thousands liked and shared the footage, writing: “Don’t worry guys I found my seat.”This was not the only mishap spotted by the public, as Perry also appeared to lose her footing as she left the ceremony.The pop star was pictured being supported by other guests after she nearly took a tumble on her way out of the service."
    ]
}