{
    "articleURL": "/femail/article-12050793/Gwyneth-Paltrows-daughter-Apple-HORRIFIED-mom-spilling-secrets-sex-life.html",
    "content": [
        "The actress, 50, sat down with Alex Cooper, 28, on her Call Her Daddy podcastShe shared a slew of intimate details - including who of her exes was best in bedHer 18-year-old daughter, Apple, seemed very uncomfortable by the admission Gwyneth Paltrow's daughter, Apple Martin, seemed absolutely horrified when her mom started spilling secrets about her sex life during her recent appearance on Alex Cooper's Call Your Daddy podcast.",
        "The actress, 50, sat down with Alex, 28, earlier this week, and during their interview, she shared a slew of intimate details - including who was better in bed between her exes Brad Pitt and Ben Affleck.Now, the host has revealed how Gwyneth's 18-year-old daughter reacted to her mother's raunchy admissions, and it looked as though the teen was very uncomfortable.In a clip shared to the Call Her Daddy Instagram page on Thursday, Apple could be seen covering her ears as her mouth opened wide in shock.",
        "The teen, who donned a white, Rolling Stones hoodie and a pair of jeans, laughed awkwardly before the camera panned away from her to show her mom. ",
        "'I love you Apple thanks for supporting the show… and your mom on this ep,' read the captioned. Gwyneth shares Apple and son Moses Martin, 17, with her ex-husband, Chris Martin, whom she was married to from 2003 to 2014. Throughout the sit-down, Alex pressed Gwyneth about her past romances with Brad and Ben, forcing the Iron Man star to spill numerous secrets - including who performed better sexually.Gwyneth dated Brad from 1994 to 1997. She then went on to have a three-year relationship with Ben. When asked who impressed her most in the bedroom, she explained, 'That's really hard.",
        "'Because Brad was like the major chemistry love of [my] life at the time. And then Ben was, like, technically excellent.'The mother-of-two added, 'I can't believe my daughter's listening to this.'",
        "She also answered a series of other comparison questions, including who she felt was the better actor - she picked Brad - and a better kisser - she couldn't decide. 'They're both so talented. And Ben is a great writer and director, but I guess I would probably have to say acting alone, Brad,' she dished. 'Because if you think of all the different roles that he's done.' She also said Brad has a better sense of style and was more romantic throughout their romance, while Ben made her laugh more. Since launching her lifestyle brand Goop 2008, Gwyneth has become an increasingly extroverted over-sharer, posting everything from lists of her favorite sex toys to masturbation tips to her website."
    ]
}