{
    "articleURL": "/news/article-12051399/Dunelm-slashing-prices-1-000-products-shipping-costs-fall.html",
    "content": [
        "Move also designed to boost Dunelm's sales due to the cost of living crisis The good news is that the discounts are available both in stores and online Popular homeware chain Dunlem is slashing the prices on thousands of its products, as shipping costs have fallen.",
        "This rare move is good news for cash-strapped customers and families who are looking to re-decorate their home on a bargain.Lockdowns across the world during the Covid-19 pandemic caused huge supply chain blockages.Due to the pandemic, that the cost of shopping goods between places like China or Japan to Britain skyrocketed.In fact, during this period, container prices increasing from £1,000 to a whopping £20,000. The move has also been designed to boost Dunelm's sales as the ongoing cost of living crisis has meant that many Brits have been unable to afford essentials in their homes. ",
        "As wholesale shipping costs skyrocketed, furniture retailers, such as Dunelm, were particularly badly hit because a number of products are sourced from Asia. But now, as shipping costs have fallen back to pre-pandemic levels, Dunelm has discounted the prices on thousands of its items. Over the next two weeks, over a thousand products will have lower prices - with an average fall of 14%, or £11.76.And the good news is that the discounts are available both in stores and online. Some of the discounts Dunelm fans could get include 30% off the price of a double hanging egg chair - which has been reduced from £499 to £349. Another of the price cuts includes an Ottoman bed which will be reduced from £999 to £799, and a London Wall mirror has been reduced by £20 to £55. ",
        "A side table has had £20 knocked off taking it to £29 and Dorma pillowcases have also been lowered from £13 to £10.Meanwhile Dunelm has also slashed the price of its rope garden chair from £299 to £199, giving shoppers 33% off. ",
        "Speaking about the move, Nick Wilkinson, Dunelm chief executive, said: 'Giving our customers great value and quality is in Dunelm's DNA, and we don't intend to stop now. 'Our customers can trust us to do the right thing and passing on cost savings as shipping costs reduce is just one way we can help them during challenging times.'The move has also been designed to boost Dunelm's sales with the cost of living crisis in mind.It aims to prompt shoppers to rein in their spending and prioritise their budgets towards going away on holiday and other leisure experiences. The retailer said both in-store and online sales are achieving 'strong growth' post pandemic, and that investment into digitalising the business was 'delivering strong returns'. Dunelm currently has 179 shops in the UK. "
    ]
}