{
    "articleURL": "/tvshowbiz/article-12041053/Meghan-Trainor-reveals-shared-secret-kiss-Charlie-Puth-snog-AMAs.html",
    "content": [
        "Meghan Trainor has revealed she once shared a secret kiss with Charlie Puth.",
        "The singer, 29, publicly shared a snog with her former collaborator, 31, on stage at the 2015 AMAs - but she's now let slip that they smooched in private too.During an appearance on Watch What Happens Live With Andy Cohen, she confessed they 'got it on' while recording their track, Marvin Gaye, before locking lips at the prestigious ceremony.Meghan told the host: 'The day we recorded Marvin Gaye - a very, like, romantic song - there was booze and we made out that night in the studio.'Ooh tea... and then never again. We were in that moment, the song got to me, the liquor. It was great.'",
        "Meghan and Charlie shocked the American Music Awards audience with a surprise kiss eight years ago.The two performed in front of a packed house before locking lips at the close of their rousing performance.But Meghan, then 21, and Charlie, then 23, continued their full-on make-out session long after the applause ended, leading many to believe in the sincerity of the passion on display.The kiss came after the two performed Meghan's latest hit, Like I'm Gonna Lose You, and then Marvin Gaye.In an interview with the American Music Awards' social media correspondent Chelsea Briggs, Charlie revealed that he and Meghan are however, strictly business.",
        "'There was a lot of making out. The dancers were making out and I’m sure some of the other dancers were making out. I think that’s it though,' he said jokingly.'We’re friends and it’s all part of my whole vision when I made Marvin Gaye, for people to hear the record and spontaneously make out with each other. That was the goal tonight for the live show.'",
        "This wasn't the first time the singers worked together.Charlie previously made a cameo in Meghan's video for her single, Dear Future Husband.In an interview with EW, the handsome singer revealed how he met the songstress, ultimately leading them to work together on his hit single.'We actually met at a party in the Hollywood Hills, and I played her a very early demo version of Marvin Gaye and she memorized the song and sang it in the studio a week later…. She’s taken me on and introduced me to her fans. They call themselves the Megatrons, and they’ve kind of adopted me,' he said."
    ]
}