{
    "articleURL": "/news/article-12050233/Biden-expected-Air-Force-chief-Charles-Q-Brown-Jnr-general.html",
    "content": [
        "Brown's expected appointment would replace current chairman Mark MilleyHe would be the second black man to be chairman of the Joint Chiefs of StaffIf President Joe Biden's likely pick for chairman of the Joint Chiefs of Staff has a manifesto for being only the second black man in the job, it was set out in a powerful video he made at the height of racial unrest following the murder of George Floyd.",
        "'I can't fix centuries of racism in our country, nor can I fix decades of discrimination that may have impacted members of our Air Force,' said Gen. Charles Q. Brown Jr. in June 2020, as President Donald Trump considered using the Insurrection Act to quell nationwide protests.'I'm thinking about how I can make improvements personally, professionally and institutionally. 'So that all airmen both today and tomorrow, appreciate the value of diversity and conserve an environment where they can reach their full potential.'It was an unusually public statement for such a senior officer, particularly one who was days from his Senate confirmation as Air Force chief of staff.",
        "But he is now expected to be named as the successor to Gen. Mark Milley when his term ends in September.It would mean that the top two posts at the Pentagon are held by African-Americans for the first time, with Gen. Brown serving alongside Defense Secretary Lloyd J Austin III.And it comes after Republicans have repeatedly accused the Department of Defense of putting diversity ahead of warfighting.In his video, Gen. Brown does not flinch from exposing the country's problems even while he is in uniform.   'I'm thinking about how full I am with emotion not just for George Floyd, but the many African Americans that have suffered the same fate as George Floyd,” he said.",
        "Floyd was an African American man who was beaten to death by Minneapolis police, triggering protests around the country.'I'm thinking about protests in my country 'tis of thee, sweet land of liberty, the equality expressed in our Declaration of Independence and the Constitution that I have sworn my adult life to support and defend. 'I'm thinking about a history of racial issues and my own experiences that didn’t always sing of liberty and equality.'General Brown would also be only the second black man to become chairman after Colin Powell, who served in the position under Presidents George H.W. Bush and Bill Clinton between 1989 and 1993.",
        "General Brown would still need to have the appointment to the country's most senior military office approved by the Senate. President Biden is expected to make the announcement before July, Politico, which first reported the scoop, said.If appointed, Brown would have a crucial advisory role at a time when the U.S. is precariously balancing the threat of China's military expansion and Russia's ongoing war in Ukraine. Chairman of the Joint Chiefs of Staff is a four-year term, serving as the highest ranking military officer in the armed forces.They do not command any troops, but rather act as the principal military advisor to the President, the National Security Council, the Homeland Security Council, and the Secretary of Defense.",
        "If he assumes the role, he would have vocal input into discussions like the provisions of U.S. arms and machinery to Ukraine amid the war with Russia.General Brown's expected appointment would see him playing a crucial role in advising on matters of national security, particularly amid Russia's war in Ukraine and China's military expansion.General Mark Milley's term is set to end in September after being appointed by then-President Trump to the role in October 2019.President Biden referenced Milley's departure from office earlier this week at a dinner for combatant commanders where he praised the military's efforts to evacuate the embassy and American citizens from Sudan.'You probably don't think about it, but you're just remarkable, remarkable, remarkable group of people. I mean that sincerely.'Except for Milley. I'm not so sure,' Biden added jokingly.'Actually, I don't want to - I've embarrassed him. I said [to Milley] ''You know, I'm going to really miss you.'' He said: ''I'm not going anywhere yet. Don't get sentimental on me, Biden. I'm from Boston''.'",
        "While Biden has not yet given the full rubber stamp approval for his pick, it is understood that Brown's experience in Asia has played a significant role in the President's decision. Brown's previous role was based in the Pacific as chief of Pacific Air Forces.",
        "Brown also has vast experience in the Middle East, where he commanded troops as head of the U.S. Air Forces Central Command.His experience having served in Europe when Russia illegally annexed Crimea in 2014 is also expected to stand him in good stead amid deliberations over the pick.He has served in his current role as Air Force chief of staff since August, 2020.Other than being only the second African American in the role, Brown would also be the first Air Force officer to be chairman of the Joint Chiefs of Staff since General Richard Myers' term finished in 2005."
    ]
}