{
    "articleURL": "/sport/rugbyleague/article-12052539/Raging-BULL-Carnage-erupts-France-rampaging-animal-breaks-loose-players-flee.html",
    "content": [
        "A rampaging bull broke free and stormed across the field in a baffling incident Animals were on a lap of honour before a Catalans Dragons rugby league game But one temporarily escaped and ran amok, with players fleeing very quickly Catalans Dragons rugby league players had to run for cover after a bull broke free in a bizarre incident.",
        "French side Catalans Dragons hosted English team St Helens at the Stade Gilbert Brutus in Perpignan, southern France, in a Super League clash on Friday evening.Three hefty bulls were paraded around the field in a pre-match lap of honour intended to 'celebrate the quality of beef in the region', an idea cooked up by Catalans owner Bernard Guasch, the head of a local meat processing company.But stunning footage released on social media shows one of the bulls shook itself loose from its handler, dragging the unfortunate man along the ground, before charging around the field.Players warming up on the pitch - many of whom wearing red training shirts - quickly abandoned their drills and scattered for cover, dropping balls behind them and sprinting away to escape.",
        "Eventually, the animal trotted over to the side of the pitch and slowed down enough that someone was able to grab it under control again as a singer crooned over the intercom.No damage was done, other than perhaps some bruised pride and elevated heart rates, and the match eventually began as intended.The hosts triumphed 24-12 in what was a rematch of the 2021 Grand Final, with the French side now fourth in the table after the victory, ending their run of three games without a win.",
        "Dragons had said before the match that 'three prize-winning bulls, as well as two cows from the same Gascon breed, will perform a lap of honour during the warm-up'.And fans quickly took to social media to express their shock at the incident.One joked: 'Hell of impact player to bring on #tactics', with a second adding: 'I found this really funny for some reason.'Another simply tweeted: 'Welcome to Rugby League', while one continued: 'Who thought this would be a good idea,' followed by a cry-laughing emoji.A fifth sarcastically concluded: 'How do we get more people to watch rugby league? Let's release a bull onto the field and make the players run for their lives.' "
    ]
}