{
    "articleURL": "/wires/pa/article-12047945/Ollie-Robinson-enjoys-teaming-Steve-Smith-ahead-Ashes-duel.html",
    "content": [
        "England seamer Ollie Robinson is enjoying being in the same dressing room as Steve Smith and doubts the former Australia captain’s presence at Sussex will have a material impact on the Ashes.",
        "Smith linking up with Sussex for three Division Two matches in the LV= Insurance County Championship gives him a chance to get to grips with English conditions ahead of Australia’s bid to retain the urn this summer.The union between player and county has divided opinion but Smith did not play any championship matches before the 2019 Ashes and still amassed 774 runs at a titanic 110.54 average in a drawn 2-2 series.",
        "Earlier this week, he confessed he was welcomed to the Sussex nets by having his stumps rearranged by Robinson, who sees the advantages in playing alongside Smith and Sussex and India’s Cheteshwar Pujara.“It’s a good battle,” said Robinson. “It’s nice to bowl at him and Pujara, I think it ups my game when I am training as well, it’s great to have them batting at the other end.“(Smith) is obviously a very good player and I think he will score runs regardless of whether he faces me or not.“We get a look at each other, but I don’t think it makes a big difference in the grand scheme of things.“To have the world’s best batsman and Pujara in the same changing room has been cool. It hasn’t felt weird, I know (Smith) from previous series and it’s nice to have him around.”",
        " I'm trying to peak for the Ashes, trying to get as many overs as possible between now and then  Ollie Robinson  Smith was restricted to a watching brief on the opening day of his championship debut at New Road, where Robinson hogged the limelight with seven for 59 as Worcestershire were all out for 264.Robinson was a constant menace, bowling with vigour and at good pace, and only when he was taken out of the firing line did Worcestershire’s batters find any kind of rhythm at the crease.This was only Robinson’s second outing of the season after experiencing some soreness in his back shortly after his return from New Zealand at the end of England’s winter touring programme in February.The issue was not a major concern for Robinson but with the eagerly-anticipated five-Test series against Australia starting next month, he elected to have a pain-killing injection in the area.“It’s similar to the one I had last year,” said Robinson, who struggled with a back problem during the 2021-22 Ashes. “I didn’t have a spasm, just the joint was getting slightly irritated.“Last summer I let it go on and on, it took until June to be playing again. This year I thought I’d get it done as soon as possible and nip it in the bud.",
        "“I don’t know many bowlers that don’t get jabs every year. It’s one of those things. I wanted to get on top of it before the Ashes, it feels really good now.”Robinson’s contribution put Sussex in the driving seat – they closed on 63 for one before bad light brought an early end to the day – and, at this stage, he plans to play in the south coast club’s matches against Leicestershire and Glamorgan before linking up with England.“I’m trying to peak for the Ashes, trying to get as many overs as possible between now and then,” added Robinson. “Three Sussex games and then the Ireland Test.“I’m about 80 per cent, I’d say, there was a little bit of rustiness there, didn’t quite get my lengths right early on. But the wicket is quite helpful so when I did get it in the right area, they nicked it.”"
    ]
}