{
    "articleURL": "/wires/reuters/article-12054931/Soccer-Salah-strike-fires-Liverpool-1-0-win-Brentford.html",
    "content": [
        "LIVERPOOL, England, May 6 (Reuters) - An early goal by Mohamed Salah was enough to give Liverpool a 1-0 Premier League win over Brentford on Saturday that keeps the pressure on fierce rivals Manchester United in the hunt for Champions League football next season.",
        "Their sixth league win in a row left the Merseysiders in fifth spot on 62 points, one behind fourth-placed United, but the Red Devils have two games in hand over Liverpool. Brentford are ninth on 50 points.Before the game got underway, the Liverpool fans loudly booed, whistled and chanted their team's name as the national anthem was played to mark the coronation of King Charles in London earlier on Saturday.Expecting the visitors to sit deep, Liverpool manager Juergen Klopp deployed Salah, Darwin Nunez, Diogo Jota and Cody Gakpo in a star-studded attack, and it quickly paid off as Salah broke the deadlock in the 13th minute.The Egyptian started the move before Fabinho crossed to Virgil van Dijk at the back post, and the big Dutchman headed the ball back for Salah to bundle home his 100th goal at Anfield.Bryan Mbeumo out-sprinted and out-muscled Van Dijk to fire home in the 40th minute for Brentford, but the flag went up for a marginal offside that was confirmed by VAR and the goal was disallowed.Nunez missed a superb chance to make it 2-0 in the 29th minute as Trent Alexander-Arnold played a brilliant pass over the top to him, but the Uruguayan guided his first-time effort wide of the near post.",
        "Gakpo missed an even better chance early in the second half as Jota flashed a ball across the box, but it struck the striker on the shins and he couldn't get it on target.With Brentford struggling to create anything of note and only managing a single shot on target, Salah's goal proved enough for the home side to claim the victory.\"I think we've improved a lot in the last couple of weeks. We've won six in a row and we have a few clean sheets, which is really important for us ... I think we are more stable at the moment in the team,\" goalscorer Salah told Sky Sports.Though Manchester United are still in the driving seat in terms of Champions League qualification, Salah said his side have not given up on the idea of a top-four finish.\"We'll take it game by game, we don't want to look further, just game by game and we'll see what will happen,\" he said. (Reporting by Philip O'Connor Editing by Toby Davis)"
    ]
}