{
    "articleURL": "/wires/aap/article-12057049/Warriors-sponsor-welcomes-investigation-ref-rants.html",
    "content": [
        "NRL football boss Graham Annesley has launched a blistering defence of his referees after the chief executive of the Warriors' major sponsor alleged there was an unconscious bias against his team.",
        "Jason Paris, CEO of telco One NZ, went on a social media rampage during the Warriors' 18-6 Magic Round loss, accusing officials of \"cheating of the highest order\".The Warriors were perplexed by referee Todd Smith's decision to overlook a possible high tackle on captain Tohu Harris from Panthers enforcer Moses Leota.Dallin Watene-Zelezniak was also sent for a head injury assessment after being glanced in the face by a Tyrone Peachey swipe that went unpunished.Adding to their frustrations was the fact the Warriors also had rookie Demitric Sifakula (striking) and Jackson Ford (hip-drop tackle) sent to the sin bin.On Monday, Paris doubled down. In a tweet, he withdrew his allegation that the referees were \"cheating\", but added: \"However, I do believe that there is unconscious bias happening every week against the Warriors and it needs to be addressed.\"All we want is consistency, but we are not getting it. Take opinions out of it and analyse the video footage from past games and compare our decisions vrs (sic) other teams.\"I think it will find that we are being disadvantaged - then we can work out why and take steps to fix it.\"Hours later Annesley did just that at his weekly briefing and, while he didn't elaborate on the Harris high shot, explained that the adjudications on Sifakula, Ford and Watene-Zelezniak were correct.",
        "\"I'll be measured as much as a I can; I'm a bit hot under the collar over this stuff,\" he said.\"There is no comment that could be worse.\"The referees work very, very hard to do their best, not just at the NRL level but kids at the park on the weekend.\"The nature of the game is that there will be disagreement about the decisions that they make.\"We can question their decision making, but we can't question their integrity.\"It questions the integrity of the entire NRL administration because we appoint these people.\"He said suggestions of a bias against the Warriors were laughable.\"I can go to eight losing clubs on any given week and they'll all tell me they didn't get the rub of the green,\" he said.\"This is not something that's peculiar to a team in New Zealand.\"NRL chief executive Andrew Abdo has also lashed Paris' commentary and confirmed an investigation into his remarks was underway.Warriors officials will meet with the organisation this week to review the decisions in question but it's understood the NRL is uncertain how to proceed with any penalty, given Paris isn't a member of the Warriors' staff."
    ]
}