{
    "articleURL": "/money/markets/article-12051945/Spotty-Rowland-lender-fined-10m-Qatar-claims.html",
    "content": [
        "A bank owned by a friend of Prince Andrew has been fined £10m for allegedly plotting to wage economic war on Qatar.",
        "Banque Havilland, a private bank based in Luxembourg, was hit with the sanction by the Financial Conduct Authority (FCA) after the watchdog ruled it attempted to use manipulative trading strategies to devalue the Qatari riyal currency.The bank is controlled by the Rowland family, including Conservative Party donor David 'Spotty' Rowland, famous for reportedly bank-rolling Prince Andrew. Rowland's son Edmund, the bank's former UK boss, was hit with a financial services ban and fined £352,000. The FCA fined and struck off ex-branch manager David Weller and employee Vladimir Bolelyy.The bank and Rowland have appealed. Edmund Rowland said: 'I refute the FCA allegations in full. I am challenging them in the independent tribunal.'",
        "The FCA said that in 2017, the bank drew up trading strategies aimed at devaluing Qatar's currency relative to rivals, aimed at creating a false or misleading impression about the Qatari bond market, intending to present the document to Qatar's rivals who may want to put economic pressure on it.It did not believe the strategy was ever implemented, but said that such a strategy could have been a criminal offence had it taken place in the UK.Therese Chambers, head of enforcement at the FCA, said the bank's 'conduct actively encouraged the commission of financial crime, providing ideas for manipulative trading to someone it saw as having the political motivation to be potentially interested in such ideas. The misconduct of Edmund Rowland was deliberate.'",
        "She added: 'Weller claimed to have believed that the other two were joking around but as a senior manager he behaved recklessly.'David Rowland is a Guernsey resident who has been dubbed the 'tax haven tycoon' – and has acted as Prince Andrew's financial adviser, attending Princess Eugenie's wedding in 2018.In 2017 he reportedly paid off a £1.5m loan for Andrew.He owns a palatial estate, Havilland Hall, where in 2005 the prince unveiled a bronze statue of Rowland smoking a cigar.",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}