{
    "articleURL": "/wires/pa/article-12049055/Cabinet-minister-says-voter-ID-thoroughly-good-thing-despite-people-unable-vote.html",
    "content": [
        "The introduction of voter ID is a “thoroughly good thing”, the Northern Ireland Secretary has said despite the Electoral Commission acknowledging some people have been unable to vote as a result of the new requirement.",
        "Chris Heaton-Harris insisted the “big problems” critics warned of did not materialise, adding: “I think most people have just taken to it as you would expect them to”.On Thursday, voters across England took to the polls to have their say about who runs their local communities and for the first time, it has been compulsory to show photo identification when voting.Passports, driving licences and blue badges are among the IDs permitted, as are the free certificates that could be applied for ahead of the vote.",
        "However, the move has been controversial, with critics of the policy arguing it would deter young people and ethnic minorities from voting and claiming thousands of people had been turned away.Shortly after the polls closed, a spokesperson for the Electoral Commission said “our initial assessment is that overall, the elections were well run” but added “some people were regrettably unable to vote today as a result”.Speaking to Sky News on Thursday evening, Mr Heaton-Harris defended the new rules, arguing similar measures have been in place in Northern Ireland for 20 years.He said: “It’s a thoroughly good thing, it means that you can be completely sure that your elections are well tested and safe.“And I don’t think, actually, considering this is a relatively big change for our politics in England that there’s been any of the big problems that people warned might come from this.",
        "“I think most people have just taken to it as you would expect them to.”",
        "Science minister Paul Scully also threw his weight behind the changes but acknowledged the Government will need to see its impact after the local elections.Asked about the statement by the Electoral Commission on the BBC’s Elections 2023 programme, Mr Scully said: “I think the chief exec of the electoral returning officers has said in his view that it has worked pretty well. It hasn’t had much of an effect.“But we do need to see. We clearly need to see after this.”The spokesman for the Electoral Commission said: “Our initial assessment is that overall, the elections were well run.“Across the country, votes were cast throughout the day and in line with the law. This is in large part thanks to the dedication of electoral administrators, who have worked hard to prepare for today and for the implementation of this new measure.“Confidence in the overall picture, however, should not overlook other impacts which can only be revealed through detailed data collection and analysis over the coming weeks.”“We already know from our research that the ID requirement posed a greater challenge for some groups in society, and that some people were regrettably unable to vote today as a result.",
        "“It will be essential to understand the extent of this impact, and the reasons behind it, before a final view can be taken on how the policy has worked in practice and what can be learnt for future elections.” It will be essential to understand the extent of this impact, and the reasons behind it, before a final view can be taken on how the policy has worked in practice and what can be learnt for future elections.  The Electoral Commission  The Commission expects to publish its initial analysis of the implementation of voter ID in June, subject to data being available.The change was piloted regionally before the national roll-out for Thursday’s elections and it will come into force for UK general elections from October.The policy is opposed by Labour, the Liberal Democrats and the Green Party whereas the Government argues the change is required to reduce electoral fraud.Tom Brake of Unlock Democracy, who is leading a coalition of groups against the policy including the Electoral Reform Society, said: “Today has been a dark day for British democracy.",
        "“Reports from all over the country confirm our very worst fears of the impact of the disastrous policy which has been made worse by the shambolic way it has been introduced.”",
        "Meanwhile, the Association of Electoral Administrators’ chief executive Peter Stanyon said there had been “many anecdotal reports” of people being unable to vote but “it is still too early to gauge how introducing voter ID has gone”.On Thursday, more than 8,000 council seats were being contested across 230 local authorities, while mayors were being selected in Bedford, Leicester, Mansfield and Middlesbrough.No votes were taking place in London and Birmingham, along with other areas including Cornwall, North Yorkshire and Cumbria."
    ]
}