{
    "articleURL": "/news/article-12046655/Vigilante-films-woman-leaving-grocery-cart-parking-lot-row-erupts-shes-confronted.html",
    "content": [
        "Sebastian Davis of Cart Narcs films himself telling people to put their carts backVideos of people's reactions have gone viral but his cause has been divisive A vigilante in California nearly came to blows with a woman when he confronted her for not returning her shopping cart.",
        "The man, who calls himself 'Agent Sebastian', has nearly half a million subscribers to his YouTube channel Cart Narcs and a similar following on Instagram.On those pages he routinely posts videos of himself confronting so called 'lazy bones' for failing to put their carts back.To make the videos, Agent Sebastian, real name Sebastian Davis, dresses up in tactical gear that makes him resemble a law enforcement officer and tells them to return their carts while waving a plastic light wand, often used for traffic control.When people do not comply, Davis pulls out a magnetic bumper sticker reading 'I don't return my shopping cart like a jerk', and slaps it on their cars. His followers praise him for instilling order in society and holding people to higher standards, but his critics accuse him of antagonizing people and exploiting their reaction for social media clout.",
        "In a clip that recently went viral after being reuploaded by Davis, but which was filmed more than three years ago, he can be seen confronting a woman in LA who does not respond well to his act.The interaction began when the woman returned to her car and got into the driver's seat but left her shopping cart in the parking bay - next to the car and not in the corral where they belong. ",
        "'Oh ma'am, that's not where the carts go, between the spots here,' said Davis just as the woman was closing the door to her Toyota Prius.'Do you work here?' asked the woman while winding down the window to address him.'Ma'am, I'm with the Cart Narcs, what we do is we narc out people who are being big old lazy bones and not taking their carts back,' said Davis.As the woman grew increasingly agitated, she asked him if he was filming, to which he replied: 'Yeah, it's how we can shame you, show other people.'Eventually the interaction escalated and the woman jumped out of the car and started filming Davis herself. 'I'm an independent secret agency,' explained Davis, as the woman became even more confused and agitated. When asked why he is filming, he replied: 'That's for your safety and my safety.' 'It's not for my safety, it's for your social media business,' said the woman, before explaining that there are no rules dictating that she has to return her cart.Eventually the woman stormed off, dragging her cart with her, but left it in a handicap bay, to which Davis says: 'Ma'am you're not learning your lesson.'",
        "Davis, who also works as a podcast producer, has been able to turn Cart Narcs into a business and sells branded merchandise on his website.",
        "He even appeared on Dr. Phil last year, but came under attack from the host for accosting a woman parked in the handicapped bay and suggesting she didn't have a visible disability.Davis began the interview by describing the attacks he suffered as Agent Sebastian.'I have had to flee quite often. As you saw, pepper spray, I've had a gun pulled on me. I've had people try to hit me with their cars and trucks over just asking them to put their cart back where they know it belongs,' he said.'You do more than just ask them to put their cart back,' said Dr. Phil. 'You shame them.''You say you're a trained agent, who trained you?' he added, before asking Davis which rules he thought he was upholding.'There's no criminal charge. There's no there's no ticket I'm writing anybody. It's just a violation of common courtesy, the same as littering or not picking after your dog,' said Davis."
    ]
}