{
    "articleURL": "/news/article-12042495/Italian-girl-16-electrocuted-death-bath-phone-friend.html",
    "content": [
        "According to local media, her parents were not present in the house at the timeA 16-year-old girl has died in Italy after she dropped her phone in the bathtub while she was talking to a friend. ",
        "The girl - named in Italy Maria Antonietta Cutillo - had been on the phone when she dropped the mobile, which was charging at the time, in the water while taking a bath in her parents' home in Montefalcione, Avellino. According to local media, her parents were not present in the house when the teenager was tragically electrocuted. In that time, the emergency services had already been called by the friend of Cutillo, who grew concerned when the call cut out. On arrival, they discovered that she had died after the device short-circuited.Her body was taken to the morgue of the Moscati hospital in Avellino for an autopsy. ",
        "Sources say Cutillo's father is well-known in the regional capital of Irpinia, where he is the owner of a local butcher's shop. Local police are investigating the incident. In 2020, a schoolgirl had died in her bath after a charging phone fell onto her chest and slipped into the water in France. The 15-year-old, identified at the time as Tiffenn, was electrocuted after the device slipped into the water at her home in Marseille.",
        "Emergency crews had rushed the girl to the city's Timone hospital and tried to resuscitate her but to no avail.Similarly, in 2019, a 13-year-old girl in Amsterdam was electrocuted when her smartphone fell into the bath while it was charging.",
        "The teenager's mother dragged her out of the bathtub after racing to the bathroom when she heard a loud scream. She had called the emergency services.Paramedics woke up the unconscious girl by punching her in the sternum, before whisking her straight off to hospital, where she spent two days.In this instance, the girl didn't die but was left with amnesia as a result of the incident, and couldn't recall the moment she dropped the phone in the bath.Dr Sem Hardon said the severity of her injuries made it likely she was electrocuted by the mains supply, which is 240V in the Netherlands.He added: 'If household electrical devices are used in bathrooms, users must be aware of safety hazards…'Nonetheless, electrical appliances or cords should never be plugged in near water and should never be in contact with a wet environment.'"
    ]
}