{
    "articleURL": "/wires/pa/article-12046623/UK-Government-confirms-contest-court-action-gender-reforms-block.html",
    "content": [
        "The UK Government has announced it will fight the Scottish Government in court over its decision to block controversial gender reforms.",
        "First Minister Humza Yousaf announced last month he would take Scottish Secretary Alister Jack to court in a bid to overturn his use of Section 35 of the Scotland Act to veto the Gender Recognition Reform (Scotland) Bill.The legislation was passed by MSPs from all parties in December, in what was thought to be the culmination of one of the most terse political issues in the history of devolution.But Mr Jack announced in January he would use the Section 35 mechanism for the first time to stop the Bill gaining royal assent.",
        "A spokeswoman for the UK Government said: “The UK Government will robustly defend the Secretary of State’s decision to prevent the Scottish Government’s Gender Recognition Reform Bill from becoming law.“We are clear that the proposed legislation would have an adverse effect on reserved matters, including on the operation of the law as it applies to Great Britain-wide equalities protections.”It is understood the Advocate General for Scotland informed the Court of Session on Thursday that the UK Government would contest the petition for judicial review, which was filed by the Scottish Government last month, and the UK Government is said to be prepared to set out its arguments in the case soon.In its petition to the court, the Scottish Government said Mr Jack made a “material error of law”, that his concerns about the safeguards in the Bill were “irrelevant” to the order’s making, and that his reasons were “inadequate”, which would make the order “unlawful”.",
        "Speaking as he announced the use of Section 35 in January, Mr Jack said: “My decision today is about the legislation’s consequences for the operation of GB-wide equalities protections and other reserved matters.“I have not taken this decision lightly.“The Bill would have a significant impact on, amongst other things, GB-wide equalities matters in Scotland, England and Wales.“I have concluded, therefore, that this is the necessary and correct course of action.”The Court of Session will now decide if the judicial review goes ahead.",
        "Speaking to journalists at Holyrood on Thursday, First Minister Humza Yousaf was asked how much money he would be prepared to “waste” on a challenge to the GRR Bill.He said: “It’s not a waste. I engaged in this court process because I’m not prepared to accept a Westminster veto over legislation that’s passed by a majority.“I won’t say much more of course because we have engaged in that court proceeding.”Passed in December, the Bill would make it easier for trans people to obtain a gender recognition certificate by removing the requirement for a diagnosis of gender dysphoria, as well as dropping the required age and shortening the time required for the applicant to live in their acquired gender.Despite two consultations on the issue since 2016, the Bill was met with serious concerns across the political spectrum, with opponents claiming it could infringe on the rights and safety of women and girls, while those who backed the Bill said it was a minor administrative change that would ease the lives of transgender people.",
        "The final days of the Bill’s passage were marred by two mammoth Scottish Parliament sittings, with MSPs debating amendments into the early hours of the morning, and a number of protests within the Holyrood chamber."
    ]
}