{
    "articleURL": "/wires/ap/article-12044075/White-House-warns-recession-debt-limit-fight-drags-on.html",
    "content": [
        "WASHINGTON (AP) - White House economists on Wednesday warned of \"severe damage\" to the U.S. economy in the event of a debt default, warning that a prolonged default could cause 8.3 million job losses and the stock market to tumble 45%.",
        "But the new report from the Council of Economic Advisers shows that even less severe scenarios would hamper the U.S. economy, evidence that the political showdown over the debt limit carries major financial costs. Without a deal in place between Congress and the White House, Treasury Secretary Janet Yellen warned that the federal government will lack the accounting tools to keep borrowing and potentially begin to default as soon as June 1.The first and most dangerous scenario is a \"protracted default.\" The second is a \"short default\" in which Congress acts swiftly to allow the nation to borrow again after defaulting. The third is \"brinkmanship,\" in which lawmakers take the country's full faith and credit to the wire, but avert default. All three would hurt the economy, the experts said.President Joe Biden has a May 9 meeting with congressional leaders to try to find a way to resolve the approaching crisis.House Republicans are insisting on spending cuts as part of any plan to allow the country to resume borrowing. Biden says he will not allow the country to be \"taken hostage\" by such demands and will only negotiate with the GOP on spending as part of the budgetary process. The president and Democratic lawmakers are seeking a \"clean\" increase to the nation's $31.4 trillion debt limit.",
        "A spokesman for House Speaker Kevin McCarthy, R-Calif., sent out an email Wednesday that blamed Democrats for the stalemate.",
        "\"There is no good reason other than political malpractice for the U.S. to default on its debt,\" wrote McCarthy spokesman Chad Gilmartin. \"Plenty of revenue is flowing in to pay interest on the debt.\"That statement treats default as solely pertaining to federal borrowing, but administration officials warn that missed payments to contractors, Social Security recipients, federal employees and others would also constitute a default.The White House analysis warned that a protracted default could cost more than 8 million jobs in the third quarter of 2023, raising the prospect of \"an immediate, sharp recession on the order of the Great Recession.\"The report said the government, unable to borrow money, would lack the traditional tools it uses to temper the impact of economic downturns, namely economic stimulus and social support.\"Because the government would be unable to enact counter-cyclical measures in a breach-induced recession, there would be limited policy options to help buffer the impact on households and businesses,\" the White House said. \"The ability of households and businesses, especially small businesses, to borrow through the private sector to offset this economic pain would also be compromised.\"A short default would also inflict damage with 500,000 fewer jobs. Even the \"brinkmanship\" approach, where lawmakers reach a deal at the eleventh hour, could cost about 200,000 jobs and shave 0.3% off the annual gross domestic product, according to the analysis.",
        "There are already signs of market stress from the showdown as the cost of insurance for nonpayment of U.S. Treasury notes has risen. The U.S. economy is also in a fragile state as Federal Reserve efforts to lower inflation have stoked concerns of a downturn."
    ]
}