{
    "articleURL": "/news/article-12046441/Heartbroken-parents-woman-31-stabbed-death-stranger-pay-emotional-tribute-her.html",
    "content": [
        "Johanita Dogbey, 31, was 'smart, dedicated and loving' said her distraught familyThe heartbroken parents of a woman knifed to death yards from a police station in broad daylight have paid tribute to their 'smart, dedicated and loving' daughter.",
        "Johanita Dogbey, 31, was said to have been on the phone to her grandmother when she was brutally murdered in Brixton, south London, on Monday afternoon.Detectives believe that she was walking alone when she was attacked from behind by a knife-wielding thug who she did not know.Ms Dogbey founded the Odette Foundation, a charity which worked with people suffering from sickle cell in Ghana and Togo.Her traumatised family described her murder just a few hundred yards from Brixton Police Station as 'senseless'.",
        "In a statement issued by the Met Police, Johanita's family said: 'We are devastated by the news of the passing of our daughter.Johanita was a smart, dedicated, and loving girl who always helped anyone. She hasn't got one bad bone in her body. She wouldn't hurt a fly.'We can't believe a senseless crime like this has happened as we can't imagine who would do this to her.'Our hearts are completely broken and will not understand why someone would take our beautiful girl away from us.'She will forever be in our hearts as we will carry on living life as gracefully and beautifully as she did.'A 33-year-old man arrested on suspicion of Johanita's murder remains in police custody after officers were granted further time to question him.",
        "Johanita was pronounced dead at the scene after suffering multiple stab wounds despite the efforts of paramedics to save her.The charity worker had been out to buy a present and was returning home for a birthday celebration.Fighting back the tears, her father Yao told MailOnline: 'We have no words at this moment. ",
        "'My daughter was beautiful and kind-hearted. I'm sorry, I can't say anything more.'Johanita's younger brother Maurice said: 'We are trying to understand what has happened and are completely broken. 'As far as we know there was no link between my sister and the attacker.'This whole thing has left us devastated. It's too much for us.'A family friend said: 'She was a genuinely good person who loved God and just wanted to make the world a better place. It's tragic that somebody who did so much good was killed like this.'A 33-year-old man has been arrested on suspicion of murder and is currently in police custody, Met Police confirmed. They revealed that at this stage there is no information to suggest the victim and the man were known to each other.Ms Dogbey was the founder of the Odette Foundation, a charity which worked with people suffering from sickle cell in Ghana and Togo.",
        "In addition to providing medical support, it also raised much needed funds for those afflicted by the disease. ",
        "She was a regular visitor to the two West African countries as part of her charity work and also helped organise fund raising events in the UK. Ms Dogbey helped establish the organisation with her friend Naya Faya, who posted a number of moving social media tributes to her.In one she writes: 'God is within her she will not fall.'Away from her charity work, Ms Dogbey, a devout Christian regularly attended a church close to her Brixton home with her parents, with friends describing them as 'God fearing people.'She originated from Ghana and lived with her family only around 300 yards from where she was attacked, and they rushed to the scene within moments of it taking place.",
        "Eyewitnesses revealed that her father Yao and other relatives dropped to their knees and started praying at the police cordon near the scene of her death on Monday.Ms Dogbey was on her way to a birthday celebration at her flat where she lived with her mother, father, brother and sister when she was attacked.Jacqueline Demontague said she saw the woman's distraught father rushing to the scene shortly after 4pm following a phone call from the grandmother. ",
        "She said: 'She was on the phone to her grandmother and suddenly she began shouting and screaming.'I cannot imagine how awful it must have been for both her and her grandmother. 'The grandmother phoned the woman's father, who came straight out to the scene.'Detective Chief Superintendent Seb Adjei-Addoh, local policing commander for Lambeth, said: 'I am in regular contact with officers leading the investigation into this brutal attack and my thoughts continue to be with the woman's family and friends as they come to terms with this awful news. We will do everything we can to support them at this unimaginably difficult time.'I recognise that the community will be experiencing worry and considerable concern and we have extra officers out in the community to answer questions and provide a visible presence.'My police neighbourhood policing teams have visited local community centres and businesses taking on board concerns and to ensure we are having the right conversations with local people at this time.'I would also ask people to share anything that they feel might help the investigating detectives.'Anyone with information about what happened can call police on 101 quoting CAD 4728/01May, or to remain anonymous contact Crimestoppers on 0800 555 111 or online."
    ]
}