{
    "articleURL": "/news/article-12045983/Britains-patriotic-neighbours-revealed-ahead-Kings-coronation.html",
    "content": [
        "Excitement continues to ramp up ahead of Saturday's crowning of the monarch For more, read MailOnline for all of today's coronation celebrations and build upFrom transforming Britain's 'most patriotic' estates into a magnificent sea of red, white and blue, to creating a portrait of King Charles out of toast - Britons have been rallying to mark the coronation. ",
        "Thousands of Union Flags and streamers of bunting have been hoisted by communities up and down the UK as excitement builds ahead the crowning of His Majesty on Saturday. In Wales, an artist used Marmite and 42 slices of toasted bread to 'raise a toast' of his own to the monarch, creating a surreal portrait of the King.While on the Kirby estate in Bermondsey, London, residents have once again shown their patriotism, with a stunning flag display that took two days to complete.The area - whose locals describe themselves as 'the most patriotic estate in London' - is famed for its national pride, having previously decorated the area in hundreds of England flags to mark the World Cup last year.  ",
        "This year's stunning spectacle was masterminded by Chris Dowse and Alan Putman. It features huge flags with the face of King Charles on and almost 2,000ft of bunting. Speaking to MailOnline, 44-year-old father-of-three Chris said: 'I reckon we're the most patriotic estate in the UK. We're definitely right up there.'This is the first time in my lifetime I will see the coronation of the King.'I was only three or four when Prince Charles and Lady Diana got married in 1981 but I remember we had a massive street party. I'm 44 now and I still remember it today. ",
        "'I wanted to do something for the kids on the estate that they will remember for the rest of their life.'The self-employed father-of-three added he was full of pride for the Royal Family. 'He is our King,' said Chris. 'Whether you're a royalist or not this is our Royal Family and it's been part of heritage from almost day dot. It's important to carry on the tradition.'",
        "More than 150 miles west, in the Welsh capital of Cardiff, artist Nathan Wyburn has been crafting his own tribute to King Charles. The 33-year-old  wanted to 'celebrate' the King's coronation by creating a piece of art using ingredients from his favourite sandwich, which consists of a fried egg, pesto, gruyere cheese and Marmite, all contained in an organic granary bap.Speaking about his bonkers portrait, Mr Wyburn said: 'When I found out that the King himself actually loves Marmite as part of his favourite sandwich, that seemed even more fitting to know that he would totally approve of this.'The artist said altogether it took him two hours to create the artwork, using just one large jar of the famous yeast extract spread - whose slogan is 'love it or hate'. The quirky artist said the 'most tedious part' of the process was spending half an hour toasting 42 slices of white bread in his four-piece toaster at his flat. ",
        "'If a slice did slightly burn then I always just put it in a darker area of the portrait or scraped off the bits of burnt bread,' he said.The former 2011 Britain's Got Talent contestant added that the King's 'distinctive features' helped him create the portrait.He added: 'I think what helps is that everybody knows what he looks like - that can be a bit of pressure at the same time.'But because he's got quite a lot of distinctive features, and he's of an age where it allows the face to have more character, it helped get those features to pop out with the Marmite because it's such a dark tone - it is perfect against the toasts.'So, (the King) being so instantly recognisable is a great help for me.'In London, one of Britain's biggest royal superfans has decked her home in monarchy memorabilia. Margaret Tyler, 79, has dedicated her entire house in Wembley to celebrating the Royal Family.It is covered floor-to-ceiling with collectables, photographs and books about the Windsors - and passers-by even mistake her home for a museum.The grandmother-of-four met the Queen four times in her long reign - describing her as 'so kind and sweet'.",
        "Despite her vast collection of memorabilia, she says she 'couldn't resist' expanding it further for the coronation. ",
        "The pensioner said: 'Charles has had a long time knowing he'll be King one day. I hope he'll do a good job - I'm sure he'll do his best, just like his mother.'She added: 'I got some Coronation memorabilia. I can never resist it.'I can never walk straight past the memorabilia shop without getting something.'The next problem is just where to fit it.'Her vast collection consists of hundreds of pictures, trinkets and books. She even has some more obscure items - such as cardboard cutouts of Her Majesty and the Royal corgis.Speaking on the coronation and the future of the royals, she said: 'I'll be watching - everyone will be watching - so here's hoping it plays out well.'Near York, a pub has created its own larger-than-life felt model of King Charles III - complete with replicas of his medals and a crown made from a recycled plant pot. ",
        "The 'royally good team' of crafters behind the effort met weekly to lovingly create the 6ft 8ins sculpture in homage to His Majesty.The group, called the Crafty Booters, created the head using a technique called needle-felting, which involves matting wool together and they made the arms and legs out of tights and alpaca wool.They also used gloves from a charity shop to make the King's hands and his crown was made from a recycled plant pot, a nod to his green campaigning.",
        "And when when customers go into the pub, they 'bow and curtsey at him'.The 14 women who make up started planning to make the figure in December last year after originally deciding to make bunting to mark the occasion.But after their 'heads went off like fireworks' with ideas, they decided to create the figure, which weighs 10kg.",
        "Wendy Wilkinson, 61, who helps runs the group, said: 'We started off by looking at different images of him and pulling out his character, like his very blue eyes.'The crown was a flower pot which I cut out and then an 86-year-old lady did that beading and created the crown - it's just incredible.'It's hilarious and really funny because you see people walk in, look at it, stop and then bow and curtsey at him and then go over to the bar to get a pint.'Elsewhere and a road in Hampshire - where residents once accidentally ordered 4.5km of bunting to mark the Queen's Platinum Jubilee in 2022 - has once again been transformed into a sea of red, white, and blue. Selsey Avenue, in Gosport, has become a sight to behold as residents gear up to celebrate the coronation this weekend. And the organisers of the display had plenty of bunting to spare having last year ordered thousands of metres of the stuff after accidentally adding an extra nought to their order.  ",
        "This year will see the road, like thousands of others in the UK, staging a street party to mark the crowning of the King on Saturday. In Devon, one farmer found an artistic way to mark the crowning of King Charles - by carving giant letters on a beachJohn Tucker scribed 'Long Live the King' in the sand at Bigbury-On-Sea, using a tractor and harrow.Helen his daughter said: 'Dad is very clever at working out the tide times and when there will be enough water so the sand isn't too soft to create this amazing artwork.'In Kidderminster, a giant mosaic of the King has been created - using 3,000 tiny squares of carpet. Workers at Victoria Carpets spent 16 hours painstakingly gluing the 3cm by 3cm patches together to form the portrait of His Majesty. The 13ft high artwork was done by workers at Victoria Carpets of Kidderminster in time for the Coronation weekend. ",
        "Elsewhere and crocheters have been stocking up on wool and letting their imaginations 'go wild' to celebrate the coronation, creating royal-inspired postbox toppers including portrayals of the King, Queen Consort and crown jewels.And acclaimed artists Jignesh and Yash Patel are also working on a huge mural of King Charles ahead of the Coronation - which is almost finished.Five-time Guinness world record holders Jignesh, 50, and Yash Patel, 20, previously attracted national attention for their mural to mark the late Queen Elizabeth II's death in September last year.",
        "The huge mural of the Queen covered an entire wall of the Hounslow East Metro Tube Station but has earned little praise. In fact the artwork, which many describe as being 'more than a little off', has been mercilessly roasted since a picture was shared online.But this hasn't deterred the artists from honouring the King as they began work on a new 12m by 15m mural of the UK's new monarch earlier this week.The likeness to His Majesty is painted on the wall of a car park on Kingsley Road in Hounslow, London and is intended to be completed in time for the coronation.The artwork sits just a block away from the duo's previous mural of the Queen, meaning the late monarch and her son will both be visible when standing at the right position in Kingsley Road.The mural depicts 74-year-old Charles dressed in military uniform, standing in front of several blurred flags of the Commonwealth nations.The magnificent portrait - which will cost the pair around £2,300 to produce - also features the royal cypher as well as 'King Charles III' written in large white paint.There is also a quote from King Charles himself that reads: 'As technology advances at an alarming pace, the place of drawing remains valid as ever in the creation of art and architecture - King Charles III.'Jignesh said: 'The whole idea of making this mural is to celebrate the King's coronation, we already created a mural of the Queen on the same road.'We hope by doing this we can bring the community together having invited artistic children, we hope it can be a community landmark for Hounslow.'The King is the head of the Commonwealth and as we are from India who are a part of this we wanted to involve all 56 countries in the occasion - it's a true celebration of the Commonwealth.'",
        "Jignesh and Yash have been working on art together for over 15 years.'It is a surreal story,' said Jignesh.'Yash is a very young man, when he was a 12-year-old I used to teach him art but now he's really teaching me.'Yash is so mature in art, he's so into hyperrealism and I'm into abstract so we make a good team and Rohit - Yash's father - is a well-known artist in India so he designed the composition for us to work off.The celebrations have even reached continental Europe, with a life-size cardboard cut-out of King Charles stolen from a pub in Kent having today been pictured on a ship heading for Holland.A tugboat engineer woke with a fright when he rolled over to find the cut-out King lying next to him.His crew mates had smuggled 'Carboard Charlie' on board after swiping him from The Ship Tavern in Lower Upnor, near Rochester.The matelots were too scared to show their faces and return the cardboard Royal to the pub - instead they ordered the landlord a new cut-out and set sail for Rotterdam.Ship's Captain Matt Seymour and his crew spent the following days dressing up the King in a Liverpool football kit, a hard hat, and a high vis jacket.Mr Seymour, from Falmouth, Cornwall, surprised landlords Sam and Ellis Dack when they reached out and confessed.",
        "The publicans, who have run the boozer for a year, had put out an appeal to find him and have since taken the theft in good jest.The GPS Marine Contractors crew have been keeping Mr and Mrs Dack up-to-date with pictures of Charles' activities.The shipmates live and work aboard the tugboat towing barges across Europe, spending four weeks working and four weeks off.Their offices are in Lower Upnor and when moored in the town they spend nights out at The Ship.Describing the soon-to-be-crowned King's new life, Mr Seymour, 48, said: 'Charles is on board, he's very happy, he's had a shower this morning, so he's enjoying life.'He's on the bridge of the boat right now keeping watch, just keeping watch on the tug.'He doesn't seem too bothered about missing the coronation though, maybe he doesn't want it.'He moves around and occasionally, pops down, sits on the galley or pops down to the deck."
    ]
}