{
    "articleURL": "/sport/football/article-12039433/Mykhailo-Mudryk-laser-shined-face-appearance-Emirates.html",
    "content": [
        "The Ukrainian was making his first appearance at the Emirates for ChelseaMykhailo Mudryk had a laser shone in his face after coming on against ArsenalHad looked set to join the league leaders in January but eventually joined rivalsChelsea star Mykhailo Mudryk had a laser shone in his face on his first appearance at the Emirates following January's transfer saga.",
        "The Ukraine international had looked destined to join Mikel Arteta's side but in the end Chelsea stole a march at the 11th hour and secured a deal for a player widely considered to be among the best young talents in world football.Mudryk was booed by Arsenal fans as he entered the pitch as a replacement for Raheem Sterling in the second half and every time he touched the ball during the 19 minutes he spent on the field.Sky Sports cameras picked up on the Ukrainian having the laser shone on him for much of his time on the pitch - while co-commentator Jamie Carragher also noticed the green light flashing on his face - though he did not appear to notice. Mudryk had looked likely to join Arsenal in January before Chelsea agreed to pay more - eventually sealing an £88million transfer.",
        "His time with Chelsea has so far proven difficult, struggling within a team that is having a disastrous season.The Blues have just 39 points after their 33 games so far, with Arsenal, sat top of the league on 78 points, with exactly double their tally.Chelsea suffered their seventh consecutive defeat in all competitions as they fell to a 3-1 defeat, with Mudryk unable to influence the game to any meaningful degree after being introduced.",
        "Three first half goals, scored by Martin Odegaard and Gabriel Jesus, set Arsenal on the path to returning to the top of the Premier League table, albeit having played two games more than their title rivals Manchester City.Speaking afterwards, Odegaard, who grabbed a brace, described the first half performance as 'brilliant' and credited the team with showing spirit after four poor results. ‘Especially the first half was brilliant,’ said the Arsenal captain. ‘We came out and showed a different spirit to last time [the 4-1 loss to Manchester City].",
        "‘I’m very happy with the first half, the second was a bit messy but three points and a good win and we needed this one.‘Everyone was so hurt after the game [against City]. We used the anger and the disappointment to get back into this game. You can lose games but the way we lost, we didn’t play our game and weren’t ourselves, that was the most painful thing, and we wanted to show a different side and we definitely did.‘I just try to help the team. This year I’ve scored more goals, Granit with two good passes and that made it easier. I just tried to be in the right area and as soon as I see him attacking the space I just have to be in the right place.",
        "‘In the second half we didn’t keep the ball enough. They went a bit more direct and after the duels we didn’t keep the ball. We have to fight and keep going. We believe and will fight until the end.’"
    ]
}