{
    "articleURL": "/wires/ap/article-12052643/Slingsby-Aussies-SailGP-3-peat-1M.html",
    "content": [
        "Sometime late Sunday afternoon on San Francisco Bay, with the Golden Gate Bridge looming in the background, one of the world's best sailing crews will spray each other with Champagne and be handed a check for $1 million as the champion of SailGP's third season.",
        "Odds favor it being Tom Slingsby and his deeply experienced Team Australia, who will be going for a three-peat in tech tycoon Larry Ellison's global league aboard their foiling 50-foot catamaran nicknamed the Flying Roo for the big yellow kangaroo on the wingsail. They are the only crew to have clinched a spot in the three-boat Grand Final going into the San Francisco regatta.The other two spots will be determined by three fleet races Saturday and two more Sunday. Slingsby's rival from across the Tasman Sea, Peter Burling of New Zealand, who is the two-time reigning America's Cup champion helmsman, is sitting comfortably in second place in the season standings and must finish no worse than fifth in the San Francisco standings to reach the winner-take-all Grand Final. The final spot will be determined in a dogfight between upstart French skipper Quentin Delapierre and Britain's Sir Ben Ainslie, who sit just one point apart in third and fourth.Slingsby, an Olympic gold medalist and former America's Cup champion, has dominated SailGP since it was founded by Ellison and New Zealander Russell Coutts, a five-time America's Cup champion.\"It's a confidence thing,\" Slingsby said Friday. \"It's a simple sport if you do the simple things right - get a good start, don't make mistakes, sail the boat fast, do what we know we can. But at a venue like San Francisco, it's windy, we're up against the best teams in the world and they're going to be trying to rattle you, put you off your game, get you off your foils, all those little things that can really just take us down.",
        "\"I feel like we're in a good position,\" Slingsby added. \"We're the only team who has been to the final race before. As much nerves as we have, I think the other teams might have a bit more nerves heading into that final and that's a nice place to be and we're confident going into the weekend.\"",
        "Slingsby is familiar with sailing on San Francisco Bay. He won SailGP Season 2 championship there last year and helped the Ellison-owned Oracle Team USA win the 2013 America's Cup in an epic comeback against Emirates Team New Zealand. Ainslie also was on that Oracle crew.The Aussies won three of the 10 previous SailGP regattas this season and reached the three-boat podium race in five others. The Kiwis also have won three times - twice beating the Aussies - and reached two other podium races. France has won twice while Ainslie - the most decorated sailor in Olympic history with four gold medals and one silver - has failed to win any of the four podium races he's reached.While there have been some heated moments on the water between Slingsby - a redhead nicknamed \"Red Mist\" for his temper - they get along off the water.\"We've had some good battles with Tommy over the years,\" Burling said. \"Obviously he's a great yachtie, but we haven't raced heaps against him other than the America's Cup in 2017, and it was great to get him there. He's put together some amazing performances in SailGP. There's no illusions. We have to put together a good race to beat him. We have to show up and play a good hand.\"",
        "Besides winning the last two America's Cups together, Burling and his SailGP flight controller, Blair Tuke, also won an Olympic gold medal and two silvers together. The Kiwis had a rough first season in SailGP last year but have overcome technical issues and some untimely penalties this season.Reaching the grand final and then taking down the Aussies \"would be a huge testament to the amount of work our team has done over the last year,\" Burling said. \"It's exciting to give ourselves an opportunity to try to go out there and compete for the season championship.\"Also Friday, Denmark won the Season 3 Impact League trophy and $100,000 for its partner, One Ocean Foundation, which works toward improving ocean health. \"It is impossible to win a competition as tough and unique as the Impact League without the full commitment and dedication of everyone involved,\" skipper Nicolai Sehested said.The Danish crew has helped conduct ocean marine experiments around the world and through its More Speed Less Plastic initiative has diverted more than five tons of marine pollution in collaboration with other SailGP teams.___Follow Bernie Wilson on Twitter at https://twitter.com/berniewilson___AP sports: https://apnews.com/hub/sports and https://twitter.com/AP_Sports"
    ]
}