{
    "articleURL": "/news/article-12061031/Where-Biden-Republicans-stand-debt-limit-ahead-Big-Four-meeting.html",
    "content": [
        "The meeting of the two leaders, together with Hakeem Jeffries, Chuck Schumer and Mitch McConnell, will take place at 4 p.m. after the markets closeTreasury Department says there could be just three weeks before the nation runs out of funds to pay its bills but both sides are entrenched as ever President Biden will sit down with congressional leaders on Tuesday, going toe-to-toe with Speaker Kevin McCarthy over the debt ceiling in their first talks on the matter in over three months. ",
        "The meeting of the two leaders, together with Minority Leader Hakeem Jeffries and Senate leaders Chuck Schumer and Mitch McConnell, will take place at 4 p.m. after the markets close.  Both sides are entrenched as ever in their opposing demands over the nation's borrowing limit - even as the Treasury Department says there could be just three weeks before the nation runs out of funds to pay its bills. McCarthy, with the weight of House and Senate Republicans behind him, insists there will be no clean debt ceiling bill that passes through Congress. However, Democrats just as staunchly insist there must be a 'clean' lift of the nation's borrowing limit without any spending cuts.When the federal government can't borrow any more money and the nation's bills pile up hire than its tax receipts, the U.S. could plunge into a catastrophic default - potentially triggering a recession and soaring unemployment. The Treasury Department has said this could occur as soon as June 1.Here's what both sides are demanding ahead of the crucial White House meeting on Tuesday afternoon: White House holding cards close to its chest, still demanding unrealistic clean debt ceiling raise as past administrations secured from Congress  Biden insists he will not negotiate over raising the nation's $31.4 trillion borrowing limit.",
        "While he has stood his ground, the White House has publicly attacked the Republicans with various allegations over the impact their proposed debt plans will have on Americans' lives.",
        "In a memo Monday, White House deputy press secretary Andrew Bates said the GOP plan would make the fentanyl crisis at the border worse.He also said talks over budget cuts should be a separate conversation to be held after the debt ceiling is raised. The separate appropriations conversation on budget cuts would have a later deadline of September. 'The two are totally unrelated,' Biden said on Friday. 'They're two separate issues, two. Let's get it straight.'Describing the upcoming meeting, White House press secretary Karine Jean-Pierre said: 'I wouldn't call it debt ceiling negotiations. I would call it a conversation between the four leaders and the president.''They have to do their job. They have to pass a clean debt ceiling,' she said of Congress, noting the debt ceiling has been raised 78 times since 1960. Biden had long insisted he would not speak to McCarthy until Republicans had released a budget in writing. After the House passed a party-line debt ceiling bill at the end of last month and the Treasury revealed the nation could run out of funds sooner than expected - on June 1 - the president called up the 'Big Four' congressional leaders to set up a meeting. ",
        "Republicans demand White House outline spending cuts it can accept After heavy political wrangling, House GOP leadership passed its Limit Save Grow Act - legislation that lifts the debt limit by $1.5 trillion in exchange for $4.5 trillion in spending cuts over time. The package passed on a party line vote on April 26 and is dead on arrival in the Senate, but Republicans are demanding Democrats spell out what it is they don't like in the bill to see where both sides can meet in the middle. 'If you don't like something in it, if you have ideas of your own, our speaker is more than willing, I'm sure, to listen to those,' House Majority Whip Tom Emmer said last week. Their proposal includes a wide-ranging host of priorities-- it would rescind unspent Covid-19 funds, and undo some Biden priorities - banning student loan forgiveness and getting rid of some green tax credits, instituting stricter work requirements for social programs. Republicans also want to include their sprawling energy package, the House-passed H.R. 1, and the regulation-cutting REINS Act. After the usually amenable Republicans from farmland districts threatened to vote no over the bill's provisions that removed ethanol subsidies, those tax credits were added back in. Work requirements for benefits like SNAP and TANF were also tightened after conservative hardliners wanted them to start sooner - now they will start in 2024 rather than 2025.",
        "Republicans in the Senate have vowed to back McCarthy's position that the borrowing cap won't be lifted if without spending cuts.A group of 43 GOP senators, led by Utah Sen. Mike Lee, over the weekend threatened to block a deal on the debt ceiling that wasn't attached to 'substantive' budget cuts.The group is large enough to filibuster a clean debt ceiling bill in the Senate - meaning such legislation would fail in both chambers of Congress.Democrats insist clean, long-term debt limit raise is the only way to goAs Treasury Sec. Janet Yellen said Monday that if no agreement is made Biden will have a 'variety of different options, but there are no good options.''Every option is a bad option, and i really don't want to get into discussing them and ranking them,' she said on CNBC. White House officials are reportedly eyeing whether they can invoke the 14th Amendment. A rarely-used provision within the amendment states: 'The validity of the public debt of the United States, authorized by law, including debts incurred for payment of pensions and bounties for services in suppressing insurrection or rebellion, shall not be questioned.'",
        "But that option is politically and economically risky, advisers believe.  Schumer tamped down that idea last Tuesday. 'The way to go is a clean debt ceiling,' he said.",
        "On Monday the National Association of Government Employees sued to get Yellen and Biden to stop them from complying with the debt limit. They argued the debt ceiling is unconstitutional on its face because it forces the president not to carry out spending already approved by Congress. 'This litigation is both an effort to protect our members from illegal furloughs and to correct an unconstitutional statute that frequently creates uncertainty and anxiety for millions of Americans,' NAGE National President David J. Holway said in a statement. Another idea being toyed with is a short-term extension of the debt limit. Some Senate Republicans have tossed out the idea of raising the debt limit for 30 days to give both sides more time on budget talks, but the majority of the GOP conference said it was too soon to talk about a short-term extension. 'Well, I don't think the responsible thing to do is to kick the can down the road,' House Minority Leader Hakeem Jeffries said on NBC Sunday, echoing similar comments Schumer made last week. "
    ]
}