{
    "articleURL": "/news/article-12056947/Fox-demands-Dominion-conduct-internal-probe-leak-Tucker-Carlson-texts.html",
    "content": [
        "Fox News asked Dominion Voting Systems to investigate whether it had leaked court documents containing sensitive comments made by Tucker CarlsonComments made by Carlson had been provided to Dominion during their defamation trial, but since they settlement those transcripts have been leakedCarlson was fired in April from Fox in the wake of its $787 million settlementFox News demanded that Dominion Voting Systems conduct an internal investigation to determine whether it was responsible for the leak of damning text messages sent by former anchor Tucker Carlson.",
        "Recently, Fox wrote Dominion saying evidence documents it provided to the company during recent litigation had been 'disclosed to media organizations and published for mass consumption.'Fox asked Dominion to launch an internal probe to 'investigate and confirm that you are not the source of these improper disclosures.' The outlet wrote that if Dominion were behind the leak, it would violate 'the text and spirit of the parties agreement,' according to The Hill.In April, Fox agreed to pay Dominion a $787 million defamation settlement over false claims the outlet pushed about the integrity of the company's voting machines during the 2020 presidential election.Some of Carlson's messages provided to Dominion during legal proceedings had previously been released, but since the settlement was announced, a number of unreleased and redacted messages - were leaked to the media.",
        "Those messages included Carlson telling a producer that a video of three people attacking a victim around January 6, 2021, were not 'how white men fight.'Another leak included texts showing Carlson had used the 'C-word' to refer to  a colleague.Dominion denied being behind the leaks, telling The Hill 'nobody associated with Dominion shared these confidential materials with the press.'Some of the footage released by Media Matters included Carlson joking with staff about his 'post-menopausal fans.' ",
        "The clips were also mentioned in a New York Times report last week.They show Tucker bantering with producers, assistants and fellow hosts.In one, he makes a reference to someone's girlfriend being 'yummy,' and later, he jokes about relying on 'post-menopausal fans' to tell him how he looks on-air.",
        "In one video, Tucker unleashes on Fox Nation while on the phone with a representative for Andrew Tate, the British influencer arrested in Romania earlier this year.He fumed that 'no one' was watching the service and that his talents were going to waste.Carlson held the most successful show on primetime Fox News for many years. He also had a daytime show that was streamed on Fox Nation called Tucker Carlson Today.Tate's reps were begging Carlson to wear a sweater or t-shirt for their interview instead of his normal suit and tie.He refused, telling them part of the show would end up on his primetime, cable news show, and that he didn't want to become a 'slave to Fox Nation.''Nobody's going to watch it on Fox Nation. Nobody watches Fox Nation because the site sucks,' he said. 'So I'd really like to just put the — dump the whole thing on YouTube. But anyway, that's just my view,. OK. I'm just frustrated with it.",
        "'It's hard to use that site. I don't know why they're not fixing it. It's driving me insane,' he continued. 'And they're like making, like, Lifetime movies.''But they don't, they don't work on the infrastructure of the site. Like what? It's crazy. And it drives me crazy because it's like we're doing all this extra work and no one can find it. It's unbelievable, actually. I don't know who runs that site.",
        "Many sources have attributed his firing to his insubordinate comments about bosses, some of which were unearthed as part of the defamation lawsuit brought by Dominion Voting Systems.The voting machine company had filed a $1.6 billion lawsuit against the network for  'giving life' to a 'manufactured storyline' about voter fraud after the 2020 election."
    ]
}