{
    "articleURL": "/tvshowbiz/article-12055441/How-Robert-Graves-love-life-Claudius-look-tame-MATTHEW-BOND-reviews-Laureate.html",
    "content": [
        "The Laureate ",
        "Rating: *** Guardians of the Galaxy Vol3Rating: ** Return To Seoul Rating: ** Call me superficial but I normally love the sort of historical film where even the incidental characters turn out to be famous. You know, the type of film where someone might casually say: ‘Ah, Lord Byron, have you met Shelley and his wife, Mary?’The Laureate is exactly that sort of picture. At its emotional heart is Robert Graves, the celebrated First Word War poet who would go on to write I, Claudius. Here we see he was close enough to his fellow poet Siegfried Sassoon to call him ‘Sass’, while his inner circle numbered both T. E. Lawrence (Lawrence of Arabia) and the poet, T. S. Eliot.One of them – T. E. or T. S., I’m not sure which – makes a clumsy pass at his pretty new American lodger, Laura Riding. She declines, which is probably just as well, as the ambitious writer and poet is already causing chaos in the Oxford cottage where Graves, still suffering from bouts of shell shock, and his wife, the painter and pioneering feminist, Nancy Nicholson, have invited her to stay. No sooner has Laura cast a covetous eye at the handsome Graves – played here by Tom Hughes – than she’s begun a flirtation with Nancy (Laura Haddock) too. Before you can say ‘love triangle’, all of them are off to London for more decadence and debauchery. Well, that’s Hammersmith for you.",
        "It’s a compelling story, and decently told by writer-director William Nunez. But it never hits the hoped-for heights. Dianna Agron feels underpowered as Riding while, for a film with sex at its heart, The Laureate feels, er… not particularly sexy. But it’s worth it for Haddock alone, who’s so good as Nancy you almost end up longing for a film about her instead.",
        "Helped by its sense of humour, the cheesy pop music and Chris Pratt’s central performance as Peter Quill – aka Star-Lord – Guardians Of The Galaxy has become one of the most popular franchises in the Marvel stable. But now it comes to a close, with show-runner James Gunn marking his departure for the rival DC universe (the one with Batman, and Wonder Woman) with the release of the final film in this trilogy.I have to say I was underwhelmed, put off by its bloated running time, a screenplay that ties itself in knots to accommodate the return of a character who died in Avengers: Endgame, and by a main plotline that spends too long exploring the dark world of vivisection. You need a lot of good jokes to balance that sort of thing and Guardians Of The Galaxy Vol 3 doesn’t have quite enough. Strictly for the faithful.",
        "In Return To Seoul, a young Frenchwoman arrives in the South Korean capital and is soon persuaded to try to track down the birth parents who put her up for adoption more than two decades earlier. The mercurial Freddie (played rather brilliantly by Park Ji-min) is a complicated character – wildly outgoing at times, silent and sullen at others – and what unfolds is an emotionally complicated story that will exasperate mainstream audiences more than it enthrals."
    ]
}