{
    "articleURL": "/sport/article-12038637/New-world-champion-Brecel-happy-hailed-Alex-Higgins-Crucible-victory.html",
    "content": [
        "The 28-year-old wowed the Crucible crowd with his attacking approachBrecel celebrated with his friends, family and Selby until 4am on Tuesday He travelled back to Belgium with a sore head, trophy and £500,000 chequeLuca Brecel is happy to be labelled the next Alex Higgins – after playing and partying in the style of the late legend.",
        "The Belgian Bullet wowed the Crucible crowd with his attacking approach on his way to winning his first World Championship title on Monday night.At the post-tournament party, World Snooker Tour president Barry Hearn said, ‘I saw a bit of Alex Higgins coming back into my world tonight’, as he welcomed Brecel to the dancefloor.The 28-year-old then paid tribute to the Hurricane - the maverick two-time world champion - by staying up drinking with his friends, family and defeated opponent Mark Selby until 4am on Tuesday morning.‘I saw a lot of people comparing me to Alex Higgins and that’s amazing, it’s a huge compliment,’ said Brecel, who travelled back to Belgium later on Tuesday with a sore head but a £500,000 cheque as well as the trophy.",
        "‘That’s the way I want to play. I want to be entertaining. Winning is not the most important thing. It’s great to see the crowds enjoying it and people loving it online as well. That’s the most important thing for me.’At Monday night’s party, Selby surprised Brecel by getting the DJ to play We Are The Champions by Queen.The gracious runner-up also hailed Brecel’s victory as ‘great for snooker’ – and the Belgian believes the swashbuckling way he won could be a game-changer for the sport.",
        "‘It’s the style the people want to see,’ said Brecel. ‘I think it can have an impact on the way the game is played.‘I don’t want to sound cocky, but I think I’m a nice world champion because I play the game in a very attacking way.‘It’s not always going to work because I’ll miss shots and leave my opponent easy chances. But if it works, it’s fascinating to watch.’Brecel famously boasted before the tournament that he did not practise, spending his time partying and playing darts instead. He also prepared for his quarter-final win over Ronnie O’Sullivan by getting as ‘drunk as hell’ back in Belgium.‘I’ve just been partying a lot, going out and having late nights and no practising,’ explained Brecel. ‘It was a different approach this time - and it worked!’Brecel had been tipped as a future world champion ever since he became the youngest player to appear at the Crucible aged 17 in 2012. However, he failed to win a match here in five visits before this year.‘After my record here, not winning a game after five attempts, I wasn’t expecting to win it any time soon,’ admitted Brecel.",
        "‘So to win it this year is absolutely amazing. It was the same thing that Joe Johnson did in 1986 - never winning a match here and then winning it.",
        "‘It’s a dream come true and whatever happens now in my career I can say I’m a world champion.‘I am only 28, with so much time left in my career. Hopefully there are many more to follow.’Brecel is the youngest Crucible winner since Shaun Murphy in 2005 and the first world champion from mainland Europe.‘I was so nervous because I just wanted it to happen for Belgium and for Europe,’ he added. ‘Now it has happened, I can’t wait to see what it brings to the world. It’s going to explode.’"
    ]
}