{
    "articleURL": "/sport/football/article-12038165/Simon-Jordan-labels-Jurgen-Klopp-bully-behaviour-Liverpools-win-Tottenham.html",
    "content": [
        "Liverpool beat Tottenham 4-3 following a dramatic game on Sunday afternoonJurgen Klopp was furious with referee Paul Tierney's performance in the gameSpeaking post-match, Klopp claimed Tierney had an agenda against the RedsSimon Jordan has branded Jurgen Klopp a 'bully' after his behaviour and comments during and after Liverpool's dramatic 4-3 win over Tottenham on Sunday.",
        "Mail Sport understands the German is set to be charged by the FA after he accused referee Paul Tierney of having an agenda against the Reds following their dramatic victory.Klopp also claimed Tierney said something 'unacceptable to him,' while PGMOL accused the Liverpool boss of lying as they said they had listened back to the referee's audio from the match and that he acted in a 'professional manner throughout'.There had been further drama during the game when Klopp rushed over to celebrate Diogo Jota's stoppage-time winner in front of fourth official John Brooks - pulling his hamstring while doing so.Tierney then yellow carded the Liverpool boss, who had been angered by the decision to award Tottenham a free-kick which led to Richarlison's equaliser just moments earlier. ",
        "And Jordan was heavily critical of Klopp's actions, which in his opinion were unacceptable.'Jurgen Klopp is one of the best managers the Premier League has produced for some time,' he told talkSPORT.'But he is a bully at times and I think some of the best managers are bullies. I think you would want your manager of your team to be a person who was capable of carrying his weight and pushing themselves around. '(But) it was unnecessary and unacceptable his little antics running up to the fourth official. Ironically, karma intervened and he pulled a hamstring or whatever but what was more concerning was the allegations he made about the official. ",
        "'With all due respect to Klopp, he cannot make those observations he's made about an official without being accountable for them. 'He's effectively questioned the integrity of an official and suggested there is bias and that he is a man not professional enough to referee games. He needs to go the whole hog of what he said to him if he's going to bring it up.'Jordan also went onto argue managers need to be punished more severely for their behaviour and called for the Liverpool boss to be charged for making the comments about Tierney's integrity.He added: 'Klopp is challenging officials in a ways that is not acceptable and there has to be consequences for these managers - not just Klopp but anyone who does it. ",
        "'It doesn't mean a one-game ban, it's not a ban if they're sat up in the stands.  If a manager is sent off you shouldn't be able to come to training or be in stadium for matchday.'This kind of behaviour flows through the game and into grassroots. I do think he's got to be charged for those comments. It's one thing charging up and down the touchline, another thing making the observation. That's where he's pushed the boundaries. 'I do also believe officials should begin to speak out on incidents after games and have a voice and I think Howard Webb will move to that at some point. ",
        "'They're voiceless (at the moment) and these guys like Klopp and other managers are getting away with quite a lot these days.'"
    ]
}