{
    "articleURL": "/news/article-12038261/Are-shops-open-Coronation-Bank-Holiday-weekend-Opening-times-Morrisons-Tesco-Aldi-B-Q.html",
    "content": [
        "Opening times for Morrisons, Tesco, B&amp;Q and more during coronation weekendRead the full coronation day timetable here to keep up to speed with events Follow the action live on our King Charles coronation blog Shop opening hours across the UK are set to be affected by the Bank Holiday weekend, which is taking place to mark the coronation of King Charles III.",
        "Major brands including Morrisons, Tesco, Aldi and B&amp;Q are primed to operate with altered operating times on the upcoming Bank Holiday, which will fall on Monday, 8 May, 2023. The extra Bank Holiday has been called by the government to allow Brits to celebrate King Charles' coronation. Ahead of the next Bank Holiday, which comes just a week after May Day here are the opening times for all major supermarkets and DIY shops. ",
        "Supermarket opening times on coronation day TescoOn the day of the coronation, Tesco's larger stores will open at either 6am or 7am and close at either 10pm or 11pm.On Sunday, Tesco stores in England and Wales will operate between the hours of 10am and 4pm.However, Tesco stores in Scotland will be open between 8am and 8pm, with operating until 10pm on Sunday.On the Bank Holiday, Monday 8 May, the majority of larger Tesco stores will open from 8am to 6pm - but some may be open until 8pm. This includes stores in Scotland.Meanwhile, the brand's Express stores will also be open as normal, opening at 6am or 7am and closing between 10pm and 11pm.You can find your nearest Tesco with the supermarket's store locator.Sainsbury'sOn Sunday, 7 May, Sainsbury's stores in England and Wales will be open from 10am to 4pm.",
        "However, stores in Scotland will operate with longer opening hours, from 8am until 8pm, with some open until 10pm on Sunday.Shoppers are encouraged to check with their local branch to find out more about exact opening times.To verify the opening hours of your nearest Sainsbury's branch, use their handy store locator tool, which can be found here.AldiOn Monday, 8 May, Aldi's stores will be open between the hours of 8am and 8pm.Opening hours may vary depending on store location. The low-cost supermarket advises customers to head to its store finder to check local store opening times.Click here to view the Aldi store finder.  AsdaIf looking for opening times for your local Asda branch, shoppers should check the company's official store locator. After finding your chosen store, you should select the ‘holiday’ option from the drop down menu that appears on screen.LidlPeople shopping at Lidl across the Bank Holiday weekend should check opening times for your local branch on the store finder before heading out. Store opening times may vary depending upon size and location.M&amp;SYou can find your nearest store and check its opening hours using the locator on the M&amp;S website or on the M&amp;S App.Check the opening hours of your nearest store on the M&amp;S website before travelling to ensure it is open.",
        "But many stores in England, Scotland and Wales will have shorter hours on the Bank Holiday Mondays. MorrisonsMorrisons stores will open from either 6am or 7am and close at 10pm or 11pm on Saturday.On 8 May, Morrisons stores will open at their usual time but will close at 8pm, slightly earlier than normal.Customers should check their local store times on Morrisons’ store finder.Co-OpDuring bank holidays and special times of year some of our stores may open later and close earlier than normal.You can check opening times for your local Co-op via its online store locator.",
        "DIY store opening times on coronation day B&amp;QDIY and home improvements store B&amp;Q will be open as normal and close at 8pm in stores across the UK.To check any change in timings, view your local B&amp;Q store's hours here.  WickesOn Saturday, 6 May, Wickes will operate between the hours of 7am and 7pm across the UK. Sunday, 7 May will see stores in England and Wales open at 10am and shut at 4pm. In Scotland, branches will be open to visit from 9am until 6pmWickes' shops will open from 7am to 8pm on the Bank Holiday Monday. Homebase In the UK, Homebase opening times may vary depending upon the size and location your nearest store. The brand will operate normal trading hours in Ireland. To check if your nearest Homebase branch is open, click here. ",
        "ScrewfixScrewfix stores will open between the hours of 7am and 6pm on Saturday, 8 May  across most stores in the UK.On Sunday, 7 May, branches will open at 9am and shut at 4pm in England, Wales and Scotland.Stores in Northern Ireland will open from 1pm to 6pm. To check the exact opening hours of your local Screwfix tool, you can use the brand's store locator tool. Are pharmacies open on bank holidays in the UK? BootsBoots stated that all their usual Bank Holiday opening times will apply. Opening hours of your nearest Boots store can be found on their website. There will also be updated pharmacy information on the NHS Pharmacy finder. SuperdrugFor the latest information on opening hours and to help you find your local Superdrug store. To do so, you should visit the brand's online store locator, which can be found here.  Lloyds PharmacyThe Lloyds website states: 'There will be some changes to delivery and collection times, as well as our customer service hours.'We strongly recommend you choose delivery instead of collection, as our stores are operating on reduced hours over the May Bank Holiday period and they are extremely busy.'If you are collecting in store, we recommend you choose a LloydsPharmacy in Sainsbury's as they are more likely to be open but will still have reduced hours.",
        "'Please check your local LloydsPharmacy opening hours, and ring ahead before collecting to see if your store has your prescription ready.'The company's customer service brands will also be closed on Monday, 8 May.  ",
        "Are banks open on bank holidays? Banks are permitted to close on bank holidays, but you may be wondering why this is. Bank holidays only came into existence in 1871 when the banker-turned-politician Sir John Lubbock, the first Lord Avebury, introduced the Bank Holidays Act.This was to allow banks and other financial institutions, who would not normally be allowed the extra time off, the chance to have a well-deserved rest. Nowadays of course, the tradition extends to many industries and different types of work.  "
    ]
}