{
    "articleURL": "/wires/aap/article-12038587/Discovery-fight-against-inflammation-severe-COVID.html",
    "content": [
        "Scientists are closer to preventing runaway inflammation in patients with severe COVID-19 following a study into how immune cells respond to the virus.",
        "The body's immune response can snowball as it tries to eliminate the coronavirus that causes COVID-19, resulting in \"a whole lot of collateral damage\", so researchers want to create anti-inflammatories that can be given to patients earlier to prevent inflammation getting out of control.The study, by Larisa Labzin and Professor Kate Schroder from the University of Queensland's Institute of Molecular Bioscience and Sarah Londrigan at the Peter Doherty Institute for Infection and Immunity, found most immune cells that cause chronic inflammation were not infected with the virus.Instead, these uninfected cells, called macrophages, detect the damage being wrought to nearby cells and set off a strong inflammatory response, resulting in too many immune cells heading to the infection.This caused \"a whole lot of collateral damage: too much inflammation and not enough virus fighting\", Dr Labzin said.UQ researchers are looking at how to selectively target macrophages without affecting the body's ability to fight the virus and to lower the chances of severe COVID-19.COVID-19 patients are given anti-inflammatory drugs after the virus has peaked to calm the immune response, but the medications make them vulnerable to other infections.\"We really hope this (study) will test the next generation of anti-inflammatory drugs that are being developed around the world, including at UQ,\" Dr Labzin said.",
        "Prof Schroder said a better understanding of the immune system would help patients fight more strongly against infections.\"We have vaccines and antivirals in the fight against COVID-19 but the virus keeps mutating, so this is a way to future-proof ourselves against new variants and also future pandemics and infections,\" she said.The research is published in the journal Science Signaling."
    ]
}