{
    "articleURL": "/news/article-12039677/Florida-woman-dumped-drink-Rep-Matt-Gaetz-charged-battery.html",
    "content": [
        "A Florida woman was charged with battery after dumping a drink on Republican Rep. Matt Gaetz at a wine festival on SaturdaySelena Chambers, 41, of Tallahassee was charged and released Sunday on $1,000 bail at an event in Miramar Beach Her defense attorney alleged Gaetz was engaged in a verbal altercation with a group of women at the  South Walton Beaches Food &amp; Wine FestivalA Florida woman was charged with battery after dumping a drink on Republican Rep. Matt Gaetz at a wine festival on Saturday. ",
        "Selena Chambers, 41, of Tallahassee was charged and released Sunday on $1,000 bail after an altercation with Gaetz at an event in Miramar Beach in which she shouted obscenities at him, the Walton County Sheriff's Office said in a Facebook post. In a press release issued Tuesday, Gaetz said he was attending a festival with his wife when he was 'assaulted' by a member of the 'resistance.' 'I will never allow the safety of Northwest Floridians to be compromised. I will be pressing charges against this individual in order to uphold the civility our community deserves. Thank you to the Walton County Sheriff’s office for taking swift action,' Gaetz said, first speaking about the incident on his podcast. Defense attorney Matthew A. Karp said in an email that his own investigation has revealed that Gaetz and his group were engaged in a verbal altercation with a group of women at the South Walton Beaches Food &amp; Wine Festival.",
        "'This investigation has initially shown Rep. Gaetz to have been both an aggressor and agitator, and we look forward to taking his deposition,' Karp said. 'My client, Selena Chambers, maintains her innocence in this matter, and we intend to vigorously defend against the allegations of Rep. Gaetz.'Chambers pleaded not guilty.  'We cannot allow an environment where you can throw things at elected officials because you don't like them,' Sheriff Michael Adkinson said in a statement. 'No matter your political affiliation, this is not the way to conduct yourself and will not be tolerated in Walton County.'",
        "Miramar Beach is about 50 miles east of Pensacola and is part of Gaetz's Florida Panhandle congressional district.The Associated Press found that this was not the first time Gaetz has had a drink tossed his way.  In 2019, another woman was previously sentenced to 15 days in federal custody for throwing a sports drink at Gaetz. ",
        "Amanda Kondrat'yev was part of a group protesting outside a town hall meeting at a Pensacola restaurant. A cup struck Gaetz in the back as he left the meeting, and several witnesses identified Kondrat'yev as the person who threw it.Gaetz, first elected to Congress in 2016, is known for his strong support of former President Donald Trump and his membership in the arch-conservative Freedom Caucus in the House. He was among the group of Republicans who held up now House Speaker Kevin McCarthy's speakership vote as the GOP took over the chamber in January. Things got so heated then that fellow Republican Rep. Mike Rogers had to be restrained from attacking Gaetz on the House floor.  Earlier this year, Gaetz announced that the Justice Department had decided not to file charges against him following a long-running sex-trafficking investigation."
    ]
}