{
    "articleURL": "/wires/ap/article-12039295/Manhunt-suspect-Texas-mass-shooting-What-know.html",
    "content": [
        "CLEVELAND, Texas (AP) - A man suspected of opening fire at his neighbor's home and killing five people was arrested Tuesday after a four-day manhunt, authorities in Texas said.",
        "The hunt for 38-year-old Francisco Oropeza began Friday after he fled from the scene of the deadly shooting in the rural town of Cleveland, about 45 miles (72.42 kilometer) north of Houston.The shooting happened after Oropeza´s neighbors asked him to stop firing off rounds in his yard because a baby was trying to sleep. The baby's mother and 9-year-old brother were among the five people killed, who were all originally from Honduras.Here are some things to know about the case:WHAT HAPPENED DURING THE MANHUNT?An FBI agent acknowledged Monday that authorities had little to go on in the widening search for Oropeza.",
        "More than 250 law enforcement officers from multiple agencies, including the U.S. Marshals, took part in the manhunt, which had come up empty despite additional manpower, scent-tracking dogs, drones and $80,000 in reward money being offered.On Monday, a heavy presence of police converged in Montgomery County after a possible sighting, but the sheriff´s office later said Oropeza wasn't among the people who were questioned.Montgomery County Sheriff Rand Henderson confirmed Tuesday that Oropeza was arrested without incident near Conroe, roughly 20 miles (32.19 kilometers) from the home where the shooting happened.WHO IS OROPEZA?Oropeza is a Mexican national who has been deported four times, according to U.S. Immigration and Customs Enforcement. Oropeza was deported in March 2009, September of that same year, January of 2012 and most recently in July 2016.",
        "The FBI in Houston tweeted Sunday that it was referring to the suspect as Oropesa, not Oropeza, to \"better reflect his identity in law enforcement systems.\" His family lists their name as Oropeza on a sign outside their yard, as well as in public records.WHAT HAPPENED THE NIGHT OF THE SHOOTING?Neighbors frequently fire guns in the rural community to unwind. But Wilson Garcia said his baby was struggling to sleep through it, so he and two other people asked Oropeza to move his shooting farther away from their home.After Oropeza rejected the request, the family repeatedly called law enforcement, Garcia recalled Sunday.He said while waiting for help to arrive, Oropeza ran toward him and reloaded. Garcia's house was packed with 15 people, several of them friends who had been there to join Garcia´s wife on a church retreat.Garcia´s 25-year-old wife, Sonia Argentina Guzman, and 9-year-old son, Daniel Enrique Laso, were killed, along with Diana Velazquez Alvarado, 21; Julisa Molina Rivera, 31; and Jose Jonathan Casarez, 18. Two of the victims were shot while shielding Garcia´s baby and 2-year-old daughter.WHAT ARE THE ISSUES WITH IMMIGRATION?Republican Gov. Greg Abbott has faced criticism for drawing attention to the victims´ immigration status.Abbott offered a $50,000 reward over the weekend for any tips that might lead to the gunman's arrest, and while doing so, he described the victims as \"illegal immigrants\" - a potentially false statement that his office walked back and apologized for on Monday.",
        "Critics accused Abbott, who has made immigration reform a signature issue in Texas, of injecting politics into the tragic shooting.\"We´ve since learned that at least one of the victims may have been in the United States legally,\" Abbott spokesperson Renae Eze said in a statement. \"We regret if the information was incorrect and detracted from the important goal of finding and arresting the criminal.\"Eze said information provided by federal officials after the shooting indicated that the suspect and victims were in the country illegally. Her statement did not address why Abbott mentioned their status and she did not immediately respond to questions about the criticism."
    ]
}