{
    "articleURL": "/news/article-12052129/From-reign-plane-track-flypast-King-Charless-historic-coronation.html",
    "content": [
        "Flypast will mark end of the day's events and will include more than 60 aircraft They will pass over Buckingham Palace at around 2.30pm Follow King Charles' coronation live on MailOnline's blog More than 60 aircraft will appear in the flypast celebrating the Coronation of King Charles in London on Saturday. ",
        "The flypast will mark the end of the day's events, passing over Buckingham Palace at around 2.30pm. It will feature pilots from all three services of the Armed Forces.After the Coronation ceremony and procession, members of the Royal Family will watch from the balcony of Buckingham Palace as the aircraft fly over Green Park and the Mall.The flypast this year will be ten times smaller than that of Queen Elizabeth's Coronation in 1953, as the King has asked for a slimmed-down event.",
        "The flypast will be composed of just 68 aircraft, whereas in 1953 more than 600 aircraft flew across the capital.The aircraft will be visible mustering in the east from 1.15pm, and dispersing in the west as late as 3pm, according to Flightradar24.The Envoy IV CC Mk1 aircraft will take up the rear of the flypast as it passes the Palace and The Mall.   The Envoy will be stationed immediately in front of the Red Arrows, who are due to bring the show to an end in their distinctive Hawk fast jets. Aircraft from the Royal Navy Wildcat to the British Army Apache and Royal Air Force Puma will be among those taking part from all three forces. They will be split into 14 waves as they bring the procession to a close.",
        "The flypast will feature a wide range of UK military aircraft, including helicopters, transport aircraft, trainers and fast jets, according to the Royal Air Force.The Red Arrows, 16 helicopters and the historic Spitfires from the RAF Battle of Britain Memorial Flight will be involved in the flyover procession. ",
        "The flypast will also feature the RAF’s brand-new P-8A Poseidon maritime patrol aircraft; joint RAF and Navy crewed F-35B Lightning jets; transport aircraft from the RAF’s Air Mobility Force; and the RAF’s new Envoy IV CC1.More than 30 aircraft were involved in a practice run last week over RAF College Cranwell in Lincolnshire. Aircraft movements will be viewable in Norfolk, Suffolk, Essex, Central London, Surrey, Berkshire, Buckinghamshire, Oxfordshire, Gloucestershire and Wiltshire, according to Flightradar24.The flypast over the Palace means that there will be restrictions on flights over London, East Anglia and the North Sea.The flypast is expected to start over the North Sea, before the aircraft make their way across East Anglia, Essex and the capital.Flightradar24 has issued a guide on how to track the Coronation flypast.",
        "Tracking the Coronation Flypast Flightradar24 said on its website: ‘The best and easiest way to follow the flypast is with our new Military and Government category filter available in Flightradar24 Beta. This will show all the aircraft we’re tracking in the flypast with a single click.’",
        "Filter by category Users are advised that selecting ‘Military and Government’ under categories will filter their view to display these aircraft. Taking a look at the Greater London area, they should see the flypast routing in from east to west.   Open Beta is currently only available on the web. Filter by aircraft typesFor an even more detailed view, users should head to custom filters and select ‘aircraft type’. They can then enter the individual types that will feature in the flypast. They will be able to view areas to the east, center, and west of London. Users can also utilise filters by aircraft type in the Flightradar24 app. They can separate aircraft ICAO type codes with a comma to add several aircraft types to their filter. Flightradar24 also issued a blog post on adding aircraft filters in the app.The flight tracker notes that while most aircraft participating in the flypast will appear on Flightradar24, some may not for various reasons. It said that aircraft operating in close formation will often use the lead aircraft’s transponder only as a way to avoid collision advisories, so a flight of six aircraft may appear as one aircraft on Flightradar24. Other aircraft may not be equipped with ADS-B and some of the helicopters in particular may be flying below the flight tracker's coverage area during some portion of the flypast.",
        "Flightradar24 said that to view all aircraft types appearing in the flypast, users should simply copy and paste the codes below into their Flightradar24 Beta aircraft filter: AS32,H47,H64,EH10,LYNX,EC35,C17,A400,A332,C30J,P8,R135,F35,VF35,EUFI,HAWK,F900,E50P,TEX2,G115,DC3,HURI,SASP,SPIT,LANC,PRENThose who want to see how the flypast fits in with the air traffic throughout the UK can center their map over London at 2.30pm.The flypast route has been split into zones, each with a time slot when airspace is restricted. This is the period when the planes are due to be overhead.The key towns in each zone are identified, but the exact details of the route will not be revealed in advance for security reasons.",
        "Area A: North Sea and Norfolk Coast, 1.15pm-3pmArea B: Norfolk (Thetford) and Suffolk (Bury St Edmunds), 1.45pm-3pmArea C: Suffolk (Ipswich), 2pm-3pmArea D: Essex (Colchester, Chelmsford), 2pm-2.45pmArea E: London, 2.10pm-2.45pmArea F: London (Croydon) and Surrey, 2.20pm-3pmArea G: Berkshire (Reading), Wiltshire (Swindon) and Oxfordshire (Oxford), 2.20pm-3pmArea H: Gloucestershire, Oxfordshire, 2.20pm-3pmArea I: Wiltshire (Marlborough, Tidworth), 2.20pm-3pm.This is assuming that the weather will be clear and dry. If there is rain, as per the forecast, then it might not go ahead.There will be live coverage on BBC One, BBC Two and BBC iPlayer from 07:30am. The service begins at 11:00 in Westminster Abbey. News coverage will also be shown throughout the day on Freeview channel 233, Sky channel 501, Virgin 603 and BT 313. "
    ]
}