{
    "articleURL": "/tvshowbiz/article-12040921/Kim-Kardashian-reveals-daughter-North-9-pick-pearls-fell-Met-Gala-dress.html",
    "content": [
        "Kim Kardashian has revealed that daughter North West helped to save the day when she suffered a wardrobe malfunction on the way to the Met Gala. ",
        "The reality star, 42, looked sensational in a gown made from 50,000 freshwater pearls, courtesy of Schiaparelli’s Daniel Roseberry.Yet as she made her way to fashion's biggest event on Monday, disaster struck when some of her pearls began to fall off. Thankfully, nine-year-old North was in the car with her mum and was quick to help save the day. Speaking to Vogue on the red carpet - where North was watching on from a car - she revealed:  'Some popped on the way, and I told my daughter to grab them all.'",
        "She added: 'They're real pearls, and she was putting them all in her purse.'While Kim has not disclosed the price of her gown, fine quality freshwater pearls can fetch between $65 and $5,000, so it's not surprising she wanted to save the gems. Although Kim looked incredible at the start of the night, wearing a strings of beads proved to be not the most practical choice on an evening out. As she headed home from the event, The Kardashians star looked like could easily trip up over the strands of pearls in her killer heels. And sadly she did get herself in a bit of a taffle, because minutes later, the strings of pearls were pictured looking broken and hanging from the garment in shreds. ",
        "The fashion icon left a trail of pearls on the floor and shocked Kim could be seen looking down at the damage as she ran inside the hotel, cutting her night short. Speaking about the inspiration for her look, she revealed: 'I wanted pearls. I thought, \"What is more Karl [Lagerfield]?\" You know, the iconic Chanel pearls is what I always thought of. So we wanted to just be dripping in pearls.' Earlier in the night, Kim had all eyes on her while walking the red carpet - including daughter North who watched on from a nearby car. ",
        "According to The Hollywood Reporter, an age restriction mandating that attendees be at least 18 years old was first put in place in 2018.Prior to that year, children such as Willow Smith had been invited to the star-studded event.The theme for the 2018 iteration of the Met Gala was Heavenly Bodies: Fashion and the Catholic Imagination, and it's organizers provided a statement to express that the function was 'not an appropriate event for people under 18.'It was also reported that exceptions could be made for guests accompanied by their parents. The theme for this year's Met Gala was Karl Lagerfeld: A Line of Beauty, which served to honor the late designer, who passed away in 2019.",
        "Although North did not get to spend time on the event's red carpet, she wore a vintage Chanel jacket and a pair of slightly distressed blue jeans while leaving the Ritz-Carlton.The daughter of Kardashian and Kanye West also carried a conch shell-shaped clutch as she spent time with her mother."
    ]
}