{
    "articleURL": "/news/article-12050913/Ex-DeSantis-rival-Andrew-Gillum-not-guilty-lying-FBI.html",
    "content": [
        "Former Democratic Florida gubernatorial candidate Andrew Gillum was acquitted Thursday on charges of lying to the FBI But the federal jury hung on charges that Gillum funneled tens of thousands of dollars in campaign money to personal accountsGillum came within 34,000 votes in 2018 of becoming Florida's first black governor, being beaten by now GOP Gov. Ron DeSantis Former Florida Democratic candidate for governor Andrew Gillum, who came within a whisker of defeating Republican Ron DeSantis in 2018, was acquitted Thursday of lying to the FBI in a corruption case that also involved illegal use of campaign contributions.",
        "But the federal jury hung on charges that Gillum funneled tens of thousands of dollars in campaign money to personal accounts. Prosecutors said they will retry him on those counts. They had claimed Gillum was struggling financially after quitting his $120,000-a-year job with the People for the American Way group to run for governor.Gillum was acquitted of lying to undercover FBI agents posing as developers who paid for a 2016 trip he took with his brother to New York, including hotel rooms, meals, a boat tour and a ticket to the hit Broadway show 'Hamilton.'",
        "Outside the courthouse, Gillum thanked his family, wife, legal team and pastor for their support, but took a dig at prosecutors.'They have quite literally tried to take everything from us. And the beauty is in our system the powers that be don´t always get to decide. Everyday people like you and me sometimes get our swing at the ball,' he said.Asked about what comes next, Gillum said 'sleep' as he walked away from a gaggle of news reporters.Gillum had faced a potentially lengthy prison sentence if convicted, although, under federal sentencing guidelines, he would have likely gotten far less than the maximum.The jury came back hung for public relations executive and Gillum adviser, co-defendant Sharon Lettman-Hicks, in the case. ",
        "Prosecutors said they will also retry her.Gillum, 43, a former Tallahassee mayor, sought to become the first Black governor in Florida history when he took on DeSantis in 2018. Gillum lost by less than 34,000 votes to DeSantis, triggering an automatic recount. ",
        "After his loss, Gillum made headlines when he was found in March 2020 in a Miami Beach hotel room where a man was suffering from a possible drug overdose. The man was later identified as an escort. Officers tried speaking with Gillum but were unable to comprehend him due to his 'due to his inebriated state,' a report from the Miami Beach Police Department said. Police said they impounded three bags that 'containing suspected crystal meth.' Gillum denied that he was using drugs, but after the incident checked himself into rehab for alcoholism.  In September 2020, Gillum came out as bisexual.'To be very honest with you, when you didn't ask the question, you put it out there, is whether or not I identify as gay,' he told talk show host Tamron Hall. 'And the answer is, I don't identify as gay, but I do identify as bisexual. And that is something that I have never shared publicly before.''The truth is, is that, Tamron, everyone believes the absolute worst about that day,' Gillum said. 'At this stage, I don't have anything else to have to conceal.' "
    ]
}