{
    "articleURL": "/news/article-12054219/New-York-Times-claims-King-Charles-Coronation-arrived-little-fanfare-cringing-discomfort.html",
    "content": [
        "News outlets from Europe to America ran coverage of the pomp and ceremonyBut the New York Times claimed the coronation was a 'cringing discomfort'The eyes of the world have been firmly focused on the United Kingdom today as Charles III was crowned King in the historic first coronation of a British monarch in 70 years.",
        "Papers from Europe to America and Australia ran coverage of the pomp and ceremony while international broadcasters beamed pictures of the pageantry into televisions back home.But not all of the world's media recognised the profound and historic event. The New York Times decided to use the seminal moment in British history to call on 'efforts to cut ties' between the monarchy and the Commonwealth nations.In their attempt to sum up today's 1,000-year-old ceremony, the American paper labelled the coronation a 'cringing discomfort' and claimed it 'arrived with little fanfare'.It is not the first time The New York Times has engaged in some Britain bashing, having previously been forced into an embarrassing apology after publishing an incorrect attack on the Royal Family during coverage of Queen Elizabeth II's funeral last year. ",
        "In an article published ahead of the coronation today, the American paper claimed that 'relations between the British monarchy and its distant realms has come to an end'.",
        "The Times claimed Charles III has been placed in a 'vexing position' that he was on a 'volatile fault line'.On a day when Britain's best was put on display for the world to see - fit with military processions, ancient royal carriages, and traditions that date back ceremonies - the paper then said Britain's 'history tends to be romanticised'.",
        "Then, to only add further to it's blotting of Britain, the paper tried to claim that the 'coronation arrived with little fanfare, and some cringing discomfort'.This comes less than a year after The New York Times faced a bombardment of backlash over its coverage of Queen Elizabeth II's funeral, that led some readers threatening to end their subscriptions.At the time, the paper described Queen Elizabeth's funeral as a 'hefty price tag' for taxpayers amid rampant inflation and a cost of living crisis in the UK.It estimated that the state funeral would cost around £6million, claiming the figure would add to the financial issues currently faced by British families. But after it was revealed that the actual cost per household in Britain will be just five pence, the paper was forced into an embarrassing apology.",
        "America's 'paper of record' has long been accused of displaying a haughty ignorance of the reality of life in the UK, with reports in recent years suggesting Brits spend their time 'cavorting in swamps' and, until recently, existed on a diet of 'porridge and boiled mutton'.The New York Times has sought to paint a bleak picture of the UK in much of its other reporting too, having previously described the NHS as on 'life support', public transport 'spluttering' and food banks 'at breaking point'.",
        "The same article praised the RMT's strike-mad Mick Lynch as 'an unlikely national hero', despite him having spent months trying to bring the country to a grinding halt.Elsewhere, in some of its other content, the paper's cooking publication tried to extolling the virtues of the crisp sandwich.Many Brits mocked The New York Times' Cooking account for the Kenji López-Alt recipe for Tuna Melt which advised that any sandwich can be improved with the addition of the salty snack.If sticking its nose into British culinary favourites once wasn't enough, The New York Times tried to claim last month that toad-in-the-hole is eggs on toast.Their bizarre recipe - adapted from one by top US chef Kyle Connaughton - claimed to be a 'homage' to London chef Heston Blumenthal. The toast had a hole in the middle - seemingly in an attempt to justify the use of the name. The recipe did not contain sausages cooked in batter. Despite The New York Times' dampening of today's coronation - and of Britain in general - many of the rest of the world's news publications recognised the historic and seminal event.",
        "CNN devoted intense coverage to the proceedings. Fox News also ran detailed recounts and up-to-date news of the event.The New York Post splashed their website with the headline: 'God save the King'. ",
        "It was a similar case across Europe, with outlets paying homage to the new King and Queen Consort and devoting their leading coverage to the pomp and ceremony. German newspaper Bild praised the King, splashing their website with 'Finally King at 74. This is the crowning glory'.The paper described the 'sweetheart' moment the King and Queen shared together as they were each crowned.The coronation 'brought the Royal Family closer together again', the paper said, writing that 'Charles seemed relaxed, focused and moved on the most important day of his life.'Charles III was recently praised for his visit to Germany earlier this year where he gave a speech in German.Australia's Sydney Morning Herald said it was a day when the King 'fulfilled his destiny' in a 'ceremony that drew on a millennium of British history.'The paper Down-Under noted how the 'monarchy balances ancient tradition and 21st-century values'."
    ]
}