{
    "articleURL": "/wires/aap/article-12047965/PM-says-UK-free-trade-agreement-starts-May.html",
    "content": [
        "A historic free trade agreement between Australia and Britain will come into force at the end of the month after an extended process pushed back by leadership instability in London.",
        "Under the deal, there will be no tariffs on almost all Australian goods exported to the UK and more Australians will be eligible for lengthier working holidays in the country.The agreement following Brexit will strip taxes on billions of dollars worth of goods, including beef, sheep meat, dairy and sugar.It will come into effect on May 31.After two years, there would be no tariffs on 99 per cent of Australian exports to the UK, which are worth some $9.2 billion.The same would apply to UK products arriving in Australia.After the same phase-in, Australians will be able to apply for working holidays in the UK to the age of 35 - up from 30 - and stay a maximum of three years instead of two.The deal will also allow Indigenous Australians to receive royalties when their artwork is resold in the UK.The UK high commissioner in Australia said the benefits will flow through as soon as June.\"So there should be an immediate impact on a number of goods coming into each other's country,\" Vicki Treadell told AAP.Ms Treadell said other aspects of the agreement such as the mobility visa changes could take a little longer given they require legislative change.She added the next step would be to boost two-way investment.",
        "\"Our consumer base is huge and the potential for yet more excellent Australian produce, products going into the UK, there will be a huge appetite.\"Prime Minister Anthony Albanese said the agreement was about greater market access for Australian businesses.He said slashing tariffs would also lead to cheaper products, which would put downward pressure on inflation.\"So the imports we get from the UK, if you cut the taxes and cut the tariffs, then they are by definition cheaper and that will have a positive impact on our economy,\" he said during a visit to an Australian-themed restaurant in London's Paddington.Farmers have welcomed the news as the \"win we have been waiting for\".\"The promise of quota tariffs being eliminated now and in the near future is like fertiliser for our economy and a relief for farm businesses struggling with rising input costs,\" National Farmers' Federation chief Tony Mahar told AAP.Winegrowers are also raising a glass, with the UK regarded as Australia's second-largest export market.\"For wine, the agreement will see the elimination of import tariffs on entry come into force,\" said Lee McLean from Australian Grape and Wine.\"The tariff elimination represents a saving of approximately $50 million per year for the Australian wine sector,\" he told AAP.",
        "Canegrowers also say the agreement will be worth millions to their industry.\"This is a valuable opportunity for Australian sugar,\" said Canegrowers chief executive Dan Galligan.\"It gives us access to a market we haven't been in since the mid 70s.\""
    ]
}