{
    "articleURL": "/sport/football/article-12058935/Man-United-fans-believe-Red-Devils-stars-David-Gea.html",
    "content": [
        "Man United supporters believe players are becoming fed up with David de GeaDe Gea made a costly mistake that saw West Ham inflict a 1-0 defeat on SundayMarcus Rashford cut a frustrated figure after De Gea's failed save attempt Manchester United supporters are growing tired of David de Gea's mistakes costing them points in the Premier League's top four race and it appears some of his team-mates are as well.",
        "De Gea's latest error saw him fail to stop West Ham forward Said Benrahma's weak long-range effort as the ball hit his hand but still trickled into the net.The Hammers would go on to secure a 1-0 win that virtually guarantees their Premier League safety and dragging United further into a Champions League qualification race with Liverpool who sit just one point behind them.Benrahma's 27th minute strike devastated United supporters, players, and Erik ten Hag with De Gea also seeming to comprehend his mistake as he lay face down in the turf.Marcus Rashford failed to hide his disappointment at the goalkeeper's latest gaffe as he turned to face Ten Hag and cut a exasperated expression with his hands on top of his head in disbelief at what had happened.",
        "Ten Hag looks back as he tries to consolidate De Gea's mistake and attempts to plan a way back into the game for his struggling side that were unable to find an equaliser.Eagled-eyed onlookers that saw Rashford's reaction believe that it shows frustration with De Gea is building in the Man United dressing room.One fan posted online: 'That was my reaction too. I couldn't believe it. It's almost like De Gea spilled it on purpose the ball was so slow.",
        "Another added: 'It’s demoralising to players when keepers make a mess of what appears to be a routine save.'However, Ten Hag backed his under-fire goalkeeper after the game and revealed that he wants to extend De Gea's Old Trafford tenure.The Spaniard made his 540th appearance between the sticks for United on Sunday to overtake Alex Stepney's previously held 45-year record.",
        "Speaking after the match, Ten Hag battled back against suggestions that he should look for a new number one.'We want him to stay and we want him to extend his contract,' Ten Hag said. 'He has the most clean sheets in the Premier League. We would not be here in this position without him.'I believe there are no concerns. It happens. As a team, you have to deal with it, show character, be resilient, bounce back and that's what this team will do,' he added."
    ]
}