{
    "articleURL": "/sport/football/article-12051489/Diego-Maradona-thanks-Napoli-players-Instagram-Serie-title-win.html",
    "content": [
        "Napoli won their first Scudetto since 1990 following 1-1 draw away to UdineseIt sparked wild scenes of celebration across Naples as thousands partiedClub icon Diego Maradona's Instagram account hailed the historic achievement Football legend Diego Maradona has 'thanked' Napoli for winning the Serie A title 33 years after he guided them to glory.",
        "Maradona, who died aged 60 in November 2020, is still worshipped in Naples for inspiring the club to the Scudetto in 1987 and 1990.After a lengthy and often agonising wait, Napoli's current crop of players finally won the championship again, sparking wild celebrations across the city on Thursday night.They sealed the title with a 1-1 draw at Udinese, with their leading goalscorer Victor Osimhen scoring the second-half equaliser that got them over the line with five games to spare.The official Maradona Instagram account posted an eye-catching graphic showing Napoli's feted No 10 climbing a set of blue steps bearing the names of the current squad.",
        "The post read: 'A new date to remember, a new joy for the city, for the people, for the history. Thank you to all of you guys! Come on Napoli.'An earlier post compared the street celebrations in Naples from 1987 and 2023, saying: 'Yesterday and today. The same city, the same happiness.'Thousands of jubilant Napoli fans flooded onto the city's streets after the draw in Udine secured the championship on Thursday night.They set off flares and fireworks long into the night in a party 33 years in the making. Maradona played for the club between 1984 and 1991, scoring 115 goals in 259 matches.",
        "That successful spell saw the club win the league twice, as well as the Coppa Italia in 1986-87 and the UEFA Cup in 1988-89.As emotions spilled over, more than 200 people were injured in the celebrations with a 26-year-old man shot dead in an incident police said was 'completely unconnected'.Vincenzo Constanzo was a member of the D'Amico crime family which had been involved in a bitter feud with another clan.",
        "Naples police chief Claudio Palomba said at least seven bullets had been fired and all indications were it was a hit as part of gang violence between members of the Camorra, the organised crime group based in the city.Costanzo was found on the ground bleeding heavily, along with three others, one of which was his girlfriend, and all were taken to a nearby hospital for treatment.Doctors battled to save Costanzo but he was declared dead while the others were treated for minor injuries and expected to be released from hospital in a few days.Later, medical authorities in Naples issued an updated report to say that an astonishing 203 people had been treated across the city following the title win.",
        "Officials said 22 were in a serious condition having suffered burns, head injuries, and broken bones after being hit by fireworks or falling from scooters and cars.",
        "Among those hurt were three police officers who were attacked as they tried to move crowds on, but they were not seriously injured.Thousands flooded into the main square of Naples at Piazza Plebiscito waving flags and banners, with many climbing up lamp posts and up onto balconies in their exuberance.Sixty thousand fans had packed into the sold-out Diego Maradona stadium to watch the game live on giant screens as it was beamed back from Udine 500 miles away."
    ]
}