{
    "articleURL": "/wires/reuters/article-12058695/We-afford-Turkeys-cost-living-crisis-threatens-Erdogans-election.html",
    "content": [
        "By Ali Kucukgocmen",
        "ISTANBUL, May 8 (Reuters) - Istanbul barber Hakim Ekinci, a long-time supporter of Tayyip Erdogan, won't be voting for the president next Sunday, blaming his economic policies for eroding Turks' purchasing power and leaving many unable to afford even basic foodstuff.Erdogan and his Islamist-rooted AK Party were able to maintain their voter base, made up mainly of lower-income, conservative Muslim Turks, thanks to strong economic growth in the first 10 years of his rule.But a cost-of-living crisis sparked by Erdogan's unorthodox economic programme over the past 1-1/2 years has eroded his popularity, posing the biggest electoral challenge to his 20-year hold on power.Some polls show Erdogan trailing his main opponent Kemal Kilicdaroglu ahead of Sunday's first round vote - although the gap has recently narrowed. The parliamentary race remains on a razor edge, with the opposition seen potentially clinching a narrow majority.\"We used to be able to buy three to four bags of groceries for 150-200 lira ($7.7-$10). My wife and I could hardly carry them. Now we can barely fill two bags,\" said Ekinci, 63, pausing to clip a customer's hair in his salon in Istanbul's Besiktas district.\"I'd say those responsible are the ones governing us. I think it is the wrong decisions they have taken. I used to be an AKP supporter but I'm not thinking of voting for them.\"",
        "Ekinci's views are representative of millions of Turks, who have had to deal with runaway inflation for years. Food prices surged 54% year-on-year in April, with headline inflation dropping to 43.7% after peaking in October at 85.5%, the highest under Erdogan's rule.Annual inflation has remained in double digits for nearly all of the five years since general elections in 2018. It began to surge after a currency crisis in late 2021, sparked by a series of interest rate cuts, in line with Erdogan's unorthodox views.Ekinci said he began to question his support for the president and the AKP due to economic reasons shortly after the 2018 elections and made a definite decision not to vote for them after the currency crisis in 2021.The Turkish lira lost 44% in 2021 and 30% in 2022. It has shed 76% under Erdogan's second term as president, marked by several currency crises due to unorthodox policies, geopolitical developments such as the Ukraine war and disputes between Ankara and Washington.\"The exchange rate is uncontrollable. We can't afford anything. Nothing they said has held, therefore they do not inspire any confidence,\" Ekinci said.WORDS AND ACTIONThe barber works by himself after having to lay off his two staff and said he cannot secure any bank loans despite the rate cuts as authorities limit consumer loans to anchor inflation. His foreign currency loans also multiplied in lira terms as the currency fell.",
        "But many AKP voters still believe only Erdogan can fix the economy, or blame other factors for its current state. Istanbul resident Halime Duman said people raising prices to make bigger profits were to blame for the soaring cost of living. \"(Erdogan) can solve it with a flick of his wrist,\" she said, taking a break from shopping at a farmers' market in central Istanbul. The opposition, including Kilicdaroglu's opposition alliance, is all talk, in her opinion.\"They don't take action,\" she said.Birol Baskan, an author and political analyst not affiliated with any party, said even \"hardcore\" Erdogan supporters don't deny that the economy is not doing as well as it did earlier in his rule.\"The reason why this party kept winning was because it delivered to voters certain material benefits. This is the first time that magic seems not to be working because of the economy, because of the high inflation (and) increasing cost of living.\"\"It badly hurt people's pocket and that's why I guess winning this election is no longer so assured.\"'NOTHING BUT HUNGER'Some voters are not confident that the opposition would immediately alleviate economic concerns either. Talat Gul, a marble mason, has never voted for the AKP or its allies. He currently sees \"nothing but hunger\" around him, but doubts things will quickly change for the better if the opposition wins.",
        "\"They have created in the last 21 years a Turkey that cannot be changed. It will take 20 years to recover, whoever comes to power. But I just want (Erdogan) to go,\" he said, walking around the farmers' market.Ekinci, the barber, has yet to decide whom to vote for among the three candidates standing against Erdogan. \"(Kilicdaroglu) may be an honest person... but they have not announced anything to convince me,\" he said.\"I want the dollar exchange rate to decline (after the elections). I want the price of petrol to fall. I want inflation to fall,\" Ekinci said.\"I want to go back to my life of five or six years ago. I want to be able to go on a picnic, travel abroad.\" ($1 = 19.4961 liras) (Reporting by Ali Kucukgocmen; Additional reporting by Jonathan Spicer and Birsen Altayli; Editing by Susan Fenton)"
    ]
}