{
    "articleURL": "/news/article-12042681/Skydiver-murdered-girlfriend-confronted-work-jailed-life.html",
    "content": [
        "Judge told Kemp as he was jailed: 'I do not accept you are genuinely remorseful' Ordered to serve at least 19 years behind bars and will be subject to prison recall A skydiver who murdered his girlfriend after she confronted him about the suspected rape of a teenage girl at work has been jailed for life.",
        "Ashley Kemp was jailed for a minimum of 19 years by a judge who told him he had shown 'nothing but self-pity to the end'.The 55-year-old was handed a life sentence for the murder of mother-of-three Clair Armstrong, 50, who was also a skydiving instructor and owned a beauty salon. Kemp, a sky diving instructor and pilot, placed his hands around Ms Armstrong's neck 'for what seemed like an eternity' so 'no one else could have her', it was heard.Judge John Thackray KC said the relationship was ending and Kemp had decided 'if you could not have her, nobody could'.",
        "The court heard how a teenager had made sexual allegations against the defendant which had led to him losing his job and put a huge strain on the couple's relationship.Sentencing him at Hull Crown Court, Judge Thackray said the circumstances of the attack at Ms Armstrong's home in Messingham, north Lincolnshire, were 'devastating, tragic and brutal'.He showed no emotion as the sentence was passed at Hull Crown Court this afternoon as members of victim Ms Armstrong's family sobbed in the public gallery.Earlier, Ms Armstrong's brother in law Ian Farrell said in a victim impact statement: 'On sixth of November 2022 our lives changed forever.'We received news which has shattered us all and left a huge hole in our lives that can never be filled.",
        "'Clair our beautiful sister and mum was tragically taken from us in such horrific circumstances that we will never accept or understand.'We miss her incredibly and regardless of what the person responsible for killing Clair receives as a punishment it will never ever be enough to ease our pain for losing her.'The day we lost Clair was the day our lives changed forever.'Recalling how Ms Armstrong was murdered in her own home, he continued: 'It was place where she should have felt safe.'But ultimately, it was where her safety was stolen from her by him,' he added, turning to look at Kemp in the secure dock, dressed in a suit and tie.Mr Farrell continued: 'It is unbearable to comprehend. Her youngest son, who at the age of 14, an age when he needs her most, has had his mum ripped from his life.'Since that horrible moment in November, we cannot remember a day in which we did not cry. We cannot remember a day when we laughed.",
        "'We cannot remember a day not filled with pain and heart ache. So many days are marred with sadness and will never be the same again.'Kemp admitted manslaughter but denied murder - leading to a six day trial at Grimsby Crown Court which ended with a guilty verdict on Tuesday last week.",
        "In his statement today, Mr Farrell continued: 'He did not have the decency to admit what he had done.'Sadly, he did not have the courage to do that. As a result, we sat through utterly horrific accounts and details about how Clair was taken from our lives.'We have heard accounts we will never be able to unhear We have seen images we can never unsee. We have heard lies we can never forgive but they will stay with us and haunt us forever.'As a family we will have to work out what life will look like without our beautiful sister and incredible mum. Currently, it is literally beyond comprehension and we can't bear to think about it.'Passing sentence, Judge John Thackray KC said he was satisfied that Kemp strangled Ms Armstrong 'so no else could have her' after she ordered him to pack his bags and leave her home.The couple had been dating for more than two years and had discussed marriage before Kemp was arrested at Leeds Bradford Airport last August, as they returned from holiday in Portugal.Kemp was accused of attempting to rape a teenage girl at the Drop Zone sky diving centre he was managing at Hibaldstow airfield, near Lincoln.Gym regular Ms Armstrong, 50, worked as a sky diving instructor at Drop Zone and also ran a beauty salon in her village of Messingham.",
        "Judge Kemp said: 'You committed the offence in the home of Clair, a place where she was entitled to feel safe and secure.'A great deal has been said in court, I emphasise wholly properly, about the devastating, tragic and brutal circumstances of the death of Clair Armstrong.'Her untimely death, coupled inevitably with the impact of what occurred on her family and those who were close to her, are a critical consideration.",
        "'No sentence I impose can give the sons of Clair their mother back. No sentence I impose can undo what you - Kemp -have done.'All I can do is impose what the law considers to be the appropriate sentence for a case of this nature.'I take account of the victim personal statement which describes better than I ever could the devastation that you have caused.'It is perhaps impossible to put into words how they feel but perhaps the statement which has been read out on behalf of the family, gives some indication of the devastation you have caused.'It describes there not being a single day when they do not cry, and not a day which is not filled with pain and heartache.'Clair Armstrong was a wholly blameless victim of a violent attack upon her, followed by her asphyxiation which culminated in her death.'",
        "He said Ms Armstrong 'had so much to live for', adding: 'She was obviously an impressive woman with her own business whilst also working as a skydiving instructor, in addition to her participation as part of a formation skydiving team. She was a much loved mother to three sons.'Kemp was fired for gross misconduct over the allegation and also lost his tied accommodation at Hibaldstow.The judge continued: 'She had generously given you a home when you lost your accommodation due to the sexual allegations .'The relationship had become strained and you must have known that it was close to being over. On the day in question, she had informed you that the relationship was finally over and that you must move out.'You decided that if you could not have her, nobody could and you launched a brutal attack upon her.'First, you struck her twice to the head, breaking her nose and causing an injury to her forehead. You then pinned her down and strangled her with such force that you broke her hyoid bone and the thyroid cartilage.'Injuries to her mouth indicated that you also smothered her mouth, no doubt to prevent her from screaming for help.'She was undoubtedly fighting for her life, evidenced by the injuries caused to your forehead and the fact that she had bitten her tongue. I reject your account that she was attacking you.",
        "'Whilst it is correct that she may well have lost consciousness during the process of strangulation, I have no doubt that the pain, suffering and undoubted terror prior to losing consciousness was in excess of a few moments.'I have no hesitation in concluding so that I am sure, that you intended to kill - although I accept it was a briefly held intention.'He also noted that Kemp had lied about the time of the murder. Kemp claimed in his 999 call in the early hours of Sunday November 6 2022 he had killed Ms Armstrong only two hours earlier.But the prosecution claimed she had died much earlier, possibly early on the Saturday morning when she stopped responding to WhatsApp messages from sky diving pals.The judge said Kemp had been caught on CCTV early on Saturday morning, with clear injuries to his face.The trial also heard that while Ms Armstrong was lying dead in bed, in a dressing gown and panties wrapped in a duvet, Kemp let the dogs out three times and wrote a suicide note.He was arrested eight miles away, standing dazed on a grass verge by a country lane after crashing his silver Nissan Qashqai into a tree.The judge was also satisfied Kemp disposed of her phone to hide damaging evidence on it - and said there were also other aggravating factors, adding:'First, this was domestic violence. That makes it more serious because of the breach of trust and because of her vulnerability.'Second, you concealed evidence by disposing of the phone. Third, you delayed reporting the death and lied as to when it occurred. Fourth, the offence was committed under the influence of alcohol.'The judge accepted Kemp had no previous convictions, the murder was not premeditated, and he was going through a difficult period.'But I do not accept that it significantly reduces your culpability. I do not accept that you are genuinely remorseful,' he added.'During your evidence, I detected nothing but self pity from beginning to end.'Jailing him for life, he ordered him to spend at least 19 years behind bars, minus 176 days on remand.Kemp, originally from Reading, met Ms Armstrong at the Drop Zone where she worked as a sky diving instructor and was also a member of the formation sky diving team.Mitigating, Mohammed Nawaz KC said: 'It is accepted by the defence that the actions of the defendant have caused untold loss and sorrow and it is difficult not to be moved by the sentiments of the family. This was a spur of the moment incident which led to this violence.'"
    ]
}