{
    "articleURL": "/wires/ap/article-12059897/Lawsuit-Yellen-ignore-unconstitutional-debt-limit.html",
    "content": [
        "WASHINGTON (AP) - A union of government employees on Monday sued Treasury Secretary Janet Yellen and President Joe Biden to try to stop them from complying with the law that limits the government's total debt, which the lawsuit contends is unconstitutional.",
        "The lawsuit comes just weeks before the government could default on the federal debt if Congress fails to raise the borrowing limit. Financial markets have become increasingly nervous about the potential for default, with economists warning that a failure to raise the debt limit could trigger a global financial crisis.On Tuesday, Biden will meet with the top Republicans and Democrats in Congress to seek a potential breakthrough. The two sides remain far apart. Republicans have demanded steep spending cuts as the price of agreeing to raise the debt limit. Biden has argued that the debt ceiling, which applies to borrowing the government has already done, shouldn't be used as leverage in budget talks.The lawsuit, filed by the National Association of Government Employees, says that if Yellen abides by the debt limit once it becomes binding, possibly next month, she would have to choose which federal obligations to actually pay. Some analysts have argued that the government could prioritize interest payments on Treasury securities. That would ensure that the United States wouldn't default on its securities, which have long been regarded as the safest investments in the world and are vital to global financial transactions.But under the Constitution, the lawsuit argues, the president and Treasury secretary have no authority to decide which payments to make because the Constitution grants spending power to Congress. Doing so, it contends, would violate the Constitution´s separation of powers.",
        "\"Nothing in the Constitution or any judicial decision interpreting the Constitution,\" the lawsuit states, \"allows Congress to leave unchecked discretion to the President to exercise the spending power vested in the legislative branch by canceling, suspending, or refusing to carry out spending already approved by Congress.\"",
        "White House and Treasury Department spokespeople declined to comment on the lawsuit Monday.The NAGE represents about 75,000 government employees who it says are at risk of being laid off or losing pay and benefits should Congress fail to raise the debt ceiling. The debt limit, currently $31.4 trillion, was reached in January. But Yellen has since used various accounting measures to avoid breaching it.Last week, Yellen warned that the debt limit would become binding as early as June 1, much earlier than many analyses had previously predicted, because tax receipts have come in lower than projected.Laurence Tribe, a law professor at Harvard University, suggested that \"it is possible that the Treasury Department would welcome the suit\" because it expresses the view that \"the ceiling is not a permissible bargaining tool for Congress to employ because it simply threatens to destroy the economy and hold the president hostage.\"Tribe has written a column in the New York Times expressing support for the idea that the debt ceiling is unconstitutional. White House aides have explored the notion of having the president invoke the 14th Amendment to the Constitution, which says the \"validity\" of the public debt \"shall not be questioned.\"",
        "How fast the lawsuit may advance through the legal system depends, in part, on the judge, Tribe noted. \"It could move extremely quickly,\" he said. \"It´s quite hard to predict.\"Richard Stearns, a federal judge who was nominated by President Bill Clinton, has been assigned to the case.Norm Eisen, a senior fellow in governance studies at the Brookings Institution, suggested that it may be \"up to the Supreme Court to determine whether there is a constitutional option to resolve this hostage crisis.\"\"If Congress is going to demonstrate this propensity for hostage taking,\" Eisen said, then \"a reallocation of authority in this dimension away from Congress\" may be called for.On Sunday, Yellen said there were \"no good options\" for the United States to avoid an economic \"calamity\" if the debt ceiling isn't raised. Economists say the standoff has distorted financial markets. Since Yellen warned a week ago that the government could default on its debt as early as June 1, interest rates on one-month Treasury bills have been shooting higher. They reached 5.35% Monday, up from 4.12% a week earlier - an unusually sharp move.That suggested that investors were shunning the one-month bills out of concern that they could suffer from a default. The one-month yield, in an unusual move, now exceeds the rates on all longer-dated Treasuries, including 10-year notes, which yield 3.49%. Typically, borrowers demand higher rates to lock up their money for longer periods. Rates on the 10-year have fallen because investors expect a recession later this year that would force the Federal Reserve to cut its benchmark rate.",
        "\"Markets are beginning to aggressively price in a potential default,\" said Joe Brusuelas, chief economist at tax advisory firm RSM. \"The timing of an economic and financial crisis caused by the political authority could not be any worse.\"In the wake of three large bank failures in the past two months, Brusuelas, like many economists, thinks many banks are pulling back on lending to bolster their finances, a trend that could weaken the economy.\"A partial or full default would exacerbate those trends and result in a pullback in spending and investment by households and firms, as well as an increase in unemployment,\" Brusuelas said. \"It would almost surely tip the economy into a full-blown recession.\""
    ]
}