{
    "articleURL": "/news/article-12039083/Bodhi-Mani-Risby-Jones-issues-groveling-apology-drunken-rampage-Indonesia.html",
    "content": [
        "Aussie man facing time behind barsAllegedly assaulted fisherman during drunken rampageHas issued grovelling apology from jail An Australian tradie accused of assaulting a fisherman during a drunken rampage while holidaying in Indonesia has issued a remorseful apology as he awaits his fate.",
        "Noosa man Bodhi Mani Risby-Jones, 23, from Queensland's Sunshine Coast, faces years in an Indonesian prison and a public caning.The carpenter has just spent his fifth night in a tiny 3x3 metre cement cell on the island of Simeulue, off the coast of Sumatra, in the ultra-conservative Aceh province.He was on a three-week surfing holiday on the island when he allegedly went on late night drunken rampage where he allegedly threw a motorcycle at a fisherman.Footage has emerged of a remorseful Risby-Jones dressed in orange prison clothes sporting a wry smile, being led from his cell to issue a grovelling apology to camera.",
        "'To the victim's family and the victim, I am extremely sorry,' he said.'My actions I can't even fathom. I really want to make it right, and fix the issue. I am sorry.'Risby-Jones also places his hands together and bows his head in a prayer motion.Aceh operates under a Sharia-based legal system, and alcohol consumption is banned.Police allege he had been drinking vodka in his hotel room at the Moon Beach Resort when he emerged without any clothes just after midnight last Thursday.Simeulue police chief Senior Commissioner Jatmiko alleged Mr Risby-Jones hit a security guard in the neck, causing him to fall to the ground, as he left the hotel.",
        "He is then alleged to have hit passing motorbike riders on the street, knocking one man to the ground where his bike fell on him causing a serious leg injury. Angered locals then chased him to the beach where they held him down and tied his arms while police were called.Police investigations are continuing.The fisherman who was alleged assaulted required 50 stitches. A potential meeting between Risby-Jones and the alleged victim could be organised to reach a reconciliation."
    ]
}