{
    "articleURL": "/wires/reuters/article-12047041/US-weekly-jobless-claims-rise-labor-costs-surge-productivity-slumps.html",
    "content": [
        "Weekly jobless claims increase 13,000 to 242,000",
        "Continuing claims drop 38,000 to 1.805 millionProductivity falls at 2.7% rate in first quarterBy Lucia MutikaniWASHINGTON, May 4 (Reuters) - The number of Americans filing new claims for jobless benefits increased last week as the labor market gradually softens amid higher interest rates, which are cooling demand in the economy.But borrowing costs could remain elevated for a while, with other data on Thursday showing labor costs surged in the first quarter as worker productivity slumped.The Federal Reserve raised its benchmark overnight interest rate by another 25 basis points to the 5.00%-5.25% range on Wednesday, and signaled it may pause further increases, though it kept a hawkish bias. The Fed has hiked its policy rate by 500 basis points since March 2022.\"Labor markets continue to experience exceptionally tight conditions, but the now-sustained increase in claims and potential further uptrend as a result of spreading layoff announcements could be the first steps along a path to more balanced labor market conditions,\" said Stuart Hoffman, senior economic advisor at PNC Financial in Pittsburgh, Pennsylvania.Initial claims for state unemployment benefits rose 13,000 to a seasonally adjusted 242,000 for the week ended April 29. Economists polled by Reuters had forecast 240,000 claims for the latest week. Unadjusted claims fell 5,518 to 219,619 last week.",
        "There was a surge in filings in Kentucky and Massachusetts as well as a notable gain in California, which offset a plunge of 9,358 in New York as the boost to claims in the state from spring breaks was unwound.Claims have been stuck in the upper end of their 194,000-247,000 range this year, reflecting a rise in layoffs as the lagged and cumulative effects of the U.S. central bank's fastest interest rate hiking campaign since the 1980s start to be felt beyond the housing market and technology sector.Nevertheless, the labor market remains tight. There were 1.6 job openings for every unemployed person in March, the government reported on Tuesday, well above the 1.0-1.2 range that economists say is consistent with a jobs market that is not generating too much inflation.Fed Chair Jerome Powell told a press conference on Wednesday that \"the labor market remains very tight,\" but noted there were \"some signs that supply and demand in the labor market are coming back into better balance.\"The number of people receiving benefits after an initial week of aid, a proxy for hiring, fell 38,000 to 1.805 million during the week ending April 22, the claims report showed. That was the largest drop in the so-called continuing claims since last July, suggesting that some of the laid-off workers are quickly finding employment.",
        "Stocks on Wall Street were trading lower. The dollar gained versus a basket of currencies. U.S. Treasury prices fell.LAYOFFS RISINGThe claims report has no bearing on the government's closely watched employment report for April, which is scheduled to be released on Friday, as it falls outside the survey period.According to a Reuters survey of economists, nonfarm payrolls likely increased by 180,000 jobs last month after rising by 236,000 in March. The unemployment rate is forecast to have climbed to 3.6% from 3.5% in March.A separate report from global outplacement firm Challenger, Gray &amp;amp; Christmas on Thursday showed U.S.-based employers announced 66,995 job cuts in April, down 25% from March. Layoffs, however, jumped 176% compared to April of last year.Though the labor market is loosening, which could help to slow wage growth, declining worker productivity is likely to keep inflation pressures strong.Nonfarm productivity, which measures hourly output per worker, dropped at a 2.7% annualized rate in the first quarter after increasing at a 1.6% pace in the October-December period, the Labor Department said in another report on Thursday.Economists had forecast productivity would decline at a 1.8% rate. It decreased at a 0.9% pace from a year ago, marking the fifth quarter that productivity fell on a year-on-year basis, the longest such stretch since the series started in 1948.",
        "During the current business cycle, starting in the fourth quarter of 2019, labor productivity has grown at an annual rate of 1.1%, which the Labor Department's Bureau of Labor Statistics, which produces the report, described as \"a historically low productivity growth rate.\"The BLS noted that \"no other previous business cycle had lower productivity growth, except for the brief six-quarter cycle from 1980 Q1 to 1981 Q3, which exhibited 1.0% growth.\"Unit labor costs - the price of labor per single unit of output - surged at a 6.3% rate after increasing at a 3.3% pace in the fourth quarter. Unit labor costs rose at 5.8% rate from a year ago. Labor costs are rising too quickly to be consistent with the Fed's 2% inflation target.\"The Fed's potential rate pause is entirely conditional on making further progress in reducing inflation pressures,\" said Sal Guatieri, a senior economist at BMO Capital Markets in Toronto. \"Today's report marked the exact opposite.\"(Reporting by Lucia Mutikani; Editing by Paul Simao)"
    ]
}