{
    "articleURL": "/wires/reuters/article-12040235/Singapores-Keppel-asset-manager-focusing-green-energy.html",
    "content": [
        "Operations to be divided into three units",
        "Targets S$100 bln in assets under management by 2026-endExpects annual savings of up to S$70 mln by 2026 from restructureTargets up to S$12 bln in asset monetisation by 2026-end(Adds Temasek's response in the eighth paragraph)By Sameer Manekar and Yantoultra NguiSINGAPORE, May 3 (Reuters) - Singapore's Keppel Corp said on Wednesday it would transform itself into an asset manager overseeing $150 billion by 2030 and focusing on green energy, betting it would provide more stable revenue streams and earnings.The plan, which would quadruple its managed assets and see it operate more like Canada's Brookfield Asset Management and Australia's Macquarie Group Ltd, marks a new chapter for Keppel, which traces its roots to a small ship repair yard corporatised in 1968.It sold its core offshore and marine business to local peer Semcorp Marine for S$4.5 billion ($3.4 billion) earlier this year.\"We see Keppel positioning as a global asset manager, much like a Blackrock, but for alternative real assets or estates. Fund management will be front and centre to build and grow recurring income,\" said Peggy Mak, a research manager at Phillip Securities.The conglomerate with an $8.5 billion market value, which has operations ranging from data centres to renewable energy assets, will be divided into fund management, investment, and operating platforms under the restructuring.",
        "\"Keppel has a strong track record in the development and operation of real assets, such as renewables, clean energy, decarbonisation and environmental management solutions, green buildings as well as digital connectivity infrastructure,\" Keppel CEO Loh Chin Hua said in a statement.A growing pool of investors including sovereign wealth funds and pension funds are interested in allocating more capital to alternative assets, said Loh, who has been at the helm since 2014. \"With our strong capabilities in these areas... we can play to our strengths.\"Singapore state investor Temasek Holdings is Keppel's largest shareholder with a 21% stake. Temasek said it has no comment on Keppel's announcement when contacted by Reuters on Wednesday.Mak said Keppel's plan to regroup into three horizontal business divisions would differentiate it from Temasek which works mainly as a financial investor.Keppel plans for a four-fold rise in assets under management (AUM) to S$200 billion by 2030, with an interim target of achieving S$100 billion worth of AUM by 2026-end.Loh told Reuters most of Keppel's assets were in the Asia Pacific but over time, it aims to be more global.\"We expect our presence in Europe and US to grow.\"The company said the shake-up could result in annual savings of between S$60 million and S$70 million by 2026, including from centralising support functions.",
        "The firm is now targeting between S$10 billion to S$12 billion in cumulative asset monetisation by 2026-end. It has already achieved asset monetisation of S$4.9 billion as at end of first-quarter of fiscal 2023 since the program was launched in late 2020.Shares in Keppel rose 2.9% on Wednesday, beating a 0.8% drop in the wider market. The shares are 32.5% higher since the start of the year, boosted by simplifying its business, mainly through asset sales.As a conglomerate, Keppel is trading at a discount to the sum of its parts, Citi analyst Brandon Lee said in a note, with the new structure expected to narrow the gap.Analysts also expected more vigorous scrutiny from investors into its investment returns after the shakeup.\"Overall, we think Keppel's focus has pivoted from asset gathering to asset optimisation which is good for balance sheet,\" Mak said. ($1 = 1.3336 Singapore dollars) (Reporting by Sameer Manekar in Bengaluru and Yantoultra Ngui and Chen Lin in Singapore; Writing by Miyoung Kim; Editing by Uttaresh Venkateshwaran, Jamie Freed and Louise Heavens)"
    ]
}