{
    "articleURL": "/tvshowbiz/article-12046175/Jake-Paul-packs-PDA-girlfriend-Jutta-Leerdam-share-loved-snaps.html",
    "content": [
        "Jake Paul packed on the PDA with girlfriend Jutta Leerdam on Thursday as they shared a kiss while posing for Instagram snaps. ",
        "The Youtuber-turned-boxer, 26, cosied up to the Dutch athlete, 24, in a series of loved-up photos as she took a break from training.  Hailed as the 'world's hottest speedskater' by media in Holland, Jutta was first linked to Jake last month, when the pair reportedly packed on the PDA during a dinner date in Miami.Jutta looked the part in a black and yellow team racing suit which she donned with a matching safety helmet and sunglasses. She was spotted skating around with her long blonde tresses pulled back in a low ponytail while her new beau ran alongside her. ",
        "Jake cut a casual figure in a pair of black shorts, a white hoodie and a pair of bright pink trainers. The couple stopped as the boxer placed his hands on the athletes waist and they looked completely smitten with one another as they locked lips. Jutta penned: 'Hard work &amp; the best support'. She also took to her Instagram Story where she shared a snap of the couple posing for a lift mirror selfie while kissing in matching white dressing gowns. She wrote: 'Happiest @jakepaul'.Jake and Jutta were first linked last month when TMZ reported they were getting cosy at LPM restaurant in Miami. The boxer reportedly met Jutta through Instagram late last year and the two began talking over the past couple of months.",
        "Things eventually evolved when they began spending time in Florida together recently, according to the outlet.",
        "The new romance comes after Paul and his ex-girlfriend, Julia Rose, split in late 2022 after dating on-and-off for years.The Dutch athlete won a gold medal in the 1000m race at the ISU Speed Skating World Cup in Calgary in December.She took first place in the 1000m race, her fourth consecutive top finish in the event.Speaking about their rumoured relationship, a source told De Telegraaf last month: 'They've been in contact with each other for months. It originated through Instagram.'Jutta was already in Miami a few weeks ago… she is now back in Miami for a Jake Paul show. Then she returns home without him.'Jutta has only recently got out of a relationship, and was with fellow speed-skater Koe Verweij until last summer.In December, she said: 'I'm having fun, although I'm not the type to stay single for the rest of my life.'It's fine for now but in the end I like to really build a relationship with someone. I still have a lot of love to give.'",
        "Jutta - who boasts over four million Instagram followers - is an influencer outside of her sport, with brand partnerships and other fashion and beauty-based projects.",
        "Last June, she took to Instagram to share her cover of ELLE Netherlands.Jake, meanwhile, has been spending time in Florida after his split decision loss to Tommy Fury in February.Tommy took on Jake in the highly-anticipated professional fight, taking the win as the pair made it through all eight rounds to a judges vote.The new dad was the rightful winner in the end - with the judges calling the fight 76-73, 76-73, 74-75 in his favour - but with a point deduction and a knockdown against his name, it was far from plain sailing.It marked Jake's first career loss, as he was previously 6-0 in his professional fighting career going into his bout with Tommy in Saudi Arabia.Following the loss, Jake vowed to return to the ring but did not disclose any plans for his next fight."
    ]
}