{
    "articleURL": "/news/article-12041177/Sainsburys-shoppers-outraged-barriers-force-scan-receipts-leave.html",
    "content": [
        "Sainsbury's shoppers were outraged by the supermarket's new barriers Has receipt scanning appeared local to you? E-mail louis.goss@mailonline.co.uk Sainsbury's shoppers have slammed the supermarket giant for installing security gates that force them to scan their receipts at self-checkout tills before being allowed to exit.",
        "The barriers block customers from leaving Sainsbury's shops until they scan their receipts.Customers leaving the store empty handed must instead ask Sainsbury's security to let them out the shop. The supermarket's customers reacted with fury as the shop pushed ahead with installing the blockades in its UK shops. Shoppers hit out at the British firm as they said the barriers put innocent customers 'under suspicion of stealing'. ",
        "The first howls of outrage were heard in December when shoppers first noticed the change. But now more are voicing their anger online as the system is rolled out to more branches across the country, including in Balham in South London and Winnersh in Berkshire. ",
        "E-mail louis.goss@mailonline.co.uk ",
        "The barriers have also been deployed in other major shops and supermarkets, including Aldi, Morrisons, and Primark.They first started appearing in British shops at the end of last year, having also been spotted in shops in Europe.  Customers slammed the shop's new security measures as they compared the experience to 'entrapment' and being treated like a 'prisoner'.Shoppers also hit out at the gates for slowing down their shopping trips as they complained about having to find their receipts to exit. A Sainsbury's spokesperson told MailOnline the gates are used in a 'small number' of its store's 'self service checkout areas' ",
        "The supermarket, however, refused to give over information as to the total number of gates it has installed across the country. The Sainsbury's spokesperson noted the exit barriers form part of a 'range of security measures.' Sainsbury's decision to install the exit barriers comes as shoplifting has surged over the previous year in the face of Britain's cost-of-living crisis. ",
        "Shoplifting increased by 22 per cent in the year ending in September 2022, figures from the Office for National Statistics show. UK food costs also soared at their fastest rates since 1977, over the past 12 months, as record inflation pushed up prices. This saw cucumber prices jump 52%, olive oil prices surge 49%, and cheese costs increase by 44% in a single year.  Customer theft in turn cost UK retailers £953 million in the year running from 1 April 2021 to 31 March 2022, data from the British Retail Consortium show. Shop owners responded by spending £722 million on tackling customer theft over the same period of time, the figures from the BRC's 2023 Crime Survey show. Has receipt scanning appeared local to you? E-mail louis.goss@mailonline.co.uk"
    ]
}