{
    "articleURL": "/wires/reuters/article-12038533/As-lithium-miners-gear-Q1-earnings-investors-focus-tumbling-prices.html",
    "content": [
        "By Arshreet Singh",
        "April 30 (Reuters) - U.S. lithium miners Albemarle and Livent are expected to report a rise in quarterly profit this week, but investor focus will likely be on how they plan to navigate the slide in prices for the metal used in electric-vehicle batteries.Strong demand for EVs and limited supply of the metal pushed lithium prices to record levels in November last year, soaring more than ten-fold from early 2021.But a slump in demand for electric vehicles in China, the world's biggest market, left a stockpile of the metal and drove prices down.Lithium prices have fallen by at least a third in the first quarter, according to an index tracked by Benchmark Mineral Intelligence, raising concerns miners will see a hit to their bottomline.Earnings of Albemarle and Livent in the first quarter, however, are expected to reflect \"peak spot price conditions\" as the producers settled their lithium contracts before the steep fall in prices, according to Seth Goldstein, an analyst at Morningstar.Though falling spot prices have raised red flags for investors over the long-term outlook of lithium miners, analysts believe spot prices will rise again as we get closer to the end of the year.\"We expect pricing to find a bottom through the course of 2023 on the back of strong demand,\" said Reg Spencer of Canaccord Genuity.",
        "In the long run, supply will continue to fall short of demand, which will help the miners, he added. QUARTERLY PROFITAlbemarle's net income is expected to rise 311% from a year earlier, while rival Livent is likely to report a 111% increase, according to Refinitiv data.Albemarle, which supplies many of the world's automakers, including Tesla Inc, is likely to see some impact from lower prices in the first quarter as \"a subset of their contracts are on monthly status,\" said Aleksey Yefremov, an analyst with KeyBanc Capital Markets.Livent is expected to report first-quarter results on May 2 and Albemarle on May 3.(Reporting by Arshreet Singh; Editing by Krishna Chandra Eluri)"
    ]
}