{
    "articleURL": "/wires/ap/article-12061329/Forte-placed-KY-veterinary-list-clouding-Preakness-plans.html",
    "content": [
        "LOUISVILLE, Ky. (AP) - Kentucky racing officials have placed scratched Kentucky Derby favorite Forte on a mandatory 14-day veterinary list that may require the colt to pass a soundness test in Maryland in order to race in the Preakness.",
        "The Kentucky Horse Racing Commission announced the update on Monday, two days after its veterinarians scratched the early 3-1 choice hours ahead of the Derby during a morning soundness check because of concerns about a bruised right foot. A KHRC release cited HISA Rule 2241a in placing Forte on the list and stated that the Todd Pletcher-trained colt must perform a \"satisfactory workout\" for a state veterinarian and have a negative blood sample to be removed.That means Maryland veterinarians may need to be convinced that Forte is able to race in the second jewel of racing's Triple Crown on May 20 in Baltimore.Medina Spirit failed a post-race drug test after winning the 2021 Kentucky Derby and had to meet a similar requirement to compete in the Preakness, where he finished third.A message sent to representatives of 1/ST Racing and the Maryland Jockey Club seeking clarity was not immediately returned.Forte was expected to lead a 19-horse Derby field at Churchill Downs before becoming the fifth scratch in the days immediately leading up to the marquee race.",
        "It was the first time that many entrants were scratched since 1936 and came amidst seven horse deaths recently from incidents before the Derby that has brought scrutiny to thoroughbred racing.Mage won the Derby at 15-1 odds.",
        "A disappointed Pletcher expressed his belief on Sunday that Forte would´ve performed well in the Derby before adding, \"Unfortunately, that wasn´t an option.\"Forte galloped Monday morning at Churchill Downs and is expected to work on Friday or Saturday, according to a tweet and video from the Kentucky Horsemen´s Benevolent and Protective Association.___AP sports: https://apnews.com/hub/sports and https://twitter.com/AP_Sports"
    ]
}