{
    "articleURL": "/sport/football/article-12054725/THE-NOTEBOOK-Dominic-Solankes-resurgence-continues-NGolo-Kante-impresses-Chelsea.html",
    "content": [
        "REPORT: Frank Lampard FINALLY gets his first win as Chelsea's interim bossDominic Solanke struggled after leaving Chelsea but he's now thriving againKante was involved around Bournemouth area every bit as much as his own halfChelsea secured their first win under Frank Lampard's second reign at the club after beating Bournemouth 3-1 at the Vitality Stadium. ",
        "The Blues took the lead after just nine minutes through Conor Gallagher's header following a cross from N'Golo Kante. Bournemouth got back on level terms in the 21st minute, with Matias Vina scoring a stunning curler from the edge of the box. But it was two late goals from January signings Benoit Badiashile and Joao Felix that ensured Chelsea picked up their first three points since March 11. Mail Sport's Riath Al-Samarrai takes a look at some of the things you may have missed. ",
        "DOMINIC SOLANKE'S RESURGENCE Chelsea’s loss has been Bournemouth’s gain in the slowly evolving fortunes of Dominic Solanke. It’s been tempting for many years to think back to his time as one of the very brightest stars in the academy at Cobham, and of course that has been followed by a prolonged period of mediocrity, including decent chunk of his spell at Bournemouth.He seems to have turned that corner now, having been shortlisted for April’s player of the month gong (three goals and three assists) and delivering another solid shift here. There’s no great argument to be made for Chelsea needing him, but he has certainly been integral to Gary O’Neil’s resuscitation act on the south coast.",
        "CHELSEA FANS' WHIRLWIND AFTERNOON  An interesting day to observe the Chelsea supporters at a time of crisis for their club. Initially their contributions nosed on the gallows humour of their predicament and it was quite amusing. ",
        "When Conor Gallagher headed them in front in the ninth minute, it prompted the chorus: ‘We are staying up, we are staying up.’ A moment later: ‘How s*** must you be, we’re winning away.’ Over the course of the game, that evolved to more questionable chants for Roman Abramovich, which would seem to be a selective appreciation of his history, before the booing of a couple of Frank Lampard’s substitutions, including the introductions of Raheem Sterling and Hakim Ziyech. By the end, we were deep into ‘Super Frankie Lampard’ territory.",
        "HOLES IN SOCKS  The peculiar trend for players cutting holes in the backs of their socks is nothing new, but Gallagher takes it to a bizarre extreme with two huge incisions in each. As one press box observer put it, they looked like badly laddered tights.",
        "JOHN BROOKS DISPLAYS HIS AUTHORITY  John Brooks, who was the victim of Jurgen Klopp’s little outburst as fourth official for Liverpool’s win over Tottenham a week ago, was referee here. Perhaps it was in sympathy for those of his profession that he took Enzo Fernandez to task for mouthing off to assistant referee Matthew Wilkes in the first half. Brooks politely told the Chelsea midfielder to zip it.KANTE IMPRESSES IN ATTACK  The deployment of N’Golo Kante in more attacking positions is often a divisive topic among Chelsea’s support. ",
        "In this game and several others it has been a recurring theme to see him get forward and, as the touch map will show, he was involved around the Bournemouth area every bit as much as his own half. His cross for Gallagher’s opener was excellent."
    ]
}