{
    "articleURL": "/sport/football/article-12042071/Frank-Leboeuf-accuses-Chelsea-players-dirtying-image-club-3-1-Arsenal-defeat.html",
    "content": [
        "Frank Leboeuf stated that he wanted to turn off the match on Tuesday in shame Frank Lampard is the third manager appointed by Todd Boehly since he arrived Criticised by Lampard and battered by Arsenal - Boehly's disastrous first season Frank Leboeuf did not hold back in his assessment of Chelsea's performance after their dismal performance against Arsenal on Tuesday night. ",
        "The former Blues skipper slammed his old team as Chelsea were well beaten by the Gunners, who returned to their perch at the top of the table. Chelsea conceded three times before the break, with Martin Odegaard netting twice before a Gabriel Jesus strike, as the hosts quickly took control. And although Non Madueke netted a consolation to make it 3-1, the Blues failed to drag themselves back into the tie and lost a sixth consecutive game under interim boss Frank Lampard. However, although the Blues have suffered heavier defeats this term, Leboeuf claimed that his old side went one step further against the Gunners by playing 'the worst' football in the world.  ",
        "'Shameful, disgraceful, pitiful,' his damning assessment began. 'I don't know if the players understand what they are doing right now. On top of dirtying the image of the club, they are dirtying their own image. What they are showing is the worst in the world of football.'You can be bad, everybody can be bad, everyone has been bad — that can happen. But when you show no character, no commitment in what you are trying to do, it shows that you are unprofessional.'The players have shown to the world that they don't deserve the Chelsea shirt. I make a difference between club and team. The club is a big club. The team is a shambles, a shame of that club. I wanted to turn off the TV, I was that ashamed.'",
        "The defeat to Arsenal was Chelsea's 14th of what has been a so far nightmare season that has seen them fall well short of any race for European qualification. It has not been the ideal start to the Todd Boehly and Behdad Eghbali era following their takeover at Stamford Bridge last summer.The co-owners have already sacked two managers this term in Graham Potter and Thomas Tuchel - as well as spend around £600million on new signings - as they look for their latest successor in the dugout. But for all the problems off the field at Chelsea, Leboeuf maintained that the squad were falling well short of expectation, and were evidently playing with the rudderless approach and lack of accountability of a team without 'leaders'.'Until I hear from Mauricio Pochettino what he’s going to do, I don’t believe any manager can solve this problem,' the 55-year-old added. 'The leadership we used to have is no longer there. That’s the main problem. ",
        "'You know Chelsea have no leaders. You know they all go into the dressing room at half-time and just drop their heads, \"Hopefully the coach doesn't talk to me because I don't want to be caught\".'The team I met when I came to Chelsea, with all those leaders, we would never do that. Impossible. We were such leaders, we had so much character, so much pride — it would have never happened. That's why I'm so ashamed, so upset.",
        "'I was amazed by the number of Chelsea fans in the stands. They have so much belief in their club, but they forget the team doesn't deserve to wear the shirt. I'm so upset and so ashamed of what I'm seeing.'I have followed Chelsea since 1996, when I signed for the club, and after I kept on following them. I've never seen anything like that in my life. It's awful, it's disgraceful.'"
    ]
}