{
    "articleURL": "/news/article-12054373/BBC-gives-platform-TV-historian-appeared-Harry-Meghans-Netflix-series.html",
    "content": [
        "CORONATION LIVEBLOG: Follow all the latest updates here The BBC today gave a platform to a TV historian who discussed Brexit and racism in Harry and Meghan's bombshell Netflix series.",
        "Professor David Olusoga warned that the monarchy may struggle to modernise on the day King Charles III was crowned in Westminster Abbey in a ceremony watched by millions in Britain and around the world. The academic, who teaches at the University of Manchester, suggested that the future of the monarchy was 'open to discussion'.He told the broadcaster: 'Now a new reign formally begins, lots of questions about the monarchy and his role are up for discussion as they always are and always have been. 'I think it's more difficult with a thousand-year-old ceremony to reflect the fact that we are one of the most secular nations in the world.",
        "'There's only so much you can modernise a thousand-year-old ceremony without it stopping being that ceremony. 'To an extent you can't modernise the monarchy because it is a monarchy. That hereditary principle is one that many people will never be comfortable with but the majority of our fellow citizens in 2023 are comfortable with this being the way we choose a head of state. They revel in the ceremonies and the tradition.'",
        "'I'd like to think that he'll find ways of modernising the royal family but I do think it's a challenge. 'We've had a year with three Prime Ministers. We've not made the best case for an alternative over the past few months.",
        "'We have to wish him well and hope that there are ways of modernising and that he's capable of finding them.'Mr Olusoga previously said that the 'fairy tale' of Harry and Meghan was 'embedding itself in a nation that is having a pretty toxic debate about the European Union.'He argued that 'immigration was at the absolute centre' of that debate, and that 'immigration is very often in this country a cipher for race'.He also criticised 'racism' in the process,According to Mr Olusoga, the fact that slave owners were then compensated to the tune of £20million 'for their human property' is often 'left out' of history lessons, which he said is 'just another way in which our memory of British slavery has been airbrushed out of Britain's story.'It comes after the King and Queen set the seal on their historic coronation day with a double Buckingham Palace balcony appearance to acknowledge the nation.Charles and Camilla in lavish robes and wearing their crowns returned with a wave the cheers of the crowds, who filled The Mall after braving downpours to see a colourful ceremonial military procession not seen for 70 years.The Prince and Princess of Wales and their children Prince George, Princess Charlotte and Prince Louis joined the monarch, as did the pages of honour and other royals - and then wellwishers were treated to an encore with just the King and Queen.",
        "The royals watched a flypast from the balcony, which was scaled down to include only helicopters and the Red Arrows due to the poor weather.The family spent a little under 10 minutes on the balcony before going back inside, but the King and Queen re-emerged moments later to loud cheers.Camilla then called for their pages to help them rearrange their trains.They went back into the palace shortly before 2.40pm, with the King lingering for one final wave.The Duke of Sussex and the Duke of York were not part of the balcony appearance, having not taken any formal role at the coronation.A few minutes past midday, Charles became the 40th reigning sovereign to be crowned at Westminster Abbey, the nation's coronation church since 1066, as Archbishop of Canterbury Justin Welby placed St Edward's Crown on his head.The historic moment, watched around the globe, was a fulfilment of the King's destiny, but followed the death of his mother, Queen Elizabeth II, last September after a 70-year reign.The coronation was a spiritual and deeply personal event for the King, a 'committed Anglican Christian', who was anointed, seen kneeling at the abbey's high altar and receiving homage from his son and heir the Prince of Wales.William's interaction with his father where he touched St Edward's Crown then kissed his father on the right cheek appeared a poignant moment for the King.",
        "As William knelt before Charles, who held his son's hand between his palms, the future monarch said: 'I, William, Prince of Wales, pledge my loyalty to you and faith and truth I will bear unto you, as your liege man of life and limb. So help me God.'The King's estranged son Harry was among the congregation, sitting two rows behind his brother with the Duke of York's family, and he was seen intently watching the crowning.",
        "And when a few minutes later the congregation was invited pay homage to the new monarch, Harry was seen, along with the other royals around him, speaking the words: 'God save King Charles. Long live King Charles. May the King live forever.'Charles delivered a King's Prayer, the first time a monarch has spoken words to God aloud during a coronation, and he prayed to be a 'blessing' to people of 'every faith and conviction'.Before the crowning the archbishop delivered a sermon to the 2,300 guests, a gathering of world leaders, celebrities, UK politicians, foreign royalty, everyday heroes and the royal family.Mr Welby began by telling the congregation: 'We are here to crown a King, and we crown a King to serve.'What is given today is for the gain of all. For Jesus Christ announced a kingdom in which the poor and oppressed are freed from chains of injustice. The blind see. The bruised and broken-hearted are healed.'",
        "Speaking to Charles and Camilla, Mr Welby said: 'The weight of the task given you today, Your Majesties, is only bearable by the spirit of God, who gives us the strength to give our lives to others.'With the anointing of the Holy Spirit, the King is given freely what no ruler can ever attain through will, or politics, or war, or tyranny: the Holy Spirit draws us to love in action.'In the stillness of the abbey, Mr Welby held St Edward's Crown high above Charles and, after placing it on his head at 12.02pm, said 'God save the King' - words loudly repeated by the congregation.The archbishop had adjusted the position of the crown for several seconds before it sat comfortably, and even crouched down to briefly check it was positioned properly on the King's head.A fanfare was played and the abbey's bells rang for two minutes after the crowning, with gun salutes fired from nearby Horse Guards Parade, the Tower of London and saluting stations across the nation and from warships at sea.Volleys were heard at Hillsborough, Cardiff and Edinburgh castles, Stonehenge and HMS Lancaster, which had sailed to Sudan to help British citizens and others escape the fighting in Khartoum.The Queen was crowned with Queen Mary's Crown, with Camilla having been anointed in public in a break with tradition.",
        "During the crowning the Queen was seen adjusting her hair out of her face.Earlier, Charles and Camilla's Diamond Jubilee Coach arrived at the abbey, following a procession from Buckingham Palace, in the midst of a Sovereign's Escort provided by the Household Cavalry's Blues and Royals and Life Guards with their shining breastplates and plumed helmets and led by the Household Cavalry Mounted Regiment band.The monarch and his wife's entrance through the west door was heralded by a fanfare from four State Trumpeters of the Household Cavalry and the abbey congregation stood as one.A large ceremonial procession was lined up before the King and Queen with representatives of all elements of the nation's ceremonial and spiritual life.There were recipients of Orders of Chivalry and Gallantry, Heralds from the College of Arms in their colourful tunics, senior clergy associated with the monarchy and the glittering coronation regalia carried by leading figures.St Edward's Crown was carried by General Sir Gordon Messenger, Lord High Steward of England.With their lavish and unwieldy robes, the King and Queen walked single file along the nave of the abbey with Camilla ahead of Charles as the hymn I Was Glad As They Said Unto Me was sung.The coronation service began with a new element when the King was greeted by 14-year-old Samuel Strachan, the longest-serving chorister of the choir of the Chapel Royal, St James's Palace.The chorister, who attends the City of London School, welcomed the monarch in the name of the 'King of Kings' - a reference to Jesus Christ - and Charles replied: 'In his name, and after his example, I come not to be served, but to serve.'Before the King took the Oath - making a succession of promises, including to maintain in the UK the Protestant Reformed Religion established by law - the archbishop delivered a preface to Charles's declaration - another first.He told the congregation the Church of England, which is headed by the King, will seek to foster an environment where 'people of all faiths and beliefs may live freely' - echoing the words of the late Queen and Charles.Charles was anointed with holy oil away from public view, shielded by the Anointing Screen.The Dean of Westminster will have poured oil from the ampulla - an eagle-shaped vessel - into the coronation spoon - the oldest object in the coronation regalia.Using his fingers, the archbishop will then have anointed the King on his hands, breast, and head.The King and Queen left Westminster Abbey in the Gold State Coach shortly after 1pm for a procession back to Buckingham Palace.Thousands of royal fans had braved the rain to line the procession route through central London.As anticipation mounted on Saturday morning, a group of republicans were arrested around 7.30am more than four hours before the coronation service began.Footage on Twitter showed Graham Smith, chief executive of the anti-monarchy group Republic, being apprehended by police in St Martin's Lane, Westminster.Protest group Just Stop Oil also said approximately 13 demonstrators were arrested on The Mall, as well as five at Downing Street."
    ]
}