{
    "articleURL": "/wires/reuters/article-12044747/Oklahoma-native-Talor-Gooch-red-hot-entering-LIV-Golf-Tulsa.html",
    "content": [
        "All momentum will be on Talor Gooch's side when he gets to relish in the comforts of home at LIV Golf Tulsa.",
        "Gooch, a native of Midwest City, Okla., is coming off back-to-back victories at LIV Golf Adelaide and LIV Golf Singapore as the Saudi-backed tour pivots to Cedar Ridge Country Club this weekend.\"I have such a love for Oklahoma. It's my people, I feel like. I'm just excited for them to actually see it up close and in person. It's going to be such an exciting week,\" Gooch said. \"I keep hearing about the support has been really good for ticket sales and just the local community. We love our sports in Oklahoma, and it's going to be fun to see the turnout.\"And if there's any such thing as home-field advantage in golf, Gooch will have it at Tulsa.\"Man, I've got so many family and friends that are going to be there all week. I can't even begin to count,\" Gooch said. \"Yeah, the Gooch gang that week will be deep.\"Gooch also has some familiarity with Cedar Ridge, where he played the U.S. Amateur Championship in 2009.\"I remember thinking it was a big-boy course at the time. I know it's still revered as one of the best courses in Oklahoma, so I'm just hopeful we're going to have some good weather,\" Gooch said. \"This time of year in Oklahoma, it can get a little windy, so us golfers know when it gets windy, it gets tough. Hoping we get a little Oklahoma wind that week.\"",
        "While Gooch might have the support of his family and friends, he will still have to try to win over the crowd as a whole, as Eugenio Chacarra, Matthew Wolff, Peter Uihlein and Charles Howell III all have ties to the Sooner State thanks to their time at Oklahoma State.Abraham Ancer will also look to garner support after his spending his collegiate career at Oklahoma.\"Man, we're all going to be crowd favorites. We love our sports. We love supporting our own. Eugenio and Wolffy and Charles and Peter and me, it's going to be great,\" Gooch said. \"Abe is going to get a bunch of support from the Sooners.\"It's going to be a great week for Oklahoma, for Oklahoma golfers.\"--Field Level Media"
    ]
}