{
    "articleURL": "/news/article-12043641/What-YouTube-originally-created-for.html",
    "content": [
        "YouTube was founded by Jawed Karim, Steven Chen and Chad Hurley in 2005The trio had very different plans for the site before video sharing took off YouTube original even had a slogan: 'Tune in, Hook up'YouTube would not have become the most popular video sharing platform on the internet if it's founder had their way.",
        "When it first launched in February 2005, it was originally intended to be a site for video dating. YouTube founders Jawed Karim and Steven Chen have attested to this in previous interviews. ",
        "Speaking at the SXSW conference in 2016, Chen said: 'We always thought there was something with video there, but what would be the actual practical application.'We thought dating would be the obvious choice.'Karim has also previously spoken about YouTube's romantic origins, telling  Motherboard in 2015: 'We even had a slogan for it: Tune in, Hook up.'The whole thing didn't make any sense. We were so desperate for some actual dating videos, whatever that even means, that we turned to the website any desperate person would turn to, Craigslist.'Despite offering to pay women $20 to upload videos of themselves to YouTube, nobody came forward.Chen, Karim and fellow co-founder Chad Hurley were forced to adopt a different strategy.Eventually they decided to abandon the dating plans and launch it as just a video sharing site.",
        "'OK, forget the dating aspect, let's just open it up to any video,' Chen said.YouTube's first official video was Karim's Me At The Zoo which was captured at the San Diego Zoo and showed him standing in front of an elephant enclosure in 2005.",
        "The following year the three founders sold the site to Google for $1.65 billion.Chen, Karim and Hurley founded YouTube while working for PayPal, and the original YouTube headquarters was above a pizzeria in San Mateo, California.Their idea behind YouTube was for non-computer experts to be able to use a simple interface to allow users to publish, upload and view videos through internet browsers. "
    ]
}