{
    "articleURL": "/tvshowbiz/article-12052901/Busy-Philipps-grabs-lunch-estranged-husband-Marc-Silverstein-one-year-split.html",
    "content": [
        "Busy Phillips, 43, was spotted in New York City having a meal with her estranged husband Marc Silverstein, 51. ",
        "The couple, who quietly separated in 2021 but have not yet divorced, shared a laugh and smiles as they sat across the table from each other on the restaurant's patio.The Cougar Town alum looked bright and fresh for spring in a green, orange, pink, white, purple and blue striped sweater and white jeans.The Girls5Eva star had her blonde hair pulled back into a low bun and wore red clogs on her feet.Busy and Silverstein - who revealed their split last May - share daughters Birdie, 14, and Cricket, 10.",
        "Busy and Silverstein married in 2007 and welcomed Birdie the following year.She previously praised her screenwriter husband's romantic side in an interview with OK!In Busy's own words: 'He did do something really romantic - he drew up a contract that says he will never break my heart.''He had it all drawn up and notarized so it's legal and he had it framed and hung it on the wall. So if we're arguing I can say, 'Um, excuse me, can I just point out what's hanging above the mantel!'' The couple had some rough spots. In her memoir This Will Only Hurt A Little, she revealed that she was close to leaving Silverstein at one point because she was doing most of the work raising their two daughters. ",
        "But Silverstein stepped up and they worked it out, Harper's Bazaar reported.However, in May 2022, the Dawson's Creek alum revealed on her podcast Busy Philipps Is Doing Her Best that she and her husband had separated in February 2021. 'It's been a really long time that Marc and I have been separated, and our kids know, our families know, our friends know,' she told co-host Caissie St. Onge.  She also revealed that she and Silverstein were reluctant to put out a public statement about the state of their marriage. ",
        "'You can only do what's right for you and your family, whether or not you have a public-facing life or you just post on Facebook or whatever.' 'It's a journey. Jour-ney. It's been a journey,' Busy revealed, saying they opted to keep things quiet to protect their daughters.St. Onge commented that Busy and Silverstein are 'the least separated separated people' she's ever seen,' the Freaks and Geeks alum agreed.'Well, we love each other very much,' she said. 'And we have these beautiful kids together. And there are a lot of things that really work about our relationship.'"
    ]
}