{
    "articleURL": "/tvshowbiz/article-12046973/Newlywed-Sofia-Richie-touches-London-ahead-Lionels-performance-Kings-coronation.html",
    "content": [
        "Sofia Richie touched down in London on Thursday ahead of her dad Lionel's performance at the King's coronation. ",
        "The newlywed, 24, landed in the capital following her lavish $2,000-a-night Maldives honeymoon with husband Elliot Grainge after tying the knot on April 22.Sharing a photo to her Instagram Story, Sofia joined a pal for a low-key stroll around the city. She slipped into a comfy knitted grey two-piece and layered over a tan jacket before shielding herself from the sun with a straw visor and some sunglasses. Alongside the snap, she penned: 'Back in London for Lionel Richie,' and a crown emoji.  ",
        "Lionel has continued to ramp up his workload with a whirlwind month spent celebrating his daughter's wedding in the South Of France before jetting to the UK for the King's Coronation. Meanwhile, Sofia has been giving fans an insight into her Maldives honeymoon with husband Elliot. The couple jetted away to the luxury resort after tying the knot in a multimillion dollar ceremony at Hotel du Cap-Eden-Roc in Antibes, France. Sofia and her music executive husband, 29, have shelled out over $2,000 per night to stay at One&amp;Only Reethi Rah's Grand Sunset Residence, a 22,809-square-foot two-villa beachfront property which has two swimming pools and sleeps up to 10.The socialite has been giving her fans plenty of footage from the ultra-luxury resort - posing in a $582 white embroidered cotton t-shirt by Magda Butrym and a matching embroidered mini skirt.",
        "The newlyweds enlisted their very own private chef to create a menu including custom cocktails called 'The Elliot' (tequila, agave, lime juice, can be made spicy) and 'The Sofia' (vodka, fresh blackberries, lime, ginger beer, and mint). While Sofia and Elliott have been enjoying a romantic honeymoon in the Maldives, Lionel has been in England preparing for the coronation. While he may have entertained a billion people worldwide at the 1984 Olympics and boasts more than 40 hit singles, he said playing for the King will be ‘the best thing ever’.",
        "The Hello star has been accompanied by his glamorous model girlfriend, Lisa Parigi, 40 years his junior, on the trip and met with the monarch and the Queen Consort at Buckingham Palace ahead of the coronation concert.Lionel has been an ambassador for the Prince’s Trust charity, which helps vulnerable young people, since the 1980s and said he didn’t hesitate when asked if he would headline Sunday’s event at Windsor Castle.‘This is going to be so much fun,’ he said. ‘Does this ever happen? No. This is a once in a lifetime opportunity, so to be a part of it is everything.He said of Charles: ‘Believe or not he cares. He is hands on. My job is to do the things that he cannot do, interviews and things like that. His time is valuable. So when I am travelling on my tours, this is what I do. I spread the world.’"
    ]
}