{
    "articleURL": "/wires/reuters/article-12044133/ECB-raise-rates-seventh-time-inflation-fight.html",
    "content": [
        "Debate is between 25 and 50 bps hikes",
        "Markets, economists leaning towards smaller stepHike will be 7th straight increaseInflation remains too high and stubbornBy Balazs Koranyi and Francesco CanepaFRANKFURT, May 4 (Reuters) - The European Central Bank will raise interest rates for the seventh meeting in a row on Thursday as its long fight against stubborn inflation continues, with only the size of the move still open to debate.The central bank for the 20-country euro zone has already lifted rates by a record 350 basis points since July in the hope of stopping runaway price growth. But getting inflation back to its 2% target is still years away, leaving policymakers with no choice but to tighten policy again this month and beyond.A 25 basis point move, a slowdown after three straight 50 basis point hikes, appears the most likely outcome, although the bigger increase is still a possibility at what is almost certainly not the end of a historic tightening cycle.The clincher could be a compromise among policymakers on what signals to send about future increases.Conservative \"hawks\", who hold a comfortable majority in the Governing Council, are leaning towards a bigger increase.But they have signalled they could compromise on a smaller move as long as the ECB indicates that May is not the end of its hikes, even if some peers - notably the U.S. Federal Reserve - may be reaching their own interest rate peaks.",
        "Another issue will be just how big a majority ECB President Christine Lagarde wants backing the decision.Many hawks could live with a smaller move given the right guidance but their dovish colleagues are likely to voice loud dissent if the hike is bigger, leaving the ECB once more speaking with many voices, seen as a weakness for years.Part of the compromise could be a deal to end reinvestments from July of maturing debt bought under the ECB's 3.2 trillion euro Asset Purchase Programme - a modest step that would shrink further the bank's bloated balance sheet, even if the inflation impact would be small.Markets see an 80% chance of a 25 basis point move while the vast majority of economists polled by Reuters were also betting on the smaller hike.Supporting a possible ECB downshift, the U.S. Federal Reserve lifted rates by 25 basis points on Wednesday and signalled it may pause further increases.ALL ABOUT INFLATIONEconomic fundamentals provide plenty of fodder for both sides of the argument.Supporting the case for a smaller move, the euro zone economy barely grew last quarter and lending figures showed the biggest drop in credit demand in over a decade, suggesting past rate hikes are starting to work their way through the economy.",
        "If squeezed hard, this credit downturn could morph into a full-blown credit crunch, weighing on growth which is barely in positive territory to begin with.At 3%, the ECB's deposit rate is already restricting economic activity, and underlying inflation has also stopped rising - at least for the time being.\"Inflation figures and results of the ECB's latest Bank Lending Survey cement the case for a downshift to 25 bps,\" BNP Paribas said in a note. \"At the same time, today's data also underscore that rates have to rise further - we affirm our 3.75% terminal rate expectation.\"Hawks argue that underlying price growth remains far too high and suggests that inflation could level off above the ECB's target unless the bank acts more aggressively.They says these risks are exacerbated by a tight labour market, especially since wage growth has been quicker than predicted and the jobless rate has fallen to an all-time-low despite the near-recessionary environment.\"Business surveys show a pickup in growth, potentially exacerbating labour market tightness, while the level of the policy rate is only 1%-point above our estimate of neutral,\" JPMorgan economist Greg Fuzesi said, predicting a 50 basis point move.The ECB will announce its policy decision at 1215 GMT and Lagarde will hold a press conference at 1245 GMT.",
        "(Editing by Catherine Evans)"
    ]
}