{
    "articleURL": "/wires/reuters/article-12046187/Lebanon-legal-council-dismisses-judge-investigating-corruption.html",
    "content": [
        "BEIRUT, May 4 (Reuters) - The Lebanese judiciary's disciplinary council on Thursday decided to remove from office one of the judges who has brought charges against the country's central bank governor and commercial banks.",
        "A number of domestic and foreign probes have been launched against Lebanon's financial officials following decades of profligate spending and mismanagement.Judge Ghada Aoun, who has investigated corruption by top Lebanese officials and the practices of the financial sector, told Reuters the disciplinary council accused her of bias.\"They are punishing me for doing my job,\" Aoun told reporters on Thursday after she left a hearing of the council, during which she was informed of its decision to dismiss her.Aoun said the bias accusations were based on comments she had made about corrupt officials. She said she had appealed the decision and could legally keep practicing until the appeal was decided.A senior judicial source told Reuters that the council had voted unanimously to dismiss her after numerous complaints were filed against her over her investigations.Earlier this year, Lebanon's prime minister and interior minister moved to restrict her probe into commercial banks, saying she was \"overstepping authority\" after she charged two banks with money laundering.Aoun also charged central bank governor Riad Salameh last year with illicit enrichment, in a case related to wider corruption investigations in Lebanon and at least five European countries. Salameh, who dies the accusations, was later charged by another Lebanese judge with illicit enrichment.",
        "Nizar Saghieh of the civil rights body Legal Agenda said Thursday's decision was a \"heartbreaking message to a judge that tried to take on major criminals\". (Reporting by Laila Bassam and Maya Gebeily; Editing by Toby Chopra)"
    ]
}