{
    "articleURL": "/wires/reuters/article-12038259/Ex-Minneapolis-officer-guilty-aiding-George-Floyd-killing.html",
    "content": [
        "By Jonathan Allen and Brendan O'Brien",
        "May 2 (Reuters) - Former Minneapolis police officer Tou Thao was found guilty of aiding and abetting in the 2020 killing of George Floyd, a Black man who died after his neck was pinned to the ground by another officer's knee during a botched arrest.The verdict against Thao, who held back a small crowd of bystanders while three other officers subdued Floyd, concludes the final criminal case related to the killing, which ignited a wave of protests over racism and police brutality across the U.S. and around the world.Thao, a nine-year veteran of the force, had opted to allow Hennepin County District Judge Peter Cahill to decide whether he was guilty or not guilty, waiving his right to a trial by jury. Cahill's 177-page decision was posted on the court's website on Tuesday morning.\"Based on his training, Thao was actively aware that the restraint he witnessed grossly deviated from the standard of care, was extremely dangerous, and risked Floyd's death,\" Cahill wrote in his decision.When sentenced on Aug. 7, Thao faces up to four years in prison, which are expected to run concurrently with the 3-1/2 years he received after he was found guilty in federal court of violating Floyd's civil rights.Derek Chauvin, a white officer captured on cellphone video kneeling on the handcuffed Floyd's neck for more than nine minutes, was found guilty of murder in 2021.",
        "With Chauvin kneeling on Floyd's neck, and the other two officers, Thomas Lane and J. Alexander Kueng, restraining his knees and buttocks, Floyd pleaded for his life before falling limp.While Floyd was pinned, Thao stood to one side and kept back the bystanders, who repeatedly yelled at the police to get off Floyd and check his pulse. Police were arresting Floyd on suspicion of using a counterfeit $20 bill at a nearby store.Minnesota Attorney General Keith Ellison said in a statement Tuesday that the verdict \"brings one more measure\" of accountability in Floyd's death.\"Accountability is not justice, but it is a step on the road to justice,\" Ellison said.Last year, Lane and Kueng pleaded guilty in state court to aiding and abetting second-degree manslaughter, the same charge Thao faced. Lane was sentenced to 3-1/2 years in prison, while Kueng was sentenced to three years.At a federal trial last year, Kueng and Lane were also found guilty of violating Floyd's civil rights. Lane was sentenced to 2-1/2 years and Kueng to three years in federal prison, to run concurrently with the state sentence.Thao's lawyers wrote that he believed Floyd was high on narcotics and having a distressed reaction. The officer's police training had told him that knee restraints on a neck were appropriate in some instances, the lawyers wrote, and he believed the other three officers were mindful of Floyd's medical needs.",
        "Chauvin was sentenced to 22-1/2 years in prison for the unintentional second-degree murder of Floyd, and last year received a concurrent sentence of 21 years in prison on federal charges of violating Floyd's civil rights. (Reporting by Jonathan Allen in New York; Editing by Rosalba O'Brien and Jonathan Oatis)"
    ]
}