{
    "articleURL": "/tvshowbiz/article-12047527/May-4th-Star-Wars-day-celebrated-celebrity-fans.html",
    "content": [
        "May the 4th fell on Thursday this year.",
        "And Hollywood stars were quick to take to Instagram to have fun with the annual Star Wars celebration. The date originated from the pun 'May the Fourth be with you,' a variant of the popular Star Wars catchphrase 'May the Force be with you.'Even though the holiday was not created or declared by Lucasfilm, many Star Wars fans around the world have chosen to celebrate the holiday. Some of the posts commemorating the day were silly, while others were eye-popping throwbacks. ",
        "Melissa Joan Hart shared a flashback photo where she was dressed up as Princess Leia.Leia's bikini is an iconic costume worn by actress Carrie Fisher as Leia in the 1983 Star Wars film Return of the Jedi. 'May the Fourth Be With You! #starwarsday,' wrote the actress in her caption.Baywatch actress Donna D'Errico did the same as she posed in a beige and gold version of the bikini. Wonder Woman actress Lynda Carter shared an old photo of herself as the superhero.'May the 4th be with you. #starwarsday,' wrote the dark-haired beauty.The Mask Of Zorro star Antonio Banderas shared a poster from Puss N Boots that resembled a Star Wars poster.",
        "The Spanish actor's caption read, 'May The 4th (and the Gato) Be With You! Amazing fan art by @m.r._opang !#pussinbootsthelastwish #pussinbootsfanart #maythe4thbewithyou #gato #starwars.' ",
        "Christopher Lloyd shared an image from The Mandalorian as he sat in a control room in front of the bounty hunter.'May the 4th be with you all!' he shared. William Shatner said Star Trek is celebrated 364 days of the year so fans should give Star Wars fans one day.The original Star Trek TV show aired from 1966 until 1969. There have subsequently been many spinoffs as well as films. The Star Wars Instagram page came up with a clever video which shared various clips from the franchise.On the main page was a photo of Grogu from The Mandalorian, who also goes by Baby Yoda. Also on Thursday Billie Lourd sported a dress featuring her mother's most iconic role and a heart-warming smile as she celebrated Carrie Fisher's life and career on Thursday with the unveiling of the late Star Wars actress' star on the Hollywood Walk of Fame.The 30-year-old Booksmart actress was joined at the unveiling by Carrie's longtime friend and Star Wars costar Mark Hamill, 71, who looked nearly as excited as Billie.The event was perfectly timed to honor Fisher — who died on December 27, 2016, at just 60 — as the event took place on Star Wars Day, the informal holiday on May 4, which happens to sound a bit like the famous phrase, 'May the Force be with you.'",
        "In addition to crowds of adoring fans, the event was also populated by top-notch C-3PO and R2-D2 stand-ins.Billie looked as if nothing could spoil the day for her, even though she didn't invite her late mother's siblings after she accused them of 'capitalizing on her' death for fame and money.",
        "Billie put on a busty display in her dress, which featured a black top with a plunging neckline and a cutout just below her cleavage.The dark material was enlivened with silver sequins, while the dress' skirt featured a scene of Carrie from the original 1977 Star Wars, which was retroactively titled Star Wars: Episode IV — A New Hope. Her mother was featured in Princess Leia's most iconic outfit, with a billowing white dress and her iconic side buns.Billie paired the look with a set of open-toe heels, and she accessorized with dangling diamond earrings while adding tear drop–shaped sparkles just below her eyes.She wore her long blond hair swept back and tied into two pigtails.Earlier, she donned a tasteful gray trench coat, though she ditched it as things warmed up. Billie looked particularly loved-up as she posed with her husband Austen Rydell, with whom she shares two children. Joining the rising star was her father Bryan Lourd, co-chairman of the high-profile talent agency Creative Artists Agency (CAA).",
        "He was married to Carrie from 1991–1994, before they divorced and he came out as gay.",
        "By Kelsi KarruliMay the force - fourth - be with you! May 4 has been branded Star Wars Day and time for fans of the franchise to celebrate the film with special deals and more. A long time ago in a galaxy far far away, the Star Wars universe featured just a few films. Now the franchise is still growing, with 12 movies, including spinoffs, and nine TV shows. And while movie lovers gush over the sci fi series all year round, there is one special day in the month of May that became National Star Wars Day because of the phrase, 'May the force be with you,' which was used by Jedi masters in the movies.The influence of George Lucas - the Star Wars creator - on pop culture is undeniable, with thousands of fans coming together on May 4 to celebrate. And the benefits of the special day go beyond its meme-y origins, with many retailers offering Star Wars lovers special deals on top-selling products. Why is May 4th called Star Wars day? Although many fans believe the fourth day of May became Star Wars day due to the turn of the phrase, 'May the force be with you,' it was primarily because of a general election. According to Lucasfilm, the iconic slogan was initially switched around in 1978 as a way to greet others on the Fourth of July. The emphasis on Star Wars on the fourth of the month of May can actually be traced back to the 1979 UK general election. ",
        "The following year, in 1979, May 4 became the unofficial day of the fandom when Margaret Thatcher became Britain's first female prime minister. To celebrate her success, her party bought a half-page ad in the May 4, 1979, edition of The London Evening News. The issue read: 'May the fourth be with you, Maggie. Congratulations!' And because May the fourth be with you doesn't have the same ring to it in other languages, the term Star Wars Day was adopted. It was observed as a day for the fandom for decades, however, it wasn't until 2019 that it was officially recognized.In 2019, California lawmakers voted to declare May 4 National Star Wars Day in honor of Disney's Galaxy Edge opening. May is also a memorable month for fans of the franchise. The original Star Wars premiered on May 25, 1977, and George Lucas's birthday is May 14. Get ready to laugh! The best of memes shared on Star Wars Day ",
        "One of the best things that comes out of Star Wars Day is the hilarious memes that are shared by fans all around the world. Star Wars Day represents more than just a witty quote, it marks a day for fans to pen some of the best jokes the web sees all year. Fans flock to Twitter on the fourth day of May to share creative memes. From Chewbacca photos to cats dressed as a character for the film, there is nothing too extreme when it comes to Star Wars day puns. 'May the force be with mew,' wrote one user alongside a cat dressed as Rey.Another person shared an image of their dog donning a hoodie and captioned it, 'May the fourth be with you.' One user even celebrated the day by giving Chewbacca his very own hair ad. ",
        "And while many fans tweet out memes, others simply take to social media to wish fellow Star Wars lovers a happy May fourth. 'May the fourth be with you all,' wrote one user. Another person showed off the Star Wars-themed cookies she made to celebrate the day. 'Happy may the fourth be with you! It's a legal requirement to wear as much Star Wars stuff as you can today, right?' wrote another user.   One person posed with a Light Saber and said: 'Happy Star Wars Day. May the fourth be with you.' Shop till you drop! Fans can get special deals on Star Wars products on May 4th - and indulge in Light Saber Churros",
        "In the midst of their Star Wars movie marathons and scrolling through all of the witty memes, fans can also indulge in discounted and special products. Collectors of Star Wars products can snag film-inspired products at a discount on May 4. Major retailers like Amazon, Target, and Walmart, will have discounts on special film-related products. Specialty retailers like Lego, Disney, and more will have brand-new products and special deals. Amazon will have special deals on May 4, including toys, books, movies, games, and more.You can get 20 per cent off all Star Wars products at Target, put your savvy skills to use with Walmart's discounted film-inspired products. Homesick Candles will be offering 'The Bounty' and The Rescue' scents. Loungefly will be offering a Darth Vader crossbody bag for $75. You can get buy one, get one 40 per cent off Star Wars toys at Macy's. ",
        "Lego will be giving out special gifts with the purchase of Star Wars products. If you spend $40 you get an X-Wing model, if you spend $85 you get a limited edition coin, and if you spend $150 you get a miniature Death Star kit. Lego will also be giving video game lovers the chance to play with the new character, Luke Starkiller, for free. Rocket League will allow you to use the R2-D2 Player Banner for free. And many places will even be offering special Star Wars-inspired food and drinks. The downtown Disney district, resorts, and parks will all be offering film-inspired treats. You can get Light Saber Churros, and Darth Vader Cupcakes at Walt Disney World Resort, or indulge in cookies iced to look like Grogu at Disneyland Park. Deals are subject to change every year.  "
    ]
}