{
    "articleURL": "/wires/aap/article-12054093/Anderson-clinic-steels-Suns-tight-Demons-loss.html",
    "content": [
        "Stuart Dew rates Noah Anderson's game sense as good as any AFL player he's coached and is confident Gold Coast's near-miss against Melbourne won't be in vain.",
        "The Suns were missing Touk Miller but an Anderson exhibition helped them edge Melbourne's midfield in a gutting five-point home loss on Saturday.Anderson did as he pleased with 36 disposals, half of them contested, 10 clearances and a brilliant goal late in the fourth quarter as the hosts surged for an upset against the side that moved back to the top of the ladder.The Suns coach said those numbers alone didn't do the midfielder justice.\"He was doing this last year and I feel everyone's just a bit slow to the party,\" Dew said of the 2019 No.2 draft pick behind teammate Matt Rowell, who had five first-quarter clearances to set the tone.\"His footy IQ, ability to find space, read the game, it's as good as I've seen in coaching at a couple of different clubs.\"It's hard to put words on it, hard to measure because a lot of it is off the ball.\"He found holes and the good players do; Scott Pendlebury we've seen him do it for about 15 years.\"Those players are a joy to watch, sometimes you're just a spectator.\"Melbourne's midfield of Christian Petracca, Clayton Oliver and Angus Brayshaw were statistically outplayed early at the stoppages.Ruckmen Brodie Grundy and Max Gawn kicked two goals each on trips forward, while Petracca produced a brilliant snap from deep in the pocket to begin the fourth quarter.",
        "\"It was a real battle,\" Demons coach Simon Goodwin said.\"They were really influential around the ball ... but to have an impact like that, he's (Petracca) a special player.\"Dew said the message was clear ahead of a trip to Perth to face the battling West Coast.\"I just said if you don't get confidence from a performance like that ... come and see me if you don't believe it I'll straighten you up,\" he said.\"That's a serious contender we played and pushed right to the line.\"But I don't need to convince them after tonight; I could feel something in the rooms.\""
    ]
}