{
    "articleURL": "/tvshowbiz/article-12060617/Below-Deck-star-Kate-Chastain-clears-baby-daddy-rumors.html",
    "content": [
        "Below Deck star Kate Chastain cleared up baby daddy rumors on Monday via her social media.",
        "The reality star wrote: 'For the record, the only thing this handsome guy has in common with any chef is the tendency to get emotional around meal times.'Kate announced the birth of her son Sullivan Cay on Friday, May 5 via her Instagram page. Kate, 40, has not disclosed the identity of the father of her child - although fans have speculated it is her former Below Deck co-star chef Ben Robinson, 42.The speculation came after she posed with Ben in April for a snap while showcasing her baby bump; the co-stars previously sparked romance rumors during the second and third seasons of the Bravo show.",
        "Last month, Kate proudly showcased her growing baby bump as she posed with former co-star Chef Ben in a new Instagram photo he shared. The TV personality, who starred in the hit Bravo series for a total of six seasons, has not disclosed who the father of the child is, and has previously opened up about being a single mother.In the snap shared in April. the star gently rested her right hand on her burgeoning bump while Ben mimicked a similar pose as the pair flashed smiles towards the camera.In the caption of the post, he humorously penned to his followers, 'Who knew that Kate Chastain and I would be the same weight one day...But to be fair I have been hitting the gym!'",
        "Chef Ben then sweetly added, 'Please wish my great friend @kate_chastain an easy delivery and a healthy beautiful baby! I am so proud of who you have become and the mother you will soon be,' followed by a red heart emoji.She could be seen wearing a fitted black dress with floral patterns, and had typed out, 'I’m already planning so many birthday theme parties for you,' followed by a slew of both red and blue heart emojis. In the post Ben uploaded to share his support to Kate along her journey to becoming a mother, social media users flocked to the comment section, with some voicing their speculation that he could be the father.'Please say kates baby is yours Ben,' one follower typed out, while another wrote, 'I think we were all hoping you’d announce you’re the father.'One fan asked Chef Ben, 'Are you going to help change diapers or make fresh baby food? Haha love this so much!'The Below Deck alum had initially sparked romance rumors during the second and third season of Bravo series.",
        "During an interview on Watch What Happens Live With Andy Cohen back in 2019, she had hinted that the two had previously had a fling when asked if she would 'sleep' with Chef Ben, prompting her to reply with, 'Not again,' per Us Weekly.",
        "Last month, Kate jumped to her Instagram stories to give a small update to her 1 million fans and followers.She could be seen taking a selfie while wearing the same mint-green dress from her photo with Ben and typed out, 'Week 36: ultrasound waiting rooms should have recliners.'Kate, known as Chief Stew on Below Deck, was on the series for a total of six seasons, until her official departure in February 2020. Ben was also on the show starting from its very first season all the way until season four."
    ]
}