{
    "articleURL": "/wires/aap/article-12044097/States-territories-guaranteed-1200-affordable-homes.html",
    "content": [
        "Every state and territory is set to receive a guaranteed 1200 affordable homes across the next five years, as pressure builds on the Greens to pass the $10 billion housing fund.",
        "Housing Minister Julie Collins says the floor of 1200 homes will ensure all jurisdictions get their fair share through the government's signature housing fund, despite obvious size differences between states such as NSW and Tasmania.\"The biggest states will get their fair share. They will get a lot more than the floor. What we are talking about here is about a floor,\" Ms Collins told ABC Radio on Thursday.\"It's also about allowing some of the community housing providers some surety of pipeline, particularly in smaller jurisdictions, so they can grow.\"There will be certainty of funding for long-term projects for investors over the long term.\"Tasmanian senator Tammy Tyrrell secured the guarantee from the government in exchange for her vote in the Senate to pass the fund.The government is struggling to garner support for its housing future fund, which would leverage $10 billion and invest the profits into affordable and social housing - up to $500 million each year.\"This is a massive victory for Tasmania,'' Senator Tyrrell said.The coalition opposes the bill, saying it would be inflationary and add to interest rate hikes because of the amount of money that would need to be borrowed to float the fund.The two Tasmanian Jacqui Lambie Network senators now support the bill, but the Greens continue to hold out in the hope of securing more investment and a rent freeze.",
        "\"We've fought to get Tasmania its fair share. The Greens are threatening to leave us with nothing,\" Senator Tyrrell said.Negotiations continue with crossbencher David Pocock, but the ACT independent says he is frustrated at the government's pace.He said he would not stand in the way of the fund if the government did not come to the table.Senator Pocock said the government should invest $900 million annually if it expected a nine per cent average return.He has also called for the money to be indexed.\"I do expect the government to take on board advice from experts,\" Senator Pocock said.He said the 1200 figure would not make a huge dent in the nation's capital, with the ACT set to lose 1056 national rental affordability scheme properties when it finishes in 2026.\"The starting point for me has been the scale. This $10 billion fund is not up to the scale of the housing challenge we see,\" Senator Pocock said.Treasurer Jim Chalmers said the government would continue to engage respectfully with Senator Pocock and chastised the Greens for failing to support the fund.\"We have vacancy rates that are very low and rents higher than we would like,\" he said.\"It beggars belief the Greens and the Liberals and Nationals in the Senate, given the pressures on the rental market right now, won't vote for more social and affordable homes.\"",
        "But Greens housing spokesman Max Chandler-Mather said Labor's plan would fall short of addressing the need for more than 700,000 social and affordable houses in coming years.\"It's still a $10 billion gamble on the stock market that doesn't guarantee a single dollar will be spent on housing and does nothing for renters,\" he said.\"We need a plan to invest billions of dollars right now.\"All state and territory ministers signed a letter to federal senators urging them to support the passing of the housing fund, including the sole Liberal minister, Tasmania's Guy Barnett."
    ]
}