{
    "articleURL": "/news/article-12048575/Stunning-NYC-townhouse-featured-Devil-Wears-Prada-hits-market-27-MILLION.html",
    "content": [
        "The massive home on the Upper East Side hit the market for $27,500,000There are seven bedrooms and 10 bathrooms across 12,000 square-feetThe home was featured in The Devil Wears Prada as Miranda Priestly's house The New York City townhouse that fashion-terror Miranda Priestly called home in The Devil Wears Prada movie has hit the market for a whopping $27million.",
        "Standing five stories tall at 129 East 73rd street on the Upper East Side, the home has seven bedrooms spread across 12,000 square-feet.There are 10 bathrooms - four half, six full - and a total of 20 rooms across the house.Built in 1906 and then renovated in 2005, the home stands 22 feet across - impressive for any space in NYC - and appears to have been largely unchanged inside since Andy Sachs haplessly attempted to deliver a book to the residence in the 2006 film.Listed by Coldwell Banker, the house even sports a half-basketball court alongside a terrace on the rooftop.",
        "The home, at 129 East 73rd Street, was featured in the movie The Devil Wears Prada, where Andy Sachs, played by Anne Hathaway, delivered a book to tormenting editor Miranda Priestly, played by Meryl Streep.The movie was based on a book by the same name, written by a former staffer of Vogue editor Anna Wintour.The movie was released in 2006 and became a smash hit, grossing more than $320million.Streep was nominated for an Academy Award as Best Actress for her portrayal of Priestly. She lost the award to Helen Mirren in The Queen.The lavish home was designed by the renowned architect Stanford White.Its renovation was overseen by designer Diamond Barrata, according to the listing.",
        "Three sets of French doors at the main entrance open on to a foyer with the first working fireplace of the home.There is a den with arched ceilings, doors, and wood paneling, which leads into the eat-in kitchen currently painted in white with cabinetry to match.",
        "Upstairs is a library on the street side to the south, and the master bedroom at the rear of the home facing north.Appliances are all state of the art, the floors and countertops are marble, and there is a skylight over the breakfast area. Leading off the kitchen is an outdoor patio space.The upper levels are accessed by a spiral wooden staircase that winds the height of the townhouse.In the living room, built-in bookshelves line the walls, a trio of tall arched windows open out onto the street, and there are two working fireplaces along the room.Behind that is a dining room - complete with another fireplace - and a servant's pantry with a staircase connecting it to the kitchen below. There is also a terrace extending off the dining room.",
        "The master bathroom has one of the home's most prominent features — a large circular window situated directly over the lavish bathtub.Moving up, there is another bedroom with a terrace and a gym at the front of the home.",
        "Above that are two more bedrooms, another terrace, a balcony, and then on the top floor is a half basketball court — complete with a planked floor, padded walls, and a massive skylight across the ceiling.Behind the court is a wide terrace, complete with a grill, dining space, and a jacuzzi.The full asking price for the home is $27,500,000."
    ]
}