{
    "articleURL": "/tvshowbiz/article-12048959/Roxy-Jacenko-run-money-getting-divorce-listing-14million-mansion.html",
    "content": [
        "Roxy Jacenko has quashed rumours she put her $14million Vaucluse mansion up for sale because of money issues or a divorce. ",
        "The socialite, 43, said she is definitely 'not getting a divorce' from husband Oliver Curtis whom she only sees 'about once a month', reported news.com.au on Thursday. She also assured she hasn't 'run out of money', revealing her current home is just too big and high-maintenance while it's just her and her two children. The PR queen, who shares Pixie, 11, and Hunter, eight, with her partner, said she wasn't 'stupid' enough to divorce her partner and let 'him take 50 per cent' . 'We haven't been living together in a full-time capacity for about four years. He'll be here for Hunter's ninth birthday soiree on the weekend,' she said.",
        "She continued: 'But an apartment will be easier — with two kids on my own, there's no need to be in a house with a gym or a cinema.'Hunter's usually in the TV room playing Call of Duty when Pixie's in bed watching TV with me. We don't need this big house.'It comes after Jacenko revealed on Thursday she and Curtis, who is currently working overseas in Singapore, would be selling their sprawling Vaucluse mansion. ",
        "The Ministry of Talent founder shared a picture of the stunning pad to Instagram when she revealed the surprise news.'Coming soon via David Malouf and Bill Malouf. Jacenko-Curtis' are on the move,' she captioned the post, mentioning the real estate agents who will list the property.",
        "While the home is not yet on the market and a price guide isn't listed, the couple purchased the home for a cool $6.5million back in 2018. The home is believed to have a $14million price tag.The couple extensively renovated the home and added a full gym, a hair salon, a children's playroom, and a room just for her $1million Hermès Birkin collection."
    ]
}