{
    "articleURL": "/wires/reuters/article-12044317/Soccer-Atletico-thrash-Cadiz-5-1-leapfrog-Real-Madrid-second.html",
    "content": [
        "By Fernando Kallas",
        "MADRID, May 3 (Reuters) - Atletico Madrid scored five for the second consecutive game as they thrashed lowly Cadiz 5-1 in LaLiga on Wednesday to move above their city rivals Real Madrid into second-place in the standings.With only five games to play, Atletico climbed to 69 points, one ahead of Real, who lost 2-0 at fourth placed Real Sociedad on Tuesday.Runaway leaders Barca, who moved to 82 points after beating Osasuna 1-0 on Tuesday, will have the chance to clinch their 27th LaLiga crown with a win in their next game at city rivals Espanyol on May 14.It was a great atmosphere at Atletico's Metropolitano stadium with the team in a rich vein of form after a difficult start to the season.Atletico, who were eliminated from European competition after finishing last in their Champions League group in November, dropped as low as sixth in the LaLiga standings before the World Cup break.Yet they were a different team this year, led by a brilliant Antoine Griezmann, a key player for World Cup finalists France in Qatar and a leading contender to win LaLiga's player of the season.Atletico have lost only two LaLiga matches after the World Cup break and won 14 of their last 19 league games.",
        "\"The break did us a lot of good,\" coach Diego Simeone told DAZN.\"The team recovered their enthusiasm, their level. The team attack with enthusiasm, defend collectively and that has made us much better.\"Not to mention that many people stopped believing in what we were doing. We are going to think the same way. We are looking to be better ourselves.\"Atletico took an early two-goal lead with Griezmann scoring twice after combining well with Yannick Carrasco and Thomas Lemar.\"I was angry that I wasn't named LaLiga's MVP in April so I wanted to show my frustration in the first minutes,\" Griezmann joked.\"It's a joke, of course. I enjoyed today. To score five goals playing a good game... We have to keep it like this.\"Alvaro Morata extended their lead right after the break and Carrasco netted their fourth from the penalty spot after a handball inside the box by a Cadiz defender.One minute after Anthony Lozano netted for Cadiz, Nahuel Molina rounded off the scoring for the hosts with a close-range strike from a counter-attack. (Reporting by Fernando Kallas Editing by Toby Davis)"
    ]
}