{
    "articleURL": "/tvshowbiz/article-12052387/Cinco-Mayo-fever-Rosario-Dawson-Mario-Lopez-Sofia-Vergara-sip-margaritas.html",
    "content": [
        "Cinco de Mayo fell on Friday this year which was a bueno way to start the weekend.",
        "Hollywood luminaries had fun taking to social media to share their tributes.  Several showed off the cocktails with tequila that they were downing as they nibbled on tacos and empanadas.Rosario Dawson, Denise Austin, Mario Lopez, Sofia Vergara and Blanca Blanco were some of the stars who shared their celebration on Instagram. Not too many people know what Cinco de Mayo is all about as many mistake it for a Mexican independence day. Cinco de Mayo is a yearly celebration held on May 5, which commemorates the anniversary of Mexico's victory over the Second French Empire at the Battle of Puebla in 1862, led by General Ignacio Zaragoza. ",
        "Workout guru Denise Austin shared a festive post as she wore a white blouse.'Happy Cinco de Mayo!!! Celebrate today with some friends and a batch of my favorite Skinny Margs! I love that these are made with simple ingredients and SO delicious!! Remember, it's HEALTHY to indulge every now and then… 'Live your life and enjoy the little moments!! Give this skinny margarita a try today and let me know what you think in comments!'The blonde then shared the Skinny Margarita Recipe: 1 Lime Wedge Salt or Chili Lime Seasoning 1 oz. Fresh Lime Juice 1 oz. Orange Juice 1 oz. Tequila 1 tsp. Agave Syrup Rub the rim of your glass with a lime wedge and dip in salt (or a chili lime seasoning if you like a little kick!).",
        "'Add equal parts fresh lime juice, orange juice, tequila of your choice and a splash of agave to a shaker with plenty of ice. Shake well and strain into your glass. Cheers!!'Carmen Electra wore a Mexican hat. 'Happy cinco de mayo #cincodemayo #celebration #mexico,' she wrote in her caption.Rosario Dawson raised a glass as she wore a cute pink dress and rose tinted sunglasses. The Mandalorian actress let fans know she was having a cocktail.'Cinco De Mayo would not be complete without the Margalicious Margarita!!' she wrote.",
        "TV host Mario Lopez was in a similar mood. He held up a margarita as she smiled while in a studio. Sofia Vergara was one of the first as she took a photo outside her Beverly Hills home. The Modern Family star sat by her pool as she wore a red floral print off the shoulder dress with long dramatic earrings.In front of her was a water cooler next to a bowl of guacamole and chips.There were also tacos and empanadas.The former model's plates were colorful with red, yellow and green designs.  Hollywood actress Blanca Blanco was celebrated Cinco de Mayo by a swimming pool.The brunette beauty wore a skimpy yellow bikini that made the most of her assets as she worked on her California suntan while on a colorful blanket.",
        "The Tale Of Tales actress - who was last in Beverly Hills over Oscar weekend - also sipped on a Corona from the can as she tried to unwind on a Friday morning.The author of the heartbreaking memoir Breaking The Mold wore her dark hair back and had on pink lipstick as she posed for Filip Shobot.The star, who will next play therapist Alma Gomez in the movie Ash And Bone 2 -  also shared with DailyMail.com her top tips for staying slim as we head into bikini weather. She also has posed for the Swedish brand Chiquelle with ads appearing in Elle magazine Sweden for May issue 2.Blanca said that staying slender has a lot to do with consistent exercise even if the routine is light.'I try to exercise five days a week for one hour a day,' said the Mission: Possible star.'Cardio and weight training are key. I use weights to stay toned. Ten pound dumbbells are great for toning. ",
        "'Some weeks are challenging to keep up with the routine, I try to be kind to myself when I can't do routine, and know even one day or five minutes of training a day is 100% better than nothing.'I sometimes just walk around my neighborhood for 15 minutes when I don't have time to go to the gym. ",
        "'I have a walk app too so walking to the car or going to the gas station helps, all add up.'And she has some diet tricks too. 'I eat grilled food over fried food. It is healthier for the heart and it lowers cholesterol.President Joe Biden celebrated Cinco de Mayo on Friday by stepping out for a quesadilla and tacos at a Washington food hall. ",
        "His unannounced visit prompted one onlooker to remark, 'This is the most D.C. thing that's ever happened to me.'Biden was joined by Vice President Kamala Harris at Taqueria Habanero, in the Edgewood neighborhood of the capital. The president paid in cash for his order and posed with staff for pictures. Aides said Biden ordered a chicken quesadilla and churros, as well as an assortment of tacos for White House staff. To the people peering over a wall and looking down from their apartment balconies to see him, the president joked, 'Don't jump.'Last year, Biden and his wife, Jill, celebrated Cinco de Mayo at the White House. In 2021, the president visited Las Gemelas, a Mexican restaurant in Washington and told workers there that the company would be receiving financial aid from his COVID relief package."
    ]
}