{
    "articleURL": "/wires/reuters/article-12043973/Equities-lose-ground-choppy-market-dollar-stays-red.html",
    "content": [
        "By Sinéad Carew",
        "NEW YORK, May 3 (Reuters) -MSCI's gauge of stocks around the world lost ground in a volatile afternoon on Wednesday and the U.S. dollar held its losses after the U.S. Federal Reserve raised interest rates but indicated that it could potentially hold off on further hikes.The Fed raised interest rates by a quarter of a percentage point and signaled it may pause further increases, giving officials time to assess the fallout from recent bank failures, wait on the resolution of a political standoff over the U.S. debt ceiling, and monitor the course of inflation.While investors initially cheered the possibility of a pause, their certainty appeared to wane as Chair Jerome Powell spoke since the Fed statement's new language does not guarantee the Fed will hold rates steady at its next meeting in June.Powell noted during a press conference that the labor market is \"very, very strong\" and that inflation is stillrunning highand well above the Fed's 2% goal.Goldman Sachs economist Jan Hatzius wrote that the \"FOMC balanced the hint toward a June pause with a clear message that it retains a hawkish bias\" and that it would keep watching the data to determine if it needs more tightening.Oil futures initially pared losses after the news but still settled down sharply after already falling 5% on Tuesday.",
        "A majority of traders had been betting on a 25-basis-point hike but investors had been less certain that the central bank will leave the door open for a hiking pause at the June meeting.\"The Fed continues to walk the tight rope, and that is they´re trying to strike a balance between their inflation fighting credibility while trying to engineer a soft landing,\" said Michael Arone, chief investment strategist at State Street Global Advisors. \"It´s not clear that the Fed is pausing here.\"In equities, MSCI's gauge of stocks across the globe shed 0.25%.The Dow Jones Industrial Average closed down 270.29 points, or 0.8%, at 33,414.24, the S&amp;amp;P 500 lost 28.83 points, or 0.70%, to 4,090.75 and the Nasdaq Composite dropped 55.18 points, or 0.46%, to 12,025.33.The dollar held onto earlier losses on the prospect of a rate hiking pause.The dollar index fell 0.461%, with the euro up 0.49% to $1.1053.The Japanese yen strengthened 1.00% versus the greenback at 135.20 per dollar, while Sterling was last trading at $1.2555, up 0.73% on the day.U.S. Treasury yields yields fell on the Fed's signal that it could pause in its tightening cycle at the next few meetings.Benchmark 10-year notes were down 7.3 basis points to 3.366%, from 3.439% late on Tuesday. The 30-year bond was last down 4.8 basis points to yield 3.6838% while the 2-year note yield was last was down 10.5 basis points to yield 3.8748%.",
        "In energy, U.S. crude settled down 4.27% at $68.60 per barrel and Brent ended at $72.33, down 3.97%.In precious metals, spot gold added 0.8% to $2,031.55 an ounce. U.S. gold futures gained 1.03% to $2,035.00 an ounce. (Reporting by Sinéad Carew, Herbert Lash, Chuck Mikolajczak in New York, additional reporting by Nell Mackenzie in London, Tom Westbrook in Singapore, Editing by Lincoln Feast and Kim Coghill; Editing by Emelia Sithole-Matarise, Angus MacSwan, Chizu Nomiyama and Deepa Babington)"
    ]
}