{
    "articleURL": "/news/article-12056931/Turkish-despot-stages-massive-election-rally-ruler-launches-bid-cling-power.html",
    "content": [
        "The rally was held on Sunday at Istanbul's Atatürk airportIt packed in an unprecedented 1.7 million people'Istanbul!' President Recep Tayyip Erdogan shouted to the sea of supporters he gathered for a show-of-force rally ahead of next Sunday's election - the toughest of his two-decade rule.",
        "'If you say okay, we will win for sure!'The masses were packed shoulder-to-shoulder across the tarmac of Istanbul's old Ataturk airport: a tidal wave of Turkish flags and banners with the 69-year-old president's face.Erdogan was the mayor of this city before leading his Islamic-rooted party to power and ending half a century of secular rule in the mostly Muslim but officially secular state.The loss of Istanbul to the opposition in 2019 mayoral elections cracked Erdogan's aura of invincibility and sounded the first warning bell for the approaching vote.",
        "The latest polls suggest that Erdogan and opposition leader Kemal Kilicdaroglu are locked in a dead heat and probably heading to a runoff on May 28.But surveys in Turkey are an inexact science and both are trying to show their supporters that they can win outright next weekend by picking up more than 50 percent of the vote.Kilicdaroglu staged a smaller but still-impressive rally that filled a park on the Asian side of the city facing the Sea of Marmara the day before.But Erdogan and his party charted 10,000 buses to bring in people from 39 provinces for what the president dubbed 'the rally of the century' on Sunday.He claimed that more than a million people had shown up - and aerial footage of the event beamed live across the nation suggested that Erdogan might have been right.",
        "'I am honoured to be here,' 68-year-old Heyiye Kefal said with a smile. The disabled pensioner was transported to the event by a party bus.'We were in bad shape before but today we have everything: freedom and comfort,' she said.The old airport was abandoned in 2018 in favour of a new one the size of Manhattan that the president built near the Black Sea.'We have reshaped the country,' Erdogan proclaimed from the stage.",
        "Kilicdaroglu's message was equally upbeat.'Are you ready for change? Are you ready to restore democracy?' the 74-year-old head of Turkey's oldest party asked his supporters.'Together, we will rule the country with reason and virtue,' he said.Istanbul's popular mayor Ekrem Imamoglu - a presidential hopeful until a court effectively barred him from higher office in a case stemming from his 2019 victory - was the guest star of Kilicdaroglu's event.'Rights, law, justice' and 'Erdogan thief!' the crowd chanted as Imamoglu spoke.'Because of Erdogan, innocent people are in jail,' pensioner Yunus Mensur said while clutching a Turkish flag.The 76-year-old echoed Kilicdaroglu's pledge that an opposition victory would bring 'freedom and democracy'.'Kilicdaroglu will do what is right,' added Sabit.The 55-year-old accountant refused to give his last name because 'we are not free - and you can write that down'.",
        "Polls suggest Kilicdaroglu is beating Erdogan by a two-to-one margin among younger voters, who have known just one leader throughout their life.The young were out in force at the Istanbul park on the pleasant Saturday evening.'He is like us, he understands people,' 20-year-old Aleyna Erdem said of the grandfatherly opposition leader.'Kilicdaroglu will raise the status of women,' added Mujde Tosun.The 24-year-old supermarket employee lives in one of Istanbul's most conservative districts and stays veiled in public.But she voiced no fear with the historically secular position of Kilicdaroglu's party.Its previous decision to bar women from wearing the veil at school or civil service was a 'thing of the past' she said.Kilicdaroglu has since pledged to make the wearing of headscarves protected by law.But Tosun said she was not particularly worried about the veil.Her main concern was the possibility that Erdogan might be re-elected. If that happens, 'we're doomed,' she said."
    ]
}