{
    "articleURL": "/news/article-12050825/VIP-coronation-guests-wont-able-relieve-HOURS-Westminster-Abbey.html",
    "content": [
        "EXCLUSIVE: Toilet facilities in the Abbey will be closed during the serviceGuests at the Coronation service will be unable to have a 'royal wee' for at least three hours due to the lack of toilet facilities at Westminster Abbey, MailOnline has learned.",
        "The congregation will begin arriving at Westminster Abbey from 7.15am and have been told they must be seated by 9am.Toilet facilities in the Abbey are 'very limited' according to advice issued to guests, and all will be closed for the duration of the service itself - from 10am until 1am.Even at that point, after Charles and the other dignitaries have left the Abbey, 'guests are required to stay in their seats until directed by ushers', warns the strict advice leaflet.A royal source told MailOnline: 'It sounds slightly comical in the vein of ''very British problems'' but it will definitely be an issue of concern for some guests.'",
        "One guest in their 80s, who asked not to be named, told us: 'People, especially those of us of a certain age, are genuinely worried about how long they'll have to hold it in. With 2,000 people in the Abbey, your chances of getting to the loo before 10am are pretty slim, so you could be having to wait for several hours.'Desperate times call for desperate measures so there has even been talk of some taking extreme action to avoid embarrassment on this most public of events.'We've been looking into whether some might consider wearing adult nappies or incontinence pads, just in case,' added the guest. 'Apparently people who attended the last Coronation in 1953 were advised not to drink anything from midnight the night before, but that raises a different question of being dehydrated.'",
        "As well as inhibited access to facilities - there are also concerns among some about access to refreshments during the long morning.Lady Glenconner, 90, who was one of the Queen's Maids of Honour in 1953 recently told the Mail about how she nearly fainted at a vital point, having had no food that morning.She recalled: 'There was just one moment I look back on that could have been disastrous: it happened when I thought I was going to faint.'I'd eaten nothing that day; my dress was constricting, the atmosphere in the Abbey made fuggy by so many perspiring bodies.'There was also a frightful stink of mothballs because the peers had kept their robes in boxes during the war and they hadn't been aired.",
        "'When I look back at the film footage, I am positively green. Just as the consecration of our new monarch was about to start, I felt dizzy and started to sway.'Conscious that I didn't want to pass out in front of the entire British Empire, I broke my vial of smelling salts.'But even though I inhaled the fumes and wiggled my toes frantically to help my circulation, as we'd been instructed to do, it had little effect. I still felt ghastly.'Help arrived in the shape of Black Rod, Lieutenant-General Sir Brian Horrocks, who was standing next to her.",
        "'Seeing me wobbling dangerously, [he] pinioned me to a nearby pillar,' she said.'I steadied and managed to save myself from collapsing. Then, I suppose, adrenaline took over and I felt a bit better.'Guests for tomorrow's service are warned that despite their prized invitations, they still may not be able to see anything at all of the ceremony sand will have to rely on TV screens.In a red-bordered paragraph the leaflet advises: 'Please not that in order to ensure that as many people as possible are able to attend the Coronation, some guests will be seated in parts of Westminster Abbey that will mean they have little or no direct view of the proceedings.'Television screens will be located in these areas and guests will still be able to enjoy being part of the historic occasion.'Westminster Abbey was contacted for comment."
    ]
}