{
    "articleURL": "/news/article-12039861/Jock-Zonfrillo-dead-Marco-Pierre-White-slammed-silence-MasterChef-star-tragedy.html",
    "content": [
        "Marco Pierre White slammed for silence after Jock Zonfrillo's deathIt comes as celebrity chefs around the world pay their respects For confidential support call Lifeline 24-hour crisis support on 13 11 14Marco Pierre White was slammed for his lengthy silence over the shock death of Jock Zonfrillo, who started his career working with the renowned British chef.",
        "The 46-year-old MasterChef star was found dead in a Melbourne hotel on Sunday, sparking an outpouring of grief from his Australian colleagues and international culinary superstars including Nigella Lawson, Jamie Oliver and Gordon Ramsay. However, White came under fire on social media for not publicly commenting on the tragedy in the days folllowing his death.On Wednesday evening, White paid tribute to Zonfrillo, posting a picture of them together and saying: 'RIP, my love and my condolences to the family. MPW x'",
        "Instagram users attacked the Michelin-starred chef after he initially posted a photograph posing with his son Luciano in Bangkok the day after Zonfrillo's death.'I'm shocked! This is as insensitive as it gets. What poor timing to post this!' one person commented on the post. 'Where's the comment on losing Jock,' another wrote.The famous chef also came under attack on Twitter. 'Haven't noticed a condolence message for Jock from Marco Pierre White,' one  person tweeted.Zonfrillo started his career working under White in the UK and credited his mentor with saving his life after giving him a job and accommodation when he was a homeless heroin addict in London in the 1990s.But White raised questions over his relationship with Zonfrillo when the MasterChef Australia star shared his personal demons in his memoir Last Shot.",
        "'Jock is not a bad man,' White told Good Weekend last year.'He has a natural intellect and he's very nice. The only problem is that almost everything he has written about me is untrue.'Zonfrillo was homeless when he landed a role in the kitchen with White in 1994. He began sleeping in the change room at work and was a month behind on payments to his heroin dealers.He claimed that he had told White all about his addiction and not having a roof over his head.'He didn't fire me. Instead, he picked up the phone, put in a call to the hostel and asked them to fast-track me on the waiting list and find a bed for me,' Zonfrillo recalled.",
        "'In the meantime, he put me in touch with a couple of boys from Canteen, the other restaurant he owned, and arranged for me to sleep on their sofa until I could get my shit together. He even advanced me some cash to tide me over.'Following the release of the memoir, White questioned much of what was written about his exchanges with Zonfrillo and said the pair actually had very little to do with each other, despite the Brit being referred to in the book 157 times.'I never saw much of [Zonfrillo], and he worked in my kitchen for a very short time,' he told Good Weekend.",
        "Zonfrillo was found dead by police at a hotel on Lygon Street in Carlton, Melbourne, about 2am on Monday at the age of 46.His death is not being treated as suspicious by police.Celebrity chef Jamie Oliver, a guest on the now delayed first episode of the new season of Masterchef Australia, led the tributes on Instagram.'We had the best time working together for this years master chef [sic], I can't tell how good it was to work with him!,' he wrote. Gordon Ramsay said he was saddened to hear the devastating news.'I truly enjoyed the time we spent together on MasterChef in Australia. Sending all my love to Lauren and the family in this difficult time,' he said.Nigella Lawson tweeted that she could not stop thinking about the Scottish-Australian chef's children.'So many are plunged into deepest grief. My heart goes out to them. And I hope their wishes for privacy are respected,' she wrote.For confidential support call the Lifeline 24-hour crisis support on 13 11 14 "
    ]
}