{
    "articleURL": "/tvshowbiz/article-12040525/Gran-Turismo-trailer-brings-incredible-true-story-big-screen.html",
    "content": [
        "The true story of a young video game prodigy who turned into a real race car driver hits the big screen with a new trailer for Gran Turismo.",
        "The Sony Pictures film tells the true story of Jann Mardenborough, who in 2011 became the third winner of the GT Academy, and the youngest ever to do so at just 19 years of age.Despite never sitting in an actual race car, he beat out 90,000 contestants to win GT Academy, winning a chance to race at the Dubai 24 Hour race.Archie Madekwe plays Jann Mardenborough, with Djimon Hounsou playing his father, Orlando Bloom as Danny Moore, a character based on real GT Academy founder Darren Cox and David Harbour as Jann's trainer, Jack Salter.The film hails from director Neill Blomkamp (District 9), who works from a script by Zach Baylin (Creed III), Will Dunn (Ms. Marvel) and Jason Hall (American Sniper), in theaters August 11.",
        "The trailer begins with Mardenborough playing Gran Turismo 25, complete with a steering wheel and pedals hooked up to his computer.He asks a friend who he thinks the best driver is, and the friend says Rory, but Jann boasts, 'I would dust him in a lap!'Jann's father Steve says, 'All you do is play video games with some crazy dreams of racing cars,' while Jann fires back with, 'Dad, you're the one who always told us to do something we love.'Steve contends, 'You know what racing cars cost? Look around, it's not our world, son,' while we see shots of his blue-collar upbringing.",
        "Eventually, Jann learns of a contest known as Gran Turismo Academy, which Danny describes as, 'The best Gran Turismo players in the world get a chance to compete in professional racing,' as we see footage of the kids in the competition.Danny's plan is met with skepticism by trainer Jack Salter, who says, 'You really think you're gonna take a kid who plays video games in their bedroom and you're gonna strap them into a 200-mile-an-hour rocket? It'll tear 'em to pieces.'Jack contends that it won't work because, 'the guys who race are elite athletes, your kids are scrawny little gamer kids.''Well, that's where you come in,' Danny tells Jack, as we see footage of Jack training Jann and the other GT Academy hopefuls.",
        "Jack, yelling into a bullhorn, jokes, 'This must be a new experience for you, using your legs,' as one of the contestants stops running and pukes.Jack explains, 'When you're in a race, the cockpit is gonna be 140 degrees Fahrenheit, G-forces will be twice what an astronaut feels upon liftoff.'Jann is in a car when he yells that he can't see anything before spinning out into the tires, as Jack jokes 'Do you get extra points for that in the game?'Jack tells Danny that, 'this whole thing is insane,' but out of everyone before him, Jann is the best, as Jack tells Jann he has won the competition, as he lets out a scream.",
        "'Welcome to Team Nissan,' Danny tells Jann as they share a hug before his introductory press conference.On their way to Jann's first race, Danny explains, 'The other racers are going to hate you,' as we see another race ram Jann's car into the wall, which starts a fight after.Jack also explains, 'If you miss a line in the game, you reset. You miss it on the track, you could die,' as we see a car that takes off flying into the air before landing in flames.Jann proclaims, 'I know this track. I've raced it a thousand times,' as he speeds past other racers as the trailer comes to an end. "
    ]
}