{
    "articleURL": "/wires/ap/article-12049673/Ex-officers-face-sentencing-girls-shooting-death-game.html",
    "content": [
        "PHILADELPHIA (AP) - Three fired police officers who pleaded guilty to misdemeanor charges in the death of an 8-year-old girl killed when they opened fire outside a high school football game near Philadelphia have been sentenced to five years of probation - the first 11 months of it on house arrest.",
        "An investigation found the officers negligently fired 25 shots at a car they mistakenly thought was involved in gunfire that broke out a block away as spectators left the August 2021 football game. In all, four people were hit by police gunfire that sped past the car.Deputy District Attorney Doug Rhoads, speaking Friday in Delaware County Court of Common Pleas, said the officers displayed a \"horrible amount of recklessness,\" even if the outcome was unintentional.Former Sharon Hill officers Brian Devaney, Devon Smith and Sean Dolan had pleaded guilty to 10 counts of reckless endangerment in a November plea agreement that dismissed manslaughter charges filed against them. Authorities said they could not determine which officer fired the shot that killed Fanta Bility.Fanta and her mother had gone to the game at Academy Park High School to see an older sister perform as a cheerleader. Another sister, then 12, was grazed by a police bullet. Fanta died in her mother´s arms.\"For some of the siblings, I think there´s a little bit of survivors guilt,\" Rhoads said. \"Nobody expects to go to a high school football game as a family and not all come home.\"",
        "The sentencing Friday capped an emotional 90-minute hearing during which the defendants spoke directly to the extended family, who had immigrated to the U.S. to seek safety from war-torn Liberia.",
        "Smith, 35, a native of Jamaica, said he had met Fanta and her brother at a playground when they were playing basketball, and later spoke with her several times on patrol.\"She would come up to my vehicle, we would stand there and talk,\" Smith told the family as he offered condolences and an apology. \"I am a father of three. I can´t imagine the pain and agony you feel every day.\"The family said their still-evolving grief takes many forms. The brother no longer wants to go to the playground.Still, they accepted the officers' apologies and extended forgiveness, staying behind in court to hug the three men and wish them well.\"We forgive, but we will not forget Fanta Bility,\" said the mother, Tenneh Kromah. The family has a federal lawsuit pending against the defendants and the police department.However, they do not think the case fits the national narrative simmering since 2020 over race and policing. Delaware County Judge Margaret J. Amoroso applauded both sides for not inflaming the rhetoric around the case.\"This isn´t about blue lives or Black lives, this is about Fanta´s life, and that her life in fact mattered,\" Rhoads said, speaking for the family.The officers said they opened fire after sensing that gunfire was \"whizzing\" past their heads.",
        "\"The conduct that placed me before your honor was a split-second decision,\" said Devaney, 43, who had been a school resource officer at Academy Park since 2013.He was not wearing a body camera that night, and the other two officers did not turn their cameras on, investigators found.The handling of the case initially prompted outrage and protests from the Black community and others as District Attorney Jack Stollsteimer had charged two Black teens who engaged in gunfire a block away - which prompted the police response - with the child´s death. Those charges were later dropped. After a grand jury investigation, the officers were instead charged with voluntary and involuntary manslaughter along with the endangerment counts.Dolan, 26, had joined the Sharon Hill department just 10 days earlier after graduating from the state police academy. He now works in the heating and air conditioning business.\"I was trying the best I could to do the right thing, and came up short. For that I am truly sorry,\" said Dolan, who, like Devaney, comes from a family of police officers.Dozens of family and friends were in court to support the officers.___ Follow Legal Affairs Writer Maryclaire Dale on Twitter at https://twitter.com/Maryclairedale"
    ]
}