{
    "articleURL": "/wires/reuters/article-12049639/FOREX-Yen-set-snap-3-week-losing-streak-bank-jitters-dollar-slides.html",
    "content": [
        "By Rae Wee",
        "SINGAPORE, May 5 (Reuters) - The yen was close to its first weekly gain in nearly a month on Friday, driven by safe-haven demand as bank sector turmoil in the U.S. unfolds, while the dollar fell as traders priced in more aggressive rate cuts from the Federal Reserve.The euro edged away from its recent one-year peak and last stood at $1.1043, after the European Central Bank (ECB) on Thursday slowed the pace of its interest rate increases with a 25-basis-point rise, though the single currency was still higher on the day against a sliding greenback.Although ECB President Christine Lagarde signalled more tightening to come, markets pared back their expectations on how much further rates would rise.\"Lagarde was hawkish in her press conference, but I think financial markets didn't really buy her view on further rate rises in coming months,\" said Carol Kong, a currency strategist at Commonwealth Bank of Australia.In the broader currency market, the yen was last more than 0.2% higher at 133.96 per dollar, and was headed for a weekly gain of over 1.5%, snapping three straight weeks of losses.\"The Japanese yen has slowly gained back its appeal of safe haven status, and has definitely been supported by concerns about U.S. regional banks and the associated safe-haven demand,\" Kong said.",
        "A deepening crisis across U.S. regional banks has kept investors on tenterhooks, with pressure growing on U.S. regulators to take more steps to shore up the sector.Shares of PacWest Bancorp plunged on Thursday, dragging other regional lenders down after the Los Angeles-based bank's plan to explore strategic options heightened investor fears.Canada's Toronto-Dominion Bank Group the same day also called off its $13.4 billion takeover of First Horizon Corp , in another sign of stress within the sector.Traders have since priced in more aggressive rate cuts from the Fed, with Fed funds futures implying a small chance that cuts could come as soon as June and through to the end of the year.That left the greenback broadly lower on Friday, with the dollar index slipping 0.18% to 101.16.The Aussie and the kiwi were among the largest beneficiaries of the sliding dollar, each rising more than 0.5% and touching multi-week highs.Sterling gained 0.27% to $1.26085.\"For the Fed's June decision, inflation data and employment indicators ... along with bank lending standards will be key to watch. The debt ceiling negotiations are another important risk,\" said Sonia Meskin, head of U.S. macro at BNY Mellon.\"We believe the Fed is unlikely to contemplate cutting rates before 2024.\"April's nonfarm payrolls report is due later on Friday, the next major data point that will offer further clues on the Fed's fight against inflation.",
        "Data released earlier this week showed that the U.S. services sector maintained a steady pace of growth in April, suggesting that inflation remains sticky, while U.S. private employers boosted hiring last month.The Australian dollar was last up 0.62% at $0.6735, after touching a two-week peak earlier in the session.The kiwi scaled a one-month high of $0.6317.The Reserve Bank of Australia, in a quarterly statement on monetary policy on Friday, warned that risks to inflation were on the upside given low productivity growth, rising energy prices and a surge in rents as population growth outpaces all expectations.(Reporting by Rae Wee; Editing by Jacqueline Wong and Gerry Doyle)"
    ]
}