{
    "articleURL": "/wires/aap/article-12055117/Indigenous-water-project-delivers-local-community.html",
    "content": [
        "After years of drought when a bushfire caught hold in northern NSW, the small rural Aboriginal community of Jubullum was in danger.",
        "Residents grabbed hoses and started to try to water their houses.And the water ran out.People evacuated and firefighters stopped the flames from destroying all the buildings, but the fire highlighted a problem - water security and safe supply.The infrastructure was old and inefficient and the water supply, pumping from the Rocky River to a tank, wasn't adequate during times of drought and had potential health risks without better filtration.So began the Jubullum Community Water Project, an innovative partnership under the NSW government's Aboriginal Communities Water and Sewerage Program to deliver clean, safe, and reliable drinking water.The project was a joint effort, led by the community in partnership with the NSW Department of Planning and Environment and environmental consultancy Ecoteam.The solution was two-pronged - the construction of a new water treatment plant and river intake to address water quality issues and improve water security, and a program of leak repair works and cultural engagement, including with local school children, to deliver significant water savings.The new water filtration system sits inside a shipping container, which has been adorned with artworks created by the kids in a water workshop with renowned Jubullum artist Lewis Walker.The water is still pumped up from the Rocky River but the newly-installed river intake, combined with the filtration system, repaired pipes and education program means the village has reliable and safe water.",
        "Ecoteam's Keith Bolton said the previous system pumped water straight up from the river and dosed it with chlorine.\"The idea was to get to a minimum use of chlorine and get out all the potential pathogens that can be in river water,\" he said.\"If the river's up and dirty, the water that's coming through the system is too, whereas this gets rid of all of that.\"The water is now filtered through several discrete stations of membranes and carbon fibres and captures microscopic particles, including viruses, and parasites like cryptosporidium and giardia.Christine Collins works for Ecoteam and grew up in Jubullum, on Wahlubul country in the west of the Bundjalung nation, about an hour from Casino.When the river is flowing, most afternoons when they come home from school, the Jubullum kids will go swimming and diving for turtles.\"But during that drought there was no water, just puddles and rocks,\" Ms Collins said.\"None of us, even the old people, had seen it like that.\"Construction of the new river intake system began during the drought, but the system had to be able to sustain flooding.It was also important to the people of Jubullum that any works in or around the river didn't cause erosion or other environmental damage, so the intake is covered in geo fabric and will blend in once vegetation grows.",
        "During floods when people in rural areas are cut off and surrounded by water, if there's a blackout and the water system is dependent on electricity, they lose access to drinking water.When the Northern Rivers region was hit by the catastrophic floods in February and March last year most communities were reliant on helicopter drops of bottled water.But Jubullum, which has its own small substation, kept on pumping - once an electrician had been helicoptered into McGyver-up the substation, which had been taken out by storm damage.Wahlubul woman Angie Collins from the Gungyah Ngalinee Aboriginal Corporation told AAP the water project had made a big difference to Jubullum and she was grateful to the department and Ecoteam.\"It has helped the community, honestly because sometimes you used to get up in the morning and there'd be no water,\" she said.\"Jubullum is a beautiful place. People come here and meet us and then they want to come back.\"The water project is great, especially for the children who are growing up now.\"Tom Attwood, senior project officer with the Aboriginal Communities Water and Sewerage Program, said they had audited 32 houses (almost 90 per cent of the houses in Jubullum) and repaired more than 100 internal leaks.\"Christine was instrumental in the preparation of the leaks and repairs program,\" he said.",
        "\"Going around to houses, chatting to people about their water use habits.\"If we had just sent plumbers around, there probably wouldn't have been anywhere near the same success.\"Thanks to the repairs and an education campaign, water consumption dropped from 100kL/day (100,000 litres) to 40kL/day. This reduced consumption has been consistent for more than 12 months now.For community member Joanne Avery water supply comes down to a simple assessment.\"It's nice and clear,\" she said with a big grin.Ecoteam has worked in partnership with Jubullum before on a sewage treatment system.They built wetlands from reeds and rushes to treat village effluent for reuse onto a lemon grove.The community was engaged at all stages of planning and design, and residents were employed and received on-the-job training during construction.The Jubullum Aboriginal Community Water Project is a finalist in the Australian Water Awards, which will be announced on Thursday, May 11."
    ]
}