{
    "articleURL": "/wires/ap/article-12060311/Down-3-0-Leafs-Big-4-seeking-breakthrough-versus-Panthers.html",
    "content": [
        "SUNRISE, Fla. (AP) - It was almost automatic in every game this season for the Toronto Maple Leafs. Either Mitch Marner, William Nylander, Auston Matthews or John Tavares was going to score a goal.",
        "That was the case, anyway - until the Eastern Conference semifinals.Three games against the Florida Panthers in this series, and that fearsome foursome has been blanked so far.After scoring at least once in 81 of Toronto´s 88 games this season entering this series, Marner, Nylander, Matthews and Tavares have combined for exactly zero goals so far in their matchup with the Panthers.\"Bobrovsky,\" Panthers coach Paul Maurice said, offering the simplest and most accurate explanation. \"That would be the end of that answer.\"That would be Panthers goalie Sergei Bobrovsky, who has stopped everything they´ve thrown at him.",
        "Matthews has gotten 14 shots at Bobrovsky in the first three games. So has Nylander. Tavares has gotten 12 to the net. Marner has taken nine.That´s 49 shots on goal in all - and Bobrovsky is 49-for-49 in those opportunities. The Panthers lead the series 3-0 after a 3-2 overtime win on Sunday and have a chance to send Toronto home via a sweep on Wednesday night.\"We´re trying to do all the right things,\" Marner said. \"I think we´ve had our chances. We´ve had our looks. Just hasn´t gone for us yet. For us, it´s just making sure we´re continuing to do the right things out there on the ice and try to get around that net a little more and try and create second opportunities.\"",
        "The numbers, both to explain all the success those four players had to this point and to explain all the success they're not currently having, are staggering.\"In terms of what I can do, it's continue to put them in positions to succeed. That would be the first thing,\" Leafs coach Sheldon Keefe said Monday. \"And then, just like with the rest of our team right now, focus has got to be on doing what we can control and focus on the things that really, truly matter.\"Toronto's top four scorers combined for at least 10 points in five games this season, had a combined six goals twice - once late in the regular season against Montreal, the other in Round 1 of the playoffs against Tampa Bay - and never had back-to-back games without someone from that group scoring a goal.In this series, it's been back-to-back-to-back games - and counting.\"All different games,\" Maurice said. \"I think (Game 3) was a very difficult game for our goaltender to play. ... These are playoff games. They just turn on the smallest of plays. There´s way more offense than you think because every play is dangerous.\"Marner, Nylander, Matthews and Tavares combined for 146 goals and 351 points during the regular season. But the Panthers have done more than keep them off the scoresheet, other than four combined assists in the three games. They limited their chances in Game 3, which was another big key.",
        "Consider: those four players got only seven shots to the net Sunday night. Nylander had that many, by himself, in Florida's 4-2 win in Game 1. That said, Maurice cautioned that the numbers don't tell the whole story, that a couple of inches to the left or right on a lot of shots would change the way the stat sheet looks.\"We've obviously just got to find a way to capitalize a little more,\" Tavares said. \"They're defending very tight around their net. We just didn´t make the plays we needed to get us the result we want.\"NOTES: Leafs G Ilya Samsonov was scheduled for an MRI exam, Keefe said, to determine the extent of the injury that forced him out of Game 3 early in the second period. Samsonov was feeling better Monday, Keefe said. ... Neither team practiced Monday, just gathered for meetings. ... Monday's line of the day, from Maurice, on his philosophy right now with Florida riding a franchise-record six-game playoff winning streak: \"Play your (butt) off and see what happens.\"___AP NHL playoffs: https://apnews.com/hub/stanley-cup and https://twitter.com/AP_Sports"
    ]
}