{
    "articleURL": "/sport/nba/article-12042073/Kendrick-Perkins-blasts-Grizzlies-disturbing-handling-Dillon-Brooks.html",
    "content": [
        "The Grizzlies made a point to say that Dillon Brooks is not welcome backThe forward struggled vs. the Lakers and tried to antagonize LeBron JamesDailyMail.com provides all the latest international sports newsThe Grizzlies aggressively leaked their displeasure towards Dillon Brooks on Tuesday, and one ex-player has a problem with how the organization is treating him on his way out.",
        "Following Memphis' 4-1 series loss to the Lakers, The Athletic reported that Brooks would not return to the Grizzlies 'under any circumstances,' according to unnamed league sources.And while the firebrand and LeBron James-antagonist struggled mightily vs. LA, Kendrick Perkins believed the parting shot from the team was overkill.'I expected them not to [bring back Brooks], but it's not what you do, it's how you do it,' Perkins said on ESPN's 'NBA Today.''This guy is up for a contract. This guy spent six years in your organization, and a couple of those years he was actually great for you. So my thing is when it comes down to affecting a livelihood, and it's also a reflection of your organization, this is not how you want to be trending.'",
        "Perkins added that he found the treatment of Brooks - who has been with the team since they drafted him in 2017 - to be 'disturbing,' while calling the former Oregon player someone who 'played with heart and passion every single night.''If they didn't want to sign him, so what? Don't sign him! But you don't have to put it out there like that like he committed a damn crime or some off-court distractions, because he was none of that,' Perkins said.",
        "However, Perkins' fellow big man Shaquille O'Neal had a different take on the situation.Speaking on the newest episode of 'The Big Podcast,' the Lakers icon questioned whether Brooks was even worth a roster spot at this point.The Grizzlies forward picked a fight with James by calling him 'old' to reporters after Game 2, and was ejected from the next game for hitting the four-time MVP in the groin.Brooks also skipped postgame media availability on at least three occasions during the series. 'He didn't play well enough to be acting like that,' O'Neal said. 'Now he's going to be out of the league, or he needs to check himself before he wrecks himself.",
        "'He's not athletic, he ain't jumping out the gym, and his jumper ain't like that,' O'Neal added.Brooks averaged 10.5 points per game in the series on just 31.2 percent from the field and 23.8 percent from three-point range.And he wasn't efficient in the regular season, either, averaging 14.3 points on 39.6 percent from the field and 32.6 percent from deep.Aside from just Brooks, the Grizzlies will likely look to retool other areas of their roster after their disappointing first-round exit. "
    ]
}