{
    "articleURL": "/news/article-12040031/Bondi-Beach-pervert-slammed-recording-12-women-sunbathing-topless-avoids-jail-time.html",
    "content": [
        "Christopher Pooley filmed at least 12 womenWomen were sunbathing topless at Bondi BeachHe pleaded guilty, sentenced to community serviceA married man has narrowly avoided jail after he illegally recorded more than twelve women sunbathing on one of Australia's most iconic beaches for his own sexual gratification.",
        "Christopher Pooley, 44, appeared in Waverley Local Court on Wednesday to learn his fate after pleading guilty to filming a person's private parts without consent.The court heard Pooley spent four and a half hours walking along Bondi Beach on February 4 and surreptitiously recorded at least 12 women who were sunbathing topless.He used his iPhone to record the stationary woman as he walked past in a 'disgusting' act slammed by magistrate Ross Hudson.",
        "He said the recordings were 'targeted and lengthy' and constituted a 'massive breach of trust' in the public space.'Just because someone is recorded and it's unknown to them, it doesn't undo the gravity of the offence,' the magistrate declared.'People have a right to their privacy. Not to be filmed. Not to have their images end up somewhere else ... somewhere they can never be removed from.'Pooley's actions were spotted by another beachgoer, who immediately alerted police.The printer admitted he captured the recordings for his own sexual gratification and told police he wanted to see if the images would 'excite him'.The court heard he has an addiction to pornography which had normalised voyeurism to him.",
        "'He believed they were more appropriate than staring at the victims,' Mr Hudson said.The court heard the West Ryde resident planned the 'not opportunistic, not spontaneous' offences, which took place over nearly five hours and impacted more than a dozen women.",
        "Magistrate Hudson said the printer's actions were unjustified and 'in many ways, disgusting'.'You say in some ways this was a victimless crime. It was not,' he said to Pooley.'In terms of a person's safety and sanctity in regard to taking those recordings, you must recognise the damage that does'.The beach pervert had no prior criminal history and good prospects of rehabilitation, the court heard.Mr Hudson sentenced him to an 18 month community corrections order and 120 hours of community service.",
        "He must undergo rehabilitation to address his mental health, his pornography addiction, and to reduce his sexual impulses.Pooley hid his face as he entered the courthouse to learn his sentence for his reprehensible behaviour.Wearing a blue and white checkered shirt and grey pants, he appeared relieved as the magistrate told him he would not spend time behind bars.Eyes hidden behind thick black rimmed glasses, he swore to the court he wouldn't repeat his disgusting actions."
    ]
}