{
    "articleURL": "/wires/reuters/article-12048823/Jan-Lennard-Struff-upsets-Stefanos-Tsitsipas-reach-Madrid-semis.html",
    "content": [
        "Lucky loser Jan-Lennard Struff is stunningly in the Matua Madrid Open semifinals after posting a 7-6 (5), 5-7, 6-3 victory over fourth-seeded Stefanos Tsitsipas on Thursday.",
        "Struff smacked 14 aces in the quarterfinal upset to earn a semifinal date against Aslan Karatsev, who beat Struff in qualifying last week.They will play again Friday with a finals berth on the line. Karatsev advanced with a 7-6 (3), 6-4 victory over China's Zhang Zhizhen.\"Aslan is playing amazing this week so far and he beat me pretty easily in qualies I need to say. I didn't play the best tennis in that match, but he made me play not good I feel like,\" Struff said. \"I think we need to analyze it now, focus on the match tomorrow and I hope I can do better.\"Struff, from Germany, is the third lucky loser to reach the semis of a Masters 1000 event. The others are Thomas Johansson (2004, Toronto) and Lucas Pouille (2016, Rome).Struff recorded 47 winners against 12 unforced errors against Tsitsipas. He jumped out to a 4-1 lead in the final set before finishing off the victory over the Greek.\"It feels amazing. It was a very, very hard battle,\" the 33-year-old Struff said. \"I knew before I needed to perform at my best. Very, very happy that I played this well today. The crowd was amazing. It was an unbelievable atmosphere and really, really happy that I won.\"",
        "Tsitsipas had 35 winners against four unforced errors. He smashed 11 aces.Karatsev registered 29 winners against eight unforced errors in his quarterfinal victory.The Russian fell behind 3-0 in the first-set tiebreak before scoring seven straight points to conclude the set.Karatsev then finished off his victory with a strong second set.\"I am happy with my condition. Back to the top level,\" Karatsev said. \"Playing well and feeling well. From the qualifying, match by match, it has got harder, so mentally you have to be there more because your opponent doesn't give you any free points so you have to be there yourself. The important thing is now recover well.\"Zhang was the first Chinese man to reach the quarterfinals at an ATP Masters 1000 event. He defeated No. 21 seed Denis Shapovalov of Canada, 11th-seeded Cameron Norrie of Great Britain and eighth-seeded Taylor Fritz along the way.Zhang had 11 winners and seven unforced errors against Karatsev.--Field Level Media"
    ]
}