{
    "articleURL": "/tvshowbiz/article-12043129/Meadow-Walker-shows-toned-physique-jet-black-bikini-dumps-cold-water-head.html",
    "content": [
        "Meadow Walker showed off her toned physique in a video that was shared on her Instagram Story on Wednesday.",
        "In the clip, the 24-year-old daughter of Paul Walker wore a form-revealing outfit as she had freezing water poured directly on her head in a spa.The model, who was recently featured in a campaign for Rag and Bone, showcased her sculpted figure in a set of images featuring her husband, Louis Thornton-Allan, that were shared to her account earlier this week.Walker donned a jet-black bikini top that exposed her chiseled midsection and arms, which was paired with a matching bottom.The fashion industry figure's dark brunette locks paired well with the tone of her swimwear.",
        "The model donned a fashionable black one-piece swimsuit while spending time with Thornton-Allan in the photos that were shared to her account earlier this week.The happy couple appeared to be making the most of a trip to the beach in two of the snaps from the photoset.Walker was also photographed as she rested on her husband's back in another shot.The model's final shot showed her animatedly speaking to her spouse during a boat ride.The fashion industry figure announced her engagement to Thornton-Allan in August of 2021 after they went Instagram official with their relationship the month prior.The pair went on to hold a wedding ceremony in Dominican Republic in October of that year.",
        "Several of her late father's castmates from the Fast &amp; Furious franchise, including Jordana Brewster and Ludacris, were present at the event.Vin Diesel, who portrays Dominic Toretto in the film series and was a close friend of Walker's father, walked her down the aisle during the ceremony.",
        "The model went on to speak to Vogue about the ceremony, which ended up being a relatively small affair due to pandemic-era travel restrictions, which did not bother the happy couple.'We couldn’t have imagined it to be any more perfect and personal—and honestly it was easy and simple. Louis and I knew exactly what we wanted from the start. It was a very intimate celebration,' she said.Walker also revealed that the evening ended with the wedding party moving to a beach and witnessing a breathtaking display of pyrotechnics.'We were all barefoot, dancing in the sand. To finish the night, there was a wonderful display of fireworks, and we lit lanterns into the picturesque night sky,' she said."
    ]
}