{
    "articleURL": "/news/article-12058809/Ex-NRL-star-Brett-Finch-splits-wife-convicted-sharing-child-abuse-material.html",
    "content": [
        "Former footy star Brett Finch has reportedly split with his wife Finch narrowly avoided a jail term in November 2022  Disgraced ex-NRL star Brett Finch has reportedly split with his wife of five years, months after he was convicted of sharing child abuse material online. ",
        "Ellie Johnston, who married the 41-year-old in 2018 and shares a three-year-old daughter with him, stood by him throughout his trial.In December - a month after Finch narrowly avoided a jail term for sending 'depraved' voice messages about sex with young boys on a gay chat service in as attempt to score drugs -  Ms Johnston said that their family needed time to heal.But now the Herald Sun has reported that the couple are 'no longer together'.",
        "Ms Johnston, the daughter of Australian Football Hall of Famer and Carlton AFL great Wayne Johnston, met Finch in 2013.While she has posted tributes to her daughter's resilience since Finch was charged, Ms Johnston hasn't shared a single picture or video of her husband on social media since his arrest.Finch, who played 270 NRL games in a 14-year career, is understood to now live off Centrelink payments after being knocked back on an estimated 300 job applications.It is understood he rarely leaves his southern Sydney home. The former halfback was arrested in December 2021 and charged with using a carriage service to publish or promote child abuse after officers intercepted his conversations in an web chat room called FastMeet.Finch was snared in a wider investigation conducted under the banner of Strike Force Hank by officers from the NSW Child Abuse and Sex Crimes Squad.",
        "Judge Phillip Mahony sentenced Finch to a $1,000 two-year good behaviour bond in Sydney's Downing Centre District Court on November 23.",
        "Finch had been under the influence of drugs when he left a series of 'twisted' messages on a gay chat line describing a desire to perform sex acts on boys as young as 12.In court Finch admitted feeling disgust at himself for making the calls and said his only intention had been to obtain cocaine as his drug problem 'spiralled out of control'. He believed the messages would connect him to people who could supply him cocaine. Judge Mahony described Finch's actions as 'highly depraved' and 'absurd' but accepted it had more to do with his chronic cocaine addiction than any genuine sexual interest in children. He said Finch had no criminal record, helped with junior football coaching and charity work and had low prospects of reoffending.'I accept that he is genuinely remorseful for his offending conduct,' Judge Mahony said, noting the ex footballer acted alone while on drug-fuelled binges.",
        "The NSW District Court heard when Finch's online offending occurred he was consuming as much as 25 grams of cocaine per week, which is considered dangerously high usage.Finch has spoken publicly about his past problems with alcohol and drugs.",
        "He had once been in demand as a paid public speaker and had supported multiple charities but had now 'lost everything'.'I understand why no one wants to come near me,' Finch said.'I've got no one else to blame but myself... it's hurt so many other people and that's what I'm sorry for.'Psychologist Chris Lennings told the court Finch's offending was not sexually motivated, but that it was important the ex-footballer was subjected to drug tests.Judge Mahony warned if he breaks the good behaviour bond he could likely be sent to prison. "
    ]
}