{
    "articleURL": "/news/article-12040381/Christies-auction-house-sell-jewelry-belonging-widow-Nazi-Party-member.html",
    "content": [
        "Christie's is planning to sell off 700 jewels worth an estimated $150million that once belonged to the widow of a Nazi Party memberCritics say Heidi Horten was only able to purchase the jewelry because her husband, Helmut, made a fortune off the backs of Jews in the HolocaustHe bought Jewish businesses at reduced rates to build his eponymously named department store franchise Famed auction house Christie's is planning to sell off 700 jewels worth an estimated $150million that all belonged to the widow of a Nazi Party member who made his fortune buying out Jewish businesses.",
        "Anthea Peers, the president of Christie's Europe, Middle East and Africa touted Heidi Horten's collection as 'one of the most beautifully curated' to 'ever come up in the jewelry world.' It includes a sapphire and diamond necklace worth $1.5million and a jadeite and diamond necklace valued at $16.5million.But all of the jewelry was purchased using money her husband Helmut made off the backs of Jews in the Holocaust, when they were forced to sell their businesses — often at greatly reduced rates.Helmut, who was once a member of the Nazi Party, used those businesses to build his eponymously named department store franchise.By the time he died in 1987, Helmut left Heidi with nearly a $1billion inheritance. ",
        "According to David De Jong, author of 'Nazi Billionaires: The Dark Side of Germany's Wealthiest Dynasties,' Horten made his first business acquisition — a modest department store purchased from his Jewish employer in 1933.The owner felt pressured to flee Germany as the Nazis came to power and sold his business at a fair price.But from then on, journalist Stephanie Stephan said, 'Horten developed a routine for seizing Jewish businesses' in a process called Aryanization in which Jews were forced to sell their businesses to Aryans at reduced rates.He would often buy businesses for just 65 percent of their value, De Jong explained to the New York Post, and 'Nazi authorities would be intermediaries in the sales.' ",
        "'They were coerced by authorities or by Horten himself,' he continued. 'They sold cheaply or lost their businesses.'And following the purchases, De Jong said, Horten would take out advertisements in local newspapers proclaiming the businesses were now under Aryan ownership.By 1937, Horten became a member of the Nazi Party.",
        "But, De Jong says, 'he did not have Nazi ideology. He was interested in expanding his business empire.'He was a sheer opportunist who saw an opportunity to grow from a small business owner to a department store mogul by the end of World War II.'As part of his efforts to expand his empire, Stephan said, Horten sought Jewish-occupied businesses in German-occupied territories.She said her father, Reinhold, had been working for Gerzon, the largest department store in Amsterdam when Horten 'used his influence with the German occupiers in the Netherlands to appoint a German administrator' who would steer the businesses to him.'This man immediately fired my father because he opposed Aryanization and advised the owner not to sell,' she said.Unfortunately, the Jewish business owner did not heed her father's advice, and sold his business after being pressured. He had planned to escape to America, but was soon captured by the Nazis.'My father led a lawsuit against Horten, consulted lawyers and spent a lot of money in the process,' Stephan recounted. ",
        "'Unfortunately, since most of the judges were old Nazis, and Horten had a good relationship with them, my father lost the case.'Helmut married Heidi in 1966 when she was 19 and he was around 50 years old.Before she died last year, Heidi commissioned historian Peter Hoeres to research and write about her late husband's past.In his report, Hoeres acknowledges Horten had exploited Jewish business owners, he had initially paid 'quite normal market prices' for their business.He also cited several instances where Horten kept Jews on as wither employees or suppliers, and noted that although he was a member of the Nazi party, h was later expelled.But, he also said his report surfaced information that Horten used forced labor at a Berlin company he purchased in 1943 that repaired airplanes. Officials at Christie's acknowledged the painful history Horten's estate is built on in their listing for the auction, which is set to begin online on May 3 and in person in Geneva, Switzerland, on May 10.'We are aware there is a painful history,' Peers told the New York Times. 'We weighed that up against various factors.' In a statement to the Post, Guillaume Cerutti also acknowledged 'awareness of the well-documented business practices of Mrs. Horten's late first husband during the Nazi era when he purchased Jewish businesses sold under duress.' ",
        "But, he said, 'all proceeds from the sale will be directed to a foundation, which supports philanthropic causes, including health care, children's welfare and access to the arts.'",
        "The website for the auction also said 'Christi's will make a significant contribution from its final proceeds of this auction to an organization that further advances Holocaust research and education.'The controversy comes just months after a French court ordered Christie's London to return The Penitent Magdalene by Dutch artist Adriaen van der Werff to the heirs of its Jewish owner after it was discovered the 18th-century work was looted by Nazis.The painting was originally owned by Lionel Hauser, an art collector and Jewish banker in Paris who reported in 1945 the Nazis confiscated his entire art collection — including The Penitent Magdalene — from his Paris home three years earlier.The French government later included photographs of the stolen artwork in its official catalog of items looted by Nazis in the country.But when Christie's sold the painting in 2005 for $115,185 its sale did not include a provenance history that mentioned Hauser's previous ownership.Then in 2017 when the painting's current owner, an anonymous British collector, approached Christie's about selling the painting again its researchers discovered it once belonged to Hauser, at which point its legal team contacted his heirs and offered to split the proceeds from the sale between the heirs and the current owner.",
        "It refused, however, to turn over the painting to Hauser's heirs, claiming there is a statute of limitations under British law since more than six years had passed since the painting was sold in 2005. Hauser's family then sued Christie's London last June in Paris civil court, and in February a judge sided with them.Christie's must now pay the family a $545 daily fine for any delays identifying the painting's current owner and location, as well as $10,900 in procedural fees. "
    ]
}