{
    "articleURL": "/wires/ap/article-12044581/Liam-Hendriks-ready-ramp-beating-lymphoma.html",
    "content": [
        "CHICAGO (AP) - Wearing a black T-shirt with white lettering that read \"STRUCKOUT CANCER,\" Liam Hendriks directed a few well-placed jabs toward a couple of his teammates. He joked about his reading habits and chuckled as he explained how he actually gained weight while fighting non-Hodgkin lymphoma.",
        "It was the same old Hendriks - as if the fight of his life had only reinforced everything the Chicago White Sox closer already knew.\"It was never a thing to me where I ever worried,\" Hendriks said. \"Like I never self-involved and looked into it as a `Why me?´ thing. I looked at it as a `Why not me?´\"That's how Hendriks got through all of it. From noticing lumps on his neck last summer to a diagnosis of stage 4 non-Hodgkin lymphoma and then immunotherapy and chemotherapy, all the way to a clean bill of health last month. All the way to a Triple-A rehab assignment that begins Friday.All the way back to the White Sox - quite possibly, very soon.\"It hasn´t changed my outlook on life, but it´s definitely made me miss being in this clubhouse,\" Hendriks said Wednesday in his first media session since he announced his diagnosis in January. \"It´s made me miss being a part of the team.\"",
        "The White Sox also missed their eccentric Australian closer.\"No matter what we do as a team, this is the best news of the year,\" right-hander Lucas Giolito said. \"He beat cancer. He's back. He's going to compete at a very, very high level.\"Chicago manager Pedro Grifol said the plan is for Hendriks to make four or five rehab appearances in the minors before determining if he is ready to return to the majors. How Hendriks feels will be the determining factor.",
        "\"He lifts us all up. He´s an inspiration to us all,\" Grifol said. \"And just the way he went about it is just incredible.\"The 34-year-old Hendriks has 115 saves and a 3.81 ERA over 12 seasons with Minnesota, Toronto, Kansas City, Oakland and Chicago. He signed a $54 million, three-year deal with the White Sox in January 2021.Hendriks led the American League with a career-high 38 saves in his first year with Chicago. The right-hander was third in the majors with 37 saves and made his third All-Star team in 2022, but he felt drained toward the end of the year - and now, he thinks he knows why.\"With the lumps in my neck coming around June, when I got the PET scan done, one, I looked like a Dalmatian, which is not great even though we have one,\" he said. \"But it turned out the ones in my hips were actually bigger.\"So, there´s no way to put a real timeline on it, but if I had the ones in my neck in June and the ones in my hip were bigger, there was always the chance that I pitched damn near all year with lymphoma in my system.\"Hendriks stayed active after his diagnosis, throwing bullpen sessions as his teammates prepared for the season during spring training. His wife, Kristi, was a constant presence at this side, and he said he could never thank her enough for what she did.",
        "He was backed by support from all over the majors, including letters from kids in Toronto who wrote about how they liked him more in a Blue Jays uniform than a White Sox uniform. A text message from Chicago Cubs pitcher Jameson Taillon - another cancer survivor - also stayed with him.\"'It´s your journey. Nobody can tell you what to feel or what to do baseball-wise. Do whatever you feel is right.'\" Hendriks said, reading Taillon's message from his phone. \"That was on January 30th ... that was one of the messages that really hit me, hit me in the eyes. I think it was right around the next day or a couple of days later I was on the mound throwing a bullpen.\"___Follow Jay Cohen at https://twitter.com/jcohenap___AP MLB: https://apnews.com/hub/MLB and https://twitter.com/AP_Sports"
    ]
}