{
    "articleURL": "/tvshowbiz/article-12048391/Operation-Repo-star-Sonia-Pizarro-dies-sleep-60.html",
    "content": [
        "Operation Repo's Sonia Pizarro died her sleep Wednesday at the age of just 60, her niece and co-star Lyndah Pizarro revealed.",
        "Although Sonia had a stroke that left her in the hospital in 2018, Lyndah told TMZ that her death was not brought on by its complications.Meanwhile Sonia's ex-husband Froylan Tercero, another Operation Repo personality, paid a gushing tribute to her in the wake of her passing.'She will always have a place in my heart and on my body since I still have her name tattooed on my stomach,' he said: 'Sonia we love you and I will honor you with all the good mementos you gave me, thank you and I love you.'Froylan, who also co-starred with Sonia in the 2009 comedy Repo Chick, hailed her as 'a bad a** chick that kicked some serious a**.' ",
        "Operation Repo was a family enterprise for Sonia - not only did some of her relations star with her on the program, but her brother Lou Pizarro was also the creator.The series, which began as a Spanish show on Telemundo before landing at truTV in English, follows car repossessions in the San Fernando Valley.A group of actors including Sonia was assembled to play fictionalized versions of alleged true stories set in the suburbs of Los Angeles.Operation Repo built up a devoted fanbase, who fell in love with its rollicking style and its catchphrase: 'It ain’t no joke if you don’t pay your note.' ",
        "After Sonia began her run on the show, she also starred in spin-off movies including Operation Sonia: Love Thy Sleeping Neighbor in 2016.She featured in Operation Repo: Lou's Revenge later that same year, and then in 2018 played a homeless woman in a movie called Followed. Sonia is survived by her children Ruby, Robert and Froylan Jr. and her three grandchildren Bryant, Brie and Danica.Her death comes nearly five years after another Operation Repo star, Carlos Lopez Jr., committed suicide by gunshot at the age of just 35.",
        "His roommate discovered him on their apartment balcony, and when the emergency services arrived they pronounced Carlos dead in situ.Carlos, who featured in the Tom Cruise movie American Made, was also an army veteran and according to TMZ served 37 months in combat with 82nd Airborne.His grief-stricken family posted a Facebook tribute that began: 'Our hearts are heavy. Our handsome adventurous and loving son Carlos Jr. Left us for Heaven yesterday and our hearts are so heavy.'They added: 'Keep our family and Carlos’s friend Ronnie Lee in your prayers please. We’ve lost our eldest son and military warrior.'"
    ]
}