{
    "articleURL": "/wires/reuters/article-12059683/Chilean-peso-rallies-right-wing-victory-constitution-vote.html",
    "content": [
        "SANTIAGO, May 8 (Reuters) - Chile's peso currency strengthened against the dollar on Monday, after right-wing parties won a majority of seats in a new council that will lead a redraft of the Andean country's dictatorship-era constitution.",
        "The Sunday ballot, in which right-wing parties won 34 of the 50 seats on the council, marked a sharp shift from a progressive majority that drafted a failed first constitutional rewrite, a move economists see benefiting local assets at least in the short term.The peso was trading up 0.66% to 788.50/788.80 per dollar following the results, although doubts remained over whether dialogue between all parties would be achieved for a new draft to garner enough popular support.The constitutional advisers elected on Sunday will start drawing up a new constitution in June, with voters approving or rejecting it in December.\"The positive evolution of local assets in the medium-term will depend on the ability of the Constitutional Council to draft a constitution that can be approved in the next electoral process,\" economists at Scotiabank said.The first rewrite, drafted largely by independent and left-wing constituents and considered one of the world's most progressive constitutions, was rebuffed by voters in September.Andres Abadia, Pantheon Macroeconomics' chief Latin America economist, said the right-wing control of the council would lead to lower political risks, helping to keep financial metrics under control and supporting the local currency.Speaking to reporters at a meeting of government ministers in Santiago, Finance Minister Mario Marcel said he hoped the result could lead to progress on tax reform that was previously shelved by Congress.",
        "\"We believe that we can now reactivate conversations and move forward in the dialogue process in a more structured way surrounding tax reform,\" Marcel said, adding that this is an opportunity to quickly \"reduce economic uncertainty in the country.\"\"Indefinite postponement of important topics like tax reform, pension reform or the constitutional process helps no one,\" Marcel said.JPMorgan economists also said the results could be positive for investments \"if well managed\", while noting the recent pendulum behavior of Chilean voters was a warning signal in the sense of settling the debate and allowing uncertainty to ebb.\"Our central scenario assumes the institutional design of the new constitution process is to help offer a minimalist new constitution so to gain enough popular support in December,\" they said.\"(But) political strategies ahead could offer surprises.\" (Reporting by Froilán Romero, Gabriel Araujo and Natalia Ramos, editing by Ed Osmond and Bill Berkrot)"
    ]
}