{
    "articleURL": "/tvshowbiz/article-12044765/Inside-Kyle-Sandilands-buddymoon-Radio-host-wife-Tegan-head-St-Tropez.html",
    "content": [
        "Kyle Sandilands and Tegan Kynaston tied the knot in a lavish ceremony last Saturday on the grounds of the $100million Swifts mansion in Sydney's Darling Point.",
        "And after splashing out a rumoured million dollars on their wedding, the cashed-up newlyweds aren't holding back on their delayed honeymoon either.Kyle, 51, and Tegan, 37, will travel to the south of France next month to celebrate their nuptials, and will be staying at a $4,000 per-night chateau.Boasting six bedrooms, a spacious living area and breathtaking seaside vistas, the accommodation will be the perfect place for the couple to spend their first weeks as husbands and wife.But they won't be alone in this romantic paradise.",
        "Tagging along for the ride will be Kyle's radio co-host Jackie 'O' Henderson and her daughter Kitty; his long-serving manager Bruno Bouchet and his Triple M producer wife Laura; and nightclub mogul John Ibrahim and his fiancée Sarah Budge.Bruno and John also served as groomsmen at the wedding.The star-studded entourage will shell out a whopping $29,000 per week for the privilege of staying in the lap of luxury.",
        "Speaking to Daily Mail Australia, Kyle revealed he and Jackie plan to broadcast their hit radio show live from the south of France, giving listeners a taste of the high life.'Unfortunately, I'm still going to be working, so I'll be doing the radio show from the south of France as well,' he said.",
        "'I'll get two weeks off from work, but I'll do one week of it [overseas] and Jackie's going to come.'",
        "Kyle joked that KIIS FM newsreader Brooklyn Ross and producer 'Intern Pete' Deppeler had also managed to wrangle their way into the trip.'So that will be some honeymoon!' he laughed.Kyle spared no expense to impress his 130 guests on his wedding day, splashing out on a huge marquee, multiple decorative chandeliers, a five-tier wedding cake and a revolving photo booth normally used at red carpet events.Guest also snacked on prawns, caviar and oyster shooters before sitting down to a three-course dinner.",
        "The star-studded guest list included Karl Stefanovic and his wife Jasmine, as well as singer Guy Sebastian and his stylist wife Jules.In addition to being a guest, the Australian Idol star performed twice at the nuptials.Prime Minister Anthony Albanese also attended with his partner Jodie Haydon."
    ]
}