{
    "articleURL": "/wires/afp/article-12058603/Young-Senegalese-revel-graffiti-school.html",
    "content": [
        "Pencil and rubber in hand Ibrahima Soumare takes his time as he carefully traces the outline of a handful of letters on a white piece of paper.",
        "Dissatisfied, he tosses the effort away and starts again on today's exercise: Draw a piece of graffiti bearing the word \"Top\".\"It's not easy, especially for a newbie such as myself,\" says Ibrahima with a shy smile.The 26-year-old Senegalese abandoned other studies to register at RBS Akademya, a graffiti school in the Dakar suburb of Guediawaye.In the capital Dakar, graffiti forms part of the urban backdrop, especially along certain major highways through the capital and out into the suburbs where many youngsters have a craze for hip-hop.Graffiti is considered an art form in Senegal, the works often bearing messages on issues such as politics, education, health and the environment.The school, which opened its doors in December 2021, \"wants to serve as a meeting place, a place to exchange, to share, one of savoir-faire,\" says Serigne Mansour Fall. Better known as Madzoo, he is one of a 25-strong founding collective behind the project.The objective, says Madzoo, \"is to bring to the table our heritage... to train young professionals\" to be useful to society and enable people to \"understand the challenges of their era\".- Recognition -Long seen by many as \"a pastime for the lazy that couldn't earn a man a crust\", in Madzoo's words, graffiti is gaining increasing recognition. The founding of the RBS Akademya was a timely stroke of luck for fans seeking formal training.",
        "Art tableaux and graffiti pieces jockey to show off their beauty and colour in the corridors of the two-storey building that houses the school.One arresting painting of an old, white-bearded man draped in blue fabric draws the visitor's gaze, a small plant made up of shells sprouts from his shaven head.\"He symbolises Pan-Africanism,\" explains Madzoo, the artist of the work.The classroom, with a long work table and wall chart, is no less original. Large letters in a mix of pink and green decorate the wall at the entrance. It is difficult to make out what is written.It is \"Style\", Soumare says. \"I also had trouble reading it,\" he admits with a smile.Today's course revolves around \"concept art\" -- how to express or create an idea -- and \"colours\", says Cherif Tahir Diop, aka Akonga, a graffiti artist, designer, and now teacher.- Theory and practice -\"Here, we are not in a conventional school. Everything is done in a light spirit,\" he says against a soft backdrop of reggae music.",
        "Like Ibrahima, Libasse Sarr, 18, and Maurice Diouf, 25, have given up study programmes to join the Akademya's ranks for six months of three classes a week mixing graffiti theory and practice.They will leave with a certificate -- albeit one not recognised by Senegalese state authorities.",
        "To register at the school costs 25,000 CFA francs (40 euros) and then 15,000 francs per month. The money goes towards buying material for lessons and the school's rental charges.RBS Akademya, very active on social media such as Instagram and Facebook, also serves as an artists' residence.According to Madzoo, some international artists stay there periodically to join exhibitions or share their experiences.Introduced to graffiti art aged just seven by older youths in his district, the bespectacled Madzoo, 36, is today seen as one of Senegal's leading \"street art\" figures.- Political pictures -He describes himself as a Pan-Africanist \"on the people's side\" who happily airs his political views.In March 2021, after serious rioting in Dakar following the arrest on rape allegations of opposition leader Ousmane Sonko, one of Madzoo's murals bearing the signature of his collective was widely shared on social media.",
        "It represented President Macky Sall, his blazer sleeve in French red, white and blue, shooting at point blank range at a youth holding a Senegalese flag.The drawing was swiftly removed from public view and Madzoo says the authorities have since had him in their sights.Though graffiti does not offer many outlets, Madzoo's students hope one day they will themselves know his success, but they \"will have to be patient and strong\", cautions Akonga.",
        "Sarr, says he enrolled in the school out of \"passion\".\"I don't ask myself too many questions about the future, but I dream of travelling around the world to express my talent and improve my skills.\""
    ]
}