{
    "articleURL": "/wires/pa/article-12060443/Police-teenager-stabbed-death-Dagenham.html",
    "content": [
        "A teenager stabbed to death near Dagenham Heathway Tube station on Friday night has been named by police as Wazabakana Elenda Jordan Kukabu, known as Jordan.",
        "Metropolitan Police officers and the London Ambulance Service were called shortly before midnight on May 5 to reports of men armed with machetes near the station in east London.Officers found 18-year-old Mr Kukabu, from Romford, with stab injuries. He died at the scene.Police said a second man, aged 20, was also taken to hospital with a stab injury – but his condition is non life-threatening.A 20-year-old man was released with no further action after police arrested him on suspicion of murder, the force added.But the same man was also arrested on suspicion of violent disorder and has been released on bail for this offence.",
        "Police said Mr Kukabu’s family have been made aware and are being supported by specialist officers.A post-mortem examination held on Sunday gave a cause of death as a single stab wound to the chest.Detective Chief Inspector James Shirley, from the Specialist Crime Command, said: “My thoughts remain with the young man’s family and friends.“Dedicated detectives have been working around the clock since this tragic incident as we strive to identify and apprehend those responsible for killing Jordan.“Our investigation is making significant progress. Local people have provided us with information, which together with forensic inquiries and analysis of CCTV is enabling us to build a picture of what happened on Friday night.”",
        "Superintendent Martin Rolston, of the Met’s East Area Command Unit, said: “I am well aware of just how much this shocking incident has affected people in Dagenham and the surrounding area.“I share their concerns and can assure local people that the Met’s investigation is painstaking and completely focused on getting justice for the family and friends of Jordan.”Anyone with information is asked to contact police on 101 or tweet @MetCC quoting 8711/05May or contact Crimestoppers on 0800 555 111."
    ]
}