{
    "articleURL": "/sport/football/article-12055203/GARY-MABBUTT-Liverpool-fans-booed-anthem-minority-spoiled-chance-unity.html",
    "content": [
        "Liverpool fans drowned out the national anthem ahead of their win on SaturdayGod Save the King was played at Anfield to mark the coronation of Charles IIIA small minority ruined what should have been a moment of unity We live in a democracy with everyone enjoying the opportunity for freedom of speech and the right to peaceful protests, but is it really acceptable to use the King’s coronation as a political football? ",
        "The people who used that freedom to disrespect the National Anthem on Saturday should know they are badly out of step with 99 per cent of the country. To play for your country and standing there with the Three Lions on the shirt singing the National Anthem was one of the best feelings in my footballing career and this was not the occasion to disrespect ‘God Save The King’ while the rest of the country were partying, being happy and glorious. The King’s coronation was an opportunity for the country to unite behind something positive, on an occasion hardly any of us have experienced before. Why should they want to try to spoil that? ",
        "I find it surprising and extremely disappointing. I have been an ambassador of the Prince’s Trust since the time when I was the captain of Spurs, and having seen the amazing work that Prince Charles has done during over his life, I know he will make an excellent King Charles III. He is a warm and intelligent human being, he understands the role that he has taken on and will do so with aplomb. I have been very lucky to have met the Royal family over the years and while travelling the world I have appreciated the special respect that they hold.",
        "This cannot be blamed on any club or its supporters, but on a minority of people who wanted to vent their frustrations, but this was not the time and place. "
    ]
}