{
    "articleURL": "/wires/ap/article-12058265/Booker-Durant-score-36-Suns-series-Nuggets.html",
    "content": [
        "PHOENIX (AP) - The Denver Nuggets - understandably - were putting a huge share of their defensive pressure and attention on Phoenix's high-scoring duo of Devin Booker and Kevin Durant in the fourth quarter of Game 4 on Sunday night.",
        "\"We were trying to make other guys beat us not named Booker, not named Durant,\" Nuggets coach Michael Malone explained.Landry Shamet obliged.Shamet made four crucial 3-pointers in the final period, Booker and Durant both scored 36 points, and the Suns beat the Nuggets 129-124 to even their Western Conference semifinal playoff series at two games apiece.Booker also finished with a playoff career-high 12 assists, including a few to Shamet, who finished with 19 points on 5-of-8 shooting from 3-point range. Shamet had scored 14 points the entire postseason before Sunday.\"Just making quick decisions, just trying to make the defense pay,\" Booker said.",
        "The series returns to Denver for Game 5 on Tuesday.Denver lost despite a huge game from MVP runner-up Nikola Jokic, who poured in 53 points on 20-of-30 shooting.Jokic used his physical play to knock down several big buckets, even ripping the ball away from Suns owner Mat Ishbia at one point after the ball went out of bounds, which earned the Nuggets All-Star a technical foul.\"I was making shots, attacking the paint,\" Jokic said. \"It was just one of those nights.\"The Suns took a 98-92 lead into the fourth quarter after a scoring flurry from Booker, who had 17 points in the third. Phoenix wouldn't trail in the fourth, though Denver didn't go quietly.",
        "The Nuggets trailed 116-106 with 4:55 remaining but never panicked, slowly cutting into the lead. They pulled within 123-120 with 22.4 seconds left but TJ Warren made two free throws to push the margin back to five.Booker - averaging 37 points on 60% shooting in these playoffs - was hot once again, shooting 14 of 18 from the field, including 3 of 4 on 3-pointers.\"I'm just trying to win,\" Booker said. \"Throw that efficiency (expletive) out the window, I don't care about that. Just keep going. Keep attacking, keep being aggressive. If it's a product of getting open shots and knocking them down, that's what I'm supposed to do.\"Jamal Murray added 28 points and seven assists for the Nuggets.Suns point guard Chris Paul missed his second straight game with a strained left groin suffered during Game 2.The Suns took a 63-61 lead by halftime. Jokic had 24 points for the Nuggets before the break while Durant had 21 for the Suns.JOKIC VS ISHBIAJokic was assessed a technical foul in the second after a bizarre altercation with Ishbia.Late in the period, Suns guard Josh Okogie crashed into the seats while trying to save a loose ball. He landed in a group of fans on the baseline that included Ishbia, who grabbed the basketball.",
        "Jokic was trying to get the basketball quickly - apparently so the Nuggets could start their offensive possession - when he tried to take the ball away from Ishbia. The ball flew backward into the crowd, and then Ishbia was knocked backward by Jokic´s elbow.\"The ball went over into the corner there and one of the fans was holding the ball,\" referee Tony Brothers said to a pool reporter. \"Jokic came to get the ball, grabbed it away from the fan, then after that he deliberately gave him a shove and pushed him down, so he was issued an unsportsmanlike technical foul.\"There were a few minutes of confusion as officials sorted out the weird scene, and then Jokic was assessed a technical foul.Ishbia told The Associated Press at halftime that he was \"fine\" and more worried about the game than the altercation. He was back in his usual seats in the second half.AYTON'S BIG OVATIONSuns center Deandre Ayton was the subject of scorn from media and fans following his subpar performance in Game 3.Ayton had just four points and nine rebounds in Game 3 and the former No. 1 overall pick was benched in the fourth quarter in favor of Jock Landale.But the big man got the fans back on his side during the first offensive possession of the night, grabbing three consecutive offensive rebounds before Booker hit a short jumper as the crowd roared.",
        "\"I thought that set the tone for the game,\" Williams said.Ayton finished with eight points and eight rebounds.TIP-INSNuggets: Aaron Gordon and Michael Porter Jr. each scored 11 points.Suns: Booker scored 13 points on 5 of 6 shooting in the first quarter. He scored 18 points in the first quarter of Game 3.___AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP_Sports"
    ]
}