{
    "articleURL": "/news/article-12059789/Biden-says-VETO-House-Republican-border-bill-vote-week.html",
    "content": [
        "The House package would bring back a number of Trump-era immigration policies - including Remain in Mexico and border wall construction It would also resume construction of the southern border wall, make it easier for minors who cross without their parents to be deportedThe House is set to vote on a sweeping immigration bill Thursday - on the day Title 42 is set to expire - and President Biden has already announced he would veto the legislation.",
        "'While we welcome Congress' engagement on meaningful steps to address immigration and challenges at the border, this bill would make things worse,' the White House said in a statement. The immigration and border security bill has been in the works for months after Republicans made the issue front and center to their campaign to take back the House. Title 42, the pandemic-era public health policy that allows for the immediate expulsion of migrants, is set to expire Thursday as Texas is sending in its tactical border force and the White House is deploying active duty troops to help with the deluge of migrant processing. The House package would bring back a number of Trump-era immigration policies - including Remain in Mexico, which requires those claiming asylum to wait in Mexico while their U.S. asylum claim is processed. It would also resume construction of the southern border wall, make it easier for minors who cross without their parents to be deported and allow for migrant families to be held in detention for a longer period of time, in hopes of ending 'catch and release' policies. ",
        "The bill would end Biden's use of humanitarian parole targeted directly at certain nationalities, which the administration uses broadly for Venezuelans, Haitians, Cubans and Nicaraguans. It would make the use of e-verify for hiring employees mandatory and only allow asylum claims to be accepted for those who do not cross the border illegally.  ",
        "It would also restrict federal funds for non-governmental organizations (NGOs) that support migrants at the border direct more money for border security technology and hiring more border agents. GOP leadership is confident the bill can get to 218 votes in the House, sending it to the Senate where it's unlikely to get a vote. At least two Republicans have said they will vote against the bill -- libertarian-minded Rep. Thomas Massie opposes the e-verify requirements and Rep. Dan Crenshaw, R-Texas, thinks the bill does not do enough to combat drug cartels. cRepublicans have been quick to note there have been some five million apprehensions at the southern border since Biden took office. Now, some Democrats  are calling on the president to negotiate some sort of reform with House Republicans.Democrat Rep. Sharice Davids wrote to Homeland Security Sec. Alejandro Mayorkas on Monday demanding he engage in immigration talks. 'You have had a year to engage prior to the lifting of Title 42, and I hope that you and the President both recommit to working with Congress to achieve real results,' she wrote. ",
        "Meanwhile Senate Republicans introduced their own border package that takes another dig at the funding to hire 87,000 IRS agents passed in Democrats' Inflation Reduction Act (IRA) -- redirecting $15 billion meant for the tax agency to the southern border. ",
        "That bill, led by Sens. Bill Cassidy and Tim Scott and co-sponsored by six others, would fund border inspections, the border wall and technologies for enforcement, end catch-and-release policies. The new policy plays come as the deadline for Title 42 is fast-approaching - the pandemic-era public health policy that allows for immediate expulsion is set to expire on May 11. ",
        "Last Thursday Mayorkas and Sec. of State Antony Blinken held a rare joint press conference to explain their path forward as Title 42 draw to a close.  'Our border is not open and will not be open after May 11th,' Mayorkas said, even as he said encounters would 'increase' once the policy is lifted. The Department of Homeland Security has predicted agents could see as many as 10,000 migrant crossings per day once the policy expires. Over the weekend border patrol made some 26,382 apprehensions, seized 83 pounds of meth and 11 pounds of fentanyl, according to U.S. Border Patrol Chief Raul Ortiz. The Biden administration plans to expand legal migration and open processing centers in South and Central America allowing migrants hoping to enter to be pre-screened to see if they meet basic qualifications for different forms of entry before making the journey. The centers will begin operating in Guatemala and Colombia in the coming weeks. Canada and Spain have also agreed to accept migrants from the centers. "
    ]
}