{
    "articleURL": "/travel/article-12048427/We-flight-attendants-worst-parts-job.html",
    "content": [
        "Aja Bailey has worked as cabin crew for both commercial airlines and private jetsCaroline Kneitz worked as an Emirates flight attendant for six yearsBoth say behind the scenes, being a flight attendant can be very tough While they might be all smiles in the air, two flight attendants have revealed that there are many downsides to their jobs.    ",
        "Aja Bailey, who has worked as cabin crew for more than eight years for both commercial airlines and private jets, says some of the tougher aspects of her work include missing every social event and altitude-induced health issues.Meanwhile Caroline Kneitz, who worked as an Emirates flight attendant for six years, says difficult passengers were a constant stress.Some of her least pleasant memories include witnessing a drunk man beat his wife and a man who she told to stop smoking blowing e-cigarette smoke in her face. Take a flight down to learn more of their insights around what goes on as a flight attendant, behind the scenes.",
        "Health concernsAja says being constantly exposed to high altitudes can lead to various health concerns such as dehydration and exhaustion, so it's 'important to prioritize your health in this industry.'She once had to get an IV drip because she was 'super dehydrated.' The globetrotter explained: 'With the job you can be so busy sometimes that you forget to drink water and eat. It's not like a nine to five job where you get a lunch break. 'When you take back to back trips sometimes there is no break in-between. Now I have to tell myself to stop, have a granola bar, have a protein bar... I'll pack a protein shake and just something to nibble on throughout my journeys.'",
        "Difficult passengersCaroline says she had a number of difficult passengers during her time as a flight attendant, which made the job very stressful at times. Some of her least pleasant experiences included a passenger blowing an e-cigarette into her face after being asked to stop smoking and one time she witnessed a drunk guy beating his wife in the middle of a full flight. Then, she remembers many passengers complaining about the food, either 'expecting restaurant quality meals or recipes that don't even exists.'She adds: 'Once a boy came up to me and demanded to be given a burger!'The seatbelt sign was 'another classic', Caroline says, and 'by far the highest point of contention between crew and their passengers.'She explains: 'A crew WILL have at least one argument per flight about this with a passenger. At our company that meant quite often taking a trip to the manager's office, reports and possible implications on your record.' Even families can prove difficult in certain situations, Caroline says. She recounted one particular incident: 'One family insisted on a baby stroller service which is only available at our home base. 'So after the plane landed and people disembarked, they insisted to the point that they refused to get off the plane. Eventually security needed to be called to remove the family.'",
        "Dealing with peoples' messMany passengers leave lots of mess behind them, the ladies say, but Caroline says the worst she had to deal with was human feces. Recalling the unpleasant incident, she said: 'Once our flight was delayed out from Dhaka, Bangladesh, because certain seats were soiled in feces and we did not have sufficient spare covers. 'It was like the entire interior needed an overhaul after a four hour flight. 'As people leave lots of mess in their seats, especially crumbs and food debris, it is very common to request for a cover change once passengers have disembarked. It can get pretty gross.'Heavy workloads and multitasking  To be a flight attendant, both women say you need to be like a 'Swiss army knife', as you are expected to do so many different tasks. Caroline added: 'There's a term we used as a nickname for air stewardesses, 'octo stew', because of the idea we would need octopus arms to get things done.'Aja says on private jets you have even more responsibilities as often you are working alone. She explains: 'Private jet flight attendants are responsible for a wide range of tasks, including cleaning, stocking, and preparing meals, which can be very physically demanding.' Medical emergenciesAnother role both women had to unexpectedly take during their time in the skies was 'medic.'",
        "Both say they have witnessed lots of medical emergencies. Aja said the most stressful situation she encountered was when a passenger passed out she had to administer CPR. Meanwhile, Caroline said she witnessed many old people suffering heart attacks but two of the most traumatic incidents she dealt with was the death of a four-year-old on the way from Dubai to Munich due to a high fever and a lady suffering a miscarriage from Australia to Dubai.'She was in dire pain for about 14 hours and bleeding like crazy,' Caroline said.One of the more bizarre medical emergencies she encountered was a woman who couldn't get a ring off her finger as it had swelled so much. As a result they had to perform an emergency landing to save her finger.",
        "Missing big life eventsBoth women say that due to their work, they missed many social events, from birthdays to weddings to family gatherings. Aja says this is something she has accepted but it can be hard at times. She mused: 'I've missed every big event due to my career. 'I've missed weddings, I've missed thanksgivings, Christmases, lots of birthdays. It just comes with the job and the territory. 'People typically fly on holidays and they want to see their families. So flight attendants and pilots are typically working during those big, special days.' ",
        "Low and irregular payOn the pay side of things, both Aja and Caroline say salaries can vary wildly.According to job side Indeed.com, the average base salary for a flight attendant in the U.S. is $39,448.When she started out in the industry, Aja said her pay was 'not livable for the year' and her training - which took two months - was unpaid. Now, on private jets the perks are much better but the shifts can be irregular so she must have cash saved in case jobs don't come in. Meanwhile, Caroline said her salary was much better as she worked for a Middle East airline. She revealed: 'Pay for Middle Eastern airlines is good because it's tax free and living expenses fully covered. So you're making about $3,000 a month which isn't bad.'"
    ]
}