{
    "articleURL": "/news/article-12056883/Tucker-Carlson-preparing-war-Fox-News-ousting.html",
    "content": [
        "Tucker Carlson is reportedly 'preparing for war' against FOX News to let him out of his contract, which expires in January 2025Executives at the network are said to be paying his $20 million-a year salary so long as he does not join another news organizationBryan Freedman, his lawyer, said 'the idea anyone is going to silence Tucker and prevent him from speaking to his audience is beyond preposterous'Ousted FOX News host Tucker Carlson is 'preparing for war' against his former network as he plans his next career move, according to a new report. ",
        "Carlson, 53, was suddenly fired from the network last month after 14 years, with no explanation given as to why the company would let their most-watched anchor go.But Carlson's contract at FOX News, in which he was paid $20 million a year, does  not expire until January 2025 — after the presidential election.Carlson is still being paid and therefore is prohibited from joining a rival network or starting his own, Axios reports. ",
        "But his attorney Bryan Freedman told Axios: 'The idea that anyone is going to silence Tucker and prevent him from speaking to his audience is beyond preposterous.'Friends and sources close with the former FOX News host added that his allies at rival platforms are now preparing to attack the network.'They're coming to him and saying, \"Do you want me to hit FOX?\"' an unidentified close friend of Carlson's told the outlet. 'He's been saying, \"No I want to get this done quiet and clean.\"",
        "'Now, we're going from peace time to Defcon 1,' the friend said, explaining: 'His team is preparing for war. He wants his freedom.'Another source close to Carlson added that Carlson 'knows where a lot of bodies are buried, and is ready to start drawing a map.' They say rival media outlets have become more aggressive about getting the 53-year-old on staff.",
        "Carlson is said to have been contacted by Rumble and Newsmax, which have both reportedly agreed to pay him more than he was making at FOX.He had a conversation with Twitter chief Elon Musk about working together, but did not discuss specifics, according to Axios.Sources close to Carlson say he is also considering building a direct-to-consumer media outlet, where his millions of fans could pay to watch him.",
        "The former FOX News host had previously promised his fans he would be back, in a video posted to his Twitter page just two days after he was fired.'When honest people say what's true, calmly and without embarrassment, they become powerful,' he said in the video.'At the same time, the liars who have ben trying to silence them shrink, and they become weaker,' Carlson continued, concluding with: 'See you soon.'He then made his first public appearance on Thursday night following with a speech at Oxford Performing Arts Center in Oxford, Alabama, for the annual fundraiser for Rainbow Omega.'I'm probably the first unemployed person you ever invited to speak,' Carlson joked.'It's funny. I never give speeches because I'm working. When I accepted this speech six months ago or something, I didn't realize how much free time I would have.",
        "'One never knows, does one?'When asked for comment by DailyMail.com, a spokesperson for FOX News said the network will not comment beyond its initial statement on April 23, which said: 'FOX News Media and Tucker Carlson have agreed to part ways. 'We thank him for his service to the network as a host and prior to that as a contributor.'",
        "The decision was made six days after Fox settled with Dominion Voting Systems for $787.5 million.Since then, a slew of rumors pertaining to his dismissal have emerged. They span from claims over Carlson's texts that emerged in the wake of the lawsuit, including some in which he claimed he hated Trump.There were also rumors Carlson may have been fired over a gender discrimination suit filed by a former female booker on his show. It has also since emerged that Carlson sent an incendiary text message the day after the January 6 storming of the Capitol - which the board of Fox News learnt about on the eve of their defamation trial.The pivotal role played by the January 7, 2021, text message was originally reported  by The New York Times.In the text to one of his producers, Carlson recalls seeing a mob of three white men attacking an 'Antifa kid' and wanting the victim to be killed. ",
        "But, Carlson wrote, he realized wanting the 'Antifa kid' to die was wrong.Carlson also asserted that white people in general do not act so dishonorably as to launch a three-against-one attack. He did not specify the race of the 'Antifa kid'.'It was three against one, at least,' Carlson wrote. 'Jumping a guy like that is dishonorable obviously. It's not how white men fight.'Following his dismissal from Fox News, their ratings have slumped as fans of the firebrand presenter left the network in droves. "
    ]
}