{
    "articleURL": "/sport/formulaone/article-12053741/Mercedes-boss-Toto-Wolff-claims-Lewis-Hamilton-sign-contract-extension-stay-Mercedes.html",
    "content": [
        "The British driver, who turned 38 in January, has said he wants a multi-year dealAmid frustrations with the W14, rumours have swirled that Hamilton may leaveThere was promise Friday when George Russell topped first practice in MiamiMercedes boss Toto Wolff has claimed seven-time champion Lewis Hamilton will sign a contract extension to stay with the team.",
        "The British driver, who turned 38 in January, has said he wants a multi-year deal, but Wolff said there is no hurry to complete the extension.Hamilton's contract with Mercedes expires after this season and amid frustrations with the W14 this season, rumours have swirled that the storied driver may be looking to move on.'It's been 11 years that we've been together and every single time when we talk about Lewis' contract it is six months of, \"Where are we and what is happening?\" and we keep saying the same thing that we are just rolling on,' Wolff said Friday. 'It's not any difficult contract conversation, we're just putting different timelines and a few different numbers in there and that's what we do. ",
        "'It's a work in progress, bouncing emails back and forth. Eventually we're going to sign him.'Hamilton on Thursday was asked if he'd ever consider racing in NASCAR and he recalled a 2011 car swap he did with Hall of Famer Tony Stewart at Watkins Glen.'I'd love to try it at some stage. It's not a dream for me to go race another series, but I am an admirer,' he said. 'I'm a fan of racing and other sports. So I would like to try it.'He also expressed interest in swapping with Valentino Rossi and trying MotoGP and maybe even IndyCar, the US-based open wheel series.",
        "'I sometimes watch IndyCar and would love to try one of those at some stage,' he said. 'But right now my focus is solely on Formula One, and I don't plan on leaving any time soon.'Red Bull rolled into the first of Formula One's three stops in the United States undefeated and its challengers already waving the checkered flag on the championship.Max Verstappen and Sergio Perez have been so strong through the first four races that rival drivers have openly wondered if any other team will win a race this year.",
        "There was early promise Friday when George Russell and Hamilton topped first practice for Mercedes, while reigning two-time champion Verstappen was fourth fastest and Perez 11th.'It's not boring for me, I'm challenged every single day trying to get back to the front,' said Hamilton. 'But as a racing fan watching, I can understand because there's not as much competition as perhaps they are used to with the NFL and NBA. 'They have tried to bring the teams closer but it never seems to work.'"
    ]
}