{
    "articleURL": "/health/article-12047479/Majority-NHS-Trusts-not-offer-training-prevent-sexual-harassment-study-finds.html",
    "content": [
        "Only five Trusts offered specific training on reporting sexual harassment at workRead more: Jab mandates 'morally akin' to sexual harassment, philosopher says The majority of NHS Trusts do not offer training to prevent sexual harassment, a study has found.",
        "New figures reveal less than one in five Trusts in England provide specific training to address workplace harassment, racism and bullying.Experts have accused the health service of failing to tackle the issue, describing the figures as ‘deeply worrying’.Researchers at the University of Cambridge analysed data from Freedom of Information (FOI) requests sent to 213 NHS Trusts in England.Of the 199 that responded, only 35 said they offered ‘active bystander’ training, which encourages individuals to recognise and respond to poor behaviour.",
        "For most, participation was voluntary.And only five Trusts said their training addressed sexual harassment in some form, while the remaining 30 said their training taught participants to challenge antisocial behaviour only in a general context.In 2019, a survey by trade union Unison found that 8 per cent of health worker respondents had experienced sexual harassment while at work during the last 12 months, with more than half of these acts being perpetrated by co-workers.Dr Sarah Steele from Cambridge Public Health and Jesus College, said: ‘The NHS is failing to take advantage of a very effective training tool to address workplace harassment, sexual harassment and other forms of unacceptable behaviour such as bullying and racism.‘It’s a tool well used by the military, universities and educators, and which even the UN and UK government promotes.",
        "‘We found low uptake of active bystander training among NHS Trusts in England, particularly outside of London, and very little of the training that was on offer focused on sexual harassment. This is deeply worrying, given the continued problem of sexual harassment in the healthcare sector.‘Organisations need to encourage active bystander training from the very first days of undergraduate degrees through to the day of retirement. Without this, the problems of sexual harassment will continue to be a problem in the NHS and across wider society.’Last month, a damning report revealed dozens of rapes and sexual assaults take place in hospitals every week.Statistics, published by the Women’s Rights Network, showed 6,500 attacks had been reported in just three years.Founder Heather Binning said the figures are ‘just the tip of the iceberg’ and that hospitals have almost become a ‘market for sex offenders’.Commenting on the new FOI figures Kate Davies, the NHS director of sexual assault services commissioning, said: ‘We will work with the government and other partners to ensure the NHS is a safe space for all staff and patients – local services must not tolerate sexual misconduct, violence, harassment or abuse – it is totally unacceptable.‘All NHS Trusts and organisations must have robust measures in place to ensure immediate action is taken in any cases reported to them, and we’d encourage anyone who has experienced any misconduct or violence to come forward, report it and seek help – there is support and care available for anyone who needs it.",
        "‘Preventing these attacks from occurring in the first place is a priority and we have a programme of work dedicated to this and have appointed our first national clinical lead to drive forward action – together we must do all we can to keep staff and patients in our services safe.’The findings were published in the Journal of the Royal Society of Medicine."
    ]
}