{
    "articleURL": "/wires/reuters/article-12059101/Biden-McCarthy-aim-break-US-debt-ceiling-standoff-default-crisis-looms.html",
    "content": [
        "By David Morgan",
        "WASHINGTON, May 8 (Reuters) - President Joe Biden and top Republicans and Democrats from Congress are set to sit down this week to try to resolve a three-month standoff over the $31.4 trillion U.S. debt ceiling and avoid a crippling default before the end of May.The Democratic president is calling on lawmakers to raise the federal government's self-imposed borrowing limit without conditions. Republican House of Representatives Speaker Kevin McCarthy has said his chamber will not approve any deal that does not cut spending to address a growing budget deficit.Biden is due to meet on Tuesday at the White House with McCarthy for the first time since Feb. 1, with Senate Majority Leader Chuck Schumer and top Senate Republican Mitch McConnell. Top House Democrat Hakeem Jeffries will also join the talks.Analysts do not expect an immediate deal to avert a historic default, which the Treasury Department has warned could come as soon as June 1. Forecasters warn a default would likely send the U.S. economy into deep recession with soaring unemployment.But the start of active talks could soothe the nerves of investors who last week forced the federal government to pay its highest interest ever for a one-month debt issue.\"We have a lot of frothy waters now. We need to calm them. Some of that could come just from saying, 'We've found areas of agreement, we've found areas of disagreement, we're going to get back together and work on a solution,'\" Republican Senator Thom Tillis told reporters late last week.",
        "Outside observers including people who have participated in past fiscal negotiations and business lobby groups have laid out a range of potential compromises largely revolving around extending the debt ceiling past the November 2024 presidential elections while freezing spending.Legislative standoffs are nothing new in a nation with deep partisan divides, where Republicans hold a thin House of Representatives majority and Biden's Democrats control the Senate by a scant two votes.But the stakes of the debt-ceiling standoff are far higher than debates about budgeting that have caused partial shutdowns over the federal government three times in the past decade.\"That is painful. It is difficult. But it is not catastrophic,\" Democratic Senator Chris Coons said, referring to past shutdowns, adding, \"default would be catastrophic.\"Biden has insisted for months that raising the debt ceiling, a move needed to cover the costs of spending and tax cuts already approved by Congress, should not be linked to budget talks.\"The two are totally unrelated,\" Biden said on Friday. \"They're two separate issues, two. Let's get it straight.\"UNCERTAIN DEADLINEMcCarthy has called on Democrats to either offer their own plan or pass a House-approved package that would impose sharp spending cuts over the next decade and impose new work requirements on recipients in benefit programs in exchange for lifting the debt ceiling by $1.5 trillion or until the end of March.",
        "Biden in March proposed a budget that aimed to cut deficits by $3 trillion over 10 years by raising taxes on companies and people earning more than $400,000 a year.Lawmakers face an uncertain deadline: the Treasury warned last week that it could be unable to pay all its bills as soon as June 1, but possibly go for weeks longer.The Bipartisan Policy Center, a think tank that specializes in budget issues, is due on Tuesday to release its own revised forecast, which could further muddy the talks if it is later than Treasury's.The last time the nation got this close to default was in 2011, with the same pattern of divided government - a Democratic president and Senate with a Republican-led House.Congress eventually came around and averted default, but the economy endured heavy shocks, including the first-ever downgrade of the United States' top-tier credit rating and a major stock selloff.Worries about the standoff have already started to weigh on financial markets, but a default would have a far more immediate effect on average Americans.\"The thing for everyday folks is declines in their retirement savings, increases in interest rates that could affect their monthly payments for cars or houses - it's just going to hurt a lot of people, and hurt low- and middle-income people the most,\" said Democratic Senator Tim Kaine.",
        "Adding to the challenge of striking a deal, McCarthy agreed to a change in House rules that allows for just one member to call for his ouster as speaker, which gives greater power to hardliners, including the roughly three dozen members of the House Freedom Caucus.(Reporting by David Morgan, additional reporting by Ann Saphir, Dan Burns, Trevor Hunnicutt and Moira Warburton; Editing by Scott Malone and Deepa Babington)"
    ]
}