{
    "articleURL": "/sport/football/article-12060265/Everton-fans-CHANT-God-Save-King-AmEx-Stadium-days-Liverpool-booed-anthem.html",
    "content": [
        "Everton fans chanted over God Save the King at the AmEx Stadium in BrightonIt comes just 48 hours after Liverpool fans also booed the national anthem Follow all the action LIVE as Everton travel to Brighton in the Premier LeagueEverton fans chanted over God Save the King at Brighton's Amex Stadium - just two days after their cross-town rivals Liverpool also drowned out the national anthem.",
        "The Premier League 'strongly suggested' that clubs should play the national anthem for this weekend's fixtures to coincide with the coronation of King Charles III.It proved to be an unpopular move with Liverpool supporters, who booed and chanted when God Save the King was played ahead of their match with Brentford on Saturday evening.And in a typical showing of solidarity among the people of the city of Liverpool, Everton fans were also vocal in their chanting over the top of the national anthem ahead of their away match on the South Coast.Liverpool's actions on Saturday divided popular opinion. Mail Sport's Dominic King highlighted that the national anthem is a symbol of the city's distrust of the establishment, built up over several decades. ",
        "But both Gary Mabbutt and Piers Morgan voiced their own opinions hitting out at those who chose to vent their frustrations during God Save the King.Liverpool's own Jordan Henderson was criticised by the club's fans for singing the anthem, while other fans defended his actions, particularly due to his involvement in the England national squad, who also play the anthem before matches.  Toffees fans used the anthem as an opportunity to cheer proudly for their relegation-threatened team, ahead of their match at Brighton, who are chasing a European place for next season.  ",
        "The Toffees went into a 3-0 lead at half-time in Monday's crunch fixture, which will go a long way to securing their future in the Premier League for another season, should they see out the result.Abdoulaye Doucoure put the visitors in front at the Amex inside the first minute, as the side in the bottom three got off to a flying start. The Mali international midfielder then doubled his tally 28 minutes later as the Toffees roared into a shock lead. The third goal was perhaps more fortuitous, but well-earned by the travelling side as their stunning visit to the South Coast continued apace. Dwight McNeil - who was full of energy and running throughout the half - forced an own goal, after Jason Steele turned his cross across the face of goal into his own net.  ",
        "Sean Dyche's side have been part of the relegation picture all season, but a win would lift them out of the bottom three with just a handful of games remaining. And with Nottingham Forest taking on bottom of the table Southampton later on Monday evening, Everton's bid to avoid the drop could take on a much more positive complexion by the time they are next in action.However, they face a stern test in Premier League leaders Manchester City, who travel to Goodison Park on Sunday. ",
        "Leicester City's own survival homes took a hit with their 5-3 defeat at Fulham earlier on Monday.  "
    ]
}