{
    "articleURL": "/tvshowbiz/article-12055625/Nicky-Hilton-Rothschild-enjoys-fun-filled-family-day-Westminster-Kennel-Club-Dog-Show.html",
    "content": [
        "Nicky Hilton Rothschild enjoyed a fun-filled family day at the 147th Annual Westminster Kennel Club Dog Show in New York City on Saturday.",
        "The 29-year-old heiress brought along her two adorable daughters and also her parents Rick and Kathy – who recently bought Nicky a Mother's Day gift at Walmart.The family looked clean-cut and stylish in their chic weekend attire, watching all of the top-notch canines compete in the legendary dog show.Hilton kept it elegant in stripes, pairing a luxurious white sweater with a lovely picnic skirt.Her two daughters – Lily-Grace, 6, and Teddy Marilyn, 4 – wore matching sundresses while their grandma looked vibrant in a patterned orange-red design. ",
        "Nicky recently had her third child – a ten-month-old daughter whose name has not yet been disclosed to the public. She shares her three children with banker husband James Rothschild. The pair were married in 2015 and their wedding was one for the record books. The couple tied the knot in London, marrying in Kensington Palace Gardens before honeymooning in Botswana. Hilton wore a $77K wedding dress in front of an A-list assemblage that included the British aristocracy and the upper crust of New York high society. Grandpa Rick looked like he was in great spirits alongside his socialite daughter and reality star wife. The Hotel scion recently sold his stake in the real estate brokerage firm Hilton &amp; Hyland, which he co-founded in 1993. ",
        "According to THR, Rick is reportedly leaving to start a new brokerage alongside his son Baron called Hilton &amp; Hilton.Details of his payout from Hilton &amp; Hyland remain undisclosed, but the company reported $4 billion in sales for 2021.",
        "Rick sold his stake in the company to the widow of his late partner Jeff Hyland, who passed away from cancer in February 2022.In a statement released in December, Hilton said: 'I entered the real estate business over 30 years ago. During those three decades, along with my partner, Jeff Hyland, we created and built Hilton &amp; Hyland. 'Together, we turned our company into the finest boutique brokerage in the world. With Jeff’s passing, it seemed like a natural progression to move forward by creating a new brokerage with my son, Barron.'Rick's son Barron is named after his own father Barron Hilton Sr., who was the son of Conrad Hilton, the trailblazing hotel magnate behind who founded the Hilton Hotels chain.  "
    ]
}