{
    "articleURL": "/sport/nfl/article-12044291/Shaquil-Barretts-wife-mourns-two-year-old-daughter-drowned-swimming-pool.html",
    "content": [
        "Arrayah Barrett, two, died after drowning in a family swimming pool in Tampa, Florida, on Sunday Days after her death, her mother, Jordanna Barrett, has broken her silenceDailyMail.com provides all the latest international sports newsTampa Bay Buccaneers linebacker Shaquil Barrett's wife has broken her silence days after their two-year-old daughter drowned in the family pool. ",
        "Arrayah Barrett, who celebrated her second birthday on April 19, was taken to the hospital but attempts to save her life were unsuccessful, The Tampa Bay Times reported.Barrett's wife Jordanna shared a heartbreaking post to Instagram in tribute to her daughter, writing an emotional statement alongside a touching photo of Arrayah beaming on her recent birthday. 'Thank you all for all the messages, flowers, thoughts and prayers,' Jordanna's statement read Wednesday. 'Our world will never be the same. Arrayah was the apple of my eye, and my heart will forever be with hers.",
        "'I love you so much my baby. I am so so sorry. Until we see each other again, please watch over your siblings and momma and dada. We love you forever and ever and always. 'I can't wait to see that precious smile again, and just hug you so close. I would do absolutely anything. There is no Barrett 6 without you, and we will forever hold your place down here, until we all meet again in heaven. I love you forever and always.' Jordanna also shared a link to an obituary for Arrayah in the caption. The father of the Tampa Bay Buccaneers star also posted a heartbreaking tribute to his  granddaughter in Florida. Steve Barrett shared photos of himself with his two-year-old grandchild Arrayah Barrett late Sunday evening just hours after the news of the death was first reported. ",
        "'Pop-Pop Loves You,' Steve wrote in a post that has since received dozens of condolence responses. Police first responded to a report of a child who had fallen into a pool at the Barrett's home in Tampa around 9.30am on Sunday, according to Tampa Police.The Buccaneers issued a statement Sunday confirming Arrayah's tragic death and sharing their condolences for the family.",
        "'While no words can provide true comfort at a time such as this, we offer our support and love as they begin to process this very profound loss of their beloved Arrayah,' the statement read.Tampa Bay Buccaneers teammates have also offered their support and love to the Barrett family following the tragic loss of the toddler. Tom Brady posted a photo of Barrett, his wife Jordanna, their four children and their dog and added the emotional message: 'The Bradys love you.' Barrett, 30, has played for the Tampa Bay Buccaneers since 2019. Brady, 45, joined the following year. Jordanna and Barrett have three surviving children: sons Shaquil Jr. and Braylon, and daughter Aaliyah.The two-time Pro Bowler and two-time Super Bowl champion agreed to a four-year, $72million contract with the Buccaneers in March 2021.Barrett sustained a season-ending injury in October, suffering a torn left Achilles during the Buccaneers' Week 8 loss to the Baltimore Ravens. ",
        "He finished the 2022 campaign with 31 tackles, three sacks and one forced fumble in eight games.A two-time Pro Bowl selection, Barrett has 348 tackles, 54.5 sacks, 19 forced fumbles and five fumble recoveries in 115 career games (69 starts) with the Denver Broncos (2015-18) and Buccaneers.The Broncos sent well-wishes to their former player on Sunday. He played with Denver between 2014 and 2018. Other teams including the San Francisco 49ers and the Seattle Seahawks also sent their condolences to Barrett and his wife. Broncos quarterback Russell Wilson wrote on Twitter: 'Heartbreaking. Praying for you and your family Shaq.'",
        "An investigation is underway but Arrayah's death is not believed to be suspicious.Arrayah was the youngest of four children that Baltimore-born Barrett has with his wife Jordanna. In a photo shared to Instagram, marking their daughter's second birthday, Jordanna wrote: 'Happy Second birthday my little Arrayah Sunshine! 'We love you so much! You are the completion to our family, the apple to our eyes! You've become the most fun, energetic, entertaining, sweet, kind, smart, precious little girl we could have ever dreamed of! 'Your big sis, big bros, and momma and daddy love you to the moon and back.'Happy birthday Arrayah Sue.'"
    ]
}