{
    "articleURL": "/tvshowbiz/article-12041763/Tom-Hanks-Rita-Wilson-hold-hands-Barcelona-celebrate-35th-wedding-anniversary.html",
    "content": [
        "Tom Hanks and his wife Rita Wilson looked as loved up as ever as they held hands during sightseeing tour in Barcelona on Tuesday. ",
        "The couple, who rang in their 35th wedding anniversary earlier this week, continued to celebrate their milestone with the trip to the Spanish city. The actor, 66, wore a white T-shirt tucked into a pair of smart black trousers and donned a stylish grey fedora hat. He shielded his eyes with a pair of sunglasses and slung a black quarter zip sweater over his shoulder. Rita, also 66, looked effortlessly stylish in a cream blazer with a matching pair of linen trousers and a coordinating hat. ",
        "Her blonde hair fell down from beneath her wide brimmed hat, choosing to complete her look with a silk neckerchief. Soaking up the historic sights they took a guided tour of the Sagrada Familia before stopping off for dinner. Tom and Rita celebrated 35 years of wedded bliss Sunday, marking the occasion with a cake.Sharing some photos to Instagram, Tom looked lovingly at his wife as they sat on a patio. '35 years of marriage,' Rita wrote. 'April 30 1988. Love is everything.' The pair first met when Rita was cast in an episode of the TV sitcom Bosom Buddies and could never have imagined they would end up at one of Hollywood's most respected couples. Tom was marred to his first wife at the time he co-starred in the comedy with Peter Scolari.",
        "The show followed two junior advertising executives who dressed as women so they could live in the one apartment they could afford. ",
        "They met again a few years later when Rita was cast as Tom's love interest in 1985's Volunteers.The future Oscar winner starred as a spoiled rich kid who joined the Peace Corps to avoid a gambling debt.After he divorced in 1987, the Money Pit star began dating his future wife and they married in 1988.Tom had two children from his first marriage, Colin, 45, and Elizabeth, 40. They expanded their family, welcoming in sons Chester, aka Chet, 32, Truman, 27. "
    ]
}