{
    "articleURL": "/wires/reuters/article-12050873/King-Charles-brother-Prince-Andrew-casts-cloud-monarchy.html",
    "content": [
        "Rapid fall from grace over links to Epstein",
        "Barred from wearing uniformStill eighth in the line of succession to throneBy Angus MacSwanLONDON, May 5 (Reuters) - As the British monarchy celebrates King Charles' coronation this Saturday with pomp and pageantry, a cloud still hangs over his younger brother Prince Andrew.Andrew was stripped in recent years of most of his titles and removed him from royal duties over his friendship with late U.S. financier Jeffrey Epstein, a convicted sex offender, and a related sex assault allegation.In February 2022, Andrew settled a U.S. lawsuit in which a woman accused him of sexually assaulting her when she was a teenager. He has not been charged with any criminal offence and has always denied any wrongdoing.Andrew had reputedly been the late Queen Elizabeth's favourite son, but the scandal was too much for her. The prince has rarely been in public since his rapid fall from grace.A Royal Navy veteran of the Falklands War, Andrew was not allowed to wear a military uniform during two solemn processions following the queen's death in September, one in Edinburgh and one in London, when he and his three siblings walked behind their mother's coffin.As the queen's coffin was borne through the streets of Edinburgh, one heckler shouted out: \"Andrew, you're a sick old man\".",
        "The incident reflected at least part of the public view of the prince. A YouGov poll published this week month showed him to be the least liked member of the royal family that it asked people about.ONCE POPULAR PRINCEYears ago, Andrew was a popular figure.Tabloids nicknamed him the \"Playboy Prince\" as they cheerfully reported on his love life, and he won respect for his service as a helicopter pilot in the Falklands.His marriage in 1986 to Sarah Ferguson was seen at the time as bringing a breath of fresh air to a stuffy institution.It all went wrong gradually and then suddenly.As a roving trade ambassador, he gained the nickname \"Air Miles Andy\" for his frequent travels, which often involved rounds of golf. His marriage ended in divorce in 1996. The media criticised him for what was described as high-handed behaviour and an overly lavish lifestyle.But it was the Epstein affair that brought true ignominy upon Andrew. His effort to clear the air over that association in a TV interview in 2019 was seen as having backfired - with some of his justifications for his actions widely ridiculed.Andrew remains eighth in the order of succession to the throne, and British media have speculated that he may still hold out hopes of returning to public life.",
        "Last month, Andrew's ex-wife Sarah Ferguson, the Duchess of York with whom he remains close, said in a TV interview the prince was a good man.\"He's a kind, good man and I think that spotlight needs to come off him and let him get on with his life to rebuild,\" she said.But royal observers think a return to favour is highly unlikely, not least as Charles has spoken of having a slimmed-down monarchy with fewer working royals.According to British media, the king also wants his brother to move out of the mansion he has occupied for years in the royal estate in Windsor and reside in a smaller home. (Additional reporting by Humza Jilani Editing by Estelle Shirbon, Andrew Heavens and Frances Kerry)"
    ]
}