{
    "articleURL": "/wires/reuters/article-12058083/Battle-Chinas-electric-SUV-market-heats-home-abroad.html",
    "content": [
        "SHANGHAI, May 8 (Reuters) - China is ground zero for the price war in electric vehicles and the battleground is shifting to SUV-styled EVs, the largest segment of the market, dominated by Tesla Inc and BYD .",
        "The market, crowded with more than 90 models, is about to get even tighter with at least 20 new models of both Chinese and foreign brands launched in April, squeezing pricing and margins at home and driving exports, analysts and executives said.EV makers in China have followed Tesla's bold price cuts by lowering prices for their own electric SUVs, cannibalizing sales of internal combustion engine (ICE) vehicles as the price gap between the technologies narrows, analysts said.The trend will spread abroad with growing exports of China-made electric SUVs.\"We're going to see a lot of Chinese exports because of the ultra-competitive market in China. It's actually going to be a pressure release valve,\" said Tu Le, founder of Beijing-based advisory firm Sino Auto Insights.The market for SUVs has boomed in China over the past decade and now represents almost 40% of all cars sold, with 400 SUV models of all fuel types.Almost as many China-made SUVs were sold in 2022 as cars of any type in Europe last year, or more than 11 million.The popularity of electric SUVs has exploded since Tesla delivered its domestically-produced Model Y two years ago in China, making it one of the fastest-growing segments in the world's largest auto market.Both domestic and foreign brands were represented among the new models rolled out at the Shanghai Auto Show in April.",
        "Legacy automakers Volkswagen, BMW and Toyota are counting on new electric SUVs to bolster China sales.Made-in-China EV startups Xpeng and Nio have six SUV models and the EV-only brands launched by Chinese state-owned car companies, such as GAC's Aion are also pushing all-electric SUVs.They will compete with 93 existing electric SUV models in a market that saw 1.5 million sales in 2022, with the top 10 brands making up 84%, a Reuters analysis of data from China Association of Automobile Manufacturers (CAAM) shows.There were 76 electric SUVs in 2020 before Tesla started producing Model Ys in China, with average annual sales amounting to just 3,000 units.Despite recent minor price hikes, Tesla's Model Y is still 20% cheaper in China than in early October, when the U.S. automaker grappled with rising inventory.DISCOUNT WARXpeng, Leapmotor and others have fired back with their own discounts, while BYD offered a discount of $1,000 on its market-leading Song Plus SUV, or about 4% off.Those refusing to slash prices on existing models to protect brand value have instead chosen to offer lower-than-expected starting prices for new models, along with longer driving ranges and greater autonomous driving features.For example, Geely's premium EV brand Zeekr priced its new compact crossover Zeekr X from $27,500, 28% cheaper than Model Y and almost the same price as Honda's CR-V, first-quarter sales of which slumped 56%.",
        "Mitsubishi Motors also said last month it had suspended for three months production of its Outlander SUV in China.The reality is \"brutal\" for legacy foreign brands targeting the mass market with small SUVs priced below $40,000, such as Ford, said Le of Sino Auto Insights.Ford's chief executive, Jim Farley, acknowledged the intense market competition for two-row, SUV-styled EVs as a factor driving China's car export boom.\"That's why they're going big on Europe. Europe is a premium export market. They're all going there,\" Farley said in April after a trip to China.Ford will also restructure its China operations to turn one of its joint ventures into an export hub for low-cost commercial electric and combustion vehicles, Farley said last week.General Motors, which saw profit from China tumble by almost a fourth in the most recent quarter, needs new EVs to be a success in order to rebuild its market share in China, but the pressure is intense.\"China has 100 vehicle brands vying for sales and a 50% capacity utilization rate,\" Chief Executive Mary Barra said.Tesla and Renault have already been exporting their China-made electric SUVs to Europe on a large scale. Tesla will begin shipping Model Y crossovers from its Shanghai plant to Canada, its first exports to North America, Reuters reported.",
        "Chinese automakers have their own plans to grow electric SUV sales to Europe.Zeekr said it would bring the Zeekr X to western Europe while exports of BYD's Atto 3 SUV more than doubled in the first quarter as it started taking orders there.\"The styling of it (Atto 3) is in keeping with the higher driving position, the good space,\" said Mark Blundell, BYD's head of marketing in Britain.\"We just feel it's a good start point for us in the UK.\" ($1=6.9000 Chinese yuan renminbi)(Reporting by Zhang Yan and Brenda Goh in Shanghai; Additional reporting by Nick Carey in London; Editing by Ben Klayman and Clarence Fernandez)"
    ]
}