{
    "articleURL": "/sport/nfl/article-12052431/Jets-head-coach-Robert-Saleh-calls-narrative-Aaron-Rodgers-having-wish-list-silly-one.html",
    "content": [
        "Since joining the Jets, at least four ex-Packers have joined Rodgers in New JerseyRodgers' linking up with offensive coordinator Nathaniel Hackett on the JetsDailyMail.com provides all the latest international sports news New York Jets head coach Robert Saleh has come out defending the team's newest addition at quarterback, calling the narrative on Aaron Rodgers having a wish list a 'silly' one, just 10 days after the 39-year-old was traded from the Green Bay Packers.",
        "Since the end of the NFL draft, the Jets have added two veterans who've played with the 2011 Super Bowl (XLV) champion in Green Bay: wide receiver Randall Cobb and offensive tackle Billy Turner. Additionally, Allen Lazard, who also caught several of Rodgers' passes during their time on the Packers, signed with New York prior to the four-time league MVP's mega-trade on April 24. Speaking to reporters on Thursday, Saleh dismissing the media's narrative that the Jets' new No. 8 had prerequisites before signing with 'Gang Green'.'I'm going to try and say this as respectfully as I can, I'm not attacking anyone, I do think it's a silly narrative,' said the 44-year-old. 'There's 32 teams in the NFL. It's common practice for, when you have a new coaching staff, that you surround those people with people they are familiar with.'",
        "'I had a wish list — Solomon Thomas, Marcell Harris, D.J. Reed, Kwon Alexander — guys who I've worked with who were very familiar with our messaging, very familiar with our scheme, who can come in and play. We had it on offense with Laken Tomlinson, Tevin Coleman, and guys who have been in the system.'Shoot, Tom Brady goes to Tampa and he gets [Rob] Gronkowski and Antonio Brown. So, it is very common for new faces to want old faces — to be able to come in and accelerate the installation of a program.' ",
        "Moreover, Saleh added that the Jets' new offensive coordinator Nathaniel Hackett also has a say in the recruiting process, not just Rodgers. The duo formed a lethal offense in Green Bay prior to joining the third-year head Jets head coach at Florham Park this spring. 'Everything's being pinned on the quarterback — it's not just him,' Saleh said. 'Hackett has something to say about it. He loves Lazard, loves Randall, took Billy Turner with him to Denver and wanted him here in [New York]. So, of course you're going to surround a coach with people who he feels will be able to plant the flag.'So, that whole narrative of whatever people are trying to put on the quarterback, I think it's tired.'",
        "Right after defending the Jets' recruiting process, Saleh was asked if if the team was planning to sign tight end Marcedes Lewis, who also played with Rodgers in Green Bay. 'You never know,' said the American-Lebanese head coach. 'At the end of the day, the best 53 will be on the football team,' he added. 'And then the best 11 will be on the football field when it's time to snap the ball. But at the same time, the reason why we're excited to bring those guys is because they stand for everything we believe in. ",
        "'Look at Allen Lazard, he came in as an undrafted free agent and he's got all this unbelievable ability to him and he's made himself. Randall has such an amazing amount of experience. Billy Turner has so much experience. But they're internally driven individuals who just want to win football games. And they love the game of football.'And it's like, well why wouldn't you bring them in to help accelerate and plant the flag and echo the message that Nathaniel and his staff are trying to accomplish?'"
    ]
}