{
    "articleURL": "/wires/reuters/article-12050577/Naples-celebrates-wildly-securing-Serie-A-title-dozens-injured.html",
    "content": [
        "By Antonio Denti and Gabriele Pileri",
        "NAPLES, May 5 (Reuters) - Dozens of revellers were injured in wild celebrations in the southern Italian city of Naples after its soccer team became Serie A champions for the first time in 33 years, local officials said on Friday.Mass street partying, punctuated by fireworks, flares, horns and firecrackers, began late on Thursday after the Napoli team secured the \"Scudetto\" title with a 1-1 draw away at Udinese in northeast Italy.\"Even those who don't follow football took to the streets to celebrate. I am not a supporter, but I took to the streets for a sense of belonging to this wonderful city, which has so much to offer,\" a Naples resident, who gave her name only as Federica, told Reuters TV.Hundreds of fans waving flags and draped in Napoli's blue and white colours waited in vain at the club's training ground in Castel Volturno, outside Naples, when the team returned from Udine, but the players went straight home from the airport.They are sure to receive a hero's welcome at Sunday's home match with Fiorentina, and another party is being planned in the city at the end of the championship on June 4.Naples health authorities said 203 people accessed emergency services overnight, including 22 with \"red-level\" critical injuries and 75 with \"yellow-level\" serious but not life-threatening conditions.",
        "Health service spokesperson Anna Tagliaferri said the figure was not unusually high, with any of Naples' larger hospitals routinely handling as many as 200 emergency room cases on a \"normal\" day.One man died in a shooting, but authorities linked it to score-settling within the local Camorra mafia. Naples Prefect Claudio Palomba told RAI public radio the incident had \"nothing to do with the (soccer) celebrations\".RARE TRIUMPHSome in Naples saw the side's runaway title triumph with five games still to play as a sign of resurgence in Italy's impoverished south after decades of dominance - not just in sporting terms - by the wealthier north.\"A Scudetto won by Napoli is not like a Scudetto won by any other team\", best-selling true crime author and club supporter Roberto Saviano wrote in the Corriere della Sera newspaper, hailing \"a miracle\".Prime Minister Giorgia Meloni joined the chorus of congratulations for the club, which won two previous league titles in 1987 and 1990 under the leadership of Argentine legend and local icon Diego Armando Maradona.\"Thirty-three years after the last Scudetto, Napoli are back as champions of Italy. Congratulations to the whole team, to coach Spalletti and to the entire club for all their efforts and for this well-deserved result,\" Meloni wrote on Twitter.",
        "Luciano Spalletti's team is set to receive a heroes' welcome upon their return from Udine later on Friday and at Sunday's home match with Fiorentina. (writing by Alvise Armellini and Gavin Jones; Editing by Toby Chopra and Hugh Lawson)"
    ]
}