{
    "articleURL": "/tvshowbiz/article-12058039/Lisa-Wilkinsons-major-royal-gaffe-covering-William-Kates-wedding-resurfaces.html",
    "content": [
        "Lisa Wilkinson's notorious gaffe from her coverage of the wedding of Prince William and Kate Middleton in April 2011 has resurfaced, after she was noticeably absent from Channel Ten's reporting of King Charles III's coronation on Saturday.",
        "The veteran TV presenter, 63, who is on a career hiatus after quitting The Project last year, may not have been in London to cover Charles' ascension to the throne, but she was on hand to report on the Prince and Princess of Wales' nuptials 12 years ago.Wilkinson, who was a co-host of Nine's Today show at the time, infamously said the late Dodi Fayed - the boyfriend of Princess Diana who died alongside her in a car crash in Paris in August 1997 - was in attendance at the Waleses' wedding.'Is that Dodi al-Fayed?' Wilkinson was heard saying as a 'mystery man' - later identified as the King of Tonga - walked into Westminster Abbey for the ceremony.'Yes, that's Dodi al-Fayed,' a supposed royal 'expert' replied during the live broadcast - despite Dodi having died years earlier.",
        "The pair then incorrectly speculated it was Mohamed Al-Fayed - Dodi's father - entering the church, before they learned it was actually the King of Tonga, and not any member of the al-Fayed family, reports The Australian's Media Diary. Wilkinson has a history of reporting on major events concerning the Royal Family.She was flown to the UK last year to cover the funeral of Queen Elizabeth II and also covered Prince Harry's wedding to Meghan Markle in 2018.",
        "This year on Channel Ten, national affairs editor Hugh Riminton landed the coveted gig to cover King Charles' coronation. ",
        "Wilkinson is also, of course, the wife of journalist and commentator Peter FitzSimons, Australia's most vocal republican and the chair of the Australian Republic Movement.Despite no longer working, Wilkinson is still riding the Ten gravy train.",
        "Wilkinson, who hasn't appeared on screens since her departure from The Project in November, is still collecting a 'seven-figure salary' from Ten thanks to the 'watertight' deal she signed in 2021.The question now remains as to how she will spend the remainder of her lucrative contract, which is said to extend beyond 2023.It's unclear where such a highly paid journalist would fit in Ten's schedule, however, as the station is mostly known for its reality TV content, not news and current affairs.",
        "'With Wilkinson unlikely to put her hand up for 10's reality tentpoles like The Bachelor or jungle duty on I'm a Celebrity, her most likely next move is said to involve some form of interview special for 10,' reports Media Diary.Wilkinson signed a reported $1.7million-a-year deal with Ten in 2018, before inking another multi-year contract with the network in 2021.The generous salary helped Wilkinson fund a dream lifestyle of high-end properties, fancy cars, luxury fashion and first-class trips overseas.Wilkinson abruptly quit The Project in November after four years on the panel, citing 'targeted toxicity' from sections of the media as the reason for her exit."
    ]
}