{
    "articleURL": "/wires/ap/article-12061483/Canada-expel-Chinese-diplomat-threats-lawmaker.html",
    "content": [
        "TORONTO (AP) - The Canadian government is expelling a Chinese diplomat whom Canada´s spy agency alleged was involved in a plot to intimidate an opposition lawmaker and his relatives in Hong Kong.",
        "A senior government official said Toronto-based diplomat Zhao Wei has five days to leave the country. The official spoke on condition of anonymity as they were not authorized to speak publicly on the matter. It's wasn't immediately clear if he's left yet.Foreign Affairs Minister Mélanie Joly said in a statement that Canada declared Toronto-based diplomat Zhao Wei \"persona non grata.\"\"We will not tolerate any form of foreign interference in our internal affairs,\" she wrote.\"Diplomats in Canada have been warned that if they engage in this type of behavior, they will be sent home.\"Canada's spy service indicated that in 2021 opposition Conservative lawmaker Michael Chong and his Hong Kong relatives were targeted after Chong criticized Beijing´s human rights record. Canada´s spy agency has not released details publicly.",
        "Chong has been critical of Beijing´s treatment of Uyghur Muslims in China´s Xinjiang province.It became public after a Globe and Mail report last week. Chong said he learned about it from that report, and Prime Minister Justin Trudeau denied knowing about it earlier.\"This should have happened years ago,\" Chong said Monday.\"I hope that this makes it clear not just to the People´s Republic of China, but other authoritarian states who have representation here in Canada, that this crossing the line of diplomacy into foreign interference threat activities is utterly unacceptable here on Canadian soil.\"",
        "On Monday, China´s embassy in Ottawa issued a statement that accused Canada of breaching international law and acting based on anti-Chinese sentiment. It said the move has \"sabotaged\" relations between China and Canada and promised unspecified retaliatory measures.China has previously insisted it does not interfere in other countries´ internal affairs, but says it will respond to what it calls provocations.The Canadian government took its time to decide whether to proceed, with both Joly and Trudeau warning about backlash from Beijing.Last week, Joly said that Beijing could threaten the safety of Canadians and the prosperity of the country in retaliation for any expulsion, but Joly now says that is worth that risk.\"This decision has been taken after careful consideration of all factors at play,\" she wrote.The revelation about Chong is the latest in a string of foreign interference attempts allegedly made by the Chinese government in Canada in recent years, including efforts to meddle in the 2019 and 2021 federal elections.Trudeau has appointed former governor general David Johnston to further study the issue, including whether a public inquiry is needed."
    ]
}