{
    "articleURL": "/tvshowbiz/article-12039845/Savannah-Chrisley-admits-boarded-flight-late-talks-Southwest-saga.html",
    "content": [
        "Savannah Chrisley has shed more light on the 'Southwest saga' that resulted in her getting kicked off a flight following an alleged altercation with a flight attendant.",
        "Chrisley, 25, first opened up about the incident on her Instagram Stories last month, alleging she was booted from the flight after she refused to check her carry-on bag as she called out an attendant. However, Southwest Airlines hit back at a statement claiming she was tardy to her flight and insulting to staffers.Speaking on her podcast Unlocked with Savannah Chrisley, the reality star admitted to boarding the plane late and acknowledged her busy schedule led to her being less patient than she normally would have been.Savannah also addressed calling the attendant an 'a**hole', admitting a switch inside her 'flipped' after a pilot stepped in and help - only to be shut down by the attendant.  ",
        "She explained she was returning home from a full day of meetings in New York, and wanted to make it back by 8:30PM to put her niece Chloe to bed.  Chrisley became Chloe's primary guardian after her parents, Todd, 54, and Julie Chrisley, 50, were sent to prison for tax fraud last November. She is also the legal guardian to her 16-year-old brother Grayson. 'I went to get on the flight and he immediately looks at me and goes, \"You'll have to check that bag.\" And just his tone and attitude was immediately angry,' Chrisley explained. ",
        "'And I was like, \"Okay, well I didn't check it in on the way here, so I would really like to see if there's room for it.\" He goes, \"That's not how it's going to work.\" I was like, \"Okay.\" And I was like, \"Well then why don't we put a tag on it as if I'm going to check it.\"'I was like, let me put a tag on it as if I'm going to check the bag, and if there's not room for it then we'll just check it.'Imitating the attendant, she said in a deeper voice:  'Ma'am, you won't be flying on this flight if that's how you want to do it.\" 'And I was like, \"Okay.\" And so I walk down the jet bridge,' she said, adding she was with her bag with a tag on it.She then alleged the attendant came down the jet bridge and attempted to take her bag. 'Just to prove a point, just to prove a little bit of power, he comes down the jet bridge and tries to take my bag.'Chrisley was also speaking with a pilot who she claimed offered to take the bag himself.'And the pilot that was standing next to me, he was just sparking conversation, come through,' she said. 'The pilot and I were talking and super, super nice guy, and the attendant comes up to try and take my bag, and the pilot goes, \"Hey ma'am, I'll find a place for her bag, it's not a big deal.\"",
        "'And the attendant literally was like this close to the pilot,' she said, holding out her hand a little over a foot away from her face. 'And goes \"No you won't, stay out of it.\"'She said she had a 'tough, rough' few day and acknowledged she may not have been her 'most patient self' as she had been up for nearly 24 hours. 'When he said that to the pilot though, something in me just flipped,' she said.'So that is when I had choice words, and I said, \"Dude, come on. There's no need to be an a**hole.\"''At that point, oh gosh, you would have thought I threatened to bomb the place. He was not having it. He was like, \"Ma'am, what did you say?\" I was like, \"There's no need to be an a**hole.\" And he goes, \"You're off. You're off. Let's go.\"'",
        "'I will say I did board late,' she said. Her friend added, 'So that makes the baggage thing more understandable.'She also claimed the attendant was adamant about kicking her off the flight even after she attempted to compromise. 'I told the attendant, \"You know what? We all have tough days. Clearly, you're in a mood. I'm in a mood. I apologize. I should not have called you an a**hole. Let's check my bag and call it a day.\"'",
        "But according to Chrisley, the attendant replied: '\"Nope, nope, you're off this flight! You will not be flying! Do I need to have whatever police come and get you!?\"' she claims he said. 'And I was like, \"Please do sir.\"",
        "Savannah then gets off the plane and in hindsight realizes she could have used 'classier language' rather than call him an 'a**hole.''I do not think I'm better than anyone else. I do not think I'm better than to not have to check my bags. All I asked was let me see if there's room because we've all been on a plane before [where] some people just don't play Tetris that well, and there's a lot of wasted space,' she said.Savannah also claimed she told the attendant she needed to make it home to her niece, who was still under the care of her 78-year-old grandmother. When he allegedly replied 'don't care', she called him an 'a**hole' again. 'Should I have called him an a**hole? Probably could have steered away from that. But it is what it is.''At the end of the day, Southwest, you won. You won because I ended up on a connecting flight going home till 3am.'After Chrisley posted her video describing the alleged fiasco last month, a rep for the airline issued a statement detailing its side of the situation, saying the reality star had been tardy to her flight, and insulting to staffers once she arrived.",
        "'Our initial reports indicate a different story than the one from the Customer's account, as she arrived at the gate late in the boarding process,' the rep said, according to People, 'and repeatedly insulted our Employee after being asked to gate-check her bag.'The airline said that 'as a result' of Chrisley's conduct, she 'was denied boarding on her original flight, and we booked her on a later flight the same day.'The rep said that the airline was 'aware' of a video Chrisley posted to Instagram Stories and was 'looking into the situation.'"
    ]
}