{
    "articleURL": "/wires/reuters/article-12038553/Carlos-Alcaraz-wins-Daniil-Medvedev-falls-Madrid.html",
    "content": [
        "Top-seeded Carlos Alcaraz cruised into the quarterfinals of the Mutua Madrid Open on Tuesday following a 6-1, 6-2 victory over 13th-seeded Alexander Zverev.",
        "Second-seeded Daniil Medvedev wasn't as fortunate, however. The Russian dropped a 7-6 (1), 6-4 decision to countryman Aslan Karatsev in their fourth-round match.Alcaraz recorded five aces, broke Zverev's serve on four occasions and benefited from four double faults by the German. The 19-year-old Spaniard won the match in 1 hour, 22 minutes.\"For me it's amazing to play the level that I played today,\" Alcaraz said. \"It's been a question mark for me. ... I played well, I feel really good right now and this match gives me a lot of confidence.\"At the beginning (I felt nerves), but you have to handle (them). The best players in the world handle the nerves really (well) and I want to be like them. Trying not to show the opponent that I'm nervous at all. I just want to enjoy playing here in the Caja Magica in front of my home crowd. It's been amazing for me to play here, so I just enjoy every moment.\"Alcaraz advances to face 10th-seeded Karen Khachanov, who posted a 7-6 (8), 6-4 win over fellow Russian and doubles partner Andrey Rublev. Khachanov totaled five aces and won 64 percent of his second serve points to upend the fifth-seeded Rublev in 1 hour, 42 minutes.Medvedev had won 33 of 37 matches this year before falling to Karatsev, who won 79 percent of his first serve points to capture the match in 96 minutes.",
        "\"I was struggling last year,\" Karatsev said. \"I'm really happy with my game (now), so we'll see what (happens next).\"Karatsev will face the winner of Tuesday's match between American Taylor Fritz and Zhang Zhizhen of China.Also on Tuesday, 17th-seeded Borna Coric of Croatia rebounded after dropping the first set to post a 6-7 (5), 6-3, 7-6 (5) win over 29th-seeded Alejandro Davidovich Fokina of Spain.--Field Level Media"
    ]
}