{
    "articleURL": "/money/investing/article-12054779/CITY-WHISPERS-FTSE-takeover-barks-turn-bites.html",
    "content": [
        "Takeover fever that has gripped the London market in recent weeks faces an important test.",
        "Thursday will be the deadline to make offers for two FTSE 250 firms – pet medicine maker Dechra Pharmaceuticals and payments group Network International. Dechra has already sounded its support for a £4.6billion approach from private equity group EQT, while Network International is the target of two suitors, Brookfield and CVC.Then May 15 will be the deadline for Apollo to make a firm move on Matt Moulding's online retailer THG.The significance of the punchily named 'put up or shut up' deadlines is that bidders must table a solid offer or walk away for six months. ",
        "There can be extensions, but these are still key dates.The next fortnight will show whether private equity is willing to commit to deals with big companies despite the turmoil gripping global markets.Is it all bark or will we start to see some bites?Short-sellers reduce Asos positions Asos is gearing up to release first-half results, which it has already warned are likely to show a loss. But one set of players in the City appears to think the fast fashion retailer's fortunes are looking up. ",
        "All five short-sellers targeting Asos, who would make money if the company's share price fell, have reduced their positions in recent weeks, indicating they think its stock might rise. Not such a fast fashion bargain after all? ",
        "Bristol Climate choir on song A busy few weeks for Bristol Climate Choir, which formed in the autumn and has already had several major concerts at environmental marches and company AGMs.Top moments include the choir unleashing its melodies on Barclays shareholders with a reworked rendition of the Spice Girls hit Stop to condemn the bank's role as one of Europe's largest funders of fossil fuels.But anyone keen to know what might be played at their next performance only has to go to their website's song library, which contains tunes they have played before 'or are intending to sing in future'. Alas, it looks like no more Spice Girls for now.But Whispers – always a fan of a singalong – will keep an eye on what's in the pipeline.Depop set for significant Etsy attention ",
        "Sales of personalised and handmade gifts helped online marketplace Etsy to beat Wall Street estimates last week.But UK Etsy-watchers were likely to be more keen to hear how Depop – a British app that allows users to sell second-hand clothes – is integrating into the company.Etsy bought Depop for a staggering £1.1billion in 2021, but later wrote down its value by a stonking £712million.The company's bosses insisted there has been 'significant progress', but hefty spending on marketing is being felt throughout the wider business.",
        "Etsy admitted Depop will 'continue to require significant attention and resources' and that it could be costlier than anticipated. Watch this space.",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}