{
    "articleURL": "/wires/ap/article-12053147/Astros-starter-Luis-Garc-Tommy-John-surgery.html",
    "content": [
        "SEATTLE (AP) - Houston starter Luis García needs Tommy John surgery and will miss the rest of the season, another major blow to the Astros' rotation.",
        "The defending World Series champions announced García´s status before Friday night´s game in Seattle. The right-hander was placed on the 15-day injured list this week. He left Monday's start against the San Francisco Giants after eight pitches with elbow discomfort.\"That´s a tremendous blow. I mean, I was praying that it was something different, something minor,\" manager Dusty Baker said after Houston's 6-4 win. \"You're always afraid of that when it's in the elbow.\"García´s injury came the same day fellow right-hander Jose Urquidy was placed on the IL with inflammation in his pitching shoulder. A date for García´s surgery had not been set.The loss of García is another major hurdle for the Astros to deal with.Star second baseman Jose Altuve has been out all season after breaking his right thumb in the World Baseball Classic. Veteran outfielder Michael Brantley hasn´t played this year while recovering from right shoulder surgery.",
        "Houston is also without outfielder Chas McCormick, who has been sidelined since April 15 with lower back tightness.Baker said before Friday's game that McCormick and Brantley could join the Astros later on Houston´s road trip, likely when the team goes to Southern California to face the Angels. Baker spoke prior to the news about García being announced.García was 2-2 with a 4.00 ERA in six starts this season. Last season he went 15-8 with a 3.72 ERA in 28 starts and in 2021, García was second in AL Rookie of the Year voting after going 11-8 with a 3.48 ERA in 30 games (28 starts).",
        "\"He's a strong kid. He's in good spirits, but it's a tremendous blow,\" Baker said. \"Hopefully (J.P.) France and some of the other young guys can give us a lift.\"___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}