{
    "articleURL": "/tvshowbiz/article-12044691/Melissa-McCarthy-names-favourite-Australian-destination.html",
    "content": [
        "She recently shared her dream of moving to Australia permanently, after temporarily relocating Down Under to film two television shows during the Covid pandemic. ",
        "And Melissa McCarthy has now named her favourite Australian destination - Byron Bay.  The American actress, 52, is an ambassador for Booking.com and is currently promoting the website's Travel Sustainable badge, an award given to environmentally conscious hotels. 'My favourite travel destinations have given me so many wonderful memories, especially the time spent with family and friends immersing ourselves in the local culture,' the Bridesmaids star told Daily Mail Australia.'So I am a huge advocate for ensuring we preserve these special destinations (and all destinations) so that we continue to have a world worth exploring,' she added. ",
        "The Hollywood star also shared some recommendations for her favourite places to stay in Byron Bay, including Cape Beach House, Cape Byron Retreat, and Buhwi Bira Byron Bay. Back in March 2021, Melissa told InStyle Magazine she'd fallen in love with Australia after filming Nicole Kidman's hit Hulu series Nine Perfect Strangers in Byron Bay. 'I am connected to Australia in a way that I didn't anticipate. I could very easily live here for the rest of my life. I'm in love with it,' she said at the time. 'Everyone is so chatty. I'm a Midwestern gal who lives in L.A., where no one wants to talk to you. And here I'll be in the grocery store, and I can't go down a single aisle without talking to somebody. It's wonderful,' she added. ",
        "Meanwhile, The Bridesmaid star also told the publication her love for Australia is so great, she keeps trying to enlist her Hollywood friends to follow her to our sunny shores.'Ben says, 'You can't just tell people to hop on a plane and go to Australia.' I was like, 'Well, I'm trying to create the world I want,'' she added.After filming wrapped for Nine Perfect Strangers, Melissa stayed in Australia to film her Netflix series God's Favourite Idiot alongside her husband Ben Falcone. Once regarded as a 'hippie' coastal town, Byron Bay has become a hotspot for Australian and international celebrities in recent years. Chris Hemsworth and wife Elsa Pataky are among some of Byron Bay's most famous residents, while the likes of Matt Damon, Zac Efron and Natalie Portman have previously chosen to holiday there."
    ]
}