{
    "articleURL": "/wires/ap/article-12051373/Germany-ease-solar-rules-new-installations-surge.html",
    "content": [
        "BERLIN (AP) - Germany's energy minister announced plans Friday to ease bureaucratic hurdles for solar power as the country set a new record for photovoltaic installations during the first quarter.",
        "Europe's biggest economy added 2.7 gigawatts of solar power capacity during the first three months of 2023, putting it on course to beat the target of 9 GW this year, compared with 7 GW in 2022.Energy Minister Robert Habeck said that he hoped Germany would for the first time install new PV capacity in the double-digits this year, an important milestone in the country's effort to become carbon neutral by 2045.The government wants to have 215 GW of solar installed in Germany by 2030, more than tripling existing capacity in seven years.To achieve that increase, Habeck announced a series of measures that would cut red tape, including accelerating the planning and approval process for PV on buildings and on unbuilt land.While many of the changes concern minor bureaucratic issues that had a considerable deterrent effect on businesses and individuals wanting to use solar power, other measures are aimed at boosting production of PV panels in Germany and training workers to install them.",
        "Solar power was responsible for more than 10% of Germany's electricity production last year, compared with about 23% from wind. The country aims to generate 80% of its electricity from all forms of renewables by 2030.Habeck, a member of the environmentalist Green party, has faced allegations of nepotism in recent days over the way key positions in his ministerial portfolio were filled since he took office at the end of 2021.",
        "Asked about the criticism, Habeck said mistakes had been made with the appointment of the head of the German Energy Agency, a government think tank, but insisted that other positions had been filled in a transparent way with safeguards to prevent conflicts of interest."
    ]
}