{
    "articleURL": "/wires/ap/article-12047235/Ex-Proud-Boys-leader-Tarrio-guilty-Jan-6-sedition-plot.html",
    "content": [
        "WASHINGTON (AP) - Former Proud Boys leader Enrique Tarrio and three other members of the far-right extremist group were convicted Thursday of a plot to attack the U.S. Capitol in a desperate bid to keep Donald Trump in power after the Republican lost the 2020 presidential election.",
        "A jury in Washington, D.C., found Tarrio and three lieutenants guilty of seditious conspiracy after hearing from dozens of witnesses over more than three months in one of the most serious cases brought in the stunning attack that unfolded on Jan. 6, 2021, as the world watched on live TV.Jurors cleared a fifth defendant - Dominic Pezzola - of the sedition charge, though he was convicted of other serious felonies. The judge excused the jury without delivering a verdict on some counts - including another conspiracy charge for Pezzola - after jurors failed to reach a unanimous decision.It´s a significant milestone for the Justice Department, which has now secured seditious conspiracy convictions against the leaders of two major extremist groups prosecutors say were intent on keeping Democratic President Joe Biden out of the White House at all costs. The charge carries a prison sentence of up to 20 years.\"The Justice Department will never stop working to defend the democracy to which all Americans are entitled,\" Attorney General Merrick Garland told reporters after the verdict.Tarrio, behind bars since his March 2022 arrest, didn't appear to show any emotion as the verdict was read. He hugged one of his lawyers and shook the hand of the other before leaving the courtroom. A few of the people sitting among the defendants´ relatives wiped away tears as the verdict was read.",
        "The verdict comes after a trial that took more than twice as long as originally expected, slowed by bickering, mistrial motions and revelations of government informants in the group. Securing the conviction of Tarrio, a high-profile leader who wasn´t at the riot itself, could embolden the Justice Department as a special counsel investigates Trump, including key aspects of the Jan. 6 insurrection.Special Counsel Jack Smith in recent weeks has sought the testimony of many people close to Trump. They include former Vice President Mike Pence, who testified before a grand jury last week, likely giving prosecutors a key first-person account about certain conversations and events in the weeks preceding the riot.Tarrio was a top target of what has become the largest Justice Department investigation in American history. He led the neo-fascist group - known for street fights with left-wing activists - when Trump infamously told the Proud Boys to \"stand back and stand by\" during his first debate with Biden.Tarrio wasn´t in Washington on Jan. 6, because he had been arrested two days earlier in a separate case and ordered out of the capital city. But prosecutors said he organized and directed the attack by Proud Boys who stormed the Capitol that day.In addition to Tarrio, a Miami resident, three other Proud Boys were convicted of seditious conspiracy: Ethan Nordean, Joseph Biggs and Zachary Rehl.",
        "Tarrio, Nordean, Biggs and Rehl were also convicted of obstructing Congress´ certification of Biden´s electoral victory and obstructing law enforcement as well as two other conspiracy charges. The four were cleared of an assault charge stemming from Pezzola, who stole an officer´s riot shield.Rehl's attorney, Carmen Hernandez, said her client \"continues to maintain his innocence.\" Lawyers for Biggs and Pezzola declined to comment. An attorney for Tarrio declined to comment.Prosecutors told jurors the group viewed itself as \"Trump´s army\" and was prepared for \"all-out war\" to stop Biden from becoming president.The Proud Boys were \"lined up behind Donald Trump and willing to commit violence on his behalf,\" prosecutor Conor Mulroe said in his closing argument.The backbone of the government´s case was hundreds of messages exchanged by Proud Boys in the days leading up to Jan. 6 that show the far-right extremist group peddling Trump´s false claims of a stolen election and trading fears over what would happen when Biden took office.As Proud Boys swarmed the Capitol, Tarrio cheered them on from afar, writing on social media: \"Do what must be done.\" In a Proud Boys encrypted group chat later that day someone asked what they should do next. Tarrio responded: \"Do it again.\"\"Make no mistake,\" Tarrio wrote in another message. \"We did this.\"",
        "Defense lawyers denied there was any plot to attack the Capitol or stop Congress´ certification of Biden´s win. A lawyer for Tarrio sought to push the blame onto Trump, arguing the former president incited the pro-Trump mob´s attack when he urged the crowd near the White House to \"fight like hell.\"\"It was Donald Trump´s words. It was his motivation. It was his anger that caused what occurred on January 6th in your beautiful and amazing city,\" attorney Nayib Hassan said in his final appeal to jurors. \"It was not Enrique Tarrio. They want to use Enrique Tarrio as a scapegoat for Donald J. Trump and those in power.\"The Justice Department hadn´t tried a seditious conspiracy case in a decade before a jury convicted another extremist group leader, Oath Keepers founder Stewart Rhodes, of the Civil War-era charge last year.Over the course of two Oath Keepers trials, Rhodes and five other members were convicted of seditious conspiracy for what prosecutors said was a separate plot to forcibly halt the transfer of presidential power from Trump to Biden. Three defendants were acquitted of the sedition charge, but convicted of obstructing Congress´ certification of Biden´s electoral victory.The Justice Department has yet to disclose how much prison time it will seek when the Oath Keepers are sentenced later this month.",
        "___This story has been corrected to reflect that the Oath Keepers sentencings are scheduled for later this month, not next month."
    ]
}