{
    "articleURL": "/wires/reuters/article-12061219/Russia-hold-Victory-Day-parade-amid-tight-security-drone-attacks.html",
    "content": [
        "Victory Day is major public holiday in Russia",
        "Some events cancelled amid security concernsPutin to make speech in Red SquarePatriarch says Russia must be strong to resist attackBy Gareth JonesMay 9 (Reuters) - Russia celebrates on Tuesday the anniversary of victory over Nazi Germany in World War Two with a parade in Red Square amid tight security following a series of drone attacks, including on the Kremlin citadel itself, that Moscow has blamed on Ukraine.Victory Day is one of the most important public holidays in Russia, when people commemorate the huge sacrifices made by the Soviet Union during what is called the Great Patriotic War of 1941-45, in which around 27 million citizens perished.This anniversary is even more emotionally charged as Russia mourns thousands of soldiers killed in the nearly 15-month war in Ukraine which shows no sign of ending.Russia is also reeling from drone attacks, including one on the Kremlin on May 3 which it said was an attempt to assassinate President Vladimir Putin. Ukraine, which is expected shortly to launch a counteroffensive to retake land, denies involvement.Putin has repeatedly likened the Ukraine war - which he casts as a battle against \"Nazi\"-inspired nationalists - to the challenge the Soviet Union faced when Hitler invaded in 1941.",
        "Kyiv says this is absurd and accuses Russia of behaving like Nazi Germany by waging an unprovoked war of aggression and seizing Ukrainian territory.Putin, his defence minister and other senior officials are expected to review the Red Square parade, which usually includes tanks, intercontinental missile launchers and marching troops.However, reflecting increased security concerns caused partly by the drone attacks, authorities have cancelled the traditional flyover. There have also been reports of fewer soldiers and less military hardware joining this year's parade as the Ukraine conflict takes a heavy toll on men and equipment.Authorities nationwide have cancelled the \"Immortal Regiment\" processions, where people carry portraits of relatives who fought against the Nazis.'SACRED BORDERS'Putin will deliver a speech in Red Square, where he will be joined by leaders of several ex-Soviet republics. In last year's address he made no mention of Ukraine but slammed the NATO military alliance for expanding to Russia's borders and hailed Soviet heroism in resisting Hitler.Since then, Finland - which borders Russia - has also joined NATO.\"May no one ever again encroach on the sacred borders of our Fatherland,\" said Patriarch Kirill, head of the powerful Russian Orthodox Church and a close Putin ally, as he laid flowers on Monday at the Tomb of the Unknown Soldier in central Moscow.",
        "\"But in order for this to be so, our country must be strong because a country that is feared is not attacked.\"Asked on Monday about cancellations of some Victory Day events, Kremlin spokesman Dmitry Peskov blamed Ukraine: \"When we have to deal with a state that is de facto a sponsor of terrorism, then it is better to take precautionary measures.\"As well as the attack on the Kremlin compound, Moscow also blames Ukraine for drone strikes over the past week on fuel depots, freight trains and multiple targets in Crimea, which Russia forcibly annexed from Ukraine in 2014.Moscow also accused Kyiv and the West of carrying out a car bombing on Saturday that wounded a prominent Russian nationalist writer, Zakhar Prilepin.Ukraine's President Volodymyr Zelenskiy annoyed Russia on Monday by moving the day that his country marks the allied victory over Nazi Germany to May 8, aligning it with Western nations in a repudiation of its Soviet past.Russia's foreign ministry spokeswoman Maria Zakharova branded Zelenskiy a \"traitor\", saying he had betrayed the memory of Ukrainians who died fighting the Nazis. (Additional reporting by Reuters Television; Writing by Gareth Jones; Editing by Andrew Cawthorne)"
    ]
}