{
    "articleURL": "/tvshowbiz/article-12041995/Pregnant-Jessie-J-shows-baby-bump-relaxes-sofa-beau-Chanan-Safir-Colman.html",
    "content": [
        "She's counting down the birth of her first child with her boyfriend Chanan Colman.",
        "And Jessie J showed off her growing baby bump on Instagram while lying on a sofa in a white sports bra on Wednesday. The singer, 35, who is set to welcome a son in a matter of weeks, was seen lying on her side with her leg over a pillow while her beau Chanan held her leg. She displayed her large tattoo on her stomach in the snap and kept comfortable in a pair of long white Nike socks. It comes after Jessie looked every inch the glowing mother-to-be as she took to social media to share a candid clip on Tuesday.",
        "The Price Tag singer showed off her bare bump in a white crop top and loose black trousers as she cooked herself dinner at home. In the video, Jessie's prominent bump was on full display as she showed off her growing tummy.Zooming in closely on her bump, the star pulled a playful expression for the camera before strolling into the kitchen to continue her cooking.Last week, Jessie confirmed to her followers that she was 'still pregnant', and joked about being 'hyped' at her changing body as a result.Jessie captioned: 'Still pregnant. Still singing. Still hyped my little ti**ies are now filling a size L bra. Still can’t believe it’s real. Still my fav audience member. Still need to pee. Still doing my epi no (IYKYK)'.",
        "With her raven locks pulled back into an up do', she appeared make-up free in the candid video - where an acoustic backing track played.Sharing the clip with her 12.9M followers, it's the latest in a string of social media updates from the singer as she documents her first pregnancy.Jessie and Chanan have been in a relationship with for a year. ",
        "In April last year, Jessie confirmed she was in a new relationship with the basketballer as they kissed on lunch date in LA.The pair first sparked romance rumours in March 2022 on Richard Branson's Necker Island in the Caribbean as Chanan has joined Jessie for the work trip.Jessie took to Instagram at the time and looked cosy with the Danish-Israeli professional basketball player in a group beach picture.Months later in May, she hinted that the 38-year-old veteran pro athlete is the first partner she's been 'properly in love' with.When appearing on The Diary of a CEO podcast, the Flashlight hitmaker teased fans about her love life but kept the details private.Jessie was asked by host Steven Bartlett how many times she'd been truly in love and she replied 'once', answering in the present tense, hinting she saw her future settled with Chanan.She continued: 'Because I can actually see my life with that person and I've never had that before.'",
        "Looking for more details, Steven said: 'sounds recent?', she grinned: 'Maybe it is.' but cheekily added: 'Maybe it isn't. Who knows? Hint.' Managing to keep the pregnancy impressively under wraps to begin with, the star announced the joyous news back in January.To announce the news, she shared a montage of sweet clips from different parts of her term so far. Captioning her post, the singer penned: 'I am so happy and terrified to finally share this… Please be gentle with me. 'Honestly, ya girl just wants to ugly cry in public in a catsuit eating a chocolate covered pickle with no questions asked.'"
    ]
}