{
    "articleURL": "/sport/formulaone/article-12038269/Red-Bull-boss-Christian-Horner-insists-Max-Verstappen-Sergio-Perez-free-race.html",
    "content": [
        "Sergio Perez beat Max Verstappen to win Sunday's Azerbaijan Grand Prix in BakuThe Red Bull team mates appear to be locked in a collision course for the titleChristian Horner insists that Verstappen and Perez are 'free to race' each other  Red Bull boss Christian Horner has declared that Sergio Perez and Max Verstappen are 'free to race,' as the team mates look to be on collision course for this year's drivers' championship.",
        "The 2023 Red Bull challenger appears to be in a league of its own over the rest of the competition, with Perez and Verstappen sharing two wins apiece in the opening four events this season.Perez closed the gap to Verstappen at the top to just six points after winning the Azerbaijan Grand Prix, as well as the sprint race one day prior.   Red Bull have often been criticised in the past for appearing to favour one driver over the other, with some expecting the team to favour double world champion Verstappen in his quest of a third consecutive title.  Horner though claims that as long as they are clear of their competition, they will be allowed to fight.",
        "Horner told reporters on Sunday: 'At the moment it's the two of them. There's a slight gap between the rest of the field, but there's 19 more races to go, and five sprint races.'There's a huge amount of racing and a whole variance of different circuits to go through, so it could ebb and flow between the two of them.'Reliability will be a key factor. And what we're more focused on as well at the moment is building a buffer with both of the drivers. Because when we get back to Europe, I'm sure there's going to be sizeable upgrades (from other teams).",
        "'And, of course, we have a reduced capacity to develop this year (due to their punishment for breaking the budget cap in 2021), so that's where our focus is – trying to build a gap.'There's six points between them after four races so they're both competitive drivers. They both want to win, which is why they're employed by the team. And I think that it's down to what they do on the track.'They were free to race today and, all year so far, they've been free.'Asked if that would continue later in the season, he added: 'Yes until the team's interests, if you're competing against a competitor, becomes bigger than the drivers' interests. But, as it is at the moment, they're free to race.'Verstappen has faced little competition from team mates since Daniel Ricciardo finished ahead of him in the 2017 season.",
        "Ricciardo, Pierre Gasly, Alex Albon and Perez have all since struggled to stay on terms with the Dutchman.After two wins out of the opening four races, Perez is hoping to buck that trend and he said on the team radio after the race at Baku that his side are 'still in the fight'.Questions over favoritism within the Red Bull team were raised after Perez's victory at the Saudi Arabian Grand Prix this season.",
        "Perez had questioned a radio instruction to maintain his laptime, wondering if the same instruction had been given to his pursuing teammate. Verstappen then asked about the fastest lap, only to be told that the team were 'not worried about that'. Verstappen promptly replied, 'but I am', and took the fastest lap point away from Perez on the very last lap.This seemed to have annoyed Perez, who explained afterward that he felt different information had been given to himself and Verstappen – with the fastest lap giving the 25-year-old an extra point towards his collection. "
    ]
}