{
    "articleURL": "/wires/afp/article-12053557/Afghan-foreign-minister-woo-neighbours-rare-visit.html",
    "content": [
        "The foreign minister of Afghanistan's Taliban government, which is not recognised by any other nation, held talks Saturday with his counterparts from Pakistan and China during a rare visit abroad.",
        "Amir Khan Muttaqi is barred by international sanctions from leaving Afghanistan but was granted an exemption for a trip to Islamabad just days after the United Nations secretary-general again condemned the Taliban government's curbs on women.China and Pakistan are Afghanistan's most important neighbours, with Beijing eyeing the vast untapped mineral resources that lie across their tiny shared border, and Islamabad wary of huge security risks along their much longer common frontier.With the minister for commerce and industry in tow, the Afghan delegation was one of the most high-profile to travel abroad since the Taliban seized power in August 2021 following the withdrawal of US-led foreign forces and collapse of the Western-backed government.\"The biggest significance of this summit is that at this moment, as we understand it, no regional economic future is possible without the stability of Afghanistan,\" said Maria Sultan, director general of the South Asian Strategic Stability Institute.\"It is also important that a formal relationship should be established, and this is only possible if there is working reconstruction of the diplomatic track,\" she told AFP.Officials said the one-day gathering was focused on how best to help Afghanistan improve security and enhance economic stability.\"Our message consistently to the Afghan authorities has been 'help us help you',\" Pakistan's Foreign Minister Bilawal Bhutto Zardari told media.",
        "Chinese Foreign Minister Qin Gang said both Beijing and Islamabad were \"ready to actively support Afghanistan with its economic reconstruction\".\"We hope that the Taliban will embrace inclusive governance and moderate policies and maintain friendly relations with its neighbours,\" he told reporters.But, he warned, \"it is important the Taliban take the security concerns of its neighbours seriously and take stronger measures to counter the various terrorist forces within Afghanistan\".Muttaqi's visit comes amid a flurry of diplomacy about -- but not involving -- Afghanistan's new rulers.- 'Counter-productive' -Earlier this week, UN chief Antonio Guterres told a meeting of envoys from the United States, Russia, China and 20 other countries and organisations that \"millions of women and girls are being silenced and erased from sight\" in the country.Taliban government officials were not invited, however, an omission a representative called \"counter-productive\".Also this week, a meeting in India of foreign ministers of the Shanghai Cooperation Organisation -- of which Kabul has observer status -- discussed Afghanistan without the presence of any representatives.The Afghan government is desperate for international recognition to give it legitimacy and has been lobbying individual nations outside of groups such as the United Nations.\"These meetings will intensify speculation that China and Pakistan are two of the few countries willing to engage closely with the Taliban, and perhaps even hold open the possibility of recognition down the road,\" said Michael Kugelman, director of the South Asia Institute at The Wilson Centre.",
        "On Friday, the UN reaffirmed its \"commitment to stay\" in Afghanistan following a review in light of the Taliban government banning local women from working for the world body there.In a statement issued from Kabul, the United Nations' mission in Afghanistan reiterated its condemnation of the ban, which \"seriously undermines our work, including our ability to reach all people in need\".\"We cannot disengage despite the challenges,\" it said.The Taliban government has firmly rejected criticism of the curbs on women, calling them an \"internal social issue\".Afghanistan is facing one of the world's worst humanitarian crises, international aid agencies say, with its 38 million population hungry and three million children at risk of malnutrition.Since returning to power, the Taliban authorities have imposed an austere version of sharia law that the UN has labelled \"gender-based apartheid\".Teenage girls are barred from secondary school, while women have been pushed out of many government jobs, prevented from travelling without a male relative and ordered to cover up outside the home, ideally with a burqa.Qin, making his first visit to Pakistan since being appointed in December, also held bilateral talks with his Pakistani counterpart.China has been Pakistan's key defensive ally since the Cold War and also its most vital economic partner through loans and infrastructure projects totalling billions of dollars."
    ]
}