{
    "articleURL": "/wires/reuters/article-12042977/US-oil-gas-output-growth-set-slow-sharply-Kemp.html",
    "content": [
        "By John Kemp",
        "LONDON, May 3 (Reuters) - U.S. oil and gas production grew rapidly in the first two months of 2023 - a delayed response to the high prices and upturn in drilling that characterised much of last year following Russia´s invasion of Ukraine.But growth is set to decelerate sharply as the more recent slump in prices curtails new drilling and well completions, with the impact evident by the fourth quarter of 2023.U.S. crude and condensates production fell by 53,000 barrels per day (bpd) in February from the month before, according to data from the U.S. Energy Information Administration (EIA).Lower output from the U.S. portion of the Gulf of Mexico (-79,000 bpd) and Alaska (-2,000 bpd) more than offset continued growth from the Lower 48 states (+28,000 bpd).Total production nonetheless increased by almost 1.2 million bpd compared with the same month a year earlier (\"Petroleum supply monthly\", EIA, April 28).Cumulative output reached 738 million barrels in the first two months of 2023, up from 669 million barrels in the same period in 2022, and the second highest ever after 771 million in 2020, before the pandemic.Chartbook: U.S. oil and gas productionMuch of the increase was the lagged effect of high prices and additional drilling during the first nine months of 2022.",
        "Producers generally wait to confirm a price increase will last, and must then hire rigs, wait for them to move into position, finish boring, hire completion crews, fracture wells, flow test them, and connect them to gathering systems.After prices increase, it typically takes an average of five months for oil drilling to accelerate and another six months for wells to be fractured and completed, resulting in an overall lag of up to 12 months.In real terms, front-month futures prices for U.S. crude were well above $100 per barrel for most of the second quarter of 2022, putting them above the 80th percentile for all trading days since 1990.The impact of that period of very high prices was still boosting output during the first quarter of 2023 as wells contracted earlier were completed and put into production.Since then, however, front-month WTI prices have fallen to around $70, roughly the 60th percentile, diminishing the incentive to boost production.In response, the number of rigs drilling for oil had fallen to 591 on April 28 from a post-pandemic high of 627 on Dec. 2, according to field services company Baker Hughes.Slower drilling will filter through into slower production growth before the end of 2023, helping offset slower consumption growth as a result of the business cycle downturn.",
        "GAS PRODUCTIONU.S. gas production increased to a record 5,984 billion cubic feet in the first two months of 2023, up from 5,600 billion cubic feet in the same period in 2022, an increase of almost 7%.Strong growth in output coupled with a relatively mild winter and the disruption of exports after the explosion at Freeport LNG resulted in a large build up of inventories and pressured prices.Working gas inventories in underground storage amounted to 2,009 billion cubic feet on April 21 compared with 1,484 billion cubic feet at the same point a year earlier.Stocks were in a surplus of 280 billion cubic feet (+16% or +0.61 standard deviations) over the ten-year seasonal average, having been in a deficit of 432 billion cubic feet (-14% or -1.50 standard deviations) as recently as September 2022.The massive surplus has depressed prices to just $2.10 per million British thermal units (2nd percentile for all days since 1990 in real terms) down from more than $9.30 (90th percentile) in August 2022.The number of rigs drilling for gas has remained steady at around 150-160 per week since September, after climbing steadily from just over 100 at the start of 2022.The static rig count should slow production growth from the third quarter of 2023, and the restart of Freeport LNG´s export operations should help reduce some of the surplus inventory.",
        "But the accumulated surplus is so large some reduction in drilling and completions will probably be needed to push production and consumption back into balance and eliminate excess stocks.Ultra-low prices are providing the strongest possible incentive to postpone new drilling and completions to promote a return to balance as well as encourage gas-fired power generators to maximise their running hours.Related columns:- U.S. gas prices slump after mild winter leaves big surplus (March 24, 2023)- U.S. oil drilling falls in response to lower prices (February 27, 2023)- U.S. gas prices near record low amid over-production (February 22, 2023)- U.S. gas prices slump on production surplus (January 12, 2023)John Kemp is a Reuters market analyst. The views expressed are his own (Editing by Mark Potter)"
    ]
}