{
    "articleURL": "/news/article-12037979/Furious-Londoners-fight-against-Just-Stop-Oil-eco-zealots.html",
    "content": [
        "Demonstrators have caused chaos by slow marching every day since April 24Video footage of different incidents shows Londoners have had enough Members of the public have been taking a stand and fighting back against Just Stop Oil eco-zealots causing disruption in London. ",
        "Demonstrators have caused chaos by slow marching every day since April 24, frustrating drivers and bus passengers trying to get around the capital - but Londonders appear to have had enough. Video footage shows one passerby in a high-vis jacket retaliate by furiously ripping all the banners out of the hands of protesters. 'Film it,' he tells the person behind the camera, showing that he will not be deterred as he appears to shout at them in frustration. Another video clip shows an angry motorcyclist arguing with the protesters to get out of the way. Eventually they allow him through, but he continues shouting - to which they shout back 'we are non violent and we are in civil resistance'.Earlier footage shows the moment a driver appears to ram into a Just Stop Oil protester before speeding off as the eco mob ignored police orders to move. ",
        "The protester had tried to block the car from getting past, but the motorist continued driving. The activist appears to fall onto the ground in the video footage amid claims of the driver having 'gone over her foot'.Met Police told MailOnline in relation to this incident: 'Police are appealing for witnesses and dash cam footage after a person was involved in a collision with a vehicle on Holloway Road, Islington, whilst engaged in a protest, at around 10:00hrs, today Tuesday 2 May.",
        "'The incident was brought to police attention after being circulated on social media and shows the person being involved in collision with a grey Renault Megane.'If you were the person or have any information about the incident please report by calling 101, tweeting @MetCC or online at www.met.police.uk/'In yet another video clip, a police officer is seen trying to negotiate with the protesters and calmly telling them they need to move onto the pavement. Smiling, he shakes hands with the lead protester and appears to try the friendly approach to get demonstrators out of the road. The numerous clips emerged as the eco group has caused chaos across London by slow marching every day since April 24.Yesterday, Scotland Yard told a group that it had imposed a condition on the march under Section 12 of the Public Order Act – ordering them to get on the pavement.",
        "But the activists argued with police, saying the order had to be imposed on an area rather than the march itself - and asked to speak to the Metropolitan Police officer behind it, Chief Inspector Chris Scammell, who turned up to explain the decision in more detail.But the group continued its demonstration this morning - with 55 protesters marching from Regent Street and Parliament Square at 7.30am and further marches expected later.",
        "A Section 12 order under the Public Order Act 1986 relates to 'imposing conditions on public processions'. It states:If the senior police officer, having regard to the time or place at which and the circumstances in which any public procession is being held or is intended to be held and to its route or proposed route, reasonably believes that -(a) it may result in serious public disorder, serious damage to property or serious disruption to the life of the community, or(b) the purpose of the persons organising it is the intimidation of others with a view to compelling them not to do an act they have a right to do, or to do an act they have a right not to do, he may give directions imposing on the persons organising or taking part in the procession such conditions as appear to him necessary to prevent such disorder, damage, disruption or intimidation, including conditions as to the route of the procession or prohibiting it from entering any public place specified in the directions.",
        "Yesterday, a video posted by Just Stop Oil on its Twitter page began with a police officer telling a protester: 'A Section 12 condition has been imposed on this march under the Public Order Act by Chief Inspector Scammell.'So the condition that has been put on the march is that you have to march on the pavement. 'If you don't, people that are marching on the road will be liable for arrest. That was imposed at 10.27am.'When one protester asked, 'Is the chief inspector not able to come and give it to everyone?' the officer said: 'No.' Another activist then said: 'I'm sorry, but our trust right now in the Metropolitan Police is very low, I don't know if you've heard, so I'd like the Bronze Commander to issue the Section 12.'Another officer then said: 'Whether you've got trust or not, that doesn't really matter.'The protester replied: 'I understand, but the Bronze Commander is over there.'But the officer insisted: 'Bronze doesn't have to come and tell you that in person.'The protester said: 'But how do I know that a Section 12 has been issued?'And the officer said: 'I told you that, I just told you. I gave you the name of the inspector who's authorised it. I can give you a time of it.'",
        "When the protester said: 'Which borough is it for, what is the jurisdiction?' the officer replied: 'At the moment it's for this street.'The Public Order Act 1986 states that conditions can be imposed by police 'as to the route of the procession or prohibiting it from entering any public place specified in the directions'. Pressed for further details, the officer added: 'The order is you can protest. But you can only protest on the sidewalk. 'If you protest in the middle of the road you are liable for arrest, that's what it is. It's been authorised at 10.27 this morning.'The video then cut to Chief Inspector Scammell turning up at the scene. He said: 'I'm Chief Inspector Scammell, OK. We've assessed your march from cameras and TfL, there's been significant disruption. 'It's reached the point where I've now put a Section 12 of the Criminal Justice and Public Order Act. Your procession must proceed on the footway.'The 1994 law quoted by Chief Inspector Scammell - Section 12 of the Criminal Justice and Public Order Act - relates to 'escort arrangements and officers' for young offenders, so he is thought to have meant to refer to Section 12 of the Public Order Act 1986, which relates to 'imposing conditions on public processions'. ",
        "This issue of the exact law was not mentioned by the protesters, but one asked him: 'What borough does this cover and until what time?' Chief Inspector Scammell replied: 'It's this procession for now.'",
        "But the protester said: 'It doesn't cover the procession, it covers an area.'However, Chief Inspector Scammell insisted: 'No, this procession needs to go on the footway. We have evidence of everyone in this procession.'Another protester said: 'I understand the procession element, but it has to be linked to an area.'But Chief Inspector Scammell said: 'No, it's just the procession. I'm not putting any directions on your procession, just where it marches, because we don't know where you are going to go. So it's this procession.'They then had a similar back and forth where Chief Inspector Scammell insisted he was not banning the group from marching - just not on the road.Today, Just Stop Oil activists continued their marching as they call for the Government to stop licensing new fossil fuel projects in the UK.In a press release it quoted one of the marchers, Sarah Benn, 56, a former NHS GP of 32 years from Birmingham, saying: 'As a doctor I have dealt with many emergencies, and the first thing you do in that situation is to urgently remove what is causing or worsening the situation.",
        "'We face a climate and ecological emergency, yet our Government sits on its hands and mouths platitudes - instead of taking the no-brainer first step of ending new fossil fuel licences.''My youngest starts GCSEs this week, but instead of being home supporting and encouraging him, I'm here slow marching with Just Stop Oil - because I'm terrified for him. Good exam grades are pointless in the face of uncontrollable flooding and wildfires, crop failures, food shortages, the collapse of the NHS and everything we love.'The group also quoted another marcher, Noah Crane, 18, an A-Level student from Norfolk, who said: 'We have seen time and again that words are not sufficient to bring about necessary social change. The people who are both the most powerful and the most greedy in the world are making billions from selling our futures; they aren't going to stop just because we ask nicely. We have to demand it.'If, throughout all of human history, there has ever been a time to take action, it is now.'Just Stop Oil said that since its campaign began on April 1 last year, there have been more than 2,100 arrests and 138 people have spent time in prison.",
        "It added that there were two Just Stop Oil supporters and four Insulate Britain supporters serving prison sentences for resisting new oil, gas and coal.Karen Findlay, Commander of Major Operations and Public Order at Scotland Yard, tweeted today: 'We are aware as of 7.40am of a group of about ten Just Stop Oil protestors in Parliament Square slow walking in one lane.'Officers immediately on scene. All protestors directed to the pavement and cleared off the carriageway within 12 minutes. Traffic moving normally.'She added soon after: 'We are aware of a further two groups of Just Stop Oil protestors slow marching in Parliament Square (different group to previous one) and Grosvenor Square. Police are on scene. Sec 12 conditions and directions to get immediately on to the pavement issued.'"
    ]
}