{
    "articleURL": "/wires/reuters/article-12052561/Justin-Steele-stays-dominant-Cubs-hand-Marlins-fourth-straight-loss.html",
    "content": [
        "Justin Steele continued his strong start by allowing one run through seven innings and Ian Happ clubbed a two-run home run as the Chicago Cubs snapped their three-game losing streak with Friday's 4-1 victory over the visiting Miami Marlins.",
        "In his seventh start of the season, Steele (5-0) lowered his ERA 1.45, while yielding just a sixth-inning run along with six hits, no walks and four strikeouts to complete seven for the fifth time of his career.Steele tied Jake Arrieta's franchise record (since 1912) with 14 consecutive starts of allowing two earned runs or fewer.Seiya Suzuki had an RBI single and Nico Hoerner recorded two hits for the Cubs, who won for just the fourth time in the last 13 games.Highly-touted Chicago first-base prospect Matt Mervis went hitless in the first three at-bats of his major league debut on Friday before delivering an RBI single in the eighth.Luis Arraez went 3-for-4 for the Marlins to raise his majors-leading average to .437. The Marlins have been outscored 30-10 while losing four in a row after sweeping a three-game home series from Chicago last weekend.Miami's Edward Cabrera (2-3), who fanned 12 Cubs last weekend, allowed three runs and five hits while walking just one and striking out eight over five innings Friday.Chicago opened the scoring in the bottom of the first when Hoerner led off with a single and eventually scored on Suzuki's hit over the head of Marlins third baseman Jean Segura. The Cubs were finally able to add to that in the fifth, when Dansby Swanson singled with two outs and scored on Happ's fourth homer of the season into the right-center field bleachers.",
        "Miami made it a 3-1 contest in the top of the sixth. Jon Berti (two hits) led off with an infield single, went to third on Arraez's second hit and scored on Yuri Gurriel's sacrifice fly.Mervis' run-scoring single added insurance for Chicago. Mark Leiter Jr. pitched the ninth for his first save.--Field Level Media"
    ]
}