{
    "articleURL": "/news/article-12043735/Madeleine-McCanns-younger-sister-Amelie-18-speaks-publicly-time-candle-ceremony.html",
    "content": [
        "This is the first time Amelie McCann has been pictured since she was a childAmelie said: 'It's nice that everyone is here together but it's a sad occasion'Madeleine McCann's younger sister spoke publicly for the first time last night as her family marked the poignant 16th anniversary of the toddler's disappearance.",
        "Maddie vanished from a holiday apartment in Praia da Luz in Portugal in May 2007 when she was just three.Her sister Amelie, now 18, joined her parents and well-wishers last night at a candle service dedicated to her. She said: 'It's nice that everyone is here together, but it's a sad occasion.'It was the first time Amelie, who is applying to go to university, has been pictured since she was a toddler - giving a glimpse of what her older sibling may look like as an adult.The vigil came two weeks after a German court decided not to hear a sex offences case against a man who is a suspect in Madeleine's disappearance.",
        "Fact-box text",
        "Amelie, with her long blonde hair and casually dressed in navy leggings, trainers and cream puffa jacket, was warmly welcomed along with Kate and Gerry by locals and supporters during an informal prayer gathering in their home village of Rothley, Leicestershire.Her twin brother Sean did not attend.Kate's close friend Fiona Payne, one of her 'Tapas Seven' pals who was on the fateful holiday in Portugal when Maddie vanished, was among the crowd.Maddie's parents had been having a tapas meal with friends when Maddie was abducted from their apartment just yards away. Amelie took her turn to light a candle for Maddie and other missing children at the war memorial, where pictures of her sister adorned the black railing and where a lantern of hope still glows around the clock for her.",
        "Kate, wearing black jeans and a blue jacket, joined in prayers but neither she nor Gerry addressed the crowds.Fiona, a doctor, read a moving poem, Hope Is The Thing With Feathers, by Emily Dickinson. She later gave Kate a warm embrace.The Reverend Rob Gladstone, vicar of the local parish church, led prayers at the informal outdoor event.He told those gathered: 'We are here this evening to show our loving concern for Madeleine and for all young children who have been taken away from their families against their will.'We are also here to encourage one another to keep up hope and pray for a renewal of strength even after this long time.'",
        "Amelie, accompanied by her friend Georgina, joined in repeating mantras read out by individual people in the 70-strong crowd, including 'Never, never give up', 'Leave no stone unturned', 'Don't forget about me' and 'Still missing, still missed'.Kate and Gerry cling to a glimmer of hope that Maddie, who would now be 19, could still be alive.Kate's uncle, retired head teacher Brian Kennedy, 84, said after the event: 'Kate and Gerry are very moved by the size of the group of people who turned up.'After all these years people still assemble - some come every time and some are new and we are very grateful.'",
        "Brian, who lives in the same village with his wife Janet, who addressed the crowd, added: 'Sixteen years without someone and still not knowing where they are is a very long time. Even if it was bad news, in some ways, would give us some closure.'But with no closure there is still hope.'German police are convinced Maddie is dead and have been intent on charging prime suspect Christian Brueckner - who was named nearly three years ago - with her kidnap and 'no-body' murder.But it recently emerged that the convicted paedophile may never face a trial in the high-profile case, and for unrelated alleged sex offences, because of a legal technicality over foreign courts' jurisdiction.Brueckner, 45, is serving a sentence in a German jail for the rape of an American tourist in the same Portuguese resort of Praia da Luz from where Maddie vanished in May 2007.He has vehemently denied any involvement in her abduction.",
        "No suspects have ever been charged in connection with one of the world's most talked-about missing child mysteries.British Police have recently asked the Home Office for more money to keep up their investigation, which is codenamed Operation Grange and has cost the taxpayer £13million so far.Their request is set to be approved by a Special Grants committee.",
        "Maddie was snatched just nine days before her fourth birthday from a holiday apartment in the Algarve while she was sleeping alone with her younger twin siblings.At the time her parents were dining with pals in a nearby tapas restaurant.Heart doctor Gerry and Kate, a former GP turned medical worker with dementia sufferers, both 55, have previously said: 'We will never give up hope of finding Madeleine alive, but whatever the outcome may be, we need to know as we need to find peace.'All we have ever wanted is to find her, uncover the truth and bring those responsible to justice.'We are grateful for the ongoing work and commitment by the British, German and Portuguese police. It is this combined police effort which will yield results and bring us those answers.'A Polish woman, Julie Wendell, recently heaped more misery on Maddie's parents by claiming in global online posts to be the missing child.Despite negative DNA tests, denials from her own family and a year's difference in age, she bizarrely continues to insist she is Madeleine. ",
        "Kate and Gerry had earlier posted a message on the official Find Maddie website, saying their daughter was 'still very much missed' and they 'await a breakthrough' in the police hunt for her.",
        "They wrote: 'Today marks the 16th anniversary of Madeleine's abduction. Still missing...still very much missed.'It is hard to find the words to convey how we feel. The poem below, by Clare Pollard, resonates strongly with us.The ContradictionThe absence contradicts itself:the missing conjures what we miss.You are not here, I'm not myself,but still I talk to you like this.You're in the crowd, the news, the glimpse -I make you there when you're not there.I trace your steps, I map your face,I say your name, see you in air.You're all I know and so unknown.I cannot hold you, yet I do:please let me hold you in my headand where you are now, hold me too.How can you be so near and far?You are not here. But here you are.'The police investigation continues, and we await a breakthrough. Thank you to everyone for your support - it really helps.'"
    ]
}