{
    "articleURL": "/femail/article-12054737/Princess-Charlotte-took-protective-role-Prince-Louis-coronation.html",
    "content": [
        "Princess Charlotte, Prince George and Prince Louis attended the coronation at Westminster Abbey todayHow are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.uk Read more: King Charles Coronation LIVE - follow the latest updates from Westminster AbbeyPrincess Charlotte appeared to take on a protective and reassuring role for her younger brother Prince Louis during today's coronation celebrations - but couldn't help but share a giggle with the five-year-old at the Buckingham Palace balcony appearance following the ceremony. ",
        "The eight-year-old daughter of the Prince and Princess of Wales was seen sitting alongside her little brother Prince Louis, in a royal car with their parents after leaving the palace, and in the front row of the Abbey a short time later. The siblings held hands during the opening moments of the historic service.Charlotte and Louis arrived without their older brother Prince George, nine, who was a Page of Honour for his grandfather. They were immaculately behaved during the service, with Charlotte proving a reassuring presence to her younger brother, who couldn't help stifle a few yawns during the sacred service. George, Charlotte and Louis were reunited after the service when they rode away from Westminster Abbey to Buckingham Palace in a carriage with their parents. The trio later appeared on the balcony of Buckingham Palace with their parents, their newly crowned grandparents The King and Queen and the other working royals. During this appearance, Charlotte could be seen sharing a giggle with her youngest brother. ",
        "The young royal stood at the right of the monarchs on the balcony, as they watched a special fly past go over the royal residence.  Prince Louis, five, put on an animated display, while Charlotte and George also watched the moment happen with glee. George, nine, was seen joking around with the other page boys who assisted with the King's cape during the ceremony. ",
        "Princess Charlotte looked resplendent in the white dress and headpiece that were picked for the momentous day. The young princess wore an Alexander McQueen dress and cape in ivory silk crepe with ivory stitch embroidery featuring rose, thistle, daffodil and shamrock motifs, to signify the four nations. She also wore a Jess Collett x Alexander McQueen Headpiece silver bullion, crystal and silver thread work, similar to the headpiece the Princess of Wales is wearing for the occasion. Meanwhile, her younger brother Louis - who turned five on St George's Day on April 23rd - looked regal in a bespoke outfit. ",
        "For the historic occasion, the young Prince was wearing an outfit made by Savile Row tailors Dege and Skinner which consists of a Hainsworth Garter Blue Doeskin Tunic with specially designed lace work embellishment to the collar, cuffs and fronts. The leg garment was black complete with Garter Blue stripe.Last year Louis was the standout star of his great-grandmother's Platinum Jubilee celebrations, entertaining the crowds with his antics on the Buckingham Palace balcony and in the audience at the Jubilee pageant. His parents aware of the responsibility on his young shoulders, Prince Louis won't attend tomorrow's concert in Windsor.The youngsters reunited for the grand carriage procession back to Buckingham Palace after witnessing King Charles being crowned at the Abbey.",
        "The King and Queen travelled in the 261-year-old Gold State Coach, followed by three carriages carrying working members of the Royal Family.In the first carriage behind them was the Prince and Princess of Wales, along with George, Charlotte and Louis.It was the biggest public test for the three siblings, who are becoming increasingly confident under the eyes of the watching world.Thousands gathered on the Mall this morning, as Charles III's day of destiny got underway. The historic first coronation of a British monarch in 70 years at Westminster Abbey saw just over 2,000 people arriving into Westminster Abbey.",
        "Charles was crowned in a Christian ceremony that dates back for 1,000 years on a day dripping with glorious displays of pageantry. The momentous event shone a spotlight on Britain’s place on the world stage.His family, including Prince Andrew and Princess Anne, enjoyed a dinner at Mayfair club Oswald's last night. Mike and Zara Tindall were out until 2am. Prince Harry flew in from Los Angeles yesterday for his 24-hour trip. It emerged last night he has been relegated to the third row in the Abbey with other non-working royals.Around 100million watched on TV around the globe, with around two million people - from all corners of the UK, Commonwealth and the world - in London for the historic event. ",
        "Guests of the King started arriving at the Abbey from 7am - four hours before the ceremony. Some 100 heads of state are in London, with representatives from 203 countries are attending."
    ]
}