{
    "articleURL": "/news/article-12061613/Duke-Sussex-spent-30-minutes-Royal-residence-fathers-coronation.html",
    "content": [
        "Prince Harry 'spent less than half an hour at Buckingham Palace' before leavingSources said he didn't see family for 'practical' reasons as they were too busyThe Duke of Sussex slipped in and out of Buckingham Palace after the Coronation without seeing senior members of the Royal Family during his visit to Britain, it was claimed last night.",
        "The report claimed Prince Harry spent less than half an hour at the Palace after the Westminster Abbey service, before travelling to Heathrow Airport to return to the United States on Saturday.Photos show how the Prince left Westminster Abbey at 1.15pm and entered a black BMW.He was then spotted exiting the A4 at 1.50pm and at the entrance to Heathrow at 2pm.The Prince's dash to the airport makes timings tight for any pit-stop at Buckingham Palace, which the report in the Telegraph said was for 'logistical reasons', to take a moment out of the public eye after the two-hour ceremony.",
        "Former Royal Protection Officer Ken Wharfe told MailOnline today that there was 'logistically, just no way' the Duke could have stopped off at the Palace.'From the West End to Heathrow, you're looking at about 35 minutes under police escort, that's the quickest you're ever going to do it,' he said.'My own view is I can't see any point in him going to the Palace, there'd be nobody there to receive him anyway and all his family were there at the Abbey for the Coronation.'I think it's highly unlikely he stopped off. I can't see any reason for it. 'It sounds ridiculous but the only possible reason would be to stop off if he needed the toilet or felt unwell.'",
        "Mr Wharf also added that it would be 'impossible' for Harry to have entered and left the Palace without being seen, particularly with so many people in central London on the day. It comes after the King expressed 'regret' over Harry's absence and toasted 'those that weren't there' during the Royal Family's celebratory lunch.The Duke was back in California on Sunday morning and therefore did not join the Royal Family for official Coronation portraits and was not at the Coronation Concert.",
        "Sources told the Telegraph, Prince Harry's lack of contact was 'practical' and he was eager to return to his wife and children in the United States while the rest of the family were busy with the Coronation procession.It is the first time Prince Harry is thought to have been at the Palace since the Queen's funeral last September.He was in Britain earlier this year to attend court cases but is not known to have seen King Charles III or Prince William. He was seated in the third row for his father and stepmother's crowning in Westminster Abbey - two rows behind his brother Prince William.It is understood Prince Harry stuck to the dress code instructed for the ceremony, wearing a dark morning suit and tie, his Afghanistan and Jubilee medals pinned to his suit jacket, and a Royal Victorian Order star and neck decoration.",
        "During the Royal Family's lunch, King Charles III raised a glass to his three grandchildren Prince George – who also served as a Page of Honour – Princess Charlotte and Prince Louis, who were among the stars of the show and carried out their public appearances with aplomb.But he made a point of also toasting 'those that weren't there' and wished his other grandson a very happy birthday 'wherever he was'.'It was apparently a very sweet moment,' a source told MailOnline.Meanwhile, a royal expert said last night that King Charles III's first official portrait following the Coronation shows him as a 'monarch who knows his own mind', surrounded by 'the people he can depend on'.Monday saw the sovereign's opening set of Royal photos unveiling the King's new 'slimmed down' monarchy, with his 'hard-working and respected' sister, Princess Anne and loving wife Queen Camilla firmly by his side.",
        "And to mark his reign as head of state, the 74-year-old sovereign was unveiled in a striking new solo portrait to commemorate his historic crowning.'This one is a strong forceful portrait of a monarch who knows his own mind and is very experienced,' royal expert Richard Fitzwilliams told MailOnline last night.It comes as Harry's wife Meghan was spotted hiking near their £11mmillion Montecito mansion just hours after the Coronation service.",
        "The Duchess of Sussex was joined on the fresh-air outing by her friends, Markus Anderson and Heather Dorak, in California on Sunday after celebrating her son Archie's birthday on Saturday.It was the first time she had been seen in public since her father-in-law's coronation on Saturday.Meghan was noticeably absent from the regal festivities in the UK this weekend, as she remained in the U.S. to celebrate her son Archie's 'lowkey' birthday at their Montecito home.Sources claim Meghan decided to have the celebrations at the couple's home, because 'she felt it would be inauthentic to do anything else'.Archie had a 'private celebration' with a lemon cake which was baked by the Duchess of Sussex using fruit from their garden, a source close to the couple said.Archie's grandmother Doria Ragland is thought to have attended the youngster's birthday party, as well as Meghan's close friend, make-up mogul Victoria Jackson, 65.When asked if any of the party guests included celebrity neighbours such as Oprah Winfrey, a source said: 'Some of their friends are celebrities, so yes, that's likely. It will be a small, intimate gathering.'Her estranged father Thomas Markle, 78, told the MoS he believed 'it was for the best' that the Duchess stayed at home. 'There are too many disagreements between Meghan, Harry and the Royals,' he added.",
        "Meanwhile, the King was back to work today as he broke ground on a £58million research facility that will aim to develop net-zero flight technology.The monarch's first engagement following his coronation at the weekend saw him pay an hour-long visit to the Whittle Laboratory at Cambridge University.The research centre, founded 50 years ago, is developing a brand new lab that will bring together the world's top aviation and energy experts to achieve emissions-free flights as soon as possible.It is a fitting first engagement for the King, who is a fervent environmentalist but can no longer speak out on such issues following his ascension to the throne.As the coronation festivities came to a close last night, the King and Queen pledged to rededicate their lives to service as Charles called the nation's support throughout the historic celebrations 'the greatest possible coronation gift'. Elsewhere, the Duchess of Edinburgh will visit Morden College in Blackheath, London, of which she is a patron, while the duke will attend a dinner at Stonehage Fleming at St James's Square for his patron charity, the Duke of Edinburgh's International Award Foundation. Buckingham Palace declined to comment on reports of the Duke's visit."
    ]
}