{
    "articleURL": "/wires/reuters/article-12040311/Anthony-DeSclafani-shines-Giants-blank-Astros.html",
    "content": [
        "Anthony DeSclafani logged eight shutout innings as the San Francisco Giants snapped a four-game skid with a 2-0 victory over the host Houston Astros on Tuesday.",
        "In his longest outing of the year, DeSclafani (3-1) tossed a season-high 109 pitches. He tallied only three strikeouts but kept the Astros off-balance with an effective three-pitch mix to generate weak contact.DeSclafani was sharp from the start, retiring the first seven batters he faced before Astros catcher Yainer Diaz lined a one-out double to the wall in right-center field in the third inning. DeSclafani stranded Diaz at third base by getting Jake Meyers to fly out to left and Mauricio Dubon to ground out to third, initiating a stretch where he retired 12 consecutive batters.It wasn't until there was one out in the seventh that the Astros mustered a second baserunner, this time via a Yordan Alvarez double to right.But DeSclafani recorded two more flyouts to snuff that threat and worked around his two-out throwing error in the eighth that enabled Diaz to take second following an infield hit. DeSclafani got Meyers to ground out to second to cap his outing, one in which he did not issue a walk.The Giants didn't provide much run support, but it proved sufficient. Joc Pederson flipped an opposite-field single to left with one out in the top of the first that drove home Thairo Estrada, who singled and stole second base off Astros rookie right-hander Hunter Brown (3-1).",
        "Pederson walked and scored in the fourth when Blake Sabol delivered a run-scoring double off the scoreboard in left.Brown labored throughout his 96-pitch outing, walking a career-high five batters while allowing four hits and recording four strikeouts before departing with one out in the fifth. It marked the first career loss for Brown in six decisions dating back to late last season.Giants closer Camilo Doval notched his fourth save with a perfect ninth.--Field Level Media"
    ]
}