{
    "articleURL": "/tvshowbiz/article-12038803/Coronation-Streets-Rebecca-Ryan-gives-birth-Actress-welcomes-child.html",
    "content": [
        "Rebecca Ryan has given birth to her first child with her husband Dan Acraman and revealed her daughter's adorable name. ",
        "The Shameless and Coronation Street actress, 32, took to Instagram on Tuesday to share her jovial baby news with her 73,000 followers.She shared an adorable snap of her daughter cuddled up in a white blanket and sleeping in a striped onesie as she announced her baby's arrival.In an accompanying caption, Rebecca revealed that she and her husband Dan had named her baby daughter Aurora.She sweetly penned: 'Welcome to the world my beautiful baby girl Aurora.' ",
        "She was quickly flooded with congratulatory messages from her co-stars and other famous pals as they took to the comments section.Elle Mulvaney, who plays Amy Barlow on the ITV soap opera, said: 'Omg. the cutest. so so happy for you.'Jack James Ryan penned: 'My new best mate,' while Mollie Gallagher added: 'Massive congratulations.'And Julia Goulding, who portrays Shona Platt on the show, commented: 'Huge Congratulations, she's beautiful.'Rebecca rose to fame on Channel 4 comedy series Shameless, and is now known for playing Lydia Chambers in the ITV programme. Her jovial baby news comes after Rebecca announced her pregnancy just days before Christmas in a sweet post. Posing in front of a Christmas tree, she wore a sparkly silver sequinned dress and cradled her blossoming baby bump as she confirmed she was expecting.",
        "She captioned the snap: 'I thought this year couldn't get any better after marrying the man of my dreams, but it turns out it can… Can't wait to become a mummy in 2023 x'Just months earlier in September, Rebecca revealed she tied the knot with her fiancé Dan declaring it 'the best day of our lives'.",
        "She looked ravishing in a white strapless gown as she and her new husband made their way hand-in-hand down a long drive way.The dress boasted a large princess skirt as well as a satin bustier while she completed the gorgeous look with a pearl tiara.Meanwhile, groom Dan looked dapper in a stylish black tuxedo as they beamed in the stunning black and white photo. Rebecca captioned the lone snap: 'Husband and Wife 24.09.22 - The best day of our lives!'"
    ]
}