{
    "articleURL": "/sport/mlb/article-12055997/MLB-ROUNDUP-Boston-Red-Sox-make-EIGHT-straight-wins.html",
    "content": [
        "Boston Red Sox continued their impressive form against Philadelphia PhilliesThere were wins for the Diamondbacks, Yankees, Rangers and Guardians  DailyMail.com provides all the latest international sports newsRafael Devers highlighted his three-hit performance with a two-run double to ignite a five-run fourth inning, lifting the surging Boston Red Sox to a 7-4 victory over the host Philadelphia Phillies on Saturday.",
        "Boston's Rob Refsnyder ripped a two-run double, Christian Arroyo had a two-run single and Reese McGuire added an RBI single for the Red Sox, who have scored 59 runs during their eight-game winning streak.Philadelphia's Bryce Harper and Trea Turner each belted a solo homer to highlight their respective two-hit performances. Alec Bohm and Edmundo Sosa each added an RBI single among their two hits for the reeling Phillies, who have lost six in a row.Bailey Falter (0-6) retired the first nine batters he faced before the bottom fell out in the fourth inning. He yielded five runs on six hits in 3 2/3 innings. Winning pitcher Corey Kluber (2-4) allowed three runs on seven hits in five innings, and Kenley Jansen secured his eighth save of the season.",
        "Diamondbacks 8, Nationals 7Lourdes Gurriel Jr. went 4-for-5, including a game-tying home run in the ninth inning, as Arizona rallied from coughing up a four-run lead to beat Washington in Phoenix.Pinch hitter Pavin Smith drew a bases-loaded walk from Kyle Finnegan (1-2) later in the inning for the winning run. Christian Walker added three hits, including a single in the ninth, and he and Gurriel each scored twice.Miguel Castro (1-0) picked up the win after coming on to record the final out in the top of the ninth. It came after Keibert Ruiz and Lane Thomas homered in the five-run uprising to give the Nationals a 7-6 lead.",
        "Mariners 7, Astros 5J.P. Crawford's three-run double sparked a seven-run eighth inning as host Seattle rallied to defeat Houston for its fifth win in its past six games.Jose Caballero added a two-run double in the ninth for Seattle, and reliever Tayler Saucedo (1-0) earned his first major league victory. Ty France had three hits for the Mariners.With the Astros leading 3-0, losing pitcher Rafael Montero (0-1) retired the first two batters he faced in the eighth before nine consecutive Mariners reached base. Seattle's rally spoiled the major league debut of Astros right-hander J.P. France, who pitched five scoreless innings. Jeremy Pena had three hits for the Astros.Rangers 10, Angels 1Nathan Eovaldi threw eight shutout innings to lead Texas' romp of Los Angeles in the second game of their three-game series in Anaheim, Calif.Eovaldi (4-2) allowed five hits, struck out five and walked two to stretch his shutout streak to 20 innings. Eovaldi was coming off his first MLB nine-inning shutout in a 2-0 win against the New York Yankees. Jonah Heim had two hits and three RBIs and Travis Jankowski had three hits and two RBIs for the Rangers, who have won five of seven.Brandon Drury had two hits, including a solo homer in the ninth inning for the Angels, who were riding a season-high five-game winning streak. Angels starter Reid Detmers (0-3) allowed three runs and seven hits in four-plus innings. He struck out seven and walked two.",
        "Rockies 5, Mets 2Rookie shortstop Ezequiel Tovar homered and finished with a career-high three hits in Colorado's win over host New York.Tovar singled and scored the Rockies' second run in the second before he hit a two-run homer in the sixth and doubled in the eighth. The 21-year-old entered Saturday with four multi-hit games in his first 39 big league appearances.Austin Gomber (3-4) earned the win after allowing two runs on five hits and two walks while striking out three in six innings. The left-hander has given up three runs over 17 innings in his last three starts while lowering his ERA from 12.12 to 6.75.Tigers 6, Cardinals 5 (10 innings)Akil Baddoo hit a game-winning RBI double in the 10th inning to lift visiting Detroit over St. Louis.Spencer Torkelson had two RBI singles for the Tigers, who won their fifth straight game. Reliever Jose Cisnero (2-0), the fifth Tigers pitcher, worked the final 1 2/3 innings to earn the victory.Dylan Carlson hit a three-run homer and Nolan Arenado hit a two-run blast for the Cardinals, who lost their eighth straight game. Adam Wainwright made his first start of the season after missing five weeks with a groin muscle strain. He allowed four runs on eight hits in five innings. Reliever Giovanny Gallegos (1-2) took the loss.",
        "Yankees 3, Rays 2Harrison Bader delivered a go-ahead, two-run single in the eighth inning as New York rallied to hand Tampa Bay a rare home loss in St. Petersburg, Fla.New York's three-run rally in the eighth inning started with DJ LeMahieu's one-out RBI double against Kevin Kelly (3-1). After Willie Calhoun popped out with two runners on, Bader put the Yankees ahead with a two-run single to right field.Ron Marinaccio (1-1) pitched 1 1/3 scoreless innings for the win, and Ian Hamilton worked the ninth for his first career save.",
        "Braves 5, Orioles 4Kevin Pillar smacked his 100th career home run, delivering a two-run, pinch-hit blast in the eighth inning to lift Atlanta over visiting Baltimore to square the three-game series.Marcell Ozuna also went deep for Atlanta, hitting his fourth homer in a 13 at-bat span. Raisel Iglesias made his first appearance after missing 33 games with a sore right shoulder. He worked a perfect ninth inning, striking out two, to earn his first save. Spencer Strider pitched five innings and allowed two runs on four hits and 10 strikeouts.Baltimore's Kyle Bradish gave up three runs on five hits, two walks and four strikeouts in five innings.Blue Jays 8, Pirates 2Brandon Belt and Kevin Kiermaier each drove in two runs to help visiting Toronto win its second straight over reeling Pittsburgh.",
        "Alejandro Kirk added an RBI double and Daulton Varsho an RBI single for the Blue Jays, who entered the series with a five-game losing streak. Toronto starter Jose Berrios (3-3) was perfect into the fifth. He gave up two runs and five hits in 6 1/3 innings, with seven strikeouts and one walk.Jack Suwinski homered and Connor Joe had an RBI single for the Pirates, who lost their sixth in a row.Cubs 4, Marlins 2Nick Madrigal delivered a go-ahead, two-run single during a three-run eighth inning as Chicago handed visiting Miami its fifth straight loss.Cubs starter Drew Smyly lasted just 3 1/3 innings while yielding two runs, three hits, three walks and striking out five on 83 pitches. But three Chicago relievers, headed by Keegan Thompson (2-2) and his three scoreless innings, combined for 5 2/3 innings of shutout ball.Chicago has won the first two games of this set following a 1-6 road trip which began by being swept in three games at Miami. Jorge Soler clubbed a solo homer for one of his two hits and Bryan De La Cruz went 2-for-4 with an RBI for the Marlins, who have been outscored 34-12 in the last five games.Guardians 4, Twins 3Steven Kwan broke a tie with his first home run of the season as Cleveland leveled up its three-game series with a victory against visiting Minnesota.",
        "The 5-foot-9 Kwan ripped an off-speed pitch from Twins reliever Jorge Alcala, just recalled from Triple-A earlier in the day, 402 feet to right center. Kwan's solo shot was enough to overcome the Twins, who scored all of their runs on home runs from Max Kepler and Carlos Correa.Correa tied things at 3-3 in the top of the seventh, when he drove a fastball from Trevor Stephan 407 feet into the seats beyond the left field wall. Stephan (2-1) earned the victory in relief, while Alcala (0-1) took the loss. Emmanuel Clase pitched a 1-2-3 ninth for his American League-leading 11th save of the season for Cleveland.",
        "Reds 5, White Sox 3TJ Friedl homered, tripled and drove in four runs to lead Cincinnati to a victory over visiting Chicago.Jonathan India reached base four times on three hits and a walk and had three runs for the Reds. The bullpen gave up just two hits in 5 1/3 scoreless innings as Cincinnati won for just the second time in the last six games. Derek Law (2-4) entered in the fourth inning and pitched 2 1/3 innings of hitless relief for the Reds. Alexis Diaz worked the ninth for his sixth save.Hanser Alberto and Seby Zavala hit solo homers for Chicago, which lost for the second time in its past six games. Mike Clevinger (2-3) gave up four runs and six hits over six innings. He struck out seven and walked one while falling to 0-3 over his last five starts.Giants 4, Brewers 1Alex Cobb pitched shutout ball for the second time in three starts, Thairo Estrada and Brett Wisely homered, and San Francisco beat visiting Milwaukee.Joey Bart also doubled in a run for the Giants, who won their fourth straight, including both games to start the three-game series. Cobb, who threw a complete-game shutout two starts ago against the St. Louis Cardinals, went the first seven innings this time, allowing five hits, all singles. He walked two and struck out five, leaving with a 4-0 lead.The Brewers avoided a shutout by scoring in the ninth off the Giants' third pitcher, John Brebbia, on a pair of walks and Owen Miller's one-out RBI single.Athletics 5, Royals 4JJ Bleday homered and doubled, leading Oakland past host Kansas City to win consecutive games for the first time this season as well as clinch its first series win.Bleday doubled and scored in the second, then lifted a one-out solo shot to right in the third for a 3-1 Oakland advantage. The A's padded their lead to 5-1 in the fourth on Ryan Noda's RBI triple followed by Brent Rooker's double. Despite walking six, Ken Waldichuk (1-2) earned the win, allowing four runs on six hits and fanning six.Losing pitcher Brady Singer (2-4) went four innings, surrendering five runs on six hits and three walks. Bobby Witt Jr. and Freddy Fermin hit home runs for the Royals.Dodgers 2, Padres 1Chris Taylor broke up a scoreless pitching duel between Blake Snell and Dustin May with a two-out, two-run homer in the top of the fourth to lead visiting Los Angeles to a victory over San Diego to even the three-games series.Taylor's sixth homer of the season was the only hit allowed by Snell over six innings. May held the Padres scoreless on three hits and a walk with six strikeouts over six innings to earn the win and improve to 4-1 on the season. No Padres reached second against May. Snell (1-5) took the loss despite allowing the one hit and three walks with six strikeouts in six innings.Right-hander Evan Phillips picked up his fourth save, striking out Trent Grisham to end the game. Phillips struck out three in the inning around a walk to Jake Cronenworth."
    ]
}