{
    "articleURL": "/wires/reuters/article-12039271/Reuters-Entertainment-News-Summary.html",
    "content": [
        "Following is a summary of current entertainment news briefs.",
        "Griner embraces growing platform at Met Gala months after return from RussiaAmerican basketball star Brittney Griner stepped onto the red carpet at the star-studded Met Gala on Monday, embracing a larger spotlight months after returning home from detention in a Russian penal colony. The twice Olympic champion has pledged to advocate for the release of other Americans detained abroad after she was freed from Russia in a high-profile prisoner exchange after nearly 10 months of detention.'Some Like It Hot' leads 2023 Tony nominationsFilm-turned-musical \"Some Like It Hot,\" led the nominations announced Tuesday for the 2023 Tony awards, the highest honors in American theater, followed by \"&amp;amp; Juliet,\" \"New York, New York,\" and \"Shucked.\" \"Kimberly Akimbo,\" and a revival of \"Sweeney Todd: The Demon Barber of Fleet Street,\" also topped the list of nominations by production for the 76th annual awards, according to a statement from the Tony Awards committee.Canadian singer-songwriter Gordon Lightfoot dies at 84Canadian musician Gordon Lightfoot, the prolific singer-songwriter known for such folk-pop hits as \"If You Could Read My Mind\" and \"The Wreck of the Edmund Fitzgerald,\" died on Monday in a Toronto hospital. He was 84. He died of natural causes, his family said in a statement released by publicist Victoria Lord.",
        "Factbox-How will TV shows be affected by the Hollywood writers strike?Thousands of Hollywood film and television writers will go on strike starting Tuesday, an action that will disrupt TV production. How will the walkout by the Writers Guild of America's affect viewers' favorite TV shows and movies? Which shows will feel the first impact of the strike?Soviet and Russian fashion icon Slava Zaitsev dead at 85Vyacheslav \"Slava\" Zaitsev, the couturier behind world-famous Soviet fashion that was often adorned with colorful Russian folkloric motifs, died on Sunday at age 85. Born into a working-class family in 1938, Zaitsev's first international recognition came in 1963 when the French Paris Match magazine wrote about his collection of overalls for female workers, according to a note posted on the website of his fashion house.Hollywood writers strike over pay in streaming TV 'gig economy'Thousands of film and television writers headed to picket lines on Tuesday for their first work stoppage in 15 years, sending Hollywood into turmoil and disrupting TV production as the industry wrestles with the shift to streaming.The Writers Guild of America (WGA) said its leadership unanimously supported a strike after failing to reach an agreement for higher pay from studios such as Walt Disney Co and Netflix Inc.",
        "Jared Leto wears giant 'Choupette' costume to Met GalaAn enormous fluffy, white, blue-eyed Burmese cat mascot ascended the Metropolitan Museum of Art steps on Monday in homage to Karl Lagerfeld´s beloved pet \"Choupette,\" who later revealed himself as actor Jared Leto, bringing a whole new meaning to this year´s Met Gala dress code \"in honor of Karl.\" In another homage to the famous feline, American rapper and singer Doja Cat wore a prosthetic cat nose and a hooded Oscar de la Renta gown fitted with cat ears.Ed Sheeran calls copycat claims 'insulting' in 'Thinking Out Loud' trialA sometimes-riled Ed Sheeran on Monday denied copying Marvin Gaye's classic \"Let's Get it On\" in his second day of testifying to jurors in a copyright trial in Manhattan federal court, calling the claim \"insulting.\" As he had last week, the British singer-songwriter played guitar and sang from the witness stand to underscore his testimony, telling jurors his song \"Thinking Out Loud\" had actually been inspired by Irish musician Van Morrison.Ethiopians savor first night of annual 'Addis Jazz Festival'Young Ethiopians packed into the compound of the Swedish embassy in Addis Ababa on Saturday night to savor an \"Ethio Jazz\" performance, an annual festival that celebrates Ethiopia's love for the musical genre. On a neon-lit stage in the country's capital, artists played various Ethiopian jazz music pieces as hundreds of revelers danced, mimed and quaffed beer to celebrate the second edition of the so-called Addis Jazz Festival (AJF)."
    ]
}