{
    "articleURL": "/news/article-12038035/Rising-Florida-equestrian-star-15-killed-fell-horse-landed-head.html",
    "content": [
        "Hannah Serfass, 15, died Sunday after being crushed by the horse she had been training on The teenager was considered a rising star in the equestrian field whose death has left the community shocked She was celebrated in the equestrian community for 'her passion for horses, her natural ability, and her worth ethic' A 15 year-old Florida equestrian hailed as a future star died on Sunday in a tragic accident after the horse she was riding knocked her off and fell on her head.",
        "Hannah Serfass was practicing while competing at Fox Lea Farm Spring Concours in Sarasota, Florida, when the accident occurred.The teenager was riding a 12-year-old horse names Quaxx, who tripped and suffered a rotational fall.Deputies said the horse, at one point, leaned forward after awkwardly planting its foot, propelling Serfass from her position.The horse then tumbled and fell on top of the young rider's head as horrified onlookers rush to her aid until emergency crews arrived.",
        "Serfass lived with her parents, David and Janine, in Tarpon Springs, Florida, where she was home schooled.The most recent address listed for the family is a stunning $2.5m waterside property with four beds and three-and-a-half bathrooms From a young age, she took to competitive sports. She was a gymnast until fourth grade, when her focused pivoted to horses. She also ran track for the Wildwood Middle High School Track Team. The United States Equestrian Federation said an onsite EMT responded immediately and Serfass was transported to Sarasota Memorial hospital, where she was pronounced dead.Quaxx was not injured in the incident.In a statement from the US Equestrian Federation, the organization called Serfass a 'very talented up-and-coming young rider who trained with Robin Swinderman.''She was known for her passion for horses, her natural ability, and her worth ethic.'",
        "Fox Lea Farms said the teenager's death is a tragedy for the entire equestrian community.'We send our sincere condolences to the family, trainer, friends, and whole equestrian community. We are all heartbroken.'Serfass was considered a rising star in the equestrian world who had a 'meteoric' rise in the sport, according to a profile published less than two months prior to her death.",
        "'Once Hannah Serfass discovered horses, the passionate young rider jumped in with both feet and never looked back,' read the World Equestrian Center profile of the junior rider.'I just got into it and never wanted to stop,' she said. 'And now, I just want to learn everything I can about it. I want to keep going with it.'Following her death, the equestrian federation said it 'takes every accident very seriously and will be reviewing the accident thoroughly to learn what we can do to minimize risk and increase safety in equestrian sport.'"
    ]
}