{
    "articleURL": "/tvshowbiz/article-12057901/Heartbreaking-Bindi-Irwins-outfit-Steve-Irwin-Gala-Dinner.html",
    "content": [
        "Bindi Irwin proudly recognised her late father Steve 'Crocodile Hunter' Irwin at a gala dinner in his honour at the SLS Hotel in Beverly Hills, Los Angeles on Saturday.",
        "The conservationist, 24, arrived to the gala event wearing a pendant necklace with a picture of her late father inside it.Bindi's necklace, which featured a photo of Steve smiling in Australia Zoo's signature khaki uniform, was prominently displayed around her neck. She also cut an elegant figure in a black top, which she teamed up with a blazer and long floral skirt.Bindi was joined by her husband Chandler who looked dapper in a tailored black suit and beige bow tie. ",
        "Her mother Terri, 58, opted for a black high-neck top, tucked into a coordinating floral skirt.She boosted her height with gold shoes and styled her hair out and straight.Bindi's brother Robert, 19, was also dressed to impress in a black tuxedo which he teamed up with a khaki button-up Australia Zoo shirt.The Irwins have kept Steve's memory alive through their conservation work at Australia Zoo.The family's most recent tribute to Steve is the Crocodile Hunter Lodge, which comprises of luxury cabins located inside the zoo premises.",
        "The chic rooms offer guests modern conveniences among the picturesque grounds, with the website listing cabins which sleep four at $949 per night. The site also houses a restaurant called 'Warrior' as a tribute to Bindi's father and Terri's late husband, Steve, and his grandchild, Grace Warrior.",
        "In a recent video posted to Instagram Stories, Robert revealed that part of the wood used in buildings was repurposed from the crocodile grandstands originally built by Steve.'So, a lot of the lodge is actually kind of in a way hand built by dad,' Robert said in the clip.",
        "He went on to say the three trees out front were also 'originally planted by dad' with the place being Steve's dream.Terri also appeared in the video, explaining that Steve always had a dream that visitors could have an immersive experience.'Steve always had a dream that someday not only could people visit Australia Zoo but to stay overnight. Have the immersive experience,' she said.'It was so important to us to make his dreams come true with beautiful luxury accommodation surrounded by our conservation work we are known for.'"
    ]
}