{
    "articleURL": "/wires/reuters/article-12037965/Ford-cuts-prices-Mustang-Mach-E-Tesla-moves.html",
    "content": [
        "By David Shepardson",
        "WASHINGTON, May 2 (Reuters) - Ford Motor Co is cutting prices on its Mustang Mach-E electric vehicle and reopening orders, the No. 2 U.S. automaker said on Tuesday, the second time has reduced prices this year after a series of price cuts by rival Tesla Inc.Ford said it is also increasing the range for standard-range battery models as it increases production of the electric crossover SUV in the second half of the year.Prices for most Mach-E models were cut by $3,000 or $4,000 depending on the version or by as much as 7.8%, Ford said. The price of the Mach-E Premium rear-wheel drive version is dropping from $50,995 to $46,995.Ford CEO Jim Farley told analysts Ford does not intend to pursue EV sales volume \"at any cost.... \"We are not going to price just to gain market share.\"Farley's stance contrasts with Tesla CEO Elon Musk's statement last month that Tesla could cut profit margins on vehicle sales to zero and make up the difference through sales of software-enabled services.Ford shares closed down 2.2% at $11.80 Tuesday and fell 1.5% in after-hours trading after it reported first quarter earnings.Last month, the federal EV tax credit for the Mach-E fell by half to $3,750 from $7,500 after new battery sourcing requirements took effect.",
        "Mustang Mach-E U.S. sales fell 20% in the first three months of the year. Ford said Tuesday shipments of the Mustang Mach-E were limited in the first three months of the year to make industrial changes that will nearly double manufacturing capacity.In January, Ford cut prices of the Mustang Mach-E by as much as $5,900 per vehicle after hiking prices in August by $3,000 to around $8,000, citing supply-chain issues and higher material costs.Ford said all standard-range models will now be powered by lithium iron phosphate (LFP) batteries, which allows vehicles to gain an additional 45 units of horsepower and improves the targeted EPA range estimates.On Monday, Tesla raised prices in a range of up to $290 in Canada, China, Japan and the United States after the company had slashed prices on its top-selling vehicles since the start of the year.The hike was Tesla's first on its two top-selling models at the same time in multiple markets, although prices across its lineup are much lower than in January, after a round of discounts. (Reporting by David Shepardson in Washington; additional reporting by Joseph White in Detroit Editing by Jonathan Oatis, Matthew Lewis and Lincoln Feast)"
    ]
}