{
    "articleURL": "/wires/ap/article-12053031/Spectator-tumbles-railing-bullpen-Philly.html",
    "content": [
        "PHILADELPHIA (AP) - A spectator fell over a protective railing and into the Red Sox bullpen while reaching for a baseball in the first inning of Boston's game against Philadelphia at Citizens Bank Park on Friday night.",
        "The fan was taken to the trauma center at Thomas Jefferson University Hospital, according to medical personnel on the scene, after he tumbled one level from an open concourse into the Boston bullpen in right-center field.The injury occurred when the fan reached over a railing in an attempt to retrieve a ball thrown his way, the Phillies said in a statement. The Phillies said the fan was conscious and responsive upon leaving the ballpark. His injuries were not disclosed.Later in the game, a Phillies employee was cleaning blood off the concrete in the area where the fan fell.Masataka Yoshida, Boston's second batter, was facing Philadelphia's Zack Wheeler when Phillies reliever José Alvarado ran from the bullpen into the outfield to call attention to the incident. Medical workers quickly ran out to the second level of the bullpen as Red Sox relievers looked on nearby.Security personnel immediately cleared fans from the railing in Ashburn Alley, which sits close to the visiting bullpen, as medical responders attended to the fan, who was wearing a Phillies jersey. Red Sox relievers looked on with concern as a hush went over the nearly sold-out ballpark that was hyped for the game and Bryce Harper's first action in Philadelphia since offseason elbow surgery.",
        "The spectator was strapped to a backboard and taken from the bullpen and field on a stretcher and a cart.The game resumed after about a 10-minute delay.Fans remained on the railing later in the game in Ashburn Alley, named after Hall of Famer and former Phillies outfielder Richie Ashburn, which has been a popular hangout spot since the ballpark opened in 2004. In addition to the railing over the bullpen, which includes a ledge to accommodate food and beverages, fans also can watch relievers closely from a seated area that also has a ledge.Some fans wondered on Friday night if they would be prohibited from watching the game from that area going forward after the fan's fall.In the initial plan for the ballpark, Phillies relievers were seated on the top part of the bullpen closest to the fans. But the visiting bullpen was switched to the top level and the home bullpen was moved below.___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}