{
    "articleURL": "/news/royals/article-12041501/UK-prepares-Coronation-Shard-raises-flag-children-party-Charles-head-appears-beach.html",
    "content": [
        "The Shard flies highest Union Flag in UK ahead King's Coronation on SaturdayChildren in Dorset held what could be the county's smallest Coronation party How are you preparing for the Coronation? Send us your pictures at oliver.price@mailonline.co.ukBritain is preparing for the Coronation of King Charles III on Saturday as people and businesses across the nation show their patriotism.",
        "The Union Flag is being raised around the UK, including on the Shard, nursery children are holding the country's smallest Coronation party in a model village, and sand art of Charles has appeared at Britain's beaches.The highest flag on a building in the UK has been hoisted to celebrate the Coronation - on top of The Shard in London.The Union Flag is now flying at 929ft on level 87, the highest standing floor of the building in London.It was raised in a special ceremony by former Royal Navy Chief Petty Officer Mike Parsonage who now works at The Shard.",
        "Mr Parsonage, technical manager within the Shard Quarter team, said: 'It was a great honour to raise this Coronation celebration flag.",
        "Send us your pictures at oliver.price@mailonline.co.uk",
        "'As a former member of the armed forces, I know how special it is for us all to be experiencing a new monarch coming to the throne.'There will be some fantastic sights in London and across the UK as service personnel play their part in formally recognising the occasion.'The nation is set to turn red, white and blue, so all of us at The Shard thought it was only fitting that the tallest building in the UK did too.'A special Coronation light display will also be switched on at 8.30pm on May 6, comprising 552 LED lights and fixtures beaming from the top 20 storeys of The Shard.",
        "And in the south west, a model village has staged what could be Britain's smallest Coronation street party.Wimborne Model Town in Dorset decked their miniature street with Union Jack bunting and laid out a table of food for children from Judy's House nursery.The 12 boys and girls enjoyed sandwiches and crisps followed by Union Jack cakes as they celebrated the forthcoming coronation of King Charles - with Molly Linley-Adams, 3, sitting at the head of the table in her crown.The street party was set up in 1/10th scale model of Wimborne as it was in the 1950s, the last time the UK had a royal coronation.",
        "Nick Clark, manager of the model town, said: 'One of my first memories was the Silver Jubilee street party and I thought it would be great if we can try and recreate it. It just grew from there.",
        "'The children were fantastic, they absolutely loved it and it went better than I expected.'It was a really nice way to mark the King's Coronation.'And incredible art made entirely of sand depicting King Charles ahead of this weekend's Coronation has cropped up at several of Britain's beaches.Sand sculptors from Weymouth, Dorset have today unveiled a stunning model of the King sitting on the throne during the Coronation - but 135 miles away from the real ceremony at Weymouth Beach.",
        "In the detailed likeness the King is wearing the St Edward's Crown and holding the Sovereign's Orb and Sovereign's sceptre, as he will do on Saturday in Westminster Abbey.The remarkable sculpture, created by Mark Anderson and Annette Rydin from SandWorld Sculpture Park, is flanked by the lion of England and the unicorn of Scotland. And another sand artist, Claire Eason, has created a 90ft by 65ft work of sand art, depicting the King's head wearing the crown, to mark the Coronation.The expansive artwork, which can be seen from the sky, was unveiled yesterday on Bamburgh beach in Northumberland.",
        "On the England-Wales border, young artists had an 'Arty Party' ahead of the Coronation.Young artists, who are members of Welsh artist Mari Hutchings' The Painty Place Art School worked to create piece called Bridging the Gap.They built a replica of the Severn Bridge over a stream in Ms Hutchings' garden, which is half in England and half in Wales, in Upper Redbrook.They posed sitting on the bridge over the stream wearing handmade royal crowns, with students Amelia Bartlett Smith holding a Welsh flag and and Charlie Lewis a Union Flag.",
        "In Hertford, Hertfordshire, crocheters have made postbox toppers to mark the Coronation.Crocheters have been stocking up on wool and letting their imaginations 'go wild' to celebrate the coronation, creating royal-inspired postbox toppers including portrayals of the King, Queen Consort and crown jewels.",
        "Acclaimed artists Jignesh and Yash Patel are also working on a huge mural of King Charles ahead of the Coronation.Five-time Guinness world record holders Jignesh, 50, and Yash Patel, 20, previously attracted national attention for their mural to mark the late Queen Elizabeth II's death in September last year.The huge mural of the Queen covered an entire wall of the Hounslow East Metro Tube Station but has earned little praise. In fact the artwork, which many describe as being 'more than a little off', has been mercilessly roasted since a picture was shared online.But this hasn't deterred the artists from honouring the King as they began work on a new 12m by 15m mural of the UK's new monarch yesterday.The likeness to His Majesty is painted on the wall of a car park on Kingsley Road in Hounslow, London and is intended to be completed in full by this evening.",
        "The artwork sits just a block away from the duo's previous mural of the Queen, meaning the late monarch and her son will both be visible when standing at the right position on Kingsley Road.The mural depicts 74-year-old Charles dressed in military uniform, standing in front of several blurred flags of the Commonwealth nations.The mural - which will cost the pair around £2,300 to produce - also features the royal cypher as well as 'King Charles III' written in large white paint.",
        "There is also a quote from King Charles himself that reads: 'As technology advances at an alarming pace, the place of drawing remains valid as ever in the creation of art and architecture - King Charles III.'Speaking today Jignesh Patel said: 'The whole idea of making this mural is to celebrate the King's coronation, we already created a mural of the Queen on the same road.'We hope by doing this we can bring the community together having invited artistic children, we hope it can be a community landmark for Hounslow.'The King is the head of the Commonwealth and as we are from India who are a part of this we wanted to involve all 56 countries in the occasion - it's a true celebration of the Commonwealth.'",
        "Jignesh and Yash have been working on art together for over 15 years.'It is a surreal story,' said Jignesh.'Yash is a very young man, when he was a 12-year-old I used to teach him art but now he's really teaching me.'Yash is so mature in art, he's so into hyperrealism and I'm into abstract so we make a good team and Rohit - Yash's father - is a well-known artist in India so he designed the composition for us to work off.",
        "'This is our fourth large-scale mural and now the local community knows us so when we plan something like this, the community automatically gets involved and helps us out.'For formalities we emailed local schools and businesses to help join in the effort.'Speaking on the public reaction to the pair's previous mural of the Queen, Jignesh said: 'I'm a very balanced person so it didn't affect me.'Most of the people who talked negatively about the mural only saw it when it was half way done and then posted negative comments without any art knowledge.'We can't do much, all we can do is keep doing good work. So far the local people who have walked past our work seem happy with it and appreciate what we are creating.'",
        "In London, royal fans celebrating the monarchy early sat down for Fleet Street Quarter's Big Picnic this afternoon.People sat down at a flower-patterned table for tea and sandwiches and were greeted by people dressed in colourful flower suits. The floral theme was inspired by the gardens of Highgrove and in honour of King Charles III's admiration of wildflowers. It highlighted the King's favourite blooms and gave a 'quintessentially British summertime atmosphere ahead of the big day', the organisers said.How are you preparing for the Coronation? Send us your pictures at oliver.price@mailonline.co.uk"
    ]
}