{
    "articleURL": "/news/article-12050441/Inside-underwater-ballroom-30M-country-estate-landowner-shot-teen-trespasser.html",
    "content": [
        "The teen was looking for a glass-domed room accessible by tunnel a under a lakeA bizarre underwater ballroom on a tech tycoon's £30million country estate is at the heart of a legal row which has seen the millionaire landowner being sued after he shot a teenage trespasser. ",
        "Gary Steele, 63, is being sued for nearly £3million after Tom Frearson, then 16, was blasted with a shotgun.The businessman has claimed that intruders had targeted his underwater ballroom, a glass-domed room accessible via a tunnel beneath one of the man-made lakes on the grounds and surmounted by a 'floating' statue of Neptune.Trespassers would also look for other unique buildings such as the 'Ice House', which was repeatedly targeted as a destination for parties and illegal raves, and the 'Boat House'.Mr Steele shot Mr Frearson in July 2018 a day after the teenager had trespassed on his estate. The tycoon was later arrested but cleared of attempted murder. He reportedly sold the Witley Estate a year later for £30million and now lives at £12million Roundhurst Farm in Lurgashall, Surrey.",
        "Witley Park, formerly known as Lea Park, is an estate dating from the 19th-century  which has three artificial lakes.In 1890, the Whitaker Wright purchased Lea Park, and the adjacent South Park Farm, from the Earl of Derby. Wright developed a pre-existing house into a 32-bedroom mansion adjacent to one of three artificial lakes - where he also built the underwater ballroom.Mr Frearson, of Hambledon, Surrey, is now suing the tycoon, claiming he was 'deliberate or reckless' in firing the gun and causing him injuries which he says have left him struggling to get work and needing lifelong care and assistance.",
        "But Mr Steele is defending the claim, insisting his actions were nether deliberate nor reckless. He says the youngster ran into the path of a 'warning shot' he had fired to scare him off while feeling 'vulnerable' after his property was targeted by explorers. Mr Steele was found guilty of possession of a shotgun without a licence, having been acquitted of attempted murder, wounding with intent and unlawful wounding by a jury at Guildford Crown Court in October 2019. He was sentenced to 15 months' prison, suspended for 12 months, and ordered to pay a total of £11,140 in fines and costs. He was also told to forfeit the shotgun and ammunition.The court heard In 2017 and 2018 they suffered extensive problems with criminal conduct from being a focus on social media whereby people encouraged each other to break into the estate.",
        "In papers submitted to the High Court, his barrister Laura Johnson KC says: 'Due to its follies, in particular the underground ballroom and the 'Ice House', the estate attracted trespassers looking to explore the grounds.",
        "'Although some of these individuals left when requested, the defendant and his partner also encountered incidents of criminal damage, antisocial behaviour and theft.'One of the follies, the Ice House, was repeatedly targeted as a destination for parties and illegal raves. The Boat House was also targeted by people breaking in, stealing - and eventually sinking - the defendant's boat and seeking to gain access to the Underwater Ballroom or the Ice House.",
        "'On occasion, intruders even brought their own watercraft to use on the lake to gain access to the follies.'In November 2014, there were two incidents on the estate. The first involved two follies being broken into. A few days later, on November 17 2014, the Underwater Ballroom was broken into.'During the course of the police investigation into these incidents, the defendant discovered that the Underwater Ballroom had become the subject of a challenge publicised on social media, which encouraged individuals to enter the estate, break into the Underwater Ballroom and take a photograph of themselves there.'This was very upsetting to the defendant. He invested significant time requesting internet sites to remove reference to or footage of this challenge. Notwithstanding these efforts, problems with trespassers and intruders continued.'On the night of the shooting, a group of youths - whom Mr Frearson knew but was not with - had been spotted within the grounds of the estate, with youths having also been in the grounds the previous night, the barrister claims.'The defendant and his partner were frightened by the arrival of the claimant's friends. It was a Monday evening. More youths attended than the night before, their behaviour was bolder and the defendant and his partner felt vulnerable because the police had not attended the previous evening when their assistance was sought.",
        "'They had no near neighbours and were isolated and afraid.'The defendant wanted to ask them to leave. He believed that their behaviour was bolder and escalating.'He took the gun with him for reassurance because of the previous incidents when he had been verbally assaulted, had stones thrown at him and been threatened.'His lawyer said: 'As a result of the defendant's fear, with the intention of frightening the intruder away with the sound of the shot, he decided to fire a warning shot.'It is now known that the intruder on the other side of the wall, below where the defendant was standing and out of sight, was the claimant.''As the defendant fired the warning shot, the claimant ran into the range of the shot and was hit. At the time the defendant fired the shot, he believed that it was safe to do.'In documents lodged with the court, Mr Frearson's barrister Colm Nugent says he was 'walking outside the perimeter wall of the estate along or near a public footpath' when he was 'shot by the defendant without any forewarning from an elevated position within the grounds'.He added: 'It later transpired that the defendant wrongly believed or claimed to believe that the claimant had been trespassing on his land earlier that same day.",
        "'The defendant fired the shotgun at the claimant from a distance of approximately 12 meters.'After he had shot the claimant he said to him over the wall 'I told you not to come back'.'The submissions in the documents submitted to the court have yet to be tested in evidence before a judge."
    ]
}