{
    "articleURL": "/femail/article-12039225/By-embracing-inner-sloven-boost-happiness-change-life.html",
    "content": [
        "Kerri Sackville, author of  wants everyone to embrace a little bit of messREAD MORE: I'm in marriage counselling because of his disgusting car habitKerri Sackville thinks everyone has The Chair. You know the one. The seat in the corner of your bedroom. Maybe it’s wooden. Maybe it’s cushioned. Maybe it’s an office chair, wheeled away from its deskly destiny. ",
        "Either way, it doesn’t really matter: you’ve never sat in The Chair and you can’t see it because heaped on top of it are piles and piles of clothes.‘Even my very neat partner has a chair,’ says Sackville. ‘He claims that the clothes are there because they “need ironing”. Does he iron them? Not that I’ve seen. Could they be hung in the wardrobe while waiting for the mythical ironing? Yes. But they remain on The Chair.’ Maybe The Chair offers respite? ‘When you’re too houseproud to drop your clothes on the floor, but you’re too tired to put them back in the wardrobe, The Chair is there to save the day. After all, if it’s not on the floor, it’s not real mess – it’s a storage solution!’Sackville, 54, is something of an expert on matters such as The Chair. This week, the Australian author will publish her fifth book: The Life-Changing Magic of a Little Bit of Mess. The title is a play on Marie Kondo’s neat-girl Bible, The Life-Changing Magic of Tidying, and the message is about – no surprise – why the right amount of clutter is good for you. Life-changing, even.",
        "Sackville had the idea in 2020. She was at home in Sydney when a publisher sent her a book about cleaning. She won’t say which one, but it was all about keeping ‘a pristine’ home: how you should do ‘housework schedules’ and why you need ‘a turbo mop’. The book was also, clearly, aimed at women.",
        "Sackville snapped. ‘It was lockdown. Life was really hard. Everybody was suffering. And I was, like, seriously? It’s not enough that we survive motherhood, survive this very complex world, survive the pandemic.Oh, and we have to have, you know, perfect bodies, perfect children, perfect relationships and perfect lives. Now we also have to have a perfect home?’ she says. ‘I couldn’t see the point of it.’A line popped into her head: ‘Has anybody got to the end of their life and wished they’d spent more time with their steam mop?’ The answer, obviously, was no. So, Sackville started writing a manifesto for mess.When I speak to her over Zoom, her background is an innocuous white wall and a sofa with a few cushions on it. But is there some mess out of shot? ‘Yes!’ she replies, happily swivelling her laptop camera to show me her study in full. There’s tat everywhere: pens, loose change, drinking glasses, playing cards, a stuffed toy octopus, a plastic giraffe, her daughter’s Halloween costume (it’s April) that has never been worn and is still in the packet. ‘I live my truth!’This is Sackville’s version of mess. It’s not dirt – ‘there is nothing life-affirming about mould’ – it’s just stuff. ‘Mess is not going to hurt anyone,’ says Sackville. And, she adds, if you embrace not tidying stuff away it’s liberating; you accept ‘not needing to be perfect’ and ‘not needing to be pristine’. ",
        "Is there any science that suggests being messy is good for you? Not much – although a 2013 study from the University of Minnesota found that clutter was conducive to creativity. (If you google pictures of Albert Einstein’s office, Mark Twain’s writing room or Francis Bacon’s painting studio, it tracks.)",
        "But Sackville believes that mess is good for the soul. If you accept that your house will never be spotless ‒ unless you have unlimited time, professional help and no responsibilities ‒ you’ll be a lot less stressed about something as inconsequential as a stray unopened Halloween costume languishing in your study.A bit of disorder makes everyone around you less stressed, too. ‘I think people are more comfortable in a slightly messy home,’ says Sackville. ‘Obviously, you don’t want to walk into a hoarder’s room and be stepping over stuff to get to the couch. But I’ve been in homes that are pristine and I felt so anxious – am I going to spill a drop of my tea, get biscuit crumbs on the floor?’What about children? Sackville has three: a 23-year-old son (tidy, but has moved out), a 21-year-old daughter (messy, and lives at home) and a 15-year-old daughter (also messy, and also lives at home). But as long as their bedrooms are clean in the hygienic sense, Sackville doesn’t mind mountains of clothing on the floor. ‘When it’s time for vacuuming we’ll just put the clothes on the bed. ",
        "And if they want to put them back on the floor afterwards, they can.’ Arguing about messy bedrooms with her daughters ‘genuinely doesn’t seem worth it to me,’ she says. ‘Just shut the door.’Maybe she’s on to something. Last October, in an interview with this magazine, Marie Kondo admitted that, after she had her third child, even her home ‘isn’t completely tidy’. (I question the credibility of this statement, but Sackville agrees with Kondo: ‘In my experience, the third kid really does push you over the edge.’)Kondo isn’t the only one slacking. Last December, Oxford University Press announced its word of the year was ‘goblin mode’: ‘a type of behaviour that is unapologetically self-indulgent, lazy, slovenly or greedy, typically in a way that rejects social norms or expectations’.Meanwhile, TikTok’s ‘frazzled English woman’ videos – where users praise un-put-together characters such as Renée Zellweger in Bridget Jones’s Diary and Kate Winslet in The Holiday – have racked up around 32 million views. And, on the Miu Miu catwalk at Paris Fashion Week in March, models wore half-buttoned cardigans scrappily tucked into tights. Ultra-neat is out, slapdash is in.About time, too. For several years, social media has been filled with videos instructing people how to ‘organise’ and ‘declutter’ their homes. But a big part of the advice has seemed to be that, in order to be tidy, you need to buy new things into which you can decant your old things. ",
        "Pasta ought to be put into glass jars; pens ought to go into plastic pots; bras, knickers and socks ought to be separated with drawer dividers. It’s just shopping.And as for the cleaning influencers on Instagram who seem to have permanently pristine homes? We are only seeing one tidy photograph of one tidy corner. Who’s to say that, out of shot, there isn’t The Chair?That kind of lifestyle isn’t sustainable, says Sackville. For the viewers or, indeed, the Marie Kondos of the world. These cleaning influencers are like ‘ducks on the water,’ she says. ‘It all looks perfect but their little legs are going like mad.’It’s why she wants everyone to embrace a little bit of mess. After all, nobody has got to the end of their life and wished they’d spent more time with their steam mop.The Life-Changing Magic of a Little Bit of Mess by Kerri Sackville will be published on Thursday by HarperCollins, £12.99*"
    ]
}