{
    "articleURL": "/tvshowbiz/article-12057245/Olly-Murs-poses-vest-backstage-Coronation-Concert.html",
    "content": [
        "Olly Murs showed off his muscly arms as he prepared to perform at the Coronation Concert held in the grounds of Windsor Castle to celebrate the Coronation of King Charles III on Sunday.",
        "The singer, 38, was interviewed before taking to the stage in front of King Charles III and Queen Camilla, as well as a crowd of 20,000 people.However, while Olly was happy to display his toned physique backstage, he insisted earlier in the day that he would not be whipping off his top during his performance. On being invited to perform, he said on BBC Radio 2: 'It's a bit surreal but I am so honoured. I am on tour at the moment so only yesterday I saw the stage. It's the biggest thing of my career.'It has the eyes of the world on it. This is something people will remember. It is really special. It's crazy. We just got an email asking me to do it!'",
        "When host Dermot O'Leary joked he looked muscly, Olly replied: 'I won't be taking my top off I have to be professional.'Sunday's show in Windsor will be hosted by Downton Abbey and Paddington star Hugh Bonneville.Buckingham Palace has promised 'global music icons and contemporary stars' for the big concert.It is certainly set to be the highlight of the second day of coronation celebrations.Around 20,000 members of the public are expected to attend and there has been a great deal of speculation around who will be performing.",
        "Musicians including Lionel Richie, Paloma Faith, Olly Murs, rock guitarist Steve Winwood, and Nicole Scherzinger of The Pussycat Dolls will entertain the royal family and members of the public.Classical acts including Andrea Bocelli, Welsh bass-baritone Sir Bryn Terfel and Chinese pianist Lang Lang are also on the bill.Hollywood star Tom Cruise, Dynasty actress Dame Joan Collins, adventurer Bear Grylls, singer Sir Tom Jones and former Strictly Come Dancing professional Oti Mabuse will also make an appearance via video.",
        "The series of pre-recorded sketches will reveal little-known facts about the monarch and will also include moments from beloved literary character Winnie the Pooh - seemingly echoing the famous moment Paddington Bear drank tea with the Queen during her Platinum Jubilee celebrations.Nigerian singer Tiwa Savage, DJ Pete Tong with his Ibiza Classics project, and winner of The Piano TV talent show, 13-year-old Lucy, will also perform.Meanwhile, fashion designer Stella McCartney will deliver a spoken word performance with a conservation theme which will reflect her and the King's 'shared passion for environmental sustainability', the BBC has said.Her performance will be part of a broader nature-themed section of the concert which will also include a rendition of a 1980s hit by classical-soul composer Alexis French and London-based singer-songwriter Zak Abel alongside a house orchestra, band and choir."
    ]
}