{
    "articleURL": "/money/cars/article-12047677/Car-crime-rise-heres-stop-happening-you.html",
    "content": [
        "As criminals use ever-more sophisticated methods to steal modern cars packed with hi-tech digital security, an old-school piece of kit is making a remarkable comeback — the humble steering wheel lock.",
        "Thieves are using all manner of electronic scanners and relays to open car doors and fire up engines, yet a physical deterrent is proving to be one of the most effective deterrents.Why? Crooks don't like spending too long at the scene of their crimes. And the more time they spend trying to defeat a strong security device like a steering wheel lock, the more likely they are to be spotted and possibly apprehended.Prices range from under £20 for a basic Halford's own-brand single-bar steering lock (£14.99), to a mid-range Stoplock pro Elite Immobiliser (£59.99), up to £145 for a Thatcham-approved Disklok.",
        "Robert Forrester, chief executive of car dealer franchise Bristol Street Motors, part of the Vertu Motors group, said: 'Searches on Google for steering wheel locks are up a staggering 83 per cent compared to this time last year. While 50 per cent more users are searching for guidance on the 'best steering wheel lock'.He explains: 'A steering wheel lock is well worth the investment. These devices may remind drivers of decades gone by, but they are in fact one of the most effective deterrents to have in your car. Not only are they off-putting to thieves looking for an easy mark, but a good quality lock is pretty much impossible to forcibly remove.'",
        "Clive Wain, head of police liaison at car security firm Tracker, said: 'Criminals continue to find ways around new security technology, which is why we always encourage motorists to use traditional security deterrents such as crook locks and wheel clamps to deter the criminals and protect their vehicles.'Tracker says keyless car theft and 'relay attack' has increased significantly from 80 per cent of all its recovered stolen vehicles in 2017 to 93 per cent in 2022.It stresses: 'Always protect your key fob. Keyless car theft works through a relay-style electronic device tricking your key fob signal into thinking the key is near to the car and then the device can assume all key fob power.'To prevent this, keep the key — and the spare, too — away from where the vehicle is kept when not in use, and block the signal by keeping the key fob in a closed tin or Faraday bag.'Recent crime figures show that as the cost of living crisis bites, car thefts have risen by nearly a third, with the AA warning of worse to come as more people are tempted to turn to crime.Office for National Statistics figures show that the number of cars stolen soared by 29 per cent between September 2021 and the same month in 2022 when slightly more than 72,000 vehicles were reported stolen.",
        "The figures also highlighted a 14 per cent rise in vehicle crime to 391,613 cases — including theft of items from inside cars and vans.Official DVLA vehicle theft data analysed by car-leasing comparison site LeaseLoco revealed that last year's most stolen car was the popular Ford Fiesta family hatchback, with thieves taking some 5,979 (up 53 per cent on 2021).It was followed by the luxury Range Rover (5,533, up 47.4 per cent); Ford Focus (2,186, up 14.3 per cent), Volkswagen Golf (2,036, up 16 per cent) and Land Rover Discovery (1,920, up 52.4 per cent).The AA says older cars are targeted by thieves using 'smash and grab' techniques. But modern vehicles are often stolen by gangs using keyless technology.",
        "Patriotic motorists tempted to decorate their cars for King Charles III’s Coronation tomorrow take care — it could land you with fines of up to £2,500 and a possible driving ban.Motoring experts at Scrap Car Comparison warn that improperly mounted decorations could breach Rule 30 of the Road Vehicles (Construction and Use) regulations 1986 which state that a driver must ‘have a full view of the road and traffic ahead of the motor vehicle’.",
        "Those on the dashboard, or windscreen could result in a £100-on-the-spot fine, or up to £1,000 if taken to court. Motorists also risk three points on their licence.Exterior items falling into the path of other vehicles could lead to a £100 on-the-spot fine plus three penalty points, rising to a £2,500 fine and disqualification.More than six out of ten motorists have decided not to drive on Coronation day, says an AA poll. But the 12 million who will still take to the road are advised to anticipate street party road closures.",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}