{
    "articleURL": "/news/article-12042041/Lucy-Letbys-bed-father-arrested-baby-deaths-court-hears.html",
    "content": [
        "Lucy Letby's father John, 76, made his daughter's bed after she was arrested  Lucy Letby slept in a bed surrounded by cuddly toys that was made by her father after she was arrested on suspicion of murdering seven babies, a court has heard. ",
        "The 33-year-old nurse is accused of murdering five boys and two girls and trying to kill 10 others at the Countess of Chester Hospital from June 2015 to June 2016.Prosecutors say she injected the infants with air, poisoned them with insulin, overfed them with milk and physically assaulted them. She denies murder. Letby wept in the dock on Tuesday as she took to the stands for the first time in her trial, following seven months at Manchester Crown Court. Jurors were told she was arrested at her three bedroom Chester home two years after she was moved off the neo-natal unit, following suspicions she had harmed babies in her care. ",
        "The court was then shown a photograph of her untidy bedroom and bed, which was covered by a duvet bearing the motif: Sweet Dreams.  ",
        "Arranged at the pillow end of the bed are four cuddly toys - Winnie the Pooh, Eeyore, a rabbit and a light brown eddy bear.Her defence lawyer Ben Myers KC observed that someone must have straightened the bed following her arrest, and suggested it was probably her father, John Letby. 'Yes,' replied Letby.Letby was giving evidence for the first time, as her parents John, 76, and Susan, 62, looked on behind - alongside the family members of the alleged victims on the other side of the public gallery. ",
        "During the hearing, an emotional Letby told the court she tried her best to care for premature babies and felt sick to be accused of murdering them.The 33-year-old nurse sobbed as she revealed that being arrested at dawn by police, and taken away in handcuffs in her pyjamas, had left her with post-traumatic stress and unable to sleep.She was 'devastated' to be blamed for the infants' deaths and at being removed from the neo-natal unit, adding: 'My job was my life, my everything.' In dramatic exchanges with her barrister, Mr Myers, the nurse repeatedly denied trying to kill or murder the 17 infants.Asked by her lawyer whether she ever wanted to harm the babies, she replied: 'I only ever did my best to care for them – I am there to help and to care, not to hurt.'She said 'it was sickening' to be blamed for the deaths, adding: 'I just couldn't believe it. It was devastating, I don't think you could be accused of anything worse than that.' ",
        "Letby admitted describing doctors, including TV medic Ravi Jayaram, who was in charge of the children's ward and who pointed the finger at her, as 'bastards'.The court has heard that he and other consultants blocked Letby from returning to the unit when she was moved into a desk job, in July 2016, even though hospital managers wanted her back on the ward. Asked if she ever wanted to hurt any of the 'hundreds' of babies she looked after, Letby said: 'No, that's completely against everything being a nurse is.'",
        "Mr Myers asked Letby to explain a note police found at her home when they arrested her two years after her final alleged victim died.Letby had written a number of chaotic phrases, including: 'I don't deserve to live. I killed them on purpose because I'm not good enough. I am a horrible evil person. I AM EVIL I DID THIS.' Letby, who sat up straight in her chair as she gave her evidence, claimed she wrote the note, in July 2016, when she was 'really struggling' and doubting her professional ability.Mr Myers asked: 'How were you feeling?' She replied: 'I felt immense responsibility, I felt I had been incompetent or done something wrong that had harmed the children.'",
        "Mr Myers pointed to a section of the brief note on which she had scrawled: 'I will never have children or marry or know what it's like to have a family.'Asked why, the accused replied: 'Because at that time I didn't see any future for myself, I couldn't imagine what life would be, or that I would have a future.'Mr Myers added: 'The note says 'I killed them on purpose because I'm not good enough'. Why did you think you weren't good enough?' Letby answered: 'Because the suggestion throughout was that I'd done something wrong, that my competencies had to be rechecked.'",
        "The nurse started weeping when Mr Myers asked her about the times she thought about killing herself and about the comment 'I'm evil I did this'. She told the jury: 'I felt at that time if I'd done something wrong and I didn't know I'd done (something) I must be such an awful evil person if I'd made mistakes and not known.'",
        "Letby said she started working at the Chester hospital while studying for her nursing degree at the city's university in 2010. She qualified the following September.Mr Myers also questioned the nurse about a close friendship she had with a doctor, who cannot be named for legal reasons. Earlier in the trial Letby broke down in tears in the dock when the fellow medic gave evidence.Asked whether there was 'anything more' to the relationship, Letby replied: 'No, he was just a trusted friend.' But she admitted they had met up outside work, adding: 'Sometimes we would go out for meals or coffee or walks.'She said their friendship 'fizzled out' at the beginning of 2018 before she was arrested in July.At times her mother, Susan, 62, wiped away tears as her only child gave evidence. She and her husband, John, 76, have attended every day of the trial.",
        "Letby, of Hereford, denies seven counts of murder and 15 counts of attempted murder against 17 children. The trial is scheduled to continue on Friday."
    ]
}