{
    "articleURL": "/wires/pa/article-12047149/Why-authorities-talking-AI-countries-doing.html",
    "content": [
        "The UK’s competition watchdog has opened a probe into artificial intelligence (AI), amid concerns that the technology might impact consumers.",
        "The Competition and Markets Authority (CMA) said it would look into whether rules need to be changed to protect both competition and consumers.But why are regulators talking about AI and what are other countries doing?– Why are so many people talking about AI?The release of several impressive new generative AI softwares in the last year has captured the public imagination.Midjourney, for example, has allowed users to write prompts and see a computer generate a realistic-looking image in just seconds of practically whatever they ask for.ChatGPT and other similar programmes have allowed users to generate poetry, convincing-sounding university essays, song lyrics and much more.– Is ChatGPT really such a game changer?One of the biggest changes in recent generative AI is just how accessible it is to people with only a mobile phone or a computer.AI has been playing a role in society for several years, but has often required users to learn how to code if they want to use it, or even more commonly has not even been accessible to the public.AI technology is likely to bring massive changes to society in the long run. The exact role of ChatGPT in this is impossible to determine for now.– Why are regulators getting involved now?",
        "Regulators are often sensitive to the same forces that drive public imagination, so they have clearly also had their interest piqued by the recent advances in accessible AI.They have now stepped in to try to figure out if they need to create new rules and laws for the sector.– What have global authorities done so far?On Thursday the CMA said it plans to launch a review of the sector. The authority will look into whether competition is strong in the sector and whether consumers are protected.In China legislators plan to force generative AI companies to do security assessments, the EU has raised copyright and privacy concerns, and the US Federal Trade Commission has said this week it plans to use existing laws to keep on top of the issue.– Will the CMA probe solve all the problems with AI?No, the watchdog’s probe is limited to what the CMA has power to influence.",
        "But there are much bigger concerns about the impact that AI might have on jobs, especially the white collar roles which have been less impacted by automation in the past.This week former UK government chief scientific adviser Sir Patrick Vallance said that AI might impact jobs as much as the industrial revolution did.",
        "Earlier Google’s Geoffrey Hinton resigned from his job at the company, warning that the technology is vulnerable to use by “bad actors”."
    ]
}