{
    "articleURL": "/tvshowbiz/article-12055477/Suki-Waterhouse-commands-attention-performs-stage-Shaky-Knees-Festival.html",
    "content": [
        "Suki Waterhouse commanded attention from a large crowd on Saturday as she performed for the 10th Anniversary of Shaky Knees Festival in Atlanta, Georgia. ",
        "The model-turned-actress, 31, appeared to be in her element as she performed on day two of the three-day music festival. The beauty looked nothing short of sensational as she donned a sheer pearl blouse with a skimpy black bralette underneath.She put on a very leggy display in textured green mini hot pants as she completed her chic ensemble. To further elevate the sassy look, she also opted for elongating her pins further by donning a pair of chic over-the-knee leather boots. ",
        "She also accessorised the look with a pair of oval-shaped sunglasses to shield her eyes from the sun.She styled her luscious blonde locks in a bouncy blowout for the day ahead and opted for a glam makeup look consisting of a sheer pink lip and a glowy base. Suki appeared to be in high spirits as she danced across the stage while belting out some great hits. The on-stage performance comes after Suki looked nothing short of sensational in a sheer dress as she arrived with her boyfriend Robert Pattinson to the Met Gala 2023 on Monday.And Suki and the superstar, 36, couldn't keep their hands off each other as they showed off their chic looks on the red carpet. The event returned to the Metropolitan Museum of Art in New York City on Monday, with everyone from Kim Kardashian to Paris Hilton set to attend the annual fundraising event.",
        "The couple, who only made their red carpet debut late last year despite dating for several years, marked their first time together at the Met Gala as a couple. ",
        "This year, the ball's theme was Karl Lagerfeld: A Line of Beauty. The late German designer, who died at 85 in 2019, was Chanel's long-time creative director. Suki glowed in a sheer Fendi dress with a skirt that reached down just above her ankles. It had an extra layer over her torso and a ribbed section highlighting her toned midriff. The entire dress was decorated with colourful flower and plant designs, along with a couple of majestic birds to create a lovely nature scene. She complemented the flesh-toned item with her dirty blond ombré hair, which she wore with a middle part as it rested delicately on her shoulders. The Daisy Jones &amp; The Six actress stood tall in a set of beige open-toe heels featuring rhinestone-clad straps. ",
        "She and her partner Robert wrapped their arms around each other and showed off some particularly affectionate glances as they posed on the iconic red carpet. He opted for a fashion-forward black Dior tuxedo, which included an extra skirt, in addition to the trousers. He wore it with a white shirt, and opted for a gold brooch instead of a tie and the Batman star added some sparkle to the look with bedazzled chunky black shoes.",
        "The lovebirds have been in a relationship since 2018, but they tend to keep a quiet public profile.In February, Suki spoke to The Times about her long-term relationship.",
        "'I'm shocked that I'm so happy with someone for nearly five years,' she gushed. 'I'm always incredibly excited when I see his name pop up [on my phone] or even a text, and I think he feels the same about me. We've always got so much to say, and I find him hilarious.'This year's decision to honor Karl Lagerfeld recently sparked controversy given the many offensive remarks he has made over the years, from slamming the #MeToo movement to opposing same-sex marriage.'I'm against it for a very simple reason: In the '60s they all said we had the right to the difference. And now, suddenly, they want a bourgeois life,' he told Vice of same-sex marriage.'It's difficult to imagine — one of the papas at work and the other at home with the baby. How would that be for the baby? I don't know. I see more lesbians married with babies than I see boys married with babies. And I also believe more in the relationship between mother and child than in that between father and child.'While he ultimately showed his support for same-sex marriage at his spring 2013 Chanel haute couture show, he still said he was 'less keen' on same-sex couples adopting children, according to the Associated Press.",
        "Along with the Vogue editor-in-chief, Anna Wintour, who runs and hosts the annual event, the 2023 MET Gala was also co-hosted by Penelope Cruz, Dua Lipa, Michaela Coel and Roger Federer.While the show may be known for its glitzy and over-the-top red carpet — with details of what occurs inside often remaining mysterious — at its heart, it is a fundraising event for the Metropolitan Museum of Art's Costume Institute.Last year, the 2022 MET Gala alone raised a grand total of $17.4 million, reported Billboard.This year the price of admission had been raised from $30,000 to $50,000, according to Page Six.Even those who had the funds weren't guaranteed entry to the party, though many of the guests were sponsored by fashion houses that footed the bill for their tickets.Every guest had to be invited, and a waiting list existed for the coveted golden ticket.",
        "And status matters, according to The New York Times, meant the hottest stars were a shoo in for an invite.Paris Hilton was among some of the big names who attended and it was her first Met Gala. Meanwhile, Blake Lively, a usual frequent attendee, recently announced that she was not attending the party, however, she stated that she will be 'watching'. ",
        "'I will be watching,' she said, according to People.Elle Fanning, Kim Kardashian and La La Anthony were among the other celebs that also attended.As for Wintour's role in the bash, Vogue's editor-in-chief organized the party and oversaw the guest list as well as the menu.She has often served as the Met Gala's chairwoman since 1994 and continues to serve look after look at every event."
    ]
}