{
    "articleURL": "/sport/football/article-12038905/Leeds-fans-say-Sam-Allardyce-appointment-firefighter-aims-avoid-relegation.html",
    "content": [
        "Sam Allardyce is set to be appointed Leeds manager for the rest of the seasonLeeds are 17th in the Premier League table and under threat of relegationThere are four games remaining of the campaign for Allardyce to help the club Leeds United have their third manager of the season, with 'Big Sam' Allardyce parachuted in to try to save the Yorkshire side from relegation. ",
        "Allardyce's arrival of Wednesday comes after Javi Gracia was sacked on Tuesday, leaving the former Bolton, England and Everton boss to take over for the final four games. The 68-year-old has plenty in his in-tray, with players divided and demoralised and a tough trip away against Manchester City first up on Saturday.Allardyce will be paid £500,000 for those four games in charge, and will receive a further £2.5million if he manages to keep the Whites up despite the odds. And below, Leeds fans on the street spoke to Mail Sport outside Elland Road about their thoughts on Allardyce's appointment. ",
        "One said: 'I think Leeds now, as it stands, are going down in my opinion, just through sheer (poor) performances. With Sam coming in, a new face - we're in dire straits at the minute so with him coming in, a new face might boost the lads up.'A bit of morale going up, you know, they need a bit of a kick up the backside.'A second added: 'I think it's a total joke to be quite honest. From the times of (previous boss Marcelo) Bielsa, and now we've gone downhill with (Jesse) Marsch, and now this... four games, how can anyone keep us up now? It's too late.' Another continued: 'I think the appointment of Sam Allardyce is clutching at straws. They're scraping the barrel there. I guess it's a temporary solution, it could be, but I'd be urging the decision makers of Leeds United to be looking at a certain Ange Postecoglou, the Australian, currently managing Celtic. ",
        "'He's the real deal and he's the guy that this club needs to pull them right out of the mire.'While one said: 'Well, I mean, it's chaotic. It's absolutely chaotic. Something does need to change. I think we're drinking in the last chance saloon at the moment. I don't know... Sam Allardyce, it's worth a go. It's worth a go, I think.'There's been so much chaos, turmoil, everything else - I think we've got to try something. Do you like the situation? Absolutely not. But I think it's got to be worth a go.' "
    ]
}