{
    "articleURL": "/wires/reuters/article-12055103/Senate-Republicans-oppose-vote-just-raise-US-debt-ceiling-push-priorities.html",
    "content": [
        "WASHINGTON, May 6 (Reuters) - A group of 43 Republicans in the U.S. Senate said they oppose voting on a bill that only raises the U.S. debt ceiling without tackling other priorities, in a letter to Democratic Senate Majority Leader Chuck Schumer, showing they could block such a plan by Democrats.",
        "Citing an economy \"in free fall,\" the Republicans, led by Senator Mike Lee and including Minority Leader Mitch McConnell, said \"substantive spending and budget reforms\" need to be \"a starting point\" for negotiations.The offices of McConnell, Schumer and other lawmakers did not immediately respond to requests for comment.Several moderates including Senators Mitt Romney and Lisa Murkowski did not sign the letter. Senator Susan Collins, another moderate Republican and the vice chair of the Senate Appropriations Committee, also did not sign.U.S. President Joe Biden, a Democrat, in recent days has criticized Republicans for threatening not to raise the debt limit unless Democrats agree to steep budget cuts. Biden will meet with four top congressional leaders on Tuesday to discuss spending priorities, according to the White House.U.S. Treasury Secretary Janet Yellen said in a recent letter to Congress that the agency may be unable to meet all of its debt obligations as soon as June 1 if the debt ceiling is not raised. The political standoff has raised concerns over a default that could reverberate across global financial markets.Schumer said this week that the Senate might consider a bill that only raises the debt ceiling without addressing other Republican priorities. With only a 51-49 majority in the Senate, Schumer would need the support of at least nine Republicans to clear a 60-vote threshold to advance such legislation.",
        "The latest Senate Republican letter shows the party could block a so-called \"clean\" debt ceiling bill.The House in late April passed a bill to raise the government's $31.4 trillion debt ceiling that includes sweeping spending cuts over the next decade.However, that measure is not expected to pass in the Senate and would be vetoed by Biden if it did. (Reporting by Ted Hesson and Moira Warburton in Washington; Editing by Franklin Paul)"
    ]
}