{
    "articleURL": "/tvshowbiz/article-12041165/Channel-4-cooking-huge-celebrity-chef-host-AXED-just-one-series.html",
    "content": [
        "One of Channel 4's newest cooking shows has reportedly been axed by the broadcaster after just one series.",
        "The Great Cookbook Challenge with Jamie Oliver has been shelved after its debut run ended in March.The show saw 18 cooks compete to win a book publishing deal and release their very own cookbooks, by creating dishes in the hope of impressing a panel of judges.Each cook would pitch their book ideas and various recipes that would appear inside it, with the contestants slowly whittled down to the final three. According to The Sun, Channel 4 have decided not to renew the show for a second series, with a source saying: 'Bosses have decided to leave Great Cookbook Challenge at one series.",
        "'They're proud of the show and will be continuing to work with Jamie on other shows currently in the pipeline.'MailOnline has contacted a representative for Channel 4 for comment.Dominique Woolf was crowned the winner with her Asian-inspired food recipes and her cookbook was released last summer. It comes after Jamie revealed cooking 'saved his life' as he struggled with dyslexia and reflected on renewing his vows with his wife Jools.The chef candidly spoke about why he decided to pursue cookery as a career, admitting he would have been 'utterly miserable' without it.He explained that he found school work 'really hard' because of his dyslexia, which is a learning difficulty that affects the skills involved in reading and spelling.",
        "Sharing how cooking was a lifeline for him, Jamie told The Sun: 'Cooking genuinely saved my life, I would have been utterly miserable without it.'Jamie also said he didn't read a novel until he was 35 years old, when he picked up Suzanne Collins' book Catching Fire from the Hunger Games trilogy. ",
        "Jamie went on to explain how he would put his children - Poppy, 21, Daisy, 20, Petal, 14, Buddy, 12 and River, six - to bed so he could read or create bedtime stories for them.He said this led to him writing his first children's book Billy And The Giant Adventure, which was something he thought he would never achieve due to his dyslexia.Elsewhere in the wide-ranging chat, Jamie also spoke about recently renewing his vows with his wife Jools, 48 - 23 years after they originally tied the knot.Last month, Jamie shared an intimate carousel of family snaps to Instagram, after saying 'I do' for a second time at the Soneva Fushi Resort in the Maldives. Speaking about the ceremony, Jamie said they had planned to renew their vows on their 20th wedding anniversary, before delaying due to the Covid pandemic.He said: 'I've got five kids, and the two eldest ones have flown the nest, at uni and getting jobs, and I just thought it would be great to go away as it would probably be one of the last holidays as a family, before boyfriends and other things that happen in parents' lives.",
        "'So we went and renewed our vows, and it was actually really nice - and I think I enjoyed it the most out of everyone.'"
    ]
}