{
    "articleURL": "/wires/ap/article-12048695/Reporter-charged-prank-call-using-S-D-governors-cell.html",
    "content": [
        "SIOUX FALLS, S.D. (AP) - A broadcast reporter has been charged with making a prank phone call using South Dakota Gov. Kristi Noem´s personal cellphone number.",
        "Stanley County Sheriff Brad Rathbun said Austin Goss, who has been fired from his job as the capitol bureau reporter for Dakota News Now, surrendered Thursday and was released on a personal recognizance bond.The misdemeanor count of making threatening, harassing, or misleading contacts carries a maximum penalty of one year´s imprisonment and $2,000 in fines.Online court documents indicate that he is representing himself, and he didn´t immediately respond to text or voicemail messages from The Associated Press seeking comment. Noem´s spokesman, Ian Fury, declined to comment.Dakota News Now and KOTA Territory News said in a joint statement that they had terminated Goss´ employment with the stations, saying they were \"unaware of Mr. Goss´ activities and deeply regret the lack of judgment he showed.\"The recipient of the \"harassing phone call\" was identified in the probable cause statement only as a 50-year-old with the initials D.L., The Argus Leader reported. But Dan Lederman, the former chair of the South Dakota Republican Party, confirmed to the paper that he was the one who was called on Jan. 22.He had no further comment, but a special agent with the South Dakota Division of Criminal Investigation wrote in the statement that the call came from a website called PrankDial, which was able to make it appear as though it was coming from Noem´s cellphone.",
        "In the pre-recorded call, a mafia member angrily accuses the recipient of stealing boxes of vaccines, including lines like \"You telling me you didn´t tell Vito that you were gonna try to move the three boxes of that AstraZeneca outside this family?\" The call ends \"You´ve just been pranked by PrankDial.com.\"Lederman told the investigator that Goss would \"occasionally text him snide or rude remarks,\" and said the audio recording \"caused him concern for his safety.\"Noem announced one day after the call was made that she was urging the U.S. Attorney General and multiple congressional committees to investigate the leaking of her family´s personal information, including her personal cellphone number.The previous week, she demanded that the U.S. Department of Justice investigate why her family´s social security numbers were leaked when Congress released its findings in the Jan. 6 investigation.Officials with the U.S. Attorney General´s officer didn't immediately respond to messages from the Argus Leader or the AP about the new development."
    ]
}