{
    "articleURL": "/wires/reuters/article-12041863/Russian-navy-vessels-seen-near-Nord-Stream-blasts--Nordic-broadcasters-report.html",
    "content": [
        "COPENHAGEN, May 3 (Reuters) - Three Russian navy ships were observed in the Baltic Sea in the area of the Nord Stream pipeline blasts prior to the sabotage that halted Russian gas flows to Europe in September last year, an investigation by four Nordic broadcasters has found.",
        "The Russian navy ships were traced using satellite images and intercepted radio communication from the Russian fleet, the four broadcasters, Denmark's DR, Norway's NRK, Sweden's SVT and Finland's Yle, said.Authorities in Denmark, Sweden and Germany have said the explosions that ruptured the Nord Stream 1 and newly-built Nord Stream 2 gas pipelines that link Russia and Germany across the Baltic Sea were deliberate. But they have yet to publish any findings of their respective investigations.The Nordic broadcasters found that in June and September last year, the Russian ships sailed from navy bases in St. Petersburg and Kaliningrad to the area northeast of the Danish island of Bornholm where three of the four pipeline leaks happened.One of the vessels, a tugboat named SB-123 capable of launching mini-submarines, was located in the area on Sept. 21 and 22, they found.Separately, the Danish Armed Forces confirmed to Reuters that a patrol vessel had taken 26 photos of a Russian submarine rescue vessel named SS-750 near the Nord Stream blast site on Sept. 22 last year, just days before the explosions happened.The incident took place seven months into Russia's war on Ukraine. The Kremlin on Tuesday denied Russian ships had any involvement in the sabotage and called for results of the investigations to be published.",
        "Moscow has, without providing evidence, blamed the explosions on Western sabotage. Both the United States and Ukraine have denied having anything to do with the attacks as has Russia.The Russian ships traced by the four broadcasters had all switched off their AIS signal, an automatic tracking system used on ship, they said. One of the ships in the area was Russian navy research vessel Sibiryakov, satellite images indicated. (Reporting by Jacob Gronholt-Pedersen, Editing by Angus MacSwan)"
    ]
}