{
    "articleURL": "/wires/afp/article-12050953/India-state-police-say-restoring-order-ethnic-clashes.html",
    "content": [
        "Police in a remote Indian state said troops were restoring order on Friday after ethnic clashes that killed at least six people and saw weapons stolen from police stations.",
        "India rushed hundreds of soldiers to Manipur, along the border with Myanmar, on Thursday after a protest march by a tribal group turned violent.Authorities imposed an internet blackout and issued shoot-at-sight orders in \"extreme cases\" in an effort to contain the unrest.Some police stations had been overrun by \"miscreants\" who stole arms and ammunition, Manipur director general of police P. Doungel told reporters in Imphal, the state capital.But troop patrols had helped to bring the situation under control by Friday, he added.\"They do not, like we say, deal with people in a way the police deals. They are meant to destroy... by using maximum force,\" Doungel said.\"The way they move about in the public is different. The way they talk to a person is different. This has gone a long way to quell the thing off.\"Security forces fired tear gas in Imphal on Thursday to disperse protesters, some of whom had set alight vehicles and houses in parts of the city.Burnt out vehicles sat on streets otherwise empty due to the imposition of a round-the-clock curfew.Defence officials said Friday that additional troops had been brought into the state by road and air.Tribal groups were protesting against demands by the state's majority Meitei community to be recognised under the government's \"Scheduled Tribe\" category.",
        "Indian law gives tribes falling under that designation reserved quotas for government jobs and college admissions as a form of affirmative action to address structural inequality and discrimination.Manipur is part of India's remote northeast, a region linked to the rest of the country by a narrow land corridor that has seen decades of unrest among ethnic and separatist groups.The northeast is home to dozens of tribal groups and small guerrilla armies whose demands range from greater autonomy to secession from India.At least 50,000 people have lost their lives in the conflicts since the first insurgency broke out in Manipur in the early 1950s.Over the years these conflicts have waned, with many groups striking deals with New Delhi for more powers."
    ]
}