{
    "articleURL": "/wires/reuters/article-12049519/Old-disputes-overshadow-visit-Japans-Kishida-S-Korea.html",
    "content": [
        "May 5 (Reuters) - Japanese Prime Minister Fumio Kishida will be visiting South Korean President Yoon Suk Yeol on Sunday in the latest effort to improve bilateral ties.",
        "However, the trip will be overshadowed by historical issues and other disputes between the two countries - in some of which progress has been made, while others remain intractable.- Relations between the two North Asian U.S. allies have been strained over disputes dating to Japan's 1910-1945 occupation of Korea. Koreans accuse Japan of forcing women to work in wartime brothels for the Japanese military and using forced labour, among other abuses. - Various measures have been taken over the years in attempts to resolve the issues. Japan says the matter of any compensation for wartime labour was settled under a 1965 treaty normalising diplomatic ties and providing South Korea with economic assistance. - In 2015, South Korea and Japan reached a settlement under which Tokyo issued an official apology to \"comfort women\" who say they were enslaved in wartime brothels, and provided 1 billion yen ($9.23 million) to a fund to help the victims. But then-South Korean President Moon Jae-in decided to dissolve the fund in 2018, effectively scrapping the agreement as he said it did not do enough to consider victims' concerns. - In 2018 South Korea's Supreme Court ordered Japan's Nippon Steel &amp;amp; Sumitomo Metal Corp and Mitsubishi Heavy Industries to compensate some wartime forced labourers. Tokyo has warned of serious repercussions if the orders are enforced.",
        "- Relations deteriorated in 2019 when Japan restricted exports of high-tech materials for making chips and display panels to South Korea. At the time Seoul threatened to pull out of an intelligence-sharing deal with Tokyo, but backed down at the last minute under pressure from the United States, which has pushed for its two allies to mend ties.- In March, Yoon's administration proposed establishing a public foundation to compensate the plaintiffs in the Nippon Steel and Mitsubishi Heavy Industries cases. As of early May, 10 out of 15 surviving victims have accepted the plan, but are still calling for an apology from Japan.- In mid-March, Kishida and Yoon met in Tokyo, in the first visit by a South Korean leader to Japan for a bilateral working meeting in 12 years.- In late March, Japan's trade ministry lifted export curbs to South Korea on the high-tech materials, while South Korea withdrew its complaint filed at the World Trade Organization on Japan's export controls.- There is concern in South Korea over potential environmental contamination from waste water at Japan's Fukushima Daiichi nuclear power plant, which was badly damaged by a 2011 earthquake and tsunami.As Japan is expected to discharge the waste water into the sea around this summer, the issue of verifying its safety may be discussed during Sunday's summit, South Korean media reported.",
        "- Seoul regularly lodges complaints over the way history is recounted in some Japanese textbooks, and there have been flare-ups over the \"Rising Sun\" flag seen as a symbol of imperial Japan. Tokyo has accused South Korean leaders of exacerbating tensions to score political points.- The two countries also have a territorial dispute over a cluster of windswept volcanic islets, known as Dokdo in Korea and Takeshima in Japan. The islets are controlled by Seoul with a small contingent of coast guards, and are also claimed by Tokyo. - The United States has pressed both countries to resolve the disputes to better counter rising threats from China and North Korea, among other regional challenges. Under Yoon, South Korea has resumed trilateral military drills and agreed to more intelligence sharing on issues like tracking ballistic missile launches from North Korea. (Reporting by Joyce Lee; Editing by Raju Gopalakrishnan)"
    ]
}