{
    "articleURL": "/tvshowbiz/article-12057919/Real-Housewives-Atlanta-Kenya-Moore-blasts-Sheree-Whitfields-new-boyfriend-Martell-Holt.html",
    "content": [
        "Kenya, 52, told Shereé, 53, that her new boyfriend Martell previously slid into her DMs on Instagram and tried to reach out to herSheree then called over Martell, 41, so Kenya could tell him herself about her allegations 'Once a cheater always a cheater you f***ing piece of s***!,' Kenya yelled at Martell while being restrained as the episode endedKenya Moore shockingly told Shereé Whitfield that her new boyfriend Martell Holt slid into her DMs during the season premiere of The Real Housewives Of Atlanta.",
        "'As a friend, I just want somebody to be honest with me because I don't want you hearing it from anybody else. You should know that he did slide into my DMs before,' Kenya, 52, told Sheree during a birthday party on Sunday's episode of the Bravo show.'Let me see it,' Sheree, 53, demanded.Sheree then called over Martell, 41, so Kenya could tell him herself about her allegations.'Ooh, I'm not trying to be rolling on the ground with She-Man over here,' Kenya said in a confessional. 'I look too damn good in this dress.'",
        "Kenya was then shown a short time later confronting Martell by saying, 'I'm sorry, did you just curse at me? What did you say to this queen standing in front of you?'Sheree then protested that a narrative was being crafted based on what happened two years ago.'Once a cheater always a cheater you f***ing piece of s***!,' Kenya yelled at Martell while being restrained as the episode ended with a 'To Be Continued' message.Before the confrontation at the party, Shereé had been gushing about dating Martell.'I met Martell through a mutual friend,' Sheree said in a confessional. 'He's on a reality show and we really enjoy each other's company.'Sheree said she was really happy she didn't give up on love and left the door open.",
        "'Martell definitely exudes big d*** energy,' Sheree said in a confessional.But when Martell showed up on Shereé's arms at Sanya Richards-Ross, 38, themed Harlem themed party for her husband Aaron's 40h birthday the women were shocked.",
        "'He ain't got no ankle bracelet on him so I think it's an upgrade,' Sanya said.Kenya asked Sheree and Martell if they were official.'Kenya is so damn nosy,' Sheree said in a confessional. 'Stop worrying about my relationship and worry about if Marc [Daly] is going to take Moore Manor in a divorce settlement and hopefully he adds baseboards.''I think Sheree needs her own spin-off show ''Watch Me Date These Dumb Dudes'',' Kenya said in a confessional.'I know another person in Atlanta that he has actually been kicking it with,' Kandi Burruss, 46, said to Kenya.'If this is just about the D, let it be about the D,' Kenya said.'But what if it ain't just about the D?' Kandi said. 'Do we say something?'Kandi's friend Monyetta Shaw, 42, also told Sheree that they had heard Martell was also dating someone else in Atlanta.",
        "'This is a Ferrari honey,' Sheree said in a confessional. 'Now if he's cheating with another girl that's like a Toyota. Now if you want to downgrade, that's on him.'",
        "Monyetta, Kandi and Kenya had spoken about Martell even before the party. Monyetta hoped that Sheree wasn't getting serious with him.'The streets been talking to you, too?' Kandi said. 'The streets say he's been kicking it with some chick in LA, though.''It's a little awkward because he did lightweight try to talk to me,' Kenya said. 'Reaching out via Instagram.''He slid up in your DM?' Kandi said.Kenya tried to show them messages to them but when she accepted his request, she saw the messages had been deleted.'Why didn't I talk to Martell,' Kenya said in a confessional. 'Every time Martell looks at a woman she comes back pregnant. Luckily for Sheree, she doesn't have any more periods, so she doesn't have to worry about that.''He's a thirst trap,' Kandi said.",
        "The season 15 premiere episode titled 'Who's Gonna Check My New Boo?' opened four days before Sanya's themed party for her husband's 40th birthday.Kenya revealed that Monyetta made an introduction for her to a super bachelor named Roi Shlomo who she's been seeing.'I'm like kind of crazy about him,' Kenya said in a confessional. 'He's been very kind to me. He's funny. He makes me feel alive, and he's not bad on the eyes.'",
        "Kenya said that she had been separated from her estranged husband since 2019.'And this chocolate Barbie doll looks too damn good to be single for too long,' Kenya said.Kandi said her husband Todd has been writing movies that he wanted her to produce but that she didn't think she had the time.'I don't ever want to see you end up in divorce court like me,' Kenya told her. 'My sisterly advice, you've got to find a way to make time for your husband.'Marlo Hampton's nephews William, 14, and Michael, 15, put together a taco Tuesday dinner for her. Marlo, 47, shared in a confessional that even though her sister had gotten out of jail she had not been in contact with her or her sons.",
        "'Michael and William, those are my boys,' Marlo said. 'They aren't going anywhere. This is forever.'Sanya went over to Sheree's house to work out. Sheree's friend Courtney Rhodes, 48, a businesswoman, showed up to join them. Courtney said she heard that Kandi had been asking around about her. Sheree said that Kandi had a lot of time on her hands.'The only time Kandi is not talking about people or me is when she's eating or sucking d*** but not in a locker room,' Sheree said.",
        "Courtney told Sheree that she was glowing and asked if it was because of Martell.'We are enjoying each other,' Sheree said. We have not put a label on anything.'Sanya and her mother went to see the party prep for Aaron's party and were impressed.'Originally, I had set a $40,000 budget for Ross' 40th birthday,' Sanya said in a confessional. 'I thought that would suffice. After casino tables, dancers, DJ, all the things, I'm sitting at about 100 grand. Whatever it takes.'Marlo met with her hairstylist Reco and she mentioned that she hadn't seen Kandi since New York.",
        "'Did you see the spoof's on Instagram?' Reco said of the videos of Kandi pretending to be Marlo.'The s*** was funny as hell,' Marlo said in a confessional. 'I'm cool on Kandi.'The group arrived at the party and Sanya said it felt like it was her wedding day.Ralph Pittman, 37, came to the party solo and said that his wife Drew Sidora, 37, wasn't feeling well.'And we got a family emergency,' Ralph said. 'She's got a family crisis going on.''Oh wow,' Kenya said.'Ralph is saying there was a crisis in the family, he forgot he was married to the crisis,' Kenya said in a confessional. 'Like you've got to be there Ralph. That's part of your family, too.'",
        "'She has a lot going on with family,' Ralph said in a confessional. 'Her father is sick, so she's dealing with a lot. I need to make sure I show love and support to my boy though. It's his 40th.'",
        "Drew and Ralph have since released a statement saying they decided to end their eight-year marriage and Ralph filed for divorce in March 2023.Kandi showed up with her husband Todd Tucker.Courtney confronted Kandi and said she didn't go around telling people that they were friends.'The truth is I don't know you,' Kandi said.Courtney said she never claimed that she did.'I don't have to clout chase,' Courtney said.'I never said you were clout chasing,' Kandi said. 'You just bounced up at me!''Well, let's bring it down,' Courtney said.'Well stop bouncing at me,' Kandi said.",
        "'Well, calm the f*** down,' Courtney said.'B****, don't you,' Kandi said.Sanya then got in front of Courtney.'I'm about to headbutt this b****,' Kandi said.The Real Housewives Of Atlanta will return next week on Bravo. "
    ]
}