{
    "articleURL": "/wires/aap/article-12039345/Arsenal-swat-Chelsea-aside-return-EPL-summit.html",
    "content": [
        "Arsenal have returned to the Premier League summit and, while they are unlikely to remain there long, they did so in style by brushing aside struggling London rivals Chelsea.",
        "Three-nil up after 34 minutes Arsenal's victory was more comprehensive than the 3-1 scoreline suggests as they dominated Tuesday's match at the Emirates.Martin Odegaard scored identikit goals after 18 and 34 minutes, sweeping in passes from the left by Granit Xhaka. Gabriel Jesus then took advantage of shambolic defending to net a third.\"I think especially the first half was brilliant. We came out a different spirit, a different team to last time (against Manchester City),\" Odegaard told Sky Sports.\"I'm very happy with the first half, but the second half was a bit messy I'd say. Three points and a good win, we needed this one to get back.\"With Manchester City at home to West Ham United on Wednesday night the Gunners can expect to be dethroned quickly, but they showed how well they can play with some scintillating football.However, there were also episodes of the casual defending that has cost them in recent weeks. Noni Madueke took advantage in the 65th-minute to score just the Blues' second goal in eight games.There was never any likelihood of a Chelsea comeback however, and Arsenal eased to their first win in five matches, a spell that has left their title chances no longer in their own hands, but relying on City dropping points.",
        "The Gunners are now two points clear at the top but have played two games more than City.\"We have to fight, we have to keep going,\" Odegaard added.\"We'll believe until the end, fight until the end.\"Chelsea, who have now lost six in six since Frank Lampard returned as caretaker manager, remain in the bottom half of the table, but probably safe being nine points clear of the relegation zone.\"Performance first half was nowhere near good enough,\" Lampard said.\"(We were) too nice to play against in all aspects, too passive.\"It's a good team. They go 3-0 up against you. The second half was better, but of course the result was relatively confirmed by then.\"The visitors began with former Arsenal striker Pierre-Emerick Aubameyang leading the line in his first start since November - in the 1-0 home defeat to Arsenal. But he was withdrawn at halftime after nine touches.Not that Aubameyang had any service, Arsenal monopolised possession and were full value for their halftime lead.Chelsea improved in the second period, but that seemed to be as much because Arsenal had taken their foot off the gas, confident victory was secured.With PA."
    ]
}