{
    "articleURL": "/wires/pa/article-12056313/Police-got-balance-right-handling-coronation-protesters--Culture-Secretary.html",
    "content": [
        "Police got the “balance right” between allowing protest and enjoyment of the King’s coronation, the Culture Secretary has said.",
        "Lucy Frazer defended the Metropolitan Police after the force was heavily criticised by MPs and human rights groups over dozens of arrests.The chief executive of anti-monarchy group Republic, who was among 52 people arrested on Saturday, was released after nearly 16 hours in police custody.Graham Smith tweeted that there was “no longer a right to peaceful protest in the UK”.",
        "Ms Frazer denied that officers had gone too far.The Cabinet minister told Sky News’ Sophy Ridge On Sunday programme: “What they have to do is balance the right to protest, which is important in a democracy. At the same time there’s the right of all those other people to enjoy what was a fabulous day.",
        "“I think, overall, they managed to get that balance right.”She said it was right of the police to take into account the context of the event, as it took place on the world stage with hundreds of foreign dignitaries attending and had national security implications.The Met confirmed 52 people were arrested for affray, public order offences, breach of the peace and conspiracy to cause a public nuisance around the coronation.Under the controversial new Public Order Act, protesters who have an object with the intention of using it to “lock on” are liable to a fine, with those who block roads facing 12 months in prison.",
        " What worries is me is that the Conservative government have now increased these sort of wide-ranging powers ... what they haven’t done is enshrined the sort of legal responsibility and the duty on the police to actually facilitate peaceful protest  Daisy Cooper, Lib Dems  Asked whether she trusted the police to use the new laws, Ms Frazer said: “Yes, I do trust them to use those new powers.“I have huge confidence in the police.“I think it’s absolutely right that they have the powers that they need in order to ensure that people can go to go on their day-to-day lives at the same time as respecting people’s rights to protest.”The new laws were intended to “redress the balance” after a recent change in demonstrators’ tactics, she said.“We’ve seen in this country a rise in protests and the way people are protesting that is interfering with the rights of people to go around their daily life.”Metropolitan Police Commander Karen Findlay acknowledged concerns about the arrest of protesters but defended Scotland Yard’s actions, saying: “Our duty is to do so in a proportionate manner in line with relevant legislation.”The Met said it received information that protesters were “determined to disrupt” the coronation – including defacing public monuments with paint, breaching barriers and disrupting official movements.",
        "Campaigners said the protests were “peaceful”, describing the arrests as “a dangerous precedent for us as a democratic nation”.The Liberal Democrats’ deputy leader said she had “concerns” the police may not have got the balance right in handling protests.“Some of that information is unfolding. But, on the face of it, I do have concerns,” Daisy Cooper told Ridge.“What worries is me is that the Conservative government have now increased these sort of wide-ranging powers … what they haven’t done is enshrined the sort of legal responsibility and the duty on the police to actually facilitate peaceful protest.”Labour frontbencher Wes Streeting said it was important for police to provide “accountability” over concerns raised about how demonstrators were treated.“Where concerns have been raised, whether that’s by Republic, the campaign for an elected head of state, or people more generally just concerned about they’ve read in the papers or seen on the telly, it’s important that the police provide that accountability,” the shadow health secretary told the same programme."
    ]
}