{
    "articleURL": "/news/article-12044901/EVs-Australia-Taking-Tesla-Model-3-Performance-roadtrip-Sydney-Canberra-Melbourne.html",
    "content": [
        "We took a Tesla on 2,500km road trip over EasterIt did not go as expected, passing off without a hitchThe total fuel cost for the epic journey was just $56It was the first charging stop on the very first interstate trip in our new Tesla, and already the touchscreen technology was defeating me.",
        "I just couldn't get it to work. I'd make my selections, wave my credit card - but every time, my bid to refuel was foiled. The queues were huge, the stress was unbearable. Eventually I gave up on the computerised self-service at McDonald's and went to the counter to order our burger and fries in person instead. Outside in the Macca's car park though, our Tesla Model 3 Performance was happily plugged in and recharging without a single problem.Contrary to everyone's expectations, including our own, the doomsday decision to go on a 2,500km EV road trip over Easter went off without a single hitch. Not one.",
        "Almost everywhere we went, we simply pulled up and plugged in, bar one recharge at Wodonga where we had to wait five minutes for a Tesla Supercharger spot on Easter Sunday.A few minutes later - just enough time for a leisurely toilet stop and a coffee, or even a quick burger and fries - and we would be back on the road again.",
        "There's no key. Your phone, your watch, a Tesla swipe card or even a ring opens the car and lets you drive it instantly. You don't turn it on or off and it locks itself when you get out.The door handles are an IQ test. You push one end with your thumb then grab the other end in your fist. You push a button to open the door to get out.Filling up the windscreen washer fluid is the only real servicing. There's no gearbox, engine oil or filter, spark plugs or radiator. Battery coolant and brake fluid levels need checked every couple of years or so.The glovebox and almost everything else is controlled by the touchscreen and that's not as painful as it sounds.The roof is glass and yes it does get very hot in Australian summers, but you can buy cheap sunshades for it. You can drive just using the accelerator. Regenerative braking uses the speed of the car to recharge the battery and slow the vehicle down, so you rarely touch the brake pedal, meaning the brake pads and discs last much longer.",
        "The entire fuel cost of the trip was almost the same price as our Good Friday Macca's feed, coming in at $56 for the whole 2,500km. In my old Audi S3, the same trip would have cost at least $400.",
        "Don't get me wrong. Australia is just at the start of its EV revolution. There is a long, long way still to go.While we travelled 2,500km, almost all of it was on the best-serviced EV roads in the country, from Sydney to Yass, to Melbourne to Beechworth, to Canberra and back to Sydney.Plugshare - the go-to phone app for EV drivers, with location details of all Australia's charging stations and whether they're available, broken or busy - tells me there are more than 100 charging stations on or near the main highway between Sydney and Melbourne.Each one of those charging stations can have up to a dozen chargers, which can be of varying speeds from slow trickle charging to superfast 350kw zappers.To avoid any recharge woes, we topped up every 200km or so without incident. Staying at a friend's remote farm near Yass, we simply plugged it in overnight at a neighbour's barn (to protect it from a rowdy herd of hoon steers). Easy.I'm the first to admit it's not exactly crossing the Nullarbor from Adelaide to Perth, or taking the Gregory Highway from Cairns to Darwin.But after almost 30 years in Australia, I've yet to drive either route in a petrol-powered car, so I'm not rushing to do it in a Tesla (although others have successfully EV'ed the Nullarbor.)",
        "The fact is, driving EVs in everyday city life - which, to be honest, is what about 90 per cent of the country does most days - is not just possible, but easy.Every morning I wake up with a near-full tank which will give me 400km-plus of real-world driving before I'm down to about 10 per cent and have to think about recharging.If there's a fast charger nearby, you can pump in enough power to take you another 100-200km in about the same time as it takes to fill the tank of a petrol car.That's one of the first things you learn in an EV - charging times are not linear. ",
        "The first question I'm always asked is how far will the Tesla go. 'Far enough', is the simple answer.The second question is always how much does it cost to recharge.My Tesla battery is about 82kwh. Our electricity at home is currently 31c/kw. To fill it up to 90 percent from empty (which you don't really do) would cost about $21 for about 450km range.Usually I top it up by about 10-15 per cent, back to 90 per cent, once or twice a week, which costs under $5. If you have solar power, you can effectively charge it for free.At a charging station, you'll pay between 40c to 66c/kw to charge up, depending on the company and how fast the charger is - chargers rate from 350kw down to plug-in home chargers at 2kw. Several rival firms are now developing their own charger networks and Tesla have even started opening up some of their Superchargers to other EV cars. But there is also some free charging.NRMA are working with the government to get chargers every 150km on Australia's main highways and drivers can currently power up for free at many of their charging stations while the rollout is underway.Some finance companies are also doing deals with charging companies. Pepper Finance gave me a year's free charging on the Evie charger network - which kept the cost of our roadtrip down to just the $56 we spent to top up at a couple of Tesla Superchargers.And many hotels, pubs and wineries will also often offer free charging as a courtesy to lure in new customers.",
        "It can whip up to 60-70 per cent in next to no time, but then slows down to 80, slower still to 90 and you can watch a sitcom episode in the time it takes to get from 90 to 100.It's a bit like loading luggage into a jumbo jet - baggage handlers can easily pack it two-thirds full, but then they'll need to start re-arranging things more carefully if they want to fill it up.As a result, there is an EV etiquette. When you stop at a busy charging station, you're only expected to charge up as much as you need to get to your next power-up, and then move on and let the next car in.Tesla's sat nav (or mobile phone app, ABRP) will automatically work out all the route maths for you and tell you the optimum charge level and best chargers on long trips.One boomer EV driver waiting for a charge left me in no doubt about the etiquette as I passed the 84 per cent level while recharging at a servo in Tarcutta, in southern NSW.She passive-aggressively stood behind our car in her Bunnings hat, tapping the charging station screen, looking around exasperated, sighing and scratching her head to get her message across.",
        "Annoying as it was, she was right however. There is an equation where time taken to recharge vs overcharging vs time saved by speeding (which drains the battery more quickly) means sticking to the speed limit and shorter but more frequent recharges is actually the quickest on long trips.And you get to see and explore new spots - we found the excellent Fowles winery while on a sideroad to recharge in Avenel, two hours north of Melbourne.But the rest of the time - which is 90 per cent of my driving - you can enjoy the breathtaking performance of electric vehicles, which is where I came in.I'm more of a revhead than a greenie - but thankfully my wife is actually nice. She's far more environmentally-friendly and encouraged me to snap up the Tesla.For her, it's kinder on the world over its lifetime (although it takes a few years to compensate for the rare mineral mining etc) and she loves the design.For me, it was a way to avoid paying $2.50-a-litre for petrol back in April 2022 when I first ordered it - and then waited 10 months for it to actually arrive.Oh, and my new ride can get from 0-60mph in 3.1 seconds. For comparison, an F1 car takes 2.8 seconds. Yup, it's supercar fast. Hypercar fast. Necksnappy fast.",
        "The EV market in Australia is still tiny and Tesla dominates, but there are other options out there.I had actually ordered a Polestar - an offshoot of Volvo - before test driving the Tesla and changing my mind.Even its fastest version is much slower than an M3P but the Polestar 2 is very much like a traditional luxury sedan inside, with similar build quality to brands like Audi and BMW.MG are the next biggest players in Australia after Tesla and come in at the budget end of the market, but now compete with fellow Chinese firm BYD.Korean firms Hyundai and Kia are big players in EVs globally and Kia's GT6 is a stunning car for its price.European brands have been slow to arrive in Australia but Mini, Volvo and Fiat now have electric versions and VW and Ford are expected to bring their latest EVs Down Under soon.At the other end of the market, Audi's e-tron is spectacular but has been overshadowed by the simply superb Porsche Taycan, while BMW has started taking orders for its electric SUV iX.Delivery times now vary from some pre-optioned Teslas and Polestars available within days while other brands can face a wait of up to a year.",
        "You'd have to spend at least half a million dollars to buy a stock petrol car that can match my Tesla (but that doesn't seem to stop utes trying. It's always utes, and usually Ford Rangers. Go figure...)While I have the top of the range Model 3, even the entry level Tesla is quicker than most petrol GTIs, hitting 100km/h in 6.1 seconds for about $65,000 - and 4.4 seconds for the dual motor long range version at around $75,000.In truth though, while the $95,000 Performance model has racetrack stats, even with its upgraded wheels, tyres, brakes and suspension, and 260km/h top speed, it's not racetrack-ready.It's superb on the highway and surefooted and elegant on the country roads of northern Victoria - but it's not a race car, despite being quicker off the mark than a weekend track star like a Porsche GT3 (which is four times the price).It's almost two hulking tonnes of metal and battery - and when you push really hard, it handles exactly like that. To put those silent 527bhp of electric motors - all zoom, no vroom - through their paces properly on a racetrack requires major suspension and brake upgrades.But on a 2,500km interstate road trip, it was blissful. On the freeway, adaptive cruise control and autopilot steering see the miles fly by, literally effortlessly.On the backroads, the underfloor batteries makes the centre of gravity low with almost no body roll through the bends, while the regenerative braking keeps the suspension taut and perfectly poised - and even recharges your battery as you drive too.I've been lucky enough to own or drive some amazing cars - the Audi S3 was the best car I'd owned since my 16v Golf GTI, but there's been Lotuses, Lancias, Jaguar XKs, MG Turbos, Alfa Romeo Cloverleafs and BMW Ms along the way.",
        "None of them even comes close to the experience of driving my Tesla. Against all the odds - and I was seriously concerned about the build quality and refinement of the Tesla - it's surprisingly the best car I've ever owned.But that burger at Sutton Forest Macca's on Good Friday was also pretty good too - once I finally got it. Bloody technology...",
        "While the Tesla might be the best car I've ever owned, buying it was the worst new car experience I've ever had.Tesla don't really have showrooms like conventional car dealers. You can book a test drive and a 'sales advisor' will hand you the swipe card 'key' - and encourage you to put your foot down!But the ordering is all done online, along with almost all communications and even trade-ins.Last year there was a huge backlog in deliveries and I was warned it would take six to nine months for my car to arrive.In the end, it was 10 months and four days of refreshing the order update webpage every hour until I finally took delivery. But the weekend before I took ownership, Tesla suddenly slashed the trade-in value of my old car by almost a quarter without warning when all my finance was in place - and virtually no time to sell it privately.Even trying to get someone to talk to about that was almost impossible and their vague promises to address the issue were never followed through.In the end, a relative saved the day by snapping up my old car for close to the value Tesla had originally put on it - but not before I had to completely refinance and scramble to get the paperwork all done in time.As a final kicker, Tesla only give you a maximum of three days from their delivery date to collect the car or they'll just cancel your order and resell it - even if you've waited 10 months and four days for it... Yeah, thanks Elon. Top tip - sell your car privately."
    ]
}