{
    "articleURL": "/sport/tennis/article-12043657/MIKE-DICKSON-Emma-Raducanu-missing-Wimbledon-wrist-ankle-surgery-blessing.html",
    "content": [
        "Emma Raducanu has been ruled out of both Wimbledon and the French Open The British tennis star has been forced to undergo surgery on both her hands She said it 'pained her' to miss out on the tournaments due to the wrist injury Seeing the picture Emma Raducanu posted of herself yesterday from a hospital bed, it was tempting to think that it was the happiest she has looked for a while.",
        "The smile almost suggested as much, but of course that cannot be the case because for any tennis player to miss the next three Grand Slams — including Wimbledon — is a crushing blow.Nonetheless, there may be a part of her which is at least relieved that something decisive has been done when it comes to fixing her body, which has been repeatedly breaking down under the strain of trying to compete on an unforgiving world tour.The image dispensed to her 2.5million Instagram followers was accompanied by that of an immaculately handwritten note, which would have quietly satisfied the teachers at her girls’ grammar school.In addition to telling of the bones at the bottom of each hand which are being attended to, she nonchalantly added that, while she was at it, she would be having a similarly minor procedure performed on her ankle.",
        "That tells of the assorted physical problems Raducanu has had since she burst on to the scene and, incredibly, managed to win the US Open less than four months after completing her school education. Progressively, the whole experience of trying to live up to that has become less fun.It culminated in a monosyllabic encounter with the media prior to her pulling out of the Madrid Open last week, a withdrawal which saw Raducanu drop out of the world’s top 100.",
        "Around that time it had been concluded by specialists that the best way forward was to operate. There would be no more trying to play through with the handicap of not being able to put in the requisite training hours.That dawning realisation perhaps explains last week’s uncharacteristic terseness.It seems the player herself had already concluded that stopgap measures were not working. At the Miami Open on March 22 she had said, ‘the current solutions aren’t very viable long-term’, admitting it had all become ‘annoying and frustrating’.Appearances backed that up. So had the various reports from places such as Roehampton’s National Tennis Centre that she had become a more withdrawn and solemn figure, compared to the carefree days when she was just another little-known British hopeful. So although nobody wants a period on the sidelines — least of all at this time of year — a bright lining around the cloud is the chance to reset.That is provided the initial diagnosis proves correct and that Raducanu’s problems are very fixable, not at the more drastic end of wrist problems afflicting tennis players.Watching from the sidelines and going through the painstaking rehab process — likely to take several months — may offer some respite from coping with the upheaval to her life and some valuable perspective.",
        "The repairs are expected to see her out, minimally, until the early autumn. If all goes well she could play some events at the back end of the year, but it might yet be deemed sensible to wait until the southern hemisphere summer of early 2024.By then Raducanu will be 21, and perhaps ready to take more charge of her own destiny and better chart what works for her, taking good decisions which will shape her career going forward.",
        "This should include continuing with a more settled team around her. You cannot help thinking that if there had been less chopping and changing behind the scenes, she might have avoided some of the dramas of the past year.The prolonged wrist injury, for example, followed a trial period with Russian coach Dmitry Tursunov, who is said to have rapidly increased her workload on the practice court.In the post-US Open period Raducanu has not been able to sustain, month-to-month, the appropriate hours needed to bring about the technical improvements which will see an undoubted natural talent bear its full fruits. A break may see a new appreciation of the tour, for all the stresses it places on young players.Clearly there is no such thing as a good wrist injury in tennis, but it remains possible this will one day come to be seen as one accompanied by a few blessings.",
        "It is safe to say the last ten months have been difficult as I dealt with a recurring injury on a bone of both hands. I tried my best to manage the pain and play through it for most of this year and end of last year by reducing practice load dramatically, missing weeks of training as well as cutting last season short to try to heal it. Unfortunately it is not enough. I’m having a minor procedure done on both hands to resolve the issues. I am disappointed to share I will be out for the next few months and while I am at it I will have another minor procedure that is due on my ankle. It pains me that I will miss the summer events and I tried to downplay the issues so I thank all my fans who continued to support me when you did not know the facts. Looking forward to seeing you all back out there."
    ]
}