{
    "articleURL": "/news/article-12042405/Seattle-boy-5-sister-8-orphaned-parents-killed-distracted-driver.html",
    "content": [
        "Parminder Singh Bajwa and his wife Harpreet Kaur Bajwa were killed in a crashThey left behind a son, 5, and a daughter, 8, who they had been going to collectParminder's motorcycle club is raising money for the children to 'build a future' A five year-old boy from Seattle and his eight-year-old sister were left orphaned after their parents were killed in a head-on collision involving a distracted driver.",
        "The crash happened on Friday afternoon when Parminder Singh Bajwa and his wife Harpreet Kaur Bajwa were on their way to pick up the children from a school bus stop in Kent, a suburb of the Washington city. A driver in the oncoming lane reached for his cell phone and crossed into the couple's path, according to Washington State Patrol.Parminder, a taxi driver, and Harpreet died at the scene and the other driver was airlifted to hospital with life-threatening injuries. The driver has not been identified, and cops have yet to comment on whether they're pursuing charges. A GoFundMe was set up by friends and family to raise money that will allow the children to 'achieve their dreams and build a better future for themselves'.",
        "The crash happened as the couple were heading east along State Road 410, just before 3pm on April 28.'The investigation in this tragedy led to the conclusion that the driver was reaching for their cell phone,' wrote the Washington State Trooper Rick Johnson in a press statement the following day.Parminder was a keen biker and part of Sikh Riders Washington, a motorcycle brotherhood which has now made its mission to support the children any way it can.'We feel responsible for each other, being a brotherhood, and we want to make sure everybody's family is safe and taken care of,' said Kamal Singh, Sikh Riders Washington. ",
        "'They were just a perfect couple,' Sonne Kahlon, Hapreet's cousin, told KOMO News. 'They completed each other. They were the 50/50.'Kahlon said the couple were full of positive energy and had a hospitality which would be missed. 'They were kids at heart, they never took anything too seriously. Everything was light. Life was light,' he added.",
        "'The moment you hear that news, the first thing that comes to your mind is, \"What's going to happen to the kids?\"' said Yashvinder Singh, who started the GoFundMe.On the page, he wrote: 'The fund will be used to ensure that his children have access to the resources they need to thrive, including educational opportunities that will help them achieve their dreams and build a better future for themselves.'We know that their parents would have wanted nothing but the best for their children, and we are committed to making sure that they have the support and resources they need to succeed.'Singh said that the motorcycle club would cover all costs, and that all money raised would be for the children.'We will do everything in our power to ensure that they have the resources they need to thrive despite their loss,' he wrote.'Our thoughts and prayers are with them as they navigate this difficult journey, and we are committed to standing by them every step of the way.'",
        "A funeral service is scheduled for Friday, May 5, in Kent, Washington."
    ]
}