{
    "articleURL": "/femail/article-12045469/Camilla-adopts-blue-royal-colour-ahead-Coronation.html",
    "content": [
        "Queen Camilla, 75, has adopted blue as her royal colour ahead of the CoronationRead more: For all the latest Royal news, pictures and video click hereWhile the late Queen was known for her rainbow spectrum of outfits, it seems Camilla has adopted a slightly different approach to her wardrobe.",
        "For the Queen Consort has been wearing a whole host of tonal blues to significant events ahead of the Coronation on Saturday. Camilla, 75, has worn almost every shade of blue over the last few months as her royal duties ramped up ahead of the big day - from sky blue in Germany to deep navy at Christmas in Sandringham.Meanwhile she also opted for vibrant blue tones for the Commonwealth Day Service in March, the Easter Day service in Windsor, and her royal Coronation portrait alongside King Charles. The decision could be seen as a hint towards her outfit for Saturday's Coronation.",
        "The royal wore a vibrant navy blue for her first Christmas at Sandringham as Queen Consort, and opted for a similarly bright hue for the Easter Day service. Meanwhile she also opted for navy when she visited York for the Maunday Thursday service. And she's also been wearing the colour for her everyday engagements as well - donning blue to mark Holocaust Memorial Day and to host a reception for The Reading Room at Clarence House. Meanwhile earlier this year she also wore blue to mark International Women's Day and World Book Day. She sported a bright blue Fiona Clare dress in a new official portrait with the King, which was released alongside the coronation invitations that announced that the monarch’s wife will be known as Queen Camilla after the historic event.",
        "Then, for their first outing after the King confirmed his wife's new title, to the North Yorkshire town of Malton, Camilla again opted for blue. She donned a pinstriped navy blue blazer and skirt.Camilla wore a sky blue during the King and Queen's visit to Germany earlier this year, donning the colour as she visited Berlin for the couple's first state visit.The monarch's wife has opted for the sapphire hues to show 'reassured confidence' as well as 'nobility and status', a colour psychologist previously told FEMAIL.",
        "Lancashire-based Lee Chambers told FEMAIL that Camilla's decision to wear royal and navy blue outfits following the confirmation of her title suggests she is 'calm and 'composed'.Lee said: 'With Camilla to be crowned Queen, it is no surprise to see her dressed in both royal and navy shades of blue. 'Blue carries a historical symbolism of nobility and status, and this still makes it a strong royal statement colour to this day. 'In addition, blue conveys that the wearer has a calm, reassured confidence, and it's associations with trustworthiness and loyalty are qualities that Queen Camilla will be wanting to send as a message during this time. The expert explained that certain shades of blue have 'emotive ties to a sense of calm and peace, and Camilla will no doubt be wanting to project these values during her public appearances. ",
        "'And finally, the choice of blue often gives us consideration for how an individual is feeling. 'It is likely to suggest that the wearer is feeling reflective and thoughtful, but also composed and grounded, ready for a significant event.'Daily Mail columnist and former British Vogue editor Alexandra Shulman previously remarked on how Camilla has a 'good eye for colour'.She explained: 'She knows a deep blue - like the Vivienne Westwood dress she wore to the London Palladium in 2013 - will bring out the colour of her eyes.'Over the years it also been noted how the Queen Consort seems to have taken style cues from the Princess of Wales.",
        "Like Kate, Camilla is set on using a small handful of go-to designers who can be relied on to crate flattering pieces for her, emphasising her waist in particular.Her favourite designer is Anna Valentine - the courtier behind her delicate dove-grey wedding dress.Kate and Camilla have both kept up with fashion trends in recent times - pussy bow blouses and polka dots, for example - and have been applauded for re-wearing outfits.They are both fans of tailored dresses and coats, however, Camilla will opt for more neutral tones while Kate goes for a pop of colour.",
        "Fiona Clare, a trusted couturier of the new Queen, has said that Camilla has 'found her rhythm' over the years.'She [Camilla] has really found her style and I think she's looking amazing' said Ms Clare. 'She suddenly looks so confident – it just happened from one day to the next.'She told the Telegraph more recently: 'What is important to the Queen is the same as what's important for millions of women, to feel comfortable and confident and always look appropriate.'"
    ]
}