{
    "articleURL": "/debate/article-12061197/GUTO-HARRI-briefed-Boris-Johnson-Charles-good-old-chinwag.html",
    "content": [
        "One of the first things I ever did while working for Boris Johnson when he was London Mayor was to escort him to Clarence House to meet the man who has just been crowned King.",
        "Back then, Boris had no armed detail nor driver, so we took the Tube. It was fast, direct, cheap and set an early pattern that he would be both accessible to the people who elected him and aware of the state of the services he ran for them.He was mobbed on the escalator – and neither he nor I realised we had stepped on a train heading east rather than west. When we did, it was too late to get to the Palace on time. We sprinted from the station to the security gate, and were still sweaty and panting as we were admitted. Prince Charles, as he was then, was unimpressed.Last June, by which time Boris had become Prime Minister, that tense relationship took a dramatic turn for the worse. This newspaper revealed that the future King was highly critical of a core policy of Boris's government: the plan to deport illegal migrants to Rwanda. The then-Prince of Wales described the scheme as 'appalling'.The timing was impeccable. Both men were about to fly to the Rwandan capital Kigali for a Commonwealth Heads of Government summit. The Press, understandably, was febrile.",
        "As Director of Communications at No 10, I did my best to calm things down. But on the flight over, the Prime Minister could not resist a dig at critics of the Rwanda plan, calling them 'condescending'.",
        "He didn't name the Prince, but he didn't need to. The papers spelt it out. Broadcasters also tried to get him to spell it out, but were disappointed. 'They wanted you to use the C-word,' I told him.'What, 'Charles'?' Boris replied.'No, 'condescending'.''Both!' added a Government colleague.By the time the two men met, officials were anxious on both sides.We could not stop cameras from capturing the encounter – but no one could hear the two men's conversation. This lasted about 15 minutes and the pictures gave no hint of any serious discord. Boris briefed that the two had 'a good old chinwag' and 'covered a lot of ground'. What had actually happened, however, was rather less amicable.'I went in quite hard,' he told me at the time, essentially squaring up to the Prince and confronting him about what he – as unelected royalty – had said about the actions of the democratically elected government.Charles had been caught out. Though he tried to play down his criticisms of the policy, Boris pointed out the obvious. 'If you didn't say it,' he told him, 'we both know your people could ring the newspapers and kill the story. The fact they haven't done that says it all.'",
        "Hoping to move on, the Prime Minister sought to compare notes on the speeches they were due to deliver at the summit. Boris was planning an upbeat tribute to the success of so many Commonwealth countries in growing their economies and consolidating their democracies, heralding the potential benefits for them and the UK in a post-Brexit world.",
        "In stark contrast, the Prince was about to argue for a 'deeper understanding of slavery's enduring impact'. It was, he believed, 'a conversation whose time has come'.The PM was appalled. And he warned the Prince in plain English: 'I wouldn't talk about slavery or you'll end up being forced to sell the Duchy of Cornwall to pay reparations to those whose ancestors built it.'Relations never fully recovered – and our new King will be relieved that Boris had left No 10 by the time he ascended to the throne. I'm sharing this, and so much more, in a series of podcasts released this Thursday, because I believe the public deserve to know.Journalists do their best to understand what's going on at the heart of government, in royal palaces, company boardrooms and the HQs of the organisations that shape our world. But the dice is loaded against them. It's hard to know what's truly going on unless you're there. Yet when you are there, you can't share it.",
        "I knew I had to cross a line when I left my journalistic career, having spent 18 years at the BBC, to go and work for Boris Johnson at City Hall in 2008.And I understood from the start that being on the other side of the door was a huge privilege, which is why I've never revealed much of what happened until now.",
        "Governing effectively requires a tight team in a circle of trust. If this is breached, you can't operate. That, by the way, was one of the worst problems in No 10 last year: a total breakdown of trust and discipline.Almost everything was leaked. Some supposedly loyal lieutenants of the Prime Minister were almost verbally incontinent, sharing whatever they could with anyone who'd listen.On one occasion, when I was addressing the crack troops known as 'special advisers', my phone was vibrating in my back pocket as a journalist teased me that she was getting an almost verbatim and contemporaneous account of my comments.So I thought long and hard about sharing what I witnessed at the heart of government for the new podcast. One major consideration is that the team I was part of no longer exists.The man I worked for is writing his own memoirs. Others in the room have clearly contributed to various books now doing the rounds. But my main motive is to try to bring some insight and perspective to a critical period in British politics that most of the media covered through a distorted and often hysterical lens. I did my best at the time to correct inaccuracies, challenge sweeping assumptions and shift a narrative that was stubbornly attached to just one toxic tale, 'Partygate': the claims of lockdown-busting events, some alcohol-fuelled, at No 10 during the pandemic. But this a hard job. Former advisers were on a shameless and relentless mission to bring down Boris and they found strange and willing bedfellows in parts of the Press and TV news.",
        "There is so much more to say about that extraordinary period than who may or may not have been drinking at work. Some of the core assumptions around 'Partygate' were wide of the mark. One serious journalist asked me, when he was clearly well-oiled himself, if Boris had been 'p*****' for his entire premiership. Ludicrous.I thought about writing a book. It gives you space, which allows proper context. You can quote anonymously and hide behind comments attributed to others. But I spent most of my decades in journalism as a broadcaster. I like to animate a story and bring it alive. I always preferred radio to television: it's more intimate, generally more intelligent and – when needed – more immediate.Podcasts take this further still, which may explain their popularity. The latest figures suggest about 400million people listen around the world, and they now have a choice of more than two million shows.At their best, podcasts bring energy, freshness and a spontaneous sincerity to storytelling.The team has combined my reflections from that period with a huge trawl of historical material. This not only takes the listener back in time but reminds them how they felt, too, during that turbulent era.Reliving it all has been strange, traumatic and cathartic. But my overriding ambition has been to take you behind that door and give you a better picture of what went on.",
        "This, I hope, will allow you to come to your own considered judgment on one of the most interesting and impactful politicians in British history, at the helm – as the title of the series suggests – in unprecedented times.Guto Harri was director of external affairs for Mayor of London Boris Johnson from 2008 to 2012 and Downing Street's director of communications in 2022. Listen to the Unprecedented podcast on Global Player from this Thursday"
    ]
}