{
    "articleURL": "/news/article-12042021/RSPCA-warns-owning-poodles-Maltese-crosses-Bichon-Frise-Cavalier-spaniels-dog-breeds.html",
    "content": [
        "RSPCA issues warning about dog breeds Furry canines need careful grooming  Grass seeds also a menace to hairy dogs  The RSPCA has issued a warning to owners of four popular dog breeds who could face the hairy prospect of steep fines if they don't groom their animals properly.",
        "The Western Australian branch of the animal welfare agency released images on Wednesday showing Maltese-cross dog Lucas, who was taken in last month with severely matted fur that was riddled with grass seeds.Vets were forced remove 700g of the tangled hair, which took over an hour.RSPCA Manager Kylie Green said there had been a number of similar cases of neglected dogs. Breeds that particularly require regular washing, clipping and grooming are poodle and poodle crosses, Maltese-crosses and the Bichon Frise, as well as long-haired breeds like the Cavalier spaniel.",
        "'We're seeing more dogs with terribly overgrown coats that point to many months without grooming,' she told Perth Now.'RSPCA WA currently has two Maltese crosses, two Lhasa Apsos and an elderly toy poodle in care who were in such poor condition that we're looking at prosecuting their owners for animal cruelty.'It's not just about looks — when a dog's fur gets long and matted it can lead to discomfort, pain, restricted movement and eye, ear or skin infections.'All dogs require washing and grooming, and ignoring these needs in a high-care breed can quickly become a welfare concern.'Ms Green said grooming is a cost and time commitment that owners need to factor in before getting one of these breeds.",
        "'If you are struggling to care for your animal, reach out to friends, family, or a rescue group like RSPCA WA before things get out of hand,' she said.'Please don't let your pet suffer.'Four-year-old Lucas will continue to be looked after by the RSPCA but will be listed on adoptapet.com.au when he is ready for a new home.Animal cruelty through neglect can attract a fine up to $50,000 or up to five years prison in Western Australia. "
    ]
}