{
    "articleURL": "/wires/ap/article-12054379/Chennai-routs-Mumbai-return-winning-ways-IPL.html",
    "content": [
        "CHENNAI, India (AP) - India great Rohit Sharma earned a dubious batting record as Mumbai Indians lost to Chennai Super Kings by six wickets in the Indian Premier League on Saturday.",
        "Sharma was out for a 16th duck, the most in IPL history, and contributed to Mumbai posting only 139-8. Chennai, on a three-game losing streak, reached the target at 140-4 in the 18th over.In the second game, Phil Salt lashed 87 runs off 45 balls for Delhi Capitals to stun Royal Challengers Bangalore by seven wickets.Bangalore rode Virat Kohli's 50th IPL half-century to 181-4, but Salt drove Delhi with eight boundaries and six sixes to 187-3 in 17 overs.Delhi moved off the bottom of the standings to second to last and mathematically not out of contention for the playoffs. Bangalore and Mumbai squandered chances to break into the top four, while Chennai beat Mumbai at its home ground for the first time since 2010 and climbed to second.Sharma dropped to No. 3 in the order to help his confidence, but he failed to reach double digits for a fourth straight match. He chipped to backward point for a three-ball duck and Mumbai slid to 14-3 in 2.5 overs.",
        "Openers Ishan Kishan and Cameron Green also fell cheaply.Nehal Wadhera rescued Mumbai with his maiden IPL half-century off 46 balls. Wadhera scored 64 off 51 balls, hitting eight fours and a six. He shared key partnerships of 55 with Suryakumar Yadav and 54 with Tristan Stubbs.",
        "But the Chennai bowlers finished on top, etching out three more wickets in the space of seven deliveries. Matheesha Pathirana took 3-15 at the death and Deepak Chahar 2-18.Devon Conway led Chennai's chase with 44 off 42, with support from Ruturaj Gaikwad (30), and Ajinkya Rahane (21). Shivam Dube completed the win with three sixes in an unbeaten 26 off 18 balls.Kohli's 55 off 46 for Bangalore at home helped him cross 7,000 runs in the tournament.Kohli and Faf du Plessis (45) put on 82 for the opening wicket but Bangalore lost its way, notably when Glenn Maxwell was out for a duck to Australian compatriot Mitchell Marsh.Mahipal Lomror's maiden IPL half-century raised Bangalore´s hopes. He took command of the innings after Kohli and scored 54 not out off 29 balls, including six fours and three sixes.But Delhi capitalized on the dew and Salt batted imperiously. Salt reached 50 off 28 balls, and notched his highest IPL score in a romp.Rilee Roussow added an unbeaten 35 and Marsh 26, and Delhi eased to its fourth win in five matches. ___More AP cricket: https://apnews.com/hub/cricket and https://twitter.com/AP_Sports"
    ]
}