{
    "articleURL": "/femail/article-12061433/Australian-OnlyFans-star-Kayla-Jade-says-family-disowned-outed-relative.html",
    "content": [
        "OnlyFans star's account found by family member Said he sent links to the rest of loved ones An OnlyFans star has revealed how her family disowned her when they discovered her X-rated account - but says she's doing great without them.",
        "Kayla Jade, who is in the top 0.1 per cent of creators on the website, first launched her account last year.She decided not to 'hide' it from her friends and family, but also 'didn't throw it in their face', setting up alternative social media accounts to promote her content.But as her popularity grew, her loved ones started seeing her work, which lead to the family disagreement when one '45-year-old male' relative paid to view her content, before sending screenshots to the rest of her family. 'I didn't bother hiding it, wanted to be super successful,' the Australian star explained.",
        "Speaking in a TikTok clip, she went on: 'I didn't hide it, but didn't shove it in their face. As time went on I got bigger and bigger, and people started seeing my stuff'.Kayla added that she could only be found if 'people were being nosy and looking for it' and that her family members that found it must have been 'clicking buttons and following links'.The star added that her mum and sister were 'too scared' to confront her about it, and got her dad to speak to her instead.Surprisingly, her father was 'super supportive' and 'grounded'.But later another family member - who she did not name but said was a '45-year-old man' found her account.",
        "The relative then took screenshots from her account and sent it to a family group chat.  'He didn't need to be so aggressive, he could have just told them,' she added.  'I then got a message from another family member, completely disowning me,' she explained.'They took me off every [social media] platform and didn't speak to me for a year. I was hurt but glad to have that toxicity out of my life,' she went on.Kayla added that she 'used to care' what people thought of her but now doesn't and 'couldn't be happier'.",
        "Later, she bumped into the family member that took the screenshots and confronted him.   'I was fuming, it's just so violating,  I trusted him, thought we had a good relationship'I confronted him about it. He didn't admit it, blamed it on other people, he couldn't handle his actions'.'I think when people have nothing going on in their own lives, they just start drama'.Kayla added that she sees him often as they 'live in the same area' and just 'stares at him'.'The way people treat sex workers is disgusting,' she added.'You think they would try and get us help not ruin our lives. No respect for privacy whatsoever, we're just here earning and living, the last thing we need is people investigating our life '."
    ]
}