{
    "articleURL": "/wires/pa/article-12055137/Council-deeply-concerned-reports-volunteers-arrested-coronation-day.html",
    "content": [
        "A council has said it is “deeply concerned” by reports that volunteers who work on women’s safety were arrested in the early hours of coronation day.",
        "The Metropolitan Police said that at around 2am on Saturday three people were stopped by officers and arrested in the Soho area of central London on suspicion of conspiracy to commit public nuisance.Among items seized were a number of rape alarms, the force said. We are working with the Metropolitan Police to establish exactly what happened, and in the meantime, we are in touch with our volunteers to ensure they are receiving the support they need  Westminster City Council  The Met said it “received intelligence that indicated groups and individuals seeking to disrupt today’s coronation proceedings were planning to use rape alarms to disrupt the procession”.The three people – a 37-year-old woman, a 59-year-old woman and a 47-year-old man – were taken to a south London police station, where they were questioned.The 47-year-old man was also further arrested on suspicion of handling stolen goods, police said.",
        "All three have since been released on bail pending further inquiries.Deputy Assistant Commissioner Ade Adelekan said: “The intelligence we received led us to be extremely worried about the potential risk to public safety.“We are aware of and understand there is public concern over these arrests. However, the matter is still under investigation.”Councillor Aicha Less, cabinet member for communities and public protection at Westminster City Council, said: “We are deeply concerned by reports of our Night Stars volunteers being arrested overnight.",
        "“This service has been a familiar and welcome sight in the West End for a long time and have extensive training so they can assist the most vulnerable on the streets late at night.“We are working with the Metropolitan Police to establish exactly what happened, and in the meantime, we are in touch with our volunteers to ensure they are receiving the support they need.”Night Stars is a part of the council’s night safety campaign.According to the council’s website, Night Star volunteers are “focused on working with the West End’s evening and night-time economy businesses to promote women’s safety and reduce violence against women and girls”.It adds: “The team will provide wider support to anyone who becomes vulnerable due to intoxication to reduce the risk to their safety or prevent them from becoming victims of crime.“The Night Safety volunteers aim to make London’s nightlife safer for everyone.“They provide a welcoming place for all and collaborate to ensure that Westminster’s nightlife remains a safe, inclusive and enjoyable experience for residents and visitors alike.”"
    ]
}