{
    "articleURL": "/news/article-12042069/Fox-News-host-Greg-Gutfeld-defends-ex-colleague-Tucker-Carlson-hall-monitor-critics.html",
    "content": [
        "Gutfeld, a late night show host on Fox, defended Carlson from backlash against a series of videos of him making off-the-cuff remarks on his Fox set Carlson was suddenly fired last week by his longtime employer for reasons that were not immediately made clear but may have to do with the host's behavior Carlson was formerly Fox's top rated host - his termination may have had something to do with material that came to light during Fox's Dominion lawsuit Fox News funnyman Greg Gutfeld came to the defense of his former colleague Tucker Carlson on Tuesday as more behind-the-scenes clips of Carlson's comments are leaked by the press.",
        "Weighing in on a Twitter thread devoted to Carlson's off-air comments, Gutfeld slammed critics coming for Carlson in the wake of his abrupt exit from Fox News.'Apparently everyone understands nonsense banter between segments except for hall monitor failures bitterly chronicling the lives of the far more successful,' he wrote.Gutfeld's defense of Carlson comes after the late night Fox host defended the now axed host against derogatory comments from Fox News colleague Geraldo Rivera last month.Rivera referred to Carlson's 'perverse January 6 conspiracy theory' as 'bullsh**,' to which Gutfeld replied, 'You're a class act Geraldo. A real man of the people.'Despite the somewhat raunchy nature of some of the behind-the-scenes clips of Fox's former highest-rated host currently circulating, the videos do not seem to be grounds for termination. ",
        "In clips that have been making the rounds after being leaked to Media Matters, Carlson is seen criticizing the Fox Nation online platform, for which he produced a significant amount content.'Nobody watches Fox Nation because the site sucks,' said Carlson, adding that the site's failures were a 'betrayal of our efforts.'The video appears to have been shot on the set of Tucker Carlson Today, one of Fox Nation's exclusive shows.'I'm just frustrated with it. It's hard to use that site. I don't know why they're not fixing it. It's driving me insane. And they're like making, like, Lifetime movies. But they don't...work on the infrastructure of the site. Like what? It's crazy. And it drives me crazy because it's like we're doing all this extra work and no one can find it. It's unbelievable, actually,' said Carlson.",
        "'We're like working like animals to produce all this content, and the people in charge of it...they're ignoring the fact that the site doesn't work. And I think it's like a betrayal of our efforts. That's how I feel.'In another video posted by Media Matters, Carlson is overheard exchanging remarks with Fox Nation host Piers Morgan, who is about to interview him.The conversation starts politely with Carlson welcoming Morgan to the company and Morgan saying he's had a positive experience so far, and then changes pace as Carlson delivers what is meant to be a humorous comment about sex.'If we're going to talk about sex, I'd love to hit up some of the fine points of technique, but, you know, but it's your show. It's totally up to you,' said Carlson in jest.Morgan, playing along with the bit, responded: 'We can certainly talk about your sexual technique, especially after your tanning testicle last week,' making reference to a segment Carlson did about the practice of tanning one's testicles as a way to reduce a decline in testosterone levels.'Not mine!' replied Carlson. 'We'll speak in more general terms, but I've got something to add.'In another leaked clip, Carlson, speaking to someone off camera joked that someone's 'girlfriend was yummy,' then said: 'Just kidding, in case this is being pulled off the bird. Hey, Media Matters for America, go f**k yourself! I don't even know what his girlfriend looks like.",
        "'And if I did, I would not find her yummy.'",
        " A recently reported text chain sent from Carlson to one of his producers on January 7, 2021 may provide insight into why Carlson was ultimately shown the door at Fox.An incendiary text sent by Carlson was revealed to the board of Fox News on the eve of its defamation trial last month and reportedly sparked, in part, his shocking exit from the network at which he thrived for years.The texts from Carlson read: 'A couple of weeks ago, I was watching a video of people fighting on the street in Washington.''A group of Trump guys surrounded an Antifa kid and started pounding the living s*** out of him. It was three against one, at least. Jumping a guy like that is dishonorable obviously. It's not how white men fight.'Yet suddenly I found myself rooting for the mob against the man, hoping they'd hit him harder, kill him. I really wanted them to hurt the kid. I could taste it.'Then somewhere deep in my brain, an alarm went off: this isn't good for me. I'm becoming something I don't want to be. The Antifa creep is a human being.'Much as I despise what he says and does, much as I'm sure I'd hate him personally if I knew him, I shouldn't gloat over his suffering. I should be bothered by it. I should remember that somewhere somebody probably loves this kid, and would be crushed if he was killed.",
        "'If I don't care about those things, if I reduce people to their politics, how am I better than he is?'",
        "The New York Times reported that Fox's board was concerned the messages could be made public at trial - a fear that pushed them to agree to the $787.5 million settlement.The board told Fox executives on the day the trial began it was bringing in an outside law firm to investigate Carlson's behavior.The board hired the law firm Wachtell, Lipton, Rosen and Katz to investigate Fox's biggest star. The network has been tight-lipped in its explanation of Carlson's bombshell firing.In a statement last Monday, a spokesman said: 'FOX News Media and Tucker Carlson have agreed to part ways.'We thank him for his service to the network as a host and prior to that as a contributor.'The New York Times report also claims Carlson called one senior Fox News executive a 'c**t', and was disappointed when that was redacted from the official record."
    ]
}