{
    "articleURL": "/news/article-12038549/HSBC-announces-10-3billion-profits-BP-records-4bn-boost-amid-cost-living-crisis.html",
    "content": [
        "Profits at HSBC banking group more than tripled in first three months of the yearAnalysts insisted major reason was huge net gain from increases in interest ratesBanks and oil giants are getting rich on the back of surging interest rates, punishing oil and gas prices and the cost of living crisis, it has emerged",
        "The banking industry stands accused of being quick to hit home buyers and others with higher interest rates on mortgages, loans and credit cards, while failing to offer the benefit of rate rises to savers.On Tuesday, it was revealed that profits at the HSBC banking group more than tripled in the first three months of the year.The group reported pre-tax profits of £10.3 billion for the three months to March 31, which was up from £3.4bn in the equivalent period last year.The increase was driven by a number of factors, however City analysts insisted a major reason was a massive net gain from increases in interest rates driven by hikes in the base rate by the Bank of England and other central banks.",
        "At the same time, energy giants and petrol retailers are making billions from higher oil and gas prices, driven by Russia's invasion of Ukraine.Yesterday, BP announced profits of £4 billion in underlying replacement cost profit between January and March, which was around £500 million more than City analysts were expecting.The increase came during a period that UK motoring organisations accused the fuel industry of profiteering on the price of diesel with retailers taking triple the normal expected profit margin – a figure of 21p per litre.",
        "One of the biggest beneficiaries of the inflated cost of diesel during the first three months of 2023 were the nation's supermarkets.This week, the Liberal-Democrats called for an inquiry into suspicions of profiteering by the major supermarkets, which continue to make billions while millions of customers struggle to put food on the table.",
        "Tesco recently announced adjusted profits of £2.63bn for the 2022-23 financial year. This was down by just 6.9 per cent on the year before, during a period when customers were facing price rises of more than 15 per cent and, in some cases, much more.Separately, Sainsbury's announced a modest 5 per cent fall in profits, taking them down to £690m.It is clear that City investors are confidents the big supermarkets are sailing through the cost of living crunch with the shares in both Tesco and Sainsbury's surging by more than 20 per cent since Christmas.Looking at HSBC, the bank's revenues rose 64 per cent to £16.2bn ($20.2bn), largely fuelled by higher interest rates.The bank's so-called net interest margin, which is the difference between what it charges for making loans to what it pays to savers, rose to 1.69 per cent.As a result, its profits from net interest income rose 38 per cent to £7.18bn ($8.96bn) for the three months, which was up by around £2bn on the same period last year.",
        "This was a substantial proportion of the bank's total profits for the three months of £10.3bn. HSBC also claims to have made a profit of £1.2bn after buying the failed US bank, Silicon Valley Bank, for £1 in March.",
        "Richard Hunter, Head of Markets at interactive investor, explained the profits bonanza, saying a key driver was 'the benefits of a rising interest rate environment.'He said: 'As a result, revenues spiked by 64 per cent to $20.2 billion, underpinned by an increase of 38 per cent to $8.96 billion of Net Interest Income. The NII figure compared to a figure of $6.5 billion the year previous and exceeded estimates of $8.85 billion.'Opposition parties renewed their calls for the Government to close a 'loophole' in its windfall tax on energy giants after BP announced its higher than expected profits.Labour's shadow energy secretary, Ed Miliband, said: 'These enormous profits are the unearned, unexpected windfalls of war.'And the party's leader, Sir Keir Starmer, said Labour wants to use an 'effective' windfall tax to freeze council tax so money is passed on to people.'This is a cost-of-living crisis. It's about choices. Labour is choosing to use those excess profits, use a proper windfall tax and use that directly to help people with the bills that they're struggling with,' he told BBC Breakfast.",
        "The Lib-Dem leader, Ed Davey, is calling for the competition watchdog to start an investigation into whether food retailers put up the prices by more than was necessary.Sir Ed said: 'Under the Conservatives, the cost of the weekly shop is going through the roof while supermarkets are raking in eye-watering profits.'Millions of families risk being overwhelmed by soaring food prices, coming on top of rising bills and housing costs.'British farmers will not see any extra income from these soaring food prices. These food prices benefit absolutely no-one but the supermarket giants.'But the British Retail Consortium said businesses are 'working hard to limit price rises for customers'.Andrew Opie, the body's director of food and sustainability, said: 'Supermarket costs continue to climb in the face of high energy bills, transport costs and labour shortages, as well as higher prices demanded by food manufacturers and farmers.'Retailers are working hard to limit price rises for customers and margins remain squeezed as they compete for market share. To help those impacted by the high cost of living, supermarkets have expanded their affordable food ranges, fixed the price of many essentials and offer support to vulnerable groups.'When the cost pressures facing retailers do eventually ease, retail prices will follow fast as they fiercely compete for market share.'",
        "The HSBC chief executive, Noel Quinn, explained the big profits, saying they showed HSBC's strengths in a rising interest rate environment.The group announced its first dividend to shareholders since before the pandemic in 2019, as well as a plan to buy back shares worth £1.6bn ($2bn) from investors.The BP boss, Bernard Looney, said: 'This has been a quarter of strong performance and strategic delivery as we continue to focus on safe and reliable operations.'"
    ]
}