{
    "articleURL": "/news/article-12046383/Billionaire-Reid-Hoffman-spent-night-Jeffrey-Epsteins-pedophile-island-conviction.html",
    "content": [
        " The LinkedIn co-founder, 55, went to Little St. James on one occasion, according to the Wall Street JournalDocuments also reveal that director Woody Allen attended dozens of dinners with his wife at Epstein's homeReid has admitted that he 'made a mistake' and was led by 'MIT's judgment' in meeting Epstein  Billionaire Reid Hoffman visited disgraced financier Jeffrey Epstein's private Caribbean Island after he was convicted of sex crimes – asking the pedophile billionaire to help raise funds for MIT.",
        "The LinkedIn co-founder and Democrat mega-donor, 55, went to Little St. James – which has been dubbed 'pedophile island' – on one occasion, according to the Wall Street Journal.Epstein allegedly used the $125 million estate to abuse underage girls alongside Ghislaine Maxwell and was convicted of soliciting a child for sex in 2008.Hoffman traveled to the island with Joi Ito, the then-MIT Media Lab director, who had asked Hoffman and Epstein to help raise funds for MIT.Documents also reveal that director Woody Allen attended dozens of dinners with his wife at Epstein's Manhattan townhouse, while the former president of Harvard University, Lawrence Summers, asked the late pervert for help raising cash.",
        "In an email to The Wall Street Journal, Ito confirmed Hoffman attended the island, with other documents revealing that he planned to stay at Epstein's notorious  townhouse in Manhattan in 2014, although this did not happen. Ito said in an email: 'Reid attended a few fundraising events at my request, including one trip to Little St. James, after I confirmed to Reid that Mr. Epstein had been an approved donor target for MIT in accordance with university rules and regulations.'Both Ito and Hoffman had been planning to revisit the island in November 2014, before traveling with Epstein from Palm Beach, to the island and then to Boston.",
        "Epstein did own a Florida mansion, and although the purpose for the trip has not been confirmed, he is accused of assaulting underage girls and young women at the property.Hoffman then apologized for meeting with the convicted sex offender, telling the Journal: 'While I relied on MIT's endorsement, ultimately I made the mistake, and I am sorry for my personal misjudgment,'He also reportedly planned to stay the night in Epstein's townhouse in December 2014, before planning to attend a 'breakfast party' with Epstein and Bill Gates.Hoffman, who is worth $2billion, says his last interaction with Epstein was in 2015, when he invited Epstein to a dinner in Palo Alto.The billionaire added: 'It gnaws me that, by lending my association, I helped his reputation, and thus delayed justice for his survivors.'",
        "Ito resident from his position at MIT after EPsteins 2019 arrest, and apologized for accepting money from him – with the university donating $85k to non-profits for sexual abuse survivors.Epstein's Manhattan mansion sold for $50milion in 2021, with the money going to his victim's compensation fund.The Caribbean Islands have since been bought by billionaire Stephen Deckoff for $60million - less than half of their $125m initial asking price.Documents obtained by the Wall Street Journal also show that former Harvard University president Lawrence Summers asked Epstein for $1million to fund an online poetry project for his wife.",
        "Emails between the pair show them discussing the details in 2014, with Epstein suggesting they meet in Cambridge for dinner.In 2016, a non-profit linked to Epstein donated $110,000 to Summers' wife's non-profit, which develops video content about poetry, according to tax records.",
        "According to the Journal the Oscar-winning movie director Woody Allen, attended dozens of dinners with his wife, Soon-Yi Previn, at Epstein's mansion and invited him to film screenings.They reportedly got together nearly every month in 2014 andf 2015, and also visited the studio of artist Jeff Koons in 2013, and to Sotheby's auction house in 2017.A spokesman for Allen and his wife, Soon-Yi, said: 'Woody and Soon-Yi lived in the same neighborhood as Epstein and were frequently invited to dinner parties at his townhouse.The pair were said to have been such regulars that Epstein's staff knew to prepare a special flourless chocolate cake for Allen.Soon-Yi is the adopted daughter of Allen's movie star former wife Mia Farrow. She and Allen wed in Venice in late 1997, when Allen was 61, and she was 26.Allen was accused of molesting his adoptive daughter Dylan Farrow, but denied that claim, and no criminal charges were ever brought against him.  'There were always other guests at those gatherings. Woody never had a business meeting with Epstein and not once spent time with him without Soon-Yi also being present.'"
    ]
}