{
    "articleURL": "/news/article-12050721/Police-officers-ordered-shave-suing-force-bid-facial-hair.html",
    "content": [
        "Police Scotland will introduce the clean-shaven policy in the coming weeksThe force said it was necessary so that officers can wear protective FFP3 masksPolice officers are threatening to sue their force after bosses introduce new guidelines which could force them to shave off beards and moustaches.",
        "Police Scotland is planning to introduce a new clean-shaven policy for frontline officers meaning hundreds of staff will have to lose their facial hair by the end of the month.The force said it was necessary so officers and staff could wear protective FFP3 masks which require users to be clean-shaven. Four are understood to be taking legal action in relation to the policy.And Scottish Police Federation (SPF) general secretary David Kennedy said it has been 'inundated with complaints' after the policy caused 'considerable angst' among officers.",
        " 'The Health and Safety Executive guidance is that an RPE policy should only be utilised as a last resort and there have been relevant questions raised as to why this policy is now being proposed.'There are serious concerns in relation to the proposed implementation of the policy and its proportionality to risk,' he told BBC Radio Scotland's Good Morning Scotland this morning.The rules, which also cover civilian staff in frontline roles, have been approved by the chief constable and is due to be introduced on May 29.During the Covid pandemic police officers were fitted with specialist masks designed to protect them from the virus.A message posted on Police Scotland's internal website from Assistant Chief Constable Alan Speirs said lessons learned from the pandemic identified that FFP3 masks offered the most appropriate and effective respiratory protection to officers and staff.",
        "He said that while the risk from coronavirus had lowered, wider risks remained to officers and staff attending calls such as fires, road accidents and chemical incidents which required PPE (personal protective equipment) to be worn.Police Scotland's new respiratory protective equipment (RPE) policy will mean that where it can be 'reasonably foreseen' that any officer or member of staff will use an FFP3 mask they should be clean-shaven.This includes all local policing frontline officers, roads policing, firearms and public order officers.",
        "ACC Speirs said in the message: 'The safety of our people remains a priority and it is clear that a single overarching policy on the use of protective masks is required.'There will be exemptions for religious, cultural, disability or medical reasons. In these circumstances, the force is seeking to introduce an alternative type of respiratory protection.Police Scotland has about 17,000 officers and 6,000 staff.It is the UK's second biggest force behind the Metropolitan police.The Metropolitan Police allows beards and moustaches as long as they are not unkemptThe Met's policy says 'beards and moustaches are allowed, but they mustn't look unkempt. Keep them trimmed and smart'.Mr Kennedy said the SPF, which represents rank-and-file officers, was supporting several members who had lodged employment tribunal cases and it had sought legal opinion relating to health and safety, discrimination and human rights.",
        "A Police Scotland spokeswoman said the safety of officers and staff was a priority and the policy was being implemented to protect those on the frontline.She said: 'We are consulting with staff associations and our diversity associations as we gather views from officers and staff ahead of implementing this vital policy to keep our people safe.'Later on Friday, the force said it would carry out a full consultation on the policy.Mr Speirs added: 'We understand the frustrations among those affected on the frontline, but the use of RPE is absolutely necessary to protect officers and staff from serious health risks.'We are listening to a wide range of views on this matter and will undertake full consultation with all relevant staff associations ahead of implementation.'A full human rights impact assessment is also being carried out as part of this process.'"
    ]
}