{
    "articleURL": "/news/article-12039805/Fears-pro-Russian-hackers-disrupt-Eurovision-hacking-broadcasts.html",
    "content": [
        "Senior Whitehall official said biggest worry was hacking of the voting systemNational Cyber Security Centre experts called in after organisers raised alarmREAD: Scouse commentator selected as alternative narrator for EurovisionMinisters fear pro-Russian hackers could disrupt Eurovision by silencing the song contest next week. ",
        "Experts from the National Cyber Security Centre (NCSC) were called in after the Government and Eurovision organisers raised concerns that the competition could become a digital front of the Ukraine war, The Times reports.A senior Whitehall official said the biggest worry was the potential hacking of the voting system like last year, when police in Italy, where the contest was staged, said the Killnet hacker group targeted the first semi-final and grand final. This year's contest, held in Liverpool, will have reinforced cyber-defences by NCSC experts working with the Home Office and the Department for Science.In 2022, Italian police managed to thwart attacks by pro-Russian hackers at the competition in Turin, especially during performances of the Kalush Orchestra, which represented Ukraine and won the contest.",
        "However, ministers still fear disruption during this year's Eurovision. A security source told The Times: 'While it’s possible to be confident that concertgoers will be safe, the cyber side is far more unpredictable.'It is unknown whether British security agencies are acting upon specific intelligence regarding a potential Russian hacker attack. The Kremlin has always denied engaging in cyber-warfare against Western states. A successful hacking attack at the contest in 2019 in Israel saw the national broadcaster's online stream being replaced with footage of explosions, which the Israeli government blamed on Hamas.",
        "The Government and local authorities have spent £14million to host the song contest in Liverpool. According to a source familiar with protecting the show against cyber attacks, the NCSC was 'routinely' helping out with big events like this.Liverpool was chosen to host Eurovision after a public vote, beating Glasgow.Paul Quinn, 32, from the Dingle area of Liverpool, will co-present the song contest finale alongside Brookside actress Claire Sweeney, 52, on Saturday, May 13.The BBC said it will be the first time contest audiences will have the option of listening to an alternative commentary in the host city's regional accent."
    ]
}