{
    "articleURL": "/wires/reuters/article-12048257/Motor-racing-Lots-sporting-buzz-Miami-F1-deliver.html",
    "content": [
        "By Steve Keating",
        "MIAMI, May 4 (Reuters) - With Formula One drivers facing off at the Miami Grand Prix, the Florida Panthers making a surprising Stanley Cup playoff run and Miami Heat facing the New York Knicks in the NBA - there is no shortage of sporting buzz this week in South Florida.But sport fans may have to look to the Panthers and Heat for some genuine excitement, warned Aston Martin's double world champion Fernando Alonso, with the Miami Grand Prix shaping up as another Red Bull victory parade.\"Maybe not too many surprises,\" Alonso told reporters on Thursday. \"If you have the fastest car, you can start a little bit behind and you are still maybe making some moves and overtakes.\"If you are in any other car, as I said we are all within 1/10th so wherever you qualify you are still more or less secure in that position and there are not many overtakes after lap two or three.\"Once again in a league of their own, Red Bull have won every grand prix this season, with three of the four races one-two finishes.While Miami can deliver plenty of Monaco like pizzazz, the action on the track could also be similar to Monte Carlo with precious little overtaking.Double world champion Max Verstappen (93) leads Red Bull team mate Sergio Perez (87) in the drivers standings and a resurgent Alonso a distant third on 60 points.",
        "The weather could shake up the deck, with scorching temperatures forecast for Saturday's qualifying followed by rain on Sunday.The other ace Alonso and team mate Lance Stroll might have up their sleeves is tyre degradation, which the Aston Martins have mastered and may be a major factor in the weekend heat.\"That will be probably the strength of our car so hopefully we can use it on Sunday if there are not many safety cars or not rain or something,\" said Alonso.\"We could see some rain forecast for Sunday so things may change but to not see many overtakes is the nature of Formula One so it should not be a surprise.\"Alonso downplayed Aston Martin's chances of a South Beach surprise but warned other teams not to under-estimate them as they have most of the season,\"Yeah they do every weekend,\" smiled the 41-year-old Spaniard. \"I don't know for us it's just a gift where we are.\"We didn't expect to be in this position so we just race every Sunday calmly without pressure. We are growing as a team.\"We are in a position that we didn't expect with a very fast car.\" (Reporting by Steve Keating in Miami, editing by Pritha Sarkar)"
    ]
}