{
    "articleURL": "/wires/ap/article-12055721/Jockey-Castellano-ends-Derby-drought-Mage-16th-try.html",
    "content": [
        "LOUISVILLE, Ky. (AP) - Javier Castellano was reminded of his Kentucky Derby drought right before the race.",
        "That's all over now.Castellano adjusted on the fly on Saturday, directing Mage to the win at Churchill Downs for the most significant of 5,646 career victories for the Hall of Fame jockey.Bunched in the second group nearing the far turn, Castellano guided the chestnut colt through traffic and into clear space at the stretch. Mage then chased down Two Phil´s, giving Castellano his first win in 16 tries at the Kentucky Derby.\"I feel like I´m on top of the world,\" said Castellano, a 45-year-old Venezuelan rider who had Preakness wins with Bernardini in 2006 and Cloud Computing in 2017. He entered the Hall of Fame that same year.\"If one thing has been consistent in my career, I never give up. ... I always tried to be positive and tried to find the right horse to participate in one of the biggest races in the world.\"",
        "In his breakthrough win, Castellano made the most of a little patience - and a backup plan.The 15-1 morning line choice didn´t make the best break from the gate, even with the Derby field reduced to 18 starters following a string of scratches. That included favorite Forte, who dropped out Saturday morning.Finding a good lane was another matter, but Castellano and Mage kept at it - even as Two Phil´s moved into contention by the final turn and seemingly had control.",
        "Mage moved into second in the stretch and ran down Two Phil´s from the outside, beating him by a length.\"We have a plan A, B, C,\" Castellano said of his strategy. \"When you go to the Kentucky Derby and when you have 20 horses, it´s really, really hard handicapping for anyone. Anything can happen in the race.\"If we break the horse out of the gate, he wouldn´t be in the lead. But the horse, he missed the break. When I miss a break, I´m using my best shot in the race.\"The Derby win capped a big day for Castellano, who also won the American Turf aboard Webslinger. As he savored that victory in the jockey´s room, seeing that 0-for-15 record in the Run for the Roses on TV provided a wake-up call.\"At that moment it gave me so much inspiration and I think, `This is the year,´\" he said. \"I´m going to break it here and win the race. I have a lot of confidence in myself and been describing the race, I´ve been dreaming that (way) for many years. I only needed a little, little opportunity to get it done.\"He also believed something better was ahead in his second mount aboard Mage. The horse finished fourth in the Grade 2 Fountain of Youth at Gulfstream Park before Luis Saez rode him to a runner-up finish to Forte in the Florida Derby.",
        "Saez was aboard Tapit Trice in the Derby and finished seventh. Castellano was back in the pack as well at one point, but his patience with Mage paid off with the horse saving his best for last.Just like ownership expected from the jockey.\"Javi has ridden Go Zapper, Honor Code, Bernardini,\" said Ramiro Restrepo, who helped broker the sale of Mage. \"I mean, these are Hall of Fame horses that are the Michael Jordan, Larry Bird, and Magic Johnson of our sport. So never did I ever think anything other than we were in great hands with having someone with his timing.\"___AP sports: https://apnews.com/hub/sports and https://twitter.com/AP_Sports"
    ]
}