{
    "articleURL": "/tvshowbiz/article-12040339/Heather-Rae-Young-ripped-tone-deaf-documenting-baby-sons-flight-private-jet.html",
    "content": [
        "Heather Rae Young was panned on social media Sunday after offering parenting tips for flying with babies - while riding on a private jet - as she marked her three-month-old son Tristan's first time on a plane.",
        "The 35-year-old TV star took to Instagram on Sunday with the post, which included a photo carousel of the travel day with her family.They included her husband Tarek El Moussa, 41, and kids Taylor, 12, and Brayden, seven, who he shares with ex-wife Christina Hall, 39.The Selling Sunset personality said she had a 'proud mama moment' as the family headed to a real estate event called The Flipping Summit in Scottsdale, Arizona.'Our little traveling boy!!' Young said. 'Took Tristan on his first flight ever ... Tristan did such an incredible job ... he was such an angel.'",
        "The Anaheim, California native offered a 'mom-tip' to her three million followers, regarding how she breast fed the tot during their travels.'I breast fed him on the way up and then again on the way down to help with ear popping,' she said. 'It worked perfectly and then the rest of the flight he just giggled, played and looked around and was so happy &amp; didn’t cry once… he loved the new environment.'He also slept the longest he’s ever slept at the hotel and it was great because in between speaking or in between events I would rush back to breast feed him.'Young and El Moussa wed in October of 2021 following a two-year courtship, and welcomed Tristan earlier this year. ",
        "Young faced heavy criticism in the adjacent comment thread to the post for being out of touch and flaunting wealth.'I love you and think you are an incredible woman, boss, mama and so many other things,' one follower said. 'You radiate positivity and inclusivity. 'BUT, this is tone def af. Private jet with help, is not an accomplishment. It’s straight privilege (and your hard work) but ZERO [percent] relatable.'Another user said: 'Love that it went well but many moms can’t relate to your flight experience on a private jet…..,' while another said, 'Of course it was GREAT. Try flying commercial.'",
        "One user pointed out the drastic differences between a private jet and commercial to Young.'Private jets do not count as \"traveling\" on his first flight,' the user said. 'Once you are surrounded by hundreds of people, petrified your child will scream his head off- is when you can say you traveled.'Another user said Young lacked self awareness with the social media post, writing, 'She can’t help it guys…it’s so hard to be so self absorbed.' One follower criticized Young as being unrelatable with the luxe life post: 'Come on you constantly complain that nursing takes all your time and energy but how many mothers have the luxury of private plane travel, chauffeuring around town, people who style their hair and makeup… you all live privileged lives and want us to relate!?!?!'"
    ]
}