{
    "articleURL": "/wires/afp/article-12058909/African-players-Europe-Milestones-goal-king-Salah.html",
    "content": [
        "Mohamed Salah bagged his 100th goal at Anfield and became the first Liverpool player to score in nine consecutive home games in a 1-0 Premier League win over Brentford at the weekend.",
        "The win, coupled with Manchester United losing at West Ham, kept alive hopes of a top-four finish and Champions League football for the Reds next season.A blunder by goalkeeper David De Gea allowed Algerian Said Benrahma to score the only goal of the match at West Ham.Here, AFP Sport highlights African headline-makers in the major European leagues:ENGLANDMOHAMED SALAH (Liverpool)The Egyptian, who has been voted African Footballer of the Year twice, slammed home at the second attempt from Virgil van Dijk's header to register his 30th goal of the season in all competitions.RIYAD MAHREZ (Manchester City)Mahrez was the creator for both City's goals, scored by Ilkay Gundogan, as the defending champions moved a step closer to retaining their title with a 2-1 win over Leeds. Twice the Algerian cut inside off the right wing before laying perfectly-weighted passes into the path of Gundogan to slot home from the edge of the box.SAID BENRAHMA (West Ham)Benrahma's goal all but guaranteed West Ham's top-flight status for another season as the Hammers beat Manchester United 1-0. But the Algerian had De Gea to thank for his 10th goal of the season as the Spaniard somehow let a weak shot from distance through his grasp.ITALYVICTOR OSIMHEN (Napoli)",
        "The Nigerian international capped the best season of his career by ramming home the penalty -- his 23rd goal in Serie A this term -- which gave Napoli a 1-0 win over Fiorentina in his team's first home match since being crowned Italian champions for the first time in 33 years. Osimhen had scored the goal which sealed the title at Udinese midweek and gave his partying fans more reason to cheer with a strike which makes him the highest scoring African player in the history of Serie A overtaking Liberian legend George Weah.GERMANYSEBASTIEN HALLER (Borussia Dortmund)The Ivory Coast international scored Borussia Dortmund's second goal in a 6-0 thrashing of Wolfsburg. Haller turned in a low cross from Karim Adeyemi on 28 minutes as Dortmund secured a vital win to keep their title hopes alive and remain within a point of leaders Bayern Munich. Haller, who missed the first half of the season following a testicular cancer diagnosis, has scored five goals since his return to action in February.ILHAS BEBOU (Hoffenheim)The Togo striker scored a tap-in as his side beat Eintracht Frankfurt 3-1 to take a huge step toward safety in the Bundesliga relegation fight. Bebou latched on to an Angelino cross to make it 3-0 on the stroke of half-time and take his tally to five this season as Hoffenheim came out fighting with a brilliant first-half performance.",
        "FRANCESEKO FOFANA (Lens)The Ivory Coast international midfielder opened the scoring to put Lens ahead in a crunch Ligue 1 game against Marseille before Belgium's Lois Openda added a second goal for the side from northern France. Dimitri Payet notched a late consolation for Marseille but the 2-1 win propelled Lens into second place behind Paris Saint-Germain, two points ahead of their beaten rivals from the south."
    ]
}