{
    "articleURL": "/wires/pa/article-12042125/Brazilian-police-search-ex-president-Bolsonaro-s-home.html",
    "content": [
        "Brazil’s Federal Police have searched former president Jair Bolsonaro’s home and seized his phone in what they said was an investigation into alleged falsification of Covid-19 vaccine cards.",
        "Several other locations were also searched and six people faced arrest, police said.The former president confirmed the search on his residence while speaking with reporters, as did his wife Michelle on her Instagram account. She said her phone was not seized, contrary to media reports.A federal police official said Bolsonaro will be deposed at Federal Police headquarters and confirmed that one of his closest allies, Mauro Cid, was arrested.Asked about the search of Bolsonaro’s home, the Federal Police’s press office said officers were carrying out 16 searches and six arrests in Rio de Janeiro related to the introduction of fraudulent data related to the Covid-19 vaccine into the nation’s health system. The statement did not name Bolsonaro or Cid.Local media reported that the vaccine cards of Bolsonaro, his advisers and his family members were altered. During the pandemic, he spent months sowing doubt about the efficacy of the vaccine and refusing to get a jab.In September 2021, that prompted doubt about whether he would be able to attend the UN’s General Assembly in New York.“There was no adulteration on my part, it didn’t happen,” he told reporters on Wednesday after the search. “I didn’t take the vaccine, period. I never denied that.”In an interview for Jovem Pan television, Bolsonaro added that his vaccination records were not required for any of his trips to the US.",
        "“The way heads of state are treated is different than for the common citizen. Everything is arranged ahead of time, and in my travels to the United States, I was not at any time required to have a vaccination card,” he said.The search adds to Bolsonaro’s mounting legal headaches. Federal Police have questioned him at their Brasilia headquarters twice in the past month related to separate investigations, about three sets of diamond jewellery he received from Saudi Arabia and his potential role in sparking the January 8 uprising by his supporters in the capital.Bolsonaro is also the subject of several investigations by Brazil’s electoral court into his actions during the presidential election campaign, particularly his unsubstantiated claims that the nation’s electronic voting system is susceptible to fraud.Those threaten to strip him of his political rights and render him unable to run for office in upcoming elections.Separately, Bolsonaro and his allies also face a sprawling Supreme Court-led investigation regarding the spread of alleged falsehoods and disinformation in Brazil, and a federal police investigation for the alleged genocide of the Indigenous Yanomami people in the Amazon rainforest by encouraging illegal miners to invade their territory and thereby endangering their lives.The former president has denied wrongdoing in all of the cases under investigation.",
        "The police statement said the insertion of false Covid-19 data occurred between November 2021 and December 2022, and enabled the people whose vaccine cards were altered to comply with the US vaccine requirement to enter the country.The investigation indicates the objective was related to “ideological agendas” and meant to “sustain the discourse aimed at attacking the vaccine against Covid-19″, the statement said.For months, Bolsonaro insisted the anti-malarial hydroxychloroquine was a treatment for Covid-19, despite a lack of robust medical evidence.At one point, he warned Brazilians there would be no legal recourse against Pfizer for anyone suffering irreversible side effects. He also linked the vaccine to Aids — an assertion rejected by doctors and scientists — prompting a justice of Brazil’s top court to order his comments be investigated.Brazil’s pandemic death toll was the second-highest in the world. A congressional investigation determined Bolsonaro should be indicted for bungling the nation’s Covid response, including him pushing unproven treatments.Bolsonaro recently returned to Brazil after several months in the US, where he mostly kept a low profile aside from a few speaking engagements.This weekend, as he seeks to reclaim his position of influence in Brazil, he travelled to the interior of Sao Paulo state and appeared at a massive agriculture show."
    ]
}