{
    "articleURL": "/wires/pa/article-12060505/Russia-bans-jet-skis-car-sharing-ahead-Second-World-War-commemorations.html",
    "content": [
        "Russia enacted a major security clampdown ahead of Tuesday’s annual commemorations marking the defeat of Nazi Germany in the Second World War, curbing the use of drones and car-sharing services in its largest cities amid its 14-month war with Ukraine.",
        "At least 21 Russian cities cancelled May 9 military parades — the staple of Victory Day celebrations across Russia — for the first time in years, Russian media said.Regional officials blamed unspecified “security concerns” or vaguely referred to “the current situation” for the restrictions and cancellations. It was not clear whether their decisions were taken in co-ordination with the Kremlin.Last week, Russia — which has not witnessed the carnage experienced by Ukraine during the invasion — was rattled by ambiguous official reports that two Ukrainian drones flew into the heart of Moscow under the cover of darkness and reached the Kremlin before being shot down.Media and local officials have blamed other sporadic drone attacks, especially targeting oil depots near the two countries’ border, on the Ukrainian military. Kyiv officials have declined to comment on such claims.The fears of a possible Ukrainian attack appeared real, even though parades will go ahead in Russia’s largest cities, Moscow and St Petersburg. But the use of drones has been banned in both cities ahead of Victory Day.In St Petersburg, often referred to as “Venice of the north” because of its network of rivers and canals, using jet skis in certain parts of the city is prohibited through to May 10.",
        "In the Russian capital, car-sharing services have been temporarily banned from the city centre — drivers will not be able to start or finish rides there – amid preparations for the traditional Red Square parade.Initially, only one foreign leader was expected to attend this year’s Moscow parade — Kyrgyz president Sadyr Zhaparov, who arrived on Monday and met Mr Putin for talks. This was one more foreign guest than last year, when no leaders went amid Mr Putin’s broad diplomatic isolation over the war. The Kremlin said at the time that it had not invited any because it was not a “round-number anniversary”.But on Monday, officials announced that Uzbek president Shavkat Mirziyoyev and Tajik president Emomali Rakhmon would be joining Mr Putin and Mr Zhaparov at the festivities, along with Armenia’s prime minister Nikol Pashinyan and Kazakhstan’s leader Kassym-Jomart Tokayev.Ukrainian president Volodymyr Zelensky said on Monday that he had sent a draft bill to parliament proposing a Day of Remembrance and Victory over Nazism in the Second World War on May 8 and a Day of Europe on May 9, further distancing Kyiv from Moscow.Mr Zelensky equated Russia’s goals in Ukraine to those of the Nazis.“Unfortunately, evil has returned,” Mr Zelensky said on Telegram.“Although now it is another aggressor, the goal is the same — enslavement or destruction.”",
        "The European Union’s Commission president Ursula von der Leyen is due to travel to Kyiv on Tuesday to mark Europe Day with Mr Zelensky."
    ]
}