{
    "articleURL": "/tvshowbiz/article-12039841/Kevin-Costners-wife-Christine-Baumgartner-files-DIVORCE-18-years-marriage.html",
    "content": [
        "Baumgartner, 49, filed for divorce from Costner, 68, on Monday, citing  irreconcilable differencesShe also asked for joint custody of the couple's three children -  Cayden, 15, Hayes, 14, and Grace, 12Costner admitted to feeling 'great sadness' over his wife's decision and is also seeking joint custody of their childrenKevin Costner's wife Christine Baumgartner has filed for divorce from the Yellowstone star after 18 years of marriage and three children together.",
        "The split is said to be due to 'irreconcilable differences,' with Baumgartner asking for joint custody of their kids - Cayden, 15, Hayes, 14, and Grace, 12. Costner filed his response to the divorce on Tuesday, and he is also seeking joint custody of their children. The 68-year-old actor and 49-year-old Baumgartner, a model and fashion designer, started dating in 2000 and tied the knot at Costner's Aspen, Colorado ranch in 2004.'It is with great sadness that circumstances beyond his control have transpired which have resulted in Mr. Costner having to participate in a dissolution of marriage action,' a statement from Costner's rep read.Watch the complete season of Yellowstone available now, only on Stan. ",
        "'We ask that his, Christine's and their children's privacy be respected as they navigate this difficult time,' the statement concluded.Baumgartner is not said to be filing for spousal support, with Costner's response filed by Laura Wasser.'Spousal support to be payable to petitioner pursuant to the terms of the parties' Premarital Agreement,' Wasser said, indicating there is a pre-nuptial agreement between Costner and Baumgartner.TMZ was the first to report the divorce news. Costner was previously married to Cindy Silva from 1978 to 1994 and they share three children - Annie, 39, Lily, 36, and Joe, 35.",
        "He also shares a son Liam Costner with Bridget Rooney, who he dated after his split with Silva. The divorce news comes weeks after DailyMail.com reported new details about Costner's rift with Yellowstone creator Taylor Sheridan.Sources claimed Sheridan developed a 'God complex' which left Costner reportedly frustrated with the development of the hit Paramount Network series.The insider also alleged that Costner was left frustrated at how his concerns over the direction the series was taking were dismissed by Sheridan - saying that the actor, who also serves as an executive producer on Yellowstone - was told to 'stick to acting' when he raised questions about the future of the show. 'Kevin will forever be proud of and grateful for Yellowstone and the cast is like family to him,' the source said of Costner, who recently nabbed a Golden Globe Award for best actor for his portrayal of John Dutton.'He just felt like Yellowstone is headed in a direction that was not in line with their initial vision and he was met with criticism, including that he should just stick to acting.'Adding to the uncertainty around the series is the fact that a date has not been set for when filming will commence for the second half of the latest season, which could be disrupted by an impending writers strike after members of the Writers Guild of America voted to authorize a shutdown over pay issues.",
        "Last month, the New York Post reported that Costner's desire to cut down his workload on the fifth season to focus on other projects was also to blame for the tension between him and Sheridan.'It’s the same as with any show runner and big star — there’s respect, but there’s friction,' a source described as 'well-placed' within the production told the outlet.Costner is currently directing and starring in Horizon, a western film series consisting of four separate movies that will be released three months apart from each other.Each film is close to three hours long and after the quadruple release, Horizon is going to be broken into a series for television - each with 42-minute episodes.Another 'highly placed' Hollywood source told the outlet that some of the blame for the 'friction' on set lies with its creator.'Taylor is the star of his show. He’s the most important person on all of his shows,' they said.Deadline reported in February that Costner wanted to shoot for only a week on the second half of season five, after he had already shortened his work on the first half.The apparent reason was that the actor wanted to focus on his upcoming Western film franchise Horizon.But Costner's attorney Marty Singer shot back after the report and claimed to Puck News that it was an 'absolute lie' that his client would only shoot for a week.",
        "'As everyone who knows anything about Kevin is well aware, he is incredibly passionate about the show and has always gone way above and beyond to ensure its success,' he said at the time.Other inside sources have claimed that Sheridan's lack of preparation has caused major delays with the production of the show - with one suggesting that Costner had made himself readily available to shoot, only for the creator's own 'overburdened' schedule to get in the way.They added that Sheridan was 'overburdened' and 'nothing was ready' even after Costner 'made himself available.They said that Costner was prepared to shoot the second half of the season sometime last year, as well as in January of this year, but there were allegedly no completed scripts to shoot at the time.'Kevin’s been extremely cooperative with working with Taylor and his production company, 101 Studios. They were supposed to shoot the second chapter of Season five late last year, but they just didn’t have the scripts,' a source told the Post.'Kevin had already committed to making his other movies. He had given the producers his schedule. There was nothing to shoot.'There have also been reports that Costner's beloved character John Dutton will be killed off in the back half of Yellowstone's current fifth season.",
        "It's unclear when production will begin on the new episodes for Yellowstone Season 5, or if those episodes will feature the death of John Dutton.Along with tensions with Sheridan, it was also reported last year that Costner's wife Baumgartner was fed up with her husband's demanding work schedule.'It's really knocked a hole in their family life,' a source told RadarOnline. 'The show is such a mega-hit, producers want it to go on forever!'It was further reported that Christine's patience was wearing thin which led to her posing an ultimatum to Costner.",
        "'However, Christine wants her husband to hang up his cowboy hat,' the source divulged.'She wants a firm commitment this is his last season — or he might have to hit the dusty trail!'Meanwhile, Costner has been busy directing his epic Western saga Horizon, a film series consisting of four separate movies that will be released three months apart from each other.Each film is close to three hours long and after the quadruple release, Horizon is going to be broken into a series for television - each with 42-minute episodes.",
        "Yellowstone star Kevin Costner made headlines once again on Tuesday, with news that his wife of 18 years - Christine Baumgartner - has filed for divorce.While the 68-year-old actor is dealing with the divorce from his 49-year-old wife - who share children Cayden, 15, Hayes, 14, and Grace, 12 together - his iconic role as John Dutton on Paramount Network's Yellowstone is also seemingly in danger.There have been reports for months that Yellowstone will be ending after wrapping up the back half of its fifth season.While the back half of Season 5 was originally slated for this summer, it's unclear when filming will actually happen now amid all this drama. Here we break down all of the Yellowstone drama over the past few months, and what it may mean for the future of the hit series.",
        "Yellowstone Ending After Season 5? Reports Swirl that Costner Will Only Film for ONE WEEKThe first reports of drama on Yellowstone came in early February, when Deadline reported that Yellowstone creator Taylor Sheridan and Paramount were plotting the end of the show.The report claimed Sheridan and Paramount were in talks for a new spin-off starring Matthew McConaughey, and that Costner and Sheridan were at odds over his shooting schedule on the back half of Yellowstone Season 5. While Costner originally committed to filming 65 days for Season 5, he only wanted to shoot 50 days for the first half of the season, which wrapped up with the mid-season finale that aired January 1.He then reportedly only wanted to film for one week for the second half of the season, since he's currently directing and starring in his Western epic Horizon for Warner Bros., his first directorial gig in 20 years.Paramount reportedly turned down Costner's proposal and was reportedly moving forward with the McConaughey spin-off in its stead. ",
        "Kevin's Lawyer Denies The ReportCostner's high-powered attorney Marty Singer told Puck News just days after the original report that it was, 'an absolute lie.''The idea that Kevin was only willing to work one week on the second half of season 5 of Yellowstone is an absolute lie,' he said. 'It's ridiculous — and anyone suggesting it shouldn't be believed for one second,' Singer added.'As everyone who knows anything about Kevin is well aware, he is incredibly passionate about the show and has always gone way above and beyond to ensure its success.'A Paramount representative also referred to Costner as an integral part of the show's success when speaking with the outlet. 'As we previously stated, Kevin has been a key component of the success of our Yellowstone series, and we hope that continues from here on out,' they said.That report also revealed the final episodes of Season 5 had not been shot yet, and the network hoped to start filming this summer for a November debut on Paramount Network.",
        "Kevin's Co-Stars Deny Any Trouble on the Set with CostnerYellowstone star Wes Bentley put in an appearance at the SCAD TV Fest in late February, where he brushed off the reports about Costner.'I know that they're still working on… working things out with everyone, to make sure we shoot,' Bentley said.'And I'm confident we will,' he asserted. 'We always have before. I think it's probably a bit of drama over nothing.' Piper Perabo and Lainey Wilson also chimed in on the supposed drama at the Billboard Music Awards in March.' I mean, there's always a lot of drama when it comes to Yellowstone, don't believe everything you hear,' Perabo, who plays environmental activist Summer Higgins, told Entertainment Tonight.Taylor Sheridan knows to play it really close to the vest, and I know better than to speak outside the ranch, but I'm excited to see what happens next,' Perabo, who is married to Yellowstone director Stephen Kay, added.And Wilson, who plays musician Abby on the show, said, 'You know what, I don't know much, but I have a feeling they're going to end it the right way, and there's gonna be more of it,' Wilson said. 'And I'm hoping I'm gonna be back in it!'",
        "Rumors Claim Yellowstone is Ending After Season 5 Due to Disputes Between Costner and Taylor Sheridan Another report from The New York Post in mid-April claimed that the show was coming to an end after Season 5 due to Costner and Sheridan clashing.'It's the same as with any show runner and big star — there's respect, but there's friction,' a source described as 'well-placed' within the production said.Another 'highly placed Hollywood' source suggested that some of the blame for the 'friction' on set lies with its creator. 'Taylor is the star of his show. He's the most important person on all of his shows,' they said.However, the production source said: 'We're hoping it will be worked out. It's too big a show for things not to be worked out.'Hopefully Kevin will return for the remaining episodes, if everyone works together, but it looks like Yellowstone will end after this season.'",
        "R.I.P. John Dutton? Rumors Swirl that Costner's Character May Be Killed Off in a Surprising Fashion Like Succession's Logan RoyJust days after Yellowstone star Dawn Olivieri told DailyMail.com that Costner's John Dutton could be killed off, another report seemed to lend credence to that.A report from Showbiz 411 claimed John Dutton will, 'meet a similar fate' than Brian Cox's character Logan Roy from the hit HBO series Succession.Logan was surprisingly killed off in the third episode of the show's final season, while on board one of his private planes. As for Dutton's apparent swan song, the source claimed Sheridan was working on how to say goodbye to the Dutton family patriarch.'The whole team is down in Texas now meeting, and trying to figure out how to do it. I'm sure Taylor Sheridan has it worked out more or less,' a source claims, adding, 'We all knew Kevin would leave eventually,' the source said.'I think the main show will go on for at least one more season after, they'll have to see how it goes. Remember, this isn't until 2024. A lot can happen,' the source added.",
        "Taylor Sheridan's 'God Complex' Caused Friction Between Him and CostnerJust weeks ago sources told DailyMail.com that Yellowstone creator Taylor Sheridan had developed a 'God complex' that was at the heart of his conflict with Kevin Costner.'Certain people in charge of the production developed a God complex,' an insider revealed.Costner was reportedly left frustrated that his concerns over the show's direction were dismissed by Sheridan. Costner - who also serves as an executive producer on Yellowstone - was reportedly told by Sheridan to, 'stick to acting' when questioning the direction of the popular series.'Kevin will forever be proud of and grateful for Yellowstone and the cast is like family to him,' the source said of Costner, who recently nabbed a Golden Globe Award for best actor for his portrayal of John Dutton.'He just felt like Yellowstone is headed in a direction that was not in line with their initial vision and he was met with criticism, including that he should just stick to acting.'",
        "And Now... a Writer's Strike...Adding to uncertainty swirling around the fate of the back half of Yellowstone Season 5 is the Writers Guild of America strike that went into effect on Tuesday.All movie and TV writers who are part of the Guild must stop all work for any companies represented by the Alliance of Motion Picture and Television Producers (AMPTP), which is essentially every major movie studio, TV network, TV production company and streaming service.The last time the Writers Guild of America went on strike was in November 2007 - a stand-off that lasted 100 days, setting a new precedent for writers being paid for their work being used in 'new media' such as the streaming services that are now ubiquitous.As for Yellowstone, since it's unclear how far Sheridan is in the writing process, it's unknown how the strike will impact the back half of Season 5. With a strike in place, it's possible for production to take place on Yellowstone if the scripts have been completed... but it would bar any further writing on any of the scripts from Tuesday until the strike comes to an end. "
    ]
}