{
    "articleURL": "/wires/reuters/article-12049731/Record-gold-prices-dampen-Indian-demand-June-Sept-quarters-WGC.html",
    "content": [
        "By Rajendra Jadhav",
        "MUMBAI, May 5 (Reuters) - Indian gold demand in the March quarter fell 17% to the lowest level in 10 quarters and is likely to remain subdued even during June and September quarters on record-high prices, the World Gold Council (WGC) said on Friday.The lower purchases in the world's second-biggest gold consumer could limit a rally in global prices, with bullion trading near all-time highs. Falling demand for gold imports could also help to narrow India's trade deficit and support the rupee.Demand during the March quarter fell to 112.5 tonnes as both jewellery and investment demand dropped due to a rally in local prices, which hit a record high of 61,845 rupees ($757.38) per 10 grams on Thursday, the WGC said.\"Softness in demand would be continue for the next two quarters,\" Somasundaram PR, regional chief executive officer of WGC's Indian operations, said .\"It could revive in the last quarter provided monsoon delivers good rainfall.\"Good monsoon rainfall usually leads to higher food grain production and improves farmers' income. Two-thirds of India's gold demand usually comes from rural areas, where jewellery is a traditional store of wealth.India recently celebrated Akshaya Tritiya, the second-biggest gold-buying festival after Dhanteras, but demand during the festival was modestly weaker than the last year, he said.",
        "Higher gold prices have been prompting some people to sell their old jewellery and coins, leading to a jump in scrap supplies, he said.In the March quarter, scrap supplies jumped 25% from a year ago to 34.8 tonnes, the highest in ten quarter, according to data published by the WGC on Friday.India's gold demand in 2023 could be between 750 to 800 tonnes compared to 774.1 tonnes in 2022, Somasundaram said. ($1 = 81.6570 Indian rupees) (Reporting by Rajendra Jadhav; editing by Uttaresh Venkateshwaran)"
    ]
}