{
    "articleURL": "/wires/afp/article-12047497/Five-teachers-seven-killed-Pakistan-school-shooting.html",
    "content": [
        "Five teachers were among eight people killed in rural Pakistan Thursday as a long-simmering row between Sunni and Shiite Muslims erupted into deadly violence, police and officials said.",
        "Two gunmen entered a school in the remote border town of Teri Mangal in Kurram district -- less than a kilometre (mile) from the Afghan border -- as teachers gathered exam papers students had completed earlier in the day.\"They identified Shiite people and separated them before opening fire,\" Muhammad Imran, police chief for the district, told AFP.Officials said five teachers and two labourers were gunned down at the school -- their bodies taken to hospital before carried out in coffins to be buried the same day.The shooting occurred hours after a man from the local Sunni community died in hospital from injuries he sustained after being attacked in his car, said Amir Nawaz, a senior government official in the area.Sectarian tensions stretch back decades and have practically divided the district in two, said Akhtar Ali Shah, a former provincial police chief.",
        "\"There is Shiite population on one side and a Sunni population on the other. Even a minor incident can spark clashes, so caution is always needed,\" he told AFP.Shiite Muslims make up roughly 20 percent of Pakistan's population of more than 220 million, but they are a majority in Kurram district -- part of the former Federally Administered Tribal Areas that were merged with Khyber Pakhtunkhwa province in 2018, bringing it into the legal and administrative mainstream.",
        "\"Teachers were arranging and compiling the papers when the gunmen entered the school,\" Nawaz said.\"These attacks were linked to sectarian violence,\" he added, confirming the death toll from both incidents.Police said authorities were in talks with community leaders in an attempt to restore peace, and a jirga -- a tribal council of elders responsible for settling disputes -- was already underway.Tensions have spiked over the past month, with four people killed in separate shootings, according to an intelligence official who asked not to be named.Also on Thursday, officials said six soldiers were killed in clashes with suspected Pakistan Taliban militants in north Waziristan, another part of Khyber Pakhtunkhwa province.",
        "Pakistan has witnessed rising attacks by Tehreek-e-Taliban Pakistan (TTP) since the Afghan Taliban retook Kabul in 2021.The TTP is a separate movement from the Afghan Taliban, but shares a common lineage and ideology."
    ]
}