{
    "articleURL": "/tvshowbiz/article-12056939/Blind-pianist-Lucy-Illingworth-13-arrives-ahead-performance-King-Charles-Coronation-concert.html",
    "content": [
        "The stars were out in force as they began arriving backstage at King Charles' Coronation Concert in Windsor on Sunday evening.",
        "And Lucy Illingworth, 13, winner of Channel 4's The Piano hit the red carpet alongside mother Candice ahead of her performance.The blind musician looked lovely in a colourful chiffon frock just months after melting the nations heart in the competition to find the UK's best amateur pianist.Lucy's ruffled dress featured sparkles and she completed the look with gold sequinned leggings and boots.The youngster from West Yorkshire, who was born with cancerous tumours in her eyes and is largely non-verbal, left audiences stunned and many in tears with her flawless rendition of Debussy's Arabesque in the series' final. ",
        "Mum Candice said that she decided to put Lucy forward for the competition as she wanted to show others how 'amazing' she was and raise awareness of her condition.She added it had been a 'once in a lifetime experience that neither of us will ever forget' which was 'literally life changing'.Since recording the show, Lucy has been learning more and more pieces by artists including Mozart, Beethoven, Schubert, Irving Berlin, George Gershwin, Duke Ellington and Stevie Wonder.The King and Queen of the royal family will join around 20,000 members of the public at the Coronation Concert to continue the celebrations after their crowning at Westminster Abbey on Saturday.The Coronation Concert will see performances by Paloma Faith, Olly Murs, veteran rock guitarist Steve and Nicole Scherzinger of The Pussycat Dolls.",
        "The show in Windsor, which will be hosted by Downton Abbey and Paddington star Hugh, will start at 8pm on Sunday May 7.Buckingham Palace has promised 'global music icons and contemporary stars' for the big concert.It is certainly set to be the highlight of the second day of coronation celebrations with around 20,000 members of the public are expected to attend.",
        "Classical acts including Andrea Bocelli, Welsh bass-baritone Sir Bryn Terfel and Chinese pianist Lang Lang are also on the bill.Hollywood star Tom Cruise, Dynasty actress Dame Joan Collins, adventurer Bear Grylls, singer Sir Tom Jones and former Strictly Come Dancing professional Oti Mabuse will also make an appearance via video.The series of pre-recorded sketches will reveal little-known facts about the monarch and will also include moments from beloved literary character Winnie the Pooh - seemingly echoing the famous moment Paddington Bear drank tea with the Queen during her Platinum Jubilee celebrations.Nigerian singer Tiwa Savage, DJ Pete Tong with his Ibiza Classics project, and winner of The Piano TV talent show, 13-year-old Lucy, will also perform.Meanwhile, fashion designer Stella McCartney will deliver a spoken word performance with a conservation theme which will reflect her and the King's 'shared passion for environmental sustainability', the BBC has said.",
        "Her performance will be part of a broader nature-themed section of the concert which will also include a rendition of a 1980s hit by classical-soul composer Alexis French and London-based singer-songwriter Zak Abel alongside a house orchestra, band and choir.Bollywood star Sonam Kapoor will also deliver a spoken-word performance.The Coronation concert will air from 8pm on the BBC. "
    ]
}