{
    "articleURL": "/sport/football/article-12044551/PSG-condemn-supporters-gathered-outside-Neymars-house-chant-leave-club.html",
    "content": [
        "Fans were also filmed on Wednesday chanting for the board to resign from rolesThe club said they 'most strongly condemn the intolerable and insulting actions'Messi has been suspended after taking an unauthorised trip to Saudi ArabiaParis St Germain have condemned the actions of supporters who are understood to have gathered outside the home of Neymar and chanted for him to leave the club.",
        "It has been a tumultuous week for the Ligue 1 outfit, who suspended Lionel Messi for two weeks following an unauthorised trip to Saudi Arabia and saw their title hopes hit after a home defeat to Lorient on Sunday.Fans were filmed on Wednesday chanting for the board to resign outside club headquarters before further clips showed a group of supporters visit the home of Neymar and called for him to move on.Messi was also believed to be the target of frustration with fans chanting for the World Cup winner to leave, having recently jeered the Argentine in home matches.'Paris Saint-Germain most strongly condemns the intolerable and insulting actions of a small group of individuals that took place on Wednesday,' a club statement read.",
        "'Whatever the differences of opinion, nothing justifies such actions.'The club gives its full support to its players, its staff and all those targeted by such shameful behaviour.'Reports suggest Messi will leave Parc des Princes at the end of the campaign following two seasons in Paris.He is reportedly of major interest to the Saudi Arabian government, who are said to be preparing the biggest offer in football history to try and lure the World Cup winner to the Middle East. ",
        "It was thought that the fans had arrived at the headquarters to protest Messi's suspension, but, according to The Sun, one chant heard was: 'Messi, son of a b****.'",
        "There was also reportedly swearing aimed at Neymar when the fans gathered outside his house.PSG are five points clear at the top of Ligue 1 but have lost of their last five games with Marseille hot on their tails.They lost at home on Sunday as Achraf Hakimi was sent off, and face Troyes up next in a vital game with the morale of the players, fans and board seemingly at al all-time low."
    ]
}