{
    "articleURL": "/femail/article-12060131/Why-did-royal-ladies-wear-white-Coronation.html",
    "content": [
        "A number of royals and other VIPs were wearing white at Westminster Abbey READ MORE: For all the latest Royal news, pictures and videos click hereThe Coronation saw a selection of stunning ensembles from members of the Royal Family and other VIPs - including ornate homages to the opulence and pageantry of the day.",
        "But many will have noticed that a number of the Firm's ladies opted for ivory and white hues, most notably Queen Camilla and her companions, who made for an ethereal and angelic entrance to the crowning ceremony at Westminster Abbey on Saturday.A new portrait released today shows King Charles III and the Queen pictured with members of the working royal family - and barring Princess Anne, who opted to don her military uniform, all the women are sporting pearly white gowns for the photograph. But is there a reason that the shade - which was also donned by the late Queen Elizabeth II for her own coronation 70 years ago - is so beloved by monarchs? Queen Victoria was a big fan of the colour, wearing a white dress adorned with a golden cloak for her own ceremony in 1838, and even becoming a key figure in popularising white wedding dresses as she wore the shade to her own wedding.",
        "Here, FEMAIL takes a look at why white is such a key hue during the festivities, and the symbolism it carries.WHY IS WHITE SO BELOVED BY THE WOMEN IN BRITISH ARISTOCRACY?The colour white carries connotations of 'purity and divinity', which hence made it favourable to royals who would have evident links to Christianity and God. ",
        "Speaking to HELLO!, fashion stylist Miranda Holder explained that this is 'classic colour psychology'.'The Queen and her maids of honour would wear white 'court dresses' to symbolise the purity and divinity of the Monarch - who was, after all, believed to be appointed by God,' she explained.However the fashion expert added that it's unlikely that guests were this year told to avoid wearing white.She also told the outlet: 'We know from various leaks in the build-up to the big day that the invitations specified day dress or national dress, with no reference to specific colours.'WHICH ROYALS AND SOCIALITES WORE WHITE TO KING CHARLES III'S CORONATION? ",
        "Queen Camilla looked elegant in her Bruce Oldfield couture gown as she was presented with a ring which 'married' her as consort to King Charles on Saturday's Coronation ceremony at Westminster Abbey.The royal, 75, was joined by two elegant companions as she walked alongside her sister Annabel Elliot and close friend The Marchioness of Lansdowne.She had axed the centuries-old tradition of having ladies-in-waiting as part of her retinue last September - instead opting for a smaller number of 'Queen's companions'.It's evident that both have an eye for fashion and aesthetics -  having worked in interior design - as the two women struck the perfect chord between sophistication and glamour with their gowns.",
        "Fiona Clare created two long, ivory dresses for Her Majesty's Companions, designed to complement each other whilst retaining individual touches in terms of the embroidery and choice of fabric.Silver edging features on The Marchioness's, whilst Annabel's has a standing collar and hand-embroidered detail.Meanwhile the Princess of Wales looked radiant in a dazzling ivory Alexander McQueen dress as she attended the King's Coronation alongside Prince William.As she arrived in London, Kate Middleton, 41, was elegant in the stunning silk crepe gown, which featured silver bullion and thread work embroidery featuring rose, thistle, daffodil and shamrock motifs to represent each of the four nations.",
        "Instead of a tiara, the royal mother-of-three wore a matching Jess Collett x Alexander McQueen Headpiece with silver bullion, crystal and silver thread work three-dimensional leaf embroidery.The Princess has long chosen to wear Alexander McQueen for significant moments in her life.And in a touching nod to her late mother-in-law, the Princess wore a set of Diana's pearl and diamond earrings for the occasion.Elsewhere her daughter Princess Charlotte adorably matched her mother in an all-white ensemble.The young princess, who turned eight this week, wore an Alexander McQueen dress and cape in ivory silk crepe with ivory stitch embroidery featuring rose, thistle, daffodil and shamrock motifs, to signify the four nations.",
        "Instead of a tiara, the mother and daughter duo wore matching Jess Collett x Alexander McQueen Headpiece with silver bullion, crystal and silver thread work three-dimensional leaf embroidery.While the pair completed their ensembles with white shoes and swept their locks back into a chic updo for the historical occasion.Sophie, the Duchess of Edinburgh also looked stunning in a regal white Suzannah couture floor-length embroidered gown with a Jane Taylor headpiece and Royal Victorian Order Mantle.The Duchess of Gloucester and Princess Alexandra were both also present - and attended in similarly gorgeous white dresses.WHAT OTHER SYMBOLISM DID THE CORONATION ENSEMBLES HAVE?",
        "One particularly sweet detail in the ceremony were the incredible tributes on the trail of Queen Camilla's Coronation robe. After the crowning and anointing, Camilla and the King emerged in their spectacular Robes of State. Camilla's robe boasts hand embroidery using gold thread and depict meaningful symbols of nature, notably specific insets and flowers which hold special meaning for the couple and the wider Royal Family as a whole.Among the flowers embroidered onto the garment are lily of the valley - which was Queen Elizabeth's favourite bloom, lady's mantle, myrtle, maidenhair fern,  cornflowers, delphiniums and national emblems - the rose, thistle and shamrock.Camilla's new robe, expertly decorated by the Royal School of Needlework (of which Camilla is patron), has also been adorned with bees and beetles to reflect the Royal couple's affection for the natural world.",
        "Fittingly, an earlier insight into Charles' vision of his Coronation - the event invitation - also boasted similar imagery, with depictions of flowers and insects. This natural theme nods to his love of nature, sustainability and climate conservation, as a monarch who has always held preservation of the environment close to his heart.As a champion of sustainable fashion, Charles donned the same Robe of State worn by his grandfather King George VI for his Coronation in 1937, which boasts a 15ft train.And his wife too recycled an old garment, sporting a robe first made for Queen Elizabeth II in 1953 and resized for the ceremony.The velvet on both robes has been restored by the Royal School of Needlework and the lining and gold lace by Ede &amp; Ravenscroft.WHICH OTHER ROYALS IN HISTORY WORE WHITE? ",
        "The late Queen Elizabeth II was adamant her historic 1953 coronation dress - also white in colour - should represent countries from around the world over which she reigned.The richly embroidered satin dress, created by British couturier Sir Norman Hartnell, is regarded as one of the most important examples of 20th century design.It features a lattice-work effect with an iconographic scheme of floral emblems in gold and silver thread and pastel-coloured silks.",
        "The embroideries are arranged in three scalloped, graduated tiers bordered with alternating lines of gold bugle beads, diamantes and pearls.",
        "Sir Norman said the Queen made clear she was unwilling to wear a gown bearing the emblems of all four British nations without those of the dominions where she was also monarch. Queen Victoria's coronation dress was, in contrast, relatively simple - and is more widely remembered for its accessories.According to Royal Central, her 'fashion that day is mostly remembered for the brilliant bits of splendour including crown and jewellery and a brilliant golden cloak: the dalmatica'.However, the monarch was still a fan of neutral tones, as after her proclamation as queen she had changed from the white-and-golden gown into a 'simple white satin dress'."
    ]
}