{
    "articleURL": "/tvshowbiz/article-12039941/Arabella-Chi-flaunts-jaw-dropping-figure-TINY-black-bikini-sun-soaked-Ibiza-getaway.html",
    "content": [
        "She's known for flaunting her jaw-dropping figure on social media.",
        "And Arabella Chi once again sent temperatures soaring on Tuesday as she slipped into a tiny black bikini during her sun-soaked Ibiza getaway.The Love Islander, 32, showed off her toned physique in the skimpy two piece that boasted a triangular top and high cut bottoms with oyster shell buckle detailing.She accentuated her features with a light dusting of make-up and let her blonde tresses cascade down her back.Arabella completed the eye-popping look with a selection of gold jewellery as well as stylish shades on her head.   ",
        "She gazed seductivly into the camera as she showed off her freshly bronzed curves writing: 'Tanned and happy'.Earlier this week showed off her peachy bottom as she soaked up the sun in on her lavish trip.She once again slipped into the sexy two-piece which she paired with necklace with her name on it.She styled her caramel locks on her side and posed for multiple snaps which were posted on her Instagram on Thursday.The reality star captioned her photo and said: 'It's the little things that give me complete wholesomeness swipe to the end some chapters end to make way for even better ones.She added: 'Feels like i never left @atzaro_hotel,' while tagging the hotel she stayed at.",
        "Along with these snaps, Arabella posted a photo of a luxurious meal she had during her visit at the most prestigious hotel, Atzaró Agroturismo.As soon as posted these, fans began commenting underneath the reality star's photo.",
        "One fan said: 'Look at you,' and added a fire emoji. While another complimented Arabella's curves: 'Stunning as always and so fit.' 'It’s never too late to be what you might have been,' chimed in another fan.Another fan commented on her post with rocket emojis.",
        "In the same post, a video of Arabella lovingly kissing and cuddling her dog, which she named Astra, caught the attention of many. As one fan wrote, 'Doggy style,' with a smiling face and love heart eyes. This post comes after the influencer flaunted her incredible physique in a very skimpy khaki bikini, while in LA a week ago."
    ]
}