{
    "articleURL": "/sport/football/article-12051615/The-meal-David-Moyes-BANNED-Manchester-Uniteds-canteen-upsetting-team-stars.html",
    "content": [
        "David Moyes endured an ill-fated 10-month spell as Manchester United manager He struggled to pick up results and garner support from much of the first teamOne particular decision to remove a certain meal from the canteen upset them Following in the footsteps of Sir Alex Ferguson as Manchester United was always going to be tough for any manager.",
        "With 38 honours over 27 hugely successful years, the Scotsman will forever be etched in history as one of the most era-defining coaches.That task in replacing him fell to David Moyes - who was recommended by Ferguson - after he had impressed during 11 years at Everton as the Toffees pushed themselves towards the upper echelons of the Premier League.However, it failed to work out with Moyes dismissed after just 10 months at Old Trafford, having lost 15 of his 51 games at the club.He struggled to win over the players - many of whom had been part of a side that had won a dynasty of trophies during the previous decade - and one decision in particular impacted upon his support base.",
        "Moyes was responsible for suspending one particular meal in the team's canteen at their Carrington training ground while he was at the club - and it was even one of Ferguson's favourites.One of Moyes's first acts upon arriving at Old Trafford in July 2013 was to ban his squad from eating fish fingers, chips and mushy peas.Moyes felt a simple cuisine like this wasn't in keeping with a club of United's stature. This went down like a lead balloon among the players who felt fish fingers, chips and mushy peas were among their favourite meals on offer in the canteen.",
        "When Ferguson was still managing, he would often decline the more refined dishes on offer and make himself a fish finger and mushy peas sandwich instead.As soon as Moyes was sacked in April 2014 and replaced on a caretaker basis by Ryan Giggs until the end of the season, fish fingers, chips and mushy peas were back on the menu.If only all United's problems could be fixed so easily."
    ]
}