{
    "articleURL": "/wires/reuters/article-12039109/Starbucks-sales-estimates-demand-recovery-China.html",
    "content": [
        "By Deborah Mary Sophia and Hilary Russ",
        "May 2 (Reuters) -Starbucks Corp beat Wall Street estimates on Tuesday for quarterly profits, powered by a sharp recovery in business in China, but shares fell about 6% in after-hours trading after the company did not lift its 2023 guidance.With most of China's COVID-19 curbs now scrapped, consumer mobility and spending in the region bounced back sharply in March.Even so, some analysts had expected China sales to remain in the red after tumbling 29% the previous quarter.Instead, the world's largest coffeehouse chain posted a 3% rise in China comparable sales in its second quarter ended April 2, helping boost international sales 7%, more than double the 2.94% increase of the average analyst's estimate, according to Refinitiv data.While the China recovery was better than the company expected, growth in average weekly sales there will be at a more moderate pace in the second half, Chief Financial Officer Rachel Ruggeri said during an earnings call.\"We've already seen it start to moderate,\" she said, noting uncertainty about consumer behavior and international travel. \"So when we take all of that into account, when we look at our guidance for the full year, we believe reaffirming our guidance allows us to continue to convey the momentum, but also for the confidence we have while still navigating a rather uncertain environment globally.\"",
        "Restaurant shares broadly haveoutperformed the S&amp;amp;P 500 Indexthis year, and McDonald's Corp and others reported a strong quarter.Some Starbucks investors may have taken profits after Starbucks' stock jumped 16% in the past five weeks with \"a pretty big run\" into the earnings report, Edward Jones analyst Brian Yarbrough noted.Globally, Seattle-based Starbucks' comparable sales climbed 11%, trouncing analysts' expectation of a 7.36% rise.Customers visited more often and spent more per trip, according to the earnings release. Excluding one-time items, Starbucks earned 74 cents per share, beating estimates of 65 cents.Starbucks, whose customers are typically younger, wealthier and relatively unfazed by inflation, has doubled down on its cold and customizable beverages, boosting traffic in the U.S. and driving a 12% jump in comparable store sales in its North American market.The chain also keeps adding customers to its rewards program, which now has 30.8 million active members in the United States, up 15% over this time last year, according to its earnings release.And it is building more cafes, adding 100 net new stores in North America and more than 360 internationally. (Reporting by Deborah Sophia in Bengaluru; Editing by Arun Koyyur and David Gregorio)"
    ]
}