{
    "articleURL": "/usshowbiz/article-12048957/ADRIAN-THRILLS-best-friend-died-wife-got-cancer-accused-plagiarism.html",
    "content": [
        "Ed Sheeran: - (Atlantic)",
        "Rating:Verdict: Packs an emotional punchThe Lemon Twigs: Everything Harmony (Captured Tracks)Rating:Verdict: In tune with pop classics Given the turmoil he has endured over the past 15 months, it seemed inevitable that Ed Sheeran would respond by writing songs about his anguish.As the UK’s biggest male pop star, he has consistently wooed the nation by translating everyday feelings into insanely catchy chart-pop. This time around, on his sixth album — (Subtract), it’s more personal.The singer’s life has been profoundly changed by a series of hard-hitting events. First came the death, in February 2022, of his best friend Jamal Edwards, a young music entrepreneur who helped launch his career.Then Ed’s pregnant wife Cherry Seaborn was diagnosed with a cancerous tumour and told she wouldn’t be able to undergo surgery until after the couple’s second child had been born.",
        "There have been professional challenges, too, with Sheeran, 32, being accused of plagiarism in two high-profile court cases. Yesterday, a jury in a New York federal court ruled that his 2014 single Thinking Out Loud did not unlawfully copy a chord sequence from the Marvin Gaye soul classic Let’s Get It On. He had threatened to quit music if there was a guilty verdict. That followed a similar copyright battle last year in relation to his 2017 hit Shape Of You — a case Sheeran also won.",
        "Happily, Cherry has since recovered from her operation, with baby number two also arriving safely last May. But the upheavals have left their marks on Ed and his latest songs are informed by grief, loss, anxiety and heartache.Subtract is the final instalment in a sequence of mathematically-titled albums, following + (Plus), x (Multiply), ÷ (Divide) and = (Equals), and it’s quite a departure from its predecessors. Acting on a suggestion from his friend Taylor Swift, he made the album with Aaron Dessner, the American musician who co-produced Swift’s two bespoke lockdown LPs, Folklore and Evermore.Working in a studio on the Kent coast, Sheeran and Dessner wrote 32 songs, with Sheeran pouring heart and soul into the collaboration before whittling the results down to 14 tracks.So, how will fans react to this leap into the unknown? Those expecting a rehash of 2017’s polished Equals, which mixed ballads, rap and rock, will be in for a surprise. Dessner, of Brooklyn art-rock band The National, has largely steered Sheeran away from hummable, TikTok-friendly ear-worms. Those trademark guitar strums remain, but these numbers rely more on piano, strings and subtle synths.A darker tone is apparent from the off. On Boat, Sheeran sings: ‘They say that all scars will heal, but I know that maybe I won’t’, before vowing: ‘But the waves won’t break my boat.’",
        "It’s not the only track to employ maritime metaphors: the waves are ‘tumbling down’ in Life Goes On; he’s ‘fighting the tide’ on Vega, and feeling ‘lost within a stormy ocean’ on Dusty.Sheeran says these songs have opened ‘the trapdoor into my soul’, and several tracks find him processing his pain. ‘It hit like a train,’ he sings on Life Goes On, while End Of Youth sees him grappling with the realities of adulthood: ‘It’s been a long year, and we’re not even halfway there… I guess it’s all part of life, but I can’t help feel low.’Dessner frames these honest, heart-on-sleeve songs with great warmth. Life Goes On is buoyed by strings and mandolin. Curtains is more robust, fuelled by pulsating electronics and guitar. The American’s intimate production touches, on both the folkier tunes and those with full, band-like arrangements, make it sound like Sheeran is in the room with the listener.There are a couple of clunky moments. Colourblind, despite its appealing, 1950s-style doo-wop melody, is a laboured attempt to tether rollercoaster emotions to the colours of the rainbow (‘Some days we’re red, and some days we both think green’). Eyes Closed, which sticks to the hook-heavy blueprint of old, feels oddly out of place; a throwback to Equals.",
        "Most of these songs pack real emotional punch, though. ‘If we make it through this year, then nothing can break us,’ he insists on No Strings, while the superb Dusty recommends playing an old Dusty Springfield record to ‘put some colour into the grey’.With Subtract kept tightly under wraps ahead of today’s release, I’ve heard the album just once, in the office of the singer’s record label, but I suspect these tastefully-crafted songs will gradually reveal their melodic power. Take nothing away from him: Subtract is a triumph.Long Island duo The Lemon Twigs are something of an anachronism. Bored by the music of their mid-20s peers, the D’Addario brothers, Brian and Michael, are in thrall to the sounds of yesteryear, from Broadway show tunes to the chart-pop of the 1960s and 1970s. The legacies of Simon &amp; Garfunkel, Wings and Supertramp loom large.Having announced themselves as teenagers on 2016’s Do Hollywood, they lost focus on 2018’s rock opera Go To School.Their third album, Songs For The General Public, was hampered by the pandemic. Now, with Everything Harmony, they are back on track. Less concept-based, more song-focused, their fourth album reins in their bombastic instincts, and it’s all the better for it.When Winter Comes Around is all finger-picked guitars and sumptuous harmonies. Any Time Of Day — written for an aborted TV show about an imaginary 1970s family band — owes something to The Four Seasons, and there’s a sophistication at play that’s unusual in a band so young. No wonder Elton John and Iggy Pop are fans.",
        "Both albums out today. The Lemon Twigs start a UK tour on May 27 at Chalk, Brighton (ticketmaster.co.uk).NIELSEN: Symphony No. 4 etc.  (Chandos CHSA 5311) Rating:Two of Carl Nielsen’s most popular works make a contrasting programme, played by an orchestra of fellow Scandinavians.The great Dane’s Fourth Symphony of 1914-16 is rugged in many places — and all hell breaks loose in the finale, two timpanists going at each other hammer-and-tongs.Edward Gardner and the Bergen Philharmonic from neighbouring Norway show a good instinct for this music and make the most of the many lyrical, idyllic interludes.But it is the blazing intensity that gives the Symphony the sobriquet ‘The Inextinguishable’ and the performers meet the challenge of a work written at the height of World War I.Nielsen’s own instrument was the violin, which he played professionally, and his Violin Concerto of 1911 has a suitably idiomatic solo part, played here by James Ehnes.It is a quirky work in two movements, each divided into two sections, and in each case it is the second section that is most tuneful; Ehnes is not very individual but plays well.FOERSTER: Symphony No. 1 etc.(Naxos 8.574336)Rating:Like his friend Mahler, Josef Bohuslav Foerster was a German-speaking Bohemian but he enjoyed a much longer life.His wife was one of Mahler’s key singers at the opera houses of Hamburg and Vienna; and the Foersters spent many years in German-speaking centres before returning home.",
        "The First Symphony is a tuneful early work from just before their marriage and it sounds most ‘Czech’ in its Scherzo, relished by the Janacek Philharmonic under Marek Stilec.The Ostrava musicians also give a special flavour to two works from Foerster’s heyday in Vienna, the Festive Overture and the fascinating 1908-10 suite From Shakespeare.Foerster seems to have more sympathy for Lady Macbeth than most of us, but he also finds room for Perdita, Viola and the quarrelling lovers in The Taming Of The Shrew."
    ]
}