{
    "articleURL": "/sport/football/article-12059179/TRANSFER-CONFIDENTIAL-COLUMN-PSG-preparing-Michael-Olise-bid-Newcastle-add-wishlist.html",
    "content": [
        "Paris Saint-Germain are planning a bid for Crystal Palace star Michael OliseMeanwhile, Manchester United aim to bring in Victor Osimhen for £130 millionTo get Transfer Confidential sent directly as a newsletter to your inbox every Monday go to mailplus.co.uk/transferconfidential Hello and welcome to another edition of our transfer newsletter, brought exclusively to you.",
        "My name is Simon Jones and, as well as writing regularly for the Daily Mail and MailOnline, I'm aiming to give you insight, news and the latest chat from across the globe on all the deals taking shape.From Paris Saint-Germain chasing a Crystal Palace star to Newcastle expanding their summer wishlist, it's been a busy week of transfer news.Teams are beginning to look ahead as the 2022/23 season enters its final act, with Manchester United eyeing a £130 million deal for Victor Osimhen.Below, I bring you the latest news from across the globe ahead of the summer transfer window. ",
        "Rangers eye Trusty after impressive loan spellArsenal's Auston Trusty is emerging as the man Rangers want to strengthen their defence this summer.Birmingham City fans, buoyed by today's news that the club have secured new investment from American hedge fund manager Tom Wagner's Shelby Companies Limited, know you can put your trust in Trusty as they named him their player of the year last week.The 24-year-old centre-back only joined Arsenal last year from Colorado Rapids and was immediately loaned out to Birmingham, where he has been almost ever-present this season.Though not the most technical of footballers, Trusty concentrates on defending and is a strong athlete. His performances have been such that he earned a first call-up to the USA side last month. Rangers are keen to get a deal done with Arsenal for around £2million.",
        "The Glasgow club have already agreed to sign midfielder Kieran Dowell who had run down his contract at Norwich City. They have discussed a move for Crystal Palace keeper Jack Butland, who is on loan at Manchester United, but that is still too expensive for their budget. United have also yet to make a decision on whether to offer Butland a deal for next season with Palace holding an option on the 30-year-old's contract.Erik ten Hag still wants David de Gea to sign a new contract and ideally wants new signings in by the start of pre-season, takeover permitting.",
        " PSG plan shock swoop for Eagles starHe has been talk of the Palace all season and now Michael Olise could be strutting his stuff at the Parc des Princes.Paris Saint Germain are ready to make their bid for the Crystal Palace winger after Mail Sport revealed in January that the France U21 international was on their radar.The pending departure of Lionel Messi means they will at least have an extra £740,000 a week in loose change to spend while PSG are also looking to offload Neymar in an effort to reconnect with their fanbase and recruit young French players.They want a centre-back, holding midfielder, striker and two wingers this summer with Olise identified as one of them.",
        "Palace would be loath to lose Olise, particularly with Wilfried Zaha also expected to go, but they have been busy trying to close a deal for Flamengo's 19-year-old Matheus Franca over the past month. Palace sporting director Dougie Freedman was understood to be in South America last week as talks intensify over a fee rising to around £25m for Franca.Olise, though born in Hammersmith, speaks French thanks to his mother. Chelsea and Man United decide Osimhen priceHe has been marvelled at by Atletico Madrid and AC Milan but Chelsea's own 'Captain America' Christian Pulisic is drawing greater attention from Napoli and Juventus.The 24-year-old USA international is one of several players Chelsea are looking to sell this summer before his contract runs down and he is desperate to play more regularly.",
        "Napoli's interest could add extra spice as Chelsea want their star striker Victor Osimhen. Napoli are insisting publicly that the Nigerian is not for sale but the general consensus, at least between Chelsea and Manchester united, is that he is for around £130million. That figure is already too high for Bayern Munich, who are concentrating on Randal Kolo Muani from Eintracht Frankfurt, and it will be a problem for Chelsea under scrutiny of Financial Fair play. They will look at who could be put into an offer for Osimhen with Romelu Lukaku, due back from Inter this summer, another one to consider.",
        "Chelsea have discussed signing Inter Milan's Andre Onana though he is not thought to be goalkeeper favoured by Mauricio Pochettino, who is expected to be confirmed as the club's next manager this week.Tottenham look to poach Brentford technical directorBrentford technical director Lee Dykes has emerged as a contender for a senior role at Tottenham following the resignation of Fabio Paratici.Tottenham, who still hope to appoint Julian Nagelsmann as coach, want a new sporting director and Dykes is one of the names in the frame alongside Johannes Spors. Dykes, 38, has worked in all four of the English league's professional divisions.The main task, once a new coach is in place, will be to ascertain Harry Kane's next step. As Confidential reported previously, Kane is leaning towards seeing out his contract but there have been early soundings from intermediaries on behalf of Manchester United and Paris St Germain. Real Madrid and Bayern are also maintaining a watching brief on the England captain.Meanwhile, Tottenham are the latest club to check on Sheffield United's in-form striker Iliman Ndiaye.Club scouts watched him score his 15th goal of the season against Preston North End last month. Everton also like the 23-year-old.",
        "Nico Williams joins Magpies' wishlist Newcastle United have added Athletic Bilbao winger Nico Williams to their lengthy list of targets but Bayer Leverkusen's Moussa Diaby is off it.",
        "The 20-year-old Williams, with a £50million release clause, was the subject of an offer from Aston Villa in January and has been followed by Arsenal too.Newcastle have the likes of James Maddison, Mason Mount, Declan Rice and Kieran Tierney on their wishlist but with competition fierce and prices even more so, they need alternatives. Spain international Williams is in the mix as is Bayer Leverkusen's Dominik Szoboszlai, who has a £65m release clause, but Diaby has drifted out of contention. Newcastle scouts have been continuing to keep an eye on Blackburn Rovers prospect Adam Wharton though.Barca fighting to keep DembeleAston Villa-bound Mateu Alemany is trying to wrap up a new contract for Ousmane Dembele before he leaves Barcelona.France flyer Dembele, who is friends with Chelsea's Pierre Emerick Aubameyang, has a £45m release clause applicable to this summer so Barcelona are keen to get that cancelled and offer improved terms - if they can fit in yet another financial improvement under current restrictions. Alemany held the first meeting with Dembele's agent last Monday and the 25-year-old winger's deal runs out next summer. Barca, meanwhile, want current consultant Jordi Cruyff to replace Alemany when he heads for Birmingham.",
        "The Cameroonian with dazzling feetHe has dance moves aplenty and earned plaudits for keeping Mo Salah and Antony quiet while playing for Cameroon, now left-back Nouhou Tolo's twinkling footwork is attracting enquiries from English clubs. ",
        "The colourful Seattle Sounders defender started all three of Cameroon's games at the World Cup in Qatar, including their 1-0 win over Brazil, and his MLS club are engaging in discussions to sell him to Europe.",
        "Reims eye Dieng He has won the Africa Cup of Nations with Senegal, was born in Switzerland and keeps goal at Loftus Road but it's not always been a life of glamour for Seny Dieng. The QPR goalkeeper's career path has taken him via the football hotbeds of Whitehawk to Doncaster and beyond. Now the 28-year-old is wanted by French club Reims.Saints surveil speedster Southampton have checked on USA international striker Haji Wright. The speedy frontman featured in all of the USA's games at the World Cup and scored their only goal against Holland. He has grabbed 16 goals in 26 games for Turkish side Antalyaspor this season and that has alerted Southampton who are looking to bolster their attack. Fenerbahce are keen to sign Southampton misfit Mislav Orsic.Guendouzi back in the Prem? West Ham's quest to find a replacement for Arsenal target Declan Rice has led them to spring-haired former 'Gooner' Matteo Guendouzi at Marseille. The feisty 24-year-old has been fighting to secure Champions League football with his club but they were dealt a blow losing to rivals Lens on Saturday. West Ham head of recruitment Rob Newman also looked at Djibril Sow last month, who impressed for Eintracht Frankfurt against West Ham in last season's Europa League.Leeds snap up 16-year-old Leeds United's main transfer business may be on hold as they await their Premier League fate but that hasn't stopped them moving for Hamilton Academical midfield prospect Josh McDonald. The 16-year-old is regarded as an 'explosive talent' by scouting staff and Leeds have beaten off competition from Rangers to tee up a £150,000 deal.Reds yet to bid for Mac Allister Liverpool still have Alexis Mac Allister on their to-do list though they have yet to place an offer to Brighton. The impressive Argentina midfielder is keen to get his future resolved early in the window and Liverpool have had contact with his father. The expected arrival of Jorg Schmadtke, as Liverpool's new sporting director from Wolfsburg, will aid their ambition to add three new midfielders this summer.",
        "United trial Dutch teen Manchester United gave a trial to Salford City winger Kelly N'Mai last week. The 19-year-old Dutchman, who has also had trials at Manchester City previously, has been on loan at Chester. He ran out for United's U21s in their 2-2 draw with Leicester City.To get Transfer Confidential sent directly as a newsletter to your inbox every Monday go to mailplus.co.uk/transferconfidential "
    ]
}