{
    "articleURL": "/wires/ap/article-12039235/Jets-decline-5th-year-option-Bectons-contract.html",
    "content": [
        "The New York Jets declined the fifth-year option on offensive tackle Mekhi Becton´s contract, according to a person familiar with the decision.",
        "It was an expected choice by the Jets, who had until Tuesday afternoon to pick up the option if they chose to do so. It would have cost New York $13.6 million next season - a hefty amount given Becton's injury history. The 2020 first-round pick will now be a free agent after this season.The person spoke to The Associated Press on condition of anonymity because the team didn't announce the move. ESPN first reported the Jets chose to not pick up the option on Becton's contract.The 24-year-old Becton has missed most of the past two seasons with knee injuries after a solid rookie year during which he quickly established himself as one of the game´s promising and physical young left tackles.But the No. 11 overall pick out of Louisville missed 16 of 17 games in the 2021 season after dislocating his right kneecap and had cartilage damage in the knee in the opener at Carolina. While switching to right tackle last summer, he suffered a season-ending chip fracture in his right kneecap during a training camp practice.The 6-foot-7 Becton tipped the scales at close to 400 pounds at one point, but was noticeably slimmer when he spoke to reporters in the locker room the day after last season ended.",
        "\"I´m losing a lot of weight,\" he said. \"As you can see, I look really skinny right now.\"Becton has frequently posted photos of himself standing in front of a mirror throughout the offseason, appearing in terrific shape.\"He´s on track,\" general manager Joe Douglas said last Thursday night after the first round of the NFL draft. \"He´s looking great. So excited to have him in great spirits and he´s looking tremendous.\"Duane Brown is expected to be the starting left tackle again this season, so Becton and second-year lineman Max Mitchell could compete for the job on the right side. New York also drafted versatile Pittsburgh tackle Carter Warren in the fourth round Saturday. Veteran tackle Billy Turner, a former teammate of new Jets quarterback Aaron Rodgers in Green Bay, was also signed as a free agent Monday.___AP NFL: https://apnews.com/hub/nfl and https://twitter.com/AP_NFL"
    ]
}