{
    "articleURL": "/sport/football/article-12042105/Erik-ten-Hag-hails-Jimmy-Murphy-main-person-Man-Uniteds-history-ahead-statue-unveiling.html",
    "content": [
        "Murphy played a key role in rebuilding Man United after the Munich air crashThe 1958 tragedy claimed eight players' lives and left Sir Matt Busby gravely illErik ten Hag has paid tribute to Jimmy Murphy hours before a statue is unveiled at Old Trafford in honour of Sir Matt Busby's former assistant.",
        "Murphy is credited with leading United out of the devastation of the Munich Air Disaster in 1958 which claimed the lives of eight players and left Busby gravely ill in hospital.The Welshman, who had been a pivotal figure in the development of the Busby Babes, took temporary charge and led United to the FA Cup final that season against all the odds. The statute ceremony will take place on Wednesday, 65 years to the day since Murphy led the team out at Wembley.Speaking at the Jimmy Murphy Centre at Carrington, Ten Hag said: 'I think it's very good that the club gives so much honour and congratulations to the main person in the history of Manchester United.'He stands for more symbols: a symbol of youth and youth development. He stands for resilience and determination, and they are the standards for Man United.",
        "'After Munich, a manager and many players fell away. The club was devastated and they bounced back, and this person played the main role. It's totally deserved he gets an honour for this. The Jimmy Murphy Centre, the Jimmy Murphy Young Player of the Year and now this statue - it's fantastic.'I know the culture of Man United, I knew before. Of course, I was long employed in youth football. I met several times Man United in big tournaments in the Netherlands.",
        "'In the past everyone knew and talked about the Busby Babes and the generation of '92. Man United has a big history of youth development and in our talks last year that was one of the points we talked about.'Ajax was the same as Man United in developing young players, giving young players opportunities. There is a pathway to the first-team but they have to deserve it.'"
    ]
}