{
    "articleURL": "/wires/reuters/article-12038117/Jim-Furyk-named-U-S-captain-2024-Presidents-Cup.html",
    "content": [
        "Jim Furyk was named the captain for the U.S. team at the 2024 Presidents Cup on Tuesday.",
        "The biennial event between U.S. and international teams is slated for Sept. 24-29, 2024 in Montreal.Canada's Mike Weir was named captain of the international squad in November.Furyk, a 17-time winner on the PGA Tour, makes his debut as captain. He played in seven Presidents Cups from 1998-2011, compiling a 20-10-3 record, and was a captain's assistant in 2015 and 2017.\"Being selected by my peers to take on the role as captain of the U.S. Team for the 2024 Presidents Cup is truly an honor that I am humbled and excited to accept,\" said Furyk, captain of the victorious U.S. squad at the 2018 Ryder Cup.\"Over the span of several decades this event has evolved tremendously into the global showcase it is today, and I am thrilled to help continue that momentum. So many legendary captains have come before me, so now to be here as the 2024 U.S. Team Captain is quite remarkable.\"Furyk participated in the only previous Presidents Cup staged at The Royal Montreal Golf Club in Quebec back in 2007, posting a 3-2 record in the Americans' 19 1/2 to 14 1/2 victory.\"Royal Montreal holds some unforgettable memories for me, as I know it does for so many other players and fans that witnessed the 2007 Presidents Cup,\" Furyk said. \"The golf course is a perfect setting for match play, and I know the passionate Canadian golf fans will create an amazing atmosphere onsite, delivering an extremely special iteration of the event.\"",
        "The U.S. team has won the last nine Presidents Cups, including the most recent edition in Charlotte, N.C., in 2022 under captain Davis Love III. The international team has not won since 1988 in Melbourne, Australia.Furyk, 52, won the 2003 U.S. Open and was runner-up at the 2013 PGA Championship. He was the PGA Tour's Player of the Year and FedEx Cup champion in 2010 and established a tour record with a round of 58 at the 2016 Travelers Championship.\"Jim has been a role model and a tremendous ambassador for the PGA Tour during his remarkable career,\" PGA Tour commissioner Jay Monahan said. \"And given the role he has played in the growth and success of the Presidents Cup over the last 25 years as both a competitor and a captain's assistant, it's fitting he will bring his leadership skills to Montreal in 2024 where he takes on the role of U.S. Team Captain.\"--Field Level Media"
    ]
}