{
    "articleURL": "/wires/aap/article-12060735/Five-star-Everton-stun-Brighton-rise-Leicester.html",
    "content": [
        "Everton have clawed their way out of the Premier League's relegation zone with a stunning 5-1 win at Europe-chasing Brighton &amp; Hove Albion, while Nottingham Forest followed suit with a rollicking 4-3 home win over Southampton.",
        "With three matches to play that took them both above Leicester City, who lost 5-3 at Fulham in Monday's other game, and Leeds United, while the Saints are now eight points adrift.Everton's start in Sussex was astonishing and the rest of the match barely less remarkable. Winning possession inside the opening minute the Toffees broke and Abdoulaye Doucoure converted Dominic Calvert-Lewin's cross.By halftime Everton, the division's lowest scorers before kick-off, were 3-0 up. Doucoure volleyed in Dwight McNeil's cross after another counter-attack, then McNeil's cross flew in off badly-positioned Albion keeper Jason Steele.Roberto de Zerbi made four changes at the break and Brighton were transformed. The second half was a siege in which Everton's England goalkeeper Jordan Pickford made a string of superb saves.A goal seemed inevitable, but when it came it was for the visitors. This time McNeil and Alex Iwobi combined for the former to score.Almost immediately Brighton finally netted, albeit through a deflection off a prone and unknowing Alexis Mac Allister. But Everton had the final word, McNeill lashing in from a tight angle in the 97th-minute.\"I've always believed there's quality. I've said it many times, but talking about it doesn't win you a game,\" Everton boss Sean Dyche said.\"It's the collective mentality to go and deliver everything you've got.",
        "\"We were very frustrated not to come away with all three points (against Leicester) but we got a reward for carrying on that mentality in their performances tonight.\"Earlier, Fulham, safe in mid-table, on a run of three successive losses, looked ripe for the picking at Craven Cottage.However, 51 minutes into the match Leicester were 4-0 down, conceding to Willian, Carlos Vinicius and Tom Cairney twice.The visitors, for whom Socceroos defender Harry Souttar remained an unused substitute, got a consolation through Harvey Barnes. But after Fulham keeper Bernd Leno saved Jamie Vardy's penalty, Willian restored their four-goal cushion. A successful spot kick from James Maddison, and a second Barnes goal, pulled Leicester back to 5-3.In the final, frantic end-to-end match of a goal-laden day Forest, the only team of the five threatened clubs not to change their manager this season, all-but ended Southampton's 11-year top-flight stay.Southampton, like Leeds on their third boss, dominated the opening exchanges but conceded in the 18th and 21st minutes to Taiwo Awoniyi. The striker converted Brennan Johnson's pass from a swift break, then volleyed in Danilo's flick after Carlos Alcaraz lost possession.Alcaraz made quick amends, profiting from a Morgan Gibbs-White error. Gibbs-White then did the same, scoring from the spot after Ashley Maitland-Niles felled Johnson.",
        "Vojnovic Lyanco headed in a 51st-minute corner to make it 3-2. But Gibbs-White set up Danilo and though James Ward-Prowse scored a late penalty Steve Cooper's team climbed to the heady heights of 16th, three points clear of the drop.\"It's the best feeling in the world, especially when the game is ending like that,\" Gibbs-White told Sky Sports.\"Fair play to Southampton. In the situation they're in, they're still fighting but we showed resilience, stuck together, got the job done and got three vital points.With PA."
    ]
}