{
    "articleURL": "/wires/ap/article-12038177/Opponents-make-ditch-effort-stop-French-pension-law.html",
    "content": [
        "PARIS (AP) - Opponents of a law that would raise the retirement age in France from 62 to 64 are making last-ditch plans to prevent the change that is set to take effect in September.",
        "The country's main labor unions on Tuesday called for another round of nationwide demonstrations and strikes on June 6. May Day protests across France on Monday drew either 800,000 people - that's according to French authorities - or 2.3 million people, which was the estimate given by organizers.France´s top constitutional body is expected to rule Wednesday on a request from opposition lawmakers to start a lengthy process that could ultimately lead to a bill or a referendum to restore the minimum retirement age of 62.With President Emmanuel Macron having demonstrated his determination to press on with the unpopular pension reform, here's a look at the next steps for his government and the plan's opponents.A LONG SHOT AT A REFERENDUMThe Constitutional Council's role is to assess whether the opposition's request over bringing the retirement age back to 62 meets the legal conditions for a potential referendum. If so, supporters would have nine months to collect signatures from at least 4.8 million, or 10%, of voters.",
        "Macron´s government would then be able to choose between sending the opposition's text to parliament for debate and eventually a vote, or waiting for six months to put the measure before voters in a referendum in six months. The proposal would only go to a national referendum if it were not debated by lawmakers.",
        "However, the Constitutional Council rejected a similar proposal in April. The authors have revised the measure to add language stating that a change in the financing of France's pension system is needed.Regardless of what the council decides Wednesday, its ruling would not suspend the law that Macron's government pushed through by using a special constitutional authority to raise the retirement age without a final parliamentary vote.MACRON WANTS TO MOVE ONIn a televised speech last month, the French leader made clear his intention to move on to other topics now that his pension law was enacted.Macron said he heard people´s anger but insisted that the law was needed to keep the pension system afloat as the population ages.He announced negotiations to start this month on \"key issues\" such as improving employee wages, career progressions and working conditions, including for older workers, in the hope these would persuade some unions to get back to the negotiating table.Last week, Macron's government presented its road map for the coming months, with the aim of getting greater support for future bills. Parliament is set to debate a major military bill by the end of the month.Legislators will then examine a government proposal on profit-sharing by companies with more than 11 employees. The proposal is intended to turn into law an agreement that unions and employers´ organizations signed in February.",
        "OPPONENTS' NEXT STEPSUnions argue the higher retirement age erodes hard-won rights for workers. The date they chose for the next nationwide protests is two days before the lower house of France's Parliament plans to debate a legislative proposal to bring back the retirement age back to 62.A group of opposition lawmakers has championed the proposal, which is separate from the one before the Constitutional Council, in the hope that most members from the left and the right would vote in favor. Macron´s centrist alliance lost its majority in the National Assembly last year.Yet there´s no guarantee such move will succeed, because some opposition lawmakers from the conservative party are in favor of the change.In a statement Tuesday, unions said they would work together to issue common proposals to address employee concerns over \"wages, working conditions, health at work, social democracy, gender equality and the environment.\"\"There's deep mistrust, and dialogue can only be restored if the government proves its intention to finally take into account unions' proposals,\" they wrote.Opponents are also expected to stage more \"casserolades,\" or scattered protest actions in which they bang pots and pans to make noise near sites Macron and his government members are visiting.\"We will not turn over a new leaf as long as the pension reform is not withdrawn,\" the head of the hard-left CGT union, Sophie Binet, warned Monday.",
        "___Follow AP's coverage of the French government at https://apnews.com/hub/france-government"
    ]
}