{
    "articleURL": "/tvshowbiz/article-12055813/Ten-releases-new-trailer-MasterChef-hours-premiere.html",
    "content": [
        "Channel Ten has released a new trailer for MasterChef just hours before the new season premiere on Sunday.",
        "The network shared the trailer to Instagram featuring the three judges Andy Allen, Melissa Leong, and Jock Zonfrillo.Jock, whose tragic death last week left Australia and his worldwide fanbase in shock, was seen laughing and smiling along with his co-stars as the song 'Somewhere Only We Know' played over the footage.Season 15 of the show had been due to launch on May 1 but it was pushed back after the Scottish chef was was found dead by police at a Melbourne hotel at 2am last Monday.Channel Ten confirmed it would delay the show with it revealing on Wednesday it would air the series starting Sunday with the support of Jock's family.",
        "'With the full support of Jock Zonfrillo's family, MasterChef Australia will air at 7.30pm on Sunday, 7 May,' read a Channel 10 statement shared to Instagram on Wednesday.'It is with Jock in our hearts that we cherish this season and remember the charismatic and big-hearted Judge and Chef who we knew and loved,' it went on.'Jock will be remembered in the MasterChef Australia kitchen for years to come.'The network added that a special edition of The Sunday Project will pay tribute to Jock from 6.30pm on Sunday before the new series airs. 'With contributions from friends, he held closely, the show will honour Jock by reflecting on his personal and professional life in a celebration of his incredible achievements,' the statement continued.",
        "Production wrapped on the 62-episode season at MasterChef HQ in Flemington, Melbourne, last month.",
        "The new season reportedly cost 'millions' to make, and producers are now looking to add a special 'tribute' episode to Zonfrillo before confirming his replacement.The chef died at age 46, and is survived by his third wife, Lauren Fried, and his four children: grown-up daughters Ava and Sophia, from his first two marriages, and six-year-old Alfie and two-year-old Isla, with Fried.A Victoria Police spokesperson told Daily Mail Australia: 'Police attended a Lygon Street address for a welfare check and located a man deceased about 2am on May 1.   'The 46-year-old man's death is not being treated as suspicious. A report will be prepared for the coroner.' Zonfrillo filmed season 15 alongside fellow judges Leong and Allen, who both pulled out of their scheduled media interviews after his sudden death.Allen and Leong were locked in for several TV and radio appearances last week to promote the launch of the culinary competition.",
        "The publicity blitz had already begun on Monday morning in the hours before the network and production company Endemol Shine had learned of Zonfrillo's death.Channel 10's entertainment reporter Angela Bishop was a guest on The Project on Monday evening - where Zonfrillo was scheduled to appear before his death - and said she had heard his co-stars were struggling to come to terms with the news.",
        "'It is a loss of a member of the family here at 10... [He was] only 46. That is why this is such a shocking piece of news,' Bishop said.'As you say, they would work 16-hour days together for MasterChef. You couldn't find closer work mates and confidantes.'They are devastated. 'Broken' is the word described to me. They are trying to process this news.'Zonfrillo's MasterChef colleagues did not seem to know he died until shortly before the news broke on Monday afternoon, as the publicity machine for the new season was in motion as late as 11.30am when Leong posted a countdown clock for the premiere on her Instagram account.For confidential support call the Lifeline 24-hour crisis support on 13 11 14."
    ]
}