{
    "articleURL": "/wires/aap/article-12049095/Demons-provide-Rowells-Suns-litmus-midfield-test.html",
    "content": [
        "Even without their midfield general Matt Rowell is backing Gold Coast's engine room to match it with \"benchmark\" Melbourne.",
        "How a Touk Miller-less Suns midfield fares against the Demons at Heritage Bank Stadium on Saturday will go a long way to determining their fate.But Rowell thinks his game has developed this year and is keen to test it against an opposition he maintains has every base covered.\"You always look at who's the benchmark in the league and in the midfield they'd be up there,\" Rowell said of the 5-2 Demons.\"We'll do our homework and it's great to be able to go up against them and see what we've got.\"With All-Australian Miller sidelined by a knee injury, the Suns will rotate numbers through the middle to contend with Clayton Oliver, Christian Petracca, Angus Brayshaw and rucking tag-team Max Gawn and Brodie Grundy.\"They've got a lot of weapons in there and complement each other well,\" Rowell said.\"Some good ball getters that go and get it then some powerful players too who can break the line.\"Inside and outside, they're pretty complete.\"The Suns have won two straight games to improve to 3-4 and sit just one win outside the top eight, salvaging some ground after a worrisome 1-4 start.\"We want to go up against the best and test ourselves and this is a great challenge,\" Rowell said.",
        "\"It was sad to see him (Miller) go down and weird last week, the first time not playing with him.\"But (against Richmond last week) everyone in that midfield stood up, rose to the occasion and we're going to have to do that for a lot of the rest of the year.\"Harrison Petty is back for Melbourne following a week on the sidelines with concussion.Lachie Weller (knee) will leave a gap in the Suns' defence while pressure forward Nick Holman and Ben Ainsworth (quad) will also miss the game.Brisbane recruit Tom Berry will make his club debut for the Gold Coast while midfielder Sam Flanders also returns from a knee injury."
    ]
}