{
    "articleURL": "/wires/pa/article-12043509/Lionel-Richie-joins-guests-royal-garden-party-ahead-Coronation-Concert.html",
    "content": [
        "The King and Queen Consort met singer Lionel Richie and other guests as they soaked up the sunny weather at the first traditional garden party of the King’s reign.",
        "Buckingham Palace hosted around 8,000 guests on Wednesday afternoon, where attendees also had the chance to mingle with the Duke and Duchess of Edinburgh, the Duke and Duchess of Gloucester and the Duke of Kent.Guests included “Coronation Champions”, exceptional volunteers recognised for their work by the Royal Voluntary Service, of which Camilla is the president.Richie, who is performing at the Coronation Concert at Windsor Castle on Sunday, met Charles and Camilla who laughed and smiled in separate meetings with the singer.",
        "He told reporters: “This is a once-in-a-lifetime opportunity. To be a part of it is everything.“I’ve known His Majesty for a couple of years, so it’s fun to be here.”Richie, who has been involved with the Prince’s Trust as an ambassador since the 1980s, praised the King’s work.He said: “Believe it or not, he cares. He’s hands on.”Although Richie did not give anything away about his upcoming performance, he said he was “excited” about the event.He said: “Are you kidding me? This doesn’t happen every day. So, am I excited about this? Absolutely. This is not like any other time in life or any occasion.“Once the lights hit and the music starts it’s just going to be magical.“I have to pinch myself. We’re walking in history.”",
        "The King and Queen Consort were in good spirits as they shook hands and chatted with invited guests and charity representatives.",
        "Camilla wore a navy and white Bruce Oldfield dress and Philip Treacy hat, while Charles wore a morning suit with a top hat.Police officers commended for acts of exceptional bravery also attended, alongside Met Police Commissioner Sir Mark Rowley.They included 20-year-old Petra Lopes, who was awarded for her quick action at a shooting last year.Ms Lopes said: “It was such an honour. I can’t wait to tell my friends about it. It was really nice to meet him.”The Queen Consort also met John Aitchison, 99, who was a dispatch driver with the Royal Artillery in Normandy during the Second World War.Mr Aitchison, from Castle Douglas, Dumfries proudly showed photographs of himself from his Army days to Camilla, who congratulated him on his service.There was a light-hearted exchange between the King and one guest who told him they were born on the same day.He quipped: “Really? Surely not. You look younger than me.”The Royal Voluntary Service is a national charity which organises volunteers who support individuals, communities and the NHS in health and social care.Originally founded in 1938 to recruit women into the Air Raid Precautions (ARP) movement, in February 2023 it launched the Coronation Champions awards to honour volunteers from a range of backgrounds who contribute to varied causes.",
        "Winners were chosen by a judging panel presided over by Camilla."
    ]
}