{
    "articleURL": "/wires/pa/article-12048475/Tories-braced-tough-night-polls-close-England-s-local-elections.html",
    "content": [
        "Polls in England have closed with Rishi Sunak’s Tories braced for a tough night after local contests which have been marred by complications due to new photo ID requirements.",
        "Campaigners have reported “countless examples” of would-be voters being turned away from polling stations on the first English elections where photo identification is mandatory.The Electoral Reform Society, which has strongly opposed the introduction, urged ministers to rethink the new law as voters went to the polls in the local elections in England on Thursday.",
        "But the Association of Electoral Administrators said the polls had been “running as smoothly as usual”.The Prime Minister has already conceded it will be a “hard night” for the Tories but insisted they were moving away from “box set drama” politics after the scandal-prone tenure of Boris Johnson and the chaotic collapse of the Liz Truss administration.A Tory spokesman said: “This will be a tough night for the Conservatives. Any Government which has been in power for 13 years is highly likely to lose seats.”The Conservatives have sought to manage expectations by pointing to forecasts by academic experts Professors Colin Rallings and Michael Thrasher which suggest they could lose more than a thousand seats if things go badly.The Tories will seek to portray any defeat below that scale as better than expected – although the loss of hundreds of councillors would not bode well for Mr Sunak’s hopes in the general election expected in 2024.",
        "The Tory spokesman said: “Independent experts Rallings and Thrasher have said we could lose over 1,000 seats.“But if Labour want to be in with a chance of taking office after the next general election as they did in 1997, they need to be making very significant gains as they did in 1995 – the last most comparable election – anything less than that will pose serious questions for Labour HQ.”The analysis by professors Rallings and Thrasher suggested gains of more than 700 for Labour would represent Sir Keir Starmer’s party’s best performance for at least a decade, which could put them on the path to becoming the largest party at a general election – even if short of an overall majority in the Commons.But 250 gains or fewer would be disappointing, while under 150 extra councillors would be “effectively a step backwards”, the academics said.Shabana Mahmood MP, Labour’s national campaign co-ordinator, said: “We are proud of the positive campaign we have run, focused on the issues that matter most to voters.“This is a cost-of-living election. We have set out the choices we would make to help people through the cost-of-living crisis, cut crime and cut NHS waiting lists, but the Tories have been silent on the issues that matter most.",
        "“If the Conservatives go backwards from their disastrous 2019 local election results, the voters will have sent a damning message about Rishi Sunak’s leadership.“It’s going to be a long night and the full picture of results will not form until well into Friday afternoon but we expect to make gains and show we’re making the progress in the places we need to win at the next election.”Liberal Democrat deputy leader Daisy Cooper said: “I have knocked on countless doors in recent weeks and heard real anger and frustration from voters who are sick and tired of being taken for granted by this Conservative government. Tonight, their voices will be heard.“I want to take this opportunity to thank Liberal Democrat councillors, candidates and volunteers who work tirelessly for their communities. They are true local champions who stand up for their local areas, and have done the party proud.”The council and mayoral elections are the first time in England that identification from a defined list has been mandatory to cast a vote.Labour is among those criticising the Government’s move, warning that it could lock millions out of voting.Jess Garland, the Electoral Reform Society’s director of policy and research, said: “We’re already seeing countless examples of people being denied their right to vote due to these new laws.",
        "“From people caught out by having the wrong type of photo ID to others turned away for not looking enough like their photo.“One voter turned away is one voter too many. The Government must take lessons from the problems we’re seeing today at polling stations across the country and face up to the fact that these new rules damage our elections more than they protect them.”In the early afternoon, the Association of Electoral Administrators said that no major problems had been reported, though it would likely not hear about individual voters being turned away.Chief executive Peter Stanyon said: “Polling day appears to be running as smoothly as usual, which is testament to the months of planning and hard work from returning officers and electoral administrators running today’s elections.“We hope the rest of the day continues along the same lines.”Layla Moran, the Lib Dem MP for Oxford West and Abingdon, said she had been told of issues in her constituency.“We’ve had reports by our tellers of people being turned away at polling stations for lack of correct ID,” she said.“Across the country I’m worried this will be significant numbers and far more than the exactly zero people found guilty of fraud last year.”Conservative MP for Southend West, Anna Firth, said she had to go back to the car to retrieve her ID so she could vote as she reminded people not to forget their documentation.",
        "The Electoral Commission, which was given £5.6 million to carry out a public awareness campaign, has tasked councils with recording how many would-be voters are turned away.",
        "No record will be made if greeters deployed outside polling stations turn people away.The watchdog plans to publish its initial findings into how the ID mandate affected voting in the coming weeks.The Government has estimated that about 4% of Britain’s population – or two million people – were unlikely to have a valid form of photo ID to vote.Passports, driving licences and blue badges are among the IDs permitted, as are the free certificates that could be applied for ahead of the vote.Photo ID will be required in England during future general elections under the policy.On Thursday, more than 8,000 council seats were being contested across 230 local authorities, while mayors were being selected in Bedford, Leicester, Mansfield and Middlesbrough.No votes were taking place in London and Birmingham, along with other areas including Cornwall, North Yorkshire and Cumbria.The last time the same council seats were contested was in May 2019, when the Tories performed poorly under Theresa May as she struggled with Brexit.The Conservatives lost more than 1,300 council seats and majority political control of 44 councils, meaning they had less to lose on Thursday than they might have done.",
        "About a quarter of the votes are expected to be counted overnight, with the rest counted during the day on Friday."
    ]
}