{
    "articleURL": "/wires/reuters/article-12059079/Sudanese-pin-hopes-talks-Saudi-Arabia.html",
    "content": [
        "Combatants aim to discuss humanitarian crisis, not war",
        "US-Saudi backed talks began in Jeddah on SaturdayNegotiations 'our only hope' - government employeeSeveral ceasefires violated since fighting eruptedKHARTOUM, May 8 (Reuters) - Sudanese are pinning their hopes on talks in Jeddah between envoys of warring factions to end bloodshed that has killed hundreds and triggered a mass exodus, but there is no sign lasting relief will come anytime soon.There has been no word on the progress of the talks which began in the Saudi Red Sea port city on Saturday between the army and the rival paramilitary Rapid Support Forces (RSF).The combatants have said they would only try to tackle humanitarian issues like safe passage, not an end to the war. Numerous ceasefire have been violated since conflict erupted on April 15.\"If the Jeddah negotiations fail to stop the war this would mean that we won't be able to return to our homes and our lives,\" said Tamader Ibrahim, a 35-year-old government employee in Bahri, across the Blue Nile from Khartoum.\"We're waiting on these negotiations because they're our only hope.\"The U.S.-Saudi initiative is the first serious attempt to end fighting that has turned parts of the Sudanese capital into war zones, derailed an internationally backed plan to usher in civilian rule following years of unrest, and created a humanitarian crisis.",
        "THOUSANDS PUSHING TO LEAVE\"Pre-negotiation\" talks began on Saturday and \"will continue in the coming days in the expectation of reaching an effective short-term ceasefire to facilitate humanitarian assistance,\" the Saudi Foreign Ministry said in a statement.The U.S. and Saudi Arabia urged the warring parties to use the talks to move toward scheduling expanded negotiations on a permanent end to hostilities, the ministry statement added.Sudan's Forces of Freedom and Change, a political grouping leading the plan to transfer to civilian rule, welcomed the Jeddah talks on Saturday.Battles since mid-April have killed hundreds of people and wounded thousands of others, disrupted aid supplies and sent 100,000 refugees fleeing abroad.The extensive use of explosive ordnance throughout the fighting has increased the danger to civilians, especially children who can mistake the munitions for toys and play with them, the United Nations Mine Action Service has said.Thousands of people are pushing to leave from Port Sudan on boats to Saudi Arabia, paying for expensive commercial flights through the country's only functioning airport, or using evacuation flights.Conflicts are not new to Sudan, a country that sits at a strategic crossroads between Egypt, Saudi Arabia, Ethiopia and the volatile Sahel region.But most of them occurred in remote areas. This time intense fighting in Khartoum, one of Africa's biggest cities, has made the conflict far more alarming for Sudanese.",
        "Since the fighting erupted, the U.N. refugee agency has registered more than 30,000 people crossing into South Sudan, more than 90% of them South Sudanese. The true number is likely much higher, it says. Aid agencies fear the influx will worsen an already dire humanitarian crisis in South Sudan.(Reporting by Khalid Abdelaziz: Writing by Michael Georgy, Editing by William Maclean)"
    ]
}