{
    "articleURL": "/wires/pa/article-12054909/Thousands-Israelis-protest-government-legal-change-plans.html",
    "content": [
        "Tens of thousands of Israelis have gathered for a demonstration against a contentious government plan to overhaul the judiciary, demanding the changes be scrapped rather than delayed.",
        "The protests have been held on a weekly basis for most of the year and they continued despite Prime Minister Benjamin Netanyahu announcing in March that he was postponing the proposals to reach a compromise agreement.Organisers of the protests, now in their 18th week, say they want to ramp up the pressure on Mr Netanyahu’s government and lawmakers after the parliament resumed its work this week following a month-long recess.In Tel Aviv, Israel’s commercial hub and epi-centre of the protests, protestors held a large banner addressing Mr Netanyahu that read, “You will never be a dictator”.The plan would give Mr Netanyahu, who is on trial on corruption charges, and his partners in Israel’s most hardline coalition in its history the final say in appointing judges.It would also give parliament, which is controlled by Mr Netanyahu’s allies, authority to overturn Supreme Court decisions and limit the court’s ability to review laws.The plan plunged Israel into one of its worst domestic crises, ripping open longstanding societal rifts and creating new ones.While the freeze in the legislation eased tensions somewhat, Mr Netanyahu’s allies are pushing him to move ahead on the overhaul.The talks under way, meant to forge a path out of the crisis, do not appear to have produced any results.",
        "Broad swath of Israeli society, including business leaders and the booming tech sector have criticised the proposed changes.Military reservists threatened not to show up for duty if the plan was approved. Tens of thousands of people, largely secular, middle-class Israelis, have regularly joined mass protests against the plan."
    ]
}