{
    "articleURL": "/wires/ap/article-12038727/Greece-Top-court-upholds-election-ban-far-right-party.html",
    "content": [
        "ATHENS, Greece (AP) - Greece´s Supreme Court on Tuesday agreed to ban the far-right Greeks Party from participating in the country's upcoming general election, upholding legal amendments approved by lawmakers.",
        "The amendments adopted by Parliament in February disqualify parties led by politicians convicted of serious offenses or ones that would not \"serve the free functioning of (Greece´s) democratic constitution.\"Imprisoned former lawmaker Ilias Kasidiaris and his Greeks Party are not allowed to participate in the May 21 election under those terms. The ban, broadly supported by Greece´s mainstream political parties, was upheld despite an 11th-hour change in the Greeks Party leadership.The Supreme Court's 9-1 decision to uphold parliament's action could effect the outcome of the election, since the winning party would likely have an easier time forming a new government with fewer parties represented in the national legislature.Kasidiaris, 42, founded the Greeks Party after receiving a 13-year prison sentence in 2020. He was convicted as a leading member of an extreme right party, Golden Dawn, which was blamed for multiple attacks against migrants and left-wing political activists.The party was founded as a neo-Nazi group in the 1980s but later claimed to represent a broader nationalist ideology.",
        "\"The Supreme Court ruling makes clear that criminal organizations appearing in the guise of a political party cannot be tolerated in the electoral process,\" government spokesman Akis Skertsos said after the decision was announced.\"It is the duty of all of us to protect democracy ... This ruling is a vindication for the government which led the effort to keep the enemies of democracy out of parliament.\"",
        "Greeks Party officials have vowed to fight the ban in European courts. Opinion polls in recent weeks suggested the party would have done well enough in the election to be represented in parliament, with a projected 4% of voter support.\"Democracy has died where it was born,\" the Greeks Party said in an online post. In a statement read out loud by his lawyer, Kasidiaris also vowed to fight the decision. \"The Greeks Party was targeted illegally ... and tonight, our democratic system of government has been abolished. Half a million Greeks are being deprived of their right to vote for the party of their choice,\" the statement said.Conservative Prime Minister Kyriakos Mitsotakis is seeking a second term in the election. His center-right New Democracy party is leading in opinion polls but suggest he is unlikely to achieve an outright victory."
    ]
}