{
    "articleURL": "/news/article-12037983/Woman-84-suffers-brain-injury-firefighter-pushed-floor.html",
    "content": [
        "Maureen Hvegholm, 84, was feeding stray cats near her home in Sparks, NevadaFirefighter Timothy Egan allegedly threw her to floor, a claim which he deniesAn 84-year-old woman claims to have suffered a brain injury after a firefighter pushed her to the floor in a row over her leaving food and water for stray cats near his fire station. ",
        "Maureen Hvegholm, 84, was feeding cats near her home in Sparks, Nevada, when Timothy Egan grabbed the plates of food and bowls of water away, moments after she had placed them down. In CCTV footage from outside the station, the two then appeared to get into an argument, with Ms Hvegholm swatting Mr Egan away and appearing to reach for the bowls. Shocking footage of the incident allegedly shows Mr Egan throwing her onto the concrete floor, with Ms Hvegholm disappearing out of sight. She slowly gets up and walks away. Her family said she returned home with a nasty swollen lump on her forehead and was later diagnosed with a traumatic brain injury. ",
        "On March 29, Ms Hvegholm filed a lawsuit in Nevada's Washoe County, alleging that he battered her with excessive force.The suit stated: 'Hvegholm has suffered a severe decline in her quality of life, her ability to move about freely, and her ability to care for herself independent of her children — as well as a looming sense of panic, terror, and lack of security in her home.' During a city council meeting last week, her son, Marc, described the incident as 'an egregious act that should never have occurred,' the Washington Post reports.Mr Egan is believed to still be employed by the Sparks Fire Department.",
        "Ms Hvegholm has been taking food and water to the cats almost every day since she moved to the neighbourhood in Sparks, Nevada 16 years ago.Pictures show a large raised lump on her forehead, which she says she sustained in the incident.The fireman said at the time that he was picking up debris in a nearby alley when a woman - later identified as Ms Hvegholm - screamed at him.He contended that he had 'pushed her away' after she threw cat food and a bowl of water at him.The old woman said that she had been 'scared' and 'confused' when he had grabbed her things. ",
        "She said she was lifted up and thrown face down by Mr Egan. After the incident, her son drove her to the Renown Regional Medical Center in Reno, where they say doctors told them she had suffered a concussion. The lawsuit alleges that she also sustained injuries to her head, neck, back, legs, arms and organs.A police incident report stated that Mr Egan's actions were 'justified and did not constitute a battery.' An incident report claimed that Ms Hvegholm had been told by firefighters not to feed the cats, as they said the animals would climb onto and scratch their equipment. ",
        "Meanwhile, Ms Hvegholm was initially cited for battery, police records state, but this was later dropped after her children spoke with police.Her daughter Gayla Oullette said her mother continues to suffer from health problems after the incident and is now a 'shell' of her former self.The 84-year-old's daughter claims her mom now suffers from headaches, nerve pain, anxiety and post-traumatic stress disorder. She said she has to walk with a cane, and while she still feeds cats, avoids the fire station area.Ms Hvegholm's lawsuit is requesting upwards of $15,000 in damages, medical expenses and legal fees. Ouellette said they are also seeking an apology from Mr Egan.Sparks City Council has been contacted for comment. "
    ]
}