{
    "articleURL": "/wires/aap/article-12060437/Support-Dees-van-Rooyen-AFL-tribunal-challenge.html",
    "content": [
        "Two rival coaches have joined past greats in calling for Melbourne youngster Jacob van Rooyen to have his two-match suspension for striking overturned by the AFL tribunal.",
        "Van Rooyen was cited by the match review officer over a spoiling attempt in a marking contest that led to Gold Coast's Charlie Ballard being taken off the field on a stretcher.Match review officer Michael Christian assessed the incident as careless conduct, high contact and high impact.The Demons will challenge van Rooyen's ban at the tribunal on Tuesday night.GWS coach Adam Kingsley and Fremantle's Justin Longmuir told Fox Footy the 20-year-old should be cleared.\"He'd be stiff to miss. It looks like he's really trying to go for the ball,\" Kingsley said.\"The only thing is where are his eyes, what's his intent? You typically judge a player's intent through their eyes.\"It feels like, to me, he was trying to compete and get the ball to ground.\"Did it look like it was suspendible? Probably not in my view.\"Longmuir agreed with his coaching counterpart.\"The thing that hurts him in that case is the fact that he took his eyes off the ball, but usually that's just a free kick,\" Longmuir said.\"I do like the way the AFL have looked after the head and concussion in particular.\"But I think we can draw the line that it's probably a footy act and he was trying to make a play on the ball.\"",
        "Ballard hurt his neck in the incident but was not concussed and is expected to play in the Suns' clash with West Coast on Friday night.Collingwood great Nathan Buckley said slow-motion footage will help Melbourne prove van Rooyen was contesting the ball, as opposed to trying to strike his opponent.Brisbane legend Jonathan Brown said a suspension for van Rooyen would mean the game has \"become a hostage to litigation\" amid ongoing legal battles around concussion.\"That is a football accident and if that is where we are going as a game, that is concerning,\" Brown told Fox Footy.\"That is taking nothing away from people that are suffering long-term injuries to the head and all those sorts of things.\"But we cannot legislate everything out of our great game, otherwise we are changing the fabric (of it).\"Van Rooyen is one of four players who will front the tribunal on Tuesday night.Port Adelaide forward Junior Rioli is facing a ban of at least three matches for striking Jordan Ridley in an off-the-ball incident that left the Essendon defender concussed.Carlton's Nic Newman will challenge a one-match ban for striking Brisbane's Lachie Neale and Geelong's Brad Close will contest his one-match ban for rough conduct over a dangerous tackle on Adelaide's Jordan Dawson."
    ]
}