{
    "articleURL": "/sport/nba/article-12055105/Grant-Williams-explains-like-curb-stomped-7-foot-280-pound-MVP-Joel-Embiid.html",
    "content": [
        "Boston won 114-102 Friday to take a 2-1 lead behind a well-rounded performanceGame 4 is once again in South Philadelphia, taking place Sunday at 3:30pm ET DailyMail.com provides all the latest international sports news Boston Celtics forward Grant Williams got stomped by newly-minted MVP Joel Embiid as the C's took out Game 3 in the Eastern Conference semifinals series. ",
        "Williams was caught by Embiid while he attempted to jump out of the way amid a scramble for a lose ball in the final minutes of Friday night's game. The 24-year-old was prone as he readied to crawl toward the basketball before Embiid came down on top of his head, pushing his face into the hardwood. 'I was like, 'Dang, I really got curb-stomped,' ' Williams told reporters postgame after seeing the footage. 'It happens, man,' he said. 'He was falling backward and I'm just thankful he didn't fully lean his weight on it because he definitely got me pretty badly but then I think he felt like he landed on something so he picked his foot up.' ",
        "Embiid checked on Williams after he returned to the game in a moment of tremendous sportsmanship between the two. 'My bad, I landed on your head?' Embiid asked Williams. The Celtics big man reassured him everything was okay, suggesting it was the nature of playoff basketball, saying 'it's what we battle for.' ",
        "Boston asserted its dominance on the road in South Philadelphia Friday night as the C's took a 2-1 advantage in the best-of-seven series. The Celtics silenced the Wells Fargo Center crowd with a well-balanced performance from its starters. Jayson Tatum headlined for Boston with 27 points, nine rebounds and five assists. ",
        "Embiid led all 76ers with 30 points and 13 rebounds as James Harden largely struggled. He was playing in just his second game since returning from injury – a sprained LCL in his right knee. Game 4 is once more at the Wells Fargo Center at 3:30pm ET Sunday. "
    ]
}