{
    "articleURL": "/news/article-12044963/Andrew-Cuomo-demanding-women-accused-sexual-misconduct-sit-questioning.html",
    "content": [
        "Andrew Cuomo subpoenaed five of the 11 women who accused him of sexual harassment when he was the Governor of New YorkThe move is part of his defense against a lawsuit filed by a state trooper who said he touched her inappropriately while she was part of his security detail in 2019Cuomo resigned from office in 2021 but has always maintained his innocenceDisgraced former New York governor Andrew Cuomo subpoenaed a number of women who accused him of sexual harassment in an attempt to clear his name as he fights a civil suit. ",
        "Cuomo, sent the subpoenas to Virginia Limmiatis, Brittany Commisso, Ana Liss, Alyssa McGrath, Lindsey Boylan, five of the 11 women who accused him of sexual misconduct.The 65-year-old resigned from his post in 2021 amidst a probe into his behavior by New York Attorney General Letitia James.Cuomo's subpoenas are seeking records from that investigation and are also calling on the women to give depositions about their accusations, according to the Wall Street Journal.Sent in March and April, the subpoenas are likely part of Cuomo's defense against a federal lawsuit brought forth by a state trooper - known as Trooper 1 - who said the governor touched her inappropriately while she was working his security detail. The suit's discovery deadline has been set for July.",
        "Cuomo previously tried to subpoena files from James' office along with investigation documents from the State Assembly. Those groups both objected, and a decision remains pending on the case, according to the outlet. Lawyers for Cuomo said the legal efforts were 'part of routine discovery' in the current phase of a lawsuit.They also said Cuomo never had a chance to question his accusers himself.Limmiatis accused Cuomo of grabbing her at a 2017 event. Commisso, Liss, McGrath and Boylan worked as aides for Cuomo. An attorney for Boylan said the subpoenas were merely another example of Cuomo's pattern of harassment against women. ",
        "'The extreme nature of this latest subpoena directed at my client demonstrates that Mr. Cuomo has no qualms about continuing his harassment of the women he abused and is using taxpayer dollars to do so,' said Attorney Julie Gerchik.She added Boylan had already gone through two investigations related to her allegations.Cuomo has insisted he is innocent since the allegations surfaced, while also apologizing for any discomfort his actions may have caused.He later claimed the investigations into him were politically motivated and said he was a victim of cancel culture.",
        "Trooper 1, whose name has not been released, alleged Cuomo tried to kiss her, steered conversations toward sex, asked her to help find him a girlfriend and once asked 'why don't you wear a dress?''As with his other victims, the governor used his physical proximity to Trooper 1 to touch her inappropriately,' the lawsuit alleged.'He commented on her appearance (''why don't you wear a dress?''); wanted to kiss her (''(c)an I kiss you?''); asked her to find him a girlfriend who could ''handle pain;'' and steered their conversations towards sex (''(w)hy would you want to get married? ... your sex drive goes down''),' the suit contended.The complaint stated that Trooper 1, who was part of Cuomo's security detail in September 2019, accompanied the governor to the Belmont racetrack where she says 'she felt violated as the Governor intentionally touched her in intimate locations between her breasts and vagina.'",
        "As Trooper 1 walked ahead of the governor to hold the door open for him, he placed the palm of his hand on her belly button and slid it across her waist to her right hip, where her gun was holstered,' the complaints alleged.The trooper said that days later, Cuomo asked her about her relationship status, 'clearly prompted by the now-public fact that he had broken up with his girlfriend' and asked for the trooper's ad.'The complaint also alleged that on another occasion, Cuomo ran 'his finger down the center of my back of my spine, basically from the top of my neck, basically midway down with his pointer finger and just said, 'Hey, you.'"
    ]
}