{
    "articleURL": "/news/article-12044089/Voice-Parliament-Liberal-Jenny-Wares-embarrassing-panel-Abbott-Hildebrand.html",
    "content": [
        " Liberal MP hosted Voice panel to get opinionsShe said there was no time to hear from Indigenous people Do you know more? Were you at the event? brittany.chain@mailonline.com A Liberal MP has sparked uproar for failing to include First Nations people in a panel she hosted to help decide which position she would take on the Voice to Parliament.",
        "Jenny Ware hosted the event in her electorate of Hughes in southern Sydney and urged as many of her constituents to come as possible.She invited former prime minister Tony Abbott to argue the 'No' campaign, while journalist and commentator Joe Hildebrand promoted the 'Yes' campaign. But towards the end of the panel Ms Ware was interrupted by a heckler who said: 'Can we please hear from a First Nations person?'In response, she said: 'We don't have the time. We simply do not have the time.'Hildebrand told Daily Mail Australia he 'heard how it came across' to the crowd, but noted it 'definitely wasn't intended to be that way'.'She was just anxious to keep to time... the entire night was actually very warm and very respectful.'",
        "Simultaneously, an Indigenous man named Phil made his way onto the stage, saying: 'I think you should hear from an Aboriginal's side or view, alright?' There was cheers and applause from the crowd as the man told the crowd he 'came from an era where there was discrimination'.'You're up here Joe, Tony, talking about the constitution. It's a system word. It has been detrimental to my people,' he said in a passionate speech to the crowd.'The truth hurts.' Viewers said the 'yes' vote campaign would be 'crazy' not to use the footage, while others said it 'proved exactly why the Voice is needed'.",
        "'And there we have it. Almost like they scripted it to demonstrate why we need a Voice enshrined in our constitution. Precisely so that Voice cannot simply be silenced... when it is inconvenient,' one said.Another wrote: 'This tells you all you need to know about the No vote.' 'Unbelievable! Cringeworthy. Two white men bicker over the Voice for 2 excruciating hours. An Aboriginal man gets up to speak and is told no time to hear his voice.' Despite the backlash online, it's understood Phil engaged in warm conversations with both Hildebrand and Abbott after the evening drew to a close. Mr Abbott supports constitutional recognition of Indigenous Australians but has been a vocal critic of the Voice to Parliament, arguing it would give one section of society greater influence over the government than others.'I think it's wrong in principle, I'm sure it would be disastrous in practice,' he told Sky News.",
        "Hildebrand, meanwhile, is a passionate advocate of the Voice, and believes it is a strong step toward closing the gap.The Liberal Party will officially back only constitutional recognition and will oppose the voice. Ken Wyatt, the former Indigenous affairs minister for the Coalition, quit the party in protest.Julian Leeser, who was the opposition shadow attorney-general, also resigned from the frontbench over the decision.",
        "Ms Ware, who is on the backbench, has long said there is not enough information to form a decision.'The Albanese-Labor government has failed to answer a lot of questions that were put forward by Peter Dutton... therefore, I think that part of my role as a parliamentarian is to represent my electorate,' she said. 'Do they have enough information on both the Yes and the No campaign?' "
    ]
}