{
    "articleURL": "/tvshowbiz/article-12054969/EMILY-PRESCOTT-Dara-Huang-dares-spoon-out.html",
    "content": [
        "The Royals enjoyed the glamour of the Coronation, so I can’t help but wonder if comments by the mother of Princess Beatrice’s stepson are a little pointed. ",
        "Dara Huang, who shares son Wolfie with Beatrice’s hubby Edoardo, had some choice words about privilege during her Channel 4 design show, The Big Interiors Battle. Dara, 40, says: ‘It makes me happy that none of the contestants are spoiled or come with a silver spoon in their mouth. They are kind and come from hard-working families like myself.’ ",
        "Jamie has a Lottie on his plate... After being described by Prince Harry in his memoir Spare as ‘the finest product of military training’, I have no doubt Jamie Lowther-Pinkerton kept himself on a sharp schedule yesterday.Not only did the former SAS man, who was William and Harry’s private secretary for a number of years, keep a watchful eye over his godson Prince George and Princess Charlotte, right, at one of the rehearsals, but he was on hand to usher the pages into their carriages at Buckingham Palace yesterday.He then hotfooted it over to the ITV studio to provide expert analysis alongside presenter Tom Bradby.",
        "SpongeBob's Royal coup They showed The Emoji Movie during the Queen’s funeral, so how did Channel 5 mark the Coronation? By screening cartoon favourite SpongeBob SquarePants. The decision didn’t faze Dan Walker, who hosts the channel’s flagship news bulletin. ‘That’s classic Channel 5,’ he joked at the Stratford Literary Festival. ",
        "However Dan, 46, was glued to the ceremony rather than SpongeBob: ‘As a student of history, I love all the pomp.’ ",
        "Don't worry if you missed out on an invitation to yesterday’s pomp, because I can reveal there is another way to get a glimpse of the newly crowned King soon enough – pay £1.1million for a four-bedroom house at Sandringham.The Grade II-listed Station House is back on the market after a proposed sale fell through. The former station master’s house is next to the now-defunct Wolferton station, which the Royal Family used until the late 1960s when visiting their Norfolk retreat. It’s not a palace but does come with a turret and some very famous neighbours at Christmas…Julie's a treasure Perhaps the peers who moaned about not being invited to the Coronation should have followed the example set by Julie, Viscountess Hinchingbrooke.The American-born socialite – whose husband Luke Montagu is heir to the Earl of Sandwich – took the opportunity to dig out some heirlooms at her family’s home, Mapperton House in Dorset. As well as finding her predecessors’ Coronation invitations from 1937 and 1953, she discovered robes worn by the Earl of Sandwich, stashed away in bin bags for decades. That would make a good episode of Cash In The Attic!"
    ]
}