{
    "articleURL": "/wires/pa/article-12049461/Local-elections-2023-Key-results.html",
    "content": [
        "Elections took place in 230 local authorities across England on Thursday. Here are some of the key results:",
        "– Swindon (Lab gain from Con)This is where Sir Keir Starmer launched Labour’s local election campaign and where the party hopes to pick up at least one of the area’s two Conservative-held parliamentary seats at the general election.Labour needed to win big to take control of the council but the party managed it, gaining 10 seats while the Tories lost 11.– Dacorum (Lib Dem gain from Con)Liberal Democrat leader Sir Ed Davey launched his party’s campaign in the Hertfordshire council by driving a yellow tractor through a “blue wall” of painted hay bales.His party has now taken control of Dacorum from the Conservatives, after gaining nine seats while the Tories lost 13.– Stratford-on-Avon (Lib Dem gain from Con)This is an area represented in parliament by Conservative MP Nadhim Zahawi, who was vaccines minister at the start of the pandemic and briefly Chancellor of the Exchequer at the end of Boris Johnson’s premiership.But Stratford council is now under Lib Dem control, with the party up 13 seats and the Tories down seven.– Surrey Heath (Lib Dem gain from no overall control)Another Conservative big beast who may be feeling nervous is Michael Gove, Secretary of State for Levelling Up, Housing &amp; Communities.Mr Gove is the MP for Surrey Heath, where the Liberal Democrats gained 14 seats and the Tories lost 10 – enough to give the Lib Dems overall control of the council.",
        "– East Staffordshire (Lab gain from Con)A straight switch from Tory to Labour control, with Labour up 10 seats and the Conservatives down eight.The result will give Labour cheer in a part of the country that will be a key battleground at the next general election.",
        "– Medway (Lab gain from Con)Labour had this Kent council firmly in its sights, with Sir Keir visiting the area on the final day of the campaign.The party gained 13 seats, enough to take full control of Medway for the first time since 1998. The Conservatives fell by 11 seats and lost overall control.– Bracknell Forest (Lab gain from Con)This was a particularly bad result for the Tories, who finished down 27 seats.All the other main parties made gains – Labour up 18, the Lib Dems up six and the Greens up two – but it is Labour which has the most to celebrate, taking overall control here for the first time since 1997.– East Hertfordshire (Con lose to no overall control)There was a surge in support here for the Greens, with the party’s total number of seats up 17.Other parties also enjoyed a boost – the Lib Dems up by four and Labour up three – while the Conservatives slumped by 23.",
        "The Greens are now the largest party on the council with 19 seats, three ahead of the Tories on 16.– Mid Suffolk (Green gain from no overall control)The Greens went one better at Mid Suffolk, winning majority control of a council in England for the very first time.The party made 12 gains and now holds 24 seats, a long way ahead of the Conservatives on six and the Lib Dems on four.– Brighton &amp; Hove (Lab gain from no overall control)There will be lessons for the Greens to learn from their performance at Brighton &amp; Hove.The party has gone from running a minority administration to seeing their councillors dwindle to a total of seven, while Labour – now in control – has seen its total jump by 22.– Windsor &amp; Maidenhead (Lib Dem gain from Con)In another big setback for the Tories, the party lost 15 seats and overall control, while the Liberal Democrats clocked up 12 gains.It is the first time since 2007 that Windsor &amp; Maidenhead has had a Lib Dem majority.– Erewash (Lab gain from Con)Erewash was one of a number of strong performances by Labour in Derbyshire.The party gained 13 seats while the Conservatives lost 10 – enough to flip the council from Tory to Labour control. Elsewhere in the county, Labour gained control of High Peak and North East Derbyshire.",
        "– North West Leicestershire (Con lose to no overall control)Labour gained 10 seats here, enough to leave it the largest party but short of an overall majority. The Lib Dems gained a seat, while the Conservatives lost 10 and the Greens lost one.This is the area of the country represented at Westminster by Andrew Bridgen MP, who was recently expelled from the Conservative Party for comparing Covid vaccines with the Holocaust.– Amber Valley (Lab gain from Con)More success for Labour in Derbyshire. The party saw its number of councillors jump by 17 while the Conservatives dropped 16 and Reform fell by six – enough of a change to give Labour an overall majority.– Stoke-on-Trent (Lab gain from no overall control)This was a top Labour target in another key election battleground. Labour finished up 17 seats, while the Conservatives were down eight and Independents down nine.Stoke was once solid Labour territory at general elections but the Tories won all three constituencies in the city in 2019.– Slough (Lab lose to no overall control)It was a very different picture for Labour in Slough, where the party dropped 17 seats and lost control of the council.The Tories went up 16 and the Liberal Democrats up three.",
        "Local issues were probably a factor here: the Government gave Labour dispensation to raise council tax by 10% to help deal with a legacy of huge borrowing debts.– West Oxfordshire (no overall control)Although West Oxfordshire remains a hung council, the Lib Dems have leapfrogged the Tories to become the largest party, gaining three seats in the process. The council includes the home area of former Tory prime minister David Cameron.– Plymouth (Lab gain from no overall control)This was one of Labour’s top targets in southern England.The party will be pleased with the result, taking overall control with seven gains.The council had been run by a minority Conservative administration, which came in for criticism after chopping down 110 healthy city centre trees overnight – a decision that may be linked to the Tories losing five seats.– Bolton (no overall control)Every seat in Bolton was up for grabs this year, and while it remains in no overall control there has been a big change in the numbers.Before the election, the Tories were the largest party and had run the council as a minority administration. They are now down nine seats and have dropped into second place behind Labour, who are up seven seats.The line-up of the new council is Labour 26, Conservative 17, Independents 11, Lib Dems six.",
        "– Hertsmere (Con lose to no overall control)The Conservatives may have faced a pincer movement in Hertsmere.The party lost 13 seats, while Labour gained seven and the Lib Dems gained six.The new council sees the Tories and Labour almost on level-pegging, on 16 and 14 seats respectively, with the Lib Dems on nine."
    ]
}