{
    "articleURL": "/sport/football/article-12059311/David-Gea-one-worlds-best-goalkeepers-Man-United-say-GOODBYE.html",
    "content": [
        "David de Gea's Man United future is uncertain after his error against West HamErik ten Hag revealed he wants the goalkeeper to sign a new deal with the clubTen Hag DEFENDS De Gea after his mistake condemns United at West Ham When Said Benrahma's tame shot trickled into the net, David de Gea rolled over and lay face down in the turf at the London Stadium.",
        "The seconds that he stared into the grass must have felt like an eternity as West Ham fans celebrated, Manchester United supporters puffed their cheeks and his team-mates cut stunned figures.In that moment De Gea must have been thinking 'not again' after making another costly error and was perhaps also fleetingly pondering his future at the club on the day he made his 540th Red Devils appearance.Admittedly, Benrahma should never have been allowed to get a shot away as he was escorted to the edge of the box by three United defenders who failed to put a challenge in. But this was a routine save, one that De Gea could previously have made in his sleep, now it appears that he is suffering a confidence crisis at exactly the wrong time in the season with United risking dropping out of the top four.",
        "It's strange that the goalkeeper who currently leads the Premier League's race for the golden glove is having his future debated in such outright terms, but that is the situation De Gea finds himself in.The 32-year-old leads the goalkeeping charts having gone 15 matches without conceding in the English top-flight, but has long lost his previously held status as the division's best goalkeeper.United supporters have called for their number one to be replaced in the summer, but Ten Hag battled back against such calls and revealed that he is trying to tie De Gea down to a new deal.",
        "After losing a second consecutive league match, Ten Hag stated: 'We want him to stay and we want him to extend his contract.'He has the most clean sheets in the Premier League. We would not be here in this position without him.'I believe there are no concerns. It happens. As a team, you have to deal with it, show character, be resilient, bounce back and that's what this team will do.'But is that the best idea for a goalkeeper who, despite making some outstanding saves over the course of a season, can't be relied upon in the biggest moments for a team that has ambitions of returning to the top of European football?De Gea keeps his starting place regardless of the mistakes he makes or his unconvincing reliability. Partly because Jack Butland isn't a good enough stop-gap to step in, but also because Ten Hag appears to trust his number one. ",
        "De Gea has established a reputation as one of the best reflex savers in the world, making countless highlight reel stops over the years and regardless of current problems has been a key reason for success at Old Trafford in other campaigns.It was only six years ago that he was an almost impenetrable presence in United's 3-1 away win over Arsenal in 2017 when he equalled the Premier League record for the most saves in a game, denying the likes of Mesut Ozil and Alexis Sanchez 14 times throughout the match.",
        "That was one of the years where the former Atletico Madrid man also won the club's player of the season award. He has won four of them during his time at Old Trafford, a feat only matched by Cristiano Ronaldo.His distribution was another coveted caveat of his game when he used to pick team-mates out and kick-start attacks with pinpoint passing precision, but that has dwindled in recent seasons and we are now at a point where the cons outweigh the pros of keeping the club legend.Look at the mistakes De Gea has made this season and the theme of a player who appears past their best is beginning to emerge.That moment when he failed to control a ball against Sevilla that led to the Spanish side scoring, his questionable pass into Harry Maguire in the same game that inspired a Europa League comeback, and Sunday's slow-motion attempt that handed David Moyes his first win over United since his sacking.De Gea has made four errors leading to a goal in all competitions this season, the highest of any Premier League player and tied with Spurs shot-stopper Lloris.There are also frustrations over his ability to deal with crosses into the box. De Gea rarely looks to move off his line to catch or punch deliveries and when he does step forward is prone to flap and cause chaos amongst his defenders who are frantically trying to clear.",
        "This was a problem when he first stepped foot in Manchester at the age of 20 in 2011 as Sir Alex Ferguson earmarked him as the perfect replacement for Edwin van der Sar, and remains an issue 12 years later.His staggering £350,000-per-week wage is another factor that goes against De Gea keeping his place at the club - even if fresh negotiations see this figure drop it's likely he will remain as one of United's top earners. De Gea will be regarded as one of both Man United and the Premier League's greatest-ever goalkeepers when he does leave for pastures new. For the sake of his end-of-career ambitions and Ten Hag's attempts to re-establish success at Old Trafford that should be at the end of this season.Sell De Gea, recoup some sort of a fee and let him go under relatively good circumstances while it's possible. Keep him and the fan favourite status the Spaniard has garnered is at risk of being dismantled, along with any efforts to move forward into a new era."
    ]
}