{
    "articleURL": "/tvshowbiz/article-12051331/RHOCH-star-Ampika-Pickston-41-cosies-billionaire-West-Ham-chairman-fianc.html",
    "content": [
        "Real Housewives Of Cheshire star Ampika Pickston, 41, put on a cosy display with her billionaire West Ham chairman fiancé David Sullivan, 74, on Thursday. ",
        "The reality beauty looked sensational in a black blazer dress with gold buttons and patterned tights as she posed alongside the football boss. Looking every inch the WAG, she clutched a £20k Hermès Birkin handbag.  David opted for a snazzy ensemble comprising a blue shimmering jacket with complementary shoes and a tie with dazzling jewel adornments. Revealing they were heading to celebrate the Coronation, Ampika added a caption reading: 'Anyone fancy a lift in the fire engine tonight? King’s coronation starts now for us. Got our tent and flags in the boot . See you there splendid peeps'. ",
        "Back in December 2021, it was reported David popped the question on the reality star's birthday, after a decade of friendship.A source told The Sun at the time: 'There’s a big age gap but they are smitten. They’ve kept quiet out of respect for their children and ex-partners but know they can’t keep a lid on this forever.'David previously dated ex-girlfriend Emma Benton-Hughes, a former porn star, for 25 years and he made her his co-chairman at West Ham.The 55-year-old, who also goes by the name Eve Vorley, was a Page 3 girl and involved in a number of adult films in the late 90s and early 2000s.She starred in films such as 'Lesbian Nurses', 'Electric Blue: Nude Wives - Private Parts' and 'Naked Neighbours', and directed films including 'Horny Housewives on the Job' and 'Sex Mad Secretaries'.",
        "Sullivan, alongside David Gold and Karren Brady, oversaw a takeover of West Ham back in 2010.Ampika, who starred in five series of Real Housewives before quitting in 2017, was previously engaged to a mystery man in 2018 following a whirlwind romance.The beauty entrepreneur met the businessman, whom she did not want to name, through an online dating website and he popped the question after just a 'short time' together.Ampika was previously married to billionaire businessman Mark Pickston, with whom she shares her son, Jake, 15."
    ]
}