{
    "articleURL": "/tvshowbiz/article-12052417/Sofia-Vergara-radiant-shoulder-red-patterned-dress-celebrates-Cinco-Mayo.html",
    "content": [
        "Sofia Vergara put on a radiant display in a new Instagram photo as she enjoyed a feast under the warm sunshine in celebration of Cinco de Mayo on Friday. ",
        "The Modern Family alum, 50, who recently posted a rare throwback photo with her natural blonde hair, flashed a big smile as she relaxed in what appeared to be a spacious backyard. The mother of one sat in a comfortable chair next to a table on an outdoor patio, with a shimmering swimming pool directly behind the actress. A large hedge along with palm trees and other greenery outlined the blue sky as she happily soaked up the sun. The model donned an off-the-shoulder, red-patterned dress that contained additional hues of green, white and yellow while holding a glass of refreshing water in her right hand.  ",
        "Her voluminous brunette locks were parted in the middle, and effortlessly flowed past her shoulders in elegant waves. She accessorized her ensemble for the special day by adding a pair of eye-catching, dangly earrings that nearly brushed the base of her neck. Sofia's makeup was classically done, and comprised of a layer of mascara to her lashes as well as a plum-colored tint on her lips. In front of her, various plates and bowls that contained a number of vibrant colors were placed on the large table. Tasty watermelon filled up one bowl, while tacos were arranged in an organized manner, ready to be eaten. ",
        "Tortilla chips filled another bowl, with freshly made guacamole placed directly in the middle to make dipping simple and easy. Tall glasses could be seen near the edge of the table near a large dispenser filled with ice water and lemons. In the caption of the post, the actress penned to her 29.1 million fans and followers, 'Muy feliz 5 de Mayo everyone!!' In translation, she wished everyone a 'Very happy May 5th.'The beauty, who has been busy filming America's Got Talent as one of the celebrity judges, appeared to be enjoying the fresh air.  ",
        "Along with celebrating Cinco de Mayo, Sofia additionally shared a throwback video on her Instagram stories from a photo shoot she had done in New York City. She added the hashtag, '#tbtNy,' meaning 'throwback to New York,' with a yellow heart placed above. The star showcased her stunning frame wearing a figure-hugging, short-sleeved red dress that flaunted her toned physique and long legs. Vergara slipped into a pair of closed-toed, nude-colored heels to allow the minidress to be the main focal point. Her hair was parted to the side, and cascaded past her shoulders in bouncy curls. During the short clip, a fan off-screen could be seen blowing her locks away from her face, while a photographer snapped away as Sofia striked numerous poses. ",
        "At one point, a stylist approached the model to do a few quick touch ups before the photo shoot continued. The Hot Pursuit actress, who tied the knot with fellow actor, Joe Manganiello, in 2015, recently spent time in the Big Apple in celebration of her new cooking competition titled, Celebrity Family Cook Off. While Sofia is taking on the important role of executive producer, her son, Manolo, will host the six-episode Roku series, reported Deadline. The actress shares the 31-year-old with her ex-husband, Joe Gonzalez. ",
        "According to the publication, the premise follows two celebrities that are accompanied by one family member who compete against one another for a cash prize that will go to a charity of the winning celebrity duo's choice. The competition will also only have two rounds: the dinner course and most importantly, dessert. With Manolo hosting, the judges of the competition are slated to be Kalen Allen and Fariyal Abdullahi.Sofia's son told Deadline, 'We’re so excited to be partnering with Roku to bring you a fun, new cooking competition! Working as a family is great and doing it in the spirit of giving back is even better.' The America's Got Talent judge also jumped to her own Instagram page to announce the new project and wrote, 'So excited to announce our new cooking competition, Celebrity Family Cook-Off! Coming soon to Roku! felicidades @manologonzalezvergara en tu nuevo show!!! Luv u.' "
    ]
}