{
    "articleURL": "/money/investing/article-12054025/Top-building-societies-told-pay-Philips-trusts.html",
    "content": [
        "A number of leading building societies are being urged to compensate customers who have lost money as a result of being pushed into unsuitable financial products provided by a third party – Philips Trust Corporation – which failed last year.",
        "The Mail on Sunday understands that the All-Party Parliamentary Group on Personal Banking and Fairer Financial Services is urging the City regulator to press building societies caught up in the debacle to pay up. They include Leeds, Newcastle and Nottingham, as well as smaller players such as Cambridge and Saffron.The parliamentary group took evidence from building society customers who have lost money as a result of Philips' plunge into administration. According to those present, the evidence was 'damning' with customers – nearly all elderly – pushed into inappropriate products.Building society customers were drawn into Philips' net in the late-2010s when they were encouraged at branches to take out wills – and trusts that would protect their assets (their home and investments) from future care fees and inheritance tax.Originally, these were provided by sister companies The Will Writing Company (TWWC) and Family Trust Corporation (FTC) – with the building societies receiving commission on each sale they made.",
        "But when TWWC went bust in 2018, Philips took over, and big problems began to emerge. It started levying extra charges while customer calls went unanswered. Philips plunged into administration just under a year ago – weeks after the MoS raised concerns over its health.Since last May, administrators at Kroll Advisory have been poring over Philips' financial entrails, trying to unravel customers' assets from the mess.",
        "It's a process that is proving costly, with customers having to make four-figure contributions towards getting their homes removed from the trusts set up by Philips.Those who hold investments in the trusts have been warned that they are unlikely to get back the sums they put in because of the poor quality of the holdings. Any repayments to customers could take until 2026 to be completed.Andrea Hindley, from Devon, has been involved – along with her three sisters – in trying to revoke the Philips' trust set up for her father and mother, comprising their Lincolnshire home and a number of investments.'They took out the trust in 2015 after it was recommended by their local building society, the Nottingham,' she told The Mail on Sunday on Friday. 'At the time, they were both in their 80s. Mum sadly died unexpectedly in April last year, and Dad is in poor health.'Andrea says the cost of getting her father's house into a new trust, overseen by herself and one of her sisters, will be in the order of £6,000. She also believes the investments – bonds – will be worth a fraction of their original value when they finally mature.'Building societies argue they never had anything to do with Philips,' she adds. 'That's right, but they did encourage customers like my mum and dad to take out a trust in the first place, which I don't believe was appropriate for them. They aren't wealthy, just comfortably off.'",
        "Mark Bishop, head of campaign strategy at financial services pressure group the Transparency Task Force, is a member of the all-party parliamentary group's secretariat. He believes building societies should be required to pay compensation.He argues that any compensation should cover the costs involved in setting up the original trusts, any subsequent charges (applied by Philips) and the investment losses suffered by customers.In recent weeks, Nottingham has been reaching out to customers. On Friday, it told the MoS: 'We are assessing the impact of the ongoing Philips' administration on customers and how we may be able to provide support. Unfortunately, it is not straightforward as we had no direct relationship with Philips.'The Building Societies Association, the industry's trade organisation, said: 'We are aware of – and sympathetic to – the difficult situation being faced by some people. But to be clear, no building society introduced customers to Philips, which is the firm where the issues have arisen.'Newcastle acknowledged the Philips debacle had been a 'source of distress' for a number of customers. It said it had set up a dedicated customer support team.The all-party parliamentary group has written to the Financial Conduct Authority, urging it to probe building societies involved in the Philips debacle. On Friday, the FCA said it had asked a number of building societies for further information about customer referrals to trust service providers.",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}