{
    "articleURL": "/news/article-12038475/A-engaged-couples-shun-natural-diamonds-favor-lab-grown-stones.html",
    "content": [
        "Some 36 percent of engaged men proposed with a lab-grown diamond last yearThat number has doubled since 2020, according to wedding site The Knot It comes as sales of natural diamonds plummet by around 25 percent More than a third of engaged men proposed with a lab-grown diamond ring last year as sales of man-made stones plummeted.",
        "Research by wedding website The Knot found the number of couples opting for lab-grown stones had more than doubled since 2020 after major jewelry brands such as Pandora started offering the sustainable alternatives. At the same time the amount of engagement rings with natural diamonds fell by around 25 percent, according to an independent diamond industry analyst Edahn Golan.Experts said the trend is being driven by couples wanting super-sized stones - made more accessible by the cheaper cost of the lab process. And it has been accelerated by celebrities such as Meghan Markle and Gigi Hadid who have all been pictured in man-made diamonds. ",
        "A 1 carat lab-grown diamond is on the market for as little as $1,430. Comparatively a diamond of the same size which had been mined naturally would cost $5,635. According to The Knot, the average size of a lab-grown engagement ring in 2022 was 1.8 carats. By comparison the average size of a natural diamond was 1.5 carats.The survey found that 36 percent of engaged couples has opted for a lab-grown ring, up from 18 percent in 2020. Natural diamonds are made of pure carbon below the earth's surface and are the hardest natural mineral found on Earth.But the way they are mined with fuel, hydrocarbons and heavy machinery has been linked to heavy air pollution and climate change. The industry has also come under fire for a poor human rights record over conditions inflicted on diamond miners in developing nations. ",
        "By comparison, lab-grown diamonds are considered more eco-friendly as they recreate the same conditions but in a laboratory. The first ever lab-grown diamond was created in 1950 but the jewelry has only gained popularity in recent years after the trend was adopted by mass-market brands. Lab grown diamonds are real diamonds, and pass the same tests used to define precious stones dug from the Earth.  ",
        "Kay Jewelers started selling lab-grown diamonds in 2019 while Pandora launched its own collection in last year. Pandora's rings start at $300, with its cheapest ring 0.15 carat in size. Meanwhile Gucci and watchmaker Breitling have both recently started using man-made diamonds in their collections. And the private equity arm of Louis Vuitton's parent company LVMH invested $90 million into firm Lusix which uses solar power to grow its diamonds. Lusix founder Benny Landa told the Wall Street Journal: 'Consumers are smart.'When they see a two carat lab-grown diamond for not much more than a one carat mined diamond, it’s a no-brainer.'Amish Shah, founder of man-made diamond producer ALTR Created Diamonds., also told the outlet: 'Young couples can now get the carat size they want and still afford a honeymoon.'A host of celebrities have also been pictured in lab-grown jewelry.In 2019, Meghan Markle attended an event in London wearing a pair of lab-grown diamond earrings from Dutch company Kimai. ",
        "Similarly, Gigi Hadid was spotted in a lab-grown diamong necklace from New York jeweler Smiling Rocks. ",
        "Diamonds grown in a lab now account for 13.6% of the $88.6 billion in diamond jewelry sold globally in 2022.In 2015m this figure stood at 1 percent.But The Knot's research found younger couples were more likely to adopt the trend. Some 37 percent of shoppers 18-to-34 years old said they were likely to choose a lab-grown diamond - compared to only 24 percent of those 35 or older."
    ]
}