{
    "articleURL": "/news/article-12042047/British-big-wave-surfer-Tom-Lowe-suffers-broken-ribs-suffering-huge-wipeout-Tahiti.html",
    "content": [
        "Tom Lowe, 39, was hospitalised with six broken ribs and internal bleedingHe had been surfing waves in Tahiti when he was flung head first into the oceanBritish big-wave surfer Tom Lowe was hospitalised with six broken ribs and internal bleeding after suffering a huge wipeout in Tahiti.",
        "The father-of-one, 39, had been surfing the waves off the coast of Teahupo'o in southern Tahiti on Friday when he was flung head first into the Pacific Ocean.Video shows Lowe taking off late on a large wave before losing his balance and being thrown into shallow waters where sharp pieces of coral cut into his body.Lowe, from St Ives, Cornwall, was nowhere to be seen as the huge wave crashed down on top of him in the horrifying incident. Those who watched in horror at the wipeout rushed to rescue the critically injured surfer from the waters before airlifting him to a nearby hospital.",
        "Lowe underwent surgery and a blood transfusion after he suffered six broken ribs, a fractured scapula and internal bleeding. His pregnant wife Tess and daughter Tigerlilly, upon hearing of the life-threatening accident, rushed to be by his bedside. 'I truly do feel lucky to have made it,' Lowe wrote in an Instagram post. 'It was a rough day,' Lowe later told Surfline. 'But I'm in one piece and I'll be back, reborn and fighting fit.' Lowe's friend Greg Long has since set up a GoFundMe page to help raise runs for the surfer's 'extensive' medical bills as his insurance does not cover his treatment.Long wrote: 'During the recent monumental swell at Teahupo'o, Tahiti, Tom endured a bad wipeout.",
        "'His resulting injuries from hitting the reef required he be airlifted to the hospital where he underwent multiple emergency surgeries. 'He is currently in stable condition but will need to remain under close watch in the hospital for the coming days.'",
        "Long said any donations will help Lowe and his family to cover his medical expenses and support his rehabilitation process.'Tom has been a dear friend for years,' Long wrote. 'Anyone who has ever met Tom knows him as a humble, kind and talented surfer who is a dedicated family man to his wife Tess, daughter Tigerlilly and soon-to-be baby-on-the-way.Tom has a long road ahead, but true to his nature, he is positive, in a fighting spirit, and extends his heartfelt gratitude for all the love and support he is being shown.'It's not in my nature to ask for handouts, but in this instance I don't know what I would have done without it,' Lowe said of the donations. So far, $36,000 (£28,800) has been raised.'I am completely overwhelmed and humbled by the generosity and kindness everyone has shown,' Lowe said. 'Thank you for all your positive energy and thoughtful messages.'"
    ]
}