{
    "articleURL": "/news/article-12058171/Savannah-West-Coast-Savage-OnlyFans-creator-reveals-salary-Perth-billboard-ordeal.html",
    "content": [
        "OnlyFans star Savannah erects roadside billboard Ad sparked complaints, all rejected by regulatorA tattooed OnlyFans model whose roadside billboard sparked community outrage has revealed how much money she has made after putting up the bold ad.",
        "Savannah, also known as WC Savage, displayed herself across a large billboard in Perth in early April.The risque billboard prompted fierce backlash from parents and residents with 350 complaints made to Ad Standards Australia.One claimed that pornography addicts could be triggered by it, and that 'sexual objectification of women leads to violence against women'. Savannah appears to have had the last laugh as she has not only been allowed to keep the billboard up, but she has also made an eye-watering sum of money.",
        "She claimed that since starting her lucrative career on OnlyFans she made US$100,000, or AU$147,913, in the first week.'My plan is to retire when I'm 40,' she told 7News.The advertisement was set up on the billboard at the intersection between Green Street and Scarborough Beach Road in Osborne Park.Savannah has since decided to remove the advertisement four weeks since raising it.She will replace the original ad with a QR code that leads residents to Western Australian charity Clothing Please. The charity recycles unwanted clothes by collecting them and redistributing them to people who need them for free.The new billboard is due to be erected on Tuesday.Savannah said it would not be the last time her face would be seen on a billboard. ",
        "She plans to erect more billboards around Australia and even overseas.Savannah hit out at complaints over the original billboard that children would be able to access her OnlyFans.'OnlyFans actually have layers of protection to stop underage people from accessing the site,' she told Perth's 6PR.'You need to have your licence. You need to have a credit card even just to access the free site.'"
    ]
}