{
    "articleURL": "/sport/football/article-12055363/Juventus-want-sign-Man-Uniteds-Mason-Greenwood-long-term-loan-deal.html",
    "content": [
        "Greenwood had rape and assault charges against him dropped in February He is yet to return to first team training with Man United in the months sinceJuventus are now keen to sign Greenwood on a long-term loan deal this summer Juventus are very keen on signing Manchester United forward Mason Greenwood this summer, according to reports.",
        "Greenwood was arrested on suspicion of rape and assault in January 2022, and was immediately suspended by United.The alleged charges were dropped in February, but Greenwood is yet to return to first team training while the club carry out their own internal investigation.Having not played for the Red Devils in over 16 months, Greenwood's future at Old Trafford is looking increasingly uncertain, but Juventus could offer him a chance to restart his career abroad as they want to sign him on a long-term loan deal, according to The Sun.The Italian giants have already reached out to Greenwood's representatives to gauge his interest.",
        "Greenwood's United contract runs until 2025, and the club are concerned that they will struggle to receive big-money offers for the forward. It is believed they would be willing to send him out on loan as long as the club he joins agrees to cover his £75,000-a-week wages. The report also claims that fellow Serie A sides AC Milan and Roma are interested in the 21-year-old, while Turkish clubs are monitoring Greenwood's situation.Juventus believe their pursuit of Greenwood could be helped by having his former team-mate Paul Pogba at the club.Greenwood and Pogba shared a dressing room for several years in Manchester, and the young striker may be tempted by the opportunity to be reunited with Pogba in Turin.",
        "Pogba moved to Juventus on a free transfer last summer after his United contract expired, although his first year has been significantly hampered by a knee problem that forced him to miss the World Cup.Juventus may also feel they have a strong chance of signing Greenwood due to the player's stance on his United future.The one-cap England international has reportedly told friends he does not expect to play for United again.Greenwood spoke to Erik ten Hag after the charges against him were dropped, but is understood to be frustrated at not being brought back into the first team fold.A source close to the youngster told The Sun last week: 'Mason believes he's finished at United.'He's sat at home kicking his heels and very frustrated.",
        "'He wants to get back playing football but realises his situation is very complicated and it's his own doing.'He is determined to play football again but doesn't think he'll ever pull on a United shirt ever again.'Prior to his suspension, Greenwood was viewed as one of the brightest talents to come out of United's academy in years, and he netted 35 goals in 129 appearances for the senior team.His club form earned him an England call-up and he made his debut in September 2020 against Iceland, but was sent home alongside Phil Foden shortly afterwards for breaching Covid rules by sneaking two girls into the team hotel. "
    ]
}