{
    "articleURL": "/wires/afp/article-12050539/Aid-workers-caught-crossfire-Sudans-bloody-war.html",
    "content": [
        "As Sudan's war plunges the impoverished country even deeper into humanitarian turmoil, aid workers face deadly risks in their efforts to provide desperately needed support.",
        "With almost non-stop bombardments, rampant looting and at least three major prison breaks in the capital, humanitarian workers complain they cannot even move around to ascertain the extent of the damage.\"We cannot go there to verify\" the looting that has occurred in different parts of the country, said Karl Schembri of the Norwegian Refugee Council (NRC).\"We can't risk our colleagues' lives.\"According to the International Medical Corps, at least 18 aid workers have already been killed amid the fierce urban street battles that broke out on April 15 between forces loyal to rival generals.",
        "The violence pits Sudan's de facto leader Abdel Fattah al-Burhan, who leads the regular army, against his deputy turned rival Mohamed Hamdan Daglo, who commands the powerful paramilitary Rapid Support Forces (RSF).Some 700 people have been killed in the fighting, according to the Armed Conflict Location and Event Data Project, while thousands more have been wounded and hundreds of thousands displaced.- No safe passage -The NRC has already lost one of its volunteers, Elsheikh Mohamed Omer, killed in the western Darfur region, which has already been ravaged by two decades of conflict.He was among at least 191 people killed in El Geneina, the capital of West Darfur state, where the aid group says \"dozens of settlements have been burnt and destroyed\".",
        "The region was already reeling from a conflict that erupted in 2003, killing at least 300,000 people and displacing 2.5 million, according to UN figures.That conflict saw former dictator Omar al-Bashir unleash the feared Janjaweed militia -- which formed the basis for the RSF -- to crush a rebellion by ethnic minority groups.Sylvain Perron, of Doctors Without Borders (MSF), said the current conditions had forced them to completely rethink their work strategies.\"The level of violence observed in Khartoum and Darfur against civilians and humanitarian workers is worrying,\" he told AFP.\"We are thinking about how to work in this context. We hope to operate with small teams of internationals and Sudanese workers, in partnership with civil society organisations, as soon as possible.\"MSF on Thursday said a \"surgical team has arrived in Port Sudan\".The UN's top humanitarian official, Martin Griffiths, made a lightning visit Wednesday to Sudan to try to negotiate safe passage for aid and aid workers, after six trucks laden with food supplies from the World Food Programme (WFP) were looted on their way to Darfur.Even before the current fighting, the UN had estimated that 15 million people -- a third of Sudan's population -- were already in need of aid to stave off famine.",
        "- 'Collateral damage' -",
        "Amid the chaos, safe passage has become elusive as humanitarian groups struggle to negotiate a conflict with no clear front lines, where control over neighbourhoods can change hands from one moment to the next.A spokesman for UN chief Antonio Guterres said \"nearly 17,000 metric tonnes\" of food aid had been looted in the fighting.The WFP \"is still trying to establish what quantities remain\" of the 80,000 tonnes of aid they had in the country before the conflict, Farhan Haq said.The problems are only compounded by the closure of banks, which makes it almost impossible to send much needed cash relief.\"It's a huge logistical problem,\" said the NRC's Schembri.With some hospitals having been shelled, only 16 percent of hospitals in the capital remain fully functional, according to UN estimates.The World Health Organization's regional director for the eastern Mediterranean, Ahmed al-Mandhari, had previously sounded the alarm over the growing threat of malaria and cholera, particularly as the rainy season approaches in the coming weeks.Even before the war, the WHO said Sudan accounted for 56 percent of malaria cases and 61 percent of deaths worldwide in 2020.Toby Harward, the UN refugee agency's principal coordinator in Darfur, said \"our facilities in Nyala in South Darfur and in El Geneina in West Darfur have been targeted by looters, criminals, bandits, out of control militias\".",
        "In El Fasher, the capital of North Darfur, \"we found ourselves on the front line of the conflict between the two sides, and many of our facilities took direct hits\", he told journalists, speaking from Nairobi.\"I stress we were not targeted, we were the subject of collateral damage,\" Harward said."
    ]
}