{
    "articleURL": "/tvshowbiz/article-12039205/Amanda-Seyfried-looks-fresh-outside-hotel-day-Met-Gala.html",
    "content": [
        "Amanda Seyfried looked fresh and rested on Tuesday morning outside the Carlyle Hotel in New York City.",
        "The Dropout actress was seen with little makeup on and her blonde hair down as she wore a black coat, blue jeans and black military boots.The star smiled at fans who waited outside for her as she held onto a black nylon purse before taking her black sunglasses off.This comes the day after the Big Love star stunned at the annual star-studded Met Gala.The 37-year-old wore an eye-popping nude leotard with beads everywhere that draped over her slim frame. ",
        "The gown was from Oscar de la Renta, and her jewelry from Cartier.She added open-toed metallic gold pumps. The performer, who won her first Golden Globe earlier this year for her starring role as Elizabeth Holmes in Hulu's The Dropout, styled her golden blonde tresses in voluminous tight curls that cascaded down her back. Despite oozing confidence at the Costume Institute Gala or the Costume Institute Benefit, Seyfried admitted in December that still gets nervous on the red carpet.'I really enjoy experimenting with fashion on photoshoots, but the red carpet is a different animal; it’s very brief and it’s very frantic,' she explained to Harper's Bazaar.The Oscar nominee continued: 'You don’t really have enough time. When I’m on a shoot, it feels more like acting – it’s more about the art in fashion, which is really fun for me.' ",
        "'You can take as long as you like to feel comfortable and make the clothing work for you, which just isn’t really the case on the red carpet,' Pennsylvania native, who is married to Thomas Sadoski, noted. ",
        "Seyfried then praised her longtime stylist Elizabeth Stewart for being 'so savvy' and 'amazing' at finding her 'pieces that she knows' suit her. 'She has these incredible relationships with designers,' the actress insisted. 'She understands what will look good on my body and she knows my boundaries with fashion, and I am so grateful for that.' Over the years, Seyfried said she has begun to prioritize comfort over everything. ",
        "'I think my style has really always stayed in one place – it has evolved here and there and of course my body has changed when I’ve had kids, but I have always been one to wear sweatpants as often as I can,' she mused.  The star also said jeans are a staple in her wardrobe and if something 'works for' her she doesn't 'move away from it.' 'I live on a farm for the most part now – no one is photographing me, so I just dress how I want,' she pointed out. Seyfried said she aspires to keep her style 'timeless' and to avoid 'trends' but acknowledged she might 'just not brave enough' just yet. ",
        "'I think that embracing what truly feels like you, and what you feel comfortable in is how you look your best,' she concluded. Kim Kardashian, Kendall and Kylie Jenner, Margot Robbie, Florence Pugh, Vanessa Hudgens, Lily James, Miranda Kerr and Gigi Hadid were also among the faces who will be at the Met Gala."
    ]
}