{
    "articleURL": "/femail/article-12050351/Shoppers-prefer-Coronation-chicken-Charles-quiche.html",
    "content": [
        "Sales of Coronation quiche ingredients have not increased, The Times reportsFor all the latest Royal news, pictures and video click hereThe Coronation quiche created in honour of the new King has had its limelight stolen as shoppers appear to favour Coronation chicken ahead of the celebrations this weekend.",
        "Quiches are filling up trolleys as a party food classic, but the raw ingredients needed to make the Coronation quiche have not been in popular demand, according to The Times.Meanwhile, searches for Coronation chicken - created for the crowning of the late Queen in 1953 - have doubled on the Waitrose website this week.As the nation prepares to come together for celebratory street parties, searches for festive favourites such as trifle have soared and bunting and flags have popped up across the country.But no supermarket has seen increased interest for the Coronation quiche ingredients, the newspaper reported.",
        "Appearing to take inspiration from the monarch's love of gardening, the dish features spinach, broad beans and tarragon. But it faced initial criticism when it was announced amid at a time when one of the key ingredients of the dish, eggs, was in national shortage.Even the most vocal royal supporters have since disparaged the dish with former Cabinet minister, Jacob Rees-Mogg, admitting that he will not be tucking into a coronation quiche because he finds the savoury meal 'disgusting'. 'I don't like quiche, it's disgusting, I wouldn't dream of having it - and it's got broad beans in it, which are loathsome,' he said.French food experts have also proposed that the proposed dish is not a quiche but is, instead, a tart. ",
        "Experts from the area of Lorraine, where the dish gained prominence, have insisted that there is only one kind of quiche – and that is a Quiche Lorraine.The Great British Bake Off judge Dame Prue Leith however has given her stamp of approval to the Coronation quiche, judging it to be 'absolutely delicious'.The chef and TV presenter became one of the first people to try the official coronation pastry at a special Big Lunch at Westminster Abbey in April, attended by faith leaders from across the country.",
        "A Big Lunch ambassador, Dame Prue, 83, praised the dish for being 'seasonal'.'The quiche was absolutely delicious,' she said. 'There was no soggy bottom, the custard was not overcooked and dry, and the balance of tarragon was perfect - a really good quiche.'Quiche is universal. Even cold, if the ingredients are right and the pastry is nice and buttery, it will taste great.'I remember when quiche Lorraine was something very special 60 years ago. It is still one of the best pastries to make.'The new Coronation dish was developed in close conjunction with the King and Queen Consort by the Royal Chef Mark Flanagan, at Buckingham Palace.Quiche was chosen because it is considered a good 'sharing' dish to take to a street party and can be served hot or cold.",
        "It also suits a wide variety of dietary requirements and preferences and is considered to be 'not too complicated to make or require costly or hard-to-source ingredients'.Former Buckingham Palace chef Darren McGrady said the King's choice came as no surprise because Charles loves any food containing eggs and cheese.Mr McGrady, who worked for the late Queen for 15 years, said he had made quiche for Charles many times.He wrote on Twitter: 'It's no surprise that the King Charles III has shared Coronation quiche to celebrate his Coronation.'His mother, The Queen loved chocolate, but The King loves anything with eggs and cheese.What's more, the late Queen was also said to be a fan of the savoury snack - and was particularly partial to a classic quiche Lorraine.But the dish that was created for the Queen's Coronation in 1953 - Coronation chicken - is still popular today, mainly as a sandwich filler.Created by Cordon Bleu-trained chef Rosemary Hume and food writer Constance Spry, the curry and mayonnaise cold chicken dish was created with ingredients that were readily-available in Britain, with post-war rationing only recently having ended."
    ]
}