{
    "articleURL": "/news/article-12060327/LA-Fire-crews-rescue-horse-stuck-narrow-wedge.html",
    "content": [
        "LA firefighters rescued a horse from a 'narrow wedge' over the weekendThe incident happened Sunday and rescuers were able to pull the horse outThe horse did not appear to be injured and walked away from the trench Los Angeles firefighters did not horse around when it came to rescuing a desperate and helpless animal stuck in a 'narrow wedge' over the weekend. ",
        "The horse became stuck in the enclosed space sometime in the late afternoon Sunday in the Sylmar neighborhood of Los Angeles, and just minutes away from one fire station. Photos and videos shared by the Los Angeles Fire Department show the horse lodged in the trench as personnel attempt to pull the animal to safety. After attempting multiple maneuvers, the horse was ultimately extracted from the hole and walked away, seemingly unhurt.   ",
        "According to officials with the Los Angeles Fire Department, firefighters first received a call about the stuck horse around 4.30pm. Urban Search and Rescue Task Forces from both Fire Stations 88 and 89 responded to the 14500 block of Olive View Drive for reports of a 'trapped horse.' LAFD Air Operations confirmed the animal's location before firefighters moved in to hike to the horse with tools in tow. The horse, according to LAFD, was 'inverted in the gap,' upon arrival. The firefighters worked to get the horse on its side in what they originally expected to take several hours. 'This is a dynamic situation with a number of options being assessed to determine the best approach,' LAFD said.A video of the incident showed more than a dozen firefighters standing around the horse, still trapped in the hole. ",
        "'Despite initial estimates, firefighters working together with a horse rescue specialist from LA Animal Services, they were able to quickly dig out and get the horse on its side and then upright,' LAFD said.",
        "In total, the rescue took mere minutes, firefighters said. 'The tremendous teamwork of all involved brought a swift and happy end to this potentially protracted incident,' the LAFD. Officials said after being pulled out, the horse 'walked out' and did not appear to have any injuries. It remains unclear what caused the horse to fall into the hole in the first place. 'The tremendous teamwork of all involved brought a swift and happy end to this potentially protracted incident,' the LAFD."
    ]
}