{
    "articleURL": "/wires/afp/article-12040761/US-Fed-likely-hike-rates-banking-fears-resurface.html",
    "content": [
        "The US Federal Reserve raised its benchmark lending rate for a tenth time Wednesday in a move that could be the last in the current cycle if the economy cools sufficiently.",
        "The central bank embarked on an aggressive campaign of rate hikes in March last year to take aim at price increases. But more than a year later, inflation remains stubbornly above its long-term target of two percent.The latest quarter-point increase lifts the target lending range to between 5.0 percent and 5.25 percent, the Fed confirmed in a statement, the highest in around 16 years.Tighter credit conditions for households and businesses are likely to weigh on the economy, the Fed said, adding that the extent of the impact \"remains uncertain.\"The policy-setting Federal Open Market Committee's (FOMC) latest decision was in line with expectations, leading analysts and traders to scrutinize the statement for any shift in the Fed's guidance on future decisions.In its statement, the Fed said it will \"take into account the cumulative tightening of monetary policy\" and the lags with which policy impacts the economy, when \"determining\" whether to hike rates again.This marks a departure from the last rate announcement in which policymakers said they expected \"additional policy firming\" could be needed to rein in inflation.\"Support for the 25 basis-point rate increase was very strong across the board,\" Fed Chair Jerome Powell told a press conference after the decision was announced.\"A decision on a pause was not made today,\" he said, later adding: \"People did talk about pausing but not so much at this meeting.\"",
        "- Banking woes -After a relatively calm period for banks following crisis-level concerns in March, this week saw the reemergence of turbulence with the collapse of California-based lender First Republic.The commercial bank's failure -- the second-largest in US history -- was announced early Monday along with a sale to JPMorgan Chase, with regulators hoping that fears would finally be calmed.",
        "But regional banks came under renewed pressure Tuesday, with some share prices declining by as much as 25 percent on concerns about the impact of interest-rate hikes on their financial health. Further declines were recorded on Wednesday.Powell sounded a more upbeat note on regional banks' financial prospects, telling reporters that the resolution and sale of First Republic was \"an important step toward drawing a line under that period of severe stress.\"- Tighter credit conditions -Powell also sounded positive on the US economy, telling reporters that the chance of avoiding a recession was \"more likely than that of having a recession,\" due to the enduring strength of the labor market.Minutes from the Fed's last meeting showed that the US central bank was forecasting a mild recession for later this year, suggesting differing views within the Federal Reserve on the outlook for the American economy.The broader US economic data remains mixed but is showing some signs of softening, with growth slowing to an annualized rate of 1.1 percent in the first quarter.",
        "The data on inflation paints a picture of slowing price increases in some areas and ongoing stubbornness in others, while figures on employment point to a weakening job market as the economy slows.Fed officials have in recent weeks suggested that the tighter lending conditions after Silicon Valley Bank's (SVB) dramatic collapse in March could act like an additional rate hike and help bring down inflation.Powell refused to be drawn on exactly how much of an impact tighter bank lending conditions could have on the Fed's decision-making.But he conceded that, \"in principle we won't have to raise rates quite as high as we would have had this not happened.\""
    ]
}