{
    "articleURL": "/wires/ap/article-12048271/Mississippi-ex-governor-release-texts-welfare-scandal.html",
    "content": [
        "JACKSON, Miss. (AP) - Former Mississippi Gov. Phil Bryant on Thursday released what he said were all of his text and email messages related to a welfare fraud investigation - including money spent on building a university volleyball arena that was pushed by NFL Hall of Famer Brett Favre.",
        "The 436 pages of messages had several that already appeared in court filings, including exchanges from 2017 to 2019 between the governor and the retired quarterback, with Favre saying he had agreed to raise money for the volleyball facility at the University of Southern Mississippi and asking Bryant for help with that effort.From 2016 to 2019, the Mississippi Department of Human Services misspent more than $77 million in welfare money that was supposed to help some of the poorest people in the U.S., according to the state auditor. Prosecutors have said the department gave money to nonprofit organizations that spent it on projects such as the $5 million volleyball facility on the Hattiesburg campus.Bryant, a Republican, finished his second and final term as governor in January 2020. Weeks later, the first criminal charges were filed against six people, including John Davis, a Department of Human Services director chosen by Bryant.Bryant earned a degree from the University of Southern Mississippi in 1977, more than a decade before Favre played football there. Favre´s daughter started playing volleyball there in 2017.Messages released Thursday show Favre and Bryant discussed the possibility of financial help for the volleyball project from Davis and Nancy New, a Bryant ally who ran a nonprofit organization that had Human Services contracts to spend welfare money.",
        "Bryant has previously said he found out in July 2019 that welfare money might have been misspent. In a text that month, Favre wrote to Bryant: \"I want you to know how much I love Nancy New and John Davis. What they have done for me and Southern Miss is amazing.\"Favre wrote that he and New's organization \"were planning to do workshops and youth clinics in the new Vball facility\" but \"I was informed today that she may not be able to fund her part. I and we need your help very badly Governor and sorry to even bring this up.\"Bryant responded: \"I will handle that... long story but had to make a change. But I will call Nancy and see what it will take.\"Days later, Bryant texted Favre to say the state auditor was reviewing Human Services contracts.\"Don't want to get anyone in trouble for improper expenditures,\" Bryant wrote.In a video posted online Thursday hours before he released text and email messages, Bryant repeated what he has said before - that he was the 2019 whistleblower who told the auditor's office about misdeeds at the Department of Human Services.\"The fact is, I did nothing wrong,\" Bryant said in the video. \"I wasn´t aware of the wrongdoings of others. When I received evidence that suggested people appeared to be misappropriating funds, I immediately reported that to the agency whose job it is to investigate these matters.\"",
        "The Mississippi Department of Human Services, with a new director, filed a civil lawsuit last year against Favre, three former pro wrestlers and more than three dozen other people and businesses to try to recover more than $20 million of the misspent money from the Temporary Assistance for Needy Families anti-poverty program.No criminal charges have been filed against Bryant, and he is not being sued. Attorneys for some of the defendants in the civil suit have filed court papers that include text-message exchanges between Bryant, Favre and others about spending welfare money on the volleyball arena.In November, Bryant's attorney cited executive privilege in seeking to block a subpoena that sought more information from the former governor. In March, three news organizations - the Northeast Mississippi Daily Journal, the Mississippi Free Press and Mississippi Today - filed papers opposing Bryant's effort to seal any information he would provide to the court.\"After much thought and discussion with counsel, I´ve made the decision to forgo any arguments about executive privilege on my text messages in this matter and simply release them all,\" Bryant said in Thursday's video. \"Frankly, I´m tired of paying legal fees to respond to lawsuits that I´m not a party to in order to protect my privacy and an executive privilege that should exist for future governors.\"",
        "Davis pleaded guilty last year in the welfare misspending case, as did New. Like Bryant and Favre, New attended the University of Southern Mississippi. As part of her guilty plea, she acknowledged her organization directed welfare money toward the volleyball arena and a pharmaceutical project backed by Favre. No criminal charges have been brought against Favre.This story has been corrected to show that the events took place Thursday, not Wednesday."
    ]
}