{
    "articleURL": "/wires/aap/article-12044279/NAB-profits-soar-higher-rates.html",
    "content": [
        "National Australia Bank has lifted first-half earnings and interim dividend on the back of higher interest rates and increased lending in its business and institutional segment.",
        "The earnings came below market expectations, prompting a slide in its share price as investors accounted for a toughening growth outlook amid rising interest rates.The lender reported half year cash profit of $4.07 billion, a 17 per cent improvement from the same period a year ago but below analyst estimates for a $4.15b profit.Statutory net profit for the six months to March 31 was up 11 per cent to $3.96b, while operating revenue jumped 19.3 per cent to $10.53b.Chief executive Ross McEwan attributed the strong profit to a deliberate choice to target growth in higher returning segments but added that high rates were now starting to affect households.\"As expected, the Australian home lending environment has become more challenging as households are faced with higher cost of living and higher interest costs,\" he told an analyst call on Thursday.\"The impact of cash rate increases on average monthly repayments are now becoming more meaningful with some further increases still to flow through to customers over coming months.\"NAB shares slid more than 7 per cent in early trading. By 11.55 AEST, the stock was still the worst performer among the major banks, down 6.4 per cent to $26.72 in a weak Australian market.The Reserve Bank on Tuesday lifted its cash rate by 25 basis points to 3.85 per cent, for its 11th increase since May 2022. NAB, along with peers CBA, Westpac and ANZ, has passed on the full increase to borrowers.",
        "On Thursday, NAB said its personal banking unit, which includes the home lending business, posted a 0.4 per cent decline in earnings for the half year amid fierce home loan competition and a rise in credit impairment.\"We've taken steps to moderate growth in home lending, given the current market dynamics, which has seen new loans written well below the cost of capital,\" Mr McEwan told reporters.On the other hand, cash earnings at its key business and private banking unit jumped 19.9 per cent to $1.7b. Institutional banking as well as the New Zealand unit also reported high double digit growth in earnings for the first half.Net interest margin - a key measure of profitability - rose 14 basis points from a year ago to 1.77 per cent, largely reflecting higher earnings on deposits and capital as a result of the rising interest rates.However, analysts believe margins have peaked and the coming months are likely to be tougher as economic growth slows down and bad debts rise.\"We expect earnings pressure to be more evident during the second half as further margin expansion is unlikely and the operating environment is likely to weaken, leading to higher credit impairment charges,\" ratings agency Moody's said after the results.NAB has seen a small uptick in customers overdue by 30 and 60 days and credit impairment charges are up at 0.11 per cent of gross loans, but remain well below long run averages, it said.",
        "The bank will pay a fully franked first-half dividend of 83 cents a share, up from 73 cents a share for the same period last year."
    ]
}