{
    "articleURL": "/wires/aap/article-12040391/Cleary-ex-assistant-Webster-head-head-NRL.html",
    "content": [
        "Penrith and the Warriors collide in the NRL's Magic Round at Suncorp Stadium on Saturday, but not quite under the circumstances most were recently predicting.",
        "Most notably, the reigning premiers are coming off a shock loss to last-placed Wests Tigers, going down 12-8 win in rain-soaked Bathurst on the weekend.Similarly, the high-flying Warriors have suffered two defeats on the bounce, going down 14-0 in similarly sodden conditions at home to an efficient Sydney Roosters team.Warriors coach Andrew Webster, whose side is struggling through a tough three-game stretch in just 12 days, said he didn't want to fill his players' heads with too much information about the Panthers' key players.\"You can get carried away looking at where all their strengths are. They've got some class players, so you have to be really smart on how you want to focus,\" he said.\"We've got to get back to our style of football and how that works for us. You have got to make sure you attack the game, be confident in yourself and go after it.\"Webster was formerly an assistant under Penrith coach Ivan Cleary, helping the Panthers to back-to-back premierships in 2021 and 2022. Despite that, he says this fixture doesn't hold any special significance.\"No...simply because getting a win in the NRL is exciting in itself.\" said Webster.\"I've got a lot of good friends and there's a lot of great people in Penrith but I just want to get the two points for the club. My honest motivation is to get that for everyone.\"",
        "On the battle between the two coaches' boxes, Webster said the personal side of it was not something he was focusing on.\"I talked to Ivan last week, just to see how his family was going. Nothing about football really,\" he said.\"I know everyone likes to build it up but at the end of the day Ivan and I aren't going to tackle each other. The players are going to do all the battling.\"I'm just grateful for all the opportunities that Ivan's given me, all the tools I've needed to be a good coach.\"Cleary said earlier this week that \"Webby is a great bloke, good coach.. and doing a great job. I think he suits that team and that club, I am happy for him and how he has started.\"He's got his fingerprints all over the team. The club itself is probably feeling pretty good about getting back home (after being based in Australia due to the pandemic).\"I can see they're happy and they're playing some pretty good footy.\"Despite this game being at Suncorp Stadium as part of Magic Round, it is designated as a home fixture for the Warriors and Webster was confident that there would be plenty of support from the New Zealand expat community.",
        "While it feels like they're up against it, there is one curious statistic in the Warriors' favour. The last three times Penrith have lost to Wests Tigers they've gone on to lose the following week as well."
    ]
}