{
    "articleURL": "/wires/reuters/article-12039493/Kosovo-Serbia-fail-agree-lowering-tensions-north-Kosovo-says-EU-policy-chief.html",
    "content": [
        "PRISTINA, May 2 (Reuters) - Leaders of Kosovo and Serbia failed to agree on how to lower tensions in Serb-majority areas in north Kosovo, EU foreign policy chief Josep Borrell said on Tuesday, warning that any further escalation could undermine the EU-backed deal on normalising ties.",
        "In March, Pristina and Belgrade verbally agreed to implement a Western-backed plan aimed at improving ties but little progress has been seen since.Some 50,000 Serbs who live in north Kosovo still refuse to take part in Kosovo institutions including police, judiciary and municipal governments they had left last November. They boycotted local election organized by Kosovo authorities last month.Borrell said that in a meeting with Kosovo Prime Minister Albin Kurti and Serbian President Aleksandar Vucic, he had expressed \"grave concern about the situation in the north Kosovo\" following elections \"with a very low turnout.\"He urged parties to compromise and warned that any further escalation could \"undermine\" the implementation of the EU-backed deal on normalising ties.Vucic and Kurti failed to agree on framework for securing greater autonomy for Serb-majority municipalities, which is a condition set by Serbs to participate in Kosovo institutions.Kurti told reporters that a draft proposal on greater autonomy for Serb-majority municipalities, which was presented in the meeting on Tuesday, was not in accordance with Kosovo constitution and cannot be accepted.\"I am very concerned,\" Vucic told reporters. \"It is clear that Pristina does not want to fulfill its commitments,\" he added, referring to the association of Serb municipalities.However, the two parties on Tuesday pledged to work together to locate Kosovo war-era burial sites to identify the remains of those still missing from the 1998-99 conflict.",
        "Almost 24 years later, 1,621 people remain missing from the war that left more than 13,000 people dead. The majority of those killed and missing are ethnic Albanians.Both parties have agreed to share documents, including those that are classified, and to use satellite data and other technology to detect the sites of suspected mass graves.The war began in 1998 when ethnic Albanians in Kosovo, then a province of Serbia, took up arms in an uprising against rule from Belgrade. It ended in June 1999 after NATO intervened. Kosovo was then governed administratively by the U.N.Kosovo declared independence in 2008 but Serbia refuses to recognize the statehood of its former province. (Reporting by Fatos Bytyci and Ivana Sekularac; Editing by Rosalba O'Brien and Lisa Shumaker)"
    ]
}