{
    "articleURL": "/news/article-12047685/Multiple-fatalities-confirmed-active-shooter-opened-fire-McDonalds.html",
    "content": [
        "Four people have been confirmed dead at the incident in Moultrie, GeorgiaPolice say that there is no immediate threat to the public following the incidentGeorgia Bureau of Investigations confirmed there are multiple scenesA mass shooter killed his mother and grandmother before gunning down the manager of a McDonald's where he worked.",
        "The suspected gunman then turned the firearm on himself, with police confirming that four people are dead after shootings at multiple locations in Moultrie, Georgia. Neither the victims nor the shooter have been identified. Colquitt County Coroner confirmed that the shooter killed his mother and grandmother at two neighboring homes in Moultrie.Witnesses have claimed that the woman who died at the fast food restaurant was the early morning manager, and that the shooter was also an employee there. Sabrina Holweger told AP that the man had killed the woman as she unlocked the door to let him in for his shift.",
        "She added that she saw the woman's body lying in the doorway of the restaurant just before 8am, with police swarming the area. A McDonald's spokesperson paid tribute to the worker, saying: 'We are devastated by the loss of our beloved restaurant manager, and our hearts go out to all the victims of this senseless act of violence. 'In the wake of this tragedy, we’re focused on offering employees grief counseling and other support, and the restaurant will be closed until further notice. We are working closely with the Georgia Bureau of Investigation (GBI) to assist in their investigation.' The Georgia Bureau of Investigations confirmed that they are currently investigating multiple scenes in the county. ",
        "Coroner Verlyn Brock was unable to confirm the identity of the shooter or victims, and could not say if the gunman knew the McDonald's worker. Jamy Steinberg, GBI special agent in charge, said: 'We are investigating multiple incidents and there are fatalities involved.'Police swarmed the restaurant on Thursday morning, shutting down traffic on one of the main streets in the south Georgia town of 15,000. The Moultrie Police Department Chief Sean Ladson confirmed that there is no immediate threat to the public.MPD officials requested that the GBI investigate the incidents and described it as an 'ongoing investigation.'McDonald's did not immediately respond to a request for comment when contacted by DailyMail.com.  ",
        "It comes just one day after Deion Patterson, 24,  killed Amy St. Pierre, 39,  and injured four others in an Atlanta hospital. Moultrie is in Colquitt County about 200 miles south of Atlanta, around a three hour drive.  Patterson fled the scene on foot and became the subject of an hours-long citywide manhunt. He was captured at about 8pm 'without incident' at a condominium complex in suburban Cobb County.The suspect's mother, Minyone Patterson, is a nurse and accompanied her son to his medical appointment on Wednesday. "
    ]
}