{
    "articleURL": "/wires/pa/article-12060331/King-Queen-say-nation-s-support-greatest-possible-coronation-gift.html",
    "content": [
        "The King and Queen have pledged to rededicate their lives to service as Charles called the nation’s support throughout the historic celebrations “the greatest possible coronation gift”.",
        "As the weekend of festivities came to a close, Charles issued a special written coronation message, saying: “We thank you, each and every one.”Traditional official portraits marking the crowning of Charles III and Queen Camilla were released to round off the monarchy’s landmark occasion.",
        "Among them, the King was captured in his full regalia – wearing the Imperial State Crown, holding the Orb and Sceptre with Cross, and dressed in his regal purple tunic and Robe of Estate, seated on a Throne Chair in the Throne Room at Buckingham Palace.Camilla was pictured alongside the King, and also in a solo portrait, wearing Queen Mary’s Crown, with the train of her lengthy embroidered Robe of Estate spread in front of her.The working royal family – the Prince and Princess of Wales, the Edinburghs, the Princess Royal and Vice Admiral Sir Tim Laurence, the Duke of Kent, the Gloucesters and Princess Alexandra – were also photographed stood with the King and Queen in the images by Hugo Burnand.",
        "The King, signing his words Charles R, said he and Camilla gave “our most sincere and heartfelt thanks to all those who have helped to make this such a special occasion”.The now-crowned monarch used his coronation message to issue an affirmation for the rest of his reign, saying he and Camilla would “now rededicate our lives” to royal service.",
        "He added: “To know that we have your support and encouragement, and to witness your kindness expressed in so many different ways, has been the greatest possible Coronation gift, as we now rededicate our lives to serving the people of the United Kingdom, the Realms and Commonwealth.”The King also paid tribute to the “countless people who have given their time and dedication to ensuring that the celebrations in London, Windsor and further afield were as happy, safe and enjoyable as possible”.",
        "Meanwhile, Prince Louis turned into a labourer as he joined Prince George, Princess Charlotte and the Prince and Princess of Wales by shovelling dirt, pushing wheelbarrows and operating a digger as they helped out at a Scout Hut in Slough as part of the national volunteering drive to mark the coronation.The five-year-old royal tried his hand at archery, making hand prints on a mural, and ended the day splashed with paint but got his reward – a smore, a marshmallow and chocolate sandwiched between two biscuits.Kensington Palace described it as the youngster’s first royal engagement.",
        "Although Louis has been at numerous big royal events from Trooping the Colour to the coronation, it is thought to be the first time he has actively participated in an official visit face to face with the public.",
        "While the King and Queen had quiet day away from the public eye after Sunday evening’s Coronation Concert, other royals joined in the Big Help Out.The Duke and Duchess of Edinburgh helped at a puppy class for trainee Guide Dogs in Reading, while the Princess Royal attend a County Civic Service recognising local volunteers in Gloucester Cathedral.",
        "Edward confessed the royal family was concerned Miss Piggy would gate-crash the royal box during the Windsor Castle musical extravaganza, after Kermit the Frog turned up and danced in front of the duke’s seat.“Everybody in the Royal Box was nervous when Miss Piggy would turn up,” he said.“There was an empty seat just behind me and we didn’t know who it was for.“We suddenly thought it could be her and once we started that rumour, everyone around us was very nervous.”",
        "The Duke of York – who stepped down from being a working royal after his controversial Newsnight documentary – was missing from the family group of royals in the official coronation portraits released so far.Andrew, who was at the coronation in his Order of the Garter robes, paid millions to settle a civil sexual assault case last year.The Duke of Sussex was also missing, no longer being a working royal, and having headed back to California shortly after the coronation ceremony.",
        "Edward and Sophie were seen to be sweetly offering support to the late Queen’s cousin Princess Alexandra, who was smiling broadly, with both assisting her by holding her arms.",
        "To one side of a crowned Camilla was her stepson and the heir to the throne, the Prince of Wales, and next to William, the Princess of Wales in her Alexandra McQueen dress and leaf embroidery headpiece by Jess Collett x Alexander McQueen.Camilla was next to the King, and on the other side of Charles was his sister the Princess Royal in military dress.Former Tatler photographer Hugo Burnand – a favourite of Charles and Camilla’s – took the couple’s official wedding photos in 2005, and for William and Kate’s nuptials in 2011."
    ]
}