{
    "articleURL": "/news/article-12052887/Louis-chance-shine-Camilla-keeps-low-profile.html",
    "content": [
        "Prince George, Princess Charlotte and Prince Louis will join the grand carriageThis will be the procession back to Buckingham Palace after the crowningREAD MORE:  King Charles Coronation LIVE: Harry arrives in UK and Kate dazzlesPrince George, Princess Charlotte and Prince Louis are set to steal the show at their grandpa's Coronation.",
        "The youngsters will join the grand carriage procession back to Buckingham Palace after witnessing him being crowned at the Abbey. The King and Queen will travel in the 261-year-old Gold State Coach, followed by three carriages carrying working members of the Royal Family.In the first carriage behind them will be the Prince and Princess of Wales, along with George, nine, Charlotte, eight, and Louis, five.George will also be a Page of Honour for the King.",
        "It will be the biggest public test for the three siblings, who are becoming increasingly confident under the eyes of the watching world.William and Kate have always fiercely protected their children's privacy, wanting them to enjoy as carefree an upbringing as possible while slowly introducing them to the unique public role they hold.Last year Louis was the standout star of his great-grandmother's Platinum Jubilee celebrations, entertaining the crowds with his antics on the Buckingham Palace balcony and in the audience at the Jubilee pageant. It is thought that he will be too young to attend tomorrow's concert in Windsor, however.The Queen Consort kept a low profile yesterday as she prepared for today's historic occasion. Camilla made only a brief appearance at the final rehearsal at the Abbey with King Charles in the morning.",
        "Seven thousand troops will be on ceremonial duties, with 4,000 taking part in the procession itself escorting the King and Queen from Westminster Abbey at 1pm.The Princess Royal will ride on horseback behind Charles and Camilla as Gold Stick in Waiting and Colonel of the Blues and Royals, to the rear of the Gold State Coach.The late Queen's cousin the Duke of Gloucester and his wife the Duchess of Gloucester, and Anne's husband Vice Admiral Sir Tim Laurence will travel in the third carriage,Following by car are the Duke of Kent and Princess Alexandra, also cousins of Elizabeth II, and completing the procession of royals.There is no place in the procession for the Duke of Sussex and the Duke of York, who play no formal part in the coronation ceremony, nor for Princesses Beatrice or Eugenie."
    ]
}