{
    "articleURL": "/wires/aap/article-12058649/Injured-Dangerfield-not-return-AFL-bye.html",
    "content": [
        "Geelong captain Patrick Dangerfield could be sidelined until after the club's mid-season AFL bye because of his hamstring injury.",
        "Dangerfield was substituted out of the Cats' win over his former club Adelaide on Saturday, having sustained the injury early in the third quarter.The 33-year-old premiership star was initially hopeful the injury would be just a minor setback.But Geelong football boss Simon Lloyd on Monday confirmed Dangerfield will be out of action for \"a few weeks\".The Cats take on Richmond on Friday night and have matches against Fremantle, GWS and the Western Bulldogs before a bye in round 13.\"Pat has been in fantastic form, so we are disappointed to lose him for the next few weeks,\" Lloyd said in a club statement.\"It's positive news that it's on the lower end of a hamstring injury.\"Pat has already commenced his rehabilitation program and will continue his strong leadership across our football program.\"The 2016 Brownlow Medal winner, Dangerfield told Fox Footy after Saturday's win that his age dictated the Cats would take a conservative approach with his recovery.Dangerfield had found form after a slow start to the season, averaging 27 disposals and 14 contested possessions in the four rounds before the Adelaide clash.His injury could re-open the door for out-of-favour midfielder Brandan Parfitt, who impressed in the Cats' VFL defeat to Southport last week.The outlook is slightly better for Western Bulldogs speedster Adam Treloar, who is expected to miss at least two matches because of a hamstring strain sustained during the win over GWS.",
        "\"Scans have revealed a strain to the hamstring, with the club to assess Treloar this week before determining a specific return to play plan,\" the Bulldogs said in a statement.Dogs forward Jamarra Ugle-Hagan faces a fitness test later this week, with an adductor issue putting him in doubt for the clash with Carlton on Saturday night.Essendon's defensive stocks have taken another hit after promising youngster Zach Reid sustained a hamstring injury in the VFL.Reid was on the verge of a senior recall and could have replaced Jordan Ridley, who is expected to miss multiple matches because of concussion following an off-the-ball incident with Port Adelaide's Junior Rioli.Jayden Laverde (shoulder) and James Stewart (foot) remain sidelined.Power captain Tom Jonas is expected to play against North Melbourne this week despite being substituted out of last round's win over Essendon following a knock to his chest."
    ]
}