{
    "articleURL": "/sport/football/article-12048199/Erling-Haaland-invites-former-kitman-watch-favourite-team-Leeds-face-Man-City.html",
    "content": [
        "Erling Haaland started his career in his homeland of Norway with Bryne FKHe has remained in touch with the club's kitman since he left the club in 2017Haaland has now surprised the kitman with a ticket to see Man City face Leeds Erling Haaland will have a piece of home at Manchester City's clash against Leeds United after surprising Bryne's kitman with a trip to the Etihad Stadium.",
        "A Leeds supporter, Kurth Gausland turned 60 in March and at his birthday party, a message from Haaland flashed up inviting him to Saturday's game.Haaland spent his formative years at Bryne and forged a close bond with Gausland as he broke into the first team as a teenager. The City striker went onto Molde, Borussia Dortmund and now the Premier League but the pair have remained in touch.Gausland will be accompanied by youth coach Espen Undheim, who played a role in Haaland's development in Norway, as well as two long-standing volunteers at the club.",
        "'Erling sent Kurth a video congratulating him from his apartment in Manchester,' Undheim told Mail Sport. 'He said, \"OK, now you're 60 I wanted to invite you to see your favourite team\".'Leeds are struggling a bit and Erling said: \"I'll invite you to see your lovely Leeds but I can't say that I won't score!\" It was quite surprising for him.' Haaland's father, Alfie, still lives in Bryne with his wife and their two daughters - both of whom are excelling at a local side.The 22-year-old's goalscoring exploits - breaking records with apparent ease during his first season - have not shocked those who knew him as they relished the chance to reconnect after the game.",
        "As a group, they often take in matches from all four top divisions in England while Bryne's marketing manager, Bjorn Hagerup Roken - a City fan - was at last week's thrashing of Arsenal.Roken made the trip with more than 60 others from the south-west of Norway as part of a Haaland Academy initiative, which is made up of sponsors and partners of Bryne comprising of local businesses.'Erling still has his family here,' Undehim added. 'When he comes home, he can use Bryne's stadium for his own personal training. 'He hasn't forgotten he was raised in Bryne.'"
    ]
}