{
    "articleURL": "/wires/pa/article-12045329/I-dead-without-Emmaus--Man-homeless-care-15-transforms-life-ice-skating.html",
    "content": [
        "A man who was put into care aged 15 before becoming homeless in his 20s, feeling the cold in his “bones” and contemplating suicide, has transformed his life with ice skating and said he “would be dead” if it were not for charitable help that introduced him to the sport and gave his life “purpose”.",
        "Brad Gigg, 26, who lives in Oxford, said his start in life was “pretty rocky” after he lived in an “abusive” home from the age of eight.He was diagnosed with attention deficit hyperactivity disorder (ADHD) at the age of 13 – a condition which affects people’s behaviour – and struggled to “accept boundaries” and “follow rules”, which meant he was “nigh-on uncontrollable”.He said he was excluded from school and started going out more, “drinking at all hours”, smoking weed, getting into fights, and being “beaten up”, until one day, aged 15, he said he came home and saw his belongings had been left at the front door.At this point, Brad said he felt he had “nothing”, and he spent the following two and a half years with different families in care.",
        "He lived in various properties after leaving the care system, but since he was struggling with his mental health and living a life of “soulless isolation”, he stopped looking for jobs, could not afford his rent, and became homeless aged 23.However, with the help of Emmaus Oxford – a charity that supports people to work their way out of homelessness – he was offered a second chance and has “changed his life for the better” and, at the height of his depression, discovered a new hobby of ice skating.",
        "He now ice skates several times per week and wants to become a learning mentor to support vulnerable teenagers and to “stop kids going through the life” he has had.“I would be dead if not for Emmaus,” Brad said. “I cannot convey the level of support and help that I got from Emmaus.“They’ve not only saved my life, but they’ve given my life purpose and changed it for the better.”Brad explained that his time in care was “like night and day” and he lived with various families – known as “placements” – over a two and a half-year period.",
        "He said he lived with some “lovely” carers, but leaving the system aged 18 was “the biggest blow to his life”.While he had an aftercare team, moved into his own flat and secured a job, after about a year on his own he “started to collapse, mentally”.“I stopped talking to people, I stopped going outside, I stopped buying food that was good and would last; I spent all my time playing a game on my phone,” Brad said.“I didn’t ask for help, I stopped paying rent, I stopped going to jobseekers, so therefore I couldn’t pay rent, I didn’t look for work, and I just existed for a year.",
        "“All that came to an end when I was removed from the flat, but I think, after a life of feeling like I’m secluded, never really being able to turn to anyone or physically ask for help without feeling like I’m going to be rejected, I feel like it was all doomed to fail.”Brad was then housed in a B&amp;B after contacting his local council, but since “his life had been so shattered”, he became “selectively mute” for several years.",
        "He feels the trauma from his past caught up with him and he “completely shut down”.He then lived with a friend before moving in with his then-girlfriend, but after that relationship ended and he had nowhere else to go, Brad was introduced to Emmaus Oxford, aged 20.Brad said Emmaus Oxford housed him and helped him find a new job, but after about a year his mental health started to “implode”.He said he became “aggressive” towards others, his ADHD worsened, and he ended up being transferred to other Emmaus branches before becoming homeless aged 23.Brad then spent the winter months living in a tent on the streets in Oxford.“I never really realised how cold cold could get,” Brad said.“It was the kind of cold where you would step out in the morning and your bones would get cold before your skin did; it’s a horrific feeling.",
        "“You’d have to spend 20 minutes warming yourself back up again.”Brad said he managed to obtain meals from food banks and find places to wash, but “the thing he missed most about living on the streets was a plug socket”.He would use his phone to speak to friends and his mother, as they had started to talk again, and look for jobs, but once he ran out of battery, he was cut off from the world.He continued: “It represented the ability to live my life autonomously.“I had to rely on the grace of others to charge my phone; I had to wait for certain periods or to have Wi-Fi, and then I could start living my life again.“That, to me, was the biggest loss, not being able to live life as a human being.”While Brad said being homeless was extremely difficult, it gave him the opportunity to reflect on his actions, and he decided to contact Emmaus Oxford again.",
        "By this point, aged 25, he said he had accrued around £6,000 of debt, “felt incredibly depressed”, and had contemplated suicide.However, he said it was at the height of his depression that he discovered ice skating.“One day, I was feeling low, and something just came into my brain and said, ‘If you don’t do anything, if you isolate again, you’re going to kill yourself’,” he said.",
        "“Part of me didn’t want to die, even if I felt like I deserved it, so I looked at things I could do and what I’ve done before, and in the Venn diagram, ice skating was in the middle.“I just decided to start doing that; I needed a hobby, I needed a place where I could go to socialise, to force myself to talk to people, and I’ve never really looked back.”Brad feels his main strengths are his “incredible ability to adapt” and his “tenacity” – and he wanted to prove to Emmaus Oxford that he had changed.",
        "One day, he cycled nearly 10 miles from Cowley to Abingdon in Oxfordshire to enquire about a new job.After Emmaus Oxford heard of his efforts, Brad said they offered him another chance and provided him with accommodation and a job, and he now works as an Emmaus Companion.Brad feels the charity saved his life and made him feel he was “worth something to people”.“Going from I may not have that second chance, to then finding out that I’d not only earned it, but I got it, made me feel like maybe I’m not a lost cause,” he said.Through the charity, Brad has received support for his mental health and ADHD, and he is continuing to ice skate several times a week, as he loves the “rush” of the sport.",
        "He has also started talking to community groups about Emmaus and homelessness, including a local school, and taking part in fundraisers, which has been rewarding.He hopes to study to become a learning mentor to help others and “give back”, and he wishes to stress the importance of asking for help, as that is one of his biggest regrets.“I want to stop kids going through the life I have, and if I can stop it with my life experience, that would be the ultimate goal for me,” he said.“But if I could give any advice, I’d say, just beg for help.“Ask anyone – ask your council, ask a friend – just find someone, because I believe all of my problems could have been solved if I had just asked for help, but I never knew that I could.”To find out more about Emmaus, visit emmaus.org.uk."
    ]
}