{
    "articleURL": "/wires/pa/article-12052401/Post-Office-chief-executive-apologises-unapproved-bonuses-linked-Horizon.html",
    "content": [
        "The chief executive of the Post Office has apologised for paying himself and other senior officers unapproved bonuses relating to the Horizon IT Inquiry.",
        "Unbeknown to the inquiry’s chair, retired High Court judge Sir Wyn Williams, the Post Office authorised the payments based on a target executives had set themselves.Letters between the Post Office and inquiry representatives published on Friday reveal that “remunerations” were awarded for the executives succeeding in supplying “all required evidence and information on time”.The Post Office’s annual financial report also states that the payments were signed off by Sir Wyn, which they were not.",
        "After a solicitor to the inquiry, Segun Jide, wrote to the Post Office to seek clarification on this, the company’s chief executive, Nick Read, apologised and said he would return his bonus.In his letter on behalf of the Post Office addressed to Sir Wyn, Mr Read admitted that it had failed to seek approval on the payments, which he conceded was an “unacceptable error on our part”.Mr Read said: “I would like to reassure you that we continue to work hard as a business to support every aspect of the inquiry’s work and are determined to put the interests of the postmasters affected first.“Our clear intent remains to offer full and fair compensation as quickly as possible and we are doing all we can to work with the Government to achieve that.",
        "“I will personally continue to ensure that the business gives the utmost support to you and the inquiry team so that all the lessons can be learned from this Horizon IT scandal.”Sir Wyn wrote back to Mr Read thanking him for “taking the trouble to personally apologise to me on behalf of the Post Office”, and advised him that the letters would be made public."
    ]
}