{
    "articleURL": "/wires/reuters/article-12051377/Stock-leave-Ukraines-Kherson-faces-weekend-curfew.html",
    "content": [
        "Weekend curfew announced in Ukrainian city of Kherson",
        "Russian attacks killed 23 people on Wednesday - officialsUkraine is expected to start a counter-offensive soon(Adds comment)By Elizabeth Piper and Vlad SmilianetsOUTSKIRTS OF KHERSON, Ukraine, May 5 (Reuters) - Some residents left the southern Ukrainian city of Kherson in cars and buses on Friday, and others stocked up on groceries, before a weekend curfew imposed as Kyiv prepares for a counter-offensive against Russian forces.The announcement of the unusually long curfew, due to last 58 hours from Friday evening to Monday morning, has prompted speculation in Kherson that the city is about to used as a launch point for the counter-attack.Some residents left because they were scared, others because they did not want to spend most of the weekend indoors.Senol Gezer, a 56-year-old man originally from Turkey, said he and his wife were going to a hotel in nearby Odesa.\"We are not afraid. We do not want to sit at home. We have time to leave,\" he said, filling his car with petrol.\"The authorities say they will clean up the collaborators (accused of cooperating with the Russians). But that is what the authorities are saying. I think something big is about to start soon. These are preparations for that, most likely.\"",
        "Local authorities gave little away about the reason for the curfew, beyond saying it was intended to enable law enforcement agencies to \"conduct their activities in Kherson\".No one will be allowed to enter or exit the city during the curfew, and residents must limit their movements to short walks outside their homes.DAILY BOMBARDMENTIt is the latest inconvenience for residents who, after enduring months of Russian occupation last year, have been subjected to daily bombardments by Russian troops encamped nearby on the other side of the River Dnipro.Despite their retreat from Kherson city last November, Russian forces still hold large swathes of territory in the wider Kherson region which Ukraine wants to recapture.Russian shelling on Wednesday killed 23 people in Kherson city, and attacks on Ukrainian-controlled parts of the Kherson region continued on Friday, regional authorities said.Iryna Chupryna, a 51-year-old former real estate manager, said she had to stay in Kherson to look after her mother and her brother. Both are invalids.\"Everybody understands it (the curfew). It means it is necessary for our military,\" she said.\"The Russian occupiers ... were in Kherson for nine months. They know, they know every location, and where there are more people, and they hit exactly there. And if the days are tense, and they should be sat through, we understand it.\"",
        "(Reporting by Elizabeth Piper; editing by Timothy Heritage)"
    ]
}