{
    "articleURL": "/tvshowbiz/article-12040191/Olivia-Wilde-Margaret-Zhang-make-light-wearing-DRESS-Met-Gala.html",
    "content": [
        "Olivia Wilde and Vogue China editor-in-chief Margaret Zhang donned versions of the same Chloe dress to Monday night's Met Gala.",
        "And on Tuesday the 39-year-old House actress and 29-year-old fashion journalist took to social media to make light of the occurrence.The Don't Worry Darling director appeared on Instagram to share a post featuring three images - one of her, one of Margaret, and one of a model wearing the original design from the 80s.Showing she was not upset by what some considered a faux pas, she noted, 'Great minds,' with an emoji wearing sunglasses.Remaining cool, calm, and collected, she added, 'If you're gonna twin with anyone, make it @margaretzhang.'",
        "And Margaret, who began her career as a blogger, reshared the post and added a clever response of her own.Referencing the violin-inspired gowns, she wrote, 'Cue the strings,' along with bicep and instrument emojis. The reactions didn't end there - Olivia took it one step further as she reposted a meme in her Instagram Stories.A fan account shared a photo of each woman and next to Olivia's picture wrote, '1:1 with my boss.'Then, next to Margaret's snapshot, 'Zoomies with my fave coworker.'The mother-of-two, who shares kids with ex Jason Sudeikis, added a crying laughing emoji, displaying her sense of humor about the whole thing.Although the women arrived to fashion's biggest night in the same look, they each brought their own sense of style to it.",
        "The actress wore a white variety with longer sleeves and patterned gold cuffs on her forearms. ",
        "And Margaret rocked the frock in black - hers with abbreviated sleeves, plus a long cape.She skipped the cuffs and also made a loud statement with her signature bright blue hair styled in a long, straight bob.She accessorized with gold jewelry and rocked precise, black, winged liquid eyeliner.On Monday evening, fans on social media couldn't help but make jokes about the ensembles, while others wondered how it happened in the first place.'I can't tell if it's supposed to be a guitar or a maxi pad with no wings,' wrote one person about the Karl Lagerfeld design. 'FIGHT, FIGHT, FIGHT,' read another tweet. And another said: 'Omg RIP to whoever is getting fired for this.''Well that's embarrassing,' someone else tweeted.'I'd be pissed,' a different user wrote. Another agreed, 'They should hide away for the next year.'",
        "Someone else asked, 'How is this even possible?''I thought all the outfits were approved beforehand? Someone's in trouble,' read another post.Other social media users argued over who wore it better, while some slammed the dress - branding it as 'ugly.'For a Met Gala after party, Wilde slipped into another Chloe design - a metallic silver netted dress that showed off her gym-honed figure. ",
        "And once again proving she was utterly unfazed by wearing the same dress as Zhang, on Tuesday morning she shared a selfie from the comfort of her bed.The star wore a plush white robe as she held the camera overhead and squinted her eyes.She playfully wrote across the snapshot, 'Oh good morningftrnoon.' "
    ]
}