{
    "articleURL": "/wires/pa/article-12039725/Co-op-doubles-paid-leave-bereaved-staff-market-leading-policy.html",
    "content": [
        "The Co-op has doubled the length of paid leave available for bereaved staff in what is says is a market-leading policy for the retail sector.",
        "The convenience chain – and the UK’s largest funeral provider – said its 57,000 employees can take up to 10 days paid leave when someone close to them dies or is seriously ill, up from five.The new policy also gives managers flexibility to give staff more days of paid leave if they think it is needed.It comes after energy provider Ovo Energy announced a new policy earlier this year giving staff unlimited and fully paid compassionate leave, including for any kind of pregnancy-related loss such as miscarriage. It’s my hope that other organisations step up and adopt this important and inspiring change from our colleagues at Co-op  Steven Wibberley  All UK employees are entitled to a “reasonable” amount of time off work if someone close to them dies, but it is down to the employer to decide how long and there is no legal right for the time off to be paid.The Co-op said its new policy is market leading among retailers, also because it is available to staff from their first day of employment.",
        "The firm emphasised that the person who has been bereaved does not have to be an immediate family member – for example, it can be a friend, colleague or cousin.Steven Wibberley, chief executive at Cruse Bereavement Support, the UK’s largest bereavement charity, said: “Bereavement and grief is an entirely personal experience and this refreshed policy allows for people to take the time away from work and grieve in whatever way they need.",
        "“It’s my hope that other organisations step up and adopt this important and inspiring change from our colleagues at Co-op, so that more grieving people are treated with kindness and respect by their employees at the times that they really need it.”The Co-op launched a new policy last year giving its staff paid time off to attend medical appointments while undergoing fertility treatment, including people using a surrogate.But the retailer slashed around 400 jobs last summer after facing tough trading conditions blamed on high inflation, as part of a transformation plan under recently appointed chief executive Shirine Khoury-Haq.The group said earlier this month that inflationary pressures are expected to continue this year and affect its short-term profitability."
    ]
}