{
    "articleURL": "/news/article-12051977/Moment-Iowa-news-anchor-28-breaks-reveals-breast-cancer-diagnosis-live-air.html",
    "content": [
        "Today in Iowa anchor Calyn Thompson grew emotional as she spoke to viewersThe news anchor revealed she has completed six chemotherapy treatments 'If I can help even one person, it will be worth it,' Thompson told her TV audienceA local television news anchor has bravely revealed that she has breast cancer live on air. ",
        "Today in Iowa anchor Calyn Thompson broke down in tears as she announced the diagnosis - just months after she did a segment on mammograms for breast cancer awareness month. 'Little did I know that interview would foreshadow the beginning of my own journey,' Thompson, who was diagnosed two weeks after she turned 28, told WHO 13 News viewers on Wednesday morning. She grew emotional as she told viewers that there were some days when she 'didn't feel like getting up', but she felt compelled to open up in the hopes of helping others. 'If I can help even one person, it will be worth it,' she told her TV audience. ",
        "In October last year, Thompson did a segment for the show reminding viewers to stay up to date with mammograms - an X-ray which is used to look for early signs of breast cancer. On Wednesday morning, her announcement began with a clip from the segment, before turning to Thompson in the studio. She said: 'Each day you welcome us into your homes so we can share the stories of others. 'Rarely are we the ones the story is about, but I wanted to share something personal with you that’s taking place in my life.'Growing emotional, she said: 'This past November, I was diagnosed with breast cancer. ",
        "'My medical team is confident it is treatable and curable, and I am completely confident in my medical team.'Stopping for a moment, she apologized to viewers, saying 'Sorry, I didn't think I would get emotional.' ",
        "She continued: 'I have completed six chemotherapy treatments, and it feels so good to have that hurdle behind me.'It was a shock when I found out I had breast cancer. And it honestly took me several weeks to process it.' She told viewers that she hoped that by sharing her own story and using her platform to spread awareness, she might be able to help 'even one person' and that would 'be worth it.' Growing tearful, she told the audience that she was diagnosed two weeks after she turned 28.'I’ve learned cancer doesn’t discriminate; not with age or profession, it can happen to anyone,' she said. 'Don’t put off preventative screenings. And if something doesn’t feel right like it didn’t for me, please go get it checked out by your doctor. Early detection does save lives.'She told viewers that she was also sharing her story as a form of thanks.'Helping you start your day each morning is a responsibility I don’t take lightly, and little do you know how much you’ve been helping me these past five months,' Thompson continued.  ",
        "Tears were seen streaming down her face as she said: 'There were some mornings I didn’t feel like getting up and going, but you helped me find the strength to get here and deliver the news. 'Coming to work every day has been the sense of normalcy and purpose I’ve needed to get through this medical journey.'",
        "She also thanked her coworkers for being 'supportive, caring, and understanding' through her journey. Thompson finished by revealing that she would be undergoing surgery later this month, and would be taking a few weeks off for recovery.Users have taken to social media to send their well wishes to Thompson. One person told the anchor: 'You had me crying right along with you this morning. I will be praying for you. You are all like family to your viewers because you are in our homes every day. I know you will fight and win this battle.'Another said: 'Going through the same thing right now! We will get through this,' while another user wrote 'I can't imagine how hard it's been to get up early and do your job while feeling so sick. You are so strong!'. Each year, about 264,000 cases of breast cancer are diagnosed in women in the US.Guidelines currently state that women ages 50 to 74 should get screened for breast cancer every other year. ",
        "Those in their 40s who are concerned should make an individual decision with their clinician. A study released in February warned tens of thousands of Americans have missed out on breast and lung cancer screenings over the two years since the Covid pandemic began.Researchers at the University of Texas looked at data from 5.3 million screenings recorded annually in the three years before Covid to establish a baseline and compared them to those carried out in 2020 to 2022.They found there were up to 14 percent fewer screenings for breast cancer during the pandemic. ",
        "Breast cancer is one of the most common cancers in the world. Each year in the UK there are more than 55,000 new cases, and the disease claims the lives of 11,500 women. In the US, it strikes 266,000 each year and kills 40,000. But what causes it and how can it be treated?What is breast cancer?Breast cancer develops from a cancerous cell which develops in the lining of a duct or lobule in one of the breasts.When the breast cancer has spread into surrounding breast tissue it is called an 'invasive' breast cancer. Some people are diagnosed with 'carcinoma in situ', where no cancer cells have grown beyond the duct or lobule.Most cases develop in women over the age of 50 but younger women are sometimes affected. Breast cancer can develop in men though this is rare.Staging means how big the cancer is and whether it has spread. Stage 1 is the earliest stage and stage 4 means the cancer has spread to another part of the body.The cancerous cells are graded from low, which means a slow growth, to high, which is fast growing. High grade cancers are more likely to come back after they have first been treated.What causes breast cancer?A cancerous tumour starts from one abnormal cell. The exact reason why a cell becomes cancerous is unclear. It is thought that something damages or alters certain genes in the cell. This makes the cell abnormal and multiply 'out of control'.Although breast cancer can develop for no apparent reason, there are some risk factors that can increase the chance of developing breast cancer, such as genetics.What are the symptoms of breast cancer?The usual first symptom is a painless lump in the breast, although most breast lumps are not cancerous and are fluid filled cysts, which are benign. The first place that breast cancer usually spreads to is the lymph nodes in the armpit. If this occurs you will develop a swelling or lump in an armpit.How is breast cancer diagnosed?Initial assessment: A doctor examines the breasts and armpits. They may do tests such as a mammography, a special x-ray of the breast tissue which can indicate the possibility of tumours.Biopsy: A biopsy is when a small sample of tissue is removed from a part of the body. The sample is then examined under the microscope to look for abnormal cells. The sample can confirm or rule out cancer.If you are confirmed to have breast cancer, further tests may be needed to assess if it has spread. For example, blood tests, an ultrasound scan of the liver or a chest x-ray.",
        "How is breast cancer treated?Treatment options which may be considered include surgery, chemotherapy, radiotherapy and hormone treatment. Often a combination of two or more of these treatments are used.Surgery: Breast-conserving surgery or the removal of the affected breast depending on the size of the tumor.Radiotherapy: A treatment which uses high energy beams of radiation focussed on cancerous tissue. This kills cancer cells, or stops cancer cells from multiplying. It is mainly used in addition to surgery.Chemotherapy: A treatment of cancer by using anti-cancer drugs which kill cancer cells, or stop them from multiplyingHormone treatments: Some types of breast cancer are affected by the 'female' hormone estrogen, which can stimulate the cancer cells to divide and multiply. Treatments which reduce the level of these hormones, or prevent them from working, are commonly used in people with breast cancer.How successful is treatment?The outlook is best in those who are diagnosed when the cancer is still small, and has not spread. Surgical removal of a tumor in an early stage may then give a good chance of cure.The routine mammography offered to women between the ages of 50 and 70 mean more breast cancers are being diagnosed and treated at an early stage.For more information visit breastcancernow.org or call its free helpline on 0808 800 6000"
    ]
}