{
    "articleURL": "/wires/ap/article-12040457/US-Mexico-agree-tighter-immigration-policies-border.html",
    "content": [
        "WASHINGTON (AP) - U.S. and Mexican officials have agreed on new immigration policies meant to deter illegal border crossings while also opening up other pathways ahead of an expected increase in migrants following the end of pandemic restrictions next week.",
        "Homeland Security adviser Liz Sherwood-Randall spent Tuesday meeting with Mexico President Andres Manuel Lopez Obrador and other top officials, emerging with a five-point plan, according to statements from both nations.Under the agreement, Mexico will continue to accept migrants from Venezuela, Haiti, Cuba and Nicaragua who are turned away at the border, and up to 100,000 individuals from Honduras, Guatemala, and El Salvador who have family in the U.S. will be eligible to live and work there.Despite sharing a 1,951-mile border with the U.S., Mexico had been notably absent from the rollout last week of a fresh set of efforts, including the creation of hubs outside the United States where migrants could go to apply to legally settle in the U.S., Spain or Canada. The first centers will open in Guatemala and Colombia.The COVID-19 restrictions have allowed U.S. officials to turn away tens of thousands of migrants crossing the southern border, but those restrictions will lift May 11, and border officials are bracing for a surge. Even with the restrictions, the administration has seen record numbers of people crossing the border, and President Joe Biden has responded by cracking down on those who cross illegally and by creating new avenues meant as alternatives to a dangerous and often deadly journey.",
        "Mexico's support is critical to any push by the U.S. to clamp down at the southern border, particularly as migrants from nations from as far away as Haiti are making the trek on foot up through Mexico, and are not easily returned back to their home countries.",
        "With Mexico now behind the U.S., plus an announcement Tuesday that 1,500 active-duty U.S. troops are deploying south for administrative support, and other crackdown measures in place, border officials believe they may be able to manage overcrowding and other possible issues that might arise once the COVID-19 restrictions end.Biden, who announced his Democratic reelection campaign a week ago, is trying to signal his administration is making a serious effort to tamp down the number of illegal crossings, which has been a potent source of Republican attacks. He also is trying to send a message to potential border crossers not to attempt the journey.But the effort also draws potentially unwelcome comparisons to Biden´s Republican predecessor, Donald Trump, whose policies Biden frequently criticized. Congress, meanwhile, has refused to take any substantial immigration-related actions.The U.S. will continue to turn away Cubans, Haitians, Nicaraguans and Venezuelans who cross illegally. Mexico said Tuesday it would continue to accept up to 30,000 migrants per month from the four countries that are making up a ballooning share of the overall illegal border crossings, with no easy way to quickly return migrants to their home countries.",
        "According to data on asylum seekers in Mexico, people from Haiti remained at the top with 18,860 so far this year, higher than the total for the whole of 2022.Meanwhile, the U.S. is accepting 30,000 people per month from the four nations for two years and offering them the ability to legally work, as long as they come legally, have eligible sponsors and pass vetting and background checks.The administration also plans to swiftly screen migrants seeking asylum at the border itself, quickly deport those deemed as not being qualified, and penalize people who cross illegally into the U.S. or illegally move through another country on their way to the U.S. border.In addition, 1,500 active-duty personnel will be deployed to the border area for 90 days and will be pulled from the Army and Marine Corps. Defense Secretary Lloyd Austin will look to backfill those troops with National Guard or Reserve troops during that period, Pentagon spokesman Air Force Brig. Gen. Pat Ryder said. There are already 2,500 National Guard members at the border. They are not working in a law enforcement capacity, but their mere presence sends a message.Then-President Trump deployed active-duty troops to the border to assist border patrol personnel in processing large migrant caravans, on top of National Guard forces that were already working in that capacity.",
        "White House press secretary Karine Jean-Pierre downplayed any similarity between Biden's immigration management and Trump's use of troops during his term. \"DOD personnel have been supporting CBP at the border for almost two decades now,\" she said. \"So this is a common practice.\"But some in Biden's own party objected to the decision.\"The Biden administration´s militarization of the border is unacceptable,\" said Senate Committee on Foreign Relations chair Bob Menendez, D-N.J. \"There is already a humanitarian crisis in the Western Hemisphere, and deploying military personnel only signals that migrants are a threat that require our nation´s troops to contain. Nothing could be further from the truth.\"The Pentagon on Tuesday approved a request for troops made by the Department of Homeland Security, which manages the border.As a condition for Austin´s previous approval of National Guard troops to the border through Oct. 1, Homeland Security had to agree to work with the White House and Congress to develop a plan for longer-term staffing solutions and funding shortfalls to maintain security and immigration processing without the use of Defense Department resources, Pentagon officials said.As part of the agreement, the Pentagon has requested quarterly updates from Homeland Security on how it would staff its border mission without service members. It was not immediately clear if those updates have happened or if border officials will be able to meet their terms of the agreement - particularly under the strain of another expected migrant surge.",
        "___Associated Press writers Aamer Madhani, Tara Copp, Zeke Miller, Rebecca Santana, Lolita Baldor and Michael Balsamo in Washington and Maria Verza in Mexico City contributed to this report."
    ]
}