{
    "articleURL": "/wires/ap/article-12053323/Rooker-Laureano-A-s-outslug-Royals-12-8.html",
    "content": [
        "KANSAS CITY, Mo. (AP) - Brent Rooker and Ramón Laureano hit back-to-back homers, Ryan Noda drove in three runs and the Oakland Athletics outslugged the Kansas City Royals 12-8 on Friday night in a matchup between the bottom two teams in baseball.",
        "Kyle Muller became the first A's starter to earn a win in 33 games this year. The drought was the longest to begin a season in MLB history, according to the Elias Sports Bureau.\"It´s been a long time coming,\" Muller said. \"We have had some opportunities and fell a little short. I don´t think the performance was worthy of the first win because we´ve had some guys have some good outings. We´re just going to keep rolling from here.\"Rooker, Noda, Esteury Ruiz and Tony Kemp each had three of Oakland's 17 hits, a season high. Ruiz and Noda both scored three times as the A's improved to 7-26 with only their second victory by more than one run.Nick Pratto homered for the Royals (8-25), who dropped to 2-15 at home. They shaved a seven-run deficit to 9-8 before Oakland scored three times in the final two innings.\"This club has shown a lot of fight and resilience to fight back, and we had a tough series against Seattle and lost some of those games we couldn´t tack on runs,\" A´s manager Mark Kotsay said. \"Tonight in the eighth inning we were able to tack on those (two) extra runs, which was breathing room.\"",
        "Rooker launched a two-run homer in the third inning and Laureano followed with a drive to left-center that made it 4-0. It was Rooker´s 10th home run of the season, second-most in the American League.",
        "Rooker hit an RBI double in the fourth and Kemp chased Royals starter Brad Keller with a run-scoring double in the fifth.Keller (2-3) gave up six earned runs, 11 hits and four walks over 4 1/3 innings.Noda added a two-run double in the fifth to make it 9-2 - the biggest lead for Oakland this season.Muller (1-2) gave up a two-run homer to Pratto in the fourth. The left-hander went 5 1/3 innings, allowing five runs and eight hits. He walked three and struck out one.For the second consecutive game, the Royals fought back from a big deficit but couldn´t complete the comeback. A two-run triple by Hunter Dozier trimmed it to 9-8 in the seventh.\"I mean, disappointing. Or, you know, we don´t expect to do that,\" manager Matt Quataro said about falling into a big hole for a second straight game. \"That is what is frustrating is that we know our guys can perform better than that and they know that. That is where the frustration comes, the internal part.\"ROSTER MOVESKansas City recalled RHP Jonathan Heasley and optioned LHP Austin Cox to Triple-A Omaha.TRAINER´S ROOMThe Royals placed OF Kyle Isbel (left hamstring strain) on the 10-day injured list and recalled INF Nate Eaton.",
        "UP NEXTOakland sends LHP Ken Waldichuk (0-2, 7.26 ERA) to the mound against Royals RHP Brady Singer (2-3, 8.48) on Saturday.___More AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}