{
    "articleURL": "/news/article-12057279/Met-Police-got-balance-right-Coronation-crowds-minister-says.html",
    "content": [
        "52 protesters were arrested during King's Coronation celebrations in LondonMet police criticised for being 'heavy-handed' but gov't source defended forceREAD MORE: Anti-monarchists WON'T stage any more protests this weekLabour and the BBC were criticised last night over the prominence they awarded to Coronation protesters, amid a republican backlash over dozens of 'heavy-handed' police arrests.",
        "Trouble started on Saturday as the leader of an anti-monarchy group, who was detained ahead of a planned protest, said police officers should 'hang their heads in shame' over a 'direct attack on our democracy'.In all, 52 protesters were arrested during the celebrations in central London, including activists from Just Stop Oil and Animal Rising groups. Opposition front bench home affairs spokesman Jess Phillips was among Labour MPs expressing reservations over the Metropolitan Police's tactics on Saturday.Questions were raised over the arrest of two women and a man in Soho on Friday night. Westminster councillor Aicha Less said they were volunteers from the Night Stars project, which helps vulnerable people in the capital's West End, adding that she was 'deeply concerned'.The Met initially said those three arrests related to possession of rape alarms which could be used to scare horses in the Coronation procession, but no further information was available last night.",
        "During Saturday, officers briefly held Patrick Thelwell, 23, who in April was found guilty of threatening behaviour for throwing eggs at King Charles – while shouting 'The King is a paedophile' – during a walkabout in York last year.",
        "A government source criticised BBC News' initial online coverage of the arrests as 'one-sided', and said: 'The Labour Party and the Twitterati, ably assisted by the BBC, have been quick to pile in with criticism of the police.",
        "'They glance over the fact hundreds of people were allowed to protest peacefully on Saturday. What happened is that officers on the ground took decisions to make arrests in a number of cases where they felt they had cause to.'Graham Smith, chief executive of anti-monarchist group Republic, was held for 16 hours by police before being released. Yesterday he attacked the new monarch as a 'puppet king'.Mr Smith said: 'These arrests are an attack on our democracy and the rights of every person in the country. Each police officer involved on the ground should hang their heads in shame. They showed no judgement, no common sense and no basic decency.'Culture Secretary Lucy Frazer insisted yesterday that police got the 'balance right' between allowing protest and enjoyment of the King's coronation.She told Sky News' Sophy Ridge On Sunday programme: 'What they have to do is balance the right to protest, which is important in a democracy. At the same time there's the right of all those other people to enjoy what was a fabulous day.'I think, overall, they managed to get that balance right.' Ken Marsh, Chairman of the Metropolitan Police Federation called into Andrew Castle's show on LBC, and said: 'I want to correct a few things.'",
        "He offered a hypothetical scenario where one hundred people 'pulled the pin on rape alarms as horses rode past them'.He contextualized the situation: 'We as the police have hundreds of incidents brought to us prior to this event and [have to] work out how to keep people safe.'With reference to the scenario, he said: 'I can assure you that would have been the most horrendous incident you would've seen in London.'"
    ]
}