{
    "articleURL": "/news/article-12055579/Protesters-stand-subway-tracks-Manhattan-stopping-trains-brawls-police-protest.html",
    "content": [
        "Anger over the death of Jordan Neely, who was killed by a chokehold inflicted by a US Marine, led protestors to jump onto the track of the NYC subway systemPhotos and videos captured the protest group taking over the Lexington Avenue and 63rd Street subway stop on the Upper East Side on Saturday evening Protesters standing on the tracks prominently displayed their protest signs calling for justice in the death of Jordan Neely, 30, who died from a chokeholdProtestors brought part of the New York City subway system in Manhattan to a halt by venturing out onto the tracks as they expressed anger over Jordan Neely's death by chokehold by a US Marine earlier this week. ",
        "Photos and videos show the protest group taking control of the Lexington Avenue and 63rd Street subway stop on the Upper East Side, bringing trains to a complete standstill.Several individuals even went out onto the tracks close to the electrified third rail preventing train from entering or departing the station. Protestors marched from downtown all the way up to the Upper East Side before they went down into the subway system to stop the trains themselves. It led to the complete shutdown of the station for the best part of an hour with the NYPD arresting at least 15 people. ",
        "Some of the protesters standing on the tracks held protest signs. One person could be seen standing on top of the protective covering that shields the electrified third rail, which normally carries 600 volts of electricity.Police made numerous arrests as trains on the F and Q line were stopped for almost an hour from 6:15pm. Service is said to have resumed by 7pm. Back up on street level one black man could be heard shouting 'I can't breathe', as he was placed in cuffs, despite no NYPD officer applying any kind of force to his chest or face. Photographer Rebecca Brannon said that the scenes that played out on the platform shocked her",
        "'I still cannot believe people jumped down onto the tracks with an oncoming train headed down the tunnel and the intensity of the arrests - the clashing between police and protesters. 'Videos will never capture that completely unimaginable feeling of dread and chaos given the unpredictability of the entire situation, constantly watching your back for fear of being pushed off the platform was just nuts. I’m just glad no one on either side was seriously injured,' she wrote on Twitter.The death of Neely, 30, on Monday has stoked an outcry over the lack of city support for those suffering from mental illness and homelessness. ",
        "Saturday marked the fourth day of protests in which activists are demanding that charges be filed against the Marine veteran at the center of the disturbing video that sees Neely in a chokehold on the floor of a northbound F train.Neely died from compression of the neck, the city's medical examiner determined on Wednesday.On Monday afternoon, he was yelling while pacing back and forth on a train in Manhattan when he was restrained by at least three people, including the Marine veteran who pulled one arm tightly around his neck.A physical struggle ensued which saw Neely lose consciousness. He was rushed to Lenox Hill Hospital where he was pronounced dead.",
        "Neely is recognizable to some New Yorkers as a Michael Jackson impersonator who regularly danced in the Times Square transit hub. ",
        "The Marine in question, Daniel Penny, 24, has not been charged with a crime in relation to Neely's death. Multiple reports suggest that Manhattan DA Alvin Bragg may convene a grand jury and pursue criminal charges as early as next week.ABC News notes how it is 'typical' for prosecutors to take their time in complex cases before impaneling the jury. Detectives in the case have spoken to around six witnesses who saw the disturbance and are seeking to talk with around four or five more. Penny has also been questioned by police and released. According to reports, he said that he did not intend to kill Neely and had been trying to restrain him until the police arrived. Witnesses said that around 2:30pm last Monday, Neely, who relatives have said he was schizophrenic, was behaving erratically, throwing garbage and screaming that he wanted to 'die' or 'go to jail' because he was fed up about having no food. Neely had been arrested 42 times in the past, including for punching a 67-year-old woman in the face. But New York congresswoman Alexandria Ocasio-Cortez spoke for many when she said his criminal history was irrelevant.",
        "'Leaders want to raise his record as if that warrants a public execution on the subway?' she tweeted. 'What have we come to?'",
        "Video footage shows Penny with Neely in the chokehold. For two minutes and five seconds, Neely struggled on the floor, flailing his feet. He went limp after two minutes and six seconds.Police took Penny into custody. But he was later released and has not been charged.In the statement, Penny's lawyers say that the Long Island-native 'could not have foreseen [Neely's] untimely death.' It also said that Penny was merely trying to restrain Neely, who was accused of being disruptive on board an F train, until the police arrived. Neely's attorneys also took aim at 'elected officials' calling on them to 'address the mental health crisis on our streets on subways.'   "
    ]
}