{
    "articleURL": "/wires/aap/article-12048983/Nationals-MPs-warned-treachery-plum-NSW-role.html",
    "content": [
        "A Nationals MP has been accused of contemplating treachery against the coalition and threatened with a referral to the state's corruption watchdog, as he considers a lucrative role in the NSW parliament.",
        "Ben Franklin has been backed by NSW Premier Chris Minns to become upper house president, with the premier saying he would instruct his party to elect a non-government member to the position.The news has sparked a crisis within the Liberal-National coalition, as Mr Franklin's promotion would diminish the opposition's power in the upper house.MPs from both parties have called for Mr Franklin to be referred to the Independent Commission Against Corruption if he does take the role, however it has since emerged that numerous coalition MPs had lobbied for the job themselves.Defying attacks from the opposition, the premier said electing a non-government member to lead the upper house would ease the functioning of government.\"We've got an ambitious legislative agenda,\" Mr Minns told reporters on Friday.\"We need someone who's able to do the job, it's a difficult job to do.\"But we acknowledge that we don't have the numbers in the Legislative Assembly or the Legislative Council.\"NSW Nationals' claims that Mr Franklin's consideration of the role could amount to corruption were dismissed by the premier.A number of coalition MPs had put their hands up for the job in recent weeks, he said.\"It's about time that senior members of the National Party either refer those other MPs to the ICAC (Independent Commission Against Corruption), or acknowledge that the whole thing was a farce from the very beginning,\" he said.",
        "Mr Franklin, a close friend of the premier, still faces expulsion from his party if he does take the job, which comes with a $315,814 salary and numerous perks including additional staff, a car and driver.The NSW Nationals on Thursday passed a snap resolution during an urgent partyroom meeting to stop any member becoming president or deputy president, and is also considering a referral to ICAC.The move would shave the number of opposition MPs in the upper house to 14 against Labor's 15 and free up a path for the government to pass legislation without needing the support of right-leaning crossbenchers.Any coalition MP who considered taking the role was contemplating a \"sleazy deal\" with the government, Opposition Leader Mark Speakman said on Friday.\"This is what people hate about politics,\" he told Sydney radio station 2GB.\"It would be an act of treachery for any person who's been elected seven weeks ago by Liberal and National voters to turn their back on those voters and instead do a sleazy deal with Labor.\"Nationals leader Paul Toole said he found the situation distressing and felt Mr Franklin had betrayed the party on Thursday.Deputy Premier Prue Car said the Nationals were abusing the ICAC's role to work through their political fights."
    ]
}