{
    "articleURL": "/femail/article-12057461/A-royal-DILF-Fans-wild-Prince-Williams-look-Coronation-concert.html",
    "content": [
        "Prince William, 40, left royal fans hot under the collar at concert in Windsor  Follow all the latest royal news and updates on Coronation events on MailOnline's live blog hereThe Prince of Wales left royal fans hot under the collar during the Coronation concert - with some even declaring the father-of-three has become a 'DILF'.",
        "Prince William, 40, joined his wife Kate, 41, and his two eldest children Prince George and Princess Charlotte at Windsor Castle for the star-studded concert this evening.On stage he paid a touching public tribute to his father the King at the coronation concert, saying: 'Pa, we are all so proud of you.'The prince delivered his speech in front of a crowd of 20,000 revellers at the Windsor Castle gala where the royal family gathered en masse to watch singers such as Katy Perry and Lionel Richie.However despite his sentimental words, many viewers of the concert were distracted by the Prince's handsome looks.",
        "One commented: 'If this isn't HOT, I don't know what is?'Another wrote: 'William is hot as f***. I will not be taking any further questions.'A third added: 'William is so hot, I'm sorry!'A fourth wrote: 'William is really a DILF!'Heir to throne William also made a sweet reference to his late grandmother Queen Elizabeth II after taking to the stage, adding: 'I know she's up there, fondly keeping an eye on us.'He told his newly crowned father Charles: 'She would be a very proud mother.'He praised the King's decades of service, his campaigning on green issues, Prince's Trust charity and celebration of diversity and support for people of all backgrounds, communities and faiths.",
        "Next in line to the throne, William also made his own historic pledge as he thanked the millions who serve in the military, schools, NHS and local communities, saying: 'I commit myself to serve you all. King, country and Commonwealth.'",
        "By publicly calling Charles 'Pa' and expressing the royal family's pride in him, he echoed the speeches his father gave at the late Queen's Jubilee concerts, when he referred to her as 'Mummy'.At his Golden Jubilee concert speech in 2002, Charles introduced his mother, as she stood beside him, with 'Your Majesty... Mummy' and later said: 'We feel proud of you.'On Saturday, William was the only member of the royal family tasked with paying homage to the King during the ancient coronation ceremony, as he knelt before his father, touched his crown, kissed him on the cheek and vowed to be his 'liege man of life and limb'.The prince began his stint on stage with the words 'Good evening Your Majesties'.But he made no other direct mention of his stepmother the Queen.Camilla was anointed and crowned with Charles in Westminster Abbey.William launched into a joke about Richie's well known hit All Night Long, saying: 'Good evening Windsor! A huge thank you to everyone for making this such a special evening.",
        "'I want to say a few words about my father, and why I believe this weekend is so important.'But don't worry, unlike Lionel, I won't go on all night long.'",
        "Speaking of the late Queen, he said: 'As my grandmother said when she was crowned, coronations are a declaration of our hopes for the future.'And I know she's up there, fondly keeping an eye on us. And she would be a very proud mother.'For all that celebrations are magnificent, at the heart of the pageantry is a simple message. Service.'He described how his father's first words on entering Westminster Abbey for his coronation - when he responded to the official greeting by a young chorister - were a pledge of service.'It was a pledge to continue to serve,' William said.'Because for over 50 years, in every corner of the UK, across the Commonwealth and around the world, he has dedicated himself to serve others, both current and future generations, and those whose memory must not be neglected.'He praised the King's take on the natural world, saying: 'He warned us of the risks to our planet's health long before it was an everyday issue.'",
        "And heralded his establishment of the Prince's Trust, adding: 'It has supported over a million young people, many from disadvantaged backgrounds, to realise their ambitions.'",
        "William continued: 'Perhaps most importantly of all, my father has always understood that people of all faiths, all backgrounds, and all communities, deserve to be celebrated and supported.'While William highlighted Charles's support of diversity, the Duke of Sussex claimed in his Netflix documentary at the start of the year that there was a 'huge level of unconscious bias' in the royal family.In 2021, the Windsors faced accusations of racism following the Duke and Duchess of Sussex's Oprah Winfrey interview.",
        "Meghan, the first mixed race person to marry a senior royal for centuries, told Oprah that an unnamed royal expressed concerns with Harry about how dark their son's skin might be before he was born.More than 20 members of the royal family watched from the royal box as William delivered his speech.Harry and Meghan were thousands of miles away in the US.The duke headed straight back after the coronation ceremony to celebrate his son Prince Archie's fourth birthday, while Meghan stayed in California rather than attending the service.In his final comments, William told Charles: 'Pa, we are all so proud of you.'I also want to express my pride and gratitude for the millions of people who serve, in the forces, in classrooms, hospital wards and local communities.",
        "'I wish I could mention you all. Your service inspires us. And tonight we celebrate you too.'I commit myself to serve you all. King, country and Commonwealth. God save the King!'"
    ]
}