{
    "articleURL": "/wires/ap/article-12039183/76ers-Embiid-doubtful-Celtics-vow-adjustments-Game-2.html",
    "content": [
        "BOSTON (AP) - Celtics coach Joe Mazzulla said he didn´t walk off the court feeling any panic following Boston´s 119-115 Eastern Conference semifinals loss to the 76ers in Game 1.",
        "If anything, he thinks his team saw on tape a blueprint of exactly what they need to do to rebound in Game 2 on Wednesday.\"I don´t think it was a letdown, we just lost the game,\" Mazzulla said. \"Hindsight is 20-20, you always have the answer after.\"What he and his staff observed was a Boston team that made lots of little mistakes in the second half. That, along with a 45-point performance by James Harden and 17 3-pointers by the 76ers, was too much for Boston to overcome.\"There´s pockets of that game that we can handle better,\" Mazzulla said. \"Then obviously late-game execution can get better. Switching, and different coverages and just finding floor space. So, I think it´s just honing in on what we´re great at and working to do it. ... And then clean up some areas where we can be a little more physical.\"Celtics guard Derrick White said they can and will adjust. It starts with Harden.",
        "\"We´ve got to make it a little more difficult for him,\" White said.What´s troubling for the Celtics, though, is that Philadelphia was able to win the physical battle down the stretch without All-Star Joel Embiid, who was sidelined with a sprained right knee.Embiid went through some light work on the court for the second straight day Tuesday, but he was listed as doubtful on the 76ers´ initial injury report.",
        "The plan was for him to do some running on his injured knee and see how it responds.\"The fact that he´s doing that is a step forward for sure,\" coach Doc Rivers said. \"It´s just health-based. If he can play, he can play. If he can´t, he can´t. If it´s 50-50, we would probably err on the other side (and not play him) because that´s what we´ve done all year. We´re not going to take any chances with him.\"76ERS AT CELTICS76ers lead 1-0. Game 2, 8 p.m. EDT Wednesday, TNT- NEED TO KNOW: With Joel Embiid out with a sprained right knee, James Harden picked up the slack to the tune of a 45-point performance that matched his career playoff high. Boston led by as many as 12 points in Game 1 after a fast start, but had several key mistakes down the stretch, including a late turnover to help Philadelphia seal the win.- KEEP AN EYE ON: Celtics C Al Horford. Philadelphia targeted him on offense, using pick-and-roll sets to get Boston to switch him onto Harden. Harden used his speed to create space on the perimeter and made several 3-pointers with the big man defending him. The Celtics will have to adjust.- INJURY WATCH: Embiid went through another workout with the 76ers training staff. The team is waiting to see how his sprained knee responds before making a decision for Game 2.",
        "- PRESSURE IS ON: Boston. The Celtics failed to take advantage with Embiid out. Falling behind 2-0 in the series would put the 76ers in the driver´s seat with the series shifting to Philadelphia for Game 4.___AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP_Sports"
    ]
}