{
    "articleURL": "/news/article-12053861/Royal-fans-raise-toast-King-pubs-escape-crowds-watch-coronation-TV.html",
    "content": [
        "Hundreds have flocked to pubs across the capital to watch the CoronationHow are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.uk Hundreds of people have escaped the crowds on the streets of London and flocked to pubs across the capital to catch a glimpse of King Charles's Coronation on large TV screens.",
        "Royal fans from the UK and abroad took to London's watering holes to get in early pints as they settled in to watch the historic service, which begins at 11am at Westminster Abbey.Many have spent thousands to get a glimpse of the atmosphere as the country watches the first Coronation in 70 years.The Albert pub near Victoria Station has become a hub for royal fans today.One punter called Steve told MailOnline: 'We wanted to go to St James' Park, but it was closed.",
        "'So we will be getting on it until the flypast and then out in Soho. God Save the King.'Cath Hartley, 58, enjoying a drink in the Albert pub in Victoria with her friend Amanda Nesbitt, 59, said: 'We wanted to get to the Mall, but it was all shut off. We arrived here at half 9 - we're two drinks down and we'll stay till the end.'Iona Bogor, 24, and her friend Camilla Hay, 25, decided to go to the pub to 'soak up the atmosphere'.She said: 'We thought we would come for a wander to soak up the atmosphere, but you can't get anywhere so we're in the pub.'We reckon we'll see more here, and it's an excuse to have a pint.'",
        "Mark Hennings, 61, and Kelly Altridge, 50, are from the Cayman Islands and are among those jolly punters eagerly awaiting the King's Coronation.Ms Altridge said: 'We spent thousands to get here and are staying in Westminster.'We are proud to be associated with Britain.'",
        "Another pubgoer, Seth Berg, 52, from Los Angeles, spent £10,000 to get to the UK for the King and Queen's Coronation.He managed to bag a hotel right next to Westminster but now cannot leave the triangle due to road blockings.They are now waiting at the Albert pub in Victoria until the road blockings are removed.Similarly, Tina Davis and her husband, who are staying in St James' Court hotel, are also stuck within the road blockings and have gathered at the same pub.Julia and Leonhard, both 26, from Italy and Germany also tried to see the King's procession from Buckingham Palace to Westminster Abbey but couldn't, so decided to come to the pub instead.They told MailOnline: 'We're here to breathe the vibe.'"
    ]
}