{
    "articleURL": "/sport/othersports/article-12039561/18-year-old-shot-baseball-game-remains-ICU-bullet-lodged-near-spine.html",
    "content": [
        "Two men who police believe to be involved in the shooting have been arrested The pair were engaged in a dispute some 400 yards away from the diamond DailyMail.com provides all the latest international sports news The 18-year-old Texas A&amp;M-Texarkana (TAMUT) baseball player shot from 400 yards away while standing in the bullpen during a college baseball game is currently suffering from partial paralysis in his leg and remains in intensive care, according to a report. ",
        "Texarkana Texas Police Department arrested a second man Tuesday and he was resultantly booked into the Bi-State Jail. Police believe both Demarco Banks, 20, and Kamauri Butler, 17, are the shooters in the dispute which ultimately led to Matthew Delaney being shot in the chest. They announced Sunday shots were fired in a neighborhood west of George Dobson Field at Spring Lake Park and an errant round 'travelled about 400 yards and struck the innocent victim at the ball field.' Banks and Butler were charged with deadly conduct and aggravated assault with a deadly weapon, respectively.ESPN spoke to Delaney's mother, Amy, Tuesday and reported he is in intensive care suffering from partial paralysis in his left leg, two broken vertebrae and a collapsed lung. 'It's [the lung] slowly inflating,' she said. 'Each day, that's gotten a little better. He still does have a chest tube to try to drain some fluid off it.' ",
        "The bullet has yet to be removed by surgeons given its proximity to Delaney's spinal cord. The freshman baseball player cannot move his left leg despite sensation returning. He is able to wiggle a toe sporadically, according to Mrs. Delaney. 'He was where he was supposed to be, doing what he was supposed to be doing,' she told ESPN. 'It's not something that we would have ever imagined.' ",
        "Amy Delaney told the outlet there is presently no indication of the time her son will remain in Christus St. Michael Hospital, nor a future prognosis. The 18-year-old has received immense support from the community which borders Arkansas. 'They have been here every day, calling, coming in, the team, the staff,' Amy Delaney said. 'Everyone has reached out. They've sent food to us. They have just been so supportive. 'We've had three different small businesses that have made donations to Matthew that are just trying to help any way they can. We've had people that we don't even know offered our homes up because we needed a place to stay. The outpouring from the people here in Texarkana has just been amazing and we're just so thankful.'Department spokesman Shawn Vaughn told the Texarkana Gazette it was a case of 'incredibly bad luck, bad place.' TAMUT released statements this week confirming the incident, subsequent hospital treatment, the ruling of the game as a no contest, alongside the cancelation of a softball doubleheader Sunday.'The university's counseling services are available to players and other students,' the statement read. 'At this time we ask that you keep our student-athlete, his family, teammates and friends in your prayers.' ",
        "Police also made three arrests of men who were at the scene of the shooting Saturday.",
        "Yankeengea Smith, 49, was taken into custody for unlawful possession of a firearm by a felon and two counts of possession of methamphetamine and ecstasy pills.19-year-olds Nathan Moore and Marcell Beaver were arrested for tampering with evidence and possession of marijuana, and possession of marijuana, respectively.Texarkana police said Tuesday 'no additional arrests are expected' in relation to the incident.  "
    ]
}