{
    "articleURL": "/news/article-12053943/CNNs-Anderson-Cooper-cut-byco-hosts-claiming-Prince-George-WASNT-attendance.html",
    "content": [
        "Cooper was analyzing the entrance of the Prince and Princess of Wales when he claimed their eldest hadn't been seen His co-hosts Max Foster and Christiane Amanpour pointed out that George was behind the KingCORONATION LIVEBLOG: Click here to follow live updates throughout today How are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.uk CNN host Anderson Cooper has been mocked on social media for failing to recognize Prince George -before confusing him with his brother Prince Louis.",
        "The lead anchor was quickly cut off by Max Foster and Christiane Amanpour after saying 'we haven't seen George' as the third in line to the throne was on the screen.Cooper pointed out the next few occasions the nine-year-old prince was on the screen, but not before his blunder was picked up by the millions watching the coronation.Foster quickly cuts across Cooper saying: 'No we did see him, he's holding the robe behind the King.'Cooper then goes: 'George is there in the back left', but is ignored by the other two, who continue to discuss the crowns the new King will wear.",
        "He also appeared to confuse George with his younger brother Louis, 5, as the three hosts discussed if Louis would be taken off by a nanny.Someone social media accused Cooper of 'obsessing' about Prince George, while another added: 'Anderson Cooper not knowing which one is George and which one is Louis is why I am watching this spectacle.A third said: 'Anderson Cooper didn't even know Prince George was there in the procession until the other two announcers corrected him. What a tool!.'One other quipped: 'One demerit for Anderson Cooper not recognizing Prince George.'Others also pointed out another CNN blunder, with the time shown in the UK as an hour earlier than it actually was.",
        "Other viewers complained about coverage by ABC, moaning that it was a 'shambles', and many had to switch channels to watch the coverage.Some laughed that affiliates of CBS cut away from the coronation as the King was proceeding down Westminster Abbey.Cooper made the gaffes despite being considered part of American royalty. His late mom was Gloria Vanderbilt, of the famed Vanderbilt shipping and railroad dynasty. "
    ]
}