{
    "articleURL": "/sport/football/article-12043089/Seamus-Coleman-gives-Everton-boost-telling-fans-soon-following-knee-injury.html",
    "content": [
        "Seamus Coleman looked set for lengthy absence after injury on Monday night But the long serving full-back reported positive news following a scanColeman reported no ACL damage, boosting likelihood of a quicker return Everton captain Seamus Coleman has confirmed his injury is not as bad as first feared.",
        "The 34-year-old defender appeared to have suffered a serious knee injury during Everton's 2-2 draw with relegation rivals Leicester on Monday night.Coleman received treatment on the pitch before he was carried off on a stretcher at the King Power Stadium having collided with Leicester's Boubakary Soumare.After the game, manager Sean Dyche feared the worst but Coleman confirmed on Everton's Twitter that there is no anterior cruciate ligament damage and he could be back in action soon.He told supporters: 'Just wanted to update you all, thanks so much for the well wishes. Just back from my scan and pleased to say I have no ACL damage. Be back soon.'",
        "Coleman has been crucial to Everton throughout his stay with the club, with Jamie Carragher keen to point out his key role on and off the pitch following his injury. 'It's a blow for him,' Carrageher said. 'Fingers crossed it's not too serious but it didn't look great.'It could be a real problem for Everton this season because I felt until he went off the pitch he was the best player on the pitch and the difference he's made to Everton, not just his leadership, people talk about his leadership but his actual energy up and down that right hand side providing energy and an attacking outlet for Everton that hasn't been there the last few weeks.",
        "'Considering what he's done for that football club over the 10-12 years he's been there. One of the best signings probably in Everton's history.' Nathan Patterson replaced Coleman against the Foxes and Everton are in 19th place in the table, one point from safety, with four games left to play."
    ]
}