{
    "articleURL": "/news/article-12042023/Pictured-Five-teens-two-adults-killed-suspected-murder-suicide-Oklahoma.html",
    "content": [
        "Seven people, including pedophile Jesse McFadden, found dead on MondaySex offender McFadden, 39, was due in court on child porn charges same day Teens are Ivy Webster, Brittany Brewer, Rylee Allen, Michael Mayo, Tiffany GuessThese are the five teens and two adults who were killed in a suspected murder-suicide in Oklahoma - as a grief-stricken grandma claims pedophile Jesse McFadden carried out the shocking massacre at his property.",
        "Friends Ivy Webster, 14 and Brittany Brewer, 16, were among six victims discovered on Monday after being slain by the convicted sex offender who was found dead alongside them at his home in Henryetta.The other victims were mother Holly Guess, 35, and her children Rylee Elizabeth Allen, 17; Michael James Mayo, 15; and Tiffany Dore Guess, 13, according to grieving grandma Janette Mayo, 59, who said she had been informed of the tragic deaths by cops.Ms Mayo was told by the Okmulgee County Sheriff's office that her daughter - who was married to McFadden - and grandchildren were all found shot dead in various locations on the rapist's property. She described McFadden as a 'monster'.Ivy's father, Justin Webster, said all of the victims suffered gunshot wounds and that some had been lined up in a row and others were 'scattered' across the property. He described the massacre as a murder-suicide.",
        "Posting on Facebook, Ms Mayo said: 'My daughter loved her children and yes she married the man who killed them but she was fooled by his charm. I hurt just like the other families but he took my world from me. My grandchildren and my daughter. I have a hole in my heart that he created by his actions Jesse McFadden was a monster for his actions.'",
        "In a separate post, she added: 'If someone wants to blame my daughter they can contact me, that man had her fooled and now my daughter and my grandchildren. 'My daughter didn't help him he killed her and 5 children so stop digging my daughter she is a victim as well.'The Oklahoma State Bureau Investigation, which is assisting in the investigation, told DailyMail.com that they could not confirm the identities of the victims.'In Oklahoma, only the Oklahoma Office of the Chief Medical Examiner may release the positive identification of individuals,' PIO Gerald Davidson of the Oklahoma State Bureau of Investigations told DailyMail.com. McFadden, 39, had been scheduled to appear in court Monday for the start of a jury trial on charges of soliciting sexual conduct with a minor and possession of child pornography. Fox 23 reports that he sent chilling texts to the victim in the case, warning her 'this is all on you', the night before he was found dead with six others. 'I did exactly what I promised I would do when I got out,' McFadden texted the victim. 'I got a marketing job making great money and was being advanced been there 2 years now and made a great life like I promised I would do with you.'",
        "'Now it's all gone, I told you I wouldn't go back … This is all on you for continuing this.'The Oklahoma Department of Corrections prison records show McFadden was convicted of first-degree rape in 2003 and released in October 2020.Court records show he was communicating with a then-16-year-old girl using a contraband cellphone while he was incarcerated at a state prison near Muskogee. The teen's grandfather reported their communications to prison officials, according to an affidavit from a Department of Corrections investigator. Ms Mayo has revealed that her daughter married McFadden last May but only found out about his criminal past two months ago. ",
        "Officials had initially issued an amber alert for Ivy and Brittany - who were reportedly seen travelling with McFadden after vanishing - but it was called off when the bodies were discovered later the same day at the home near Henryetta, a town of about 6,000 about 90 miles (145 kilometers) east of Oklahoma City.The two girls were supposed to be going swimming at a creek with McFadden's teenage daughter. ",
        "While details from police have been scant, grieving relatives are trying to piece together the horror started that began with two teenagers being reported missing.In an emotional interview this morning, Ivy's parents suggested that McFadden had impersonated their daughter over text after killing her.",
        "Ivy's mother Ashleigh Webster explained how she had been speaking to her daughter on Snapchat late on Saturday night but when she received a message from her the next morning, something didn't feel right.'I got a message the next morning, Sunday morning that was her phone but I don't believe it was from her anymore saying that they were going to McAlester and she would be home later,' she told NewsNation.Mr Webster added: 'We think Jesse wrote that and probably had already happened at that point.'",
        "Speaking about why they had concerns, Ms Webster added: 'The way Ivy is, she's my best friend, she's constantly 'Mum I love you, ok mum we're going to eat, ok mum we're done eating we're going to go do this now'. She lets me know everything.'This message was kind of 'ok we're going to McAlester, I'll see you around 5.''It was just different but I also didn't think anything of it because they were maybe in a hurry.'Officials discovered the seven bodies on the property around 3pm at 14600 Holly Road in the rural town of Henryetta, Oklahoma State Bureau of Investigations told DailyMail.com.The Websters, who moved to the area two years ago, revealed that they were completely unaware of McFadden's past, adding: 'We had a read on him that he was a little weird but we felt comfortable  especially knowing several of our daughters' friends would go over there all the time and hang out.",
        "'Tiffany would come over here to our house  and stay here on the weekends and we never suspected any kind of maliciousness.'Brittany's father Nathan, who called his daughter his 'right hand side kick' also said that his daughter had spent the weekend with the McFadden's family several times before.He told News On 6 that his daughter was selected to be Miss Henryetta at the [National American Miss pageant] in Tulsa and represent her town this summer. ",
        "'And now she ain't gonna make it because she's dead, she's gone,' the grief-stricken father said.He said during a vigil on Monday that his daughter had dreams of becoming a veterinarian or a teacher.He added: 'It's just a parent's worst nightmare, and I'm living it. I am just lost.' The grim discovery in Oklahoma keeps the U.S. on a torrid pace for mass killings in 2023 and could push the number of people slain in mass killings past 100 for the year, according to a database maintained by The Associated Press and USA Today in a partnership with Northeastern University.  "
    ]
}