{
    "articleURL": "/sport/football/article-12059279/Lionel-Messi-RETURNS-training-PSG-apology-Saudi-Arabia-trip.html",
    "content": [
        "PSG tweeted a photograph of Lionel Messi back in training on Monday afternoonArgentine apologised to his team-mates after making trip to Saudi ArabiaFrench league leaders had suspended him for two weeks and docked wages Lionel Messi has returned to training with Paris Saint-Germain after his suspension for taking an unauthorised trip to Saudi Arabia was lifted.",
        "The Argentine apologised to the club and his team-mates for taking the two-day trip to the Middle East at the beginning of last week.PSG banned the World Cup winner for two weeks and also docked some of his wages, but Messi came back into the fold on Monday.Having missed Sunday's 3-1 victory over Troyes in Ligue 1, Messi will now be back in contention for Saturday's home fixture with Ajaccio. The 35-year-old's expected return comes as PSG hope to secure the title with their lead over Lens currently standing at six points with four matches left to play. ",
        "Messi, wife Antonela Roccuzzo and children Ciro and Mateo, travelled to Saudi Arabia last Monday as part of his £25million-a-year role as an ambassador for the country.They were photographed enjoying attractions in the capital Riyadh and Diriyah.PSG's players had a scheduled day off on the Monday but following their 3-1 defeat to Lorient the previous day, manager Christophe Galtier ordered them in for extra training.Messi, however, was already in transit to Saudi Arabia - a country where he could be playing his football next season - and wasn't able to turn back.Because the trip was not sanctioned by Galtier, nor by sporting director Luis Campos, PSG suspended Messi for 15 days and also docked some of his wages.",
        "On Friday, Messi apologised in a social media message to the club and his team-mates for missing the training session. 'I thought we were going to have a day off after the game as always,' Messi began in the 39-second clip shared onto his Instagram story.'I had this trip organised and I couldn't cancel it. I had already cancelled it before. I apologise to my team-mates and I'm waiting for what the club wants to do with me.'It appears Messi's contrition has been recognised with PSG allowing him back into training early.  ",
        "There were suggestions following the incident that Messi and his father, who is also his agent, have made it clear to PSG that he will leave the club at the end of the season.Fans gathered outside the club headquarters on Wednesday to chant for the PSG board to resign, while they also called for Messi to leave the club, with the Argentinian also receiving jeers from supporters at recent matches.PSG have been trying to extend his contract over the last few months, but it appears Messi will move on.Reports in Spain suggest Messi will play for Saudi club Al-Hilal next season, having agreed a deal worth £260m-a-year.In Messi’s absence, PSG remained on course for the league title on Sunday as goals by Kylian Mbappe, Vitinha and Fabian Ruiz earned a 3-1 win at Troyes. "
    ]
}