{
    "articleURL": "/wires/aap/article-12040481/Budget-plug-billions-grid-scale-energy-storage.html",
    "content": [
        "The federal budget will unlock at least $10 billion of new investment in renewable power projects, with states already lining up for the funding.",
        "Energy Minister Chris Bowen confirmed on Wednesday the government's commitment to a capacity investment scheme (CIS) for large-scale energy storage projects that are \"both renewable and dispatchable\".The scheme is intended to ensure households and businesses can count on renewable energy being available when they need it, locking in cheaper renewable energy regardless of future global energy shocks.The scheme is \"absolutely essential - unlocking billions of dollars of renewable energy investment and unlocking gigawatts of power\", Mr Bowen told an industry audience in Sydney.The country's energy ministers last December endorsed the $10 billion mechanism to underwrite long-term projects, after experts warned Australia could fall short on targets for a 82 per cent renewable electricity grid at the current pace of work.\"Rewiring the Nation is important for moving our energy grade to 82 per cent, but it's not enough,\" Mr Bowen told the Smart Energy Council conference.Some have been calling for an energy storage target to accelerate the rollout of assets to support renewable generation, but the minister has resisted.\"The capacity investment mechanism is key to providing that stable and certain environment for investment in dispatchable renewable energy,\" he said.Dispatchable energy includes generation or storage that can increase or decrease as required by market operators.\"By insisting that investments under the capacity investment scheme will be both renewable and dispatchable - it can't be one or the other, you've got to be both - we are ensuring that the investment occurs (in both),\" he said.",
        "There would be more in next Tuesday's budget, and there had already been \"very productive conversations with state ministers who will be first cabs off the rank\", he added.Going jurisdiction by jurisdiction, the first auctions under the mechanism will occur later this year.Heidi Douglas, national director of Solar Citizens, welcomed the support in the upcoming budget for large-scale renewable storage and for households to replace gas with electric appliances.\"Household electrification is not just a big win for the environment, it is a big win for reducing household costs and the cost of living pressure from rising electricity and gas bills,\" she said.But Ms Douglas said a renewable energy storage target is essential or the minister's goal of 60 million more home solar systems in the next seven years - with battery storage - won't be met.The CIS will complement rather than overlap existing state schemes such as the NSW Electricity Infrastructure Roadmap, and will not alter competitive tenders already under way.There will also be an energy support package for households in the budget, and $314 million in tax breaks already announced for small businesses that electrify during the 2023/24 financial year."
    ]
}