{
    "articleURL": "/tvshowbiz/article-12061485/Ruby-Tuesday-Matthews-fire-exploitative-photo-shirtless-son.html",
    "content": [
        "An Australian influencer has been called out for posting a photo on social media of her young son posing shirtless in low-slung pants for a fashion campaign.",
        "Ruby Tuesday Matthews was accused by her own followers of being ignorant to the dangers of online predators, who are known to exploit innocent images of children and distribute them on the dark web.The Byron Bay-based mother of three, 27, shared the image of her four-year-old son Mars to promote a cap being sold by her clothing label Robey.After the picture was labelled 'exploitative', Matthews responded to her critics on Tuesday morning in a furious Instagram video.She maintained there was 'nothing wrong' with the photo and dismissed her haters as 'overly-sensitive'.",
        "Matthews also said the shot was not 'staged' so her son's pants were deliberately low-hanging, adding that Mars spends most of his time shirtless anyway.'Firstly that shot is not staged at all. We literally went to my friends' banana farm and that is how he was wearing his outfit that day, no shirt as per usual, and we shot some shots with him in the hat,' she said.'I'd also like to say that if you are sexualising that image of him, I think you actually need to have a look at the bigger picture of what your issue is and maybe you have become so overly sensitive.'The lines are blurred between what is wrong and right. There is nothing wrong with that image.'",
        "Matthews also hit back at accusations she was putting her children in danger by posting photos of them on social media.'I am very aware there are predators online that collect images of kids, but I am a lot more concerned about when my child has a phone than an image like that being put on the internet,' she said.'I feel like I am doing everything I can to protect my kids and I don't feel putting an image like that on the internet is putting him in danger. If I did, I wouldn't do so. That is my choice as his mum to make.'Matthews went on to say she was a 'victim [of] sexual assault at a very young age' and so is 'vigilant of where I put my children and the decisions I make'.'You are entitled to your personal opinion, but please keep it to yourself,' she added.'I will be removing that image and I am sorry if it has triggered something in you.'The controversy erupted on Monday when Matthews posted a gallery of photos on Instagram of Mars modelling a cap from her Robey collection.One of the images showed the preschooler shirtless in a pair of low-slung pants.Worried fans were quick to criticise the post as 'disgusting' and 'exploitative' after it was picked by watchdog accounts Dutch Minty, Influencer Updates AU and Influencer Tea &amp; Gossip.",
        "'Everything about this is wrong... Very wrong. That second photo is highly disturbing! Anyone who thinks this is okay is twisted,' one person commented.'Why the hell is [his] pants so low? This is so disgusting!' another said."
    ]
}