{
    "articleURL": "/wires/pa/article-12057181/Chesterfield-beat-10-man-Bromley-set-play-final-date-Notts-County.html",
    "content": [
        "Chesterfield defeated 10-man Bromley 3-2 after extra time to set up a National League play-off final against Notts County.",
        "Having gone a goal down to Adam Marriott’s opener in first-half stoppage time, the Spireites turned things around after the break and had looked on course for a 2-1 triumph thanks to a Deji Elerewe own goal and Darren Oldaker’s strike.Michael Cheek dramatically forced extra time, however, with a goal nine minutes into added time, only for Liam Mandeville to grab the winner after 103 minutes, leaving Chesterfield 90 minutes away from ending their four-year exile from the Football League.The match was delayed by 10 minutes due to crowd congestion, but that did not stop the Spireites making a strong start, with Ryan Colclough forcing Reice Charles-Cook into a low save.There was a further delay due to an emergency in the crowd, before Bromley took the lead in the eighth minute of first-half injury time.Ross Fitzsimons was unable to deal with a cross at the near post, allowing Marriott to poke home from a yard out.",
        "Chesterfield upped the ante after the break and levelled when Elerewe turned Colclough’s cross into his own net under pressure from Andrew Dallas.The game was then held up for 10 minutes as the referee took the players off the pitch when a drone began flying over the pitch.When they returned, Bromley, aiming for Football League status for the first time in their history, were reduced to 10 men when Elerewe was sent off for a 75th-minute tackle on Mandeville.",
        "It did not take long for the hosts to take advantage as Oldaker’s deflected 20-yard free-kick fizzed past Charles-Cook and looked destined to set up their Wembley date.But Bromley had other ideas and, nine minutes into 10 added on, they sent the game to extra time as Cheek poked home from close range.The Spireites were not going to be denied, though, and Mandeville sealed their trip to the national stadium by rifling home the winner."
    ]
}