{
    "articleURL": "/news/article-12053495/Jay-Blades-Stephen-Fry-Emma-Thompson-lead-celebrity-guests-arriving-Kings-Coronation.html",
    "content": [
        "Follow our live blog for all the latest updates on the King's Coronation How are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.uk Popular celebrity duo Ant and Dec joked they were going to recruit for the next 'I'm a Celeb' series as they spoke of how 'proud and privileged' they felt to be among those invited to the Coronation of King Charles. ",
        "They burst out laughing at the fact they would be in the Abbey with dignitaries and world leaders ahead of the service this morning. Speaking in an ITV interview as they excitedly arrived, they were asked: 'How does it feel for you guys to not be the most important people in the room?''It feels wonderful to be honest,' Ant said. 'You know, I was watching all the coverage last night, I have been, leading up to it... people have been getting coronated at Westminster Abbey for thousands of years...'You're part of history! It's fantastic. So we're just happy to be invited.' ",
        "He added that it was a privilege to be invited and described it as a 'wonderful day'.  Dec  joked they initially thought their invite was a 'wind up,' adding: 'It's cock-a-hoop, absolutely cock-a-hoop!' He said it was 'surreal' and joked when he got the invite he thought it must be a 'wind up'. He laughed: 'I thought surely it's our time to be wound up - and this is it! But it was for real and here we are, I can't quite believe it.'Dec also joked: 'And also - we're hoping to recruit for the next series of I'm a Celebrity Get Me Out Of Here'. Following the ceremony, Ant and Dec spoke about how 'fantastic' it was to witness it. ",
        "'The view was very good by the way, we were here, and then there was only one row, then he (the King) walked past, they all walked past,' Ant told ITV News as he left Westminster Abbey.He said that the most amazing moment of the ceremony was 'when the crown went on'.'The crowning, the whole thing, just a fantastic day,' added Dec.",
        "QI Stephen Fry, 65, was one of the first famous guests to arrive this morning. He was pictured queueing to enter the church while donning a black blazer, cream double-breasted waistcoat, white shirt and purple tie. Dame Emma Thompson posed for the cameras as she arrived, giving a playful thumbs up. She was wearing a vibrant red, flowery coat. Singer Katy Perry arrived dressed in a lilac suit with matching statement hat.Hundreds of police officers, soldiers and coronation event staff could be seen on the roads close to Westminster Abbey. Metropolitan Police and military police officers patrolled the route from Victoria to Westminster from the early hours on Saturday.Royal fans with Union flags and crowns could be seen on trains and in tube stations from just after 4:30am.Some were seen carrying tents, chairs and sleeping bags."
    ]
}