{
    "articleURL": "/wires/aap/article-12058269/Dockers-debate-Fyfe-Jackson-midfield-combination.html",
    "content": [
        "Fremantle forward Michael Frederick says it would be \"pretty cool\" to see Nat Fyfe and Luke Jackson unleashed in the midfield for a full game together.",
        "Fyfe made a successful return from a plantar fasciitis injury in Saturday night's 69-point win over Hawthorn, with the two-time Brownlow medallist tallying 10 disposals, two clearances and a goal after coming on as the sub in the third term.The match also marked Jackson's finest performance since crossing to Fremantle at the end of last year.The former Demon racked up a career-high 24 possessions to go with six marks, seven tackles, four clearances and two goals.Jackson and Fyfe mixed their time between attack and the midfield.Fyfe was meant to play this year almost exclusively as a forward but Fremantle's centre clearance woes mean the 31-year-old is now likely to spend extended stints in the midfield.Coach Justin Longmuir is also keen to give Jackson more runs on the ball as a big-bodied midfielder.If Fyfe is given the green light to play a full game in Saturday's clash with Sydney at the SCG, it could pave the way for a Fyfe-Jackson double act in the midfield.\"It will be very cool to see Luke and Fyfey one day line up in the midfield together, side by side for a full game,\" Frederick told reporters on Monday.\"I know JL (Longmuir) has said that Fyfey will definitely play some midfield time.",
        "\"And you've seen with Luke Jackson playing in there as well - there's multiple threats.\"And even someone like Sam Switkowski in there as well - we've got good midfield depth.\"Fremantle and Sydney sit outside the top eight with similar 3-5 records.The Dockers' finals hopes will be severely tested over the next three weeks when they take on Sydney, Geelong and Melbourne.Fremantle's win over Hawthorn was fuelled by a high skill level and a willingness to take the game on.Frederick said it was important to continue that theme this week against a Sydney side on a three-match losing run.\"We know Sydney aren't where they want to be, and we're not where we wanted to be,\" Frederick said.\"If we keep backing up our performances and playing the way we want to play, with some dare and being OK with making mistakes but taking some risks, we know we can get the job done.\""
    ]
}