{
    "articleURL": "/wires/reuters/article-12041533/Finally-feeling-positive-White-Sox-eye-series-win-vs-Twins.html",
    "content": [
        "The Chicago White Sox are on their first winning streak of the season, and they will chase their elusive first series victory when they face the visiting Minnesota Twins on Wednesday night.",
        "Chicago has won two straight, both in walk-off fashion, after losing 10 in a row.Andrew Benintendi's two-out single in the 10th inning propelled the White Sox to a 3-2 victory over Minnesota on Tuesday in the opener of a three-game series. The Twins took their second loss in three games.\"Walk-offs are always fun,\" Benintendi said. \"Definitely glad to be on this side and get our first two back-to-back (wins) this season.\"Minnesota will try to even the series behind right-hander Louie Varland, who began the week thinking his next start would come for Twins' Triple-A Saint Paul affiliate.Instead, the Saint Paul native is heading back to the major leagues. So much for a possible reunion with his older brother, Gus, a Milwaukee Brewer who is set to rehab with Triple-A Nashville this week.\"That would have been a lot of fun,\" Varland said. \"Have the whole family out there and hopefully me and Gus would pitch in the same game, but things did not work out that way, obviously.\"That's because Varland is expected to step in for Tyler Mahle. A right arm strain will sideline Mahle for more than a month, Twins manager Rocco Baldelli announced on Sunday.Varland (0-0, 4.50 ERA) made one previous major league start this season, getting a no-decision against the host New York Yankees on April 14 after pitching six innings of three-run ball. He walked one and struck out eight, and each of the three hits he allowed were solo home runs.",
        "Varland started twice against Chicago at the end of his first big-league season last year, going 1-0 with a 1.80 ERA and eight strikeouts in 10 innings.Ace righty Dylan Cease (2-1, 4.15 ERA) is set to start for White Sox on the heels of his least effective outing of the season.Facing the major-league-leading Tampa Bay Rays on Thursday in the opener of Chicago's seven-game homestand, Cease allowed seven runs, six earned, and nine hits in four-plus innings. He served up a home run for the second straight start while striking out a season-low three hitters.\"Just bad,\" Cease said. \"Didn't give us a chance to win. Just bad all around.\"After pitching at least five innings in each of his first four starts, Cease hasn't reached that benchmark in the past two. His run of early-season success included an April 10 victory at Minnesota, when Cease scattered three runs, one earned, and three hits in five innings. He struck out six while issuing two walks and hitting a pair of batters.In 10 career starts against Minnesota, Cease is 4-4 with a 4.83 ERA with 59 strikeouts in 54 innings.The White Sox out-hit the Twins 5-3 on Tuesday. With the victory, Chicago tied the season series between the clubs at two games apiece.",
        "--Field Level Media"
    ]
}