{
    "articleURL": "/wires/reuters/article-12039153/AMD-forecasts-second-quarter-revenue-expectations.html",
    "content": [
        "By Chavi Mehta, Jane Lanhee Lee and Stephen Nellis",
        "May 2 (Reuters) - Advanced Micro Devices shares slumped on Tuesday after the chipmaker forecast quarterly sales below estimates due to a weak PC market, overshadowing the company's optimism that the chip market would start to recover in the second half of 2023.The company also missed analyst estimates for PC and data center chips sales for the first quarter, and its shares fell over 6% in extended trading.That stood in contrast to rival Intel Corp, whose shares rose nearly 3% in extended trading. Intel last week said the PC market would start rebounding in the second half, raising Intel's margins with it.While analysts had watched AMD grab market share in the data center after Intel delayed ramping up the shipping of its most powerful data center processor chip code, named Sapphire Rapids, for over a year, some said they were seeing AMD now stall.\"I think AMD's days of taking large swaths of share will likely be over, and it will probably see a more aggressive market for data center competing with Intel,\" said Anshel Sag, analyst at Moor Insights &amp;amp; Strategy. \"AMD has great products in data center, but Intel still has a lot of customers who are still using Intel and deep (customer) relationships.\"Still, AMD CEO Lisa Su told investors on a conference call that the first quarter was the bottom of the market for the company's PC business and the industry.",
        "\"We remain confident in our ability to grow in the second half of the year,\" she said.Part of that growth, Su said, will come from a chip called the MI300, which will compete with Nvidia Corp's flagship chips for artificial intelligence. Su said customer interest in the chip is growing.\"We do believe that we will start ramping revenue in the fourth quarter with cloud AI customers, and then it'll be more meaningful in 2024,\" Su said. \"Success for us is having a significant part of the AI overall opportunity,\" she added.Nvidia has the bulk of the AI market, and analysts believe it has a strong hold on its position.\"We believe MI300 will be used primarily on special projects or on a case-by-case basis,\" said Summit Insights Group analyst Kinngai Chan, adding that the MI300 is likely to be inferior to Nvidia's latest H100 data center chip for large language model applications, such as ChatGPT.AMD forecast current-quarter revenue of about $5.3 billion, plus or minus $300 million. Analysts polled by Refinitiv were expecting revenue of $5.48 billion.Revenue in the fiscal first quarter ended April 1 came in at $5.35 billion, compared with estimates of $5.30 billion. (Reporting by Chavi Mehta in Bengaluru, Stephen Nellis and Jane Lanhee Lee in San Francisco; Editing by Maju Samuel, David Gregorio and Leslie Adler)"
    ]
}