{
    "articleURL": "/wires/reuters/article-12040357/GRAINS-Wheat-hits-2-year-low-bumper-northern-hemisphere-supply-hopes.html",
    "content": [
        "Crop-friendly weather across U.S., Russia, parts of Europe",
        "Talks on Black Sea grain export deal set for WednesdayU.S. corn, soybean planting progress weighs on prices(Recasts, adds quote in paragraphs 3-4, updates prices)By Naveen ThukralSINGAPORE, May 3 (Reuters) - Chicago wheat slid for a third consecutive session on Wednesday to its lowest in 25 months as the recent rain in U.S. winter wheat-growing areas and favourable weather in other northern hemisphere suppliers boosted expectations of abundant supplies.Corn and soybeans slid as rapidly progressing U.S. planting weighed on prices.\"On top of the bearish weather situation for the northern hemisphere, talks on UN-brokered deal that allows the safe Black Sea export of Ukrainian grain is scheduled for Wednesday,\" commodities research firm Hightower said in a report.\"All sides in negotiations involved are expected to attend.\"The most-active wheat contract on the Chicago Board of Trade (CBOT) lost 0.1% to $6.08-1/2 a bushel, as of 0302 GMT, after dropping earlier in the session to it lowest since April 2021 at $6.07-1/4 a bushel.Corn fell 0.6% to $5.76-1/2 a bushel and soybeans gave up 0.5% to $14.03-1/2 a bushel.Favourable weather conditions across top suppliers - the United States, Russia and Europe - are driving hopes of ample supplies in the second half of 2023.",
        "The U.S. winter wheat crop rating as of Sunday was up 2 points from the prior week at 28% \"good to excellent\", according to the U.S. Department of Agriculture (USDA).Soft wheat exports from the European Union in the 2022/23 season that started in July had reached 25.67 million tonnes by April 30, up 9% compared with 23.46 million a year earlier, data published by the European Commission showed on Tuesday.The wheat market is awaiting news on extension of the Black Sea grain export deal.Talks of the U.N.-brokered deal on safe Black Sea export of Ukrainian grain are scheduled later in the day, with all stakeholders involved, a senior Ukrainian source said on Tuesday.However, Ukraine's grain exports could fall to around 26 million tonnes in the 2023/24 season as harvest has sunk, largely due to Russia's invasion, a senior ministry official said.In the corn market, the USDA said planting was 26% complete as of Sunday, just below the average analyst estimate of 27% and matching the five-year average.U.S. soybean planting was 19% complete, ahead of the average analyst estimate of 17% and the five-year average of 11%.Commodity funds were net sellers of CBOT grain and soy futures contracts on Tuesday, traders said. (Reporting by Naveen Thukral; Editing by Sherry Jacob-Phillips and Sohini Goswami)"
    ]
}