{
    "articleURL": "/tvshowbiz/article-12059319/Matty-Healy-dances-Shake-watching-rumoured-girlfriend-Taylor-Swift-perform.html",
    "content": [
        "Matty Healy danced the night away during his rumoured girlfriend Taylor Swift's latest concert in Nashville.",
        "The 1975 singer, 34, got his groove on as he busted some moves to her 2014 hit Shake It Off at the Nissan Stadium on Sunday night.In a video shared to Twitter by a crowd member, he could be seen clapping and gyrating while attending the most recent gig in Taylor's Eras Tour.Other fans went wild as they spotted him wearing a T-shirt featuring the cover of her 1989 album, which he had been seen sporting in previous years.Earlier in the day, Taylor had been pictured for the first time with Matty in photos exclusively obtained by DailyMail.com. ",
        "Earlier in the day, Taylor had been pictured for the first time with Matty in photos exclusively obtained by DailyMail.com.The rumored couple were pictured arriving to Taylor's condo at 12:30AM on Sunday morning following her Eras concert in Nashville, Tennessee.They sat beside each other in the back of their chauffeured vehicle, where Matty, 34, was still wearing the same bracelet he sported earlier that evening while attending her concert alongside members of Taylor's girl squad, Gigi Hadid and Lily Aldridge.The sighting came a day before Taylor's third concert at Nashville's Nissan Stadium saw its start time delayed due to lightning in the area.Nissan Stadium will remain under Shelter in Place until the current storm passes - with Swift taking to the stage at a delayed start time.",
        "She posted on Instagram: 'Even though we have one last show in Nashville tonight I just have to post these photos causeeeee… it’s been WILD. I got to announce Speak Now (my version) is coming on 7/7, got to perform ‘Nothing New’ with boss genius/baby angel face @phoebebridgers for the first time, and have been so moved by these beautiful, generous Nashville crowds!!!! I just can’t believe it. PS I know there’s talk of a rainy weather vibe tonight but I’m ready to play, see you sooon!!'The new romance comes less than a month after Taylor, 33, split from her boyfriend of six years, actor Joe Alwyn.Only last month, Taylor's inner circle - including her brother Austin, Gigi and the Haim sisters - reportedly unfollowed her now-ex Joe.",
        "Many Swifties — her loyal and eagle-eyed fans — claimed that some of the songwriter's besties reportedly broke ties on Instagram just shortly after being spotted hanging out with the star and perhaps learning what really happened.The bold moves on social media appeared to suggest that there may be more to the breakup than the public is aware of.Just after catching up over dinner with longtime friends Blake Lively and her husband Ryan Reynolds, for instance, the Deadpool actor allegedly immediately unfollowed Alwyn.",
        "The obvious snub was a shocking move considering Ryan had previously gushed about the British actor and their six-year-long friendship in a TIME100 Next article published in September 2022. (His wife does not currently follow Alwyn.)The multi-Grammy winner's younger brother, Austin Swift, unfollowed Joe. The Conversations With Friends star still follows him.A few others who were quick to click unfollow were some of Taylor's gal pals after they were spotted hanging out in New York City on Thursday.Before dating rumors emerged around Swift and The 1975 singer, Taylor had dated British actor, Joe Alwyn, for six years until their split was confirmed last month in April.Shortly after being spending time with the Midnights singer, supermodel Gigi as well as the three Haim sisters reportedly all unfollowed The Favourite star.It is hard to confirm if they ever followed Joe in the first place, but Taylor's observant and perceptive fans shared screenshots of the Victoria's Secret Angel's following list less than 24 hours later.Reports also show that the three sisters making up the rock band HAIM — Alana, Danielle, and Este — allegedly all followed suit.",
        "Joe still follows Alana and Danielle, but it is unclear if he and Este ever followed each other initially.The three sisters reportedly even unfollowed Joe on their official HAIM band account.",
        "Supermodels and Victoria's Secret Angels Martha Hunt and Lily unfollowed him too.Matty's appearance on stage during Taylor's Eras Tour comes shortly after The Sun reported earlier Thursday that the rumored couple had plans to confirm the romance over the weekend during her Nashville stop. According to the outlet, Healy is slated to perform two of her popular songs, with a source stating, 'Taylor and Matty have been planning their ‘coming out’ for a few weeks now, and are really excited just to go public with their love.'The insider further revealed, 'Neither of them want any secrets, or to hide away. The plan is for Matty to walk out on stage mid-show and play two songs.''They will chat to the audience and, at present, the idea is for them to confirm their romance with some kind of PDA — public display of affection. It won’t be anything remotely cheesy though.'And on Saturday, Matty strummed on his guitar as he made an appearance with Taylor's supporting act during the show. Whether he will hop onto the stage once again to perform with the Blank Space hitmaker has yet to seen. Taylor and Matty's rumored romance first came to light earlier this week on Wednesday, with a separate source telling The Sun, 'She and Matty are madly in love.'",
        "'It’s super-early days, but it feels right. They first dated, very briefly, almost ten years ago but timings just didn’t work out,' the insider added.",
        "In regards to her ex, the source informed the publication, 'Taylor and Joe actually split up back in February, so there was absolutely no crossover.''Both Matty and Taylor have been touring over the past few weeks, so it’s been a lot of Face-Timing and texting but she cannot wait to see him again,' and added that the two stars, 'are incredibly supportive of their respective careers.''They are both massively proud and excited about this relationship and, unlike Taylor’s last one — which was very much kept out of the spotlight, deliberately — she wants to ‘own’ this romance, and not hide it away.'While Taylor focuses on her Eras Tour, which is slated to conclude later this year in August, Matty is also in the middle of touring with his band, The 1975.Before making a surprise appearance to join the opening act, the Robbers musician was seen making a quick Starbucks run after reportedly spending time at Taylor's Nashville condo earlier Friday night.As the British-born singer exited the popular coffee shop chain on Saturday, he carried a warm drink in his hand while also looking through his smartphone as he was led by a security guard to a sleek, white SUV parked near the coffee shop.",
        "After grabbing a drink to get a boost of energy, Healy was later seen arriving at Nissan Stadium in the heart of Nashville ahead of Taylor's Saturday night performance in the city.Earlier on Friday, he was seen dancing along to Swift as she sang her hit track, Shake It Off, amongst fellow concert-goers in a secured area on the floor section of the venue.The video was posted on Twitter and quickly went viral amid rumors that Matty and Taylor have started a budding romance. Despite the speculation that the two have entered a relationship, both singers have yet to publicly confirm they are dating."
    ]
}