{
    "articleURL": "/sport/football/article-12047167/Chelsea-keen-offload-Ruben-Loftus-Cheek-summer-amid-AC-Milan-interest.html",
    "content": [
        "Chelsea are keen to slim down their squad after signing 17 players this seasonMidfielder 'Ruben Loftus-Cheek is among those likely to leave' this summer AC Milan are 'interested in the 27-year-old', but cannot match his current wages Chelsea are 'looking to sell Ruben Loftus-Cheek this summer', but may struggle to find a club willing to match his £150,000-per-week wages despite 'interest in the midfielder from AC Milan.'",
        "The 27-year-old has never been able to nail down a regular spot at Stamford Bridge, and the Blues are willing to lose him in order to slim down their squad and wage bill.Loftus-Cheek has made 20 league appearances this season, but is unlikely to thrive in a squad that also includes the likes of N'Golo Kante and Enzo Fernandez.Despite this, reports in the Evening Standard suggest the midfielder is unwilling to leave his boyhood club.They also report that Milan are keen on bringing him to the San Siro, but only on much lower wages than he currently receives at Chelsea. ",
        "If Loftus-Cheek was to make the switch, he would link up with fellow Blues academy graduate Fikayo Tomori.However, it seems the Blues' incoming manager (Mauricio Pochettino is expected to join the club) would have to force the midfielder out as he still has 12 months left on his contract.Selling Loftus-Cheek would be a shrewd move from Chelsea on a number of counts. Aside from helping them shrink an awkwardly over-sized squad, he would also help the club stay in line with Financial Fair Play rules.Homegrown players can be sold for pure profit, which would offset the West London club's £600 million spend across the past two transfer windows.",
        "Mason Mount is another academy graduate likely to leave after interest from Liverpool and Arsenal, while Conor Gallagher could also be on the way out.",
        "Mateo Kovacic has also been targeted by Bayern Munich, while Kepa Arrizabalaga could leave as Pochettino is expected to prioritise signing a new goalkeeper and striker.Chelsea fans will be hoping the former Tottenham boss can arrive as soon as possible after a torrid run of form under Frank Lampard.They have lost all their six games under the club legend and now sit 12th in the Premier League table with five games left to play.Lampard's side will next be in action against Bournemouth, who can overtake them with a win, on Saturday. "
    ]
}