{
    "articleURL": "/wires/reuters/article-12043619/Vikings-QB-Kirk-Cousins-comfortable-familiar-win-status.html",
    "content": [
        "Kirk Cousins enters the fourth win-or-else season of his 12-year NFL career knowing the Vikings are willing to move on unless Minnesota reaches rare heights in 2023.",
        "Cousins, 34, is in the final year of his contract and sixth season with the Vikings. He tries not to spend much time considering it could be his final year with the franchise, which opted not to extend his deal despite a 13-4 record in 2022.\"I don't think you go there,\" Cousins said of contemplating the end of his run with Minnesota. \"I think it's healthiest to be present. To be focused on Phase 2, Wednesday, and live right now in the moment. And again, when you do that, you just do it day after day, and you get to next February, and you say, 'Everything will work out.' It's just best to stay in the present to have March go the way you want it to go.\"Cousins counts $20.25 million against the salary cap this season and trading -- Cousins has a full no-trade clause, meaning he'd have to approve his exit via trade -- or releasing him before June 1 would've cost the cash-strapped Vikings $48.75 million. The final two years on his deal are automatic void years, meaning he's a free agent in March barring a new round of bargaining with second-year general manager Kwesi Adofo-Mensah.\"I want to be in Minnesota. That's kind of a no-brainer,\" Cousins said. \"So, hopefully, we can earn the right to do that.\"",
        "Cousins led the NFL in fourth-quarter comebacks and game-winning drives in 2022. But winning in the regular season might not get it done this time. Cousins has delivered in this position before.In 2016 he played under the franchise tag in Washington, and the franchise tagged him again in 2017. Cousins left for a guaranteed $84 million on a three-year deal with the Vikings, who re-upped with him after the 2020 season on a two-year, $66 million deal.\"My fourth year after my rookie contract, the two years in Washington after that, and now this ... I would just say that to say, it's more the norm than the exception,\" Cousins said of his expiring deal. \"The exception is that you have something penciled in for future years. Most of our locker room has no idea what is coming in three or four months, let alone three or four years or next year. So, I feel like I'm one of the guys, if you will. We're all in this together, and that's the way this league works.\"Cousins was endorsed strongly by second-year head coach Kevin O'Connell, who noted Cousins last had the same voice calling plays in 2015 and 2016 when Sean McVay was a lead designer of the Washington scheme.",
        "\"This'll be really cool for him to be in the same system, call the same formations, the same plays,\" O'Connell said. \"I'm just excited to see him in year two and my goal is that 2023 is one of the best seasons Kirk Cousins has had playing quarterback in the NFL.\"--Field Level Media"
    ]
}