{
    "articleURL": "/tvshowbiz/article-12044823/The-Masked-Singer-Olivia-Culpo-reveals-identity-performing-UFO-season-quarterfinals.html",
    "content": [
        "'That was fun, you guys,' said Olivia, 30, who wore a silver outfit with a spaceship for a skirt while performing as UFO UFO sang Amy Winehouse's song Tears Dry On Their Own as dancers with umbrellas wearing British-themed outfits surrounded her. Medusa, California Roll and Macaw advanced to the semifinalsOlivia Culpo was unmasked as the UFO on Wednesday's quarterfinals episode of The Masked Singer that featured a British Invasion theme.",
        "The former Miss Universe received the lowest scores during the season nine episode and had her identity revealed at the end of the hour-long show.'No freaking way,' Jenny McCarthy Wahlberg, 50, screamed.'That was fun, you guys,' said Olivia, 30, who wore a silver outfit with a spaceship for a skirt.'I can't believe it's Olivia,' Nicole Scherzinger, 44, said. 'My friend Olivia!'",
        "'Did you know that she could sing like this?' Jenny asked.'I know that you are the most gorgeous human ever,' Nicole said. ' I mean, look at that face. But I didn't know you could sing.''I mean, I'm no Nicole Scherzinger but I like to sing in the shower,' Olivia said.'That takes a lot of guts to get up there,' Nicole said.Jenny pointed out that she made it to the quarterfinals.'I don't know how that happened,' Olivia quipped.Show host Nick Cannon, 42, asked her if singing was going to be something she would consider taking seriously moving forward.'The singing in the shower that I do I am going to just make it a little bit more professional-sounding,' Olivia said. 'I'm just going to bump it up a notch.'",
        "The crowd cheered for her and she danced around the stage. Nick asked her if there was anything she wanted to say to her fans, family or the panel.",
        "'Just thank you so much for this opportunity,' Olivia said. 'I really do feel like although I had a mask on, this is more of my personality that I got to share for the first time. So much of that I feel like I have to do is not about that, or people don't want to see your personality, so this was really, really fun for me.'Olivia then danced across the stage singing for the audience.Before her unmasking, the UFO was excited to perform for the audience in a disguise.'So much of my career is based on the way that I look physically, so adding value because of my energy or my singing, it feels like there is more that I have to offer,' UFO said. 'And, you know, I'm getting older, so, gotta hold on to something. Joking!'UFO sang Amy Winehouse's song Tears Dry On Their Own as dancers with umbrellas wearing British-themed outfits surrounded her. She jumped up and ran around the stage to celebrate when she finished.'You are so fun UFO,' Jenny said.A butler brought out a clue. It was a phone. Nick picked it up, listened to a garbled voice and said they were telling him the clue was 'red, white, and blue.'",
        "'I'm beyond proud to represent and come from the USA!,' UFO said.Nick asked UFO how The Masked Singer stage compared to other stages.'This is really great for me because my usual career is very rigid, and I feel like you have to be perfect,' UFO said. 'It's all about your appearance for example. And it's kind of strange, but, honestly, this is the most authentic I feel like I've ever been able to be.'Robin Thicke, 46, guessed she was supermodel Molly Sims. Jenny thought it was Gigi Hadid. Nicole was sure she was Lily Collins. Ken Jeong, 53, guessed she was Rebecca Romijn.UFO was one of the top four contestants competing on the show. Medusa, The California Roll, and Macaw all also performed.Nick opened the themed British show by coming out wearing a bowler hat and sat on a throne with a giant English flag behind him.'It promised to be a smashing night of British hits,' Nick said.",
        "The show ended with a touching in memoriam for Jerry Springer, who died April 27 at age 79. He appeared on the show last season performing as Beetle and his in memoriam was accompanied by a recording of the audience chanting, 'Jerry, Jerry, Jerry.'Macaw, a giant bird mask with feathers along his arm, went first. He sang Elton John's Your Song standing next to a red grand piano as someone played. The audience applauded when he finished.",
        "'What a beautiful, beautiful performance,' Nicole said.Macaw ran around the stage flapping his wings.'That vocal could win the championship of season nine,' Robin said.'We really got to see all the colors of your heart tonight on that stage,' Nicole said. 'Thank you for being so vulnerable and courageous to share that with us.'A butler they referred to as Gerard the Butler came out carrying a tray with a clue that read 'leader.''Whether in the studio, on the stage, or on TV, I know how to lead,' Macaw said.",
        "'The Macaw is Macaulay Culkin,' Ken guessed.Everyone laughed.'That is a Mac-awful guess,' Jenny quipped.Jenny thought it might be Ryan Cabrera. Nicole guessed it might be Darren Criss or David Archuleta.'After going through a lot of life transitions, I feel like I'm able to spread my wings and show my true colors,' Macaw said.California Roll, made up of five different singers, went next wearing giant sushi outfits. They took the stage together and sang Creep by Radiohead.'My mind is blown,' Jenny said when they finished.'Individually your voices are a voice to be reckoned with but together collectively you are limitless,' Nicole said.The butler brought out another clue that read 'White House.'",
        "'Well, we had such a good time performing at the White House they even gave us a standing O,' one of the rolls said.",
        "Jenny thought it was Pentatonix. Nicole thought it was members of the cast of Hamilton. Ken said they were Miami Sound Machine.'The harmonies come from our soul,' one of the rolls said. 'The reason we sing is to spread love, peace, and joy.'Medusa, with a giant head of green snakes, went next. She battled back into the competition after being saved by the judges with the Ding Dong Keep It On Bell. Medusa performed Adele's hit song Someone Like You.Robin and Ken got on top of their desks to applaud her when she finished. The crowd chanted 'Medusa.''Medusa, to me, you are the one to beat!' Nicole said.The butler brought out a clue that read 'Mom.''Being an artist is my greatest passion, but being a mom is my favorite job,' Medusa said.'That rules out Kesha,' Robin said.",
        "Nicole thought it was Imogen Heap or Amy Lee. Jenny thought it might be Ashlee Simpson. Nick asked Medusa where her deep emotion came from.'I have experienced devastating loss in my life, and I think my goal as an artist was for people to feel less alone and that's what music has always done for me,' Medusa said. 'So just the fact that you guys are feeling what I'm trying to portray, it means more than you'll ever know.'",
        "The rest of the contestants Macaw, California roll and Medusa moved on to the semifinals.The Masked Singer will return next week on Fox."
    ]
}