{
    "articleURL": "/news/article-12044033/Protests-New-York-Citys-subway-death-Jordan-Neely-hands-Marine-veteran.html",
    "content": [
        "Protests began on Wednesday inside of New York City's subway system following the death of Jordan Neely on MondayA video circulated online showed Neely, a homeless Michael Jackson impersonator, being put in a chokehold by another passengerActivists chanted 'black lives matter' and 'F*** Eric Adams' at Manhattan's Broadway-Lafayette station A homeless man's death has been ruled a homicide as protesters took to New York City's subway system to demonstrate his death at the hands of Marine veteran. ",
        "Jordan Neely, 30, was shouting and pacing aboard an F train in Manhattan on Monday afternoon, witnesses and police said, when he was taken to the floor by a 24-year-old US Marine veteran from Long Island who is between deployments.His death has now been ruled a homicide caused by compression of the neck. The decision of whether or not to charge the Marine will be made by the district attorney's office. Video of the altercation posted online showed the man lying beneath Neely, holding him in a headlock position for several minutes as Neely tried and failed to break free.A second passenger pinned Neely's arms while a third held down his shoulder. It was unclear why the group had moved to restrain him. Neely lost consciousness and was pronounced dead at a Manhattan hospital shortly afterwards. On Wednesday, protesters began assembling at New York City's Broadway-Lafayette subway station, where Neely was taken to the hospital from, to protest his death. Chants of 'black lives matter,' 'justice for Jordan Neely,' 'F*** Eric Adams' and 'the homeless matter' could be heard, reports Gothamist. ",
        "NYPD officers could be seen entering the subway platform carrying bundles of zip-ties. At the time of writing, as many as four arrests have been made at the protests, reports independent journalist Liam Quigley. ",
        "According to a flyer circulating on Facebook, the protest was scheduled to start at 3pm on Wednesday.The subduer was taken into custody and released without charges. His name has not been released publicly. A spokesperson for the Manhattan district attorney said an investigation was ongoing.Contacted by the New York Daily News on Wednesday, the Marine refused to answer questions. 'I'm not answering any questions. I appreciate it, but I'm not answering any questions,' he said.Also on Wednesday, New York Governor Kathy Hochul addressed the video saying it was 'deeply disturbing' but declined to say if the state would be investigating it as a criminal matter.  As news of Neely's death spread online, some New Yorkers recalled encountering him during the years he spent performing as a Michael Jackson impersonator, often inside the Times Square transit hub.",
        "His death comes amid a period of heightened public attention to both homelessness and mental illness on New York City's streets and subways. Following several high-profile incidents, including a shooting on a subway that left 10 people wounded last year, Mayor Eric Adams promised to deploy additional police officers and mental health workers throughout the transit system.Video of Monday's encounter evoked strong reactions from New Yorkers and officials, with some describing the act as a lethal overreaction to a person in the throes of mental illness and others defending the Marine's actions.",
        "The freelance journalist who recorded the incident, Juan Alberto Vazquez, told the New York Post that Neely was screaming 'in an aggressive manner' and complaining of hunger and thirst. Neely did not physically attack anyone, Vazquez said, adding that the 24-year-old approached the man after he threw his jacket to the ground.The video opens with Neely already on the subway car's floor, with the man's left arm around Neely's neck, locked into his other arm positioned against the man's head. ",
        "A second man holds Neely's outstretched arm while pinning the other hand against his body. Neely is mostly still, but half a minute later tries to struggle out of the headlock. Eventually, he goes limp.Dave Giffen, the executive director at Coalition for the Homeless, blamed city and state officials for an inadequate response to the mental health crisis and questioned why the Marine was not facing criminal charges.'The fact that someone who took the life of a distressed, mentally-ill human being on a subway could be set free without facing any consequences is shocking,' he said. 'This is an absolute travesty that must be investigated immediately.'Those calls were echoed by several Democratic elected officials, who described the incident as a low point for the city. A spokesperson for the mayor touted his administration's investment in mental health initiatives, but declined to comment directly on Neely's death, noting, 'There's a lot we don't know about what happened here.'",
        "Tribute videos posted online show a loyal fanbase who enjoyed crossing paths with Neely on their daily commutes. Some grew concerned when he went missing early last year, according to YouTube comments.Jason Williams, an actor, recalled encountering Neely when he first moved to the city in 2007. Then a teenager, Neely was an agile Michael Jackson impersonator, Williams said, soliciting donations as he moonwalked through the subway and lip-synced to 'Billie Jean.''He embodied the hustle spirit of New York,' Williams said. 'He was a great performer and it's a real tragedy that he was killed so senselessly.'"
    ]
}