{
    "articleURL": "/wires/reuters/article-12048239/U-S-Congress-gears-immigration-overhaul-Title-42-ends.html",
    "content": [
        "By Richard Cowan",
        "WASHINGTON, May 4 (Reuters) - A fresh push for a bipartisan immigration overhaul, coupled with enhanced border security, is emerging in the U.S. Congress, as thousands of migrants amass across the border in Mexico ahead of the end of COVID-era border restrictions next week.The latest among those efforts is a last-minute legislative push that would grant U.S. border authorities similar expulsion powers allowed under the expiring COVID restrictions - known as Title 42 - for a period of two years, according to a congressional office involved in the talks.Title 42 began under Republican former President Donald Trump in 2020 at the beginning of the COVID-19 pandemic and allows U.S. authorities to expel migrants to Mexico without the chance to seek asylum. The order is set to lift on May 11 when the COVID health emergency officially ends.But many Republicans and some Democrats, particularly in border areas, fear the end of the order will lead to a rise in migration that authorities are poorly equipped to face. A top border official recently told lawmakers that migrant crossings could jump to 10,000 per day after May 11, nearly double the daily average in March.Senators Kyrsten Sinema, an Arizona independent, and Thom Tillis, a North Carolina Republican, are leading the effort to temporarily extend border expulsions. The pair view it as a short-term fix while they work on broader immigration reform, Sinema spokesperson Hannah Hurley said.",
        "\"This is squarely about the immediate crisis with the end of Title 42,\" Hurley said.Separately, the Republican-controlled House of Representatives plans to pass a package of border security measures next week to place tougher constraints on asylum-seekers, resume construction of a wall along the southwest border with Mexico, and expand federal law enforcement.Many are seeking more sweeping change - but their hopes have been dashed in the past.It has been 37 years since Congress passed significant immigration reform, but a persistently high volume of migrants and an acute labor shortage have galvanized lawmakers. Republicans also cite the flow of illegal drugs into the United States through ports of entry as reason to harden border security.While some Democrats characterize the House border legislation as inhumane, several Democratic and Republican senators said they eagerly await such a bill.Tillis, who is pushing both the short-term legislative fix for Title 42's end and a wider package of reforms, said a House-passed bill would be \"something we can build on.\"\"It gives us some room to gain the support we need in the Senate\" for broader legislation, he said, adding it could take two to three months to construct a compromise. But senators had no illusions this would be an easy task.",
        "Dick Durbin, the No. 2 Senate Democrat, said the House bill would provide clues on Republicans' intent. He added that in conversations with fellow senators, \"One of the first things they say is 'well if the House starts the conversation I think we can get somewhere.' We'll see.\"Since a 1986 immigration reform package, which resulted in some 3 million immigrants winning legal status, Congress repeatedly has failed to update the nation's policies.Around 11 million unauthorized immigrants in the United States could have a stake in the outcome of this latest effort, along with U.S. businesses hungry for workers.To succeed in the Democrat-controlled Senate, it would need 60 senators from across both parties to back it, as well as win the support of the Republican-controlled House.\"A high-wire act,\" is how Republican Senator John Cornyn from border state Texas portrayed it, adding it was \"the only path forward.\"STARS ALIGNINGThe U.S. Chamber of Commerce, the nation's largest business association, has launched a campaign urging Congress to act. It was endorsed by 400 groups, ranging from the American Farm Bureau Federation to the U.S. Travel Association.Republican-controlled states see their farming, ranching, food processing and manufacturing businesses begging for workers, a void that immigrants could fill if not for Washington's clunky visa system.",
        "Finally, passage of an immigration bill coupled with beefed-up border security could boost President Joe Biden's re-election campaign and give Republican candidates something to cheer, too.The House bill would deal with some of the five \"buckets\" in the Tillis-Sinema effort, according to a Senate source familiar with their work.Overall, they include a modernization of the plodding asylum system, improvements to how visas are granted, and measures to more effectively authorize immigrants, be they laborers and healthcare workers or doctors and engineers, to fill American jobs.There is also the fate of 580,000 \"Dreamers\" enrolled in the Deferred Action for Childhood Arrivals (DACA) program, who were brought illegally into the United States as children.Republicans have blocked their path to citizenship for two decades, arguing that would encourage more to take the dangerous journey to the border.Senators acknowledge some of their goals might have to be abandoned to achieve a \"sweet spot.\" But which ones?Democratic Senator Chris Murphy, who won passage last year of the first major gun control bill in about three decades, did so in part by recognizing that a too ambitious bill is a recipe for failure.Murphy was asked how the difficulty of winning immigration legislation stacks up to other recent battles, such as gun control, gay marriage and infrastructure investments.",
        "\"It's an 11 on a scale of 10.\" (Reporting by Richard Cowan; additional reporting by Ted Hesson; Editing by Mary Milliken, Mica Rosenberg, Diane Craft and Rosalba O'Brien)"
    ]
}