{
    "articleURL": "/sport/formulaone/article-12056871/Lewis-Hamilton-steals-bold-purple-sequined-outfit-arrival-Miami-Grand-Prix.html",
    "content": [
        "Patrick Mahomes, Serena Williams and Elon Musk descended on Miami SundayRoger Federer, Shakira, Will.i.Am, Vin Diesel and Mike Tyson were also thereDailyMail.com provides all the latest international sports news Tom Cruise, Patrick Mahomes, Roger Federer and Serena Williams were among the star-studded line-up of celebrities descending on Florida for the Miami Grand Prix on Sunday afternoon.",
        "There are three US races on the calendar for the 2023 season, and this week marks the first of the year - with plenty of big names making the most of the opportunity to take in the action in the sunshine.Tennis great Federer was among the first to show up at the track on race-day, even getting the opportunity to be driven around the circuit by Mick Schumacher - the son of F1 legend Michael and current Mercedes third driver. Icons in the world of music were also on hand, with the Black Eyed Peas' Will.I.Am, music producer Timbaland, legendary rapper Wyclef Jean, and grime artist Skepta all seen in the paddock area ahead of the action.Retired Formula One racer Juan Pablo Montoya was seen walking around the garages while three-time world champion Jackie Stewart was seen speaking to Miami Dolphins owner Stephen Ross.",
        "Other legendary athletes like tennis star Juan Martin del Potro and World Cup winner Blaise Matuidi - wearing a PSG shirt - were photographed in Miami Gardens.Fashion designer Tommy Hilfiger was seen walking the grid with his wife Dee before the start of the day as well. Elsewhere, the likes of Mike Tyson, Jake Paul, singers Becky G and Shakira, soccer star Sergio Aguero, Brooklyn Beckham, Winnie Harlow and the Jonas Brothers were all listed as attendees for the race on Sunday.",
        "Vin Diesel, star of the Fast and Furious franchise, was also spotted giving a thumbs up to the crowd on Sunday afternoon. He later posed for a picture with a number of Ferrari staff members on the track before the race began.One of the most famous names on the star-studded invite list - who also attended qualifying on Sunday - was Elon Musk.There were plenty of current sports stars heading trackside too, with the Miami Heat's Jimmy Butler taking a day out from the NBA playoffs to take in the race, while NFL stars Dak Prescott and CeeDee Lamb were spotted chatting in the paddock.Ahead of the race, Lewis Hamilton made a very strong first impression, as the seven-time world championed wowed with his outfit ahead of the Grand Prix.The British Mercedes F1 driver entered the paddock in a bedazzled outfit covered in purple sequins, finishing it off with a pair of black Dr. Martens boots in the baking Miami sun.",
        "With highs around 80°F (27°C), Hamilton made one of the bolder choices in outfits of the rest of the grid - but he wasn't the only one making their mark.Haas driver Nico Hulkenberg stepped out in a matching shirt and shorts bathed in pink and palm trees while Alpha Tauri's Yuki Tsunoda went with a simple white linen outfit. ",
        "Ferrari's Charles Leclerc went with an oceanic theme - arriving in baby and sea blue colors."
    ]
}