{
    "articleURL": "/tvshowbiz/article-12047051/Chloe-Madeley-reveals-no-sex-drive-reduced-breastfeeding.html",
    "content": [
        "Chloe Madeley has candidly discussed her postpartum journey on her Instagram page after welcoming her first child with James Haskell last year.",
        "The fitness guru, 35, admitted she had no sex drive after giving birth and only regained her libido after she stopped breastfeeding and her cycle returned.Answering a fan who was concerned about their lack of sex drive after three months postpartum, Chloe reassured them that it was 'very common'.She said: 'If you're breastfeeding and or haven't started your menstrual cycle yet this is very common. It's down to low levels of oestrogen and also prolactin circulating the body.Revealing when her own sex drive returned, she said: 'I reduced BF and after a week or 2 knew my cycle was coming back because my libido reappeared.'",
        "Alongside the message, she said a sweet snap of her breastfeeding her daughter Bodhi, nine months, who she shares with her husband James. Chloe also discussed the stages she went through before returning to physical exercise because she didn't feel that her recovery was 'in the right spot yet'.The daughter of Richard Madeley and Judy Finnigan explained the stages were rest and recovery, a graded return to training and feeling 'neutral' about her body image.She began: '9 months postpartum... Boxes I patiently waited to be able to tick before embarking on a physique goal. This post can apply to anyone who has a goal, but knows their life isn't quite in the right spot to start yet... ",
        "'1. Rest and recovery. This can apply to anyone who's experienced injury, and make no mistake about it, your body postpartum and post childbirth is one, big, injured mess.'You have to accept that it needs time to rest in order heal, if you rush it, you only prolong your recovery and risk doing further damage. '2. Graded return to training. This means encouraging your body to readapt to physical stressors in a progressive fashion.'For me, this looked like short daily walks, and core and pelvic floor engagement in various planes of movement. '3. Neutral body image. This was an interesting one For me... There's a lot of encouragement from mums and the female media outlets to love and accept your pp body, yet when I posted this image.",
        "'I got a lot of heat from mums for posting it when essentially I didn't look postpartum enough for their standards, and ironically I was body shamed by numerous women.'But this is my body 4/5 weeks pp and it took a lot of mental attention in my pregnancy, and a lot of gentle mental ironing out pp, to accept that it wasn't going to change for a good few months, which was uncomfortable and daunting. Staying on neutral body image...",
        "'I'm not a huge fan of the body-self love-movement, not because I don't champion it in theory, but because in practice, it's extremely rare for most women (and not just in the western world) to fall in love with every inch of their internal and or external being.'And while some women can do it (at least they say they can on Instagram), most women can't, and not only is that perfectly normal it's also perfectly ok.",
        "'So instead of body adoration, I think body practicality / neutrality / acceptance is more realistic (and more healthy in every context tbh), and that's what I champion 100%.'Did you just have a baby? Have some kind of surgery? Ok, well your body is going to reflect that, it is what it is. Accept it and move forward. '4. Patience when reconfiguring your life ... And self encouragement that you will get there eventually getting to the gym 7 days a week a couple years ago was easy.'Getting to the gym 1 day a week now makes me feel like I have achieved beyoncé levels of success.",
        "'It's both physically and mentally exhausting having a baby, plus there's only so many hours in a day and even if / when you do get help, there's a thousand other things to do and then bang you've got your baby back again.",
        "'It took me 7/8 months to figure out how to find time to go to the gym somewhat consistently again.'This is an adjustment period, you will figure it out eventually. 5. Figuring out how to get some consistent control over your diet again. 'It's one thing implementing self control for a day or two, but when you're stressed and tired self control around food often goes out the window.'This is both a decision fatigue issue and also an hormonal response, ghrelin (hunger hormone) has been shown to spike in sleep deprived individuals.",
        "'You have to ask yourself how you're going to stick to it when you have a bad day, because the bad days are unavoidable, so you need a solution.'For me it was no more pringles in the house, m&amp;s count on us meals in the fridge and the huge mental effort that was the first calorie friendly takeaway I ordered - that was a real band aid rip! '6. Goal and timeline clarity. It's so frowned upon now but my experience as a coach is more valuable to me than the opinion of a zeitgeist pandering female on instagram...'It's very hard to reach your body goals without total clarity of both what the goal is and a timeline within which to achieve it...",
        "'And that doesn't just apply to your body goals being attainable fyi, it also applies to travel, work, finances, relationships... You will struggle with a goal if you view it as an open ended hope.'7. Keep trying! You won't have a perfect day every day, the golden rule of getting to your destination in the face of road closures? Find a way around and keep going!'You won't get anywhere if you give up every time it gets hard. Don't give up. Keep going."
    ]
}