{
    "articleURL": "/tvshowbiz/article-12040243/RHONJ-Teresa-Giudice-warns-fianc-hes-camera-excluding-Joe-Melissa-Gorga-group-dinner.html",
    "content": [
        " Teresa was driving with her youngest daughters Milania, 17, and Audriana, 12, when she accepted a call from her fiancé Luis 'Louie' Ruelas, 48Louie revealed that he was inviting all of her co-stars and their significant others except for her brother Joe and her sister-in-law Melissa to a pre-wedding dinnerTeresa also raised eyebrows at her surprise wedding shower when she omitted Melissa while thanking people by name for attending, including Louie's sisters Teresa Giudice warned her fiancé that he was caught on camera excluding her brother Joe Gorga and his wife Melissa Gorga from a pre-wedding group dinner.",
        "The 50-year-old reality star at her surprise bridal shower on Tuesday's episode of The Real Housewives Of New Jersey also noticeably did not mention Melissa, 43, as she delivered a speech thanking people by name for attending.Teresa was driving to the bridal shower with her youngest daughters Milania, 17, and Audriana, 12, when she accepted a call from her fiancé Luis 'Louie' Ruelas, 48.Louie revealed that he was calling to find out who he should invite to a pre-rehearsal dinner group gathering at the 'beautiful' Avra restaurant in New York City.He rattled off the people he was inviting, including Teresa's co-stars Dolores Catania, Jennifer Aydin, Jackie Goldschneider and even Margaret Josephs, who had recently feuded with his bride-to-be.",
        "'Just to put the invite out to all of them — except Melissa and Joe. I’m not inviting them but ...,' Louie said before Teresa cut him off.'You know the cameras are on, we’re filming, right?,' Teresa awkwardly told Louie as she looked in the mirror for Audriana's reaction in the back seat.'Oh, s***. OK,' Louie said.Teresa promptly took Louie off speakerphone as her daughters kept silent.'You have to invite everyone, you can’t just do some and not the others,' Teresa said while looking at Milania in the front passenger seat.",
        "Teresa then told her daughters that Joe and Melissa would be invited.'I don’t like to tell the kids everything that’s going on with my brother and Melissa unless I have to tell them,' Teresa admitted in a confessional.'There’s no reason to tell them anything right now. The wedding’s a week away. I’m so close to my happily ever after,' she added.",
        "Teresa raised eyebrows at her surprise wedding shower when she omitted Melissa while thanking people for attending, including Louie's sisters.'I mean, could she just not say, ''I'm just so happy my sister-in-law's here and that we're moving on in a good way?''', Margaret Josephs, 56, said in a confessional.'It feels very intentional and if I was Melissa, I would feel like I'm not very wanted,' she added.Melissa in a confessional took the high road.'Her new sister-in-laws seem lovely. I'm happy for her, I want that for her, too. I just don't understand why she feels like it's them or me. To me, she just was like, ''Ha, I replaced you guys. I have someone to call family, so bye'',' Melissa said.Melissa earlier in the episode told Joe, 43, about their group trip to Ireland to celebrate Teresa's upcoming wedding.She told Joe how she cried during a group event when she drew a picture of the Gorga family for Teresa and how afterward she realized she was done with her.",
        "'I don't want you to prove yourself anymore,' Joe told his wife.",
        "Melissa said she planned to attend the surprise bridal shower to maintain their fragile 'peace' until the wedding so Joe and her children could attend.'We'll be at the wedding. We're there for her, we're happy for her, and then it's like, I am done. I want off the ride. I am done,' Melissa told Joe.Joe and Melissa did not attend Teresa's wedding in August in New Jersey.The season 13 episode titled Messes &amp; Bridesmaid Dresses also showed Teresa's four daughters, including Gia, 22, and Gabriella, 19, trying on bridesmaids dresses.Gia got a video call from Teresa's ex-husband Joe Giudice, 50, and asked if it was okay to show their father the dresses.Teresa approved and had an amicable conversation with Joe.'Joe, I'm gonna keep praying every day that I hope one day you can come back here,' Teresa said.'Thank you, Tre,\" Joe said. 'I'm glad that you's are happy, and that things are going the way they are, and I appreciate everything that you're doing over there for my kids because, you know, I can't be there, and everybody deserves to be happy and as long as you's are happy, that's all that matters.'",
        "Teresa got emotional and wiped away tears during their conversation.'Joe wishing me happiness just shows how far we've come. I'm so proud of how we've continued our relationship, stayed connected. And I know that makes our daughters happy. He's always gonna be in my life,' Teresa said in a confessional.Teresa and Joe got divorced in 2020 after they both spent time serving prison sentences after pleading guilty to federal fraud charges.The episode also showed Teresa's brother Joe and his wife Melissa gifting their daughter Antonia with a white Porsche SUV for her 17th birthday. ",
        "'I drove a Toyota,' Melissa noted.'I drove an old Chevy,' quipped her mother Donna Marco, who drove up in the car to surprise Antonia.The surprise left Joe praising the wonders of family life and focusing on the positive people in his life. The Real Housewives Of New Jersey will return next week on Bravo."
    ]
}