{
    "articleURL": "/wires/ap/article-12051423/Nigerian-senator-wife-jailed-UK-organ-harvest-plot.html",
    "content": [
        "LONDON (AP) - A senior Nigerian politician and his wife were handed prison sentences Friday for conspiring to transport a street trader to the U.K. as part of an organ-harvesting plot.",
        "Ike Ekweremadu, former deputy president of the Nigerian Senate, and his wife Beatrice were convicted in March of conspiring to arrange the travel of a 21-year-old man to be a kidney donor for their sick daughter.Ike Ekweremadu, 60, was sentenced to nine years and eight months by a judge at London´s Central Criminal Court. Beatrice Ekweremadu, 56, was jailed for four and a half years and 51-year-old Dr. Obinna Obeta, described by prosecutors as a medical \"middleman\" in the plot, received a 10-year sentence.The case was the first to convict suspects of an organ-harvesting conspiracy under the U.K.´s modern slavery laws.Passing sentence, judge Jeremy Johnson said that \"people-trafficking across international borders for the harvesting of human organs is a form of slavery.\"\"It treats human beings and their body parts as commodities to be bought and sold. It is a trade that preys on poverty, misery and desperation,\" he said, telling the defendants: \"You each played a part in that despicable trade.\"Prosecutors said the couple was behind the recruitment of the man at a Lagos street market, and that they arranged for the victim to provide a kidney to their 25-year-old daughter, Sonia, in an 80,000-pound (nearly $100,000) transplant operation at a London hospital.They said the victim, who was transported to London in February 2022, believed he was being taken to Britain to work. When he discovered the truth, he fled and went to police.",
        "Meanwhile a doctor at the Royal Free Hospital had become suspicious about the circumstances surrounding the proposed operation, and decided it couldn´t go ahead. The Ekweremadus then tried to find more potential donors in Turkey, prosecutors said.Kidney donations are legal in the U.K., but it´s a criminal offense to pay someone for doing so.The victim, who can´t be named for legal reasons, told the trial that he did not agree to donate a kidney and \"would never\" have done so.\"My body is not for sale,\" he said.The victim, who now lives in the U.K., said members of his family in Nigeria had been visited and told to \"drop\" the case.\"I cannot think about going home to Nigeria,\" he said. \"These people are extremely powerful and I worry for my family.\"Even though I live here in the U.K. at the moment, I know I need to be careful too. I have no-one here, no family, no friends. I am having to start my life again.\"Detective Superintendent Andy Furphy of the Metropolitan Police said it had been a \"challenging and complex\" case.\"Ike and Beatrice Ekweremadu and Obeta preyed on the victim, a young man vulnerable by his personal circumstances, using their significant wealth and political influence to intimidate and exploit him,\" he said.",
        "\"The Metropolitan Police is committed to tackling modern slavery, human trafficking and exploitation in all its forms and we can only succeed in this by working closely with partners in the U.K. and overseas,\" he added."
    ]
}