{
    "articleURL": "/wires/reuters/article-12053565/Sudans-warring-parties-hold-talks-Saudi-Arabia.html",
    "content": [
        "RSF's Hemedti confirms group's participation",
        "Mediators press for peace at Jeddah talksFirst serious initiative to end fightingFurther gunfire, air strikes on Saturday -witness(Adds explosion in Bahri industrial zone, paragraph 10)By Aziz El Yaakoubi and Nafisa EltahirRIYADH, May 6 (Reuters) - Envoys from Sudan's warring military factions - the army and the paramilitary Rapid Support Forces - were in Jeddah for talks on Saturday, Saudi Arabia's foreign minister said, as international mediators pressed for an end to the three-week old conflict.The U.S.-Saudi initiative is the first serious attempt to end fighting that has turned parts of the Sudanese capital Khartoum into war zones and derailed an internationally backed plan to usher in civilian rule following years of unrest and uprisings.Riyadh and Washington earlier welcomed the \"pre-negotiation talks\" between the army and the RSF, and urged them to actively engage following numerous violated ceasefires.But both sides have made it clear they would only discuss a humanitarian truce, not negotiate an end to the war.Confirming his group's attendance, RSF leader Mohamed Hamdan Dagalo, commonly known as Hemedti, said he hoped the talks would achieve their intended aim of securing safe passage for civilians.Sudan's armed forces said they sent a delegation to the Red Sea city on Friday evening, but special envoy Dafallah Alhaj said the army would not sit down directly with any delegation that the \"rebellious\" RSF might send.",
        "Hemedti has meanwhile vowed to either capture or kill army leader Abdel Fattah al-Burhan, and there was also evidence on the ground that both sides remain unwilling to make compromises to end the bloodshed.Saudi foreign minister Faisal bin Farhan said in a tweet he hoped both sides would \"engage in dialogue that we hope will lead to the end of the conflict\".In the city of Bahri across the Nile from Khartoum, warplanes were heard overnight and explosions startled residents. \"We don't leave the house because we're scared of stray bullets,\" said a resident who gave his name as Ahmed.An eyewitness in Eastern Khartoum reported gun clashes and air strikes over residential areas on Saturday.Other witnesses said later in the day that they heard a large explosion and saw a plume of smoke that appeared to be coming from the industrial zone in Bahri.The Turkish ambassador's car also came under fire from unknown assailants, a Turkish diplomatic source said. The envoy was safe inside the embassy.Turkey's foreign minister said Turkey would move its embassy from Khartoum to Port Sudan following the attack.Both the RSF and army accused each other of being behind the attack.The conflict erupted on April 15, following the collapse of an internationally backed plan for a transition to democracy.",
        "Burhan, a career army officer, heads a ruling council installed after the 2019 ouster of long-time autocrat Omar al-Bashir and a 2021 military coup, while Hemedti, a former militia leader who made his name in the Darfur conflict, is his deputy.Prior to the fighting, Hemedti had been taking steps like moving closer to a civilian coalition that indicated he had political plans. Burhan has blamed the war on his \"ambitions.\"HUMANITARIAN CATASTROPHEWestern powers have backed the transition to a civilian government in a country that sits at a strategic crossroads between Egypt, Saudi Arabia, Ethiopia and Africa's volatile Sahel region.White House national security adviser Jake Sullivan was travelling to Saudi Arabia at the weekend for talks with Saudi leaders.Saudi Arabia has had close ties to Burhan and Hemedti, both of whom sent troops to help the Saudi-led coalition in its war against the Houthi group in Yemen. The kingdom is also focused on security in the Red Sea, which it shares with Sudan.The U.N. has significantly cut back its operations in Sudan after three of its employees were killed and its warehouses were looted, and sought guarantees of safe passage of humanitarian aid.The fighting has also impacted vital infrastructure and caused the closure of most hospitals in conflict areas. U.N. agencies have warned of a humanitarian catastrophe if clashes continue.",
        "The World Health Organisation said on Saturday it had delivered medical aid to Port Sudan, but was awaiting security and access clearances that have prevented several such shipments from reaching Khartoum, where the few hospitals that are functioning are running out of supplies.(Reporting by Moaz Abd-Alaziz and Nafisa Eltahir in Cairo and Emma Farge in Geneva and Huseyin Hayatsever in Istanbul; Writing by Aziz El Yaakoubi and Michael Georgy; Editing by Raju Gopalakrishnan, John Stonestreet, Frances Kerry and Alexander Smith)"
    ]
}