{
    "articleURL": "/sport/othersports/article-12050915/Ben-Ainslie-braced-Great-Britain-vs-France-showdown-SailGP-finale.html",
    "content": [
        "Great Britain sit fourth in the SailGP leaderboard entering the final weekendThey are one point behind France, with only the top three reaching podium raceThe entire season will be decided then, with Australia the stand-out favourites  So it all comes down to this. After 12 months, 10 rounds and plenty of globe-trotting, SailGP's third season will be decided in San Francisco this weekend.",
        "With the entire championship set to be decided by one grand finale race on Sunday, Australia's commanding 11-point lead at the top of the standings actually counts for very little.Tom Slingsby and his crew have set the standard all season long but will still have to execute the perfect strategy to finish top of the podium.New Zealand are also likely to make the three-boat, winner-takes-all race but the third spot will come down to a Battle Royale between France and Great Britain.The French boat, skippered by Quentin Delapierre, holds a slender one-point advantage over Sir Ben Ainslie's British team, meaning everything is up for grabs.",
        "Ainslie knows the San Francisco conditions well having contested the 2013 America's Cup there as tactician for Oracle Team USA, which may provide a competitive edge.'We are expecting good conditions, normally you get a pretty solid thermal breeze that comes in under the Golden Gate Bridge,' he told Mail Sport.'Strong winds and relatively flat water, which is good for these foiling boats. It is a perfect SailGP venue, you couldn't wish for a better venue for a finale.'It was a mixed bag in the fleet races for Britain during the last round in Christchurch, New Zealand, with third place the best they could achieve.",
        "France, meanwhile, have been resurgent in the last two rounds. They won all three completed races in Sydney and took the first one in Christchurch to leapfrog Britain in the overall leaderboard.Delapierre is on record as saying Ainslie is his sailing idol but the respect is very much mutual.'They are a relatively young team and they have done tremendously well this season,' Ainslie said.'I think they have been the stand-out team really when you look at where they've come from. We know they are tough competitors, we understand how to try and sail against them and that is ultimately our key focus.",
        "The top three boats will reach the podium race in San Francisco. This race alone determines the overall champion for the whole season. 1. Australia - 84pts2. New Zealand - 73pts3. France - 69pts4. Great Britain - 68pts5. Denmark - 60pts6. Canada - 59pts7. United States - 57pts8. Switzerland - 29pts9. Spain - 29pts",
        "'I have been massively impressed by the French team and Quentin. I think right now he is the stand-out sailor in SailGP, the way he has come into a team that was struggling last season and turned it around, getting them up to being potentially league champions.",
        "'The first part of San Francisco is beating the French, then if we do that, we get ourselves into the podium race and anything is possible.'Ainslie was frustrated with the way his crew executed their race starts in Christchurch, with the British boat getting into a tangle with the French and others at the line.With so much at stake, it's unlikely to be any easier in San Francisco but getting a jump on competitors is absolutely vital.'Starting is complex enough at the best of times but more so when you start getting to the business end of the season like we are now,' he said.'We were really getting wrapped up with the French, we had a good opportunity to put a bit of heat on them but ultimately the execution wasn't as good as it should have been.'Really, that's been on me to go away and have a think about that, what those key factors in those split-second decisions are. It really does come down to split-second timing at those moments.'In San Francisco, I expect even closer boat-on-boat action between the four teams that are vying for that podium race.'",
        "While there is immense pressure on Australia not to throw away all their excellent work this season, Ainslie is relaxed about the situation his boat finds itself in.",
        "'The good thing for our team is that we have zero to lose and everything to gain, which is a nice place to be in terms of going in with the right positive mental attitude and pushing hard.'The Kiwis are not that far ahead of the French and ourselves. We missed a whole event in Copenhagen [after striking an uncharted rock in practice] and so the form book is not massively different.'The French, Kiwis and ourselves have been pretty close for the whole season and it's not unrealistic the Kiwis could miss out if they're not careful.'As for the Aussies, if they lost it from here, that would be tough. But that is the nature of SailGP.'"
    ]
}