{
    "articleURL": "/wires/afp/article-12047637/Prosecutors-probe-chokehold-death-New-York-subway-rider.html",
    "content": [
        "New York prosecutors are investigating the death of a homeless man put in a chokehold by a fellow rider on the city's subway, in an incident that has sparked outrage.",
        "The death of Jordan Neely -- widely identified as a Michael Jackson impersonator who often performed on the train -- was caught on camera and has angered activists and left-leaning lawmakers.The incident touches on two burning issues in America's financial capital -- the many homeless people suffering mental illness and residents' fears for their safety on the underground.It also has a racial element that has sparked calls for protests: Neely was Black and the man who suffocated him to death appears to be white.The 30-year-old Neely was killed by \"compression\" of the neck as a result of \"homicide,\" New York's medical examiner told AFP in a statement.The video shows him on the ground of a subway train as another man, said by US media to be a 24-year-old US marine, holds him around the neck.Freelance journalist Juan Alberto Vazquez, who shot the footage, told AFP that the man restrained Neely after the latter started screaming at other passengers, saying he didn't have anything to eat or drink.Police have questioned the man and it is now up to prosecutors to decide whether to file charges in the case.\"As part of our rigorous ongoing investigation, we will review the medical examiner's report, assess all available video and photo footage, identify and interview as many witnesses as possible, and obtain additional medical records,\" a spokesperson for the Manhattan district attorney said in a statement sent to AFP Thursday.",
        "Neely was living on the streets and had been arrested dozens of times, according to reports. Friends told local media that he had a history of mental illness and that his mother had been murdered when he was a teenager.- 'Callous' -Dave Giffen, of the Coalition for the Homeless, said Neely's death was evidence of the city's \"callous indifference to the lives of those who are homeless and psychiatrically unwell.\"Left-wing Democratic lawmaker Alexandria Ocasio-Cortez wrote on Twitter that Neely \"was murdered.\"Centrist mayor Eric Adams told CNN that \"any loss of life is tragic,\" but that \"there is a lot we don't know about what happened here.\"\"We cannot just blanketly say what a passenger should or should not do in a situation like that,\" added Adams, who is Black.Demonstrators were due to protest in Brooklyn on Thursday evening demanding that the man be arrested.\"The initial response by our legal system to this killing is disturbing and puts on display for the world the double standards that Black people and other people of color continue to face,\" city council speaker Adrienne Adams said in a statement.Police said in a statement that officers responded to an incident on the F train at the Broadway-Lafayette subway station in Manhattan at 2:27 pm (1827 GMT) on Monday.",
        "They found Neely unconscious and he was transported to Lenox Hill hospital \"where he was pronounced deceased,\" the statement added."
    ]
}