{
    "articleURL": "/health/article-12038623/Scientific-American-slammed-woke-sex-binary-article.html",
    "content": [
        "The scientific journal published an article arguing against the sex binary Experts slammed the article, saying it 'distorts reality' and is incorrect READ MORE: Trans patients scramble for hormone drug fearing bans ",
        "The prestigious Scientific American has come under fire after publishing an editorial claiming that human sex is not binary.",
        "In the piece headlined 'Here’s Why Human Sex Is Not Binary', Princeton University anthropologist Dr Agustin Fuentes argues that considering biological sex as a binary is 'bad science'. He argues that using biological sex in cases such as the prison a person is assigned to or in cases of sports are the same logic used for discrimination akin to slavery.Biologists have slammed Dr Fuentes' assessment, with some fearing one of the world's leading scientific magazines is now kowtowing to a 'woke' agenda.Dr Jerry Coyne, a biologist at the University of Chicago, told DailyMail.com that the magazine is 'forcing a progressive lefty agenda' onto readers just wanting to learn about science. [Dr Fuentes] is imposing his ideology on nature,' Dr Coyne said.",
        "The article, published May 1, argues that the typical biological distinctions of 'male' and 'female' are not based just on the reproductive material a person produces.Dr Fuentes believes that when legally defining sex for sports and medicine, more than just whether someone produces sperm or eggs should be considered.In his piece, Dr Fuentes said misrepresentation of biology were used to justify slavery, denying women rights, racism and other forms of discrimination. He argues that because the distinction of sexes is not as clear in some animals as  others it belongs on a spectrum rather than a binary. ",
        "He cites some fish that can change from a sperm-producer to an egg-producer under certain circumstances.'Given what we know about biology across animals and in humans, efforts to represent human sex as binary based solely on what gametes one produces are not about biology but are about trying to restrict who counts as a full human in society,' he writes.  However, many leading biologists disagree with Dr Fuentes' assessment. Dr Colin Wright, an evolutionary biologist and author, wrote in a response to the Scientific American: 'When biologists claim that sex is binary, we mean something straightforward: There are only two sexes. This is true throughout the plant and animal kingdoms.''This is the biological definition of sex that all biologists adhere to,' Dr Coynesaid.'An organism’s sex is defined by the type of gamete (sperm or ova) it has the function of producing.'Experts also fear that claims that people who believe in basic biology are similar to bigots are dangerous.",
        "Amid the wave of bans, trans communities have been quietly circulating guides for purchase.",
        "'This true of all animals and true of almost all plants. It's a binary because there is no middle sex,' Dr Coyne continued.'This fact has been believed by biologists for many years. This fact has been denied by ideologues.'  ",
        "Dr Carole Hooven, an evolutionary biologist at Harvard University, told DailyMail.com: 'One should argue with evidence, and refrain from attacking the character of their opponents.''I’m sure there are some bigots who are trying to weaponize science; but that doesn’t change the scientific facts. 'They exist and aren’t going away, and we must learn to engage in respectful debate about their implications.'In response to these comments, Dr Fuentes told DailyMail.com: 'I am specifically arguing against the use of what kind of gametes one produces (ova or sperm) as the basis for legal and societal classifications and rights. 'The key point is that ova don't make a woman and sperm don't make a man in a legal or in a biological sense, thus should not be used as a legal basis.'Dr Coyne fears that this type of editorial appearing in a mainstream scientific publication is bad for science overall.'Teaching there is not two sexes in humans distorts the facts of nature. You distort people's understanding of reality,' he said.Dr Coyne claims the article is pushing an 'authoritarian progressive leftist agenda'. 'Its a politically neutral magazine being used as a political tool and that's a shame,' he said. 'Scientific American publishes fascinating articles about the latest scientific research, and often this work is relevant to important and timely issues,' Laura Helmuth, editor-and-chief of the journal, told DailyMail.com in response.",
        "'We hope the articles we share, many of which are written by leading experts, help readers understand our world. That is my only agenda.'He said that he agrees with many of his readers and associates that call the magazine the 'UnScientific American'.DailyMail.com reached out to the Scientific American and Ms Helmuth directly for comment. Dr Hooven warns these arguments that cloud the sex binary can put women in danger.",
        "'Sometimes sex matters, and sometimes it doesn’t. When it does, it can matter a great deal, especially for women,' she explained.'On average, men are bigger and stronger than women, and commit the overwhelming majority of rapes and murders. Most men could kill most women with their bare hands. 'These facts have informed the establishment of laws and social policies that protect female spaces, particularly those where women are in vulnerable positions such as where they sleep or shower (prison cells and locker rooms, for example). 'Historically, female sports categories have excluded males, given the average differences in size, strength, and power, so that females can compete on a relatively even playing field.'When asked for response, Dr Fuentes told DailyMail.com: 'Both Dr Coyne and Dr Hooven are well aware of the history of the misuse of false \"biology\" as ideology to remove rights. ",
        "'I do to tie the actual sex biology to that, but I do tie the specific application of an [sex] as indictors of human value and the definition of human to those historical wrongs.'Dr Wright said articles like Dr Fuentes' confuse the conversation of gender and sex.'Gender ideology seeks to portray sex as so incomprehensibly complex and multivariable that our traditional practice of classifying people as simply either male or female is grossly outdated,' he writes.'[It instead] should be abandoned for a revolutionary concept of “gender identity.”'This entails that males wouldn’t be barred from female sports, women’s prisons or any other space previously segregated according to our supposedly antiquated notions of “biological sex,” so long as they “identify” as female.'The Princeton expert also notes that in some mammal species, the male lactates for their offspring, which is usually associated with females.Dr Hooven, said Dr Fuentes is misrepresenting sex and the traits an animal has.'No serious scientist would argue that traits are binary; it is sex that is binary,' she explained.'Sex differences in hormones, strength, size, etc. are not the same as sex, but are strongly associated with it, just as an interest in construction equipment or dolls are traits associated with, but not the same as being a boy or girl.",
        "'In mammals, there are two sexes and two only. One can change their sex-related characteristics like hormones, mode of dress, muscle mass, even voice, but one cannot change sex. 'The point is, biologists and others understand that while male and female are binary sex categories based on gamete size, and bodies and behavior of boys and girls, men and women are extremely diverse, there are some circumstances in which sex matters.'Dr Fuentes disagrees with the assessment from the biologists. 'There are sexes and differences between them matter. That is not in dispute. But the overlaps between sexes also matter and are sufficient that the frame of a \"sex binary\" is misleading and inhibits better research and analyses,' he said."
    ]
}