{
    "articleURL": "/tvshowbiz/article-12053589/Amber-Gill-discusses-sexuality-cheering-Arsenal-player-girlfriend-Jen-Beattie.html",
    "content": [
        "She's dating Arsenal and Scotland footballer Jen Beattie. ",
        "And Amber Gill has said she's always been 'free spirited' as she discussed her sexuality while cheering on her girlfriend during Friday's match. The former Love Island star, 25, who won the reality show in 2019, came out last year after she tweeted: 'Switching teams was the best decision I made in my entire life.' As she made her way to see Arsenal Women beat Leicester City 1-0, Amber answered some of her fans questions. Sharing some photos to Instagram, she shared an encouraging message for a follower who was 'struggling to come to terms' with their own sexuality.",
        "Amber explained: 'I've always been a free spirited babes. Love you who you love, not a***d. So when I figured out I wasn't just an ally of the community I was a member, I was like cute. 'Talk to people close to you that you trust about it. You can DM me if you want to. 'Feel good about it you are a part of the best people in the world. Don't put pressure on to label yourself.'Amber and her friend cheered on Jen, before she headed home and snapped a sweet photo of them together. Recently she opened up about her romance and spoke out about being a positive influence for people wanting to come out at an older age. ",
        "In an exclusive chat with MailOnline, Amber said: 'I just know there was a certain point where I was like I want to pursue serious relationships with women - I’m still figuring it all out.'The reality star has since been flooded with messages of gratitude from fans who have thanked her for inspiring them, as her relationship with Jen blossoms, with Amber even thinking about making a documentary about her story.Amber continued: 'People say I make them feel comfortable and their emotions feel valid, so that’s why I love doing what I do and having a positive impact on people. ",
        "'I’ve been thinking of making a documentary because of the messages I’ve been receiving.'It’s important, and I love people who have paved the way and known since they were young and advocated for us, but also I think the people who haven’t done that are still valid, and part of the (LGBTQ+) community. 'I want to show them that you can still be part of the community whether you come out at 17, or 20 or 25.'On removing the stigma around coming out at an older age, Amber added: 'I bet loads of people feel if they’ve got to a certain age, that they can’t come out now and you can, whenever you want. You can decide whatever you want for yourself, whenever you want.'"
    ]
}