{
    "articleURL": "/wires/aap/article-12053235/AFL-issues-lifetime-bans-ongoing-racism-battle.html",
    "content": [
        "The AFL concedes racism will never be fully eradicated from the competition despite a new zero-tolerance approach resulting in lifetime bans for perpetrators.",
        "Nine football supporters have been banned for life this year and the league has confirmed at least another six are being investigated over racist behaviour.The new hard-line stance comes in response to a growing number of racist incidents at games this season, as well as on social media.Multiple players have been targeted, including Indigenous stars Jamarra Ugle-Hagan (Western Bulldogs), Izak Rankine (Adelaide) and Michael Walters (Fremantle).AFL Executive General Manager Inclusion and Social Policy Tanya Hosch on Saturday applauded fans for calling out racist behaviour at matches and urged them to alert authorities to similar incidents in future.\"I don't expect that this is going to go away overnight but I hope that this will serve as a demonstration to people that if we can find you there will be a serious consequence attached to it,\" Hosch told reporters.\"Hopefully over time it will relieve us from some of this terrible behaviour that really does cause a lot of harm to players and other people in the crowd.\"I hope it does over time but I don't expect that this action is going to fully eradicate racism.\"Hosch confirmed banned fans can apply to have their penalties reversed after five years, hopeful that perpetrators will reflect on and change their behaviour and attitudes.",
        "Banned fans will have their club and league memberships cancelled and photographs of them provided to security personnel at stadiums around the country in an effort to prevent them from attending matches.\"We do have to rely on (security) picking that up so I assume if someone really wanted to go to a huge amount of trouble to disguise themselves, they might slip through,\" Hosch said.\"But certainly we have the best process that we can possibly have, in partnership with the stadia, to identify these people who would be removed if we were able to locate them at a game in the course of the ban.\"Hosch said she was not at all surprised by the number of fans who had been banned for life this year.\"I wish it did shock me. For some time we've known that there are big numbers out there,\" Hosch said.\"Racism is an issue in society generally and of course with the large numbers of people that come together to enjoy the footy, you would have to know that some proportion of people with those ideas, beliefs and behaviours are going to be at the football.\"I wish that I was surprised, but I'm not. But I think the important thing is that with the identification of these offenders we're able to take action that I hope sends a really strong message about what's ok and what's not ok.\"",
        "Ugle-Hagan took a powerful stance against racism in March when he lifted his jumper during the Bulldogs' win over Brisbane and pointed to his skin, in a recreation of Nicky Winmar's iconic 1993 pose.Multiple players and clubs have publicly called out racist behaviour and Hosch said she was proud of the public stance the playing group had taken.\"The players are incredibly resilient and I know that they get amazing support from their clubs,\" Hosch said.\"That stand is becoming better understood and embraced among clubs, across the code and so many of the code's supporters and fans.\"Their resilience is incredible but they shouldn't have to tolerate it in the first place.\""
    ]
}