{
    "articleURL": "/wires/reuters/article-12058197/Gold-flat-traders-gear-US-inflation-data.html",
    "content": [
        "U.S. CPI due on Wednesday",
        "Dollar down 0.1%Platinum regaining investors' attention - ANZ(Updates prices)By Ashitha ShivaprasadMay 8 (Reuters) - Gold prices edged higher on Monday as the dollar eased, while investors awaited a key U.S. inflation data due this week that could influence the Federal Reserve's monetary policy stance.Spot gold was up 0.2% at $2,020.80 per ounce, as of 0634 GMT. U.S. gold futures also climbed 0.2% at $2,029.30.The dollar index dipped 0.1%, making bullion more attractive to overseas buyers.The U.S. consumer price index (CPI) data is due on Wednesday.Any signs of inflation being subdued would hinder the greenback due to lower interest rate expectations from the Fed, which could see gold trend higher, said Tim Waterer, chief market analyst at KCM Trade.Traders also keep a tab on the developments surrounding the U.S. banking sector and U.S. debt ceiling.U.S. Treasury Secretary Janet Yellen on Sunday issued a stark warning that a failure by Congress to act on the debt ceiling could trigger a \"constitutional crisis\".Gold would be among the \"prime beneficiaries\" if there are further signs of weakness in the U.S. economy and prices could move to $2,100 sooner rather than later, Waterer said.Economic uncertainty and lower rates attract demand for zero-yielding bullion.",
        "\"We are constructive on precious metals going into May ... We anticipate a trading range of $1,954-$2,080 per ounce for gold (in May),\" Edward Meir, metals analyst at Marex said in a note.On the physical front, China held 66.76 million fine troy ounces of gold at the end of April, up from 66.50 million ounces at end-March.Spot silver was up 0.1% at $25.67 per ounce.Platinum rose 0.5% at $1,064.03 and palladium gained 1.5% to $1,513.11.\"Platinum is regaining investors' attention as fundamentals improve,\" ANZ wrote in a note.\"South African mining challenges weigh on supply recovery this year, while demand is getting support from gold as well as substitution away from palladium.\" (Reporting by Ashitha Shivaprasad in Bengaluru; Editing by Sherry Jacob-Phillips abd Rashmi Aich)"
    ]
}