{
    "articleURL": "/news/article-12042305/Home-former-Brazilian-President-Bolsonaro-raided-six-people-arrested-fake-vaccine-card-probe.html",
    "content": [
        "Brazil's Federal Police is investigating a group that forged vaccine information for former President Jair Bolsonaro, his daughter and a former top aide's familyThe top aide, Colonel Mauricio Cid, was among six people who were arrested in series of raids Wednesday; Bolsonaro had his phone taken during a raid, tooAuthorities say vaccine cards were forged prior to Bolsonaro departing for the United States on December 30, a day before his presidential term ended Brazilian authorities raided the home of former President Jair Bolsonaro on Wednesday as part of an investigation of a group that allegedly forged COVID-19 vaccine cards.",
        "At least six people were arrested by the Federal Police as part of the operation, including Colonel Mauricio Cid, Bolsonaro's former top aide. Search and seizure warrants were also issued for 10 other suspects.Brazilian media outlets TV Globo and Globo News were able to confirm that the suspects allegedly entered vaccine information in the Ministry of Health system which false claimed that Bolsonaro, his 12-year-old daughter Laura Bolsonaro, Cid, his wife and daughter were vaccinated.The Federal Police is also looking into whether former first lady Michelle Bolsonaro's vaccination card was also altered.'With this, such people were able to issue the respective vaccination certificates and use them to circumvent the current health restrictions imposed by public authorities (Brazil and the United States) aimed at preventing the spread of contagious disease, in this case, the Covid pandemic,' the Federal Police said.",
        "Bolsonaro, who tested positive for the coronavirus on multiple occasions and compared the virus to 'a little flu,' told a bevy of reporters that he was 'surprised' by the raid at his Brasilia home. His cellphone was seized during the raid.'There was no adulteration on my part, it didn't happen,' he said. 'I didn't take the vaccine, period. I never denied that.'The former far-right leader also confirmed that his daughter never received the vaccine.",
        "Information in the National Health Data Network showed that Bolsonaro had received two doses of Pfizer. The first vaccine shot was administered August 13, 2022 and the second jab took place October 14, 2022. Both vaccine appointments took place at the municipal health center in the Rio de Janeiro city of Duque de Caxias.",
        "The vaccine information was entered into the National Immunization Proram Information System on December 21 by Duque de Caxias city government secretary João de Souza, who was among the six people apprehended Wednesday.The records were removed by December 27 by Duque de Caxias vaccine director, Claudia Acosta, who cited an 'error' in the system. Bolsonaro and his daughter departed for the United States on December 30, a day before his presidential term ended.Acosta was questioned by Federal Police agents Wednesday but was not placed in custody.The search adds to Bolsonaro's mounting legal headaches. Federal Police have questioned him at their Brasilia headquarters twice in the past month related to separate investigations - first, about three sets of diamond jewelry he received from Saudi Arabia and, second, regarding his potential role in sparking the Jan. 8 uprising by his supporters in the capital.Bolsonaro is also the subject of several investigations by Brazil´s electoral court into his actions during the presidential election campaign, particularly his unsubstantiated claims that the nation's electronic voting system is susceptible to fraud. Those threaten to strip him of his political rights and render him unable to run for office in upcoming elections.",
        "Separately, Bolsonaro and his allies are also facing a sprawling Supreme Court-led investigation regarding the spread of alleged falsehoods and disinformation in Brazil, and a federal police investigation for the alleged genocide of the Indigenous Yanomami people in the Amazon rainforest by encouraging illegal miners to invade their territory and thereby endangering their lives.The former president has denied any wrongdoing in all of the various cases under investigation.Six people have been arrested by Brazilian authorities as part of the investigation of a group that allegedly forged vaccine information in the government's COVID-19 data base.cards that were used by former President Jair Bolsonaro, his family and top aides to enter the United States."
    ]
}