{
    "articleURL": "/wires/ap/article-12061055/US-provide-Ukraine-1-2-billion-long-term-security-aid.html",
    "content": [
        "WASHINGTON (AP) - The U.S. will provide $1.2 billion more in long-term military aid to Ukraine to further bolster its air defenses as Russia continues to pound Ukraine with drones, rockets and surface-to-air missiles, the Pentagon said Tuesday.",
        "The aid package will be provided under the Ukraine Security Assistance Initiative. Unlike U.S. equipment, weapons and ammunition sent from Pentagon stocks that can be delivered to Ukraine quickly, this money is to be spent over the coming months or even years to ensure Ukraine's future security needs.The Pentagon said it will fund air-defense munitions and drones for air defense, and provide equipment to help modify Western air-defense launchers, missiles and radars so they can be used with Ukraine's systems. It will also buy artillery rounds, howitzer ammunition, satellite imagery assistance and funding for ongoing maintenance and spare parts for a variety of systems. U.S. officials said the weapons include HAWK air-defense systems. They spoke on condition of anonymity because that has not yet been formally announced.The Pentagon said the aid will build the capacity of Ukraine's military \"to defend its territory and deter Russian aggression over the long term.\"Including this package, the U.S. has provided Ukraine nearly $37 billion in military aid since Russia invaded in February 2022.The latest aid comes as Ukraine prepares to launch a spring offensive against Russian forces, with air defense a persistent issue.",
        "Ukraine's air defenses shot down 35 Iranian-made drones over Kyiv in Russia´s latest nighttime assault, officials said Monday. Wreckage from a drone struck a two-story apartment building in Kyiv´s western Svyatoshynskyi district, while other debris struck a car parked nearby, setting it on fire, Kyiv Mayor Vitali Klitschko said in a Telegram post.",
        "Russian shelling of 127 targets across northern, southern and eastern parts of Ukraine killed three civilians, the Ukrainian defense ministry said.Facing economic sanctions and limits on its supply chains due to its invasion of Ukraine, Russia has routinely turned to Iran´s Shahed drones to bolster its firepower. And U.S. aid packages - including more immediate military weapons and support - have included systems to shoot down and otherwise defeat the drones.___ Associated Press writer Tara Copp contributed to this report."
    ]
}