{
    "articleURL": "/wires/afp/article-12049295/Beautiful-Corolla-Afghan-love-affair-Toyota-endures-ages.html",
    "content": [
        "Little is certain in Afghanistan -- armies invade and retreat, governments rise and fall -- but when the key of a Toyota Corolla turns in the ignition, the engine can be relied upon to roar to life.",
        "A humble Japanese runabout with a reliable albeit unglamorous reputation, the Toyota Corolla is said to be the world's most popular car, with over 50 million trundling off production lines since 1966.Sturdy, uncomplicated and affordable, it is finely tuned for a nation where roads dissolve into punishing terrain, repairs rely on frayed supply chains, and a \"make do\" mentality has emerged from decades of hardship.\"These cars have always been there for people,\" says mechanic Mohammad Aman. \"If you travel with these cars, they can take you anywhere.\"",
        "\"The Corolla is quick, their metal is bold, they work well,\" the 50-year-old told AFP. Other cars \"are flimsy like paper\" by comparison, he insists.In Afghanistan, Corollas are virtually ubiquitous.Fleets of the suburban mainstay sell on forecourts overlooked by rusted Soviet troop carriers. Corolla taxis with pummelled bodywork jounce past humvees immobilised since US forces withdrew in 2021.Even hauling up a mountain in a 4X4 you may be overtaken by a careening Corolla driver.And Afghans everywhere emblazon their vehicles with English-language tributes romanticising the brand: \"Happiness is a Toyota feeling\", \"Toyota sets the standard\" and \"Beautiful Corolla\" have become the unofficial slogans of Kabul's grinding traffic jams.- 'Special craze' -Corollas flooded Afghanistan after the withdrawal of Soviet forces in 1989 and the subsequent collapse of the USSR -- before which Moscow's state-owned Lada brand dominated the market.",
        "They have had a background role in national history ever since.When Washington launched air strikes after the 9/11 attacks, Taliban founder Mullah Omar fled his Kandahar hideaway in a white Corolla.It was buried in 2001 but triumphantly excavated last year \"still in good condition\", a Taliban government spokesman said, adding it should be publicly displayed as a \"great historical monument\".",
        "Over the Taliban's 20-year insurgency, the Corolla became the vehicle of choice for car bombers.Expendably cheap and camouflaged in plain sight, they were packed with explosives and rammed into targets with devastating effects.In 2022, after American forces had pulled out, Taliban authorities boasted about a new Afghan-designed sports car: a supposed symbol of progress.But under its sleek, aerodynamic exterior were the mechanical innards of a modest Corolla.Everywhere, sprawling families cram into the car, with passengers far outnumbering seats.\"In other countries everything is used in the way it's intended,\" said auto dealer Azizullah Nazari. \"But in Afghanistan people don't care much about such standards.\"The 39-year-old has sold imported Corollas to suit any budget -- $1,500 to $14,000 -- and many seem to have taken a circuitous route to the country.He points to a pristine white model apparently originating from Canada. Its interior is lined with Korean newspaper and it has a Ghanaian number plate.",
        "Another has a bumper sticker from a US university; one more has the incongruous coat of arms of a district in central Germany.But all their roads have led to Afghanistan, where \"people have a special craze for Toyota\", Nazar insists.- 'Top and fantastic car' -Such is Afghans' faith in the car that the capital's largest repair market is not served by paved roads.Shuhada-e Salehin is a jungle of interchangeable spare parts where Corollas are praised for their workaday dependability.\"Some people's rides are simple, but some have a passion for making them fancy,\" explains mechanic Aman.",
        "Begrimed with engine grease, his colleagues peer under the hood of an impossibly battered 1991 wagon -- its paintwork cracked like a dry riverbed, the back wheel chocked with a stone, a peeling \"fantastic Corolla\" decal stuck to the window.Next door, others fiddle with tendrils of wiring in the footwell of a Corolla adorned with cursive verse: \"HighSpeed Toyota. Top and fantastic car in the world. Compatible with all condition.\"A dull green model nearby is improbably branded \"Dramatic Classic Car\".Out in Kabul's afternoon traffic, 27-year-old cab driver Naqeebullah pilots a sun-bleached Corolla three years his senior as he scouts for fares.He estimates 80 percent of vehicles on the road match his.",
        "\"All cars have failed to show results apart from the Toyota Corolla,\" he puts it simply.Swaying from his rearview mirror is a prayer card. \"Glorified be the one who has made this means of transport subservient to us,\" it reads."
    ]
}