{
    "articleURL": "/news/article-12042799/Lori-Vallow-smirks-distraught-friend-tells-murder-trial-threatened-kill-bury-her.html",
    "content": [
        "Audrey Barattiero wept as she recounted how she confronted the cult mom about whether there was 'anything weird going on' in October, 2019Vallow then began laughing hysterically before allegedly telling Barattiero that she would cut her up and bury her 'in a place nobody would ever find me'At the time, Vallow's two kids JJ, seven, and Tylee, 16, had vanished. They were found a year later buried in her new husband Chad Daybell's backyardLori Vallow today smirked as a distraught former friend of the cult mom told her murder trial that she threatened to cut her up and bury her in trash bags.",
        "Audrey Barattiero, who was staying at Vallow's apartment in Rexburg, Idaho, in October 2019, wept as she recounted how she confronted her about whether there was 'anything weird going on'. Vallow told her, 'No.'At the time, Vallow's kids JJ, seven, and Tylee, 16, had vanished. Nine months later, they were found buried in her new husband's backyard. JJ's body was in trash bags.Barattiero told Vallow she was going to pack. 'As soon as I turned to go upstairs, she started laughing – as if at something hilarious,' Barattiero recalled. Vallow told her: 'You're so naïve and too trusting. You're like a little child ... Well I've got news for you. Not everyone is a good person and not everyone can be so kind.'Barattiero told the court Vallow threatened to kill her: 'She said she would cut me up ... it would be so messy and there would be so much blood and something about bleach and trash bags. She would bury me in a place nobody would ever find me.'",
        "Vallow sat smiling - almost appearing to laugh at times - and whispered feverishly to her attorneys during Barattiero's emotional testimony at the Ada County Courthouse in Boise on Wednesday.The cult mom, 49, and her new husband Chad Daybell are accused of murdering her kids and then killing Daybell's wife Tammy a month later. Two weeks after Tammy's death the pair married in Hawaii.",
        "Defense attorney Jim Archibald grilled Barattiero over the 'crap' he accused her of making up after never disclosing it at grand jury proceedings. The witness testified that she had never spoken of it before because Vallow terrified her.'Nothing of this sort was talked about. You want the jury to believe that you just didn't make this last crap up?' Archibald said.Barattiero replied: 'I did not make it up.' She said she hadn't mentioned it before because Vallow said: 'If you ever tell anyone, I will find you in the dark of the night.'Earlier the witness told how Vallow had pledged to use 'knives and fire' to drive an evil spirit out of her husband at the time, Charles, just days before he was shot dead by Vallow's brother.Barattiero was attending a religious conference with the cult mom in Utah when she said she 'wanted to work on getting a negative spirit out of Charles.'Barattiero said Vallow claimed that her husband was a 'zombie' who had been possessed by an evil spirit. The alleged killer was leading a group of women in a prayer-like circle in her hotel room when she said she would use 'knives and fire and weapons' to 'work on her husband.'The conference was in June, 2019. On July 11 of that year, Charles Vallow was shot dead in Arizona by Vallow's brother Alex Cox who is also accused of being involved in the murder of her two kids.",
        "Vallow moved to Rexburg, Idaho, after Charles' death to be near her future husband Daybell. The State says the same theories about evil spirits and 'zombies' were used by Vallow and Daybell to justify the killings of her two kids and Daybell's wife Tammy.Barattiero said she met Daybell and Vallow in late 2018. At the time Vallow was married to Charles and Daybell was married to Tammy, but the pair are believed to have started an affair long before their eventual marriage.'I believed that there was kinda a vibe,' Barattierro told jurors. 'They didn't seem flirtatious but it seemed like they maybe liked each other or something.'",
        "She said that Daybell, who was a religious author and the self-styled leader of their deranged cult, later asked her to be friends with Vallow.Barattiero said Daybell told her 'he couldn't talk to her all the time'. She added: 'My impression was that he was trying to keep propriety because he was married.'She told the court that in January or February of 2019, Daybell told her his wife was going to be dead within a year.'He said that he had a near death experience and that a deceased relative told him that [Tammy] would pass on by the time she was 50,' Barattiero told jurors. Tammy Daybell died aged 49, seven months before her birthday.",
        "She said that in October 2019, the month of Tammy's death, Vallow had visited her in Missouri. She was over at Vallow's hotel when she told her that Tammy's spirit was in a cage and needed to be freed because 'some person has overtaken her body.'Vallow asked Barattierro to help with casting out the evil spirit from Tammy. Barattierro broke down as she told the court: 'I told her I did not want to help and did not want to participate. She highly pressured me saying you're supposed to be my friend, you're supposed to help me. I reiterated I didn't want to and she kept on.'Tammy died at the Daybells' home in Rexburg on October 19, 2019. She was initially determined to have died of natural causes but when cops started searching for Vallow's missing children her body was exhumed.An autopsy - which had been refused by Daybell - found she was suffocated.",
        "Vallow and Daybell tied the knot on a beach in Kauai on November 5, 2019. Receipts show she purchased her own wedding ring on Amazon almost three weeks before Tammy's death. The children were missing for almost a year before their corpses were found buried in Daybell's yard on June 9, 2020.During the opening, prosecutor Lindsey Blake described how charred remains were all that was left of Tylee.",
        "She told jurors: 'You will hear it explained as a mass of bone and tissue. That's what was left of this beautiful young woman.'Tylee's DNA was later found on a pickaxe and shovel in a shed on the property. JJ's body was wrapped in trash bags and duct tape - the tape binding his arms in front of him and wrapping around his head.The two children and Daybell's previous wife Tammy were all killed because they stood in the way of the couple's relationship, the State says. 'Remember, the defendant will remove any obstacle in her way to get what she wants, and she wanted Chad Daybell,' Blake told jurors.",
        "'The defendant used money, power and sex to get what she wanted.'Jurors have heard from friends and relatives of Vallow that she and Daybell believed the children were 'dark' and referred to them as 'zombies' before they disappeared.'The common theme was the body has to be destroyed,' Blake said. 'The defendant and Chad used their self-proclaimed religious teachings to justify their actions to others — their actions from affair to murder.'Prosecutors say the couple planned to use life insurance money from Tammy's death, and that Vallow kept collecting and spending the children's social security and benefits after they died.",
        "The trial opened on April 10 and the State is still laying out its case. Vallow denies two counts of first-degree murder and three counts of conspiracy in the deaths of her two children and Tammy Daybell.She further denies grand theft for allegedly collecting government benefits on behalf of her children after they were killed.Daybell is being tried separately.",
        "July 11, 2019: Lori Vallow's husband, Charles Vallow, is killed by her brother, Alex Cox, in Arizona. Police initially rule that Alex acted in self defense but reopen the case months later after the children are reported missing. August, 2019: Lori moves children JJ and Tylee to Rexburg, Idaho, close to where her future husband Chad Daybell lives with his wife Tammy.September 8, 2019: Tylee is seen alive for the last time during a trip to Yellowstone National Park with Lori, JJ and Alex. In the following weeks Lori tells people that her daughter is studying at Brigham Young University's Idaho campus.September 23, 2019: The last time JJ is seen at his school in Rexburg. Lori emails the school the following day claiming she is moving the family to California for a new job. October 2, 2019: Brandon Boudreaux, the ex-husband of Lori's niece Melani Pawlowski, is targeted in a drive-by shooting in Arizona. Police identify the vehicle carrying the shooter as a Jeep registered to Charles Vallow, Lori's late husband. October 19, 2019: Chad's wife Tammy, 49, dies at their Idaho home. An obituary states that she passed away peacefully in her sleep. Chad declines an autopsy and her death is listed as due to natural causes.October 25, 2019: A friend of Tylee receives a vague 'miss you' text from her phone but says that it didn't sound like the teen.   November 5, 2019: Lori and Chad tie the knot on a beach in Kauai. Receipts indicate that Lori purchased her own wedding ring from Amazon nearly three weeks prior to Tammy's death. November 26, 2019: Out-of-state relatives ask Idaho police to perform a welfare check on JJ. Lori and Chad claim he is in Arizona with relatives and ask their friend, Melanie Gibb, to lie and say she took the boy there for Thanksgiving. Police soon learn that no one has seen JJ or Tylee, since September. November 27, 2019: Police execute a search warrant related to the children at Lori's home and discover that she and Chad have fled Idaho.December 11, 2019: Tammy's body is exhumed from a Utah cemetery and her death is reclassified as suspicious.December 12, 2019: Lori's brother, Alex Cox, is found dead in a bathroom in his Arizona home. Months later an autopsy determines that he died of natural causes while he had the overdose drug Narcan in his system. December 21, 2019: Rexburg police issue the first press release about JJ and Tylee, revealing they believe their disappearance could be linked to Tammy's death and asking the public for information.December 24, 2019: Lori and Chad issue a statement through an attorney saying they love their son and daughter and look forward to addressing 'allegations once they have moved beyond speculation and rumor'.December 30, 2019: Police accuse Lori and Chad of lying to investigators and say they believe the couple know where the kids are or what happened to them.January 3, 2020: Police search Chad's home in Salem and remove 43 items, including tech devices and journals. They also comb over sections of the snow-covered yard with rakes and metal detectors.January 26, 2020: Lori and Chad are seen for the first time in months as police serve them with two search warrants in Kauai. Lori is also served with a court order to produce the children to authorities in Idaho in five days. The couple are approached by the media while officers serve the documents and refuse to say anything about the children.January 30, 2020: Lori misses the court deadline to produce the children to Idaho authorities.February 20, 2020: Lori is arrested in Kauai and charged with two felony counts for desertion and nonsupport of dependent children, and one misdemeanor count each for resisting and obstructing an officer, solicitation of a crime, and contempt of court. March 5, 2020: Lori is extradited to Idaho, where she is held on $1million bond at Madison County Jail.March 17, 2020: Lori professes her innocence in a statement through her attorney as two other members of her defense team quit and the judge removes himself from the case. March 24, 2020: Court documents filed in the divorce of Lori's niece Melani and her husband Brandon Boudreaux allege that Lori told people she believed her children were zombies before they disappeared. April 9, 2020: Authorities reveal they are investigating Lori and Chad for murder, attempted murder and conspiracy in connection with Tammy's death. June 9, 2020: Police search Chad's home in Salem for the second time and discover human remains in the backyard. Chad is taken into police custody and charged with destruction or concealment of evidence.May 25, 2021: Lori and Chad are charged with first degree murder in the deaths of the children. Chad is also charged with first-degree murder in the death of his wife Tammy. May 27, 2021: Lori is deemed incompetent to stand trial on the murder charges in Idaho. August 5, 2021: Prosecution announces it will seek the death penalty for Chad. April 11, 2022: Lori is restored competency. Criminal proceedings against her in Idaho are ordered to continue. April 14, 2022: Lori is taken to the Madison County Jail in Rexburg, Idaho, by Fremont County Sheriff officers.April 10, 2023: Lori Vallow goes on trial for the murders of JJ, 7, and Tylee, 16. "
    ]
}