{
    "articleURL": "/femail/real-life/article-12049693/Australia-dangerous-country-workplace-harassment-violence-Lloyds-Register-Foundation.html",
    "content": [
        "Australia one of the most dangerous places to work More than double the global average violenceAustralia has been named one of the most dangerous places in the world to work with almost half of all workers claiming to have experienced violence and harassment while on the job. ",
        "More people in Australia claim to have suffered physical, psychological or sexual violence than any other country, according to a new report by Lloyd's Register Foundation.A shocking 49 per cent of Australian workers have faced from violence in the work place, while the global average stands at 21 per cent.New Zealand is not far behind, with 42 per cent of workers in the country complaining of workplace violence.Dr Sarah Cumbers, Director of Evidence and Insight at Lloyd's Register Foundation, said: 'The latest results from our World Risk Poll do not paint a positive picture for the region. ",
        "Regions with the highest reported experience of multiple incidents of violence and harassment in the workplaceAnother important characteristic of psychological violence and harassment at work is that it is often experienced multiple times. 61.2% of individuals worldwide who have ever experienced it report facing it three or more times, including 36.9% who reported experiencing it more than five times ( PhysicalAustralia and New Zealand (71.9%)Central/Western Africa (67.2%)East Asia (61.7%)PsychologicalAustralia and New Zealand (79.3%)Northern America (73.8%)Eastern Europe (68.6%)SexualNorthern America (65.4%)Australia and New Zealand (65.4%)Central Asia (64.9%)",
        "'The data allows us to identify both the frequency and type of violence and harassment that workers are experiencing. 'Unfortunately for Australia and New Zealand, a majority of participants from the region who reported experience of violence and harassment to the poll had experienced it three or more times.'",
        "The study found that 52 per cent of women in Australia and New Zealand have experienced violence and harassment in the workplace at some point in their life. In comparison, 44 per cent of men reported similar experiences.'Nobody should go to work and face violence and harassment – whether physical, psychological or sexual – yet our data suggests this is happening at an alarmingly high rate,' Dr Cumbers added.'There is a need for immediate action in Australia and New Zealand, with interventions set up to ensure workers are better protected. 'Business leaders, governments and trade bodies must come together and ensure these findings are not ignored.'Those who have experienced violence have suffered more than one, with 72 per cent of those in Australia and New Zealand who have seen violence in the workplace describing it as something that happens 'repeatedly'. To compile the global report, 125,000 people across 121 countries were polled about their experiences of workplace violence and harassment.All those interviewed were given a comprehensive definition of each of the three forms of 'violence and harassment' (physical, psychological, and sexual) that they were asked about.While the results are shocking reading for Australians, it may be down to Aussies being more likely to complain at work.",
        "Dr Sarah Cumbers added to FEMAIL that the results were 'alarming' but 'not unprecedented'.'The previous Poll in 2019 also showed high levels of experience of violence and harassment at work in the region, particularly among women.'While another 2018 study focused on Australia found more than half of workers had experienced sexual harassment at their current or previous workplace,' she said.",
        "She explained the latest World Risk Poll showed that people Australia and New Zealand also have the highest rate of repeat violence.With many people complaining of violent encounters more than three times. 'This suggests that, even if these incidents are being reported to employers, they may not be acted on effectively to stop the problem recurring,' Dr Cumbers said.'This presents a clear call to action to employers to take complaints seriously and ensure appropriate action is taken.'",
        " HIGHEST RATES OF VIOLENCEAustralia Finland Iceland  New Zealand Denmark  United States Norway  Canada  Greece  Sweden LOWEST RATES OF VIOLENCE",
        "KyrgyzstanLebanonMalaysiaUzbekistanArmeniaIndonesiaGeorgiaKazakhstanPakistanTajikistan ",
        "She added that the poll shows that workers in Australia and New Zealand are also significantly more likely to tell someone else about their experience than the global average. 'This is most frequently a friend or family member, but significant numbers – around two thirds of those who told the poll they had experienced violence and harassment – also said they told their employer or a supervisor. ",
        "'Together, these findings suggest that Australia and New Zealand is a region where there is both high experience of violence and harassment and work, but also high social recognition of what constitutes violence and harassment. 'The first step to addressing a problem is always recognising that the problem exists, so this aspect of the findings is encouraging, but there is clearly a huge amount of work to be done to actually tackle the issue.'John Ninness, Principal Consultant at Safetysure, a leading provider of workplace health and safety consultant agency in Australia added there is a 'growing body of evidence that supports many Australian workers have been subject to workplace violence, aggression or harassment.''Direct comparison of workplace violence and harassment in Australia and other countries is complex,' he said.'There are often variations in definitions and interpretation what constitutes workplace violence and harassment, reporting mechanisms, and/or specific cultural differences of those who report workplace violence. 'For example I believe that workplace violence and harassment is less likely to be reported in some Asian cultures.'Notwithstanding that workplace violence, aggression and harassment is clearly a global problem that can occur in any country or industry,' he said.Adding: 'The Lloyds Register Foundation Report World Risk Poll 2021: Safe at Work? is an important work that highlights the gravity of workplace violence globally rather than Australia in general.'",
        "'Australia is now taking a stand on workplace violence, aggression and harassment through some of the world's leading laws on workplace psycho-social hazard management which I believe (over time) should see our workplaces eliminate and/or substantially reduce psycho-social risks.'"
    ]
}