{
    "articleURL": "/sport/othersports/article-12043925/Ronaldos-six-mini-meals-day-Bradys-tomato-boycott-Sports-stars-weird-wonderful-diets.html",
    "content": [
        "From 'magic potion' smoothies to mate tea, athletes fuel up in different waysAnd some like NBA star Chris Paul have cut meat out of their diets completelyDailyMail.com provides all the latest international sports newsWill Levis's fall out of the first round of the NFL Draft was surprising, but not as surprising as some of his dietary habits.",
        "After Levis was selected by the Titans at No. 33, a TikTok from 2021 resurfaced where he was seen eating unpeeled and overripe bananas.Some defended the banana decision online, saying that fruit contains its highest antioxidant levels once its past its sell-by date.But it was harder to justify his decision to put mayo in his coffee last year, a curious move that some fans branded a publicity stunt.Nonetheless the muscular quarterback appears to be doing something right in terms of his food choices, and he's far from the only pro athlete who keeps a close eye on their diet.Here, DailyMail.com looks at some weird and notable food choices in the sports world.",
        "Cristiano RonaldoAt 38 years old, the Portuguese striker remains in top condition, and that's largely down to his extremely strict diet.He is said to eat six smaller, protein-packed meals throughout the day instead of the typical main meals of breakfast, lunch and dinner.And the former Manchester United and Real Madrid player has a particular love of fresh fish, according to Portuguese national team chef Luis Lavrador.His favorite options from the sea include swordfish, sea bass, sea bream and cod.For breakfast, Ronaldo often opts for cheese, ham, and low-fat yogurt, while he also enjoys avocado toast as a snack.",
        "The star has also lauded chicken as 'magical' for its mix of high protein but low fat, while salad, whole grains like quinoa, and fresh fruit are also part of his daily intake.",
        "Erling HaalandHaaland has smashed the Premier League's single-season scoring record in his first year with Manchester City, and a 'magic potion' might just be behind it.The Norwegian striker revealed last month that his special drink consists of milk, kale and spinach.But the hulking striker consumes far more than just smoothies, taking in almost 6,000 calories a day - which is two-and-a-half times more than the average man should.The 22-year-old has shared that he gets protein from somewhat unconventional sources, eating cow's hearts and livers for fuel.But while the striker is clearly a meat-eater, he is conscious of where his protein comes from.  'People say meat is bad for you but which?,' he said in documentary 'Haaland: The Big Decision.' 'The meat you get at McDonald's?'",
        "Josh HartWhile Ronaldo and Haaland are extremely meticulous about what they put in their bodies, Hart doesn't seem to be as picky.The New York Knicks guard has been seen munching on pizza and chicken wings after playoff games this postseason.And a past social media post of his grocery shopping shows that what we've seen recently is not an aberration.",
        "Hart shared a picture to his Instagram story in 2018 - when he was with the Lakers - of a shopping cart filled with pretzels, Goldfish, ramen noodles and 'Zebra Cakes,' among other snacks.The player's haul also included Totino's pizza rolls, tortilla chips and frosted mini wheat cereal.'Why I can't go shopping by myself,' he captioned the image.",
        "Tom BradyUnlike Hart, you won't catch Brady eating pizza - or caffeine, or mushrooms.The recently retired seven-time Super Bowl champ avoided those foods (specifically tomatoes, in terms of pizza) as well as peppers and eggplant during his hugely successful career due to their links with inflammation.The quarterback followed an organic, gluten-free and mostly plant-based meal plan, making sure 80 percent of his diet came from vegetables and the other 20 percent came from meat.Specifically, Brady has praised the benefits of alkaline foods over the years,  naming blueberries, avocados, kale and spinach in his book as foods that help lower his body's PH and keep him healthy.The former Patriots and Bucs passer has also said many times in the past he drinks up to three gallons of water each day.On the other hand, Brady avoids white sugar and any white flour, while he very rarely consumes alcohol.",
        "Chris PaulAnother plant-based athlete - even more so than Brady - is Phoenix Suns guard Paul, who has avoided meat and dairy since 2019.",
        "While the 12-time All-Star used to love fried chicken and processed snacks, per The Beet, Paul made the switch four years ago and was the NBA's leading assist man last season at 36.'I still don't believe I would be playing at the level I'm playing at if I didn't go plant-based,' he told the website.In an interview with GQ last year, he outlined some of his favorite foods, naming plant-based pancakes, JUST Egg (vegan) scrambles with veggies and fruit as some breakfast staples.He'll often have sauteed vegetables, rice and salad for lunch and dinner, along with protein drinks.  For dessert, cookies are his 'favorite,' he told The Beet, while the future Hall of Famer also launched a brand of plant-based snacks including 'Hot Hot Puffs' and 'Cookies n Creme Popcorn.'",
        "LeBron JamesJames is still one of the NBA's best players at 38 years old, and he's previously credited his frequent consumption of wine for maintaining his level of play.He told ESPN in 2018 that he was drinking wine 'pretty much every day' after not trying it until he turned 30.'I've heard it's good for the heart,' he said. 'Listen, I'm playing the best basketball of my life... Whatever it is, I'll take it.'James is also a backer of tequila brand Lobos 1707, and has spoken about tequila as another drink he'll have to wind down after games.",
        "'I go home and drink wine or tequila every night and if I'm at home in Los Angeles, I watch some movies with the kids or play Madden,' he told reporters last year.He's averaged just over 22 points and 11 rebounds per contest this postseason, and it's hard to argue with his methods as the Lakers have a 1-0 lead over the Warriors in the second round.",
        "Mate teaMate (pronounce ma-tay) is a mixture of near-boiling water with dried leaves of the yerba mate plant - and many soccer players swear by it for its various benefits.Perhaps most importantly, mate is said to offer the same energy boost of coffee without the caffeine come-down, with South American stars such as Lionel Messi and Luis Suarez favoring the drink.",
        "Players drink the beverage with a straw - to filter out the leaves - out of a wooden mug, and Antoine Griezmann, Sergio Aguero, Paul Pogba and more have been seen with mate in their hand. The drink even became popular in the England camp ahead of the 2018 World Cup, with Harry Kane, Dele Alli and Eric Dier being influenced by their South American teammates and then-manager Mauricio Pochettino. Mate tea contains 24 different vitamins, while it is also believed to enhance mental focus alongside the energy boost of caffeine.",
        "Furthermore, it is also packed with antioxidants, some of which combat muscle fatigue, and it is claimed to help you sleep deeply."
    ]
}