{
    "articleURL": "/wires/reuters/article-12046855/US-trade-deficit-narrows-sharply-March-exports-rise.html",
    "content": [
        "WASHINGTON, May 4 (Reuters) - The U.S. trade deficit narrowed sharply in March as exports increased, which could position trade to continue contributing to economic growth in the second quarter.",
        "The trade deficit contracted 9.1% to $64.2 billion, the Commerce Department said on Thursday. Data for February was revised to show the trade gap widening to $70.6 billion instead of $70.5 billion as previously reported.Exports increased 2.1% to $256.2 billion. Goods exports shot up 3.1% to $174.3 billion. Crude oil exports rose $2.5 billion, boosting shipments of industrial supplies and materials.There were also increases in exports of motor vehicles, parts and engines. Exports of services rose $0.1 billion to a record $81.8 billion, driven by travel and transport.Imports slipped 0.3% to $320.4 billion, with goods falling 0.5% to $260.9 billion. The decline in imports in March was likely flagging softening business investment as the lagged and cumulative effects of higher interest rates start to be felt.Capital goods imports fell $1.9 billion, pulled down by semiconductors, electric apparatus and excavating machinery. There were also decreases in imports of crude oil and organic chemicals.But consumer goods imports increased $2.4 billion, lifted by pharmaceutical preparations, other textile apparel and household goods. Imports of cellphones and other household goods decreased $1.5 billion. Imports of services increased $0.1 billion to $59.5 billion, supported by travel. Transport services fell.Adjusting for inflation, the goods trade deficit narrowed 4.4% to $99.4 billion. Real dollar exports of petroleum were the highest since the government started tracking the series in 1994.",
        "A smaller trade deficit was one of the contributors to the economy's 1.1% annualized growth rate in the first quarter. Trade has contributed to GDP growth for four straight quarters, a trend that economists expect will persist into this quarter. (Reporting by Lucia Mutikani; Editing by Paul Simao)"
    ]
}