{
    "articleURL": "/tvshowbiz/article-12043777/Succession-composer-Nicholas-Britell-reveals-series-finale-90-minutes-long-Like-movie.html",
    "content": [
        "Succession will be going out with an epic, 90-minute long series finale, according to the show's Emmy award-winning composer.",
        "Speaking with Variety, composer Nicholas Britell revealed the final episode of the series will be as long as some movies.'It’s 90 minutes,' Britell, 42, told the publication.'It’s a huge episode — like a movie.'The latest news comes as the cast, who have been receiving plaudits from fans and critics alike, navigate Emmy submissions. ",
        "It recently emerged that Kieran Culkin, who plays family member Roman Roy in the series, will be submitted for Outstanding Lead Actor in a Drama Series at the Emmy Awards this year, according to Variety. Variety has also reported that Sarah Snook, who plays Shiv Roy, will also be submitted into the Outstanding Lead Actress in a Drama Series category for the upcoming Emmys. Reps for HBO and Snook did not confirm to Variety how she would be submitted.   Culkin had previously earned two nominations for Outstanding Supporting Actor in a Drama Series in 2020, where he lost to The Morning Show's Billy Crudup, and 2022, where he lost to his co-star Matthew Mcfadyen (Tom Wambsgans).The actor will likely be going up against co-stars Jeremy Strong and Brian Cox, who were both nominated in the Lead Actor categories for Season 2 and Season 3.Strong won for Season 2 but lost to Squid Game star Lee Jung-jae for the hit Netflix series Squid Game in Season 3.  ",
        "Culkin appeared on Variety's Awards Circuit podcast, and when asked if he thinks Roman is a lead character, he certainly agreed.'If you’re asking if he’s a lead character, then I would say absolutely,' Culkin said during the podcast appearance.'I think this season was set up before episode three happened as Logan versus Shiv, Roman, Kendall,' Culkin explained. ",
        "'And then [Logan] passes, and it’s what I think the central focus of the show is — the three of them,' he added.Strong's team confirmed he will be submitted for a lead actor nomination, though it's unclear if Cox will be submitted for contention.Since Cox's Logan Roy appeared in the first three episodes of Season 4 before being killed off, he could technically submit himself for Lead Actor, Supporting Actor or even Guest Actor, if he doesn't appear in any more episodes.'Only performers appearing in less than 50% of the eligible episodes can submit in the guest performer categories,' read the Emmy rules on the matter.",
        "Culkin confirmed the decision to submit himself for the lead actor categories is simply due to how the show has evolved.'It’s just that’s what the show is. If I’m supporting, that would mean Kendall and Shiv are also. And to me, that doesn’t feel like that’s the show,' Culkin admitted. ",
        "'The show has always felt like an ensemble, but the center of gravity is this man, Logan. So it’s always sort of silly to think of these things — who’s lead, who’s supporting, but it always felt like he’s lead, and we’re all dancing around him,' Culkin added.It was announced shortly before the season debuted in March that Season 4 would be the final season of Succession.",
        "Succession creator Jesse Armstrong first confirmed that Season 4 will be the end of the show in a wide-ranging interview with The New Yorker, where he was asked why he decided to confirm the final season before it debuted.'One, we could have said it as soon as I sort of decided, almost when we were writing it, which I think would be weird and perverse,' Armstrong began.'We could have said it at the end of the season. I quite like that idea, creatively, because then the audience is just able to enjoy everything as it comes, without trying to figure things out, or perceiving things in a certain way once they know it’s the final season,' he added.'But, also, the countervailing thought is that we don’t hide the ball very much on the show. I feel a responsibility to the viewership, and I personally wouldn’t like the feeling of, “Oh, that’s it, guys. That was the end.” I wouldn’t like that in a show. I think I would like to know it is coming to an end,' he clarified.",
        "He added, 'And, also, there’s a bunch of prosaic things, like it might be weird for me and the cast as we do interviews. It’s pretty definitively the end, so then it just might be uncomfortable having to sort of dissemble like a politician for ages about it. Hopefully, the show is against bulls**t, and I wouldn’t like to be bulls****ing anyone when I was talking about it.'"
    ]
}