{
    "articleURL": "/tvshowbiz/article-12045059/Martha-Stewart-Mariska-Hargitay-glam-socialite-hat-luncheon-NYCs-Central-Park.html",
    "content": [
        "A month after receiving an Easter visit from a house-hunting Pete Davidson, Martha Stewart vamped it up in head-to-toe black attire at the Central Park Conservancy's 41st Annual Frederick Law Olmsted Awards Luncheon in Manhattan on Wednesday.",
        "The 10-time Daytime Emmy-winning lifestyle guru easily defied her 81 years in a Carolina Herrera by Wes Gordon coat, Prada peep-toe platforms, and what she described as an 'old fedora.'Make-up artist Nicole Daisy Toye made sure Martha was ready for her close-up at the socialite-filled 'Hat Lunch' held inside Central Park's Conservatory Garden.At one point, Stewart (born Kostyra) posed while holding a bottle of Whispering Angel Rosé alongside her pink-clad publicist gal pal, Susan Magrino.Last Friday, the Martha Cooks producer-host discussed being regarded as a 'bona fide sex symbol' telling InStyle: 'It's a good example for others, actually. I'm a teacher. I'm trying to teach others that you can look great. There's no reason to slump around.'",
        "Martha maintains her youthful appeal by eating all-organic food, taking private Pilates classes three times a week, as well as enlisting a masseuse and chiropractor.Stewart will next compete for three trophies - daytime program host, culinary series, and instructional/how-to program - at the 50th Annual Daytime Emmy Awards, which air June 16 on CBS/Paramount+.It was Emmy winner Mariska Hargitay's first time attending the 'Hat Lunch' so she had to borrow a large hat from a friend to go with her chambray jumpsuit and tagged along with Go Ask Ali podcaster Ali Wentworth.",
        "'I don't have any hats like this. I promise next year I will come and represent,' the 58-year-old daughter of Jayne Mansfield vowed to Page Six on Wednesday.'Central Park is what gave me freedom and space when I moved to New York and I was overwhelmed by the concrete jungle and the weather and the darkness. I came in here and got peace and got rejuvenated. It's a place of so many memories. It's a sanctuary.'On Tuesday, Mariska 'got a clean bill of health' from the doctors of Hospital for Special Surgery after recovering from a trimalleolar fracture aka breaking her ankle in three places.Hargitay currently executive produces and stars as Captain Olivia Benson in the 24th season of Law &amp; Order: Special Victims Unit, which airs Thursdays on NBC.Dick Wolf created the Law &amp; Order spin-off, which made history as the longest-running US prime-time drama in history.",
        "Speaking of which, Miss Beverly Hills 1982 will also guest star as Olivia in the May 11th episode of NBC's Law &amp; Order: Organized Crime starring Christopher Meloni as her former partner Detective Elliot Stabler.The Central Park Women's Committee - originally founded in 1983 - wound up raising $4.3M in funds for the management and maintenance of Central Park.",
        "Television Hall of Famer Katie Couric wore a black floral dress with a matching hat as she checked out 'some of the awesome chapeaus' at the posh benefit.But the 66-year-old journalist - whose date was 'good friend' Pat Shifke - wasn't above stealing the bloom-filled centerpiece from her table.American Ballet Theatre's principal dancer Misty Copeland looked chic in a white floral frock, pearl-style bracelet, and black fascinator.Project Runway judge and ELLE editor-in-chief Nina Garcia looked fabulous in a b&amp;w-dotted pleated dress, featuring large sleeves, with a matching fedora. Also attending the 41st Annual Frederick Law Olmsted Awards was former Mayor Michael Bloomberg. "
    ]
}