{
    "articleURL": "/tvshowbiz/article-12054641/Nadia-Sawalhas-boozy-Coronation-party-Loose-Women-star-enjoys-BBQ-ice-cream-sundaes.html",
    "content": [
        "Nadia Sawalha joined millions around the country as she celebrated King Charles and Queen Camilla's Coronation on Saturday.",
        "The Loose Women star, 58, defied the rain and went full out for the festivities with an outdoor BBQ joined by elder sister Dina, 60.Taking to her Instagram, the former actress offered a glimpse of her fun-filled day as she shared the recipes for her Curly Cooks Of Croydon podcast.The sisters donned matching Union Jack bows and tucked into lamb kebabs, vegan burgers as well wine to drink.Dina appeared at ease as she rustled up the delicious looking dishes and despite the terrible weather they enjoyed their food on the patio.",
        "They partied alongside Nadia's husband Mark Adderley who provided the dessert in the form of huge ice cream sundaes. Nadia previously admitted she clashed with sister Dina just before her wedding, resulting in the pair not speaking 'for a long while after that'. These days, Nadia and teacher Dina are close again, jetting off on holiday together and even living next door to one another in south east London.But Nadia is never seen in pictures with middle sister and Ab Fab star Julia, with Dina seemingly caught in the middle of their long-running feud.The Loose Women panelist said of her fallouts with her sisters: 'We've had some rocky times, but the culprit has always been men.'Discussing her issues with Dina, Nadia told Woman &amp; Home magazine: 'I was begging [Dina] not to marry her partner and we didn't speak for a long while after that.",
        "'I remember sending her a text saying, 'I'm completely heartbroken' – I was.'However, the sisters made amends once Dina separated from her husband, and Nadia was happy to support her.",
        "Dina said: 'As her sister, I see a very different side of her; she's always so loud and in your face on Loose Women – sometimes I think: 'Oh, please don't say that!' – but I get to spend time with the real Nadia.'She added: 'That's the Nadia I love.'VIP guests queued for a mile from 6am to get one of the prime 2,300 seats inside Westminster Abbey on Saturday. The Abbey was full at just before 9am. Some 100 heads of state are in London, with representatives from 203 countries attending to watch Charles be crowned in a Christian ceremony that dates back for 1,000 years on a day dripping with glorious displays of pageantry. Stunning flowers in reds, burgundies and yellow golds covered the top of the ornate golden High Altar.",
        "A smiling Dean of Westminster in his vivid red clerical robe was seen hurriedly carrying the holy oil for the anointing down the length of the abbey from the altar through the quire, clutching the precious ornate silver vessel in both hands.It will also shined a spotlight on Britain’s place on the world stage in the UK's biggest ceremonial military operation since the state funeral of Sir Winston Churchill in 1965 with 7,000 servicemen and women marching with the King and Queen.",
        "The Coronation saw 7,000 servicemen and women accompanying Their Majesties, making it the country’s biggest ceremonial event since 1953. Indeed, the Coronation procession back from the Abbey after the ceremony is so large that when the King and Queen arrived at Buckingham Palace, the rear will only have reached Downing Street, a mile away.   ",
        "More than 100million people around the world watched the historic first coronation of a British monarch in 70 years - with an estimated 2million people on the streets of London to watch history unfold.King Charles, 74, automatically took the throne following the death of his mother, Queen Elizabeth II, in September last year.A rich royal blue carpet - chosen to highlight the regal red, gold and purple robes of the king and queen - adorned the dais in the coronation theatre. Prince Harry flew in from Los Angeles for his 24-hour trip. It emerged on Friday night he has been relegated to the third row in the Abbey with other non-working royals."
    ]
}