{
    "articleURL": "/wires/pa/article-12050747/Deadly-6-2-magnitude-earthquake-strikes-central-Japan.html",
    "content": [
        "A strong, shallow earthquake has hit central Japan, killing at least one person and injuring 13 others.",
        "No tsunami warning was issued following the quake – which had a magnitude of 6.2 according to the US Geological Survey – in Ishikawa prefecture on the west coast of Japan’s main island of Honshu.The Japan Meteorological Agency measured the quake at 6.5 and said it was centred at a depth of about 7.5 miles.One person was reported dead and at least 13 were injured in Suzu city at the northern tip of Noto Peninsula in Ishikawa prefecture, a city official said.He said six homes were damaged and rain could trigger mudslides, causing further damage.He did not say how the person died, but the Fire and Disaster Management Agency reported that a person was found without vital signs after falling from a ladder.It said another person was injured when a cabinet fell on them, and two people were rescued from damaged buildings in the city.A video broadcast by NHK public television showed a section of a hill that had crumbled and fallen on a house.It also broadcast a video taken by a reporter who was visiting his family in Ishikawa prefecture that showed a room shaking for nearly half a minute, with picture frames rattling on the walls. Japan is celebrating several national holidays this week.",
        "Government spokesperson Hirokazu Matsuno said there were reports of other damaged buildings but details are still being confirmed. There was no reported damage at two nuclear power plants in the area, he said.The East Japan Railway Co said bullet trains connecting Tokyo and Kanazawa in Ishikawa prefecture were temporarily halted for safety checks but resumed normal operations, with some delays.Japan is one of the world’s most earthquake-prone nations. A massive 2011 quake in the country’s north-east caused a devastating tsunami and nuclear plant meltdown."
    ]
}