{
    "articleURL": "/news/article-12054159/Heres-Penny-Mordaunt-carrying-sword-King-Charles-coronation.html",
    "content": [
        "CORONATION LIVEBLOG: Click here to follow live updates throughout today There were many familiar faces who played a part in King Charles III's Coronation ceremony, including Tory MP Penny Mordaunt. ",
        "The Leader of the House of Commons carried a sword at the historic event as Lord President of the Privy Council, a role she has undertaken since September last year.Dressed in a teal blue dress with gold detail and a matching cape, Ms Mordaunt carried the 17th-century Sword of State into the Abbey before presenting it to the King in his throne. It was the first time in history that the Jewelled Sword of Offering has been carried and presented to the monarch by a woman. The intricately detailed sword was made for George IV's coronation in 1821, It is encrusted with diamonds, rubies and emeralds and is decorated with jewelled roses, thistles and shamrocks. ",
        "The sword was blessed by the Archbishop of Canterbury and then presented to the King by Ms Mordaunt, who wore a £2,000 Roni dress by atelier Safiyaa.It had been carried into the Westminster Abbey by Petty Officer Amy Taylor, who became the first woman to undertake the duty of carrying the sword into the Abbey after being selected to represent service men and women as a tribute to the King's military career.The sword, which symbolises royal power, was placed in the King's right hand, then clipped onto his girdle and eventually unclipped.The King then stepped forward and offered the sword to the Dean, who placed it on the altar.",
        "The sword was then 'redeemed' by Ms Mordaunt, who placed the redemption money on an alms dish, held by the Dean, before drawing the sword and carrying it in its naked form, without its scabbard.Notable figures including a number of fellow MPs praised her, with Labour MP Emily Thornberry tweeting: 'Got to say it, @PennyMordaunt looks damn fine! The sword bearer steals the show.' Author and columnist Caitlin Moran also commented on the social media buzz around Ms Mordaunt's role, saying: 'Penny Mordaunt's sword is the 'Pippa Middleton's Bum' of the Coronation.' Labour MP Chris Bryant quipped in a tweet: 'The Penny is mightier than the sword.' ",
        "Speaking to The Times' Red Box Politics podcast ahead of the ceremony, she also disclosed she had been 'doing some press-ups' in preparation for her sword-carrying role. Ms Mordaunt, who is also the Leader of the House of Commons, explained: 'The Lord President of the Council is really the chairman of the King's Privy Council. 'It used to be the executive for the King, and it still does a lot of business and it's an important part of our constitution and the authority that we have in Parliament. 'On the day I am representing the King's authority, and I am going to be doing a number of things.' ",
        "She added that she had been practising in rehearsals with weighted replicas and that her experience in the Navy had helped prepare her for standing for long periods of time without fainting. Asked about being around the King with a 'big pointy sword', Ms Mordaunt admitted she did feel 'a terrible weight of responsibility'. Discussing how she feels the ceremony fits into modern life, Ms Mordaunt added: 'I think this is really important to the country. I think the monarchy survives and persists because it adapts and it changes and it's always relevant. 'And I think that in this coronation, yes, it is going to be royal and marvellous and mystical and spiritual and everything that you would expect it to be, but it will be modern as well. 'And there's always great chat before an event like this, has it gone too far one way? Has it gone too far the other way? And we always get it absolutely spot on. ",
        "'And I think that it's an important moment for the country. I think the country is proud of the monarchy and the royal family and the service they play. 'They provide stability, we saw that most profoundly last year. And they provide continuity and I think as far as how we're known by the rest of the world, they're a huge part of our story. ",
        "'I just hope everyone has an amazing weekend, I know that is what the King would wish.' Back in September, she officially announced the Queen's death and proclaimed Charles as Britain's new King in front of the Accession Council. She was applauded online for doing an 'outstanding job' during Saturday morning's 'moving and sombre' ceremony.Twitter users pointed out that Ms Mordaunt, who was appointed to her new role by Prime Minister Liz Truss, had little time to prepare for the Accession Proclamation but still managed to be 'very polished' and spoke with 'authority', according to spectators."
    ]
}