{
    "articleURL": "/news/article-12041789/Bearded-man-70-scoops-5-555-entering-LADIES-poker-tournament.html",
    "content": [
        "David Hughes entered the $250 buy-in for the Ladies No-limit Hold’em in FloridaA heated debate erupted over the bearded man's involvement in the tournamentA bearded man has won a women's poker tournament in Florida, sparking outrage from fellow competitors.",
        "David Hughes, from Deltona, Florida, entered the $250 buy-in see-off his competitors at the 'Ladies No-limit Hold’em' event at the Seminole Hard Rock Hotel and Casino.Hughes, who was photographed and filmed taking part in the ladies' tournament, took home a whopping $5,555 after seeing-off 82 other entrants.A heated debate about the bearded man's involvement in the tournament broke out online as he was filmed sitting at the poker table.The presence of the man, said to be aged 70, also appeared to rattle his female competitors with many taking to social media to voice their displeasure about his decision to enter.",
        "Hughes was said to have been able to compete in the Texas Hold'em tournament for women due to anti-discrimination laws in Florida. Despite evidently being a bearded man, state legislation prevents him from being excluded from the woman's event.",
        "Other states such as Nevada also do not restrict men from entering the tournaments. However, some competitions offer a 90 percent discount for women so that men are deterred from trying to enter. Hughes' fellow competitors appeared outraged that he was able to enter and win.Professional player Ebony Kenney voiced her outrage and criticized Hughes for entering.'Playing the World Poker Tour ladies event today, and Dave here is the only man.",
        "'While we appreciate the dead money, I really wish men would get what these events stand for.'Other pros also weighed in to share there disapproval. Charlie Carrel said: 'It pokes fun at the idea that anybody can identify as a woman and be allowed to enter women’s spaces.'DailyMail.com has approached Seminole Hard Rock Hotel and Casino, Hollywood, Florida, for comment.",
        "But this is not the first time that a man has entered a women's poker tournament, nor that a man has won one of the competitions.Former World Series of Poker (WSOP) champion Abraham Korotki entered a $300 buy-in competition at the Borgata Poker Open in Atlantic City in 2009.Participants in the poker tournament were said to have been furious with Korotki at the time, growing increasingly irate with him as he advanced through each round. Korotki was one of two people who remained standing at the end, facing competitor Nicole Rowe from New York. But the man took home the prize pot of $20,982 after defeating the women challengers."
    ]
}