{
    "articleURL": "/sport/football/article-12045731/How-watch-Brighton-vs-Man-United-Premier-League-tonight.html",
    "content": [
        "Brighton host Erik ten Hag's Manchester United in the Premier League tonight The Seagulls come into the game off the back of a 6-0 win against Wolves Follow Mail Sport's LIVE blog for all the latest updated from Manchester United Brighton host Erik ten Hag's Manchester United in the Premier League later this evening.",
        "Roberto De Zerbi's side come into the game off the back of a 6-0 win against Wolverhampton Wanderers - with Deniz Undav, Pascal Gross and Danny Welbeck all scoring for the Seagulls. A win for the hosts this evening will take them back into the Europa League spots and only four points behind Liverpool with two games in hand. As for the Red Devils, they defeated Aston Villa in their last game - with Bruno Fernandes scoring the only goal of the game. Mail Sport breaks down everything you need to know ahead of Brighton's meeting with Manchester United including how to watch and team news. ",
        "When is Brighton vs Manchester United?Brighton's clash with Manchester United will take place this evening, with the game kicking off at 8pm.The showdown between the two teams will take place at the Amex Stadium, where the hosts have won four of their last five games in all competitions.United fans will be slightly confident heading into the game. The Red Devils have won three of the last five meetings against the Seagulls. The two sides last met back in April, where the Red Devils defeated Brighton on penalties in the FA Cup semi-final.Kaoru Mitoma is Brighton's top scorer this season. The winger has scored 10 goals in all competitions. ",
        "Marcus Rashford is United's top scorer this season, with 29 goals in all competitions. The Englishman has scored one goal in his last five games for the club. ",
        "How to watchThis evening's clash between Brighton and United will be shown live on Sky Sports Main Event and Sky Sports Premier League, with coverage getting underway at 7pm.The game between the two teams will also be streamed on the Sky Go app.Highlights will be uploaded to the official Sky Sports YouTube channel after the game.Mail Sport will also be providing live coverage of Brighton vs United, so you can keep up-to-date with all the latest developments here.",
        "Team newsA number of key players are set to return for Brighton ahead of the clash with the Red Devils. Moises Caicedo, Alexis Mac Allister and Karou Mitoma were all named on the bench against Wolves at the weekend but are expected to return to the starting eleven.Joel Veltman limped off in their win at Wolves and could miss this evening's game. Tariq Lamptey, Jakub Moder, Evan Ferguson, Jeremy Sarmiento and Adam Lallana are also set to miss the match.Danny Welbeck is likely to lead the line against his old club with Mitoma, Solly March and Julio Enciso operating behind the forward.As for United, the Red Devils are will be without Raphael Varane and Scott McTominay. However, Ten Hag recently revealed that Varane is in line to feature again before the end of the season.",
        "Alejandro Garnacho, Donny van de Beek and Lisandro Martinez remain long-term absentees.Rashford is set to lead the line, with Antony and Anthony Martial on either side of the forward. Predicted Brighton XI (4-2-3-1): Steele; Gross, Colwill, Dunk, Estupinan; Caicedo, Mac Allister; March, Enciso, Mitoma; Welbeck Predicted Manchester United XI (4-3-3): De Gea; Wan-Bissaka, Lindelof, Shaw, Dalot; Casemiro, Eriksen, Fernandes; Antony, Rashford, Martial ",
        "What's been said?De Zerbi is a doubt to be on the touchline when his side face United this evening. The Italian cancelled his press conference on Wednesday as he is unwell and remains at home recovering from his illness.After the win against Wolves in their last game, De Zerbi labelled the win as the best in his coaching career.'I think it's the best performance in my career as a coach,' said the Italian former Sassuolo and Shakhtar Donetsk manager.'We scored six goals but if we speak about the level of the play, the style of the play, the quality of the play, I think we are playing a very high level of football.'This victory started in Wembley, not today, because today we showed pride, we played well.",
        "'We suffered a lot after Wembley because we deserved to win, we suffered a lot in Nottingham because we played the Nottingham game with the heads still in Wembley and today you watched the reaction.",
        "'The players are not like the players on the PlayStation or robots. They gave soul, heart and in those five days they suffered a lot.'As for United, Ten Hag was asked to give his thoughts on the clash with Brighton. The Dutchman revealed that they will be out for revenge after suffering Wembley heartache against the Red Devils last month.'It's a normal reaction, I think everyone involved in top sport, if you get beaten you want to have revenge and that is normal they have a huge motivation to beat us but we have to match that and do more, show more hunger than them to win this game and willingness is the word for tomorrow,' Ten Hag said at his pre-match press conference. OddsBrighton to win - 19/20Manchester United to win - 12/5Draw - 27/10Brighton to win each half and Brighton to have the most corners in each half - 18/1All odds via Paddy Power and correct at the time of publication.  ",
        "Prediction Brighton will be looking to build on their last result when they face United this evening.With the likes of Caicedo, Mac Allister and Mitoma all in line to return to the side, it could be a long night at the office for the Red Devils.",
        "As for Ten Hag's men, they will be looking to go back into third place this evening with a win.If the likes of Rashford, Martial and Antony are all firing from the off, it should be enough to get the job done.Prediction: 2-1 Brighton "
    ]
}