{
    "articleURL": "/tvshowbiz/article-12048961/Brooklyn-Beckham-discuss-food-SLAMMED-disastrous-cooking-tutorials.html",
    "content": [
        "Brooklyn Beckham has discussed his passion for cooking after receiving backlash for his 'disastrous' kitchen tutorials.",
        "In a Michelin Guide video posted to his Instagram, the wannabe 'chef', 24, said being in the kitchen helped him 'take his mind off things'.He also revealed his and wife Nicola Peltz's favourite food while discussing his LA stomping ground's 'food scene'.The son of David and Victoria Beckham began the video by discussing his early memories of cuisine with his famous parents.He said: 'I grew up in London I always used to go to the pub, and we used to go after my dad played football.",
        "'I didn't drink, because I was too young, but I used to have the pie and mash and fish and chips in the newspaper with vinegar.'However his tastes have matured over the years, saying: 'My and my wife, we are obsessed, our favourite food is Japanese, they way the Japanese treat food, they are so careful and so precise'.Brooklyn then spoke passionately about the kitchen, telling his followers: 'I love cooking because it's one of the few things that takes my mind off anything that's happening'. He went on to say: 'One of the many things I like about chefs is they are so artistic, they are so hard working, and it's always every day, every minute of every hour trying to master their craft. ",
        "Last week, Brooklyn left fans in stitches as he filmed yet another cooking video with a huge hole in his tracksuit bottoms after coming under fire for his tutorials.He took to Instagram to share a reel which showed step-by-step how to make a grilled cheese sandwich.Unimpressed fans were quick to roast the star over his 'boring' and 'unnecessary' tutorial while others couldn't help but notice his fashion faux pas in the video.Taking to the comments section, they were quick to share their confusion over why he had filmed with a hole in his trousers.",
        "One person wrote: 'There seems to be something wrong with the pants,' while another asked: 'Is there like a hole in your pants, or am I tripping?'A third said: 'The hole is distracting me,' and a fourth added: 'Love the easy access hole on your sweatpants.'",
        "1. Brooklyn was slated by fans for his 'raw' meat while whipping up a Sunday dinner.2. His salad and plain spaghetti left much to be desired in a silent cooking tutorial3. He hired a film crew for $100,000 to film him making a sandwich4. He required assistance with frying a hash brown5. During a cooking segment on The Today Show, viewers poked fun at his humble breakfast sandwich ",
        "In the tutorial, he cooked a toastie in a frying pan to make sure it was crispy, while adding mushroom and ham inside.The video received mix reviews from fans, with one joking it was a 'culinary masterpiece' with several laughing emojis. Another added: 'Blowtorching pieces of toast. So unnecessary,' while a third carped: 'God this is utterly cringe and boring.' A fourth wrote: 'Wow. You blowtorched the bread. So unnecessary.' However others praised the young cook for his ability, with one commenting: 'I need to do this for dinner this week. Looks amazing.' Brooklyn has largely been cooking for Instagram videos over the past few years as he shares basic tips with his followers on meals such as burgers and sandwiches.But he admitted to Bustle in a recent interview: 'I'm not a professional chef – at all.''I've never said that. I never would say that. Obviously, my dad [retired footballer David Beckham] knew what he was doing at a very young age. I've only been doing cooking for not even three years.'Brooklyn's latest post came after he was branded 'out of touch' by furious fans for using lavish ingredient truffle to whip up a tagliatelle in his latest cookery tutorial.In the video, Brooklyn also appeared to take inspiration from his father with his top, as he sported a red England number seven shirt, which David himself inherited.",
        "In the caption, he gushed over his love of truffle, which he used generously to make the dish, writing: 'In my kitchen no such thing as too much truffle.'But he was blasted by social media users for using the lavish ingredient, who claimed that it was 'out of touch' to do so amid a cost-of-living crisis.",
        "Commenting on his post, one person said: 'I wish I could afford the idea of \"no such thing as too much truffle\".'Another fumed: 'We're in a Cost of living crisis Brooklyn.'According to 2021 estimates , winter black truffle has an average price of $20.49 per ounce, while burgundy black truffle costs $24.93 per ounce and summer black truffle is worth $22.57 per ounce. It is not known what type of truffle Brooklyn used.A third wrote: 'He needs to get with his audience. Most people can't afford truffles. I have worked as a chef, very basic what he is doing. Love to see him work in a restaurant kitchen and see how he would manage.'While a fourth added: 'These people live in a different world most people can barely afford to eat at the moment and this kid is waffling on about truffle.'In the cookery clip, Brooklyn was seen making a sauce from scratch, using ingredients including flour, grated garlic, oil and cheese.",
        "He then generously added truffle slices to the creamy sauce, which he heated up in a saucepan while boiling his tagliatelle pasta separately."
    ]
}