{
    "articleURL": "/tvshowbiz/article-12044303/Molly-Sims-dazzles-shows-stunning-frame-sparkling-purple-sequin-dress-NYC.html",
    "content": [
        "Molly Sims put on a show-stopping appearance in a dazzling dress as she stepped out in New York City on Wednesday. ",
        "The Las Vegas alum, 49, who recently showed off her toned physique in a floral swimsuit on a getaway to Cabo San Lucas, flashed a cheerful smile as she made a grand exit from The Greenwich Hotel in the heart of Manhattan. The mother of three slipped into a sleeveless, dark purple sequin dress that fell down towards her ankles, with the unique material sparkling with every movement she made.Her ensemble was held up with thin straps that wrapped around her shoulders, and contained a V-neck cut on the front for a sultry flare. She slipped into a pair of open-toed, gold metallic heels that coincided with the dress as she headed to a launch party in celebration of her brand, YSE Beauty.  ",
        "The model, who has previously collaborated with brands such as Chanel, Michael Kors, and also Jimmy Choo, carried a small, light blue clutch bag in her left hand to hold a few items she needed during the outing. Her long, blonde locks were parted in the middle, and styled back into a low, chic ponytail to allow her hair to fall down behind her. Molly accessorized her look by adding a pair of small, glittering earrings for a flashy touch.A warm blush was added to her cheekbones for a radiant glow, while a nude-colored, satin tint was worn on her lips for a finishing touch. ",
        "The beauty, who will ring in her 50th birthday later this month on May 25, was seen excitedly leaving the hotel and entering a sleek vehicle awaiting to take her to the next destination. In a clip uploaded onto her Instagram stories on Wednesday, Molly could be seen getting her hair and makeup done and stated towards the camera, 'Here we go, here we go, launch party!' She then gave a quick shout out to hair stylist, Matthew Monzon, and penned in a caption added towards the bottom of the reel, '45 minutes for full glam?! No problem.' ",
        "Molly officially launched her brand, YSE Beauty, late last month on April 25, which offers a variety of skincare products to consumers. Some of the products include exfoliating pads ($72), Vitamin-C serum ($85), moisturizer ($65), and also a Gel-oil cleanser ($45). In a message from the actress on the brand's official website, Sims explained that creating the items took three years and, 'hundreds of formulations.' The star also explained she, 'finally perfected my holy grail skincare routine – a routine that delivers genuine, bare-faced beauty.' In regards to the inspiration behind the name, the actress revealed that it was in tribute to her mother. 'I called the brand YSE (wise) because a wise woman (my mom, Dorothy) once said: beautiful skin is when you feel your best. So put down the concealer and start living-because life is too short to miss out on the real, everyday magic.' ",
        "She also made an appearance on Today earlier last week to further discuss the launch of the brand and expressed that, 'It's all about living your life being happy, making those moments, and having great skin.' 'I got married a little late in life, met my prince, started having kids in 2012, and my hyper-pigmentation, sun spots...I did everything really harsh,' adding that she did various skin treatments, such as lasers and peels. ",
        "'I want my village, I want my girls, I want my community to feel good and look good,' she added during the interview with Hoda &amp; Jenna. Aside from working hard with her latest beauty entrepreneurship, the podcast host also puts her main focus into raising her three children: sons Brooks, 10, and Grey, seven, as well as daughter, Scarlett, eight, whom she shares with husband, Scott Stuber. The Wrong Missy actress tied the knot with the Netflix executive in 2011 during a romantic Napa vineyard wedding. While talking on Today, she also opened up about being active in her children's lives. 'People DM me or text me and they're like, \"Oh, are you tired?\" And I go, \"Yeah, but, you know, in parenting, the days are long but the years are short.\" And you got to lean in.'  "
    ]
}