{
    "articleURL": "/wires/reuters/article-12055485/Horse-racing-Mage-wins-Kentucky-Derby.html",
    "content": [
        "May 6 (Reuters) - Mage won the 149th running of the Kentucky Derby at Churchill Downs in Louisville, Kentucky, on Saturday to capture the first leg of U.S. thoroughbred racing's Triple Crown.",
        "Mage, who finished second in the Florida Derby last month, finished the 1-1/4-mile race in two minutes and 1.57 seconds.The chestnut colt, who went off at 15-1 odds, sped up on the last stretch to take the lead and cross the finish line ahead of Two Phil's, who was second, and Angel of Empire, one of the favorites, who finished in third place.The victory was the first Kentucky Derby win for Venezuelan trainer Gustavo Delgado and Venezuelan Hall of Fame jockey Javier Castellano, who won the Run for the Roses after 16 attempts.\"I never give up, I always try hard, took a lot to get here I finally get it,\" said Castellano. \"I'm blessed. Thank you for the opportunity to run this horse, that has a lot of heart.\"An emotional Delgado added: \"When I arrived to the U.S. my first dream was go to Kentucky. I was sure that the horse was very good.\"This year's race was marked by the number of horses scratched, including favorite Forte who became the fifth horse to be removed early on Saturday, leaving the field at 18 horses, the smallest field since 2020.Saturday's Derby was also the culmination of a week stained by the death of seven horses, which led to the suspension of trainer Saffie Joseph Jr. Two horses, Chloe's Dream and Freezing Point, had to be euthanized hours before Saturday's race.",
        "\"It is with the utmost sadness that we report these tragic fatal injuries. Churchill Downs is unwavering in our commitment to the health and well-being of equine safety,\" Churchill Downs said.Animal rights group PETA said that, given the number of deaths, they had urged Churchill Downs to close the track in order to implement stronger safety protocols.\"Churchill Downs is a killing field,\" PETA's senior Vice President Kathy Guillermoaddedin a separate statement.The Preakness Stakes, second leg of the Triple Crown, will be run on May 20 at Pimlico Race Course in Baltimore, followed by the Belmont Stakes three weeks later on June 10. (Reporting by Janina Nuno Rios in Mexico City, additional reporting by Aadi Nair; Editing by Daniel Wallis, Franklin Paul and Kim Coghill)"
    ]
}