{
    "articleURL": "/tvshowbiz/article-12045289/Kylie-Jenners-ex-BFF-Jordyn-Woods-shows-cool-style-new-Instagram-snaps.html",
    "content": [
        "Kylie Jenner's ex-BFF, Jordyn Woods, took to her Instagram Stories to show off her outfit of the day.",
        "The 25-year-old socialite put her cool girl style on display wearing an asymmetrical white top and cargo jeans.Woods - who recently stoked new feud rumors with the lip kit mogul, 25 - paired the ensemble with a cozy beige cardigan and black sneakers with white laces.She accessorized with a multi-color Fendi purse and oversized sunglasses shielding her eyes. The star - who's currently dating basketball player Karl-Anthony Towns, 27 - wore her caramel tresses parted in the middle and cascading down in waves.",
        "A few days earlier the beauty sizzled in another Instagram snap, wearing a form-fitting dress as she posed by her car Last month fans of Woods believed she was shading Kylie, and theorized that the model had taken Selena Gomez's side amid her alleged feud with her former pal.She raised eyebrows as she showed support for Selena's makeup brand, Rare Beauty, following reports of the actress and reality star's online spat.Just days after Jenner denied mocking Gomez's eyebrows, Woods gushed over a lip liner from the Only Murders in the Building's cosmetics company.In an Instagram Story the bombshell applied a creamy mauve lip pencil to her pout and stated that she 'loves' the product.The five-foot-nine beauty went on to reveal to fans that if they're 'wondering the shade color' it is called kind words.",
        "Some of Woods' followers speculated that she was shading Jenner, who ended their friendship after her sister Khloe Kardashian's then-boyfriend Tristan Thompson was caught kissing Jordyn in 2019.The Life of Kylie alum's post comes after Jenner reportedly lost more than half a million followers, according to SocialBlade.com, after a TikTok user accused Jenner of making fun of the former Disney Channel star's eyebrows.",
        "Still, both women have publicly responded to the allegations, saying there was no feud between them. Kylie commented, 'This is reaching. No shade towards Selena ever and I didn’t see her eyebrow posts! u guys are making something out of nothing. This is silly.'Selena chimed in with, 'Agreed @kyliejenner. It’s all unnecessary. I’m a fan of Kylie!' Jordyn and Kylie were inseparable until their friendship suffered following the kissing scandal with Thompson.In the aftermath, the social media influencer appeared on an episode of Jada Pinkett Smith's Facebook Watch series, Red Table Talk, and addressed the scandal, denying that 'anything intimate' happened with Thompson, other than resting her legs on his.However, she admitted that Thompson kissed her as she was leaving the party: '[There was] no passion, no nothing. He just kissed me … it was a kiss on the lips. No tongue … no making out.'",
        "During her interview, Jordyn also famously responded to the allegations that she was trying to split up Tristan and Khloe, saying 'I don't need your situation' which many took as a hint at Tristan's unfaithful ways.Khloe publicly called Jordyn out on Twitter after the model shared her side of the story and said she wasn't the reason that Khloe and Tristan broke up.",
        "'Why are you lying @jordynwoods??' Khloe tweeted at the time. 'If you're going to try and save yourself by going public, INSTEAD OF CALLING ME PRIVATELY TO APOLOGIZE FIRST, at least be HONEST about your story. BTW, You ARE the reason my family broke up!' Khloe - who first reconciled with Tristan after the incident - split up with the athlete last year, after Thompson admitted to fathering a son with fitness model Maralee Nichols while still in a relationship with Khloe. At the time the Kardashians star and Thompson were also expecting a son via surrogate.Meanwhile Jordyn has been going strong with her NBA boyfriend Karl-Anthony Towns. The pair have been dating since May 2020."
    ]
}