{
    "articleURL": "/news/article-12056123/SNP-boasts-force-Keir-Starmer-hold-IndyRef-No10.html",
    "content": [
        "Wes Streeting said he was 'not entertaining' questions over a hung Parliament Keir Starmer's allies dodged on whether Labour would do a deal to prop him up in No10 as new analysis today showed him falling short of a Commons majority despite big local election gains.",
        "Closely-watched projections have found that Labour would have 298 MPs if Thursday's results were replicated at a general election.That would be up 95 on the standings from 2019 - but still around 30 short of an outright majority. Meanwhile, the figures compiled by academics Colin Rallings and Michael Thrasher for the Sunday Times concluded that the Tories are on track to plunge 127 seats to just 238.The SNP has gleefully seized on the numbers to claim it will be able to force Labour to grant a new Scots independence referendum.  The estimates are based on the 4.2million ballots cast for councillors, and come with the caveat that behaviour is often different in Westminster polls.",
        "A Lib-Lab deal saw the Tories battered in Bracknell Forest last week.The council was taken by Labour after being under Conservative control for more than 25 years.Rishi Sunak's party lost an eye-watering 27 seats in the contest.Some 18 went to Labour, seven to the Lib Dems and two to the Greens.The scale of the disaster was seemingly increased by a local agreement between Lib Dems and Labour that they would not stand in the same wards.",
        "Asked on Sky News' Ridge on Sunday programme whether Labour would be prepared to deal with the Lib Dems or SNP, shadow health secretary Wes Streeting said he was 'not even entertaining that prospect'. ",
        "'I don't think that's a scenario we're going to be in after the next general election.'  Mr Streeting conceded that Labour has 'more work to do to earn people's trust and support'.But he insisted he is 'confident Labour can win a majority'. Labour gained 635 seats and took control of another 22 local authorities in the elections on Thursday, while the Tories suffered heavy losses.With almost all authorities having declared, Mr Sunak's party shed 48 local authorities and 960 councillors, near the 1,000 worst-case prediction senior Tories had floated to manage expectations ahead of the poll.The Liberal Democrats had what leader Sir Ed Davey hailed as the 'best result in decades', taking 12 local authorities and 416 seats.But while Labour were jubilant, the national vote share will give Sir Keir pause for thought and Rishi Sunak some grounds for hope.The Tories were on 29 per cent, the worst in a significant ballot event since 2013. Labour was up five points on 2019 on 36 per cent, but that was only a marginal improvement on a year ago. SNP Westminster Deputy Leader Mhairi Black said: 'At the next election, voting SNP is the best way to lock the Tories out of Scotland. 'A strong team of SNP MPs would put Scotland in the driving seat of a minority UK government - and ensure the power to determine Scotland's future is transferred to Edinburgh. ",
        "'Voting SNP would put the choice over Scotland's future in Scotland's hands, ensure the cost of living crisis becomes the main priority of Westminster, and rebuild our relations with Europe.' "
    ]
}