{
    "articleURL": "/wires/ap/article-12059127/China-tells-US-reflect-deeply-downturn-ties.html",
    "content": [
        "BEIJING (AP) - China´s foreign minister told the U.S. ambassador on Monday that Washington is responsible for the downturn in relations between the two countries and must \"reflect deeply\" before ties can return to a healthy track, an official said.",
        "Qin Gang´s comments follow a suspension of serious dialogue on a range of issues between the world´s largest economies, increasingly at odds over tariffs, attempts by Washington to deprive China of cutting-edge technology, and China´s claims to self-governing Taiwan and large parts of the South and East China Seas.China's Foreign Ministry quoted Qin as telling Ambassador Nicolas Burns that a \"series of erroneous words and deeds by the U.S.\" since a meeting in November between U.S. President Joe Biden and Chinese leader Xi Jinping \"have undermined the hard-won positive momentum of Sino-U.S. relations.\"\"The U.S. side should reflect deeply, meet China halfway, and propel China-U.S. relations out of the difficulties and back on the right track,\" Qin was quoted as saying.The United States should \"correct its understanding of China and return to rationality,\" Qin said, repeating his earlier accusation that the U.S. is attempting to suppress and contain China. Beijing routinely cites U.S. political and military support of Taiwan as infringing on its sovereignty.Qin said ties had \"grown icy\" and the priority was to stabilize them \"and avoid a downward spiral and unanticipated events.\"",
        "The U.S. should stop \"undermining China´s sovereignty, security, and development interests,\" particularly through support of Taiwan's independent identity, Qin said.China says Taiwan must come under its rule, by force if necessary, while the United States says the relationship between the sides must be resolved peaceably. U.S. law requires it to treat threats to Taiwan, including a military blockade, as a matter of \"grave concern,\" though it remains ambiguous under what conditions U.S. forces could be dispatched to defend the island.",
        "Despite the lack of formal diplomatic relations, the U.S. is Taiwan's largest supplier of military hardware and diplomatic support, even while it continues to maintain relations with Beijing. Biden has been seen as going a step further by repeatedly saying that the U.S. would back Taiwan militarily, and America has been upgrading basing arrangements with the Philippines, located just south of Taiwan.U.S.-China military contacts have been on hold for years, and China's top staff refused to answer a call from Defense Secretary Lloyd Austin after then-Speaker of the House of Representatives Nancy Pelosi visited Taiwan last year. China retaliated for the visit by staging a naval and air force blockade of Taiwan and cutting off channels of communication with the U.S. on issues from environmental protection to maritime security.At a daily briefing Monday, Chinese Foreign Ministry spokesperson Wang Wenbin described the meeting between Qin and Burns as \"a normal diplomatic arrangement.\"In a tweet, Burns said he met with Qin and \"discussed challenges in the U.S.-China relationship and the necessity of stabilizing ties and expanding high-level communication.\"In comments to a U.S. think tank last week, Burns said Washington has been consistent in its approach toward Taiwan and insists that \"any resolution of the (cross-Taiwan Strait) differences has to be peaceful.\"",
        "\"We hope that the government here in China will commit itself to a peaceful resolution of the dispute,\" Burns said in an online discussion with the Washington-based Stimson Center.The U.S. \"has the obligation as well as the interest to make sure that we can provide defensive arms to Taiwan so that the Taiwan authorities can have a proper defense and we can help them build up a deterrence,\" he said.\"If Taiwan has a sufficient deterrence in place, and if other countries around the world are supporting a peaceful resolution, one would hope that that would lead the Chinese to understand the consequences of the use of force in the Taiwan Strait,\" Burns said.Contacts between Washington and Beijing have been fraught for months since U.S. Secretary of State Antony Blinken abruptly canceled a Beijing trip aimed at easing U.S.-China tensions in February. That came after a large high-altitude Chinese balloon was shot down after it sailed across the U.S., drawing Pentagon accusations of spying on sensitive military sites despite firm Chinese denials.Qin was due to depart Monday for visits to Germany, France and Norway amid China's fraying relations with Europe over alleged unfair trade practices, human rights abuses and Beijing's support for Russia in its war against Ukraine.",
        "Chinese President Xi and his Russian counterpart, Vladimir Putin, declared their governments had a \"no limits\" friendship before Moscow´s February 2022 attack on Ukraine. Beijing has refused to criticize the Kremlin over the invasion but has tried to appear neutral and has called for a cease-fire and peace talks.___This story has been amended to correct the name of the Chinese Foreign Ministry spokesperson from Mao Ning to Wang Wenbin."
    ]
}