{
    "articleURL": "/news/article-12057211/Sophie-Edward-Eugenie-Jack-Brooksbank-arrive-King-Charles-Coronation-concert.html",
    "content": [
        "Follow all the latest royal news and updates on Coronation events on MailOnline's live blog here King Charles danced alongside the Queen at the Coronation concert as they, and their family, really got into Lionel Richie and Katy Perry's performances as well as a spectacular Take That finale.",
        "Prince George and Princess Charlotte led the royals in a singalong during the final performance from the British boy band at Windsor Castle. Charles III and his wife Camilla also laughed at Miss Piggy and Kermit the Frog, who even appeared in the royal box with them before the stage and Windsor Castle were turned a patriotic red, white and blue.The couple were welcomed with great enthusiasm by the 20,000-strong crowd, who did three cheers for the King and Queen when they arrived as the sun set for the show being broadcast across 100 countries.And as night fell, the royals donned their glowstick wristbands and danced to Lionel as he sang All Night Long. Katy Perry belted out hits including Roar before Take That closed the spectacular event that had included Shakespeare, ballet and a drone show reflecting the monarch's love of the environment, culminating in a blue whale soaring over the castle.At the finale, choristers of St George's Chapel, Windsor Castle, sang the opening to Take That's song Never Forget.Prince George and Princess Charlotte clapped along and the King also joined in - and there was a dancing Queen, as Camilla moved to the music. The royals then held up their Union flags as the concert came to a close, with William tickling George's nose with his.",
        "The King and Queen danced along to Take That's performance of Shine as Prince George and his sister Princess Charlotte enthusiastically waved their Union flags.In the final performance of the Windsor Coronation Concert, the band, who have not performed together for four years, ended with Never Forget - as Kermit the Frog danced along.Charles and Camilla laughed and chatted as they bopped along throughout, with Kate, Charlotte and George also getting into the groove - as did the Duke and Duchess of Edinburgh.William had slipped away so he could go on stage to give a moving tribute to his father, telling him: 'Pa, we are all so proud of you.' He also told King Charles that he had no doubt the late Queen Elizabeth, his 'very proud mother', would be 'fondly' looking down from heaven on his Coronation weekend.Princess Charlotte attempted to get Prince George's attention and pointed at her father the Prince of Wales as he made his way onto the stage to deliver a speech during the Coronation Concert.As William concluded his speech, he said: 'God Save the King,' which was repeated loudly by the thousands in attendance. The speech was followed by the national anthem. The King smiled and waved to the crowd at the end.",
        "Just before Hugh Bonneville introduced Take That as t the final act, Take That, the BBC cut to the royal box, where Kermit the Frog waved a Union flag in front of a grinning Duke of Edinburgh.The King looked to his left as he clapped before Bonneville signed off: 'And, of course, thank you your majesties, for allowing us to perform for you here. We sincerely hope you and the frog have enjoyed yourselves.'The camera then showed a wide view of the royal box, with Charles and Camilla smiling while Kermit nodded.There was no sign of Miss Piggy.",
        "The appearance of Lionel Richie prompted a royal singalong during his rendition of Easy.Zara and Mike Tindall could be seen singing along to the song, with some swaying from the Duke of Edinburgh. The performance sparked huge applause from the King and Queen.Lionel has said he thinks the King will bring a 'new flavour' and his 'amazing sense of humour' to the role of monarch.The US singer, who was about one of the celebrity guests at the coronation service on Saturday, will perform a number of his hit tracks when he takes to the stage at the Coronation Concert in the grounds of Windsor Castle on Sunday evening.",
        "Ahead of his performance, he told the PA news agency: 'I think he's going to bring a new flavour. I'm going say this to you honestly, a lot of people don't know this about him, but he has an amazing sense of humour that we haven't seen yet, so I think we may in the future see a little bit of a glimpse of that - and of course, inclusiveness.'Richie revealed that he immediately jumped at the chance to perform at the celebratory concert, saying: 'It's an honour because it's every 80 years, except for the Queen who just took it all the way to the end. But I mean, this is amazing.'The singer added that he had a chance to speak to Charles ahead of the event and revealed he was 'so happy' and 'really looking forward' to the concert.'He's throwing a party, think about that. This is unusual. I understand this has not happened this often where you have this kind of thing after the big one. So I'm very happy about this. He's very loose,' he added.",
        "Top Gun star Tom Cruise appeared via a pre-recorded video at the Windsor Coronation Concert, calling the King his 'wingman'.Appearing in his Warbird plane as it flew through the clouds, he said: 'Pilot to pilot. Your Majesty, you can be my wingman any time,' before saluting and banking off.",
        "He spoke in a video which also featured messages from Pierce Brosnan and Bear Grylls.The King and Queen, crowned at Westminster Abbey yesterday, sat next to Prince George, Princess Charlotte and the Prince and Princess of Wales, however, it was past the bedtime of Prince Louis, five, who has stayed at home. Sat next to their proud parents, George and Charlotte also appeared to be having a fantastic night dancing and clapping to the songs.Stars including Nicole Scherzinger and Amanda Holden are also in place for tonight's spectacular show on a Union Flag-shaped stage where pop icons including Katy Perry, Lionel Richie and Take That will perform. The royal box was full. The Duke and Duchess of Edinburgh and their children arrived, waving madly to friends. Prince Andrew and his ex-wife Sarah Ferguson, Duchess of York, were also in place. Princess Eugenie, her husband Jack as well as Peter Phillips and his partner Lindsay Wallace were also there. More than 20,000 people were there as the celebrations for the King and Queen's crowning ramped up again.",
        "Paloma Faith, Olly Murs, veteran rock guitarist Steve Winwood, and Nicole Scherzinger of The Pussycat Dolls as well as classical acts including Andrea Bocelli, Welsh bass-baritone Sir Bryn Terfel and Chinese pianist Lang Lang were also on the bill. ",
        "Hollywood star Tom Cruise, Dynasty actress Dame Joan Collins, adventurer Bear Grylls, singer Sir Tom Jones and former Strictly Come Dancing professional Oti Mabuse made an appearance via video. Nicole Scherzinger had said she felt like a Disney princess when she was rehearsing her song.The Pussycat Dolls frontwoman performed a rendition of Reflection, which was written and produced for Disney's 1998 animated film Mulan.Scherzinger told the PA news agency backstage ahead of the event that she felt 'overjoyed' and 'honoured' to take the stage.'Now that I'm here, it just feels really surreal. Being on the ground and having Windsor Castle as your backdrop is the dream,' she added.",
        "The singer said she found the coronation service on Saturday to be 'remarkable', as her home country of America does not have the same type of pageantry.The concert was considered by many to be a crowning touch on the magnificent weekend, after joyous big lunch celebrations today and a surprise walkabout by the Prince and Princess of Wales.Reflecting on his thoughts surrounding the royal family ahead of the concert, host Mr Bonneville said: 'I think each generation will need to make its own definition of what monarchy means.'And I think that is the challenge for the future. In our ever-changing world, where does the monarchy stand? What does it mean?'I mean, for my generation, and for my parents' generation, it was the glue that bound our nations together, and that glue will need to shift and evolve in order to keep the strength that it's had in the past.'Bonneville said he thought the coronation service was 'extraordinary' and admitted that he found the moment the King swapped his 'robes of status and honour' for a simple white shirt for the private anointing as 'particularly touching'.He added: 'It's a crazy old service, it's strange to think how it's accreted over the years, over the centuries to what it is today and it obviously will have a new meaning, a different meaning for our generation, the generation that witnessed it with the late majesty.'I found it moving and an extraordinary change-marker in the sand for our culture and for our generation.'",
        "The series of pre-recorded sketches revealed little-known facts about the monarch and also included moments from beloved literary character Winnie the Pooh - seemingly echoing the famous moment Paddington Bear drank tea with the Queen during her Platinum Jubilee celebrations.",
        "Nigerian singer Tiwa Savage, DJ Pete Tong with his Ibiza Classics project, and winner of The Piano TV talent show, 13-year-old Lucy, also performed.Mr Tong revealed the King specifically requested Ibiza classics songs as part of his coronation concert.The BBC Radio 1 DJ, who has been tasked with delivering the King's wish at the event being held on Sunday evening, said he hopes it will be a 'brilliant' way to start the show in the grounds of Windsor Castle.Backstage ahead of the event, Tong said: 'He wanted Ibiza classics, that was very specific.'And then they asked us to suggest a couple of songs so we suggested three or four, and he came back with one of them and that's the one that's starting the show, so they very much had an involvement in what they wanted us to perform.'Asked why he felt this genre was among the playlist requests, he added: 'I think they want to put across a big variety of UK talent and touch all different demographics and be relevant to different age groups.'I mean, the shows we do we literally get kids up to pensioners. Relapse ravers, we call them - so maybe there's a few relapsed ravers in the royal household, we don't know.'Meanwhile, fashion designer Stella McCartney delivered a spoken word performance with a conservation theme which will reflect her and the King's 'shared passion for environmental sustainability'.Her performance was part of a broader nature-themed section of the concert which included a rendition of a 1980s hit by classical-soul composer Alexis Ffrench and London-based singer-songwriter Zak Abel alongside a house orchestra, band and choir."
    ]
}