{
    "articleURL": "/tvshowbiz/article-12057191/Danny-Keough-seen-time-Lisa-Marie-Presleys-death-daughter-Riley-Keough.html",
    "content": [
        "Danny Keough was spotted while stepping out with his daughter Riley and his granddaughter, whose name has not been revealed publicly yet, in Calabasas on Sunday morning.",
        "The 57-year-old actor and his 33-year-old daughter stayed close to one another as they left an Erewhon Market after picking up a pair of drinks.This marks the first time that he has been seen in public since the death of his former wife Lisa Marie Presley, who passed away at the age of 54 in January.Danny kept it casual in a blue hoodie, tan pants and a green trucker cap during the outing.Riley opted for a red striped cardigan sweater that was contrasted with blue jeans.",
        "Danny and Lisa Marie began dating in 1985, and they went on to tie the knot after three years together.The couple started a family with Riley's arrival in 1989, and they welcomed a son named Benjamin in 1992.However, the former pair split up two years later, and their divorce was finalized that year.Benjamin subsequently died by suicide at the age of 27 in Calabasas on July 12, 2020.Lisa Marie went on to have marriages to Michael Jackson, Nicolas Cage and Michael Lockwood, although all ended in divorce.The daughter of Elvis and Priscilla Presley shared twin daughters Harper and Finley, 14, with Lockwood — her final husband — whom she divorced last year.The singer's final public appearance was at the 80th Golden Globe Awards, just two days before her death.",
        "She passed away after suffering cardiac arrest at her residence in Calabasas on January 12.",
        "Riley was present during her mother's memorial service, which took place ten days after her death, during which she revealed that she had recently welcomed her daughter into her life.The actress' husband, Ben Smith-Petersen, read his wife's eulogy for her mother, during which she expressed her gratitude for the guidance that Lisa Marie had given her over the course of their time together. 'Thank you for showing me that love is the only thing that matters in this life. I hope I can love my daughter the way you loved me, the way you loved my brother and my sisters,' read part of the statement, via Us Weekly.'Thank you for giving me strength, my heart, my empathy, my courage, my sense of humor, my manners, my temper, my wildness, my tenacity. I’m a product of your heart.'"
    ]
}