{
    "articleURL": "/sport/football/article-12054451/Liverpool-1-0-Brentford-Mohamed-Salah-bags-winner-Reds-one-point-Man-United.html",
    "content": [
        "Liverpool won their sixth Premier League game in a row on Saturday as they beat Brentford 1-0 at AnfieldMohamed Salah scored the only goal, his 100th at Anfield and 30th of the season, with a close-range effortThe Bees looked to have gone level through Bryan Mbeumo after 39 minutes , but it was ruled out for offsideOn an emotive day at Anfield in which the home support loudly booed the national anthem played for Charles III’s coronation, The Kop were able to sing the praises of their own Egyptian King, Mo Salah.",
        "Liverpool fans made their controversial choice to boo God Save the King at ear-splitting volume before kick-off, when they also launched into a powerful rendition of their own signature tune, You’ll Never Walk Alone.It was almost a relief to the senses when Anthony Taylor blew his whistle to start the football match and Salah provided the winning intervention after only 13 minutes to break all sorts of personal records and milestones.Converting Virgil van Dijk’s header across goal from close range, Salah became the first Liverpool player in history to score in nine consecutive games at home, also reaching his Century in total at Anfield.In addition, it meant he’d reached 30 goals in a season for the fourth time since joining from Roma in 2017 and joined Steven Gerrard in fifth place on the all-time scorer’s list, on 186.",
        "Addressing the fans’ reaction to the national anthem, which the club had been asked to play by the Premier League, a thoughtful Klopp said:",
        "Liverpool (4-2-1-3): Alisson 7: Alexander-Arnold 7.5, Konate 6.5, van Dijk 7, Robertson 6 (Tsimikas 82); Jones 6 (Milner 82), Fabinho 6; Gakpo 6.5; Salah 7, Nunez 6 (Diaz 65 6), Jota 7 (Henderson 72 7) Subs unused: Kelleher (Gk), Gomez, Matip, Carvalho, Elliott Goal: Salah 13 Booked: van Dijk, Fabinho, Konate, AlissonBrentford (5-3-2): Raya 6: Hickey 6 (Wissa 88), Zanka 6.5, Pinnock 6, Mee 7, Henry 6 (Dasilva 72); Jensen 7 (Damsgaard 82), Onyeka 6 (Schade 72), Janelt 6 (Baptiste 82); Toney 7, Mbeumo 6 Subs unused: Cox (Gk), Ajer, Ghoddos, Roerslev Booked: Mbuemo, HenryReferee: Anthony Taylor 7",
        "‘First and foremost, today was a big day for England and I respect that a lot. Everybody wants to be happy about it and celebrate. Not everything is better than in the past, but thank God we have the freedom of free speech and freedom of opinion.‘It was clear something like this would happen, everybody knew it. That is fine, nothing else happened, there were no chants.‘The people showed, I don’t exactly know what it was, but they weren’t always happy in the past with the way Liverpool, the club and the city, were dealt with. That is it.Today is for all the other people who loved the day, I am not sure if you say Congratulations to the King but I say it. For the people who really celebrate it, don’t think about other stuff.‘People who are not happy about it, say it, and that’s it. I think it was absolutely Ok.’Back on the pitch, Salah celebrated another step towards legendary status.‘It is something that makes me proud,’ said Salah. ‘I am motivated to keep breaking records and win games for the team.‘I would like to score better goals than that but will take it for a very important three points.‘I told David (Raya) he hit the ball on my knee. I was just happy I scored. We have improved a lot in the last couple of weeks, six (wins) in a row and a couple of clean sheets which is important.’",
        "Salah has scored some spectacular goals in his Reds career but this one was scrappy. Fabinho’s dink to the far post was headed across by van Dijk and Salah took a first touch with his studs before completing the job from the helpful ricochet a yard out.",
        "it was enough for Liverpool to complete a sixth consecutive victory, the last five by a single-goal margin.Though fourth-placed Manchester United are still favourites to qualify for the Champions League, Liverpool are only a point behind and Erik ten Hag’s men need to make the first of their two games in hand pay at West Ham tomorrow (Sunday evening).Liverpool could count to having other chances, Darwin Nunez and Trent Alexander-Arnold were denied by smart saves from Raya while Nunez and Cody Gakpo also missed the target when well placed inside the box.But Brentford, whose only win at Anfield was way back in another coronation year 1937 when George VI was crowned, also gave it a go and showed why they are in the top half this season.Captain and top scorer Ivan Toney, who had scored with a low free-kick against Nottingham Forest last weekend, almost repeated the trick after 38 minutes with a shot that beat Alisson but also the far post.",
        "Bryan Mbuemo also beat Alisson before a lengthy VAR check ruled he’d begun his run past Virgil an Dijk fractionally early. The physical confrontation between Toney and van Dijk was compelling throughout.Unusually, Klopp had started with four forwards but reduced that to three for the final quarter, sending on Jordan Henderson for Jota, needing to tighten up with Thomas Frank’s side threatening an equaliser.When Mr Taylor blew the final whistle, Alisson was relieved to have kept his hundredth clean sheet as a Liverpool goalkeeper and he was even booked for timewasting with The Bees keen to pepper the Liverpool goal with high crosses in the final stages.Klopp joined in the chorus of praise for Salah: ‘I can’t see him stopping. That’s just his nature - you need to have this desire to score goals,’ said the Reds boss.‘A lot of people don’t appreciate players when they are still playing. For us, it’s clear. He is an all-time great.’",
        "On the top four race, he added: ‘If Manchester United win their games in hand, then they are seven points away and it is pretty much done. We know that bu it’s an interesting period. Nothing is decided and that’s good.’For Brentford, their forward Mbuemo rued his closely-ruled out equaliser.",
        "‘They had a very high line so I had to gamble all the time. It was a (fine) margin to not be a goal,’ he said. ‘At the end they tried to win as much time as they could.’Bees manager Thomas Frank was happy to see his team be brave enough to press Liverpool high up the pitch. ‘It was a good performance, my only complaint was the final pass or cross. We could have tested the goalkeeper more. But last season, we lost 3-0 here, it is a huge development.’ "
    ]
}