{
    "articleURL": "/wires/ap/article-12042683/Subban-launches-showcasing-diverse-world-hockey.html",
    "content": [
        "More than a year since playing his last NHL game and retiring at age 33, P.K. Subban is still pushing himself away from the ice.",
        "Sure, he's still training and staying in shape, but the 2013 Norris Trophy-winning defenseman is now working on pushing the limits on television.\"I don´t ever put limits on myself. I would suggest that the game of hockey do the same,\" Subban said. \"I think that there´s no limits on what we can do. The game is still very young in terms of how we broadcast the game and how we do things. I still think there´s a lot of room for growth.\"That growth is on display across hockey media in the United States. There is a variety of voices contributing, from former women's star AJ Mleczko and other women on game broadcasts to Black retired players Subban, Kevin Weekes and Anson Carter analyzing from the booth or studio.Subban's latest foray is \"P.K.'s Places,\" a hockey show by Peyton Manning's Omaha Productions for ESPN that puts him at the forefront of a sport eager to embrace and showcase diversity to expand what has long been a predominantly white audience.\"It´s incredible, and I think it really shows the commitment to diversity that ESPN and Disney and Omaha and the NHL has to really growing the game and expanding the roots,\" ESPN senior managing producer Lindsay Rovegno said. \"He´s a natural choice. He´s passionate, he´s high energy, he´s fun. It´s really very clear that he wants to expand the game and wants people to see that there´s a history but there´s also a really fun element to the sport.\"",
        "Subban is having plenty of fun after hanging up his skates, and he hopes that comes through on the show, which launched Wednesday with the first episode on ESPN+. He's at peace with his decision to stop playing after 13 professional seasons because the right situation didn't materialize to keep chasing the Stanley Cup.\"When I didn´t have an opportunity to play on a team that I thought was the right fit to do that, it was a no-brainer for me to go in a different direction,\" Subban said. \"The way I played the game was I give 150% every shift ... I have that same passion that I had on the ice to bring it to media.\"Subban looks up to Super Bowl champion-turned-morning show personality Michael Strahan in terms of creating a second stage of his career and gets advice from the former New York Giants defensive lineman about how to follow his path. In hockey, there are also two prominent former players who are Black: Weekes, who's at ESPN, and Carter, who's an analyst for Turner Sports.Riffing with Manning and interviewing Ray Bourque about winning the Cup and celebrating in Boston takes Subban beyond just the analyst realm and allows him to show some of the personality that made him a star in the NHL from Montreal to Nashville to New Jersey for more than a decade.",
        "\"He brings a fresh perspective,\" said Rovegno, who has worked on the \"Places\" franchise from its inception. \"He brings not only his experience on the ice and sort of shares anecdotes from his time as a player, but really connects with the legends and is able to dive into the history and share the passion that he has for the game.\"Subban reached a deal with Omaha and ESPN before retiring, and this show may just be the start for him. Perhaps a hockey version of Peyton and Eli's \"ManningCast\" with brothers Malcolm and Jordan could be in store down the line.\"Maybe that´s something that we´ll consider,\" Subban said. \"To be able to do things that maybe replicate the `ManningCast´ or any other things that are being done on broadcasts in the sports world would be something that would be huge for hockey.\"___AP NHL playoffs: https://apnews.com/hub/stanley-cup and https://twitter.com/AP_Sports"
    ]
}