{
    "articleURL": "/sport/football/article-12039285/Dominic-Calvert-Lewin-trusts-body-rigorous-rehabilitation-programme.html",
    "content": [
        "The Everton striker has seen his career stall over various fitness issues Sean Dyche made the decision not to rush Dominic Calvert-Lewin back this termEverton could now reap the rewards with striker having scored against LeicesterDominic Calvert-Lewin insists he has full confidence in his body once again and will embrace the challenge of leading Everton’s fight for survival.",
        "The England striker scored his first goal since last October in Monday’s 2-2 draw, converting a first half penalty, but it was his all-round performance that caught the eye as his physical presence gave Everton a focal point that has been desperately lacking.It has been a torrid year for Calvert-Lewin, who missed the start of the campaign after breaking down with a knee injury and then had to sit out the first two months of Sean Dyche’s reign after damaging his hamstring in the new manager’s opening game against Arsenal.Dyche put Calvert-Lewin through a rigorous rehabilitation programme, looking into every aspect of his lifestyle from the bed he was sleeping on to the weights he was lifting, and Everton’s number nine now says he is fully up to speed to cope with all that is thrown at him.",
        "‘When you take so many setbacks and can’t play, it can become also a mental game to take the shackles off and trust your body to be free,’ said Calvert-Lewin. ‘I have been in that cycle and in all fairness to the manager, he has given me my time.‘I have got back to a point where I feel happy within my body, whereas previously I think I have rushed back, maybe from my own fault of wanting to get back too quick and help the team. This time I have had to be patient which has been difficult because I am not a patient person.",
        "‘I am grateful for the manager for giving me that time to be able perform freely like I did against Leicester.’Goals have not been easy to come by for Everton, who have been the lowest scorers in the country, but Calvert-Lewin is adamant he can chip with enough big moments in the next four games to ensure they secure safety.‘I have been shouldering responsibility for a while,’ said Calvert-Lewin. ‘I know what it means to wear the No.9 shirt and play for Everton and lead the line. I have done it for the last three-four years now so it is nothing new to me. I accept the challenge and enjoy the expectation.’"
    ]
}