{
    "articleURL": "/health/article-12047339/Detroit-school-closes-student-dies-officials-investigate.html",
    "content": [
        "A kindergartner, whose name and age remain unknown, passed away last weekThe school will remain closed until Monday as it undergoes a thorough cleaningREAD MORE: Renewed concern as virologists find bird flu spreads among ferretsA Detroit elementary school has been temporarily shuttered after a kindergartener died with flu-like symptoms. ",
        "The Detroit Public Schools Community District announced that Marcus Garvey Academy will undergo a thorough cleaning while it remains closed until Monday as health officials investigate 'unusually high rate of flu-like symptoms including student fevers, and vomiting.' The health department has not confirmed the cause of the fatal illness but said parents of young children should monitor them for symptoms including fever, headache, lethargy, nausea/vomiting, and abdominal pain.Seasonal flu typically lasts from the autumn through around February, but it is not unheard of for the virus to linger into the warmer season.",
        "The school district said: 'Tragically, last week one of our kindergarten students at Marcus Garvey passed away. At this time, the medical examiner has not determined the cause of death.'Parents of children aged four through seven should remain especially vigilant, the health department advised. Childhood illness is nothing new, and most parents have come to expect their children will pick up some pathogen or other from a classmate and bring it home. ",
        "Humans could one day be struck down by ‘dog flu’ – a mutated form of avian influenza which is slowly evolving. Virus samples taken from infected dogs were better able to recognize human cell receptors, compared to those taken from a decade ago.",
        "And while flu can certainly prove fatal, especially to people with compromised immune systems, deaths are not very common. ",
        "They typically max out at around 200, and the vast majority of pediatric flu deaths - approximately 80 percent - occur in children who have not gotten a flu shot. The school district and health officials are tight-lipped about the identify of the deceased child, whose name, age, and underlying health remain a mystery. But the former's statement that it has experienced an unusually high rate of flu-like illnesses 'this week' after a kindergartener died last week suggests the issue has been brewing for at least a week. Visits to the emergency department due to flu symptoms in Wayne county, where Detroit is located, have been far lower this year than what can normally be expected. Still, visits ticked up from late March into early April, according to the county's most recent influenza surveillance report. Hospitalizations due to flu have also ticked up in recent weeks, though still far below the county's five-year average.  Dr Kevin Dazy, a pediatrician at Children's Hospital of Michigan told a Fox news affiliate: 'You can see flu really any time of the year. I don't think it's necessarily surprising, but it's a reminder we have to be washing our hands, be careful of reporting symptoms kids have, so it's not spreading rapidly from child to child.'  "
    ]
}