{
    "articleURL": "/wires/aap/article-12055175/Corica-insists-Sydney-upset-City-ALM-finals.html",
    "content": [
        "Buoyed by an elimination final win over their nearest rivals, Steve Corica believes Sydney FC can upset Melbourne City and seal a spot in the A-League Men grand final.",
        "Sydney sealed a gritty 2-1 elimination final win over the Western Sydney Wanderers on Saturday to set up an intriguing two-legged semi-final with City.The Melburnian outfit won the premiership by 11 points and many believe the title is City's to lose.But they face a Sydney side who have found form at the business end of the season after finishing fifth, 17 points off City at the top.The Sky Blues are undefeated in their last six games and are beginning to find a chemistry that has been lacking throughout the year.Their tough, come-from-behind victory over the Wanderers suggests there is resolve in this side, although Corica stressed they would have to be faultless to knock City over.\"They (City) have been really great, they're a great team and a very exciting team to watch as well,\" said Corica, whose side will host the first leg at Allianz Stadium on Friday.\"We beat them earlier in the season as well so they are beatable, you have to play really well to do that.\"It's over two legs as well and the first leg is at home, we just have to make sure that we get ourselves up for that game.\"It's obviously very emotional, the derby, so we need to come back down to earth very quickly and start preparing for the next game.\"",
        "Corica again made an impassioned plea to the club's active supporter group The Cove, to reconsider their boycott of his team's finals matches.The Cove have chosen to stay away from finals games because of the A-League's decision to sell grand final hosting rights to the NSW government.Corica was confident English winger Joe Lolley would be able to have a greater contribution against City after getting an 11-minute cameo against the Wanderers.Lolley has been battling a hamstring issue and was subbed on and off again with the result secured.\"Whether he starts or comes off the bench again next week, we'll have to wait and see how much training he does,\" Corica said.\"But he was brave enough to put his hand up to be on the bench, he did well.\""
    ]
}