{
    "articleURL": "/wires/reuters/article-12057321/Russian-nationalist-writer-describes-surviving-attack-Moscow-blamed-U-S--Ukraine.html",
    "content": [
        "May 7 (Reuters) - The prominent Russian nationalist writer, Zakhar Prilepin, on Sunday described breaking both legs in a car bomb that killed his driver and which Moscow blamed on the United States and Ukraine.",
        "\"To the demons I say: You will scare nobody. There is a God. We will win,\" he said in a Telegram post apparently written from hospital in Nizhny Novgorod region, where Russia's state Investigative Committee said his Audi Q7 was blown up on Saturday in a village about 400 km (250 miles) east of Moscow.Russia's Foreign Ministry blamed Ukraine and the Western states backing it, particularly the United States, for the attack on the writer, an ardent proponent of Moscow's military campaign in Ukraine.Ukraine's security services neither confirmed nor denied involvement. Mykhailo Podolyak, a senior advisor to Ukrainian President Volodymyr Zelenskiy, said he believed Russian authorities had staged the attack.The U.S. State Department did not immediately respond to a request for comment.Prilepin said he was driving and that he had dropped his daughter off five minutes earlier. A mine detonated under the wheel on the passenger side where his driver Sasha Shubin, his \"guardian angel for eight years,\" was sitting, he added.The man responsible fled after exploding the first of two mines, Prilepin said, adding, \"Had he blown up the second one, everyone would be dead.\" The Russian investigative committee has said it is questioning a suspect named Alexander Permyakov.\"I lost consciousness for about three minutes, woke up and crawled to the broken windshield,\" Prilepin said. \"The villagers ran up and helped get me out.\"",
        "Prilepin said both of his legs were broken and one fracture was open. He said the regional Nizhny Novgorod governor, Gleb Nikitin, had sent a helicopter to fly him to the city in 16 minutes, sparing him a three-hour drive. (Reporting by Elaine Monaghan; editing by Diane Craft)"
    ]
}