{
    "articleURL": "/wires/reuters/article-12047223/US-industrial-recession-cuts-diesel-electricity-use-Kemp.html",
    "content": [
        "By John Kemp",
        "LONDON, May 4 (Reuters) - U.S. manufacturing and freight activity has declined for six months running, which is being reflected in falling consumption of diesel and other distillate fuel oils as well as industrial electricity sales.Manufacturers reported another widespread downturn in April, according to the monthly purchasing managers' survey published by the Institute for Supply Management (ISM).The ISM composite manufacturing index stood at 47.1 (15th percentile for all months since 1980) last month and has been below the 50-point threshold dividing expanding activity from a contraction since November.The index has fallen to levels that have coincided with a significant mid-cycle downturn in industrial activity or a cycle-ending recession in the past.The forward-looking new orders component remained at just 45.7 (9th percentile) in April - signalling activity is likely to continue falling for several more months.Chartbook: U.S. diesel and electricity useBecause manufacturing output is closely correlated with consumption of distillate fuel oils and industrial electricity use, the downturn is filtering through into significant reductions in energy consumption.Based on the most recent data available, the volume of distillates supplied, a proxy for consumption, fell in six of seven months between August 2022 and February 2023 compared with the same months a year earlier.The volume of distillates supplied was down by an average of almost 5% between December 2022 and February 2023 (16th percentile for all overlapping three-month periods since 1980).",
        "Electricity sales to industrial consumers also fell in six of seven months between July 2022 and January 2023 compared with a year earlier, again using the most recent data available.Between November and January, industrial electricity sales were down by an average of 3% compared with a year earlier (12th percentile for all three-month periods since 1980).The decline in energy use confirms the industrial side of the economy is in the middle of a broad-based and sustained downturn.The downturn is set to last through the middle of 2023 at least, as interest rates rise, corporate layoffs continue, and businesses and households become more cautious about spending.Related columns:- Hard-ish landing has already arrived for U.S. manufacturers (April 4, 2023)- U.S. diesel consumption falls as economy slows (March 1, 2023)John Kemp is a Reuters market analyst. The views expressed are his own (Editing by Paul Simao)"
    ]
}