{
    "articleURL": "/wires/reuters/article-12054901/Guardiola-angry-Haalands-penalty-gesture.html",
    "content": [
        "By Lori Ewing",
        "MANCHESTER, England, May 6 (Reuters) - A magnanimous gesture by Manchester City's goal-machine Erling Haaland left Pep Guardiola fuming on Saturday after the Norwegian striker ignored his manager's orders to take a spot-kick and handed the ball to team mate Ilkay Gundogan.After the German midfielder had scored a first-half brace to put the Premier League leaders 2-0 up against Leeds United, Guardiola yelled from the sidelines for Haaland to take the penalty they had been awarded in the closing minutes.But the 22-year-old Haaland, who has already scored a Premier League single season record of 35 goals, glanced at Guardiola before handing the ball to Gundogan so that the German could complete a hat-trick.It was a move that sent the Spanish manager into fits of rage, especially as Gundogan's effort was pushed aside by a diving Joel Robles.\"If Gundo scores everyone is 'OK, hat-trick, well done,'\" Guardiola said following City's 2-1 victory.\"But a taker is a taker. At 2-0, this is a business, not a situation where we cannot forget it.\"The 32-year-old Gundogan felt the heat from Guardiola when he stepped up to the spot.\"First he showed to Erling that he was quite mad about that, and then also he had a go at me,\" Gundogan told BBC Sport. \"It is what it is at the end.",
        "\"The moment Erling grabbed the ball, I was sure he was going to take it but he looked out for me. I checked with him a few times to make sure he was sure. He was certain to hand the ball to me. I was confident to score.\"Haaland had several excellent scoring chances, with a shot that bounced off the crossbar and another that glanced off the post.With City in pursuit of their third successive Premier League title, and the win having extended their lead over second-placed Arsenal to four points, Guardiola's mood had improved somewhat by the time he met reporters post-game.\"The performance was excellent. We played really, really good,\" said the Spaniard, whose side have four league games left this season.\"Who knows if Erling takes the penalty and miss it? What happen if Gundo takes the penalty and score? So the question is 2-0, who is the taker? The taker is Erling.\"Second point is that is how Erling is as a person. He is incredible, wants to score goals, but at the same time, the team, the mates are important. He had chances to score goals, he didn't convert, but he played an outstanding game.\"But it's 2-0, especially in England it never is over and I want the taker who has more routine, who is a specialist, to take it.\"",
        "Treble-chasing City next head to Real Madrid for the first leg of their Champions League semi-final on Tuesday. (Reporting by Lori Ewing)"
    ]
}