{
    "articleURL": "/health/article-12042163/Warning-signs-cancer-revealed-Ed-Sheerans-wife-Cherry-Seaborn-diagnosed-tumour.html",
    "content": [
        "Ed Sheeran felt like he was 'drowning' after his wife was diagnosed with cancerHere, MailOnline reveals some of the cancer warning signs to look out forHis chart-topping songs and albums have made him a household name.",
        "But in a documentary released today, singer songwriter Ed Sheeran has described how he felt like he was 'drowning' after doctors found a tumour in his wife's arm.The 32-year-old shared how Cherry Seaborn, 30, was diagnosed with cancer in February last year while she was six months pregnant with their second child. In his Disney+ show, titled Ed Sheeran: The Sum Of It All, he broke down in tears and admitted fearing that she would die.The couple have now welcomed their daughter Jupiter and, following surgery to remove the tumour, it hasn't come back.But with 375,000 Brits and 2million Americans diagnosed with cancer every year, for many the symptoms of the disease, such as fatigue and weight loss, aren't always obvious.Here, MailOnline reveals some of the cancer warning signs to look out for.",
        "Unusual lump or swellingAny lump that does not go away should be taken seriously. Lumps or swellings in the neck, armpits, stomach, groin, chest, breast or testicle could be a sign of cancer, warns Cancer Research.If you have a lump that is increasing in size you should speak to your GP, the NHS says. Experts say it is important to regularly check your breasts, underarms and groin area for new lumps.  Weight lossLosing weight unintentionally can also be a warning sign of cancer. ",
        "Although small weight changes are normal, Cancer Research warns that people who lose a noticeable amount of weight without trying to should speak to their GP. Cancer can cause unexplained weight loss for a variety of reasons. For example, with bowel cancer, weight loss can be caused by a tumour as it makes you feel sick or bloated reducing your appetite, says Bowel Cancer UK. A tumour can also physically block the bowel, causing pain in the stomach and similarly putting you off eating, explains the charity.",
        "Pain or acheA pain or ache is the body's way of communicating that something is wrong. You should seek medical advice for any persistent pain in the body as it could be a sign of something more serious, according to Cancer Research. A pain could be a sign of a tumour, for example a persistent sore throat can indicate  throat cancer and pain in the tummy can be a sign of bowel cancer. Bleeding or bruisingBleeding or bruising without hurting yourself can be a warning sign of cancer. Blood in your poo or pee or even vomiting or coughing up blood are signs that appear in several types of cancer, according to Cancer Research. Bowel cancer, cervical cancer and also lung cancer can cause unexplained bleeding. Unexplained bruising can also be a sign of leukaemia. ",
        "Unusual vaginal bleeding between periods, after sex or after the menopause should also be reported to your GP. The blood can be red or darker and be brown or black, but whatever the colour or amount quantity, you should get it checked out. FatigueFeeling stressed or having trouble sleeping can be common reasons for feeling more tired than usual. But if you are feeling tired all the time, you should speak with a doctor. A tumour bleeding internally can cause tiredness because it can develop into anaemia — when there is a lack of red blood cells in the body.You may feel very tired and have pale skin as a knock-on effect. Anaemia can also cause dizziness and breathlessness, according to Macmillan. ",
        "Heavy night sweats Having a fever or sweating a lot at night can be a sign of an infection, according to Cancer Research. Sweating can also be a side effect of certain medication and it is experienced by women around the time of the menopause. However, if you have very heavy and drenching night sweats or have an unexplained fever you should speak to a doctor.  "
    ]
}