{
    "articleURL": "/sport/football/article-12055071/Real-Madrid-2-1-Osasuna-Los-Blancos-win-Copa-del-Rey-20th-time-Rodrygo-brace.html",
    "content": [
        "Real Madrid have won their first Copa del Rey title since 2014 in SevillaThey beat Osasuna 2-1 thanks to a goal in each half from RodrygoCarlo Ancelotti has now won 10 trophies across two spells at RealCarlo Ancelotti won his 10th trophy as a Real Madrid coach as his team beat Osasuna 2-1… and it was just like watching Brazil. ",
        "Wingers Rodrygo and Vinicius were the stars of the show with the former scoring twice from the latter’s brilliant assists.If Ancelotti ever does take the Brazil job then these two will be the first names on his team sheet. As it is they are the terrible tandem in Spain terrorizing defences and they were too much for Osasuna.Jon Moncayola was given the ominous task of dealing with Vinicius and he failed his first test but he was not the only one. There were no more than 100 seconds on the clock when Vinicius went past the Osasuna right-back. He then skipped past Ruben Peña and bypassed Aridane. The blistering run down the right flank ended with a cross to the Brazilian on the other wing, Rodrygo, who had arrived to the edge of the six-yard box. He lashed the ball past Osasuna keeper Sergio Herrera with a slight deflection off of Juan Cruz. Madrid were ahead inside two minutes.",
        "Twenty minutes later Vinicius went past Moncayola once more and when the defender pulled him back he was shown the game’s first red card. In Madrid’s next attack Vinicius went past Moncayola once more and crossed for Rodrygo who teed-up Benzema whose shot was saved.Osasuna’s first chance came next with the lively Abde nicking the ball from Eder Militao and sending a diagonal shot past Courtois only for Dani Carvajal to clear off the line. Frustrated at the near miss the on loan Barcelona winger kicked a water bottle behind the goal and banged his head on to the post. Osasuna knew chances would be few and they had to take them.",
        "Madrid remained on top and David Alaba sent a long range free-kick on to the crossbar with the favourite’s next chance. Osasuna were struggling to contain Madrid and David Garcia was booked for rugby tackling Benzema.Vinicius was tying Osasuna in knots and Garcia risked a second yellow in a confrontation with him. The winger went nose to nose with Vinicius and he ruffled the Real Madrid forward’s hair.When the two teams walked off the pitch at half time Osasuna substitute Chimy Avila sought out Vinicius as the players went down the steps of the tunnel. Madrid substitute Lucas Vazquez, who had earlier had a calming word in Vinicius’ ear, stepped in between the two. That led to a further flaring of tempers and things got lively in the tunnel with reports that Osasuna’s director of football Braulio Vazquez had to be held back by colleague Jose Antonio Cata Preito in what appeared to be a brewing altercation with someone from Madrid’s bench.",
        "If the rise in temperature between the two teams favoured anyone then it favoured Osasuna and they were level on minute 57 when midfield Lucas Torro scored the goal of his life beating Courtois from outside the penalty area with an unstoppable shot into the corner. It was his first goal of the season and the red half of the Cartuja Stadium was in raptures. A flare thrown from the Osasuna end after the goal went in then set fire to something behind the goal and security had to take a fire extinguisher to the flames.",
        "With 20 minutes left Madrid got themselves back in front and again it was the Brazilians who made it happen. Vinicius drove to the byline and when he pulled the ball back Garcia cleared straight to Toni Kroos. His shot then clipped the heels of Garcia and ran to Rodrygo who doubled his tally in the final.Vinicius might have made it three on 89 minutes but he selflessly tried to roll it back to Benzema and when the pass fell short Osasuna cleared. Five minutes were added on but with Luka Modric on as a late sub Madrid saw out time to win their 20th Spanish Cup.",
        "Real Madrid: Courtois, Carvajal, Militao, Alaba, Camavinga, Valverde, Tchouameni (Rudiger, 69), Kroos (Modric, 82), Rodrygo (Asensio, 89), Benzema, ViniciusUnused subs: Vallejo, Nacho, Hazard, Lunin, Odriozola, Vazquez, Ceballos, MarianoGoals: Rodrygo (2, 70)Osasuna:  Herrera, Moncayola, Garcia, Armado, Torro, Bardonado, Pena (Garcia, 75), Oroz, Ezzalzouli, Oroz, Ezzalzouli (Alfonso, 75), Budimir (Avila, 70)Unused subs: Garcia, Kike, Ibanez, Sanchez, Ferdandez, Herrando, Munoz, Moreno Goals: Torro (58) "
    ]
}