{
    "articleURL": "/news/article-12046601/King-Charles-III-Coronation-Thieves-steal-tents-campers-Mall.html",
    "content": [
        "Patrick McCrossan has slept in an outdoor chair after having two tents stolen The 62-year-old's £670 GoPro and various phone chargers were also takenThieves are robbing royal fans camped on The Mall ahead of the Coronation - with one victim having two tents stolen in just 48 hours when he went to the toilet.",
        "Patrick McCrossan, a royal fan who lives in Chelsea, has been forced to sleep in an outdoor chair after having his tent removed - before the replacement was also taken.The 62-year-old who is originally from Northern Ireland, told MailOnline that he has been left scared to go for a comfort break in case he is targeted again.As well as losing two tents, Mr McCrossan's £670 GoPro and various phone chargers were stolen, despite The Mall being at the heart of the biggest security operation in British history with a record 11,500 police officers on duty in London this weekend.Mr McCrossan said that he was disgusted that criminals were using the Coronation as an 'opportunity' to steal from royal well-wishers.",
        "He believes that the robbers overheard him saying that he was going to the toilet in nearby Green Park.Mr McCrossan told MailOnline: 'My stuff got stolen - twice. I've got no tent now. I had to buy two new chairs and my tents gone, twice. I couldn't get it a third time.Asked if he had told the police, he said: 'No - I don't see any cameras anywhere. I think what it was was there were some guys, some people milling around. I've been to so many of these events over the years - I thought it was alright to say that I'm only going to the toilet.",
        "'There were some that weren't open, so I went up towards Green Park to go to the toilet up there and I thought that would be fine. And when I came back, they were gone. And I thought oh s***, someone's gone off with my stuff.'",
        "He added: 'My bag had phone chargers and all sorts of things in it and my GoPro. I bought my GoPro, £659, in March for my birthday and it was gone. I lost a lot of stuff. 'I'd got myself a GoPro for my birthday because I go to that many interesting places and see interesting things.'Mr McCrossan added that he was now concerned about leaving to go the toilet again.He said: 'If I get enough trust in people around me, even though they've just come, I think they're alright - but I've just got to be sure I can go away and feel that I'm not going to come back and it would be all gone.'He also said that he was 'tempted to go and get another tent' because there was a shop stocking them in nearby Piccadilly.",
        "It comes as a senior police officer said protesters who try to disrupt the coronation can expect 'very swift action' from police who will have 'an extremely low threshold' when dealing with them.",
        "Metropolitan Police Deputy Assistant Commissioner Ade Adelekan told journalists that the force will not tolerate any criminal activity camouflaged as protest during the event.A massive security and policing operation is under way that will see 11,500 police officers on duty on Saturday and 10,000 military personnel taking part in the ceremony.Specialist teams have begun scouring the area of central London where events will unfold and will continue monitoring crowds to spot signs of suspicious behaviour.The policing plan, dubbed Operation Golden Orb, has been re-examined after a security incident outside Buckingham Palace on Tuesday evening when a man who allegedly had a knife threw shotgun cartridges over the palace gates."
    ]
}