{
    "articleURL": "/wires/reuters/article-12050645/FOREX-Dollar-touch-softer-US-payrolls-loom.html",
    "content": [
        "Dollar broadly softer, U.S. jobs data in focus",
        "Sterling at highest in almost a year(Updates prices throughout, adds comment in paragraph 19)By Dhara RanasingheLONDON, May 5 (Reuters) - The dollar was a touch softer against other major currencies on Friday as banking sector woes added to talk of U.S. rate cuts later this year, ahead of the much-anticipated monthly U.S. jobs report.Sterling rose to its highest level in almost a year, the euro recovered some ground from losses made after Thursday's European Central Bank meeting and the yen was set for its first weekly gain in nearly a month - benefiting from safe-haven demand.The dollar index, which measures the greenback's value against other major currencies, was a whisker softer at 101.31, and set for a second straight week of falls.Growing expectations for a Federal Reserve rate cut later this year have dimmed the outlook for the dollar, while fresh turmoil among U.S. banks has ratcheted up recession risks and added to speculation that the Fed could soon reverse course.The central bank hiked rates by a quarter point on Wednesday and signalled it may pause an aggressive tightening campaign.Shares of U.S. regional banks have tumbled this week as First Republic Bank collapsed and Los Angeles-based PacWest Bancorp said it would explore its strategic options.",
        "\"Conviction levels are rising that credit conditions will tighten and the U.S. economy would slow more than it otherwise would,\" said Chris Turner, global head of markets at ING.\"That takes the heat out of inflation and paves the way for the Fed to cut rates.\"Traders have priced in more aggressive rate cuts from the Fed, with Fed funds futures implying a small chance that cuts could come as soon as July.The April non-farm payrolls report later on Friday could provide the next steer for currency markets. Economists polled by Reuters forecast the U.S. economy created 180,000 new jobs, versus 236,000 in March.Data released earlier this week showed that the U.S. services sector maintained a steady pace of growth in April, suggesting that inflation remains sticky, while U.S. private employers boosted hiring last month.The dollar was steady at 134.26 yen, although the Japanese currency was headed for a weekly gain of 1.5%, snapping three straight weeks of losses.Sterling climbed over a third of a percent to $1.2633 , reaching its highest level in almost a year. It was around 0.2% firmer at 87.44 pence per euroAnd the euro was marginally firmer at $1.1021, holding below recent one-year peaks. It came under selling pressure on Thursday after ECB on Thursday slowed the pace of its interest rate increases with a 25-basis-point rise and noted that past moves were having an impact on the economy.",
        "Although ECB President Christine Lagarde signalled more tightening to come, markets pared back their expectations on how much further rates would rise.The Aussie and the kiwi were among the largest beneficiaries of the sliding dollar, touching multi-week highs, though the kiwi later pared gains.The U.S. dollar meanwhile fell 1% to 10.58 Norwegian crowns , while the Swiss franc weakened after data showed Swiss annual inflation eased more than expected in April.The dollar was last up 0.64% at 0.8915 Swiss francs\"The U.S. dollar is weaker against all the G10 currencies today but the Swiss franc,\" said Marc Chandler, chief market strategist, at Bannockburn Global Forex.\"The backdrop seems fragile even though a few regional bank shares have done better in after-hours trading and Apple's earnings were received well by the markets.\"(Reporting by Dhara Ranasinghe; additional reporting by Rae Wee in Singapore Editing by Keith Weir, Kirsten Donovan)"
    ]
}