{
    "articleURL": "/health/article-12051491/The-NHS-left-burnt-working-Australia-like-constant-holiday.html",
    "content": [
        "Are you a UK medic who's moved Down Under? Email me:  laurence.dollimore@mailonline.co.uk British doctors and nurses who moved to Australia for better working conditions have blasted the UK for failing to improve the NHS while forcing their former colleagues into 'horrendous' strikes over pay. ",
        "Dr Michael Mrozinski, 37, told MailOnline today that he fears the NHS 'cannot be saved' after years of 'empty promises' to make working for the health service a more attractive option - most importantly by hiring more staff. The Glaswegian said staffing levels were already a shambles when he left for Down Under in 2016, and that he feels 'vindicated' for making the move after seeing them fall even further since. He also now gets paid double what he would in the UK, and says he is treated 'like a professional' in Australia and 'feels much more respected.' He is not alone, it seems, with scores of UK medics regularly posting on social media about their 'much happier' lives after moving to the other side of the world.  ",
        "While Dr Mrozinski has vented online about the stark differences between the two countries, his popular TikTok channel is more of an educational tool that sees him 'call out medical misinformation' to his more than 362,000 followers.  Speaking to MailOnline today, he said: 'I felt burnt out after working in the NHS for seven years... in Australia, management listen to my concerns and ideas for better patient care, whereas in the UK they couldn't care less about any ideas I had.' The doctor, who now lives in Melbourne, said he is 'encouraged to have a good work life balance and encouraged to leave on time', while in the UK 'it's expected that you stay late, with no thanks or appreciation.' ",
        "He added: 'The main difference is I enjoy my job is because the work environment is fantastic, the hospitals are well staffed and there are relieving doctors if wards are short. 'This makes for more people to share the workloads, instead of less people and more work, like in the UK. With more staff, means there is more teaching and helps doctors develop even further. 'In the UK, teaching sessions were often cancelled due to not enough staff to cover the work when teaching was supposed to happen!' Dr Mrozinski said he believes the 'the goodwill of the NHS workers has run out' and that 'they realise that the government isn't committed to making changes to pay or conditions.' He said he would encourage anyone to make the move as it would 'really open your eyes as to how healthcare workers are appreciated and valued.' He added: 'Australian healthcare plays the long game and realises that keeping workers happy and fresh, means they enjoy their job, do their best work and rarely need any sick leave. 'In the UK, most are on the verge of burnout, seeing too many patients in unsafe environments and needing time off due to stress - it's a shortsighted plan with no end game.' ",
        "The doctor said it was 'horrendous' to see his former colleagues striking across Britain.   ",
        "'Seeing the general public clap for healthcare workers during Covid but now calling them greedy for wanting pay restoration is appalling,' he said. 'Unfortunately, I saw this coming a long time ago and it's vindicated my reasons for leaving in 2016, and it's much worse now than it ever was. 'Who knows where it will be in another seven years…. I worry for my family and friends who still live in the UK, because the NHS, in its current state is not good for healthcare workers or patients and I'm not sure it can be saved.' Meanwhile, nurse Natalie Joyner said she has never looked back since making the move from the UK some eight years ago. The mother-of-five, 48, originally from Bournemouth, now works in the Women's &amp; Children's Hospital in Adelaide, and said she moved for a better lifestyle. She told MailOnline: 'My actual nursing role is very similar to my role in the UK as I worked in a NICU in England... The two big differences are the pay...'The pay is much better here, I probably get paid about double, and the nurse to patient ratio, that is much better here.' She added: 'Work life balance is better too. I love walking out of the hospital at the end of my shift and it still being warm outside, or waking up from a night shift and going out to my garden and having a swim in my pool, and lovely walks in the sunshine on the miles of sandy beaches. ",
        "'On my days off my favourite thing to is relax and read by the pool. I feel like I live in a holiday villa and on a constant holiday. 'A couple of my old work colleagues have expressed interest and I actually got one of them a job here and she moved over in January.' The latest figures show up to 40 per cent of the NHS workforce is looking to resign or retire in the next five years.It comes after a job advert this week emerged from recruitment firm Blugibbon Medical, looking for medics with A&amp;E experience and promising rates of more than £1,000 ($1,800 AUD) per shift - of which you only have to work 10 each month.",
        "As well as this, doctors who take up the offer are to be given a two-bedroom furnished apartment, use of a car and a bonus of up to £10,000 ($18,000 AUD) after one year.The advert, which is currently on the British Medical Journal (BMJ) careers website, notes that the salary would put the successful candidates in the top 5 per cent of Australian earners.It comes after tens of thousands of NHS junior doctors in England took to picket lines last month in pursuit of 'pay restoration', with many warning that medics in their droves are leaving the NHS to work for better pay, terms and conditions in Australia and elsewhere. ",
        "ARE YOU A UK NURSE OR DOCTOR WHO HAS MADE THE MOVE TO AUSTRALIA? Email laurence.dollimore@mailonline.co.uk In a video uploaded at the end of April, Dr Mrozisnki told his 362,000 followers: 'I saw the writing on the wall in 2015... I moved and I've never been happier. 'And it's not just the money, I get treated so much better, I get more respect in Australia.' He then fired a warning shot to the UK. Responding to a commenter who told him to 'stop crying' about working in the NHS, he said: 'I don't work in the UK anymore I work in Australia... I'm not crying! 'I love being a doctor in Australia, but there are 40 per cent of doctors in the UK that are actively looking to leave the NHS.",
        "'You'll be crying then when they do leave, you'll be the first one complaining about private healthcare, you'll be the first one complaining about long waits in the emergency departments, so, buckle up, it's coming!' Another Scot named Caitlin Stewart brands herself a 'travelling nurse' on TikTok.A recent video shows her enjoying a road trip in Australia with the caption reading: 'Eight week contract finished, time for a month off!' And nurse Jasmine Brownlow made the move to Australia about a year ago and often shares videos of her new life with her almost 50,000 followers on TikTok. ",
        "In one clip this week she is seen sipping on a cocktail with the caption reading: 'You move to Australia and a few days off work mean sipping cocktails at a beach club in Fiji.' In another video she wrote: 'Taking a year out of my life to travel and have new experiences has been the best thing I could have ever done.' Meanwhile, a teacher from Northern Ireland named Caroline has amassed more than 135,000 TikTok followers on her Acountydownunder account. ",
        "She moved to Australia seven years ago and is now flying back to the UK to help recruitment companies there snap up NHS workers, as well as education professionals. In a video uploaded to her TikTok account in March she says: 'For the past seven years I have been living in Sydney, Australia, and my life has been nothing but a dream. 'I work to live and not live to work... this year I'm going around the country, helping to recruit nurses to Australia, because on a daily basis on my Instagram, people always ask me how to make the move, so now I'm coming to venues near you to tell you just how amazing it is in person.' It comes as the recent job advert calling for Brits to move to Australia makes reference to former doctor Adam Kay's popular book and TV series This Is Going To Hurt.The online advert states: 'A&amp;E Registrar sick of the NHS? This isn't going to hurt…'. And a picture of a paper advert, shared by Dr Kay on Twitter, also references his piece, saying: 'Got that Dr Adam K feeling? Come to Australia!'The advert says it is looking for 'a couple or two friends' for the jobs on offer who have had four years' experience, including in accident and emergency, since graduating from medical school. It states that the 'best part' about the job is only working five night shifts in a row, twice a month — meaning the successful candidate is off the rest of the time to 'travel or enjoy one of the world's most liveable (and cost-effective) cities'. Dr Kay called the advert 'depressing' and suggested that the Government address junior doctors' pay concerns or face them leaving the NHS.He wrote: 'How depressing to see this in the BMJ. It's hard to say those figures don't present a compelling argument. ",
        "'It all leads to a big question for the govt: if you don't address doctors' very reasonable pay concerns, alongside their conditions and wellbeing, guess where they're going?'On the BMJcareers website, the job posting promises an annual salary of A$240,000 (£127,600) and requires medics to commit to the role for 12 months. This includes A$2,000 (£1,064) per shift and a A$10,000 (£5,2899) to A$20,000 (£10,632) bonus after one year. The positions would be based at private hospital Brisbane Northside Emergency — which is located in the northern suburbs of Brisbane, Queensland. Those who are successful will work five night shifts (9pm to 7pm) in a row twice a month and the rest of the month they will be off. There are no on-call requirements but optional extra shifts are available if wanted. The ad claims wait times at the emergency department are just four minutes per patient. For comaprison, one in five patients in England were waiting more than 12 hours to be seen by an NHS doctor in April, latest official figures show.The attractive Aussie offer comes weeks after junior doctors carried out a four-day strike over the 26 per cent real terms pay cut they have faced over the last 15 years.One junior doctor shared his payslip on Twitter amid the strikes, showing his take home at the end of his second year was just £1,823 for the month — less than just two shifts alone at the Australian private medical centre.British Medical Association (BMA) chiefs, who organised the unprecedented four-day walk-out, are demanding a 35 per cent pay rise, which could be worth up to £20,000 extra for some medics. The Government has branded current demands 'ridiculous'. Downing Street has insisted there will be no talks unless junior doctors abandon their starting position of a 35 per cent pay rise and call off the strikes. However, the BMA, which represents 45,000 junior doctors in England, has countered that Government should 'get into the room and discuss pay restoration – whether that means 35 per cent or not'.In January, junior doctor Edward Bridge told the i how he and his partner, who is also a doctor, moved to Brisbane in 2018 in search of a 'better work-life balance'.The 29-year-old said they had become 'fed up' with low pay, antisocial working hours and feeling burnt out.'The only way to incentivise people to come back is to make working conditions better and safer for doctors,' he said. 'Part of that is also paying them more.'He added that it is 'pretty horrendous' working in an under-staffed A&amp;E, and described working in the NHS as 'difficult, frustrating and demoralising'.Dr Bridge said he had never intended to move to Australia as he resonates with the values the NHS was built upon, however the 'traumatic' experiences he had as a junior doctor in the UK changed that.",
        "'You look at your paycheck after a couple of difficult months when you've been doing nights, weekends and suddenly you're like, 'why am I doing this to myself when there is a better option, there is a better lifestyle out there',' he added.That same month it was revealed a husband-wife doctor duo had also made the move because of pay and the fact the NHS is a 'pressure cooker'.Dr Arpita Ghosh and Dr Amit Saha left the UK for Perth, Australia, in 2018 - tempted by better pay and working conditions.They told the Evening Standard that Australia offers autonomy and flexibility, which is 'important for someone who has a family'.Dr Ghosh, a consultant obstetrician and gynaecologist who trained at Kings College London, thanked the NHS for #making me the doctor I am' but admitted it is now 'crunched'.'The NHS is a pressure cooker,' Dr Ghosh added. 'There is no comparison between your work-life balance in the Australian system compared to Britain.'Pay also matters and there is a huge disparity between what is offered in both countries.'It's not just doctors that are fleeing the UK in search of attracting Australian job offers though, as Scottish nurses revealed they have tripled their wage since moving there.Laurel Dyer, 28, from the Isle of Mull, Scotland, moved to Australia last year and has undertaken roles in Western Australia and New South Wales - while fulfilling her love for the outdoors.Ms Dyer, who is employed by a nursing agency, told The Times her income was around triple what she earned back home and revealed some of her Scottish nursing colleagues have followed her lead.'They came at a very similar time to me and are loving it out in Australia,' she said.'I think the friends that are still at home are more settled in their life, but they are very envious of the job, the money, the lifestyle of Australia.'I think if it wasn't for those roots there, they would probably be out in a heartbeat.'"
    ]
}