{
    "articleURL": "/sport/football/article-12056187/Man-Uniteds-Amad-Diallo-set-head-loan-season-hit-Sunderland-spell.html",
    "content": [
        "Man United's Amad Diallo has been tipped for a foreign loan move next seasonThe 20-year-old has impressed, scoring 12 times for Championship SunderlandThe Ivorian winger could find his way to the Dutch top-flight due to his physique Manchester United's Amad Diallo could spend next season on loan at a foreign club after a strong spell at Sunderland this season.",
        "Diallo, 20, has been on loan with the Black Cats this season, scoring 12 goals in 36 matches for the Championship club. The Ivorian winger has been a success in the second tier, but may find his opportunities limited with Erik ten Hag's Manchester United in the upper reaches of the Premier League. Therefore, The Sun suggest that he might be making another loan move, this time to a foreign league in Holland or somewhere similar.Holland's Eredivisie has been touted as an option because it is a less physical league, which allows a slight player like Diallo to develop. ",
        "But Manchester United think the Ivorian has a long-term future at the club, with his contract running until 2025, and want to secure another loan deal, not a sale.Diallo was born in the Ivory Coast, and raised in Italy, making his breakthrough in Serie A with Atalanta, scoring on his senior debut in 2019.In 2021, Man United purchased him for £37m, and he has enjoyed loan spells at Rangers and Sunderland since then. Last month, ten Hag hailed Diallo's 'progress' at Sunderland, but said he had 'reservations' about the Ivorian's role with Man United next season.Ten Hag said: 'Young players need experiences, and when we decide for him to come back, he has to be a player who can compete for the starting XI or minimum to come on for a lot of games and make an impact.'",
        "Diallo has been thriving at Sunderland, earning a nominee for the Championship's Young Player of the Season award. Sunderland boss Tony Mowbray warned Man United not to let the young talent be lured away by another big club.He said: 'I have a good feeling for Amad that if he's not back at United he will go for big, big money to a top Spanish team. He loves football and wants to play so what do you do if you are at Manchester United?'Are you happy just to be a Manchester United player and play six sub appearances and two starts over a season of 60 games for them? Or do you want to go out and play?",
        "'So are they going to sell him? If they do they will want to recoup their money which was reputedly 40 euros or whatever it was.'I would suggest they would try him at another level and he'd go (on loan) to the Premier League, or go back to Italy or Serie A or Spain.'Manchester United look to boost their chances of a Champions League spot with a trip to West Ham on Sunday evening - having already secured the Carabao Cup and a place in the FA Cup final.Sunderland sit in 7th place in the Championship, but could still make the playoffs if the results fall their way on the final day of the season. They travel to Preston on Monday, knowing a win would put them in contention for the final round of games. "
    ]
}