{
    "articleURL": "/tvshowbiz/article-12045531/Love-Islands-Zara-Deniz-Lackenby-Brown-turns-heads-revealing-mesh-catsuit-night-out.html",
    "content": [
        "Zara Deniz Lackenby-Brown turned heads in a revealing ensemble during  a busy night out in London on Wednesday.  ",
        "The TV personality, 25, who was dumped from the Love Island villa on day 16, slipped into a mesh catsuit.  Showing off her figure in the skin-tight number, she boosted her height with a pair of strappy black heels and accessorised with a chain strap shoulder bag. Zara draped a light pink fur coat over her shoulders as she departed Cirque le Soir Night Club and flashed a smile for the cameras. Continuing on with her night, she then headed over to the House Of Sims streaming party at Jin Bo Law sky bar to celebrate the release of new reality show. ",
        "The Sims siblings followed closely behind with Demi wearing a denim mini dress with a matching cropped jacket. Making her way to the event, she was joined by her sister Frankie who wore a busty satin dress with a long denim trench coat.  Zara's outing comes after she responded to claims she faked romance with ex beau Jordan Odofin - saying she doesn't need a man for fame.The Love Island star admitted she is now living her best single life and has lots of guys sliding into her DMs.The model started dating former co-star Jordan after leaving the villa - but the two were quick to go separate ways just after a few weeks.",
        "Fans accused the pair of 'faking' their relationship but Zara hit back to the false claims saying they had nothing to lose in getting to know each other.'What a lovely boy, I can't fault Jordan - we were dating and like when you just realise that there is not that romantic spark but it's all good, we're friends.'Zara added her and Jordan, 28, are in great terms and want the best for each other and they had no reason to 'fake' anything.",
        "'It wasn't fake - I heard that rumour. Someone said he said that, he never said that. Why would we fake it? We have nothing to fake,' she said.The model went on saying she was grateful the pair shared an experience together as they couldn't meet in the villa before, but it just wasn't meant to be.But it appears Zara has a lot on her plate as she admitted she is living her best life as a single woman - and has a lot of hot single guys bombing her DMs.'I few eligible bachelors in the DMs but I'm focusing on myself right now, yes some famous people - but that was my life before, I had guys in my DMs before so that's nothing new for me,' she said. "
    ]
}