{
    "articleURL": "/wires/ap/article-12057827/Hamlin-bumps-Larson-lead-final-lap-win-Kansas.html",
    "content": [
        "KANSAS CITY, Kan. (AP) - Denny Hamlin had walked out of victory lane after winning a thrilling NASCAR Cup Series duel over Kyle Larson with a last-lap pass at Kansas Speedway on Sunday just in time to hear his crew chief, Chris Gabehart, make a bold proclamation.",
        "\"He's the most talented race car driver in the world,\" Gabehart was saying.Awkward, because Gabehart wasn't talking about his own driver.\"Tells you what he thinks about me,\" Hamlin said with a wry grin.Gabehart was talking about Larson, who was leading in the closing laps on a sizzling day in the heartland. But it was Hamlin who was better this time. He spent about 30 laps stalking Larson before making a couple of failed attempts at the lead in the closing laps. Finally, heading onto the backstretch on the final one, Hamlin pulled alongside Larson and made the slightest of contact, sending him bumping into the outside wall and giving Hamlin a clear path to the finish line.The victory ended a 33-race winless drought for Hamlin dating to last year's Coca-Cola 600. And along with giving Hamlin a record fourth win at Kansas, it gave Joe Gibbs Racing its 400th win overall in NASCAR's top series.",
        "\"I was sideways. He was sideways. I knew it was going to be close whether he could clear me,\" Hamlin said. \"I was grinding his left side, trying to keep the side-draft as much as I could. It's such a super-sensitive part and I hooked him at the end.\"Hamlin said he planned to speak with Larson about the finish at some point.",
        "\"I was really loose,\" Larson said. \"He was able to finally get my inside off two. It seemed he was side-drafting me aggressively. I don´t know if he finally got me turned sideways, but turned me into the outside wall and he got the win.\"So what does Gabehart think of his own driver?\"I'm so proud of Denny to work over - in my view - the most talented race car driver in the world,\" he said.Larson finished second and William Byron, who was two laps down for more than 50 laps during the middle portion of the race, rallied to join his Hendrick Motorsports teammate in the top three. Bubba Wallace, who won the fall race at Kansas, was fourth while Ross Chastain rounded out the top five before tempers flew on pit road.Chastain, who has drawn the ire of many drivers this season with his aggressiveness on the track, found himself in another heated confrontation Sunday. He had gotten into Noah Gragson with about 60 laps to go and sent him for a spin, and Gragson walked up to the Trackhouse Racing driver afterward to make his displeasure known.Gragson put his hands on Chastain, who responded with a sweeping right hook that appeared to connect. Gragson tried to return the punch, but he was pulled away by security and NASCAR officials.",
        "\"I'm sick and tired of it,\" Gragson said of Chastain's driving style. \"The guy runs into everyone. When you have guys like Chase Elliott and other guys telling you to beat his ass, everyone is just sick of him.\"Chastain accepted some of the blame for the spin but didn't have much to say about the punch.\"I got tight off four for sure,\" Chastain said. \"Noah and I have a very similar attitude on the race track. We train together, we prepare together, we know every little bit about each other. I definitely crowded him out of four.\"Kyle Busch had railed against Chastain over the radio before crashing out of the race on a restart. Afterward, Busch seemed to take aim at the performance of the Next Gen car, which he said made it too difficult to pass.\"Not racing like it once used to be,\" he said after dropping an on-air expletive. \"You´re faster than a guy, you run him down three-tenths a lap and you stall when you get there. Part of it´s the car. They can aero block you, pinch you, burn up your tires and do everything else to hold their position and then you get passed from behind. Very frustrating.\"STAGE WINNERSHamlin took the opening stage for his second of the season, and Martin Truex Jr. finished second after his win in last Monday's rain-delayed race at Dover. The top four spots and six of the top seven in the stage belonged to Toyota.",
        "The second stage ended in a mess when a caution flew and the leaders pit with eight laps to go. Joey Logano took the lead, tying the Kansas Speedway record with the 26th change in the race. And when the green flag dropped, Busch jammed behind a four-wide move and went for a spin, bringing out another caution and giving Logano the stage win.PENALTY SITUATIONTyler Reddick's car failed inspection twice on Saturday, resulting in the ejection of car chief Michael Hobson, while Brennan Poole lost car chief Dave Jones when his car also failed twice. Ricky Stenhouse Jr. started at the back after having to change his water pump gauge and Corey LaJoie joined him in the rear after making some pre-race adjustments.UP NEXTNext week is the \"Throwback Weekend\" at Darlington, and it's increasingly become a family affair. Elliott's No. 9 car for Hendrick Motorsports will look like his father Bill Elliott's car from 2003; Ryan Blaney's No. 12 will pay homage to father Dave Blaney's old sprint car; and the No. 21 of Harrison Burton will look like father Jeff Burton's old paint scheme.___AP auto racing: https://apnews.com/hub/auto-racing and https://twitter.com/AP_Sports"
    ]
}