{
    "articleURL": "/tvshowbiz/article-12049885/Millie-Bobby-Brown-puts-leggy-display-cropped-red-ord-cowboy-boots.html",
    "content": [
        "Millie Bobby Brown was all smiles on Friday as she attended the opening of Osaka Comic Con in Japan.",
        "The Stranger Things actress, 19, put on a leggy display in a cropped red co-ord for the ceremony, which consisted of a studded jacket and hot pants.She also donned a matching blazer and cowboy boots, revealing her slim figure and washboard abs.Millie, who recently got engaged to boyfriend Jake Bongiovi, swept her brunette tresses into an up do for the event, which celebrates comic book characters. The beauty also broke a sake barrel with Danish actor Mads Mikkelsen, symbolising new beginnings and the future to come.",
        "Millie looked in good spirits, smiling and waving at the crowds as the event began.It comes after Millie put on a kooky display as she arrived in Milan with Jake at the end of April. The actress donned a comfy purple Rotate tracksuit and grinned at Jake, strolling through Milan Malpensa airport and a crowd of fans.She also made the quirky decision to put a box on her head with a face on it as she prepared for her Stranger Day meet and greet with fans at the Alcatraz in the city.The beauty looked at her fiancé lovingly as they stepped out together. Millie wore her light brown locks in an up do, later changing into a white blazer and skirt for her event.",
        "She also donned a pair of black and silver boots, adding inches to her height. The beauty, who got engaged to Jake in early April, previously flashed her stunning engagement ring on Instagram.",
        "The Stranger Things star took to social media  to share how she will be launching a new coffee range through her beauty brand Florence By Mills, which she said was a venture she's been dreaming of 'ever since [she] can remember.'After teasing the new business, which will add to her £11 million acting fortune, Millie blew a kiss to the camera that showed off her ring, which is estimated to have cost 20-year-old Jake a whopping £120,000.While she is best known for her role as Eleven in Netflix's supernatural hit Stranger Things, Millie is a savvy businesswoman too thanks to her brand which also has a make-up line and a forthcoming fashion collection.Millie highlighted her natural beauty in the video as she wore light touches of make-up and styled her brunette locks in a slicked-back look, the actress complemented her ensemble by accessorising with pendant earrings and a matching necklace.In the caption of her video, Millie wrote: 'If you know me, you know I can't start my day without my morning coffee! I'm so excited that I can finally share Florence By Mills Coffee with you all! ",
        "'We have had so much fun creating and sampling the delicious coffee and I can't wait for you all to try the launch collection!'Be sure to follow the @florencebymillscoffee account for all exclusive updates and sneak peeks! Looking forward to all of our coffee chats together! Xoxo Mills.' Millie announced her engagement with a post showing off her glimmering rock in a monochrome picture.",
        "She penned in the caption: 'I've loved you three summers now, honey, I want 'em all'.While Jake also shared an announcement post to his own page, simply writing 'forever' alongside two snaps of the couple.Celebrating the joyous news, the smitten couple took part in a beachy photoshoot - with Millie dressed in a crochet dress while Jake donned a cream polo shirt. The announcement confirms some speculation that has been circulating on social media over recent weeks, after she flashed a glimpse at the ring in a recent post. Posing behind the wheel of a convertible car in a picture last month, Millie looked away from the camera and lifted her hand in the air, showing the prominent diamond ring on her finger. While she also sparked rumours in August when she was seen wearing a gold diamond ring on her wedding finger during a PDA-packed outing. ",
        "Sharing that they had spent 'three summers' together in the announcement post, it comes after the actress recently dished the dirt on how she and Jake met.",
        "Millie explained they connected on Instagram and became friends through the platform, before romance was sparked.Answering the internet's most searched questions about her, she said: 'We met on Instagram. And we were friends for a bit, and then, what can I say?'She introduced Jake to her 62.7M followers in June 2021 with a cute photo of him posted to Instagram, but it wasn't until she posted a picture of him planting a kiss on her cheek that they were 'Instagram official.' Millie called Jake her 'partner for life', in a gushing post where she shared a series of pictures of the couple back in January 2023. "
    ]
}