{
    "articleURL": "/femail/article-12059893/Do-know-sticker-Imperial-Leather-for.html",
    "content": [
        "The original Imperial Leather soap bar was first launched in the 1930sRead More: People are only just finding out what the H on lampposts means Debate has raged for years over the real reason for the label on the Imperial Leather bar of soap.",
        "The sticker is known for remaining secure even after weeks of use as the bar slowly wears away- with many fans joking they wish they had a 'relationship as strong'.But now it's been revealed that the scratchy metallic label is actually a stand to stop the bar sticking to the soap dish.One person took to Twitter to say: 'If the relationship isn't as strong as that sticker on Imperial Leather soap I don't want it.Another quipped: 'I want my love to feel like what Imperial Leather has with that sticker, bond unbreakable.'",
        "While someone else gushed: 'Whatever you're going through, may you have the strength to endure triumphantly and unscathed to the very end, like this imperial leather sticker.' Another confused person wrote: 'How does the sticker stay on Imperial Leather bars of soap right to the end?' To which someone replied: 'I believe you're supposed to have it in your soap dish/on the sink with label side down. Stops soap getting a 'soggy bottom''. It's clear the debate has raged for years after one fascinated person took to Reddit in 2019 and said it 'amazed' them how it managed to stay in place for so long.'You have no idea how many times I've sat in the bath and stared at this sticker in amazement that it sticks to the soap 'till the very end, Please enlighten me,' they asked. ",
        "However he was hit with a mind-blowing revelation about its real purpose. A commenter explained that the sticker is meant to be used as a mini soap stand, and that the bar should be placed with the label facing down. ",
        "Many discussed how nostalgic the soap was for them, reminiscing about seeing it in their grandparents' bathrooms, whereas others were determined to uncover the truth.'I don't know what glue they use, but I was always told that the sticker is meant to substitute for a soap stand, and should always be downwards,' revealed one.'Well ****** me with a bar of soap! That makes perfect sense, I've been an imperial guy for years and never thought of that so I just went and 'flipped my soap' and it works, thanks!' one amazed reader responded.Some suggested that the label itself was magnetic and helped it to stick.'Older bathrooms used to sometimes have a chrome thing mysteriously fixed to the wall over the bath. 'It was magnetic and I think the the metal label on the soap stuck to it, thus removing the need for a gooey soap dish. Seemed like a good idea at the time,' said another.",
        "Imperial Leather confirmed to MailOnline that apart from brand identity the 'sticker on the top is for a long lasting bar and preventing mushiness'. ",
        "The brand explained: 'Besides the brand identity, the sticker on the top is for a long lasting bar and preventing mushiness. 'When the soap is used, the sticker will make and keep the top surface, where the sticker is on, concave. 'After use, the soap is supposed to be upside down. The concave surface will help water run out from the bar and minimise the touching surface on a soap tray.'Imperial Leather was initially a scent first created in 1798 by Royal London perfumery Bayley's of Bond Street, which was visited by Russian nobleman Count Olaf, who requested they create a fragrance reminiscent of the distinct aroma of the Russian Courts. It was named 'Eau de Cologne Imperiale Russe', and became his favourite fragrance.Cussons &amp; Sons eventually took over Bayley's of Bond Street, which included the acquisitions of original fragrances, in 1930 they launched their first Imperial Leather soap based on the scent. "
    ]
}