{
    "articleURL": "/wires/reuters/article-12043107/European-shares-end-higher-eyes-Fed-oil-stocks-fall-second-day.html",
    "content": [
        "STOXX 600 index closes up, oil stocks fall",
        "UniCredit up on strong Q1 earningsEuro zone unemployment falls to 6.5% in March(Updates with prices to close, new analyst comment, euro zone unemployment data and details on individual stock performances)By Shreyashi SanyalMay 3 (Reuters) - European shares climbed on Wednesday, a day after their biggest fall in a month, as speculation mounted the U.S. Federal Reserve might deliver its last interest rate hike, while energy stocks extended declines.The pan-European STOXX 600 index ended up 0.3%, after closing at its lowest level in one month on Tuesday.The oil and gas sector dropped 0.8% as crude prices continued to fall on worries about the health of the U.S. economy and its impact on demand.But focus remained squarely on the Fed, which is expected to raise rates by a quarter of a percentage point at 1800 GMT (2 p.m. ET), and signalling a possible pause in its 14-month tightening cycle.Fed Chair Jerome Powell is scheduled to speak to reporters half an hour later.\"Tonight is expected to see the final rate hike of the current cycle before the Fed moves into its pause period,\" said Chris Beauchamp, chief market analyst at online trading platform IG.\"This is the base case, and if we see a more hawkish FOMC tonight then the tentative gains in stocks this afternoon could slip away.\"",
        "The STOXX 600 closed April on strong footing, even outperforming Wall Street's S&amp;amp;P 500 index as focus turned to earnings and a rate decision from the European Central Bank (ECB) on Thursday.The ECB is seen raising rates by 25 basis points, with recent data pointing to banks sharply turning off credit taps making a case for a smaller hike than recently.Separately, a report showed euro zone unemployment rate fell to 6.5% in March, pointing to a further tightening of the labour market.Among stocks, Stellantis, the world's third-largest carmaker by sales, fell 1.9% after it sounded cautious on the rest of the year, with its vehicle inventories growing.Italy's UniCredit gained 3.8% as the lender raised its financial targets for the year after it posted stronger-than-expected first-quarter earnings.Deutsche Post added 1.1% after the German logistics company reported first-quarter operating profit above expectations.Signify, the world's biggest lighting maker, dropped 9.1% on missing quarterly core profit expectations, while Deutsche Lufthansa AG fell 1.3% after it reported revenue below market expectations.British education group Pearson jumped 10.1%, after plunging nearly 15% in the last session, as BofA Global Research double upgraded its stock to \"buy\" from \"underperform\". (Reporting by Shreyashi Sanyal in Bengaluru; Additional reporting by Shubham Batra; Editing by Sonia Cheema and Mark Potter)"
    ]
}