{
    "articleURL": "/femail/article-12052325/Im-eco-activist-use-LEAVES-toilet-paper.html",
    "content": [
        "Rob Greenfield, 36, was raised in Wisconsin but now lives in FloridaHe is raising awareness for his Grow Your Own Toilet Paper InitiativeThe goal is to get people to use leaves instead of store-bought toilet paperAn environmental activist who uses leaves when he goes to the bathroom is demonstrating how everyone can grow their own 'toilet paper' to save on waste. ",
        "Rob Greenfield, 36, was raised in Wisconsin but now lives in Florida, where he has embarked on a two-week tour of the state's major cities to raise awareness for his Grow Your Own Toilet Paper Initiative.The goal is to encourage people to use green leaves from the blue spur flower plant — also known as the 'toilet paper plant' — in the bathroom instead of stocking up on store-bought toilet paper. 'I want to show people that another way is possible,' he told People. 'We live in this consumer culture where most of us don't really know where things come from, how they get to us, and what the impact it is that it has on the earth. And toilet paper's no exception. We just buy it at the store and we never think twice about it.'",
        "Greenfield, who calls the leaves the 'Charmin of the garden,' kicked off his tour in St. Pete on April 29 and will end it in Miami on May 9. As part of the campaign, he is parking his compost toilet in bustling areas of each city with his toilet paper plant on one side and packages of store-bought toilet paper on the other to grab people's attention — and hopefully get them to ask questions. ",
        "'It's really a way to catch people in the moment. They'll say, \"Whoa, you can do that? You can grow your own toilet paper?\"' he said. 'And then I share with them that this is possible and that it's possible for us to grow so many things that can break us free from consumerism.'He is also handing out cuttings to people who live in warm climates such as Florida and mullein seeds to those who are in areas that experience freezes, so they can grow their own toilet plant trees. Greenfield explained on his website that when he moved to Orlando in 2018, he planted two cuttings of the toilet paper plant that a friend gave him. ",
        "'Within one year I had a TP bush abundant enough to support a family of five, plus cuttings to share with hundreds of friends each year so they could grow their own TP too!' he wrote. Not only are the leaves environmentally friendly, but he insisted there are also other benefits to using them instead of traditional toilet paper. According to Greenfield, the leaves smell like mint and are 'softer than many toilet papers on the market.' They are also 'strong and durable' enough that 'your fingers will not break through when wiping.' 'The leaves often grow about the same size as a store-bought piece of toilet paper,' he explained. 'On dewy mornings, these furry leaves hold onto moisture. So the TP Plant doubles as a wet wipe!'",
        "Using leaves also reduces the energy needed to manufacture and distribute toilet paper while saving money. The average American goes through roughly 141 rolls of toilet paper each year. ",
        "The only downside to the toilet paper plant? You can't flush the leaves. 'If you have a flush toilet, you can place a small bucket next to your toilet to place your used leaves. Then take them outside and compost them,' he advises on his site. Greenfield is an advocate for composting, but the dirty leaves can also be thrown into the garbage. When it comes to saving the environment, he is known for going to extremes to get his point across. Over the past decade, he has lived with just 44 possessions, bathed in only natural water resources, gone dumpster diving for food, and worn a plastic suit filled with his own garbage to encourage sustainable living. Greenfield told People that his ultimate goal is to get people to grow their own toilet paper and then start composting their poop to prevent water pollution, avoid freshwater waste, and build the soil to help feed more people. 'When people say things like, \"Oh, by wiping your butt with a toilet paper plant, you're going back to the past,\" I'm like, \"No, I'm taking us into the future, a future that is actually living in harmony with the earth in a way we're connected to it. And in a way where we aren't dependent upon corporations to wipe our butts for us,\"' he said."
    ]
}