{
    "articleURL": "/wires/ap/article-12039123/Groups-sue-federal-officials-manatee-protection.html",
    "content": [
        "MIAMI (AP) - Several conservation groups announced Tuesday that they're planning to sue federal wildlife officials, citing a failure to protect the West Indian manatee following record death rates in recent years.",
        "The Center for Biological Diversity, Harvard Animal Law &amp; Policy Clinic, Miami Waterkeeper and Frank S. González García filed a notice of their intention to sue the U.S. Fish and Wildlife Service. The notice is required by law before suing a federal agency.The legal notice follows a November petition urging FWS to reclassify the species from threatened to endangered under the Endangered Species Act. The conservation groups said FWS was required by law to determine within 90 days whether the petition presents substantial information indicating the reclassification may be warranted. No findings have been issued yet, even though more than 150 days have gone by, the groups said.\"I´m appalled that the Fish and Wildlife Service hasn´t responded to our urgent request for increased protections for these desperately imperiled animals,\" Center for Biological Diversity attorney Ragan Whitlock said in a statement. \"It´s painfully clear that manatees need full protection under the Endangered Species Act, and they need it now.\"Manatees are gentle, round-tailed giants sometimes known as sea cows that weigh as much as 1,200 pounds (550 kilograms) and can live as long as 65 years. Manatees are Florida´s official state marine mammal but are listed as a threatened species, with many dying from starvation due to pollution-fueled algae blooms killing the seagrass they rely on for food. They also face peril from boat strikes and toxic red tide algae outbreaks along the state´s Gulf coast. Their closest living relative is the elephant.",
        "Since having their legal protections reduced in 2017 when the species was reclassified as threatened instead of endangered, manatee numbers have declined dramatically, conservationists said.",
        "Fueled by wastewater treatment discharges, leaking septic systems and fertilizer runoff, algae blooms can become so thick that seagrass can´t get the sunlight it needs to survive, jeopardizing the manatees´ main food supply. That's contributed to the deaths of nearly 2,000 manatees in the past two years, representing more than 20% of all manatees in Florida, the groups said.An FWS spokesperson said the agency doesn't comment on proposed or pending litigation."
    ]
}