{
    "articleURL": "/sport/mma/article-12058057/Mark-Zuckerberg-stuns-onlookers-two-incredible-results-Brazilian-jiu-jitsu-tournament.html",
    "content": [
        " Mark Zuckerberg enters first BJJ tournament Meta boss wins gold and silver medals Zuckerberg has keen interest in combat sportsFacebook founder and Meta CEO Mark Zuckerberg has shocked martial arts fans by winning both gold and silver medals in his first ever Brazilian jiu-jitsu tournament.",
        "The world-famous tech giant, 38, proved he has serious grappling skills in his first BJJ competition by winning medals in both the Gi and No-Gi disciplines - the Gi being the loose-fitting uniform of heavy fabric tied with a belt that's often worn by competitors.Zuckerberg proudly shared photos from the tournament on his official Instagram account but did not divulge the name of the competition.'Competed in my first jiu jitsu tournament and won some medals for the Guerrilla Jiu Jitsu team,' he wrote. 'Thanks to @davecamarillo @khaiwu @intense0ne for training me!'Zuckerberg told Joe Rogan in 2022 that he became very interested in mixed martial arts during the Covid-19 pandemic, and has since been training in the various aspects of the combat sport.",
        "'I really like watching UFC for example, but I also like doing the sport,' Zuckerberg said on the podcast.'There's something so primal about it, I don't know … Since then I've just introduced a bunch of my friends to it—we train together, and we like, wrestle together, and there's a certain intensity to it that I like.'The Meta boss has also been seen sitting ringside at UFC events and seems to have developed a friendship with UFC boss Dana White. In 2022, Zuckerberg posted footage of himself sparring with mixed martial artist Khai 'The Shadow' Wu ahead of the fighter's UFC debut.",
        "The video, which attracted hundred of thousands of likes, quickly went viral and drew comments from many big names in the fighting world.'This is great!' Joe Rogan commented. 'I'm so happy to see this. Training looks solid too!'Brazilian Jiu Jitsu practitioner Bernardo Faria commented, 'Amazing!!! Half guard, arm-bars, triangle! Super cool!''That's dope,' UFC grappler and three-time World Jiu-Jitsu champion Gilbert Burns wrote.",
        "'Yo!!! F***ing awesome Mark,' former UFC champion Conor McGregor commented on the post.Zuckerberg has explained that training is 'really important' to him and helps to maintain his 'energy level and focus'.'It's because I have a connection to it,' he said. 'Since COVID, I got super into surfing and foiling, and then really into MMA. I know a lot of people who do it.'MMA is like the perfect thing because it's like, if you stop paying attention for one second, you're gonna end up on the bottom.'Brazilian Jiu-Jitsu has become very popular with celebrities in recent years, with the likes of Tom Hardy, Russell Brand, Henry Cavill and Guy Ritchie posting about their interest in the sport."
    ]
}