{
    "articleURL": "/wires/afp/article-12059225/Zelensky-says-Russia-defeated-Nazism-was.html",
    "content": [
        "President Volodymyr Zelensky vowed Monday that Russian forces would be defeated in Ukraine just as Nazi Germany was beaten in 1945, during an address commemorating the end of World War II.",
        "His speech recorded at a war memorial in Kyiv comes one day ahead of Victory Day in Moscow, a Soviet war anniversary to be marked by an army parade through Red Square with security on high alert.Ukrainian forces meanwhile said they had downed nearly three dozen Russian attack drones, spurring explosions and air raid sirens in the capital overnight.\"All the old evil that modern Russia is bringing back will be defeated just as Nazism was defeated,\" Zelensky said in a video at Kyiv's World War II memorial.\"Just as we destroyed evil together then, we are destroying a similar evil together now.\"Zelensky was speaking on the anniversary of Nazi Germany's surrender to allied forces on May 8, 1945, Victory in Europe Day.",
        "He said he had submitted a bill to parliament to formally commemorate World War II in Ukraine also on May 8, which for years was marked on May 9 like in Russia and other ex-Soviet countries.It is the latest in a series of steps taken by Ukraine in recent years to distance itself from Moscow, including by renaming streets and towns named after Soviet figures.Zelensky said Ukraine would also mark a separate Europe Day on May 9, which promotes peace and unity on the continent.",
        "- 'Always scary' -The EU welcomed the move and said European Commission head Ursula von der Leyen would visit Kyiv for talks with Zelensky on Tuesday.Ahead of the visit Brussels proposed a fresh round of sanctions on Russia. A spokesman said the measures would seek to tackle \"the evasion of sanctions\".The Kremlin has leaned on World War II rhetoric to justify its invasion, saying in February last year it was launching the war to \"de-Nazify\" Ukraine.",
        "But the Ukrainian leader said the Kremlin was responsible for \"aggression and annexation, occupation and deportation,\" as well as \"mass murder and torture\".\"All of this will be answered by our victory -- the victory of Ukraine and the free world.\"In Kyiv, Mayor Vitali Klitschko said Russians had overnight launched nearly 60 drones, 36 of them in the direction of the capital. The attacks wounded five people, he said.AFP journalists saw a gutted apartment damaged by debris in the Svyatoshynsky district of the capital.Vadym, a 47-year-old resident, said he heard air raid sirens and the shaking of his neighbouring building when the debris hit.\"We've been at war for a year. It's always scary. Not as scary as on the front line. But of course it's scary. Terrible for children,\" he told AFP.",
        "- Phosphorus munitions -",
        "He said his own children had just arrived for a visit hours before the attack.In the southern region of Odesa, officials said a Russian strike had hit a warehouse, leaving one dead and several injured.The Russian army also targeted a village in the southern region of Kherson, wounding six civilians including a nine-year-old boy, authorities said.In the eastern Donetsk region, Ukraine accused Russian forces of deploying phosphorus munitions in Bakhmut, the epicentre of fighting for several months.Yevgeny Prigozhin, the chief of Russian mercenary outfit Wagner, said on Monday that his forces in Bakhmut had begun to receive badly-needed ammunition.In a series of profanity-laced videos, Prigozhin last week accused Russian Defence Minister Sergei Shoigu of withholding supplies.Victory Day, a key event on the Russian political calendar under President Vladimir Putin, is going ahead despite a series of recent sabotage attacks in the country.Military parades in more than two dozen Russian cities have been cancelled over security concerns, as well as in hubs controlled by Russian forces on the annexed Crimean peninsula.Armenian Prime Minister Nikol Pashinyan announced Monday he would visit Moscow for Victory Day events despite growing frustration at home over Russia's role in Yerevan's standoff with historic rival Azerbaijan.",
        "The leaders of Kazakhstan, Kyrgyzstan, Tajikistan and Uzbekistan are also expected to attend the celebrations in Moscow.The Kremlin said following talks between Putin and Kyrgyzstan President Sadyr Japarov on Monday that Russia will expand its military installations in the Central Asian ally."
    ]
}