{
    "articleURL": "/wires/reuters/article-12044149/LIVESTOCK-CME-live-cattle-futures-extend-setback-six-week-low.html",
    "content": [
        "By Tom Polansek",
        "CHICAGO, May 3 (Reuters) - Chicago Mercantile Exchange live cattle futures tumbled to a six-week low on Wednesday, extending a setback from an all-time high last month as technical selling and long liquidation hit the market, brokers said.Losses in equities also pressured cattle futures amid concerns that weakness in the U.S. economy could depress demand for beef.The front-month live cattle contract has pulled back 9% since supply worries pushed futures to their record high on April 13. Brokers said the market had become overbought.\"We pumped a lot of air and upside into the cattle in the recent run,\" said Matt Wiegand, commodity broker for FuturesOne. \"The path of least resistance was down in the absence of any fresh bullish news.\"The most-active June contract finished down 1.250 cents at 161.650 cents per pound. The front-month contract reached its lowest price since March 22.Feeder cattle futures also closed lower at the CME, with the August contract dropping 2.650 cents to 223.525 cents per pound and touching its lowest price since April 11.U.S. wholesale prices for choice cuts and select cuts of boxed beef were weaker.Declines in cattle futures helped drag down CME lean hog futures, brokers said. The hog market seems to be somewhat stuck in a trading range, after falling to contract lows last month, a broker added.",
        "June lean hog futures settled down 1.950 cents at 88.000 cents per pound.The U.S. Department of Agriculture quoted the wholesale pork carcass cutout down $2.01 at $80.07 per cwt amid declines in prices for hams, bellies and ribs.Average hog weights in the week ended April 29 were 285.9 pounds in Iowa, southern Minnesota and South Dakota, down from 286.9 pounds a week earlier and 288.5 pounds last year, the USDA said separately.On Thursday, traders will review weekly U.S. pork and beef export sales data due from the USDA.(Reporting by Tom Polansek; Editing by Shailesh Kuber)"
    ]
}