{
    "articleURL": "/wires/aap/article-12039899/Average-Sydney-rental-costing-record-711-week.html",
    "content": [
        "The average Sydney renter is now paying $711 a week to keep a roof over their head with the price expected to spiral further as landlords pass on the latest interest rate increase.",
        "The cost of renting a home in Sydney jumped 13.1 per cent over the past year, with landlords putting up rentals 1.3 per cent in April, data released by Core Logic on Wednesday shows.Rent is up in all capital cities by an average of 11.7 per cent, as the pain from 11 rate rises flows from home owners to tenants.The Community Housing Industry Association NSW (CHIA) says the only way to correct the escalating crisis is for the government to urgently invest in social and affordable housing.\"This is not the sort of record anyone in Australia wants to break,\" CEO Mark Degotardi said on Wednesday.\"It is yet more proof that renters in NSW and across the country are at crisis point.\"The housing emergency is growing more and more dire.\"Landlords would pass on the the cost of Tuesday's interest rate rise to tenants, he said.\"And the vacancy rate in NSW is also at a record low, so we can expect rents to climb even further.\"Premier Chris Minns acknowledged NSW was in a housing crisis but said measures including freezing rents could have unintended consequences, including reducing the number of rentals available.\"One of the leading ways we believe we can address the housing crisis in Sydney and in NSW is to get more supply going,\" he said.",
        "The government is committed to banning no-grounds evictions and secret rental bidding, meaning real estate agents have to disclose when prospective tenants up their bids at rental property inspections.A rental commissioner will also be appointed to advocate for tenants and a portable bond scheme allowing renters to transfer their bonds from one property to another.The NSW Greens and their federal counterparts have continued to call for a rent freeze, closing loopholes which allow bidding wars between prospective tenants.The Real Estate Institute of NSW is calling for an \"immediate and expeditious inquiry\" followed by a \"brutal action plan\".It says the government and industry need to work together to build thousands of homes to prevent a housing catastrophe.CEO Tim McKibbin says the disparity between demand and supply is set to worsen, putting unprecedented pressure on a housing market already unable to cope.\"It's time for action and this means government and industry working together now,\" he said.Federal Housing Minister Julie Collins will meet her state and territory counterparts in Canberra on Wednesday to discuss pathways to strengthening renters' rights."
    ]
}