{
    "articleURL": "/news/article-12038823/Jumping-barricades-glimpse-Majesty-Brits-share-memories-the1953-Coronation.html",
    "content": [
        "King Charles will be crowned at Westminster Abbey on May 6 Many are still able to recall details from the Coronation of Queen Elizabeth IIHow did you mark Her Majesty's Coronation? Email: james.callery@mailonline.co.uk As Britain readies itself for the Coronation of King Charles III this weekend, those who were fortunate enough to have been around for the crowning of Queen Elizabeth II have shared fond memories of the historic day.",
        "Pamela Tawse was 18 and still in her nurse's uniform and cap when she made her way to central London after her night shift, eager to catch a glimpse of the Queen on June 2, 1953.It was the huge crescendo of noise, she remembers, aged 88, twinkling in delight as she thinks back to a time when Britons, still enduring rationing eight years after the end of World War Two, turned out in force to see the opulence and glamour of the start of a historic reign.'We climbed over the barricades and the crowds were really deep,' Tawse recounted.'Then suddenly, we heard an enormous roar, and we knew that probably the Queen was coming by,' she said, her eyes vividly lighting up at the memory through a pair of gold-rimmed glasses.",
        "Tawse had decorated the hospital bedpans in red, white and blue tape, a small symbol of the excitement greeting 27-year-old Queen Elizabeth II as the new head of the Royal Family on the brink of a technicolour age.For Brenda Piper, who slept on the pavement to secure a spot along the procession route, there was a sense of amazement at the sheer 'spectacle' of the Queen sweeping past in a gold state coach.'This Elizabethan age, it really did begin that way,' she said, clutching a black and white photograph of herself with friends on the day. ",
        "'Next thing it was coffee bars, and then spaghetti bolognese, and then miniskirts. So it really was a beginning.'Tawse and Piper were two of the 12 people who discussed their memories of the Queen's Coronation ahead of the crowning of her son King Charles on May 6, which will feature much of the same pomp and pageantry, but with a scaled-down procession and a shorter ceremony.",
        "They were part of an estimated 3 million people who lined the processional route in London, attended street parties, watched on television for the first time, or followed from thousands of miles away.Queen Elizabeth II, who died last September aged 96 after 70 years as monarch, had taken to the throne in 1952 after the death of her father. By tradition there is a gap between the succession and the Coronation.Not everyone was wowed by that day in 1953.Olive Goldsmith, who is now a retired Refugee Council employee, said her experience was shaped by two friends who provided an outsider's view, with one having spent a childhood in India under British rule, and another from Prague, which had been occupied by Nazi Germany.",
        "'They were both very intrigued to see how the native English behave,' she said, adding that she didn't recall much 'royalism' as they lived in an area known for its 'socialist principles'.",
        "Milton Job, a clerk at the time in what was then British-ruled Nigeria, attended a local celebration where school children joined local chiefs, bosses and expatriate officers.'I will never forget it,' he said.He later moved to Britain, expecting to be there only for three years but still living in London in 2023 after he built ties in the country.He said: 'I expected the best, and to me, I wasn't distracted by anything that is negative, although you cannot just do away with some people who have not seen a Black man before.'We were here to study, we were here for a purpose.'",
        "Eve Harewood, who was 13 when she followed the Coronation from Singapore, said that she remembered thinking she would love to move to England one day. 'It was something I really wanted to experience,' she said. She moved to Britain in her 30s.Many of those who spoke recalled the excitement of the time, seeing the young Queen as the symbol of a new beginning for Britain.They contrasted that with the sentiment of today, with Britons facing the biggest squeeze in living standards since records began in the 1950s.Alex Falk, who worked with the Coronation photographers, said Britain had fallen down the international pecking order since the 1950s, while others expressed regret that the country and its social fabric had changed so much.",
        "Phillip Williams was 16 at the time of the Coronation of Queen Elizabeth II and cycled at 3am from his home in Wanstead to London for a 15-hour shift as a young police cadet. 'I feel sorry for the younger generation of today,' Williams said. 'I think things were probably much harder now than they were in my days.'Like others, he plans to watch King Charles' Coronation and wishes the King well.But he cautioned: 'This time, I should take it easy, especially at my age.'  ",
        "Valerie Roberts, 79, from Much Wenlock in Shropshire, was just nine when the Queen was crowned.She remembers that her parents, Harry and Kate Edge, who lived in The Crescent in the market town, bought a television for the occasion, and her mother also knitted her a jumper that featured a royal carriage. She discovered the item seven decades later, just in time for the Coronation of King Charles.Roberts said: 'My main memory is that we got a television just for the Coronation. We invited neighbours, as back then most people wouldn't have had television. Our house and the whole of The Crescent was decorated, as the council had put poles in the road with flags and bunting.'She also noted that for the Coronation this weekend, she will be ringing the bells at Holy Trinity Church in Much Wenlock at 5pm on Saturday, following a service in the church on Friday evening."
    ]
}