{
    "articleURL": "/news/article-12053845/Bakhmut-burns-Ukraine-accuses-Putins-forces-accused-using-deadly-white-phosphorous.html",
    "content": [
        "Apocalyptic drone footage  showed the embattled city emblazed in an infernoUkraine accused the Kremlin of using the phosphorus munitions in BakhmutBakhmut has descended into hell on earth as the besieged city came under attack from Vladimir Putin's forces.",
        "Apocalyptic drone footage released by Ukraine's defense ministry showed the embattled city emblazed in a fiery inferno as white phosphorus appeared to descend onto the streets. Use of the highly toxic chemical in civilian areas is considered a war crime.Ukraine accused the Kremlin of using the phosphorus munitions which create fast-spreading fires. Russia has been accused of using the highly toxic chemical before.It is unclear when the horrifying footage took place but Russia has been struggling to capture Bakhmut for months now, racking up thousands of causalities during the flailing campaign.It came as the Wagner mercenary group announced plans on Friday to withdraw from Bakhmut, but Ukraine said the fighters were reinforcing positions to try to seize it before Russia marks World War Two Victory Day next week. ",
        "Ukraine's defence ministry released the barbaric drone footage on Twitter, saying that the phosphorus attack targeted 'unoccupied areas of Bakhmut with incendiary ammunition'.The Ukrainian military command said Moscow's forces were continuing to 'destroy the city'.Other videos appeared on social media of the eastern Ukrainian city of fire raining down and raging through the street.Russia's forces have been accused of using white phosphorous multiple times since launching its illegal invasion of Ukraine in February last year. Putin's men were said to have used the highly toxic chemical during last year's siege of Mariupol as well as its intensive bombing campaign of Syria in 2015.",
        "White phosphorus is a wax-like substance which creates fierce, bright, cascading smoke once it makes contact with oxygen. The chemical is used by armies to illuminate targets during the night or as a smokescreen during the day.Human Rights Watch (HRW) have said 'white phosphorus is notorious for the severity of the injuries it causes,' burring at 800 degrees.The group added: 'White phosphorus is highly soluble in fat and therefore deeply burns human flesh. If fragments of white phosphorus enter the bloodstream, they can lead to multiple organ failure. Already-dressed wounds can reignite when dressings are removed, and they are re-exposed to oxygen.The release of the shocking footage came as the head of Russia’s sinister Wagner mercenary group threatened to pull his troops out of the battle for Bakhmut amid bitter infighting in the Kremlin.",
        "Stood in front of the bodies of his dead men near the eastern Ukrainian city, Yevgeny Prigozhin took aim at Vladimir Putin and his military advisers for starving his forces of ammunition.He blamed them for ‘useless, unjustified losses’ as he spearheads attempts to take the town which has become a symbolic objective for Moscow.",
        "Pledging to pull out on May 10, he said: ‘If due to your petty jealousy you do not want to give the Russians the victory of capturing Bakhmut, it is your problem.’",
        "In a flurry of furious videos yesterday, Prigozhin also accused military leaders of ‘sitting there jiggling their fat bellies’ while his troops were dying.In one expletive-laden clip he pointed to around 30 uniformed bodies of his men who had been killed and said: ‘These are someone’s fathers and someone’s sons. The scum that doesn’t give us ammunition will eat their guts in hell.’The Kremlin is understood to have ordered the city to be captured for Victory Day on May 9 – the commemoration of the defeat of Nazi Germany.But Ukraine last night said the video was a bluff to wrongfoot Kyiv ahead of an onslaught before the anniversary.Deputy defence minister Hanna Maliar said they were seeing huge numbers of troops being thrown forward into Bakhmut in an attempt to take the city.Putin has since ordered a mass evacuation from parts of occupied Zaporizhzhia region as Ukraine prepares its counteroffensive.Buses are taking families with children and the elderly from at least 18 settlements.The retreat - seen on video - is even underway in Enerhodar, site of Europe's largest nuclear power plant, currently held by Russia.",
        "There are fears in Ukraine and the West that Putin is preparing a nuclear 'false flag' stunt involving the Zaporizhzhia Nuclear Power Plant.",
        "The retreat is the clearest sign so far of Russian concern at an imminent Ukrainian advance inside territory Putin has illegally claimed to be part of Russia.The pull-back comes as Putin prepares to mark so-called Victory Day in Moscow on 9 May - the annual holiday commemorating the defeat of Hitler.Yet as well as the emergency retreat of residents in Zaporizhzhia, Russia also faces a threatened mutiny by Wagner private army - pulling its troops out of Bakhmut on 10 May unless Russia's defence ministry provides more ammunition which it has failed to do so far.Instead, defence minister Sergei Shoigu has now ordered ammunition to be kept under 'special control' rather than given to Wagner, reported independent media outlet Meduza.This is believed to be due to critical shortages in Putin's supply system.A video showed the Russian army use 'incendiary and phosphorus ammunition' on Bakhmut in an 'apocalypse' attack.'The invaders, apparently, decided to wipe Bakhmut off the face of the earth,' said a Ukrainian source.Despite the attack Ukrainian forces 'continue to defend Bakhmut'.Shoigu was scathingly attacked by Chechen leader Ramzan Kadyrov who backed Wagner chief Yevgeny Prigozhin in complaining about a lack of ammunition for forces on the ground.'I really hope that [Shoigu] will listen to my call and an order will be given to the General Staff to go and sort things out,' said Kadyrov.",
        "He vowed his forces were ready to replace Wagner troops in Bakhmut to win it for Putin.'Our fighters are ready to advance and occupy the city,' he said.'But I would like us to take the remaining two kilometres of the city not at the cost of the lives of soldiers, but by mutual understanding to fulfil the order of the Supreme Commander-in-Chief Vladimir Putin.'In another blow for Putin, the Ukrainians evidently launched an attack on Dzhankoi in Crimea.A spiral of smoke was seen rising from the ground.Russian sources claimed air defence down a missile.In Zaporizhzhia, the Putin-appointed occupation leader Yevgeny Balitsky said: 'In the past few days, the enemy has stepped up shelling of settlements close to the front line.'I have therefore made a decision to evacuate first of all children and parents, elderly people, disabled people and hospital patients,' he wrote.This involved a 'temporary evacuation' from 18 settlements, including the town of Enerhodar where the Zaporizhzhia Nuclear Power Plant is located.Buses have taken people to 'safer areas' including Berdyansk on the Sea of Azov."
    ]
}