{
    "articleURL": "/news/article-12056161/British-familys-holiday-hell-infected-bites-vomit-trails-mystery-dead-dog.html",
    "content": [
        "A British holidaymaker took her family to Hurghada for two weeks in April 2022Everything that could go wrong 'just bl**dy well went wrong!' she told MailOnlineA mother's dream of a two-week getaway to the white sandy beaches of Hurghada became a holiday from hell when her family was plagued with infected mosquito bites and embarrassed by medicine-induced bathroom accidents around the resort.",
        "Tracey, 58, a teaching assistant from Leamington Spa, took her daughter Britt, 25, and son-in-law Liam, 31, to Egypt in 2022. But far from a relaxing break, the three were stuck, sick in the room as staff dealt with fights and the mystery of a dead dog.Not in a position to fly home or move, Tracey and her family endured two-weeks of sickness in a dirty room at a resort they say smelled of sewage. Tracey, who asked that the family name be withheld, spoke to MailOnline about her holiday from hell in Hurghada.",
        "Tracey booked off a relaxing break with her family before the summer rush in April 2022. It was her daughter's first time abroad in 13 years and her son-in-law's first overseas holiday.And 'what could go wrong just bl**dy well went wrong!' she told MailOnline.",
        "From the first night, the family suffered mosquito bites to their ankles. When they looked to clean the wounds with hot water in the bathroom, they discovered there was none.Staff made assurances the issue would be put right but, as Tracey told her travel agency after the trip: 'I was four days without hot water [or] showering or being able to wash my feet and ankles.'Tracey told MailOnline: 'I craved a hot and clean bath to soak my legs and ankles in as they were so painful and heavy.' ",
        "The bites soon became infected, yellow lesions oozing as her feet swelled up and made it nearly impossible to walk. A bite on her eyelid left her face purple and swollen for two days.The bathroom, she said, was filthy. She told MailOnline the bath was 'thick with grime' and home to a cockroach.The resort stank of sewage and the public bathrooms were 'vile', she claimed in her report after getting home. Tracey was left to hobble back and forth for days on swollen, dirty ankles to get the issues sorted herself as reception assured someone would come.After four days of waiting, Tracey said, five men arrived at her room to inspect the leaking air-con. And by the morning it was broken again. 'Everything that went wrong took days and days [to fix],' she explained. When she complained to the hotel, she said the receptionist replied: 'what would you like me to do? It's normal for air-con to leak a little bit.'Each day the cleaner mopped it up and each day it flooded again.",
        "As the wounds worsened, Tracey sought help from an on-site doctor, who diagnosed the infected bites and prescribed antibiotics.After allegedly offering to see Britt for free, he 'went back on his word' and started messaging the family: 'When are you paying?' 'Can you call now?' ",
        "She told her travel agent later that the infections voided any chance of enjoying the holiday: 'I couldn't snorkel or swim with the dolphins on the boat trip I went on. I couldn't sunbathe properly as I had to cover my ankles and legs up. 'It really felt like a pointless venture.'The day after getting her jab, Tracey suffered an 'extreme loose bowel movement which was uncontrollable' at the terrace bar.Britt, also suffering from bites, has to run around the resort after her, clearing up.Tracey said she 'was and still am thoroughly embarrassed as everybody could see what had happened'. Her clothes had been 'totally ruined' and had to be thrown away.'I was just an absolute bl**dy mess,' she told MailOnline. 'I have been to Egypt many times over the past 17 years and have never experienced anything so degrading.' She said the one funny part of the holiday was having to stand outside of the cubicle, clapping to keep a light attached to a motion sensor on while enduring dire illness.All the while, Tracey described scenes of chaos around the resort.According to Tracey's testimony, the family witnessed a member of staff being beaten by six men while on their break. The dead dog was tossed outside the front of the hotel and had to be removed... you could not write it.  ",
        "'It started around 12am and went on until 3:30ish,' she reported. 'The fight started by the terrace bar and ended in the restaurant... They ended up pulling the porter up to the restaurant so they could kick him in without people watching.' 'I expect this kind of behaviour in Benidorm,' she told her travel agent. It was the first time her daughter, who suffers from anxiety and PTSD, had been abroad in 13 years.'The holiday was supposed to be a reset for her. She suffered an accident five years ago and this was her time to get away from everything... and it was just horrendous.'Elsewhere, a guest had left a dead dog in reception. 'It was wrapped in a blanket and she placed it on a chair. This caused another guest to start shouting at her and they ended up in a slanging match, along with staff.'The dead dog was tossed outside the front of the hotel and had to be removed... by a member of staff. You could not write it.'She told MailOnline: 'If I could have travelled back to the UK after a few days, I certainly would have done so. Because of my swollen feet and ankles I was very worried about the flight possibility making my condition much worse than it already was.",
        "'The thought of thrombosis genuinely concerned me, so I felt that I had no choice but to remain and continue with the antibiotics until I 'personally' felt safe and confident to travel back home again.'",
        "Finally, it was time to go home - and the transfer to the airport did not arrive.'We were told it would be outside for us at 6pm. We waited 30-40 minutes and had to order an Uber ourselves.'Absolutely diabolical,' she wrote. 'We couldn't even get away from the place.'After getting home, Tracey had to visit doctors in the UK due to a new infection.Tracey reached out to the organisers, seeking compensation for the problems encountered, as well as the distress and disappointment suffered as a result.She said her agency offered £850 after a full inspection, the price of the hotel, which she accepted.The Hotel Aqua Beach Resort in Hurghada has since closed down. Tracey's travel agency told MailOnline that the resort has since reopened under different management and undergone refurbishment, with substantially better reviews."
    ]
}