{
    "articleURL": "/wires/reuters/article-12052025/Lawmaker-head-NSF-warn-delays-funding-U-S-tech-research.html",
    "content": [
        "By Jane Lanhee Lee",
        "Santa Clara, California, May 5 (Reuters) - Silicon Valley's U.S. Democratic Representative Ro Khanna and the director of the National Science Foundation (NSF) warned on Friday against delays to funding for U.S. research in the face of surging technology investment by rivals such as China.While the CHIPS and Science Act authorized the NSF's budget of $81 billion over five years, which could double the annual budget by 2027, the foundation's director, Sethuraman Panchanathan, told Reuters he was concerned the funding could get delayed.The bill was signed by President Joe Biden last year as the U.S. looks to bring back chip manufacturing and maintain a competitive edge on technologies against adversaries, in particular China.\"The time is now. This is an important moment not to cede leadership in any emerging technologies,\" Panchanathan said.The NSF is a federal agency that funds a big portion of science and engineering, including research at universities.It had a budget of $8.8 billion for the fiscal year of 2022, and Panchanathan said an increase in funding would help support the NSF's Directorate for Technology, Innovation and Partnerships, called TIP.TIP is the agency's first new directorate in more than 30 years and would help identify research, a lot of it already funded by the NSF, that can become technology products, he said.",
        "The directorate would help build up an ecosystem of academics, corporates, venture capitalists, and others to help researchers and startups get off the ground.Panchanathan and Khanna met nearly two dozen venture capitalists, startup CEOs, and some big tech firm executives in Santa Clara, California to discuss the CHIPS and Science Act.\"We're under-investing in science in America. We are at historic lows,\" Khanna told Reuters. \"China is investing extraordinarily in these technologies that we would need to compete. And this is a first significant investment in that.\" (Reporting By Jane Lanhee Lee; Editing by Robert Birsel)"
    ]
}