{
    "articleURL": "/tvshowbiz/article-12045829/Jess-Impiazzi-34-reveals-started-IVF-revealing-heartbreak-early-menopause.html",
    "content": [
        "Jess Impiazzi revealed she has started IVF as she shared a snap of her bruised stomach on Instagram on Wednesday. ",
        "The former Ex On The Beach star, 34, opened up about her treatment after revealing she was left heartbroken at being told she is going through the early menopause. The TV personality, who is in a relationship with footballer Jermaine Pennnant, still wants to have children, and has detailed what the hormones are she is currently injecting herself with during her IVF.Jess was seen sitting on the floor of her bedroom in a pair of pink pyjamas as she lifted her shirt to reveal her bruised stomach, which she said is normal.She admitted the last few days have been 'the hardest' and she has been left feeling 'a little sorry for herself' and extremely 'tired'. ",
        "She wrote: 'IVF update: I’m on day ten of the Pergoveris jabs (which is the follicle stimulating hormone) and day 5 of the Fyremadel shot (which stops me from ovulating).'Today when I injected my Fyremadel shot I caused this big bruise and it bled, that’s normal though and my nurse reassured me when I went in this morning for my scans. 'Everyone @thesurreyparkclinic has been amazing throughout and like a family helping me through!' Jess said despite her stomach being really sore her follicles 'are responding to the treatment'. She continued: 'Emotionally I think today has been the hardest day, I’ve been tired since starting the treatment but I hadn’t experienced too much emotional issues.",
        "'Today I guess I’m just feeling a little sorry for myself and a little teary, I have to have extra jabs for a few more days then planned to give my follicles more time to grow bigger! 'The good news is they are responding to the treatment so I’m happy with that! I’m just feeling like a pin cushion atm and my tummy where I’m injecting is a little sore!'Tomorrow is a new day! I have reiki and then going on a long walk! Fresh air in the forests always helps! Then acupuncture again to end the week! ",
        "'I got this and if anyone is going through this or in fact anything challenging right now… you’ve got this too!'She explained her symptoms were initially dismissed as stress three years ago, before she was privately diagnosed with premature menopause.The menopause occurs between the ages of 44 and 55 when a woman stops having periods and can no longer fall pregnant naturally but 1 in 100 women can experience it before the age of 40.Speaking about her devastating diagnosis, Jess said she still hopes to have children with Jermaine, 40, and that they are attempting to start a family through IVF.  She told The Sun: 'I have always wanted to have a family so to be told the chances of having my own children are slim is heartbreaking. ",
        "'We had talked about kids but we haven't even been together for two years and assumed we had more time.'Jess went on to reference their 'tough times', which saw Jermaine diagnosed with ADHD just before Christmas while he was also declared bankrupt at the start of this year.Jess admitted they hadn't planned to have a relationship this early in their relationship, but Jermaine insisted he plans to stand by his partner and support her.",
        "The former footballer, who started dating Jess in September 2021, said: 'I understand how much she wants to have a family, time is of the essence so all I can do is be her support and do whatever I can to make the journey possible.'Speaking about her diagnosis, Jess admitted she felt 'let down' by GPs after they put her symptoms down to stress in multiple appointments over three years.Jess explained that she began missing periods, suffered irregular heavy bleeding, experienced fatigue, brain fog and anxiety at the age of 30. She said she would have been able to have her eggs frozen if she'd known earlier, sharing her upset about the choice being 'taken away' from her.After going to a private clinic specialising in fertility and hormonal problems, Jess said she was diagnosed with endometriosis on her bowels and primary ovarian insufficiency, which often leads to infertility.",
        "Jess admitted she was worried about telling Jermaine that they needed to try to have a family straight away following her diagnosis, saying they hadn't planned to do so for a few years.The couple have now decided to try IVF treatment and are currently awaiting results of initial tests and Jess said she won't be able to have multiple biological children.Jess, who was previously married to rugby player Denny Solomona, and Jermaine started dating in November 2021.",
        "The menopause occurs when a woman stops having periods and can no longer fall pregnant naturally.It is a natural part of ageing, which occurs in women between 45 and 55 years old. However 1 in 100 women can experience menopause before the age of 40, which is known as premature menopause or premature ovarian insufficiency.Symptoms often include hot flushes, night sweats, low mood, reduced sex drive, vaginal dryness, an increase in facial hair and difficulty sleeping.According to NHS advice, symptoms can begin months or even years before your periods stop and last around four years after your last period. Premature or early menopause can occur at any age, and in many cases, there's no clear cause. Source: NHS "
    ]
}