{
    "articleURL": "/wires/afp/article-12052577/Floods-kill-170-people-east-DR-Congo.html",
    "content": [
        "More than 170 people have died after heavy rains and flooding in eastern DR Congo's South Kivu province, officials said Friday, after torrential downpours killed dozens in neighbouring Rwanda.",
        "South Kivu governor Theo Ngwabije said dozens of people were unaccounted for in the Kalehe region, west of Lake Kivu and near the Rwandan border, where the floods also washed away hundreds of homes.\"We have about 176 people dead,\" he said while visiting the affected area.\"This toll is provisional,\" he said. \"We also have about 100 people missing.\"Archimede Karhebwa, the assistant administrator of Kalehe, had earlier told AFP that about 100 people had died, according to a provisional toll.A day of national mourning will be observed on Monday with flags lowered to half-mast \"in memory of the lost compatriots\", the government announced on Friday evening.Several villages in Kalehe were submerged when rivers burst their banks after heavy rains, he said.Karhebwa said the floods carried away hundreds of houses and also \"surprised vendors and their clients in the markets\".Innocent Mupenda, a civil society figure from the region, said a downpour started on Thursday afternoon, before the \"river carried away villagers\".His mother and 11 children died in the flood, Mupenda said.Vital Muhini, an elected official from Kalehe, also told a local radio station that the floods had been \"devastating human and material damage\". He put the number of deaths at around 150.AFP was unable to independently confirm the death toll, with reported figures varying.",
        "A member of a rescue team deployed on Friday afternoon, who declined to be named, said \"the search is continuing in the rubble\".Eastern Congo's deadly flooding follows the death of at least 127 people this week after downpours in neighbouring Rwanda, which lies on the other side of Lake Kivu.- 'Sending out an SOS' -Karhebwa, Kalehe's assistant administrator, said that the rivers have burst their banks and caused disastrous flooding on four previous occasions.The area had been studied and people living by the river requested to leave, he explained.Deforestation in the area and climate change have contributed to the flooding problem, according to Karhebwa.\"We are sending out an SOS to people of good will and for urgent humanitarian aid,\" he said.Heavy downpours during rainy seasons in central Africa regularly lead to flooding and landslides.But experts say extreme weather events in Africa are happening with increased frequency and intensity due to climate change.Last month, a landslide provoked by torrential downpours killed around 20 people in North Kivu, a province that neighbours South Kivu.The Democratic Republic of Congo, a vast nation the size of continental western Europe, is one of the poorest countries in the world, riddled by corruption and conflict in its east."
    ]
}