{
    "articleURL": "/wires/reuters/article-12048255/CANADA-FX-DEBT-Short-squeeze-helps-lift-Canadian-dollar-2-week-high.html",
    "content": [
        "Canadian dollar strengthens 0.6% against the greenback",
        "Touches its strongest since April 21 at 1.3520Price of U.S. oil settles 0.1% lowerCanada-U.S. 2-year spread narrows by 15.5 basis pointsBy Fergal SmithTORONTO, May 4 (Reuters) - The Canadian dollar strengthened to a near two-week high against its U.S. counterpart on Thursday as oil rebounded from its lowest level of the day, putting pressure on investors that have placed bearish bets on the currency.The loonie was trading 0.6% higher at 1.3535 to the greenback, or 73.88 U.S. cents, after touching its strongest since April 21 at 1.3520.The move came as the other dollar bloc currencies, the Australian and New Zealand dollars, also gained ground.\"I think that it's a bit of a short squeeze helped by the stabilization of the oil market after a very volatile, say, 24 hours ... We didn't break through any key technical levels,\" said Marc Chandler, chief market strategist at Bannockburn Global Forex LLC.The price of oil, one of Canada's major exports, settled 0.1% lower at $68.56 a barrel but clawed back much of its earlier decline. It follows sharp losses in the previous two days.Meanwhile, U.S. Treasury yields slid amid pressure on several U.S. regional bank stocks. The drop in yields follows the Federal Reserve's move on Wednesday to signal a possible pause in its interest rate hiking cycle.",
        "\"The one thing that Canada has got going for it is how aggressive the market is pricing in Fed rate cuts,\" Chandler said.The Bank of Canada's governor, Tiff Macklem, said that the bank is ready to tighten further if Canadian inflation gets stuck significantly above target.Canadian government bond yields were mixed across the curve. The 2-year eased 2.4 basis points to 3.562% but the gap between it and its U.S. equivalent narrowed by 15.5 basis points to about 20 basis points in favor of the U.S. bond. (Reporting by Fergal Smith, editing by Deepa Babington)"
    ]
}