{
    "articleURL": "/wires/reuters/article-12055665/Motor-racing-Alonso-starts-row-Miami-win-long-shot.html",
    "content": [
        "By Steve Keating",
        "MIAMI, May 6 (Reuters) - Fernando Alonso will start the Miami Grand Prix on the front row alongside pole sitter Sergio Perez, providing Aston Martin the chance for a win, believes team principal Mike Krack.Alonso, however, does not quite see the same opportunity and expects to have a hard-charging Max Verstappen's Red Bull filling his mirrors by the midway point of the 57-lap race on the 3.36 mile (5.41km) temporary street circuit around Hard Rock Stadium, the home of the NFL's Miami Dolphins.The Red Bulls of Verstappen and Perez have been in a league of their own this season winning every grand prix, with three of the four races one-two finishes.While the Aston Martins have shown plenty of pace as well, Alonso's appearance on the front row has as much to do with a bit of good fortune for the Spaniard combined with bad luck for Verstappen.The Dutchman, who had dominated practice in Miami, looked almost certain to take pole but was unable to complete his final flying lap after Ferrari's Charles Leclerc crashed with a minute and 36 seconds remaining bringing an end to the qualifying.\"The opportunity is there if you start from the front row,\" assured Krack after Saturday's qualifying. \" If you start from the first row your aim has to be to win the race.",
        "\"We have strong competitors who didn't get it all together today except Sergio but we will try and give it our best.\"Verstappen, last year's winner in Miami, will start ninth but Alonso guessed that he will see him on his exhaust by lap 25.With a slim six-point lead over Perez in the drivers standings Verstappen was clear he will be on the charge from lights out on Sunday.Asked what result he was expecting the double world champion set the target at, \"Minimum is P2.\"Alonso's team mate Lance Stroll will also have to come back if he is to fight for a podium.The Canadian failed to make it out of the first phase qualifying only 18th after the team gambled on running on a single set of soft tyres in an attempt to save a set for the second session.\"We were in discussion with Lance and we should have just called him in there was no need to take this much of a risk that we did,\" said Krack. \"We wanted to get both cars in Q3 and there was no need to take that risk.\"As a team you have some statistics to gauge what the cutoff will be and in these things we were not good enough.",
        "\"I think maybe we were a bit greedy but we have to take our lesson from it and do better next time.\" (Reporting by Steve Keating in Miami. Editing by Kim Coghill)"
    ]
}