{
    "articleURL": "/wires/aap/article-12045093/Cowboys-blood-imposing-Finefeuiaki-Roosters-clash.html",
    "content": [
        "Even as North Queensland's season remains in perilous territory ahead of Sunday's clash with the Sydney Roosters, a ray of light will shine on the Cowboys in their must-win Magic Round fixture.",
        "Nineteen-year-old talent Kulikefu Finefeuiaki has been named for his debut via the interchange after being promoted from a development contract just last month.The New Zealand-born, Ipswich State High School product began playing rugby league for the Redbank Plains Bears aged 11, before finishing school and joining the Cowboys prior to the 2022 season.Finefeuiaki says there were plenty of tears when he informed his family of his looming debut, but it won't fully sink in until he runs out at Suncorp Stadium for the very first time.\"My mum started crying and that made me cry,\" Finefeuiaki said. \"I'm still lost for words at the moment.\"I still can't picture it. It's been a childhood dream and it's finally coming true.\"The young yet imposing second-rower will bring instant physicality to a Cowboys outfit that has been outmuscled and outplayed in recent weeks, no more telling then a 44-6 flogging at the hands of Cronulla in round nine.Coach Todd Payten said the youngster's size and power will give their bench a lift.\"He enjoys physical contact and the combat side of our game, so it's a great opportunity for him against a physical Roosters team this weekend,\" said Payten.Finefeuiaki will likely share minutes with starting right-edge forward Heilum Luki, who returns from a hamstring injury to replace the suspended Jeremiah Nanai (four weeks).",
        "But even with his big frame, the 19-year-old's softer side is there for all to see.He said he still pinches himself being around and training with childhood hero Jason Taumalolo.\"He's another Tongan boy like me and he put our country on the map.\"Droves of Finefeuiaki's family are expected to turnout for his maiden NRL game with the young back-rower indicating some 40 family members want to attend.But there will be one family member torn when Finefeuiaki takes the field on Sunday.\"(The Roosters) are my brother's favourite team,\" a smiling Finefeuiaki added.\"But he'll be going for the Cowboys because I'm playing.\""
    ]
}