{
    "articleURL": "/wires/ap/article-12058945/Airstrikes-kill-known-Syrian-drug-kingpin.html",
    "content": [
        "BEIRUT (AP) - Airstrikes over southern Syria early Monday killed one of the country´s most well-known drug dealers, an opposition war monitor and a pro-government radio station reported.",
        "The rare attack came days after Jordan warned it would use force inside Syria to eliminate drug trafficking to its territories and from there to oil-rich Arab gulf nations.The strikes also come a day after Arab governments reinstated Syria to the Arab League following the country's suspension for its crackdown on protests that ultimately led to a lengthy civil war. As Arab governments gradually rekindle ties with Damascus, one of the key topics of discussion has been Syria's illicit drug industry, which has flourished during the ongoing conflict - especially the illegal amphetamine Captagon.Western governments estimate that Captagon has generated billions of dollars in revenue for President Bashar Assad, his Syrian associates and allies. Damascus has denied the accusations.The first strike hit a home in the Syrian village of Shuab in Sweida province near the Jordanian border, killing Merhi al-Ramthan, his wife and six children, according to the Britain-based Syrian Observatory for Human Rights.The opposition war monitor and Sham FM reported another strike in the southern province of Daraa that hit a building. The Observatory said the building housed a drug factory.Ahmad al-Masalmeh, an opposition activist who covers developments in southern Syria, also said that one strike killed al-Ramthan and his family in Sweida province. He said the other hit a facility in Daraa province used by Iran-backed groups to produce and store drugs before smuggling them to Jordan. He said the strikes happened before dawn Monday, igniting a fire at the drug facility in Daraa province.",
        "The pro-government radio station did not give any further details. There was no immediate comment from either Jordanian or Syrian authorities.Activists and the war monitor said they believe Jordan is likely behind the airstrike, with the Captagon producer among the most wanted by Jordanian authorities for facilitating drug smuggling across the border with the backing of a small militia. They also say al-Ramthan is close with militias linked to Assad and the Iran-backed Lebanese group Hezbollah.Jordanian state media shared news of the airstrike, but only cited Syrian media and added that al-Ramthan was wanted by Jordanian authorities. Jordan's foreign minister at a press conference Monday following a meeting with his Dutch counterpart said Syria had committed to cooperating with Arab countries on drug smuggling during last week's talks in Amman, and that he will call his counterpart in Damascus to \"translate this agreement into a clear mechanism.\"\"Whenever we take any steps to protect our national security and facing any threats towards it, we announce it at the appropriate time,\" Jordanian Foreign Minister Ayman Safadi said. \"When it comes to the case of drugs, as we said before, the surge in drug smuggling is a huge threat to the kingdom, the region, and the world.\"Last week, Safadi warned that his country will not stand idle if drug trafficking continues from Syria.",
        "\"We are not taking the threat of drug smuggling lightly,\" Safadi told CNN last week. \"If we do not see effective measures to curb that threat, we will do what it takes to counter that threat, including taking military action inside Syria to eliminate this extremely dangerous threat.\"For us, it is a must that we end this crisis because we've suffered tremendously from its consequences,\" he said.Al-Masalameh, the opposition activist, said: \"The war planes were believed to be Jordanian following the threats by the foreign minister.\"Jordan has frequently reported busting drug smuggling operations on its border with Syria, with its soldiers sometimes engaging in shootouts with drug cartels trying to break through from southern Syria. In recent years, Jordanian authorities have discovered millions of smuggled Captagon pills, many of which were sent to oil-rich gulf nations.Both Syria and neighboring Lebanon have become gateways for the drug to the wider Middle East, and particularly to the the Gulf.In March, the U.S. and U.K. slapped sanctions on four Syrians and two Lebanese involved in manufacturing and trafficking Captagon.The six included cousins of the Syrian president and well-known Lebanese drug kingpins. Weeks later, the European Union imposed sanctions on several Syrians, including members of Assad´s family, blaming them for the production and trafficking of narcotics, notably Captagon.",
        "___Associated Press writer Albert Aji contributed to this report from Damascus, Syria."
    ]
}