{
    "articleURL": "/wires/reuters/article-12053241/Man-pepper-sprayed-police-gets-14-years-longest-Jan-6-related-sentence.html",
    "content": [
        "By Andrew Goudsward and Steve Gorman",
        "WASHINGTON, May 5 (Reuters) - A Pennsylvania man found guilty of felony assault and other charges for pepper-spraying police officers outside the U.S. Capitol was sentenced on Friday to 14 years behind bars, the longest prison term to date for anyone convicted in the riot of Jan. 6, 2021.Peter J. Schwartz, 49, was convicted last December at a trial in federal court where evidence showed he was in the vanguard of a mob attacking police at the lower west terrace of the Capitol and boasted later that he had \"started a riot\" by \"throwing the first chair.\"Prosecutors said Schwartz then seized a police duffle bag full of pepper-spray canisters and handed them out to others in the mob, including his wife, so they could turn them against police officers.According to the government's case, Schwartz began chasing down any retreating officers he could find and dousing them with pepper spray as he surged through the crowd into the lower west terrace tunnel wielding a wooden club.A welder by trade, Schwartz was arrested in early February in his hometown of Uniontown, Pennsylvania.Schwartz and two co-defendants, Jeffrey Scott Brown and Markus Maly, became the first three individuals convicted at trial of assaulting police officers with pepper spray on Jan. 6.",
        "Brown, of Santa Ana, California, was sentenced last month to 4 1/2 years in prison. Maly, of Fincastle, Virginia, is awaiting sentencing. Schwartz's wife, Shelly Stallings, received a two-year prison term last month.Schwartz was found guilty on four counts of assault with a dangerous weapon and six other charges, including obstructing an official proceeding, entering a restricted building with a dangerous weapon and engaging in physical violence in a restricted building.His 170-month prison term surpasses the previous longest sentence yet handed down in a case related to the Jan. 6 attack - 10 years received by former New York City cop Thomas Webster for assaulting a Washington police officer that day.Schwartz's punishment may soon be eclipsed. The U.S. Justice Department on Friday asked a federal judge to sentence Oath Keepers founder Stewart Rhodes to 25 years in prison for his conviction on seditious conspiracy and other charges stemming from the Jan. 6 riot.On Thursday, a federal court jury convicted four members of another far-right extremist group, the Proud Boys, of seditious conspiracy, defined under a Civil War-era law as a plot to oppose the government with force.At least 950 people have been charged and more than 600 convicted for their roles in the Capitol rampage by supporters of then-President Donald Trump. The Jan. 6 attack marked the most violent assault on the halls of Congress since the British invasion of Washington during the War of 1812.",
        "Trump had urged his followers in a speech that day to \"fight like hell\" to disrupt congressional certification of Democrat Joe Biden's 2020 presidential election victory, a race the Republican incumbent has continued to falsely claim was stolen by massive fraud.Schwartz's lawyers appealed for leniency, saying their client and his wife had traveled to Washington to hear Trump's speech and walked to the Capitol with other protesters without intending in advance to incite violence.Defense attorneys said in court documents that Schwartz's actions that day \"were motivated by a misunderstanding as to the facts surrounding the 2020 election.\" (Reporting by Andrew Goudward in Washington; Writing and additional reporting by Steve Gorman in Los Angeles; Editing by Stephen Coates)"
    ]
}