{
    "articleURL": "/news/article-12060017/Industry-groups-dismiss-Labours-unrealistic-plans-hike-stamp-duty-foreign-property-buyers.html",
    "content": [
        "Keir Starmer is poised to include the proposals in Labour's election manifesto Industry groups have dismissed Labour's 'unrealistic' plans to hike stamp duty for foreign property buyers and restrict the sale of new-builds to overseas investors.",
        "Sir Keir Starmer is poised to include proposals for higher taxes on non-UK property purchasers in Labour's manifesto ahead of the next general election.According to the Financial Times, Labour will pledge to increase the surcharge on stamp duty - currently at 2 per cent - for overseas buyers purchasing UK property.This will come with new rules to prevent overseas buyers purchasing more than 50 per cent of properties in a new development.Party officials told the newspaper their plans would also include restrictions on property sales for a certain period - for example, only allowing first-time buyers to buy homes in a new development for the first six months.",
        "Sir Keir last week tackled Rishi Suank over the challenges facing Britons trying to get on the property ladder during Prime Minister's Questions in the House of Commons.The Labour leader accused the PM of 'kicking them when they are down' by ditching compulsory housebuilding targets.But Mr Sunak pointed to figures that showed last year had the highest number of first-time buyers in 20 years. Labour's new housing policies are set to get the go-ahead this summer as the party drafts its manifesto ahead of a general election expected next year, the Financial Times reported.An analysis by the Centre for Public Data, a non-profit organisation, last year showed an increasing presence of overseas buyers in the UK property market.",
        "It found close to 250,000 residential properties in England and Wales were registered to individuals based overseas, which equated to roughly 1 per cent of total housing stock.This was up from less than 88,000 homes in 2010.But there are fears a fresh crackdown on foreign ownership could stall the property market by blocking developers from the overseas investment they might need before beginning construction on a project.",
        "John Hawksworth, former chief economist at PwC, posted on Twitter: 'Restricting or taxing more heavily property sales to non-residents would be well intentioned.'But beware of unintended consequences if it kills off some apartment developments that rely for viability on advance off-plan sales to overseas investors.'Luke Mills, head of UK residential at real estate advisers CBRE, said: 'It's well-intentioned to let first-time buyers buy first, but working across the board it is unrealistic.'Stewart Baseley, executive chair of the Homebuilders Federation, said: 'While prioritising UK buyers is key, some large-scale developments require upfront funding that (overseas) investor buyers can provide.'"
    ]
}