{
    "articleURL": "/news/article-12058553/Hero-store-associate-sacrificed-life-save-shoppers-hid-Texas-mall-shooting.html",
    "content": [
        "Racquel Lee was one of hundreds present at the Allen Premium Outlets SaturdayIn the chaos that ensued, the unnamed store associate gathered a frantic Lee and 12 others, including several children, and hid them inside a bathroom closetOn her way out, Lee recalled realizing that among a mound of 'bullets and bodies' outside, was the same store worker that hid her barely an hour beforeA mother-of-two who survived the Dallas mall shooting has revealed a hero store worker sacrificed her life to save a dozen shoppers who she hid inside a closet. ",
        "Racquel Lee was one of thousands present at Allen Premium Outlets Saturday when 33-year-old gunman Mauricio Garcia shot dead eight victims.She began her impromptu shopping trip by pulling up to the same H&amp;M store where Garcia would arrive in his own car moments later and open fire. Lee said it 'sounded like a warzone' as frantic shoppers started fleeing from the hail of bullets.In the chaos that ensued, the unnamed store associate gathered a frantic Lee and 12 others, including several children, and hid them inside the store's bathroom closet. The worker then left the group, and Lee hours later was escorted out by police.On her way out, Lee recalled realizing that among the mass of 'bullets and bodies' outside, was the same store worker that hid her barely an hour before. Scroll down for video: ",
        "'The store associate saved our lives,' Lee tearfully told CBS News Texas Sunday, ultimately cutting the interview short after becoming too emotional.'I was crouching down, like, \"I hope we don't get hit by a bullet,\"' the near-victim added of when the gunfire began.'Earlier in the interview, Lee explained how she parked her White SUV in front of the H&amp;M where the gunman was seen arriving and opening fire on a group that included children.",
        "Lee said that immediately, even inside the store, she and other shoppers recognized they were gun shots and ran for cover.'The gunshots – it sounded like a warzone,' she recalled. 'It was horrifying and it felt like you were in a dream.'She went on to detail how once inside the closet, she and others seen in footage shared by the mom with CBS desperately tried to refrain from crying in fear the gunman would find them. She said people were also trying to call emergency responders, but did not have service in the restroom closet.'We were in a bathroom closet, and we were just in the closet trying not be heard, crying, praying - people were trying to call 911, we couldn't dial out.'She tearfully added: 'I just remembered thinking – Oh god, he's coming in here next.'Fortunately for her and others hiding out in the restroom, Garcia - a suspected Neo-Nazi and Dallas resident - was killed by an Allen PD officer who happened to be on the scene and also heard the gunshots.The killer had fired more than 100 times, and had more ammunition and weapons in his car, when he was shot dead.After the shooter was subdued, Lee was among hundreds of others escorted off the premises by local and state cops, who discovered her and the others while doing a sweep of each of the outlet's stores.",
        "Her recollection of the events that unfolded Saturday afternoon come on the heels of other accounts detailing others' selfless deeds that perhaps saved lives during the shooting.",
        "A man who witnessed the outlet mall shooting firsthand, Allen resident Steven Spainhouer, recalled being one of the first people on the scene - rushing to rescue his son from a clothing store where the now-deceased gunman's attack started. At least one of those slain, Spainhouer recalled, was a child, whom he desperately tried to save after rushing to the H&amp;M - where his own son had been working. Shortly before, around 3:30pm Spainhouer received a frantic call from his son notifying him that there had been shots fired outside the shop, with his relative still trapped inside.As that was going on, and prior to other officers' arrival, Spainhouer - who is trained in CPR - attempted to resuscitate multiple people struck by the gunman's initial hail of gunfire, including three he said were already beyond saving.'The first girl I walked up to was crouched down covering her head in the bushes, so I felt for a pulse, pulled her head to the side and she had no face,' he said of the first victim he came across, a young girl.Still set on saving the mess of victims, Spainhouer recalled how he then found another child, who survived the barrage of bullets by being covered by his protective mother, who he said was among eight to die by the gunman.",
        "'When I rolled the mother over, he came out,' Spainhouer said, speaking to CBS reporter JD Miles just a few hundred yards from where the carnage was seen only a few hours before.  'I asked him if he was OK and he said, 'My mom is hurt, my mom is hurt.''Spainhouer described how he attempted to alleviate the boy's mental anguish by taking away from the grisly scene.'Rather than traumatize him any more, I pulled him around the corner sat him down and he was covered from head to toe.'Spainhouer added: 'Like somebody poured blood on him.'",
        "The dutiful dad tried to rescue another victim, but was also unsuccessful. Meanwhile, as important minutes continued to pass, Spainhouer - unaware that the unnamed Allen officer was already on the scene - waited for others to arrive and help him with his efforts.   'I was on the phone with 911 and I was telling them we have a mass casualty incident,' the father said, appearing visibly emotional during the TV interview.Spainhouer further added that as he and others waited for medical help, local police were forced to transport several of the victims to nearby medical practitioners - as their condition was too severe to wait for an ambulance. 'No one can see what we saw today and not be affected by it,' he said, saying the events of the day would stay with him. 'It's not a situation I would wish upon anybody, it's just unfathomable to see carnage.'",
        "Spainhouer's son also told the station that two customers inside the H&amp;M store were among the at least seven injured. Spainhouer, meanwhile, while holding back tears, remarked, 'It's tough when you see a family that's out shopping, having fun, get wiped off the face of the Earth because somebody with a gun has some other type of issue.'As for the hero cop who took down the gunman, he has yet to be named - though new details continue to emerge about the 33-year-old shooter. What is known is that Garcia lived in a quiet Dallas neighborhood of single family homes in the northeast of the city with his family up until relatively recently, moving to a Budget Inn about 15 miles away, DailyMail.com can reveal. The one-star hotel is a far cry from the single-story, three-bedroom, two bath 1,331 sq foot home where he up until recently resided with his family, located on a tree lined street roughly 28 miles from the scene of Saturday's carnage.The home is worth an estimated $275,000, and no one would answer the door when knocked.However, Sunday afternoon, DailyMail.com spotted a middle-aged woman pacing anxiously in the yard talking on her cell phone. Records show a Carmen Catalan, aged 59, also lives at the address.Neighbors were more receptive in reporters' inquiries, painting a picture of a man in his thirties, who months ago still lived with his parents and often wore a security-guard uniform.",
        "A neighbor, who did not want to be identified, described Garcia as 'appearing like a normal guy' – but having possible mental issues.He recalled: 'We spoke cordially in passing. He appeared to be just a normal guy. He would just leave for work and return, nothing out of the ordinary.'His mother doesn't speak English, but he did, like you or I would. He seemed just like a very good kid. Always polite, friendly, but perhaps a bit mentally slow - just in the way he spoke and responded. It was a distinct impression I got.'Garcia, however, hasn't lived at the home for several months, neighbors said - instead taking up residence at the Budget Inn on North Stemmons Freeway, just a few blocks from the University of Dallas.That did not stop federal officials from showing up at the doorstep of his family's home in the northeast suburb of Piper Hill just an hour and half before the first shots rang out.'It was about 5pm, when three Dallas police squad cars and the FBI turned up,' the anonymous neighbor said.He added: 'I never heard any banging on doors or kicking down doors or anything of that nature. 'They engaged in dialogue with the family members as they were leaving - but the family didn't go with them.'Moreover, law enforcement officials offered insight as to Garcia's character - while confiding to CBS that he had been working as a security guard prior to the massacre.A next-door neighbor of the suspect, who asked to be identified as Julie, said she told NBC News that she would regularly see Garcia going to and coming home from work every day like clockwork before he moved to the inn.'He tried to acknowledge us but seemed a little off,' she recalled. 'He wasn't somebody you could carry a conversation with.' Garcia also apparently had several social media accounts active before the shooting, that have seeming been scrubbed amid state and federal officials' ongoing investigation.The profiles, the sources said, showed the Dallas citizen's preference for neo-Nazi and white supremacist content, as officials have still yet to release the names of his eight victims, or the condition of at least seven others injured. One of the eight victims, 20-year-old Christian LaCour, was identified Sunday by a post to relative's Facebook.A Farmersville resident who also worked as a security guard, LaCour was mourned by his grandmother Sandra Montgomery who said she was 'so proud of him'.'My beautiful grandson, Christian LaCour, was the security guard killed in the shooting at Allen Texas. He was such a beautiful soul,' she wrote. LaCour's sister's mother-in-law also wrote: 'Words can not even begin to describe the devastation that our family feels,' she said in the post. '[There] will forever be a void.'"
    ]
}