{
    "articleURL": "/tvshowbiz/article-12040097/Rita-Ora-husband-Taika-Waititi-emerge-partying-Met-Gala.html",
    "content": [
        "She admitted to getting a hangover after partying the night away with fashion and Hollywood royalty at the Met Gala.",
        "And Rita Ora kept things very low-key as she emerged the next day with her husband Taika Waititi.Long gone were the fashion-forward outfits she wore the night prior, and in its place were sweats, a baseball cap, and sunglasses. The only sign of glam were the long, edgy black nails she rocked the evening before. Rita, 32, was spotted checking out of The Bowery Hotel in New York City on Tuesday alongside her husband, 47, who also attended the Met Gala with her. ",
        "He too kept it casual with sunnies and a hat as he rolled their belongings out of the fancy hotel.The Marvel director wore a black hoodie, leather jacket, and faded blue jeans.  Rita had quite the Monday evening celebrating fashion's biggest night alongside her husband and a slew of other stars. But it seems she may have had a little too much fun - she joked she about having a hangover on her Instagram Stories on Tuesday.The post began with Rita getting all glammed up before it transitioned with her in bed, looking crummy.'I forgot to finish my transition so enjoy my hangover,' she wrote in bold font. At least Rita will be able to take comfort knowing she was looking amazing the night prior  ",
        "It all started with her sizzling at the ball in a black sheer gown that hugged every inch of her jaw-dropping figure.",
        "Her barely there frock boasted floral lace appliqué and perfectly placed chiffon along with a huge dramatic train.Meanwhile husband Taika looked suave in a long gun metal blazer which he wore shirtless and teamed with smart white trousers.He added extra style to the ensemble with pearls as well as a black floral corsage.The party continued after the gala for the couple, who were also spotted attending a star-studded after party at Zero Bond. ",
        "Rita showcased her sizzling physique in a risque black co-ord which was heavily adorned with gold chains and pearls all over. She layered the eye-catching look with a fur and snakeskin coat, while adding a pair of opaque tights with towering platform heels.The seriously accessorised look also included a pair of oversized earrings and a series of chunky bangles, teamed with a pair of cool vintage shades.Rita wore her blonde locks in loose beachy waves and opted for a neutral pallet of make-up in bronzed tones. "
    ]
}