{
    "articleURL": "/wires/reuters/article-12052133/Man-Utds-Garnacho-involved-against-West-Ham-says-Ten-Hag.html",
    "content": [
        "May 5 (Reuters) - Manchester United winger Alejandro Garnacho could return from an ankle injury that has sidelined him for two months when they face West Ham United on Sunday, manager Erik ten Hag said as the Old Trafford outfit look to improve their away record.",
        "United have failed to beat a team in the top nine of the table away from home this season and the 18-year-old Argentine's return to fitness could give Ten Hag's side a chance to improve their sloppy form.Garnacho has had an excellent debut season, scoring four times and providing five assists in all competitions.\"I think it will be the same squad (that played against Brighton &amp;amp; Hove Albion). Maybe one player: Garnacho. I have to see. Maybe he can be involved, but we will have to see how the progress can go,\" Ten Hag told reporters.United, who are fourth in the Premier League, are four points ahead of fifth-placed Liverpool with a game in hand.Ten Hag's team have five league games left, starting with the weekend's trip to West Ham, before they face derby rivals Manchester City in the FA Cup final.The Dutchman said he is confident United can recover from their 1-0 loss at Brighton and perform well in the final games of the season but urged the side to show character after a poor result.\"We have every time in the season, when we had a defeat, then we bounced back. So I count on my team, we have to do it again,\" Ten Hag said.",
        "\"The players have to take responsibility and I count on them. We have everything in our hands, so we have to focus on our performance... I am quite confident about that.\"We need to be there, in the Champions League (next season). We want to be there because we want to challenge the best teams in the world so we do everything in our power to get that done.\" (Reporting by Pearl Josephine Nazare in Bengaluru Editing by Toby Davis)"
    ]
}