{
    "articleURL": "/wires/ap/article-12058151/Reinhart-hero-Panthers-Leafs-OT-3-0-lead.html",
    "content": [
        "SUNRISE, Fla. (AP) - Florida briefly limited ticket sales for their series against Toronto to fans with U.S. credit cards, a decision that some Maple Leafs fans thought was designed keep them from coming to Games 3 and 4.",
        "The Panthers might be able to keep them from a Game 5 in Toronto, too.Sam Reinhart scored 3:02 into overtime and the Panthers - who had to fight just to squeak into the playoffs, then stunned Boston in Round 1 - are on the brink of their first conference finals appearance since 1996. Florida topped Toronto 3-2 on Sunday night, taking a 3-0 lead in their Eastern Conference semifinal series.\"We've had a lot of guys stepping up at big moments,\" Reinhart said.None bigger than he did to win it. Reinhart dumped the puck off the boards behind the net to set up his game-winner, then headed behind the goal to take a pass back from Anton Lundell. Reinhart twirled his way to the front, tapped the puck home and just like that, Florida had its first series lead in 27 years.\"There's a lot of things going our way,\" said Florida defenseman Aaron Ekblad, whose team has won six consecutive playoff games for the first time in franchise history. \"We're just trying to take it day by day ... just doing the right things to make us successful.\"",
        "Anthony Duclair and Carter Verhaeghe scored for Florida. Sam Lafferty and Erik Gustafsson scored for Toronto, which had plenty of fans there - ticket sales for all opened 24 hours after the online purchasing window opened last week. They left disappointed; Florida's left thrilled.",
        "\"They've been good,\" Panthers coach Paul Maurice said of Florida's fans. \"Now they're excited.\"Sergei Bobrovsky stopped 22 shots for the Panthers. Joseph Woll stopped 18 of the 21 he faced for the Maple Leafs after he relieved starter Ilya Samsonov, who stopped all eight shots he saw before leaving early in the second period with an injury.Game 4 is Wednesday night, with Florida in position for a sweep and a spot in the conference finals against Carolina or New Jersey.\"Got to win one game,\" Leafs coach Sheldon Keefe said. \"That was the mission here tonight. Got to start with one and give yourself a chance. They're in full control here; it's up to us to make it uncomfortable for them and not go away. We still have tremendous belief in our group.\"Reinhart's goal for that 3-0 lead means it's time for the Maple Leafs to spend the next three days hearing about the most dreaded of stats three games into a best-of-seven - the one about how only four clubs have erased such a deficit in hockey history. Toronto is one of those four, coming from 3-0 down to beat Detroit in the 1942 Cup final.\"Obviously, it's do-or-die now,\" Leafs center Auston Matthews said. \"So, it starts with one game.\"",
        "And they may have a new starting goalie as well. Samsonov left the ice 37 seconds into the second period with an undisclosed injury. He was ruled out before the third period started and Keefe had no postgame update on his condition.The play started with Samsonov stopping a shot by Duclair, as Verhaeghe came down the slot chasing the rebound.Verhaeghe got tripped by Toronto´s Luke Schenn, and Schenn also crashed into Samsonov on the same play. Samsonov remained down for more than a minute, eventually got to his feet and skated to the Toronto bench - going directly down the tunnel to the Maple Leafs´ locker room.Woll replaced Samsonov, coming in cold to face the Florida power play. Woll stopped the first shot he faced, but Duclair scored with 1 second left on the power play to tie the game at 1-1.Toronto led 1-0 and 2-1, only to see Florida come back with the tying goal each time.Lafferty one-timed a pass from David Kampf home just 2:26 into the contest to finish off a 2-on-1 and open the scoring. Gustafsson´s wrister made it 2-1 when it caromed in off Marc Staal´s stick midway through the second. Verhaeghe tied it 5 minutes later and to the third they went, tied at 2-2.",
        "It stayed that way until Reinhart decided they'd played enough.\"Really happy for him,\" Maurice said.AROUND THE RINKMatthews took a puck off the outside of his right wrist in the third period, was shaken up and remained in the game - appearing to not even miss a shift. ... Toronto is now 34-47 all-time in Game 3s. Florida is now 5-8. ... There were only two penalties called in regulation, both against Toronto in the second period.WOLL TIESThere is one big tie between Woll and the Panthers - he was Boston College´s go-to netminder for three years, before Spencer Knight took over for the Eagles in the 2019-20 season.Knight has been with the Panthers for parts of three seasons and has been out since February in the NHL´s player assistance program.THE CAPTAINMiami Heat captain Udonis Haslem - wearing a Duclair jersey - was at the game with some teammates including Heat guard Gabe Vincent, and did his part to get fans engaged by beating a drum at one end of the rink shortly before game time.\"I got cool with Duclair a couple years ago, and told him that when I had time I would come out,\" said Haslem, whose Heat lead New York in a second-round series 2-1 with Game 4 in Miami on Monday. \"It´s amazing here right now. South Florida sports, we always feel like the underdogs, but these guys on the Panthers, the heart they play with, it´s inspiring to see.\"",
        "___AP NHL playoffs: https://apnews.com/hub/stanley-cup and https://twitter.com/AP_Sports"
    ]
}