{
    "articleURL": "/femail/article-12042891/Man-won-99k-ITV-quiz-kept-money-secret-family-one-year.html",
    "content": [
        "Daniel, 24, from Wirral only told his grandmother of his winningsREAD MORE: 'I'm a millionaire but I hide my wealth from my family' A man who won a whopping £99,000 on an ITV quiz show has revealed how he managed to keep the cash a secret from his family for a whole year.",
        "Daniel O’Halloran, from Bebington, Wirral, said he couldn't believe it when he went home with the jackpot after appearing on the 1% Club in 2022.The game show, hosted by comedian Lee Mack, tests the logic and common sense of its contestants - with one lucky winner out of 100 walking away with with fortune.The 24-year-old declined the chance to walk away with only £10,000 and instead risked it all for the grand prize.Speaking to the Chester Standard, the plant operator explained how he kept the true scale of his winnings a secret from his family for almost an entire year -only informing his grandmother of his big win.",
        "He filmed his feature episode back in July 2022 in Manchester, however it wasn't televised until Saturday April 29.He said: 'For the last nine months, my family had thought I’d taken the £10,000 because I wouldn’t have been able to keep a whole secret. On Saturday, we all watched it together and when I said I would take on the question they were just going nuts.'As huge fans of the game show, Daniel's parents were elated to see their son on the big screen, especially as it was his mum's idea to apply for the show.He added that he initially had no intention of going on the show, but a surprise call back from producers settled his nerves.",
        "Daniel said he really liked the format of the show and it's 'logic-based working out of things' but did concede that he almost succumbed to the live pressure.He said: 'I didn’t know how I was going to do it. You only have 30 seconds on each question, but I just got my head in it for those 30 seconds. I remember on the day, my mum and dad both called me for half an hour separately and quizzed me, which was my revision.'He was adamant that he'd answered a few questions incorrectly, but kept his head in the game and stood strong until the end.  ",
        "The lad has sure made his family proud, after offering to take them to a number of festivals this year - with a promise to foot the costs.Daniel has also become somewhat of a neighbourhood hero, and is taken aback by the outpouring of support and positivity from the local community.He said the experience has been an incredible one, and everyone he met on the show was 'kind and lovely'."
    ]
}