{
    "articleURL": "/wires/reuters/article-12039115/Ford-revenue-rises-20-demand-SUVs-pickup-trucks.html",
    "content": [
        "By Joseph White and Nathan Gomes",
        "May 2 (Reuters) - Ford Motor Co on Tuesday posted robust first-quarter revenue and profit, thanks to strong demand for trucks and SUVs, but issued a measured full-year outlook tempered by continued losses in its electric-vehicle unit.In a late briefing, Ford Chief Executive Officer Jim Farley said he hopes the company becomes \"boringly predictable\" at meeting investor expectations. Ford missed Wall Street estimates for the fourth quarter, leaving $2 billion on the table, Farley said earlier this year.Farley also said Ford does not intend to pursue EV sales volume \"at any cost\" - after the automaker earlier in the day slashed Mustang Mach E prices for a second time this year.Farley's stance contrasts sharply with that of Tesla Inc CEO Elon Musk, who said last month that the EV maker could cut profit margins on vehicle sales to zero and make up the difference through sales of software-enabled services. Tesla, however, has the advantage of earning higher profit margins on its EVs than Ford and other legacy automakers have across their full portfolios.Facing declining demand for its products in China, Ford will restructure its operations there to run on lower investment, and \"double down\" on its commercial vehicle business there, including EVs, Farley said. Ford's joint venture with Chinese automaker JMC Corp can become an export hub for lower-cost commercial electric and combustion vehicles, he added.",
        "Ford handily beat analysts' expectations for first-quarter earnings before interest and taxes, reporting EBIT of $3.4 billion, compared with consensus of $2.4 billion.The automaker reaffirmed guidance for full-year adjusted EBIT of $9 billion to $11 billion. Those numbers include an anticipated loss of $3 billion in Ford's Model e electric vehicle unit.Shares were down 2% in after-hours trading.Although U.S. vehicles sales in April were much stronger than expected, Ford cautioned that \"higher industrywide customer incentives as vehicle supply-and-demand rebalances\" will be a \"headwind\" for profitability.AGGRESSIVE MOVESThe company for the first time broke out financial results for its Ford Blue, Ford Pro and Ford Model e units. Ford Blue earnings before interest and taxes doubled to $2.56 billion, a margin of 10.4%, and Ford Pro EBIT nearly tripled to $1.4 billion, a margin of 10.3%.Ford's overall EBIT margin was 8.1%, after factoring in losses from Model e.For 2023, the automaker expects full-year EBIT for Ford Blue to climb slightly to $7 billion, while Ford Pro EBIT could nearly double, to almost $6 billion.Ford lost more than $60,000 per electric vehicle sold in the first quarter. Its combustion-vehicle business, Ford Blue, averaged pretax profit of $3,715 a vehicle, while the Ford Pro commercial business earned $4,053 per vehicle, based on the company's financial data.",
        "In a briefing, Chief Financial Officer John Lawler said the company is on track for its Model e electric vehicles to be EBIT margin-positive by the end of 2024. Ford expects the unit to post an EBIT margin of 8% by the end of 2026, a target CEO Farley described as \"totally realistic\" given the company's \"aggressive\" moves to take cost out of its next-generation EVs.Demand for the electric Ford F-150 Lightning pickup is \"really, really strong,\" Farley said. Ford is sticking with plans to boost Lightning production to a rate of 150,000 vehicles a year by the end of this year.In the meantime, the company expects continued pricing pressure on its Ford Blue combustion models, while Ford Pro commercial vehicles retain some pricing strength.Ford's profit in the first quarter was $1.8 billion, or 44 cents per share, compared with a loss of $3.1 billion, or 78 cents per share, a year ago. Adjusted diluted earnings per share were 63 cents, compared with 38 cents a year ago. Analysts had expected 41 cents.The Dearborn, Michigan-based company reported revenue of $41.5 billion for the quarter through March, compared with $34.5 billion a year ago.(Reporting by Nathan Gomes in Bengaluru and Joseph White in Detroit Writing by Paul Lienert Editing by Ben Klayman and Matthew Lewis)"
    ]
}