{
    "articleURL": "/news/article-12044205/Pharmacists-share-anti-government-ads-attacking-Albanese-governments-60-day-drug-script-policy.html",
    "content": [
        "Pharmacists are printing anti-government adsThey are in reaction to the new drug script policyPharmacists are printing anti-government advertisements as they lash out against a new drug policy that will drastically cut the cost of medicine. ",
        "Health minister Mark Butler announced last Wednesday plans to introduce a 60-day drug script policy that will allow patients to buy double their supply of some prescription medicines from next January.The plan was recommended by the Pharmaceutical Benefits Advisory Committee and endorsed by doctor's groups and the Consumer Health Forum (CHF). ",
        "It will see 325 drugs dispensed in 60-day doses instead of the current 30 days, effectively halving medicine costs and saving patients $180 a year.The policy has been slammed by the Pharmacy Guild who warn it could bankrupt pharmacies or see staff lose their jobs as it reduces the income of chemists.Pharmacists have been printing anti-government advertisements on patient prescription forms and putting leaflets inside packages arguing against the policy.The ad features the words 'UNDER THREAT, UNDER THREAT' in bold above a picture of Prime Minister Anthony Albanese.Below the image it reads: 'ALP budget cuts risk medication shortages and pharmacy viability'.There is a URL included under the material that takes patients to a website filled with anti-government messages and a petition to fight against the policy. The CHF has criticised the reaction of the pharmacy guild and some pharmacists in printing anti-government ads.CHF CEO Dr Elizabeth Deveny said the messaging was 'concerning' and urged the Pharmacy Guild 'to reconsider their efforts'. ",
        "'In the last couple of weeks we've seen the Pharmacy Guild, which represents pharmacy owners, create unnecessary alarm and concern among consumers but this is one step too far,' she said. 'We have not seen this done before on scripts and it is definitely not in the best interests of patients.'Dr Deveny reiterated CHF's support for the policy, saying it will help patients doing it tough. 'This is a really good move which shows the government is listening to the voices of consumers,' she said.'Every dollar saved at the pharmacy is money that can be spent on groceries or rent.'",
        "Australian Pharmacy Guild president Trent Twomey, who was previously criticised for his views on Covid-19, has been a vocal critic of the plan after it was announced last week.He brashly called for government MPs to 'get off your a***' and talk to pharmacists' at Parliament House in Canberra last week.Mr Twomey said pharmacists will lose money from out-of-pocket patient fees, which the Pharmacy Guild estimates at $2.3billion over four years compared with the government's figure of $1.6billion. 'They're not refunding that,' he said. 'The pharmacist is wearing the complete rest of the cut.'And that's what's going to send these guys to the wall. And (Mr Butler) just doesn't seem to give a s***.'",
        "He added that chemists would have to cut staff, reduce hours and slash services due to losing $170,000 each year under the change.Former deputy chief health officer Dr Nick Coatsworth told Daily Mail Australia that the changes would undoubtedly lead to savings for Aussies, but warned there could be consequences. 'The main benefit of these changes would be that patients with longer term drug prescriptions would reduce the number of visits to their pharmacy, and make subsequent savings as well in dispensing fees.'However, we're concerned about the implementation of this policy, and the detail is important.'",
        "He explained that the change doesn't address three main concerns for Australians when it comes to health care. 'Does this in any way improve access to primary care? And the answer is no. It doesn't increase the number of consultations, in fact, it decreases them.'People with chronic conditions are effectively seen less often with this policy because you can get 12 months supply instead of six months supply of medication.'The second issue is the affordability side of things. With the change you can save $160 a year. This helps but, actually, it's not going to make much of change when grocery bills are going up 50 bucks a week. 'The improved affordability is welcomed, but it's very small. I hope the minister's got more in the budget to improve health care affordability for people on long term medications.'"
    ]
}