{
    "articleURL": "/wires/aap/article-12040893/Goodwin-understand-fans-boycott-ALM-finals.html",
    "content": [
        "Adelaide United captain Craig Goodwin understands if fans decide to boycott the A-League Men finals series to send a message as unrest over the decision to sell the grand final to NSW continues.",
        "Sydney FC active supporter group the Cove are boycotting the playoffs, starting with Saturday night's derby final against Western Sydney, though Wanderers counterparts the RBB will be there.Melbourne City active supporters Yarra End Collective have also said they intend to boycott the finals.Both the Sydney and City active supporter groups cited a lack of communication and follow through on promises to fans from the Australian Professional Leagues.The June 3 grand final will be held at Sydney's CommBank Stadium as part of a three-year deal with Destination NSW.Adelaide finished third and will host sixth-placed Wellington at what Goodwin still hopes will be a packed Coopers Stadium in their elimination final on Friday night.\"That's up for the fans and the supporter groups to decide for themselves,\" Goodwin told reporters.\"Obviously from the decision they feel hurt and unheard and undervalued.\"So fans are going to make their decision on what they want to do.\"From a player's perspective, of course, always we want to have a packed stadium but if that's the way that they want to get their message across, then that's up to them to decide.\"Previously, the grand final hosting rights were awarded to the highest-ranking team to reach the decider.Socceroos winger Goodwin was one of the strongest opponents of the decision to sell the grand final to Sydney when it was announced.",
        "\"I've made my feelings quite clear in the previous months,\" he said.\"It does take away I guess, the home advantage which is something you work so hard for in the regular season\"Obviously having the finals series, that's what you push so hard for, to get that first or second spot to have the best possible chance of hosting a grand final.\"Unfortunately it is what it is for the time being in this year and we just have to focus on Friday night and Wellington and putting ourselves in the best position that we can.\"We've had a tremendous season and regardless of where the grand final's being held, I really back us to have a really good chance of winning it this year.\""
    ]
}