{
    "articleURL": "/wires/ap/article-12044527/Haase-HR-5-RBIs-Tigers-rally-6-5-win-Mets.html",
    "content": [
        "DETROIT (AP) - Eric Haase homered in both games of a doubleheader, driving in six runs, and the Detroit Tigers tagged Max Scherzer in his return from a suspension to sweep the New York Mets with an 8-1 victory Wednesday night.",
        "Haase had five RBIs in the first game, including a go-ahead single in the eighth inning of a 6-5 comeback win, and then added one of Detroit´s two homers off Scherzer in the nightcap.The slumping Mets have lost eight of 10. They were playing their second consecutive doubleheader in three days after getting rained out three times since Saturday.In the second game, Scherzer struggled against his former team. Detroit scored twice in the first inning, Haase homered in the second and Matt Vierling hit a two-run homer in the fourth.Scherzer (2-2) allowed six runs and eight hits in 3 1/3 innings. He was suspended for 10 games by Major League Baseball on April 20 after getting ejected for having a foreign substance on his pitching hand during his April 19 start against the Los Angeles Dodgers.Michael Lorenzen (1-1) allowed one run in seven innings to get his first win with Detroit, which is 2-14 against the AL East and 10-3 against the rest of baseball.",
        "The Tigers trailed the first game 5-4 in the eighth, but Vierling singled with one out and Adam Ottavino (0-2) hit Javier Baez with a pitch. Riley Greene grounded to first for the second out, but Haase hit a two-run single to right-center.",
        "Tyler Alexander (1-0) got the win by retiring the last batter in the eighth. Alex Lange pitched the ninth for his fourth save.YANKEES 4, GUARDIANS 3, 10 INNINGSNEW YORK (AP) - Willie Calhoun hit a tying single in the ninth inning and pinch-hitter Jose Trevino came through with a game-ending single in the 10th, lifting New York to a win in a game it had two more players get hurt.Yankees center fielder Harrison Bader, back from the injured list just a day earlier, left after a ninth-inning collision with Isiah Kiner-Falefa, and Oswald Peraza limped off after hurting an ankle as a pinch runner.Calhoun and Jake Bauers homered in the fifth off Shane Bieber as the Yankees erased an early 2-0 deficit.Pinch-hitter Oscar Gonzalez had an RBI single in the top of the ninth to put Cleveland ahead 3-2, but Calhoun's singe in the bottom half of the inning tied the score.Albert Abreu (1-0) got Josh Naylor to ground into an inning-ending double play in the 10th to get the win.With the automatic runner on second, Trevor Stephan (1-1) walked Bauers leading off the bottom of the 10th and Kiner-Falefa sacrificed. Trevino then blooped a single to center over the drawn-in infield, boosting the Yankees to 17-15.",
        "Cleveland has lost five straight series and 11 of its last 16 games.NATIONALS 2, CUBS 1WASHINGTON (AP) - CJ Abrams had a tiebreaking RBI single in the seventh inning for the second consecutive game, and Washington beat Chicago.After Marcus Stroman pitched six crisp innings for the Cubs, the Nationals went ahead on four pitches by Adbert Alzolay (1-1). Lane Thomas tripled down the left-field line, the first extra-base hit of the game, and Abrams lined the next pitch to center.Jake Irvin held the Cubs to two hits over 4 1/3 innings in his major league debut, and five Washington pitchers limited Chicago to six singles. Carl Edwards Jr. (1-1) retired the side in the seventh, Hunter Harvey worked the eighth and Kyle Finnegan induced a game-ending double-play grounder from Patrick Wisdom for his seventh save.The Cubs have lost five of six, all to NL East foes, and fell to .500 for the first time since April 9.GIANTS 4, ASTROS 2HOUSTON (AP) - Wilmer Flores homered and Joey Bart and Austin Slater had two hits each to lead San Francisco.Slater drove in a run to put the Giants up in a two-run sixth, and an RBI double by Bart extended the lead to 3-0 in the seventh.",
        "Alex Bregman got Houston within a run with a two-run home run in the eighth before Flores added some insurance for the Giants with a solo shot in the ninth.San Francisco starter Logan Webb (2-5) yielded five hits and two runs in 7 2/3 innings, and Camilo Doval pitched a scoreless ninth for his fifth save.Houston´s Framber Valdez (2-4) allowed five hits and two runs with eight strikeouts in six innings.WHITE SOX 6, TWINS 4CHICAGO (AP) - Eloy Jiménez hit a tiebreaking RBI single in the seventh inning to lead Chicago to its third straight victory.Luis Robert Jr. homered as the White Sox secured their first series win of the season. Tim Anderson and Yasmani Grandal each had three hits, and Keynan Middleton worked the ninth for his first save of the season.Carlos Correa had two RBIs for Minnesota, and Nick Gordon homered for the second straight day.Jiménez drove in Andrew Benintendi with his single to left against Griffin Jax (1-3). The White Sox added an insurance run in the eighth when pinch-runner Billy Hamilton scored from second on Elvis Andrus´ grounder to second.Aaron Bummer, Gregory Santos (1-0), Kendall Graveman and Middleton combined for four scoreless innings in relief of Dylan Cease. Santos earned his first major league win after working out of a bases-loaded, no-out jam in the top of the seventh.",
        "ANGELS 6, CARDINALS 4ST. LOUIS (AP) - Mike Trout and Jake Lamb hit solo homers in the ninth inning, Shohei Ohtani tied a career-high with 13 strikeouts and Los Angeles rallied to beat St. Louis.Los Angeles has won six of its last eight games, while the Cardinals have lost five in a row.Ohtani didn´t get the decision, but did become the second player in MLB history to record 500 career strikeouts and hit at least 100 home runs, joining Babe Ruth. Ohtani gave up four runs on five hits over five innings and allowed two home runs for the second straight outing.The Angels trailed 4-3 heading into the top of the ninth before Lamb launched his second homer of the season to right-center off Giovanny Gallegos (1-1), tying the game at 4. With one out, Trout hit his eighth home run of the season to left for the eventual game-winning run. Anthony Rendon added a run-scoring hit.Brandon Drury also homered for the Angels. Ryan Tepera (2-1) earned the win and Carlos Estevez picked up his seventh save of the season.Dylan Carlson and Nolan Gorman homered for St. Louis, which at 10-21 is off to its worst start since the 1973 squad opened the season 8-23.",
        "RAYS 8, PIRATES 1ST. PETERSBURG, Fla. (AP) - Shane McClanahan became baseball´s first six-game winner and Tampa Bay routed Pittsburgh.McClanahan (6-0) gave up one run on five hits over six innings, striking out nine and lowering his ERA to 2.03. Josh Lowe and Wander Franco homered off Pittsburgh relievers as the Rays improved to 25-6.Since 1961, only the World Series-winning 1984 Detroit Tigers (26-5) had more wins through 31 games. Tampa Bay has outscored its opponents 207-94. The Rays lead the majors with 64 home runs.Andrew McCutchen homered for the Pirates (20-11), who have their first three-game losing streak of the season.Yandy Díaz got the first Rays hit off Mitch Keller (3-1) with two outs in a three-run third with a single and later scored when shortstop Rodolfo Castro was charged with an error after misplaying Harold Ramírez´s grounder. Brandon Lowe made it 3-1 with a two-run double. McCutchen had hit a solo homer in the top of the third.DODGERS 10, PHILLIES 6LOS ANGELES (AP) - Max Muncy hit a game-ending grand slam and Los Angeles rallied from an early five-run deficit for a season-high sixth straight win.Bryce Harper doubled to start a four-run second inning and reached base five times in his second game of the season for the Phillies, who lost their fourth straight.Los Angeles swept the three-game series, outscoring the defending NL champions 36-11 and reaching double digits in every game.Pinch-hitter Austin Barnes gave the Dodgers a 6-5 lead with a two-run single in the eighth, but Philadelphia tied it in the ninth. Harper singled, Nick Castellanos walked and Bryson Stott delivered an RBI single against Brusdar Graterol (1-1).Chris Taylor singled leading off the bottom half against former Dodgers reliever Craig Kimbrel (1-1) and stole second. Mookie Betts struck out before Freddie Freeman was walked intentionally. Will Smith drew a walk that loaded the bases, and Muncy launched the next pitch into the right-field seats for his major league-leading 12th home run.RED SOX 8, BLUE JAYS 3BOSTON (AP) - Enmanuel Valdez, Triston Casas and Masataka Yoshida each drove in two runs and Boston won its fifth straight.Nick Pivetta (2-2) went six innings and gave up three runs, including solo home runs by Daulton Varsho and Vladimir Guerrero Jr. - whose shot in the third cleared the Green Monster and left Fenway Park.Alek Manoah (1-2) allowed five runs, two earned, and eight hits in five innings for Toronto.Manoah held Boston hitless until there were two outs in the third, but encountered a rough stretch after getting hit in his right calf by a sharp line drive off the bat of Rafael Devers with one out in the fourth. Devers took second when catcher Alejandro Kirk fielded the carom and threw the ball into right field. Devers advanced to third when Manoah´s pick-off attempt sailed into center and scored on Jarren Duran´s double. Casas´ single tied the game at 2.Toronto took the lead in the fifth when Kevin Kiermaier led off with a double, took third on George Springer´s sacrifice fly and scored on a balk by Pivetta. But the Red Sox went ahead 5-3 in the bottom of the inning by scoring three unearned runs off Manoah with two outs, including a two-run single by Valdez.PADRES 7, REDS 1SAN DIEGO (AP) - Rookie Brett Sullivan hit his first home run and had his first four RBIs, and Juan Soto hit a three-run double to make up for a baserunning blunder that cost Xander Bogaerts a club-record on-base streak as San Diego beat Cincinnati.Seth Lugo (3-2) pitched six strong innings for the Padres, who have won seven of 10 heading into a home weekend series against the rival Los Angeles Dodgers. It´ll be the teams´ first meeting since the Padres eliminated the 111-win Dodgers in four games in the NL Division Series to reach their first NL Championship Series in 24 years.The 29-year-old Sullivan, catching a day game after a night game, hit a two-run double down the right field line with one out in the second and then drove a two-run homer to right with two outs in the fourth. His two-run double, off Luis Cessa (1-4), snapped the Padres´ 0-for-15 skid with runners in scoring position.ROCKIES 7, BREWERS 1DENVER (AP) - Kyle Freeland pitched five scoreless innings, Kris Bryant and Charlie Blackmon homered and Colorado got its season-high third straight win.Alan Trejo hit a three-run double and Elías Díaz had an RBI single as the Rockies improved to 9-3 in their last 12 games against the Brewers.Already ahead 4-0, the Rockies added to their lead in the seventh when Jurickson Profar doubled off Tyson Miller and Bryant launched his fourth homer. Blackmon connected for a solo shot off Jake Cousins in the eighth.Eric Lauer (3-3) went 4 2/3 innings for Milwaukee, allowing four hits and four runs - none earned. Third baseman Mike Brosseau made a throwing error in Colorado´s four-run fourth.Freeland (3-3) gave up three hits, walked none and struck out five in snapping his three-game losing streak. Five relievers finished a five-hitter.DIAMONDBACKS 12, RANGERS 7ARLINGTON, Texas (AP) - Christian Walker homered twice before he drew a bases-loaded walk that put Arizona ahead to stay.Walker put the Diamondbacks ahead 3-1 with his three-run homer in the third, added a solo shot in the fifth that chased Texas starter Andrew Heaney and walked on four pitches from Jose Leclerc in the seventh that drove in the run that snapped a 7-7 tie.Each team hit four homers on the mostly sunny, 79-degee day with the roof open.Ketel Marte and Emmanuel Rivera also homered for Arizona, which matched its season high for runs. Walker matched his career-best with five RBIs in his sixth career multihomer game.Josh Jung hit two homers for the Rangers, who had a four-game win streak snapped. Jonah Heim and Leody Taveras also went deep.Joe Mantiply (1-0), the third Arizona pitcher, threw 1 1/3 scoreless innings. Josh Sborz (0-1), the second of five Texas pitchers, allowed three runs over 1 1/3 innings.ROYALS 6, ORIOLES 0KANSAS CITY, Mo. (AP) - Vinnie Pasquantino homered and drove in three runs, Zack Greinke won for the first time since last August and Kansas City snapped a 10-game home losing streak.Greinke (1-4) won for the first time in 14 starts, allowing just three singles in five innings and striking out three. He threw only 44 pitches -- his fewest in a start since tossing 43 for Arizona at Boston on Aug. 14, 2016.The Royals won their second home game of the season to improve to 2-13 at Kauffman Stadium.Pasquantino homered into the right-field bullpen to give Kansas City a fourth-inning lead in a game that lasted just 1 hour, 59 minutes. He doubled in another run in the sixth to put the Royals up 2-0.The Royals knocked Kyle Gibson (4-1) out of the game with four runs in the seventh, highlighted by Pasquantino´s second RBI double.BRAVES 14, MARLINS 6MIAMI (AP) - Marcell Ozuna hit a grand slam among his two home runs, Ronald Acuña Jr also homered and Atlanta went deep six times to roll past Miami.Acuña´s three-run shot to center field in the fifth inning was his sixth home run of the season and made it 11-4 before Austin Riley homered to left-center to add two more runs.Only the Tampa Bay Rays and Los Angeles Dodgers have recorded more home runs so far this season than the Braves (52). Acuña is hitting .358 and leads the majors with 43 hits and 14 stolen bases.The Braves sent 12 batters to the plate against starter Braxton Garrett (1-1) in a seven-run second. Ozuna also had a solo homer in the third and was 3 of 5 with five RBIs.Michael Harris II had a two-run homer in the second, and Ozzie Albies added an RBI double. Albies was 4 of 5 with two RBIs and had a solo shot in the eighth. He leads Atlanta with eight home runs this season.Collin McHugh (1-0) pitched three scoreless innings of relief for the win.MARINERS 7, ATHLETICS 2, 10 INNINGSOAKLAND, Calif. (AP) - Eugenio Suárez hit a three-run homer in the 10th inning after AJ Pollock tied the game with a solo home run in the ninth, and Seattle defeated Oakland.The start was delayed 65 minutes by rain, contributing to a paltry crowd of 2,685 one night after the A´s drew 2,583.With two outs in the 10th, Suárez connected off Adam Oller (1-1) to give the Mariners their first lead. Seattle then loaded the bases and J.P. Crawford added a two-run single to make it 7-2.Pollock homered off Zach Jackson with one out in the ninth, his second straight game with a tying home run in the late innings.Oakland´s bullpen was charged with a blown save for the fourth consecutive game. The A´s have lost their first 10 series for the first time in franchise history.Matt Brash (3-2) pitched 1 2/3 scoreless innings to get the win.___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}