{
    "articleURL": "/wires/reuters/article-12046741/Westinghouse-unveils-small-modular-nuclear-reactor.html",
    "content": [
        "By Timothy Gardner",
        "WASHINGTON, May 4 (Reuters) - U.S. company Westinghouse unveiled plans on Thursday for a small modular reactor to generate virtually emissions-free electricity that could replace coal plants or power water desalinization and other industries.Rita Baranwal, the Westinghouse Electricity Co's top technology officer, said the reactor, dubbed AP300 for its planned 300 Megawatt capacity, will not use special fuels or liquid metal coolants unlike some other next-generation reactors.It will be a smaller version of its AP1000 reactor, several of which are operating in China, and which are ramping up in Georgia at the Vogtle plant, after years of delay and billions of dollars over budget.Despite hurdles for new nuclear, Baranwal was confident. \"We've kept it simple, designed it on demonstrated and licensed technology, and I think that's one of the advantages that we have with this concept,\" she told Reuters in an interview. Westinghouse, owned by Brookfield Business Partners, plans to start constructing the reactor by 2030 and have it running by 2033.Small modular reactors (SMR) are meant to fit new applications such as replacing shut coal plants and being located in more remote communities. President Joe Biden's administration believes that maintaining existing nuclear plants and developing next-generation reactors is crucial for its goal of decarbonizing the economy by 2050.",
        "So far the design for only one SMR, planned by NuScale Power Corp, has been approved by U.S. regulators and it still needs permits.Westinghouse did not reveal how much the first reactor would cost, but said later units would cost about $1 billion. The company, based in western Pennsylvania, has had informal talks with parties in neighboring states Ohio and West Virginia about the potential building of AP300s at former coal plants.Westinghouse also hopes to sell reactors to countries in eastern Europe, even though nuclear power critics have expressedconcernsthat developers and governments should think carefully before building new nuclear plants anywhere near the region. They noted that Russia took the Zaporizhzhia nuclear power plant in Ukraine, the site of repeated shelling.Baranwal said Russia's actions have made countries motivated to become more energy independent and the AP300 will be passively safe because it does not need power supply or human intervention for 72 hours in the event of an incident.Westinghouse also sees potential customers in sub-Saharan Africa, which could bring electricity for the first time to some areas.The company is not sure yet whether the technology can be exported to China, where the first AP1000s began operations in 2018. That year, former President Donald Trump's administration issued restrictions on exports of nuclear technology newer than the AP1000 due to nuclear proliferation concerns.",
        "Baranwal said if the U.S. government deems AP300 to be a subset of the earlier reactor technology \"then we can start entertaining the possibilities\" of exporting it to China. (Reporting by Timothy Gardner; Editing by David Gregorio)"
    ]
}