{
    "articleURL": "/news/article-12042153/Carer-kept-disabled-man-enslaved-affair-wife-tells-jury-make-mistakes.html",
    "content": [
        "Carer George Webb said affair with wife of man he looked after was a 'mistake'Webb and Sarah Somerset-How accused of holding her husband Tom in slaveryA live-in carer accused of keeping a disabled man in slavery while having an affair with his wife today told a jury 'we all make mistakes' when asked about the fling.",
        "George Webb said starting a relationship with Sarah Somerset-How while she was still married to husband Tom was one of his 'biggest mistakes ever', and that he did not want to get involved in the relationship because he is 'not Jeremy Kyle'.But he said the couple were 'very unhappy' when he first met them and that Mrs Somerset-How had told him she had doubts about marrying the cerebral palsy sufferer 'from the start'.As a result, he said he tried to give them both advice on their relationship, which included telling her to 'find herself 'a man'.Webb and his lover are accused of imprisoning her husband in the house the three shared, barely keeping him alive as she spent his money while treating him 'like a piece of property'.",
        "Mrs Somerset-How is accused of using her 40 year old husband - who requires 24 hour care - as a 'cash cow' to swindle him out of his inheritance.Today, Webb, 50, told the court he didn't want to get 'involved' in the married couple's relationship but gave 'advice' to them both - recommending Mrs Somerset-How 'get rid' of her disabled husband.Somerset-How and Webb are charged with holding a person in slavery and ill-treatment by a care worker.Webb faces a charge of ABH against Mr Somerset-How after an incident in which he is accused of hitting him with a shoe.",
        "Mrs Somerset-How also faces charges of fraud and theft.Webb, who began caring for the 'intelligent' history graduate in 2016, today told jurors about his admitted affair with his employer's wife.Under cross-examination from prosecutor Paul Cavin KC, the carer was asked about texts where he told Mrs Somerset-How: 'Get rid of him. Go find yourself a man. I think you need to leave Tom and get your life back.'This was shortly after he started his employment with the couple in 2016.Webb told the jury: 'At that time, Tom and Sarah were back and forth with each other. Sarah was telling me she had doubts about marrying him from the start. I knew there were problems when I first started.'They were both very unhappy at that point. I didn't see the point of Sarah being somewhere she didn't want to be. They were arguing daily.'They both admitted to me the very first night of me being there they had a plan, and they were going to end on good terms.'I'm not Jeremy Kyle. I didn't know how to deal with their issues. I gave them both advice.'When the prosecution suggested he was 'happy to get involved', Webb said 'absolutely not'.",
        "The prosecution asked: 'This wasn't a situation where you were working closely together and fell in love over a long period of time. So why did you think it was appropriate to start having sex with the spouse of a client?'",
        "Webb replied: 'I know it wasn't appropriate. We all make mistakes. It is one of my biggest mistakes ever.'The court has heard that while the pair bought themselves lingerie and DJ equipment with cash Mr Somerset-How had been given by relatives, he was left as a 'prisoner in his own home'.They allegedly left wheelchair-bound Mr Somerset How - who is almost blind and needs 24-hour care - in bed for 90 per cent of the time, allowed him a shower once a week and went for a whole year without brushing his teeth.For food he would be left with only a packet of crisps and a sandwich, the court was told, while Webb and Somerset-How carried out their plan to 'ostracise' him from his family.The jury was told that eventually Mr Somerset-How managed to raise the alarm about how he was being treated with a friend who alerted his parents.They then staged a rescue with police and social services, 'an operation that had the marks of extracting someone as a hostage' from his home in Chichester, West Sussex, the court heard.Mrs Somerset-How and Webb deny the charges.The trial at Portsmouth Crown Court continues."
    ]
}