{
    "articleURL": "/tvshowbiz/article-12044587/Sweet-Tooth-Fans-Netflix-devastated-series-cancelled.html",
    "content": [
        "Fans of a major Netflix show have been left devastated after the streaming giant announced it would not be renewing it past season three.",
        "Sweet Tooth, produced by Robert Downey Jr, is based on a comic book of the same name by Jeff Lemire.It tells the story of post-apocalyptic future where humanity has been all but wiped out by a huge pandemic.As a result, human-animal hybrids begin to populate the planet, with Gus (Christian Convery) being half-human, half-deer.Gus, whose nickname is Sweet Tooth in the show, is the main character, with the world being shown through his innocent eyes.",
        "Netflix bosses announced this week they had renewed the show for its third and final season.The news prompted fans of the programme to take to Twitter to express their mixed views. One person wrote: 'Bittersweet that the story will be ending. I'm glad, with Netflix's track record, it's getting a chance to come to an end.'While someone else shared: 'Not Sweet Tooth coming with 2 seasons this year (2nd and 3rd) And the 3rd one being it's final season what I am supposed to watch after this show ends???''Just finished sweet tooth and i'm so glad they confirmed at the end the final season is coming. the end set everything up so well for one more season too,' tweeted someone else.While another person wrote: 'Happy about a third season but also sad to see it end so soon. Though a proper conclusion is much appreciated! So many shows drag on for too long and don't know when to stop. Looking forward to this!'",
        "Someone else posted: 'Season 2 of sweet tooth is so good I don't want it end.'And another fan wrote: 'THEY CANCELLED, gonna cry I don't want it to end roll on season 3.'",
        "It comes after terrified viewers of Netflix horror Hellhole claim they were so shaken by the show they were unable to get the movie out their heads 'weeks'.The Polish language film, released by the streaming giant last year, and is set in the country in 1987.It tells the gripping story of a police officer who is investigating mysterious disappearances.The cop infiltrates a remote monastery before uncovering the dark truth about its clergy.And many viewers of the frightening flick took to Twitter to express just how disturbed they were after watching, with some saying they could not get it out of their head.One person wrote: 'It's been over two weeks since I've watched Hellhole on Netflix and it's stuck in my brain!'While another person wrote: 'Watch Hellhole on Netflix. Slow burner but what an ending! Partner couldn't last though it, it was too gross.''I just finished Hellhole on Netflix and I'm sitting here thinking about it. It held my attention but wtf did I just watch?,' asked another viewer.",
        "Another shaken viewer tweeted: 'Was a bad decision to watch Hellhole on Netflix.'",
        "While someone else shared: 'Trying a Polish #horror today. #Hellhole on... naturally, all curtains are open AF.''This movie #Hellhole on Netflix is absolutely NUTS,' wrote another viewer.And someone else posted: '2022's Hellhole distributed by @netflix received mid reviews but is honestly one of the most gripping and claustrophobic horrors I've ever watched.'"
    ]
}