{
    "articleURL": "/wires/reuters/article-12045989/Russia-accuses-U-S-alleged-Kremlin-drone-attack.html",
    "content": [
        "Kremlin administration shifts focus from Kyiv to Washington",
        "Allegation goes beyond previous accusations against U.S.Washington denies accusationSecurity experts: incident implausible as assassination attemptIncident came six days before Victory Day showcase on Red Square(Adds U.S. denial in headline, paragraphs 2 and 7)By Mark TrevelyanMay 4 (Reuters) - Russia accused the United States on Thursday of being behind what it says was a drone attack on Moscow's Kremlin citadel intended to kill President Vladimir Putin.A day after blaming Ukraine for what it called a terrorist attack, the Kremlin administration shifted the focus onto the United States, but without providing evidence. The White House was quick to reject the charge.Ukraine has also denied involvement in the incident in the early hours of Wednesday, when video footage showed two flying objects approaching the Senate Palace inside the Kremlin walls and one exploding with a bright flash.\"Attempts to disown this, both in Kyiv and in Washington, are, of course, absolutely ridiculous. We know very well that decisions about such actions, about such terrorist attacks, are made not in Kyiv but in Washington,\" said Putin's spokesman Dmitry Peskov.He said the United States was \"undoubtedly\" behind the incident and added - again without stating evidence - that Washington often selected both the targets for Ukraine to attack, and the means to attack them.",
        "\"This is also often dictated from across the ocean ... In Washington they must clearly understand that we know this,\" Peskov said.White House national security spokesman John Kirby told MSNBC television the Russian claims were false, and that Washington does not encourage or enable Ukraine to strike outside its borders.Russia has said with increasing frequency that it sees the United States as a direct participant in the war, intent on inflicting a \"strategic defeat\" on Moscow. The United States denies that, saying it is arming Ukraine to defend itself and retake territory that Moscow has seized illegally in more than 14 months of war.CALLS TO KILL ZELENSKIYHowever, Peskov's allegation went further than previous Kremlin accusations against Washington.Putin was not in the Kremlin at the time, and security analysts have poured scorn on the idea that the incident was a serious assassination attempt.But Russia has said it reserves the right to retaliate, and hardliners including former president Dmitry Medvedev have said it should now \"physically eliminate\" Ukrainian President Volodymyr Zelenskiy.Peskov declined to say whether Moscow saw Zelenskiy as a legitimate target.He said Russia had an array of options and the response would be carefully considered and balanced. He said an urgent investigation was under way.",
        "Putin was in the Kremlin on Thursday and staff were working normally, he said.The incident took place less than a week before Russia's May 9 Victory Day celebrations marking the defeat of Nazi Germany in World War Two - an important public holiday and an opportunity for Putin to rally Russians behind what he calls Russia's \"special military operation\" in Ukraine.Peskov said air defences would be tightened, and this was happening anyway for the military parade on Red Square, the centrepiece of the holiday, just over the Kremlin wall from the site of the alleged attack.He said the parade would go ahead as normal, and include a speech from Putin.(Reporting by Reuters; writing by Mark Trevelyan; Editing by Kevin Liffey)"
    ]
}