{
    "articleURL": "/news/article-12044011/By-Heck-Sausage-maker-ditches-meat-free-products-lack-demand.html",
    "content": [
        "The company reduced its vegan-friendly range from 15 products to only twoYorkshire sausage maker Heck has ditched most of its vegan products after admitting most people aren't 'quite ready' for meat-free alternatives.",
        "The company has reduced its vegan-friendly range from 15 products to only two after a lack of demand. Managing director Andrew Keeble said customers were not as enthusiastic for vegan sausages as had been commonly thought.He told The Daily Telegraph: 'We had a huge range of vegan products because, like everyone else, we believed what was being written in the press. The vegan market is really funny. 'We actually had some amazing products out there that were very functional... [such as] one with quinoa and beetroot in it. But the public somehow wasn't quite ready for it yet. They didn't want all that veg in the sausage.'",
        "Britons' rejection of meat-free products came as business investors were pumping cash into vegan brands because 'they didn't want to miss the next Google', Mr Keeble said.Supermarket sales of meat-free products fell by £37.3million in the year to September, analysts NielsenIQ found.Just last month smoothie-makers Innocent Drinks axed a dairy-fee range of vegan coconut, almond and hazelnut-flavoured drinks, joking on social media that they hadn't been popular. 'We know some of you really love these drinks, so we wanted to take this time to thank you for buying them. We really appreciate all five of you,' the company said in a tongue-in-cheek statement. ",
        "Grocery sales of vegan and vegetarian products have slumped over the past year. But veganism could still be a cash cow, Keeble reckons. He said his business was 'still committed to vegan' and 'in time', the public would be more enthusiastic for sausages made out of meat-alternatives like quinoa. "
    ]
}