{
    "articleURL": "/wires/reuters/article-12049725/Rebel-without-pause--ECB-tries-outhawk-Fed-Mike-Dolan.html",
    "content": [
        "By Mike Dolan",
        "LONDON, May 5 (Reuters) - Not for the first time, the European Central Bank is determined to display policymaking independence from its Transatlantic cousin - but the two central banks are likely more in sync than it seems.Two potentially pivotal policy decisions within 24 hours this week from the ECB and U.S. Federal Reserve ended up with two very distinct directions of travel. Both hiked interest rates a quarter point - but only the ECB said more was to come.Without committing to it, the Fed signalled a pause in its 13-month, five percentage point tightening campaign. The ECB publicly dismissed any suggestion its squeeze over nine months and amounting to 375 basis point to date was done yet.Almost piqued by the question, ECB President Christine Lagarde insisted the bank was not dependent on the Fed: \"We are not pausing - that is very clear.\"And in the shadows of the council's deliberations, well-known hawks were clearly pleading for an even harsher medicine.Strategic autonomy? Parallel universes? Or economies and policy cycles only marginally out of step?A counter-intuitive recoil of the euro against the dollar following the more hawkish ECB position on Thursday strongly suggested the last of those options. So did the fact there was barely a flicker in the two-year transatlantic yield gap.",
        "Even though the ECB is clearly dealing with higher inflation rates, it started credit tightening four months after the Fed last year - perhaps fearful that the energy shock following the Ukraine invasion would hit the underlying economy.Now, the euro area has swerved a winter recession, the ECB is playing catch-up to some extent - for all the clear differences in the nuts and bolts and vulnerabilities of both economic blocs.It's not that the ECB can't or shouldn't adopt a different course.Although it tended to follow Fed cycles in its infancy and with lags anywhere from six to 18 months - failing twice in two attempted solo tightening bouts - the ECB has managed to spend much of the past decade ignoring the Fed and pursuing a lonely anti-deflation battle of its own. The global nature of the shocks of the past three years, however, shift the dial again.Money markets do partly agree with Lagarde - seeing one more quarter point rate rise in the pipeline.But that's only in tandem with last year's four-month lag to the Fed. They now see the so-called terminal ECB rate at 3.5% in September - still a chunky 175 bps below peak Fed rates if you assume that at 5.25%, those have now reached the end of the line.",
        "And even though futures assume U.S. rates will be cut by as much as 100 bps by year-end, they still won't get back below ECB on those prevailing market assumptions. The 2-year U.S. sovereign yield premium over Germany remains about 120 bps.Is there a bigger gap in balance sheet management perhaps?The ECB on Thursday clearly indicated it would pick up the pace of its balance sheet contraction this summer, tightening financial conditions even further. But, curiously, both central banks' pandemic-bloated asset piles are now almost identical after a year of gradual unwinding.To be sure, some investors think the relatively dovish market take on hawkish ECB rhetoric may be mistaken - or at least distorted by this week's reverb of U.S. banking upheavals.\"Lagarde was not able to fully convince markets of the ECB's determination to fight inflation,\" said Joost van Leenders at Van Lanschot Kempen, adding there's a \"clear risk\" the ECB would have to execute more than the one last quarter point hike priced.AXA Investment Managers' Hugo Le Damany and Francois Cabau also felt at least two more hikes were still possible, with risk to markets' implied terminal rate \"tilted to the upside.\"IN SYNC?But many also argue the ECB is talking tough for effect.",
        "While the euro zone's 7% April inflation rate is still more than three times the ECB's target and more than two points higher than the U.S. equivalent - both are set to fall below 4% by year-end and converge to within a point of each other.Core rates are \"stickier\" but these could quickly dissipate when the lagged effects of a year of rate rises flattens credit growth.The ECB's Bank Lending Survey on Tuesday showed a significant tightening of credit standards and credit growth to the broader economies was well underway. The Fed's version - the quarterly loan officer survey due next week - is likely to reveal the same.According to the International Monetary Fund, U.S. economic growth for this year will, at 1.6%, be twice that of the euro zone - even if the latter is expected to catch up and overtake the U.S. next year with a meagre 1.1% expansion.\"The peak of interest rates might be nearer than ECB President Lagarde tried to make markets believe at the press conference,\" said ING's global head of macro Carsten Brzeski.For some, the ECB may even have gone too far already.\"The extent of policy tightening delivered by the ECB to date is already sufficient to cause a recession,\" said Fidelity International's Anna Stupnytska. \"The ECB is very likely already in the policy mistake territory that would ultimately require a rapid course correction in coming months.\"",
        "The opinions expressed here are those of the author, a columnist for Reuters.(By Mike Dolan, Twitter: @reutersMikeD; Editing by Lisa Shumaker)"
    ]
}