{
    "articleURL": "/wires/pa/article-12050447/Neil-Warnock-consider-future-short-term-jobs-keeping-Huddersfield-up.html",
    "content": [
        "Neil Warnock is open to another managerial challenge in the future, but says he will only return to work towards the end of next season after masterminding Huddersfield’s Championship survival.",
        "The 74-year-old was tempted out of retirement in mid-February by a return to one of his former clubs, with the Terriers battling to get out of the relegation zone at the time.A run of just one defeat in nine league matches saw Huddersfield complete a remarkable turnaround, with the 1-0 home win over promoted Sheffield United on Thursday night securing their place in the Championship and in turn relegating Reading to League One.Warnock’s long managerial career has spanned more than 1600 games and included eight promotions.While there are no immediate plans to stay in the game and plan for the start of the new campaign with Huddersfield, Warnock hinted should another interesting opportunity present itself early in 2024, he would give it serious consideration.“It is lovely how it happened and the fans were fantastic last night, but it was hard work, probably the hardest job I have ever had really. But it is great to come away when you have been successful,” Warnock said on talkSPORT.“The new (Huddersfield) owner is coming over, I think for the game (against Reading) on Monday, and no doubt I will have a chat with him.“If I can help them at all (with thoughts on a new manager) I will do, but  a lot of people (already) have their own ideas about things like that.",
        "“At the minute I am just concentrated on making sure we stayed up really. It gives them a better chance of building for the future.“It is a good club, the fans have been brilliant, so I am pleased to put a bit back into it.”",
        "Warnock added: “(After the season) I am going to be doing some shows, ‘an evening with’, and I have really enjoyed them.“I have got some in May and June, then after the one in September, that is me done and then the time is our own really – there are one or two places which (my wife) Sharon wants to go to.”Asked if he would consider a return to management again if an opportunity came up towards the end of next season, Warnock said: “That will do me – I don’t mind the end of February, March and April, (but) I can’t work any longer than that.”"
    ]
}