{
    "articleURL": "/news/article-12053773/Stony-faced-Prince-Andrew-booed-crowds-emerges-Buckingham-Palace.html",
    "content": [
        "Follow our live blog for all the latest updates on the King's Coronation  How are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.uk Prince Andrew appeared downcast as he left Westminster Abbey this afternoon after watching the historic moment his brother was crowned King along with Queen Camilla. ",
        "The Duke of York was today dressed in formal Order of the Garter robes - despite having no formal role in the Coronation. He played no part in the ceremony or procession behind the Gold State Coach that carried the newly crowned King and Queen to the Palace. Andrew, 63, and Duke of Sussex, 38 - who sat on the same row in the Abbey - were today mere spectators to the occasion given that they are no longer working royals. But while Andrew donned Garter robes, Prince Harry appeared wearing a suit. Prince Andrew's attire today reflected an apparent softening of the royal family's stance towards him - after he was banned by the late Queen from wearing the robes in public for her last Garter Day at Windsor Castle. But the Duke of York appeared with a serious, downcast look on his face as he emerged from the Abbey following the service.  Andrew stepped back from royal duties after his car crash Newsnight interview and the furore over his friendship with paedophile billionaire Jeffrey Epstein. ",
        "The Mirror reported that they were informed by the Palace two weeks ago that Andrew would not be in Garter robes. The Order of the Garter is the oldest and most senior order of chivalry in Britain.",
        "According to the royal family website, in medieval times King Edward III was so inspired by tales of King Arthur and the chivalry of the Knights of the Round Table that he set up his own group of honourable knights, called the Order of the Garter.Today, the order includes the King, who is Sovereign of the Garter, 'several senior members of the royal family, and 24 knights chosen in recognition of their work', according to the website.The Order of the Garter robes are made of dark blue velvet and can be accompanied by a cap.The robe has a white satin lining, white silk bows on the shoulders, an attached red velvet hood and tasselled cordons.Prince Andrew and Prince Harry also missed out on stepping out onto the balcony at the Palace for a traditional photo op following the service. Andrew joined his children, the Tindalls, Princess Anne and her husband, the Kents and the Wessexes at Mayfair club Oswald's for a dinner last night - but there was no sign of the 'outcast' Prince Harry.",
        "Earlier a stony-faced Andrew was pictured leaving Buckingham Palace and driven down The Mall in a state car. But some of the crowd in a grandstand booed as he went past.Yesterday the Prince appeared left out in the cold as he took a solo drive around the grounds of Windsor Castle while the rest of the royals practiced for the Coronation. ",
        "The Duke of York was pictured in his Range Rover at the historic site in Berkshire just 24 hours before his brother was set to be crowned King. Prince Andrew stepped down from public life after his Newsnight interview in November 2019 and the furore over his friendship with paedophile financier Jeffrey Epstein.The late Queen's disgraced second son went on to pay millions to settle a civil sexual assault case to a woman he claimed never to have met. Virginia Giuffre sued him for allegedly sexually assaulting her when she was 17 after she was trafficked by Epstein. Andrew denied the claims. Ahead of his legal settlement, his mother stripped him of all of his honorary military roles, including Colonel of the Grenadier Guards, and he gave up his HRH style.",
        "The monarch smiled to huge crowds who cheered wildly and waved flags as he was seen earlier before the start of the procession. On the short journey from St James' Palace, the King, 74, looked solemn and thoughtful at times, in what is undoubtedly the biggest day of his life. Senior members of the Royal Family arrived around 20 minutes later, including Prince Andrew.The monarch had been heir since the age of three, and is now ready to finally embrace his day of destiny with the woman he loves by his side. VIP guests queued for a mile from 6am to get one of the prime 2,300 seats inside. The Abbey was full at just before 9am.",
        "They watched Charles crowned in a Christian ceremony that dates back for 1,000 years on a day dripping with glorious displays of pageantry. The two-hour service, pared back from his mother's in 1953, is a pivotal moment in the history of the Royal Family will balance ancient tradition and a future in the 21st century."
    ]
}