{
    "articleURL": "/news/article-12059529/Witness-Brownville-Texas-bus-stop-died-said-driver-yelling-profanities.html",
    "content": [
        "George Alvarez was charged with eight counts of manslaughter after allegedly plowing into a group of migrants in Brownsville, Texas on Sunday Alvarez told police he had lost control of his car after running a red light and running into the group outside of the Ozanam CenterSeveral of the victims were identified by the shelter as Venezuelan migrants A man with a lengthy criminal history lost control of his Range Rover after running a red light and slammed into a crowd at a Texas bus stop, killing eight people, police said. ",
        "Now, he has been charged with eight counts of manslaughter in the crash that also saw 10 other people hurt.  On Monday, Brownsville police identified George Alvarez, 35, as the driver from the horrific Sunday crash outside a migrant and homeless shelter in the border town.  Alvarez's bail was set at more than $3million on the charges as he faces 10 additional aggravated assault charges. Though, he has been charged with more than 20 crimes in his life. Some of previous charges include aggravated assault with a deadly weapon, assault against the elderly, possession of marijuana and DUI.A witness to Sunday's crash said he saw Alvarez speed up to roughly 60mph before slamming into the crowd.   The witness, identified as Luis, recalled a woman in a white car passing by and telling them to move as the gray Range Rover trailed behind her.'Another car behind her came toward us at full speed, yelling profanities at us and ran us over,' the witness told CBS News.The car flipped on its side and the driver tried to flee as brave witnesses rushed to detain him until police arrived. Police said.",
        "Lieutenant Martin Sandoval said at a Monday press conference that Alvarez wasn't cooperating with officers and was refusing to speak.The suspect refused to give police his name and providing them with several false identities.  ",
        "'It's not simply just combative. He is just saying \"No, I am not going to do this,\" and he will tense up and so it kind of makes it harder for the detention officers to do their jobs, but we are talking to him,' Sandoval said.Sandoval said Alvarez was taken to the hospital for injuries sustained when the car rolled over.Alvarez does not appear on the Cameron County online jail roster and it was not immediately clear if he remains in the hospital. Brownsville police did not respond in time for this report.  Police retrieved a blood sample and sent it to a Texas Department of Public Safety lab to test for intoxicants. At Monday's press conference, police detailed Alvarez's lengthy criminal history. Previously he's been charged with:two counts of aggravated assault with a deadly weaponone count of assault against the elderly or disabledfour counts of assault causing bodily injury to a family memberone count of assault on a public servanttwo counts of burglary of a vehicleone count of assault causing bodily injurytwo counts of criminal mischiefone count of driving while intoxicatedone count evading arrest detentionone count interference with public duties one count obstruction or retaliationone count of possession of marijuana less than two ouncesthree counts of resisting arrest during search or transportone count of theft of property between $50 and $500 ",
        "A majority of the victims were identified as Venezuelan men waiting for a bus to return from Downtown. Several of them stayed overnight at the migrant shelter, according to the Associated Press. Shelter director Victor Maldonado said over the past two weeks he has seen an influx of Venezuelan migrants. As of Thursday, about 4,000 migrants in Texas' Rio Grande Valley border control custody were from Venezuela.Maldonado said the center had not received any threats before the crash, but did afterward.'I've had a couple of people come by the gate and tell the security guard that the reason this happened was because of us,' Maldonado said.",
        "Brownsville has long been an epicenter for migration across the U.S.-Mexico border, and it has become a key location of interest for this week's end to pandemic-era border restrictions known as Title 42.The Ozanam shelter is the only overnight shelter in the city and manages the release of thousands of migrants from federal custody.The shelter can hold 250 people, but many who arrive leave the same day. In the last several weeks, an uptick in border crossings prompted the city to declare an emergency as local, state and federal resources coordinated enforcement and humanitarian response.'In the last two months, we've been getting 250 to 380 a day,' Maldonado said.About 2,500 migrants have crossed through the river daily into Brownsville in the past few days, Pedro Cardenas, a city commissioner, said. He said the Border Patrol is aware of the city's capacity of 1,000 at their processing area near the crossing point and a downtown building where city employees and volunteers guide migrants on how to purchase bus or plane tickets to their final destinations.The city is considering expanding services to accommodate needs in the coming days, Cardenas said.While 80 percent of people released from federal custody leave the same day, the city's emergency management official said, a bottleneck has formed over the past few days.",
        "'Most of the people coming across don´t want to stay in Brownsville, but we don´t have enough buses for them to buy their ticket to leave,' Cardenas said. 'Some are waiting for family members.'"
    ]
}