{
    "articleURL": "/sciencetech/article-12042915/People-just-realising-hidden-message-LG-logo-spotted-it.html",
    "content": [
        "LG has a unique logo worthy of a closer look - but have you grasped its meaning? Faced with an ever-changing whirl of new brands popping up on our televisions, smartphones and laptop screens - it's easy to overlook the hidden meanings in many of their designs.",
        "But the emblems from some high street names are devised in such a clever way they deserve a closer look.South Korean tech giant LG certainly has a trademark to match its cheerfully-named forebears, The Sun reports.Born from the merger of its parent companies Lucky and Goldstar in the 1980s, LG's logo is made up of a burgundy-colored circle resembling a round face.",
        "Inside the circle, an L can be spotted as its nose, encircled by a large G giving the impression of a smile. A dot in the middle even looks like an eye, altogether creating the effect of a happy face.A brand expert said: 'These hidden messages help LG to appear more approachable and inviting.'According to LG itself, the letters 'L' and 'G' in a circle symbolize the world, future, youth, humanity, and technology. A company spokesman said: 'Our philosophy is based on humanity. Also, it represents LG's efforts to keep close relationships with our customers around the world.'Red, the main color, represents our friendliness, and also gives a strong impression of LG's commitment to deliver the best. Therefore, the shape or the color of this symbol mark must never be changed.'Have you ever felt that the LG on your electrical appliance was smiling back at you?",
        "The LG brand in operation today stemmed from Lucky Chemical Co., Ltd. established in 1947. After a huge success of 'Lucky Cream', the first Korean make-up cream, Chairman In-hwoi Koo named his company 'lucky', which sounds similar to the word 'Lak Hui' and has the meaning of giving joy to all. In this way, LG's first hit product brand became the company's name.",
        "This 'Lucky' brand became a representative brand of Lak Hui Chemical's products, such as 'Lucky toothpaste', and became a bridgehead for Lucky Chemical Co., Ltd. to grow into a leading chemical company. In 1974, Lak Hui Chemical changed its name to Lucky Co., Ltd.Goldstar, founded in 1958, also played a huge role in LG history. As the first electronic company in Korea, Goldstar developed many of the first electronic products in Korea. Lak Hui and Goldstar quickly grew into leading companies in the chemical and electronics industries in Korea.",
        "After their expansion, in 1983, the name of the group was changed to 'Lucky Goldstar'.The 1990s ushered in a new age of openness, globalization, and information. The name 'Lucky Goldstar' was considered too long for overseas consumers. It was also necessary for the company to acquire a strong and vivid brand identity with an integrated corporate image to survive in the rapidly changing business world.Source: About LG "
    ]
}