{
    "articleURL": "/wires/ap/article-12050445/No-place-like-road-Visiting-teams-thriving-NHL-playoffs.html",
    "content": [
        "When the Vegas Golden Knights went on the road to face the Winnipeg Jets in the first round of the NHL playoffs, they got a chilly welcome - and that was inside.",
        "\"They had no hot water at the Fairmont Hotel last week in Winnipeg, which I really didn´t like at all,\" coach Bruce Cassidy said. \"Great hotel, by the way: great service, nice people, just no damn hot water.\"And no home cooking. Vegas beat the Jets twice on the road and won the series in five games.The Golden Knights are not alone in what Tampa Bay coach Jon Cooper declared \"the year of the road team.\" Visiting teams have matched the best start in league history with 34 wins through 56 games; the .607 winning percentage is by far the highest of any playoff year dating to 1966, not counting 2020 when games were played at neutral sites with no fans.Coaches point to better preparation and more roster depth as well as parity leaguewide that has evened out the differences among teams playing for the Stanley Cup. Matchups that used to be paramount don't matter as much now that there's so much offensive talent across lineups. There is less of a drop-off from the stars on the first line to depth contributors on the fourth.\"It may have to do with the structure of the teams now and how much that´s changed over the years,\" Florida coach Paul Maurice said before his team won a second consecutive road game take a 2-0 series lead on Toronto. \"There´s really high-end, skilled guys. Like our third line has three guys who can make plays. They´re skilled guys. They´re not even necessarily hitters, and that´s kind of true around the league.\"",
        "Maurice, Cassidy, Carolina coach Rod Brind'Amour and noted that every rink is now the same size; no more special quirks like the tight corners in Boston Garden designed for the Bruins to be big and tough. It wasn't until 1996, when the Sabres moved out of \"The Aud\" in Buffalo, that all NHL arenas were a uniform 200-by-85 feet.\"When you think back to playoff series, you think of the old Boston Garden, Chicago Stadium,\" Cassidy said. \"They were much more intimidating, smaller. You could build your roster a little around them, like baseball parks. Now it´s pretty much 200 by 85. That has something to do with it.\"Brind'Amour said home ice has \"become less of an advantage.\" No offense to home fans, he said, who give the Hurricanes energy, but the longtime player-turned-coach said, \"I just don´t know how much it hurts the other team.\"Since 2011, only once have road teams won more than home teams, when they went 44-40 (.524) in 2018. Add up all the playoffs since 2011 and road teams have gone 434-531 (.450).They're 34-22 this year - one fewer road win than all of last season.\"It is a leaguewide trend, but it doesn´t make you feel any better about it,\" Toronto coach Sheldon Keefe said after the Maple Leafs lost at home to Florida in Game 1. \"No matter where we´re playing, you should be able to play the same.\"",
        "That gets to the root of the road-warrior mentality, too. Not only are players often more free from distraction away from home but they tend to streamline their approach.\"Sometimes on the road, you have a different mindset of playing simple,\" Edmonton forward Ryan Nugent-Hopkins said.A rule change passed several years ago also takes a tactical advantage away. On faceoffs before 2015, the visiting player had to put his stick down first, giving his home rival a positioning edge that can make a difference. Now that´s only a factor at center ice because everywhere else the player closest to his own goal must put his stick down first.Home teams still get the last line change, which allows coaches to better dictate matchups. But Maurice showed in Florida's wins at Toronto how little he cared about getting certain players out against the Leafs' top scorers - something former player Anson Carter sees as an evolution of talent.\"Back in the day, when I played, you couldn´t put your third or fourth line out against a first line - they'd get eaten alive,\" said Carter, now a Turner Sports analyst. \"Now with teams really going four lines deep or at least two centermen deep that are equally effective in the faceoff circle and at least two defensive pairs, you don´t have to worry about your top pair being on the bench or your top center being on the bench while the other team just takes advantage in the offensive zone.\"",
        "___AP Sports Writers Mark Anderson in Las Vegas, Aaron Beard in Raleigh, North Carolina, Josh Dubow in San Jose, California, and the Canadian Press contributed.___AP NHL playoffs: https://apnews.com/hub/stanley-cup and https://twitter.com/AP_Sports"
    ]
}