{
    "articleURL": "/wires/pa/article-12044237/Fulham-manager-says-Liverpool-s-match-winning-penalty-embarrassing.html",
    "content": [
        "Fulham manager Marco Silva claims the award of Liverpool’s match-winning penalty was embarrassing as his side slipped to an eighth defeat in 10 games.",
        "Mohamed Salah scored from the spot for the second successive match to secure a 1-0 win after Issa Diop was adjudged to have brought down Darwin Nunez.Silva was not convinced, however, saying: “The way they scored the goal, I have to say that is embarrassing.“Today in football to give a penalty like that, after the VAR didn’t take that penalty (away) it is difficult to understand.",
        "“I will not say nothing more because after it will be difficult for me and I don’t want to create more problems for me. It is difficult to understand that penalty,” Silva said.“When Darwin touch the ball he start to dive himself but after he touched his left leg with Issa.“They are going to say it is harsh but the referee gave and after the VAR cannot take (away). It is always the same conversation. I didn’t speak with the referee at the end or at half-time. I had some words with the fourth official.“Issa told me that it is clear not penalty. The referee made a mistake and the VAR is there to take that decision and not allow the penalty to go on. That’s clear for me.”",
        "The victory secured a fifth successive win for Liverpool for the first time since April 2022 and maintained the pressure on fourth-placed Manchester United, whom they trail by four points having played two matches more.",
        "“Really pleased with big parts of the game: first half controlling, creating not finishing situations off,” said manager Jurgen Klopp.“The penalty I like a lot because it a counter-pressing situation; Darwin is fully in the situation and gets a pen and Mo finishes it off.“We then don’t close the game early and we have to fight to the end and we needed Ali (Alisson Becker) obviously, the save from (Carlos) Vinicius was sensational and he was happy about the clean sheet more than anyone.“Five wins in a row is super-difficult. It felt it was ages ago we did it and the more I like it.”"
    ]
}