{
    "articleURL": "/news/article-12055133/The-fascinating-Coronation-cameos-NOT-spotted.html",
    "content": [
        "The cross of the Orb is bent off centre, having been dropped by a thief in 1671Tory MP Penny Mordaunt exchanged a bag of coins for the Sword of OfferingDespite wall-to-wall TV punditry, there may be some unexplained incidents, eye-catching moments and oddities that still need explaining. Here, we highlight several of the more offbeat elements of the day.",
        "Pageboy with child-star mumOne of Charles's pageboys was Ralph Tollemache, 12, whose mother Sophie appeared in the John Cleese film A Fish Called Wanda when she was aged six.Wonky orbThe cross on top of the Orb is bent off centre, having been dropped by a would-be thief in 1671.During the English Civil War, Irish-born Colonel Thomas Blood swapped sides to fight with Oliver Cromwell.But when Charles II returned to the throne, Blood became one of the most wanted men in England and tried to steal the Crown Jewels from the Tower of London.",
        "During the botched heist, the Orb was dropped and damaged – leaving the cross still crooked.Wood salvaged from the Royal YachtThe Diamond Jubilee State Coach was built 13 years ago, with interior wooden panels made from 100 historic artefacts including oak timber from Henry VIII's flagship, the Mary Rose. The handrails also came from the Royal Yacht Britannia.Bag of 50psAs Lord President of the Privy Council, Tory MP Penny Mordaunt exchanged a bag of coins for the ancient custom of the Jewelled Sword of Offering. The purse contained 100 newly minted, cupro-nickel 50p pieces with an effigy of the crowned King. Before decimalisation in 1971, a peer used to offer 100 silver shillings.",
        "Gospel choirThe magnificent gospel choir – a first for a British Coronation – featured singers who performed at Prince Harry and Meghan Markle's wedding. The Ascension Choir, led by Abimbola Amoako-Gyampah, included singers from the Kingdom Choir in south London who sang the Ben E King song Stand By Me for the Duke and Duchess of Sussex.Rolling out the blue carpet...A new, royal-blue carpet was laid down at Westminster Abbey especially for the Coronation. It was designed with a friction-less weave so Their Majesties' robes did not snag on the floor.BBC Huw's swipe at Liz TrussBBC anchor Huw Edwards was accused of making an unsubtle dig at former Tory PM Liz Truss. As she arrived at the Abbey behind Boris Johnson, he told viewers that she was 'Prime Minister for a very brief period' – a reference to her 44 days in No 10, the shortest time for a British PM.The hot equerry, a King's slippers ... and a very Grim trick of the lightThe 'Hot Equerry'An army of female viewers swooned over the King's aide, Major Jonathan Thompson. Nicknamed the 'Hot Equerry', the 39-year-old was described on social media as 'hunky', 'dashing' and 'handsome'. Major Thompson's fans may be disappointed that the kilted officer with the 5th Battalion Royal Regiment of Scotland has been married for 13 years to marketing executive Caroline and they have two children.",
        "Trees replanted at SandringhamA pair of tall yew topiaries were positioned at the Abbey's Great West Door, underplanted with a meadow of wild grasses and cowslips, primroses and violets.The trees will be replanted in a new, biodiverse topiary garden at Sandringham, which will be open to the public, as a lasting reminder of the day.",
        "Spectre of the Grim ReaperSocial media went into a frenzy about an overhead picture of the Abbey nave which was said to show the Grim Reaper – a shadowy figure carrying a stick. In fact, it was a trick of the light and was the outline of a clergyman.",
        "Charles's slippersThe King wore 'opera pump' slippers hand-made by Northampton-based Gaziano &amp; Girling using Swiss calf leather. The leather on the soles came from a tannery in Devon which uses ancient methods. The silver buckles were commissioned by the Goldsmiths' Company and were modelled on a pair worn by George VI.",
        "Blue manesThe braids (made from recycled plastic bottles) weaved into the manes were part of a tradition which began at Queen Victoria's coronation. Charles chose royal blue – his mother's favourite colour."
    ]
}