{
    "articleURL": "/femail/article-12059407/Meghan-Markle-fans-baffled-strange-belt-hike-speculate-weight-loss-aid.html",
    "content": [
        "Meghan, 41, was pictured enjoying some fresh air with friends over the weekend Many eagle-eyed fans noticed she was wearing something around her waistTwitter has erupted with people trying to decipher what the mystery object isMeghan Markle's fans were left baffled after she was seen wearing a strange item under her shirt during a hike on Sunday - with some speculating that it was a weight loss aid and others theorizing that it was a hernia treatment.",
        "The Duchess of Sussex, 41, was pictured enjoying some fresh air with friends over the weekend - just hours after she missed King Charles III's coronation.The mother-of-two donned black leggings and a matching, baggy T-shirt for the outing, as well as a khaki jacket, which she tied around her waist. She paired the look with a wide-brimmed beige hat, a pink neckerchief, and large sunglasses.But many eagle-eyed fans were quick to notice that Meghan was wearing something around her waist - which was hidden beneath her shirt but could be seen bulging out whenever the top pressed against her tummy.",
        "Social media quickly erupted with people trying to decipher what the mystery object around the royal's stomach was and what it might be used for - with the theories ranging from bandages due to recent surgery to a 'tummy tuck binder.' Some even wondered if it meant the 41-year-old was suffering from health problems.'Is Meghan wearing a hernia belt?' one Twitter user asked. 'Or is it a fanny pack under her shirt?'Hernia belts are thin pieces of fabric worn around your waist, which are used to 'provide support and apply compression' for those suffering from 'hernia defects.''Old age set in, probably got a hernia,' someone else agreed.",
        "'I had to have surgery and I am wearing a wrap and it looks like that under my clothes. It is Velcro and used after plastic surgery,' added a different person. Others hypothesized that it was a 'sugar monitor' or an 'Ozempic pump.' Ozempic is a drug used to treat diabetes that has become a popular weight loss aid in recent months.Someone else suggested that it was a 'recording device' for her and Prince Harry's next Netflix documentary.",
        "'Maybe it's mic gear for more Netflix nonsense,' read another tweet. The couple dropped a six-part explosive Netflix docuseries last year, but there has been no talk of a second season yet.",
        "Others wondered if the item on Meghan's hips was simply exercise equipment, like a 'weight pack' to make the hike more strenuous, or something to hold her phone or wallet in during the walk.'It's a sports pack, similar to a fanny pack. Athletes use it to carry cell phones,' wrote another Twitter user.Meghan was noticeably absent from the coronation in the UK this weekend, opting to stay back in the US to celebrate her son Archie's 'lowkey' fourth birthday at her and Prince Harry's Montecito home. Harry, 38, attended King Charles' big day, but rushed back to California afterwards. He headed straight to the airport as soon as the ceremony concluded, and was on the plane before his father and stepmother Camila, the newly crowned queen, had even finished having their official portraits taken.",
        "He was seen landing back at LAX airport around 6:30pm on Saturday - after spending a total of 28 hours and 42 minutes in the UK.Despite Harry's quick exit, the King honored Archie at a post-coronation buffet, raising a glass to toast the toddler's fourth birthday.A source said that while most members of the Royal Family 'breathed a sigh of relief' that Harry didn’t join them at the celebration afterwards, King Charles, 74, seemed 'genuinely quite disappointed that he didn’t stay.' Charles thanked everyone who had worked hard to make the day so special, before paying tribute to 'those that weren’t there', including Archie, who he wished a very happy birthday 'wherever he was.'"
    ]
}