{
    "articleURL": "/wires/pa/article-12052793/Man-jailed-14-years-attacking-police-Capitol-riot.html",
    "content": [
        "A Kentucky man with a long criminal record has been sentenced to a record-setting 14 years in prison for attacking police officers with pepper spray as he stormed the US Capitol with his wife.",
        "Peter Schwartz’s prison sentence is the longest so far among hundreds of Capitol riot cases.The judge who sentenced Schwartz also handed down the previous longest sentence — 10 years — to a retired New York Police Department officer who assaulted a police officer outside the Capitol on January 6, 2021.Prosecutors had recommended a prison sentence of 24 years and 6 months for Schwartz, a welder.US District Judge Amit Mehta sentenced Schwartz to 14 years and two months in prison, followed by three years of supervised release. You are not a political prisoner. You're not somebody who is standing up against injustice or fighting against an autocratic regime  Judge Amit Mehta  Judge Mehta said Schwartz was a “soldier against democracy” who participated in “the kind of mayhem, chaos that had never been seen in the country’s history”.“You are not a political prisoner,” the judge told him. “You’re not somebody who is standing up against injustice or fighting against an autocratic regime.”Schwartz briefly addressed the judge before learning his sentence, saying, “I do sincerely regret the damage that January 6 has caused to so many people and their lives.”The judge said he did not believe Schwartz’s statement, noting his lack of remorse.“You took it upon yourself to try and injure multiple police officers that day,” Judge Mehta said.",
        "Schwartz was armed with a wooden tyre tool when he and his then-wife, Shelly Stallings, joined other rioters in overwhelming a line of police officers on the Capitol’s Lower West Terrace, where he threw a folding chair at officers.“By throwing that chair, Schwartz directly contributed to the fall of the police line that enabled rioters to flood forward and take over the entire terrace,” prosecutor Jocelyn Bond wrote in a court filing.Schwartz, 49, also armed himself with a police-issued “super soaker” canister of pepper spray and sprayed it at retreating officers.Advancing to a tunnel entrance, Schwartz coordinated with two other rioters, Markus Maly and Jeffrey Brown, to spray an orange liquid toward officers clashing with the mob.“While the stream of liquid did not directly hit any officer, its effect was to heighten the danger to the officers in that tunnel,” Ms Bond wrote.Before leaving, Schwartz joined a “heave ho” push against police in the tunnel.Stallings pleaded guilty last year to riot-related charges and was sentenced last month to two years in jail.Schwartz was tried with co-defendants Maly and Brown. In December, a jury convicted all three of assault charges and other felony offences.Judge Mehta sentenced Brown last Friday to four years and six months in prison. Maly is scheduled to be sentenced on June 9.",
        "Schwartz’s lawyers requested a prison sentence of four years and six months. They said his actions on January 6 were motivated by a “misunderstanding” about the 2020 presidential election.Then-president Donald Trump and his allies spread baseless conspiracy theories that Democrats stole the election from the Republican incumbent.“There remain many grifters out there who remain free to continue propagating the ‘great lie’ that Trump won the election, Donald Trump being among the most prominent. Mr Schwartz is not one of these individuals; he knows he was wrong,” his defence lawyers wrote.Prosecutors said Schwartz has bragged about his participation in the riot, shown no remorse and claimed that his prosecution was politically motivated. He referred to the Capitol attack as the “opening of a war” in a Facebook post a day after the riot.“I was there and whether people will acknowledge it or not we are now at war,” Schwartz wrote.Schwartz has raised over 71,000 dollars (£56,000) from an online campaign entitled “Patriot Pete Political Prisoner in DC”.Prosecutors asked the judge to order Schwartz to pay a fine equalling the amount raised by his campaign, arguing that he should not profit from participating in the riot.Schwartz was on probation when he joined the January 6 riot. His criminal record includes 38 prior convictions since 1991, “several of which involved assaulting or threatening officers or other authority figures”, Ms Bond wrote.",
        "Schwartz was working as a welder in Uniontown, Pennsylvania, before his arrest in February 2021, but he considers his home to be in Owensboro, Kentucky, according to his lawyers.More than 100 police officers were injured during the riot. More than 1,000 people have been charged with federal crimes related to January 6. Nearly 500 of them have been sentenced, with over half getting terms of imprisonment.The 10-year prison sentence that Judge Mehta handed down in September to retired NYPD officer Thomas Webster had remained the longest until Friday.Webster had used a metal flagpole to assault an officer and then tackled the same officer as the mob advanced toward the Capitol."
    ]
}