{
    "articleURL": "/news/article-12054869/Tories-rowing-housing-crisis-told-brave-build-30-000-home-new-towns.html",
    "content": [
        "MP Craig Mackinlay called for new towns to be built to solve the housing crisis He said Kent alone could take two brand new towns, each with 30,000 homes Tories rowing over the housing crisis following the local election losses were last night told to 'be brave' and build 'new towns' to solve the problem.",
        "Senior Tory MP Craig Mackinlay called for the radical plan, saying that Kent alone could take two completely new towns each comprising 30,000 homes.There was bitter Tory infighting after last week's dire local election results, with ex-Minister Kelly Tolhurst suggesting that Labour's triumph in ousting the Tories in Medway was partly down to local anger at 'unrealistic housing targets'. But fellow Tory Sir Charles Walker hit back by saying the Government should be 'putting up the homes that the young and aspiring want to buy'.Sir Charles, MP for Broxbourne in Hertfordshire, added that his area 'builds houses and we returned all of our councillors on Thursday'.",
        "The fierce internal Tory debate came after Sir Keir Starmer vowed to take on 'nimbyism' (not in my backyard) opposition to new house-building by saying a Labour government would re-impose binding local house-building targets scrapped by Rishi Sunak after a huge Tory backbench revolt. However, South Thanet MP Craig Mackinlay told The Mail on Sunday that to tackle the housing crisis, politicians had to bite the bullet and accept that a series of new towns was the answer.He said adding houses 'piecemeal' to towns was one of the reasons 'we are losing elections', saying: 'We should be brave enough to deliver much needed housing numbers in a different way and build ambitious new towns with the proper infrastructure and facilities instead of adding to existing conurbations which simply add to local pressures and are universally opposed.'",
        "Kent could take two new towns, he said, but suggested there was potentially more scope in Sussex and Surrey. He also insisted that farmland instead of precious 'green belt' land could be used.Proposing major developments is likely to meet with fierce local opposition. But privately, some Tories worry that Sir Keir's vow to impose house-building targets will work electorally for Labour, with one ex-Minister saying privately 'our voters tend to be the ones who don't want new homes built near them – theirs are voters who in many cases want those new houses'.Separately, Sir Charles Walker warned last week: 'If the Conservatives don't build homes for young people… I suspect we won't like what we find at the end of it.'"
    ]
}