{
    "articleURL": "/news/article-12059171/Doctor-pulls-babys-head-childbirth-horrified-father-watches.html",
    "content": [
        "Family say hospital in Brazil pressured them to sign documents to hide incidentThey also say that the girl was alive as she started to emerge from the motherA doctor is being investigated after reportedly 'climbing on to a pregnant woman's stomach' and pulling her baby's head off during childbirth while the horrified father was watching.",
        "The family of the dead baby say that the girl was alive when she started to emerge and that after the traumatic incident, the hospital tried to pressure them into signing documents which would cover up what had happened.The incident on May 1 is said to have taken place at the Hospital das Clinicas da UFMG, in the Santa Efigenia neighbourhood of Belo Horizonte in Brazil.Ranielly Coelho Santos, the baby's mother, launched a complaint with the police two days after the failed delivery of her child. Officers are now investigating the shock death of the infant.Ms Santos, 34, who already has a nine-year-old daughter, was taken into hospital on April 24, 28 weeks into her pregnancy, over concerns for her high blood pressure, before doctors induced labour seven days later.",
        "During the birth, the obstetrician, who has not been named, reportedly called the girl's father to observe the procedure closely. The father, who was watching the birth of his baby alongside Ms Santos' mother, says that he even saw his daughter blinking and moving her mouth, which he said was proof the girl was alive and well.However, in a tragic turn of events, according to the family's report to the police, the doctor climbed onto the mother's belly as she attempted to pull the girl out, and 'ripped off the child's head'.",
        "The police report also says that the family, from Ribeirao das Neves, a municipality on the outskirts of Belo Horizonte, received an apology from the doctor for what happened during the delivery of the baby.They say they were later approached by a social worker at the hospital who said that the facility would bear all the costs for the baby's burial.However, the offer was understood to only be valid if they agreed to sign documents stating that 'the autopsy had already been performed at the hospital', that 'the child's body had already been examined' and that 'the body would not be forwarded to the Legal Medical Institute (IML)' for further analysis.",
        "The parents refused to sign the paperwork and later filed a complaint with the police, with the baby's remains then being examined at the IML, according to the family's lawyer Jennifer Valente.The hospital told Itatiaia that it 'deeply regretted' the case and said they would 'make every effort to investigate the facts' while awaiting the autopsy report.The baby's body is set to be released to the parents today so that it may be buried by the devastated family.MailOnline has independently contacted the hospital for comment. "
    ]
}