{
    "articleURL": "/wires/pa/article-12042939/Ministers-accused-wanting-loophole-foreign-donations.html",
    "content": [
        "The Government has been accused of intentionally wanting to keep a ‘loophole’ in UK election law that might be letting foreign countries donate to political parties through the back door.",
        "A Lords amendment to the National Security Bill would have introduced new transparency measures on UK-registered political parties with respect to donations received from foreign powers.However, MPs rejected it by 254 votes to 134, majority 120, with Security Minister Tom Tugendhat insisting the law already makes “robust provision in relation to donations to political parties”.",
        "Disagreeing with Mr Tugendhat, Labour former minister Sir Chris Bryant asked in the Commons: “What would a party do if, for instance, they were offered a donation for, let’s say, £50,000 by somebody who lives and works in Moscow today?“The law says they have to do nothing as long as they are on the electoral register.“But surely, we would want to say I’m not sure that that’s quite right.”He described the provisions in the Lords amendment as the “minimum”, adding: “I have said that there’s a flaw in PPERA (the Political Parties, Elections and Referendums Act ) … but the danger is, I’m starting to worry that the Government wants it to exist as a loophole, because otherwise I simply don’t understand why the minister is holding out on this point.”The Conservative chairman of Parliament’s Intelligence and Security Committee, Sir Julian Lewis, also gave his backing to the Lords amendment, as he argued it would “help to increase the transparency and accountability of our political system”.",
        "He insisted the UK has previously “clearly welcomed Russian money, including in the political sphere”, and said: “The amendment is eminently reasonable, it shouldn’t be controversial for political parties to want to ensure the transparency of their foreign political donations.“We must protect against covert, foreign state-backed financial donations if we are to defend our democratic institutions from harmful interference and influence.”Meanwhile, shadow Home Office minister Holly Lynch challenged Mr Tugendhat to say that alternative provisions are effective and that “dirty money with a price attached isn’t finding its way into our system and into our democracy”.Closing the debate, Mr Tugendhat said the Government has to treat “British citizens like British citizens”, adding: “The idea that we can treat British citizens differently, depending on how we feel about them seems to me rather a bad way of making law.“That, however, does not mean that political parties have to treat British citizens the same.“And the rule in this surely is just because you can, doesn’t mean you should. There are many donations, there are possibly many individuals who many of us would not wish to accept donations from. And the point about politics is it’s about decisions. It’s about judgment. It’s about choices.”",
        "The Bill will now return to the House of Lords, where peers will decide whether to accept the Government’s rejection of their amendment or propose a different one.",
        "Dr Susan Hawley, executive director of Spotlight on Corruption, said: “The Government’s strong words on tackling foreign influence and defending UK democracy ring very hollow today.“This is a badly missed opportunity by the Government to protect the next election from malign influences and make sure that political parties play their role in protecting the UK political system from dirty money.”The Bill as a whole aims to update Britain’s security laws to combat modern-day state threats, including sabotage, spying, foreign interference and economic espionage.",
        "Concerns were raised in the Lords that moves to grant criminal immunity to the intelligence services and military in assisting overseas operations could provide legal cover for tipping off other states in cases of torture or extraordinary rendition.The Government stressed it would not make it legal to encourage or enable torture or rendition or solicit murder.Liberal Democrat former minister Alistair Carmichael tabled an amendment to specify the protection did not apply to torture or inhuman, cruel or degrading treatment or punishment, or the violation of a person’s sexual integrity.His amendment was defeated by 252 votes to 132, majority 120.Peers and MPs also pushed for the remit of Parliament’s Intelligence and Security Committee to be updated to improve scrutiny of the intelligence services, although the Commons voted 254 to 136 – majority 118 – to disagree with this change."
    ]
}