{
    "articleURL": "/news/article-12051049/Has-Ukraine-shot-unstoppable-Putin-missile-Experts-say-wreckage-suggests-Kinzhal-downed.html",
    "content": [
        "Ukraine is suspected of shooting down Russia's prized Kh-47 Kinzhal missileRussia launched series of missiles at Ukraine over drone strike on KremlinUkraine is suspected of shooting down an 'unstoppable' Russian hypersonic missile in what would be a major blow to Vladimir Putin.",
        "The air-launched missile was aimed at Kyiv in the early hours of Thursday after a drone strike on the Kremlin - but it is believed to have been downed by Ukraine. Ukrainian military experts say the wreckage at the site suggests the downed missile was Russia's prized Kh-47 Kinzhal - or Dagger - hypersonic missile.The Kyiv armed forces may have used a US-supplied Patriot system to down the suspected Kinzhal, experts said.The 24ft-long, one-ton Kinzhal can carry conventional or nuclear warheads, and Russia has boasted that the missile has no match among Western defences. ",
        "If Ukrainian forces did down the Kinzhal, it would be the first time such a missile has been shot down.",
        "Specialist Defense Express website said: 'One of the photos shows the nose cone, which is as similar as possible to the one used in the Kh-47 Kinzhal missile with a complex shape of sharp diameter transitions.'The wreckage shows that it sustained penetration damage, which allows us to estimate the thickness of the material needed to withstand the high temperature during acceleration to hypersonic speeds.'It also indicates that the intercept was quite effective, with the warhead destroyed in midair.'This explains the powerful explosion heard by Kyiv residents on the night of 4 May.'The site said: 'Outdated Soviet air defence systems are not capable of shooting down such a missile…",
        "'In most cases, defeating such a target is possible only with the help of the Patriot PAC-3 air defence system with a PAC-3 MSE kinetic interceptor.'The hole in the wreckage… indicates the possible use of such a missile.'Russian war sites have strongly disputed the Ukrainian claim as 'nonsense'.'Ukrainian military experts are trying to pass off the image of a water pipe as the wreckage of a rocket,' said one.The Kinzhal can be fired from the MiG-31, Tu-160 or Tu-22M3M warplanes, and it has been used by Moscow in the war.It has a range of 1,250 miles and its conventional version was deployed for the first time against Ukraine in March 2022.Russian forces had launched a barrage of missiles at Kyiv and other Ukrainian cities in the early hours of Thursday after two drones struck the Kremlin in a strike Russia has blamed on Ukraine and the US.",
        "Kremlin spokesperson Dmitry Peskov insisted - without providing evidence - the US was 'undoubtedly' behind the strike that he said was carried out by Ukraine - claims the White House dismissed as 'lies'.Around 40 explosive-laden drones with 'for Moscow' scrawled on them were fired at cities that were miles away from the front line, with explosions heard in the capital Kyiv and southern cities of Odesa and Zaporizhzhia.",
        "'Decisions on such attacks are not made in Kyiv, but in Washington,' a furious Peskov said. 'Kyiv only does what it is told to do. Attempts to disown this, both in Kyiv and in Washington, are, of course, absolutely ridiculous.'Ukrainian President Volodymyr Zelensky denied Russia's claims Ukraine was behind the drone strike on the Kremlin and British security officials believe the attack was a 'false flag' operation by Russia to distract Kyiv from its anticipated counter-offensive and rally up support back home.While Ukraine has demonstrated the capability to launch such attacks on the Kremlin, Kyiv is considered unlikely to risk fracturing international support by targeting the dictator directly. A Russian 'false flag' attack appeared a more likely explanation, with the explosion intended to generate support for Putin and further Russian attacks on Kyiv, UK officials said last night. "
    ]
}