{
    "articleURL": "/wires/reuters/article-12040973/Iranian-president-Damascus-visit-Syrian-war-began.html",
    "content": [
        "DAMASCUS, May 3 (Reuters) - Iranian President Ebrahim Raisi met counterpart Bashar al-Assad in Damascus on Wednesday in the first visit by an Iranian head of state since Syria's war began in 2011, underlining close ties as Syrian relations with Arab states thaw.",
        "With military and economic support from both Iran and Russia, Assad regained control of most of Syria from rebels that were backed by regional countries now seeking dialogue with him.Raisi's visit comes as Iran and regional rival Saudi Arabia rebuild relations after years of tensions, and as Arab states that shunned Assad - including Riyadh - rebuild ties with his government.Assad, speaking alongside Raisi, welcomed \"the development\" of ties between Tehran and Riyadh.Assad also stressed the importance of meetings between officials from Syria, Turkey, Russia and Iran in Moscow.He said the goal should be to secure the withdrawal of \"the occupying forces and halting support to terrorist groups\" - an apparent reference to Turkey's troops in northern Syria and its support for Syrian rebels.Syrian officials have repeatedly said that any moves towards normalising ties between Damascus and Ankara can only come after Turkey agrees to pull out thousands of troops it has stationed in the rebel-held northwest of Syria.Raisi praised Syria for resisting what he described as U.S. pressure and confronting \"takfiris\", a term used to describe jihadists such as Islamic State. \"Iran will always stand by Syria ... and supports its sovereignty,\" he said.Raisi and Assad signed a long-term strategic cooperation agreement, including a memorandum of understanding on oil industry cooperation, the Syrian state news agency reported.",
        "Assad said he hoped the visit would give a \"strong push\" to trade and investment.Arab nations which had isolated Syria over its violent crackdown on protests in 2011 are developing a roadmap to end the 12-year war and reintegrate Syria into the Arab fold.A U.S. State Department spokesperson said on Wednesday that the deepening of ties between Iran and Syria should be of great concern, not just to U.S. allies and countries in the region, but to the world more broadly. The spokesperson, Vedant Patel, told reporters Washington has made clear to partners that it does not support others normalizing ties with Damascus.Speaking to pro-Iran broadcaster al-Mayadeen on the eve of his visit, Raisi said the trip would \"consolidate and develop\" ties with Syria and other allies, including Lebanese armed group Hezbollah, which also intervened in Syria on Assad's behalf.Iranian and Syrian flags lined the airport road in preparation for the arrival of Raisi and his delegation, which included Iran's ministers of oil, defence, foreign affairs and telecommunications.Tehran has already supplied Assad's government with credit lines and won lucrative business contracts in the telecoms and mining industries, among others.In parallel, Iran has become more entrenched militarily in Syria. An Israeli rocket strike on Damascus in February killed Iranian military experts and Tehran has used the flow of aid in the aftermath of a deadly February earthquake to bring in arms.",
        "Assad has never publicly acknowledged that Iranian forces have operated on his behalf in Syria's civil war, saying Tehran has only military advisers on the ground. (Reporting by Firas Makdesi in Damascus, and Laila Bassam in Beirut and Parisa Hafezi in Dubai; Additional reporting by Humeyra Pamuk in Washington; Writing by Maya Gebeily and Tom Perry; Editing by Gareth Jones, Mark Heinrich and Daniel Wallis)"
    ]
}