{
    "articleURL": "/wires/ap/article-12048835/Escaped-inmate-accused-deputys-killing-Mexico.html",
    "content": [
        "FARMVILLE, Va. (AP) - A man who escaped from a Virginia jail this week after being charged in the 2022 killing of a North Carolina sheriff's deputy was captured in Mexico Thursday, authorities said.",
        "Alder Marin-Sotelo, 26, was one of two inmates who escaped from Piedmont Regional Jail in Farmville Sunday. He was taken into custody Thursday afternoon by Mexican authorities in the state of Guerrero, in southwestern Mexico, the FBI in Charlotte, North Carolina, said in a post on Twitter. Officials did not immediately release any details on how he was captured. The investigation into Marin-Sotelo's exact movements since his escape is ongoing, according to the agency.Marin-Sotelo escaped from the jail at about 1 a.m. on Sunday and left in a red or burgundy Ford Mustang, FBI officials said. The other escapee, Bruce Callahan, who was being held on drug charges, left the prison later that day, jail officials said. The jail superintendent said guards didn't notice the inmates were missing until about 26 hours after Marin-Sotelo escaped. Authorities have not said whether the two escapes are related. Jerry Townsend, superintendent of the jail, told WRAL-TV that officials believe the inmates manipulated the locking mechanism on the rear exit door and escaped.Marin-Sotelo was charged with murder in the August 2022 killing of a North Carolina sheriff´s deputy, who was shot while on duty after he stopped along a dark stretch of road late at night. Ned Byrd was found dead outside his vehicle with his police dog still inside. Marin-Sotelo´s brother, Arturo Marin-Sotelo, was also charged with murder in Byrd´s killing.",
        "Both Marin-Sotelo and Callahan were federal detainees with no affiliations to the area or local charges, the sheriff's office said.After he escaped, the FBI and the U.S. Marshals Service offered a combined $70,000 reward for information leading to the arrest and conviction of Marin-Sotelo."
    ]
}