{
    "articleURL": "/wires/pa/article-12049849/Retailers-report-unprecedented-demand-coronation-mementoes.html",
    "content": [
        "Sales of coronation memorabilia have attracted “unprecedented” demand as consumers seek a lasting memento of the occasion.",
        "Luxury ceramics maker Halcyon Days said it expected sales of more than £1 million of its collections created to mark the occasion and had increased its workforce by 20% since January to create an additional 150,000 products.Boss Pamela Harper said: “We have seen unprecedented demand for our coronation collections.“As a royal warrant holder and the sole historical suppliers of objets d’art to the British royal family, we have always seen our sales surge during royal occasions.“However, the King’s coronation is truly a momentous occasion and we have been overwhelmed by demand.",
        "“To prepare, we have increased our workforce by 20% since January and have created an additional 150,000 products for our coronation collections. I am delighted to see consumers from the UK and abroad alike continue to celebrate the best of Britain.”EBay has also reported a roaring trade in coronation-themed mementoes as searches for ‘coronation teddy’ jumped by more than 980% week on week, ‘God save the King cushions’ by 400% and ‘King Charles III coronation mug’ by more than 260%.Shoppers were also seeking out investment pieces, with searches for ‘King Charles stamp’ doubling in the run-up to the weekend alongside a 200% increase in searches for ‘royal mint silver bullion coin’.Robert Parkinson, eBay UK’s coins, stamps and bullion manager, said: “The upcoming coronation is set to cause a huge spike in demand for Charles III coins and stamps on eBay.",
        "“The British royal family is popular around the world and being the first coronation to take place in over 70 years, it will undoubtedly generate a wide selection of popular memorabilia set to increase in price over time.",
        "“Of course, rarity is key when it comes to adding value to collectable items. The magnitude of this event will likely see huge numbers being produced, so patience is key for would-be collectors hoping to sell things on for significant profit.”Meanwhile, Sainsbury’s said it had sold 143.3 miles of bunting and 22,000 Charles and Camilla face masks ahead of coronation weekend.Searches for red, white and blue clothing are also up by 676% on last week, the supermarket said, while searches at Argos for King Charles cardboard cut-outs are up by 369% over the last four weeks.Sainsbury’s also said sparkling wine sales are up 128% year on year, with sales of Nyetimber soaring by 600% as consumers choose to buy British for the coronation weekend.Lidl said quiche sales were up 33% as customers took inspiration from the official coronation dish, while sales of mini Scotch eggs and Melton Mowbray pork pies were up 15% and 10% respectively.The supermarket said it sold one of its coronation mugs every five seconds on the first day of sale, along with enough bunting to line the coronation procession route 75 times.",
        "Wine merchant Berry Bros. &amp; Rudd said sales of English sparkling wine were up 304% on last year."
    ]
}