{
    "articleURL": "/tvshowbiz/article-12039945/Phoebe-Burgess-triggered-seeing-images-NRL-star-ex-Sam-flash-screen.html",
    "content": [
        "Phoebe Burgess admitted she finds photos of herself with ex-husband Sam 'triggering' as she spoke of her life post-divorce on Today Extra on Wednesday.",
        "The influencer, 35, was being interviewed by hosts Sylvia Jeffreys and David Campbell about her new Vogue podcast when a picture of the Burgesses in happier times flashed up on screen.In an awkward moment, she said seeing herself with Sam, a former NRL player-turned-coach, was a 'slight trigger' following their messy separation in 2019.'She's back, baby. Good morning, it's nice to see you back,' Campbell said at the start of the segment.'She's back. Only a slight trigger with a few of those images there, but we will sail through,' Phoebe replied, referring to the photo montage during her introduction.",
        "She then said she had been 'doing well' while juggling her career with raising her two children with Sam, daughter Poppy, six, and son Billy, four.'We're going well. I always say \"we\" as I feel like I come in a pack, there's three of us,' she added.'I think I made a joke that I've been hiding down in Bowral, but getting that call from Vogue to do the podcast really changed things a lot.'",
        "'I don't sit people down and coerce them to give me the juice on their trauma, but it's cool to get women talking,' she continued.Speaking of life as a single mother, Phoebe said it can be 'isolating' doing it alone, but she has been empowered by other women in the same position telling their stories.",
        "'[Single parent families are] the fastest growing family in Australia,' she said.'It can be really isolating thinking the way you planned your life, the future you envisioned for yourself and the way you like to raise your kids, is completely erased and you're back to a clean slate, ground zero.'",
        "Phoebe went on to say she isn't looking for love anytime soon, despite Sam moving on with English hairdresser Lucy Graham, with whom he is expecting a child.'Knowing my family is complete, I'm not actively looking for something,' she said.'I don't have that feeling anymore. If it comes along, great, but that's a freedom I can enjoy,' she added.Phoebe revealed on her podcast Under the Gloss last month that her children had saved her from despair during her divorce.'That was the only solid thing that I held onto. That was it. They needed me,' she said.Phoebe, who split from Rabbitohs star Sam in October 2019 before finalising their divorce a year later, added: 'I had to still be here [for the children]. The thing that gets you up off the floor is that they need you.'",
        "The Burgesses married in 2015, separated in late 2018 and resumed their relationship in early 2019. They split for good on October 2 that year.",
        "Daily Mail Australia revealed last month Sam was expecting a third child with his new partner Lucy Graham, just five months after they went public with their romance.'We are so excited and happy to be starting this new chapter together... Happy days,' the English rugby league star said in a statement."
    ]
}