{
    "articleURL": "/news/article-12046617/Woman-23-arrested-faking-disappearance.html",
    "content": [
        "Chloe Stein, 23, was last heard from on Monday when she claimed in a text to her boyfriend that she had been pulled over by police on a desolate roadIn 20 hours she was missing, 'tens of thousands of dollars' was spent on searchStein was charged with making false reports, false alarm to agencies of public safety, obstruction of the administration of law, and disorderly conductA Pennsylvania woman who was feared missing has been arrested after she allegedly faked her disappearance as it was revealed she wasn't going to graduate college this year.",
        "Chloe Stein, 23, was last heard from on Monday when she claimed in a text to her boyfriend that she had been pulled over by police on a desolate road.She was reported missing the next day when her Volkswagen Beetle was found with her cell phone inside. Over the next 20 hours, authorities spent 'tens of thousands of dollars' searching for the woman. Stein was found safe by Tuesday night and had a wild tale to tell about being held at gunpoint before being released. But Pennsylvania State Police said the evidence was inconsistent and Stein then admitted to making up the entire story.Stein was charged with making misdemeanor false reports, false alarm to agencies of public safety, obstruction of the administration of law, and disorderly conduct. She was arraigned on Wednesday morning and is scheduled to be back in court for a preliminary hearing on May 25.",
        "In a press conference on Tuesday night, Trooper Steve Limani announced that Stein had been found at the home of an acquaintance in Jeannette.  Limani explained that there was no record of Stein being pulled over and that it was believed Stein ditched her car Monday night after texting her boyfriend and then walked to the residence in Jeannette, where she stayed for about 21 hours, according to a tip police received. ",
        "Police clarified on Wednesday that Stein actually stayed in a garage off Wylie Avenue, where Stein and her family live.  A neighbor told WPXI that Stein showed up on their porch and her family and authorities were then contacted. That is when she told police about her alleged abduction. 'She was released after being held at gunpoint and semi-assaulted, we'll call it, and bound,' Limani said. 'So then she was released and dropped off near an alleyway near her home. Of course, 'cause that's what someone would do.'Investigators confronted Stein about her story and how the evidence didn't add up, which led to Stein admitting that she fabricated the ordeal, according to the criminal complaint.'Video evidence, cellular evidence and information obtained during interviews concluded that Stein had fabricated the incident,' troopers wrote in the complaint.'When questioned further about the inconsistencies, Stein admitted that she had fabricated all of the information pertaining to the incident.'",
        "'The way it was described to us is the garage is behind her house and that's where she was for the majority of the duration,' Limani said. ",
        "Limani said it's believed Stein faked her disappearance because while her friends and classmates were looking forward to graduation, she apparently knew she would not be part of it. ",
        "Stein's mother told police her daughter was set to graduate from Penn State Greater Allegheny this weekend, but a university official confirmed that Stein had not in school for more than a year.  A representative from Penn State Greater Allegheny later told WPXI that Stein has not been enrolled at any Penn State campus since the fall 2018 semester.'Now all of a sudden, as an investigator we're thinking, 'Well, wait a second. There's alternatives. There's reasons for her to 'disappear,' to escape life,' Limani said.'The situation at college was a driving force, probably the number one driving force for the whole scenario,' Limani added. State police held the press conference immediately after locating Stein because they wanted to let residents know there was no danger to the community.'The only reason we are here before tomorrow is because the people need to know there is not somebody pulling people over this minute that is abducting people,' Limani said. 'There was never any police stop. There was never any pullover. None of that happened.''She recklessly endangered the lives of others, and scared her family and friends,' he added. ",
        "Limani said that after Stein sent her boyfriend the text on Monday night and then wasn't heard from for hours, her worried boyfriend and friends went looking for her.",
        "They located her car abandoned along Radebaugh Road underneath the Toll Route 66 bridge about a mile from the Sonic restaurant. Her cell phone was found inside.A passerby would later tell police that they spotted the parked vehicle around 11:10 p.m. on Monday.It was determined that Stein has ditched her car and walked the three miles back to Jeanette where she stayed until she was located and arrested. Police spent resources and 'tens of thousands of dollars' looking for Stein on Tuesday. They deployed a helicopter in the search and conducted data searches in an attempt to locate her, Limani said.Limani also stressed that despite the manpower and money spent, what matters most is that Stein is alive and safe.  'We were concerned before that we had a criminal investigation that may possibly be whatever you want to call it, kidnapping, some type of assault, who knows what it could've been, so we went from investigating that type of potential crime to now we are trying to investigate what is this type of crime, when you are risking inconvenience, alarm, alarming a community,' Limani said Tuesday. 'I don't want to miss the point of — at least she's safe.'Stein was taken to the Westmoreland County jail in Hempfield where she was arraigned Wednesday morning.",
        "Stein's attorney Phil DiLucente released a statement to KDKA-TV.'My client and her family are grateful for the support and kindness of all concerning recent events, and to that end respectfully requests privacy at this time.'"
    ]
}