{
    "articleURL": "/news/article-12056951/Alabama-cheerleaders-injured-Sweet-16-party-shooting-fighting-lives.html",
    "content": [
        "Cara Johns and Trinity Richards, both 16, were critically injured on April 15They are in the ICU after being struck several times at a Sweet 16 party Four people died and 28 were injured in the mass shooting in DadevilleTwo Alabama cheerleaders injured in the Sweet 16 mass shooting that left four dead and 28 injured are fighting for their lives after being shot several times, including in the head.",
        "Cara Johns and Trinity Richards, both 16, were injured when six gunmen allegedly opened fire at Birthday girl Alexis Dowdell's celebration at the Mahogany Masterpiece Dance Studio in Dadeville, Alabama, around 10.30pm on April 15.Both girls were shot in the head but also sustained wounds around their legs, stomachs and chests. The two are fighting for their lives after being told their conditions may not be 'survivable.'Recalling the moment Johns' family found her in the hospital, one of her parents, whose name wasn't disclosed, claimed 'it was a nightmare [they] couldn't awaken from.''She had left in a beautiful prom dress but now she was covered in a bloody hospital sheet,' a GoFundMe for Johns read.Wilson LaMar Hill Jr., 20, Johnny Letron Brown, 20, Willie George Brown Jr., 19 and brothers Ty Reik McCullough, 17, and Travis McCullough, 16, were arrested and charged in connection to the massacre. A 15-year-old was also arrested, but his name wasn't disclosed due to his age.",
        "GoFundMe organizer Sara Oswalt said Johns was still recovering in the ICU and has 'miles' to go before she hopefully returns back to her life.Johns is a junior in high school and a cheerleader. In her spare time, she worked at a local restaurant - a life her family only hopes she can get back to.",
        "'We have hope that as long as we have our Cara alive, we will be able to make it,' Oswalt wrote.Oswalt posted a statement from one of Johns' parents recalling the 'nightmare' of when they received a call their daughter had been a victim of another mass shooting.'At 11:10 Saturday, April 15, 2023, our nightmare began. I was told my beautiful 16-year old daughter had been a shooting victim in the mass shooting at a birthday party in Dadeville, Alabama. 'I rushed to the local hospital only to discover Cara was not at that location. Because of the overwhelming chaotic situation, I had to search two more hospitals before discovering where she was. 'The physician in charge told us Cara's condition may not be survivable. This was a nightmare we couldn't awaken from. She had left in a beautiful prom dress but now she was covered in a bloody hospital sheet. 'Cara was then rushed by ambulance to a facility in Georgia that specialized in gunshot head injury. A bullet had penetrated her brain, passing through the frontal lobe and lodging there. 'She had to have immediate emergency surgery. But that wasn't all. She'd also been shot in the chest and in the stomach, three bullet wounds. Unbelievable and a miracle she was still living.' ",
        "As of May 2, Johns was taken off the ventilator and able to breath on her own, Justin Johns, her father, wrote on Facebook.  He added the cheerleader's stomach bleeding was under control and the blood clots had disappeared.'When I first walked into the room this morning she smiled at me which was a touching moment for me she knows who I am and she also knows a lot more,' he wrote. As of Sunday afternoon, more than $13,000 had been raised.  ",
        "Trinity's parents also broke their silence on their daughter's condition and claimed she was shot in the head, foot and side - as a fourth bullet grazed her leg.The cheerleader was initially deemed unable to be saved but a medic at the scene 'saw something special in her as she lay there dying.' 'He encountered Trinity he observed her agonal breathing, gasping for air every 15 seconds or so,' her mom, Cheryl Sledge Richards, wrote on GoFundMe.'When this occurs they expect a dying brain, heart attack or stroke. He said when triaged they had coded her as being beyond help.'She added: 'He decided to provide her with an airway to save her life. We are grateful to him for that and praise God for guiding him.'",
        "Trinity's family prayed for a miracle as they watched their 'once fiercely independent, incredibly physically strong, enthusiastic cheerleader' lay in an ICU hospital bed.",
        "She is currently on several drugs and medical devices while battling different infections, as doctors had to remove a portion of her skull. Despite her injuries, Trinity is currently 'talking, laughing, smiling' as she now works toward sitting up and eating on her own.The cheerleader has goals of going to an Atlanta college and her family prays she might still accomplish her dreams after about a year of treatment.More than $6,500 had been raised for the cheerleader.The four victims killed in the shooting were identified as Corbin Dahmontrey Holston, 23, Shaunkivia Nicole 'Keke' Smith, 17, and Marsiah Emmanuel Collins, 19, and high school football star Philstavious Dowdell, 18. Philstavious was the birthday girl's brother.The shooting at the dance studio on North Broadnax Street also led to Philstavious's mother being injured. ",
        "At the time of the shooting, Alabama District Attorney for the Fifth District, Mike Segrest, said there were four victims in the hospital in critical condition. It's unclear the identities of the other two victims. While 20-year-old Brown was arrested in connection to the shooting, his mother claimed he is innocent. 'He didn’t do any shooting. When the firearms started firing off, he got down on the floor,' Amanda Riley, Brown's mother, told AP. 'My kids don’t carry weapons, I’m going to tell you that right now. The FBI just searched my house. They couldn’t find one weapon in my house. They didn’t find one bullet in my house and in my shed out back.' ",
        "Brown has no criminal background and was set to play football at Faulkner University in the fall."
    ]
}