{
    "articleURL": "/news/article-12056411/Police-launch-urgent-appeal-missing-boy-15-seen-Friday.html",
    "content": [
        "Police concerned for the welfare of Warren Taylor, 15, reported missing FridayComes amid two other men, 17 and 21, also missing from West Yorkshire Police have launched an urgent appeal for a boy who was reported missing on Friday and has not been seen since.",
        "Warren Taylor, 15, is believed to have been wearing a dark blue jacket, black tracksuit bottoms and black trainers when he disappeared in West Yorkshire. Police are concerned for the teenager's welfare and are desperately seeking any information that could help them in their efforts to find him.Warren is known to frequent Batley - a market town between Bradford and Leeds in West Yorkshire. West Yorkshire Police described Warren as a 15-year-old boy who is 5ft 6ins and officers have called on the public to contact them with any possible sightings.His disappearance comes amid a recent spate in the number of missing people in the area - with West Yorkshire Police also trying to locate 17-year-old Liam Woolford who has not been since since May 1.",
        "Liam, from Middleton, Leeds, was said to have been wearing black jeans and a black hoodie with a white 'Hoonighan' logo. He also had a black jacket and a grey baseball cap the last time he was seen.In a later tweet this morning, police said they believed Liam had moved to the Stonehaven area of Scotland. In a third appeal, police also reported Kai Stones as missing from Bradford. He is described as a 21-year-old slim man who is 6ft tall and was wearing grey Berghaus tracksuit bottoms and a grey Berghaus jacket.",
        "In a series of tweets yesterday, West Yorkshire Police said:  'MISSING FROM LEEDS: Warren Taylor, 15 y.o.. 5'6\", may be wearing a dark blue jacket, black tracksuit bottoms, black trainers. May frequent the Batley area. Concern for welfare, any sightings or info, ring 101/999, log ref: 1362 05/05.''Missing Person Appeal - Liam Woolford, 17 years from Middleton, Leeds. Black jeans &amp; a black hoody with a white \" Hoonighan \" logo on it. Black crosshatch jacket &amp; a grey baseball cap. Any information relevant to his whereabouts, please ring re-reference 01/05/2023.' 'MISSING FROM BRADFORD: Kai Stones, 21 y.o., slim, 6' tall, wearing grey Berghaus joggers, grey Berghaus jacket, likely with hood up - concerns for welfare. Any sightings / info, please call 101/999, WYP log ref: 1449 06/05.' "
    ]
}