{
    "articleURL": "/wires/ap/article-12047933/GOP-Oregon-state-senators-boycott-2nd-day-prevent-quorum.html",
    "content": [
        "SALEM, Ore. (AP) - Most Republican members of the Oregon Senate failed to show up for the second straight day Thursday, delaying action by the majority Democrats on bills on gun safety, abortion rights and gender-affirming health care.",
        "The stayaway prevented a quorum, with Senate President Rob Wagner calling for another try on Friday. Republican lawmakers have used walkouts in the past, but this time - if they continue to stay away - they´ll be testing a law approved overwhelmingly in a ballot measure last November that bans lawmakers with 10 unexcused absences from running for reelection.The boycott comes as several statehouses around the nation, including in Montana and Tennessee, have become battlegrounds between conservatives and liberals. Oregon has increasingly been divided between liberal population centers like Portland and Eugene and its mostly conservative rural areas.The leader of Senate Republicans, Sen. Tim Knopp, spoke on the phone Thursday with Democratic Gov. Tina Kotek after telling journalists Wednesday that a derailed legislative session would jeopardize the governor's legislative agenda, including tackling homelessness.Knopp´s spokesperson, Ashley Kuenzi, said Kotek expressed willingness to help resolve the impasse. But the governor's office had a different characterization of the call, with Knopp being asked to stop the boycott.\"The governor listened to his concerns and reiterated that he is making choices,\" said Kotek´s spokesperson, Elisabeth Shepard. \"She asked him to choose to get back to work to do the people´s business.\"",
        "Knopp told a news conference Wednesday that Republicans are protesting because bill summaries are not being written in plain language even though a 1979 state law requires they be readable by anyone with an eighth or ninth-grade education, which is measured by a score of at least 60 on the Flesch readability test.",
        "Senate Majority Leader Kate Lieber said that's just a pretext, and noted that the vast majority of bills have passed with bipartisan support, including on housing and attracting the semiconductor industry to Oregon.\"This is about abortion, guns and transgender rights,\" Lieber said. \"The timing of this is such that they´re walking out on important legislation that Oregonians sent us here to do.\"The Senate added this weekend to its schedule to convene, starting at 9 a.m. Saturday and Sunday.The existence of the readability law, passed by the Legislature in 1979 with bipartisan support, was discovered in April by a Republican caucus staffer. Knopp said he does not know when the law was last employed to make bill summaries easy to read.\"But it´s important that we follow the law because, if we´re passing laws today, are we just expecting in, you know, 20, 30, 40 years that people are just going to ignore the laws that we have on the books that we all passed,\" Knopp said Wednesday. \"I don´t think we would appreciate that.\"Asked if the Republican boycott was due to the bills on gun control and abortion and gender-affirming care, Knopp said, \"It´s about every bill. But those bills specifically also don´t qualify under this law, and they refuse to fix them.\"",
        "Knopp said Republicans are reviewing bills to see if they pass the readability test. He added that legislative counsel, the non-partisan office that drafts legislation, \"in large part is to blame for the bills not meeting Oregon law.\"Some local leaders, labor organizations and activists supporting reproductive and LGBTQ+ rights in Central Oregon called on Knopp to end the Republican walkout and planned to hold a rally later on Thursday in Bend - Knopp´s hometown.GOP lawmakers employed the same boycott strategy in 2019 and 2020 to freeze legislation capping greenhouse gas emissions, among other things. Oregon has a two-thirds quorum rule, meaning the state House and Senate need two-thirds of their members to be present to conduct business. In the Senate, that´s 20 of its 30 members. Currently, 17 senators are Democrats, 12 are Republicans and one is an independent.If Republican senators deny a quorum for the rest of the legislative session, which doesn´t end until late June, they could theoretically kill the bills on gun control, abortion rights and gender-affirming care.The wide-ranging bill on abortion and gender-affirming care would shield patients and providers from lawsuits originating in states where abortion and gender-affirming care are now restricted. It would also allow doctors to provide an abortion to anyone regardless of age and bar them in certain cases from disclosing that to parents.",
        "The gun control measure would increase the purchasing age to 21 for AR-15-style rifles and similar guns, impose penalties for possessing undetectable firearms and allow for more limited concealed-carry rights.___The Associated Pressreceives support from several private foundations to enhance its explanatory coverage of elections and democracy. See more about AP´s democracy initiative here. The AP is solely responsible for all content."
    ]
}