{
    "articleURL": "/sport/football/article-12048095/Sean-Dyche-insists-Seamus-Coleman-remain-Everton-season-ending-injury.html",
    "content": [
        "Seamus Coleman sustained a season-ending injury against Leicester on MondayThe 34-year-old fullback will see a specialist to learn the extent of the knock Everton boss Sean Dyche has insisted Coleman will remain 'part of the club'  Seamus Coleman will see a specialist on Friday to learn the extent of his injury with Sean Dyche adamant his captain still has a future at Everton.",
        "Though Coleman did not suffer a cruciate ligament rupture during Monday’s 2-2 draw at Leicester, the impact he sustained in a challenge with Boubakary Soumare was significant and he will not play again this season.There is still a possibility he will require surgery to repair the damage.Coleman is one of several players who is out of contract at the end of the campaign. He needed to figure in three more fixtures before the end of the season to equal Tim Howard’s club record of 354 Premier League appearances and it would be dreadful if fate denied him that opportunity.The 34-year-old has made it clear he does not want discussions about his own circumstances to be any kind of distraction, as Everton fight to avoid relegation, but Dyche insists Coleman, a £60,000 signing from Sligo Rovers in 2009, will be an influence in the next four games – and in the long-term.",
        "‘Seamus is well on board with what we are trying to achieve here,’ said Dyche. ‘He is in the loop. I have had discussions with him about the team and the club because he has such a great knowledge of the feel of the group and the club.’Everton have always tried to keep former players around their coaching set up and Coleman, who started doing his badges a couple of years ago, is not the kind of character they could afford to lose. During his peak years, he was one of the best right-backs in the Premier League.",
        "Dyche added: ‘He is certainly a part of the club and will be going forwards, one way or another. He will be around – even immediately going forward with his injury. I had a chat with him about it to get some of his thoughts. He knows the club in and out, the feel of it, the story of it.‘But he is also a very knowledgeable Premier League player and he has a really good manner about him. 'He is really honest and authentic, he is one of the pros you want around the group because the younger players can see that and learn as they go through the ups and downs of their development.",
        "‘They can see someone who has been through it all and still doing it. Now he will be affecting it in a different way. We will still be involving him, still be chatting to him and he will still be rubbing off on the players I can assure you.’On the specific of whether contract talks have taken place – Kevin Thelwell, Everton’s Director of Football, is predominantly handling this – Dyche explained: ‘Like all the players, we are having communication with the relevant people and their agents.‘But Seamus’ focus is solely on the club, as you can imagine. Being the servant he is to the club, and the way he is, he hasn’t even had one question to me about it. ",
        "'We don't want to clutter that with anything other than being respectful and truthful with the players.’"
    ]
}