{
    "articleURL": "/wires/reuters/article-12054129/Expect-electric-atmosphere-Padres-host-Dodgers.html",
    "content": [
        "Before Friday's opener of the first Dodgers-Padres series of the season, Los Angeles manager Dave Roberts took notice of the atmosphere at Petco Park in San Diego.",
        "\"Their fans are into it anytime we are here,\" he said.And Padres manager Bob Melvin agreed.\"Everyone in our clubhouse knows what the crowd is going to be like,\" Melvin said in his pre-game media session. \"We absolutely love the atmosphere. It's going to be loud.\"Expect the same on Saturday night when the two National League West rivals meet again.\"These games are fun,\" San Diego's Fernando Tatis Jr. said after hitting two home runs for a second time off Clayton Kershaw on Friday night to fuel the Padres' 5-2 win in the series opener. \"These are the Padres against the Dodgers. And Padres fans love it.\"The Dodgers might still view the San Francisco Giants as their biggest rival. Clearly, residents of San Diego view the Dodgers as Public Enemy No. 1. And they have taken to letting the Dodgers know it almost pitch-by-pitch.\"This is how it should be,\" Roberts said of the atmosphere at Petco Park.The Padres -- and San Diego's -- dislike toward all things Dodgers started long before the Padres crushed Los Angeles in last year's National League Division Series. It's been building for years. \"Beat L.A.\" has become a mantra of Padres fans.However, it's been hard for the Padres to make their \"rivalry\" case while the Dodgers won the season series 14-5 in 2022.",
        "\"We won tonight,\" Tatis said. \"Time to keep it going.\"Saturday's middle game of the series will have right-hander Dustin May (3-1, 3.15 ERA) pitching for the Dodgers against Padres left-hander Blake Snell (1-4, 5.28).After drawing a crowd of 45,116 Friday night -- their 11th sellout of the season -- the Padres are looking toward two more sellouts and possibly the largest three-game series total in Petco Park history. The present mark is 133,856 set against the Dodgers over April 22-24, 2022.May will make his seventh start of the season Saturday night. He has given up 12 runs on 20 hits and 14 walks with 23 strikeouts in 34 1/3 innings. The Dodgers are 3-3 in May's starts.May has a 1-4 career record against the Padres, with a 3.88 ERA over 10 appearances (seven starts). He has 43 strikeouts against 14 walks in 46 1/3 innings.Snell has a postseason history with the Dodgers. Last October, he claimed the Padres' penultimate win in the NLDS, holding the Dodgers to one run on five hits and two walks with six strikeouts in 5 1/3 innings. And for the Tampa Bay Rays in the 2020 World Series, he held the Dodgers to three runs on four hits and four walks with 18 strikeouts in 10 innings, spread over two outings, for a 2.70 ERA.",
        "Snell picked up his first win of the season in his most recent start, Monday vs. the Cincinnati Reds. But over his last three outings, Snell has given up seven runs on 15 hits and eight walks with 17 strikeouts in 16 innings for a 3.94 ERA.--Field Level Media"
    ]
}