{
    "articleURL": "/wires/reuters/article-12045973/Russian-rouble-soars-one-month-high-oil-prices-halt-slide.html",
    "content": [
        "By Alexander Marrow",
        "May 4 (Reuters) - The Russian rouble climbed sharply to a more-than-one-month high on Thursday, gaining for a fifth straight session, as oil prices steadied after a recent slide, somewhat countering the impact of reduced foreign currency supply.By 1326 GMT, the rouble had firmed 1.6% against the dollar to 77.94, its strongest mark since April 3.The rouble should trade at 74-76 against the dollar in the next three to six months, said Dmitry Polevoy, head of investment at Locko-Invest, as imports slow, the public's demand for hard currency drops and companies convert forex to pay dividends.It gained 1.8% to trade at 86.17 versus the euro and was 1.8% firmer against the yuan at 11.24 , also its strongest since early April against both currencies.The rouble strengthened sharply after the central bank held interest rates steady on Friday, but retained the prospect of future hikes. The rouble has also benefited with a lag from high oil prices throughout April, which translates to higher export revenues for Russian exporters.But after month-end taxes were paid on April 28, the rouble can now count on reduced supply of foreign currency in the market.Brent crude oil, a global benchmark for Russia's main export, was down 0.1% at $72.29 a barrel, paring earlier gains and struggling to claw back the more than 9% decline of the previous three sessions.",
        "The drop in oil prices to $73 from $80 per barrel will put pressure on the rouble and may lead to another wave of weakening, said Banki.ru chief analyst Bogdan Zvarich in a note.\"In the current situation, risks remain that the dollar-rouble pair will return to the 80-82.5 range,\" Zvarich said.Russian stock indexes were higher, hovering not far from near-three-week lows.The dollar-denominated RTS index pared intraday losses to gain 1.6% to 1,024.1 points. The rouble-based MOEX Russian index was steady at 2,532.9 points.Russian stocks are unlikely to see any serious buying interest before Russia's long weekend, said Sinara Investment Bank analysts. The country celebrates Victory Day on May 9.Geopolitics are partly to blame for Russian stocks' recent decline, while investors globally fear recession, hence the sustained drop in Brent, Sinara said. (Reporting by Alexander Marrow; Editing by Christina Fincher and Sohini Goswami, Kirsten Donovan)"
    ]
}