{
    "articleURL": "/femail/article-12048639/Army-chic-Crown-Princess-Mary-Denmark-participates-Home-Guard-parade-Copenhagen.html",
    "content": [
        "The annual memorial service marks Denmark's liberation from Nazi ruleRead More:  Princess Mary lets her natural beauty shine through as the Danish royal touches down in Australia on her first official visit in over 10 yearsCrown Princess Mary of Denmark wore army uniform today as she took part in a Home Guard Parade in Copenhagen.",
        "The 51-year-old royal was appointed captain of the Danish Home Guard in March 2019.In her role, the mother-of-four oversees the annual Parade – which celebrates Denmark's liberation from Nazi rule.At the ceremony at the Kastellet fortress, the royal – who grew up in Australia – donned a khaki military uniform and combat boots.Mary proudly had four medals on show for the ceremony, including the Order of the Elephant, which is the highest ranking order in Denmark.",
        "The royal also had a ceremonial sword tucked into her belt as she laid a wreath at the memorial.  Mary swept her long brown hair into a voluminous ponytail and tucked it under a racing green beret.After laying the wreath, the royal gave the memorial a salute – as she paid tribute to those who lost their lives in WWII. It comes as Queen Maxima of the Netherlands and King Willem-Alexander also took part in a Remembrance Service in Amsterdam this evening.Last month, Crown Princess Mary returned to Sydney for her first official visit in over 10 years. However, the trip was rocked by a security scare on day one after she was confronted by a man in a helmet wearing a Go Pro camera.The heckler, wearing a high-vis vest, was overhead saying 'I got close to the Crown Princess' before a security guard in dark sunglasses intervened. ",
        "Photographs show the man just one metre away from the princess's bike just moments before security moved between them. ",
        "Although she was born and raised in Tasmania, Mary moved to Denmark during her courtship with the heir to the Danish throne. The love story between Princess Mary and Prince Frederik has been well documented.She famously met her husband by chance at Sydney pub the Slip Inn during the 2000 Olympics.After their encounter, Fred – who was in Australia to support Denmark's Olympic sailing team – asked Mary for her phone number and a romance blossomed.'The first time we met we shook hands. I didn't know he was the prince of Denmark. Half an hour later someone came up to me and said, \"Do you know who these people are\"?' Mary revealed in an interview about their meeting.",
        "They maintained a long-distance relationship for a year, with Frederik making secret trips Down Under before Mary moved to Denmark to study the Danish language at Copenhagen's Studieskolen in 2001.In early 2003, Frederik's mother Queen Margrethe publicly acknowledged the relationship and the couple announced their engagement at Amalienborg Castle later that year on October 8.Frederik and Mary married on May 14, 2004 at Copenhagen Cathedral, with the newly minted Crown Princess opting for a beautiful gown by Danish designer Uffer Frank and a veil first used by Crown Princess Margaret of Sweden in 1905.",
        "Their first child, Prince Christian Valdemar Henri John, was born October 15, 2005; Princess Isabella Henrietta Ingrid Margrethe followed on April 21, 2007.Almost four years later Mary and Frederik welcomed twins, Princess Josephine Sophia Ivalo Mathilda and Prince Vincent Frederik Minik Alexander at the Rigshospitalet in Copenhagen on January 8, 2011."
    ]
}