{
    "articleURL": "/news/article-12041307/Married-teacher-18-month-affair-girl-pupil-sex-Travelodge.html",
    "content": [
        "Dr Iain David Bryant is alleged to have had an 18-month affair with a schoolgirl Pupil A explained measures Bryant took to keep relationship secret from his wife A married Scottish teacher faces being struck off for an alleged 18-month affair with a schoolgirl in which the pair reportedly used burner phones to arrange illicit meet-ups that included sneaking off to car parks and Travelodge to have sex.",
        "Dr Iain David Bryant taught chemistry at Levenmouth Academy in Leven, Fife, and is claimed to have begun an illicit tryst with the student - known simply as Pupil A - in October 2017. The teacher, known as David to friends and colleagues, allegedly kissed the unnamed student - who was under 18 at the time - after she came to him when she was having a hard time in school.   This initial kiss allegedly developed further, and it is claimed that they began a full sexual relationship after she turned 18, and would sneak off to desolate car parks to 'engage in oral sex and foreplay'.The 55-year-old is appearing at five-day hearing of the General Teaching Council for Scotland (GTCS).Bryant faces eight allegations in total, and if found guilty could be removed from the teaching register.",
        "He is accused of kissing and touching the girl in a school laboratory, giving her a mobile phone so they could communicate and establishing a code word they could use as part of their alleged illicit relationship. After the girl turned 18, Bryant is said to have met her several times a week to engage in sexual activity.Bryant - who now works as a celebrant - allegedly met the student in a nearby Travelodge after she turned 18 to have sex.",
        "According to the pupil, this followed a series of secretive meetings in desolate car parks and garages where they would engage in oral sex and foreplay.During the hearing, the three-person panel for the GTCS heard from Levenmouth Academy head teacher Ronnie Ross, who claimed that he discovered hidden notes that had been passed between the pair following Bryant's suspension in 2019.Mr Ross also said he found a series of 'trinkets and a soft toy' that were exchanged as gifts between Bryant and the girl.In his evidence on Tuesday, Mr Ross said: 'There were trinkets, a small soft toy and I saw some messages that were kept next to the items, it was a large cupboard behind the learning wall.'Lauren Doherty, presenting officer for the GTCS, asked the head teacher whether the notes revealed much about the alleged relationship.",
        "Mr Ross replied that they were 'superficial', adding: 'The notes were just correspondence between the pupil and the member of staff that were private - nothing that was shocking, but the fact that there were little notes and Pupil A had told a teacher that when they got the gifts and when they were exchanged.'There was love and kisses, no suggestion of sexual intercourse, it was more superficial things that were said. You thought, \"My goodness, they shouldn't have done that\".'",
        "The panel also heard from Dean Hendry, Levenmouth's principal teacher of history and modern studies, who spoke about how two teachers - Steve Davies and Laura Barrowman - told him about a rumour of a romance between Bryant and Pupil A following a school trip.Mr Hendry said yesterday: 'It was a higher modern studies trip to the parliament building in Edinburgh. It was in relation to gossip they had heard on the day of the modern studies trip to the Scottish Parliament.'Steve Davies and Laura Barrowman were having lunch, and the pupils were having lunch, and what they said was pupils behind them [were] talking about teachers they fancied and at one point they overheard a pupil had a relationship with a teacher.'I can't confirm if that was the word used, relationship or affair, but it was along those lines.'",
        "'Between October 2017 and June 2019 at Levenmouth Academy, it is alleged that the teacher did enter into a relationship with Pupil A, then a pupil at the school and did:'Take Pupil A away from a window and hug her as she was feeling upset.''Say he was thinking about kissing Pupil A the following day.''Kiss Pupil A [who at the time was still at school and under the age of 18].''Engage in an emotional relationship with Pupil A who at the time was still at school and under the age of 18.''Kiss and touch Pupil A in the technician's lab.''Meet Pupil A two or three times a week in parks and walk dogs.''Give Pupil A a mobile phone a few months later, and contact her using a code word Delilah.''Meet Pupil A in a Travelodge and/or other property and engage in sexual activity once she was over 18.'",
        "But he claimed he couldn't report the allegations because he wasn't sure which teacher was involved.He told the GTCS how the affair came to light six months later when staff were finally told of the allegations against Bryant, saying: 'I think it must have been at least six months after Dave had been suspended, staff weren't told initially and rightly so, people began to chat and say he had been suspended for an alleged relationship with a pupil.'",
        "On Monday, the GTCS heard evidence from Pupil A about how the alleged relationship began.She explained: 'It started out that David was just a teacher that I could have a rant with, it was just the two of us, most of the time the door was shut. I had a hard time in school and he would be the teacher I could talk to.'In November of 2017, one of the times I was talking, he made a comment about wanting to kiss me and I told him to go for it, so he did and we were kissing pretty much every day. The relationship lasted about three years from when I was 17 and I ended it as I had become more mature and sick of being second best, so I told him to choose between me and his wife.'Pupil A also told the hearing of the extreme measures Bryant took to keep their relationship a secret from his wife.It was heard that he went as far as buying a burner phone, and using a family member's home for their meetings.Pupil A, who is now 23, told the GTCS that a month after they first kissed 'he bought a pay-as-you-go phone so we could talk over the Christmas break'.",
        "She added: 'At the beginning it was just me confiding in him, after the kiss it went from there, he would pick me up from school and we would drive about and chat. 'It was mostly mutual, I wouldn't put it all on him, we didn't sleep together until March of 2018 when I had turned 18.'From the beginning he would tell his wife he had things on so we could meet. When we met up it was always in secret and in the car. He had keys to a second house, I think it was his wife's cousin's home, so we started meeting there.'The hearing heard that the pair kissed and touched in a science lab at Levenmouth Academy as well as meeting parking outside East Fife FC's Bayview stadium.Pupil A also revealed that the pair began a full sexual relationship at a Travelodge in Glenrothes, Fife, after she had turned 18.Pupil A said: 'There was a lot more oral sex and foreplay leading up to when we slept together. I had never had a relationship like that before so it was all very new to me and I was hesitant to begin with.'There's a local football ground at Bayview and there is rubble ground which is used as a car park so we would use that a lot.'",
        "Speaking of having sex at a travelodge in Glenrothes, she said: 'I think it was chosen as it was more accommodating than a car seat, and the local Travelodge is only a five-minute drive for me, but far enough away from where he stays that he wouldn't be caught.'The hearing continues."
    ]
}