{
    "articleURL": "/sport/golf/article-12061073/Republicans-outrank-Democrat-rivals-list-Washington-DCs-100-golfers.html",
    "content": [
        "In total, 34 members of the GOP finished in the top 100, compared to 10 DemsThe list incorporates lobbyists, insiders and elected officials, like Joe Biden DailyMail.com provides all the latest international sports newsBeltway Republicans are more economical than their Democratic counterparts, or at least that appears to be the case on the golf course.",
        "Golf Digest has released its list of Washington DC's top-100 golfers – a list compiled of presidents, senators, representatives, congressional staffers, lobbyists, and political titans. In total, 34 members of the Grand Old Party made the list, compared to just 10 Dems.Not only do the Republicans generally get through 18 holes in fewer strokes than Democrats, but their top officials outperform the other side of the aisle at the highest levels of power.Donald Trump, for instance, was first among presidents, while ranking 11th overall with an estimated 2.5 handicap (although Golf Digest notes he has not recorded a score publicly in more than a year).Former President Barack Obama ranked 43rd with an 8 handicap, while George W. Bush was tied for 86 with a 15 handicap. Current President Joe Biden ranked 59th, although his game has suffered due to fewer rounds than his predecessors.",
        "Absent from the list is former Vice President Dan Quayle, who was a three-year letterman at Depauw University and regularly appears in pro-am events.In total, a dozen congressional Republicans made the list to the Democrats' five. The top-ranking elected official is Texas congressman Roger Williams, who came in at 17. Other high-ranking Republicans include South Carolina congressman Bill Timmons and Georgia's Rick Allen.",
        "The best Democrat is Michigan's Dan Kildee, who ranked 61st.Other notables include Trump's former chief of staff, Mick Mulvaney, as well as former House speaker John Boehner, Texas Republican Chip Roy, and Kentucky Senator Rand Paul.But the top spot went to Tony Russo, who lobbies for T-Mobile and boasts a 1.9 handicap.Of course, Trump has more involvement in golf than just playing. He also owns several courses, which has helped him continue relations with foreign countries, such as Saudi Arabia, which owns the upstart LIV Golf tour."
    ]
}