{
    "articleURL": "/wires/ap/article-12053251/Military-Contractor-error-caused-Hawaii-toxic-foam-spill.html",
    "content": [
        "HONOLULU (AP) - An investigation found that a spill of about 1,300 gallons of fire suppressant at a fuel facility in Hawaii was caused by a maintenance contractor improperly installing an air vacuum valve, U.S. military officials said Friday.",
        "Aqueous Film Forming Foam, which is used to suppress fires caused by flammable liquids, contain PFAS, a class of chemicals that are slow to degrade in the environment.The firefighting foam liquid concentrate was spilled in November at the Red Hill Bulk Storage Facility near Pearl Harbor. The concentrate pooled on the floor inside the facility and then seeped under a door and onto a paved access road and soil, the military said.The contractor improperly installed an air vacuum valve to the foam system in April 2022, the military said in a statement. The individual also failed to disable the foam concentrate pumps from automatically starting prior to conducting fire suppression system testing on Nov. 29, 2022, which cause the uncontrolled discharge.The statement said, \"stricter safeguards and more assertive Navy oversight should have been in place to reduce the risk of this type of mishap.\"In 2021, jet fuel spilled from a drain line at the Red Hill Bulk Fuel Storage Facility. It flowed into a drinking water well and then into the Navy´s water system, which serves 93,000 people in and around Joint Base Pearl Harbor-Hickam. Nearly 6,000 people sought medical attention, complaining of ailments such as nausea, headaches and sores. The military put about 4,000 families in hotels for several months.",
        "The spills have contributed to distrust of the military in the community.Navy Vice Adm. John Wade apologized at a news conference announcing the findings of the investigation into the firefighting foam spill, Hawaii News Now reported.Navy groundwater monitoring sample results in the affected area after the November spill showed no exceedances of PFAS based on state and federal screening levels, the military said.PFAS - an abbreviation for perfluoroalkyl and polyfluoroalkyl substances - were developed as coatings to protect consumer goods from stains, water and corrosion. Studies of lab animals given large amounts of PFAS have found that some of the chemicals may affect growth and development, reproduction, thyroid function, the immune system and the liver."
    ]
}