{
    "articleURL": "/news/article-12060061/Fight-erupts-new-Utah-state-flag-opponent-saying-design-woke.html",
    "content": [
        "The new flag still carries an image of the beehive from which Utah derives its nickname, but is bolder and simplerIt is backed by leading GOP lawmakers, who say the old flag is drab, and does not stand out in a crowdBut some prefer the original design - and have even claimed its replacement is the latest example of woke culture run amok A row has erupted over the new state flag of Utah, with opponents claiming the new design is 'woke' and GOP backers saying the older flag was boring. ",
        "A bill signed into law in March said that a redesigned flag would replace the state flag from 1911.The new flag is a modern beehive design, set inside a honeycomb-shaped hexagon, with the state's famed mountains represented by white peaks that sit behind. Utah is nicknamed the Beehive State, thanks to its large Mormon population, who say the insect habitat perfectly encapsulates their philosophy of everyone working together. It replaces a more typical state flag dating back to 1913, which consisted of a crest with a bald eagle and beehive inside mounted on a dark navy back drop. Those behind the new flag - including most of the conservative state's top GOP lawmakers - say that it stands out more strongly, while still perfectly encapsulating Utah  But opponents claim the original flag is better - and have even suggested the new design represents woke culture run amok.  ",
        "Republican Mike Schultz, majority leader of the Utah House of Representatives, told the Wall Street Journal: 'We had a sucky flag. Now we have a cool flag.'Schultz, said he arrived at his position in a roundabout way, saying: ' [After the 2020 election] it took me about four months or so to take down the Trump flag because I was in denial.'I ran the Utah flag afterward. And I just thought, it looks like crap.' ",
        "But others have since said that the new flag design has gone 'woke' and in an attempt to have it reversed pushed for a referendum on the new design. Lt. Gov. Deidre Henderson's office said backers submitted just under 50,000 signatures, far short of the 134,298 they needed to put the issue to a vote in 2024. Chad Saunders, a marketing executive, who organized the referendum said he was unhappy about the process.Saunders gripe came over the new flag having the date 1847 removed, and other symbols marking when Brigham Young led Mormon pioneers into the Salt Lake Valley.He said: 'They don't want to be looked at as old, with our women's hair tied up in buns and wearing gingham.'",
        "Jeff Shoell, a GOP state delegate, said new-flag proponents 'want to have a version a kid can draw. 'Talk about dumbing down our society.'While Utah resident Scott Vandenhazel said: 'We don't need the woke design.'Meanwhile, Republican Representative John Curtis says he plans to fly both the old flag and the new one outside his office.Brandon Beckham, a member of the Utah Republican party state central committee, said the design is just 'a logo'.According to the WSJ, a political-action committee dubbed “Are You Listening To Us Yet?” has until next February to submit 134,298 signatures, to fight the design. ",
        "The new flag has been met with rave reviews by vexillologists, those who study flags.Ted Kaye, a flag scholar, said: 'We jokingly call those SOB flags—that’s a seal on a bedsheet.'Kaye said that the old Utah flag, which was changed 12 years ago to fix a mistake, wasn't simple or distinctive enough. In a reader's letter to the Salt Lake Tribune, local man John Middleton said: 'Even if it wasn’t my first choice, the new flag is a definite improvement on the old one.'Only time will tell if Utahans adopt this flag as enthusiastically as the citizens of the other four corner states have for their flags with colorful, graphic designs.'In total, the Utah government received more than 1,000 submissions of ideas for flags during the public submission phase.  "
    ]
}