{
    "articleURL": "/wires/pa/article-12060983/Humza-Yousaf-says-arrest-SNP-s-former-chief-executive-gut-wrenching.html",
    "content": [
        "Scotland’s First Minister has said the arrest of the SNP’s former chief executive was “gut-wrenching”.",
        "Humza Yousaf made the comments in an interview with Holyrood magazine, published on Monday, when he was asked about what he thought when he found out Nicola Sturgeon’s husband had been arrested.“It was really gut-wrenching, actually; I make no bones about it. I have known Peter and Nicola for many, many years. They are friends of mine. They are people that have helped me throughout my political career. And, frankly, I couldn’t quite believe the news,” he told the magazine.Mr Murrell was released without charge pending further investigation.Mr Yousaf, who took over from Ms Sturgeon as both First Minister and SNP party leader in March, said he was “only in control of what I’m in control of” and that the “government side of things has gone quite well” since he took office.",
        "“I would say that, of course, but I think we’ve been able to send clear signals about what we’re intending to come forward with in terms of some of the early policies which drive that direction of travel; we’ve been able to begin the process of refresh and resetting some of the important relationships with business, and the like, but yes, I feel frustration, of course, that it has been overshadowed, totally, by what’s happened in the past,” he told the magazine.",
        "“No, I don’t feel betrayal. Frustration, for sure. Not betrayal. But frustration over issues that started even before the election contest finished with the membership numbers debacle, it just didn’t have to happen and led to a whole disruption within the party.“Frustration, when I think about the legitimate press questions about when the auditor resigned and why did the party not know about it?“Why did members not know about it? And what’s been going on for six months since that has happened?“So, I definitely feel a sense of frustration. Not betrayal, but selfishly, a frustration that this is going on while I also have a big job to do to lead the country.”"
    ]
}