{
    "articleURL": "/sport/nrl/article-12055515/South-Sydney-Rabbitohs-star-Tevita-Tatola-dedicates-NRL-win-Melbourne-Storm-father.html",
    "content": [
        " Tevita Tatola gives tribute to late father Souths star said it's been a 'tough week' Souths beat Storm 28-12 during Magic RoundSouth Sydney forward Tevita Tatola has delivered an emotional tribute to his late father after his side's 28-12 victory over Melbourne, that puts the Rabbitohs on a five-match winning streak.",
        "'Junior' Tatola, 26, dedicated South's win to his dad Tevita snr who passed away during the week after a long run of poor health.Tatola, who had a challenging upbringing with six brothers, was very close with his father who lived with diabetes and required dialysis three times a week.'It's been tough, but, I know he would have wanted me to come play tonight,' he told Nine's Danika Mason after the match.'I just wanted to do him proud. I appreciate all the support. Especially JD and all the coaching staff at the club. ",
        "'They've been behind me and my family this whole week. It's just been a tough week. I love this club, love the boys.'Mason told Tatola that she is sure his father would be proud of the way he played and the person he is. 'Thank you,' said Tatola. The Souths prop then looked at the camera and gestured towards the sky. 'I love you, dad,' he said.From the outset, Souths had the better of what was billed as Magic Round's marquee match and could thank Cody Walker and Latrell Mitchell for both their early advantage and eventual margin of victory on Saturday night.South Sydney have knocked off reigning premiers Penrith, ladder-leading Brisbane and the Storm in the latest wins of their five-game streak to send a warning shot to the premiership and put a lukewarm start to the season behind them once-and-for-all.",
        "'It's a great start but that's all it is,' Rabbitohs coach Jason Demetriou said.",
        "'It's a start to the season we wanted but there's a long, long way to go.'If we keep having a defensive mindset, then we're a tough team to beat.'Encouragingly for Demetriou, the Rabbitohs are still below full strength and are only going to become more fearsome when forwards Keaon Koloamatangi, Shaq Mitchell and Siliva Havili return to fitness.Melbourne, meanwhile, could be about to lose a big man of their own - Nelson Asofa-Solomona appeared to aggravate his knee injury in a second-half tackle and jogged from the field late.In his 200th NRL game, Souths fan favourite Alex Johnston crossed for a double, his first of a campaign that has so far been dominated by Campbell Graham and the Rabbitohs' right edge.But the night belonged to Mitchell and Walker, at least one of whom had a hand in the first three tries that opened up the Bunnies' lead and ultimately sealed the result.'Our key players are playing well at the moment and that's what you want,' Demetriou said."
    ]
}