{
    "articleURL": "/wires/ap/article-12056909/Guardians-Galaxy-Vol-3-opens-114-million.html",
    "content": [
        "There is nothing like the promise of a chapter closing to draw people to the movie theater, especially when tied to the Marvel Cinematic Universe. This weekend, \" Guardians of the Galaxy Vol. 3,\" which says goodbye to this iteration of the space misfits and its driving creative voice, director James Gunn, earned $114 million in ticket sales from 4,450 locations in North America, according to studio estimates Sunday.",
        "Internationally, where the film opened in 52 territories including China, \"Vol. 3\" earned $168 million, giving it a $282 million global debut.Domestically, it´s both an impressive sum for any movie and slightly less than what we´ve come to expect from a Marvel opening. Last year on the same weekend, \"Doctor Strange in the Multiverse of Madness,\" riding on the success of \"Spider-Man: No Way Home,\" raked in $187.4 million in its first three days in North America. And in November, \"Black Panther: Wakanda Forever\" also opened over $181.3 million.But things have come back to earth this year, at least by high-flying superhero standards. \"Ant-Man and the Wasp: Quantumania\" debuted just over $106 million on its way to $474 million worldwide. At rival studio DC/Warner Bros., \"Shazam! Fury of the Gods\" only made $133.4 million total. The question on some analysts' minds this weekend is whether it´s because of the specific character or a bigger issue of \"superhero fatigue.\"\"Guardians Vol. 3\" bumped \" The Super Mario Bros. Movie \" out of first place after four weekends atop the charts and kicked off the summer movie season, a vital and usually profitable corridor for Hollywood that runs through Labor Day and often accounts for 40% of a year´s box office.",
        "For Comscore senior media analyst Paul Dergarabedian, it´s still a solid opening for the summer season, which he said is poised to deliver the most robust profits since 2019.",
        "\"Though `Guardians of the Galaxy Vol. 3´s´ debut may reflect a bit of audience fatigue for the reliable superhero genre, this is just the beginning for what promises to be an irresistible movie marketplace with a killer combination of appealing films for every taste and every audience demographic,\" Dergarabedian said.The next major superhero movie on the schedule is DC´s \"The Flash,\" set for June 16, which has its own flurry of intrigue around it because of star Ezra Miller's legal and personal troubles.\"Guardians Vol. 3\" sees the return of actors Chris Pratt, Zoe Saldaña, Dave Bautista, Karen Gillan, Pom Klementieff, Bradley Cooper and Vin Diesel. Reviews have been mostly positive, but a little more divided than previous installments. And it remains difficult to compare a pre-pandemic opening such as Vol. 2´s $146 million debut (May 2017) with a post-pandemic one.\"Vol. 3\" is Gunn´s last Guardians/Marvel movie as he turns his focus to leading DC Studios.\"The Super Mario Bros. Movie\" added $18.6 million in its fifth weekend to take second place, bringing its domestic total to $518.1 million. Globally, it has now surpassed $1.1 billion.",
        "Third place went to \"Evil Dead Rise\" with $5.7 million, and in fourth place was \"Are You There God? It´s Me, Margaret,\" with $3.4 million - both were holdovers.Studios left the weekend mostly clear for the superhero behemoth, but Screen Gems and Sony did debut their new Priyanka Chopra Jonas romantic comedy \"Love Again\" (featuring Celine Dion and some new songs) in 2703 locations. It made a modest $2.4 million to take the fifth place spot.Estimated ticket sales for Friday through Sunday at U.S. and Canadian theaters, according to Comscore. Final domestic figures will be released Monday.1. \"Guardians of the Galaxy Vol. 3,\" $114 million.2. \"The Super Mario Bros. Movie,\" $18.6 million.3. \"Evil Dead Rise,\" $5.7 million.4. \"Are You There God? It´s Me, Margaret,\" $3.4 million.5. \"Love Again,\" $2.4 million.6. \"John Wick: Chapter 3,\" $2.4 million.7. \"Dungeons &amp; Dragons: Honor Among Thieves,\" $1.5 million.8. \"Air,\" $1.4 million.9. \"Guy Ritchie´s The Covenant,\" $1.2 million.10. \"Sisu,\" $1.1 million. --Follow AP Film Writer Lindsey Bahr on Twitter: www.twitter.com/ldbahr."
    ]
}