{
    "articleURL": "/wires/aap/article-12040233/Australian-golf-great-Frank-Phillips-died-aged-90.html",
    "content": [
        "Australian golf great Frank Phillips OAM has died, aged 90.",
        "A winner of 23 professional tournaments worldwide including the Australian Open twice, Moss Vale-born Phillips died at a nursing home in Bowral on Tuesday night.Phillips, a life member of the PGA since 2002 and regarded as one of the supreme ball strikers of his era, was renowned for his devotion to the craft and his drive to succeed.The great Norman von Nida liked his game so much that he took him away overseas.Much of Phillips' success was in Asia, where he won the Singapore Open in 1965 and the Hong Kong Open in 1966 and 1973.\"I liked playing in the Far East because I had a wife and three kids, and I could get home relatively quickly. It took a very long time to get home from America. Touring was a challenge, but I always enjoyed it,\" he said several years ago.Phillips played in the Masters twice, in the US Open and at the British Open, achieving his best major championship finish, 12th at St Andrews in 1964.Phillips won his first Australian Open at Kingston Heath in 1957 and his second at Victoria Golf Club in 1961.He also famously finished equal second with Jack Nicklaus behind Gary Player in the Australian Open at Kooyonga in 1965.",
        "Phillips was proud to have mixed it with the likes of legends Nicklaus, Player and Ben Hogan throughout his career.\"You watch, you listen and you ask as many questions as you can,\" he said.\"I first met Gary Player in England in 1956 and he had possibly the worst golf swing I'd ever seen. But he worked so hard at the game, kept improving, won a couple of tournaments in England and then ended up winning nine majors, which was absolutely amazing. He was a fierce competitor, which inspired me.\"Phillips is survived by his three children Melissa, Frank Junior and Rodney, and a loving cluster of grandchildren and great grandchildren. His devoted wife Faye died in 1991."
    ]
}