{
    "articleURL": "/tvshowbiz/article-12056249/Stranger-Things-season-five-delayed-Hollywood-Writers-strike.html",
    "content": [
        "The creators of Stranger Things have confirmed production on season five has been delayed by the Hollywood Writers' strike.",
        "Matt and Ross Duffer, both 39, known as the Duffer Brothers, took to Twitter on Saturday to break the bad news to fans of the Netflix show.They wrote: 'Writing does not stop when filming begins. While we're excited to start production with our amazing cast and crew, it is not possible during this strike.'We hope a fair deal is reached soon so we can all get back to work. Until then -- over and out.'While the fifth and final season of the sci-fi horror was announced last February, a release date has not been set.",
        "Members of the Writers Guild of America went on strike for the first time in 15 years on Tuesday, hitting the picket line in Los Angeles and New York after their current contract expired.The biggest points of contention in the negotiations are an increased wage floor, and more payments and residuals from shows that are shown on streaming platforms.Charles Slocum, assistant executive director at the WGA West explained the situation to Deadline.'In streaming, the companies have not agreed to pay residuals at the same level as broadcast, or the same reward-for-success as they have traditionally paid in broadcast,' he said.'If you write for a streamer, you get two residuals payments — one for domestic streaming and one for foreign streaming. It's a set amount of money. If it's a big hit, you do not get paid more residuals in streaming, whereas in the broadcast model, you do because of its success.'",
        "The writers want protections against mini-rooms, in which two or three writers, working for the base salary, script out a considerable portion of a series before it gets the greenlight.They also want protections against the use of artificial intelligence.But while writers are striking over their pay, it was reported earlier this year that the show's stars are set for a major pay increase.The cast has been divided into tiers, with the top adult stars Winona Ryder and David Harbour set to make a whopping $9.5 million (£7.52m) each for the entire season, according to Puck News.",
        "The younger stars of the series are divided into lower tiers with smaller — though still sizable — salaries for the final season.MailOnline reached out to representatives for Winona, David and Netflix at the time.Winona and David are reportedly making multiple times what they earned for the previous fourth season.The Edward Scissorhands star and the Hellboy actor both received around $350,000 (£276k) per episode in that season, which amounts to around $2.8 million (£2.22m) total.The outlet reported that a second tier of salaries includes actors Finn Wolfhard, Caleb McLaughlin, Gaten Matarazzo and Noah Schnapp.The actors, who represented the original quartet of friends from the first season, will be earning $7 million (£5.54m) each for the fifth season, a significant boost from their $25K (£19.78k)-per-episode fees in the first season.",
        "Sadie Sink, who joined the series in the second season but has become a pivotal part of the main cast will reportedly be receiving the same amount as well.Another group of series regulars playing teens — including Natalia Dyer, Joe Keery, Maya Hawke and Charlie Heaton — will apparently be making over $6 million (£4.75m) for the final season.",
        "A final tier is reserved for the other fixtures on the show not included in the previous tiers.Although their salaries weren't disclosed in the report, they are said to be earning considerably less than the other groups.However, one major star is apparently not included in any of the tiers: Millie Bobby Brown, who plays a telekinetic teen who escapes from a government laboratory before joining forces with the quartet of boys to fight evil forces that have escaped into their (fictional) hometown of Hawkins, Indiana.Millie has an exclusive contract with Netflix, so her compensation has been determined separately.Few details have been released about the final season, though the Duffer Brothers, who created the series and serve as showrunners on Stranger Things, told Indiewire in August that they would not be expanding the cast, as they did in previous seasons.'We’re doing our best to resist [adding new characters] for Season five,' Ross Duffer said. 'We’re trying not to do that so we can focus on the OG characters, I guess.'"
    ]
}