{
    "articleURL": "/wires/aap/article-12040331/Brumbies-star-Nic-White-set-lured-Force.html",
    "content": [
        "The Western Force are hopeful of luring Wallabies halfback Nic White for next season, but Brumbies coach Stephen Larkham won't give up the star veteran without a fight.",
        "The Force are also in talks with former whizkid James O'Connor about heading back west next season to where his journey began.The Perth outfit are deep in negotiations with Brumbies star White and a deal could be agreed soon.Complicating matters is whether the soon-to-be 33-year-old will receive a Rugby Australia top-up after the World Cup.If White is offered a top-up, it would boost the Brumbies' hopes of keeping him.With Gareth Simpson to head back to England at the end of this season and former captain Ian Prior in the twilight of his career, White would add vital class and experience to the Force's halfback stocks, which also boast the speedy Issak Fines-Leleiwasa.But Larkham doesn't believe White's departure is a done deal.\"I'm not 100 per cent sure, I don't think it's true,\" Larkham said of the reports of White signing with the Force.\"From our perspective we know there's an ongoing negotiation with Rugby Australia and Nic White.\"On the back of that negotiation we're tied in with Rugby Australia. So I don't know where that (White signing with the Force) has come from, I certainly haven't had confirmation of that today.\"We're still hopeful. There's 'Slips' (James Slipper) and there's Whitey, both players have been here for a long time.",
        "\"They're both exceptional players, and both players that we've expressed many times now that we want to keep.\"They'll be in a situation where they would get a (RA) top-up, there's no doubt about that from our perspective.\"The Force released a statement on Wednesday saying discussions with White were still progressing, but that nothing had been confirmed.\"White is a player the Western Force would be interested in, bolstering international experience and on-field leadership within the Western Force squad,\" the statement said.In another signing surprise, O'Connor is a chance to return to the Force - 12 years after he last played for the franchise.O'Connor was a fresh-faced teenager when he first appeared for them in 2008 and he became the second-youngest debutant in Wallabies' history at 18 years and 126 days when he made his Test debut later that year.The classy utility left the Force in 2011 to join the Melbourne Rebels and he spent stints in England and France amidst off-field troubles before signing for the Queensland Reds for a second time in 2019.O'Connor's current contract with the Reds runs out at the end of this season and the Force are in talks with the 32-year-old."
    ]
}