{
    "articleURL": "/tvshowbiz/article-12044709/Todd-Fisher-slams-Billie-Lourds-accusation-capitalized-mother-Carrie-Fishers-death.html",
    "content": [
        "Carrie Fisher's brother Todd is hitting back at his niece Billie Lourd's accusation that he profited from the Star Wars' actress's death. ",
        "The director, 65, called the accusation by Billie, 30, 'disturbing and hurtful' in a statement provided to TheWrap on Wednesday. It comes after Lourd confirmed she didn't invite late actress's siblings - Todd, Joely Fisher and Tricia Leigh Fisher - to the Hollywood Walk Of Fame ceremony set to take place on May 4, as she accused them of 'capitalizing on her mother's death.' In his statement Todd disputed the accusation saying, 'We made every attempt to speak with Billie's team regarding the invitation prior to making any public comments.''Billie saying that she was publicly attacked by me is not the case, I simply expressed my hurt and disappointment in not being invited. And to further say that we were NOT invited and \"we know why!\" I had no idea what her reasons were.' ",
        "Fisher died at the age of 60 in 2016 - the next day, her mother, Hollywood star Debbie Reynolds passed away from a stroke.In the statement Fisher expresses that he simply wanted to honor Carrie.'Keeping the focus on Carrie Fisher, let's put our differences aside for the hour long ceremony and move on from there. I was told It was a no go and why would I want to heighten level of emotion for his niece, going further to say if I showed up, she would not.'",
        "He further went on to deny the claim: 'I never capitalized on either Carrie or my mother Debbie's deaths, and in no way meant to hurt Billie… and that is the truth …' 'Clearly, she could have called us and expressed her issues, even if we did not agree. Hearing about the event through a press article and from family friends was disturbing and hurtful, particularly since I was the one who initiated the Walk of Fame nomination for my sister a couple years ago.' 'As she has finally communicated these deep seeded [sic] feelings publicly and wants no relationship with me, my response is that I've finally learned where she stands after 7 years…..''BUT could we not stand together for a moment, set aside our differences, and celebrate Carrie Fisher's legacy in the way she deserves and the way she would have wanted?' Elsewhere in the lengthy statement he also addressed Billie's claim that following her mother's death her siblings did interviews and sold books, and did not consult her. ",
        "'Billie's father was well aware months in advance of my book, which, was a loving and truthful homage to the incredible lives (not deaths) of Carrie and mom and the 60 plus years I spent with them both.He added, 'I was not aware of the permissions needed from Billie, who came along 40 years later' and encouraged her to read the book as it could 'assist in her healing process.'",
        "He also reminded his niece that he possesses the family's archives, including letters and personal communications, which prove how close he was to his sister.'To say that her mother's very complicated relationship with her family is known only by her and those who are actually close to her, purposely negates my 60 plus years as Carrie’s only brother who lived those years by her side.''Before making that inference as if she alone knows something, I ask her to remember that I have all of our family’s archives, letters and personal communications for 70 plus years. If you knew my mother, Debbie, you know she kept everything!' Star Wars actress Fisher - who had previously spoken openly about her battles with addiction and bipolar disorder - died after going into cardiac arrest on a plane with cocaine, morphine and ecstasy in her system. Days before a planned May 4 star ceremony for Fisher, her half-siblings Joely, 55, and Tricia-Leigh, 54, took to Instagram to launch a blistering attack on 30-year-old Lourd for the 'bizarre' decision to bar them from the event - a day after Todd claimed family had 'frozen him out' of their 30-seat guest list. Lourd hit back and claimed the siblings had 'capitalized on her mother's death' in a barbed statement to DailyMail.com, where she also said they had 'hurt her deeply' with their actions in the wake of her loss.",
        "She said: 'I have seen the postings and press release issued by my mother’s brother and sister. I apologize to anyone reading this for feeling the need to defend myself publicly from these family members. But unfortunately, because they publicly attacked me, I have to publicly respond. The truth is I did not invite them to this ceremony. They know why.'",
        "'Days after my mom died, her brother and her sister chose to process their grief publicly and capitalize on my mother’s death, by doing multiple interviews and selling individual books for a lot of money, with my mom and my grandmother’s deaths as the subject.'I found out they had done this through the press. They never consulted me or considered how this would affect our relationship.'The truth of my mom’s very complicated relationship with her family is only known by me and those who were actually close to her. Though I recognize they have every right to do whatever they choose, their actions were very hurtful to me at the most difficult time in my life. I chose to and still choose to deal with her loss in a much different way.''To be clear - there is no feud. We have no relationship. This was a conscious decision on my part to break a cycle with a way of life I want no part of for myself or my children.",
        "'The people who knew and loved my mom at Disney and Lucasfilm have made this star on the Hollywood Walk of Fame to honor her legacy possible. This moment is about Carrie Fisher and all that she accomplished and what she meant to the world. I’m going to focus on that. May the 4th be with you.'The statement comes after Joely and Tricia-Leigh shared a joint post accompanied by several throwback snaps with Fisher, which read: 'In response to all of you asking whether or not we will be part of the celebration….'Strangely we won’t be in attendance to celebrate our sister, whom we adored. For some bizarre, misguided reason our niece has chosen not to include us in this epic moment in our sister’s career.'This is something Carrie would have definitely wanted her siblings to be present for. The fact that her only brother and two sisters were intentionally and deliberately excluded is deeply shocking.'We have all been grieving the loss of our favorite human for some years now…we have given Billie the space to do that in her own way. We have been nothing but loving and open, consistently.'This isn’t about a photo op on Hollywood Blvd…this is about celebrating the permanency of Carrie’s legacy in this industry , taking her place with a star on the iconic walk of fame along side our parents.",
        "'We thank the Hollywood Chamber of Commerce for honoring our sister in this way. May the Fourth Be with you. Joely and Tricia Leigh Fisher.'DailyMail.com has contacted representatives for Billie Lourd for comment.This comes after Todd hit out over being denied access to the ceremony. One day after Carrie's death. her grief-stricken mother, Singin' In The Rain star Debbie Reynolds, died of a stroke after telling Todd: 'I want to be with Carrie.'Now Todd, who was close to both Carrie and Debbie, has told TMZ it was the family who froze him out.'Frankly, it's a distressing situation and I don't deserve to be put in this position,' said Todd, insisting that if Carrie had her way he would be asked to the event.'As the only brother of the Carrie Fisher, being omitted from this special day is truly hurtful,' calling his exclusion 'extremely hurtful and distressing as I was always a big part of everything my sister and mother did historically over their lifetimes.'It comes six years after a bitter feud erupted over the multi-million dollar estates of the Star Wars actress and her mother Debbie.He noted that he and Carrie were in attendance when Debbie got her second star on the Hollywood Walk Of Fame for live performance in 1997.",
        "Debbie received her first star on the Walk Of Fame for motion pictures in 1960, and five years later she got to place her hand- and footprints in front of what was then Grauman's Chinese Theatre with little Carrie and Todd standing by.Todd has now said that he himself kick-started the process to procure Carrie a star on the Hollywood Walk Of Fame, which she will finally get this Thursday.The date is May 4 - known as Star Wars Day because of the pun 'May The Fourth Be With You' - and apparently the final seating arrangement for the ceremony is in the hands of Disney, which controls the sci-fi franchise.Todd claims that when he protested his snub, Disney told him that Carrie's family had already occupied their allotted seats and the final decision was up to them.To hear him tell it, he was also advised not to bring the matter to Carrie's daughter Billieand cause her any further strain.Billie, who has followed her family's footsteps into acting, will be on hand at Thursday's ceremony to accept the honor on her mother's behalf.'It's heartbreaking and shocking to me that I was intentionally omitted from attending this important legacy event for my sister, Carrie,' Todd said.Todd and Carrie were Debbie's children by her first husband Eddie Fisher, a singer who infamously abandoned the family to run off with Elizabeth Taylor.",
        "Carrie was always blisteringly frank about her life, both in semiautobiographical novels like Postcards From The Edge and memoirs like Wishful Drinking.Her celebrated writing included the screenplay for the movie of Postcards From The Edge starring Meryl Streep and Shirley MacLaine, as well as a one-woman show of Wishful Drinking that became an HBO special.Two years after his mother and sister died, Todd himself wrote an intimate memoir called My Girls: A Lifetime With Carrie And Debbie.He confessed that Carrie was 'a little angry at me' during their final conversation, partly because 'there was always different tension between the family of mom, particularly myself, and Carrie, as it related to her drug use at the time.'Todd recalled: 'But when Carrie and I got face-to-face, there was no way to have any of that. It just melted away, because the blood, the relationship between brother and sister, the bond, is so deep.'He wrote that Carrie 'broke down' in front of him the last time she spoke to him and said: 'We have to be OK with each other. It's the foundation.'"
    ]
}