{
    "articleURL": "/tvshowbiz/article-12050135/Mel-Smiths-gambling-spiralled-500-bets-50-000-wagers-Griff-Rhys-Jones-reveals.html",
    "content": [
        "READ MORE: My friend Mel, a moving yet joyously funny tribute by comic co-starMel Smith's multi-million-pound windfall saw his gambling spiral as he swapped £500 bets for enormous £50,000 wagers after selling production company TalkBack for £62million, according to co-founder Griff Rhys Jones.",
        "Suddenly having access to millions, the comedian sought greater thrills with much bigger sums and larger risks.Smith and Jones formed the company in 1981, going on to produce influential British comedy shows including I'm Alan Partridge, Smack The Pony and Da Ali G Show.In 2000 they agreed to sell to the media firm Pearson for £62million, which meant - as well as a turnover of £32million the previous year - Smith, Jones and managing director Peter Fincham each pocketed roughly £20million.Speaking to The Idler magazine about adjusting to life with new-found fortunes, 69-year-old Jones said: 'Mel liked to lay a bet and when he had a lot of money he liked to lay a huge bet.",
        "'I don't know anything about gambling, never liked it.'But if before coming rich he'd been in the habit of putting down £500 on the gee-gees, then the thrill of that would wear off if you've just made £22million quid.'So it might be more of a thrill to lay bets of £50,000.",
        "'But I don't judge him.'Smith, who famously appeared in Not The Nine O'Clock News alongside Jones, died age 60 in 2013 following a heart attack.He had suffered from health problems for some time.During an appearance on Celebrity Mastermind in 2009, Smith had appeared frail and slurred his words.",
        "He was taken to hospital days after the show was recorded and said later: ‘My throat specialist feared I had cancer. I spent three weeks in agony in hospital. It turned out I had a virulent throat infection.’ In 2000, Smith revealed that he had conquered a seven-year addiction to over-the-counter painkillers.He said he downed handfuls of the drug Nurofen Plus ‘like Smarties’ after developing gout which spread from his feet to his wrists, elbows and knees, causing excruciating pain. On one occasion in 1999 he swallowed 50 tablets – more than eight times the recommended daily dose – and had to be admitted to hospital.Tests revealed he had two stomach ulcers which had been ‘dripping’ blood, leaving him anaemic.He said: ‘When my doctor found out how many pills I’d taken he told me, “You might as well of [sic] put a gun to your head”. I am very lucky to be alive.’That realisation finally made him quit the tablets.At the start of his addiction, Smith was also depressed that his career as a director seemed to be stalling, despite his film Bean having taken £100 million at the box office.‘It’s frightening how I became hooked on a prescription drug which is freely sold over the counter at any high street chemist,’ he said.",
        "The withdrawal symptoms caused him to experience a severe depressive episode, but he was supported by his devoted wife Pam.‘It was my dark secret and I got deeply depressed,’ he said.The comedic duo met while filming Not The Nine O’Clock News with stars including Rowan Atkinson. ",
        "Smith had attended Oxford specifically to join OUDS, the prestigious drama society, and developed a reputation during his undergraduate days as a writer and actor - and as a man who could hold his booze. Writing in 2013, Jones said his first view of his future comedy partner was not what he had expected. 'One day in the late Seventies, I went for a drink with a friend at a pub in London. He pointed to a figure sitting in the corner. \"Do you know who that is?\" he asked.'\"The slob in the corner?\" I replied.'\"Yeah, him. That’s Mel Smith.\"’Jones said he had imagined a more suave and mysterious figure, rather than 'a cuddly, roly-poly, happy-go-lucky man' who loved curry house biryanis. ",
        "The pair went on to make Alas Smith and Jones, which lasted for 10 series over 16 years, before forming Talkback together, which launched the careers of some of comedy's biggest names. Smith married Pamela Gay-Rees, a former model, in 1988 and the couple had two children together. ",
        "They had properties in St John's Wood in London and Oxfordshire, as well as a hideaway in Barbados. His long career included directing the popular romantic comedy The Tall Guy and Brain Donors, as well as the first Mr Bean film. He featured in cult-classic The Princess Bride as the Albino.  Smith died from a heart attack at the age of 60 at his home in northwest London on July 19, 2013.  After he died, Jones wrote: 'He had no side or pomposity about him at all. Mel was always ready to take a risk, or bet on the horses, or fight a good fight.'He had the loyalty of a water buffalo, and if you were in his herd he was with you.'He was always anxious to allow everybody their say, and was generous with writers, however bad the sketch. He was companionable with actors, however many times they forgot the words.He never stole lines or ideas. He knew what made him laugh and wrote his jokes accordingly.'Smith was variously described as a larger-than-life personality and the driving force behind the careers of many enormous stars. Rowan Atkinson, who worked with Smith on both Not the Nine O'Clock News and Bean, the first Mr Bean film, said he was 'truly sad' to hear about his death.",
        "In a statement, he said: 'Mel Smith - a lovely man of whom I saw too little in his later years. I loved the sketches that we did together on Not the Nine O'Clock News.'He was the cast member with whom I felt the most natural performing empathy.'He had a wonderfully generous and sympathetic presence both on and off screen.\"He was also an excellent theatre and movie director, doing a wonderful job on the first Mr Bean movie.'If you direct a comedy movie that takes 245 million dollars at the box office you've done something pretty special, and I never thought he was given enough credit for this success.'I feel truly sad at his parting.'Actor and comic Peter Serafinowicz also paid tribute. He wrote: 'Very sad to hear about Mel Smith. He did something very kind for me early in my career even though he hardly knew me. 'Such a funny man.' "
    ]
}