{
    "articleURL": "/wires/pa/article-12044351/Six-green-apprenticeships-marked-coronation-emblem.html",
    "content": [
        "Six green apprenticeships have been chosen to mark the coronation in recognition of their sustainability credentials.",
        "The apprenticeships – which have been selected by industry experts for their contribution to creating a low-carbon economy – will be marked with the official coronation emblem, the Department for Education (DfE) said.It is hoped that the six apprenticeships, which include low carbon heating technician, countryside worker and forest craftsperson, will encourage more people to work in the green industry.",
        "The Government and employers will use the coronation emblem to promote the apprenticeships which have been selected as the “gold standard” for green skills training.The apprenticeships were designed by employers working with the Institute for Apprenticeships and Technical Education (IfATE) who considered the impact of each occupation on the environment and future workforce.They also reflected the King’s commitment to ensuring natural assets endure for future generations, integrating renewable energy sources into our lives, and applying sustainability into every aspect of our economy, the DfE said.Education Secretary Gillian Keegan visited Richmond Park this week and met apprentices who are already working on these six apprenticeships. These gold-standard, sustainable apprenticeships offer people the chance to embark on exciting new careers in industries from forestry to construction, and contribute to creating a more sustainable economy  Education Secretary Gillian Keegan  Ms Keegan said: “As we work towards our net-zero goals, it has never been more important to prioritise green skills and protect our natural environment.",
        "“In recognition of the critical role education and skills play in responding to climate change, these green apprenticeships have been selected in honour of His Majesty The King’s coronation.“These gold-standard, sustainable apprenticeships offer people the chance to embark on exciting new careers in industries from forestry to construction, and contribute to creating a more sustainable economy.”The six apprenticeships were selected from a list of over 200 identified by IfATE’s expert green skills panel. We all have a role to play in tackling climate change. Thanks to vital input from a range of employers we are one step closer to putting the environment at the heart of apprenticeships  Jennifer Coupland, chief executive of IfATE  Jennifer Coupland, chief executive of IfATE, said: “These six apprenticeships represent the gold standard for green skills and will pave the way for hundreds more.“We all have a role to play in tackling climate change. Thanks to vital input from a range of employers we are one step closer to putting the environment at the heart of apprenticeships.“We urge more employers to get involved and hope many students will consider these exciting career opportunities.”"
    ]
}