{
    "articleURL": "/news/article-12045421/Retail-expert-Gary-Mortimer-walks-David-Jones-1000-suit-looking-shop-assistant.html",
    "content": [
        "A retail expert couldn't find staff in David JonesCustomer service has reportedly declined A prominent retail expert has revealed his shock during a visit to one of Australia's  biggest department stores when he was unable to find a staff member to assist him with a $1000 designer suit.",
        "Gary Mortimer, who is a Professor of Marketing and Consumer Behaviour at the QUT Business School, filmed the incident on Wednesday and posted it to his Twitter account. 'Respectfully, I've been wandering around @DavidJonesStore Brisbane CBD for 10 minutes with a $1000 M.J. Bale, just looking for a team member,' he wrote.Footage shows Prof Mortimer wandering through David Jones Brisbane's menswear department carrying an MJ Bale suit and searching for a staff member.",
        "MJ Bale is a luxury Australian menswear label, charging around $1000 for a two-piece suit. He can be seen walking through various sections of the menswear department, which all appear to be void of both customers and retail staff members.Prof Mortimer, who is also a consumer behaviour researcher and industry speaker, said eventually an MJ Bale team member arrived to assist him with his purchase.Twitter users empathised with Prof Mortimer's situation.'It's not just David Jones, nor is it just Brisbane,' one comment read'I had a similar experience recently in Sydney, vowing not to return to one Dept Store.'Another suggested that AI would soon be replacing the need for human retail workers.'Only a matter of time before you'll be able to walk in, get what you want, and an AI model will bill your card,' they said.",
        "'Customer experience can make or break you,' another observed.",
        "The iconic Australian department store has suffered serious losses in recent years and there have been reports of slipping customer service standards by customers.A recent Google review of David Jones' Sydney store read: 'let down by inept customer service. Poor communication'.'The fitting rooms are dirty, dated, filthy carpet, hole the size of a plate in the ceiling and a dirty band-aid on the floor,' another said.While a third reviewer said the Sydney store was 'a shadow of its former self'. In December, Daily Mail Australia revealed that the outgoing owners of David Jones spent a whopping $400million on renovations just two years before selling the struggling business for a quarter of what the revamp cost.Woolworths Holdings Limited (WHL) - which has no relationship to Australia's Woolworths supermarket chain - bought the upmarket store in 2014 for a whopping $2.1billion.But less than eight years after the purchase, the South African-based conglomerate was forced to sell the business to Australian company Anchorage Capital Partners on in December for as little as $100 million.",
        "The decline of the iconic brand became evident through the closure of several stores in recent years, including the failure of its much-anticipated boutique outlet at Barangaroo in Sydney, which opened in 2016.",
        "By the end of 2021, shelves at the Barangaroo store were stripped of products, display cases were empty and windows were covered up.David Jones' Fortitude Valley store in Brisbane closed in January, 2020, just three years after it opened.Then in July, 2020, David Jones announced the sale of the iconic Melbourne menswear, homewares and food building in the Bourke Street Mall.In June, 2022 it shut its only store in Wellington, New Zealand.Woolworths Holdings' profits more than halved between 2015 and 2019, falling from $161million to $37million, forcing the owners to write down the business by more than $1.1billion.David Jones suffered a devastating $33 million loss in 2020.At the time the $400million revamp was taking place, Woolworths Holdings revealed in August 2019 that the company's profit had plummeted 42 per cent, from $64million to $37million in the 52 weeks to June 30.Daily Mail Australia has contacted David Jones for comment.  "
    ]
}