{
    "articleURL": "/news/article-12054235/Ron-DeSantis-says-cowered-Disney-silence-social-issues.html",
    "content": [
        "Gov. DeSantis told Newsmax host John Bachman, 'Disney is not allowed to pervert the system to the detriment of Floridians' The feud between Disney and DeSantis started after company executives  blasted the controversial 'Parental Rights in Education Bill,' aka 'Don't Say Gay' DeSantis said 'this is a win for Floridians'  Florida Governor Ron DeSantis says Disney's recent silence on social issues is evidence of his victory over the entertainment giant after a battle over his so-called Don't Say Gay bill.",
        "DeSantis told Newsmax: 'Since our skirmish last year, Disney has not been involved in any of those issues.' He then gloated on air: 'Disney has not made a peep.'He was referring to his Parental Rights in Education Bill, which banned classroom instruction on gender identity or sexual orientation from kindergarten through third grade.Disney bosses were goaded by staff into opposing the bill, with DeSantis revoking its right to self-govern its giant Orlando Walt Disney World Resort in revenge.The likely 2024 presidential contender continued: 'Disney is not allowed to pervert the system to the detriment of Floridians... this is a win for Floridians.'Why should one corporation govern itself and be exempt from laws,' he said, in part. 'It's like the most egregious type of corporate welfare you can believe... so we said no.'",
        "Last year, DeSantis  revoked Disney's self-governing status. On Friday, he signed a bill that allowed a governing board to void development agreements the company had approved.He said Disney tried to do a contract with themselves before the state board took over but said the contract is not valid. 'The legislature here just passed a statue which I will sign shortly nullifying that agreement because these development agreements under Florida law are subject to revocation, so I think they got too cute,' he said. ",
        "'I think that we will end up winning that fight. Disney should not be governing themselves they should absolutely be held accountable.'Disney was suing the Sunshine State in what they claimed was a 'targeted campaign of government retaliation.' 'First, the big issue with Disney was they exercised a lot of political influence in this town,' DeSantis said.'And they tried to fight us on things like parents' rights and things that are really important to the people of Florida. We beat them on that. We signed a parents' rights bill and we've expanded protections and we've done a lot of stuff to go back and fight woke ideology.'",
        "Walt Disney World single-handedly transformed Orlando and its surroundings after opening in October 1971.The Florida city is now one of America - and the world's - top tourist destinations, with Universal Studios also opening a huge theme park resort nearby. DeSantis' battle with Disney was widely-praised by many conservatives and centrists, who have bemoaned corporations getting involved in social justice issues.But the Florida governor has also faced criticism from both left and right, who say that a true conservative should be in favor of less legislation, rather than more.DeSantis has been touted as a possible 2024 Republican nominee for the presidency.",
        "He has yet to declare - but hasn't denied his rumored plans to do so.The Florida governor was touted as a strong contender and future star of the party - but the sheen has come off his campaign in recent months.Manhattan prosecutors' decision to indict Donald Trump over hush money payments to porn star Stormy Daniels have turbocharged the former president's re-election campaign.Trump, once seen as a fading also-ran, is now hammering DeSantis in the polls.DeSantis has also been criticized for his perceived inability to connect with voters on the campaign trail.At a recent Q and A in Tokyo, DeSantis grew very animated when asked about trailing Trump in the polls, and was dubbed 'bobblehead' over an unfortunate video of his head rocking up and down while his eyes gleamed with apparent irritation. "
    ]
}