{
    "articleURL": "/tvshowbiz/article-12043445/P-K-Subban-SLAMMED-body-shaming-Lizzo-live-air-makes-joke-size-lunch.html",
    "content": [
        "Ex-NHL star P.K. Subban has been slammed online for bodyshaming Lizzo live on-air by making a crass comment about the size of her lunch during an ESPN segment on Tuesday night.",
        "Sportsman Subban, 33, shocked fans as he analyzed Game 1 of the Panthers vs. Maple Leafs Stanley Cup Playoff series - with the furore beginning when his co-host John Buccigross quipped Toronto should 'pack a lunch' after losing 4-2.Subban responded: 'Maybe they need to pack a Lizzo-sized lunch.'Lizzo is known for being a body positive advocate and and a proud plus-size fashion icon - launching an inclusive shapewear line in 2022.Subban's remark saw fans demand he apologize to the singer, with the retired hockey player branded a 'clown' and 'fatphobic.'",
        "One fan wrote: 'Sis Pk Subban really just say “Lizzo sized lunch?” That’s… not acceptable. That’s fatphobic.Another typed: 'PK Subban saying someone needed a Lizzo sized lunch? Seems like a harmful thing to say.'One typed: 'PK Subban randomly dissing Lizzo was NOT on my bingo card for tonight' while another follower penned: 'PK Subban fat-shamed Lizzo. Typical Subban clown move. He's just horrible on ESPN.'Another typed: 'did pk subban just make a fatphobic lizzo joke…..' while another wrote: 'PK Subban is going to have to apologize for making a comment about Lizzo.'DailyMail.com has contacted representatives for ESPN and Lizzo for comment. Last month an internet troll attempted to body-shame Lizzo via Twitter, as a nude picture the singer shared to Instagram in 2021 resurfaced.",
        "The Juice hitmaker shared the post, which is an unedited picture without any clothing, as part of a self-esteem social media campaign.But as it did the rounds across Twitter again, one fan tweeted a picture of herself beside Lizzo's, attempting to shame her by asking 'me or Lizzo?'",
        " Appearing to backfire, many fans rallied to support the singer as they simply responded with her name instead of the troll's.And it seemed that Lizzo herself was keen to cast her vote, simply tweeting her own name at the same time that the drama was unfolding.The picture began to circulate on Twitter again after two years as one user share a snap of an article which said Lizzo was 'changing the beauty standard', writing above: 'Thanks, , but my beauty standards remain unchanged'.This response spurred on many other trolls to also take a dig at the singer, who has proudly spoken about being plus size.",
        "But it was the comparison tweet that appeared to go viral, with the user placing a picture of herself next to the nude shot and asking who the public preferred.In a backfire, many took to the reply section to show their support for Lizzo, with one replying: 'Lizzo any day,' as another added on: 'Any and EVERY day'.",
        "'Lizzo. Gal has talents,' added a third.And in a tweet appearing too well-timed to be a coincidence, the hitmaker herself tweeted 'Lizzo'.Hilariously, this prompted a slew of brands to tweet their own names out - including the official page for Kikkoman USA, who wrote: 'Soy Sauce'."
    ]
}