{
    "articleURL": "/femail/article-12053609/Style-Queen-M-xima-Netherlands-stuns-attends-Coronation-King-Charles-London.html",
    "content": [
        "Queen Máxima of the Netherlands looked stunning as she attended the Coronation of King Charles in LondonCORONATION LIVEBLOG: Click here to follow live updates throughout today Queen Máxima of the Netherlands looked stunning in a white dress as she attended the Coronation of King Charles alongside her husband King Willem-Alexander in London today. ",
        "The European monarch, 51, donned a smart outfit as she arrived in London for the historic first coronation of a British monarch in 70 years at Westminster Abbey where Britain will hail its new King.  King Willem-Alexander is distantly related to King Charles - he was the Queen's fifth cousin once removed thanks to an ancient connection in their family tree.Willem-Alexander is a descendant of Princess Carolina of Orange-Nassau, who was the daughter of William IV, Prince of Orange, and his wife Anne, the eldest daughter of King George II of Great Britain and his consort Caroline of Ansbach.In 2018, the royal couple last visited the UK in 2018 - when Maxima greeted the late Queen with a friendly peck on the cheek.  ",
        "The Queen and the Duke of Edinburgh also paid a state visit to Queen Juliana and Prince Bernhard of the Netherlands in March 1958.The couple were not amongst the foreign royalty who mingled with other VIP guests at the dazzling eve-of-Coronation reception at Buckingham Palace last night.Others who attended included Prince Albert and Princess Charlene of Monaco – striking in Terrence Bray lavender trousers with a one-shouldered top –  along with King Philippe of Belgium and daughter Princess Elisabeth, who wore a £3,609 Giorgio Armani navy dress.",
        "Princess Lalla Meryem of Morocco stopped for photographers at the Grand Entrance, as did Grand Duchess Maria Teresa and Grand Duke Henri of Luxembourg.Glamorous Queen Rania of Jordan - sporting a button-down midi dress from Schiaparelli, costing £8,000 - and her husband King Abdullah were welcomed warmly by King Charles, an old friend.Queen Letizia of Spain cut a typically glamorous figure in green. She opted for a £850 Victoria Beckham frock.Charles will be crowned in a Christian ceremony that dates back for 1,000 years on a day dripping with glorious displays of pageantry. It will also shine a spotlight on Britain’s place on the world stage.And on the streets of London today, including on a packed Mall, there is huge excitement among tens of thousands who have been camped out for days so they can see the extraordinary event unfold. More than 100million will watch on TV around the globe.Approaching two million people - from all corners of the UK, Commonwealth and the world - are flowing into Central London, despite rain being forecast. Trains into the capital were packed this morning, with soldiers taking part in the ceremony seen flowing into mainline stations.Guests of the King started arriving at the Abbey from 7am - four hours before the ceremony. Some 100 heads of state are in London, with representatives from 203 countries due to attend.",
        "The longest-serving heir to the throne in British history will today be crowned at Westminster Abbey in a ceremony that is steeped in the majesty of his illustrious forebears – but also embraces and emphasises the proud diversity of modern-day Britain.",
        "‘There will be all the pomp and ceremony you could dream of, but as little of the “them and us” as possible,’ one senior royal aide said last night.Crowned alongside the King, 74, will be his wife of 18 years – and his love for much, much longer.The once unthinkable has become a reality, and from today the former Camilla Parker Bowles will be known as Queen Camilla as she is anointed and has Queen Mary’s Crown placed upon her head.Yesterday the 75-year-old Queen Consort made only a brief public appearance as she attended a final rehearsal at the Abbey with her husband in the morning. She chose not to attend any of the other public engagements by his side, preferring to ‘pace herself’ and also ensure ‘the day was about her husband’, sources said.‘She loves him unconditionally and always wants him to shine,’ a friend said.Last night the couple retired to enjoy a private dinner at their London home, Clarence House.‘The calm before the storm – perhaps metaphorically as well as literally’, a friend said with a nod to the dismal weather forecast, something the new King and Queen’s celebrations have in common with the late Queen’s Coronation in 1953."
    ]
}