{
    "articleURL": "/tvshowbiz/article-12045081/Vanderpump-Rules-cheater-Tom-Sandoval-caught-spinning-web-lies-grieving-partner-Ariana-Madix.html",
    "content": [
        "Tom Sandoval was caught lying by his grieving girlfriend Ariana Madix as their friends grew increasingly suspicious on Wednesday's episode of Vanderpump Rules.",
        "The 39-year-old reality star was confronted by Ariana, 37, after learning from Lala Kent, 32, that he purposely stayed at a barbecue with Raquel Leviss, 28, after knowing that Ariana was reeling over the death of her beloved grandmother Bonnie. Lala told Ariana that she was with Sandoval at the barbecue when she called to let him know that her grandmother died.Tom told Ariana that he was in the bathroom when his ride Jason left without his knowledge, but Lala said she was there and Tom knew Jason was leaving.Ariana then called Tom over to explain instead of defending him herself during the episode filmed before the so-called 'Scandoval affair' with Raquel became public.",
        "'I found out that my grandma died, like, while you were there. You knew about that, and then Jason said, \"I'm gonna leave,\" And then you said, \"I'm gonna stay'',' Ariana asked Tom.'Well, ...yeah, I kind of figured you wanted to be alone,' Tom said.Ariana noted in a confessional that Tom 'dropped everything' to console her 10 years ago when her father died.'We've been together now for eight and a half years, and somehow, somewhere, it feels like maybe he just doesn't think I'm as important anymore,' she added.Tom insisted that he couldn't get a car as Ariana poked more holes in his story.",
        "'I choose Tom over everyone. Like I ride or die for you. So I look like an idiot being Tom's, like, number one stan when he's not mine,' Ariana said in a confessional.Raquel during the episode titled 'Lady And The Glamp' also shockingly revealed that she slept over at Sandoval's house while Ariana was out of town attending her grandmother's funeral.She admitted that she slept there after going into the jacuzzi with both Sandoval and Tom Schwartz, 40 and stayed over because she was drunk.",
        "The episode opened with Raquel, Sandoval, Schwartz, and Ariana in a car going on a glamping trip for Raquel's 28rh birthday. Scheana Shay, 37, and husband Brock Davies drove in a separate car and they all met up at Cuyama Oaks Ranch, which had a petting zoo and yurts for them to stay in.Back in Los Angeles, Lala met up with James Kennedy, 31, at her new office.'By the way, you know Raquel slept at Sandoval's that night, right?' Lala said.'How do you know about this?' James asked.'Because Katie called me last night,' Lala said.'Katie knows?' James said.'Yes,' Lala said.",
        "Lala then explained in a voiceover that a few days before Katie Maloney, 36, was at Lisa Vanderpump's house Villa Rosa working on sandwiches while Ariana was away attending her grandmother's funeral. ",
        "Ken Todd, 77, then walked in and said, 'I can't believe that Tom Sandoval had Raquel over when Ariana's away, in the jacuzzi as well. And she stayed all night.'Katie was shocked. Lisa Vanderpump, 62, shared that she found out earlier when Raquel arrived late and hungover to a tasting at SUR. Lisa demanded to know why she was late.'I overslept,' Raquel said. 'I stayed up late. I went back to Tom's place and we went in the jacuzzi with Schwartz.''Oh, so you were in with both of them?' Lisa asked. 'Where did you stay last night?''At Sandoval's,' Raquel said. 'Nothing happened, though.''It doesn't matter if anything happened,' Lisa said. 'It's just the fact that you were there.''I know, it's bad,' Raquel said. 'I know. It was just easier to sleep on the couch and stay the night.'",
        "'You all know Lisa, she can sniff bulls*** from a mile away,' Lala said in a voiceover.Lisa called Sandoval who was in the car driving with Schwartz.'I'm calling you because Raquel has just shown up here an hour and half late looking like a bag of s***, and then she says she got so wasted last night and ended up spending the night at your house,' Lisa said.",
        "Sandoval and Schwartz laughed.'We hung out for a little bit and she literally just dipped out,' Sandoval said. 'I don't know, like actually she left early.''Hold on a second so you she didn't stay the night?' Lisa said.'I said she dipped out, which is true,' Sandoval said. 'She dipped out.''What does dipped out mean?' Lisa asked.",
        "Lisa asked him point blank if Raquel spent the night at his house.'Yes,' Sandoval said. 'I have people crash at my house all the time.''She's not people Sandoval, your wife is away and she's a beautiful single girl,' Lisa said.'I'm just over this whole Schwartz and Raquel thing,' Sandoval said.'That's not a thing,' Schwartz said.'No, it's not,' Lisa said. 'Schwartz and Raquel thing is so last week. Now it's a Schwartz, Sandoval and Raquel thing.'James told Lala that Sandoval told him that they were in the jacuzzi but that Raquel dipped out and went to bed.'She literally went into my f***ing room,' Sandoval told James. 'Not my room, my guest room or whatever.'",
        "Lala told James about her Labor Day barbecue party. Scheana, Brock, Sandoval and Raquel were there and it was the day Ariana's grandmother died.'Ariana was calling him furious and he was like ''okay I'll come home right now and he didn't leave for another two hours'',' Lala told Katie and Lisa over dinner. 'He was with Raquel all day long.'",
        "'I think Sandoval has a thing for Raquel,' Lala told James.'Oh my God if Tom is banging Raquel, that is just,' James said.'The last time that Sandoval was talking about a woman the way he talks about Raquel is when he was talking about Ariana to the group while he was with Kristen [Doute],' Lala said.'Something ain't right,' Lala said. 'I think something is going on. I'm just going to call it like I see it.'Back at the clamping, Raquel toasted to everyone.",
        "'I wanted to cheers to being surrounded by good friends and good vibes,' Raquel said. 'This is exactly what I wanted to do for my birthday.''I feel like these are my true core people,' Raquel said in a confessional. 'These are my forever friends. These are the people looking out for me, who believe in me.'Ariana started tearing up thinking of the loss of her grandmother Bonnie on the heels of her dog Charlotte dying.'It's been a really hard year for me losing Charlotte and now losing my grandma,' Ariana said in a confessional. 'I'm not well. I'm really barely hanging on to be honest.''Did anything happen while I was out of town?' Ariana asked at the glamping.Raquel told her about how she was an hour and half late to the food tasting at SUR as Sandoval covered his face.",
        "In a confessional, Sandoval said that after beach day Schwartz, Raquel and him took a car back to his house and jumped into the jacuzzi, had some drinks and listened to music. Raquel told Ariana she went into the jacuzzi.'And then I stayed the night and I slept on the couch,' Raquel said.",
        "Sandoval said he then told her to go sleep in the guest room.'You guys lied and said she didn't stay the night,' Scheana said.'Optics,' Schwartz said.'We just thought maybe it would be better if everyone didn't know those little details,' Sandoval said in a confessional. 'I fully was going to tell Ariana but we should have just told the truth. Stupid.''Something doesn't smell right with this Raquel and Sandoval ''friendship'',' Lala said in a confessional. 'I know better than anybody that when you have a dude who's your best friend, who's there during difficult times and then you add alcohol you end up sitting on their face.'At night during dinner at glamping, Raquel got emotional.'I just appreciate each and every one of your friendships,' Raquel said.'Seeing you get so much more confidence and come into who you are is like showing up at Lala's birthday party doing all this f***ing bada**,' Sandoval said.",
        "Raquel laughed.'I'm f***ing proud of you Raquel,' Sandoval said.Raquel shared that her big dream was to be in pageants but she aged out.'I've always been the good girl but now that I've aged out of pageants I don't have to worry so much about my reputation,' Raquel said in a confessional. 'Honestly, I feel like I'm kind of making up for lost time right now.'Sandoval gave her a gift of vintage Versace sunglasses that he said was from him and Ariana.",
        "'We love you Raquel,' Sandoval said, hugging her.Back in LA, everyone arrived at Kristina Kelly's beauty event.Ariana told Katie that she didn't have an open relationship with Sandoval. Vanderpump Rules will return next Wednesday on Bravo."
    ]
}