{
    "articleURL": "/tvshowbiz/article-12048947/Liberty-Poole-suffers-awkward-wardrobe-malfunction-bikini-relaxing-pool-Ibiza.html",
    "content": [
        "Liberty Poole suffered an awkward wardrobe malfunction with her bikini while relaxing by the pool in Ibiza on Thursday. ",
        "The Love Island star, 23, who featured on series seven of the show in 2021, is on a trip to the Spanish island with fashion brand Shein. The beauty has been enjoying soaking up rays by the pool and going for tasty meals with her co-stars Olivia Hawkins, Demi Jones, Lucinda Strafford and Molly Smith.  But Liberty couldn't stop laughing after she suffered a self-inflicted mishap in her stunning bikini by the pool. She donned a sensational black two-piece which accentuated her gorgeous curves and was embellished with chain detailing. ",
        "But the star revealed that she had tried opening her new swimsuit with a knife after the waiter didn't have a pair of scissors. As a result the tiny number was falling apart and Demi and Olivia had to come to her rescue. 'This is the current situation...' said Liv as Demi tried to cut through the bikini with a knife, while a giggling Liberty posted to her Instagram stories. 'Needs must!' laughed Liberty, who was able to see the funny side of the situation in fits of laughter. She wrote: 'For context I had to get changed straight in my new bikini which was wrapped in paper and instead of paper the waiter brought over a knife.'It's never the simple life with me @demijones1 love you thanks girl.'",
        "She gave an update later on, revealing that the situation had been resolved. She continued: 'Liv sawed the chain off my whole bikini! Living life on the edge.' Liberty famously coupled up with Jake Cornish on Love Island, even making things official - but the pair broke up before they left the villa and have not been seen together since.",
        "It comes after Liberty made a candid confession about editing Instagram pictures last month. She looked nothing short of sensational in a scanty red swimsuit with a deeply plunging neckline and high-rise hips, to show as much skin as possible. Feeling candid, in the caption on the shot, newly-brunette Liberty revealed she was 'tempted' to edit the snap to 'lift her natural boobs and shrink her bloating', but the decided she wanted to show off her normal body and quash beauty standards. Her inspirational words read: 'Curvy and proud !! I was tempted to lift my natural boobs in this picture so they looked “perfect” shrink the bloating but no this is me...'So why would I, this is real and this is a normal body despite what beauty standards say just be you . MY BODY MY STANDARDS'. Liberty looked sensational in her sexy swimsuit, which featured a cleavage-enhancing low cut neckline and just about contained her assets.",
        "Not content with showing her cleavage, she also showed off her bottom and hips with the perilously high-rise hips on the one-piece. She was also using the snap to debut her newly darkened locks, with the bouncy brunette curls enhanced with lightened strands around her face. That weekend, Liberty shared another snap from the impromptu photoshoot, taken during her sun-drenched trip to the United Arab Emirates. She was at the Café del Mar beach bar in Abu Dhabi, in the sexy shots. "
    ]
}