{
    "articleURL": "/tvshowbiz/article-12058913/Olivia-Wilde-goes-dinner-son-Otis.html",
    "content": [
        "Olivia Wilde had a big smile on her face as she spent time with one of her great loves on Sunday. ",
        "The actress and director, 39, took her son Otis, nine out to grab some food from Little Dom's in LA as they enjoyed some quality time together. Olivia is also mother to daughter Daisy, six from a previous relationship with Ted Lasso star Jason Sudeikis. She looked casually cool wearing a white top under a cropped Adidas zip-up top, as well as a hat and Gazelle trainers and Ray-Ban sunglasses. Olivia and Jason. who officially split back in November 2020, have been involved in a bitter child custody battle over their two children.  ",
        "The Hollywood stars have additionally been thrust back in the spotlight amid their former nanny's wrongful termination lawsuit. Jason and Olivia claimed in new legal documents, per TMZ, that their former nanny, Ericka Gernaro, did not file her wrongful termination lawsuit correctly in California as a civil lawsuit. They further claim that the lawsuit should have been filed in the state of New York as a private arbitration. The former couple informed TMZ in a statement published on Thursday that, 'It is unfortunate that this private matter continues to play out in the press.' 'Our focus has been and will continue to be to steadfastly protect our family in the face of harassment of any kind. We are confident that the evidence brought forward will affirm our position to summarily dismiss this case and bring our family peace.' ",
        "Ericka, who had worked for the Hollywood stars from 2018 until 2021, claimed earlier this year in February that she was fired after asking for a three day medical leave due to the stress of the job. However, both Jason and Olivia allege that she was not fired, but that she actually resigned. The former couple says that nanny Ericka Genaro had her salary doubled in 2020 and that she was 'taken care of by the family.'In one instance, they say that they paid for her and her dog to stay in London's Rosewood Hotel, after she left her job. The final bill came for over $22,000 thanks in-part to food and booze room service. They further claim that travel expenses of around $17,000 for Ericka to move from London to the United States was also reimbursed. ",
        "They also allege that Genaro was in breach of her working agreement by going to the media about the couple's intimate problems as well as lying about her criminal record. They are quoted as saying that Genaro has described herself as 'ruthless.'The TMZ report says that Sudeikis and his former fiancée allege that Genaro only began to have issues with her job when she demanded a tax-free pay raise. Genaro has previously told DailyMail.com how the Horrible Bosses star would text her about his concerns as Olivia Wilde started to see Harry Styles more often, before bringing Genaro on a trip to London.",
        "But the former celebrity couple quickly hit back at Genaro's claims, calling them 'false and scurrilous.'They repeated that assertion in a statement to DailyMail.com about Genaro's lawsuit, saying: 'As parents, it is incredibly upsetting to learn that a former nanny of our two young children would choose to make such false and scurrilous accusations about us publicly.' The former nanny's lawsuit also claims that she was put in the middle of Jason and Olivia's split and claimed Wilde 'abruptly left' home and her two children amid the break up. 'Wilde's sudden absence from the home had an adverse consequence on its emotional state, including Sudeikis leaning on the presence of Plaintiff for support,' the suit claims.A source told DailyMail.com that in fact Wilde did not 'suddenly' move out but rather was filming between Los Angeles and Palm Springs while Sudeikis and their children were in London.Olivia and Jason have also been in a child custody battle of their own, with the actress claiming last month in April in documents obtained by The Blast, that the actor is not paying for child support. She claimed that while Sudeikis is assisting with their children's school tuition, all other expenses are being covered by her only. Last month, she also plead poverty in court filings. ",
        "Despite being worth $10 million, Olivia, who was served legal documents last year during the 2022 CinemaCon amid the child custody battle, claimed that the Ted Lasso star is prolonging the court battle to 'litigate her into debt.' "
    ]
}