{
    "articleURL": "/sport/football/article-12042943/SIMON-JORDAN-Glazers-arent-indecent-owners-entitled-fans-way.html",
    "content": [
        "Some United fans have been insistent that Qatari bidders must lead the clubMany simply want the owner who has the biggest chequebook to take overUnited supporters are detached from reality and will achieve little with protestsWhen football decided to eat itself financially it lost the right to have any moral outrage about who gets involved in the game and what their methods and motivations are.",
        "Football allowed itself to become a conduit for all manner of agendas from who made satellite dishes to broadcaster prosperity and every advertiser God put breath into and it was all cheered on by a baying audience of fans shouting ‘more, more, more’ and hang the damn costs.So the behaviour of certain Manchester United fans regarding the imminent takeover beggars belief — they embody the new generation of entitlement.Their hypocrisy and double standards are so steeped in a lack of self-awareness that it borders on the staggering. United fans mocked their noisy neighbours when Middle Eastern money transformed Manchester City’s fortunes and they weaponised that new-found wealth to ridicule the substance of their rivals.They were sneering because they viewed United as an organically built club and now, without a hint of embarrassment, they are desperate for Middle Eastern ownership because it suits them.",
        "Fans generally bemoan football culture being diminished and demolished by money, with players paid far too much and detached from reality. But at the same time, fans scream for the next owner they want — and it’s invariably the one with the biggest chequebook.United fans’ aversion to their current owners, the Glazers, is based around the fact they had the audacity to buy the club in part with other people’s money and carried debt. Oh boo hoo, get over it. Fans are entitled to a view and an ability to express it, of course they are, but if leveraged purchases are so awful, why do the majority of businesses get bought that way?",
        "This assumption that football is somehow different is for the birds. I believe it’s because football starts from an unrealistic position, it’s Never Never Land. There’s a belief that nothing ever really gets paid for, you’re never going to be accountable for anything and there’s always someone to pick up the bills. But I’m afraid when you bring big business into sport you are going to have people who do things differently.United fans want the Glazers gone and only want someone buying the club on their terms. They are detached from reality and will achieve little besides driving themselves insane. They are like Just Stop Oil campaigners demanding everyone shares their view. It’s ridiculous and shouldn’t be encouraged. It’s one thing embracing the fans, another to indulge them.There is so much activism in society these days and it’s moved into football with many fans now viewing themselves as activists. Trying to please them is a fool’s errand — and let’s not forget, like so many areas of life, it’s often those with the minority view that shout the loudest.",
        "We ARE guilty of listening to very noisy minorities and thinking they are representative of an entire community. You go on social media and see hateful bile everywhere but it’s not reflective — only around 30 per cent of the population are on Twitter. There were 500 fans marching on Old Trafford last weekend and it was picked up by the media — but it was only 500!",
        "So what is it exactly United fans think they are entitled to? Are they really of the belief, in a world where clubs are valued in the billions, that they can tell prospective owners how to spend their money? We’re seeing more and more of this sense of entitlement and I don’t agree with it.I wonder if they realise how preposterous it is to be telling Sir Jim Ratcliffe how he’s got to buy their club and if he doesn’t he can do one. Are they really that away with themselves that they think they can dictate to a billionaire how he buys something? It’s one thing putting your views across, it’s another thing being totally and utterly destructive and unrealistic.There is no need for vicious, vitriolic, hate-filled rants against owners. They haven’t stolen your first born for goodness’ sake.I tipped in a comparative fortune to Crystal Palace, was emotionally invested and put my family at risk. I tried to have dialogue with fans so they understood my decisions but ultimately, you can’t please all of the people all of the time. And having been in that position, I don’t believe it gives fans this visceral right to hammer people under the auspice of love for your club.",
        "Despite the servicing of debt, the Glazers have still spent vast amounts of money on the club. Yes, they could have done certain things better and no, they are probably not ideal.But what is ideal? A Russian oligarch sanctioned by the Government having proceeded to set football’s finances on fire? Or would you prefer what City had with the disgraced Thai leader Thaksin Shinawatra who was neck deep in corruption? Or a regime that allows journalists to be cut up with bone saws?",
        "United fans will argue all they want is decent owners. Well, I’d argue the Glazers aren’t an indecent set of owners, they just had the audacity to buy a commercial business with commercial business ideals, serviced the debt and then, shock horror, took some dividends, because of course only players, managers and agents can get money from football.It feels like I’m batting for the owners but I’m batting for logic. You’re always going to be criticised and you accept that when things aren’t going well, but it has to be credible criticism rather than total contempt.These days owners are more than just custodians for the next generation. They are the literal owners economically which means, in good and bad times like Covid, they will have to provide money to fund clubs and not just give it a miss when results aren’t great. So they get to decide, within reason, what goes.",
        "Fans wanted a globalised sport — the best players, the most money. So they can’t then scream and expect people to spend enormous amounts on clubs and not be prepared to take the rough with the smooth because the fact is, there’s no perfect owner.More money for old rope for Big Sam Football really is the gift that keeps on giving for Sam Allardyce. Fireman Sam will ride off into the sunset in a Brink’s-Mat van with £500,000 for nothing or £3million for saving the day for Leeds.The fact they are prepared to pay him so much for four games can be seen two ways — money well spent or another example of how ludicrous and ineffective football can be, given his reward for keeping them up equates to three per cent of Leeds’ income from domestic broadcasting rights.A word of warning though — Sam’s last voyage at West Brom ended in relegation.",
        "Football should acknowledge the coronation - if it wants toI’m not a staunch monarchist but I value the monarchy and believe its uniqueness adds to our country. I’m not sure how comfortable I’d feel if clubs were issued with a diktat to sing the national anthem before this weekend’s games though.I know there are different views about what the monarchy represents to different parts of our society and I believe people should be able to make their own choices.",
        "There are certain things in society you should value and one of them is decency, so with the coronation being a once in a lifetime event, I would hope our football clubs want to do it.Football is our national sport and should be involved in some shape or form, if it chooses to.Lampard has diminished his own reputationFrank Lampard's appointment at Chelsea has been an exercise in nothingness. The decision to sack Graham Potter to appease some fans has backfired. Lampard probably wasn’t going to be getting another Premier League job any time soon anyway, but this move has possibly only further diminished his reputation as a manager.Ultimately, the mess that Chelsea find themselves in will be put down to a profligate new owner having his moment, but what a waste of everybody’s time it’s been, including Frank’s."
    ]
}