{
    "articleURL": "/news/article-12042509/Dianne-Feinstein-89-Senate-week.html",
    "content": [
        "AOC calls again for 89-year-old Dianne Feinstein to quit the Senate 'I think criticisms of that stance as 'anti-feminist' are a farce,' she wroteThe senator has been absent for nearly two months since she was hospitalized in early March As calls for resignation pile up for Sen. Dianne Feinstein, the 89-year-old California Democrat is 'hopeful' she can return to the Senate next week, according to Chuck Schumer's notes. ",
        "Senate Majority Leader Schumer held a news conference on Tuesday where he did not address Feinstein's absence, but a shot of Schumer's notes showed he had an update from the senator. 'I spoke with Sen. Feinstein yesterday. We are both hopeful she can return next week,' the document read. A Schumer spokesperson said: 'It was in his notes, and he would have said if someone asked.' The senator has been absent for nearly two months since she was hospitalized in early March. Her absence on the powerful Senate Judiciary Committee has held up President Biden's judicial nominations as Republicans refuse to give the nominees a majority vote to get confirmed.",
        "Feinstein's office would not confirm a timeline for her return. 'Senator Feinstein continues to make progress in her recovery, however, we don't have a timeline yet for her return to Washington which is dependent on her medical team saying it is safe to travel,' the spokesperson said. On Tuesday the Senate Judiciary Committee held a high-profile hearing where Democrats eviscerated the Supreme Court's lax ethics rules and some Republicans agreed the high court needed to do more to offer transparency and confidence on conflicts of interest and free perks.Chair Dick Durbin had urged Chief Justice John Roberts to testify or appoint another member of the court to do so. But without Feinstein he could not subpoena the justice, who refused to comply. ",
        "Meanwhile New York progressive Rep. Alexandria Ocasio-Cortez said Monday that it was time for 89-year-old Democratic Senator Dianne Feinstein to retire, amid a lengthy absence from Congress due to ill health which has disrupted Democrats' efforts to confirm liberal judges.AOC is the latest member of Feinstein's own party to call for her to go, and she shrugged off complaints that such messages were sexist.'I think criticisms of that stance as 'anti-feminist' are a farce,' she wrote on the new social media platform Bluesky.Democrats including former House speaker Nancy Pelosi and New York Senator Kirsten Gillibrand have dismissed such calls as sexist because they say men of the same age would not face the same demands. But there is no getting away from it - Republicans have refused to help Democrats replace Feinstein on the Judiciary Committee while she is away. ",
        "'Her refusal to either retire or show up is causing great harm to the judiciary - precisely where repro rights are getting stripped,' wrote AOC, as she made the case that Feinstein was hurting women's rights. 'That failure means now in this precious window Dems can only pass GOP- approved nominees.'It follows similar comments she made in April, after weeks of speculation about Feinstein's frailty.'I think what we're seeing is really concerning, and I think whenever a member's health and ability to serve us brought into the spotlight, it's very unfortunate, it's very sad,' she told CNN.",
        "'But I do think that what is happening right now, and the impact that the continued ability to serve is having on our ability to fill the courts, the impact that this is having on people's access to abortion care, I think this is something that is — it is unfortunately something that I think it is appropriate to consider.'It follows a ruling in Texas that threatened access to mifepristone, a common abortion pill, handed down by a conservative judge appointed under Donald Trump.Even before shingles, the Senate's oldest member was prone to concerning bouts of forgetfulness - with staff having to remind her about where she stood on bills and once forgetting that she had already announced her retirement in 2024. California Reps. Katie Porter, Adam Schiff and Barbara Lee are already locked in a race for her seat. ",
        "In the meantime, allies in her own party have helped fend off calls that she should go.'Senator Feinstein has been a champion for California for 20 years,' former House Speaker and fellow octogenarian Pelosi told CBS News. 'She deserves that respect to get well and be back on duty.'Men would not face the same calls, she added. 'It's interesting to me. I don't know what political agendas are at work that are going after Senator Feinstein in that way. I've never seen them go after a man who was sick in the Senate in that way,' she added.",
        "But her absence comes at a critical time with Democrats' holding the slimmest of Senate majorities. The Senate is due to hold a hearing Thursday on raising the debt ceiling, after the House passed a Republican bill last month that would increase the borrowing limit but only if it came with big spending cuts.Any bill needs 60 votes to get through the Senate, and Feinstein's absence reduces Democrats' leverage by one vote. "
    ]
}