{
    "articleURL": "/news/article-12048753/Its-no-tall-tale-Giraffes-make-decisions-based-mathematical-statistics.html",
    "content": [
        "Making predictions based on statistics is a highly developed reasoning skillPreviously it has been seen only in large-brained animals such as primates They’re already head and shoulders above the other zoo animals.",
        "But it’s not just their height that’s helping giraffes stand out, according to a study.They also appear to be able to make predictions based on statistics. Four giraffes at Barcelona Zoo were able to calculate the odds of getting their favoured treat.Predicting based on statistics is a highly developed reasoning skill and has been seen only in large-brained animals such as primates.For the study, two male and two female giraffes were shown two clear boxes filled with vegetable sticks. Each had a mix of carrot and courgette sticks, with carrots being the preferred option.",
        "Researchers drew a stick from each box using closed fists, and let them choose between the options.A barrier was then put in both boxes so the giraffes could consider only the upper part of the container when deciding. In 17 of 20 experiments, they picked the container more likely to give carrot sticks.Alvaro Caicoya, from Barcelona University and an author of the study published in Scientific Reports, said the results suggest ‘large relative brain sizes are not a necessary prerequisite for statistical skills’.For the study researchers presented four giraffes - two male and two female - with two transparent containers filled with vegetable sticks.Each box had a different mix of carrot and courgette sticks, with carrots being the preferred option.",
        "Initially, a researcher covertly drew a stick from each container using closed fists, and let the giraffe choose between the two options.The researchers then upped the ante by inserting a physical barrier in both containers, so the giraffes could only take into account the upper part of the container when making their decision.In 17 out of 20 experiments, the giraffes were able to select the container that was more likely to produce their favoured carrot sticks.",
        "This was based on the relative frequencies of food in the containers, and not on other information such as their sense of smell, the researchers said.The team said the findings, published in the journal Scientific Reports, suggest that despite having a relatively small brain size for a mammal, giraffes may have more sophisticated statistical abilities than previously thought.Mr Caicoya added: ‘The results of the study suggest that large relative brain sizes are not a necessary prerequisite for the evolution of complex statistical skills.‘Statistical abilities might provide crucial fitness benefits to individuals when making inferences in a situation of uncertainty, and it should not be surprising if these abilities are widespread.‘For example, the savannah environment in which giraffes live is characterised by widely spaced trees.‘Therefore, being able to identify from a distance which trees have the best proportions of leaves and flowers that the giraffes want to consume likely provides an evolutionary advantage.",
        "‘This ability allows giraffes to conserve energy by avoiding unnecessary travel to less desirable food sources, and instead focus their efforts on reaching the trees that provide the most beneficial nutrients.’"
    ]
}