{
    "articleURL": "/wires/reuters/article-12045649/Virgin-Money-shares-slide-lower-half-year-profit.html",
    "content": [
        "By Sinchita Mitra and Eva Mathews",
        "May 4 (Reuters) - British lender Virgin Money on Thursday reported a fall in its half-year profit on higher investment costs and increased provisions for potential bad loans, sending its shares down as much as 11%.Lenders are under pressure to prepare for potential loan defaults amid an economic crunch in Britain, with recent U.S. banking turmoil further denting investor sentiment.London-listed Virgin Money reported pretax profit of 236 million pounds ($296.56 million) for the six months to March 2023, down 25% from a year earlier.\"Pleasingly for now, the number of customers in financial distress remains low, but we continue to expect arrears numbers to increase as the credit cycle normalises,\" CEO David Duffy said in a statement.Total loans and advances stood at 71.95 billion pounds at the end of March, compared to 71.82 billion pounds on Sept. 30.\"Virgin Money is in the middle of the pack when it comes to interest rate sensitivity and excess capital, and we are not quite sure if this bank is branch or digital led,\" RBC Capital analyst Benjamin Toms said in a note.\"It feels like a lot of investment is still required to compete with large UK peers.\"Shares in the company recovered some of their early losses and were down 7% at 142.6 pence at 0744 GMT on Thursday. The stock is down about a fifth over the year to date.",
        "The British bank, however, increased its outlook for its 2023 net interest margin (NIM) - a key measure of a lender's underlying profitability - to about 190 basis points, compared with the previous estimate of about 185 to 190 basis points.Some of that benefit comes from the Bank of England's successive interest rate hikes designed to curb rampant inflation, with lenders profiting on the gap between what they charge on lending and pay out on deposits. ($1 = 0.7958 pounds) (Reporting by Sinchita Mitra and Eva Mathews in Bengaluru; editing by Uttaresh Venkateshwaran, Iain Withers and Sharon Singleton)"
    ]
}