{
    "articleURL": "/tvshowbiz/article-12044577/Shock-Sunrise-shake-Sam-Mac-replaced-weather-presenter-Jimmy-Rees.html",
    "content": [
        "Jimmy Rees is set to takeover Sam Mac's role as Sunrise weather presenter next week. ",
        "The comedian, 35, will takeover the coveted gig for one week only, as he covers for the new father who is taking a week of leave. Jimmy announced the news live on Sunrise on Thursday, joking that he's 'finally made it' and that it's 'breaking news'. 'I think I finally made it. Breaking news, I'm becoming the sunrise weather guy all next week. I have no idea what you have planned for me,' he told Sunrise host Natalie Barr. Jimmy said he's going to be visiting a few places in Victoria from where he will be doing some live crosses.",
        "'No, I'm going to a primary school, thermal springs and yet to be discussed other things that hopefully I can actually do,' he said. Host Natalie Barr revealed he will be doing a defensive driver training course at some point next week, ahead of reading the weather. 'How hard can it be? I got something I wanna say, I think the weather holds him back,' he joked about Sam Mac. ",
        "'I'll tell people just to look it up on their phone so I can keep going with the defensive driving course,' he joked.Jimmy, also known as Jimmy Giggle, is a former kids TV host turned TikTok star who got millions of views on the social media platform in lockdown by sharing hilarious videos on Australia's Covid-19 border closures.",
        "He has taken the popular video platform by storm after a 10-year stint on beloved ABC Kids program Giggle and Hoot. He also competed in the 16th season of Dancing with the Stars in 2019, starred in several stage productions, and appeared on multiple Australian TV programs.Sam meanwhile, who recently underwent an incredible eight-week body transformation, has been a weather presenter on Sunrise since 2016."
    ]
}