{
    "articleURL": "/sport/football/article-12053961/On-day-coronation-fans-asking-King-Charles-III-supports.html",
    "content": [
        "The Royal Family have a long history with supporting the beautiful gamePrince William is an avid Aston Villa fan, supporting the club since childhoodBut His Royal Highness does not share in his son's support of the VillainsOn the day of his coronation, questions have been raised as to which football team King Charles III supports.",
        "The Royal Family have a long history with the beautiful game, with the Queen rumoured to have been a West Ham, stemming for her admiration of former Hammers and England boss Ron Greenwood.Prince William has been an avid supporter of Aston Villa since childhood, and recently attended the club's training ground to meet with Unai Emery and the first-team squad.The royal love affair with the sport stems back even further though, with King George V beginning the tradition of a member of the family attending the FA Cup final when he saw Burnley defeat Liverpool to lift the famous trophy in 1914, during the last final to be staged at Crystal Palace.That result marked the only time the Clarets have lifted the trophy in their history, but the association between Vincent Kompany's side and royalty does not end there.",
        "George V's great-grandson the former Prince of Wales revealed that a charity trip to area led to him supporting the Lancashire club.'A consortium of my charities, including the British Asian Trust, has been working in Burnley.' Charles told an audience for the Trust in 2012.'Hence, some of you asked this evening whether I support a British football club and I said \"yes – Burnley\". And people have responded \"Burnley?\"",
        "'Oh yes, because Burnley has been through some very challenging times and I'm trying to find ways of helping to regenerate and raise aspirations and self-esteem in that part of the world.'My charities have been working there together to demonstrate that an integrated approach can produce the best dividends.'The 74-year-old has since visited Turf Moor and was even presented with his own replica shirt, with 'HRH 1' printed on the back.Burnley shared a tweet congratulating Charles for the coronation, with the Championship winners also announcing that they will mark the occasion by singing the national anthem prior to their final game of the season against Cardiff on Monday."
    ]
}