{
    "articleURL": "/wires/reuters/article-12060375/Phillies-Kyle-Schwarber-heating-Blue-Jays-pay-visit.html",
    "content": [
        "No player was scuffling more on the Philadelphia Phillies than Kyle Schwarber.",
        "Mired in a maddening 0-for-21 slump, Schwarber broke out in a big way with two hits and three RBIs in a 6-1 victory over the Boston Red Sox on Sunday.It snapped a six-game losing skid, which the Phillies hope will push them to a winning streak when they host the Toronto Blue Jays on Tuesday.Schwarber started slow last season but managed to blast a National League-leading 46 home runs, helping to fuel a postseason run to the World Series. The Phillies fell in six games to the Houston Astros.Schwarber, who's hitting just .188 with eight home runs, was dropped from leadoff to the No. 5 spot by manager Rob Thomson.\"I hate it. I wish that I didn't (start slow). But it is what it is,\" Schwarber said. \"I can promise you guys that, whenever I do step out there, I'm taking my best step forward -- and so is everyone else in this clubhouse whenever we step on that field.\"The Phillies have been besieged with injuries, though Bryce Harper's miraculous early return from Tommy John surgery has been a boost.If Schwarber can continue to produce and the pitching staff can elevate its consistency, the Phillies will be right back in the mix.\"You go into an off day with a win and break a losing streak,\" Thomson said. \"It feels really good.\"",
        "Philadelphia will hand the ball to Aaron Nola (2-2, 4.64 ERA) on Tuesday.In Nola's last start against the Los Angeles Dodgers, he allowed seven hits and four runs in 6 1/3 innings. Nola is 0-2 with a 5.48 ERA in four career starts against the Blue Jays.After a five-game losing streak, the Blue Jays responded with a key three-game series sweep over the Pittsburgh Pirates.The Blue Jays outscored the Pirates 22-3, capped by a 10-1 victory on Sunday.\"It's a credit to the guys,\" Toronto manager John Schneider said. \"There's no panic. It is what it is in Boston (four-game sweep), then you move on and try to win the next series. It's always tough to take all three, but we finally got back to what we're used to doing.\"Whit Merrifield, Daulton Varsho and Kevin Kiermaier each homered in the nine-run win.Through the first 35 games, Merrifield is hitting .291 with seven stolen bases.Brandon Belt entered the series with a subpar .161 average, but he went 6-for-9 with three doubles and three walks in the three games.\"That's what this lineup is capable of,\" Schneider said. \"You're seeing Brandon come around. (Danny) Jansen is having great at-bats and Whit is having great at-bats. Kiermaier today had a couple of knocks. It lengthens it out and you don't have to be so reliant on the top of the order.\"",
        "Alek Manoah (1-2, 4.71 ERA) is scheduled to start for the Blue Jays.In Manoah's last start against the Boston Red Sox, he gave up eight hits and five runs, two earned, in five innings.\"I thought he was getting on a roll a little bit,\" Schneider said after Manoah's last start. \"It was kind of typical Alek. He was making good pitches, but we didn't help him defensively. You can't have four errors, throw the ball around and expect to win. I thought he was good.\"Manoah has never faced the Phillies.Vladimir Guerrero Jr. has missed the last two games because of left wrist soreness. It's unclear if he'll be in the lineup Tuesday.--Field Level Media"
    ]
}