{
    "articleURL": "/news/article-12059833/Whos-official-Coronation-portrait-Working-royal-family-stood-alongside-King-Queen.html",
    "content": [
        "King Charles and Queen Camilla posed with working members of the Royal Family at Buckingham Palace The King is in full regalia, wearing the Imperial State Crown along with regal purple tunic and Robe of Estate Traditional portraits released to mark the King's Coronation have shown a glimpse into Charles' vision of a slimmed-down monarchy.",
        "King Charles and Queen Camilla posed with working members of the Royal Family at Buckingham Palace to mark the historic occasion this weekend.The King is pictured in full regalia, wearing the Imperial State Crown along with his regal purple tunic and Robe of Estate. He is stood alongside Camilla, who is wearing Queen Mary's Crown, with the train of her lengthy embroidered Robe of Estate spread in front of her.To their immediate left are the Prince and Princess of Wales, who wore her Alexandra McQueen dress and leaf embroidery headpiece by Jess Collett x Alexander McQueen. On the other side of Charles was his sister the Princess Royal in military dress. The Duke and Duchess of Edinburgh are also pictured either side of Princess Alexandra - the late Queen Elizabeth's cousin. The Duke of Kent and the Gloucesters are also included in the image by Hugo Burnand.",
        "A royal expert told MailOnline that Anne, the Princess Royal, being positioned next to her brother King Charles is 'most significant' and 'shows much he appreciates her and will be relying on her'.Richard Fitzwilliams said Princess Anne's proximity to the King 'is no accident', adding that the fact she is 'experienced and hard-working' will have been noticed by Charles. He said: 'Princess Anne's proximity to the sovereign, that's no accident. She's experienced and hard-working.",
        "'Anne's been at it a long long time, she knows the ropes. The King knows how popular she is, so it's no accident his sister is next door to him.'It shows much how much he appreciates her and how much he will be relying on her, she is extremely popular and has a high profile. People know who she is and respect her, that's very important.'Mr Fitzwilliams said the portrait of the working royals signified 'the people who the King can depend on', adding: 'The absentees, everyone knows the reasons for that'. Noting that the group portrait included only four people under the age of 70, Mr Fitzwilliams said that this will be a 'challenge' for the King in the future, who will need to decide 'how slimmed down he wants the monarchy to be'.Of the King's solo portrait, he said: 'This one is a strong forceful portrait of a monarch who knows his own mind and is very experienced'. Queen Camilla looked 'more relaxed and comfortable' wearing the crown in her solo portrait than she did in Westminster Abbey, he added.Former Tatler photographer Mr Burnand - a favourite of Charles and Camilla's - took the couple's official wedding photos in 2005, and for William and Kate's nuptials in 2011. ",
        "Prince William, Charles' eldest son, is the first in line to the throne, followed by his three children George, Charlotte and Louis.Prince Edward, Charles' youngest brother, is 13th in line to the throne, while his elder sister Princess Anne is 16th.Prince Richard, Duke of Gloucester, was the first cousin of Queen Elizabeth and the first cousin once removed of Charles. He is 30th in the line of succession.Prince Edward, Duke of Kent, was the first cousin of Prince Philip and is also the first cousin once removed of King Charles. He is 40th in line to the throne and is  An individual portrait of the King has also been released, showing Charles holding the Orb and Sceptre with Cross, seated on a Throne Chair in the Throne Room at Buckingham Palace.Camilla was pictured alongside the King, and also in a solo portrait.It comes as the royal couple have pledged to rededicate their lives to service as Charles called the nation's support throughout the historic celebrations 'the greatest possible coronation gift'.In a message released at the end of the weekend's celebrations, the King said: 'As the coronation weekend draws to a close, my wife and I just wanted to share our most sincere and heartfelt thanks to all those who have helped to make this such a special occasion. ",
        "'We pay particular tribute to the countless people who have given their time and dedication to ensuring that the celebrations in London, Windsor and further afield were as happy, safe and enjoyable as possible. ",
        "'To those who joined in the celebrations - whether at home, at street parties and lunches, or by volunteering in communities - we thank you, each and every one. 'To know that we have your support and encouragement, and to witness your kindness expressed in so many different ways, has been the greatest possible coronation gift, as we now rededicate our lives to serving the people of the United Kingdom, the realms and Commonwealth.'The Duke and Duchess of Sussex, along with Prince Andrew, were nowhere to be seen.Harry and Meghan stepped down as senior royals in March 2020, and have since given tell-all interviews about their treatment. Harry attended the Coronation on Saturday, but flew back to California shortly after the ceremony.Prince Harry also released his bombshell memoir Spare, revealing intimate details of the Royal Family's private life, following the Queen's death.The Duke of York, who played no formal role in the Coronation but attended in his Order of the Garter robes, sat in the same row as Harry during the ceremony at Westminster Abbey on Saturday.",
        "Andrew stepped down from public life after his Newsnight interview in November 2019 and the furore over his friendship with paedophile financier Jeffrey Epstein.The King is known to be in favour of a smaller, cheaper monarchy and is understood to be likely to keep the number of working royals at 11.But his sister last week said the idea of a smaller Royal Family 'doesn't sound like a good idea from where I'm standing'.It comes as Coronation celebrations continued for a third day today, with royals taking part in Big Help Out events.Meanwhile, Prince Louis turned into a labourer as he joined Prince George, Princess Charlotte and the Prince and Princess of Wales by shovelling dirt, pushing wheelbarrows and operating a digger at a Scout Hut in Slough. ",
        "The young prince missed the Coronation Concert last night because it was past his bedtime, but took part his first ever official royal engagement today.When the Prince of Wales took control of a digger, Louis jumped into his father's lap as William moved the mechanical arm and grabbed a bucket full of soil before dumping it on a heap. He looked fascinated as William worked the controls of the excavator.And it didn't end there, Kate was seen pushing a wheelbarrow while her youngest son shoveled in sand. He then took control, steering it expertly as his mum supported its weight. Louis also did some painting for a mural. ",
        "Although Louis has been at numerous big royal events from Trooping the Colour to the coronation, it is thought to be the first time he has actively participated in an official visit face to face with the public. While the King and Queen had quiet day away from the public eye after Sunday evening's Coronation Concert, other royals joined in the Big Help Out. The Duke and Duchess of Edinburgh helped at a puppy class for trainee Guide Dogs in Reading, while the Princess Royal attend a County Civic Service recognising local volunteers in Gloucester Cathedral. Edward confessed the royal family was concerned Miss Piggy would gate-crash the royal box during the Windsor Castle musical extravaganza, after Kermit the Frog turned up and danced in front of the duke's seat. 'Everybody in the Royal Box was nervous when Miss Piggy would turn up,' he said. 'There was an empty seat just behind me and we didn't know who it was for. 'We suddenly thought it could be her and once we started that rumour, everyone around us was very nervous.' Edward and Sophie were seen to be sweetly offering support to the late Queen's cousin Princess Alexandra, who was smiling broadly, with both assisting her by holding her arms. "
    ]
}