{
    "articleURL": "/wires/aap/article-12038595/Pandemic-effect-felt-NSW-public-health-system.html",
    "content": [
        "Three thousand people needing cataract extractions or a whole new knee are among those overdue for planned surgery in NSW.",
        "New analysis released on Wednesday shows a 15-fold explosion in the number of people overdue for elective surgery in the state, primarily because of widespread surgery suspensions during the COVID-19 pandemic.The overdue list included 1144 people in December 2019, but three years later it had 17,000 names.Mostly, those waiting longer than recommended were set for non-urgent surgeries including 1787 cataract extractions, 1346 total knee replacements and 813 removals of tonsils.The figures were contained in a wider report into the pandemic's effects on key parts of the NSW public health system.The Bureau of Health Information's Healthcare in Focus report showed the health system was already at or near-record levels of activity in 2019.\"Despite significant fluctuations in activity during the pandemic, it has continued to get busier,\" bureau chief executive Dianne Watson said.A long-term upward demand for ambulance services accelerated during the pandemic, taking callouts to record levels in the last quarter of 2022 (157 responses an hour) and increasing waiting times.The average length of stay for acute care increased sharply during the Delta wave (June - October 2021) and remained longer throughout 2022.The average acute admitted patient now spends 4.9 days in a NSW hospital, up from 4.4 in 2019.Yet, the new highs didn't sully the average patient's experience.",
        "Ratings of care provided by paramedics remained particularly high while the percentage of admitted patients who rated their care in a NSW hospital as \"very good\" was broadly similar to that throughout 2019.In the days after the March state election, Health Minister Ryan Park ordered NSW Health to get a panel of clinicians to audit and implement improvements to surgery across the state by July.Recommendations would be made on efficiency programs, better collaboration with the private sector and suggestions about how to reduce the waiting list, now hovering around 100,000 people.The task force was one of Labor's final election promises.Mr Park also called for a terminology change, ditching elective surgery for planned surgery.\"(Elective) sounds like people had a choice - this is surgery people are living in pain waiting for,\" he said in March."
    ]
}