{
    "articleURL": "/wires/reuters/article-12058713/China-seeks-new-fields-cooperation-Pakistan-military.html",
    "content": [
        "BEIJING, May 8 (Reuters) - China's defence minister on Monday told Pakistan's navy chief that their militaries including their navies should \"expand into new fields of cooperation\" to bolster the capability of the two neighbours in safeguarding security in the region.",
        "Ties between the two militaries stretch back years, with their navies and air forces holding bilateral exercises in each other's territory.For China, Pakistan and its access to the Arabian Sea is key in the event of a maritime blockade in the Strait of Malacca.But Chinese interest in the region has stirred concern, especially in neighbouring India after China opened its first overseas military base in Djibouti on the northwestern fringe of the Indian Ocean in 2017.China's Defence Minister Li Shangfu told Pakistan's Chief of Naval Staff Amjad Khan Niazi, who was visiting Beijing, that the two countries' military relationship was a key part of bilateral ties.\"The two militaries should expand into new areas of exchanges, create new high points of cooperation to continuously enhance their ability to deal with all sorts of risks and challenges, and jointly maintain the security interests of the two countries and of the region,\" said Li, according to a statement on China's Ministry of National Defense website.Niazi's visit comes after Zhang Youxia, vice chairman of China's Central Military Commission, said in late April that the Chinese military was willing to deepen and expand cooperation with Pakistan's military.So far, China has not disclosed if it had sought military access to Pakistan's Chinese-funded, deepwater port of Gwadar.",
        "The Pentagon previously identified Pakistan as a possible location for a future Chinese military base, with Gwadar seen as the likely location. Any sign of that happening would fuel New Delhi's worries of growing Chinese military alliances and assets in its own backyard.In 2022, New Delhi expressed concern over a Chinese survey ship's visit to a strategic port in Sri Lanka. In 2014, Sri Lanka angered India when a Chinese submarine and a warship were allowed to dock in Colombo. (Reporting by Albee Zhang and Ryan Woo; Editing by Michael Perry)"
    ]
}