{
    "articleURL": "/wires/reuters/article-12048091/Celtics-look-wrest-homecourt-advantage-76ers.html",
    "content": [
        "The Philadelphia 76ers overcame the absence of Joel Embiid to win the opener of their Eastern Conference semifinal series before failing to show up in his return for Game 2.",
        "The third-seeded 76ers bid for a better all-around effort with the newly minted NBA MVP in tow for Game 3 on Friday when they host the second-seeded Boston Celtics.Sporting a brace over his sprained right knee, Embiid battled rust before finishing with 15 points and five blocks in 27 minutes during the 76ers' 121-87 setback on Wednesday.Embiid was playing in his first contest since sustaining the injury in Game 3 of the first-round series versus the Brooklyn Nets. He sat out the clinching contest of the series sweep as well as Game 1 of this set, a 119-115 victory for the 76ers on Monday.\"I felt pretty good to play and I felt like I could help the team,\" said Embiid, who averaged a league-best 33.1 points in the regular season.\"I feel like I just got this out the way. Disappointed by the loss. But that's a step toward getting back to myself.\"The 76ers didn't look like themselves in terms of their 3-point shooting on Wednesday. After making 17 shots from beyond the arc in the series opener, they converted just 1 of 13 attempts in the first half of Game 2 and finished 6 of 30 for the contest.James Harden made just 2 of 14 shots from the floor and misfired on all six attempts from 3-point range to finish with 12 points. By comparison, Harden sank 7 of 14 attempts from beyond the arc to highlight his 45-point outburst in the series opener.",
        "\"Our spacing wasn't right and this is a make-or-miss league,\" Harden said, per the Philadelphia Inquirer. .\".. For us, we've just got to do a better job of knowing where we are on the floor and just allowing each other to have space and to generate shots -- easier shots.\"Jaylen Brown appeared to have no issue finding his shot. He scored 13 of Boston's first 18 points and finished with 25 for the game on Wednesday.NBA Sixth Man of the Year recipient Malcolm Brogdon sank six 3-pointers to highlight his 23-point performance off the bench for the Celtics.Boston seized control of Wednesday's game by outscoring Philadelphia 35-16 in the third quarter. The Celtics made 46.7 percent of their shots from the floor and 39.2 percent from 3-point range to even the series.\"They came in here and they got one on us on our home court,\" Marcus Smart told the Boston Herald. \"We definitely want to send a message going back to Philly.\"Part of that message was limiting their mistakes. The Celtics followed up their 16-turnover performance in the series opener by committing just seven in Game 2.\"Hostile environment. But it should be fun,\" Brown said. \"We should all be excited to embrace that challenge.\"Jayson Tatum likely will be up for the challenge after turning in a lackluster performance in Game 2.",
        "Tatum found himself in early foul trouble and finished with just seven points in 19 minutes. He recorded career-high averages in points (30.1), rebounds (8.8) and assists (4.6) during the regular season.--Field Level Media"
    ]
}