{
    "articleURL": "/wires/pa/article-12054311/Josh-Little-rested-Ireland-s-Test-against-England-Lord-s.html",
    "content": [
        "Ireland have rested star bowler Josh Little for next month’s Lord’s Test against England, chipping away at the status of what should be a prestige fixture for the visitors.",
        "Little has not played first-class cricket since 2019 but the 23-year-old’s stock has never been higher following an impressive stint at the Indian Premier League with Gujarat Titans and would surely have improved the Irish attack had he been picked.Instead he will now miss his fourth Test of the year, having been excused from games against Bangladesh and Sri Lanka due to his near £400,000 IPL deal.Little has put his country first this month, breaking up his stint with the Titans and making his way from Jaipur to Chelmsford to feature in a crucial three-match ODI series against Bangladesh.Ireland must win that 3-0 to keep alive hopes of automatic World Cup qualification and Little’s arrival will boost their chances considerably, but it is now clear that limited-overs cricket will continue to be a priority.National selector Andrew White said: “Although the IPL will have finished, we are very conscious of the need for Josh to rest, recover and prepare for what will be a busy and important summer for us in white-ball cricket.”Ireland played their only previous Test against their neighbours four years ago and there is no question that Little’s absence diminishes the occasion.While speculation over England’s IPL contingent in the match has been subject to debate, Ireland turning up without their strongest side will come as a surprise.",
        "The Ireland squad contains five players who took on England in 2019 and lost by 143 runs – captain Andrew Balbirnie, Paul Stirling, James McCollom, Mark Adair and Andy McBrine.The latter is set to play as a solitary frontline spinner, with Ben White and Matthew Humphreys dropping out after featuring in sub-continental conditions.Ireland have lost all six of their Test match outings, but saw Lorcan Tucker, Curtis Campher and Stirling score their maiden centuries in recent months. They face Essex in a first-class warm-up game at Chelmsford starting on May 26, before the four-day Test runs from June 1-4.Ireland squad: A Balbirnie (captain), M Adair, C Campher, G Dockrell, F Hand, G Hume, T Mayes, A McBrine, J McCollum, P Moor, C Olphert, P Stirling, H Tector, L Tucker, C Young."
    ]
}