{
    "articleURL": "/tvshowbiz/article-12046827/Gael-Garcia-Bernals-stepmom-44-makes-fortune-selling-used-underwear-OnlyFans.html",
    "content": [
        "Bella de la Vega, 44, started her OnlyFans after the death of her then-husbandShe was wed to director José Ángel García, Gael's dad, who died at 70 in 2021Bella sells each item for between $445 and $564, depending on the garment The stepmother of Golden Globe-winning actor Gael Garcia Bernal is making a fortune selling her used undies to fans.",
        "OnlyFans star Bella de la Vega, 44, said she felt 'like a millionaire' after launching her new business venture.She started her OnlyFans account two years ago after the death of her late husband, Mexican director José Ángel García, aged 70 in January 2021.Bella is stepmother to José's famous son, 44-year-old Gael.Gael, who won a Golden Globe for Mozart In The Jungle in 2016, stars alongside Jennifer Lopez and Joseph Fiennes in next week's release, The Mother, directed by Niki Caro.",
        "In a recent interview, Bella explained how her used underwear venture was making her a small fortune.'I'm still at my entrepreneurial stage, but I've done incredibly well,' the actress said.'I feel like I'm already becoming a millionaire.'It was a big surprise for me. My followers started writing to me on Instagram and OnlyFans to tell me to sell my used thongs.'I know there is a fetish people have, but I never imagined there would be such a large market eager for this.'The actress added that she didn't care 'what people say' about her new line of work.Bella described what paying fans receive: 'My lingerie is clean, they are made for me in the center of Mexico City, they are my own brand.",
        "'I wear them at least once to please my fans because they ask for them like this.'",
        "She added: 'You can say that they are almost new, I even put a little perfume on them - although only a little so my own aroma is not lost.'Bella said she sold each item between $445 and $564, depending on the garment. Shipping is also included in the price.She said that most of her clients came from Mexico and the US, but she has many followers throughout Latin America.'This is just the beginning. I have already announced it on my Instagram page and I'm getting a lot of requests,' Bella said.'It's going well for me and I plan to continue doing it for my followers.'One fan commented: 'Mmmmm, how nice to have your aroma on my pillow at night after dreaming of you my love.'",
        "Another added: 'Wow how sexy.' 'What a promotion,' someone else said.However, Bella admitted that she had a tough time when she first got her OnlyFans account as the widow of a famous film director.'I felt that producers were prejudiced about me, thinking that I only dedicate myself to being on OnlyFans,' she said.'But I keep getting more and more followers, so how could I leave something that is working so well for me?'"
    ]
}