{
    "articleURL": "/wires/pa/article-12048729/Neil-Warnock-proud-Huddersfield-beat-drop-rules-staying-manager.html",
    "content": [
        "Neil Warnock was a proud man after Huddersfield retained their place in the Sky Bet Championship with a 1-0 victory over promoted Sheffield United, but ruled out staying on as manager into next season.",
        "The 74-year-old came out of retirement in mid-February to take on the role, with the Terriers battling to get out of the relegation zone.However, a run of just one defeat in their last nine league matches ensured they achieved safety as Danny Ward’s stunning 25-yard strike got the job done against United with a game to spare, instead sending Reading tumbling into League One.Warnock had previously said keeping the Terriers up would be the “greatest achievement” of his career, which has spanned over 1600 games and included eight promotions.And he believes it was no less than the players deserved after a nail-biting 90 minutes at the John Smith’s Stadium.“I’ll remember tonight for the rest of my life,” said Warnock. “It’s a massive achievement and I couldn’t be any prouder.",
        "“When (Warnock’s assistant) Ronnie Jepson phoned me, he said ‘are you sure? This is the worst team I have seen’. Everyone has worked their socks off for me but I can’t do another 10 months of this. The job is done for me.“I have great memories and didn’t want to leave having gone down.“You can imagine relegation, jobs at stake. We looked nervous, not wanting to have a second touch. At half-time we told them what we’d been doing the last nine games and we deserved it in the end.",
        "“Danny scored one like that for Cardiff at Forest, I said we could do with another one of those. He’s an unsung hero.“It’s been an amazing ride. I think tonight could have converted youngsters for years to come.“I remember watching Joe Shaw for (Sheffield) United one night and it did me. I had to be an United-ite and there will be Town fans like that tonight.”The Blades enjoyed a promotion party of their own last month after they secured their return to the Premier League.But they had to endure watching Huddersfield celebrate this time around and boss Paul Heckingbottom admitted it was a difficult result for his team.“Of course we have to put it into perspective but not one of us enjoyed that,” he said. “But we’ve earned the right to be in that position.“I can’t help how I feel after a defeat. It was evident in the second half that there was one team scrapping for survival.“I am not going to be tough on the lads. They have been fantastic and that’s the difference when you haven’t got that edge.“We were good first half and missed chances, but second half they played it like a Championship match.”When asked about Warnock’s achievement of keeping the hosts up, Heckingbottom said: “Results have picked up. I have seen a lot of games and they have turned some really good teams over.",
        "“He’s worked his magic and got what he, and the club, wanted.”"
    ]
}