{
    "articleURL": "/wires/reuters/article-12038441/Moyes-thankful-West-Ham-stability-says-clubs-quick-axe-managers.html",
    "content": [
        "LONDON, May 2 (Reuters) - West Ham United manager David Moyes says he is thankful for having a chairman who 'did not buckle' and show him the door when results were going against the London club this season.",
        "When Tottenham Hotspur's interim manager Cristian Stellini was sacked last week it took the grim tally to 13 coaches fired since the start of the Premier League season.Tottenham and Southampton are on their third managers and according to British media reports Leeds United are close to sacking their second coach of the season in Javi Gracia.West Ham and Nottingham Forest are the only clubs in the bottom half of the standings who have kept faith with the man who started the season at the helm.Moyes believes top-flight teams have become too trigger-happy, firing coaches at the first hint of trouble and disputes whether it is in clubs' long-term interests.\"It's a big part of the game now that managers are losing their jobs much quicker now,\" Moyes, whose side face a daunting away trip to leaders Manchester City on Wednesday, told reporters on Tuesday when asked about the Premier League revolving door.\"If you are going to keep chopping and changing, I wouldn't be sure it's the right thing for football clubs for continuity, stability, the growth you are trying to get.\"Maybe the clubs now have got too much money and they can afford to keep changing direction all the time.\"Several clubs in the basement battle have 'interim managers', namely Dean Smith at Leicester City and Ruben Selles at bottom club Southampton. Higher up the table, Chelsea and Tottenham are muddling through with Frank Lampard and Ryan Mason holding the fort while permanent managers are targeted.",
        "\"I don't think I can ever remember the Premier League having as many interim managers in different roles and different changes,\" said Moyes, who is in his second spell at West Ham.\"It's not for me to look at it, but maybe a lot of clubs may look back at it and think, 'did we make the right decision?'\"Some West Ham fans were calling for Moyes to be sacked in January after six defeats in seven league games saw them drop into the relegation zone.But Moyes has proven to be a steady hand on the tiller and West Ham are now in 15th place, four points ahead of the third-from-bottom Nottingham Forest having played a game less.They are also in the Europa Conference League semi-finals.\"Through my career, I've been really fortunate that I've had really good chairmen and men with distinction who don't buckle when the call comes,\" Moyes said.Few give West Ham a chance of avoiding defeat at a City side on an eight-game winning streak in the league and on course for a Premier League-Champions League-FA Cup treble.\"We've been to the Etihad a lot and it's been hard to win, but I've got to say, we've given them some really good games when we've played them,\" Moyes added. (Reporting by Martyn Herman Editing by Christian Radnedge)"
    ]
}