{
    "articleURL": "/sport/football/article-12055525/Mikel-Arteta-admits-best-time-Arsenal-lift-Premier-League-title.html",
    "content": [
        "Mikel Arteta says competition in Premier League will continue to get tougher Arsenal will seek to continue title charge with win over Saudi-backed NewcastleA win at St James' Park will see the Gunners close the gap on leaders Man City Arsenal manager Mikel Arteta believes this is the 'best time' for his side to win the Premier League with state-owned clubs on the rise.",
        "The Gunners' main title rivals, Manchester City, are owned by ADUG, the investment company of Emirati royal Sheikh Mansour whilst third placed Newcastle United, who Arteta's men face on Sunday, are owned by PIF, a Saudi investment fund.With Qatari Sheikh Jassim Bin Hamad Al Thani tabling a world-record £5 billion bid for Manchester United last week, there is a possibility that three clubs in the Premier League would be owned by states.Arteta believes this season is the best opportunity for his side to win their first league title since 2003/04, with Todd Boehly's heavy spending Chelsea also looking to make strides next season after a disastrous first campaign in charge of the Blues.'It is the best time because this is the moment right now,' Arteta said.",
        "'The best time is when you have something and try to take it, especially in elite sports because you don't know when you are going to have another opportunity.'That is what we are trying to do. We are going to Newcastle to try to win the game and continue to be there.'We have to compete with those teams for sure because we are Arsenal Football Club. The demands are to be the best in everything that we do so we have to find a way to do that.'",
        "Arsenal have performed exceptionally well under the guidance of the Spaniard to still be in with a shout of claiming the league title, but with rivals expected to spend big in the summer, Arteta is adamant the hardest league, in his opinion, is only going to get harder to compete in.'From my experience, 22 years here, this has been the most difficult league that I have lived with and participated in.'Next season looks like it is going to be even harder, I don't know. But for sure, this one, with four games to go, I'm telling you it's the hardest I've ever been involved in.'"
    ]
}