{
    "articleURL": "/wires/reuters/article-12052189/Russias-mercenary-boss-deepens-fog-Ukraine-war-deflecting-blame.html",
    "content": [
        "Mercenary chief's 'withdrawal' seen by Ukraine as bluff",
        "Prigozhin seeks to dodge blame for failing to take BakhmutRisky attempt to force hand of Putin and defence chiefsBy Mark Trevelyan, Andrew Osborn and Jonathan LandayLONDON, May 5 (Reuters) - An extraordinary announcement by Russian mercenary leader Yevgeny Prigozhin that his fighters will abandon the Ukrainian city of Bakhmut looks like an exercise in blame avoidance and disinformation, Russia specialists and military analysts say.But it takes his conflict with defence chiefs to a new level in what has been a difficult week for Moscow, two days after a purported drone attack on the Kremlin. It also highlights Russian frustration at failing to complete the capture of Bakhmut after more than nine months of costly, intense battle.Prigozhin delivered an effective ultimatum to President Vladimir Putin and the military establishment on Friday by saying Wagner would quit Bakhmut on May 10 and withdraw to \"lick its wounds\" after suffering exponentially rising losses. He accused military bureaucrats of starving it of the ammunition it needed.But many months of impetuous tirades from the former Kremlin catering magnate, a master in the art of self-promotion, have made clear that his words are seldom to be taken at face value.Ukraine immediately scented a bluff. Its deputy defence minister said Wagner was actually bringing in fighters from other parts of the front line to try to complete the capture of Bakhmut in time for Russia's World War Two Victory Day celebrations next Tuesday. Reuters could not independently verify those movements.",
        "Kimberly Marten, a professor at Barnard College and Columbia University who specialises in Russian security issues, said Prigozhin and his mercenaries are \"essential elements of Russian military intelligence, so we don't believe anything he says\".\"This is all smoke and mirrors, so we are just guessing,\" said Marten, who has testified multiple times to the U.S. Congress on Wagner. She noted it would be foolhardy for any commander to \"broadcast\" their intentions to their enemy five or six days in advance.ANGRY TIRADEWhat looked real, however, was Prigozhin's fury at Defence Minister Sergei Shoigu and Chief of General Staff Valery Gerasimov. He hurled abuse on both their names in a tirade filmed in front of dozens of bloodied corpses, and said he would hold them responsible for \"tens of thousands of Wagner dead and injured\".Some saw Prigozhin's move as a desperate gamble to try to force Moscow to give him the extra supplies and Russian troop support he needs - and one that might work, because Russia has paid too high a price to give up now on Bakhmut.\"If this (pullout) is exactly what happens, we should expect the Ukrainian army to attack during the rotation and the loss of all, or most, of the city,\" wrote a Russian military blogger, Zhivov Z.",
        "Alexander Bovdunov, a political analyst, told Russia's 'Argumenty Nedeli' news portal: \"Wagner is our most effective assault infantry. It must get everything it needs. Internal bureaucratic conflicts must recede into the background if Russia is to achieve victory.\"Austrian analyst Gerhard Mangott said if Prigozhin really withdrew, \"this would be much too quick for the Russian regular armed forces to take over the positions of the Wagner fighters in and around Bakhmut.\"\"If he really means it ... this would give the Ukrainian armed forces the opportunity to seize parts, or the whole of Bakhmut from the Russians,\" he said, adding this would be a disaster for Putin and Shoigu.Yohann Michel, an analyst at the International Institute for Strategic Studies in London, said Prigozhin's statement looked like an attempt to transfer blame for the failure to take Bakhmut, and an indication that its capture remained elusive.He also questioned whether Prigozhin had the agency to withdraw without Kremlin permission. \"If Putin wants him to be in combat, he'll force him in one way or another to do so.\"Michael Mulroy, a former senior Pentagon official, said Prigozhin's latest comments could be a bluff or a sign he was truly short on manpower, saying Russian commanders had treated Wagner \"as if they were totally expendable\".",
        "VITAL UNITWestern intelligence assessments have regularly concluded that Wagner is one of Russia's most effective battlefield units because of its ability - up to now - to absorb high casualties and carry out full frontal attacks using \"human waves\".Although it started out as a force of around 10,000 made up of former professional soldiers and special forces, its momentum - however slow - became contingent upon a constant supply of new recruits which dried up when the defence ministry in February stopped it from using convicts recruited from prisons.The U.S. intelligence community estimated that up to 40,000 convicts were fighting for Wagner at one point.Wagner has since opened recruiting centres to try to replenish its ranks at the same time as the defence ministry itself is recruiting professional soldiers.Marten said its involvement in the battle for Bakhmut, including fighters recruited from Russian prisons, had allowed Putin to avoid declaring a full-scale mobilization.Whatever its immediate intentions around Bakhmut, Wagner is likely to remain a significant player in the war, given Prigozhin's personal ambitions and determination to stay in the limelight. Pro-war bloggers reported that former deputy defence minister Colonel General Mikhail Mizintsev, sanctioned by Western countries for orchestrating the brutal siege of Ukraine's Mariupol, has been newly recruited to Wagner as a deputy commander.",
        "\"We will lick our wounds, and when the motherland is in danger, we will rise again to defend it. The Russian people can count on us,\" Prigozhin said on Friday. (Reporting by Mark Trevelyan, Andrew Osborn, Jonathan Landay and Idrees Ali; Editing by Daniel Wallis)"
    ]
}