{
    "articleURL": "/sport/football/article-12060269/Man-United-loanee-Amad-Diallo-scores-stunning-goal-lift-Sunderland-play-places.html",
    "content": [
        "Amad Diallo scored a stunning goal for Sunderland in their 3-0 win at PrestonThe Man United loanee helped the Black Cats book their place in the play-offsDiallo's 13th goal of the season attracted the attention of Man United supporters Manchester United fans have praised Amad Diallo after the winger scored a superb curling effort to inspire his loan club Sunderland into the Championship playoffs.",
        "The 20-year-old has enjoyed a strong loan spell with the Black Cats this season, contributing impressively towards their late promotion push.Diallo ensured his loan spell would go beyond the final day of the Championship season, with the Ivorian netting a vital goal to help his side earn a play-off spot.The youngster swept in a first time effort into the top corner of the Preston net, with his shot curling beyond the dive of goalkeeper Freddie Woodman.Diallo's strike was lauded by Manchester United fans on social media, with supporters keen to see the winger involved at Old Trafford next season.",
        "'We've got some player there,' one fan commented, with another writing 'This loan deal to the Championship could be the best thing in his career we’ll find out next season.'United supporters also compared Diallo to Brazilian winger Antony, who has had a mixed first season at the club, while others called for patience despite his impressive Championship loan.'Surely he starts ahead of Antony next season,' one fan said. 'Pleased for him and no doubt he’s a talent. However doing it in championship versus starting for United every week is a different ask. He deserves a shot in pre season &amp; take it from there,' another said.Diallo's 13th goal of the season proved crucial as Sunderland took control of their match against Preston in the second half.",
        "Alex Pritchard and Jack Clarke added to the Black Cats as Tony Mowbray's side moved into sixth place on the final day of the season.The 3-0 victory saw Sunderland clinch a play-off spot on goal difference ahead of Blackburn, who won 4-3 in a dramatic match against Millwall.Diallo will now hope to inspire Sunderland in their upcoming play-off semi-final matches against Luton.",
        "The winger is expected to move away from Man United on loan again next season as the club aims to continue his development.Diallo, who was born in the Ivory Coast and raised in Italy, made his breakthrough in Serie A with Atalanta, scoring on his senior debut in 2019.In 2021, Man United purchased him for £37m, and he has enjoyed loan spells at Rangers and Sunderland since then. "
    ]
}