{
    "articleURL": "/news/article-12056633/Father-having-lunch-16-year-old-daughter-shielded-Texas-mall-gunman-opened-fire.html",
    "content": [
        "Geoffrey Keaton said he was having lunch with his 16-year-old daughter at Fatburger at the Allen Premium Outlets when they heard gunshots He described trying to shield his daughter before they hid as the gunman killed eight peopleKimberly Blakey said she initially drove toward the sound of gunshots before her daughter told her to turn aroundTerrified shoppers and employees at a Texas mall have described in harrowing detail how they tried to either hide or flee when a gunman opened fire Saturday afternoon.",
        "A father having lunch with his 16-year-old daughter told how he shielded her as the sound of gunshots got louder, while a mother said her car was shot up as she and her 14-year-old daughter tried to flee the Allen Premium Outlets.A mother shopping with her daughter also described how they heard multiple 'popping' noises and saw 'sparks flying like it was right in front of us.'Police say nine people, including the gunman, were killed at the scene and at least seven victims were transported to a local hospital in the aftermath.  Of those, three were in critical condition as of Saturday night and four were stable.At least one victim is believed to be a child as young as 5-years-old.",
        "Speaking to the New York Times following the shooting in Allen, a suburb of Dallas, Geoffrey Keaton said he was having lunch with his 16-year-old daughter at Fatburger in the outlet mall when they heard gunshots.'I immediately knew,' he said. 'I got my baby girl under the counter to shield her, and they got louder, like he was right there.' Keaton said the restaurant manager allowed customers to hide in the back during the fatal shooting, where they were able to exit through a rear door and run to their cars.",
        "But when they did, Keaton said, 'You could see bodies of people he had shot on the sidewalk.' He also shared videos on his Facebook page showing him and his daughter sheltering in a hallway with hundreds of other customers and later watching as police investigated the scene.'All we wanted was a Fatburger,' he said in the video, noting that his daughter just wanted a latte. ",
        "Kimberly Blakey also said she and her 14-year-old daughter were trying to flee the parking lot when they heard the gunshots.As she frantically tried to flee, she told CNN, she initially drove toward the sound of gunshots before her daughter told her to turn around.When they finally approached the exit, though, the mother and daughter got stuck behind other cars trying to do the same.That's when, Blakey said, she felt her car get hit twice by gunfire.'I told my daughter to get down,' Blakey recounted. 'She did, and I could hear her start praying.'Eventually, the pair were able to get out of the parking lot and Blakey did not stop until they reached their house — even when she realized her car's flat tire light had come on.'We were on a mission to get out of there,' she said.",
        "Meanwhile, inside the mall, witnesses described the mad rush to flee.A woman named Colleen, who did not wish to provide her surname, told CBS Texas she was with her son at the mall at the time of the shooting.They described the shooter as wearing all black in and wearing 'like a SWAT uniform without the letters SWAT on it'. She said the shooter was a 'big guy' and was carrying a rifle before he opened fire and people began to run screaming in different directions.  Colleen and her 22-year-old son said they saw the killer dead on the ground when they were evacuated by the police with other bodies on the floor too.Her son initially thought the gunshots were construction noises before he saw the killer in front of the store.  He said: 'Out of nowhere I heard about like 10 pops go off and I look at the customer next to me and I was like \"was that gunshots?\".'And he said it was probably just construction and more shots go off, heard like 10-15 more shots go off and so I ran to the front of the store and we're like \"No that's shooting.\"'We saw the guy dressed in all black wearing a vest, has an assault rifle and he's just shooting at people.'",
        "'We definitely saw some bodies going down,' Colleen added. 'We definitely saw some people being shot. It was right outside our door. It was horrible.'And I'm a trauma nurse, and I couldn't do anything to help because the gunman's an active shooter.' Elaine Penicaro, who had recently moved to the area, said she heard nonstop hail of gunfire while shopping with her own daughter. 'We were outside the Converse store and we just heard all this popping,' Penicaro told Fox 4 after also fleeing the scene, ducking for cover when they heard the shots reportedly around 3:45pm.'We kind of all just stopped, and then a second later, just \"Pop, pop, pop, pop, pop,\" and there were sparks flying like it was right in front of us.'She said she saw 'a lady who looked like she lost her daughter.' And Fontayne Payton, 35, said he was at H&amp;M when he heard the sound of gunshots through his headphones. He said: 'It was so loud, it sounded like it was right outside.'I pray it wasn't kids, but it looked like kids,' he said. The bodies were covered in white towels, slumped over bags on the ground. 'It broke me when I walked out to see that.'",
        "Kingsley Ezeh also said he was walking inside the mall when he saw people starting to run.",
        "'I turned around and I saw two ladies running toward m, and then one was like \"Someone's shooting, someone's shooting.\"'Behind that woman, he said, he saw a man holding his neck which 'blood [was] just dripping down.' Kaileo Polakiko, 36, also said he was shopping with his parents for an upcoming vacation when they saw people running outside.'It was just kind of chaotic for a second,' he recounted. Then when someone said \"shooter,\" we all ran to the back of the store.' And outside, Brayson Jones, a 17-year-old who was working the PM shift at the outlets' Champs Sports store, told the New York Times that he heard 'probably 20-plus shots' and saw people running out of stores.'As soon as I heard the shots and people yelling, I didn’t wait to see what was going on, I backed out and got out of there,' the teen recalled of the hectic scene.He added that in the frenzy he rescued a random stranger, who he said ran toward his car when the shots were fired and motioned to let him inside.'As soon as I heard the shots and people yelling, I didn't wait to see what was going on, I backed out and got out of there,' he said.Meanwhile, back inside the Fatburger, employee Tiffany Gipson shared how she and some customers hid in a hallway behind the mall restaurant.",
        "'I've never witnessed anything like this,' she said. 'This is very traumatic for me and I already suffer from anxiety and seizures.'",
        "The shooting which began at about  3:30pm and rocked the small city of Allen where residents are now desperate for answers. Dashcam footage showed the moment the gunman, dressed in full SWAT garb, pulled up to the outdoor outlet before opening fire with an AR-15, killing eight people including children.A mass evacuation transpired as cops reportedly swept each store to assess their safety, with hundreds of shoppers filed away from the H&amp;M location where at least four bodies were seen.Pictures posted online appear to show the shooter, who still has not yet been identified, dead on the ground outside the Fatburger restaurant after being killed on the scene by a police officer who was at the mall for an unrelated call."
    ]
}