{
    "articleURL": "/travel/article-12053721/Give-Montenegro-Medieval-towns-glitzy-marinas-Balkan-beauty-rising-star.html",
    "content": [
        "Nick Redman stays at Regent Porto Montenegro, a luxury hotel near Tivat 'The country is one of the best sun magnets in southern Europe,' he says  READ MORE: Inside a dreamy Philippe Starck-designed 5-star Paris hotelWakey, wakey on a Mediterranean morning and there’s a mesmerising view of yacht masts. Elegant super-vessels with metallic paintwork are packed sardine-tight, hulls reflecting the sunny ripples of the port waters as their owners emerge and saunter off to shop in local boutiques.",
        "But this is not Monte Carlo, it’s Montenegro, a small country sandwiched between Croatia and Albania, 350 miles east across the Adriatic from Italy.In the north, mountains plummet to fjord-like jade inlets suggestive of New Zealand or Norway. Farther south, the broad, blond sands are reminiscent of Turkey.For tan-seekers it’s a flight of under three hours from Gatwick - or from Manchester, on a twice-weekly Jet2 route to coastal Tivat launching next month.The country is one of the best sun magnets in southern Europe, and the Regent Porto Montenegro, where I’m staying, is part of a luxury residential development near Tivat, owned by the Investment Corporation of Dubai.",
        "Foreign money is attracted to Montenegro like bees to honey - China has even advanced a $1 billion loan for a controversial new expressway that will link to neighbouring Serbia.The Regent’s peachy facades and grand colonnades nod to the grand palazzos of the Italian Lakes. The bedrooms are not flashy, but super-comfy and many have magnificent balcony views of gorgeous Boka Bay. Breakfasts are elegant, leisurely affairs and dinner at the in-house Murano restaurant is excellent, with modern Mediterranean dishes on offer including a memorable bonito tartare.There’s no faulting the value of food and drink in the marina’s smart establishments, either, with bottled local beers for €3.65 at the hotel, pizzas from €8 in chic, buzzy Roberto’s Mare, and pasta and risotto mains for €10 at Navale Kitchen &amp; Bar.",
        "The 40-minute taxi ride south to the town of Budva the next day is a snapshot of Montenegro in all its beauty, with brilliant blue Adriatic waters and pebbled beaches on one side, mountain peaks on the other, still dusted with snow.With its lichen-spattered old-stone ways, red roofs and stout churches, central Budva is a reminder of the medieval Venetian Republic, which also once held sway. A few footsteps echo as we turn quiet corners, but high summer will bring tourist crowds: signs advertise Guinness at ‘English Pub The Prince’, and there are Nutella pancakes on menus.",
        "B&amp;B doubles at Regent Hotel Porto Montenegro (ihg.com) from £173. EasyJet (easyjet.com) Gatwick to Tivat and Dubrovnik from £29 one-way. Small-group guided tours of the area start at £47pp with Go Baloo (gobaloo.me).",
        "The same distance north of Porto Montenegro, Unesco-listed Kotor town, once a naval base, is wedged between soaring peaks and a deep bay. I have to remind myself I am not in Italy as I amble around. West round the coast, Perast town provides the perfect lunch stop: elegant Conti, where specials include penne ‘The Sopranos’ with steak, porcini mushrooms and white truffles.Boats run to Our Lady Of The Rocks, an islet apparently drafted in from Lake Garda. Its blue-domed church is a beauty, lined inside with silver votive offerings left by storm-fearing mariners over the centuries.",
        "Family-run vineyard Savina, above Boka Bay, makes some of Montenegro’s finest wines and our tasting is a holiday highlight, sipping glasses of pink grenache on the terrace while nibbling white cheese.The view is of cypresses against the silver Adriatic. The soundtrack is of chardonnay being bottled rhythmically by a tiny machine at the bar. I inhale and swallow the magic of the Med."
    ]
}