{
    "articleURL": "/wires/ap/article-12054861/AP-PHOTOS-From-Charles-Derby-day-fancy-hats-rule.html",
    "content": [
        "If ever there was a banner day for hats - wild and colorful hats - it was Saturday, the dual spectacle of King Charles III's coronation and the celebration that IS the Kentucky Derby.",
        "Katy Perry donned a wide lilac hat to go with her matching bespoke jacket and skirt by Vivienne Westwood, her chin up as she peered under its flat, tilted brim while she searched for her seat at Westminster Abbey (yes, there were memes).And there was Princess Anne, the king's sister, in a two-pointed military topper with tall red feathers that blocked Prince Harry's view from the third row (more memes ensued). Sorry, Harry, she was chosen as Gold Stick in Waiting and holds a variety of military titles.It's tradition, of course, to wear hats to coronations and other formal royal affairs, but the thousands who gathered on the streets to celebrate went all out with head gear, from fake golden crowns to novelty deeley bobbers (those springy headband things) and hats of all kinds with motifs featuring the British flag.Speaking of hats of all kinds, the Kentucky Derby is arguably the world´s most famous horse race. It´s also a chance for racegoers to strut their fashion stuff.Seersucker suits, floral dresses and bright colors abound, but racegoers famously elevate their style to another level with their grand collections of hats and fascinators.",
        "Men tend to favor fedoras or bowlers, while women sport designs featuring feathers and flowers in every shape, color and size. Bigger is often better when it comes to Derby hats.",
        "The event has appointed an official milliner, or hatmaker, every year since 2018. But in a sign of their growing importance at the Kentucky Derby, it named three milliners for the 2023 event: Christine Moore, Jenny Pfanenstiel and The Hat Girls.The tradition of wearing hats to the Derby began with its first running in 1875."
    ]
}