{
    "articleURL": "/wires/aap/article-12048877/Premier-highlights-social-medias-role-youth-crime.html",
    "content": [
        "Social media companies can do more to prevent youth crime, Queensland Premier Annastacia Palaszczuk says, after her state passed \"the toughest laws in Australia\" in an attempt to rein in offending.",
        "The state government has been under pressure to defend its response after three people were killed in a collision this week involving a stolen Mercedes allegedly driven by a 13-year-old boy in Maryborough.\"Nearly everybody in that community knew one of the people who were killed,\" Ms Palaszczuk told Nine's Today Show on Friday.\"It has been very upsetting and I think there's not a Queenslander that is not touched by this tragedy in some way.\"Queensland's parliament in March passed a raft of laws targeting young people, including harsher prison terms for car thieves and new penalties for people who boast about crime on social media.The changes also make it a crime for a child to breach their bail conditions, allow GPS trackers on children as young as 15, and let courts declare certain youths serious repeat offenders.\"I can't stop every single instance of youth crime but we can throw everything at it,\" Ms Palaszczuk said.Posting crimes to social media can encourage copycat behavior, and platforms such as Facebook can do more to \"clamp down\" on publication, the premier said.Ms Palaszczuk said the Queensland laws passed earlier this year were \"the toughest in Australia\" and were voted on by both sides of politics.\"They will take time to take effect,\" she said.",
        "\"We've given the courts the laws, and now the courts have the opportunity to use those laws.\"The state also boosted funding to early intervention programs making \"really substantial changes\", Ms Palaszczuk said.Opposition Leader David Crisafulli again slammed the government for \"watering down\" youth justice laws when it came to power.\"Young criminals in stolen cars are taunting police,\" he told reporters on Friday.\"They aren't running from the law - they are now running at it. It defies belief.Mr Crisafulli said Queensland was \"the youth crime capital of the country\".\"We deserve so much better,\" he said.\"When people put on a blue uniform and go to work, you would expect that they will have the tools, the resources, and the laws to be able to do their job.\"Mr Crisafulli said he supported changing the laws to give media access to matters in children's court, saying identities could still be protected while maintaining accountability.His deputy Jarrod Bleijie accused the premier and Police Minister Mark Ryan of presiding over a government in chaos and said Ms Palaszczuk had given up on listening to Queenslanders."
    ]
}