{
    "articleURL": "/wires/ap/article-12057463/Perez-homers-Royals-avoid-sweep-5-1-win-As.html",
    "content": [
        "KANSAS CITY, Mo. (AP) - Salvador Perez homered and the Kansas City Royals beat the Oakland Athletics 5-1 on Sunday to avoid being swept in the series between teams with the worst records in the major leagues.",
        "Kansas City (9-26) lost two of three to the A's (8-27) and dropped to 1-10 in series this season.Perez went 3 for 4 with a 462-foot home run over the left-field fountains and scored three times. Maikel Garcia scored Perez with an RBI single, giving the Royals a 2-1 lead in the fourth.\"I hit the ball pretty good, but it counts as a homer no matter how far you hit it,\" Perez said. \"...We have to do this more consistently and it was a great win today. We will try to come in tomorrow and do the same thing.\"Nick Pratto hit a two-run double in the eighth to highlight a three-run inning.Ryan Yarbrough (1-4) pitched 5 2/3 innings and allowed one run on three hits with two strikeouts and a hit batter. Yarbrough was removed from the game in the sixth after getting hit in the face by a liner that was 106.2 mph off the bat of Ryan Noda. Yarbrough was able to walk off the field with the assistance of trainers.\"Your heart drops in those moments, it is one of the worst things you can see on the field,\" Royals manager Matt Quatraro said. \"Luckily, when we got out there, (Yarbarough) was aware of what was going on. He is going to get more tests. As far as his outing until that point, that was just what we are used to seeing from him.\"",
        "Royals relievers Carlos Hernandez, Aroldis Chapman and Scott Barlow each tossed scoreless outings.Mason Miller (0-2) gave up two runs on five hits with five strikeouts and a hit batter in six innings of work.(Miller) is building momentum and I think each start he is just getting better and better,\" Oakland manager Mark Kotsay said. \"Veteran Salvador (Perez) got him early in the game and seemed to see him pretty well, but was probably the only guy in the lineup really. Overall, good performance.\"Ramón Laureano broke an 0-for-10 stretch with an RBI single in the fourth. Esteury Ruiz extended his hitting streak to nine games in a 1-for-4 afternoon.REMEMBERING VIDA BLUEPrior to first-pitch, there was a moment of silence remembering Vida Blue, who died Saturday at the age of 73. Blue was drafted by the then Kansas City Athletics in 1967 and debuted for the A´s in 1969, shortly after the move to Oakland. Blue won an AL MVP, and Cy Young Award and was a three-time World Series champion in Oakland. He also played for the Royals from 1982-83.ROSTER MOVESRoyals: RHP Max Castillo was recalled from Triple-A Omaha. RHP Jonathan Heasley was optioned in the corresponding move.TRAINER´S ROOMRoyals: LHP Daniel Lynch (left rotator cuff strain) was expected to make a rehab start in Triple-A on Sunday. Lynch was placed on the 15-day injured list on March 30.",
        "UP NEXTAthletics: Oakland continues a six-game road trip with a matchup with the Yankees. LHP JP Sears (0-2, 5.06 ERA) is expected to start for the Athletics.Royals: RHP Zack Greinke (1-4, 5.25 ERA) opens a three-game series with the White Sox in the first meeting between AL Central foes in 2023 and just the second different divisional opposition of the season for Kansas City.___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}