{
    "articleURL": "/news/article-12039341/Airplane-passenger-slammed-photo-smelly-feet-propped-headrest-goes-viral.html",
    "content": [
        "Reddit users slammed an airplane passenger for flaunting her feet on a flight The photo of the unnamed woman showed her proudly propping her feet in the air while showing off white white anklet socksThe photo posted on Monday garnered high attention with several people either ridiculing the woman or claiming they would've liked the viewA passenger onboard a crowded Delta flight was shamed for putting her stenchy feet on top of a headrest.",
        "The incident was exposed on a Reddit thread by user seefooddiet2200, who didn't hold back on their experience on the dreadful flight.The photo showed the ignorant passenger with her feet propped to a 90 degree angle as her feet covered with white anklet socks hung high.According to the poster, the girl's feet were right under the air vent, which 'wofted the scent through the plane.'",
        "Several people tuned to the thread to post their two cents, with some claiming they would've loved a closer look.'I would be the one to tell her that her feet smell and to put them away for the sake of everyone,' one person wrote.'At least they're wearing socks,' another said.One person defended the aspiring foot model and added, 'You afraid of socks or something? Can’t believe society has gotten to the point that it’s unacceptable to take off your shoes. Makes me sigh and laugh all at once.'",
        "To which another chimed in, 'Taking your shoes off on a long flight is not rude though. Sticking them up in the air like the person in the picture is rude.'Another commenter gave an unexpected cheeky response, 'I'd be the one to tell her that the pungent aroma of her feet is enticing and erotic.'",
        "'Some people would pay money for that,' one person said. 'So I hear.'  The flight appeared to be onboard a Delta plane but the destination is unknown.This isn't the first time an indecent airplane passenger was called out for resting their feet out in the open. Last month, a passenger onboard a flight in Australia was seen propping her bare feet on the seat in front of her.  ",
        "'This would have to be one of the most disgusting things that I've seen on a flight in a long time,' the person, who shared the photo to a Facebook group, wrote. The passenger who snapped the photo revealed that after 'putting up with it' for 20 minutes, they politely asked the person to remove their feet. The photo led to a lengthy discussion on Facebook between users. 'I've once been in the seat where the feet protruded. Attached to a backpacker (so you can imagine the smell). Long-haul from Paris to Singapore. It was extremely unpleasant and I draped a blanket over them,' one said. "
    ]
}