{
    "articleURL": "/wires/reuters/article-12041671/Reeling-Cardinals-brace-Shohei-Ohtani-Angels.html",
    "content": [
        "Miles Mikolas struggled out of the blocks by posting a 10.05 ERA over his first three starts.",
        "The right-hander found his stride during his next three starts while allowing six runs (five earned) in 17 1/3 innings. Mikolas (1-1, 5.97 ERA) will try to continue his recent surge on Wednesday when the St. Louis Cardinals host the Los Angeles Angels in middle contest of a three-game series.The Angels recorded a 5-1 victory on Tuesday night for their fifth victory in their last seven games. The Cardinals have lost four straight games and seven of eight.Mikolas drew this start after throwing 6 1/3 innings in his last outing, a 6-0 victory at San Francisco on April 27. He blanked the Giants on four hits and two walks while striking out six batters.\"That's the guy we're used to seeing,\" Cardinals manager Oliver Marmol said. \"He was pounding the zone with literally everything and he got a lot of swing-and-miss with the slider. He did a really good job and gave us exactly what we needed.\"Mikolas is 1-2 with a 3.07 ERA in four career games against the Angels, including two starts.Shohei Ohtani (4-0, 1.85) will make his first career start against the Cardinals. Ohtani allowed five runs on three hits (including two homers), two walks, three hit batters and two wild pitches during an 8-7 victory over the Oakland Athletics on April 27.",
        "\"He's human,\" Angels manager Phil Nevin said. \"He's going to give up runs. You could sense it in the whole stadium, like, `What's wrong with him?' But nothing was wrong with him. You have to throw it over the plate. And major league hitters take swings, and sometimes they hit them.\"Ohtani struggled in the fourth after hitting a double and running the bases in the previous half-inning. Ohtani gave up five runs in the fourth inning -- as many runs as he had allowed in his previous 60 innings -- but he insisted he wasn't fatigued.\"I don't think that had anything to do with it,\" Ohtani told the Orange County Register through an interpreter. \"I was probably a little passive trying to protect our lead too much. I should have been aggressive.\"In the bullpen right before the game, and the first three innings, I probably felt the best I have all year. That (fourth) inning was very regrettable but I felt really good coming back in the fifth and sixth to shut it down. I'll use this as a learning experience.\"Both teams made a bullpen adjustment for this series. The Angels activated Ryan Tepera (shoulder inflammation) from the injured list and sent fellow right-hander Andrew Wantz down to Triple-A Salt Lake City.",
        "The Cardinals sent left-hander Zack Thompson down to Triple-A Memphis to join that club's starting rotation. Right-hander Guillermo Zuniga arrived from Memphis to replace him and made is big league debut Tuesday.Zuniga turned heads with a strong showing for Colombia at the World Baseball Classic.\"He did a nice job there,\" Marmol said. \"He lit up the radar gun and had the secondary stuff to complement it. This gives us an opportunity to take a look at him.\"--Field Level Media"
    ]
}