{
    "articleURL": "/wires/reuters/article-12043609/Equities-choppy-Treasury-yields-dollar-retreat-choppy-trading-Fed-hikes-rates.html",
    "content": [
        "By Sinéad Carew",
        "NEW YORK, May 3 (Reuters) -MSCI's gauge of stock markets around the world was advancing but trading was choppy on Wednesday while U.S. Treasury yields and the U.S. dollar steepened declines after the U.S. Federal Reserve raised interest rates but indicated that it could hold off on further hikes.The Fed raised interest rates by a quarter of a percentage point and signalled it may pause further increases, giving officials time to assess the fallout from recent bank failures, wait on the resolution of a political standoff over the U.S. debt ceiling, and monitor the course of inflation.Oil futures initially pared losses after the news but still settled down for the day after already falling 5% on Tuesday.A majority of traders had been betting on a 25-basis-point hike but investors had been less certain that the central bank will leave the door open for a hiking pause at the June meeting.\"The updated language in the policy statement does suggest the bar is going to be quite high for further rate hikes. The statement is pretty clear that today's hike is probably the last,\" said Tom Garretson, senior portfolio strategist at RBC Wealth Management, US, in Minneapolis.\"Treasury yields have fallen and the dollar has weakened so it's a pretty dovish market reaction,\" he said.",
        "Along with clues about the rate hiking path investors were expected to listen carefully for Powell's view on the U.S. banking industry during his press conference, according to Alex Coffey, senior trading strategist at TD Ameritrade.MSCI's gauge of stocks across the globe was up 0.1%.However, the Dow Jones Industrial Average fell 229.04 points, or 0.68%, to 33,455.49, the S&amp;amp;P 500 lost 20.01 points, or 0.49%, to 4,099.57 and the Nasdaq Composite dropped 19.63 points, or 0.16%, to 12,060.88.Also in focus this week are first quarter earnings reports and Friday's U.S. jobs report for April.Wall Street has also been keeping a wary eye on the U.S. debt ceiling, with lawmakers squabbling and Treasury Secretary Janet Yellen warning of a potential money shortfall as soon as June 1.The dollar, which was down ahead of the Fed's statement, deepened its losses in volatile trading on the prospect of a rate hiking pause.The dollar index fell 0.461%, with the euro up 0.5% to $1.1054. The Japanese yen strengthened 0.74% versus the greenback at 135.53 per dollar, while sterling was last trading at $1.2557, up 0.75% on the day.U.S. Treasury yieldsedged lower after the Fed's signal that it could keep rates unchanged at the next few meetings.Benchmark 10-year note yields were down 3.6 basis points to 3.403%, from 3.439% late on Tuesday. The 30-year bond yield was last down 1.9 basis points to 3.7128% while the 2-year note yield was last was down 3.9 basis points to 3.9407%, from 3.98%.",
        "In energy, U.S. crude settled down 4.27% at $68.60 per barrel and Brent ended at $72.33, down 3.97%.In precious metals, spot gold was up 0.3% at $2,022.00 an ounce. U.S. gold futures gained 0.44% to $2,023.10 an ounce. (Reporting by Sinéad Carew in New York and Karen Brettell, additional reporting by Nell Mackenzie in London, Tom Westbrook in Singapore, Editing by Lincoln Feast and Kim Coghill; Editing by Emelia Sithole-Matarise, Angus MacSwan and Chizu Nomiyama)"
    ]
}