{
    "articleURL": "/wires/ap/article-12051291/TurboTax-customers-receive-checks-141M-settlement.html",
    "content": [
        "WASHINGTON (AP) - Millions of Americans who qualified for free tax services - but were instead deceived into paying TurboTax for their returns - will soon get settlement checks in the mail.",
        "In a settlement last year, TurboTax's owner Intuit Inc. was ordered to pay $141 million to some 4.4 million people across the country. Those impacted were low-income consumers eligible for free, federally-supported tax services - but paid TurboTax to file their federal returns across the 2016, 2017 and 2018 tax years due to \"predatory and deceptive marketing,\" New York Attorney General Letitia James said.All 50 states and the District of Columbia signed the May 2022 settlement, which was led by James.Consumers eligible for restitution payments do not need to file a claim, the New York Attorney's General Office said Thursday. They will be notified by an email from Rust Consulting, the settlement fund administrator, and receive a check automatically.Checks will be mailed starting next week, and continue through the month of May. The amount paid to each eligible consumer ranges from $29 to $85 - depending on the number of tax years they qualify for.\"TurboTax´s predatory and deceptive marketing cheated millions of low-income Americans who were trying to fulfill their legal duties to file their taxes,\" James said in a Thursday statement. \"Today we are righting that wrong and putting money back into the pockets of hardworking taxpayers who should have never paid to file their taxes.\"",
        "At the time of the May 2022 settlement, James said her investigation into Intuit was sparked by a 2019 ProPublica report that found the company was using deceptive tactics to steer low-income tax filers away from the free, federal services they qualified for - and toward its own commercial products instead.Under the terms of last year's settlement, Intuit Inc. agreed to suspend TurboTax´s \"free, free, free\" ad campaign. According to documents obtained by ProPublica, Intuit executives were aware of the impact of advertising free services that were actually not free for everyone.\"The website lists Free, Free, Free and the customers are assuming their return will be free,\" an internal company PowerPoint presentation said, per ProPublica. \"Customers are getting upset.\"When contacted by The Associated Press on Friday, Inuit pointed to the company's May 2022 statement following the settlement agreement.\"Intuit is pleased to have reached a resolution with the state attorneys general that will ensure the company can return our focus to providing vital services to American taxpayers today and in the future,\" Kerry McLean, Intuit´s executive vice president and general counsel, said at the time."
    ]
}