{
    "articleURL": "/wires/reuters/article-12058957/Biden-plans-bolster-US-airline-consumer-protections.html",
    "content": [
        "By David Shepardson and Nandita Bose",
        "WASHINGTON, May 8 (Reuters) - President Joe Biden will announce on Monday that the U.S. Transportation Department aims to write new rules requiring airlines to compensate passengers for significant flight delays or cancellations when carriers are responsible.It is the latest in a series of moves by the Biden administration to crack down on airlines and bolster passenger consumer protections.\"When an airline causes a flight cancellation or delay, passengers should not foot the bill,\" U.S. Transportation Secretary (USDOT) Pete Buttigieg said in a statement.USDOT said it plans to write regulations that will require airlines to cover expenses such as meals and hotels if carriers are responsible for stranding passengers. Most carriers voluntarily committed in August 2022 to providing hotels or meals but resisted providing cash compensation for delays.The Biden administration has objected to family seating fees, investigated 10 carriers for failing to provide refunds, pressed Southwest Airlines to do more after a holiday meltdown led to more than 16,000 flight cancellations and proposed other new consumer protections.USDOT will make clear starting Monday on a government website that no U.S. carriers have agreed to provide cash compensation for delayed or canceled flights under carriers' control.The Biden administration has sparred with U.S. airlines over who was to blame for hundreds of thousands of flight disruptions last year.",
        "Airlines for America, a trade association representing Delta Air Lines, United Airlines, American Airlines , and others, said U.S. airlines \"have no incentive to delay or cancel a flight and do everything in their control to ensure flights depart and arrive on time, but safety is always the top priority.\"U.S. airlines note the Federal Aviation Administration (FAA) acknowledges it does not have enough air traffic control staff and is operating 10% fewer flights than in 2019 to reduce pressure on the system.In October, Reuters first reported major U.S. airlines opposed USDOT plans to update its dashboard to show whether carriers would voluntarily compensate passengers for lengthy delays within airlines' control.USDOT said Monday the updated dashboard will show that one airline guarantees frequent flyer miles and two airlines guarantee travel credits or vouchers when cancellations or delays result in passengers' waiting three hours. No airline guarantees cash compensation.There is no legal requirement for airlines to compensate U.S. passengers for delayed or canceled flights, but the European Union and some other countries require compensation of up to 600 euros ($663) for most significant delays. (Reporting by David Shepardson and Nandita Bose in Washington)"
    ]
}