{
    "articleURL": "/sport/football/article-12060081/Mauricio-Pochettino-wants-bring-plethora-new-talent-enhance-Chelseas-spine.html",
    "content": [
        "Mauricio Pochettino is keen to bring a wealth of talent to Stamford BridgeThe Argentinian is expected to be appointed the next Chelsea managerChelsea star Christian Pulisic is attracting interest from Napoli and JuventusIncoming Chelsea head coach Mauricio Pochettino is targeting a new spine to his team this summer but accepts his hands are tied due to the club’s bloated squad.",
        "The Argentine is on course to become the Blues’ new permanent head coach, replacing current interim boss Frank Lampard at the end of the season.Pochettino, it is understood, has identified a new goalkeeper, a central midfielder and a No 9 as the three positions he would ideally look to strengthen during the close season.The former Tottenham boss ideally wants to add players with Premier League pedigree.However, Pochettino will join Chelsea on the understanding that the club’s first concern will be to offload a number of players in order to make the squad more manageable for their new boss.",
        "There is also a will to reduce costs to ensure the club stay inside Financial Fair Play regulations.Departed head coach Graham Potter found huge difficulty in managing his overloaded squad due to strict rules concerning squad sizes in domestic and European football.A number of players have found themselves completely out in the cold on match-days, which has disrupted harmony.Chelsea’s squad is so oversized that the club have had to expand the changing areas at the club’s Cobham HQ.Pochettino believes the Blues squad is rich in potential but is keen to add experience into his ranks to supplement the wealth of young talent already at the club.",
        "Kepa Arrizabalaga has spent the majority of the season as Chelsea’s No 1 owing, in part, to Edouard Mendy’s injury problems.However, there remains doubt over Arrizabalaga’s long-term position as first-choice keeper, while Mendy is yet to agree a new contract.",
        "Pochettino also wants a long-term central midfield partner for club record signing Enzo Fernandez with doubts over N’Golo Kante and Mateo Kovacic’s futures.The lack of a central striker has been a major problem for Chelsea this season. The summer arrival of Pierre-Emerick Aubameyang has not worked out with the Gabon striker among the players the club will look to offload this summer.Romelu Lukaku is due to return from his loan spell at Inter Milan, but it remains to be seen whether he has a future under Pochettino.There is hope a deal for Pochettino to be confirmed as Chelsea’s new boss can be wrapped up by the end of the week, although Lampard - who secured his first win since returning to the club against Bournemouth on Saturday - is expected to remain in charge for the final four matches of the season."
    ]
}