{
    "articleURL": "/wires/reuters/article-12044939/Red-Sox-blow-past-Blue-Jays-run-winning-streak-5.html",
    "content": [
        "Triston Casas went 3-for-5 with game-tying singles in back-to-back innings and the Boston Red Sox went on to beat the Toronto Blue Jays 8-3 on Wednesday night.",
        "The Red Sox totaled 15 hits and scored in their last five innings en route to their fifth straight win and third in a row to begin the four-game series.Masataka Yoshida and Enmanuel Valdez had two hits and two RBI apiece for Boston.Red Sox starter Nick Pivetta (2-2) struck out six and allowed three runs on five hits over six innings.Pivetta and relievers Chris Martin, Kutter Crawford and Ryan Brasier combined to retire 15 of the Blue Jays' final 17 batters.Pivetta allowed solo home runs to Daulton Varsho and Vladimir Guerrero Jr., who each were 2-for-4 for Toronto. Alek Manoah (1-2) allowed five runs, two earned, on eight hits while striking out three in five innings.Toronto also committed four errors, and the Red Sox made two.The visitors opened the scoring when Varsho roped his fourth homer of the season into the bullpen in right field bullpen to begin the second. It was his second homer in as many games.Guerrero doubled Toronto's lead an inning later, socking a towering shot over the Green Monster and out of the ballpark.The Red Sox knotted the score as they strung together three straight hits and scored two runs in the fourth.The first hit was Rafael Devers' comebacker that deflected off the pitcher, and he went to second on a throwing error by catcher Alejandro Kirk. After a wild pitch moved him to third, Devers scored on Jarren Duran's one-out double to center.",
        "A failed pickoff allowed Duran to advance to third, setting up Casas for a line base hit to right to tie the game.In the fifth, Toronto jumped in front again as Kevin Kiermaier doubled and later scored on a balk by Pivetta. But in the bottom of the inning, Casas singled to again tie the game, and Enmanuel Valdez's single scored two more for a 5-3 lead. The hit came when his hard ground ball took a bad hop on Guerrero at first base.After Connor Wong greeted Toronto reliever Anthony Bass with a leadoff double in the sixth, Yoshida brought him home on another infield single that deflected off the pitcher, adding another insurance run.Boston capped the scoring with an RBI double by Yoshida in the seventh and Enrique Hernandez's run-scoring single in the eighth.Crawford exited with left hamstring tightness, according to the Boston Globe.--Field Level Media"
    ]
}