{
    "articleURL": "/wires/pa/article-12051685/Greens-win-sole-control-UK-council-time.html",
    "content": [
        "The Greens have won their first outright majority on a UK council in what it hopes cements a “coming of age” moment as a mainstream party.",
        "Mid Suffolk fell from a minority Conservative administration to sole control of the Greens as they made inroads elsewhere during the local election results on Friday.The left-wing environmentalists have controlled local authorities in minority and coalition administrations before, but this is the first time they will have outright control.With eight more results to be declared, the Greens’ victory was declared when they won 18 of the East Anglia council’s 34 seats.Green Party co-leader Adrian Ramsay told the PA news agency: “For the first time anywhere outside Australia we’ve seen the Greens take the majority control of a council.“It’s enormous because what we’ve seen over the last four sets of election since 2019 is the Green party really coming of age as a mainstream party in this country.”",
        "Mr Ramsay said the Greens have been part of around 20 local administrations in the past but capturing overall control is a “really significant” moment that “paves the way for success at the general election.”He said his party is picking votes from both Labour and the Conservatives across rural and urban areas.Caroline Lucas has been the party’s sole MP, but Mr Ramsay hopes to enter the Commons in the new Waveney Valley constituency, which includes much of Mid Suffolk.",
        "Carla Denyer, who shares the Green leadership, plans to run in Bristol Central, where she will change strong Labour support.But doing so would edge out another left-wing candidate, putting at risk Sir Keir Starmer’s chances of winning a general election.Mr Ramsay said: “Getting more greens elected will hold other parties’ feet to the fire and will raise the issues that need to be challenged in terms of the climate emergency but also cost of living and growing inequality.”The Greens were also behind the Conservatives losing overall control of East Hertfordshire, where no party won a majority. Seventeen Green candidates won spots on the council on Thursday’s votes.In Mid Suffolk, Mr Ramsay vowed to be responsive to local concerns and focus on housing which is currently “far too expensive for local people and outside their reach”.He said the Green-run council plans to advocate for more social housing and being tougher with developers on affordable housing."
    ]
}