{
    "articleURL": "/news/article-12043127/Amazons-credit-card-offering-150-gift-coupon-new-customers-apply.html",
    "content": [
        "Amazon has revamped its two credit cards and both now come with better perksThe Prime Visa is offering a $150 gift card to new customers - with no minimum spending requirement It comes after Dailymail.com analyzed the best cashback deals on the market Amazon has revamped its credit card and is offering a $150 gift coupon as a welcome bonus to new customers.  ",
        "The Amazon Prime Rewards Visa Signature Card has been rebranded the Prime Visa and will give new users the coupon automatically - with no minimum spending requirement. Previously the firm only offered a $100 gift card as a sign-up bonus.Its second card, the Amazon Rewards Visa Signature, has also been rebranded the Amazon Visa and will offer a less substantial $60 gift coupon upon approval.The deal comes after Dailymail.com revealed the seven top credit cards hoping to lure new custom in with lucrative cashback deals. ",
        "Both Amazon's cards - issued by JPMorgan Chase - have no annual fee and come with variable interest rate between 18.99 percent and 26.99 percent.The Prime Visa offers a competitive 5 percent cashback on Amazon and Whole Foods purchases which can be redeemed immediately after each transaction.The deal comes with a spending limit of $2,500 for the first three months.It means that customers could earn up to $125 cashback in three months - on top of the $150 gift card.But the Amazon Visa only offers 3 percent cashback on the same purchases.Both come with no foreign transaction fees and also offer 2 percent cashback at restaurants, gas stations and drug stores as well as local transport - including rideshare apps like Uber.  ",
        "Anybody is eligible to sign up for the Amazon Visa while the Prime Visa requires that customers have a Prime membership - which costs $139 a year.The deal is more competitive than most cashback offers available on the market which typically require customers spend a certain amount of money before they can qualify. ",
        "For example, the Chase Freedom Unlimited card offers new joiners a $200 sign-up bonus - but only after they spend $500 in the first three months after opening the account.Similarly the Citi Custom Cash Card also offers a $200 cashback bonus to new customers - providing they spend $1,500 in the first three months.Amazon has been steadily moving into the world of financial services, having launched its own insurance comparison website last year.It first started offering the Prime credit card in 2017 to capitalize on its growing number of subscribers. The move echoes a similar strategy to Apple which recently launched its first ever savings account with a 4.15 percent interest rate - more than ten times the rates offered by mainstream banks. The tech giant managed to attract more than $1 billion deposits in its first four days, sources said. "
    ]
}