{
    "articleURL": "/wires/pa/article-12055823/Duke-Sussex-returns-California-British-Airways-flight.html",
    "content": [
        "The Duke of Sussex has returned to California after catching a British Airways flight within hours of his father’s coronation.",
        "Harry arrived at Los Angeles International Airport (LAX) at around 7.30pm local time (3.30am UK) to reunite with his son on his birthday.Prince Archie turned four on Saturday and spent the day with his mother, the Duchess of Sussex, at their US home.British Airways flight attendants confirmed to the PA news agency that Harry had been on the flight but said they were not permitted to discuss the details of his trip.",
        "The duke’s appearance at the coronation marked his first public appearance alongside the royals since he lambasted his family in his controversial memoir Spare.He was seated in the third row for the crowning of Charles and the duke’s stepmother the Queen in Westminster Abbey, and was placed two rows behind his brother the Prince of Wales.Harry chatted to his cousin Princess Beatrice and her husband Edoardo Mapelli Mozzi as he entered the church on Saturday in the drizzling UK rain.He also nodded and smiled to guests as he processed behind them, walking down the nave of the abbey alone.",
        "It is understood the duke wore what he was asked to wear, which consisted of a dark morning suit and tie, his Afghanistan and Jubilee medals pinned to his suit jacket, and a Royal Victorian Order star and neck decoration.",
        "During the service, as the congregation paid homage to the King, Harry was seen, along with the other royals around him, speaking the words: “God save King Charles. Long live King Charles. May the King live forever.”His abrupt return to the US meant he did not appear on the Buckingham Palace balcony for the finale of the day, with the Palace confirming earlier that he had no formal role at the event.Also absent from the balcony was the Duke of York, who has stepped away from public life after a controversial Newsnight interview in November 2019 and the furore over his friendship with paedophile financier Jeffrey Epstein."
    ]
}