{
    "articleURL": "/sport/mlb/article-12041997/Scandalized-pitcher-Trevor-Bauer-wins-Yokohama-DeNA-Baystars-debut-pro-game-22-months.html",
    "content": [
        "Trevor Bauer fanned nine batters and gave up one run in seven innings to win Bauer was released from the Los Angeles Dodgers after sexual assault claims DailyMail.com provides all the latest international sports news In his first official professional baseball game in just over 22 months, the scandal-ridden Trevor Bauer delivered a dominant start to his Nippon Professional Baseball career leading the Yokohama DeNA Baystars to a 4-1 win over the Hiroshima Carp.",
        " It was Bauer's first official game after the Los Angeles Dodgers released him earlier this year following claims of sexual assault and domestic violence. The pitcher received plenty of pomp and celebration at his arrival when he was announced by the team.Bauer, scattered seven hits in 7 innings, allowed one run, struck out 9 and threw 98 pitches in a 4-1 victory against the Hiroshima Carp before 33,202, which the team said was a record.The highlight might have been Bauer's batting.Pitchers still bat in Japan's Central League, where the DH is not used. Bauer grounded out once and put down a perfect sacrifice bunt in the fifth, which led to Yokohama's go-ahead run. He also struck out.",
        "The only blemish was a a bases-empty home run in the second to fellow American Matt Davidson, who played with Bauer with the Cincinnati Reds in 2020.'My ex-teammate got me,' Bauer said. 'I don't know how far it went. I talked to him before his next at-bat and I said: \"Why do you have to do that to me?\"'Bauer´s first game has been long awaited in Yokohama, which has not won the Japanese season championship since 1998. Bauer is expected to deliver with the team now leading the Central League.",
        "Osaka club Orix leads the Pacific League.'I felt great,' Bauer said. 'I just felt normal, the body felt good: command, velocity, results. All good. It was a great day.'He even tried a few words of Japanese, addressing the fans after the game. Roughly translated he said: 'I win in Yokohama.'Fans applauded and understood immediately. He said teammates were teaching him.'I have to make sure they´re not telling me to say something wrong,' he said.",
        "Bauer was asked by Japanese reporters what he was thinking about just before the game. His reply suggested he was feeling some pressure.'My nose started bleeding,' he said. 'That´s what was on my mind coming to the field.'Yokohama signed Bauer for a reported $4 million, and he also gets millions more in termination pay from the Dodgers.Billboards all over town announced his arrival, including a seven-story poster that went up Wednesday on the side of a Yokohama department store.Bauer arrives with a baseball pedigree as the 2020 Cy Young Award winner, and also claims of sexual assault and domestic violence that have kept him out of playing in the majors for almost two years.Bauer was released by the Los Angeles Dodgers this year after an arbitrator reduced his 324-game suspension to 194 games for violating the domestic violence and sexual assault policy of MLB and the players' association.",
        "MLB Commissioner Rob Manfred suspended Bauer in April of last year after a San Diego woman said he beat and sexually abused her in 2021. Bauer disputed her claims and said everything that happened between them was consensual.He was never charged with a crime and a California judge found the woman's claims 'materially misleading.'Bauer could have joined any MLB team for this season, but no teams wanted him - or if they did, they didn't sign him.Bauer, as he has before, lauded the atmosphere at Japanese stadiums, where there is a constant din of chants, songs and drums beating with fans always participating.'The atmosphere in the U.S. doesn't compare to here at all,' Bauer said. 'The only time it comes anywhere close is sometimes in playoff baseball. I played in a World Series in 2016 and the Cleveland stadium was very loud. But the sustained energy here is just so much different.'His debut came after three appearances with Yokohama's farm clubs, where he had 17 strikeouts in 16 innings with a 2.25 ERA.",
        "Japanese fans have welcomed him, women have not organized to protest his presence, and he's being given the benefit of the doubt For his part, he's talking up every aspect of playing in Japan.",
        "'I just want to win,' Bauer said. 'I want to contribute to that. I want to pitch well. I want to entertain the fans.'Yokohama fan Shohei Horikawa stood inside Yokohama's stadium and summed up what many Japanese feel.'I know he had some issues in the past, but he was not convicted,' Horikawa said, wearing a Bauer No. 96 jersey. 'I want him to reset himself in Japan without any prejudice and to do his best.'"
    ]
}