{
    "articleURL": "/wires/ap/article-12047511/Average-long-term-US-mortgage-rate-slips-6-39-week.html",
    "content": [
        "LOS ANGELES (AP) - The average long-term U.S. mortgage rate edged lower this week, a modest boost for homebuyers looking for relief as a stubbornly low inventory of properties for sale fuels bidding wars in many markets.",
        "The average rate on the benchmark 30-year fixed-rate home loan fell to 6.39% from 6.43% last week, mortgage buyer Freddie Mac said Thursday. A year ago, it averaged 5.27%. The average rate fell for five straight weeks before rising the last two weeks of April.This week's drop in mortgage rates is welcome news for prospective homebuyers, many of whom have been pushed to the sidelines during the past year as the Federal Reserve cranked up its main borrowing rate in a bid to tamp down persistent, four-decade high inflation.All told, the Fed has raised its benchmark rate 10 times since March 2022, including an increase this week that pushed it to 5.1%, the highest since 2007, from virtually zero early last year.Shifts in the Fed´s short-term lending rate don´t directly affect mortgage rates, but they do influence the yield on 10-year Treasury bonds, which lenders use as a guide to pricing home loans. That´s because higher rates push bonds prices lower, which then causes their yield to go up. Investors´ expectations for future inflation and global demand for U.S. Treasurys also influence mortgage rates.The average rate on a 30-year mortgage reached a two-decade high of 7.08% last fall after months of Fed rate hikes and stubbornly high inflation. So far this year, it has averaged around 6.36%.",
        "Higher rates can add hundreds of dollars a month in costs for homebuyers on top of already high home prices. The combination, along with a near-historic low level of homes for sale, has led to a lackluster spring homebuying season.Sales of previously occupied U.S. homes fell 2.4% from February to March and were down 22% from a year earlier, according to the National Association of Realtors.\"Interested homebuyers are acclimating to the current rate environment, but the lack of inventory remains a primary obstacle to affordability,\" said Sam Khater, Freddie Mac´s chief economist.The average rate on 15-year fixed-rate mortgages, popular with those refinancing their homes, rose this week to 5.76% from 5.71% a week earlier."
    ]
}