{
    "articleURL": "/tvshowbiz/article-12044059/Farmer-Wants-Wife-viewers-notice-odd-Andrew-Claire-quit-show.html",
    "content": [
        "They quit Farmer Wants a Wife early on Sunday to begin a real-life relationship.",
        "But before making the decision to leave the series as a couple, farmer Andrew Coleman and Claire Saunders declared their love for one another on camera.However, there was a detail about this emotional conversation that some viewers found 'odd' - namely that Andrew and Claire seemed to be avoiding eye contact.The pair did not look each other in the eye despite speaking candidly about their feelings, prompting some fans to wonder if there was something else going on.'I have told my granddaughters that if you're talking to someone, look at them and make eye contact with them. Not rocket science,' one viewer wrote.",
        "'But he's a grown man and he doesn't look her in the eye,' they added.'I love Claire. Not sure on the no eye contact though,' another fan said, while a third viewer wrote: 'Eye contact, girl. You got this!' One fan wondered if the two were 'maybe nervous around the camera?'Andrew said on Thursday they were not deliberately avoiding eye contact, but acknowledged they were both nervous having such a private moment play out in front of the cameras.",
        "'I'm not aware of any avoiding eye contact,' he told 7Life.'From my point of view, I was deep in thought - there's no doubt about that.'There's probably nerves there, too, but I certainly felt it all went well that evening and I certainly got the response I was hoping to get.'",
        "The couple now live together on his NSW farm, after Claire moved interstate for him.Andrew professed his love for the Tasmanian mine truck driver in touching scenes that aired on Sunday night's episode.'I'm falling in love with you,' he admitted as the pair sat on a garden chair together.Claire went on to reveal she felt the same way and was 'very happy' the pair had found each other on the show.",
        "'I'm definitely falling in love with you too, I didn't expect any of this to happen. I'm pretty chuffed,' she said.Andrew said on Monday the two had already discussed starting a family together. 'We're approaching it with the mindset of, \"Let's enjoy one another first for a period of time and make memories of our own and if things keep evolving in a positive manner, then that'll come,\"' he told Woman's Day.  "
    ]
}