{
    "articleURL": "/tvshowbiz/article-12057775/Shakira-accepts-Billboards-Woman-Year-award-Latin-Women-Music-gala.html",
    "content": [
        "Shakira emotionally discussed relationships after her painful split from Gerard Pique as she was recognized as Billboard's Woman Of The Year at the inaugural Women in Latin Music gala on Saturday.",
        "The 46-year-old singer-songwriter - who recently underwent a difficult split from her ex Pique last year - led the stars at the event celebrating the success of Latinas and gave a speech that made headlines at the Watsco Center in Miami. Speaking about her opinion on relationships, she said: ''It doesn't matter so much if someone is faithful or not; what really matters is if you continue to be faithful to yourself.' She ended her speech by saying that her music helped her get through difficult times in life.She said, 'When I felt most lost, it was music that put me on the path back to myself.' ",
        "Pique was beset by cheating rumors after his split from Shakira - and has now sparked up a new romance with Clara Chia.Shakira added, 'There comes a time in every woman's life when she no longer depends on someone to love or accept herself as she is.'The search for the other is replaced by the search for oneself when the desire to be perfect is replaced by the desire to be authentic,' she said.Shakira spoke to women everywhere, saying as a group, 'Women are much stronger than we think.'",
        "She continued, 'We are braver than we think we are. I think we are also more independent than we were taught to be.",
        "'What woman hasn't gone through the experience of looking for attention, affection, or approval from others and forgotten about herself? It has happened to me,' she saidThe inaugural Latin Women in Music gala will air on Telemundo on Sunday, May 7.The upcoming two-hour special, also known as Mujeres Latinas in la Música, celebrates 'Latin female artists, executives, and creatives proactively working for positive change, inclusion, and gender parity in the music industry,' according to Billboard.The accomplished singer has been in the music industry since her teens, with 11 studio albums under her belt and multiple Latin Grammys as well.",
        "Her achievements in 2023 include her track Shakira: BZRP Music Sessions #53 debuting at the ninth spot on Billboard's Hot 100 Chart. It marked the first time a woman had landed in the top 10 of the chart with a Spanish language track.Shakira is not just one of the best-selling musical artists of all time but the number-one-selling female Latin artist ever, according to Billboard.The honor comes after Shakira split from her long-time partner, retired professional footballer Pique after 11 years together. The Columbian beauty acknowledged there is a high level of interest in her own life but requested that her two sons, Milan and Sasha, be allowed to live a 'healthy and happy life'.",
        "In a lengthy Instagram post written in Spanish, the singer asked the media to respect her privacy so her sons, aged 10 and eight, can live their lives in peace without the 'constant scrutiny of cameras.'Shakira reportedly quit her beloved Barcelona for good after being served an 'eviction notice' by her ex Gerard’s father.Spanish media reported it came after she received a demand for her and her parents to abandon the ex-couple’s former family home.",
        "It is the same flat where Shakira is said to have set up a witch doll on her balcony, which faces her mother-in-law’s home.Both El Periodico and La Vanguardia have reported Shakira was told in March she had until this month to leave the mansion in Esplugues de Llobregat where she has lived since she split from ex-footballer Gerard last year or face a 'compensation' payment.It was reported the demand came by email signed by Gerard’s dad, Joan Piqué, who is thought to be the sole director of his son’s holding company, Kerad Holding.El Periodico reported in reference to the house move demand: 'Now we understand the photos of the singer crying.'In an Instagram statement in both English and Spanish about how she was leaving Barcelona, Shakira said: 'I settled in Barcelona to give my children a stability, the same we are now looking for in another corner of the world next to family, friends and the sea.",
        "Shakira and Gerard split after a 12-year relationship, and the 36-year-old former footballer recently revealed he has listened to Shakira’s so-called 'diss track' that appears to mock him and his new 23-year-old girlfriend Clara Chia.The singer released the tune Bzrp Music Sessions, Vol. 53 which she has said was a cathartic way of expelling her pain over their split.Gerard said in an interview with Barcelona-based radio station RAC1: 'Yes, obviously (I’ve listened to it),' but added he didn’t want to comment further, saying: 'I don’t want to talk about it – I don’t think I should talk about it.'The ex-footballer stressed that all he wants is for his kids to be happy saying, 'We have a responsibility, those of us who are parents must protect our children. Everyone makes their own decisions. I don’t feel like talking anymore. I just want my children to be well... I’ve always had a close relationship with my children.'"
    ]
}