{
    "articleURL": "/wires/reuters/article-12060721/CANADA-FX-DEBT-CAD-steadies-near-3-week-high-rate-spreads-underpin-currency.html",
    "content": [
        "Loonie touches a three-week high at 1.3316",
        "Price of U.S. oil settles 2.6% higherCanadian bond yields rise across curveBy Fergal SmithTORONTO, May 8 (Reuters) - The Canadian dollar was little changed against its U.S. counterpart on Monday, with the currency holding near an earlier three-week high supported by higher oil prices and recent narrowing in the gap between U.S. and Canadian bond yields.The loonie was trading nearly unchanged at 1.3370 to the greenback, or 74.79 U.S. cents, after touching its strongest intraday level since April 14 at 1.3316.\"The strength in the (Canadian) dollar is really driven to a large extent by narrowing interest rate spreads,\" said Benjamin Reitzes, Canadian rates &amp;amp; macro strategist at BMO Capital Markets. \"The rebound in oil prices hasn't hurt either but the rate story is probably the bigger one.\"The gap between Canada's 2-year yield and its U.S. equivalent has narrowed to 24 basis points in favor of the U.S. bond from as much as 76 basis points in March as confidence rose that the Federal Reserve is nearing a pause in its interest rate hiking campaign.Oil, one of Canada's major exports, clawed back some recent losses for a second straight day, settling 2.6% higher at $73.16 a barrel, as U.S. recession fears eased.Still, speculators have raised their bearish bets on the Canadian dollar, data from the U.S. Commodity Futures Trading Commission showed on Friday. As of May 2, net short positions had increased to 50,096 contracts from 43,791 in the prior week.",
        "Meanwhile, the Bank of Canada has launched public consultations on the features that could be included in a digital Canadian dollar, in an exploratory move to gauge the viability of a digital version of the currency.Canadian government bond yields were higher across the curve, tracking moves in U.S. Treasuries. The 10-year touched its highest level since April 20 at 2.998% before dipping to 2.957%, up 4.1 basis points on the day. (Reporting by Fergal Smith; Editing by Andrea Ricci)"
    ]
}