{
    "articleURL": "/tvshowbiz/article-12058795/Bebe-Rexha-displays-figure-plunging-swimsuit-detailing-weight-gain-battle.html",
    "content": [
        "Bebe Rexha displayed her figure in a plunging black swimsuit on Sunday - after detailing her weight-gain battle following her PCOS diagnosis.",
        "The singer, 33, took to Instagram to pout for a mirror selfie in the racy ensemble, which also featured a silver clasp at the waist.Bebe flaunted her stunning shape in the Dolce and Gabbana number as she relaxed on holiday.The musician also shared a snap of herself by the pool in a gorgeous cream figure-hugging dress, preparing for an evening out.Another image showed Bebe in a pretty patterned blue outfit while waiting for food by the beach. ",
        "It comes after Bebe revealed she has been struggling with weight gain after being diagnosed with polycystic ovary syndrome.The hitmaker opened up about her hormone imbalance on the Gayle King SiriusXM show, explaining that the condition can cause symptoms like ovarian cysts, irregular periods, acne, excess hair growth, infertility, and weight gain.'I definitely struggle with my weight, and I struggle with the way that I look, and it's been tough for me. 'I just found out recently that I have PCOS, and a lot of women have it. And a lot of women have it and don't know,' said Bebe. The three-time Grammy nominee explained that the side effect of weight gain has been hard for her to deal with as an entertainer.'It's tough. I think for me, I've been definitely struggling with my weight, and I've been struggling with food forever,' she said.",
        "Rexha recalled that upon signing her first record deal, she was told by her label, \"Are you ready to get into boot camp shape? Because you need to lose 20lbs in order to do this career, like you have to lose weight.\"After years of being overly pressured about her weight, she has learned the importance of controlling the people she keeps close to her.",
        "PCOS stands for polycystic ovary syndrome.PCOS is a hormonal disorder causing enlarged ovaries with small cysts on the outer edges.Women with PCOS may have infrequent or prolonged menstrual periods or excess male hormone (androgen) levels. Symptoms include menstrual irregularity, excess hair growth, acne, and obesity.Fertility may also be affected.While the exact cause of PCOS isn't known, insulin resistance caused by a highly refined and processed diet is believed to be one of the biggest triggers.PCOS can be managed through diet, the contraceptive pill and other oral medications.Source: Mayo Clinic ",
        "The singer opened up about her fluctuating weight last month when she discussed feeling 'discouraged' after discovering she was trending on TikTok under the topic 'Bebe Rexha weight.'The Brooklyn-born Albanian star tweeted, 'Seeing that search bar is so upsetting. I'm not mad cause it's true. I did gain weight. But it just sucks. Thank you to all the people who love me no matter what.'",
        "Bebe (born Bleta) admitted: 'I've always struggled with my weight. A bi*** likes to eat. I'm working on myself everyday. Just discouraged a bit right now.' When Twitter user @SugaRboo2054 pointed out that her image was illegally used for a 'fat to flat' VLCC weight loss program advertisement on PornHub, the Call On Me singer responded: 'That's just messed up.'As far back as June 2021, Bebe has promoted the movement to 'normalise 165lbs' before tearfully confessing six months later she was the 'heaviest I have ever been' and felt 'disgusting in my own body.''I weighed myself just now and I don't feel comfortable sharing the weight because I feel embarrassed,' she admitted on TikTok.'I don't feel good in my skin, and when I don't feel good, I don't want to post. And that's really honestly the reason I haven't been posting in the last year or so as much as I used to.'I think all the body positivity that stems from me is probably a place of hurt and confusion of like, I don't know how to help myself anymore or how to love myself.'"
    ]
}