{
    "articleURL": "/wires/reuters/article-12051831/Mexican-president-says-migrant-flows-wont-increase-U-S-border-policy-change.html",
    "content": [
        "MEXICO CITY, May 5 (Reuters) - Mexican President Andres Manuel Lopez Obrador does not foresee a jump in migrant flows once U.S. border restrictions are lifted next week, contrary to U.S. officials who are preparing for the possibility of a spike in illegal border crossings.",
        "The border policy known as Title 42, which allows U.S. authorities to rapidly expel migrants to Mexico without the chance to seek asylum, is due to expire on May 11.U.S. officials have been preparing for the possible arrival of tens of thousands more migrants at the U.S.-Mexico border once those restrictions end. A top U.S. border official estimated that migrant crossings could jump to 10,000 per day after May 11, nearly double the daily average in March.Lopez Obrador said on Friday his government is working to inform migrants about U.S. permits and visas they can request from their home countries, noting that he expected those programs to keep the numbers of migrants at the U.S.-Mexico border from growing.\"We think migrant flows will not increase, because another option, an alternative, is opening up,\" Lopez Obrador told his regular daily news conference.A U.S. program that started this year allows up to 360,000 Venezuelans, Haitians, Cubans and Nicaraguans to request humanitarian parole from their home countries.As well, in recent days the U.S. has said it will accept some 100,000 people from El Salvador, Guatemala and Honduras under an expanded family reunification program, and open centers in Guatemala and Colombia for migrants to apply for refugee resettlement and other forms of entry.",
        "Mexican Foreign Minister Marcelo Ebrard said the news of Title 42 ending has already reached migrants via smugglers who are charging up to $7,000 with offers to bring migrants into the U.S. once the policy ends. (Reporting by Valentine Hilaire and Raul Cortes; Editing by Daina Beth Solomon and Sandra Maler)"
    ]
}