{
    "articleURL": "/tvshowbiz/article-12055327/Madonna-fighting-form-gloves-help-boyfriend-Josh-Popper.html",
    "content": [
        "Madonna took to social media in fighting form Saturday.",
        "The superstar, 64, who has hinted that a biopic about her life might be back on, welcomed in the weekend suited up for the ring.'Let's wrap this week up' she penned a cross a photo of herself throwing a punch in her Instagram Stories. The singer was dressed in a pair of black boxing shorts with white trim.She showed off her taut abs wearing a white mesh shirt with a black bra top beneath. ",
        "The Holiday artist accessorized with an 'M' pendant attached to a black choker.Her long red hair was styled in long, loose waves.The hitmaker added a black lace bustier as her boyfriend, 29-year-old Josh Popper, helped her wrap her hands in bandages before putting them into her gloves. The boxing instructor was dressed casually in a white T-shirt and a pair of dark blue joggers. He wore a billed cap backwards over his dark hair and sported a closely trimmed goatee. While the Material Girl waits to learn if her biopic will get the greenlight, a biography based on her life is headed to store shelves later this year. Madonna: A Rebel Life by Mary Gabriel will be published in October. The tome is said to explore not only the Ray of Light singer's  career, but her contribution to modern feminism and the LGBTQIA+ movement.",
        "In a statement released to The Bookseller, the author wrote, 'If Madonna’s story were to be reduced to one word it would be power.  She represents the power of a woman without fear.'",
        "Continuing, 'The Madonna I found during five years of research and writing is fierce — in her work, in her life, in her passions. Norman Mailer called her \"our greatest living female artist.\"''I would add that she is one of the most significant figures of modern times.'Madonna has been furiously preparing for her upcoming The Celebration tour which kicks off in July at a sold out show in Vancouver. She will share her hits from  her four decades as a superstar as she and her troupe crisscross the globe.    "
    ]
}