{
    "articleURL": "/sport/othersports/article-12058463/Aussie-Olympic-icon-Vicki-Roycroft-friend-saved-life-dead-11-minutes.html",
    "content": [
        "Vicki Roycroft was dead for 11 minutesAussie Olympian suffered a burst aortaLuckily a vet was close at time of incidentOlympic equestrian legend Vicki Roycroft has sensationally revealed that she was dead for 11 minutes after suffering a burst aorta at the Sydney Royal Easter Show last month.",
        "The 70-year-old three-time Olympian was readying herself for a show jumping competition when she suddenly collapsed and went into cardiac arrest. Roycroft received CPR at the scene before being rushed to hospital for a life-saving eight-hour operation to fix the tear in her aorta, which is the main artery that carries blood from the heart to the rest of the body.Roycroft, who was hospitalised for three weeks, has paid tribute to doctor and vet Mark Schembri, who was having lunch in a nearby restaurant when the incident happened.Dr Schembri got the phone call and sprinted to the scene to aid Roycroft, who was 'unresponsive and pale' when he arrived. ",
        "'I believe I was dead for 11 minutes. And trust me, there's nothing there,' she told the ABC.'There were no bright lights or angels singing or anything like that. Sorry to offend any religious people. They brought me back and all was good. Here I am.'Mark Schembri, who got to me early enough, did the cardio stuff and kept enough of the blood circulating in my brain that I didn't become a vegetable because, as I said, I was a bit dead there for a while.'Roycroft knows she was incredibly lucky that the incident didn't happen while she was riding on her property.",
        "'I think it would've been the end,' she admitted.'They tell me [there's a] less than three per cent [chance of survival from a burst aorta].'It's lucky the right people were around at the right time. It's lucky I'm reasonably fit.'I still want to be around to annoy people.'",
        "Dr Schembri, who first met the Olympian when he was a veterinary student, was happy that he could be of assistance.'Vicki looked dead. It was that shocking moment when you realise this patient needs CPR now, so we got to work straight away,' he said.'She was completely unresponsive and pale.''She's a wonderful competitor at the Sydney Royal Easter Show, a renowned Olympian, and just a wonderful person,' he said.'So, to be part of that story is very special to me.'Roycroft, who will be away from the sport for some time, has returned to her home on the NSW central coast.'I hope to get back to a reasonably normal life,' she said.'I have to be careful I don't do any damage in the meantime ... the main thing now is don't do anything dumb, let it all heal, and we'll go from there.'Roycroft represented Australia at three Olympics and three World Championships.She was named Australian Champion on three occasions - in 1983 for three-day eventing and for show jumping in 1996 and 2005.",
        "Roycroft was among the first people to receive the Australian Sports Medal, in 2000, which is awarded by the Governor-General in recognition of Australian sporting achievements."
    ]
}