{
    "articleURL": "/money/investing/article-12054051/MIDAS-SHARE-TIPS-Investment-turn-Zinc-gold.html",
    "content": [
        "The Beechgrove Garden is not just one of the UK's best-loved TV gardening programmes, it's also a personal favourite of King Charles. This weekend, viewers across the country can tune in, as Aberdeen-based Beechgrove plants the King's favourite blooms, delphiniums, in honour of the Coronation.",
        "Beechgrove is produced by Tern TV, a subsidiary of Aim-listed Zinc Media. The company makes dozens of top-rated programmes and the shares, at 83p, should go far.Zinc is headed by Mark Browning, a media veteran known for taking troubled businesses and turning them around. Browning helped Heart Radio to become London's most popular radio station and a leading force in the country today. He moved on to ITN, turning it from a news producer for ITV, Channel 4 and Channel 5 into a broad-based media production business.",
        "Now he is engaged in a similar exercise at Zinc. Originally the brainchild of Bob Geldof, under the name Ten Alps, the business was renamed Zinc Media back in 2016. It evolved into a TV production company, but the transition was tricky and Browning was appointed in 2019 to fix it.Early progress was hindered by the Covid-19 pandemic and subsequent challenges but Zinc is now in full growth mode. Turnover rose 72 per cent to £30.1million in 2022 and the company made a small underlying profit of £100,000. Further gains are predicted, especially as the group has already secured more than £25million of revenues so far this year, with considerably more in the pipeline.The surge in sales reflects a change in strategy, initiated by Browning shortly after he joined. In the past, Zinc focused on documentaries. While these were often well regarded, they were mostly one-off commissions so sales and profits could be unpredictable from one year to the next.",
        "Now, the group has expanded its remit to cover any kind of factual entertainment. Documentaries are still integral to the business, with high-profile programmes including Putin vs The West, Afghanistan: Getting Out and Tom Daley's Illegal To Be Me. But Zinc makes long-running series too from Beechgrove Garden to Bargain Loving Brits to Sunday Morning Live.Most programmes are made for the BBC, ITV and Channels 4 and 5, as these still account for the majority of TV commissions in the UK. But Sky is a big client too, alongside American broadcasting giants, such as Netflix, Disney+ and Discovery.Following some astute acquisitions, Browning has added several new customers to his client list – organisations that want to use films and videos to promote what they do, train staff or simply raise their profile.Drinks group Red Bull commissioned Feeling Supersonic: Felix Baumgartner to commemorate the Austrian skydiver's extraordinary space jump in 2012. Lego City Stuntz brings a Lego range to life. Saving Lives At Sea charts the work of the Royal National Lifeboat Institution.Some companies fund major TV productions too, such as Best Laid Plans, developed with the insurer Hiscox. And there are podcasts in the mix as well, including Cunningcast by former Baldrick actor, Tony Robinson. Not that long ago, TV production firms turned their noses up at commissions from anyone other than mainstream broadcasters. ",
        "Today, the lines are far more blurred, with big TV channels, businesses, streaming services and governments all keen to make distinctive films and distribute them on any kind of screen, from TV sets to mobile phones.Browning believes that success for Zinc lies in appealing to anyone in search of a high-quality production outfit that can turn facts and feats into compelling stories.  The opportunity is certainly vast. In the UK TV market alone, around £1billion a year is spent on factual programmes, with company-funded films taking the total considerably higher. If Zinc can capture even a fraction of that market, revenues and profits should rocket.Browning is also keen to start paying dividends, as the business becomes more established.Midas verdict: Zinc Media shares were nudging £3 before the pandemic and economic uncertainty sent them tumbling to just 83p. Mark Browning is determined to reverse that trend and recent results suggest he is on the right path. The Hollywood screenwriters' strike could help the business too, as US networks look beyond California for new commissions. Buy now and watch the shares move forward.Traded on: AIM Ticker: ZIN Contact: zincmedia.com or 020 7539 2000",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}