{
    "articleURL": "/tvshowbiz/article-12057075/Michael-Keaton-walks-hand-hand-grandson-Lakers-Warriors-match-Los-Angeles.html",
    "content": [
        "Michael Keaton had a very special date for Saturday's match up between the LA  Lakers and the Golden State Warriors in Los Angeles.",
        "The actor, who is reprising his Batman character for the upcoming film The Flash, brought along his grandson, River, to the game. The 71-year-old star kept his look low key, wearing beige jeans, a white T-shirt and a navy blue sweater.The Emmy winner stepped out in comfortable looking sneakers.",
        "He wore a blue and white billed hat and dark aviator sunglasses as he held the boy's hand while they headed into the Crypto.com Arena. River looked adorable wearing a yellow Lakers T-shirt with a purple number 3 on it. The grade schooler looked sweet in gray joggers and sneakers.  'You wanna get nuts? Let's get nuts,' the actor says as an aging but still tough Bruce Wayne/Batman in a trailer for The Flash.Michael is reprising the role some three decades after he last appeared as the caped crusader.Stepping back into the character was emotional for the versatile star, according to The Flash director Andy Muschietti.'When he arrived to the set, the Batcave was already finished and it was lit and everything,' the director told Variety.'He stayed like this [eyes wide] for a while. I didn’t want to interrupt him. I just wanted for him to take it in. Who knows what was going on there? But something was going on there.'",
        "The proud grandpa even asked the director to take a photo of him in the bat suit for  River.'It was funny because at one point during the scene where we shot him in the full suit, he was like, \"Can you take a picture? It’s for my grandson,” Muschietti said.'It was one of those moments where he really showed something was inside that was very emotional.'Ben Affleck, 50, will also appear as Batman/Bruce Wayne in this epic adventure that crosses the multiverse. 'I did finally figure out how to play that character [Batman], and I nailed it in The Flash' the Oscar winner told The Hollywood Reporter. 'For the five minutes I’m there, it’s really great. A lot of it’s just tone. You’ve got to figure out, what’s your version of the person? Who is the guy that fits what you can do?' ",
        "Sasha Calle, 27, stars as Supergirl in The Flash and will take center stage in the upcoming Supergirl film which is currently listed as being in development. Ezra Miller 30, stars at the title character. The actor who announced they were seeking treatment for 'complex mental health issues' after running into legal problems last summer has been keeping a low profile since then. The Flash screened at the recent Cinemacon last month, receiving glowing reviews from fans. ",
        "The Flash opens in theaters June 16."
    ]
}