{
    "articleURL": "/tvshowbiz/article-12052513/Amber-Heard-seen-daughter-Oonagh-friend-stroll-new-home-Spain.html",
    "content": [
        "Amber Heard was seen settling into her new Spanish home recently as she took a walk around Madrid with her young daughter and a friend.",
        "The 37-year-old actress was spotted chatting with a friend and also seemingly making a phone call while walking down a city street late last week.She also brought along an apparent caretaker who pusher her daughter Oonagh, two, in a seated scooter.DailyMail.com exclusively reported on Thursday that Amber has retreated from the US and the hustle and bustle of Hollywood in the wake of her ex-husband Johnny Depp's mostly successful defamation trial against her in Virginia last year.Now she has set up camp in a home just outside Madrid with her daughter, but it's unclear when she will attempt to make her wake back to Hollywood and to restart her acting career.",
        "Amber was dressed casually for her outing in a simple white top, which she wore without a bra.She contrasted it with a textured black midi skirt and black open-toe shoes with thick heels.She appeared to wear modest makeup and kept her blond locks tied up in a casual bun.In addition to a black handbag, she kept her phone on a strap around her torso, and she held it up as if making a call while walking with her companions.Little Oonagh looked adorable in a white shirt with multicolored horizontal stripes, along with blue overalls that had started to fall down around her arms.",
        "Amber was also seen chatting with a pal in a black tank top and a brown plaid skirt with black combat boots, while another woman in a black top and dark jeans appeared to be minding Oonagh and pushing her stroller.Despite relocating across the world, Amber seems to be enjoying the slower pace in the Spanish capital.'She’s bilingual in Spanish and is happy there, raising her daughter away from all the noise,' a friend of the actress told DailyMail.com.She doesn't appear to have completely sworn off acting, but she also isn't in a hurry to get back to working on set. ‘I don’t think she is in any hurry to return to work or to Hollywood, but she will probably come back when the time is right for the right project,' the friend added.",
        "Her sojourn may be somewhat extended though, as she sold her home in Yucca Valley, California, in July of 2022 for a pretty profit.One of Amber's two shot but unreleased projects was the upcoming superhero film Aquaman And The Lost Kingdom, which will be released in December of this year.For months, it was unknown if Amber would return for the film, or if she would be cut from it over the controversy related to her legal battles with her ex Johnny Depp.",
        "She was seemingly vindicated in the UK after Depp lost a defamation suit against The Sun for publishing her allegations of his domestic abuse.The judge overseeing the case determined that Depp had assaulted Heard in a majority of the instances described by the publication. But she suffered a shocking reversal of fortune back in the US after she published an op-ed in the Washington Post referencing her history of being a victim of domestic abuse, which did not name Depp, but was widely interpreted as being about her ex-husband.This time, Depp sued her directly for defamation, and the case was decided by an unsequestered jury, rather than a judge.The jury found that Heard's statements in the op-ed were defamatory, but, confusingly, also determined that Depp's lawyer had defamed Heard. She was ordered to pay $10.35 million to her ex-husband, while he was forced to pay her $2 million for his attorney's defamatory statement.After Heard was unable to pay the initial judgment, they eventually reached a settlement by which her insurer would pay Depp just $1 million.",
        "Although both essentially were vindicated in different trials, Amber has been seemingly shunned from Hollywood, while Depp has engaged on the comeback trail. He is set to star in the upcoming French film Jeanne du Barry, directed by Maïwenn, and he will also direct a film about the painter Amedeo Modigliani.",
        "In May of 2022, Depp received the support of his friend, the guitar virtuoso Jeff Beck, and the two recorded and album and went out on tour together.Beck died in January from a bacterial meningitis infection. "
    ]
}