{
    "articleURL": "/wires/pa/article-12046065/Dangerous-electrical-goods-remained-sale-Facebook-alerts.html",
    "content": [
        "Dangerous electrical goods remained on sale via Meta’s Facebook Marketplace more than two months after the company was alerted to their existence, a charity has warned.",
        "Electrical Safety First flagged 10 products to Meta on February 28 after it identified them as posing a risk of electric shock and fire following a wider scale investigation.Amazon Marketplace, eBay, Wish.com and AliExpress all responded to the charity’s alerts and swiftly removed the listings. Meta has distinguished itself from other online platforms for all the wrong reasons  Lesley Rudd, Electrical Safety First  Electrical Safety First reviewed the status of the 10 listings on Facebook Marketplace on April 24.It found four were no longer active, with links leading to a page stating that the listing “may have expired or been sold”. However six listings remained active.Among them were an e-scooter charger with an illegal UK plug lacking a fuse, and a pair of hair straighteners being sold with an EU plug and non-compliant UK travel adaptor.",
        "Both were deemed unsafe to use.All listings were finally removed by Thursday morning.Electrical Safety First chief executive Lesley Rudd said: “Meta has failed to act when presented with our evidence, leaving their shoppers exposed to avoidable harm.“In doing so Meta has distinguished itself from other online platforms for all the wrong reasons.”Ms Rudd added: “The Government’s product safety review is more than a year late and this inaction from Meta is clear evidence that we cannot rely on the goodwill of online platforms to protect shoppers.",
        "“The Government must urgently publish its review – in not doing so, it is allowing consumers to be put at risk.“Laws are urgently required to force online marketplaces to take reasonable steps to ensure products on their platforms are safe.”The Department for Business and Trade confirmed that its Office for Product Safety and Standards asked Meta to de-list the items on April 20.A DBT spokeswoman said: “We are holding businesses to their legal obligations, including online marketplaces, to keep the public safe.“Working with local Trading Standards, the Office for Product Safety and Standards is taking action to ensure that any products that pose a serious risk to consumers are identified and removed from sale.“We are also carrying out a thorough assessment of product safety in the UK and exploring the issue of online marketplaces further.”A Meta spokesman said: “We work closely with external partners and respond to valid legal requests, including from the Office for Product Safety and Standards, to prevent illegal activity on our platforms.”"
    ]
}