{
    "articleURL": "/wires/ap/article-12050761/Indonesia-works-rescue-20-trafficking-victims-Myanmar.html",
    "content": [
        "JAKARTA, Indonesia (AP) - Indonesian officials said Friday they were working to rescue dozens of their nationals who were trafficked to Myanmar to work as cyber scammers, amid an increase in human trafficking cases in Southeast Asia.",
        "At least 20 Indonesian job seekers are trapped in Myawaddy township, the site of an armed conflict between Myanmar's military and ethnic Karen rebels, said Judha Nugraha, an official in Indonesia´s Foreign Affairs Ministry. Myawaddy is in eastern Kayin state along the Thai border.According to Nugraha, fake recruiters offered the victims high-paying jobs in Thailand but instead trafficked them to Myawaddy, about 567 kilometers (352 miles) south of Naypyidaw, the capital, to perform cyber scams for crypto websites or apps.The Indonesian Migrant Worker Union, a nonprofit group, said some victims were tortured when they failed to reach certain targets and forced to pay more than $10,000 in travel costs. Authorities said the victims were likely trafficked to Myanmar by illegal means since no records can be found of their arrival in Myanmar´s immigration system.\"The challenges on the ground are indeed high as authorities in Myanmar face difficulties entering Myawaddy since rebels have taken over the region,\" Nugraha said.Indonesian officials are working with authorities in Naypyidaw, Myawaddy and Thailand, and have asked for assistance from other organizations to help get the victims out of the area safely, he said.",
        "Indonesia´s Foreign Minister Retno Marsudi told a news conference on Friday that the government has worked on 1,841 human trafficking cases in the past three years where victims are Indonesians who were duped into online scams.",
        "That number includes 1,138 Indonesians who were repatriated from Cambodia last year, Marsudi said.\"From this number, you can see the magnitude of human trafficking related to online scams whose victims are ASEAN citizens,\" she said, adding that victims from several nations are involved in the latest case.Marsudi said the government is also working to help Indonesian victims of online scams in Myanmar, Cambodia, Thailand, Vietnam, Laos and the Philippines.She said the Indonesian Embassy in Manila said Friday that Philippine authorities have rescued more than 1,000 trafficking victims from 10 countries, including 143 Indonesians, who will be repatriated to their countries of origin.\"As the chair of ASEAN this year, Indonesia is trying to raise this issue at the 42nd ASEAN Summit,\" Marsudi said.ASEAN includes Brunei, Cambodia, Vietnam, Indonesia, Laos, Malaysia, Myanmar, Philippine, Singapore and Thailand. Indonesia will host the bloc´s leaders' meeting in May 10-11 in Labuan Bajo on Flores island."
    ]
}