{
    "articleURL": "/tvshowbiz/article-12051329/Meg-Ryan-nester-Daisy-True-19-son-Jack-Quaid-31-busy-actor.html",
    "content": [
        "Hollywood's sweetheart Meg Ryan made a rare appearance this week to support a longtime Hollywood friend.",
        "The 61-year-old Sleepless In Seattle star was by pal Michael J Fox's side as he hosted a special screening in New York City for his new AppleTV+ film Still: A Michael J Fox Movie.The blonde movie star - born Margaret Mary Emily Hyra - is usually not seen at big, splashy events but fans may get to see a lot more of her. That is because both of her children are now adults.Her daughter Daisy True is 19-years-old and a high school graduate. And the son she had with ex-husband Dennis Quaid, 31-year-old Jack Quaid, is a busy actor - his latest gig is on a Star Trek animated series. ",
        "Quaid was also seen on his Instagram page this week living it up in Paris.Daisy was born in China in 2004 and was adopted at 14 months of age by Meg.Ryan raised Daisy as a single mother in New York City after her high-profile 2001 divorce from movie star Dennis Quaid, 69, who is best known for the movies The Parent Trap, The Day After Tomorrow and A Dog's Purpose.The only father Daisy may have known was Meg's on and off boyfriend, 71-year-old rock star John Mellencamp.The stars began dating in November 2010 and stayed together for four years before breaking up in August 2014. However, they got back together before the end of that year. Then they split again.",
        "Daisy attended school in lower Manhattan and was often seen out in public with her mother as they walked on the street.The teenager was last seen at an event with Meg in July 2019 when they sat front row at the Schiaparelli fashion show in Paris during Paris Fashion Week.Meg told Redbook magazine Daisy was an easy child'Daisy doesn't feel hard. She doesn't feel like…there's no sweat on it, man,' she told the magazine.",
        "'She's a good hang, and she's easy. She's very smart and she's very generous. I love that she's funny. I love that. 'I just can't imagine what it was like before she came. Life is good, it's so good with her in it. She and Jack get along great. All of us fit together beautifully.'Meg shared in that same interview that Daisy was randomly assigned to her, per China's adoption process. But she feels it was fate.'I am convinced, completely convinced that there was nothing random about it. She is the daughter I should have,' she said.'I never felt like I was on a rescue mission or anything like that. I just really wanted a baby; I was on a mission to connect with somebody, and Daisy and I got to meet each other this way at this time,' said the star.",
        "'We are so compatible. And also having the experience of having had Jack and now to have Daisy in a different way—there's no difference in the love you feel.The When Harry Met Sally… star also talked being a single mother.'I mean, Jack has his dad and they're close, he'll always have that. But when you're the only one in the house with the kids, you get to be the one in charge. You're the one making the rules. There's no stress because you and some other adult don't agree on how you want to raise your kids,' she said.",
        "Jack is a successful actor.His first acting role was in 2012 in The Hunger Games where he played Marvel, and he also popped up in the sequel The Hunger Games: Catching Fire.In 2014 he played Dylan in Just Before I Go, which was followed by his starring role as Eric in 2015's Running Wild.Then he made his mark in TV by starring as Kyle in Sasquatch Sketch Comedy from 2014 until 2015.Several movies followed: Ithaca (2015), Aberrant (2016), Tragedy Girls (2017), Rampage (2018) and Plus One (2019).",
        "Jack has also provided his voice for two Batman cartoon projects.He now stars as Bradward Boimler on animated TV series Star Trek: Lower Decks.",
        "Ryan is still working in Hollywood. Last year, it was announced that Meg would be returning to the screen as she plans to star in and direct the forthcoming movie What Happens Later.According to The Hollywood Reporter, the movie is an adaptation of Steven Dietz's play Shooting Star.",
        "The media outlet also revealed that the playwright was penning the screenplay alongside both Kirk Lynn and the actress, herself.The feature is described by the filmmakers as an 'evolved and nostalgic take on the romantic comedy.'What Happens Later hones in on a former couple that examines their romantic past while they're snowed in at an airport.David Duchovny will play opposite Meg."
    ]
}