{
    "articleURL": "/femail/article-12051103/Kates-charm-offensive-Princess-ripped-royal-rule-book-touchy-feely-Soho-fans.html",
    "content": [
        "Footage of Princess of Wales' Soho trip has been posted on TikTok and TwitterRead More:  Kate and William meet TikTok royalty! Prince and Princess of Wales  film hilarious video with trainspotting internet star Francis BourgeoisKate Middleton ripped up the royal rule book yesterday as she got very touchy feeling with wellwishers in Soho.",
        "The Prince and Princess of Wales visited the Dog and Duck pub in Soho yesterday afternoon to learn about how the establishment is gearing up for King Charles' coronation this weekend.Before going into the pub, the royal couple took the time to greet fans who had gathered on Bateman Street to catch a glimpse of them.Among the crowd was secondary school English teacher Louis Stevenson - who praised the Princess' Early Years initiative. In a video shared on his Twitter, Louis told the Princess: 'You mean so much and are such an inspiration.'",
        "While discussing Louis' work, Kate admitted: 'I'm trying to get my kids to speak more French.'The Princess then went on to stress 'how important' it is to learn languages in childhood.As the conversation draws to a close, Louis asked: 'Can I get a selfie with you?' 'Of course,' the Princess replied. 'Thank you so much for my flowers. That's really sweet of you.'As they posed for the photo, Kate put her arm around Louis.'Keep up the hard work,' she said, after giving him a gentle squeeze on the shoulder. Sharing the footage with his followers, Louis wrote: 'Many have reached out, and asked what the Princess and I talked about. I’ll share this video with you. ",
        "'She most cheerfully lent an ear, was really interested in my job (I’m a teacher of English), and was genuine with everybody. Yesterday was a dream.'",
        "In response, one fan said: 'What a gentle soul she is! Everyone keeps saying the same thing natural sweet and authentic and that she really is pretty in real life.'Another added: 'Authentic. That’s so unique in today’s world and so appreciated.' Following their interaction with the Princess, the royal fan who runs the TikTok account 'The Kings Guard Official' shared a video of Kate posing for selfies on the street.The 70-second clip shows the Princess patiently posing for multiple photos with fans and saying: 'It's very nice to meet you.'After posing for a photo with a royal fan at the front of the crowd, a self-deprecating Kate admitted that she often questioned her approach to selfies.She said: 'I'm sorry, I always get really close. I'm like, \"what do I do?!\" She then took another selfie with a fan further down the crowd before asking them if they had travelled far to get to London that day. In the background, a member of the public called out in the background: 'Kate, can I get a selfie? I'm late for my meeting.' ",
        "Warning of the tourists of the potential risk of rain tomorrow, she added: 'I hope you enjoy it. But I was just saying, make sure you find yourself an umbrella! ",
        "'It might rain. It's the British way.'At this point, Kate then responds to the impatient man behind the group and leans in for a selfie with him.As he turned his back to her, she exclaimed: 'How are we going to do it?'Giving him a gentle tap on the shoulder, the Princess added: 'I look like I'm Photobombing you!' The video ends with Kate recording a video for a royal fan's family back home - telling them that it's 'very nice to meet you'.",
        "What's more, Kate also leaned into the frame for a candid relaxed snap with one fan - who had a incredibly similar version of the Princess' sapphire engagement ring, which once belonged  to Princess Diana.The purple-haired fan beamed as she showed the Princess her ring and held her hand up in the photo.While engaging with members of the public, Kate said their eldest child Prince George was 'excited' about the upcoming coronation and had been taking part in rehearsals.When asked if George was 'excited' to be a Page of Honour at his grandfather's Coronation, the Princess replied: 'He is actually. Having done a few rehearsals, I think everyone is a bit more relaxed.' Meanwhile William, 40, also enjoyed some photos and made easy banter with the crowd as he quipped the family has a 'quiet weekend' ahead with 'nothing at all' planned.",
        "Onlookers laughed as the prince waved the question off in jest while accepting some flowers."
    ]
}