{
    "articleURL": "/tvshowbiz/article-12061133/Vanderpump-Rules-star-Scheana-Shay-celebrates-38th-birthday.html",
    "content": [
        "Vanderpump Rules star Scheana Shay celebrated her 38th birthday with hunky husband Brock Davies at a lavish Culver City pool party on Sunday.",
        "In the snaps, the 38-year-old reality television personality wowed in a pastel crop top by Tiare Hawaii as she posed with her shirtless beau, 31, at The Shay Culver City's rooftop pool.The star, who recently admitted to shoving Raquel Leviss, also shared several videos that had been taken during her birthday party to her Instagram Story.The star also wore a Tiare Hawaii wrap skirt that added extra color to her look, and she contrasted the bright tones of her outfit with white sandals.The actress accessorized with a fashionable pair of sunglasses and a set of earrings. ",
        "Her gorgeous brunette hair was partially covered up by a bright pink cap, although she later removed her headwear and let her locks flow freely in the breeze.Davies opted for a woven robe and a pair of white trunks as he spent time with his wife.Shay held a drink and danced with a friend who described her as the 'birthday girl' in the first video that was shared on her Instagram Story. She went on to share a video of her daughter Summer Moon Honey, aged two, swimming into her father's arms.The reality television personality and her husband previously welcomed their child into their lives in April of 2021.The happy couple went on to tie the knot during a ceremony that took place in Cancun the following August.",
        "Shay was previously married to her former husband, Michael Shay, from 2014 until 2017.",
        "In addition to her birthday, the television figure celebrated her recent win at the MTV Movie Awards, which took place on Sunday. The media personality was given the Best reality on-screen team award, which she shared with castmates Ariana Madix, Katie Maloney and LaLa Kent.Shay shared a selfie in which she showed off her Golden Popcorn award trophy to her Instagram Story on Monday afternoon.The Bravo star also added a text graphic to her post that read: 'Thank you @mtv and everyone who voted! Ahhhhhhhh!!!!' "
    ]
}