{
    "articleURL": "/wires/reuters/article-12047063/Modernas-surprise-profit-powered-deferred-COVID-orders.html",
    "content": [
        "By Patrick Wingrove and Leroy Leo",
        "May 4 (Reuters) - Moderna Inc on Thursday reported a small profit of 19 cents per share instead of an expected loss as it booked more revenue in the first quarter from last year's deferred orders for its COVID-19 vaccine than had been anticipated.Analysts expected a loss of $1.77 per share, according to Refinitiv data, and Moderna shares had jumped more than 5% to $136.71 by midday. They had fallen nearly 28% this year.The company did not change its forecast of $5 billion in COVID vaccine sales for the year based on advance purchase agreements. But Moderna said it was in discussions about new contracts with customers in Europe, Japan, and the U.S. that could further boost vaccine revenue.The company expects to sign commercial contracts for updated COVID vaccine boosters over the next few weeks and into the third quarter, Chief Commercial Officer Arpa Garay said on a conference call to discuss results.The company continues to expect the U.S. annual COVID-19 market to be 100 million doses, she added.The first quarter's $1.83 billion in COVID vaccine sales represents most of the $2 billion expected in the first half of the year for advanced purchase agreements, but was double analysts' estimates of $998 million.Moderna expects an additional $3 billion in deferred vaccine revenue in the second half of 2023.",
        "\"On top of their current $5 billion contracts, our numbers suggest they would need an additional $5 billion of contracts to produce the margins stated in their guidance for this year,\" said SVB Securities analyst Mani Foroohar. \"If they're unable to generate that additional revenue, we expect their full year margin to be materially worse than guidance.\"The Moderna results come two days after rival Pfizer Inc reported better-than-expected COVID vaccine sales for the first quarter and maintained its expectations for full-year sales.Pfizer and partner BioNTech own about two thirds of the global COVID vaccine market.\"The real question is, can Moderna gain market share from Pfizer and BioNTech in the mRNA space? If that happens, then they're going to start having better numbers for the year,\" said Oppenheimer analyst Hartaj Singh.Moderna said on Thursday it expects a tax benefit of $300 million to $500 million for the year due to credits for research and development and certain one-off items.The company had generated around $36 billion in sales over the last two years from the COVID vaccine, its only commercial product.Demand for the vaccine has since fallen globally as the worst of the pandemic has eased. The company in February forecast a possible net loss for 2023, calling it a transition year before it starts to see sales from experimental vaccines for respiratory syncytial virus (RSV) and flu.",
        "Those vaccines, also based on the same mRNA platform as its COVID shot, have yet to be filed for regulatory approval decisions. (Reporting by Patrick Wingrove in New York and Leroy Leo in Bengaluru; Editing by Caroline Humer, Jamie Freed and Bill Berkrot)"
    ]
}