{
    "articleURL": "/news/article-12050871/Burger-King-store-closures-explained-Fast-food-giant-close-400-underperforming-franchises.html",
    "content": [
        "The company says underperforming stores will be the first to be axed this yearThe chain has undergone an image change in response to slowing sales READ MORE: The eight beloved fast food chains, including Krispy Kreme, that are slowly disappearing across America Burger King has estimated that it will have to make a historically high number of closures this year. ",
        "In a bid to keep up with its fast food rivals, CEO Joshua Kobza announced that the chain will shutter between 300 and 400 underperforming restaurants in 2023. According to its earnings release, Burger King axed 124 locations in the year up to March, leaving 6,964 spots across the country. One bust franchisee has already announced it will shut 27 locations across seven states this year. Burger King is now the third-biggest fast-food restaurant in the US, after losing its second-place position to Wendy's. McDonald's remains top dog. Burger King also faces pressure from more upmarket chains including Five Guys and Shake Shack.But why are so many stores closing - and will the dramatic cuts to its real estate portfolio help the chain catch up with its rivals and stop its crown from slipping?",
        "Why is Burger King closing restaurants?Chairman Patrick Doyle said the company is cracking down on underperforming franchisees. Sales performance can vary greatly between Burger King locations, and the company said it is seeking franchisees with stronger finances.'There will always be a minority [of franchisees] who aren't dedicated, enthusiastic operators. We'll work with them to leave the system and move on to do something else,' said Doyle.'There simply is no room for franchisees who are not willing or able to work hard to operate restaurants that are better than the system average over the long term.'",
        "The closures will target the least profitable stores, so the company can focus on its turnaround plan to boost sales and buckle down to fight its competition. ",
        "What is the chain's turnaround plan? Burger King set out with renewed vigor at the end of 2022 to surf the tide of the tumultuous fast food market. It had been suffering with lagging sales, trailing behind Wendy's and its Goliathan rival, McDonald's. One analyst told DailyMail.com that the chain was at risk of entering into a 'death spiral' if it failed to play catch-up with its rivals.In September 2022 it unveiled its $400 million 'Reclaim the Flame' rebranding plan - with a focus on advertising, revamping rundown restaurants and targeting a younger, more diverse market. Bosses said the campaign would make the brand more 'premium'. The plan involved spending $150 million on advertising, and after years of 'Have it Your Way', the brand officially changed its slogan to 'You Rule', and even released its 'Whopper Whopper' jingle on TikTok and Spotify. The ad was a fervent success and has been streamed more than three million times on the music platform.   The brand is also aiming to streamline overly complicated menus and operations.The Whopper was taken off the value menu and given new flavor extensions. The Ch'King sandwich was replaced with the new Royal line of chicken sandwiches. The Ch'King sandwich took 21 steps to prepare, but The Royal Crispy Chicken takes just five.",
        "And it appears as though the chain's shiny new image may be beginning to pay off. In its 2023 first quarter results, the company reported that - despite store closures - its comparable sales rose 8.7 percent. Kobza said earlier this year that he 'felt really good' about where the company is going.",
        "How will restaurants change? The chain is also investing $50million over the next two years to renovate and freshen up nearly 3,000 restaurants.The modernization consists of new restaurant technology, kitchen equipment, and building enhancements - with the aim of making the dining experience easier and more enjoyable for burger fans. $200million will go toward restaurant remodel projects for about 800 stores in the next two years.This includes futuristic features such as three-lane drive thrus and food delivered via a conveyor belt.At some innovative eateries customers will be able place their orders under solar-powered canopies, where they can stay and eat.There's also a curbside pickup area for customers who order ahead on the app. After purchasing, customers can pull up into a pickup spot, and notify the restaurant that they've arrived through the app, and employees will bring the food out to the car.An alternative to curbside pickup are Burger King's new pickup lockers, where guests can grab the food straight from the kitchen after ordering through the app.",
        "Why was Burger King struggling?The firm was badly positioned when the pandemic hit compared to its rivals. Its digital platform was behind, so the brand struggled to keep up with the demand for delivery when people could not visit restaurants in person. The chain also suffered from a series of ill-fated menu revamps - including the Impossible Burger. Launched in 2016, bosses said it was a meat-free alternative, pipping McDonald's to the post. But they were forced into the mother of all climb downs when they admitted it would be cooked on the same equipment used for beef and chicken.In early 2019, it tried to take on McDonald's again, this time challenging their rival's Happy Meals range.Burger King's Real Meals included options such as the Blue Meal and the DGAF (Don't Give a F***) Meal, which were designed in conjunction with Mental Health America for Mental Health Awareness Month.But bosses were accused of using mental health to turn a profit, with critics pointing out that the chain was not offering resources to those living with mental illness, and the products were simply gimmicks.",
        "Which stores are closing? Not all of the 300 to 400 locations closing their doors this year have been revealed, as boss Kobza admitted there is 'a fair degree of uncertainty' around the plans.",
        "But there are confirmed closures from two Burger King franchisees who have gone bust this year. Meridian Restaurants Unlimited, which runs over 100 locations, will shut 27 restaurants across seven states including Minnesota, Montana and Utah. The franchisee filed for bankruptcy in March, having reportedly racked up $14 million in debt. The franchisee said it was 'possible, if not likely' they would be pressed to close more stores as they negotiated rent and operational improvements with landlords, as well as struggling with rising food costs and poor sales.Another franchisee, EYM King of Michigan, also announced it was closing 26 restaurants across the state and laying off over 400 employees after the chain missed a deal with the Department of Labor.In a letter to the state Department of Labor and Economic Opportunity, EYM King of Michigan LLC said they had failed to reach an agreement with Burger King Corp.Some struggling spots are expected to be bought out. Karali Group is reportedly set to pay more than $7million for 27 locations in Ohio and Pittsburgh, Pennsylvania, while 37 stores in Virginia are expected to be bought for $22million by DC Burger, according to Restaurant Business. Some locations are on the brink. Franchisee Toms King, which operates 90 units, had to be bought out of bankruptcy for $33 million in January.  ",
        "Michigan2155 Gratiot Ave9871 Livernois 8201 Woodward Ave18021 Kelly Rd20200 Grand River Ave13600 W. McNichols Rd15500 W. Seven Mile20240 Plymouth Rd12661 Mack Ave9239 Gratiot Ave17440 E. Warren16245 Livernois Ave3863 W. Jefferson Ave. 10336 W. 8 Mile Rd3625 South Dort Hwy3801 Clio Rd13324 Woodward Ave28203 Plymouth Rd34835 Plymouth Ave31456 Woodward Ave23660 Telegraph Rd30711 Southfield Rd1113 E. West Maple Rd2411 E. 8 Mile Rd9774 E. M-36Minnesota 209 Nokomis Street, Alexandria 926 Central Avenue Northeast, East Grand Forks  528 Western Ave, Fergus Falls 21 Depot Street, Litchfield 205 Lake Street, Long Prairie 586 Southwest 1st Street, Montevideo 516 East Bridge Street, Redwood Falls 100 21st Street North, Moorhead 1611 US-12, Willmar Montana1422 West Main Street, Lewistown520 North 27th St, Billings1211 9th Street West, Columbia FallsKansas   2201 East Kansas Ave, McPhersonNebraska3627 South Lincoln Avenue, York2504 O St, Lincoln4230 North 27th Street, LincolnNorth Dakota 3765 Gateway Drive, Grand ForksUtah171 East Gateway Dr, Heber7810 South 1300 E, Sandy 10235 South State Street, Sandy729 North Main St, Clearfield1466 East 3500 North, Lehi119 East Crossroads Blvd, Saratoga Springs147 East Bangerter Highway, Draper5390 South 1900 West, Roy1660 West North Temple St, Salt Lake CityWyoming 1902 Mountain View Drive, Cody "
    ]
}