{
    "articleURL": "/sciencetech/article-12045753/Heres-phone-settings-need-change-want-phone-longer.html",
    "content": [
        "Hidden settings on both iPhone and Android can preserve battery life over timeLowering your power usage can make phones last years more than expectedREAD MORE: Here's the big charging mistake you make with your phone Tweaking a few settings on your phone could add years of life to your handset, according to a tech repair expert.",
        "Kewin Charron, a tech expert at the French company Back Market, told DailyMail.com there are a few hidden settings for Android and iPhone handsets that can help preserve your phone by reducing strain on the battery.Basic steps like switching to dark mode can reduce the battery drain caused by bright displays and help handsets last longer. So can turning off location services when not in use and making sure you are connected to Wi-Fi.",
        "Not only will preserving your handset save you money and hassle, it is also better for the environment. ‘The battery is a key component when it comes to making your iPhone last longer,’ Mr Charron explained.",
        "‘One way to reduce the drain on your phone's battery is to enable the auto-brightness feature and set the maximum brightness to roughly 50 percent — as long as this won’t strain your eyes,' he said.'This setting automatically adjusts the brightness level based on the ambient light.'To activate it, go to Settings, tap Accessibility &gt; Display &amp; Text Size &gt; Auto-Brightness and switch on.Using Apple’s High Efficiency photo format (HEIF) also helps protect your battery, by reducing file size of photos and videos.This lessens the load viewing pictures takes on the load on your handset’s battery.Charron continued: ‘This setting can decrease the file size of both photos and videos by up to 50 percent.' ",
        "To switch on this setting, click Settings &gt; Camera &gt; Formats, then turn on High Efficiency.Charron also recommends turning on Battery Optimization, so you don’t overcharge your phone (which can impact battery life).For iPhones with iOS 13 and beyond, go into your iPhone Settings &gt; Battery &gt; Battery Health &amp; Charging, and select Optimised Battery Charging.If you really want to keep the battery going, Low Power Mode is your friend, although it can change your experience of using the device, Charron warns.Charron says, ‘This setting means you won’t be notified of new emails until you launch the Mail app, the display brightness will be turned down, and the auto-lock timer set to around 30 seconds. 'But, it will ensure your battery is being used as efficiently as possible, helping it last in the short and long term.'‘To enable Low Power Mode, click Settings, and then Battery to switch it on. If you’re keen to make Low Power Mode your default setting, click Settings &gt; Control Center &gt; Customise Controls, then select Low Power Mode.’’For Android users, there are several settings which can help to preserve the battery - and make sure the handset lasts.‘Adaptive Battery is a key Android setting, helping prevent apps that you don’t often use from running in the background, unless you’re actively using them,’ Charron says.",
        "‘ Overtime, your device will learn about your app usage and optimise your battery in-line with your behaviour. For Android devices, enabling this setting might vary. Try clicking Settings &gt; Battery and then turning on Adaptive Battery.",
        "Just as with iPhones, preventing your Android from burning energy on the screen can eke a bit more lifetime out of the handset, Mr Charron says.It’s easy to achieve this with the Auto Screen Brightness or Adaptive Brightness in your handset.To do this, go to Settings &gt; Display &gt; and turn on Auto Screen Brightness or Adaptive Brightness.",
        "Mr Charron says, ‘Dimming your brightness to around 50% can also help preserve the lifespan of your battery, but do ensure you aren’t straining your eyes to read the dimmer display.’He also advises stopping your devices from overcharging (this can impact your battery’s overall health.Click Settings &gt; Battery &gt; and then turn on Battery Care to enable this feature - or on some devices, try clicking Settings &gt; Battery &gt; Battery Usage, then tapping Optimised.The French expert continued, ‘The Battery Saver setting on Android devices is another way to help your phone last longer. But, similarly to iPhones, this setting can change your experience of using the device.‘When you enable the Battery Saver Setting, you might notice your phone will turn automatically to the Dark theme, some visual effects and features might become limited, and apps might take longer to load. ",
        "'Yet, this setting will help increase the lifespan of your battery. To enable the Battery Saver setting on most Android devices, open the settings app, select Battery, and click Battery Saver.'"
    ]
}