{
    "articleURL": "/tvshowbiz/article-12061147/Kyle-Sandilands-admits-cracks-starting-marriage-week-wedding.html",
    "content": [
        "Kyle Sandilands has revealed he is already having arguments with his new wife Tegan Kynaston just one week into their marriage.",
        "The radio host, 51, who tied the knot with the communications executive, 37, in a $1million ceremony on April 29, said on Tuesday they'd recently had a blazing row over his health and diet.Kyle joked the 'cracks are starting to show' in their relationship as Tegan is watching him like a hawk when it comes to snacking on junk food.Despite having shed an impressive 20kg before his wedding, Kyle said he likes to gorge on family-sized blocks of chocolate, whereas Tegan prefers him to eat healthy snacks like wholemeal Salada crackers. One recent fight broke out when she saw her husband eating a Milka chocolate bar, and she ran from the other side of the room to wrestle it out of his hands. ",
        "'I bought a Milka chocolate; it's thinner and family size. I gnawed through it like a rat with cheese,' Kyle said. '[Tegan] runs towards me and physically wrestles me. I sat there like an anchor and she twisted my arm until I let it go and I was like, \"What carry on is this?\"'I said my blood pressure is through the roof and I went out for a cigarette.'She told me to have a glass of water. I'm too old. I only eat what I eat, I don't give a s**t, it's too late for me to change - I am me,' he added.",
        "The couple, who are parents to baby son Otto, tied the knot on Saturday, April 29, in Sydney's Darling Point in a ceremony believed to have cost $1million.The shock jock said 'I do' with his business manager at a heritage-listed mansion in front of 130 guests - the most notable being Prime Minister Anthony Albanese. Before the wedding, Kyle revealed he had lost an impressive 20kg on a health kick. ",
        "Kyle was surprised to learn he had shed the kilos after his radio co-host Jackie 'O' Henderson encouraged him to weigh himself on air.'You were 140kg at your biggest. You look good and you are definitely not like you used to be,' she said.Kyle then stepped onto the scales to learn he now weighed 121kg, and Jackie said: 'Oh, my God, you're 20kg lighter!''That's without any effort and I didn't get paid $1million from Weight Watchers and I've still done it,' he added, referring to the weight loss program for which Jackie is an ambassador."
    ]
}