{
    "articleURL": "/wires/pa/article-12039731/Mental-health-patients-left-Welsh-Government-says-RCN-Wales.html",
    "content": [
        "Mental health patients in Wales are being “left behind”, the Royal College of Nursing (RCN) has claimed as it called for more money to be invested in the sector.",
        "The union said a lack of financial investment in inpatient services combined with ongoing stigma around severe mental ill health has contributed to inequalities within mental health provision.A report published on Wednesday by RCN Wales made eight recommendations to the Welsh Government to better protect patients.They included enhancing the workforce, providing further education to staff and ensuring there are safe and legal numbers of mental health nurses to fill statutory roles. The Welsh Government needs to recognise the value of mental health nurses for protecting patient safety  Jenifer French, RCN Wales  An independent review of the mental health nursing workforce was suggested, including into those working in the NHS, local authorities, prison and criminal justice settings, the private sector and charities.It also asked the government to set out a timeline for when Section 25B of the Nurse Staffing Levels (Wales) Act 2016 – a law which requires trusts and other health settings to maintain minimum staffing levels – would be extended to mental health inpatient wards.",
        "Jenifer French, from RCN Wales, said: “Recently, the Welsh Government has been very focused on prevention and early intervention, which I’m sure has had a tremendous impact for many.“However, those experiencing severe and enduring mental illness have been left behind.",
        "“Mental health nurses have a unique set of skills to meet the needs of some of the most vulnerable and marginalised groups in society. Mental health nurses provide life-saving clinical care and can help an individual change their life.“The Welsh Government needs to recognise the value of mental health nurses for protecting patient safety.”Mental health nursing covers a wide range of services including specialisms such as perinatal services, child and adolescent services, severe and enduring mental ill health, eating disorder services, secure services including in the criminal justice system and prison settings, substance use, and increasingly older people as rates of dementia increase.The report, Mental Health Nursing: A profession that must be valued, said recruitment of pre-registration mental health nurses should be increased further. There are increasing demands on expanding the role of nurses and often this is without recognition that we are removing some of our most experienced and capable nurses from direct care  Alun Thomas, Adferiad Recovery  It also said health boards should set out a plan on how to support qualified mental health nurses to use their skills and knowledge, and establish career paths for them to become specialists, advanced nurse practitioners and consultant nurses to improve retention.Alun Thomas, chief executive of Adferiad Recovery, a charity helping people with complex mental health and substance misuse conditions, said: “Mental health nursing remains under significant pressure.",
        "“There are increasing demands on expanding the role of nurses and often this is without recognition that we are removing some of our most experienced and capable nurses from direct care.“There must be an increase in pre-registration places in our schools of nursing, though this alone will not address the longer-term issues of nurses leaving the profession.“Mental health nurses must feel that they are able to deliver the quality care they came into the profession to do, and we should include the nursing role in all our workforce planning across the health and social care sector, rather than see nursing as a separate function.”"
    ]
}