{
    "articleURL": "/wires/aap/article-12044887/McDonalds-operator-admits-union-busting-campaign.html",
    "content": [
        "The former operator of a McDonald's franchise in South Australia has agreed to pay $275,000 in fines and penalties to end court action over a long-running anti-union campaign among employees.",
        "The Federal Court action was brought by the Shop, Distributive and Allied Employees' Association (SDA) and was settled after the former operators of the Murray Bridge outlet admitted breaching workplace rights by pressuring staff to stop being SDA members or to not join the union.The breaches and admissions do not relate to the current operators of the fast food outlet, east of Adelaide, nor to McDonald's Australia.The SDA said workers at Murray Bridge were threatened with demotion and cuts to hours if they remained members and a list of union members was posted on a noticeboard.The union said it believed the case was the first time a McDonald's store had admitted to a campaign to de-unionise its workforce.\"McDonald's Murray Bridge workers were bullied, intimidated and threatened because they stood up for themselves and their co-workers,\" SDA state secretary Josh Peak said.\"This attack on vulnerable, young workers cannot be tolerated.\"Former McDonald's worker Heather Hammond said she witnessed senior management's campaign to keep workers out of the union and to punish those who joined.\"I witnessed a McDonald's manager tell a worker that if she did not resign her SDA membership, she would be demoted,\" Ms Hammond said.\"I was pressured into resigning my union membership. They made me frightened I would lose my position as a supervisor.\"",
        "ACTU President Michele O'Neil said the settlement reinforced the legal right of all workers to join a union.\"The case sends a strong signal to employers who attempt to intimidate or interfere with their workers' right to join and be part of a union that there are real consequences,\" Ms O'Neil said.In a statement, the fast food company said no allegations were made against McDonald's Australia Ltd.\"This individual is no longer a franchisee within the McDonald's system. In fact, they left the McDonald's system in May 2021,\" the company said.\"McDonald's Australia does not accept or condone anti-union conduct within our business or franchisee-owned restaurants.\"The company said it had clear policies in place to ensure franchisees, managers and employees complied with the Fair Work Act.\"We have a long history of collaborative relationships with unions, which includes an agreed approach for restaurant visitation and meeting with crew,\" it said."
    ]
}