{
    "articleURL": "/tvshowbiz/article-12039327/Im-Celeb-South-Africa-Dean-Gaffney-Joe-Swash-vomit-trial.html",
    "content": [
        "I'm A Celebrity... South Africa viewers were in hysterics as they watched newcomers Dean Gaffney and Joe Swash vomit and splutter gruesome cocktails of animal  innards just minutes after arriving on the show on Tuesday.",
        "Former I'm A Celebrity winner Joe, 41, who was voted champion by the public on his first run on the series in 2008 and Dean, 45, who previously appeared on the 2006 series, were tasked with drinking a variety of concoctions made from various parts of animals, insects and vile tasting natural foods in a bid to win treats for each existing member of the camp in Kruger National Park.Actor Dean, who played Robbie Jackson on the BBC soap EastEnders from 1993 to 2003, did not fair well with his Bushtucker Trials during his first time in the jungle, when he screamed and dry heaved his way through the challenges, with not much changing this time.And while Joe - who also was also in EastEnders as Mickey Miller from 2003 to 2008 - forced himself through his I'm A Celeb trials and also tried out many more as the host of former ITV2 spin-off show I'm a Celebrity... Extra Camp, he didn't have an easy ride this week either.The pair were told by hosts Ant McPartlin and Declan Donnelly to stand in front of a table and choose a log to turn over, with Dean first picking the log named 'Helen Fanny-gan', before he was tasked with drinking a glass of blended cow vagina.",
        "Before he had even picked up the glass, a bright red Dean was shuddering and screaming.He tipped half the contents of the glass into his mouth, slopping much of it down his top, before attempting to swallow it, with Dean visibly bringing the drink back up into his mouth and spraying it out onto the table despite having his lips tightly closed.Dean proceeded to vomit much of what he had swallowed onto the table as Joe yelled at him to 'drink it like a shot', while signalling for him to quickly tip the glass back, instructing Dean to: 'Bang it!'The screen star gulped the rest of the glass and managed to keep it down, successfully winning a prize of some lemonade for Helen Flanagan.Joe selected the log named 'Phil Tough-hell' and he was given a glass of blended maggots to consume.Describing it as 'a real thicky' Joe looked repulsed before he picked the glass up and took a gulp before instantly vomiting the grey smoothie back up into the glass, to which Dec observed: 'Oh! It's going back in,' while Dean looked on, crying with laughter, spraying saliva as he was unable to contain his guffaws.A sweaty Joe eventually managed to down the majority of the drink, winning some wine gums for campmate Phil Tufnell.",
        "The pair went on the heave and reach for each of the abundance of specially prepared items, much to the delight of viewers, with many taking to Twitter to comment on the trial. ",
        "'Dean Gaffney and Joe Swash doing a drinking trial together is something I didn’t know I needed,' wrote one viewer.Someone else shared: 'This is absolute sheer gold from Dean Gaffney,' while another person wrote: 'Loving these two together .. but omg this trial is disgusting.'Noting Dean comforted himself by swaying backwards and forwards, someone commented: 'The level of rocking from Dean Gaffney is SEVERE.'While another viewer shared: 'Joe Swash and Dean Gaffney doing a trial together is the BEST, we do not deserve this series of #ImACeleb.''Joe Swash and Dean Gaffney doing a drinking trial is everything I was hoping for and more,' wrote another viewer, while someone else shared: 'I would pay to watch @joeswash and @deangaffney1 on a weekly challenge show we are in hysterics watching @imacelebrity.''Joe Swash drinking these drinks is the best TV I’ve seen so far in 2023,' declared another show fan.While someone else noted: 'Joe Swash has expressed more emotions with his face, in 30 seconds, than I have in 52 years.'And another person wrote: 'Dean Gaffney and Joe Swash are literally the best two people that could’ve entered the jungle right now! Creasing!'",
        "It comes after Amir Khan was voted off I'm A Celebrity...South Africa earlier in the show.The 36-year-old sports star has become the third celebrity to leave the ITV show, after being voted off in a secret ballot.Before announcing the latest departure, Dec told the campmates: 'You all know why we’re here this morning - last night we left you with the news that someone would be leaving camp as a result of a secret ballot...'Amir was then announced as the latest celebrity to leave the camp.The former boxer - who retired from the sport in 2022 - insisted appearing on the show has been one of the 'best experiences' of his life.However, Amir also admitted that he felt ready to leave the camp and return home to his family.He said: 'It was one of the best experiences I’ve ever had. It’s like I got to be with a new family in South Africa. ",
        "'I’m always going to compare it with my first time in Australia but this one, for me, was way better. Great camp, the campmates were amazing.'Even though I would have loved to have stayed in a little bit longer, sometimes what can happen is, if you stay longer, you can outstay your welcome.",
        "'It was just a great experience and I’m just glad I had the opportunity.'Carol Vorderman left viewers in hysterics on Tuesday night's episode of I'm A Celebrity South Africa as she claimed she has 'Britain's most buoyant bottom'. The former Countdown star, 62, was taking part in a terrifying underwater challenge 'Tanks of Torment' that saw her swim through sea creatures to gain stars and meals for the camp. She was joined by Olympic athlete Fatima Whitbread, also 62, who showed off her almighty strength by using a lever to raise up trapdoors for Carol to swim through. Before starting the challenge, Carol confessed that an unusual problem could likely impair her in the task. She told a very amused Ant and Dec: 'The only problem I really have is, right, my bottom always floats to the top. ",
        "'It's the most buoyant thing in Britain!'Viewers couldn't contain their laughter at Carol's very naughty confession as they rushed to Twitter. One joked: 'Never need armbands with Carol around!', while another simply exclaimed: 'HAHA Carol.' As Carol unscrewed the stars and added them to her bag, Dec couldn't resist making another reference to her famous behind.  The cheeky presenter added: 'That's the problem with having Britain's most buoyant bottom. It's difficult to get down!', while Ant said: 'Very difficult!'",
        "But although she managed to win seven meals for camp, ultimately Carol wasn't able to complete the challenge.  She appeared shaky from early on as she swam among the alligators, admitting: 'I'm really not happy about this.'Seeing a terrifying snake was the final straw for the TV personality as it forced her to quit the challenge altogether, despite Fatima's words of encouragement. ",
        "A devastated Carol said: 'I can't do that. I'm not sure I want to do it. I've got this fear of drowning.'I have this real fear of drowning. And it's like my ultimate fear.'The I'm A Celebrity South Africa camp is set to be 'torn apart' in Wednesday's show as the campmates are divided once again.In a teaser for the next episode of the ITV show, Ant and Dec tease that the celebrities will be split into two groups, as they share a glimpse of a terrifying new bushtucker trial.And it appears that things will get tense between the newly-formed rival camps as they're forced to go head-to-head, with Ant and Dec declaring: 'Let the battle commence!'A preview video showed the moment new campmates Joe Swash and Dean Gaffney - who earlier took part in a disgusting drinking trial - arrived into camp to greet their fellow celebrities.But the union was short-lived as it was then teased that the stars would be divided into separate groups.",
        "A text on screen read: 'a camp united', followed by 'then torn apart'.With the presenters then confirming: 'The camp is now set to be split into two groups. Let the battle commence.'The camp was previously split when Shaun Ryder, Andy Whyment and Phil Tufnell had to slum it in the Savannah Scrub home before finally being allowed back into main camp.I'm A Celebrity...South Africa continues tomorrow at 9pm on ITV1 and ITVX. "
    ]
}