{
    "articleURL": "/tvshowbiz/article-12047869/Sanam-Harrinanan-stuns-navy-gown-joins-beau-Kai-Fagan-UK-Asian-Film-Festival.html",
    "content": [
        "Love Island's Sanam Harrinanan looked sensational as she joined beau Kai Fagan at the UK Asian Film Festival's opening gala at BFI Southbank in London on Wednesday.",
        "The beauty, 24, who was crowned winner of the winter 2023 series alongside her beau, showcased her curves in a figure-hugging navy gown.Sanam's elegant frock boasted an asymmetrical neckline and waterfall sleeve which cascaded down on to the red carpet.  She flaunted her long toned pins via a racy thigh-high split and completed the look with white strappy heels.Accentuating her features with make-up, she styled her brunette tresses into loose curls as they fell past her shoulders.  ",
        "Meanwhile Kai, also 24, cut a dapper figure in a plaid blazer which he layered over a crisp white shirt.He teamed the look with smart grey trousers and shiny dress shoes as he posed up a storm wrapping his arm around the gorgeous Sanam.The UK Asian Film Festival, celebrates the richness and vibrancy of South Asian culture, history, arts, storytelling at the capitol's BFI on the Southbank. Their outing comes after Sanam spoke out on her career plans after winning the £50,000 prize pot with her beau Kai.The couple were crowned the winners of the winter series of the ITV2 show earlier this month, but for Sanam her time in the villa has meant a drastic decision.Sanam worked as a social worker before the show, and in a new interview she had admitted her decision to appear on Love Island has put a halt to her previous career. ",
        " 'I can't go into social work again, I don't think I'll be able to,' she admitted to heat Magazine.She added though that she has plans to use her new platform to help her local community. 'I've got a meeting about it this week with my social work manager because I want to be able to use this platform to help children locally,' she explained.P.E. and science teacher Kai meanwhile has said he hopes to continue working with kids but knows his career path will most likely have to change. ",
        "'I still want to do the same thing I was doing but in a different capacity but it's just finding out what that capacity is and how I can do it,' he explained. Kai and Sanam made history as the first time a Casa Amor bombshell has entered the show and gone on to take the win in the show.Sanam has revealed she plans to use some of the £50,000 prize money to support her mum - who he is on her own after her dad passed away - as well as potentially invest in projects to help children. Meanwhile, teacher Kai told how he is planning to go on nice holidays with the money and plenty of fancy dates.Speaking on The Morning After podcast, Kai revealed: 'We have about a thousand dates planned. We said we want to go to the Amalfi coast and Santorini. I feel like they are more holidays than dates. Maybe invest a little bit.'",
        "Sanam continued: 'I am going to be soppy but I am going to give my mum some of course because it's just me and mum so I have got to support her aswell.'"
    ]
}