{
    "articleURL": "/sport/afl/article-12053277/Footy-fan-punched-woman-falls-stands-Marvel-Stadium-Carlton-AFL-game.html",
    "content": [
        "Incidents occured at Carlton v Brisbane match Man was punched in the head in Carlton fan bay Woman fell from second tier at Brisbane fans end Footage has emerged of crowd violence at the AFL match between the Carlton Blues and Brisbane Lions at Marvel Stadium in Melbourne on Friday night.",
        "Channel Nine has shared the vision including the moment a young football fan strikes another fan in the head.In the footage, a man wearing glasses confronts a group of younger supporters in a bay with a large Carlton banner.One of the young men stands up makes contact with the man wearing glasses, prompting him to shove the younger fan.The situation escalates when one of the young men strikes the man in the face, knocking his glasses off his head to the shock of the crowd.Another member of the group then leans over and taunts the stricken man.",
        "A woman who was standing beside the injured man then implores the younger man to stop.It is unknown what sparked the incident or what was said between the parties. Victoria Police told Daily Mail Australia the young man who threw the punch was likely to be charged.'Police responded to reports of an altercation at a Marvel Stadium in Docklands on 5 May,' a police spokeswoman said.'It’s understood a man was assaulted by another male just before 10pm. The victim received minor injuries and was treated at the scene.'A man was spoken to at the scene and is expected to be charged on summons for assault related offences.'  ",
        "In a separate incident, a woman is being treated at the Royal Melbourne Hospital after falling from the second tier of seats at Marvel Stadium on Friday night.The incident occurred before the game had started and the woman is reported to have fallen at the Brisbane Lions supporters end of the ground.She was treated at the scene by ground staff until medical assistance could arrive.“There’s unfortunately been a supporter injured in the crowd this evening,” Fox Sports reporter Drew Jones said on Friday.“She’s conscious and being attended to by staff at Marvel Stadium at the moment, some talk she may have fallen from the second level down to the set of seats at the other end of the ground, we hope she’s ok.”An Ambulance Victoria spokeswoman told news.com.au on Saturday the woman was in a stable condition in hospital.“Paramedics were called to a report of a fall just after 6pm last night,” the spokeswoman said.“A woman was treated for lower body injuries and taken to the Royal Melbourne Hospital in a stable condition.”"
    ]
}