{
    "articleURL": "/femail/travel/article-12040705/Natural-Bridge-looks-just-like-Blue-Lagoon-perfect-day-trip-Gold-Coast.html",
    "content": [
        "Travellers are flocking to Natural Bridge, SpringbrookIt is a 50-minute drive from Australia's Gold Coast A tiny corner of Australia's east coast is soon to be overrun by tourists.",
        "Natural Bridge in Springbrook, which is located just a 50 minute drive south-west of the Gold Coast, is the perfect destination for Aussies yearning for a magical sight under a stunning waterfall. The hidden gem has been dubbed 'Australia's Blue Lagoon' and labelled a 'must-see' destination by travellers who have been fortunate enough to experience its beauty.However, there's a catch: visitors are not allowed to swim in the creek.But there is still a wide-range of tourist-friendly activities: travellers can spend their days bird-watching for riflebirds, green catbirds, and wompoo fruit-doves.",
        "After a lovely day in the sun, nature lovers can go on a spectacular night-time tour to see the resident colony of protected glow-worms and microbats. ",
        "Never expose glow-worms to smoke from cigarettes or fire, bright lights or insect repellents, as these can kill themDo not shine torchlight directly on the glow-worms; they will stop glowing for up to one hour—interrupting their feeding as well as spoiling the experience for othersSource: Queensland Department of Environment and Science",
        "It is important to note that cellphone reception is scarce in the area.Natural Bridge features a picturesque rock formation which was created by the force of a waterfall over the basalt cave.It also contains hoop pines emerging from surrounding forests which are living relics of the Jurassic Age over 180 million years ago.",
        "The area is easily accessible from a car park - after which you'll have to follow a 1km circuit and descent through the beautiful rainforest.It is essential to avoid smoking, lighting a fire, or using insect repellant inside the glow worm caves as the toxins could kill them. A camping area called 'The Settlement' is also open to tents, camper trailers, and campervans.Campers will have access to toilets, drinking water, and a cooking shelter with free electric barbeques.",
        "Visitors have been raving about their time at Natural Bridge online with one describing it as 'straight out of the Blue Lagoon'.'I think this is one of the best hidden gems on the Gold Coast,' a woman, Lara, wrote. 'Everything was so scenic.' She added: 'I wouldn't have been surprised if I saw a mermaid swimming around down there.''Oh my god, I've been to Springwood National Park and it's so pretty,' said another.'This is so magical, I need to add it to my bucket list,' a third wrote.",
        "Distance: 1km returnTime: Allow about 1hr walking timeNote: Due to long sets of stairs, it is easier to walk this track in a clockwise direction.Details: A sealed circuit track takes you through the forest, across Cave Creek and into the arched cave to witness the waterfall plunging from above. Interpretive signs along the circuit highlight the park's special features. The hoop pines Araucaria Cunninghamii that emerge through the thick greenery of the surrounding rainforest are living relics of the Jurassic Age—the age of the conifers—about 180 million years ago. At night the cave is illuminated by thousands of glow worms' tiny green lights. While glow-worms are visible year-round, their display is significantly reduced during the winter months.Source: Queensland Department of Environment and Science"
    ]
}