{
    "articleURL": "/news/article-12045099/White-House-economists-claim-8-MILLION-jobs-lost-stocks-drop-45-default.html",
    "content": [
        "President Joe Biden has a May 9 meeting with congressional leaders to try to find a way to resolve the approaching crisis: the US could default on June 1On Wednesday, White House economists said a prolonged default could cause 8.3 million job losses and wipe 45 percent off the stock marketRepublicans are insisting on spending cuts and the rolling back of policies to prevent climate change: Biden says their demands are a non-starterWhite House economists have warned a prolonged debt default could trigger 8.3 million job losses and the stock market could tumble 45 percent, sparking 'an immediate, sharp recession on the order of the Great Recession.'",
        "Republicans are insisting that the Biden administration agree to spending cuts and the rolling back of climate change policies. Biden insists that is not on the table.'MAGA House Republicans voted on an extreme proposal to limit oversight of wealthy tax cheats, save billions in giveaways for Big Oil, grow everyday costs for hardworking Americans who have to foot the bill,' the president tweeted on Wednesday. 'It really shows you who they value.' On Tuesday, he accused the hardline Republicans of 'holding the American economy hostage'.",
        "'MAGA House Republicans have laid out two options for us: cut spending – from veterans to food programs – by 22 percent. Or they'll default on our national debt,' he tweeted. 'That's what holding the American economy hostage looks like.' The Senate Republicans pushed back, accusing Biden of being unwilling to negotiate.'Americans are fed up with federal spending. Democrats have no solutions and refuse to come to the table. It's simply unfair and irresponsible.'The exchanging of insults came as a new report from the Council of Economic Advisers shows that even less severe scenarios than a prolonged default would hamper the U.S. economy, evidence that the political showdown over the debt limit carries major financial costs. Without a deal in place between Congress and the White House, Treasury Secretary Janet Yellen warned that the federal government will lack the accounting tools to keep borrowing and potentially begin to default as soon as June 1.",
        "The first and most dangerous scenario is a 'protracted default.' The second is a 'short default' in which Congress acts swiftly to allow the nation to borrow again after defaulting. The third is 'brinkmanship,' in which lawmakers take the country's full faith and credit to the wire, but avert default. All three would hurt the economy, the experts said.President Joe Biden has a May 9 meeting with congressional leaders to try to find a way to resolve the approaching crisis.House Republicans are insisting on spending cuts as part of any plan to allow the country to resume borrowing. Biden says he will not allow the country to be 'taken hostage' by such demands and will only negotiate with the GOP on spending as part of the budgetary process. The president and Democratic lawmakers are seeking a 'clean' increase to the nation's $31.4 trillion debt limit.A spokesman for Kevin McCarthy, the House Speaker, sent out an email on Wednesday that blamed Democrats for the stalemate.'There is no good reason other than political malpractice for the U.S. to default on its debt,' wrote McCarthy spokesman Chad Gilmartin. 'Plenty of revenue is flowing in to pay interest on the debt.'",
        "That statement treats default as solely pertaining to federal borrowing, but administration officials warn that missed payments to contractors, Social Security recipients, federal employees and others would also constitute a default.",
        "The White House analysis warned that a protracted default could cost more than 8 million jobs in the third quarter of 2023, raising the prospect of 'an immediate, sharp recession on the order of the Great Recession.'The report said the government, unable to borrow money, would lack the traditional tools it uses to temper the impact of economic downturns, namely economic stimulus and social support.'Because the government would be unable to enact counter-cyclical measures in a breach-induced recession, there would be limited policy options to help buffer the impact on households and businesses,' the White House said. 'The ability of households and businesses, especially small businesses, to borrow through the private sector to offset this economic pain would also be compromised.'A short default would also inflict damage with 500,000 fewer jobs. Even the 'brinkmanship' approach, where lawmakers reach a deal at the eleventh hour, could cost about 200,000 jobs and shave 0.3 percent off the annual gross domestic product, according to the analysis.There are already signs of market stress from the showdown as the cost of insurance for nonpayment of U.S. Treasury notes has risen. The U.S. economy is also in a fragile state as Federal Reserve efforts to lower inflation have stoked concerns of a downturn."
    ]
}