{
    "articleURL": "/wires/reuters/article-12050467/TEXT-Wagner-founder-Prigozhins-public-appeal-Moscow.html",
    "content": [
        "May 5 (Reuters) - Yevgeny Prigozhin, leader of Russia's Wagner Group militia, announced on Friday that his forces would on May 10 quit the Ukrainian city of Bakhmut that they have been trying to capture since last summer.",
        "Following is an excerpt from his open letter, addressed to the chief of the general staff, the defence minister and the supreme commander - President Vladimir Putin - in which he lists what he says are Wagner's services to Moscow and renews long-standing allegations of establishment incompetence and vindictiveness:... 9. By May 9, 2023 [Victory Day], we were supposed to take Bakhmut, but knowing this, from May 1, the paramilitary bureaucrats practically cut us off from artillery ammunition;10. The units of the Russian Defence Ministry, which are designated to cover our flanks, are having difficulty holding them. The stated number of troops is very different from the real one, a triumph of the small print: instead of tens of thousands - tens and rarely hundreds of fighters.11. The offensive resources of PMC [private military company] \"Wagner\" ran out in early April, but we attack, despite the fact that the enemy forces outnumber us five to one. This - when the norm is that our side should have a threefold advantage when attacking.12. Because of the lack of ammunition, our losses are increasing exponentially every day;13. Despite this, the council of commanders of Wagner has decided to hold our positions and continue the offensive on Bakhmut until May 10, 2023, so as to greet Russians' sacred holiday on May 9, Victory Day, with the splendour of Russian weapons;",
        "14. I formally address the Chief of the General Staff, the Minister of Defence, the Supreme Commander-in-Chief and the people of Russia. I declare on behalf of the Wagner fighters, on behalf of the Wagner command, that on May 10, 2023, we are obliged to transfer positions in the settlement of Bakhmut to units of the defence ministry and withdraw the remains of Wagner to logistics camps to lick our wounds. I'm pulling Wagner units out of Bakhmut because in the absence of ammunition they're doomed to perish senselessly;15. I'm making an open appeal, since not a single letter of mine was considered, I have been reporting all the problems since March 19, 2022;16. The Minister of Defence said this week that there was more than enough ammunition. The shortage of shells in Wagner is 90%;17. I ask the Chief of the General Staff to sign a combat order to Wagner to transfer its positions in the population centre of Bakhmut to units of the Ministry of Defence and indicate the date when they will replace us in our positions;18. Of course, I anticipate criticism. After a while, there will be clever people who say that we should have stayed in Bakhmut longer. Whoever has critical remarks - come to Bakhmut, you're welcome, stand up with guns in your hands in place of our killed comrades;",
        "19. I want to emphasise again: out of 45 sq km of Bakhmut, 2.5 km are left [to be taken]. By not giving us shells, you are not depriving us of victory, you are depriving the Russian people of victory; ...(Compiled by Kevin Liffey; Editing by Conor Humphries)"
    ]
}