{
    "articleURL": "/wires/ap/article-12054729/Ex-Penn-State-RB-Brown-embarks-NASCAR-pit-crew-career.html",
    "content": [
        "KANSAS CITY, Kan. (AP) - Journey Brown never envisioned a future without football.",
        "He certainly never envisioned one in racing.The last time he walked off the field after a game, Brown had run for 202 yards and two touchdowns, leading Penn State to a 2019 Cotton Bowl victory over Memphis. He had every reason to believe that he would one day be back in AT&amp;T Stadium, the home of the Dallas Cowboys, leading an NFL team to another victory.\"The only NASCAR I knew was `Talladega Nights,´\" Brown said of the slapstick film starring Will Ferrell, \"and my next-door neighbor had a Dale Earnhardt Jr. flag.\"Brown knows a whole lot more these days. On Saturday, he walked through the infield gate at Kansas Speedway and joined his new teammates from Trackhouse Racing, where he's learning the ropes as a pit crew member.The winding road to reach this point was long and unexpected, beginning not long after that December game in Texas.",
        "Brown was undergoing a routine COVID-19 test during the height of the pandemic. Brown joked with the doctor that he had a good heart, one capable of pumping enough blood through his body to power those long TD runs, when the doctor turned to him with a grim-faced expression. The doctor told Brown that something was amiss - there was something concerning with his scans - and he'd need additional testing.",
        "Soon afterward, Penn State coach James Franklin called him into his office and delivered the news: Brown had hypertrophic cardiomyopathy, a thickening and stiffening of the heart wall, and it would be too dangerous to continue playing football.All those pictures of what the future might hold evaporated that day in the office.\"I was always confident in my abilities in football,\" Brown told The Associated Press during a wide-ranging interview. \"For me, the confidence I had in myself, I know I would have been in the league, and I would have played for as long as I chose.\"Then,\" Brown said,\" that wasn't an option anymore. And I didn't know what I was going to do.\"He helped out with the Nittany Lions for a bit. He had a job lined up to train budding players in California that fell through, in part because of how expensive it is to live there and in part because of the daughter he had back in Pennsylvania.When Brown got a call about trying out as a tire changer for Trackhouse Racing, he basically blew it off. But a few weeks later, pit coach Shaun Peet called again and convinced Brown to travel to Charlotte and give the operation a look.Brown thought he'd find a bunch of guys turning wrenches in a greasy garage. What he found was a sophisticated research and engineering facility, immaculately clean shop space and a finely tuned team that created an atmosphere not much different from the one in college football.",
        "Peet said he made no promises. But it didn't take long for Brown's athleticism to show. He was faster than the average crew member, quickly getting into position to change a tire. He was stronger than many too, making it easy to fling a 40-pound wheel back to the pit wall. And his dexterity made changing the lugnuts seem natural.Brown wound up spending a week in North Carolina, then headed home to ponder his future. He spoke with family and friends, including Carolina Panthers defensive end Yetur Gross-Matos, one of his old teammates at Penn State.\"I was like, `I think I want to give this NASCAR thing a try,´\" Brown said.He wound up moving to North Carolina late last year and spent most of this year learning the nuances of life as a pit-crew member. Brown may eventually be part of the regular rotation for Trackhouse Racing, which fields cars for Daniel Suarez and Ross Chastain in NASCAR's top series.In the meantime, Brown has bought a house and settled down. He has become an ambassador for AdventHealth, one of the team's sponsors, and spends spare time speaking at schools about the importance of living a healthy lifestyle.It's not the future he envisioned. But it's one he's happy to embrace.",
        "\"I know what my life would have been in the NFL. The life I'm living now, it's the what-if - like, what if I didn't play football? What would I be doing?\" Brown said. \"Right now, I wake up every day curious, because I'm living a life I never knew I would. I'll never forget I was a ballplayer. I love football to this day. But I love this life I never thought I'd be living.\"___More AP auto racing: https://apnews.com/hub/auto-racing and https://twitter.com/AP_Sports"
    ]
}