{
    "articleURL": "/wires/ap/article-12060667/Mac-DeMarco-fame-indulged-199-song-album.html",
    "content": [
        "LOS ANGELES (AP) - Often dubbed the prince of indie music, Mac DeMarco has built a devoted fanbase through his mix of distinct slacker rock and being unafraid to show off his endearingly offbeat personality.",
        "His latest release - a nine-hour, 199-song album - has confounded and stunned fans and critics alike. But for DeMarco, it was a way to reach his next creative phase.\"If I´m going to write something, I need to move forward,\" he said in a recent interview, his first since his opus, \"One Wayne G,\" was released. \"I like this stuff. I´d like to share it. I don´t really know how. I might as well just give it all at the same time.\"The album is a window into DeMarco´s creative process, as well as his extensive range as an artist. He drew the cover art himself as a finishing touch to the personal project. \"It´s a self-portrait. And that´s essentially what `One Wayne G´ is, you know, five years of me,\" he said.The album arrived roughly three months after \"Five Easy Hot Dogs,\" a collection of instrumental songs he recorded during a road trip and is particularly proud of.But more than just a way to get unreleased and some seemingly unfinished songs off his chest, the 33-year-old saw \"One Wayne G\" as an opportunity to subvert expectations of what releasing an album nowadays should look like.",
        "\"People are making music for TikTok or really short songs and there´s like 9,000 writers on a pop song. It´s very single-driven. So, I was like, `Well, I´m going to put out like nine hours and most of it won´t have song titles. It will just have dates,´\" he recalled.",
        "The scope of the album is daunting, but listeners have found rewards in all those tracks. Paste Magazine summed it up: \"There´s a Tender Album Hidden Inside Mac DeMarco´s One Wayne G, But It´ll Take You Nine Hours to Find It.\"DeMarco made a name for himself as a singer, songwriter and multi-instrumentalist known for his laid-back style of music. He has become synonymous with his DIY-ethos and his proselytization of analog recording methods.He showed up for his interview with The Associated Press in the most unfussy way possible. Missing were the combination of publicists, managers and hair and makeup people that often trail stars to interviews.Instead, DeMarco rode his motorcycle to downtown Los Angeles from his home a few miles away, sporting a solid blue hoodie with his keys and a keychain which reads \"Millionaire in Training\" hanging around his neck.And while DeMarco was confused by the question about his missing entourage, the musician conceded that he has reached a surprising level of fame.He built a steady following after he released his second full-length studio album, \"Salad Days,\" but said he doesn´t feel pressure to recreate the same kind of sound that led to his ascent. \"There are a lot of people that want me to just make `Salad Days´ over and over and over again,\" he said. \"But that was a certain period.",
        "\"I´ve made a bunch of records that have made me enough money to live comfortably and like, I´m in a position where I can make the art that I want to make,\" he said. \"I don´t know, I just enjoy -I love music. Music is cool.\"DeMarco likes to segment his music into periods. \"Five Easy Hot Dogs\" emerged from a road trip that he said would only end once he finished the album.\"It all feels like it´s just so encapsulated. It´s kind of like, `This is a period in time. This is where it was made. This is where it was mixed. This is the vibe.´ And you know, for me, I like that,\" he said. \"People can take it however they want, but it was an important period in my life.\"He plans to make his next album the same way, except this time on his motorcycle. Asked how that would work, he grinned, as if having a plan up his sleeve, and replied, \"I´ll figure it out.\"In addition to music, DeMarco has gained a reputation for some offbeat antics.There´s the time he was beaten and tied up on \"The Eric Andre Show,\" or the time he brought Nathan Fielder on stage at his Los Angeles concert and the pair kissed, something DeMarco didn´t remember. Or one might come across his \" Advanced Studio Recording Techniques,\" a series of insightful but mostly absurd videos, during which his face is inexplicably doused in Vaseline.",
        "\"It was fun at first, but then, especially the longer my hair is, the worse it is getting the Vaseline off,\" he recalled. \"It doesn´t matter how much shampoo you use. You have it in there for about a week.\"Although his irreverent attitude is still very much intact, the Canadian musician appears to have matured and mellowed with age. He has cut out caffeine and alcohol, regularly sees an acupuncturist and quit smoking a year ago while on his \"Five Easy Hot Dogs\" road trip.\"I don´t like being beholden to things like that, you know? As humans, we got to have water, you got to have shelter, you got to have food. That´s enough things to be trapped by,\" he said of his spartan lifestyle.But DeMarco still enjoys a good prank. After \"One Wayne G\" dropped, his record label teased a physical release of the 199 songs on social media, something fans will be disappointed to discover is not going to happen.\"We had these fake mock-ups of a vinyl and a cassette and it´s just like, it´s not going to fit. I´m sorry,\" he laughed."
    ]
}