{
    "articleURL": "/sport/football/article-12045969/How-Arsenal-line-season-look-strengthen-Champions-League.html",
    "content": [
        "Mikel Arteta is looking to make big changes this summer to strengthen his squadArsenal boss is targeting a centre-back, two central midfielders and an attackerSportsmail takes a look at how the Gunners team could shape up next seasonManchester City usurped Arsenal and reclaimed top spot after a 3-0 win against West Ham on Wednesday night - and with the Gunners' title hopes looking unlikely, they'll be looking ahead to next season.",
        "Mikel Arteta's team have already secured their place in the Champions League this season and they will need to upgrade for their first season in Europe's elite since 2017. As they look to keep pace with City and ensure they are equipped for their long-awaited return to Europe's top-tier club competition, Mikel Arteta is set to strengthen his squad.It is understood Arteta wants a new centre-back, possibly two central midfielders and a versatile attacker. Here, Mail Sport takes a look at how the Arsenal team could shape up after what is expected to be an unprecedented summer of transfer business at the Emirates Stadium.",
        "GOALKEEPERAaron Ramsdale There is no real contest here - Aaron Ramsdale has firmly established himself as Arteta's No 1. Ramsdale joined Arsenal in the summer of 2021 following three relegations with Bournemouth, Sheffield United and Chesterfield. The 24-year-old has kept 12 clean sheets this season, a record bettered only by Newcastle's Nick Pope and Manchester United's David de Gea. DEFENDERSBen WhiteBen White has established himself as one of the country's best defenders in recent years. White has been a key member of Arsenal's backline this season, but was a notable absentee from Gareth Southgate's England squad. Marc Guehi At centre-back, Crystal Palace's Marc Guehi has impressed Arsenal's recruitment specialists this season. ",
        "But the Gunners are one of many Premier League teams, including Tottenham, keen on the England international this summer. The Gunners want a centre-back amid concerns over William Saliba's long-term fitness while Rob Holding's contract is up next year.Saliba's absence has been a cause for concern for Arsenal in the run-in of the Premier League season, with Holding struggling to deputise for the Frenchman.Arsenal fans have bemoaned their lack of squad depth as a reason for their title charge falling off.Guehi has been a regular for Palace this season, often captaining the side as they head for another mid-table finish in the Premier League. ",
        "His performances at Selhurst Park propelled him into Gareth Southgate's plans with the 22-year-old making his international debut in 2022.He's made 78 appearances for the south London club since joining on a five-year deal for £18million from Chelsea in 2021.William SalibaWilliam Saliba started every one of Arsenal's Premier League games this season before hurting his back in last month's Europa League defeat by Sporting.  In his absence, Arsenal dropped points against Liverpool, West Ham, Southampton and Man City.Oleksandr Zinchenko Oleksandr Zinchenko can play in midfield but has generally been used at left back this season by the north London side.",
        "The versatile Ukrainian reunited with Arteta at Arsenal last summer after completing a £32million move from Pep Guardiola's side.Zinchenko had worked under Arteta previously at City, where the now Gunners boss had spent three years as an assistant to Guardiola.MIDFIELDThomas Partey Since his arrival from Atletico Madrid in 2020, Thomas Partey has become one of the most important players at the Emirates Stadium, and has formed a vital partnership in midfield with Granit Xhaka.Though a holding midfielder by trade, Partey has contributed important goals to his side in games against Tottenham and Leicester, as well as in the Gunners' dramatic comeback win over Bournemouth.Declan RiceWest Ham captain Declan Rice is the Gunners' priority target in central midfield.Rice has been strongly linked with Arsenal now they have qualified for next season's Champions League, but the Hammers' £100million valuation of the England international could yet prove a stumbling block. Despite Rice's deal at the London Stadium expiring in June of 2024, Hammers boss David Moyes is resolute that his captain will not be leaving the club in for a cut-price fee in the summer.Moyes has previously stated that Rice will only depart the club if one of his suitors is willing to break the British record. ",
        "However, Arsenal's quest to land Rice could be hampered by Newcastle's interest in the defensive-minded midfielder.Eddie Howe's side have the funds available to outbid Arsenal in any transfer battle for Rice and the Newcastle manager refused to rule out pursuing a deal for the West Ham star.While their current first choice midfield pairing of Partey and Xhaka have been excellent this season, they are 29 and 30 respectively, while Jorginho is 31.The 24-year-old could be a long-term solution at the Emirates, as Arteta looks to add to a young side.Martin OdegaardOdegaard has been one of the club's most important players and a massive influence on the Arsenal team.He is someone Real Madrid gift-wrapped for the Gunners in 2021, having reluctantly given up on the player they signed as a 16-year-old from Stromsgodset in 2015. ATTACKBukayo SakaSaka has been an ever-present for Arsenal in the Premier League this season.The England winger has played a vital role in their surprise push for the title.Saka had started four of England's five matches at the World Cup in Qatar, contributing three goals and one assist.His displays across the season led to Saka being named Young Player of The Year at the London Football Awards.",
        "Gabriel Jesus Jesus has been pivotal to Arsenal's good form this season and has been praised massively by manager Arteta on several occasions.The Brazilian star joined the Gunners from Manchester City for £45million last summer. Though he has missed several parts of the season with niggling injuries, he is back fit now.",
        "His link-up play has gained plaudits as he has helped transform his side from missing out on the Champions League to genuine title contenders in a matter of months. Moussa Diaby Bayer Leverkusen forward Diaby is believed to be of serious interest to Arsenal. The 23-year-old has had an excellent season, scoring 14 goals so far - adding to his tally of 17 last term.Arteta wants to add further depth to his attacking options with Bukayo Saka, Gabriel Martinelli, Leandro Trossard and Reiss Nelson his main options in attacking midfield.Diaby is likely to cost in-excess of £50million, but the Gunners will face competition for the former PSG star's signature with Manchester United, Newcastle and Real Madrid all linked with the exciting attacker.Wilfried Zaha is out of contract at the end of the season and is also a consideration for Arsenal, but they want to pursue a move for Diaby before exploring a potential free transfer for the Crystal Palace star.",
        "Their expected move to sign a new forward is set to be fuelled by the expected departure of Nelson, who Mail Sport can reveal has rejected the offer of a new contract amid a growing belief the forward will leave at the end of the season when his contract expires.It remains to be seen whether Arsenal make Nelson an improved offer before his deal expires in June. But his first-team chances will be limited at the Emirates in the future amid a feeling it may benefit his career if he plays regular football elsewhere.Brighton are interested and will make Nelson a formal offer, though there are other interested parties in the Premier League and abroad.",
        "Interest in Romeo Lavia and Moises CaicedoSouthampton's teenage midfielder Romeo Lavia is also of interest, while the Gunners remain keen on Brighton's Moises Caicedo. The 19-year-old Belgian only joined the Saints last summer in a deal worth up to £14million, signing a five-year contract.The teenager has impressed this season, despite Southampton's struggles in the league.The Red Devils are among several clubs to have eyed a move for Lavia, with Chelsea having enquired.",
        "Both Arsenal and Chelsea came in for 21-year-old Ecuador international Caicedo towards the end of the January window, with the Gunners seeing a bid worth as much as £70million rebutted by Brighton.Murmurings of a January move first began to emerge when Chelsea submitted a £55million bid for the midfielder amid uncertainty over whether a move for primary midfield target Enzo Fernandez would materialise.Arsenal then joined the bidding war, offering Brighton £60million. Both offers were rejected, with the south-coast club insisting he was not for sale that window.That prompted Caicedo to release a statement expressing his desire to leave.What could it mean for homegrown players?The north London side will also look to offload some of their fringe players with the likes of Folarin Balogun, Kieran Tierney, Rob Holding and Emile Smith Rowe set to attract interest this summer. Groin surgery in September, on a tendon problem that had blighted him for four years, brought his campaign to a halt and Smith Rowe has not forced a way back into Arteta's starting XI since returning.Patino is likely to leave Arsenal this summer as he looks to secure regular first team football.The 19-year-old, who has made two first team appearances for the Gunners since signing a professional deal in 2020, has been a regular on loan at Blackpool this season.",
        "Despite the the Tangerines enduring a tough campaign that has left them 23rd in the table, he has impressed in central midfield and made 33 appearances.His contract at the Emirates runs until 2025, but Patino is not expected to stay in North London beyond the summer as he seeks a consistent starting birth.Arsenal are willing to help the teenager find a new club, with a number of sides interested in securing his signature.Balogun has shone for Reims in Ligue 1 this season, scoring 17 goals in 27 appearances for Will Still's side.Serie A giants AC Milan are believed to be one of a number of European clubs keen on Balogun and he has left the door open to an exit after claiming 'a lot could change'.Balogun has two Premier League appearances to his name, having started in Arsenal's 2-0 loss to Brentford on the opening day of last season.The youngster will return to north London when his loan spell in France ends at the end of the season but faces stiff competition for minutes.He will battle it out with the likes of Jesus, Eddie Nketiah and Leandro Trossard for a place in Arteta's side next season. "
    ]
}