{
    "articleURL": "/health/article-12060251/Ray-Liotta-silent-killer-condition-suffered-HALF-Americans-45.html",
    "content": [
        "Ray Liotta was suffering from arteriosclerosis when he died last yearThe NIH warns that half of people aged 45-84 suffer from the heart conditionREAD MORE: Hollywood stars pay tribute to the Goodfellas actorRay Liotta was suffering from damaged arteries when he died last May - an extremely common but lethal condition.",
        "Medical records show the Goodfellas star, 67, died in his sleep from a combination of heart failure, respiratory failure and fluid build-up in his lungs while filming a movie in the Dominican Republic last year.Each of these complications can be caused by arteriosclerosis, which occurs when arteries responsible for carrying blood from the heart to the rest of the body become damaged.The National Heart, Lung and Blood Institute (NHLBI) warns that half of Americans aged 44 to 85 are suffering from the condition, with many not even knowing. It denies other organs vital oxygen and causes dangerous bottlenecks of blood, which could lead to clotting in the lungs.",
        "'Atherosclerosis develops slowly as cholesterol, fat, blood cells and other substances in your blood form plaque,' the NHLBI, a part of the National Institutes of Health, writes.'When the plaque builds up, it causes your arteries to narrow. This reduces the supply of oxygen-rich blood to tissues of vital organs in the body.'This type of build-up often occurs in people who suffer from health issues that impact blood circulation, such as high blood pressure, blood sugar or cholesterol. Smoking and obesity are also known risk factors. Mr Liotta famously smoked for much of his life before quitting in 2018.Mild cases of atherosclerosis do not usually have symptoms, and signs do not occur until an artery is so narrowed it cannot supply blood to organs and tissues. Blood cots in the arteries can cause heart attacks or strokes.",
        "For a heart attack, the sufferer might have chest pain, lightheadedness, shortness of breath, nausea or vomiting.Chest pain or pressure (angina) may also occur if you have atherosclerosis in your heart arteries.With a stroke, someone may be confused or feel dizzy, have a severe headache and vision problems.If the atherosclerosis in the arteries leading to your brain, you may experience sudden numbness or weakness in your arms and legs, according to The Mayo Clinic.You may also have trouble speaking or slurred speech, loss of vision in one eye and drooping facial muscles.These are indicators of a transient ischemic attack, which if left untreated, can lead to a stroke.Atherosclerosis in the arteries in your arms and legs can cause symptoms of peripheral artery disease, including leg pain when walking. Atherosclerosis in the kidneys, meanwhile, can trigger high blood pressure or kidney failure. Research suggests that people with atherosclerosis have a 250 percent higher risk of dying from heart failure than their peers.While the heart will still be beating the build-up in the arteries prevents oxygen from reaching vital organs. Sufferers may die within minutes without medical attention.Poor blood flow to the lungs can affect the organs' ability to gather oxygen. ",
        "There are many types of abnormal heart rhythms.",
        "This could lead to respiratory failure — when the lungs can no longer breathe. In a 2020 study, 80 percent of patients with a form of atherosclerosis suffered respiratory failure.Blockages of blood circulation can also lead to the fluid getting stuck in the lungs, unable to circulate back to the heart.Blood that cannot escape will begin to build up in the alveoli, air sacs in the lung responsible for gathering oxygen and distributing it to the bloodstream.This leads to a build-up of fluid in the lungs, called pulmonary edema. Around 1million Americans suffer the condition each year, almost always alongside a case of heart failure.This further depresses the body's ability to gather air and can often lead to death.There are multiple forms of the atherosclerosis. The most common is coronary artery disease, when plaque builds up in arteries around the heart.Coronary artery disease alone is responsible for 610,000 deaths in the US every year, making it the leading killer of Americans. It remained in the top spot even through the Covid pandemic.Peripheral artery disease occurs when plaque build-up in the legs, arms or pelvis restricts blood flow.  Many people who suffer from this condition require amputation, as the severely restricted blood flow causes issues for a person's limbs.",
        "Other types include carotid artery disease — build up in the neck arteries, renal artery stenosis — clogged arteries responsible for supplying the kidneys with blood, and vertebral artery disease — affecting arteries in the brain."
    ]
}