{
    "articleURL": "/wires/ap/article-12040159/Call-Abrams-big-hits-7th-Nats-beat-Cubs-4-1.html",
    "content": [
        "WASHINGTON (AP) - Alex Call hit a two-run double during a three-run seventh inning, and the Washington Nationals beat the Chicago Cubs 4-1 on Tuesday night.",
        "CJ Abrams had the tiebreaking RBI single in the seventh off Keegan Thompson (1-2) as part of a 3-for-3 night. Victor Robles followed with an infield hit and Call doubled to the gap in left-center to make it 4-1.\"Straight joy, happiness and a lot of fun, because the guys are going crazy,\" Call said. \"Obviously, any time you win or have a big hit, that´s why you play.\"Chicago´s Patrick Wisdom tied for the major league lead with his 11th homer, a 426-foot shot off Mason Thompson in the seventh that tied the game at 1-1.Trevor Williams, a former Cub, pitched into the sixth inning for Washington and departed with a 1-0 lead. Hunter Harvey (1-1) got the final out of the seventh, then allowed two baserunners in the eighth but got out of the inning when he caught Wisdom looking with a 98 mph fastball.Kyle Finnegan finished for his sixth save. Williams appreciated the effort by his relievers but aspires to make it easier on them.",
        "\"Thankfully we have been going five-plus (innings) every time,\" Williams said. \"I´d like to see that go to six-plus every time and seven-plus. We just turn the calendar to May and I´m looking forward to getting to the field tomorrow and getting ready for my next start.\"",
        "Cubs right-hander Hayden Wesneski allowed one run on five hits over six innings. Luis García smacked a run-scoring single to center in the third to put the Nats ahead 1-0.Williams, who made 12 starts for the Cubs in 2021, gave up four hits and struck out four in 5 1/3 innings, his first scoreless outing this year.\"If you are teaching our young pitchers what he is doing so well, he attacks the strike zone with all his pitches,\" manager Dave Martinez said. \"He´s got a great plan. He knows what he wants to do. But it´s all about being in the zone with him. He´s not afraid to throw the ball in the zone. He does it really well.\"Another former Cub, Carl Edwards Jr., got out of a bases-loaded jam in the sixth by striking out pinch-hitter Trey Mancini and inducing a weak infield popup from Eric Hosmer.Nico Hoerner´s on-base streak ended at 26 games. The Cubs second baseman went 0-for-5 with a strikeout.\"I thought Trevor Williams threw really good, kept us off balance,\" Cubs manager David Ross said. \"We had that one inning that we had a shot but weren´t able to come through.\"TRAINER´S ROOMCubs: With C Yan Gomes still under evaluation, the Cubs called up C Miguel Amaya from Double-A Tennessee. LHP Ryan Borucki was designated for assignment. ... RHP Jameson Taillon threw 45 pitches in a simulated game on Tuesday. ... RHP Kyle Hendricks will pitch Wednesday for Triple-A Iowa. Nationals: OF Corey Dickerson (left calf strain) took batting practice Tuesday.",
        "UP NEXTCubs RHP Marcus Stroman (2-2, 2.29 ERA) goes to the mound Wednesday night for his eighth career start against the Nats. Washington RHP Jake Irvin, a 2018 fourth-round selection out of Oklahoma, will make his major league debut. RHP Cory Abbott was sent to Triple-A Rochester.___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}