{
    "articleURL": "/wires/ap/article-12060937/Arkansas-ailing-feeling-good-SEC.html",
    "content": [
        "Arkansas has had as bad a run of injuries as Dave Van Horn has seen in his 21 years as coach.",
        "Yet here the Razorbacks are, ranked as high as No. 3 in the polls and tied with Vanderbilt for first place in the Southeastern Conference.Arkansas (36-12, 17-7) followed a home sweep of Texas A&amp;M with a road sweep of Mississippi State this past weekend. The Razorbacks are a half game up on LSU in the West Division.\"Yeah, the team is kind of unreal, to be honest with you,\" Van Horn said. \"They show up every day to play and they think they can win. They did it this weekend. Obviously, we´re all happy where we are.\"The Razorbacks' health problems surfaced a week before opening day when it was announced No. 1 pitcher Jaxon Wiggins would have Tommy John surgery and miss the season.Koty Frank went out in early March with a back muscle injury, Brady Tygart missed eight weeks with an elbow problem, and last week Van Horn announced Dylan Carter would undergo Tommy John surgery.Left fielder Jared Wegner (broken thumb) has been out since April 11, center fielder Tavian Josenberger (hamstring) since April 22 and second baseman Peyton Stovall since April 29.Peyton Holt has taken over at second, Jace Bohrofen has moved from right to center, Kendall Diggs has been playing right after being the designated hitter, and Mason Neville and Hunter Grimes have split time in left.",
        "\"We have a lot of talented kids on the team,\" Bohrofen said. \"It´s not just us fighting injuries. I know some other teams are banged up. How the guys who come off the bench, it´s what they do when you don´t have your starters out there, and I think we´ve done a good job of contributing, stacking quality at-bats and having quality outings on the staff as well.\"The Razorbacks host South Carolina this weekend and end the regular season at Vanderbilt.IN THE POLLSWake Forest (39-7), which won two of three against nationally ranked Boston College and has won all eight of its Atlantic Coast Conference series, overtook LSU atop the polls after the Tigers lost two of three to Auburn.The Demon Deacons have outscored conference opponents 155-77 in 23 games and, at 18-5, lead Duke by four games for best overall league record.LSU (37-10), now the consensus No. 2 team, got a career-high 15 strikeouts from Paul Skenes in its 3-0 win at Auburn on Friday, but the Tigers came back to win 8-6 and 12-2 in an eight-inning game ended on the mercy rule.D1Baseball.com and Collegiate Baseball newspaper rank Arkansas third. Vanderbilt (34-13) is No. 3 by Baseball America.TIDE ROLLS ONAlabama's series win over Vanderbilt at home was the Crimson Tide's first over a top-five opponent in almost a year and came in the wake of the gambling scandal that cost coach Brad Bohannon his job last Thursday.",
        "Catcher Mac Guscette, who collapsed on the field at LSU last week after getting hit in the neck by a wild pitch, hit a tiebreaking, eighth-inning homer in Sunday's 2-1 series-clinching victory. The game drew a sellout crowd of 5,800 and ended what interim coach Jason Jackson called an emotional week.\"I know our fans and all of 'Bama Nation are going to be behind these guys right now,\" Jackson said. \"And believe me, they love it and they feed off it, so keep it coming.\"STANFORD SWEEPStanford moved back into the top five of the polls after a sweep at Arizona State. Tommy Troy homered in all three games and Alberto Rios connected twice Friday and once Sunday as the Cardinal moved 3 1/2 games ahead of Sun Devils in the Pac-12.AROUND THE HORNCalifornia homered 12 times in three games while sweeping UCLA on the road for the first time since 1991. ... Florida sustained a crushing series loss at Texas A&amp;M when Travis Chestnut scored on Brandon Neely's balk in the bottom of the ninth inning to give the Aggies a 3-2 win. ... Nolan Schubart hit two grand slams and homered a third time to finish with 10 RBIs in Oklahoma State's 20-7 run-rule win over East Tennessee State on Sunday. ETSU's Cameron Sisneros also homered three times in the game and finished the three-game series with five. ... Mississippi's Calvin Harris set a school record with four home runs in a 20-12 win over Missouri on Saturday.",
        "___AP college sports: https://apnews.com/hub/college-sports and https://twitter.com/AP_Top25"
    ]
}