{
    "articleURL": "/news/article-12056303/Wagner-chief-insists-promised-ammunition-needed-amid-threats-leave-Bakhmut.html",
    "content": [
        "Prigozhin claims assurances made to keep supplying Wagner with weapons He said on Friday that Wagner would pull out over lack of sufficient munitionsWagner Group's chief appeared to ditch plans to withdraw from the contested city of Bakhmut, Ukraine after saying he has been promised as much ammunition and weaponry as needed to stay on amid a clash with top 'fat cat' Russian officials.",
        "Yevgeny Prigozhin said on Telegram on Sunday that he had received assurances that Russia would supply his mercenaries with the necessary munitions to stay in Bakhmut after announcing he would pull his men out on Friday.Prigozhin, who has been critical of Russia's defence minister Sergei Shoigu, said previously that officials in Moscow had been consumed by 'petty jealousy' and withheld crucial supplies to his men, resulting in 'useless and unjustified' losses.But in an audio message posted today, Prigozhin said: 'Overnight we received a combat order, for the first time in all this time.'We have been promised as much ammunition and weapons as we need to continue further operations. We have been promised that everything needed to prevent the enemy from cutting us off (from supplies) will be deployed on the flank.'",
        "The Wagner Group of mercenaries has worked closely with Russian state forces throughout the invasion of Ukraine - as well as in other operations around the world.The private military company was first spotted in Ukraine in 2014, weeks after Russia annexed Crimea.",
        "The group has been accused of human rights abuses throughout Africa - and since in Ukraine.It has claimed credit for a number of significant gains in Putin's invasion of Ukraine, including the capture of Soledar. ",
        "The US has estimated Wagner is spending around $100mn a month to stay in the fight, and reports have shone a light on the 'human wave' death squads pushed into the fight in suicidal marches under heavy gun and artillery fire.Prigozhin has all the while been critical of Russia's generals.While he has been an essential part of Russia's invasion, experts have identified a 'crack' in his relationship with the state as a result of his attacks on official institutions.The threat to leave Bakhmut is the latest in a series of tensions as Ukraine appears to be gearing up for a spring counter-offensive into occupied regions. Yohann Michel, a research analyst with the International Institute for Strategic Studies, said previously that Prigozhin's threat of backing out could be taken with a 'shovel of salt'.He said Prigozhin might want to regroup without being accused of retreating, or he may worry about being fired for not taking the city and prefer to say he left on his own, or he could genuinely need more ammunition.'The only thing I am taking seriously from that declaration is that Bakhmut is probably not ready to fall.'If Prigozhin did pull Wagner’s troops out of Bakhmut, it would have serious implications, he urged.'If he’s removed from the front line — except if Russia surprisingly has reserves that they did not want to use before — I think we can say it is the end of this phase of the offensive for Russia.' ",
        "During the saga, Prigozhin and Chechen Republic Head Ramzan Kadyrov stated their intention to replace Wagner Group forces with Chechen Akhmat troops on 10 May.Prigozhin had published a letter to Shoigu declaring Wagner would hand over its positions in Bakhmut at midnight on 10 May, the time he said Wagner would have entirely run out of combat potential.Akhmat forces had already been scattered through parts of Ukraine this year but have not yet committed to major operations. "
    ]
}