{
    "articleURL": "/femail/article-12059087/See-fabulous-videos-Coronation-weekend-Daily-Mail-Royals-TikTok-account.html",
    "content": [
        "Our new TikTok account DailyMail Royals offers all the latest Royal Family news Feel like the Coronation went by in the blink of an eye? Then our new TikTok account has got you covered.",
        "Daily Mail Royals offers all the latest Royal Family news  on video - meaning you have the chance to relive all they key moments from the historic weekend again. Our expertly-curated coverage includes highlights from the service at Westminster Abbey to last night's Coronation concert outside Windsor Castle. Relive Prince Louis' cutest moments from the coronation as well as hearing from members of the public who lined the streets of London for the coronation. With the Prince and Princess of Wales meeting more members of the public today, we'll be bringing you even more clips as the Coronation celebrations continue.",
        "The launch of our TikTok account last month coincided with our new Royal Channel, which boasts exclusive stories going right to the heart of life in the Royal Family.By following the @dailymailroyals account, viewers have access to rare archive footage, unrivalled columnists bringing unique insights into the workings of The Firm, and original expert analysis on breaking royal news.And it's not just the British Royal Family which features on our TikTok account.Our comprehensive coverage also includes royals from around the world - from Princess Charlene of Monaco to Queen Rania of Jordan.Both the channel and social media page offer fascinating historical content from our unique Daily Mail archive.It also features fabulous lifestyle content, celebrating the best of fashion, beauty, property and travel - all with a regal twist.",
        "For instance, stylist Alice Hare gave her tips for dressing like Princess Diana earlier this week.What's more, we also brought our followers footage of the cast of The Crown celebrating as they finished filming season six of the hit Netflix show. ",
        "The new social media page - which will also include behind-the-scene action form our royal talk show Palace Confidential - follows the incredible success of our Daily Mail TikTok account, which has more than 4.7million followers.Last month, the Daily Mail's Diary editor Richard Eden opened up about Queen Camilla's alleged reaction to Prince Harry's description of her in his bombshell biography Spare.Still not convinced? Why not head on over to the TikTok page and see for yourself the wonderful royal coverage it has on offer... "
    ]
}