{
    "articleURL": "/wires/ap/article-12055259/Perez-wins-pole-Miami-continues-chasing-Verstappen.html",
    "content": [
        "MIAMI GARDENS, Fla. (AP) - Sergio Perez will start from the pole at the Miami Grand Prix, where he has been given clearance to race for both the win and the championship.",
        "Perez trails Red Bull teammate Max Verstappen by just six points in the championship standings and team boss Christian Horner vowed in Miami to allow the drivers to race for the title. Verstappen, the two-time reigning F1 champion, and Perez each have two wins this year as Red Bull has swept all four races and finished 1-2 three times.The pole for Perez was the third of his career, but the other two were on the street circuit at Jeddah. Perez won the Azerbaijan Grand Prix and will try to make it two straight Sunday.\"Checo! Checo! Checo!\" the crowd chanted for Perez while waving Mexican flags.He said the Saturday qualifying effort was a massive turnaround after he had struggled through all three practice sessions.\"Everything came more alive and we were just playing with the tools and we put the lap in that we needed,\" Perez said before explaining why he was having such a tough weekend.",
        "\"Everything. It wasn't coming together. It was one of those weekends where we were struggling with balance, confidence, this tarmac is very sensitive to temperatures.\"Qualifying came to a halt with 96 seconds remaining when Charles Leclerc crashed his Ferrari into a barrier. Leclerc also crashed on Friday.Fernando Alonso will start on the front row for the first time in his resurgent season with new team Aston Martin. He's seeking his 33rd career F1 victory, which would be a first for Aston Martin.",
        "Carlos Sainz Jr. qualified third for Ferrari and was followed by Kevin Magnussen in his highest-qualifying effort of the season. Magnussen drives for Haas, the only American team in F1.Pierre Gasly of Alpine qualified fifth and was followed by George Russell of Mercedes and Leclerc.Verstappen qualified ninth.Horner this weekend praised Perez's start to the season.\"Checo´s had a fantastic start to the season. He´s started the season stronger than he´s ever done,\" Horner said. \"And I think that, as we all know, confidence is a big thing in in any sport and Checo´s confidence is sky high, and this championship is going to be a marathon and there will be highs and lows to it along the way, I´m sure.\"But, his challenge, and the challenge for both drivers is maintaining the consistency.\"He also acknowledged that Red Bull will allow Perez to challenge the two-time champion.\"I think the most key thing is to ensure that paranoia doesn´t creep in and that both drivers are treated equally. You go to pains to provide equality, to the point of who drives out the garage first each weekend, you know, it alternates. It even alternates in the debrief who talks first,\" Horner said. \"I think so long as the drivers know that they´re both getting an equal chance and it´s ultimately down to what they do on the circuit, that´s where you want it to play out, not through reliability, for example, to play a key role in a championship fight between your two drivers within your own team.\"",
        "Seven-time F1 champion Lewis Hamilton failed to advance out of the second round and will start 13th on Sunday.Both McLaren drivers and Logan Sargeant of Williams were eliminated in the first round of qualifying. McLaren has multiple North American sponsors and considers racing in the United States something of a home stop, while Sargeant was born and raised about 20 miles away from the track in Fort Lauderdale.Sargeant is the first American on the F1 grid since Alexander Rossi in 2015 and this weekend is his first visit to the Miami circuit.\"Are we through?\" he asked over his radio with clear dejection in his voice following the qualifying session.\"P20. It's very tight,\" was the reply he received.\"It's been a tricky weekend so far, I have been struggling to get comfortable. I feel like we made a pretty good step from (third practice to qualifying) just super fine margins,\" Sargeant said later. \"It is what it is. Just move on.\"___https://apnews.com/hub/auto-racing and https://twitter.com/AP_Sports"
    ]
}