{
    "articleURL": "/femail/article-12044385/Dietitian-reveals-exactly-order-Chipotle-want-lose-fat.html",
    "content": [
        "Jacqui Burke is known as @glowup.nutritionist on TikTok In a recent video, she demonstrated how to order Chipotle for fat loss She advised picking any protein you want but limiting yourself to one fat source A registered dietitian has shared how to order a satisfying Chipotle meal that will fill you up but still help you lose fat. ",
        "Jacqui Burke, who is known as @glowup.nutritionist, has more than 52,000 followers on TikTok, where she shares tips on losing fat and boosting your metabolism without depriving yourself. The expert has explained on her page that eating healthy isn't the same as eating for fat loss, which is why people often struggle to see results. In a recent video, she used the app's green-screen function to walk viewers through her protein-packed Chipotle order. ",
        "'First up, you are gonna select a bowl, and then pick any protein you want,' she said. 'I, personally, always get chicken, but they're all great choices.'Carbs are next up on the menu, and she explained that you should choose either rice or beans — not both.  Burke likes to get brown rice, but she noted that you should 'choose the one you want the most.' 'The fun part is the toppings,' she continued. 'So first off, salsas. Get as many salsas as you want. They add flavor and they're pretty low cal.'When putting together her bowl, she opted for tomato salsa, green salsa, and corn salsa.  'Where you really want to be mindful is selecting your fat source,' she explained. 'So you want to choose either guacamole or sour cream or queso or cheese.'She got cheese, but for those who get guacamole, she advised getting it on the side and only using about half of the container. ",
        "Finally, she added some romaine lettuce for extra fiber. ",
        "Burke's final order clocked in at 625 calories, 23 grams of fat, 45 grams of protein, and 62 grams of carbs.  'As you can see with the breakdown of this meal, it has a pretty great balance between carbs, proteins, and fats without breaking the bank from a calorie standpoint,' she said. ",
        "Select whichever protein you wantChoose between rice or beansGet as many salsas as you want Choose one option from guacamole, cheese, sour cream, or quesoIf you opt for guacamole, get it on the side and only use half of the servingAdd romaine lettuce",
        "The dietitian noted that her clients don't count calories, but she still finds it to be a useful tool when dining out. 'It's definitely going to fill you up, but it's still balanced so it won't spike your blood sugars,' she said of the meal. Burke's video comes three months after TikTok user Koli Marks, 25, revealed the Chipotle order that helped her drop four pants sizes in six months.The content creator, who uses the handle @healthkols, went from a size 18 to a size 10 by eating in a mild calorie deficit and getting at least 30 minutes of movement every day.Marks explained that she orders a burrito bowl with a half scoop of brown rice, a half scoop of black beans, sofritas (shredded tofu braised in spices), fajita veggies, and corn topped with a little bit of cheese and sour cream.'My favorite hack is I get a big side of lettuce,' she said. 'I get it on the side because I don't want to get all soggy, and this adds so much volume to my meal.",
        "'You know, this is kind of a wimpy-looking bowl. Like this is plenty of food for one serving, but it is a little bit less than I used to eat, so I like getting the lettuce because it adds volume.'Marks also got a side of Chipotle's honey vinaigrette, which is 220 calories for a small container, but she noted that she only uses half of it.'I realize that it's the same taste,' she said. 'Honestly, sometimes it was kind of overwhelming using all of it.'"
    ]
}