{
    "articleURL": "/femail/article-12059719/Bartender-sparks-FIERCE-debate-revealing-secretly-cuts-customers.html",
    "content": [
        "Benji Spears told TikTok he tricks the patron into thinking he is pouring liquor even if he isn't But the admission has sparked a fierce debate among other social media users READ MORE: The REAL reason servers always put customers' straws into their drinks for them A bartender has caused quite the stir on social media after revealing a shocking tip of the trade.",
        "US-based Benji Spears took to TikTok to show how he secretly cuts off customers when he thinks they have had too much to drink.It involves tricking the patron into thinking he is pouring liquor even when he isn't. But the admission has sparked a fierce debate among other social media users.",
        "In the clip, which has so far been viewed more than 7.5 million times, Benji can be seen standing behind the bar with a glass set down in front of him.He turns his head toward a customer and tells them: 'Yeah, you're good babe, I've got you.'The bartender, who has more than 1.5 million followers on TikTok, then begins to pour a drink.But, rather than add any liquor into the glass, he only pretends to do so and instead fills it with soda only.Benji swirls the freshly-made beverage with a slice of lime before telling the customer that a 'strong one is coming right up.'He uploaded the clip alongside a caption that read: 'When your drunk bestie is insisting another drink but you know they have to work in the morning.'However, the light-hearted clip left other TikTok users fiercely divided in the comments.In one camp, there were those who praised Benji for his work and said he deserved 'kudos' for his actions.",
        "One user wrote: 'As someone who always asks for one drink too many… you are doing the Lord's work out there!'Another added: 'All bartenders need to do this!! Kudos to you!!'And a third simply said: 'I'd feel so safe at your bar.'But, on the other hand, there were those who were less than impressed with the revelation.Someone commented: 'Remind me never to go to this bar.'Another social media user added: 'I don't care how many drinks or beers I had I would pick up on this immediately.'One playfully wrote: 'Don't ever do me like that. Give me extra.'"
    ]
}