{
    "articleURL": "/news/article-12053037/Arizona-esthetician-29-ESCAPED-attacker-stabbed-FIFTEEN-times-dying-wounds.html",
    "content": [
        "Lauren Heike, 29, who was killed on a hiking trail after being stabbed 15 times in the back and chest fought off her attacker and ran away before she collapsedShe was found dead on the Reach 11 trail on April 28, with police launching a week-long manhunt for her killerPolice believe she was 'chased through or over a barbed wire fence' and convicted felon Zion Teasley, 22, has been charged with her murderAn Arizona esthetician who was killed on a hiking trail after being stabbed 15 times in the back and chest managed to fight off her attacker and run away before she collapsed. ",
        "Lauren Heike, 29, was found dead on the Reach 11 trail on April 28, with police launching a week-long manhunt for her killer.She fought for her life and managed to escape after she was 'randomly attacked' by alleged killer Zion Teasley, 22, according to Phoenix Police. But Heike later collapsed and died from the severe stab wounds and her escape may have been a factor as to why it took more than 24 hours for her body to be found. Authorities believe she was 'chased through or over a barbed wire fence' and Teasley, an ex-marine and convicted felon, has been charged with her murder.",
        "Phoenix homicide Lt. James Hester revealed that Heike managed to fight off the attacker and get away before she died.'I believe she fought him off and she was able to get away but her injuries were too severe for her to continue,' he said at a press conference on Friday. He said she likely didn't know Teasley who is accused of killing Heike in a premeditated attack and stabbing her 15 times in the back and chest after stalking her on the hiking trail. Hester added: 'He was quickly located in an apartment not far from the scene.'Officers are still investigating whether Heike was sexually assaulted before the murder but it is likely she was not, according to police. ",
        "Court documents obtained by DailyMail.com reveal that Teasley was captured on surveillance footage following Heike for some time on April 28.He was then caught on camera returning to the area where her body was discovered and climbing back over the fence.A probable cause affidavit also revealed that the suspected killer had recently been fired from his job at a nearby sports store for being 'aggressive' to female employees and stealing.His DNA was found on a shoe that Lauren discarded as she attempted to scale the barbed wire fence.Police were able to track down Teasley because of a sample in their system from a prior felony conviction.Teasley was released from prison in November after being sentenced to three years in prison after pleading guilty to robbery with a deadly weapon, disorderly conduct and robbery in June 2020.He has been charged with breaching his probation, as well as one count of first-degree murder – meaning he could face the death penalty if found guilty.The convicted felon dropped out of the Marine Corps boot camp in San Diego after just four months, first entering the training in March 2019.A Marine Corps spokesman confirmed that he had separated from the training in June 2019, and his arrest documents confirmed that he was not on active duty.",
        "Lauren suffered 15 stab wounds to her upper body and had defensive wounds on her hands.",
        "Teasley was identified from surveillance footage by his probation officer, as well as his former employer.They told officers that he was 'recently terminated for being aggressive toward female employees' as well as stealing from the store.Phone data also placed Teasley in the same area as Lauren before her death, moving in the same direction as the footage.His employer also confirmed that he carried a pocket knife, which police say is consistent with the murder weapon.When arrested by officers the suspected murderer said: 'There's no freaking way I'm here for a sex crime. I haven't been with anyone for a long time.'The probable cause affidavit also stated that during his interview, he spoke about 'growing up as a Christian, and his internal struggle with his own sexuality.'It added: 'Zion was concerned about the salvation of his soul due to his thoughts'.He also identified himself as being the man in the footage, before telling officers he recognized Lauren from the news and 'wanted to look like her'.Teasley claimed that he was 'walking to a nearby movie theatre', and admitted to officers he knew Lauren was attacked but 'struggled to admit she was murdered'.",
        "When asked if he had planned to kill Lauren he said: 'I am definitely not the person who plans to kill another person. If I was going to do something like that it wouldn't be premeditated. 'During his first court appearance he was given a $1million cash bond for the violation, but was remanded into custody with no bond in relation to the murder charge.Prosecutors told the court that there was 'photographic evidence' linking him to the crime, adding that people who knew him identified him as the person in the surveillance footage released by police.A chilling clip showed a lone figure sprinting on the trail coming from the direction of where Lauren's body was found.Lawyers confirmed that DNA evidence also linked him to the crime, as well as phone evidence, and 'circumstantial' evidence.",
        "The court heard that several people he works with knew he had a knife which they say was 'consistent with the murder weapon.'Prosecutors also confirmed that he was a flight risk, and had bought a plane ticket which was meant to leave for Detroit on Thursday evening.Teasley remained silent during the ten-minute hearing, only speaking to confirm his name and date of birth.He was accused of several counts of kidnapping, assault with a deadly weapon, robbery and burglary in the third degree.",
        "Ten charges were dismissed after he struck a plea deal with prosecutors, with some of the more serious felonies being dropped.Teasley served 16 months in the Red Rock Correctional Facility in Eloy before being released in November.He was arrested at his home in Scottsdale, less than a mile from the trail where Lauren's body was found.Speaking before his court appearance, Sergeant Melissa Soliz said: 'Detectives are serving a search warrant at the man's apartment and he was taken into custody this evening at around 6.30pm.'Right now, he is the person that we believe to be responsible or in connection to the murder of Lauren Heike.",
        "'This is going to take a while for our detectives to sift through all this evidence, process it, collect it and hope to have some more answers later.'With this man taken into custody, I can tell you that he is the same person that was shown on the video clip that we shared with you all a few days ago.'With this information we hope that the community tonight can rest a little easier knowing that this person is off the streets.'Lauren had previously worked as an esthetician for Admire Medical Aesthetics in Washington before moving to Arizona.Teasley's charge comes a day after Lauren's father, Jeff Heike, paid tribute to his daughter saying: 'She was my little girl. I'm really going to miss her."
    ]
}