{
    "articleURL": "/wires/ap/article-12040825/Showtime-UK-readies-pomp-King-Charles-IIIs-coronation.html",
    "content": [
        "LONDON (AP) - The crown has been resized. The troops are prepared for the biggest military procession in 70 years. The Gold State Coach is ready to roll.",
        "Now it´s time for the show.King Charles III will be crowned Saturday at Westminster Abbey in an event full of all the pageantry Britain can muster.Enrobed clergymen will hand over the medieval symbols of power - the rod, the scepter and the orb. Brass bands and soldiers in bearskin hats will troop through the streets. And the new king and queen will presumably end the day on the balcony of Buckingham Palace to wave to the cheering crowds.But don´t be too dazzled. There´s purpose behind the pomp: to buttress the crown´s foundations and show that the people of the United Kingdom still support their monarch.Royal historian Robert Lacey compares the event to a U.S. presidential election and an inauguration rolled into one - a celebration as well as a test of how the public sees the new sovereign.",
        "\"The king obviously is not subject to the vote and so these big public rituals are the closest royal people get to that sort of test,´´ said Lacey, author of \"Battle of Brothers: William &amp; Harry - the Inside Story of a Family in Tumult.\" \"Its basic purpose is to attract the loyalty and interest of British people to demonstrate that crowd outside Buckingham Palace waving at the balcony.\"",
        "But, while TV screens around the world will be filled with flag-waving fans, Charles' coronation comes at a difficult time for the royals.Opinion polls show that support for the monarchy has weakened over time. Britain is gripped by double-digit inflation that is eroding living standards and making some people question the expense of the coronation. And the royal family is riven with controversy as Charles´ younger son, Prince Harry, lobs criticism from his base in Southern California.More fundamentally, some in Britain´s increasingly diverse society want a re-examination of the monarchy´s links to the trade in enslaved Africans and its role in the former British Empire, which ruled over large parts of Asia, Africa and the Caribbean.Kehinde Andrews, a professor of Black Studies at Birmingham City University, questions whether the people of Britain and the Empire´s successor, the Commonwealth, really want a 74-year-old white man as their representative.\"If that isn´t the biggest celebration of white supremacy, I can´t think of what is, especially when you think about the lengths, the pageantry, the jewels and all this stuff, right?´´ Andrews said of the coronation. \"So if you really were serious about saying, look, we want an anti-racist future, there is absolutely no place for this terrible institution.\"The king has tried to address some of those concerns by promising to open the royal archives to researchers studying the family´s links with slavery.",
        "But the coronation will be a broader, more symbolic effort to show the monarchy still has a role to play.The crowning of Charles and Camilla, the queen consort, will feature many of the elements of coronations past - the hymns, the prayers, the anointing with oils - all of which are designed to remind the world of the history, tradition and mystery embodied by the monarchy.But the festivities have been tailored to better reflect modern Britain, where about 18% of the population describe themselves as belonging to an ethnic minority. That compares with less than 1% when Charles´ mother, the late Queen Elizabeth II, was crowned in 1953.For the first time, religious leaders representing Buddhist, Hindu, Jewish, Muslim and Sikh traditions will play an active role in the ceremony. The music will feature pieces written and performed by artists from each of the U.K.´s four nations and throughout the Commonwealth.Symbolically, Charles will open the service by facing a young choirboy and pledging to serve - not to be served - and he has scrapped the centuries-old tradition of having the most senior members of the aristocracy pledge their loyalty to him. Instead, the congregation and those watching at home will be invited to pledge allegiance to the king.",
        "The ceremony will also be shorter - about two hours, instead of three.\"The coronation is about different people celebrating together,\" said interfaith leader Aliya Azam, who will represent Muslims when faith leaders greet the king after he is crowned. \"I think what´s very important is that cohesiveness triumphs over divisiveness, like light triumphing over darkness.\"Sylius Toussaint and his wife, Bridgette, will be watching. The couple celebrated Elizabeth´s coronation as children on the island of Dominica and moved to England in 1960 to find work. A corner of their home in Preston, northwest England, is festooned with royal photos and souvenirs, including a tin of coronation shortbread.Toussaint likes Charles´ efforts to protect the environment and he´s willing to look past the breakdown of his first marriage to the late Princess Diana. He blames the government, not the monarchy, for the immigration crackdown that unfairly targeted him and thousands of other Caribbean migrants in recent years.\"Maybe like the rest of us, he has his faults ... but he´s forgiven,\" Toussaint said. \"I think he will do a good job and we rather like him.\"The question is whether that allegiance is passed on to younger generations.While support for the monarchy has softened over the past 30 years, it is much weaker among young people, according to surveys conducted by the polling firm Ipsos.",
        "One of the monarchy´s strengths is that many see the benefit in having a neutral head of state at times of instability, said Kelly Beaver, the firm´s U.K. chief executive. With Britain facing multiple pressures from inflation to climate change and the war in Ukraine, the king has \"a real opportunity to step forward and to demonstrate leadership,\" she said.\"And so I think, really, for Charles, it´s all to play for.\"Unfortunately for the king, the coronation will also spotlight the family dramas that have rattled the House of Windsor. Chief among those is Charles´ tense relationship with Harry and his wife, Meghan, a biracial American who pundits once thought would help the royal family connect with multicultural Britain.But those hopes crumbled when the couple gave up front-line royal duties and decamped to California three years ago. Since then, they have aired a series of grievances, including allegations that palace officials were insensitive to Meghan´s mental health struggles when she was adjusting to life as a royal, that the Windsors are guilty of unconscious bias in their attitudes on race, and that Camilla leaked unflattering stories about the couple to garner more favorable coverage for herself.After months of speculation about whether they would be invited to the coronation, the palace announced that Harry would attend but Meghan would remain in California with their two children.",
        "If recent royal gatherings are any indication, attention will now shift to the seat assignments inside the Abbey and whether Harry speaks to his father and Prince William, the heir to the throne.\"Where Harry sits in relation to the rest of his family clearly will be of great importance to the international media,\" said Joe Little, managing editor of Majesty Magazine. \"But, you know, Buckingham Palace and the organizers will be aware of that, and they will, I´m sure, come up with the best possible solution under the circumstances.\"All of this - the history of the monarchy, the changes in British society, and even the family drama - will be on people´s minds as they watch the coronation unfold.For Lacey, that´s how it should be. At some level, people will process all of these things when they decide whether to cheer or stay away altogether, just like voters on election day.\"One of the interesting things about the coronation and its symbolism is it´s not just simple celebration,\" he said. \"It does give Britons a chance to look and think about what matters to us.\""
    ]
}