{
    "articleURL": "/femail/article-12045555/What-happened-One-Pound-Fish-man-fishmongers-viral-song-came-price.html",
    "content": [
        "'£1 Fish' man Muhammad Nazir went viral in 2012 video and won a record dealHowever after returning to Pakistan he was not allowed back into EnglandThe 'One Pound Fish' man took the UK by storm in 2012 when a video of the fishmonger selling his wares at a London market went viral.",
        "In the April 2012, just a few months before the London Olympics, Colin Miller filmed Muhammad Shahid Nazir at his stall at Queen's Market in Upton Park to document his novel sales tactics.The original video quickly went viral and, as of this year, has been viewed nearly 20million times on YouTube. 'Come on ladies, come on ladies. One pound fish,' Mr Nazir sang to entice customers.Mr Nazir earned himself a recording contract with Warner Music who helped him create a hit song which was released in December - making for tight competition with X Factor winner James Arthur's cover of Shontelle's Impossible.The song reached number 29 in the charts and the official music video has received nearly double the views of the original viral clip, having been viewed more than 36million times on YouTube as of today.",
        "However, Pakistani native Mr Nazier's rapid success came at a price, as it attracted the attention of immigration officials.He returned to Pakistan in December 2012 just before his student visa was due to expire. At the time people thought he had been deported, but he told the BBC ahe went home so he could apply for a visa to perform in France.Mr Nazir applied to return to the UK, but was rejected as officials claimed he breached his student visa by creating the music video with Warner Music, the New Statesman revealed in 2016.",
        "A 2013 refusal letter from the UK Border Agency told the singing fishmonger: 'By your own admission, during your time of your previous leave in the UK, you were signed as a singer by an entertainment company.'He again applied to return to the UK a year later to work on a film about his life but he was refused by the Border Agency again who said they were 'not satisfied' that he was seeking entry as an entertainer for a limited period.While Mr Nazir told the New Statesman that he had 'technically' made a mistake, he believed the record label should bare some of the responsibility - branding his rejected attempts to return to the UK as a 'very hard punishment'.",
        "He added that he 'made British people happy' with his music, which was inspired by the Bollywood and Punjabi sounds he grew up listening to living in Pattoki, near Lahore in the Punjab reason of Pakistan.Mr Nazir believed he had been banned from applying for entry into the UK for a decade, but the Home Office told the New Statesman in 2016 that he had not been banned and any future applications would be considered on their own merits. He is not believed to have returned to England since he left in 2012 but he has said he would love to."
    ]
}