{
    "articleURL": "/news/article-12060303/The-Wales-release-video-showing-young-children-mucking-Big-Help-event.html",
    "content": [
        "The Wales' led the nation in a day of volunteering taking part in the Big Help Out The Prince and Princess of Wales have released new behind-the-scenes footage of their young children mucking in to help build a Scout hut, as they led the nation in a day of volunteering.",
        "As the long Coronation weekend came to an end, thousands of people up and down the country gave back to their local community as part of the Big Help Out event, created to mark the official crowning of King Charles. Among those hard at work were Prince William and Kate who helped renovate the 3rd Upton Scouts Hut in Slough, Berkshire today with the help of their three young children, Prince George, 9, Princess Charlotte, 8, and Prince Louis, 5.The video compilation showed the three youngsters eagerly taking part, with the adored Prince Louis spotted helping his father drive a JCB digger, pushing a rather large wheelbarrow and shovelling soil.The beaming Princess of Wales was also captured toasting marshmallows on an open fire, helping out her own children and scouts at the event. ",
        "The two elder children were seen painting the park bench, drilling and playing archery, while Prince William was seen navigating a digger. Princess Kate was seen instructing her adorable youngest child Prince Louis on what he needed to do to give a helping hand.She is seen telling Prince Louis, who was seen pushing a wheeling a barrow full of soil back and forth, 'go fill it up again and we'll meet you back here'.The young royal captured the hearts of all those watching as he was seen shovelling sand and painting a planter base which saw him get splashed with paint.",
        "But his efforts were quickly rewarded with a marshmallow-and-chocolate biscuit sandwich. When Prince William took control of a digger that dumped bucket full of earth onto a spoil heap, Louis was sat in his father's lap after seeing nine-year-old George have a go and telling mum Kate 'I want to go in with him'.Louis was given his chance to take charge and asked 'What does this one do?' as he pulled a lever, but was not phased when the digger lurched back slightly and was encouraged by his father, who said 'Keep going Louis, that's it'.Later, the five-year-old prince was given the task of filling a wheelbarrow with builders' sand and he focused on the job, diligently shovelling the material before wheeling the barrow himself. ",
        "Kate watched over her son, telling him to shovel in a 'bit more' and when the barrow was a quarter full, Louis wheeled it away to help volunteers building a path and made a number of runs.The young royals beavered away helping renovate the 3rd Upton Scouts Hut as the adults reset a path, dug a new soakaway, sanded and revarnished a door, screwed together planters and created a mural as a lasting legacy of their work.Louis and Charlotte painted the brick base of a planter with masonry paint and as the young prince sploshed it about, his sister told him: 'You've got paint in your hair! Louis, look at me! Look at me!'",
        "The five-year-old carried on regardless and his sister added: 'You've got to wipe it.'One volunteer asked Louis: 'You might want to be a painter when you grow up?'To which Louis replied: 'No, a fighter pilot.'Nearby, George was given a drill and screwed wooden planters together, helped by a volunteer, as his father also assembled the boxes and at the end William quipped they would have to 'clean up my mess' but was told he had done a 'good job'.A boisterous Louis joined his sister making handprints on a mural inside the Scout building and when asked which prints were his, pointed as he said 'I did one there, there and there'.",
        "The three young royals took part in a game of archery which brought out the competitive spirit in the siblings, and later the family were presented with Scout scarves.Scout member Milena Pereira said about the archery: 'Charlotte mentioned she has done it before at home, but they were all determined to have a go.'They were really nice and respectful, a nice family, so today was a nice surprise, we didn't know they were coming.'Before leaving, Louis was treated to a 'smore' - a marshmallow-and-chocolate biscuit sandwich - as the youngster roasted marshmallows over a brazier.",
        "William smiled and said: 'You won't hear a peep out of him now for about 20 minutes.'And the five-year-old staggered around after taking a bite, as he enjoyed the moment, and bumped into his sister.Kensington Palace described the event as Louis' first royal engagement, although he has attended a number or high-profile royal events it is thought the Slough visit was the first time the prince has actively engaged with the public.Matt Hyde, chief executive of The Scout Association, told the PA news agency: 'We've had an extraordinary day, you could see the Prince and Princess of Wales and their family helped out and had a great time.'Prince Louis was leading the way with the wheelbarrow of sand that he was helping to repair a path.'They were all painting doors, they were helping screw together planting boxes and also there was lots of digging as well, which the Prince of Wales enjoyed."
    ]
}