{
    "articleURL": "/wires/reuters/article-12039495/Florida-prosecutor-suspended-DeSantis-abortion-seeks-reinstatement-US-court.html",
    "content": [
        "By Brendan Pierson",
        "May 2 (Reuters) - A lawyer for a Florida prosecutor on Tuesday urged a federal appeals court to reinstate his client after the state's Republican governor, Ron DeSantis, indefinitely suspended him over his pledge not to prosecute people seeking or providing abortions.\"This governor punishes dissenting voices,\" David A. O'Neil, a lawyer for suspended prosecutor Andrew Warren, told a three-judge panel of the 11th U.S. Circuit Court of Appeals. \"It's what he does.\"O'Neil said suspending Warren, a Democrat who was elected head of the state attorney's office in Tampa, violated his right to free speech under the First Amendment of the U.S. Constitution and subverted the will of the voters who elected him.Henry Whitaker, a lawyer in the Florida Attorney General's office representing DeSantis, said Warren was suspended for his conduct of refusing to enforce the law, not for his speech.Whitaker urged the court to uphold a January ruling in favor of DeSantis by U.S. District Judge Robert Hinkle. The judge found that the suspension violated Florida state law, but that as a federal judge he did not have the power to overrule it.Circuit Judge Kevin Newsom, an appointee of former Republican President Donald Trump, appeared the most skeptical of Warren's case, at one point saying outright that he did not see a First Amendment violation.",
        "Circuit Judge Jill Pryor, who was appointed by former Democratic President Barack Obama, and U.S. District Judge Anne Conway, who normally sits in federal court in Orlando and was appointed by former Republican President George H.W. Bush, also sat on the panel. They did not clearly signal how they would rule.Warren, who won re-election in 2020 as the Hillsborough County state attorney, sued DeSantis last August. He said the governor illegally retaliated against him after he joined prosecutors around the country in signing a statement vowing not to use their offices to criminalize reproductive health decisions. He signed on June 24, the day the U.S. Supreme Court overturned its landmark 1973 Roe v. Wade decision that recognized women's constitutional right to abortion.Florida at the time banned abortion after 15 weeks. Last month, DeSantis signed a bill banning it after six weeks. (Reporting By Brendan Pierson in New York, Editing by Alexia Garamfalvi and David Gregorio)"
    ]
}