{
    "articleURL": "/news/article-12048857/Banking-fears-spark-4-8bn-withdrawals-Britons-record-amounts-cash-accounts.html",
    "content": [
        "The figure was the highest amount withdrawn since records began in 1997  It marked a sharp contrast to recent years when bank deposits increasedBritons have withdrawn record amounts of cash from accounts as fears over the US banking crisis spread around the globe.",
        "As shares in America's regional lenders tumbled yesterday on another brutal day for the sector, Bank of England (BoE) figures showed £4.8billion was pulled out of UK banks and building societies in March.The figure, which was the highest amount withdrawn since records began in 1997, marked a sharp contrast to recent years when bank deposits increased – particularly during Covid as many stuck at home saved vast sums.Monthly negative cash withdrawals have only ever taken place five times, the last being in April 2018. ",
        "Experts said the figures show households are less willing to hold money in banks following the collapse of US lender Silicon Valley Bank (SVB) in March, which damaged confidence and exposed fresh weaknesses in the financial system.A City source told the Daily Mail: 'No doubt about it, this is big. It's the largest month-on-month withdrawal.'Households instead turned to other options, depositing money into National Savings and Investment (NS&amp;I) accounts, while businesses also put their money in gilts.A breakdown of the data showed households deposited £3.5billion into NS&amp;I accounts in March, the highest level since September 2020 when they reached £5billion amid the pandemic.The withdrawals come despite the FSCS savings protection that covers up to £85,000 per individual, per individually licensed bank.",
        "The Bank of England looks set to raise interest rates again next week as it grapples with double-digit inflation.In another blow to borrowers, rates are expected to rise from 4.25 per cent to 4.5 per cent.Paul Dales, chief UK economist at Capital Economics, said there was a 'decent chance' this would be the peak, but warned rates could hit 5 per cent if inflation – which is currently at 10.1 per cent – stays higher than expected. Rising interest rates push up the cost of mortgages and other loans for millions of borrowers.It comes as the European Central Bank also raised interest rates again yesterday from 3 per cent to 3.25 per cent and signalled more hikes to come.",
        "Samuel Tombs, chief economist at Pantheon Economics, said: 'The £3.5billion rise in cash in NS&amp;I accounts shows that some households have shifted savings in order to benefit from a full Government guarantee, while corporate treasurers appear to have allocated more surplus cash to gilts.'While up to £85,000 in bank accounts is protected, there is no limit on the figure the Government protects in NS&amp;Is which makes it an attractive investment in times of trouble. The BoE data is the first detailed insight into how UK households have reacted to the US banking crisis.",
        "SVB went bust nearly two months ago but the fallout continues to reverberate worldwide amid the worst industry turmoil since 2008.Last weekend regional lender First Republic was seized by US authorities and sold to JPMorgan in a £8.5billion deal.It was hoped this would calm nerves but instead contagion spread and last night California-based PacWest became the latest to find itself fighting for survival. Its shares crashed to a record low when trading on Wall Street started yesterday, falling around 40 per cent in a matter of minutes after the bank admitted it was looking for a buyer.The UK fallout has been muted despite a string of banks posting deposit outflows last week. Fears of recession abated yesterday as two reports showed the economy was in better shape than feared.",
        "BoE data showed lenders approved 52,011 mortgages for house purchase in March.That was up sharply from 44,126 in February and the most since October in the wake of the mini-Budget that triggered a lending crunch. A separate report by S&amp;P Global showed Britain's powerhouse services firms grew at the fastest pace in a year. Economics director Tim Moore said: 'A strong rate of service sector growth meant that the UK economy started the second quarter of 2023 in positive fashion.'",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}