{
    "articleURL": "/news/article-12042791/Inside-couples-bargain-mobile-home-luxury-Malibu-trailer-park-Point-Dume-Club.html",
    "content": [
        "Emily Mills, 46, and her partner Barclay Neel, 48, purchased a luxury mobile home from Dvele in 2019 for $495,000 They placed their luxury mobile home in Point Dume Club in Malibu - a private trailer park that is one of the most expensive in the USPoint Dume Club residents pay up to $2million for their homes while the median price in Malibu's zip code is about $5millionA couple scored a bargain home for less than $500,000 in Malibu where their neighbors are spending up to an eyewatering $5million for the same views of the Pacific. ",
        "Emily Mills, 46, and her partner Barclay Neel, 48, purchased the luxury mobile home from Dvele in 2019 for $495,000 and had it trucked to the ritzy Point Dume Club mobile trailer park. The three-bedroom, 2.5-bath home is as eye-catching as any of the luxurious homes littering the Malibu coastline, but the couple paid less than a fifth of the median home price in the area. Within Malibu's zip code, home prices hover around $5million, leaving the glamorous coastal stretch for the rich and famous. The locals at Point Dume Club are themselves paying about $2million for their homes but that does not include land rental. ",
        "Emily and Barclay said their new home was birthed out of tragedy after their original property in Point Dume Club was taken out by the Woolsey fire that burned through 100,000 acres of Malibu and Southern California. 'We went from this really high high of having this brand-new house that burned down,' Mills told Insider.'We were going to move into it, and then it was just ashes.'Their newly built home was burnt to a crisp, but the couple decided to use their insurance money to purchase another Dvele home. 'In the end, we really did get our dream house.'  When purchasing a mobile home, buyers must also lease the land their home is parked on in Point Dume Club - a 24-hour gated mobile home community.",
        "The club is one of the most expensive trailer parks in the US with land rentals ranging anywhere between $400 to $4,000 a month. In order to achieve their stunning home, Mills told Insider she turned to Dvele - a San Diego-based startup that sells prefab and modular homes that are energy efficient and climate resilient. Dvele largely constructs homes in a giant factory before trucking them in large pieces to the homeowner's plot to be installed. ",
        "Their 1,840-square-foot home took four months to construct, which is about half the time a typical house is built, according to the company. But installation took longer for Emily and Barclay as the pandemic was raging and supply shortages and shutdowns affected work crews. The house came with all major appliances so all they had to do was furnish it once it was installed on a cliffside off Route 1. The home has wooden shiplap paneling on the outside, giving the property a modern feel and large windows to let in a ton of California sunshine. It has a small back patio area for entertaining and soft lighting to give a calm and relaxing effect. The back patio is connected to the living area with has two sliding glass doors that operate as windows.",
        "Off the living room, in an open concept, is a large dining room table that seats six and a bar light to keep it well-lit - although Mills and Neels won't need it with the amount of natural light flowing in. Behind the table is a kitchen with additional bar seating, plenty of quartz counterspace, and stainless steel appliances. It also has a home office that is built between two sliding wood doors that can open to create a walkway. The spacious primary bedroom has views of the hillside and a connected bathroom that has a standalone tub. The home also features an outdoor shower to allow homeowners and guests to rinse off after a dip in the ocean. On of the other side of the house, the two other bedrooms operate as Jack-and-Jill rooms that are connected via the bathroom.  "
    ]
}