{
    "articleURL": "/wires/ap/article-12061327/Nuggets-search-answers-dropping-2-straight-Suns.html",
    "content": [
        "DENVER (AP) - Kevin Durant and Devin Booker needed just a little bit more offensive help, someone to take just the tiniest bit of pressure off Phoenix's high-scoring tandem.",
        "Along came Landry Shamet, who elevated his game - five 3-pointers, 19 points - as the Suns equalized the second-round series at 2-2 against the Denver Nuggets.It´s the X-factors who are helping swing a series that moves back to the Mile High City for Game 5 on Tuesday night. Philadelphia also plays at Boston with that series tied at 2-all.Durant and Booker are simply doing what stars do - shine. Same with the Nuggets in Jamal Murray and Nikola Jokic, whose 53-point performance in a 129-124 loss Sunday was overshadowed by a sideline fracas with Suns owner Mat Ishbia (Jokic drew a $25,000 fine from the league for making improper contact).Shamet certainly stepped up for Phoenix in Game 4. The contest before, it was Cameron Payne who started in place of the injured Chris Paul and scored seven points, including a big 3-pointer early in the fourth.Now, it's Nuggets coach Michael Malone's turn to find a counter. Malone hinted it could be extended minutes for veteran point guard Reggie Jackson or possibly more floor time for shooting guard Peyton Watson. It may be a change in schematics, too.",
        "Anything to wrestle back momentum from the Suns.\"We owe it to ourselves to make sure we´re looking at everything we can do to give us our best chance of winning,\" Malone said. \"Whether that´s adjusting the game plan, whether that´s adjusting the rotation, everything is on the table.\"",
        "Booker was sizzling in Phoenix, shooting 79% from the floor and scoring a combined 83 points over two games.\"That´s just Book - he looks for those moments to not just make those shots but send a message to his team that he can carry us,\" Suns coach Monty Williams explained. \"He practices all those shots. I´ve seen it. ... He would sit right here and tell you that even though he made those shots we have more work to do. That´s what I´m going to say as well.\"It was the bench that provided quite a boost for the Suns in Game 4. The reserves for the Suns outscored the Nuggets' reserves by a 40-11 margin, with Shamet leading the way. Terrence Ross and Jock Landale each added eight.\"We knew this series wasn´t going to be easy. They´ve got two of the top few scorers in this league on their team,\" Nuggets forward Michael Porter Jr. said. \"We´ve got to figure out how to slow those guys down a little bit.\"That and finding more options to take the offensive load off Murray and Jokic, the two-time NBA MVP who's averaging 36.5 points, 14 rebounds and 9.5 assists.Aaron Gordon had a big performance in a Game 1 blowout with 23 points. In Game 2, Kentavious Caldwell-Pope went 4 for 4 from beyond the arc, including back-to-back swishes that erased a deficit and put the Nuggets ahead for good early in the fourth quarter.",
        "\"We have to take what they´re giving us,\" said Porter, who's 9 of 25 from deep in the series. \"There are some ways that I think we can get everybody involved.\"76ERS AT CELTICSSeries tied 2-2. Game 5, 7:30 p.m. EDT, TNT- NEED TO KNOW: James Harden´s go-ahead 3-pointer in the closing seconds of overtime proved to be what the 76ers needed to fight off a late flurry by the Celtics in Game 4 and send their Eastern Conference semifinals series back to Boston tied up at two games apiece. Both teams have lost one home game so far in the matchup, while also claiming a win on the road.- KEEP AN EYE ON: The 76ers´ rotation. Coach Doc Rivers acknowledged fatigue contributed to the Celtics being able to fight back from a 16-point deficit in the third quarter. But he plans to stick to an eight-man rotation. Harden (47) and Joel Embiid (46) led Philadelphia in minutes played in Game 4, with four starters logging 40 or more.- INJURY WATCH: Embiid´s minutes were the most he´s played since returning in Game 2 from a sprained right knee. He acknowledged the extra time affected him late in Game 4.- PRESSURE IS ON: The Celtics. Upon further review, Boston coach Joe Mazzulla said he would have taken a timeout following Harden´s go-ahead 3-pointer in Boston´s 116-115 overtime loss in Game 4. \"Hindsight is 20/20. I should have called (a timeout) to help us get a 2-for-1 or a couple more possessions,\" Mazzulla said. \"Obviously, with (18.2 seconds) left, down one you want to get as many chances as you can. So I definitely learned from that.\"",
        "SUNS AT NUGGETSSeries tied 2-2. Game 5, 10 p.m. EDT, TNT- NEED TO KNOW: The Nuggets have gone 39-7 at home this season, including 5-0 in the playoffs. \"We did our job. They did their job,\" Jokic said. \"In the end, it´s going to be an interesting game.\"- KEEP AN EYE ON: Denver´s defense. \"The two games in Denver, I felt our defense was great. We left it somewhere in the desert. It didn´t arrive in Phoenix,\" Malone said. \"That´s got to be paramount. If we´re going to go up 3-2 and get control of the series again, it´s got to start with defense again.\"- INJURY WATCH: Paul remains day-to-day with a left groin strain, but has been getting in some work. \"He´s just getting his shots up and more than likely just seeing where he is,\" Williams said. \"But I haven´t gotten one official report on Chris. So nothing´s changed for me.\"- PRESSURE IS ON: Porter and the Nuggets. The team was a combined 7 of 22 from 3-point range in Game 4, including 2 of 9 from Porter. This after he hit six 3-pointers in Game 3. \"Definitely a must-win,\" Porter said of Game 5.___AP Sports Writers David Brandt and Kyle Hightower contributed to this report.",
        "___AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP_Sports"
    ]
}