{
    "articleURL": "/news/article-12055863/Sydney-woman-Rosemarie-Earley-kicked-Woonona-home-despite-living-50-years.html",
    "content": [
        "An elderly woman is being kicked out of her homeShe has resided at her Woonona home for 50 years An elderly woman who has lived in the same home for almost 50 years is being kicked out of her residence by the government because it doesn't 'meet her needs'.",
        "Rosemarie Earley, 77, has lived at her Pendlebury Parade house in Woonona, in Sydney's south, for 49 years.But following the recent death of her husband, she now faces expulsion as her name was not on the original lease and her application to be recognised as a tenant was rejected.",
        "'(I felt) despair. Like what are they doing to me? I had no idea. I was in tears, like, what am I going to do now?' she told A Current Affair.  Ms Earley and her husband had moved into their home after migrating to Australia from England back in 1971.The pair were allocated their home by the state government a few years after arriving into the country.Mr Earley automatically had his name put on the lease, as Ms Earley explained that women during that time were not allowed to have their name on the lease. The couple inquired about buying the property, but the man who collected their rent explained they couldn't purchase it.Ms Earley recalled the man telling the couple, 'This is your house, you can stay here till you die'.Problems arose with Ms Earley's living situation when her husband died from heart failure last November.The grieving widow contacted the government to be recognised as a tenant so she could stay at the property.  ",
        "The government made the decision to kick her out instead despite the change.Ms Earley said she was so happy when she finally signed the paperwork to confirm she could live in the house, and was left shocked when she was told to leave. 'I don't understand why,' she said.Ms Earley questioned why the government was so eager to kick her out after informing her of the decision less than 12 months since the passing of her husband. ",
        "The NSW Government informed Ms Earley that she would be moved to a 'suitable home to meet her needs' when such a home was found. A spokesman said they recognised the sudden move would be difficult for Ms Earley. 'After living in a home for 49 years, we acknowledge this transition is incredibly difficult and have advised Mrs Earley that she is able to remain at her current property another suitable property is confirmed,' he said.   'Mrs Earley currently resides in a three-bedroom home as a single occupant, we are reviewing home options to accommodate Mrs Earley while providing appropriate housing for thousands of families on the social housing waiting list in need of larger accommodation.''We are committed to providing Mrs Earley and all elderly tenants housing which suits their needs such as lifts, minimal stairs and other modifications.'",
        "Ms Earley has called on the government to 'show some compassion' and has described their treatment of elderly people as 'disgusting'. "
    ]
}