{
    "articleURL": "/news/article-12058807/Second-victim-Texas-mall-massacre-identified-alongside-20-year-old-security-guard.html",
    "content": [
        "Engineer Aishwarya Thatikonda, 27, was shot while shopping for her birthday Security guard Christian LaCour, 20, was killed inside the Allen Premium OutletsKyu Cho, 37, and Cindy Kang, 35 , died along with their young son James, 3READ MORE: Who is Mauricio Garcia? What we know so far about the shooter Two sisters were shot and killed in the Texas mall massacre – as their mother fights for her life in a critical condition.",
        "Fourth-grader Daniela Mendoza and second-grader Sofia Mendoza were both shot dead following the rampage in Allan, Texas.Both attended Cox elementary school, with Wylie ISD Superintendent David Vinson confirming their mother, Ilda, was also shot and remains in critical condition.Vinson said in an email: 'We love your babies, we love them so much. Our love for our kiddos and each other will get us through this. 'Daniela and Sofia will not be forgotten. Hug your kids, and tell them you love them.'The Korean Consulate in Dallas confirmed that Kyu Cho, 37, and Cindy Kang, 35  were both killed in the massacre, along with their three-year-old son James.",
        "Currently their eldest son, 6, is being treated at a hospital and is in a serious condition following the rampage in Allan, Texas.Engineer Aishwarya Thatikonda, 27, and Christian LaCour, 20, who worked as a security guard at the mall, were also killed in the massacre. Thatikonda, originally from Hyderabad, India, had been shopping for her upcoming birthday when she was one of the nine shot dead - including the shooter. She moved to Dallas two years ago to work as a Project Engineer at Perfect General Contractors, was shopping with her friend at the Allen Premium Outlets on Saturday morning when gunman Mauricio Garcia opened fire.",
        "'She was very friendly and very loving,' a family representative told WFAA, adding that Thatikonda's friend was injured in the shooting and is currently stable in the hospital. LaCour was the first victim of the mass shooting to be identified yesterday, with his grandmother Sandra Montgomery describing him as a 'beautiful soul'. 'My beautiful grandson, Christian LaCour, was the security guard killed in the shooting at Allen, Texas. He was such a beautiful soul,' she wrote. In another tribute post shared Sunday, one person who is friends with LaCour's family said he was a 'very sweet gentleman.'",
        "Kellie Smith said she considered herself lucky to have 'watched this sweet young boy turn into a very sweet gentleman,' the woman wrote on Facebook. 'Their will forever be a void. Please uplift his family in prayer as they navigate this unimaginable time of their lives. Christian you will always remain close to us because we will keep you in our hearts until we see you in Heaven,' Smith wrote. LaCour was the first of eight victims to be identified publicly and the identification comes a full day after the shooting took place. Children were among the eight killed during the rampage, where more than 100 rounds were fired. Seven were pronounced at the scene and two at the hospital. ",
        "Additionally, the fire department transported nine victims to hospitals, however, officials say more may have been taken by other agencies. As of the early hours of Monday, there are three victims were in critical condition and four in stable condition, police confirmed to FOX 4.The shooter has since been identified as 33-year-old Garcia. He was gunned down by a police officer after the shooting on Saturday afternoon.Officials are investigating whether Garcia had an interest in white supremacist or neo-Nazi ideologies.",
        " A law enforcement official said federal agents had been reviewing social media accounts and believed Garcia had expressed an interest in neo-Nazi views and had a patch on his chest reading RWDS - an acronym for Right Wing Death Squad, which is popular among extremists and white supremacy groups. Investigators have searched a home connected to the suspect and a Dallas motel near an interstate where Garcia had been staying. The motel room contained multiple weapons, including an AR-15-style rifle and a handgun. A man who witnessed the outlet mall shooting firsthand on Saturday recalled being one of the first people on the scene - rushing to rescue his son from a clothing store where the now-deceased gunman's attack started. Shortly before, around 3:30pm, Steven Spainhouer received a frantic call from his son notifying him that there had been shots fired outside the H&amp;M. ",
        "Footage showed the moment those first shots rang out, in which the unidentified gunman is seen pulling up to the store. Driving over with the intent to save his child's life, Spainhouer explained how he got there before any first responders - and was faced with the monumental task of trying to save lives.'I never imagined in 100 years I would be thrust into the position of being the first first responder on the site to take care of people,' he told CBS News. Spainhouer said he jumped in and tried to help victims who were in need. The man said he attempted CPR and first aid but was shocked by the severity of the situation and several of the victims. ",
        "'The first girl I walked up to was crouched down covering her head in the bushes, so I felt for a pulse, pulled her head to the side and she had no face,' he said of the first victim he came across, a young girl.Dashcam video showed the gunman getting out of a car and shooting at people on the sidewalk on Saturday afternoon. More than three dozen shots could be heard as the vehicle that was recording the video drove off.Garcia was using an AR-15-style gun during the mass shooting, and was dressed in full tactical SWAT gear. ",
        "Allen Fire Chief Jonathan Boyd confirmed that seven people died at the scene, including the gunman, and then a further two victims died in hospital. Three of the wounded were in critical condition in the evening, and four were stable, Boyd said in an update on Saturday night. A Dallas-area medical group said it was treating victims as young as 5 years old. Investigators confirmed they believe shooter Garcia was working alone, but they have not yet released any motive for the killings. Fontayne Payton, 35, was at H&amp;M when he heard the sound of gunshots through his headphones. He said: 'It was so loud, it sounded like it was right outside.'I pray it wasn't kids, but it looked like kids,' he said.  'The bodies were covered in white towels, slumped over bags on the ground. 'It broke me when I walked out to see that.'"
    ]
}