{
    "articleURL": "/femail/homes/article-12040301/Inside-nautical-themed-cabin-hiding-inside-blue-boatshed-Cornelian-Bay-Hobart.html",
    "content": [
        "A blue boat shed has been transformed into a cute cabinIt is in Cornelian Bay in Hobart TasmaniaSitting on the water's edge at the end of a string of colourful cabins lies a blue boatshed that hides a stunning interior. ",
        "The boatshed was built in 1937 and lies on the shore of Cornelian Bay in New Town, Tasmania, just 5.5km from Hobart's city centre. Passersby would assume the quaint shed is just like any other however guests are greeted by freshly renovated rooms with high quality finishes and a stunning view over the water. The whole space measures in at just over 40 square metres and features a roomy kitchen and living space, bathroom, huge outdoor deck and a lounge. Blue-and-white timber panelled walls and diamond-shaped windows give a nautical-chic feel while vaulted ceilings add height to the rooms. ",
        "A 18sqm timber deck is the perfect place to sit and take in the tranquil scenery and a fireplace in the lounge creates a cosy atmosphere.The blue boatshed with a charming red door is the first in a string of sheds along the shore line which are used for recreational purposes only. This is the first time since May 2021 one of the sheds has been put on the market.Listing agent Donna Paton of Fall Real Estate told realestate.com.au she has been inundated with inquires for the cute boatshed which has an asking price of $395,000. ",
        "'I think this boatshed is most probably the best one in Cornelian Bay. Not just because it is beautifully renovated, but because it is located right next to a little beach and it only has one neighbour,' she said. ",
        "'To my knowledge, there are no others available at the moment. However, occasionally they sell privately.'Donna said her brother and sister-in-law have who own the cabin have enjoyed the 'beautiful, special place to spend time entertaining and relaxing' for the past nine years. The agent believes the boatshed will fetch a higher price than the asking as she has already received some generous offers. "
    ]
}