{
    "articleURL": "/femail/article-12060803/Woman-shares-live-saving-PSA-touch-metal-pumping-gas.html",
    "content": [
        "A woman named Nicki, based out of LA, gives life-saving advice for pumping gas Make sure to touch something metal before touching the gas nozzleIf you don't touch metal, an unfortunate spark may produce an electrical fire A woman has shared a life-saving hack on how to pump gas safely in a TikTok 'PSA.'",
        "Nicki Andrea, who is based out of LA, visited a rest stop recently and was told by a man at the gas pump that static from your hands could end in tragedy.After hearing his advice, she took to her video-sharing app with this message to her 94,000 followers: 'Always make sure you touch something metal. Touch your car. Touch something metal, with both hands, before, you touch the nozzle, because that static, can cause a spark that can produce an electrical fire.'She continued: 'The friction from you moving around can happen from cold, dry environments, and something about the static, that you produce when you're getting outside of the car... moving around... touching things....'",
        "The video has gotten more than 230,000 likes, 3,500 comments and 17,500 shares, which showcases that many like Nicki are using the platform for good.Followers were quick to hop into the conversation under the video, with many shocked and others claimed they were surprised that they'd never heard this information before.",
        "Do not keep the engine running: The hot engine mixed with gas vapors can cause an explosionDo not smoke: Gas vapors you can't see could be ignitedDo not 'top off' gas in your tank: It can lead to it being spilledDo not fill gas in plastic bags: It's not a safe place to store it",
        "'I literally can't afford to unlock any more fears UGHHHHHH,' one person wrote.Another added: 'He's not lying I used to work at a gas station and this was part of the safety manual during training.''I get shocked all the time from static so I feel like you just saved my life,' someone else added.",
        "In 2012, a gas station fire once started in the U.S. due to static electricity, KSHB 41 reported.When interviewed, the station owner stated: 'The fire was so intense, that it actually melted the concrete, and completely melted the pump, the gentleman's truck. We've got extensive fire and smoke damage....'The reporter goes on to say: 'Authorities say, it is a good reminder not to get back in your car, while you're filling up. A spark from static electricity can start that fire.'The science is simple: static from your body, or phone, can cause an electrical fire to suddenly occur.Expert Bob Renkes, an Executive Vice-President at the Petroleum Equipment Institute in Tulsa, notes that by the time you touch your phone, your credit card, or go inside your car at the pump, 'you have seven or eight times when you'll dissipate your static electricity.''All it takes is once. So we never have a problem when we initially fuel,' he added.He goes on to say: 'So they're sitting in the car, they generate static, they pop out again, they haven't dissipated their static, and they touch their nozzle. 'As gasoline goes in, the vapors come out of the fill pipe, so you have a source of ignition when your static discharges from your hand to the nozzle – exactly where the vapors are coming out of the fill pipe. So it does happen.'",
        "In this day and age when everyone is on their cellphones, it is very important to note that any and all technology carries static as well. It is strongly suggested to not use your cellphone either, while pumping gas. It is always best to err on the side of caution, especially with such simple instructions of being fully present with your actions when pumping gas.Next time you're at the gas station, stay standing by your pump, touch metal just in case, and don't be distracted by your phone, because a few moments of focus could lead to avoiding serious danger, and not putting yourself and others at risk."
    ]
}