{
    "articleURL": "/news/article-12058069/Toyota-not-sold-Australia.html",
    "content": [
        "New Toyota Prius won't be sold in AustraliaPrevious models suffered dwindling sales Auto journalists and punters are not happy Toyota is drawing flak for its decision not to sell the latest sleek upgrade of Prius hybrid cars in Australia for vague reasons.   ",
        "The Japanese auto giant in November unveiled its fifth generation 2023 Toyota Prius hybrid in Japan and the US. It features a more streamlined look generating headlines on motoring news websites such as 'Lamborghini looks meet fuel-sipping economy'.Australia's motoring community also took notice. Auto journalist Mike Costello enthused: 'It looks great – sleek, stylish and entirely unlike what we've come to expect from Toyota's longstanding eco leader.' However, it won't be spotted on Australian roads - with a Toyota spokesperson telling Daily Mail Australia there were no plans to bring the new Prius Down Under. 'Toyota's hybrid-electric technology is now available across nine models in Australia, several of which are similar in size to the Prius, so we don't see a role for the new Prius at this stage,' the spokesperson said.",
        "'Last year, Toyota sold 72,815 hybrid-electric vehicles and we expect that 2023 will continue Toyota's strong leadership in the sales of these vehicles, building on the proud legacy that began with the original Prius in 2001.'Costello called this decision short-sighted.'In making this decision, it (Toyota) took the wrong lesson from the old model's failure to resonate, and pulled the pin at precisely the wrong time,' he wrote.The new model Prius boasts a more powerful 2.0-litre hybrid system delivering an output of 144kW, which is a big increase on 90kW provided by the previous model's 1.8-litre capacity.",
        "A plug-in hybrid model of the new make offers 164kW and can accelerate from 0 to 100km/h in just 6.7 seconds with an electric driving range that is 50 per cent higher, meaning an extra 60km, from a 13.6kWh battery.When the battery runs low, the Prius will continue to run on its hybrid engine, which has fuel economy of 4.8L/km.Those who purchase the top-line of the new Priuses will get a dashboard with 12-inch touchscreen with Toyota's latest software as well as wireless Apple CarPlay and Android Auto, satellite navigation and over-the-air updates.Other features include dual-zone climate control, heated and ventilated seats, an ambient lighting system, USB-C ports, an electric parking brake, a panoramic sunroof, and on the plug-in hybrid model, solar panels on the roof. Safety features include autonomous emergency braking (AEB), lane-keep assist, adaptive cruise control, blind-spot monitoring, and rear cross-traffic alert.There's also automatic parking, a built-in dashcam, a digital rear-view mirror, and on some models, home power sockets inside the car, allowing external electrical devices to be charged from the car's battery.",
        "Despite the Prius being the company's pioneering and flagship model of battery run cars Toyota has replaced it in Australia with other makes and only 35,000 of the more than 300,000 of the maker's hybrid cars sold in Australia have been Priuses.",
        "Following drastically dwindling sales, which dropped to fewer than 100 in 2021, Toyota retired the Prius from the Australian market altogether last May. Several motoring enthusiasts called it a bad move from Toyota.  'That new model would be the perfect upgrade/replacement for us when the time comes. Come on Toyota! Wake up to yourselves,' one wrote. ",
        "'This is the first Prius I'd actually own. Not based on how it looks compared to other Prius' but how it looks compared to most cars in general. It's that good!' another said.'Stupid, forcing people to buy import again,' another disgruntled Aussie wrote.'Boggles the mind. Say this was $55, it's still $10k cheaper than a Model 3 Tesla, maybe more, looks cooler inside and out, Japanese build quality, decent performance that will sip fuel but offering the best of both worlds!'An article about the new Prius on the auto website Drive also attracted a lot of disappointed would-be buyers.'Toyota Australia again made another mistake, this time by not selling Prius 2023,' wrote one.",
        "'Simply they don't have any idea what Australia customers actually wants, have bad taste and intuition what could sell and what won't be sellable, their decision is purely based on the sales stats.''It's a very poor decision,' another said. ",
        "'I would have seriously considered this for a new daily with the 2.0 if they had brought it to Australia... damn,' wrote another. 'As nice as this is, Toyota Australia knows their target audience and this wouldn't sell here. We're the land of SUVs and Dual Cabs.'"
    ]
}