{
    "articleURL": "/news/article-12053131/George-Soros-Fortress-investment-firm-talks-buy-Vice-400m.html",
    "content": [
        "Vice was reported on Monday to be preparing to file for bankruptcy, despite being valued in 2017 at $5.7 billionOn Friday, the Wall Street Journal reported that two investment groups - Fortress, and one belonging to financier George Soros - were close to a dealThe planned sale of the company to its lenders would value Vice at around $400 million including debt: current management would remain in place Vice Media could be saved from bankruptcy by a consortium of investors that includes George Soros's fund and Fortress - already a significant shareholder.",
        "The deal would value Vice at $400 million, The Wall Street Journal reported on Friday - a far cry from the $5.7 billion valuation of 2017.On Monday it was reported that the company was preparing to file for bankruptcy, but more than five companies had expressed interest in acquiring it, The New York Times said.Friday's deal would see existing management remain in their roles, the Journal reported, and Vice founder Shane Smith kept on in some role. Smith is currently executive chairman of Vice Media.Senior lenders would include Fortress Investment Group, a New York-based fund led by CEO Peter Briger, and Soros Fund Management, founded in 1970 by the billionaire investor George Soros, now 92.",
        "Other shareholders would be wiped out - among them private-equity firm TPG Group, Sixth Street Partners and media mogul James Murdoch, The Journal reported. The drama at Vice comes a little over a week after BuzzFeed News announced its closure, and three months after Vox laid off 130 people, representing 7 percent of staff. Vice is preparing to run a court-supervised sale in a Chapter 11 bankruptcy, the Journal reported, which could be filed as soon as next weekFortress holds senior debt, which means it is first in line for a payout. Other investors - among them Disney - have already written down their investments and are not getting their money back.",
        "'Vice Media Group has been engaged in a comprehensive evaluation of strategic alternatives and planning,' Vice said in a statement on Monday.'The company, its board and stakeholders continue to be focused on finding the best path for the company.'They have not commented on Friday's report. The company, founded in Montreal in 1994 as a free magazine, reached its zenith in 2017 and was seen as an avatar of new media.Its founder, Shane Smith, rocked the establishment with his brash approach and provocative style, venturing personally to North Korea and cartel-controlled Mexican badlands to film rollicking documentaries.",
        "Vice had 3,000 employees around the world, working on a cable network, more than a dozen websites, two shows on HBO, an ad agency, a film studio, a record label and a bar in London.Its headquarters in a hipster enclave of Brooklyn were seen as the coolest place to work in town.But in recent years the company has struggled to find its footing.Smith stepped down in March 2018 after The New York Times published an expose of sexual misconduct within the company and The Wall Street Journal reported Vice missed its annual revenue target by $100 million.He was replaced as CEO by industry veteran Nancy Dubuc, but she left in February this year, along with Jesse Angelo, the company's global president of news and entertainment.",
        "Dubuc was replaced by longtime company insiders Bruce Dixon and Hozefa Lokhandwala as co-CEOs.At the time, the pair said: 'We're both passionately committed to bringing the brand, business operations and creative spirit of Vice forward into the future, and we're excited and grateful for this opportunity to continue to work closely with the board and VMG's exceptional management team.'This is an era of tremendous change for media companies, and Vice's unique brand of news, entertainment and lifestyle content has never been more relevant.'We look forward to building on its success as we chart the next exciting chapter for the company.'Vice was exploring a sale earlier this year, but was damaged by the decision of Greek broadcaster Antenna Group to end a years-long, multimillion dollar contract to buy news content.The contract with Antenna had been seen as a lifeline for its ailing news division. The contract termination signaled that Antenna, long considered a possible buyer for Vice, ultimately wouldn’t step in to acquire the company."
    ]
}