{
    "articleURL": "/wires/ap/article-12039331/Muslim-mayor-blocked-White-House-decries-watch-list.html",
    "content": [
        "A New Jersey mayor who was blocked from attending a White House celebration this week with President Joe Biden to belatedly mark the end of the Muslim holy month of Ramadan called Tuesday for the administration to end the federal \"watch list\" that he said illegally targets Muslims and others.",
        "During a news conference held Tuesday in South Plainfield by the New Jersey chapter of the Council on American-Islamic Relations (CAIR-NJ), Prospect Park Mayor Mohamed Khairullah and several other speakers condemned the list as illegal, discriminatory and unconstitutional. They also called on the U.S. Secret Service and other federal agencies to stop using and distributing the list, which the group says has more than 1.5 million names, a majority of which are \"Arab or Muslim sounding.\"CAIR has called on the Biden administration to cease the FBI´s dissemination of information from what is known as a Terrorist Screening Data Set that includes hundreds of thousands of individuals. The group informed Khairullah that a person with his name and birthdate was in a dataset that CAIR attorneys obtained in 2019.Shortly before he was set to arrive at the White House for the Eid-al-Fitr celebration on Monday, Khairullah said he received a call from the White House stating that he had not been cleared for entry by the Secret Service and could not attend the celebration where Biden delivered remarks to hundreds of guests.Khairullah said Tuesday that he has no idea why his information is on the list and that no one in the federal government will tell him, adding that there´s \"no reason to believe I'm an unsafe person.\" Khairullah noted that he has been detained a few times and questioned while traveling, experiences that he called \"humiliating.\"",
        "\"I´m not upset about not being at the White House,\" said Khairullah, who was elected to a fifth term as his town's mayor in January. \"I´m about human rights. I have a platform to address this issue, but about 1.5 million others don´t ... an incident like this makes me question the progress I thought we had made.\"",
        "Selaedin Maksut, the CAIR chapter's executive director, said there is no transparency in how or why people are added to or removed from the list, and there is no remedy people can seek to have their names removed.\"Two decades after 9/11, we continue to see the harm of the watch lists. We continue to see how it causes difficulties for American Muslims and Americans at large, infringing on their civil rights,\" Maksut said.A Secret Service spokesman confirmed that Khairullah was not allowed into the White House complex, but he declined to detail why. The White House also declined comment.In a statement issued Tuesday night, New Jersey´s two U.S. senators - Bob Menendez and Cory Booker, both Democrats, and Rep. Bill Pascrell Jr. , a Democrat who represents the district where Khairullah lives - announced that they have formally asked the Secret Service and the Biden administration for an explanation of why the mayor was blocked from attending. The trio also asked that he be notified about the \"substantive reasons he was denied admission\" and that his status be reviewed so he may be able to attend such events in the future.",
        "Khairullah was an outspoken critic of President Donald Trump´s travel ban that limited entry to the U.S. of citizens from several predominantly Muslim countries. He also has travelled to Bangladesh and Syria to do humanitarian work with the Syrian American Medical Society and the Watan Foundation.Khairullah said he was stopped by authorities in 2019 and interrogated at John F. Kennedy International Airport in New York for three hours and questioned about whether he knew any terrorists. The incident happened when he was returning to the United States after a family visit to Turkey, where his wife has family.On another occasion, he said he was briefly held at the U.S.-Canada border as he traveled back into the country with family.CAIR said Khairullah helped the New Jersey Democratic Party compile names of local Muslim leadership to invite to the White House Eid celebration and over the weekend was a guest at an event at the New Jersey governor´s mansion.Khairullah was born in Syria, but his family was displaced in the midst of the government crackdowns by Hafez al-Assad´s government in the early 1980s. His family fled to Saudi Arabia before moving to Prospect Park in 1991. He has lived there since.He became a U.S. citizen in 2000 and was elected to his first term as the town´s mayor in 2001. He also spent 14 years as a volunteer firefighter in his community.",
        "Khairullah said he made seven trips to Syria with humanitarian aid organizations between 2012 and 2015 as a civil war ravaged much of the country."
    ]
}