{
    "articleURL": "/tvshowbiz/article-12060151/Ive-bed-bound-Kerry-Katona-agony-arthritis-flare-up.html",
    "content": [
        "Kerry Katona has revealed that she is in 'agony' due to an arthritis flare up in her back and hips that has left her bed bound. ",
        "The former Atomic Kitten star, 42, was diagnosed with arthritis in 2021 after 13 years of unexplained chronic pain. In a new update on Monday she told how her body was 'shutting down' due to the pain and that she has been unable to work for the past few days. She wrote in her Ok! Magazine column: 'I've had a rare couple of days off work this week, but I've been bed bound. I'm in agony with my back and my hips – I have arthritis in my hips.'I've suffered with the pain for a long time, but it's been worse over the past few days. It's like my body knows I have time off work so it shuts down.",
        "'I think it's because I'm always on the go and running off adrenaline. But it's been nice to have a bit of a break, despite the pain.'Three days ago she confirmed she now has arthritis in hips and had to tone down her current exercise and weight loss regime as a result.   She said on Instagram: 'So I've been out of action because I hurt my back and my hips. So I have arthritis in my hips. Bear with me.'Trying to do a workout, my hips are killing, so I'm not pushing it… I get these shooting pains in my legs like I'm getting an electric shock. And my god it really really hurts.'",
        "She then elaborated further: 'I'm trying to train and my left hip is really really tight in that joint, to the point I have been in tears. Crying. Like in so much pain.'Imagine a fly, and you want to pull its wings off, that's what I want you to do, pull my legs off, that's the pain I've been feeling, it's been horrendous. Horrendous. I had a massage, and I could not move. So I have literally stayed in bed.Kerry has previously admitted to struggling with the condition and was diagnosed with arthritis in 2021 after 13 years of unexplained chronic pain.At the time she announced the diagnosis to her followers admitting she was 'over the moon' to finally know what was wrong.",
        "It comes after last week Kerry made a sly dig at the cast of I'm A Celebrity... South Africa admitting none of the contestants 'have grasped my attention'.The TV personality, who won I'm A Celebrity back in 2004, when she starred on the third series alongside the likes of Peter Andre and Katie Price. The launch pulled in half the viewers of the show's original format, but is still ITV’s highest week day audience this year, peaking at 4.9 million TV viewers. And Kerry has given her take on the spin-off series and why she decided to pass on being part of the star line-up.   ",
        "'I'm not watching I'm A Celebrity... South Africa because I'm too busy to watch any telly at the minute. None of the contestants have grasped my attention,' Kerry said.'The only one I adore is Dean Gaffney - he's a good friend and I hope he wins. ITV asked me to be in it. I was already committed to another TV show, but also, I don't think the experience is something that can be relived. 'It was a once-in-a-lifetime opportunity. When I won, it had the highest-ever ratings and I was the first Queen of the Jungle, I wouldn't want to lose that as it was a really special moment for me,' Kerry wrote in her New! Magazine!.  MailOnline contacted ITV for comment at the time. ",
        "Arthritis is a common condition that causes pain and inflammation in a joint.In the UK, millions of people have arthritis or other, similar conditions that affect the joints.Arthritis affects people of all ages, including children.Types of arthritisOsteoarthritis and rheumatoid arthritis are the 2 most common types of arthritis.OsteoarthritisOsteoarthritis is the most common type of arthritis in the UK.It most often develops in people in their mid-40s or older.It's also more common in women and people with a family history of the condition.But it can occur at any age as a result of an injury or be associated with other joint-related conditions, such as gout or rheumatoid arthritis.Osteoarthritis initially affects the smooth cartilage lining of the joint. This makes movement more difficult than usual, leading to pain and stiffness.Once the cartilage lining starts to roughen and thin out, the tendons and ligaments have to work harder.This can cause swelling and the formation of bony spurs called osteophytes.Severe loss of cartilage can lead to bone rubbing on bone, altering the shape of the joint and forcing the bones out of their normal position.The most commonly affected joints are those in the:handsspinekneeshipsRheumatoid arthritisRheumatoid arthritis is less common than osteoarthritis.It often starts when a person is between 30 and 50 years old. Women are more likely to be affected than men.In rheumatoid arthritis, the body's immune system targets affected joints, which leads to pain and swelling.The outer covering (synovium) of the joint is the first place affected.This can then spread across the joint, leading to further swelling and a change in the joint's shape. This may cause the bone and cartilage to break down.People with rheumatoid arthritis can also develop problems with other tissues and organs in their body."
    ]
}