{
    "articleURL": "/sport/boxing/article-12056093/Canelo-Alvarez-John-Ryder-respects-Mexican-defends-undisputed-title.html",
    "content": [
        "Saul 'Canelo' Alvarez has successfully defended his super middle-weight crownHe defeated John Ryder via unanimous decision in Mexico on Saturday nightThe pair were seen in the dressing room after showing respect to each otherSaul 'Canelo' Alvarez has commended John Ryder for his 'toughness' after successfully defended his undisputed super middle-weight crown on Saturday night, following a unanimous decision victory.",
        "It was a gutsy performance from the English fighter, who, in front of 50,000 people in Guadalajara, Mexico, took Alvarez the distance in what was a heroic effort against one of the world's best boxers. The fight was scored 120-107 on one card and 118-109 on the other two, with Alvarez taking the win to go 59-2-2 in his professional career. The Mexican certainly had the advantage, fighting in front of a raucous home crowd, but Ryder, who despite suffering his sixth loss in his 38 fight career, fought gallantly throughout the 12-rounds. After the bout, the pair were seen shaking hands and exchanging words in the dressing room, and it was clear there was no bad blood between them, with Alvarez commending the Englishman for being 'tough.' ",
        "'Good fight,' Ryder can be overheard saying as Canelo approaches him to shake hands. Ryder, who was sporting a swollen eye and a bandage around his nose, added: 'Good shot!'Canelo replied: 'Yeah I know... In the second round. At the end of the second round, right?' 'The last shot as well. Just before the bell,' Ryder said. 'Yeah! I felt it. You're tough, you're tough. Very strong. Glad to share the ring with you,' the Mexican said. 'Thank you. It's an honour,' the Englishman said. ",
        "Both fighters used the first two rounds to assess each other, before a Canelo jab caused blood to pour from Ryder's nose.Canelo then knocked Ryder down with a clean one-two in the fifth round and it looked ominous for the 34-year-old from Islington.Impressively he got back up and fought through the 12 rounds, taking multiple vicious punches throughout the fight but held on until the last bell despite spitting blood from his mouth.Ryder had previously lost five career fights to Billy Joe Saunders, Nick Blackwell, Jack Arnfield, Rocky Fielding, and the most recent being Callum Smith in 2019 by unanimous decision.",
        "The loss ended his four-fight win streak with his record now sitting at 32-6. Alvarez, meanwhile, has now gone two-from-two in his last two bouts, after he defeated Gennadiy Golovkin back in September, bouncing back from his loss to Dmitry Bivol earlier in the summer.But it seems the undisputed super middle-weight champion has his eyes on a rematch with the Russian orthodox fighter, wasting no time in calling out Bivol following his victory against Ryder.'Everybody knows, we want Bivol,' Alvarez said in the ring on Saturday. 'If the fight with Bivol don’t happen, then we’ll see.' Promoter Eddie Hearn has previously said that he could instead face David Benavidez at super middle-weight, who recently defended his WBC interim title against Caleb Plant. ",
        "But Alvarez seems to have his eyes on a rematch with Bivol and wants to fight again at 175 pounds. "
    ]
}