{
    "articleURL": "/wires/ap/article-12040719/IMF-says-inflation-slow-growth-Mideast-year.html",
    "content": [
        "DUBAI, United Arab Emirates (AP) - Economies across the Middle East and Central Asia will likely slow this year as persistently high inflation and rising interest rates bite into their post-pandemic gains, the International Monetary Fund said Wednesday.",
        "The IMF's Regional Economic Outlook blamed in part rising energy costs, as well as elevated food prices, for the estimated slower growth. The report said that while oil-dependent economies of the Gulf Arab states and others in the region have reaped the benefits of elevated crude prices, other countries - such as Pakistan - have seen growth collapse after an unprecedented flooding last summer or as economic woes worsened.The regional slowdown also comes as an explosion of fighting in Sudan between two top rival generals - who only a year ago as allies orchestrated a military coup that upended the African country's transition to democracy - threatens a nation where IMF and World Bank debt relief remains on hold.Rising interest rates, used by central banks worldwide to try to stem inflation's rise, increase the costs of borrowing money. That will affect nations carrying heavier debts, the IMF warned.\"This year we´re seeing inflation again being the most challenging issue for most of the countries,\" Jihad Azour, the director of the Middle East and Central Asia Department at the IMF, told The Associated Press. \"For those who have high level of debt, the challenge of increase in interest rate globally, as well as also the tightening of monetary policy, is affecting them.\"",
        "The IMF forecast predicts regional growth will drop from 5.3% last year to 3.1% this year. Overall, regional inflation is expected to be at 14.8%, unchanged from last year, as Russia's war on Ukraine continues to pressure global food supplies and affect energy markets.",
        "It will be even worse in Pakistan, where the IMF projected inflation to more than double, to about 27%. Pakistan and IMF officials have held repeated talks over the release of a stalled key tranche of a $6 billion bailout package loan to Islamabad.The IMF warned that financial conditions worldwide will tighten this year, brought on in part by two bank failures in the United States in March. The sudden collapse of Credit Suisse before it was purchased by UBS also strained markets.For Sudan, Azour acknowledged the challenge as the country faces a humanitarian crisis brought on by the weeks of fighting there. The violence has also worsened a debt crisis that has gripped the country for decades as it faced Western sanctions.\"We have worked with the government of Sudan, for the Sudanese people, in order to help them by achieving a debt operation that would allow Sudan to have a debt relief of more than $50 billion,\" Azour said.\"But unfortunately, the recent developments ... put in a halt to all of of those efforts,\" he added."
    ]
}