{
    "articleURL": "/wires/reuters/article-12057977/Texas-police-seek-motive-mall-shooting-killed-8.html",
    "content": [
        "By Gabriella Borter and Maria Caspani",
        "May 7 (Reuters) - Texas police on Sunday were investigating what motivated a 33-year-old gunman to kill at least eight people at a mall over the weekend, as President Joe Biden called for stricter gun laws.The Texas Department of Public Safety on Sunday confirmed the identity of the assailant in Saturday's shooting as Mauricio Garcia, a 33-year-old resident of Dallas, Texas.Police said Garcia killed eight people and wounded at least seven on Saturday afternoon at Allen Premium Outlets mall in Allen, a northern suburb of Dallas, before he was killed by police.The killings were the latest in at least 199 mass shootings that have occurred in the United States so far in 2023, according to the nonprofit group Gun Violence Archive, which defines a mass shooting as any in which four or more people are wounded or killed, not including the shooter.In a statement on Sunday, Biden renewed calls for the U.S. Congress to ban assault weapons and high-capacity magazines, as well as to enact universal background checks and end immunity for gun manufacturers. The president noted that Garcia had been wielding an AR-15 rifle and wearing tactical gear.By Sunday evening, Texas law enforcement had not released any details about a possible motive, or the identities of the victims. A local ABC News affiliate reported that investigators had found several handguns, long guns and ammunition inside Garcia's car at the scene of the shooting.",
        "A family member identified one of the slain victims on social media as Christian LaCour, a security guard.\"We watched this sweet young boy turn into a very sweet gentleman,\" Kellie Smith wrote in a Facebook post on Sunday, identifying LaCour as the brother of her daughter-in-law. \"Words can not even begin to describe the devastation that our family feels.\"Allen police said three wounded victims were hospitalized in critical condition on Sunday, and at least three were hospitalized in fair condition, including one at a children's hospital. The assailant fatally shot eight people, including at least one child, before a police officer killed him, police said on Saturday.A graphic 10-second video was circulating on Twitter on Saturday, showing several dead bodies slumped against a planter and white wall bearing the sign of retailer H&amp;amp;M.At least one of the victims, lifeless and bloody, appears to be a young child. Reuters was able to verify the video was taken at the mall where the shooting took place.In past shootings, social media sites have worked to take down links to such graphic images. An emailed request for comment to Twitter, which no longer has a communications team, returned an automated reply with a poop emoji.TRAGEDY REIGNITES GUN CONTROL DEBATE",
        "The tragedy in Allen, which happened just over a week after another deadly shooting in the Texas town of Cleveland, reignited the heated debate over gun control in the United States.The U.S. Constitution's Second Amendment protects the right to bear arms, a hot button issue for many Republicans who are backed by millions of dollars in donations from gun rights groups and manufacturers.Texas Governor Greg Abbott, a Republican, called the shooting \"devastating\" in a Sunday interview on Fox News and said the way to prevent gun violence should involve addressing mental illness.\"There has been a dramatic increase in the amount of anger and violence that's taking place in America,\" he said. \"We are working to address that anger and violence by going to his root cause, which is addressing the mental health problems behind it.\"Senate Majority Leader Chuck Schumer and other Democrats stressed the need to pass stronger gun safety legislation to curtail gun violence.On Sunday evening, Allen community members packed into Cottonwood Creek Church to hold a vigil for the victims.\"Our hearts were broken yesterday,\" Allen Mayor Ken Fulk told the congregation. \"We thank you for your patience and understanding during this ongoing investigation.\"(Reporting by Gabriella Borter in Washington, Maria Caspani in New York, Brad Brooks in Lubbock, Texas, Moira Warburton in Washington, and Brendan O'Brien in Chicago; Editing by Lisa Shumaker, Lincoln Feast an Sandra Maler)"
    ]
}