{
    "articleURL": "/wires/reuters/article-12055275/Tigers-come-beat-Cardinals-10-innings.html",
    "content": [
        "Akil Baddoo hit the winning RBI double in the 10th inning to lift the visiting Detroit Tigers over the St. Louis Cardinals 6-5 on Saturday.",
        "Spencer Torkelson had two RBI singles for the Tigers, who won their fifth straight game.Tigers starting pitcher Spencer Turnbull allowed five runs on seven hits in 4 2/3 innings. He struck out six and walked one.Reliever Jose Cisnero (2-0), the fifth Tigers pitcher, worked the final 1 2/3 innings to earn the victory.Dylan Carlson hit a three-run homer and Nolan Arenado hit a two-run blast for the Cardinals, who lost their eighth straight game.Cardinals starting pitcher Adam Wainwright made his first start of the season after missing five weeks with a groin muscle strain. He allowed four runs on eight hits in five innings.Wainwright struck out five and walked none.Reliever Giovanny Gallegos (1-2), the fifth Cardinals pitcher, took the loss.The Cardinals took a 3-0 lead in the second inning. Paul DeJong drew a leadoff walk and Brendan Donovan followed with a single. That set the stage for Carlson's three-run homer.Wainwright cruised through his first four innings before allowing three runs in the fifth inning.Baddoo hit a leadoff single, stole second base and scored on Eric Haase's single. Zack Short doubled, Zach McKinstry hit a sacrifice fly and Riley Greene hit an RBI single to tie the game 3-3.The Cardinals led 5-3 in the bottom of the inning when Lars Nootbaar reached on an infield single and Arenado hit his two-run homer.",
        "The Tigers cut their deficit to 5-4 in the sixth inning when Nick Maton hit a double and scored on Torkelson's single.Detroit tied the game 5-5 in the seventh inning when Greene hit a single, Javier Baez walked and Torkelson hit another RBI single.Baddoo drove in designated runner Jonathan Shoop from second in the top of the 10th, and Cisnero retired the Cardinals on a fielder's choice, a popout and a groundout.--Field Level Media"
    ]
}