{
    "articleURL": "/wires/pa/article-12050643/Alexis-Mac-Allister-Brighton-s-aim-fight-European-place.html",
    "content": [
        "Alexis Mac Allister believes Brighton are proving they have the quality to reach Europe after his nerveless penalty secured an “unforgettable” 1-0 win over Manchester United.",
        "The Seagulls soared to sixth spot in the Premier League table, above Tottenham and Aston Villa, thanks to Mac Allister thumping home with virtually the last kick of Thursday’s pulsating contest.Roberto De Zerbi’s free-flowing side have two games in hand on Spurs and Villa, as well as fifth-placed Liverpool, who sit just four points above them.Argentina midfielder Mac Allister says Albion must focus on their own situation and results as they bid to cap a memorable campaign by achieving continental qualification.“We know that it’s the end of the season and these three points are very important,” he told Brighton’s club website.“The way we are playing is very important because we feel very good. We will do our best to finish as high as we can.",
        "“We have to think about ourselves and not look at the other teams. If we play the way we play, we will have big chances to fight for a European spot and that has to be our aim.”World Cup winner Mac Allister kept his composure to fire into the top-left corner from 12 yards nine minutes into added time after Luke Shaw’s inexplicable handball was penalised following VAR intervention.The 24-year-old’s 11th club goal of the season prompted more jubilant scenes inside the Amex Stadium on the back of Saturday’s record-breaking 6-0 hammering of Wolves.",
        "“It was so special,” he said. “For the team and the fans, it was an amazing win and something unforgettable.”Brighton’s last-gasp success partially avenged their painful FA Cup semi-final penalty shoot-out defeat to United 11 days earlier.The Seagulls also broke the club-record top-flight points tally by moving on to 55 – three more than they managed in the the 42-game 1981-82 season – with six games still to go.Goalkeeper Jason Steele, who made smart saves to deny Marcus Rashford, Anthony Martial and Bruno Fernandes, admits Albion’s recent Wembley agony gave them additional incentive.“It wasn’t about revenge or anything like that,” he said. “Did we have a little bit extra motivation? Yeah, probably.“But I don’t think it spilled over into anything other than that and we deserved to win.“It was a big night for us. Two good teams were going toe to toe, really enjoyable to play in and the last-minute winner, you can’t beat that.”Brighton complete a trio of consecutive home games against relegation-threatened Everton on Monday evening.The fitness of Pascal Gross and Evan Ferguson will be assessed ahead of that match but head coach De Zerbi does not expect to have Joel Veltman back from injury."
    ]
}