{
    "articleURL": "/tvshowbiz/article-12061349/Sunrise-host-Natalie-Barr-55-praised-Met-Gala-worthy-gown-red-carpet-event.html",
    "content": [
        "Sunrise host Natalie Barr has been hailed for her incredible style after wearing a 'Met Gala-worthy' gown to Sydney's prestigious Gold Dinner on Thursday. ",
        "The acclaimed journalist, 55, wowed fans when she slipped into a black evening dress by the late Carla Zampatti. The frock featured a sweetheart neckline and hugged her sensational figure, and she accessorised with jewellery from Fairfax and Roberts. Nat wore her trademark brunette tresses down and opted for a matte makeup look.  The look sent the Channel Seven's stars celebrity pals and fans into a frenzy, with many comparing the outfit to one seen on the Met Gala red carpet.",
        "'Wowee,' Sylvia Jeffreys wrote, sharing a number of flame emojis. 'Looking amazing,' Angela Cox added. 'You could be attending the MET Gala in that killer dress Nat,' yet another enthusiastic fan added. Nat has gained a huge following since anchoring Sunrise. The notoriously private star often shares her wardrobe and makeup secrets. Natalie recently revealed her skincare regime, including how she protects her face from the daily ravages of television makeup.",
        "'I'm always asked about my skincare, especially how I take off all my TV makeup after work,' Natalie captioned a video shared to Instagram.'Well for the past 5 years I've used a brand called @dermaviduals. (I've just become an official ambassador for them).'My skincare regime all starts with a really simple cleanser,' the breakfast television host continued.",
        "'With a combination of their DMS Cleansing Milk &amp; Gel, the @dermaviduals cleansing range supports your skin and is powered with all these pure, active ingredients that gently nourish your skin. They mix it up to suit you,' she explained.",
        "Natalie added in the video that the worst thing about working in breakfast TV is 'wear and tear on your face and hair. Lots of makeup.'She added that she has a 'travel kit' that she takes on assignments that includes a mini version of her favourite moisturiser.Natalie previously told Yahoo! Lifestyle that she's the 'fittest [she's] ever been' after embracing a 'back to basics' approach to her health.'I exercise regularly, eat well most of the time, cut out sugar and make sure I get enough sleep,' she said.Natalie revealed her weekly fitness routine consisted of Pilates, Xtend Barre classes, walking and running.",
        "The newsreader also regularly uses a green algae face mask by Australasian skincare brand Dermaviduals.Natalie explained that she prefers Dermaviduals because their products don't contain 'nasty chemical stuff'.She replaced Samantha Armytage as Sunrise's co-anchor in March 2021, stepping in alongside David 'Kochie' Koch.Prior to her promotion, she was the show's longtime newsreader."
    ]
}