{
    "articleURL": "/wires/pa/article-12052951/Charles-Camilla-leave-Big-Help-Out-Big-Lunches-royals.html",
    "content": [
        "The King and Queen are to leave the Big Help Out volunteering and Big Lunch celebrations over the coronation weekend to the rest of the royal family, Buckingham Palace has said.",
        "Charles and Camilla will attend the coronation concert at Windsor Castle on Sunday evening, but are not set to appear at any of the street parties earlier in the day.They will also not be appearing publicly on the Monday – the day of the Big Help Out which is billed as a lasting volunteering legacy to mark the King’s crowning.",
        "The public have been encouraged to take up hundreds of thousands of volunteering roles on the extra bank holiday, with more than 1,500 charities involved.An app has been created to allow people to search for volunteering opportunities, ranging from helping the elderly to working with environmental charities and supporting animal welfare.A Buckingham Palace spokesperson said: “While wholly supportive of the Big Help Out initiatives taking place right across Britain on Monday 7 May, they will not be attending any events in-person.“These will instead be attended by other members of the royal family.”Camilla is patron of the Royal Voluntary Service charity, and has also been patron of the Big Lunch initiative since 2013.Thousands of street parties are expected to be held across the country, with people encouraged to come together for a Coronation Big Lunch on Sunday.",
        "Charles and Camilla will attend an early family supper at Windsor Castle before hosting a private larger scale reception for VIP guests ahead of the concert and then taking their seats at 8.30pm for the live televised show.",
        "The Prince and Princess of Wales are expected to carry out engagements over the weekend.On Sunday, the Duke and Duchess of Edinburgh will attend a big lunch in Cranleigh, the Princess Royal and Vice Admiral Sir Tim Laurence will attend a community street party in Swindon, and Princess Beatrice and Princess Eugenie will attend a big lunch in Windsor.For the Big Help Out, Edward and Sophie will take part in a puppy class at the Guide Dogs training centre in Reading, while Anne and Sir Tim will attend a civic service recognising local volunteers at Gloucester Cathedral.The Duke and Duchess of Gloucester will meet young volunteers from the Coptic Orthodox Church at a coronation party at St Mark’s Coptic Orthodox Church in Kensington.At 74, Charles is the oldest British monarch at a coronation, and his reign follows that of his mother Elizabeth II, the nation’s longest-reigning sovereign."
    ]
}