{
    "articleURL": "/news/article-12055627/Federal-budget-Power-bill-relief-promised-Treasurer-Jim-Chalmers.html",
    "content": [
        "Power bill relief promised in federal budget Could flow to over five million households Jim Chalmers says economy is set to slow The Albanese government is promising to help more than five and half million households pay their soaring energy bills.",
        "Treasurer Jim Chalmers told the ABC on Sunday morning that the measure in next week's federal budget, which is believed to allocate $500 to each household to help with bills, will also be available for more than one million small businesses. 'They will all be eligible for several hundred dollars to help with their electricity bills to take some of the edge off what is the key drivers of these cost of living pressures,' he said.The amount made available will depend on the cost of electricity for the area. Dr Chalmers said it would also depend 'on how much the states and territories are willing to kick in because this is a co-investment with them' as to how generous the relief will be in different parts of Australia.",
        "The measure will also be targeted to help the  'most vulnerable' but won't just be restricted to age pensioners with Dr Chalmers promising the budget would help dull the edge of runaway inflation.'What we have tried to do with the budget broadly particularly the cost of living package is to try to take some of the pressure off inflation rather than add to it,' he said.Dr Chalmers voiced optimism inflation could be brought under control sooner than previously forecast.However, he was not expecting average wage growth to overtake inflation, and thus increase real spending power, until the beginning of next year.",
        "Dr Chalmers warned the budget would forecast a slowing economy and that would be felt even more per person as a high influx of migrants overshadows economic growth, which could lead to a 'per capita recession'.The Treasurer stressed the high intake of 300,000 migrants this year and a projected 400,000 next year was not a result of government targets but a rapid return of overseas students and long-term tourists after the Covid pandemic border closures.Although the budget is widely expected to return to a surprise surplus, Dr Chalmers warned it might only be temporary. 'The pressures on the budget after that (the next year) will intensify rather than ease,' he said after being asked about heavy new defence expenditure and the spiralling costs of the National Disability Insurance Scheme.Dr Chalmers said it was a misconception the budget's improved condition was solely due to the tax being harvested from the sky-rocketing price of commodities, such as iron ore. 'Commodities are an important part of the story but not the biggest part of the story,' he asserted. 'Only about a fifth (of the improvement) is from higher the commodity prices, the biggest improvement, 40 per cent of it is from the labour market, lower unemployment and higher wages growth.' Another measure that will also help the budget's bottom line is a $2.4 billion increase in Petroleum Resource Rent Tax, to be paid by oil and gas companies on their offshore liquefied natural gas projects over the next four years. ",
        "Dr Chalmers said there had been 'widespread consultation' with the sector on the changes, which from July 1 will cap the amount companies can deduct project costs against income. The Treasurer said these measures would mean 'more tax sooner from these projects and it means it can help fund our cost of living package and other priorities in the budget'. On the controversial state three tax cuts inherited from the Morrison Coalition government, the Treasurer again batted back suggestions they will be axed. 'Our position hasn't changed,' Dr Chalmers said.He said the tax cuts were one way to restore bracket creep, where inflated wages mean people end up paying proportionately more in tax, and the cuts would kick in at the relatively modest level of $45,000 a year.'We have always supported tax relief for people on low and middle incomes,' he said.Dr Chalmers announced the budget will also increase indexation to provide $4 billion more to community services.Providers who will benefit include mental health, disability, domestic violence and homelessness services, the Medicare Benefits Schedule and community nursing. Shadow Treasurer Angus Taylor said the acid test for the budget would whether it puts downwards pressure on inflation, currently running at seven per cent annually.'If you want to help all Australians, all vulnerable Australians, not just the ones you can identify and the ones you are picking out, if you want to help all vulnerable Australians you've got to get the inflation under control,' Mr Taylor said."
    ]
}