{
    "articleURL": "/wires/ap/article-12046159/India-talk-China-Russia-Central-Asia-meet.html",
    "content": [
        "PANAJI, India (AP) - India's foreign minister held talks Thursday with counterparts from China and Russia ahead of a meeting of a Central Asian security forum.",
        "Subrahmanyam Jaishankar said he had detailed discussions with Chinese Foreign Minister Qin Gang on bilateral ties. \"Focus remains on resolving outstanding issues and ensuring peace and tranquility in the border areas,\" he tweeted after the meeting.India and China are embroiled in an intense three-year standoff involving thousands of soldiers stationed along their disputed border in the eastern Ladakh region.A meeting last week between their defense ministers gave a glimpse of just how differently the two countries view the situation along the border. While India accused its neighbor of eroding ties by violating bilateral agreements, China said the border conditions were \"stable overall.\"A clash three years ago in Ladakh killed 20 Indian soldiers and four Chinese.Jaishankar also said he had a \"comprehensive review of bilateral, global and multilateral cooperation\" with Russian Foreign Minister Sergey Lavrov.",
        "Analysts say India is likely to be concerned over Russia's growing reliance on China as its invasion of Ukraine drags on.New Delhi's relationship with Moscow, its Cold War ally, has remained strong. But Beijing gaining more sway over Moscow could prove frustrating for India.Foreign ministers from the members of the Shanghai Cooperation Organization, a security pact dominated by Moscow and Beijing, arrived in the Indian tourist hotspot of Goa, where they are expected to discuss deepening economic and security cooperation in the region on Friday. A summit of SCO leaders is to be held in July.",
        "Pakistan, India's archrival, is also a member of SCO. Its foreign minister, Bilawal Bhutto Zardari, is making the first visit by a high-ranking Pakistani official to India in nearly a decade. Zardari´s attendance has triggered speculation of a thaw in strained relations between the two South Asian countries, though both ministers have dismissed speculation of a bilateral chat.\"During my visit, which is focused exclusively on the SCO, I look forward to constructive discussions with my counterparts from friendly countries,\" Zardari tweeted before setting off for India.The two countries have a history of bitter relations, mainly over Kashmir, a disputed Himalayan region that was split between them but is claimed by both in its entirety. India and Pakistan have fought two wars over Kashmir since gaining independence from British colonial rule in 1947.Jaishankar held talks with the SCO's secretary general, Zhang Ming, earlier Thursday and was also expected to speak with Uzbekistan's foreign minister.Russia and China founded the SCO in 2001 as a counterweight to U.S. alliances across East Asia to the Indian Ocean. The group includes the four Central Asian nations of Kazakhstan, Kyrgyzstan, Tajikistan and Uzbekistan, which Russia considers its backyard. In 2017, India and Pakistan became members and Iran is set to join later this year.",
        "___Find more of AP´s Asia-Pacific coverage at https://apnews.com/hub/asia-pacific"
    ]
}