{
    "articleURL": "/wires/reuters/article-12058079/Thailand-wins-International-Crown-United-States-places-third.html",
    "content": [
        "Thailand ran the table at the Hanwha LifePlus International Crown, defeating Australia in the finals of the team event on Sunday afternoon at TPC Harding Park in San Francisco.",
        "The team of Atthaya Thitikul, Patty Tavatanakit and sisters Ariya and Moriya Jutanugarn went 6-0-0 in the round-robin stage over the first three days. They lost only one individual match the entire week -- one of the singles matches against the United States in the semifinal round Sunday morning -- but it was just a brief speed bump en route to winning the nation's first International Crown.\"First of all it's such an honor to represent our country,\" said Moriya Jutanugarn, whose sister, Ariya, earned the inaugural most valuable player award. \"Of course, we had a really good team this week. Everyone just give 100 percent for every match. A lot of the good players are out here. We're just trying to stay there and just keep committed, and trying to play as solid as we can.\"The United States rebounded from their semifinal loss to Thailand to defeat Sweden in the consolation match and take third place.The International Crown was played for the first time since 2018 due to the COVID-19 pandemic. The top eight countries in women's golf were determined by last year's Rolex Rankings and each country sent four of its top players to the unique team event.The countries were seeded and split into two pools, with teams competing in four ball (best ball) in a single round-robin format from Thursday to Saturday. The top two countries from each pool advanced to Sunday.",
        "Two semifinal matches were played Sunday morning, each consisting of two singles matches and one foursomes (alternate-shot) match. Thailand took two of three matches against the U.S., while Australia swept Sweden, setting up the finals Sunday afternoon in the same format.Thitikul defeated Lexi Thompson 3 and 2 to open their semifinal showdown, but Lilia Vu got the Americans on the board by beating Tavatanakit 1 up. Vu trailed 1 down after 12 holes but won the 13th and 14th with pars -- while Tavatanakit bogeyed each -- to take the lead for good.But in the alternate-shot match, the Jutanugarn sisters birdied the par-5 third and fifth holes for a 2-up lead on Nelly Korda and Danielle Kang for an early lead. Korda and Kang rallied to even the match through 16 holes, but the Jutanugarns birdied the par-3 17th to take the lead for good.The finals weren't as close. Thitikul defeated Australia's Stephanie Kyriacou 4 and 2, winning four of the last five holes, while Tavatanakit eased to a 4-and-3 victory over Hannah Green. The Jutanugarns lost their first two holes to Minjee Lee and Sarah Kemp, but they bounced back and won Nos. 3, 5, 7, 8, 9 and 10 -- all with birdies -- to turn the match around en route to a 4-and-3 win.",
        "Ariya Jutanugarn said the Thai players felt a bit worried Saturday night about the final day of the tournament.\"We kind of talked through it and then everybody just said, `You know what, do our best, and let's go with no expectations and we know that the result is gonna be great,' \" she said.In the consolation match, Madelene Sagstrom got the Swedes on the board with a quick 5-and-4 victory over Vu. Thompson tied the score by beating Maja Stark 3 and 2, and Kang and Korda grinded out a close 1-up victory over Anna Nordqvist and Caroline Hedwall.Kang and Korda won just two holes and never led by more than one.\"Having team events like this, I think, brings a wider fan base for us,\" Thompson said. \"I think fans really enjoy it, and I think there's a lot more energy out here and people cheering and things like that. We got big crowds today. I think it's important for women's golf in general, too, to have these events.\"--Field Level Media"
    ]
}