{
    "articleURL": "/news/article-12051039/US-air-passenger-caught-smuggling-18lbs-pure-cocaine-Italy.html",
    "content": [
        "The man was carrying 43 rolls of the white powder in his wheelchair tires An American air passenger was caught smuggling 18 pounds of cocaine worth $1 million into Italy inside the tires of his wheelchair. ",
        "The man - who was at Milan Malpensa airport in Lombardy, after disembarking a flight from La Romana in Santo Domingo - was carrying 43 rolls of 'very pure' cocaine, when they were discovered by a drug-sniffing dog named Cosmo, according to La Repubblica.The passenger was in the arrivals hall with a brace on his right leg, when a sniffer dog barked and alerted Financial Guard Police to him.They subsequently carried out a thorough check of the man, his belongings and the wheelchair, where they ultimately discovered over eight kilograms of the drug.He was arrested, before being made to undergo a medical examination to assess the validity of his health conditions.",
        "His arrest was validated by the Busto Arsizio prosecutor and his transfer to the local district house was ordered.Police reports indicate that the street value of the drug would have been above one million euros ($1,100,625). It marks the second time in a year that the Financial Guard have encountered a drug pusher using a wheelchair to conceal the items. Last August, a Spanish citizen revealed himself to be faking an injury in order to smuggle 13 kilograms of cocaine into the country. The canine unit had been on patrol at the airport checking arrivals passengers and their luggage from the flight from the Dominican Republic - a commonly used drug-trafficking route. ",
        "They initially discovered nothing when they searched the luggage, until they cut open the upholstery of the wheelchair to find the drugs.Police at the time said that as soon as the drugs were discovered, the wheelchair user immediately stood up and began walking un-aided.In total, 11 packets of cocaine, weighing 13.25kg (25.2lbs) were seized, and it could have made 27,000 individual doses, police confirmed.The street value of the bust values to roughly €1.4m (£1.2m)."
    ]
}