{
    "articleURL": "/wires/reuters/article-12038347/Chinese-foreign-minister-hails-Myanmar-friendship-visit.html",
    "content": [
        "BEIJING, May 3 (Reuters) - China supports Myanmar in finding its own path to development and urges the international community to respect its sovereignty and help it achieve peace and reconciliation, China's foreign ministry said on Wednesday.",
        "Myanmar had been largely shunned by Western countries since its military overthrew an elected government led by Nobel Peace Prize laureate Aung San Suu Kyi in 2001 and crushed nationwide pro-democracy protests that erupted after the coup.Neighbouring China, however, has maintained close ties with Myanmar's generals and Foreign Minister Qin Gang, making a rare trip to Myanmar by a senior foreign official, met junta chief Min Aung Hlaing in Naypyitaw on Tuesday.\"China supports Myanmar in exploring a development path with Myanmar characteristics that suits to its national conditions,\" Qin's ministry cited him as saying in the talks.China supported Myanmar in \"advancing its political transition process and backs relevant parties ... to properly address differences and seek national reconciliation under the constitutional and legal framework\", Qin said.The international community should respect Myanmar's sovereignty and play a constructive role in helping it achieve peace and reconciliation, he said.Myanmar has been rocked by violence since the coup with pro-democracy activists taking up arms, in some places alongside ethnic minority forces fighting for self-determination, to battle the well-equipped army.Efforts by Myanmar's Southeast Asian neighbours to initiate dialogue have come to nothing.China is a major buyer of Myanmar's resources, including jade, tin and timber while it has occasionally had to take in refugees spilling across the border from fighting between insurgents and Myanmar government forces.",
        "On economic development, Qin said China would accelerate investment linked to a China-Myanmar Economic Corridor and implement projects on agriculture, education and health care.China also supported Myanmar on improving its relations with its western neighbour, Bangladesh, the Chinese foreign minister said.Myanmar broadcaster MRTV said the discussions included increasing border trade and cooperation on energy. (Reporting by Reuters staff; Writing by Ben Blanchard; Editing by Kanupriya Kapoor and Josie Kao)"
    ]
}