{
    "articleURL": "/news/article-12051939/The-kids-busy-playing-TikTok-Billionaire-mogul-reveals-built-empire-scratch.html",
    "content": [
        "John Catsimatidis built an empire after starting his career in a supermarketThe billionaire expanded his businesses to cover everything from oil to radioHe also slammed Gen Z for being 'too busy on TikTok' to launch their careersA billionaire industry mogul has revealed how he built his empire from scratch, as he slammed Gen Z for being 'too busy on TikTok' to launch their careers. ",
        "John Catsimatidis, 74, is best known as the brains behind a fleet of real estate holdings and supermarkets across Manhattan, and his billion-dollar empire stretches from oil refineries to hosting his own radio show. But the 74-year-old insists that he was not always set up for success, with the college dropout originally working a menial job in a supermarket that taught him the value of earning an honest paycheck.'If you're working 100 hours a week, and it's not working, you'd better work 120,' he told DailyMail.com. 'You can't win if you're afraid of losing.' ",
        "Born on the small Greek island of Nisyros in 1948, Catsimatidis moved to New York when he was just six-months old. After graduating from Brooklyn Tech High School, the future-billionaire received an early life lesson when his mother, Despina, pushed him to get a job at a local grocery store. 'When I finished high school, I was ready to sleep on the couch for the whole summer and watch television,' he told DailyMail.com. 'My mother threw me off the couch, and I guess I'm a kid of extremes, because I quickly ended up working 70 hours a week.' The mogul, who is worth more than $4 billion today, said he would end every day by 'making sure everything was perfect so the store was set up to do business' the next day. ",
        "'This taught me the responsibility of a little bit of perfection,' he added, feeling the habit was one of the building blocks that set up his future success. ",
        "When he was ready to head to college, Catsimatidis made the bold move to reject a Congressional recommendation to attend West Point.Instead, he attended New York University, but dropped out just eight credits short of graduating to take part-ownership in his first supermarket. 'The supermarket business taught me that if you're going to be a leader, when you say \"charge\", everyone has to follow you,' he continued. 'If you don't have leadership qualifications, you know where you get? Nowhere.' Aggressively expanding out from part-owning the store he once worked in, Catsimatidis' supermarket empire includes New York staples Gristedes and Red Apple Markets. He claims to have been making a million dollars a year aged just 24. Asked about his best advice for those looking to advance their business careers, Catsimatidis didn't hesitate as he responded: 'Hire people that know more than you do.' 'I had zero financial background, but I hired well. And I built a great relationship with people in the food business and real estate business, and I ended up with a lot of mentors.' 'Always get a good education,' he continued. 'I made sure both my kids got the best education, and it helped them make friends worldwide. Then, it's just a combination of a good education and keeping your nose clean and working harder.' ",
        "However, the 74-year-old said that last ingredient is one that is dearly missing for many today. 'That's one of the problems we are having in our country these days, the kids are busy playing TikTok.' 'The harder you work, the easier it gets to win,' he added. 'Look at people only working three days a week, and I'll show you failures.'",
        "For those looking to break a funk in their business, the billionaire stressed the importance of identifying windows of opportunity.  Revealing how he made his first $100 million after starting from scratch, Catsimatidis said he poured $5 million of his store's bottom line into real estate in 1976, at a time when 'nobody was touching real estate'. 'I took the excess cash flow from the supermarket business, and I woke up four years later and made my first $100 million.'I bought some properties for nickels and dimes. One property, I bought for $400,000, and I sold it for $40 million, but those are the opportunities I took advantage of.' As Catsimatidis' career thrived in the 1980s, he aggressively expanded his business portfolio across a number of industries, a move he feels could be emulated by people in any aspect of their lives. 'You're not going to make it in life unless you spread it around a little bit,' he added. 'That's my advice for people going to university, no matter what you're taking up you should have a little bit of everything.' ",
        "Alongside acquiring Manhattan grocery store franchise Gristedes in 1986, he also sold a small aviation company that later became NetJets. Also among his many industry investments, which includes an expansive oil empire, the 74-year-old owns WBAC Radio, which he uses to host his own show to share lessons with other titans. He said: 'It's not a business for me - it's a hobby. I give advice to everyday people.' Catsimatidis delved into his background and the tools that aided his path to becoming a self-made mogul in his new memoir: 'How Far Do You Want to Go? Lessons From a Common-Sense Billionaire'.Emphasizing the need for 'common sense' in planning for success, Catsimatidis said: 'We have a lot of divisions in our business, and my job is just to deliver common sense. And he said he felt compelled to release the book in part as a reminder of his career for his family, and also to help guide people through tough times. 'One of the big sellers of the book is fathers and grandfathers, who buy my book to give their kids and grandkids, to help learn a few lessons.' "
    ]
}