{
    "articleURL": "/wires/ap/article-12055503/Cardinals-use-Contreras-primary-DH-weeks.html",
    "content": [
        "ST. LOUIS (AP) - Signed as Yadier Molina's replacement, Willson Contreras won't be spending much time behind the plate during the next few weeks.",
        "Cardinals manager Oliver Marmol said before Saturday´s 6-5, 10-inning loss to Detroit that Contreras will be primarily a designated hitter and Andrew Knizner will get most of the time at catcher.\"It allows for some familiarity behind the plate with our guys, which I think will help, especially in the state that we´re in,\" Marmol said. \"At the end of the day when you start winning ballgames. And some familiarity with our pitchers and our bullpen.\"St. Louis is on an eight-game losing streak, its longest in 16 years and is a National League-worst 10-24, the Cardinals' first time 14 games under .500 since ending the 1997 season at 73-89.Contreras agreed to an $87.5 million, five-year contract during the offseason.\"We´re not losing ballgames because of Willson Contreras,\" Marmol said. \"This is a guy that´s putting in an amazing amount of work to be able to become more familiar with, one, our pitchers but also how we do things. So, he will DH a decent amount moving forward, and then we have a strategy as to what that looks like beyond that.\"",
        "Contreras declined an invitation to play for Venezuela in the World Baseball Classic so he could spend all of spring training with the Cardinals and learning the pitching staff.",
        "\"It´s tough,\" Contreras said. \"I´m an employee. I know that my primary position is catching. If they want me to DH more, I can do nothing about it but be the best hitter I can be.\"Contreras has thrown out five of 16 runners trying to steal against him while Knizner has caught just one of 11. However, Cardinals pitchers have a 5.04 ERA in 201 2/3 innings throwing to Contreras compared to a 4.03 ERA in 96 innings with Knizner behind the plate.\"It´s getting better,\" Contreras said about his relationship with his pitchers. \"Our relationships are good. I don´t think there is a miscommunication or anything like that. If you look back at the games, we´re not executing with two strikes. We get the hitters in 0-2 counts but we´re not executing with two strikes. That´s where we´re getting hurt.\"___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}