{
    "articleURL": "/health/article-12047171/Doctors-left-horrified-scans-reveal-patients-body-riddled-tapeworms.html",
    "content": [
        "Patient was infected with tapeworm eggs that then died forming small cystsRead more: Images show parasitic worms crawling underneath woman's skinShocking images show how a patient seeking help for a persistent cough was riddled with the remains of dozens of tapeworm larvae.",
        "A stomach churning X-ray, posted by a Brazilian medic, shows hundreds of bright what spots, each representing the calcified remains of a parasite.This condition, called cysticercosis, occurs when larvae of a species of tapeworm, which normally lives in the intestines, enters tissues like the muscle or brain.There they form hard nodule like cysts that can feel like lumps under the skin.While unpleasant they are generally harmless — as the larvae don't survive — the cysts that remain can cause problems if they develop in the brain or eyes.",
        "Dr Vitor Borin de Souza, a medic at the Hospital das Clínicas in Botucatu, shared the images in a now deleted thread on Twitter.He said: 'Cysticercosis is acquired from ingestion of tapeworm eggs (present in the feaces of humans with tapeworms).'Don't want to [catch] it? Wash your food well before consuming.'Dr de Souza added that in most cases like these, the patient does not require any treatment.He said: 'If you don't have any injury inside the head, spinal cord or eyes, you don't even need to treat.",
        "'These lesions are calcified so they are not viable cysticerci (tapeworm larvae). If it doesn't cause any discomfort, life goes on.'He did confirm, however, that the patient was awaiting an MRI scan to check for the location of any cysts in their brain.",
        "Cysts in this location can be potentially deadly.While headaches and even seizures are common, such the nodules can also lead to confusion, dizziness and a condition called hydrocephalus, an excess of fluid in the brain, that if left untreated can be fatal.Surgery is usually required to remove the cysts in these cases.Cysts can also reach the eyes where they can cause blurry or disturbed vision, and potentially cause an infection.The cysts themselves may only develop months or years after the initial infection with the tapeworm eggs.",
        "The tapeworm that can cause cysticercosis is a species called Taenia solium, also known as the pork tapeworm.Eggs from this species are passed on between humans through contaminated faeces most commonly through tainted water supplies or inadequate hand hygiene during food preparation.People can also get the tapeworm through contaminated pork products, though in this case the eggs hatch in the intestine do not spread to other parts of the body to cause cysticercosis.The World Health Organization estimates Taenia solium larvae cysts developing in the brain are responsible for up to 70 per cent of epilepsy cases in some parts of the world.About 2.5million people are thought to be infected with Taenia solium per year, with it most commonly detected in poor regions of Asia, South America and Eastern Europe.",
        "People who only have cysticercosis, unlike people with an active tapeworm infection in their intestines, cannot spread the eggs to other people."
    ]
}