{
    "articleURL": "/wires/reuters/article-12040373/Oil-steadies-ahead-expected-rate-hikes.html",
    "content": [
        "Oil falls 4% after steep 5% decline in previous session",
        "Brent posts lowest settle since December 2021Fed delivers small rate hike, signals possible pause in tightening cycleUS crude, distillate stockpiles fall, gasoline builds -EIA(New throughout, updates prices, market activity and comments to settlement, adds Federal Reserve news)By Stephanie KellyNEW YORK, May 3 (Reuters) - Oil prices fell 4% on Wednesday, extending steep losses from the previous session after the U.S. Federal Reserve raised interest rates and as investors fretted about the economy.Brent futures settled $2.99 lower, or 4%, to $72.33 a barrel, the global benchmark's lowest close since December 2021. Brent hit a session low of $71.70 a barrel, its lowest since March 20.U.S. West Texas Intermediate crude (WTI) fell $3.06, or 4.3%, to $68.60. WTI's session low was $67.95 a barrel, lowest since March 24.A day earlier, both benchmarks fell 5%, their biggest daily percentage declines since early January.On Wednesday afternoon, the Fed raised interest rates by a quarter of a percentage point, pressuring oil prices as traders worried that slower economic growth could hit energy demand.But the Fed also signaled it may pause further increases, giving officials time to assess fallout from recent bank failures, wait for resolution of a political standoff over the U.S. debt ceiling and monitor inflation.",
        "Banking sector concerns returned to the spotlight on Monday after U.S. regulators seized First Republic, the third major U.S. institution to fail in two months, with JPMorgan Chase &amp;amp; Co agreeing to take $173 billion of the bank's loans, $30 billion of securities and $92 billion of deposits.\"The Fed going into a pause mode should be very supportive for the price of oil,\" said Phil Flynn, an analyst at Price Futures Group. \"The big question is whether or not we're going to have more shoes drop in the banking sector.\"The European Central Bank is also expected to raise rates at its policy meeting on Thursday.Also pressuring oil prices, government data showed U.S. gasoline inventories unexpectedly rose by 1.7 million barrels last week. Analysts polled by Reuters had expected a 1.2 million-barrel drop.\"The most notable thing is that gasoline demand gave back all of the increases that we'd seen in previous weeks,\" said Andrew Lipow, president of Lipow Oil Associates in Houston.U.S. crude inventories fell by 1.3 million barrels in the week, compared with forecasts for a 1.1 million-barrel drop.In China, data over the weekend showed April manufacturing activity fell unexpectedly in the world's largest energy consumer and top buyer of crude oil.Morgan Stanley lowered its forecast for Brent prices to $75 a barrel by year-end.",
        "\"Downside risk to Russia's supply and upside risk to China's demand have largely played out and prospects for 2H tightness have weakened,\" the bank said in a note, referring to buoyant exports from Russia despite Western sanctions. (Reporting by Stephanie Kelly; additional reporting by Noah Browning and Muyu Xu Editing by Emelia Sithole-Matarise, Marguerita Choy and David Gregorio)"
    ]
}