{
    "articleURL": "/news/article-12042481/Drunk-driver-25-killed-brid-posted-note-received-branding-inconsiderate-rude.html",
    "content": [
        "Jamie Lee Komoroski, 25, was branded an 'entitled b****' after the incident in 2017She is accused of drunkenly driving into the back of a golf cart carrying newlyweds Samantha Miller and Aric Hutchinson Officers who arrested her wrote in an affidavit that she told hospital staff that she 'wanted to kill herself'A drunk driver who mowed down and killed a bride hours after her wedding proudly posted a note she was given for parking in an 'inconsiderate and rude' way.",
        "Jamie Lee Komoroski, 25, received the letter after bragging about 'battling for a parking spot', and was branded an 'entitled b****' after the incident in 2017.Other pictures posted on her social media show her asking for 'plan B' with the hashtag 'getting that d***'.Komoroski, who grew up in New Jersey before moving to South Carolina for college, also posted a picture of what appeared to be marijuana in 2017. The drug is illegal in both states.She is accused of drunkenly driving into the back of a golf cart carrying newlyweds Samantha Miller, 34, and Aric Hutchinson, 36, at Folly Beach, South Carolina, on Friday.",
        "The 'sweet' newlyweds and two other occupants of the buggy were inside the vehicle when it rolled several times over 100 yards, killing the bride instantly.Komoroski was allegedly traveling at 65mph in a 25mph zone and was drunk behind the wheel of a rented Toyota Camry.Officers who arrested her wrote in an affidavit that she told hospital staff that she 'wanted to kill herself', before she was put into Charleston County Jail – and is now on suicide watch.Other post on social media shows her pouring alcohol into her friends mouth before swigging herself, again when she was underage.Posting the angry note online with the caption 'this b*** got p*ssed', the author of the message said: 'I'm sorry your mother didn't raise you to be a considerate person.",
        "'Hope you made it to whatever was so important to cause you to be that rude, hopefully you're not always like that. Have a wonderful day you entitle b***h.'Another post appeared to show her making a joke about crashing her white jeep on the beach, captioned 'I almost veered off into the ocean #oops'.It comes after DailyMail.com revealed images of the alleged drunk driver dressed as a bottle of Bud Light in 2018 – when she was underage.",
        "She had Bud Light logos strapped to her wrists and legs and the word 'year' scrawled on her T-Shirt.",
        "The outfit appears to have been a boozy Halloween pun on Toy Story character Buzz Lightyear, with Komoroski also wearing a makeshift pair of wings, similar to those seen on the toy spaceman.That snap is one of many on Komoroski's Instagram that refer to alcohol, or show her enjoying a drink.Her most recent photo - uploaded to Instagram last Tuesday - show her posing on a beach in a white bikini, with the caption 'Did someone say tequila?'Another uploaded on May 22 shows her clutching a can with the caption 'Chin up, butter cup!'.And in October 2018, Komoroski was snapped holding up a bottle of what appeared to be sparkling wine to her mouth, with the caption 'Tailgate Queens.'",
        "Hauntingly, Komoroski uploaded a photograph of herself on Folly Beach on March 28 - the same spot where her victims held their nuptials before Friday's tragic crash.",
        "Officers on the scene wrote in arrest documents that they were unsure if the groom would 'make it through the night' following the crash.The tragic bride's mom and sister have since spoken out about how Samantha was having the happiest day of her life hours before her tragic death, and shared poignant snaps of her enjoying life as a newlywed hours before she was killed.Folly Beach officials said Komoroski was not injured in the deadly smash. She was driving 65mph in a 25mph zone at the time of the crash and smelled of alcohol, but refused a field sobriety test.According to the affidavit, she told first responders that she had consumed one beer and one tequila shot before getting behind the wheel.When asked by officers how she felt on a scale of one to ten - ten being completely sober - Komoroski allegedly said she was an eight.",
        "Results from Komoroski's blood tests are still pending, and she is being held without bail in but Charleston County.She has been charged with three felony DUIs resulting in great bodily injury or death and one count of reckless homicide.",
        "Komoroski could face up to 25 years in prison for the death of the bride, as well of a fine of up to $25,100, and an additional 15 years and $10,100 for the serious injury caused to the men in the buggy.For the reckless homicide she could be handed a sentence of 10 years in prison, and a fine of up to $5,000 – as well as having her license revoked for five years on her release.Komoroski was first charged with speeding on 31 May 2018 in Horry County, South Carolina - home of Myrtle Beach and Coastal Carolina University, where Komoroski attended school.",
        "She was accused of speeding less than 10 miles per hour over the speed limit, to which she pleaded guilty and paid a $76.50 fine.Later that year, Komoroski pleaded guilty to a count of driving a vehicle at a speed that is unreasonable road conditions. She was arrested in November during a rare freeze warning in the popular tourist area.In 2019, Komoroski was again charged with speeding 10mph or less over the speed limit, to which she again pleaded guilty and paid another $76.50.More recently, she was cited for failure to use a turn signal or stop signal, to which she pleaded guilty on April 5, 2023, and paid a $25 fine.",
        "A GoFundMe for Aric and his family has raised more than $390k with Anette, his mother, writing: 'I was handed Aric's wedding ring in a plastic bag at the hospital, five hours after Sam placed it on his finger and they read each other their vows. Aric has lost the love of his life.'"
    ]
}