{
    "articleURL": "/femail/real-life/article-12044181/Cafe-owners-dont-want-accept-card-payments-say-prefer-cash-cost-living-crisis-goes-on.html",
    "content": [
        "A business is encouraging customers to pay with cash, not card But customers seemed dividedCafé owners have stuck a handwritten note on the front counter urging customers to pay with cash rather than card.",
        "While Australia is heading towards a cashless society, the business prefers to receive cash to keep the entire profit and avoid dishing out a percentage to the bank.An image of the pink note with blue handwriting was shared online and read: 'Cash is king! Cash is our preferred method of payment.'With cash we retain 100 per cent of its value. Card companies and banks get zero per cent.'Support your local business by paying cash please.'At the bottom of the note, the business reassured customers they still accept card payments.",
        "Aussie Redditors had a lot to say about the note and whether it's better to pay with card over cash. 'I appreciate them stating their case, while still accepting cards. Not like those shops that charge $4.50 for a coffee but have a $5 eftpos minimum,' one wrote. In response one person said: 'A couple weeks ago I literally came across a store that had a $15 eftpos minimum.' A third agreed with the store and wrote: 'No tax! Cash in hand is king!' 'I love cash, plus it helps limit spending too if you don't bring your card and spend only cash,' a fourth wrote. But many customers warned about the potential risks involved with handling cash in store compared to card payments - including possible theft.",
        "Australia is heading towards becoming a cashless society, with cash expected to make up just 10 per cent of all transactions by 2025.The prediction comes from market consultant Lance Blockley, who says the pandemic has sped up the shift to cashless payments.Professor Richard Holden, Professor of Economics at UNSW Business School says that it's become a lot more convenient for people, especially businesses.'Businesses don't need to bundle up cash at the end of the day, take out extra insurance for having large amounts of cash on hand – and consumers can get things moving faster without fumbling around for change,' he told Gary Adshead.Source: 6pr.com.au ",
        "'I'd argue that business has not factored in the cost of managing cash when saying it retains 100 per cent of the value of the transaction,' one Redditor said. 'There are time and risk savings not having to balance, secure, and deposit cash.'Another mentioned the 'invisible costs' of handling cash.'They don't realise that handling cash means you spend more employee time fetching change from the bank, counting floats, moving cash around physically, risk of theft, risk of employees helping themselves to the till, not having the right change for customers, and so on,' one said.  'Cards aren't perfect, but they're not extortionately-priced for the problems they solve for vendors.'"
    ]
}