{
    "articleURL": "/tvshowbiz/article-12054947/Usher-allegedly-leaves-Chris-Browns-birthday-party-BLOODIED-NOSE-following-argument.html",
    "content": [
        "Usher was reportedly hosting Brown's birthday party at a Vegas skating rinkBrown — allegedly 'intoxicated' — got upset after trying to speak to TaylorAfter trying to defuse the situation, Usher allegedly returned with a bloody nose Chris Brown and Usher got into an alleged altercation that supposedly became violent during the former's 34th birthday party on Friday night.",
        "According to TMZ, the rapper and the 44-year-old singer were both in attendance during the Look At Me Now songwriter's celebration, which took place at the Skate Rock City roller rink Las Vegas.Sources spoke to the media outlet and expressed that the Yeah 3X singer, who recently mimicked a sex act during a festival appearance in Thailand, and the Grammy-winning performer had been friends for several years prior to the event.Usher, who hosted the party, was also seen while singing Happy Birthday to Brown in a video that was shared to a partygoer's Twitter account.However, the insiders stated that the No Guidance singer became incensed after he attempted to speak to Teyana Taylor, who was also present at the event, and she chose to ignore him completely.",
        "A source spoke to Hollywood Unlocked, where the news about the incident was originally revealed, and expressed that the performer was 'disrespectful' to the actress during the party.The insider also remarked that Brown was 'intoxicated' when he initially approached the 32-year-old singer.Several sources spoke to lovebscott.com and expressed that the singer was upset about how his planned Michael Jackson tribute at the American Music Awards was canceled at the last minute.Taylor was reportedly involved with the planned performance and ended up pulling out not long before the show, which caused the project to fall apart.",
        "After she was approached by Brown, the singer remarked that he was 'on one' in an apparent reference to his intoxication, and he responded by asking Usher to make her leave his birthday party. When the U Got It Bad singer reportedly attempted to mediate the situation, the rapper allegedly called him a 'coward' and exited the roller rink with his entourage.The performer was said to have then followed his friend to the venue's parking lot in order to discuss the situation and calm him down.However, a source spoke to lovebscott and expressed that 'CB [Chris Brown] and his crew beat Usher's a**.'",
        "The performer was said to have been left with a bloodied nose and bruised ribs following the incident.According to TMZ, it was unknown if Usher was admitted to a hospital following the alleged beatdown or if police had been contacted.The media outlet reached out to the Las Vegas Metropolitan Police Department, although no incidents resembling the supposed encounter had been reported as of late.Neither Brown nor Usher have made any public comments about the alleged incident as of yet. Taylor, who was once a friend of Brown, has since unfollowed him on Instagram. Usher has since confirmed that he will appear at the Lovers &amp; Friends festival, which is scheduled to take place later today.",
        "Sources spoke to TMZ and stated that the hitmaker would perform while recovering from the alleged attack.Lovebscott's sources also expressed that Brown, who was also scheduled to appear at the festival, would go on with his performance as planned. ",
        "The pair have previously collaborated on several tracks, including New Flame, which was released in 2014, and Party, which debuted two years later. The My Way singer was featured in Welcome to My Life, a documentary focused on the life and career of his friend. Usher also brought out Brown during a show that took place as part of the former's residency in Las Vegas last year and embraced him on stage before presenting him with flowers.He also told his friend via Hollywood Unlocked: 'You a great. You're a legend. We love you and we gonna continue to keep lifting you up, bro.' "
    ]
}