{
    "articleURL": "/wires/aap/article-12040375/Activists-slam-NT-government-fracking-decision.html",
    "content": [
        "KEY QUOTES AND REACTION TO THE NT GOVERNMENT'S DECISION TO ALLOW FRACKING:",
        "* \"The government has broken its promise to us that it would implement all recommendations of the Pepper inquiry before fracking starts. In communities it's clear that the government has not done a proper job of making sure Aboriginal people understand the huge impact fracking will have on our country and that our voice is heard.\" Johnny Wilson, traditional owner and jungai (cultural lawman) at Lightning Ridge* \"Fracking stinks and the Beetaloo project is a disaster. The Albanese government - which was elected on a platform of strong climate action - should step in to stop it. Doing nothing will put Australia's climate targets and their own promises to the community out of reach.\" Climate Council head of advocacy Jennifer Rayner* \"This is the beginning of a new wave of prosperity for the Northern Territory and Australia, delivering new jobs and substantial economic benefits while strengthening east coast energy security.\" Australian Petroleum Production and Exploration Association NT director David Slama* \"The Northern Territory government's decision to hit go on onshore gas production today before fully implementing the recommendations of the Pepper inquiry is a breach of faith with Territorians.\" Environmental Defenders Office chief executive David Morris* \"We are here for our children's future. We are completely appalled by the lies they've just said ... they have no plans to manage these emissions.\" Australian Parents for Climate Change advocate Anna Weekes",
        "* \"What fracking will sacrifice is simply irreplaceable and that's clean water, prime land and a sustainable economic future.\" Rallen Australia (owner of six NT cattle stations) director Luciana Ravazzotti* \"It would be practical and level-headed of the (mining) minister to respect the climate science, experts from the NT, warnings from the United Nations and the International Energy Agency all of which say we cannot continue to open up new fossil fuel projects without fuelling catastrophic climate change.\" The Australia Institute principal adviser Mark Ogge* \"Scope two and three emissions from the Beetaloo need to be offset but the government has backflipped on this promise...this is a gift to gas companies.\" Environment Centre NT chief executive Kirsty Howey* \"It is time to accept that implementation of the Pepper Inquiry has gone off the rails, and abandon plans to frack the Beetaloo.\" Lock the Gate national co-ordinator Carmel Flint* \"Communities in the Beetaloo Basin and across the continent oppose fracking - today's decision flies in the face of deep concerns from Traditional Owners and inquiries from the Northern Territory and federal parliaments.\" GetUp chief executive and Widjabul Wia-bal woman Larissa Baldwin-Roberts* \"The health of our children and their children are more important than big new gas projects which have short-term outcomes and will cause immediate damage.\" Former Australian of the Year and epidemiologist Fiona Stanley"
    ]
}