{
    "articleURL": "/femail/article-12040847/I-wear-32k-bra-Ive-perfect-bikini-stills-works-body.html",
    "content": [
        "Jennifer Duncan, thought to be from the US, showed off her figure in bikini topREAD MORE: The REAL power behind the throne: Astrologer reveals the most influential members of the Royal Family... and it's not who you think!A curvy mother has showcased her figure in a bikini top after finding one that works for her 32k chest.",
        "Jennifer Duncan (@jenroseduncan), thought to be from the US, discovered a swim set that flatters her physique and makes her confident enough for those sunny days spent by the pool.Sharing her discovery to TikTok, Jennifer explained that she had spent the last five months breastfeeding her youngest.As such, she seemed to be on the look out for bathing suits that would work with her new assets and was shocked to find a 32k bikini top.In one clip, the brunette beauty showed off the blue polka dot garment from Freya Lingerie, which features a plunging, halter neckline and dainty straps. ",
        "Jennifer - who seems to spend many of her days by the pool or in a boat on a lake -  revealed that she paired the garment with denim shorts in a size 8.'Ready for summer in the pool,' the stunning mother said while posing up a storm outside last month.It comes after a woman who had back-breaking size 32G boobs, that reached down to her stomach, appeared unrecognisable after travelling to Turkey for a breast reduction.Phoebe Howie, 20, from Aberdeen, Scotland, was just 12-years-old when she started having to double up on wearing bras to support her chest.By the time she was 14, she was wearing size 32F cup bras and hated her quickly developed boobs.",
        "With a small size six frame, Phoebe's 32G breasts caused her severe back and shoulder pain and made her feel extremely self-conscious because they drooped down to her stomach.After trying to get on the NHS waiting list for a breast reduction since she was 17, the bar supervisor, decided to take matters into her own hands by saving up and flying to Turkey for breast reduction surgery.In June last year, Phoebe travelled to Turkey and spent £3,800 on her breast reduction and lift surgery which took her from a 32G to a 32D. "
    ]
}