{
    "articleURL": "/tvshowbiz/article-12061455/How-Kim-Zolciak-spent-HOURS-phone-psychic-clocking-2k-bill-shock-divorce.html",
    "content": [
        "Months before her shock divorce from Kroy Biermann, Kim Zolciak spent nearly four hours speaking with a psychic in a session likely costing nearly $2000.",
        "Back in February, Zolciak, 44, boasted about her three hours and 35 minute long session with medium Natalie Tomlinson on her Instagram account.Tomlinson's services do not come cheap. According to her website, she charges  $685 for an hour long session, meaning Zolciak might have spent well over $2,000 for the conversation.She posted a picture of the phone call's jaw-dropping time stamp to her Instagram Story, writing: 'Just finished my reading with the best @nataliepsychic (holy s**t look at the time).' ",
        "Notable, the screenshot included an image of her wedding photo with her now-ex Kroy.Just three months later, it emerged Kim had filed for divorce from Kroy after 11 years of marriage.The shock news came amid reports that the couple have been dealing with financial issues, reportedly owing the IRS $1.1. million in unpaid taxes.The former Real Housewives of Atlanta is said to have listed her separation date from the ex-NFL star as April 30, according to TMZ.Kim, 44, and Kroy, 37, share four children together: Kroy Jagger (KJ), 11, Kash, 10, and twins Kaia and Kane, nine.Once married, Kroy also legally adopted Kim's daughters from her previous relationships, Brielle, 26, and also Ariana, 21, whom the reality star shares with ex-husband, Daniel Toce.She filed the paperwork citing that the marriage is 'irretrievably broken with no hope of reconciliation,' the outlet noted.",
        "The star is asking for joint legal custody of their four children and primary physical custody.The outlet also reported that she requested spousal support.Kim also requested her maiden name be restored legally.Kim and the former Atlanta Falcons NFL star first met in 2010 after crossing paths at the Dancing With Atlanta Stars charity event.",
        "They tied the knot one year later in November 11, 2011.The split comes just after it was revealed that Kim and Kroy allegedly owe $1.1 million in unpaid taxes, penalties and interest to the IRS, according to TMZ.Kim and Kroy allegedly did not pay in 2013, 2017 and for 2018.The reality stars also reportedly owe the state of Georgia $15,000 in unpaid taxes from 2018.The couple's home in George entered 'foreclosure' in February, per the outlet. However, Kim's daughters later insisted they were not going to lose their home, claiming the residence had been 'saved.' "
    ]
}