{
    "articleURL": "/sport/football/article-12050591/Erik-ten-Hag-claims-VITAL-Manchester-United-qualify-Champions-League.html",
    "content": [
        "Man United lost 1-0 to Brighton after Alexis Mac Allister's 99th-minute penalty United's top four hopes took a knock as a result but remain in their own handsTen Hag said they must qualify for the Champions League ahead of a big summerErik ten Hag says Manchester United cannot afford to throw away fourth, insisting it is ‘vital’ they secure Champions League qualification as they head into a significant summer of change - before claiming he trusts his players to do the job.",
        "United want to sign a striker to start finishing the chances they are creating – with Tottenham’s Harry Kane top of Ten Hag’s list – as the club’s multi-billion-pound takeover edges nearer.Ten Hag is focused on finishing fourth but United have failed to win any of their trips to teams in the Premier League’s top nine, their latest loss coming to Brighton. That 1-0 defeat thanks to Alexis Mac Allister’s 99th-minute penalty has left United looking over their shoulders to Brighton and Liverpool and Ten Hag said his players need to take responsibility for this sticky situation.‘It is always vital that we have to be in the Champions League,’ said Ten Hag. ‘It is a battle because many teams and clubs in the Premier League are competing for it and they have the power to fight for that as well. We want to be there and will do everything to get there.",
        "‘Manchester United, we need to be there in the Champions League. We want to be there because we want to challenge the best teams in the world so we do everything in our power to get that done. I count on my team. We have to do it again.’Though it took a stoppage-time spot-kick for them to win, Brighton out-played United over the 90 minutes. ",
        "Of the few chances that were created by the visitors, Ten Hag was left ruing his lack of a recognised centre forward as Marcus Rashford, Anthony Martial and Antony failed to be clinical in front of goal at the Amex Stadium.‘There is no time to stay in this,’ Ten Hag said of the Brighton defeat. ‘In one hour we move on to the game against West Ham. Prepare for them and make a good plan. The players have to take responsibility and I count on them and they can do that.‘We have everything in our hands so we have to focus on our performance. I trust my players. I am quite confident about that. Every game is a battle and a challenge so we have to be ready.’Alejandro Garnacho has a chance of being in the squad for the first time in two months at the London Stadium after returning to training following an ankle injury.",
        "‘I think it will be the same squad,’ said Ten Hag. ‘Maybe Garnacho can be involved, but we’ll have to see.’It was a feisty affair against Brighton with referee Andre Marriner losing control of the clash. Frustrated as Brighton passed out from the back, 5ft 9in Antony committed a foul on Mac Allister that some have suggested could have led to a red card before squaring up with 6ft 4in Lewis Dunk.",
        "‘But his passion is a strength,’ Ten Hag said of Antony. 'Of course, until a certain level, you have to control it. You need passion and desire to win your games and win battles in the game.‘It is very strong with him and he is very ambitious. Don't go over the top, stay focused on your game and what the game needs, and if he does that he is a great player.’"
    ]
}