{
    "articleURL": "/news/melbourne/article-12058263/Sale-stabbing-Aspiring-rap-star-accused-killing-Clint-Allen-free-bail.html",
    "content": [
        "Clint Allen was walking home with wife Bek and friendsPolice gave Mr Allen first aid but he died at the scene Accused stabber was free on bail at the time Spencer Shumski was a wannabe musician  A wannabe hip hop artist accused of stabbing to death a beloved family man in front of his wife had been free in the community on bail over serious gun allegations. ",
        "Daily Mail Australia can reveal Spencer Shumski, 20, of Sale had been facing  weapons charges when police allege he stabbed Clint Allen to death in the early hours of Sunday morning. Mr Allen, 38, had been celebrating his wife Bek's 37th birthday when he was allegedly confronted by Shumski outside The Criterion Hotel in Sale, Victoria, about 200km east of Melbourne. ",
        "Dressed in a black suit and white shirt, Shumski appeared in the Sale Magistrates' Court on Monday via video link from the Morwell Police Station cells. He had been due to appear in court on Tuesday over the alleged firearm offences, which are now expected to be consolidated into his next court appearance in August. While the circumstances of those offences remain unknown, Magistrate Julie O'Donnell agreed to revoke his bail immediately. Shumski's lawyer John Sullivan did not contest the decision and made no further application for bail. 'If I could I would,' he told the magistrate. The court heard Shumski had never spent a day behind bars until now and he did not suffer any condition that might affect him while caged awaiting justice. The circumstances surrounding the tragic death of Mr Allen were not revealed in court. Daily Mail Australia has learnt Shumski was a wannabe musician and photographer, who has posted music videos online under the stage name NP Benzey. ",
        "Some of Shumski's lyrics talk about traditional teenage angst, such as lost love, drugs and violence. 'You know I take drugs on my own. I'm consistently feeling alone. Wish somebody would come let me know. Everything will be fine just be strong,' he sings on his track 'Love Deep'. In another track, titled 'Memories', Shumski sings about becoming famous. 'I've been thinking bout. What I wanna do next. I've been thinking bout. My face on on the big screen. My life like a movie. Makin these big moves in the booth with scooby. Layin back with a rack rollin' up a dubie,' he sang. ",
        "In a social media post spruiking one of the tracks, Shumski's proud father addressed his concern about some of the lyrics.  'Spencer’s newest song and V-Clip - Maybe not exactly the lyrics a parent prefers to hear but honest and passionate... It’s so important to to be supportive and attempt to lead by example while our teenagers are working out who they are and how this world work,' he wrote in 2020.  Mr Allen, his wife Bek and three others were reportedly outside the pub when they were approached by Shumski, who had been a complete stranger to them. The group made a frantic call to police about 1am, with officers arriving to find Mr Allen severely wounded at the York-MacAlister intersection.",
        "Despite desperate efforts to revive Mr Allen while waiting for paramedics to arrive, he could not be saved.Mr Allen's devastated family said he was just walking home after the night out.His distraught stepdaughter, Makala Lister, who is six-weeks pregnant, said the beloved BMX champion and an avid outdoorsman, who loved camping, dirt bikes and 4WDs, would be sorely missed.'Clint was an amazing husband, father and grandfather to his unborn granddaughter,' she told the Herald Sun.'He was loved by everyone who met him and was always up for a chat no matter what topic.''He will be forever missed and loved from everyone he came in contact with.' ",
        "Other family members hit out at Mr Allen's killer. 'F**k this world they let the cruel ones get away and they take the ones that r good away sadly last night one of the best people I know was taken to early that you will never be forgotten I wish the best for Bek Allen and Clint Allen family he should still be here #justiceforclint,' one relative posted to social media. 'You were taken way to soon. Thank you for showing me all the stupid things we use to do as kids,' another friend posted. 'Thanks for showing me how to sneak to the milk bar while we were \"mowing the lawns\".'",
        "The incident has angered Sale residents, who claimed the town had become littered with 'crazies' when the sun set. One Sale resident said the town's main street was 'not safe at night anymore' and that he was also threatened with a knife recently.'I walked home from work the other night at 11pm and there was crazies swearing and waving knives at me in Raymond St near the banks,' Tez Leeson said on social media.Anyone who witnessed the incident or has any information is urged to contact Crime Stoppers on 1800 333 000. "
    ]
}