{
    "articleURL": "/sport/nfl/article-12056515/Zack-Kuntz-New-York-Jets-rave-freak-draft-pick-despite-selecting-220TH-overall.html",
    "content": [
        "Zack Kuntz was picked by the Jets in the seventh round of the draft, 220th overallHe has been labelled a 'freak' by the team after his incredible combine results DailyMail.com provides all the latest international sports news The New York Jets front office are getting very excited about one of their new rookies... despite picking him in the SEVENTH round of the NFL Draft. ",
        "Zack Kuntz endured an injury-riddled 2022 season and went much later than initially expected, with the Jets getting him 220th overall.But that isn't lowering the excitement among the coaching staff in New York, with coach Robert Saleh labelling the 6-foot-8, 255-pound tight end a 'freak' this week.When asked about the Old Dominion star, Saleh said: 'There's an old saying, \"Always take the freak that loves ball.\" And if you do, usually they pan out.'So, he's got freakish ability and he's got a love for football, so now we just got to work with him.'",
        "Kuntz put in a head-turning performance at the NFL Combine, running a 4.55-second 40-yard dash, while finishing top among tight ends in the vertical jump (40ins), the broad jump (10ft, 8ins), and the three-cone drill (6.87seconds). Additionally, he bench-pressed 23 reps of 225 pounds, leaving the Jets drooling over his potential, and snapping him up on the third day of the draft at the end of April.'He tested through the roof,' general manager Joe Douglas said of Kuntz this week. 'So we were sitting there at the top of the seventh round and just going through some of the guys who just had that freak factor to him.'He was right there at the top - the size, the speed, the length, the jump, just everything - and another guy who may have been drafted a little sooner if not for the injury this year.'",
        "Kuntz suffered a dislocated kneecap in 2022, which meant he only played in five games and therefore endured an underwhelming final college season.His draft stock plummeted due to his lack of game-time, but Kuntz was confident his Combine comeback had left him in a good position to be selected by an NFL team.",
        "'I knew it was very doable for me to be in the position I'm in now. I think my performance at the combine definitely helped in terms of just raw athleticism and what I’m able to do physically. 'That’s why you go through the interview process and everything. It was such a deep tight end class. It is what it is. It’s no discredit to any of those guys. I think there’s a lot of great players. At the end of the day, I’m a Jet and I’m very happy for it.'Kuntz was the 14th tight end selected in the draft, with Utah's Dalton Kincaid the first to go, to the Buffalo Bills at No. 24. 'There’s a chip on my shoulder,' Kuntz said at being picked behind so many of his peers. 'I sat there with my family and I counted every single guy. In my position right now, I’m given a great opportunity and at this point, it’s in my hands what I do with that. I’m certainly going to maximize it.'"
    ]
}