{
    "articleURL": "/news/article-12044445/Peugeot-206-family-car-given-monster-makeover-massive-tractor-wheels-fitted.html",
    "content": [
        "Three engineers perfected their second model in a Top Gear-style makeoverSturdy machine can plough through water-logged assault courses and potholesStunning creation comes from a car found in a scrapyard in Backpool in 2014A Peugeot 206 family car has been turned into an offroad monster - after its owners fitted it with massive tractor wheels.",
        "The three engineers finally perfected their second model in a Top Gear-style makeover.The trio first attempted the feat with a manual Ford Fiesta - but had to switch after it didn't long.They then moved to the automatic Peugeot hatchback finding the supermini performed much better.'We're ­living out childhood moments from TV — Top Gear, Scrapheap Challenge and Chop Shop — building all the crazy things we saw and thought, \"Wow, I'd love to do that one day\",' Gareth Jenkins, from Nuneaton, Warwickshire told The Sun.",
        "The 29-year-old continued: 'Now we’re older that day is here, and we certainly have more to come.'We just wanted to see if we could get some old tractor wheels to work on a car.'The sturdy machine has the ability to plough through water-logged assault courses and tretcherous potholes. The three pals had to weld a steel rim to the tractor wheel to make it fit onto the tiny car.They also added strength bars to make sure it didn't break. And the stunning creation all comes from a car that was found in a scrapyard in Backpool in 2014. The group grew up idolising car shows on TV where like minded motor-heads competed to convert rusty bangers into new creations.",
        "In Top Gear, Jeremy Clarkson, Richard Hammond and James May created boats, electric cars and unique stretched limos.",
        "In Scrapheap Challenge teams competed each week to create a machine - made only from what they could scavenge from discarded junk.And in Chop shop Bangladeshi coachbuilder Nizamuddin Awlia and Cockney mechanic Bernie Fineman converted rusty autos into supercars using basic tech.The trio wanted to follow their heros - and created the Peugeot monster."
    ]
}