{
    "articleURL": "/sport/football/article-12045789/Man-Uniteds-Erik-ten-Hag-defends-Bruno-Fernandes-Casemiro-fiery-post-match-tiff.html",
    "content": [
        "The players were caught arguing after the whistle blew in United's 1-0 winCasemiro and Fernandes have been involved in heated conversations beforeErik ten Hag has said he saw 'no problem' with Bruno Fernandes and Casemiro's heated argument at full time after Manchester United beat Aston Villa on Sunday. ",
        "Cameras caught the post-match spat and images appeared to show the former Real Madrid midfielder lambasting his team-mate before Harry Maguire came over to intervene. Fernandes had scored the only goal of the game in a 1-0 win for United, which boosted their chances of finishing in the top four.Casemiro and the Portuguese midfielder have previously been caught arguing on the pitch, most recently after winning the Carabao Cup at Wembley. The Brazilian called out his team-mate amid the celebrations to question why Fernandes had failed to pass in front of goal when United were 2-0 up.",
        "But speaking to United's official website, Ten Hag said that he encouraged discussions between his players. 'Yes, of course [I encourage them],' the former Ajax coach said. 'They have to communicate. That have to organise it and make sure we get a win.'So when they are talking to each other, in discussion, debating with each other, I don't have a problem with that.'It showed willingness and showed ambition from this team.'Fernandes has been involved in several heated discussions with team-mates since his move to Manchester in 2020. During the Villa game, Jadon Sancho was spotted telling the Portugal international to 'stop moaning' after Fernandes dramatically threw up his arms in frustration after Sancho was dispossessed by Leander Dendoncker. ",
        "The pair later put their differences behind them, hugging after Fernandes found the back of Emiliano Martinez's net. Fernandes and Victor Lindelof  had a fiery exchange of words during United's 2020 Europa League semi-final defeat at the hands of Sevilla. Lindelof was the target of Fernandes' ire after he believed the defender was involved in conceding Luuk De Jong's 78th-minute winner, and fighting back, the Sweden international barked 'f*** you' and 'filho da puta' (Portuguese for 'son of a b****').",
        "United are still challenging on two fronts as they pursue Champions League football, while they are in the FA Cup final against arch-rivals Manchester City on June 3. Ten Hag's side are fourth, two points behind Newcastle with a game in hand. Liverpool are hot on the heels of United and are four points behind in fifth.  United are in action away at Brighton and Hove Albion on Thursday before they travel to London to play West Ham on Sunday. "
    ]
}