{
    "articleURL": "/tvshowbiz/article-12040963/Maya-Jamas-hit-ITV2-hit-danger-axed-four-seasons.html",
    "content": [
        "Maya Jama's ITV2 hit show is in danger of being axed, according to a new report on Wednesday. ",
        "The Love Island presenter, 28, stars as a team captain against Lady Leshurr on Hip Hop comedy show, Don't Hate the Playaz.Hosted by Jordan Stephens, the programme wrapped up its most recent season in December last year, with Maya having featured since its first episode in 2018.However, TVZone recently reported that the panel show could be facing an uncertain future and might not be renewed for a fifth series. It comes after Maya replaced Laura Whitmore as the host of Love Island, delighting fans of the show during the dating its most recent series in South Africa. ",
        "A spokesperson for ITV told MailOnline: 'It is untrue to suggest the show has been axed. We are proud of the multi-award winning success of Don't Hate the Playaz and will be exploring future plans for the series in due course.'The show, produced by BAFTA-winning producer Monkey, sees the teams go head-to-head to show off their Hip Hop knowledge. It comes after Maya looked incredible as she posed up a storm in a figure-hugging white co-ord on Monday.The Love Island host took to Instagram to give her 2.7million followers an insight into her bank holiday weekend. And the star did not disappoint, as she showcased her enviable figure in a tight white crop top and matching skirt.The beauty paired her stylish look with a pair of pink Miu Miu sunglasses and chic white Miu Miu bag.",
        "She added inches to her enviable frame with white knee-high boots and styled her brunette locks straight.",
        "Maya appeared in good spirts as she offered the camera a variety of poses and sipped on an espresso martini.In one snap, she offered a cheeky grin as she clutched a pink jersey jacket and showed off her flawless palette of make up, including a bold winged eye.At the end of her photo dump, Maya shared a quote which had clearly resonated with her.It read: 'Something I heard recently and I've tried to adopt whenever possible: \"Whoever has the most fun, wins.\"' "
    ]
}