{
    "articleURL": "/tvshowbiz/article-12058551/Kim-Kardashian-ex-Kanye-West-distance-parent-son-Saints-soccer-game.html",
    "content": [
        "Kim Kardashian and ex Kanye West were seen keeping a friendly distance from each other at their son Saint's soccer game in Los Angeles on Sunday.",
        "The 42-year-old single mom - who joined daughter North, 9, on TikTok recently - donned skintight leggings and a plunging bodysuit.She was joined by her ex-husband Kanye, 45, who also wore a full black ensemble, including a headwrap and crew neck top.The Kardashians star shielded her brown eyes behind a pair of sporty, glossy black sunglasses.She topped her clinging outfit with a zip-up hooded sweatshirt that she left unzipped. ",
        "The Skims founder's lustrous raven hair was brushed straight back and secured in a tight bun set at the middle of her head.Her slicked locks were parted precisely down the center as she rocked the pristinely preserved style she wore Friday night in New York City.The artist, who now goes by Ye, and his ex-wife seemed to keep a friendly distance from each other during the sporting event.But they both interacted with their adorable kids - Saint, 7, Chicago, 5, and son Psalm, who turns 4 on May 9. Missing from the scene was daughter North, 9.Kim's sweatshirt had baggy sleeves and cropped at her famously curvy hips.The reality television star's top exposed her busty cleavage and had a deep, soft v-neck dip.In addition to her outer layer, Kim also tied a second piece of clothing that looked to be a long-sleeved shirt, around her hips.",
        "Kardashian's leggings cropped at her ankles and she finished the getup with a pair of white and gray Nike Air Max sneakers with lime green and black accents.",
        "Kim appeared to forgo makeup for the day in the sun, and she skipped jewelry as part of her fuss-free look.The socialite flaunted a long, pointy-tipped, nude manicure as she sat in a black fold up chair. She was a doting, hands-on mother as she showed her daughter Chicago and son Saint loads of affection. Like his ex-wife, Kanye also wore a pair of leggings to the game, adding matching knee guards. The Chicago-bred rap star added black socks and sneakers and sported a scruffy beard. He wore a long black tag around his neck, which showed a headshot of himself inside a protective encasing.West attended the soccer game without the company of his 'wife' Bianca Censori.",
        "Saint looked adorable with his long curly hair styled in two-strand twists with box parts.The youngster was dressed in uniform, which was a black Adidas jersey with short, white sleeves.He also wore black athletic shorts with knee-high black Adidas socks and black and white Nike cleats.Chicago was darling in a long-sleeved pink shirt with charcoal black jeans, plus a pair of white sneakers with pink accents.",
        "The tot wore her lengthy dark curls in a high ponytail that was set at the top of her head.She looked on throughout the game, and also stayed close to her mom, who showered her in kisses.Chicago's baby brother Psalm sat in the grass and played with a friend as they shared toys.The little one wore his air in a neatly braided style and a gray firefighter-themed outfit from his recent birthday party.The back of the little boy's shirt read: 'Sound the alarm. Psalm turns 4!' ",
        "Kim has had a busy week, as the mogul spent recent days on the east coast in New York City.She attended the Met Gala last Monday, captivating fans as she appeared in a beaded pearl Schiaparelli gown that called back to her old Playboy spread. While there, she mingled with sisters Kendall Jenner and Kylie Jenner, and ex-boyfriend Pete Davidson.Speaking to Entertainment Tonight, a source said about the former couple: 'They both really respect each other and there are zero hard feelings.'The insider added: 'He knows Kim was looking to have fun when they dated, and he was totally fine with it. He also enjoyed their time together.'Later in the week Kim brought major sex appeal to a Manhattan party by turning up in a skintight black vinyl dress.",
        "Kardashian arrived at Cipriani Soho with her mother Kris Jenner to celebrate the 31st birthday of billionaire scion Alexandre Arnault.Other guests at the swanky gathering included pregnant Rihanna and beau A$AP Rocky.",
        "Kim then jetted back to the west coast, where she joined loved ones to celebrate her son Psalm's imminent birthday.The billionaire entrepreneur went all out for her youngest son, who turns four on Tuesday, by pulling out all the stops for a firefighter-themed birthday party.The undergarment designer was joined by her younger sister Khloe, who appeared in several photos and videos posted on Kim's social media.Kardashian began by sharing a video of several firefighters from Calabasas, who had been invited to the event, standing in front of a vintage fire engine.She then entered 'Psalm's fire department' and showed off a sizable mural that depicted her son responding to a fire alarm.The star also had custom plate decals printed that featured text reading: 'Psalm is fired up to be 4!'She hen gave her fans a look into 'Psalm's firehouse,' where partygoers could get their hands on custom-printed 'Psalm merch.'Many of the guests were provided with firefighter's costumes featuring their first names printed on the back of their coats.She went on to show off one of the event's dessert tables, which featured various Dalmatian-themed biscuits, cupcakes and marshmallow sticks, and she also had a churro stand installed at the event.",
        "Kardashian later donned her own custom-made firefighter's jacket and held her son's hand as they walked through the party's grounds.",
        "The Hollywood fixture went on to share videos of various dessert and candy tables that had been set up for the guests.Kim and Khloe were later seen riding in the vintage fire engine, and the latter posted a photo of daughter True, 5, wearing a t-shirt bearing her aunt's image.The 38-year-old's firstborn was also provided with one of the custom-printed firefighter's jackets.Psalm's older sister North shared a video to her TikTok account in which she went for a ride with her friends on the fire engine."
    ]
}