{
    "articleURL": "/wires/reuters/article-12053669/Guardians-try-slow-Max-Kepler-Twins.html",
    "content": [
        "Returning home didn't help the Cleveland offense immediately, and the Minnesota Twins' Max Kepler keeps punishing the Guardians every time he comes to town.",
        "Kepler's 440-foot rocket of a home run provided all the scoring in Minnesota's 2-0 victory on Friday during the opener of a three-game series between the American League Central rivals.The teams will square off again on Saturday.Kepler, 30, now has 15 home runs and 33 RBIs in 48 games in Cleveland -- his highest power figures anywhere other than Minneapolis.\"It's a good place to hit for lefties,\" Kepler said, according to the Minneapolis Star Tribune. \"You see it well, and you just try to pull it to right and see what happens.\"Kepler's blast off Cleveland rookie Peyton Battenfield -- who was otherwise outstanding in striking out seven over seven innings -- increased Minnesota's franchise-record streak of homering to 17 straight games.Cleveland manager Terry Francona said of Kepler, \"You don't have to remind me about him. I feel like I've seen every one of (his homers). He's dangerous when you leave something over the plate. He's very dangerous.\"The Twins have to hope that the long ball will spark Kepler's power stroke. In his previous 14 games, Kepler hit just one home run. He has four on the season after averaging 12.3 the previous three seasons following a career-best, 36-homer campaign in 2019.Meanwhile the Minnesota pitching staff aims to continue its strong form. The Twins have limited the opposition to three runs or fewer in eight of the past 12 games.",
        "The Twins' Saturday starter, veteran right-hander Sonny Gray (4-0, 0.77 ERA) leads the majors in ERA. Minnesota starter Bailey Ober, who got the win on Friday, said Gray challenged his fellow Twins starters to go deeper into games during spring training. They have responded, going at least 5 1/3 innings 22 times this season -- tied for first in the majors.Gray, in his 11th major league season and pitching for his fourth team, hasn't yielded more than one run in any of his six starts. He has struck out 41 and walked 12 in 35 innings.In 15 career starts against the Guardians, Gray is 6-4 with a 3.53 ERA. He went 1-1 with a 4.67 ERA vs. Cleveland last year.He will be opposed on Saturday by Logan Allen (1-1, 2.45). On Sunday, the left-hander became the second pitcher in Cleveland franchise history to strike out at least eight hitters in each of his first two major league starts, matching Herb Score's feat from 1955.After firing five innings of one-run ball in a win over the Miami Marlins on April 23, Allen gave up two runs in five innings against the Boston Red Sox on Sunday.He will hope that the Cleveland offense can break out of its funk. Since losing 8-7 in 10 innings to the Red Sox on April 29, the Guardians have been held to three runs or fewer in five straight games, four of them losses.",
        "\"If a pitcher has the ability to spin it or change speeds in any count, it's giving us fits right now because we're just trying to hit everything,\" Francona said.--Field Level Media"
    ]
}