{
    "articleURL": "/news/article-12049581/Shocking-moment-Florida-dad-41-sucker-punches-umpire-sons-high-school-baseball-match.html",
    "content": [
        "Jorge Ignacio Aponte-Gonzalez was arrested after he allegedly punched a military veteran umpire during his son's high school baseball match last monthHe threw the punch at the unsuspecting official after he got into an argument with his child, the Osceola County Sheriff’s Office saidAponte-Gonzalez was booked into Osceola County jail with his bail set at $1,500 and is facing charges of battery on a sports officialA 41-year-old father has been arrested after he allegedly punched a military veteran umpire during his son's high school baseball match last month. ",
        "Jorge Ignacio Aponte-Gonzalez threw the punch at the unsuspecting official after he got into an argument with his child, the Osceola County Sheriff’s Office said. Shocking footage shows the moment the umpire, a 63-year-old military veteran, was assaulted from behind and left unconscious.Aponte-Gonzalez was booked into Osceola County jail with his bond set at $1,500 and is facing charges of battery on a sports official and disruption of a school function. ",
        "The incident began when Aponte-Gonzalez's son began to argue with the umpire during the match and the official told the child to calm down.He then walked over to a gate near the Kissimmee field in order to wait for a colleague to take over a few innings like usual. But a video shows the suspect walking over to the umpire before he punches him from behind and knocks him to the ground. The parents and players in attendance, who were left shocked at the incident, rushed over to help the unconscious victim on the field. Osceola County Sheriff Marco Lopez said: 'The umpire is obviously going to maintain control of the game because that is what they are there to do. 'To make sure kids learn all about sportsmanlike conduct.'The kid was being disruptive, so the umpire’s like, \"Hey, tone it down,\" maintaining control.",
        "'They went back and forth a little bit. I don’t know exactly what was exchanged, but… that is what upset the father.'",
        "Aponte-Gonzalez is said to have told arresting officers that he was 'defending my kid' and failed to show remorse for what he did. Lopez said: 'This umpire is a 63-year-old man. He’s a veteran. A United States military veteran. 'He does this because he has passion for baseball and he likes to give back to his community. He loves to dedicate his time to baseball and kids.' The sheriff spoke to the victim who said he wants the suspect prosecuted so other youth referees and officials do not suffer similar violence. 'There should be no parent acting like this public,' Lopez said.He called Aponte-Gonzalez a 'coward' who routinely disrupted other games from the stands."
    ]
}