{
    "articleURL": "/sport/football/article-12051613/Borussia-Dortmund-boss-Edin-Terzic-plays-Jude-Bellinghams-potential-Real-Madrid.html",
    "content": [
        "The England international looks set to join the Spanish giants in the summerJude Bellingham has almost agreed personal terms with Real Madrid over moveEdin Terzic sought to calm speculation surrounding his potential transferBorussia Dortmund boss Edin Terzic has sought to calm speculation surrounding Jude Bellingham's seemingly imminent move to Real Madrid.",
        "Mail Sport reported this week that the Spanish giants have won the race to sign the 19-year-old midfielder, with Bellingham on the verge of agreeing personal terms and the transfer fee not thought to offer too much of an obstacle.Liverpool, Manchester City and a host of other top European clubs had long thought to have been in the frame but the 14-time champions of Europe have won out, or so it is believed.Terzic, speaking ahead of Dortmund's crucial Bundesliga clash with Wolfsburg at home as they chase a first title in over 10 years, played down the noise surrounding Bellingham's move.'I haven't even heard from him that he's involved with another club,' he told reporters all understandably queuing up to question him regarding the England international.",
        "Terzic's comments follow days of endless reports surrounding Bellingham's next club, with the midfielder's future having dominated headlines and column inches for some time.His strong performances for England at last year's World Cup as well as his crucial role in Dortmund's best season in some years have only sought to heighten the interest in him around Europe.Having been signed from Birmingham City as a 17-year-old, Bellingham has matured into one of Europe's foremost midfielders and Dortmund can be certain that they will receive over £100m for him.",
        "Such is their desire to land him, reports emerged on Friday suggesting Bellingham was set to become Real Madrid's second highest earner this summer - trailing only the seldom used Eden Hazard.The report states that Bellingham will sign a six-year contract with Los Blancos.Furthermore, Bellingham will have a reported release clause of £875million, the equivalent of €1billion. It is believed Real Madrid, who have had meetings with Bellingham's father, Mark, in recent weeks surged to the front of the hunt following Liverpool's withdrawal last month.Liverpool had for a long time seemed the next destination for Bellingham, though the scale of their midfield rebuild this summer and the ever-increasing price being touted for the midfielder ensured they were put off.As it is, Bellingham looks set to be the heir to Luka Modric's midfield throne, a key pitch in Real Madrid's plot to land him.Terzic himself has been open in the past regarding Bellingham's future, admitting Dortmund to be a 'step' for him as he plots his next career move.Leaving Birmingham in 2020, Bellingham was said to be the envy of plentiful clubs but chose Dortmund to continue his development, a move that has proven to be a masterstroke, much like his friend Erling Haaland's.'With all respect for Jude and his performance, we are answering these kinds of questions since he arrived (in 2020),' said Terzic in March.",
        "'Before he chose to join us, he had opportunities to join the Premier League. There was loads of interest from top-flight clubs.'But he chose to join us because he knows it can be the perfect step for him. I think we’ve proven it both ways. He’s helping us a lot. But we as a club are helping him and his career as well.'We are really happy that he’s part of our team, he’s one of our leaders at 19. He stepped into the England team as one of our players. It’ll be a topic for his future.'Dortmund trail Bayern Munich by a point following last week's draw with Bochum."
    ]
}