{
    "articleURL": "/wires/ap/article-12048429/Napoli-wins-1st-title-Maradona-played-club.html",
    "content": [
        "ROME (AP) - Below a giant mural of Diego Maradona, Napoli fans celebrated the Italian league soccer title as if they were at the game - singing, jumping and lighting flares.",
        "On the other side of Naples, at the stadium now named for Maradona, tributes to the club´s most emblematic player were everywhere: his image on banners, flags and scarves, his No. 10 on the back of shirts.As Napoli coach Luciano Spalletti put it after the Partenopei sealed their first league title since Maradona led the club to the 1987 and 1990 championships, the late Argentina standout's legacy made a difference.\"These fans have seen big coaches come and go. They saw Diego Armando Maradona play and perhaps his (impact) is also felt in this success,\" Spalletti said.Unlike the Maradona years, however, this Napoli title wasn´t about a single player but rather a well-run unit that often overwhelmed opponents with standouts in every department: league scoring leader Victor Osimhen at center forward, league assist leader Khvicha Kvaratskhelia at left wing, passing expert Stanislav Lobotka in central midfield and physical presence Kim Min-jae at center back - not to mention their veteran coach.Napoli clinched the trophy with a 1-1 draw at Udinese on Thursday.",
        "Osimhen equalized for Napoli early in the second half by redirecting in a rebound after Sandi Lovric had put Udinese ahead early on.\"I´m happy for all Napoli fans worldwide,\" Osimhen said. \"No one deserves the scudetto more than Neapolitans - more than us.",
        "\"I don't care who scored, I just wanted to get the scudetto.\"Napoli moved an insurmountable 16 points ahead of second-place Lazio with five rounds still to play.Besides the 11,000 Napoli fans inside and 5,000 more outside the stadium in Udine in northern Italy, a capacity crowd of more than 50,000 watched the match on jumbo screens at the Stadio Diego Armando Maradona in Naples.\"Napoli, this is for you,\" Spalletti said. \"There are people here who will be able to get through difficult moments in their lives because they remember this moment. These people deserve all the joy.\"In Udine, celebrating fans invaded the field at the final whistle, while in Naples there were fireworks and delirium.\"You always told me, `We want to win,´ and now we´ve won. We´ve won all together,\" Napoli president Aurelio De Laurentiis told the crowd at the Naples stadium before he embraced Naples Mayor Gaetano Manfredi.De Laurentiis took over the club in 2004 when Napoli was declared bankrupt, restarting in the third division.\"This is the coronation of a dream that´s been going on for 33 years,\" De Laurentiis added. \"It's been a long process.\"It´s the first time a club south of Italy´s traditional soccer capitals of Milan and Turin has won the league since Roma claimed the title in 2001.",
        "Napoli matched the record of clinching with five rounds to spare, shared with Torino (in 1947-48), Fiorentina (1955-56), Inter Milan (2006-07) and Juventus (2018-19).In the 52nd minute, Osimhen slotted in a rebound off a shot from Kvaratskhelia following a corner kick.During his goal celebration, Osimhen broke his face mask and the Nigeria forward had to play without it for a few minutes while it was repaired by Napoli staff members on the sideline.It was Osimhen´s 22nd goal in the league this season and the 46th of his Serie A career, matching former AC Milan standout and current Liberia President George Weah as the top African scorers in Italy.Afterward, Osimhen - who has acknowledged that he would like to play in the Premier League one day - would not commit to remaining with Napoli.\"I want to enjoy this moment for the rest of my life. Then after the season my other dreams can come,\" Osimhen said. \"But for now it's not a time to talk about my other dreams. I wanted to win this. ... For me this is just a moment.\"Napoli had a brief lapse during the first half during which Lovric found space within the area for a quick control and angled shot inside the far post in the 13th.",
        "Napoli has dominated all season and didn´t lose in the league until getting beat by Inter in January. A 5-1 victory over Juventus nine days later left no doubt that this was the Partenopei´s year.Napoli, though, wasn´t even considered a title contender before the season because of the departures of former captain Lorenzo Insigne, club record scorer Dries Mertens and defensive stalwart Kalidou Koulibaly.But Osimhen has developed into the most dangerous striker in the league, and dribbling wizard Kvaratskhelia has done far more than just replace Insigne on the left wing as one of the biggest revelations in Europe this season.The title also gives Spalletti the one honor he has coveted most after previously managing Roma and Inter and winning two Russian league championships with Zenit St. Petersburg.Spalletti´s innovative style first showed promise at Udinese nearly two decades ago when he led the provincial club to a fourth-place finish and a spot in the Champions League. Udinese coach Andrea Sottil played under Spalletti at Udinese.\"The fans deserve it,\" Napoli captain Giovanni Di Lorenzo said, his hair colored in Napoli blue from the locker room celebration. \"It felt like we were playing in Naples today.\"___Andrew Dampf is at https://twitter.com/AndrewDampf___More AP soccer: https://apnews.com/hub/Soccer and https://twitter.com/AP_Sports"
    ]
}