{
    "articleURL": "/wires/ap/article-12047529/Alabama-fires-baseball-coach-report-suspicious-bets.html",
    "content": [
        "Alabama fired baseball coach Brad Bohannon on Thursday after a report of suspicious bets involving his team, with the school saying he violated \"the standards, duties and responsibilities expected of university employees.\"",
        "No details were disclosed on why Bohannon was let go after five years on the job, but the firing came three days after a report warning of suspicious wagers prompted Ohio´s top gambling regulator to bar licensed sportsbooks in the state from accepting bets on Alabama baseball games. Pennsylvania and New Jersey have since followed suit.ESPN reported later Thursday that surveillance video from the sportsbook located at the Cincinnati Reds' Great American Ballpark indicated the person who placed the bets was communicating with Bohannon at the time. ESPN cited multiple anonymous sources with direct information about the investigation.Alabama said athletic director Greg Byrne had initiated the process of firing Bohannon and that pitching coach Jason Jackson will serve as interim head coach, beginning with Thursday night's home game against Vanderbilt.\"There is no reason to believe at this time that any student-athletes are involved,\" a person familiar with the investigation told The Associated Press. The person spoke on condition of anonymity because of an ongoing investigation by the school.The firing comes nearly five years to the day since the Supreme Court cleared the way for states to legalize betting on sports. Sports betting is currently legal in 33 states, with billions wagered every year.The NCAA bars athletes and athletic employees from betting on games \"and from providing information to individuals involved in or associated with any type of sports wagering activities concerning intercollegiate, amateur or professional athletics competition.\" The NCAA said Thursday it was committed to protecting athletes and the \"integrity of competition\" and is monitoring the case.",
        "One sports wagering expert said it could be an eye-opener for college sports.\"It´s going to raise a lot of questions,\" said John Holden, an associate professor at Oklahoma State. \"I think we would be naïve if this was the only incident like this that has happened. If this is linked to the coach, the consequences will serve as a warning to the rest of college sports that this is not permitted and it will be dealt with.\"Matthew Schuler, executive director of the Ohio Casino Control Commission, issued an emergency order Monday barring wagers on Alabama baseball. The order said one of the state´s \"certified independent integrity monitors\" notified the state about the suspicious bets.The Pennsylvania Gaming Control Board issued a similar warning. Spokesman Doug Harbach said Thursday the board received a report from Las Vegas-based U.S. Integrity warning sportsbooks of suspicious wagering activity involving Friday night´s Alabama-LSU game.Alabama scratched its starting pitcher shortly before the game, then scored five runs in the ninth inning of an 8-6 loss to LSU, which was ranked No. 1 in the major college baseball polls while Alabama was unranked. No details have been released about the nature of the suspicious bets.The New Jersey Division of Gaming Enforcement also told sportsbooks to suspend wagering on Crimson Tide baseball games.",
        "Matthew Holt, the president of U.S. Integrity, declined to give details of the case and what raised red flags, but did say it started with the sportsbook.\"The licensed sportsbook operator reported the abnormal activity and sent it over to us,\" he told AP.U.S. Integrity then alerted surrounding states, took responses and reported back to Ohio regulators, who took over the investigation, Holt said.U.S. Integrity has deals with professional sports leagues, schools and conferences across the country - including the Southeastern Conference of which Alabama and LSU are members.Ronnie Johns, chairman of the Louisiana Gaming Control Board, told nola.com that two bets were on LSU to win Friday's game.\"One was on a parlay which involved the LSU-Alabama game, and then there was another straight-up (money line) bet,\" Johns told the news outlet. \"I was told it was a large bet that involved LSU-Alabama.\"Holden said a five- or six-figure bet placed on a top-ranked LSU football team wouldn´t cause much of a stir. But he said he believes bet limits would be placed on college baseball because there isn´t much wagering activity on the sport and not as much information available that might affect the betting lines.\"I can´t imagine you being able to get down any significant amount of money outside of Louisiana,\" Holden said. \"Even in Louisiana, four figures would be about as large a bet as any sportsbook would take.\"",
        "The American Gaming Association said it does not have a figure for annual wagering on college baseball. Ohio Casino Control spokeswoman Jessica Franks said Ohio does not track wagering by sport.Bohannon went 166-124 in five-plus seasons, including a 30-15 record this season. In 2021, he led Alabama to its first NCAA regional since 2014.___AP College Sports Writer Ralph Russo in New York, AP Sports Writer Eric Olson in Nebraska and AP Writer Wayne Parry in New Jersey contributed to this report.___More AP college sports: https://apnews.com/hub/college-sport and https://twitter.com/AP_Top25 and https://apnews.com/hub/sports-betting"
    ]
}