{
    "articleURL": "/money/markets/article-12043871/Unilever-investors-revolt-fat-cat-pay.html",
    "content": [
        "Unilever suffered a bloody nose as shareholders revolted over fat cat pay in the boardroom.",
        "At its annual general meeting, the consumer goods group behind Hellmann’s, Dove and Ben &amp; Jerry’s ice cream saw 58 per cent of participating shareholders vote against its pay report for 2022. Unilever said it was ‘disappointed’ at the outcome, though the vote was advisory rather than binding.‘We are committed to shareholder engagement and will consult over the next few months to listen carefully to feedback and determine any next steps,’ the company added. ",
        "Outgoing boss Alan Jope, who took over as chief executive in January 2019, was paid £4.8million last year, including a base salary of £1.37million.That took his pay in the four years from 2019 to 2022 to £16.4million.But his reign has proved controversial. Jope launched a failed bid to snap up Haleon, the Sensodyne toothpaste maker, for £50billion last year.And he has clashed with shareholders, notably fund manager Terry Smith, over how the company is run. Smith has accused Unilever of ‘virtue signalling’ with its ethically-focused marketing.But while the company has gained a reputation for being ‘woke’, it continues to operate in Russia even after the invasion of Ukraine.Activist investor Nelson Peltz, whose daughter Nicola married David and Victoria Beckham’s son Brooklyn last year, joined the Unilever board after taking a stake in July 2022.",
        "Just two months later, Jope said he would step down after nearly four decades with the company.He will step aside on July 1 to make way for Hein Schumacher, who is the former boss of the Dutch dairy company Royal Friesland Campina.Three shareholder advisory firms called on investors to vote against the company’s pay policy at the annual meeting.Pirc opposed the remuneration report while Glass Lewis raised concerns over the £1.62million base salary of the incoming boss – some 18 per cent more than Jope was paid.Unilever failed to provide a ‘cogent rationale for the necessity of such a remuneration package’, it added.Likewise, Institutional Shareholder Services said that Schumacher’s base salary is ‘significantly higher than his current salary at Royal Friesland Campina and UK market peers’.Last week Unilever said in the first three months of the year, sales were 10.5 per cent higher than in the same period a year earlier, at £13billion, which was driven by a 10.7 per cent increase in prices and a 0.2 per cent fall in the volume of goods sold.In the fourth quarter of last year, its prices rose 13.3 per cent and volumes fell 3.6 per cent.",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}