{
    "articleURL": "/news/article-12055235/RICHARD-KAY-Step-golden-step-ancient-rituals-gave-Charles-crowning-glory.html",
    "content": [
        "His face betrayed nothing more than a calm serenity. For a man of restless energy and insecurity, Charles chose his Coronation day to reveal a new kingly demeanour. ",
        "There were nerves, of course, but nothing to disturb the look of benign pleasure as he emerged on to the Buckingham Palace balcony.For once, he even knew what to do with his hands. There was no fidgeting or pulling at his cuffs. Hidden beneath his robes they emerged only to acknowledge and wave to the crowds.Here, at last, he was The King.So much history has been written about that famous balcony. For decades Charles had been a part of it – but only as a support act.",
        "Yesterday, for the first time, he was the focus. No wonder he came back for an encore, gazing at the rhapsody of red, white and blue that covered the Mall, as a river of friendly humanity flowed between the plane trees.His has been a life of preparation. He called it the 'eternal wait'. Now you could see the relief at having at last arrived at his destination after such a long journey.Everything went like clockwork. Even the ink from his fountain pen flowed to order as he signed his oaths to uphold the Protestant succession. And while yesterday's spectacle was a grand story of pageantry and symbolism, ritual and faith, for the King the greatest consolation, surely, was the presence of Camilla being anointed and crowned at his side.",
        "He seemed to take confidence from her very presence.His Camilla. For years, he had feared that, when the solemn moment came, he would be a King alone: cursed for marital misfortune and a tragedy that briefly threatened to imperil the monarchy. But for all his contradictions and foibles, perseverance must be his greatest quality. In making Camilla acceptable, he had first to win over his family – no easy task when the future of the institution was at stake – and then the country.Just as he judged the moment was right to wed Camilla in 2005, so the Fates and his late mother dealt him a good hand. Queen Elizabeth lived to see the steadiness and reassurance that Camilla conferred on her son. But she also knew that being monarch requires not just erudition and humility – attributes Charles has always possessed – but also a partnership.",
        "For her, it was with Prince Philip. That was why she marked her Platinum Jubilee anniversary by expressing her sincere wish that the former Mrs Parker Bowles would have the title Queen Consort when Charles came to the throne. Until that point, there had been an understanding that she would be known as Princess Consort.It meant that his page in history would be shared. Chivalry, tradition and solemnity – along with military precision – all played a part, but what really mattered for Charles was that Camilla was there every step of the way.",
        "She had steadied him and readied him. Practised wearing her crown just as he had, accompanied him to rehearsals and, on that bone-shuddering ride back to the Palace in the Gold Coach, the first to offer compliments. There were anxieties, of course. That wait in the carriage before departing the Palace for the Abbey, for instance, when the rain was hammering down.The oldest crowned sovereign in British history, Charles may not have been overawed by the splendour London had put before him, but he was supremely conscious of the occasion.In times past, his eyes would have raked the congregation, searching left and right for some familiar face with whom to exchange a glance or a smile.Yesterday his eyes were fixed, betraying only concentration on a sacred ceremony that reflected his deeply held faith.Processing both up and down the Abbey, there was on all sides a sea of bobbing hats and stiff-necked bows. His daughter-in-law Kate dropped the deepest of curtseys. Had he tried to seek out his son Harry, he would have looked in vain. ",
        "The prince was not only seated with the non-working members of the Royal Family but obscured by the plume of his aunt Princess Anne's cocked hat.For 21 years, Charles has been tinkering and tuning the details of his own coronation, settling on a combination of 1,000 years of tradition fused with touches of modernity. ",
        "It was a blend of the fastidiousness and colour that we have come to expect from the King. Indeed, with so many working parts, there was ample room for error. But every bit had been exhaustively gone over.Charles knew he could not bring the youth and vigour that his mother exhibited at her coronation in 1953, but he was able to balance those qualities with his years of experience and wisdom. Every element from kissing the Bible to receiving the orb and sceptre was done with a sense of majesty. The age of chivalry, like the age of reverence, may have long-gone for modern monarchs.In its place has come an age of insatiable curiosity. Somehow Charles managed to straddle past and present.When he spoke for the first time to make his vow to the Almighty – to serve, not be served – his voice was clear and strong.This, at last, was a man no longer tormented by the frustration that characterised so much of his earlier life as Prince of Wales, when he competed for attention with a glamorous younger wife.Once or twice, he licked his dry lips and spoke only to thank those who brought him the instruments of coronation.But there was no sign of impatience as the service moved inexorably to its pivotal moment.",
        "The changes of outfit took place seamlessly, as if he was in a costume drama, which of course he was. There was a 'Thank you, William' when his son gravely buckled him into a stole for the crowning.And he allowed the faintest of smiles when William, paying homage to his father, declared himself his 'liege man of life and limb', uttering the same words Charles himself declared to his mother at his investiture as Prince of Wales 54 years ago.Having waited 70 years for this moment, Charles was remarkably cool, so much so that when that weighty Crown of St Edward – all 4.9lb of it – was lowered on to his head, there was no sense of excitement or urgency.And if he felt a moment of triumph, he certainly didn't show it.",
        "For much of this two-hour service, Camilla was a bystander, her face as impassive as her husband's. But when it was her turn to be anointed and crowned, the King looked on with kindly approval. Those twin moments of crowning ratcheted up the tension. For many of the years of his marriage to Diana – and afterwards – the talk was of skipping a generation and that Charles should never be king. But, as the weight both of St Edward's crown and history bore down on the King, such talk seemed foolish and wrong.",
        "Charles has fulfilled his destiny. It has just taken longer than many thought. If he harbours any regrets, he does not show them.He has always taken a fatalistic approach to providence. If he was determined to ensure his wife was crowned Queen, he was also uncompromising in the kind of coronation he wanted and the people he wished to witness it. Family, yes – but not all of them, for he knew he had to make adjustments that would sit well with modern Britain.So many other monarchies have faded or withered away through extravagance or a failure to adapt to change.Britain's is the best-known in the world and its members are global celebrities. Its survival has lain in its willingness to embrace change.Charles wants to be an agent of change. Which is why, when he came out to accept the acclamation of the crowds on the Palace balcony, all eyes were on the supporting cast behind him.William and Kate were there of course, but away to the side, anxious not to upstage the King on his big day. There was no Harry and no Prince Andrew, but it was certainly more crowded than last year's Platinum Jubilee showpiece.Was this a rethink? Or have Princess Anne's cautionary words about the pressure to slim down the monarchy had an immediate impact?Neither, in fact. But the King did want to share that moment of public applause with all those in the family, young and old, who have supported his journey. Years ago, a younger and less certain Charles related to a friend fragments of memories of his mother's Coronation. He told how, in the 1950s, after her long overseas tours, crowds would pour into London's streets to welcome her home.As they drove around the Victoria Monument, ironically the epicentre of yesterday's joyful celebrations, the then Prince Charles turned gloomily to his companion and said: 'Of course they'll never do that for me.'How wrong he was. Yesterday tens of thousands of loyal supporters swamped the Mall – and roared to tell him so."
    ]
}