{
    "articleURL": "/wires/reuters/article-12059395/A-great-treat-King-Charles-says-thanks-coronation-celebrations.html",
    "content": [
        "Charles rededicates his life to service",
        "Charles and Camilla appear in surprise sketchLouis, 5, operates digger in first royal engagement(Recasts with new statement from king paragraph 3-6, adds detail paragraph 14, adds bullet points)By Alistair SmoutLONDON, May 8 (Reuters) - King Charles on Monday gave \"sincere and heartfelt\" thanks to everyone involved in his coronation weekend and said he and his wife Camilla would rededicate their lives to service as three days of celebrations drew to a close.Amid pomp and pageantry, Charles and Camilla were crowned at London's Westminster Abbey on Saturday in Britain's biggest ceremonial event in 70 years.In an echo of his late mother Queen Elizabeth's Platinum Jubilee message last June, before she died three months later, Charles and Camilla reiterated their pledge to serve.\"As the Coronation weekend draws to a close, my wife and I just wanted to share our most sincere and heartfelt thanks to all those who have helped to make this such a special occasion,\" Charles said in a statement, paying tribute to those who made the weekend possible and those who joined in celebrations.\"To know that we have your support and encouragement, and to witness your kindness expressed in so many different ways, has been the greatest possible Coronation gift, as we now rededicate our lives to serving the people of the United Kingdom, the Realms and Commonwealth.\"",
        "The statement came at the end of three days of celebrations, and was accompanied by four official photos of Charles, Camilla and members of the royal family.Festivities included a \"Coronation Concert\" featuring singers including Lionel Richie and Katy Perry, as the royals joined a 20,000-person audience at Windsor, the king's palace to the west of London.In a surprise comedy sketch after the concert, Charles and Camilla interrupted Richie and Perry as they were relaying their experience of the weekend on TV show American Idol, on which the singers are judges.Charles asked Richie whether the singers will be there \"all night long\", in reference to one of Richie's hits.\"I just wanted to check how long you'll be using this room for?\" asked a chuckling Charles.DAZZLING SPECTACLERounding off a long holiday weekend of street parties and celebrations, Monday saw thousands of organisations get together for a volunteering programme.Charles' son William and his wife Kate took part in \"The Big Help Out\" by visiting a scout group in Slough, near Windsor, with their children. Kate is president of the Scout Association.It was the first royal engagement for their younger son Louis, 5, who shovelled, pushed a wheelbarrow, and even operated a digger, with supervision from his father.",
        "Other members of the royal family volunteered at events around the country, as did Prime Minister Rishi Sunak and leader of the opposition Labour Party Keir Starmer.\"On the weekend, I think no other country in the world could put on such a dazzling spectacle,\" Sunak told broadcasters.\"It was deeply moving to be in the coronation service and incredibly uplifting, and it's an experience I think that nobody will forget for the rest of their lives.\" (Reporting by Alistair Smout; Editing by Alison Williams, Nick Macfie and Christina Fincher)"
    ]
}