{
    "articleURL": "/sport/football/article-12054145/Tottenham-ask-Barcelona-price-Franck-Kessie-LaLiga-giants-look-balance-books.html",
    "content": [
        "Tottenham have asked Barcelona to give them a price for Franck KessieThe midfielder looks to be one player who could be sold by the club this year He has fallen out of favour in Xavi's side having started five league games Tottenham have reportedly asked Barcelona to 'give them a price' for midfielder Franck Kessie. ",
        "The 26-year-old signed for the club in July 2022 and while he has made 39 appearances for the Catalan side, he has struggled to cement himself as a regular face in Xavi's first XI, having started just five LaLiga games this season. Tottenham have been long-standing admirers of Kessie, notably submitting a £13m bid to sign the Ivory Coast midfielder back in December. While Kessie had struggled to find his feet at Barcelona, he rejected that approach from Spurs, as well as an offer to return to his former club AC Milan, and also rejected a wage cut, as the club looked to free-up some cash to re-sign Lionel Messi.But according to SPORT, Daniel Levy's side have once again inquired about the player and it seems this time he could leave the club, with the outlet reporting that he 'is one of the players chosen to leave Barca as of June 30.' ",
        "It comes as cash-strapped Barca are looking to balance their books before the end of June, in a bid to ensure they can make new signings this summer and hold on to some of their key talents. The LaLiga leaders are currently mired by debts of £1.33 billion (€1.5bn), are embroiled in a corruption case and must raise funds of £177 million (€200m) in order to be able to make transfers this summer. ",
        "Kessie's departure could help to alleviate the financial squeeze the club are facing, with the Spainsh outlet saying: 'The club's [Barcelona's] goal is to close a direct sale and Tottenham has asked for a price in recent days.' Despite having signed him less than a year ago, he could be one of several players to leave this summer, with Newcastle also reportedly having bid £60m for Raphinha. ",
        "Kessie, who has 58 caps for the Ivory Coast, was the first signing in a big summer swoop by the Catalans, who also acquired Robert Lewandowski for £42.5m, Raphinha for £56m and Jules Kounde for £56m, but had initially struggled to register the defender. Kessie joined from AC Milan on a free transfer, but he has struggled to cement his place in the side, starting just 14 times in 39 appearances across all competitions. It is a far cry from his form in Italy, where the 26-year-old made 25 starts for Milan in the Serie A alone last season, making 39 appearances across all competitions, before scoring seven times for the Italian giants. Given regular game time, he could become an important player at Tottenham, who are also keeping tabs on several other midfielders, including James Ward-Prowse. "
    ]
}