{
    "articleURL": "/news/article-12054633/Seattle-girl-2-mauled-German-shepherd-citys-famed-Pike-Place-Market.html",
    "content": [
        "Harlow Loren was visiting Pike Place Market on Monday when she was attacked by the unleashed German ShepherdThe dog's owner said the pup was 'friendly' before it turned on the toddler  Harlow's mother LoRee Loren is pleading for the dog's owner to come forward A toddler was left with a deep gash on her face after being mauled by a German shepherd she was invited to pet at Seattle's famed Pike Place food market.  ",
        "Harlow Loren was left wounded and traumatized after the incident Monday, when she spotted the unleashed animal with its female owner. The dog's owner, who has not yet been identified, told the little girl her pup was 'friendly,' Harlow's mom LoRee Loren told KOMO. But when when little Harlow started petting the animal it sunk its fangs into her face. After managing to free her from the clutches of the animal, Loren dialed 911 - and claims the dog's owner fled the scene before help could arrive. 'She allowed my daughter to pet her dog, telling us it was friendly. She wasn’t paying attention to her dog at all, and blamed my daughter when her dog attacked her in the face,' the shaken mom aid. Emergency personnel helped the injured little girl before she was taken to hospital.",
        "The tearful mother spoke to ABC4 News after her daughter was released from the hospital.'My daughter was petting this dog nicely, she was being watched, and then the dog suddenly just attacked.'Though the little girl did not need stitches she said she was given antibiotics as to prevent her eye to develop an infection.The Seattle Police Department was not available when DailyMail.com contacted them for any new developments.Loren, who was visiting from Thurston County in Washington State, said that it was her daughter's first time at the Pike Place Market. ",
        "She is now pleading for the dog and its owner to come forward.Earlier this week she posted photos of her daughter's injured face on Facebook asking for those to share the news with the hashtagSharing again for those who come to my page to share because the news blurred her photo out with the hashtag #JusticeForHarlowTravee.'I’m trying to find this lady and her dog. Today at the Pike Market Seattle,' she wrote on her Facebook. 'She took off, there are witnesses, camera footage. Police and animal control are looking for her and have a case started.''If you know who this is or have any information please contact Seattle Police, and Officer Cantu with Animal Control.  My daughter is traumatized,' she said, in part.'Please share this to help spread the word as groups in Seattle are REFUSING to let me post to get help from the community.'",
        "Pike Place Market, a public market that was established in 1907 is home to hundreds of independent businesses, local farmers, artists, crafts people and restaurants. It is famed as one of America's top foodie hot spots, and was the location of the first Starbucks store. The legendary market is Seattle's most popular tourist destination and ranked the 33rd most visited tourist attraction in the world with more than 10 million annual visitors.",
        "Pets are not permitted in the market's buildings, including the main arcade, only trained service animals, according to the website."
    ]
}