{
    "articleURL": "/news/article-12046803/BBC-News-presenter-Lukwesa-Burak-caught-stretching-live-air.html",
    "content": [
        "BBC's Lukwesa Burak stretched her arms to the ceiling and exclaimed 'OK'But she looked shocked when she suddenly realised she was being filmedA BBC News presenter was left red faced today after she stretched her arms to the ceiling and exclaimed 'OK' when she thought she was no longer on camera.",
        "Lukwesa Burak's face was a picture of horror when she suddenly realised the camera was still on her - and she tried to compose herself by looking down at her desk.Her silence continued for a few more moments before she spoke again - but to make matters worse, her microphone was still switched off so nothing could be heard.The moment at 11.17am this morning was spotted and tweeted by TV critic Scott Bryan, who is a BBC contributor himself on Radio 5 Live's Must Watch podcast.",
        "Burak had finished a segment of the programme and said as it cut to the BBC News titles: 'Around the world and across the UK, this is BBC News.'A short clip of bagpipers then appeared, before Burak could be seen stretching her arms up and then realising the camera was still rolling, leaving her with a face of sheer embarrassment.She stayed silent for a few moments, but could eventually be heard saying 'One of our top stories here on the programme and we've been monitoring a visit...'Mr Bryan, who often tweets videos of funny moments in television broadcasts, described it as 'quite the surreal minute on the BBC News Channel just now'.He added: 'Clearly the opt-out for UK viewers as international viewers had an ad break didn't work. Nice bagpipes though.'",
        "An 'opt-out' is where one set of viewers will see something different to another because a version they are being shown is no longer broadcasting from the central 'feed'.BBC broadcaster Victoria Valentine tweeted: 'There but by the grace of God goes every presenter of live broadcast in the history of news. Also, can we take a moment of appreciation for the wonder that is Lukwesa Burak?'BBC News presenter Rich Preston added: 'Two things strike fear in the heart of live TV presenters. First is hearing the director shout frantically 'IN-VISION, IN-VISION!!' in your ear when you thought you were, in fact, not in vision. The second is appearing in one of @scottygb's Twitter 'uh oh!' moments.'And BBC Radio Scotland presenter Grant Stott said: 'Oh the joys of live telly! Fronting something you have no control over!'"
    ]
}