{
    "articleURL": "/sport/football/article-12047093/Manchester-United-handed-huge-boost-Bayern-Munich-drop-race-sign-Victor-Osimhen.html",
    "content": [
        "The Nigerian forward has played a leading role in Napoli's title charge this term Man United, Chelsea, Real Madrid and PSG have all been tipped to make a moveHowever, the Bundesliga giants have decided they will now not bid for OsimhenManchester United have been handed a huge boost in their pursuit of Victor Osimhen after Bayern Munich dropped out of the race to sign him.",
        "The Nigerian forward has played a leading role in Napoli's title charge this term, netting 21 goals in 26 league games to help Luciano Spalletti's men move 15 points clear at the top of Serie A.United, Chelsea, Real Madrid and PSG have all been tipped to make a move in the summer with the player valued at more than £100million.However, the Bundesliga giants have decided they will not bid for Osimhen as they are unsure whether he is worth spending a record fee, according to BILD.He has more than two years left on his current Napoli contract after previously joining the club from French Ligue 1 outfit Lille in 2020. ",
        "The Red Devils are still looking for a long-term replacement for Cristiano Ronaldo, who left the club in November. Erik ten Hag is desperate for more firepower to put his team in touching distance of the likes of Arsenal and Man City - who are the only two sides in the Premier League title race this season.United are also interested in Harry Kane - but they were already warned that he will set them back £100million this summer, with the Tottenham forward's contract expiring in 2024.Osimhen revealed in March that he dreams of playing in the Premier League.He said: 'I think playing in one of the top five leagues in the world is an amazing feeling for me.",
        "'A lot of people worldwide consider the Premier League as the best and the strongest league but now I'm in one of the best leagues in the world which is the Italian Serie A.''I'm working so hard to make sure that I achieve my dream of playing in the Premier League some day but like I said, it's a process and I just want to keep on this momentum and continue to do well,' Osimhen added.Napoli can seal a first Serie A title in more than three decades - since Diego Maradona led the club to the 1987 and 1990 championships - if it wins or draws at Udinese on Thursday.Napoli missed out on a chance to clinch the title when they were held to a 1-1 draw by Salernitana on Sunday.They then watched as second-place Lazio beat Sassuolo 2-0 on Wednesday to again delay the celebration."
    ]
}