{
    "articleURL": "/news/article-12049585/Suncorp-Gender-terms-like-guys-no-longer-permitted-employees-diversity-training.html",
    "content": [
        "Suncorp just wrapped up its diversity training Staff are told to use less gender terms like 'guys' The training required an 80 per cent grade to passGender diversity training by one of Australia's biggest insurers is discouraging the use of common terms such as 'guys' by its employees while requiring them to score 80 per cent in an assessment to pass the course. ",
        "Brisbane-based Suncorp has introduced the training for all employees in the company, asking them to define numerous genders and reduce usage of certain terms.Among the terms and phrases that Suncorp will no longer allow are 'guy', 'acting like a girl', and 'that's so gay'.The training also asks questions like 'what is gender identity' and 'we cannot assume someone's gender identity just by their appearance. Is this statement true or false?' This year Suncorp's CEO Steve Johnson also introduced 'gender affirmation leave', which grants workers six weeks paid leave and up to 12 months unpaid leave for sex reassignment surgery.",
        "A company insider reportedly said the compulsory training implies that staff are 'bigots'.'The vibe at Suncorp is that they are annoyed that the underlying assumption is that they need the training,' the insider told the Courier Mail.'It implies they're all a bunch of bigots in the first place. 'Which they ain't.'Now, instead of referring to colleagues as their gender, staff are encouraged to use terms like 'folks' and 'team', as well as adding their pronouns to social media profiles and email footers.   The training includes an assessment at the end which fails those who score less than the equivalent of a standard 'B' grade in most schools. The 'short module', as described by a company spokesperson, was launched six months ago as Suncorp continues to transition into a more inclusive organisation. ",
        " '[The one-off] short training module was developed internally by our employees, for our employees, and aims to provide practical information so we can better support all our customers and workforce,' the spokesperson told Daily Mail Australia.'The overwhelming majority of our employees have already completed this course and we have received very positive feedback.'The primary goal of the module is to educate people that gender identity is not about 'physical markers but rather how we feel on the inside'.",
        "Other takeaways from the module says that it is not advised to assume anyone's gender and that instead of Mr or Ms, 'Mx' could be used as a 'non-binary option''Course material seen by News Corp also states that 'non-binary is a gender all on its own and can also be used to recognise the fluidity and diversity that some of us feel'.'Some people who are non-binary also describe having a trans experience. The point is we all describe our gender experience in different ways and the labels we use, if we use them, are personal.'The term 'allyship' is also referenced several times in the material.'Allyship is very important for all marginalised groups, including the LGBTIQ+ community. 'Which of the following statements are true? - an ally is someone who listens to, believes and amplifies LGBTIQ voices? Anyone can be an ally? Allyship means showing up, speaking up and offering support to others? Or all of the above?'",
        "In 2019 a study by the Harvard Business Review failed to find substantial evidence that diversity training was an effective tool for business to use on employees. The study concluded that there was an 'absence of any observable change in the behavior of male or white employees' - two audiences typically targeted by activist organisations as the worst offenders of bigotry. It also found that 'treating diversity training as a silver bullet' was ineffective in creating change, and suggested inviting 'underrepresented talent to join, stay, succeed, and lead within [the] organisation'."
    ]
}