{
    "articleURL": "/wires/reuters/article-12038551/Valentin-Yudashkin-Russian-designer-dresses-dress-uniforms-dies-59.html",
    "content": [
        "May 2 (Reuters) - Valentin Yudashkin, a Russian fashion designer known not only for flamboyant evening gowns but also for redesigning Russia's military uniforms, has died at the age of 59, Russian news agencies reported on Tuesday.",
        "Yudashkin, whose often theatrical designs are exhibited in museums in France and the United States, first made his mark by dressing Raisa Gorbacheva, the wife of Soviet leader Mikhail Gorbachev, in the late 1980s.In the 1990s, after the break-up of the Soviet Union, he became a Russian icon, styling national Olympic and soccer teams before, in 2008, redesigning 85 parade uniforms for all the branches of Russia's armed forces, together with Igor Chapurin.\"The most difficult thing was to make sure the uniforms, like any other uniform, were functional,\" he told Reuters in an interview. \"I spent a lot of time talking to people who are serving in the army now to understand what works for them, what doesn't, what's comfortable and what isn't.\"Yudashkin said he had been influenced by his early years working in theatres to produce costumes from cheap materials.He joined the French fashion body that awards the prized \"haute couture\" label, but briefly created a stir, according to the TASS news agency, by designing his own line of jeans.\"Everyone was indignant: 'You have the label! You have no right to belittle haute couture!',\" he was quoted as saying. \"Years later, what do we see? Dior jeans! Chanel sneakers!\"But Yudashkin also bemoaned the rise of leisure wear.",
        "\"You can't only walk around in sportswear,\" TASS quoted him as saying. \"In our lives there are weddings, birthdays, the first ball and the society debut, so the dress will remain forever.\"Yudashkin died two days after Vyacheslav \"Slava\" Zaitsev, the doyen of Soviet and Russian fashion, who was nicknamed the \"Red Dior\" by the French press at his zenith in the 1960s and also dressed Gorbacheva.Zaitsev counted celebrities and politicians among his clients and was the first Soviet designer to be allowed his own fashion label. (Writing by Kevin Liffey; Editing by Conor Humphries)"
    ]
}