{
    "articleURL": "/wires/reuters/article-12054925/Buffett-says-comfortable-investments-Japan-Taiwan.html",
    "content": [
        "By Jonathan Stempel, John McCrank",
        "OMAHA, Nebraska, May 6 (Reuters) - Warren Buffet on Saturday said he is more comfortable with Berkshire Hathaway Inc deploying capital in Japan than Taiwan, reflecting the growing tensions between the United States and China. The billionaire investor contrasted Berkshire's recently increased investments in five Japanese trading houses with its recent U-turn on a multi-billion dollar investment in Taiwan Semiconductor Manufacturing Co, or TSMC.\"It's a marvelous company,\" Buffett said at Berkshire´s annual meeting, referring to Taiwan Semiconductor. But \"I would feel better about capital that we've got deployed in Japan than in Taiwan.... That's the reality.\"Berkshire invested more than $4 billion in TSMC last year, only to sell most of it within three months. Tensions between the U.S. and China have simmered in recent months, with some investors worried that China might invade Taiwan.Meanwhile, Berkshire revealed last month it had increased its stakes in Itochu Corp, Marubeni Corp, Mitsubishi Corp, Mitsui &amp;amp; Co and Sumitomo Corp to 7.4%, and Buffett said his company might buy more.Berkshire in August 2020 had first disclosed owning 5% stakes in each, in investments then worth more than $6 billion, and reported increasing the stakes to more than 6% in November.Buffett said the investment reflected their similarities to his own conglomerate Berkshire Hathaway Inc.",
        "\"The Japanese thing was simple,\" Buffett said. \"There were five very very substantial companies, understandable companies\" paying decent dividends and repurchasing their shares, and where Berkshire could manage the currency risk by selling yen-denominated debt to finance the sale, he added.\"They're doing intelligent things, and they're sizable, so we just started buying them,\" and have been \"more than pleasantly surprised\" at their progress, he said.Berkshire does not pay a dividend.Buffett's longtime business partner Charlie Munger took a different view, pointing to Apple Inc's success in using China as a major supplier, which he said has been good for both the company and the country.\"I think we're equally guilty of being stupid,\" Munger said, referring to the U.S. and China. \"If there's one thing we should do it's get along with China and we should have a lot of free trade with China, in our mutual interest,\" he said.(Reporting by Jonathan Stempel in Omaha, Nebraska and John McCrank in New York; Editing by Ira Iosebashvili and Chizu Nomiyama)"
    ]
}