{
    "articleURL": "/tvshowbiz/article-12050037/Jennifer-Lopez-breaks-silence-time-Gwyneth-Paltrows-shock-comments.html",
    "content": [
        "Jennifer Lopez has broken her silence for the first time since Gwyneth Paltrow's explosive confessions about her husband Ben Affleck's sexual prowess. ",
        "Appearing on The View on Thursday, the Jenny From The Block hitmaker, 53, spoke candidly about her husband and lauded how he raises their collective children. Speaking about her husband Ben, 50, she said: 'He's an amazing dad. It brings tears to my eyes. He is honestly the best dad I've ever seen. He's so involved, he teaches me about how to interact with the kids sometimes.'Her gushing homage to her husband came just days after Gwyneth, 50, stunned fans by comparing her two A-lister exes Brad Pitt and Ben - revealing the latter was 'technically better in bed but the former edges things as the better actor.She dated Brad from 1994 but they broke off their engagement in 1997 because at aged 24, she felt she was too young for marriage. She went on to have a three-year relationship with Ben, who married Jennifer last year. ",
        "In the wake of Gwyneth's comments, Jennifer opted to discuss his abilities as a father instead of giving a nod to his sexual abilities. Jennifer and Ben combined their families after tying the knot last year.  She has 15-year-old twins Emme and Max with her ex-husband Marc Anthony, while Ben has Violet, 17, Seraphina, 14, Samuel, 11, from his marriage to Jennifer Garner. ",
        "Branding him 'present, loving dad who cares', Jennifer said: 'He's an amazing dad. It brings tears to my eyes. He is honestly the best dad I've ever seen. He's so involved, he teaches me about how to interact with the kids sometimes...'He's just so in tune, he's such a brilliant guy anyway, like he's so learned in so many things, and you can just tell when he's had his kids, he read every book and everything you could possibly learn about children, and he applies it...'He is present and that's all you can ask for, is a present, loving dad who cares and who shows up every single day, and that's who he is.'",
        "Earlier in the week, Gwyneth was put on the spot in a podcast interview with Alex Cooper called Call Her Daddy.Giving a series of frank answers, Gwyneth answered who was best in the bedroom, saying: 'That's really hard. Because Brad was like the major chemistry love of your life at the time. And then Ben was like technically excellent.'I can't believe my daughter's listening to this.'Asked who she regarded as the better actor of the two, she said: 'They're both so talented. And Ben is a great writer and director. But I guess I would probably have to say acting alone, Brad. Because if you think of all the different roles that he's done.'",
        "Aside from the cheeky comments, Jennifer said it has been difficult watching her children starting to 'individuate' themselves from her. She said: 'I'm experiencing this now, we all experience it for the first time with our own kids, and you're just like \"Oh, this is what she was talking about\"... 'This is the time where your kids don't want to talk to you, and they kind of individuating from you, and it's all necessary, and intellectually I understand it. But my heart! My heart!'Outside of her life at home, Jennifer's film career has continued thriving - she will star in the upcoming film The Mother, set for release on Netflix on May 12.The action film sees Jennifer play an assassin determined to do anything to keep her young daughter safe.The role required lots of combat scenes, and Jennifer stepped up to the challenge with plenty of training.",
        "'That was one of those ones where you really have to train a lot, where you really have to do the fight training and you have to do the sniper training... It was a lot of fun but it's a lot of work,' she said.While Jennifer, who is now in her early 50s, wishes she would have gotten more of these kinds of roles when she was a little younger, she still says it was an 'empowering' experience.  ",
        "'And it's funny, you know I wish I would have gotten a lot of these types of roles that I'm getting now, funnily enough, when I was a little bit more, you know, spry.",
        "'A little bit younger, let's just say it. And it's exciting to be able to do it now, I think for me, it's really kind of empowering and makes me feel strong and good.'The Jenny From The Block singer described how her background in dance helped her pick up the fight routines. 'It was regular fight training, but it was choreographed. You have to be efficient, I can't be fighting eight hours a day. After an hour, I'm like, OK! 'So they had to be real efficient and we choreographed almost like a dance, which is good for me since I'm a dancer, so I can kind of do it step by step and I just learn it from there.'"
    ]
}