{
    "articleURL": "/sport/football/article-12053889/Gary-Neville-slams-Premier-League-club-owners-hitting-panic-button-ever.html",
    "content": [
        "Javi Gracia's dismissal took the number of managerial changes to 13 this seasonHe was the second Leeds manager to be sacked this season after Jesse MarschSam Allardyce has four games to try and preserve Leeds' Premier League statusGary Neville has slammed Premier League club owners for hitting the panic button more than ever this season.",
        "Javi Gracia's dismissal as Leeds United boss took the number of managerial changes in the top-flight to 13 this season. The 53-year-old Spaniard was sacked and replaced by Sam Allardyce until the end of the campaign.Gracia, the second Leeds manager to be sacked this season after they parted ways with American Jesse Marsch in February, lasted two-and-a-half months at Elland Road. And the Sky Sports pundit, 48, labelled Allardyce's appointment at Leeds as 'desperation'.",
        "'I couldn't believe it at first,' he said on the Gary Neville Podcast. 'The desperation we're seeing now...'I'm a club owner, I've sacked managers but the desperation we've seen this season in the Premier League mainly due to the fact clubs are so worried about losing that income, going down… we're seeing some of the maddest football decisions we've ever seen. And it's crazy.'This Leeds season has been as crazy as it gets. Jesse Marsch stayed for a long time, Javi Gracia comes in, it doesn't work then gets sacked and Sam Allardyce comes in for four games, then the sporting director goes…'The former England boss, 68, has four games remaining to try and preserve Leeds' Premier League status after replacing Gracia on Wednesday.Allardyce, who will be back in the dugout for the first time since leaving West Brom in 2021, said: 'Defensively the team will have to be the best it's been this season.",
        "'Obviously it's been a bit frail and we're going to try and put that right while we've been here.",
        "'In possession I've always seen them to be very, very good, so there's not a lot of work needs to be done from that point of view.'But out of possession recently, as everyone can see by the goals conceded, it's something that needs most work on in the short time we've had.'Leeds sit above the relegation zone on goal difference and the former Bolton, Newcastle, West Ham, Sunderland and Everton boss said he was delighted with the players' reaction to his survival plan.'I couldn't be more pleased,' he said. 'The players have aired their views and that's important for me.'"
    ]
}