{
    "articleURL": "/wires/pa/article-12060147/Watford-ensure-half-finish-hard-fought-win-against-Stoke.html",
    "content": [
        "Watford ended a season to forget with a hard-fought 2-0 victory against Stoke.",
        "Imran Louza and Keinan Davis scored second-half goals to ensure Chris Wilder’s side at least finished the campaign with a top-half finish, but defeat capped a depressing end to Stoke’s season as they failed to win any of their last seven games.The Potters started brightly and took just 22 seconds to worry Watford’s defence when Ben Pearson’s fierce drive from 20 yards was tipped over the crossbar by Daniel Bachmann.Pearson tried his luck again from slightly further out when the resulting corner broke to him. This time the Stoke midfielder’s effort flew into the Rookery Stand.The Hornets goalkeeper was tested again in the third minute, beating away Josh Tymon’s angled shot as Stoke continued to threaten.The hosts reacted by carving out two chances of their own.",
        "Louza’s through ball split Stoke’s defence wide open but goalkeeper Matija Sarkic rushed off his line to deflect Ismaila Sarr’s effort past a post.Louza then teed up Davis, only for veteran defender Phil Jagielka to block the Watford striker’s goal-bound shot.Bachmann was soon called into action again, scrambling across his goal to palm away Will Smallbone’s scuffed shot. Then Sarkic denied Ken Sema in a breathless opening 15 minutes which produced 10 efforts on goal.Tymon and Sarr both saw shots saved as the frenetic pace finally abated.",
        "Davis was becoming more and more of a handful for Stoke’s defenders to cope with, albeit frustrating the home fans by taking too many touches and failing to get his shots away.But the Aston Villa loanee almost provided Watford defender Ryan Andrews with his first-ever career goal with a clever pass, but the 18-year-old’s drilled shot was blocked.The second half began as a tamer affair but at least produced the decisive two goals – the first a real moment of quality.Louza’s deft pass sent Sarr through on goal but Sarkic managed to paw the ball away from his feet. Davis collected the loose ball and laid it on a plate for Louza to curl a delightful left-footed curler past Sarkic’s outstretched hand and into the net off the far post.Davis doubled the lead four minutes later, picking up Sema’s pass and driving into the Stoke area. There was an element of fortune as his low shot clipped Morgan Fox and spun into the net.The question remains as to whether Hornets boss Wilder will still be in charge at Vicarage Road next season but, if this was his last game, then at least he signed off with a win."
    ]
}