{
    "articleURL": "/sport/football/article-12049935/He-big-miss-Jamie-Redknapp-pinpoints-player-Erik-ten-Hag-needed-badly-defeat-Brighton.html",
    "content": [
        "Manchester United lost 1-0 to Brighton in the Premier League on WednesdayThe Seagulls were dominant and finally got their goal deep into injury timeJamie Redknapp believes Man United sorely missed one player on the night  Jamie Redknapp believes that there was one player that Manchester United sorely missed during Thursday's painful 1-0 defeat to Brighton at the The Amex Stadium.",
        "The Red Devils were second best for the majority of the game and were ultimately made to pay in the final seconds.Brighton were awarded a penalty deep into injury time when Luke Shaw handled a cross and Alexis Mac Allister duly smashed it into the top corner with 90+9 minutes on the clock.It was a goal that Brighton deserved for their display, a display which Redknapp believes was made easier by the absence of Christian Eriksen. Eriksen was an unused substitute on the night, having featured in seven games over the past 23 days. ",
        "'Manchester United didn't do enough today,' Redknapp said on Sky Sports. 'They've not done enough in so many away games against good sides.'When you look at Brighton you can see patterns of play, you see movement and understanding. Away from home, Manchester United are struggling with that.'That's something Erik ten Hag certainly needs to work on. At home they've had some good performances. Away from home they're struggling a bit.'Christian Eriksen was a big miss today. When he doesn't play, they miss that calmness and quality. 'Fred wasn't as comfortable on the ball in those tight area and that's something they really missed without Eriksen.'They just weren't good enough today, Brighton were the better team and fully deserved the three points.'",
        "Despite the loss, United are still well placed to finish in the Champions League places as they sit four points ahead of fifth-placed Liverpool with a game in hand.They also face a relatively straightforward run-in, with their final five games of the season coming against West Ham, Wolves, Bournemouth, Chelsea and Fulham.As for Brighton, the win moves them within four points of Jurgen Klopp's side with two games in hand, meaning they have an excellent chance of securing European football for the first time in their history.They will next be in action against relegation-threatened Everton on Monday. "
    ]
}