{
    "articleURL": "/tvshowbiz/article-12061245/Taylor-Sheridan-charges-Paramount-50-000-WEEK-film-Yellowstone-ranch.html",
    "content": [
        "READ MORE: Inside Sheridan's TWO luxury ranches - including $350M property that is twice the size of ChicagoMaking Yellowstone is no cheap endeavor.",
        "A new report from the Wall Street Journal sheds light on creator Taylor Sheridan's allegedly high expenses to create the wildly popular series.  ",
        "Sheridan allegedly charges Paramount as high as $50,000 a week to film Yellowstone on his own ranch in Texas, nearly $210K to train actors at a 'Cowboy Camp' held on his own property, and rents herds of cattle out for $25 a head.All this is in addition to the money he already makes as the writer, producer, and sometimes director of Yellowstone and its spin-offs.The report comes amid news Yellowstone is coming to an end after five seasons, and as show star Kevin Costner begins divorce proceedings with estranged wife Christine Baumgartner. The epic final instalment of Yellowstone returns this November, only on Stan. ",
        "The report outlined the high expenses Sheridan has charged his production partners to create the series. He works with Paramount, which funds his series, and 101 Studios, the organization which creates his shows. Sheridan declined a request by WSJ to be interviewed for the story.  At the 'Cowboy Camps', actors are taught how to work with horses and realistically depict ranch life. WSJ reported Paramount was charged $214,979.61 for the camp leading into season five, which lasted around a week.About $33,000 of that was just for catering. Use of his horses was also costly - Paramount was charged $2,000 a head.",
        "In another example cited by WSJ, a wrangler thousands of miles away from set also charged production $3,000. The wrangler explained to the skeptical production office that she was working on one of Sheridan's ranches and getting his horses ready for filming. Sheridan also uses his preferred farrier to work with the horses. In May 2022, two of Sheridan's farriers were flown in from Texas to Montana, in another expense which annoyed the studio head. 'Are you kidding me? We can't find a local person?' David Glasser, head of 101 Studios, said in an email to production staffers.In addition, 24 horse saddles ordered by the prop master cost a jaw-dropping $23,519.19. The saddles were to be done in the style of the Royal Canadian Mounted Police. 'We have had 5 seasons of a show. And we are just ordering saddles now?' Glasser asked in one email of the expenses. ",
        "Another point of contention was the creation of $3,130 worth of prop jewelry being made out of state, despite them being able to apply for tax breaks by using in-state vendors.The high costs also extend to Sheridan's other popular Yellowstone spin-offs. According to WSJ, it costs at least $22 million to make a single episode of 1923, the Yellowstone prequel.While both Paramount and 101 Studios both conceded his shows are not cheap to make, they are content with their working relationship.",
        "'Taylor's shows are among our most successful and profitable,' a spokeswoman for Paramount told WSJ.As for 101 Studios, executives told WSJ they try to compromise with Sheridan when it comes to budgeting and creating a quality show. While they claimed they were cost-conscious, 101 Studios say the success of Sheridan's shows prove they are worth the high price tag.",
        "According to WSJ, it costs over $500 million a year for Paramount to create Sheridan's programs. That figure also includes the first season of the Yellowstone spin-off 1923, which cost nearly $200 million.In contrast, an episode of HBO's The Last of Us costs $16-$18 million an episode while House of the Dragon usually costs under $20 million an episode, according to WSJ sources.The high costs come as investors scrutinize Paramount. On Thursday, they reported a first quarter loss of $1.1 billion. The loss is due in part to more money being spent on streaming content.Last week, Paramount Network announced that Yellowstone would officially end with the final episodes of the fifth season launching in November.",
        "The show has been a monster hit for the network, and tells the story of the Dutton family, and their battles over their gigantic Montana ranch. It is still a ratings smash, but the atmosphere on set is said to have become fraught over Costner's alleged insistence on only working part of the week. Costner has also allegedly had a tense relationship with Sheridan. ",
        "Despite the cancellation, fans of Yellowstone will likely be soothed by news that a sequel has already been given a full-series order.Matthew McConaughey has been tipped as its possible star, although producers have yet to confirm any members of its new cast."
    ]
}