{
    "articleURL": "/wires/ap/article-12043163/PGA-rules-cut-dried-comes-McIlroy-3M-bonus.html",
    "content": [
        "CHARLOTTE, N.C. (AP) - Rory McIlroy says he had his reasons for skipping his second elevated event at the RBC Heritage.",
        "That wasn´t enough for PGA Tour commissioner Jay Monahan to pay out the remaining $3 million of McIlroy's Player Impact Program bonus.Monahan announced Wednesday that the world´s third-ranked player won´t receive the $3 million sum - a day after the 33-year-old McIlroy said he presented his case.McIlroy finished second to Tiger Woods in the PIP program, which measures a player´s popularity and impact on tour. He was set to make a $12 million, but that payout has been reduced by 25% after he missed his second elevated event.Under the PIP rules, the top players are only allowed one \"opt-out\" for the season´s 12 designated \"elevated tournaments\" on this year´s tour, not including the four major tournaments and the Players Championship. McIlroy's decision to skip the tournament in Hilton Head, South Carolina, was his second opt-out after missing the Sentry Tournament of Champions.Monahan said the rules are \"cut and dried.\"\"When we made when we made the commitment to this schedule with the Player Impact Program, we adjusted for one opt out,\" Monahan said at the Wells Fargo Championship. \"For any second opt out, you would forfeit to 25% unless there was a medical issue. ... So in terms of precedent, in any situation like that we´re going to look at the criteria against the situation at hand and make a decision, There´s nothing really unusual about that.\"",
        "McIlroy won´t have to pay anything back; the money will simply be deducted from what he was scheduled to earn.McIlroy said Tuesday night at a FedEx Founders Fund charitable event in Charlotte that he had planned to play at the RBC Heritage but opted out because he needed a \"reset\" after missing the cut at the Masters.McIlroy indicated the stresses that engulfed the PGA Tour over the last year -like player defections to the LIV Tour and setting up a new schedule for 2024 - have weighed heavily on him while serving as player director for the PGA Tour´s policy board. He hopes to take time away from the board after his commitment is complete.\"I´ve always thought I´ve had a good handle on the perspective on things and sort of where golf fits within my life, and trying to find purpose outside of golf in some way,\" McIlroy said. \"But I think over the last 12 months, I sort of lost sight of that. I´d lost sight of the fact that there´s more to life than the golf world and this little silly squabble that´s going on between tours, and all sorts of stuff.\"McIlroy indicated Tuesday that he'd spoken with Monahan about his absence, but wasn't sure if the $3 million would be withheld.",
        "Monahan said he completely understands McIlroy's need to be refreshed, but the rules still stand.\"He knew the consequences of that,\" Monahan said. \"First of all, players should be able to make a decision not to play. That's the beauty of our model. But he knows the consequences of that based on that criteria. And that´s our position.\"___AP golf: https://apnews.com/hub/golf and https://twitter.com/AP_Sports"
    ]
}