{
    "articleURL": "/news/article-12040033/MasterChef-Australia-judge-Jock-Zonfrillo-dead-Channel-Tens-agonising-decision.html",
    "content": [
        "Masterchef host Jock Zonfrillo died on Monday Network 10 cancelled the premiere of Masterchef  The launch of the 2023 season of Masterchef was supposed to be a triumphant day for Network Ten, with the ratings powerhouse scoring world-famous chef Jaime Oliver as a fourth judge.",
        "But just hours before its slated premiere, news broke of the shock death of Jock Zonfrillo, 46, who helped steer the show to new highs with fellow hosts Andy Allen and Melissa Leong since coming on board in 2019.The Scottish-born chef and restauranteur was found in a hotel on Carlton's Lygon Street in Melbourne at about 2am on Monday, with the cause of death not revealed but not being treated as suspicious by police.Ten immediately postponed the premiere, and the future of the network flagship, its most expensive and longest-running franchise, was thrown into uncertainty.The network, whose PR juggernaut had been in full swing and backed up by excited social media posts from Zonfrillo, Allen, Leong and Oliver, was now left scrambling for a replacement.",
        "What did go to air was the reality show The Bridge, which had gone up on Ten owner Paramount's streaming service last year, attracting a mediocre 223,000 viewers.With Masterchef filling in large 90-minute blocks in Ten's programming, The Bridge, which consists of only six hour-long episodes, will be entirely aired by Thursday.This means Ten faces another decision about what to air next week - whether that could be Masterchef or whether the program can be aired at all.Daily Mail Australia revealed Jock's wife Lauren will have the final say on when and how the show will proceed.",
        "'It will really come down to Jock's family and what they feel he would have wanted,' a Ten insider said.Speaking on Wednesday, Sunrise entertainment editor Peter Ford said Ten would have 'to juggle sympathy and respect with business and programming.''They need to talk to Lauren and find out where she's at. They need to have her onside, they need to have her wanting that show to go to air.''There's also a massive amount of revenue due into the network in the coming weeks. They have to consult with Coles, who are the major sponsor.'Ford said he 'personally can't see it (Masterchef) starting next week because, to be blunt, there will be a funeral'.'A lot will unfold in the next 48 hours,' he said.",
        "Meanwhile, tributes have poured in for the popular Zonfrillo.Jaime Oliver said he was in 'shock'.'We had the best time working together for this year's master chef [sic], I can't tell how good it was to work with him!''Jock was very generous to me with his time and spirit in the show and for that I was really grateful.''Sending heart-felt love and condolences to all of his family, friends and his second family, the master chef team and contestants xxx. Love jamie.'",
        "Fellow hosts Leong and Allen said they were floored by the news.'Feels too raw to process still... You showed me what true excellence looks like, both in the kitchen and outside of it... My heart goes out to your family, who were and are your life,' Leong wrote.While Allen said: 'Sure, you've taught me so much about food, but it's the lessons I learnt about what it means to be a great father, husband and friend that I'll take away from our time together and will last forever'.The Masterchef team, wrapped up production a month ago but is now reportedly combing through each episode of the program to make sure nothing in it could distress viewers.A tribute to Zonfrillo at the beginning of the season and, possibly, the conclusion of each episode are also reportedly being considered.For immediate support call Lifeline on 13 11 14.",
        "Network 10 and Endemol Shine Australia are deeply shocked and saddened at the sudden loss of Jock Zonfrillo, a beloved member of the MasterChef Australia family. Jock passed away in Melbourne yesterday.'Jock was known to Australians as a chef, best-selling author, philanthropist and MasterChef judge but he will be best remembered as a loving father, husband, brother and son.'Determined and talented and with plenty of grit, Jock was born in Glasgow to an Italian father and a Scottish mother, which meant his formative years were heavily influenced by two strong cultures and it was his obsession with food and desire for a new pushbike that at just 12 years old fuelled Jock to knock on kitchen doors looking for a job.'Jock's love and passion for food saw him become one of the youngest culinary students to do an apprenticeship at The Turnberry Hotel at just 15 years of age. From that point onwards there was no holding him back and by 17 he was working alongside Marco Pierre White at his eponymous Restaurant Marco Pierre White.'Throughout his career he worked with world famous chefs and in restaurants all over the world. His talent saw him shine in the world's most formidable kitchens and he opened Bistro Blackwood and Restaurant Orana in Adelaide after moving to Australia.'Jock's Restaurant Orana was recognised with the coveted distinction of three hats in both 2019 and 2020 and he also received global accolades, accepting the prestigious Basque Culinary World Prize in 2018.'In 2019, Jock was named as a judge on MasterChef Australia in which he took great pride in challenging and coaching the contestants and of course inspiring a nation of home cooks.'Jock's charisma, wicked sense of humour, generosity, passion and love for food and his family cannot be measured. He will be greatly missed."
    ]
}