{
    "articleURL": "/tvshowbiz/article-12051171/Giddy-Myleene-Klass-arrives-Westminster-Abbey-ahead-Coronation.html",
    "content": [
        "Myleene Klass arrived at Westminster Abbey on Friday ahead of The Coronation of King Charles III as she prepared for the big day.",
        "The giddy presenter, 45, has been made ITV's prime Music Expert and will join the channel live from the ceremony on Saturday. Speaking from the back of a car en-route to the iconic London landmark for the rehersal, Myleene wore a bold floral dress and shared her excitement. The singer looked sensational in the multi-coloured two-piece that she teamed with a towering pair of gold heels. 'I was told to dress smart so I've gone very subtle,' she joked gesturing to her eye-catching ensemble. ",
        "Updating her followers in the Instagram Story, she continued: 'I'm not sure what to expect but I'm very excited. I have got my passport for entry. I'll keep you posted'Myleene then slipped on a high vis jacket and shielded her eyes with a pair of sunglasses as she made her way inside the Abbey. She explained: 'Just following the team to the studio, this is Gazza he's my protection officer, he's going to keep me out of trouble.' The presenter's quick dash to Westminster came following her usual stint on Smooth radio this morning. Elsewhere, Amanda Holden was interviewing giddy Royal fanatics already lining the streets of London while Sharon Osbourne greeted campers on The Mall ahead of Coronation festivities on Friday - as the stars got ready for the big day. ",
        "Britain's Got Talent judge Amanda, 51, was made Heart FM's prime Coronation correspondent as she was sent through the capital to report on the festivities. She headed to The Mall to greet Royal fans - where an unlikely Sharon, 70, was situated - who had camped out on the tree-lined road connecting Trafalgar Square to Buckingham Palace ahead of King Charles' celebrations on Saturday. She beamed as she posed between fans, who were draped in Union Flags, before she headed back to Global Studios to dress in a Bridgerton-style ensemble as she was marking the release of Netflix's new show Queen Charlotte: A Bridgerton Story. ",
        "Prior to her visit to The Mall, she boarded a bus to take her to Heart FM ahead of the big day and looked great in a pretty floral dress. The collared number featured a spring design and was cinched in at the waist with a belt as she posed up a storm onboard. She completed the look with a pale blue coat and pointed white stilettos while shielding her eyes from the sun.Amanda wore her honey tresses in loose waves over her shoulders and opted for a typically bronzed makeup look. She looked like she was having a great time on the special bus which drove through central London including past Big Ben and Trafalgar Square.",
        "The beauty then stopped to pose at the front of the bus which said 'King's Coronation Special' on the front. As she arrived she was then accompanied by two men in royal fancy dress as she beamed away. Elsewhere Sharon was pictured emerging from a tent after greeting those who were camping to get a good view of the Coronation. Sharon has jetted into the UK for TalkTV's Coronation coverage and will also be joining Vanessa Feltz and a slew of royal experts, including ex-royal butler Paul Burrell, for live coverage of the event on Saturday. A fan shared some snaps of her and wrote in the caption: 'GOOD MORNING! Day Two of the #Coronation Camp-Out is here!'Surrealist moment of last night? Watching Sharon Osbourne filming a segment at 1am and then having her walking about offering up sandwiches and cakes to campers! Thanks for the sarnie, @MrsSOsbourne!' The coronation itself will take place in Westminster Abbey on Saturday, with the Coronation Big Lunch and Coronation Concert on Sunday. ",
        "Members of the public have been encouraged to take part in The Big Help Out on Bank Holiday Monday by volunteering for local organisations.The first glimpses of the Coronation procession seen during a rehearsal overnight have given an insight into what the pageantry will look like and who will be involved.",
        "The procession returning to Buckingham Palace down The Mall will feature the Gold State Coach. King Charles III and Queen Consort Camilla will sit in it as they are greeted by crowds."
    ]
}