{
    "articleURL": "/news/article-12058535/Ellie-Prices-mum-questioned-sugar-daddy-murder-trial.html",
    "content": [
        "Ricardo Barbaro is standing trial Pleaded not guilty to murdering Ellie PriceJury heard 'sugar daddy' question to Ms Price's mother The mother of a woman allegedly murdered by her partner has been questioned in court over her daughter's 'sugar daddy' relationship with a man 'interested' in brothels.",
        "On Monday, a Victorian Supreme Court jury was played the recorded evidence of Tracey Gangell, whose daughter Ellie Price, 26, was allegedly murdered by Ricardo Barbaro.Barbaro, 36, has pleaded not guilty to Ms Price's murder and is standing trial.In the video, the jury heard that under cross-examination from barrister Rishi Nathwani, who is acting for Mr Barbaro, Ms Gangell was asked about her daughter's financial relationship with a man called Mark Gray. ",
        "Mr Nathwani asked Ms Gangell if she was aware that Mr Gray had paid for her daughter's addresses in Melbourne, bought her a sports car and paid her an allowance.Ms Gangell responded in the negative or that she was unsure of the questioning, which also probed her knowledge of her daughter's drug use and her employment in a strip club and brothels that Mr Gray had an interest in.'What do you say to the suggestion that Mr Gray was (Ms Price's) Ellie's sugar daddy?' Mr Nathwani asked.Earlier, the jury heard Ms Gangell giving evidence under questioning from Crown prosecutor Patrick Bourke KC in which she said her daughter had told her she wanted to return to Tasmania 'until (Mr Barbaro) Ric was out of her life'..",
        "In his opening address last week, Mr Bourke told the jury that Ms Price's body was found on May 4 by police in the bedroom of her Park St unit with six stab wounds, including to her neck, chest and back.",
        "He said Mr Barbaro had left Ms Price's address in the early hours of the morning on the same day she was allegedly murdered, which the prosecution alleges was April 29.Mr Bourke said Mr Barbaros fingerprints were at the scene, including a fingerprint on Ms Price's bathroom mirror in blood, and the accused was arrested in Wentworth Point, NSW, on May 14.He said Ms Price had made police complaints against Mr Barbaro over alleged violence, and she had told her mother before her death that she wanted to return to her home state of Tasmania until the accused was out of her life.Mr Nathwani told the jury last week to ask themselves if Ms Price had 'upset' anyone in her employment in strip clubs who would want to harm her.The trial, before Justice Lex Lasry, continues."
    ]
}