{
    "articleURL": "/sport/football/article-12053631/Inside-Wrexhams-expenses-paid-promotion-party-Las-Vegas.html",
    "content": [
        "Wrexham players enjoy Day Two of four-day trip on owner's dime poolsideInside Wrexham's first 'monster' night in Vegas: Welsh flags waved in Sin CityWrexham's promotion-winning players had yet another fun-filled day in Las Vegas on their second day of a four-day all-expenses-paid extravaganza gifted to the team by their co-owners Ryan Reynolds and Rob McElhenney. ",
        "McElhenney was the first of the club's two Hollywood owners spotted taking part in the players' festivities in Sin City, joining his side for dinner at famed Las Vegas eatery Spago on Friday night. But first on the itinerary was an afternoon spent partying poolside at the Wet Republic Ultra Pool at the MGM Grand with the players keen on letting their hair down after their triumphant 111-point season. The National League champions chatted and danced with bikini-clad women as they soaked up the sun and looked forward to their future in League Two. As night fell the team made their way to Spago where they were joined by McElhenney and his wife an 'It's Always Sunny in Philadelphia' co-star Kaitlin Olson. ",
        "Dining on modern Italian fare at the Wolfgang Puck-owned restaurant located in the Bellagio hotel, the team were greeted with yet another warm welcome, in the form of an ice sculpture in the shape of Wrexham's club badge. Perched on the waterfront, a number of players shared their surroundings with their followers, with 47-goal striker Paul Mullin posing with both thumbs up by the famous Bellagio fountains. An Instagram group picture featuring Liam McAlinden, Ollie Palmer, Andy Cannon, Rob Lainton and Harry Lennon showed the group tucking into a seasonal seafood tower, which features poached Gulf shrimp, Maine lobster, green-lipped mussels, East &amp; West coast oysters, seasonal poké, and king crab legs. ",
        "After dinner, the players moved onto OMNIA nightclub where they were greeted in bombastic style - as they had been the night before at Hakkasan nightclub at the MGM Grand - as the packed house in the cavernous nightclub jumped up and down waving sparklers and enormous Welsh flags were waved in a tribute to the team's achievements. Legendary DJ Steve Aoki was on the decks, which Ben Tozer later snuck behind to watch the revellers from a good vantage point, and the players led the partygoers in a round of chanting in honour of their star targetman Mullin. ",
        "Aoki also gave the players a shoutout as the party rolled into the early hours of Saturday morning.  Reynolds is yet to make an appearance alongside his team but with two more days of revelry planned, the A-List star may yet turn up in the US party capital.  Ahead of the trip, Mullin shared that the idea for a trip away to celebrate winning the league grew as they moved closer to their goal in an interview with GQ.",
        "The striker said: 'It became a thing where if we won the league, we'd get a holiday. So we're off to Vegas.''Ryan and Rob told us to leave our cards at home, they're sorting the lot. They sent us a full itinerary just now. ",
        "'Part of me doesn't want to go, I might be dead by the end of it! But I'd never go to Vegas by my own accord, so I'm buzzing for it.' But one member of the history-making side did not make the trip: manager Phil Parkinson, who told Sky News that he hopes his players enjoy their deserved reward but 'come back in one piece'. On the players' first night, they dined at Hakkasan and then moved onto the restaurant's nightclub where they were treated to a Wrexham-themed presentation. Centre backs Eoghan O'Connell and Tozer shared a brief snippet of themselves on the dance floor. ",
        "O'Connell gently teased his team-mate for his outfit choice, likening the shirt Tozer was wearing to one worn by a Foot Locker employee. Parkinson's side danced the night away to music from DJ James Hype but showed no signs of tiredness for the next jam-packed day in the four-day trip. Wrexham's increasing popularity in the US, first sparked by their Hollywood owners and sent through the roof with the launch of Disney+ docu-series 'Welcome to Wrexham', means the champions have received a heroes' reception on American soil. The side will be back Stateside in July for a string of friendlies against Chelsea, Manchester United, LA Galaxy II and one more team yet to be confirmed.   "
    ]
}