{
    "articleURL": "/wires/pa/article-12050035/Napoli-s-fans-light-sky-celebrate-Serie-A-title-win.html",
    "content": [
        "Napoli supporters partied long into the night as they took over the city to celebrate the club’s first Serie A title in 33 years.",
        "After the disappointment of the celebrations being put on hold by Sunday’s draw at home to Salernitana, Luciano Spalletti’s side got the job done with a 1-1 draw at Udinese to spark incredible scenes in Naples.",
        "The city’s piazzas were crammed with jubilant fans, who lit flares and fireworks as they chanted into the early hours.“Seeing the Partenopei smiling and joyful is the greatest emotion for me. They are the ones who pass on their happiness. The problem was reaching this point, as when you have the feelings of an entire city weighing on your back,” Spalletti told DAZN.“There are people here who will be able to get through difficult moments in their lives because they remember this moment. These people deserve all the joy.“It perhaps makes me feel more relaxed now, we’ve been able to give them that joy. These fans have seen huge coaches come and go. They saw Diego Armando Maradona play and perhaps his protection is also felt in this success.”Argentina great Diego Maradona fired Napoli to their first title in 1987 and cemented his hero status with the club by winning a second in 1990.Napoli also won the UEFA Cup and Coppa Italia during Maradona’s spell in the city, but in the 89 years of their history without him the club have only previously won five Italian Cups.",
        "Maradona died in 2020, with the club naming their stadium in his honour.Now, in the ground that bears his name, Spalletti’s swashbuckling side have stormed to the Scudetto with five games to spare.Nigerian striker Victor Osimhen grabbed the second-half equaliser at Udinese to clinch the title – his 22nd league goal of the season.Osimhen has been the star man for Napoli this season, with talented Georgian winger Khvicha Kvaratskhelia, 22, also establishing himself as one of Europe’s most exciting talents."
    ]
}