{
    "articleURL": "/tvshowbiz/article-12054139/Is-Roxy-Jacenko-following-Oliver-Curtis-Singapore-socialite-sends-rumours-swirling.html",
    "content": [
        "Roxy Jacenko recently put her $14million Vaucluse mansion up for sale. ",
        "And while the socialite quashed rumours that she's selling the house because of money issues or divorce, The Saturday Telegraph has reported that she might be moving to Singapore. The 43-year-old's husband Oliver Curtis served one year in jail for insider training in 2016, and began working for his father's tech start-up in Tasmania following his release in 2017. However, it has been reported that he has now left his father's company and recently relocated to Singapore for a new job.  So, Roxy may be considering the move to reignite their marriage. ",
        "The PR queen, who shares Pixie, 11, and Hunter, eight, with her partner, told news.com.au that she wasn't 'stupid' enough to divorce her partner and let 'him take 50 per cent'.'We haven't been living together in a full-time capacity for about four years. He'll be be here for Hunter's ninth birthday soiree on the weekend,' she said.She continued: 'But an apartment will be easier — with two kids on my own, there's no need to be in a house with a gym or a cinema.'Hunter's usually in the TV room playing Call of Duty when Pixie's in bed watching TV with me. We don't need this big house.'",
        "Roxy revealed last Thursday that she was selling her sprawling Vaucluse mansion.",
        "The Ministry of Talent founder shared a picture of the stunning pad to Instagram when she revealed the surprise news. 'Coming soon via David Malouf and Bill Malouf. Jacenko-Curtis' are on the move,' she captioned the post, mentioning the real estate agents who will list the property.While the home is not yet on the market and a price guide isn't listed, the couple purchased the home for a cool $6.5million back in 2018. The home is believed to have a $14million price tag.The couple extensively renovated the home and added a full gym, a hair salon, a children's playroom, and a room just for her $1million Hermès Birkin collection."
    ]
}