{
    "articleURL": "/wires/ap/article-12038279/Vermont-allows-nonresidents-use-assisted-suicide-law.html",
    "content": [
        "Vermont on Tuesday became the first state in the country to change its medically assisted suicide law to allow terminally ill people from out of state to take advantage of it to end their lives.",
        "Republican Gov. Phil Scott signed the bill that removes the residency requirement for the decades-old law.Last year in a court settlement, Oregon agreed to stop enforcing the residency requirement of its law allowing terminally ill people to receive lethal medication. It also agreed to ask the Legislature to remove it from the law.Before Vermont removed its residency requirement Tuesday, it had reached a settlement with a Connecticut woman who has terminal cancer to allow her to take advantage of its law, provided she complies with other aspects of it.\"We are grateful to Vermont lawmakers for recognizing that a state border shouldn´t determine if you die peacefully or in agony,\" said Kim Callinan, president and CEO of Compassion &amp; Choices, a nonprofit advocacy organization, in a statement. \"Patients routinely travel to other states to utilize the best healthcare options. There is no rational reason they shouldn´t be able to travel to another state to access medical aid in dying if the state they live in doesn´t offer it.\"Vermont is one of 10 states that allow medically assisted suicide. Critics of such laws say without the residency requirements states risk becoming assisted suicide tourism destinations.",
        "Mary Hahn Beerworth, executive director of the Vermont Right to Life Committee, testified before a legislative committee in March that the practice \"was, and remains, a matter of contention.\"",
        "\"To be clear, Vermont Right to Life opposed the underlying concept behind assisted suicide and opposes the move to remove the residency requirement as there are still no safeguards that protect vulnerable patients from coercion,\" said Beerworth, adding she had a number of concerns including what liability Vermont could incur if the drugs failed to end a patient´s life.Supporters of Vermont´s medically assisted suicide law say it has stringent safeguards, including a requirement that those who seek to use it be capable of making and communicating their health care decision to a physician. Patients are required to make two requests orally to the physician over a certain timeframe and then submit a written request that they signed in the presence of two or more witnesses who aren´t interested parties. Witnesses must sign and affirm that patients appeared to understand the nature of the document and were free from duress or undue influence at the time.Lynda Bluestein, 75, of Bridgeport, Connecticut, and Diana Barnard, a physician from Middlebury, sued Vermont in federal court last summer, claiming its residency requirement violated the Constitution´s commerce, equal protection, and privileges and immunities clauses. Barnard specializes in hospice and palliative care and has patients from neighboring New York state, which, like Connecticut, doesn´t allow medically assisted suicide.",
        "Bluestein said Tuesday that the change in Vermont means that so many other people in the Northeast can take advantage of the state's law.\"I´m thinking even more importantly that this is going to cause other states, the other jurisdictions that have medical aid in dying, to look at their residency requirement, too,\" she said.For Cassandra Johnston, 38, of Clifton Park, New York, the news was \"such a relief.\" She was diagnosed with stage 3 breast cancer last year and lives a 40-minute drive from Vermont.\"It gives me such a peace of mind to know that if I need that peaceful and compassionate option that it's right next door,\" Johnston said. \"And it's life-changing for someone like me. It really is.\"______Rathke reported from Marshfield, Vt."
    ]
}