{
    "articleURL": "/tvshowbiz/article-12045349/Priyanka-Chopra-shares-snap-daughter-Malti-checking-NYC-skyline-make-worthwhile.html",
    "content": [
        "Citadel action star Priyanka Chopra Instastoried a sweet snap of her 15-month-old daughter Malti Marie Jonas checking out the view from their penthouse apartment at the Four Seasons Residences in downtown Manhattan on Tuesday.",
        "The Indian 40-year-old - who boasts 169.9M social media followers - captioned the picture of her toddler: '[You] make it all worthwhile #nyclove.'On Wednesday, Priyanka donned a belly-baring pink outfit and brought her husband - two-time Grammy nominee Nick Jonas - to SONA, the Indian restaurant she co-owns with Maneesh K. Goyal.The 30-year-old New Jersey native was wearing the same black suit he donned for the New York premiere of Love Again at AMC Lincoln Square Theater where Chopra bared her shoulders in a light-blue trumpet dress.The former Miss World 2000 plays Mira Ray, a grieving woman who falls for journalist Rob Burns (Sam Heughan), in Jim Strouse's rom-com hitting UK theaters May 10 and US theaters May 12.",
        "It's been an incredibly busy weekend for Priyanka and Nick, who also glammed up for The Metropolitan Museum of Art's annual $50K/ticket gala on Monday.The Costume Institute benefit holds great significance for the married couple of four years, who technically met at a 2017 Oscars bash, but didn't truly connect until the 2018 Met Gala.Jonas took a candid snap of his baby girl sitting in Chopra's lap before she and her glam squad got to work on her b&amp;w Valentino look.The former Disney Channel star's boyband The Jonas Brothers will release their sixth studio record The Album on May 12.",
        "The talented trio technically originated as a solo project for Nick back in 2005 before he began writing songs with his older siblings Joe and Kevin.The South Asian sensation also portrays Nadia Sinh/Charlotte Vernon in Josh Appelbaum, Bryan Oh, and David Weil's $185M-budget, dismally-reviewed seven-episode spy series Citadel, which airs Fridays on Amazon Prime Video. ",
        "Priyanka recalled how 'very tough' it was to film reshoots for Citadel one month after little Malti, who was welcomed via surrogate, spent her first 110 days in the NICU.'I won't lie, it was a very tough time,' Chopra admitted to THR on Monday.'We were new parents at that time. The additional photography that we had to do was in Atlanta and LA was where my home was, and I would fly to Atlanta every week and fly back every weekend. My husband and my mom and my in-laws were home for the duration of my shoot.'But Amazon Studios and AGBO made it conducive and figured out my schedule to where I could fly back every weekend to be with her, and then come back and shoot on Monday. I really appreciated that. They're family people, they understand the value of that. Joe, Anthony and Jen Salke were like, \"We got you and we'll figure it out.\"'"
    ]
}