{
    "articleURL": "/wires/ap/article-12055335/Donovan-enshrined-soccer-Hall-Fame.html",
    "content": [
        "FRISCO, Texas (AP) - Landon Donovan, who played in three World Cups and scored 57 goals across 157 international appearances for the United States, was enshrined in the National Soccer Hall of Fame on Saturday.",
        "Donovan, who also played for six MLS Cup-winning teams, was inducted along with fellow national team players DaMarcus Beasley, Lauren Cheney Holiday and Kate Sobrero Markgraf. Steve Zungul was honored for his lengthy career in the Major Indoor Soccer League.Hope Solo, who was voted into the hall on the 2022 players' ballot, was also enshrined after she deferred her induction last year amid legal issues.Jill Ellis, who won two Women's World Cups as the U.S. coach was inducted on the Hall of Fame builder's ballot. Journalist Grant Wahl was posthumously named the recipient of the Colin Jose Media Award. Wahl died in December while covering the World Cup in Qatar.Donovan's illustrious career spanned from 2000-14. He is tied with Clint Dempsey for most career goals and ranks second on the team's all-time appearances list. He was named a U.S. Soccer Player of the Year in 2003, ´04, ´09 and ´10.Donovan won titles in Major League Soccer with the LA Galaxy in 2005, ´11, ´12 and ´14. He scored 145 goals in 340 games for LA and the San Jose Earthquakes, second only to Chris Wondolowski (171) on the career scoring list.",
        "Donovan told a story about when he was cut from the 2014 U.S. World Cup team, and how Beasley, Kyle Beckerman and Michael Bradley consoled him. Beckerman had just learned that he made his first World Cup roster - but had chosen to comfort Donovan.",
        "\"As I was thinking about it, I thought, `Well Landon, how many times have you taken a moment to put your arm around someone else?´ I had a hard reality: Zero. Never. I´d never done that,\" Donovan told the crowd. \"So as much as I would have loved to have gone to another World Cup, that moment of learning compassion to that level, was way, way, way more powerful.\"Beasley was the first American man to play in four World Cups. A defender and midfielder, he scored 17 goals in 126 international appearances. His club career included stops with Manchester City, the Glasgow Rangers and the Houston Dynamo.Holiday scored 24 goals in 133 games with the United States after making her senior debut in January 2007. In addition to the World Cup in 2015, she won gold medals in Beijing and London. She was also the NWSL´s Player of the Year in 2013.Markgraf is currently general manager of the U.S. women's team. She played in three World Cups and was a starter on the team that won in 1999.Solo delayed her induction last year to participate in an in-person treatment program following her arrest on a DWI charge. Solo made 202 appearances with the national team, with 153 wins and an international-record 102 shutouts. She won a World Cup title and two Olympic gold medals with the team.",
        "Ellis, FIFA´s women´s coach of the year in 2015 and 2019, is president of the National Women´s Soccer League´s San Diego Wave. She concluded her remarks with a shoutout to the U.S. women headed to the World Cup this summer in New Zealand and Australia.\"Today as I reflect on standing here I'm humbled and thankful for those who have walked beside me And yeah, I've got one more thing for you: Let's go hit a frickin' three-peat this summer,\" she said.___More AP soccer: https://apnews.com/hub/soccer and https://twitter.com/AP_Sport"
    ]
}