{
    "articleURL": "/health/article-12042265/New-report-shows-fentanyl-deaths-spiked-280-2016.html",
    "content": [
        "Fentanyl deaths rose 5.7 per 100,000 people in 2016 to 21.6 per 100,000 in 2021The CDC report showed fentanyl overdose deaths rose 55 percent in 2019-2020READ MORE: Fentanyl is 'single greatest challenge US faces as a country'Fentanyl's fatal rise across America has been laid bare in a new Government report.",
        "Overdose deaths involving the synthetic opioid more than tripled from 2016-2021, rising from 5.7 per 100,000 in 2016 to 21.6 in 2021.The drug was responsible for killing 69,943 people in 2021, equivalent to roughly one American every eight minutes, making it more deadly than cancer, Covid and car accidents.Fentanyl — which is 50 times stronger than heroin — is killing almost as many as methamphetamine, cocaine, heroin and oxycodone combined.It comes as the Department of Homeland Security Secretary declared fentanyl the 'single greatest challenge the US faces as a country' last month.",
        "It is being increasingly mixed with other illicit street drugs, leading to swathes of accidental overdoses — as well as people intentionally injecting fentanyl.Today's report is the latest to evaluate the lethal opioid's impact on the American population.It looked at death certificate records across America and showed that fentanyl-related deaths rose by about 55 percent in 2019-2020 and 24 percent in 2020-2021.In the US, difficulties in getting treatment for substance use disorders during the Covid pandemic coincided with a jump in use of synthetic opioids like fentanyl, and opioid-related deaths soared to a record-high in 2020.The heroin-based market has morphed into a fentanyl-based market, according to the Department of Justice's Drug Enforcement Administration.Fentanyl is flooding into the US from Mexico and China and is relatively easy to smuggle across the border. It is also cost effective for dealers to mix it into their supplies, which saves them money and can extend or boost the high experienced by users.",
        "Dr Allison Lin, an addiction psychiatrist at University of Michigan Medical School, told ABC News: 'The vast majority of our folks or patients with substance use disorders, even if they don't know it, they're primarily using the drug supply that's primarily fentanyl.'So, the folks who were using heroin previously are the folks who are also using fentanyl now. It's just that the supply of opioids and other drugs in our communities are primarily supplies that are predominantly fentanyl because of all the characteristics of it, how inexpensive it is, how easy it is to cut with other substances, other factors.'",
        "The Biden administration has been pushing for action as US drug-related overdose deaths surpassed 100,000 in 2021, according to government estimates.Between 2016 and 2021, the rate of drug overdose deaths involving methamphetamine increased more than fourfold, and cocaine-related overdose deaths more than doubled, the CDC said.Oxycodone and heroin deaths fell marginally during the study period.",
        "A disgraced Florida nurse of nearly 30 years has been convicted of stealing hundreds of vials of fentanyl and using the drug for herself. ",
        "Roughly two-in-100,000 died due to oxycodone-related overdose in 2016. That fell to 1.5-in-100,000 people in 2021.Heroin related deaths decreased from 4.9 per 100,000 in 2016 to 2.9 in 2021, the report found.",
        "For all five drugs looked at in 2021, men had higher death rates than women, particularly with heroin where men's rate of death was three times higher.Across all ages, fentanyl had the highest overdose death rates.Rates were greatest in those aged 35 to 44, followed by those aged 25 to 34.The cheap and highly addictive drug is used by doctors for patients in serious pain or with terminal illnesses.Fentanyl was invented in the US in 1959 as a cheaper alternative to other painkillers used in hospitals and health centers worldwide.Three chemicals, benzylfentanyl, 4-anilinopiperidine and norfentanyl and considered to be precursors to fentanyl by the DEA - meaning they are primary ingredients to the drug's creation.It binds to opioid receptors in a person's nervous system, which are responsible for giving the body a pleasurable feeling when activated.Republican lawmakers have blamed the Biden administration's lax immigration policies for the surge in fentanyl coming across the southern border. It takes a vanishingly small dose of fentanyl to cause a fatal overdose. Just two milligrams, the equivalent of five grains of salt is enough to cause death. Because it is cut into other popular drugs, many people who die of overdoses do not know they are taking fentanyl. Fentanyl has been partially blamed for America's sharp fall in life-expectancy over the past three years.  ",
        "It's now found in everything from cocaine to molly and street benzodiazepines like Xanax. "
    ]
}