{
    "articleURL": "/news/article-12046709/Carcass-30-tonne-fin-whale-washed-Yorkshire-beach-tourist-attraction.html",
    "content": [
        "55ft whale washed up on Yorkshire beach to be removed 'whole' by contractorsPeople are visiting to take pictures of the carcass despite health warningsREAD MORE: Whale dies after being stranded in North Sea off Yorkshire coastThe carcass of a 30-ton fin whale that washed up on a beach has become a tourist attraction - as an operation gets under way to remove the body without dissecting it.",
        "The 55ft mammal died on Tuesday after it was spotted getting into difficulties in the sea off Bridlington, East Yorkshire, this week.Since then, the huge carcass has become a macabre tourist attraction, with families coming down to see it and take selfies.However, the local council has warned people to stay away from the body, citing health fears and respect for the creature.There were concerns that the whale would have to be dissected to remove it from the beach but East Riding of Yorkshire Council is now hoping to move it whole.",
        "The council said it would be working with contractors over the next few days to remove the whale.It added that it was talking to marine experts to understand the cause of the creature's death.",
        "The whale was spotted in shallow water in the North Sea by Bridlington beach at around 1.15pm on Tuesday.It is uncommon for fin whales, the second largest species in the world, to be in the North Sea.Experts suggested at the time that it could have been suffering from malnutrition or disease. Hundreds of people watched as teams from the Coastguard and British Divers Marine Life Rescue tried in vain to save the animal.Mary Ford, who lives nearby, said this week: 'It is very sad to see such a beautiful creature die.",
        "'It was throwing a huge spout initially, then that got less and less as time went on.' She added: 'It was obvious it was dying.'Another local said her dog howled just as the whale died. She said: 'It's like he knew the whale had died.'",
        "A spokesman for East Riding of Yorkshire Council said today: 'Over the next couple of days we will be working with our contractors in an attempt to move the whale away from the beach whole, and we are liaising with zoological experts over the cause of this sad incident.'To help us, some roads and slipways will be closed, and we'd ask the public to please bear with us.'This is a very challenging operation and the largest of its kind we have dealt with.'The body has moved slightly down the beach overnight because of the tide.'There will be a cordon and we are urging people to please stay away from the whale for health reasons, to help us deal with the situation, and also out of respect.'",
        "Next to the blue whale, the fin whale is the second largest mammal in the world. They can grow up to 80ft long and weigh as much as 120 tons.They have a distinct ridge along their back behind the dorsal fin, which gives them the nickname 'razorback'. Fin whales have a very unusual feature - the lower right jaw is white and the lower left jaw is black. Commercial whaling led to the killing of nearly 750,000 animals in the Southern Hemisphere between 1904 and 1979.Their current status is unknown in most areas outside of the North Atlantic.Commercial whaling remains a threat for fin whales. After a two-year hiatus, Iceland resumed commercial fin whaling in 2013 with a quota of 184 whales. The majority of the whale meat ends up in Japanese markets.Source: WWF"
    ]
}