{
    "articleURL": "/tvshowbiz/article-12061263/Missy-Elliott-looks-trimmer-models-stylish-Fendi-sweatsuit-new-Instagram-snap.html",
    "content": [
        "Missy Elliott showed off her trim frame in a stylish new social media snap.",
        "The 51-year-old rapper looked svelte while modeling a hoodie and sweatpants outfit from the new Fendi and Marc Jacobs collaboration. 'Thank you so much @Fendi for sending me the new Fendi/ @marcjacobs collab early for my show it’s Bussin #TheBaguette,' she captioned the photo, which was shared to her Twitter on Monday.The Work It hitmaker's image has changed over the years, with Missy reportedly losing over 70 pounds after being diagnosed with Graves' Disease in 2008.In 2011 she disclosed that she'd been battling the condition - an autoimmune disease that affects the thyroid - for the past three years, and used diet and exercise to manage the symptoms.  ",
        "In her stylish new snap Missy finalized her look with a matching hat and a pair of platform sneakers.The Virginia-born star - who recently became the first-ever female rapper admitted into the Rock &amp; Roll Hall of Fame - accessorized with oversized gold hoop earrings.As for glam, she rocked a bronze eyeshadow, dramatic lashes and a touch of gloss on her pout.Her fans were thrilled with the snap, with one writing, 'Always fly' and another adding, 'Love this look!!' And on Saturday, Missy wowed as she hit the stage during the Lovers &amp; Friends music festival in Las Vegas.The songstress slipped into a bedazzled red suit along with large gold hoops as she entertained the crowd.",
        "Back in 2011 Missy revealed her struggle with Graves' Disease. The star told People magazine at the time that she was diagnosed with the autoimmune disease in 2008.",
        "And the illness has been so debilitating that it even made it difficult for Missy to complete everyday tasks.'I couldn't write because my nervous system was so bad - I couldn't even use a pen,' she said.The singer initially realized something was wrong when she was driving and her leg started 'jumping'.'I couldn't keep the brake down and almost crashed,' she recalls.The star also suffered severe mood swings, dizzy spells and hair loss; ending up undergoing radiation treatment which improved her condition, along with medication.There is no cure for Graves' disease.In 2018 she shared some of her healthier diet tips, and revealed that she restricted her intake on calorically-dense foods like juice, soda and bread in an Instagram post. ",
        "According to the American Thyroid Association, Graves’ disease is an autoimmune disease that causes over-activity of the thyroid gland, or hyperthyroidism. This condition is also known as Basedow’s disease. It’s the most common cause of hyperthyroidism in the United States.The disease, named for Irish doctor Robert Graves, is seven to eight times more common in women than men. It’s caused by a process that occurs in the immune system during which antibodies are created that cause cells in the body to work harder. They bind with receptors on thyroid cells and cause it to overproduce thyroid hormones, resulting in an overactive thyroid.Graves’ disease symptomsMost of the symptoms associated with Graves’ disease are caused by the over production of thyroid hormones inside sufferers bodies. Those symptoms include racing heartbeat, tremors in the hands, issues sleeping, weight loss, weakness of the muscles, neuropsychiatric symptoms and an intolerance to heat.Graves’ disease may also be associated to inflammation of the eyes. It’s the only form of hyperthyroidism to include such symptoms. It can cause swelling of the tissues around the eyes and bulging, known to medical professionals as Graves’ ophthalmopathy or orbitopathy.Only one-third of Graves patients are said to experience related eye disease. Only five percent of those patients experience severe enough inflammation to cause severe to permanent vision problems. Graves-related eye problems occur more often in sufferers who smoke.Some Graves patients may experience a lumpy, red thickening of the skin on their shins. This is called pretibial myxedema and is usually painless and mild. Pain has been reported in some patients, however.Other symptoms include nervousness, anxiety, irritability and mood swings.What causes hyperthyroidism?According to the NHS, Graves' disease is just one of many causes of hyperthyroidism. It can also be caused by thyroid nodules, or lumps; medications containing iodine; high levels of human chorionic gonadotrophin in the body, which commonly occurs in early pregnancy, multiple pregnancies or molar pregnancies' pituitary adenoma, or benign tumors in the pituitary gland; thyroiditis, also called inflammation of the thyroid; and thyroid cancer. Graves' disease is the most common cause, though.How is Graves' disease diagnosed?Upon hearing a patients symptoms, a general practitioner may administer a blood test to check hormone levels in trying to diagnose Graves' disease, the NHS states. The test will check for levels of thyroid-stimulating hormone, triiodothyronine, and thyroxine. They'll be compared with healthy levels and the doctor will proceed from there with their diagnosis. Is Graves’ disease genetic?Graves’ disease can be passed on genetically, though doctors and researchers have yet to be able to identify what the specific gene is for preventative screening.Living with Graves’ diseaseGraves’ disease can be managed with medical treatment. Patients should be treated first with beta-blockers.There are a number of anti-thyroid medications on the market which doctors recommend in the treatment of Graves’ disease. Those medications do not cure Graves’ disease, but do help manage its symptoms.Medication may not work for all Graves’ disease sufferers. In that case, doctors often recommend treatment with radioactive iodine or surgery. Patients who receive this treatment will then have to be monitored for under-active thyroid via frequent thyroid function tests. Should this occur, doctors will likely prescribe hormone tablets."
    ]
}