{
    "articleURL": "/wires/ap/article-12039145/5-killed-Haiti-vigilante-crowds-target-suspected-gangs.html",
    "content": [
        "PETIONVILLE, Haiti (AP) - Vigilante killings are surging in Haiti's capital and surrounding areas, where an additional five men were slain and set on fire Tuesday by a crowd that left one of the bodies near a police station in an upscale community.",
        "The male victims were apparently brought out alive from the slum of Jalousie outside Port-au-Prince and then killed, according to people in the crowd. Most of the bodies were left strewn along the road that leads to the home of former President Jovenel Moïse, who was killed in July 2021. A fifth body was left close to the police station in suburb of Petionville.\"It´s horrible for them to be killed in front of the eyes of the police,\" said Jean Marc Étienne, who witnessed the scene while sitting in a park in front of the station. \"That shows nobody is safe, that anybody can be killed.\"The Associated Press visited the police station, where authorities declined to comment. A police spokesman did not return calls for comment.At least 18 people have been reported killed by crowds in Port-au-Prince and surrounding areas since last week, although videos and pictures shared on social media suggest the number is higher. The images largely show crowds pelting men with big rocks and setting fire to gasoline-soaked tires placed around or over their bodies.The killings come as some Haitians say they are tired and angry over escalating gang violence, with the U.N. noting a 20% increase in killings from January to the end of March, compared with the last quarter of 2022. In addition, 637 kidnappings have been reported so far this year, a 63% increase compared with the last three months of 2022.",
        "\"The police and the justice (officials) have to take control,\" Étienne said of the vigilante killings.Overall, more than 130,000 Haitians have fled their communities as gangs break into homes, set them on fire and kill people in territory held by rival gangs.On Monday, Prime Minister Ariel Henry condemned the ongoing vigilante killings and ordered people to \"calm down.\"\"The insecurity we experience is appalling,\" he said, adding that people should not be dragged \"into mindless violence.\"Some Haitians have condemned the violence on social media, saying that alleged gang members also have a right to life and that they don´t support a growing vigilante movement.Pictures and videos shared on social media have shown Haitians sharpening machetes and using big trucks to block entrances into neighborhoods as they vow to root out gangs that the U.N. says control up to 80% of Port-au-Prince.Over the weekend, Haiti´s National Police issued a statement saying officers are dismantling gangs across the country that are \"terrorizing the civilian population.\"U.N. Secretary-General António Guterres has appealed for the immediate deployment of a foreign armed force, a plea that the U.N.'s special envoy to Haiti echoed last week. It's a request that Haiti's prime minister first made in October, but the U.N. Security Council has shown no interest.",
        "___Associated Press reporter Dánica Coto in San Juan, Puerto Rico contributed."
    ]
}