{
    "articleURL": "/sport/nba/article-12056451/LeBron-James-hails-one-best-days-life-son-Bronny-18-commits-USC.html",
    "content": [
        "Bronny James shared his decision, just hours before Game 3 of Lakers-Warriors The 18-year-old was believed to be torn between USC, Oregon or Ohio State  DailyMail.com provides all the latest international sports news LeBron James has described Bronny's decision to commit to USC as 'one of the best days' of his life as the NBA legend heaped praise on the young star for becoming the first in the family to go to college.",
        "After L.A.'s Game 3 win against the Warriors at home on Saturday, the 38-year-old Lakers star opened up on his 18-year-old son's choice to stay close to home and play for the Trojans next season. '[It's] one of the best days of my life,' James said after dropping 21 points against the reigning NBA champions. 'First of all, congratulations on Bronny and the decision he made...super proud of him...our family is proud of him.'For me, personally, it's even more special to me 'cause it's the first time someone out of my family to go to college. 'Obviously I didn't go to college either so it's just a proud moment to see my son go to college and he's the first one to go to college in my family so super, duper proud. Super emotional. Just super, duper happy for his journey and today was a proud day. I couldn't lose today, no matter the outcome of this game, I couldn't lose today.",
        "'But I take the cherry on top of this dub, though.' Bronny James abruptly announced his much-anticipated decision on social media on Saturday, about two hours before his father's Lakers took on Steph Curry and Co.He was a McDonald's All-American, just like his father, but the six-foot-three guard was among the few uncommitted elite high school basketball prospects heading toward the summer. ",
        "The namesake son of the top scorer in NBA history played at Sierra Canyon School, which is known for educating scions of the sports and entertainment industries in Chatsworth, an outer suburban neighborhood of L.A.Bronny and his Sierra Canyon team played at USC's Galen Center last January, as they beat a team from Georgia's Wheeler High School led by elite recruit Isaiah Collier — who is coincidentally now Bronny's teammate at USC. 'This is an incredible thing,' LeBron said of his son's latest step in his development in a career destined for the NBA. '[...]USC is getting a great kid.  'He's there to play basketball, [but] they're going to be super surprised at how great a kid he is, even though they've been recruiting him for a while.'",
        "LeBron James has been an active, supportive parent for his sons' basketball dreams, even amid the demands of a pro career now in its 20th season. The elder James also has frequently mentioned that he won't retire until he gets to play alongside Bronny, though the logistics of achieving such a dream would be daunting.If Bronny left USC after one season in 2024 and then landed an NBA job, his father would turn 40 during his son's rookie season. 'I was serious,' James said. 'And I'm still serious about it. Obviously, I've got to continue to keep my body and my mind fresh, I think my mind most importantly. [...] But at the end of the day, I've done what I had to do in this league, and my son is going to take his journey.",
        "'Just because it's my aspiration [to play together] doesn't mean it's his, and I'm absolutely OK with that,' James added. 'My job is just to support my son in whatever he wants to do. [... ] One thing about being a parent is it's not always about what you want. It's about listening to your kids and what they want, and that's when you get a real relationship.'LeBron James has said he would have played at Ohio State, relatively close to his native Akron, if he hadn't gone straight to the NBA in 2003.After Bronny  also chose to stay close to home for college, he will join an already loaded Trojans roster coming off the school's third straight NCAA Tournament appearance under coach Andy Enfield. Bronny James and Enfield both attended the Lakers' victory in Game 3 and got big cheers when they appeared on the scoreboard accompanied by USC's fight song. Several key contributors to last season's USC team are returning, headlined by star guard Boogie Ellis, who led the Trojans with 17.7 points per game.",
        "Many recruiting observers wondered whether USC's strong roster at guard would dissuade Bronny James from choosing the Trojans, perhaps steering him toward Oregon, Ohio State or an alternative to higher education. Instead, the son of the four-time NBA champion and four-time league MVP didn't back down from the challenge of contributing to USC's current surge to national prominence. ",
        "Bronny James is one of the nation's top prospects at point guard, with playmaking skills, a steady jump shot and perimeter defense that could be immediately valuable to the Trojans. His recruiting was done with no public fanfare, however: He gave no significant hints about his decision before he announced his destination Saturday, several months after many of his fellow high school seniors chose their schools.The younger James' full name is LeBron James Jr., but he's much better known by his family nickname. His younger brother, 15-year-old Bryce, is also an elite collegiate prospect at Sierra Canyon.Last month, James spent the Saturday between the Lakers' 81st and 82nd games of the regular season flying back and forth to Portland. James made the one-day trip with his mother, his wife, Bryce and Zhuri to watch Bronny play in the Nike Hoop Summit for Team USA.'I wasn't going to miss it,' James said at the time. 'I understand how important fatherhood is, just coming from a no-father household. ... We always try to support each other in all our endeavors. I'm only as good as my family.'"
    ]
}