{
    "articleURL": "/news/article-12061067/Burger-King-launches-red-black-Whopper-cash-new-Spider-Man-movie.html",
    "content": [
        "Burger King will add a Spider Man-themed Whopper to its menu next weekThe chain announced it would close more than 400 stores last weekNonetheless, Whopper sales were up and its share price rose to an all-time highBurger King has introduced a Spider Man-themed Whopper burger to coincide with the release of the upcoming 'Spider-Man Across the Spider-Verse' movie.",
        "The new Whopper is not dissimilar from the one fans have come to know, except it's sandwiched between a red bun spotted with black sesame seeds. It will be available at participating restaurants across the US from May 15 through June 21.Last week it was reported that a number of Burger King's franchisees, which run hundreds of restaurants, have fallen upon hard times.Last month two franchisees, representing more than 140 locations, went bust and Meridian Restaurants Unlimited, which has 118 Burger King locations across the US, filed for bankruptcy, having racked up $14 million in debt.Earlier this week Burger King announced that by the end of the year it would shutter up to 400 underperforming locations.",
        "Chairman Patrick Doyle said of the closures: 'There will always be a minority [of franchisees] who aren't dedicated, enthusiastic operators. We'll work with them to leave the system and move on to do something else.'There simply is no room for franchisees who are not willing or able to work hard to operate restaurants that are better than the system average over the long term.'But there are other signs things may be looking up. Earlier this month its parent company Restaurant Brands International topped expectations in its first quarter earnings call.Burger King itself experienced 12 percent more sales per store as compared with the same period last year. Restaurant Brands International, which also oversees chains including Popeyes, Tim Hortons and Firehouse Subs, experienced its highest share price of all time on May 3.  ",
        "'This is one of the best results we've had in a really long time,' Restaurant Brands CEO Josh Kobza told CNBC. ",
        "In April, Burger King US President and former Dominos executive Tom Curtis, told the CNBC the chain was selling a record number of Whoppers. That came months after Restaurant Brands named a new CEO Joshua Kobza.When announcing the upcoming closures this year, Kobza admitted there is 'a fair degree of uncertainty' around the plans.Burger King struggled to recover after the pandemic and in April 2021, RBI recruited Curtis to turn around its US business.He pinpointed the construction of Whoppers, highlighting how some employees were slipping cheese slices below the meat, others on top.Curtis said this was slowing down production and wanted to standardize the procedure.In April Kobza said he felt 'really good about where we're going' and praised the 'tremendous leadership' of Curtis.",
        "Michigan2155 Gratiot Ave9871 Livernois 8201 Woodward Ave18021 Kelly Rd20200 Grand River Ave13600 W. McNichols Rd15500 W. Seven Mile20240 Plymouth Rd12661 Mack Ave9239 Gratiot Ave17440 E. Warren16245 Livernois Ave3863 W. Jefferson Ave. 10336 W. 8 Mile Rd3625 South Dort Hwy3801 Clio Rd13324 Woodward Ave28203 Plymouth Rd34835 Plymouth Ave31456 Woodward Ave23660 Telegraph Rd30711 Southfield Rd1113 E. West Maple Rd2411 E. 8 Mile Rd9774 E. M-36Minnesota 209 Nokomis Street, Alexandria 926 Central Avenue Northeast, East Grand Forks  528 Western Ave, Fergus Falls 21 Depot Street, Litchfield 205 Lake Street, Long Prairie 586 Southwest 1st Street, Montevideo 516 East Bridge Street, Redwood Falls 100 21st Street North, Moorhead 1611 US-12, Willmar Montana1422 West Main Street, Lewistown520 North 27th St, Billings1211 9th Street West, Columbia FallsKansas   2201 East Kansas Ave, McPhersonNebraska3627 South Lincoln Avenue, York2504 O St, Lincoln4230 North 27th Street, LincolnNorth Dakota 3765 Gateway Drive, Grand ForksUtah171 East Gateway Dr, Heber7810 South 1300 E, Sandy 10235 South State Street, Sandy729 North Main St, Clearfield1466 East 3500 North, Lehi119 East Crossroads Blvd, Saratoga Springs147 East Bangerter Highway, Draper5390 South 1900 West, Roy1660 West North Temple St, Salt Lake CityWyoming 1902 Mountain View Drive, Cody "
    ]
}