{
    "articleURL": "/wires/reuters/article-12049719/Key-trios-absence-Ryder-Cup-shame-Europe-captain-Donald.html",
    "content": [
        "May 5 (Reuters) - The absence of Sergio Garcia, Ian Poulter and Lee Westwood from this year's Ryder Cup is sad, but could herald a generational shift, said Team Europe captain Luke Donald.",
        "The trio, who have played in 28 Ryder Cups among them and are now part of the LIV Golf series, confirmed on Wednesday that they had quit the DP World Tour, ruling themselves out of the biennial contest against the United States.Their resignations came a month after the DP World Tour, formerly known as the European Tour, won its legal battle to be able to suspend and fine players who featured in conflicting LIV Golf events without permission.Garcia is the Ryder Cup's record points scorer with 28.5, while Westwood has played a record 11 matches, being part of seven winning teams. Poulter has also played a key role in some of Europe's biggest successes.\"It's sad we've got to this point but this was always a possibility,\" Donald told the BBC in an interview published on Thursday.\"I played with all three and they've been stalwarts of, and given a lot to, both the Ryder Cup and European Tour. I have a little more clarity now.\"It is a shame ... Ultimately this is their choice and I wish them well. They feel like this was the best choice for them and now I've got choices to make that are best for me.\"This year's Ryder Cup could represent a \"generational shift\", said Donald, who replaced Henrik Stenson as Team Europe captain last year after the Swede said he was joining the lucrative Saudi-backed series.",
        "\"We certainly have plenty of great players to look at and pick from,\" Donald added.\"There's great momentum with European golf, we've already had seven winners in the U.S. (this season) and a bunch of people who haven't played in the Ryder Cup have played great this year...\"This year's Ryder Cup runs from Sept. 29 to Oct. 1 at the Marco Simone Golf and Country Club near Rome. (Reporting by Aadi Nair in Bengaluru; Editing by Clarence Fernandez)"
    ]
}