{
    "articleURL": "/wires/aap/article-12058253/Housing-jobs-federal-parliament-agenda.html",
    "content": [
        "A $10 billion plan to improve social and affordable housing is on the line as the Senate debates government legislation this week.",
        "With Tuesday's federal budget the main game, Labor is also seeking the support of the Greens and crossbenchers to secure the passage of its Housing Australia Future Fund Bill.The fund's earnings will help deliver 30,000 new social and affordable homes over five years.The government wants a vote on the bill before the Senate rises on Thursday.While Labor will have the support of independents, the Greens are holding out for a more ambitious plan.Greens leader Adam Bandt said it would be a \"terrible idea\" for the government to force a vote on the bill.\"It would be much better for the government to put their effort into negotiating improvements to the bill so that it can pass, because that is something the Greens are willing to do,\" he told reporters in Canberra.Mr Bandt said the legislation in its current form did not have the support of his party, which wanted to see action on the rental crisis and significant spending on housing.Independent senator Tammy Tyrrell, who secured a floor in the program of 1200 homes for every state and territory, said the Greens could end up delivering \"nothing\".\"The Greens need to back in the Housing Australia Future Fund,\" she said.Another key item for debate will be laws to set up Jobs and Skills Australia and improve protections of and access to worker entitlements, including for superannuation and parental leave.",
        "Labor will head into the budget sittings with a solid lead over the Liberal-National coalition in opinion polls, and its newest MP, Mary Doyle, will be sworn in as the member for Aston on Tuesday.Ms Doyle will deliver her first speech on Thursday.Former minister and Fadden MP Stuart Robert is expected to address parliament following his retirement announcement over the weekend.The resignation will trigger a by-election in the Gold Coast seat, with local businesswoman Fran Ward considered the frontrunner to be endorsed as the LNP's candidate.The parliament will mark the passing of a number of significant Australians, including Indigenous leader Yunupingu, former ministers John Kerin and Stewart West, and social justice campaigner Father Bob Maguire."
    ]
}