{
    "articleURL": "/sport/football/article-12057527/ASHES-WATCH-Ollie-Robinson-bags-magnificent-seven.html",
    "content": [
        "The England bowler looks to be shaping up well ahead of the Ashes this summerOllie Robinson bagged another magnificent seven in victory for SussexPlaying alongside new Sussex team-mate Steve Smith - who he'd got out in nets Good week",
        "Ollie Robinson began the week by bowling his new Sussex team-mate, Australian run machine Steve Smith, in the nets — and finished it with career-best figures of 14 for 117 against Worcestershire at New Road.He ended up hobbling from the field in his 46th over of a gruelling draw played out on a heavy outfield, but insisted: ‘My body feels all right. It was just a little bit of cramp, I was probably dehydrated. My body feels good, which is a positive after four tough days.’Robinson, who took seven wickets in each innings, will embark on the Ashes at Edgbaston on June 16 with Smith’s pre-match praise ringing in his ears: ‘I was impressed with him when he was out in Australia. I thought he had some really good skills and it looks like he’s got better since then.’On this week’s evidence, Robinson’s battle with Marnus Labuschagne could be pivotal. The Australian, currently top of the Test rankings, endured a quiet start to the season with Glamorgan, making 17 and five against Durham.But he then hit 64 against Leicestershire and has now warmed up with 64 and a superb 170 not out from just 207 balls at Headingley against Yorkshire, who made a gutsy 412 for nine — with a punishing 174 from former England opener Adam Lyth — to earn a draw.",
        "Ominously for England, Labuschagne admitted: ‘That’s probably the most balanced I’ve felt at the crease. I felt like my head position was in a good spot and my bat path was coming down nicely.’Critics of the county game’s decision to help Australia’s two best batters acclimatise ahead of the Ashes will hardly have been cheered up by Labuschagne’s remarks about Smith: ‘We speak most days, so I’m sure he’ll have a debrief with me on his game and I’ll debrief him on what happens on my game.’Look out, too, for one Australian who is not in the Ashes squad for the first two Tests, but may force his way into contention, especially with question marks over the fitness of fellow seamer Josh Hazlewood. Michael Neser, who played the first of his two Tests against England at Adelaide in December 2021, took seven for 32 for Glamorgan at Headingley, including a hat-trick.At Trent Bridge, Jimmy Anderson put a quiet first-innings performance behind him to bowl Lancashire to the brink of victory over Nottinghamshire. He finished with figures of three for 35 and ended up bowling to old buddy Stuart Broad, who blocked grimly for a draw and was still there at the end with Notts nine down. Earlier, Broad took two for 119 from 30 overs over Lancashire’s two innings.",
        "Middling weekThe good news for Jonny Bairstow, who is all but certain to slot straight back into the England team when they take on Ireland at Lord’s on June 1, is that he played a first-class match for the first time since the Manchester Test against South Africa last August.Bairstow did manage an unbeaten 20 in Yorkshire’s first-innings 106 as Neser ran amok, but then fell for a nine-ball duck after going in at No 3 in the second.Steve Smith, meanwhile, was dismissed for 30 in his first innings for Sussex, lbw to Worcestershire seamer Josh Tongue. DRS might have had it as a bail-trimmer.",
        "Ollie Pope managed 26 and a rapid 47 and Ben Foakes 24 and nought as Surrey clung on for a draw against Essex at Chelmsford.England spinner Jack Leach collected six wickets, including three for 15 in the first innings, but could not get Somerset over the line in their draw with Northants at Taunton.Chris Woakes, who wants his Test place back, had match figures of five for 68, but was outshone by Warwickshire team-mate Chris Rushworth, whose seven for 38 helped skittle Hampshire for 97 and secure an innings win.Bad weekOlly Stone is earmarked as one of England’s three out-and-out quicks for the Ashes, with Ben Stokes keen to ensure one of him, Jofra Archer and Mark Wood play in each of the five Tests.",
        "But, after match figures of three for 118 off 25 overs for Nottinghamshire against Lancashire, the injury-prone Stone hobbled off with hamstring trouble and is now awaiting the results of a scan on the problem.When Nottinghamshire’s ninth wicket fell in the last over, Stone had to drag himself back out to bat to secure the draw.",
        "His county colleague, Test opener Ben Duckett, was twice bowled in single figures by Tom Bailey.Duckett’s opening partner at Notts, Haseeb Hameed, has not given up hope of a Test recall and made 97 in the first innings before Anderson got him for just four in the second."
    ]
}