{
    "articleURL": "/wires/aap/article-12049783/Bruhn-Cats-22-pick-chance-AFL-debut.html",
    "content": [
        "Prized recruit Tanner Bruhn will return to Geelong's starting line-up against Adelaide as the reigning premiers seek to extend their AFL winning streak to five matches.",
        "Bruhn, a former first-round draft pick traded in from GWS last year, played the opening three games of the season for his new side as the Cats fell into a 0-3 hole.The 19-year-old sat out for three weeks but worked his way back as the substitute against Essendon in round seven, kicking two goals from 11 disposals in little more than half a game.Geelong coach Chris Scott confirmed Bruhn will start against in-form Adelaide at GMHBA Stadium on Saturday.\"He didn't go out of our team because he had some deficiencies that he needed to go and work on,\" Scott said.\"It was more a matter of we've got a pretty deep midfield and there is no disgrace at all at being moved out of our midfield because Patrick Dangerfield came back in, or those sort of guys.\"Tanner is going to be a really good long-term prospect for us but more than that I'm really confident that he's going to help us a lot in the short term.\"Ruck Jon Ceglar and Zach Tuohy also return to the Cats' 22, with the veteran Irish defender overcoming back spasms that kept him sidelined last week.Jack Bowes (calf), Gary Rohan (hamstring) and Sam De Koning (nose) are out injured.",
        "Interestingly, Oisin Mullin (soreness) was withdrawn from the extended squad late on Friday and replaced by No.8 draft pick Jhye Clark, who could make his debut.Scott has been keen to protect highly-rated Clark from the media spotlight, shutting down questions about the talented midfield prospect, who had 29 disposals in a strong VFL showing last week.\"Jhye's going to be a gun and we're so excited about him, and I can understand why you're excited about him too,\" Scott told reporters on Friday.\"But we're going to let you know when he's playing with plenty of notice and until I bring it up, I'm not going to talk about him.\"Adelaide have been one of the competition's biggest surprise packets this season, climbing into finals contention on the back of an exciting brand of football under fourth-year coach Matthew Nicks.The Crows enter Saturday's contest with an identical record to Geelong (4-3) and while it has been almost 20 years since they won at Kardinia Park, Scott dismissed Adelaide's historical travel woes as irrelevant.\"What is more relevant is how they've gone over the last month and they've been very good, so it will be a challenge,\" Scott said.\"But on the other side, we feel like we're playing much better footy than we were early in the season.",
        "\"Every club around the competition has got their challenges right at the moment, mainly because the competition is so even and there's not much room to move if you get a few injuries.\"If you're a little bit off in any one game you can really get hurt, especially against good opposition, which the Crows clearly are.\"Adelaide have named an unchanged line-up after having their four-match winning streak snapped in a heartbreaking one-point defeat to Collingwood last round.The Bureau of Meteorology has forecast a maximum temperature of 14C and thunderstorms, including possible hail, for the Crows' visit to inhospitable Geelong."
    ]
}