{
    "articleURL": "/news/article-12039871/Man-shot-Liverpool-seven-minutes-Olivia-Pratt-Korbel-killed-unrelated-shooting.html",
    "content": [
        "Cops rushed to Liverpool street after reports of screaming man and shots firedA man was chased into a front garden and shot multiple times on a Liverpool street just seven minutes away from where nine-year-old Olivia Pratt-Korbel was murdered last year in an unrelated shooting.",
        "Merseyside detectives appealed for witnesses following the shooting in Huyton, east Liverpool, on Tuesday evening.Officers were called just after 9.45pm following reports that a number of shots had been fired on Brookwood Road and a man had been heard screaming.When officers arrived they found a 37-year-old man in the front garden of a house who had suffered gunshot injuries to his leg and foot.Detective Inspector Alyson Keenan, said: 'In the last year we have all seen the heart-breaking devastation that can be caused by those who use guns on our streets and I would appeal to anyone in the community who has any information to come forward, so we can keep our streets safe.",
        "'These people should be treated like pariahs, who are not welcome in our communities because of the harm they bring. 'They have no respect for other members of the public so don't deserve any respect from the communities they inhabit.'We are relentless in our pursuit of those involved in gun crime and will do anything in our power to remove these individuals from our streets and put them behind bars.'We are committed to tackling gun crime, but we can't do it on our own. 'I would urge people from the community who may have any information which could help us to contact us. ",
        "'Any information provided will be acted upon. Help us to put this person where he belongs - behind bars. If you have any information at all, which may help us piece together the evidence we require, please call.'",
        "Thomas Cashman, 34, was jailed for 42 years last month for the murder of nine-year-old Olivia Pratt-Korbel in Kingsheath Avenue, which is just seven minutes from where Tuesday's shooting happened.Cashman was meant to kill drug dealer Joseph Nee, 36, but ended up shooting Olivia through her 46-year-old mother Cheryl's hand on August 22, at their home in Dovecot, Liverpool.Their home is just a seven minute drive from the location of the unrelated shooting that took place on Tuesday evening. Police believe the victim of Tuesday's shooting was chased into the garden by another man, who gunned him down before fleeing.The 37-year-old was taken to hospital where he is being treated for his injuries, which are not life-threatening.Crime scene investigators are carrying out forensic examinations at the scene and house-to-house inquiries were underway in the early hours of Wednesday. Officers will also be looking at CCTV from the area in a bid to identify the person responsible.High visibility patrols have be stepped up in the area to reassure the local community.If you have any CCTV, dashcam or doorbell footage, or any information about this incident DM @Merseypolice on Twitter, or Facebook 'Merseyside Police Contact Centre' quoting reference number 1226 of May 2. ",
        "Alternatively you can call the independent @CrimestoppersUK hotline anonymously on 0800 555 111."
    ]
}