{
    "articleURL": "/sport/tennis/article-12061315/Nick-Kyrgios-tipped-feature-French-Open-despite-not-playing-seven-months.html",
    "content": [
        "Nick Kyrgios is tipped to play in French Open come May 22Aussie star hasn't played a tournament in seven monthsThe 28-year-old last featured at Roland Garros in 2017Previously said girlfriend Costeen Hatzi 'wants to see Paris' Officials are optimistic Nick Kyrgios will emerge from relative obscurity and make a surprise comeback at this month's French Open.",
        "Australia's most enigmatic athlete hasn't played a tour match since the Japan Open seven months ago, subsequently undergoing knee surgery after being forced out of January's Australian Open.Kyrgios has given Roland Garros a wide berth for the past six years.His last match during a European clay-court swing ended in an infamous default after throwing a chair on the court in a classic Kyrgios tantrum while playing Casper Ruud at the 2019 Rome Masters.The hot-head has previously dismissed Roland Garros as being the worst grand slam of all, saying the tournament 'sucked' and should be kicked off the calendar.",
        "Yet the talk suggests Kyrgios is on track for a shock return at the season's second major, which starts in Paris on May 28.'I think he will play Roland Garros,' a senior tennis official told AAP.With his management remaining tight-lipped, fans will have to see it to believe it.Kyrgios remains on the French Open entry list and, with a current ranking of No.26 in the world, would be seeded and guaranteed not to play a higher-ranked rival until at least the last 32.As well as offering priceless match practice ahead of the grass-court season, the 2022 Wimbledon runner-up would also be guaranteed to bank a minimum 62,000 euros ($A101,000) even with a first-round exit.",
        "And returning to Paris was certainly in Kyrgios' plans before he was injured, with love seemingly conquering his dislike for the red-dirt grind.'Yes, I'm playing the French Open. My girlfriend (Costeen Hatzi) wants to see Paris, so why not?' Kyrgios told reporters in Riyadh at the Diriyah Tennis Cup exhibition event in Saudi Arabia in December.'Pick up some more money (in Paris) … I've played well on clay, I've beaten (Roger) Federer, (Stan) Wawrinka, I've played a final on clay (in Estoril in 2015).",
        "'But usually at that time of year I like spending time at home.'Because if I don't, then I'm travelling for eight months a year. It's too much.'But she likes Paris so why not?'Kyrgios has certainly been training, not only on court but also in the gym, and is said to be in decent physical shape.Unlike most, the 28-year-old has also proven - on several occasions - he can compete at the slams with little match preparation.He made the Australian Open quarter-finals in 2015 without playing for four months, the third round at Melbourne Park in 2021 after sitting out most of the previous season during the height of the Covid-19 pandemic, and has reached the second week of other majors following lengthy lay-offs.",
        "He recently took to social media to say 'I can't wait' to play an exhibition match against Danish sensation Holger Rune in Copenhagen on May 24 - four days before the French Open starts.Kyrgios also said last month he was 'pumped' to be returning for the Laver Cup in Vancouver in September and retweeted a post of him being front and centre of a promotion for an Ultimate Tennis Showdown in LA a week after the Wimbledon final in July.So he does appear to have intentions of returning to the court.But exactly when, fans will have to wait and see."
    ]
}