{
    "articleURL": "/tvshowbiz/article-12047097/Holly-Willoughby-42-wows-sleek-peach-suit.html",
    "content": [
        "They are the faces of beauty giant Garnier. ",
        "And Holly Willoughby, Davina McCall and Alex Scott were leading the glam on Thursday as they attended the brand's Spring Summit in London. This Morning host Holly, 42, looked incredible in a peach coloured suit as she posed up a storm alongside the former Big Brother host, 55, who was wowing in a baby pink jumper, crisp white trousers and strappy sandals.Also in attendance was fellow ambassador Alex, 38, who went for a crisp white ensemble to pose alongside the veteran TV stars, having made her transition from the football pitch to commentary and the beauty world. The trio of complementary coloured ensembles made the three women dazzle in front of the orange backdrop and mini supermarket shelves set up in the event.  ",
        "Holly was radiant at the bash as she beamed at the camera with her hair flawlessly styled into her sleek blonde bob and her make-up dewy. Davina looked ageless as ever while wowing in the simple yet stunning ensemble comprising a pink crew-neck jumper and a white trousers. Adding into the sleek look was Alex, who stunned in a white bodysuit and matching double wide-leg trousers from the Spring/Summer 2023 Michael Kors Collection.Her outing comes after Holly got candid with her skin struggles as she shared a make-up free video with her 8.2 million Instagram followers.",
        "Running her hand across her cheekbone, she said to the camera: 'Look can you see this here? This is my pigmentation, which is the bane of my life.'During the social media clip, which was streamed live from her account, Holly was completely natural - clipping her blonde locks back to show her radiant skin.Going through her skincare routine, the star stressed the importance of SPF and Vitamin C as she advised younger generations to prevent the pigmentation she battles with.",
        "Hyperpigmentation or skin pigmentation describes when certain areas of your skin are darker than the rest and is caused by a pigment called melanin.And sharing the spots where she has this, Holly appeared on camera in a pair of white pyjamas with black piping.While she accessorised with jewellery brand Aurum +Grey's Connect Letter Necklace - admitting that she 'doesn't take it off' in the comment section.Going through her skincare regime, she told the camera: 'Now, if it was daytime, which it is not, I would now put on my SPF on but I'm not going to do that. If any of you are young, which I'm sure you are, please remember to put your SPF on."
    ]
}