{
    "articleURL": "/sport/football/article-12056617/Manchester-United-3-0-Tottenham-Hosts-WSL-title-hopes-convincing-win-Spurs.html",
    "content": [
        "Leah Galton and Alessia Russo scored first half goals in Man United's 3-0 winNikita Parris added a third in the second half as Marc Skinner's side beat SpursThe win extends Man United's lead at the top of the WSL for the time being In a week where England lost one of their most creative attacking talents in Fran Kirby, Sarina Wiegman was sat watching two players that probably should, but probably won’t, make her 23-player World Cup squad.",
        "Manchester United’s Leah Galton and Tottenham’s Bethany England. Galton scored her 10th goal of the season in a 3-0 victory that keeps United top of the WSL table.England was not on the scoresheet but was Spurs’ best hope of a goal and her impeccable form has single-handedly kept her team out of the relegation place.Both England and Galton are unlikely to be on the plane to Australia but for different reasons. England, a member of the Euro 2022 winning squad, has fallen out of favour and has not been picked for the last three camps.Galton has never played for England. The forward was wanted by former manager Phil Neville in 2019 but asked not to be selected. ",
        "Galton took time out from football in 2018 and explained that she had to 'fall back in love' with the game when she joined United that year. Galton said in March that England have kept in touch to see where her head is at and has not ruled out changing her mind, but is concerned that adding international football to the mix will disrupt the balance she has found at United.It is a more than understandable decision, given how well she is performing for Marc Skinner’s side - who took another huge step towards securing Champions League football.",
        "United had squandered several chances in the opening 30 minutes before the breakthrough finally came thanks to a defensive calamity from Tottenham.Amy Turner was caught in possession and her attempted back-pass to Korpela was intercepted by Galton, who held off Molly Bartrip to steer the ball into the bottom right corner.Three minutes later, it was 2-0. Ella Toone’s in-swinging cross was flicked on by Galton and Russo was there to hammer a first-time volley into the back of the net.Despite having less than 30 percent possession, Spurs should have pulled a goal back just before half-time. Jessica Naz found space on the left and found an unmarked Celin Bizet in the box, but she could only glance a header against the crossbar when it looked easier to score.",
        "Tottenham’s defending, somehow, only got worse in the second half. Galton miscued her cross into the box but Shelina Zadorsky missed the ball, which then hit Bartrip on the back and landed at the feet of Nikita Parris - who had all the time in the world to control the ball and side-foot a half-volley into the net.Parris is another player that was part of England’s Euro 2022 squad but has been in and out of the squad since. A goal in front of Wiegman will have done her World Cup hopes no harm.",
        "The chances Spurs did get, they wasted. Mana Iwabuchi was one on one with Mary Earps but put her effort straight at the United goalkeeper, who then got up to parry Rosella Ayane’s rebound that was also hit directly at her.For United, attention now turns to the FA Cup final against Chelsea. For Spurs, they remain precariously above the relegation spot with next weekend’s game against bottom-placed Reading pivotal to their survival hopes.",
        "Manchester United (4-2-3-1): Earps, Battle, Le Tissier (Mannion 74), Turner, Blundell (Riviere 86), Ladd, Boe Risa, Parris (Thomas 63), Toone (Williams 74), Galton (Garcia 73), RussoSubs not used: Baggaley, Tounkara, Cascarino, NaaslundGoals: Galton 32, Russo 35, Parris 53Manager: Marc SkinnerTottenham (4-4-2): Korpela, Graham, (Iwabuchi 59) Turner (Petzelberger 77), Bartrip, Harrop, Bizet (Neville 59), Zadorsky, James, Naz (Ayane 45), Spence (Percival 59), EnglandSubs not used: Spencer, Ale, SummanenBooked: Bartrip, HarropManager: Vicky JepsonReferee: Kirsty DowleAttendance: 5,796"
    ]
}