{
    "articleURL": "/tvshowbiz/article-12047737/The-Little-Mermaid-expected-pull-110-million-four-day-opening-weekend.html",
    "content": [
        "The Little Mermaid is expected to make a big splash when it debuts in theaters over the Memorial Day weekend. ",
        "Current projections show the live-action remake of the 1989 animated classic pulling in $110 million over its four day opening weekend, according to Deadline.If the much-anticipated film pulls in that box office, it will be the eighth biggest Memorial Day debut. The biggest is currently last year's Top Gun: Maverick which brought in $160.5 million over the four day scoring period.The film stars Halle Bailey, 23, as Ariel, Melissa McCarthy as Ursula, Javier Bardem as King Triton, Daveed Diggs as Sebastian and Jonah Hauer-King as Prince Eric and is directed by Rob Marshall. Alan Menken, who was the composer of the original film also scored the remake and Lin-Manuel Miranda wrote original songs.",
        "In a cover story for Ebony, Halle revealed that playing Ariel, '...is all a part of God's plan for me.'Halle has been a star since she was a teenager. She's also one half of the R&amp;B singing group Chloe x Halle with her sister Chloe Bailey.Landing the role of Ariel allowed her to spread her wings and explore her individuality. 'It was the first thing I did by myself, independently,' Halle revealed to the outlet. 'I had to move across the world. Suddenly I was in London, and I was by myself. It really forced me to grow up.' ",
        "'The whole filming experience was insane. It was the most intense, excruciatingly beautiful experience of my life. I mean, physically, mentally—all of the above,' the actress admitted. 'But once I got through it, I was like, wow. [I was] really impressed with myself, because I'd never done something like that before.' 'I pushed myself as far as I've ever pushed myself in life,' she recounted to Edition magazine. 'And I feel like the message from her was to know that you've always had it in you.' The movie filmed at London's iconic Pinewood Studios for almost a year. ",
        "'I'm really excited for my version of the film because we've definitely changed that perspective of just her wanting to leave the ocean for a boy,' Halle said.'It's way bigger than that. It's about herself, her purpose, her freedom, her life and what she wants.'Halle added, 'As women we are amazing, we are independent, we are modern, we are everything and above.'And I'm glad that Disney is updating some of those themes.'"
    ]
}