{
    "articleURL": "/tvshowbiz/article-12048603/Bryan-Cranston-Aaron-Paul-make-cameo-preview-Sunny-Philadelphia.html",
    "content": [
        "Breaking Bad stars Bryan Cranston and Aaron Paul make a cameo in a new sneak peek for the 16th season of the FX comedy It’s Always Sunny in Philadelphia.",
        "In the trailer, Cranston and Paul - who played the respective roles of Walter White and Jesse Pinkman on the AMC series - are seated in the back of a vehicle driven by the show's Charlie Kelly (played by Charlie Day).Charlie warns the ubiquitous pair that the car 'may smell a little funky' after he upchucked in it earlier, to which Paul says, 'Oh, perfect.'Charlie also references Cranston's previous signature role on the comedy Malcolm in the Middle, calling him, 'Mr. Malcolm' in the clip.According to a synopsis from FX, the show - which also features Rob McElhenney, Danny DeVito, Glenn Howerton and Kaitlin Olson - is set to return 'for a record-extending Sweet 16 Season.Watch Breaking Bad available exclusively on Stan.",
        "'The Gang is ripping straight from the headlines as they yearn for the past and attempt to survive the year, navigating 2023 with 16 years of baggage and a few figures from their past rearing their heads.'The synopsis goes into details into the storylines involving key characters, noting that 'this year alone, Mac (McElhenney) battles with allergies and long-distance dating' and 'Charlie takes on his long-forgotten sisters.'Also, per the synopsis, 'Dee (Olson) fights for rent control and women's athletics, Frank (DeVito) wrestles for his gun, and Dennis (Howerton) struggles to improve his mental health.'",
        "Cranston and Paul are the latest in a string of notable names to make appearances on the long-running FX comedy.Others who have been seen on the program include Diddy, Pablo Schreiber, Josh Groban, Guillermo del Toro and Game of Thrones co-creators David Benioff and D.B. Weiss.",
        "Cranston and Paul led the Emmy-winning hit Breaking Bad for five seasons from 2008-2013, and last year reappeared on the last season of the show's spinoff, Better Caul Saul. The actors are also good friends and have founded a business with one another, as in 2019, they established the mezcal company Dos Hombres. It’s Always Sunny in Philadelphia is slated to return to the air June 7 on FX."
    ]
}