{
    "articleURL": "/news/article-12061151/Telstra-hit-major-outage.html",
    "content": [
        "Customers unable to make or take callsTelco giant said problem was fixed by 9amThousands of Telstra customers across Australia spent hours unable to make or receive calls after a major network outage.",
        "Frustrated customers are still experiencing issues with making and receiving calls and text messages on Tuesday morning, hours after the outage was first reported.A flood of incident reports were first received late Monday night, according to real-time tech intelligence network Downdetector.Telstra technicians scrambled to try to resolve the problem overnight but services were still disrupted by the morning.Calls to triple-0 and mobile data were not affected by the outage. Telstra says the network glitch was resolved by 9am and has apologised for the inconvenience caused.",
        "'The issue affecting mobile calls is now fixed. Mobile data and calls to Triple Zero, if you had coverage, were not affected at any stage,' a spokesperson said.'We're sorry for the impact this had to people's days. Our team worked to get everyone calling again as quickly as possible.'Telstra added the outage impacted on customers mainly in NSW and Queensland, despite a Downdetctor map showing the issue was nationwide and impacted on every capital city except Darwin.Earlier on Tuesday, the telecommunications giant said it was working to resolve the issue but can't say when the problem will be rectified.'If you're having trouble with calls on your mobile this morning, we're working urgently to fix it. We're sorry to mess with the start of your day,' Telstra tweeted in an earlier update.",
        "'Switching Airplane mode on/off can fix the issue for some customers.''Making calls using Wi-Fi Calling or through apps like FaceTime or Messenger should still work.''We'll add updates to this post as soon as we get them.'Furious customers took to social media to vent their frustration.'Trying to run a business here - no phone,' one man tweeted."
    ]
}