{
    "articleURL": "/sport/othersports/article-12042605/Tori-Bowie-Footage-sprinters-gold-medal-Rio-2016-Olympics-resurfaces-death.html",
    "content": [
        "Tori Bowie was part of US team that overpowered the Jamaicans seven years agoThe 32-year-old claimed gold in London at the 2017 World Championships too DailyMail.com provides all the latest international sports news Highlights of Tori Bowie's sprint to bring gold home at the 2016 Olympics in Rio has resurfaced after news of her death emerged on Wednesday, as fans marvel at the track and field athlete's participation in the second fastest 4x100 meter relay of all time.   ",
        "Running the fourth leg in the relay, the 32-year-old kept the USA up there with the mighty Jamaicans, overpowering Shelly-Ann Fraser-Pryce after clinching the baton from English Gardner as she ran home for gold. The US women, composed of Bowie, Gardner, Tianna Bartoletta and Allyson Felix, sealed victory in 41.02 seconds. Bartoletta, the team's lead-off runner, was even waiting for Bowie for a wild embrace and to celebrate the second-fastest time in history behind the world record that Felix and Co. set to winning gold at London in 2012. For Bowie, it was her first gold medal in what was her first and only involvement at any Olympic Games. ",
        "'I glanced. I mean, I realize we're leading the medal count. I mean, considering how big our country is I'm not too surprised,' she said with a laugh at the time.For Bartoletta, it was the second gold in Rio, after winning the long jump too.Just a year later, in 2017, Bowie won the 100 meters at the 2017 World Championships in London. She also helped the 4x100 team to gold. 'USATF is deeply saddened by the passing of Tori Bowie, a three-time Olympic medalist and two-time world champion,' USA Track and Field CEO Max Siegel said in a statement on Wednesday. ",
        "'A talented athlete, her impact on the sport is immeasurable, and she will be greatly missed.' ",
        "Growing up in Sandhill, Mississippi, Bowie was coaxed into track as a teenager and quickly rose up the ranks as a sprinter and long jumper. She attended Southern Mississippi, where she swept the long jump NCAA championships at the indoor and outdoor events in 2011. Bowie was taken in by her grandmother as an infant after she was left at a foster home. She considered herself a basketball player and only reluctantly showed up for track, but Bowie was a fast learner, becoming a state champion in the 100, 200 and long jump before going to college.Her first major international medal was a 100-meter bronze at worlds in 2015. After winning, she said, 'my entire life my grandmother told me I could do whatever I set my mind to.'In a post on Twitter, Icon Management included a picture of Bowie holding up her hands in the shape of a heart. The management company wrote: 'We've lost a client, dear friend, daughter and sister. Tori was a champion…a beacon of light that shined so bright! We're truly heartbroken and our prayers are with the family and friends.' "
    ]
}