{
    "articleURL": "/wires/reuters/article-12046379/Shopify-cut-20-workforce-beats-quarterly-revenue-estimates.html",
    "content": [
        "By Chavi Mehta",
        "May 4 (Reuters) - Shopify Inc on Thursday posted a surprise first-quarter profit and announced plans to lay off 20% of its staff while allaying investor concerns by exiting its logistics arm, sending its shares surging about 28%.The Canadian e-commerce company had aggressively built out an order-fulfillment network in recent years on expectations that a pandemic-fueled demand boom would last, mirroring similar moves by rivals.But that bet unraveled last year, sharpening investor scrutiny of the capital-intensive project that could weigh on earnings, and forcing the company to cut 10% of its workforce in July.On Thursday, Shopify offloaded the logistics arm to freight forwarder Flexport in an all-stock deal.\"They can have the best of both worlds - a logistics business that makes them competitive with Amazon without having to manage a business that is not core to Shopify and had been losing money,\" said Gil Luria, analyst at D.A. Davidson &amp;amp; Co.Thursday's jump was set to add about C$22 billion ($16.20 billion) to the company's market valuation, taking it to about C$103 billion.Shopify had 11,600 employees and contractors as of Dec. 31.Meanwhile, its March quarter earnings signaled the benefits from a host of new tools that encouraged businesses from Mattel to Coty to integrate Shopify into their own sites, allowing the company to raise its subscription fees.",
        "\"We are seeing that consumers are really voting with their wallets to buy from brands they love,\" President Harley Finkelstein said in an interview. \"There is sort of intentionality around discretionary spending.\"Revenue of $1.51 billion topped analysts' estimates of $1.43 billion, according to Refinitiv. Adjusted profit was 1 cent per share, compared with expectations for a 4 cent loss.\"Over the course of one earnings release, Shopify completely shifted its investor positioning to be a balanced-growth and profitable company,\" William Blair analyst Matthew Pfau said. ($1 = 1.3577 Canadian dollars)(Reporting by Chavi Mehta and Akshita Toshniwal in Bengaluru; Editing by Krishna Chandra Eluri and Sriraj Kalluvila)"
    ]
}