{
    "articleURL": "/wires/pa/article-12051827/Junior-doctors-Scotland-vote-overwhelmingly-strike-BMA-says.html",
    "content": [
        "Junior doctors in Scotland have voted to strike in what will be their first national walkout over pay.",
        "Members of BMA Scotland voted overwhelmingly to strike, with 97% of those who took part in the ballot backing the walkout, the union said on Friday. Turnout was 71%.Dr Chris Smith, chairman of the BMA’s Scottish junior doctors committee, said: “This ballot result shows, beyond doubt, that junior doctors in Scotland have had enough.”The union has now warned that, should the Scottish Government not put forward a pay deal it felt was credible in negotiations, junior doctors would then begin preparations for a 72-hour walkout at dates to be confirmed. We are not asking for huge pay increases – we are simply asking for a tangible step towards addressing the pay erosion our profession has suffered for well over a decade, combined with a clear plan for this to be reversed and restored  Dr Chris Smith  The union said it was in negotiations with the Scottish Government, and claimed that pay for junior doctors had been eroded over the past 15 years with them earning 23.5% less than if they were doing the same job in 2008.An increase of 4.5% has been rejected, with junior doctors claiming the offer was a real-terms pay cut.",
        "The Scottish Government has previously said the BMA’s pay demands were “simply unaffordable”.",
        "Scotland’s Health Secretary Michael Matheson on Friday said he is “disappointed” junior doctors have voted to strike and said he will continue to do all he can to avert industrial action in NHS Scotland.First Minister Humza Yousaf said his Government was in “active and meaningful” negotiations with junior doctors and would continue these “in good faith in the hope of finding a resolution and avoiding industrial action”.The number of junior doctors entitled to vote in the ballot was 5052, with 3610 taking part in the vote. Some 3499 said they wanted to strike, while 111 said they did not want to during the five-week ballot which closed on Friday.If doctors walk out, the union said, junior doctors would not provide emergency care during the strike, with NHS boards needing to arrange emergency cover.Dr Smith said the “years of pay erosion” was “simply unacceptable”.“We are no longer prepared to stand aside, feeling overworked and undervalued, while witnessing so many junior doctors seeking employment abroad or outside the NHS where our considerable skills are properly valued,” he said.“We have made, and continue to make, progress with Scottish Government in formal negotiations on pay, but there is still some work to do before there is an offer that we believe could be credibly put to members.",
        "“In the meantime – we will use this mandate to urge the Cabinet Secretary to signal a clear commitment to investing in the future of Scottish junior doctors, to make Scotland’s NHS an attractive place to train, grow and progress our careers, and show us that the work we do is finally properly, and fairly, valued and appreciated.“We are not asking for huge pay increases – we are simply asking for a tangible step towards addressing the pay erosion our profession has suffered for well over a decade, combined with a clear plan for this to be reversed and restored.”Mr Matheson said: “I am disappointed that BMA junior doctors have voted to take industrial action, which is in no-one’s interest. I will continue to do all I can to avert industrial action in NHS Scotland.“Negotiations to agree a pay uplift are already underway. As these negotiations are held in confidence, it would be inappropriate to offer any further details at this time.”Sandesh Gulhane, health spokesman for the Scottish Conservatives, said that it was “clear” junior doctors were “at the end of their tether”.“Michael Matheson must address the poor conditions junior doctors face, such as ensuring they can get hot, nutritious food at night and that rotas are done six weeks in advance,” he said.",
        "“The ball is in the SNP Government’s court to find a solution to this dispute and deliver the modern, efficient, local health service that Scotland needs.”Jackie Baillie, Scottish Labour’s health spokeswoman, said the overwhelming strike mandate showed the “righteous anger of Scotland’s junior doctors”.“This result has not come out of the blue – it is the product of years of SNP failure to support junior doctors and reward them for their work,” she said.“It is absolutely vital that in the interests of the workforce and our NHS, Michael Matheson gets round the table with the BMA and hammers out a deal.”Scottish Liberal Democrat leader Alex Cole-Hamilton said the Holyrood Government had “left junior doctors utterly depleted”.He said: “Humza Yousaf used to boast that Scotland was the only place in the UK where health strikes didn’t happen. Today’s news exposes that for what it always was: a pathetic attempt to cover up his party’s epic failures.“The new Health Secretary cannot afford to make the same colossal mistakes as his predecessor. He must accelerate talks and bring this dispute to a swift conclusion.”"
    ]
}