{
    "articleURL": "/sport/mlb/article-12039487/Trevor-Bauers-new-teammate-Yasuaki-Yamasaki-shuts-speculation-feud-celebration.html",
    "content": [
        "Yokohama DeNA BayStars shared a video of Bauer doing his sword celebrationYasuaki Yamasaki appeared to take issue with the 'disrespectful' celebrationDailyMail.com provides all the latest international sports newsTrevor Bauer's new Yokohama DeNA BayStars teammate Yasuaki Yamasaki has shut down any speculation of a disagreement between the pair.",
        "Ahead of his first NPB start that's scheduled for Wednesday, the Yokohama DeNA BayStars, who he joined in March after going unsigned by any MLB teams following allegations of domestic violence, shared a video of Bauer encouraging fans to join him in performing his signature sword celebration. However, Yokohoma's closer appeared to take issue with the move on social media as he replied to the team's post, with the translation of his response appearing to brand the move 'disrespectful' and Bauer an 'idiot.'But Yamasaki took to Twitter once again on Tuesday to dispel any speculation of a feud between the pair, insisting his original post had been perceived in an 'unintended' way.Sharing a photo of the pair posing together in uniform, Yamasaki wrote: 'The content I sent was received overseas in an unintended way, and it was perceived that I was bad at him. Talking with Bauer, I was able to convey my feelings firmly. Bauer is an important teammate who aims to win together.' ",
        "It also later emerged that the Japanese pitcher's tweet had been mistranslated into English and his comments had in fact been intended for the team. With the post supposed to read: '(The club) Official (twitter) shouldn't encourage (the fans to do Sword Celebration Action). Foolishness. No respect. There's a different way.'",
        "Bauer himself responded to clear the air, reinforcing the belief that the teammates have made up. He quote tweeted Yamasaki's post, saying: 'I've said my fair share of things on Twitter that were not taken how I intended them by the media and sometimes things get lost in translation. It's all good my friend. I know what you meant.'The team also shared a statement Tuesday evening clarifying the incident as it revealed it had spoken to Yamasaki regarding the intention of the video.'Before yesterday's game, the club had a discussion with Yasuaki Yamasaki about the staging presentation by the club regarding Trevor Bauer's Sword Celebration performance,' the statement read. 'The club explained to Yasuaki Yamasaki that the direction and communication were purely intended to share joy with the fans.'The club also discussed with Trevor Bauer, after his arrival in Japan and before his appearance in a minor league game, to see if there were any problems with his Sword Celebration performance - as Trevor Bauer did not want to do anything inappropriate to Japanese culture. The club supported the idea and considered it as an action that would please the fans.'We are very sorry that some foreign media cut out some of Yasuaki Yamasaki's words on twitter and misled the public.'",
        "Bauer, unsigned by any major league club after claims of domestic violence, joined Yokohama in March on a one-year deal.His arrival in Japan has been widely celebrated with the pitcher becoming a baseball celebrity in the famous port city. Small replica posters of the department store version dot train stations around town spelling out 'Bauer' in English with the message in Japanese - 'He's here.''My face is too big,' Bauer said recently, breaking into a seldom-seen laugh with reporters. 'It's very cool. It's very cool. Growing up as a kid you see professional athletes and movie stars on billboards like that; kind of cool for me to be there myself.'Bauer was unable to find a major league team to sign him this season even after an arbitrator reduced his unprecedented 324-game suspension for violating the league's domestic violence and sexual assault policy.",
        "MLB Commissioner Rob Manfred suspended Bauer last April after a San Diego woman said he beat and sexually abused her in 2021. Bauer has said everything that happened between them was consensual.He was never charged with a crime, and a California judge found the woman's claims 'materially misleading.'Bauer joined his hometown Dodgers before the 2021 season and was 8-5 with a 2.59 ERA in 17 starts before being placed on paid leave. The Dodgers are responsible for $22.5 million of this season's salary.",
        "Bauer, once of the Los Angeles Dodgers, pitched his first competitive game in almost two years on Sunday and said he's almost ready to debut in Japanese baseball after being shunned by major league teams. "
    ]
}