{
    "articleURL": "/news/article-12042575/Ex-Biden-aide-says-no-idea-classified-docs-office-files.html",
    "content": [
        "Biden's former executive assistant Kathy Chung told the House Oversight committee she wasn't aware there were classified documents when packing up Chung testified that she didn't look closely at Biden's belongings, which also included family photos, policy papers and challenge coins, she saidClassified documents were found in now President Joe Biden's Penn Biden Center office and at his Wilmington, Delaware home  Then Vice President Joe Biden's former executive assistant Kathy Chung told the House Oversight Committee that she wasn't aware there were any classified documents among the belongings she packed up. ",
        "CNN reported Wednesday on the contents of Chung's interview to the GOP-led committee, with Chung telling lawmakers she did not notice any documents with classified markings as she unpacked boxes to move Biden into his Penn Biden Center office. Chung testified that she didn't look closely at Biden's belongings, which also included family photos, policy papers and challenge coins, she said. Classified documents were also found at Biden's Wilmington, Delaware home, prompting a federal investigation and the appointment of special counsel Robert Hur, who is leading a criminal probe into the matter. Chung spoke to federal prosecutors in January, CNN said, before Attorney General Merrick Garland appointed Hur. ",
        "Republican Former President Donald Trump and former Vice President Mike Pence are also being investigated over classified documents found at their homes after leaving office.  Chung's testimony backs up Biden's claim that he was 'surprised' by the discovery of classified documents at his Penn Biden Center office.More documents were later found at his home in Wilmington - where he continues to spend practically every weekend. 'My Corvette's in a locked garage, OK? So it's not like they're sitting out on the street,' Biden offered in January. 'People know I take classified documents and classified materials seriously.'In her testimony, Chung described being tasked to pack up Biden's vice presidential office during the transition to the Trump-Pence administration. ",
        "While she had a security clearance during her time working in the Obama-Biden administration, Chung told lawmakers that she believed that any classified material or documents that would need to be collected via the President Records Act had been removed from Biden's office by the time she was packing it up. She testified that she didn't double check the contents as she loaded file folders into the approximately 13 boxes that ended up at the Penn Biden Center. When asked why she said, 'we didn’t have the time or we didn’t think that we needed to sort through them.' 'We just were tasked with – to pack up,' she added, according to CNN. In her interview with lawmakers, she explained that some of Biden's belongings were unpacked, while other files were stowed away.'Well, there were - like those boxes with the Cancer Moonshot and some of the policy papers, I knew. You know, we unpacked those,' she said. 'And we also unpacked some of the boxes with - you know, the Vice President loves photos of his family, so just to make his office look nice, we unpacked those and put those out.''So, it wasn't just all documents,' she said.  When asked if she studied each file she decided to unpack Chung answered 'barely.' ",
        "'We just picked up the file folder from the boxes and put it in the cabinet,' she said. Chung was also forced to tell lawmakers that she had not relationship with the Chinese Communist Party nor was anyone in the Biden family involved in the packing of boxes or instructing her what to pack. Chung has been the target of a racist conspiracy theory suggesting because of her ethnicity she has ties to China. On the political right, another narrative popped up that she was hand-picked by Hunter Biden to move boxes of classified materials. Chung's full transcript hasn't been released to the public.On Wednesday, Democratic Rep. Jamie Raskin, the Oversight Committee's ranking member, demanded that it see the light, expressing concerns that Republicans deliberately 'misrepresented the voluntary transcribed interview.'  'Since launching their investigation into then-Vice President Biden’s handling of classified records, Committee Republicans have peddled false claims and racist innuendo to distract from their unwillingness to investigate former President Trump’s mishandling of and refusal to turn over hundreds of classified records retained at his Mar-a-Lago Club,' Raskin said Wednesday in a statement."
    ]
}