{
    "articleURL": "/news/article-12057765/Ben-Fordham-rips-Chris-Minns-not-lighting-Opera-House-King-Charles-Coronation.html",
    "content": [
        "Plan to light Opera House sails for King CharlesNSW premier rejected that over cost concernsDecision slammed by 2GB listeners, Ben FordhamLabor premier Chris Minns has come under fire for cancelling plans to light up the Sydney Opera House to commemorate King Charles' Coronation on Saturday night.",
        " Former Liberal premier Dominic Perrottet had earlier made plans to project images on the Opera House to celebrate King Charles' historic ascendancy to the British throne.But his Labor successor Chris Minns did not follow through with the plans prompting Fordham to question the NSW premier on why the images were not displayed.'Who died and made you King?' 2GB breakfast host Ben Fordham said of the decision to cancel lights for the once-in-a-generation event held on Saturday.Mr Minns revealed he made the call for financial reasons explaining it would have cost about $100,000 of taxpayer's money to light up the Opera House. ",
        "Fordham pointed out the Opera House was lit up following the death of Queen Elizabeth II on September 8, 2022.He questioned how Mr Minns decided the 'king doesn't deserve' to be given the same kind of respect and illuminated on the famous roof like his mother. Fordham accused the premier of 'nitpicking' and claimed Mr Minns had 'annoyed a lot of people' with his captain's call. Mr Minns argued the late Queen Elizabeth II had 'devoted five decades of service to Australia and the Commonwealth' compared to her son who only recently ascended to the throne. The late Queen Elizabeth II was head of the Commonwealth for seven decades, from her coronation on February 6, 1952 until her death on September 8, 2022. ",
        "Mr Minns said the decision ultimately came down to the financial cost. 'It costs between [$80,000] and $100,000 to light up the Opera House. We've got to be mindful of where taxpayer money is spent and obviously there are other places and other ways of commemorating the King's event,' he said. 'I took into consideration that in 2012 the Opera House was lit up 23 days over 365 days. Last year it was lit up for over 70 days,' he said.'It was lit up for everything from solemn occasions to a football team that was touring NSW I think it was Barcelona FC so it obviously that's not appropriate either.'Mr Minns said he had been selective on what causes to commemorate revealing he had turned down several offers from different groups to light up the venue.'I'd like to keep it for Australia and Australians and moments of sacrifice and heroism for the country or when there's an important international event in Sydney,' he said.Fordham rejected his argument and hit back: 'Sure, but the King's Coronation doesn't come around all that often and we are not a republic yet. 'So is this our NSW or your NSW, and who died and made you king?'",
        "Fordham pointed out Mr Minns had called for the Ukrainian flag to be beamed onto the roof of the venue a year ago.",
        "The demand was made after Russia launched its invasion in the eastern European country on February 24, 2022. Fordham said he had fielded emails all day from angry listeners who were outraged over the decision to not light up the Opera House.NSW Governor Margaret Beazley was among the people who left voice messages with the call particularly painful for Mr Minns.Ms Beazley swore in Mr Minns as NSW premier on March 28 after he defeated Mr Perrottet at the state election. Ms Beazley said she was 'upset' by Minns' choice, calling it 'embarrassing'.Another listener called Minns' decision 'petty' and 'unforgivable' while a third said it showed 'an appalling lack of respect to the new king of our Commonwealth'."
    ]
}