{
    "articleURL": "/wires/reuters/article-12059639/Yields-rise-banking-optimism-supply.html",
    "content": [
        "By Karen Brettell NEW YORK, May 8 (Reuters) - Treasury yields rose on Monday on greater optimism that the worst stresses in the U.S. regional banking system may be over, and before the U.S. Treasury Department will this week sell $96 billion in new supply. Safe haven demand for U.S. government debt ebbed on a rebound in U.S. regional bank shares on Friday, while a stronger-than-expected jobs report for April also boosted investor sentiment. Regional bank shares extended gains on Monday. Banks and investors are also preparing for the sale of this week's coupon-bearing supply, which will include $40 billion in three-year notes on Tuesday, $35 billion in 10-year notes on Wednesday and $21 billion in 30-year bonds on Thursday. The new supply \"will test investors demand for Treasury supply at these levels,\" said Ian Lyngen, head of U.S. rates strategy at BMO Capital Markets in New York. Yields are rising on \"some confidence that we might have gotten past the worst on the regional banking side, and the ongoing demand, just generally speaking, for equities despite everything that´s going on in the world,\" he said. Benchmark 10-year yields were last at up 7 basis points on the day at 3.517%, after falling to a one-month low of 3.296% on Thursday. The yields are holding above a seven-month low of 3.253% on April 6. Two-year yields gained 8 basis points to 3.999%. The yield curve between two-year and 10-year notes was last at minus 48 basis points, reflecting continuing concerns about an upcoming recession. The Federal Reserve´s Senior Loan Officer Opinion Survey due later on Monday will be watched for signs on whether banks are pulling back on lending in anticipation of new regulatory requirements. Consumer Price Index (CPI) data due on Wednesday is also a major U.S. economic focus this week as investors try to gauge whether price pressures will continue to ease, or remain at levels that could make the Fed likely to continue to raise interest rates. Fed funds futures traders are currently pricing in a 93% likelihood that the Fed will leave rates unchanged at its June meeting, and 7% odds of an additional 25 basis points hike. But they also see rates peaking in June, and expect around 69 basis points of cuts by year-end. May 8 Monday 9:33AM New York / 1333 GMT Price Current Net Yield % Change (bps) Three-month bills 5.1175 5.2528 -0.012 Six-month bills 4.9175 5.1093 0.004 Two-year note 99-196/256 3.9991 0.077 Three-year note 100-24/256 3.7153 0.076 Five-year note 100-2/256 3.4981 0.079 Seven-year note 100 3.4999 0.076 10-year note 99-220/256 3.5167 0.071 20-year bond 99-88/256 3.9227 0.070 30-year bond 96-92/256 3.8308 0.069 DOLLAR SWAP SPREADS Last (bps) Net Change (bps) U.S. 2-year dollar swap 23.50 -1.50 spread U.S. 3-year dollar swap 14.75 -1.00 spread U.S. 5-year dollar swap 9.25 -1.00 spread U.S. 10-year dollar swap 0.75 -1.50 spread U.S. 30-year dollar swap -43.00 -1.25 spread (Reporting by Karen Brettell; editing by Jonathan Oatis)"
    ]
}