{
    "articleURL": "/tvshowbiz/chloe-ferry/article-12058959/Chloe-Ferry-shows-curves-plunging-green-attends-jungle-themed-party.html",
    "content": [
        "Chloe Ferry showcased her surgically enhanced curves on Sunday as she attended a jungle themed party to celebrate pal Nathan Henry's I'm A Celeb Australia appearance. ",
        "The reality star, 27, looked incredible in a plunging khaki green top, teamed with beige skin-tight leggings.She completed her look with a pair of stylish cowboy boots and a straw hat as she arrived with Nathan.Geordie Shore star Nathan, 32, was dressed in the iconic red and beige I'm A Celeb outfit from the show.Sophie Kasaei and her boyfriend Jordan Brook arrived hand-in-hand to their pal's party. ",
        "Nathan arrived blindfolded and was shocked when he saw all of his friends and family dressed in jungle gear. He announced he will be starring on I'm A Celebrity Australia right before he made his debut on the screen on Sunday.The star shared an emotional clip on his Instagram stories as he announced the news before he headed to the jungle.In the video, shirtless Nathan said: 'Good morning everyone, if you are seeing this then the news has obviously broke that I am going into the jungle to do I'm A Celebrity Australia . I think that is the car outside waiting to pick me up.'I am so excited, I am so nervous, this is the biggest secret I have ever kept and youse know I have got a very big mouth.'I hope I do the UK proud and I hope everyone votes for me to win. I am getting a bit emotional, what the f***. '",
        "He penned the post: 'THIS IS IT NATHAN IS IN THE JUNGLE! Nathan has joined the cast of will be running his account whilst he is in there here is a little message before he left!'Another post showed an official poster of Nathan for I'm A Celebrity Australia as it was captioned: 'Our client @nathanhgshore is in the jungle! He has joined the cast of @imacelebrityau. Good luck Nathan go and smash it!'An insider told The Sun recently: 'I'm A Celebrity is a huge opportunity for Nathan and he really wants to do the show.'It's really a dream come true for him. It's also perfect timing now Geordie Shore is winding down.'",
        "Despite Nathan's successful debut, with several celebrity pals wishing him the best of luck - I'm A Celebrity... Get Me Out Of Here! Australia has left viewers unimpressed after the cast was unveiled on Sunday night .Among the stars battling it out in the jungle are veteran presenter Kerri-Anne Kennerley, Australian Idol judge Ian 'Dicko' Dickson, MAFS star Domenica Calarco and actress Debra Lawrance.But the line up left many scratching their heads, with some viewers baffled by who any of the cast were.'Who are these people??' questioned one confused person on Twitter while another said, 'Yeah I have no idea who you are'.",
        "'I’m sorry but I have no idea who these people are. Except Dicko. Who was predictable because Kyle got to be back on Idol,' said one more.'Gotta love how all these 'famous' people have to explain who they are to each other,' someone else said.'Dear @Channel10AU Why didn't you get some real celebrities. I don't know who these people are,' yet another tweeted.'I have to be honest, they may as well chuck a bunch of unknown randoms in the jungle instead cause who tf are most of these people,' someone wrote.There was some confusion among the celebrities themselves when they met Debra Lawrance, who is best known for her role as Pippa Ross on Home and Away.",
        "'How do none of these people know who Debra Lawrance is when she's just about the only person I actually do know?!?!?' someone wrote.'HOW do these people (especially Dicko) not know who Debra Lawrence is?????' another asked.Also appearing on the 2023 season are radio host Woody Whitelaw, television host Bianca Hunt and celebrity chef Anna Polyviou.Nathan Henry, best known for appearing on UK reality series Geordie Shore, has likewise joined the new Australian season."
    ]
}