{
    "articleURL": "/wires/pa/article-12047717/50-50-chance-coronation-flypast-cancelled--RAF.html",
    "content": [
        "A flypast to celebrate the King’s coronation is at risk of being cancelled due to poor weather.",
        "Royal Air Force (RAF) Air Chief Marshal Sir Michael Wigston has said “it’s 50/50” as to whether the event will go ahead, and the final decision will be made just one or two hours before it is due to start.Forecasters expect conditions in London to be cloudy and wet on Saturday, which could hamper the ability of pilots to fly safely.More than 60 aircraft from the Royal Navy, British Army and Royal Air Force – including the Red Arrows – are scheduled to fly over The Mall and Buckingham Palace at around 2.15pm.The King and Queen Consort are due to appear on the palace balcony with other members of the royal family to watch the six-minute flypast.Sir Michael said: “The weather isn’t looking brilliant, but there’s nothing we can do about it.“We have to be safe, we have to make sure that we aren’t taking any unnecessary risks.“We’ll make a weather call one or two hours before the actual moment, but if there’s rain and low cloud then it will be almost impossible to get it through.“It’s 50/50 at the moment, but we have lots of options, the decision will be made, at this stage we’re hoping for the best.”",
        "A Ministry of Defence (MoD) spokesperson also told the PA news agency: “The latest weather information will be obtained from both the Met Office and from our helicopters performing weather checks in advance of the main flypast on Saturday.",
        "“If suitable, the flypast will continue as planned. If not, then there are options available to reduce the numbers of aircraft, with cancellation being the last resort.”The decision on whether to go ahead with the flypast can be made by the RAF’s Air Vice-Marshal Mark Flewin, Air Officer Commanding No 1 Group, or the aircraft pilots.The Met Office expects Saturday to be a “cloudy, wet day” across large parts of the UK, with rain falling on London “by around lunchtime”.There were fears the flypast for the late Queen’s coronation in June 1953 would be called off due to bad weather, but after conditions improved it went ahead at 5.15pm following a delay."
    ]
}