{
    "articleURL": "/wires/ap/article-12051617/NOT-REAL-NEWS-A-look-didnt-happen-week.html",
    "content": [
        "A roundup of some of the most popular but completely untrue stories and visuals of the week. None of these are legit, even though they were shared widely on social media. The Associated Press checked them out. Here are the facts:",
        "___FedNow won´t give agency power to seize bank accounts for political beliefsCLAIM: The Federal Reserve is launching a new program that will give it the power to monitor, freeze and even seize private bank accounts based on a person´s behavior or political beliefs.THE FACTS: Fed officials and banking experts say the new FedNow service does not give the agency additional surveillance and enforcement authorities. They say the service simply replaces the agency´s outdated system for banks to process checks and electronic payments. Yet social media posts are sharing a lengthy blog piece with the headline \"U.S. Government Docket No. OP-1670 Exposes New Fed Power to Seize Control of U.S. Bank Accounts.\" The blog item claims a secretive government initiative \"gives unelected officials the power to closely monitor or even freeze your account based on your behavior, and potentially even based on your political views.\" It also claims the system would give government officials the power to monitor a person´s investments, restricting how much they can invest or contribute to certain companies, causes and political parties. But the government document referenced by the post - Docket No. OP-1670 - suggests nothing of the sort, Fed officials and banking experts say. Instead, they say, it details the creation of FedNow, a new service set to launch this summer that will allow banks and credit unions to speed up the dayslong process of clearing checks and electronic payments. \"The Fed and FedNow cannot access individuals´ bank accounts or control how they choose to spend their money,\" the agency said in an emailed statement. Aaron Klein, a senior fellow at the Brookings Institution, a think tank in Washington, D.C., concurred. He said the Fed is simply revamping its outdated Automated Clearinghouse system, which is the network financial institutions use to send each other electronic credit and debit transfers such as payroll direct deposits, social security benefits and tax refunds. \"They are upgrading their current system that runs on 1950s tech to one that´s modern,\" Klein explained in an email. \"It´s like changing from Blockbuster to Netflix.\" Nicholas Anthony, a policy analyst at the Cato Institute, another Washington-based research group, noted that banking institutions are already required to report suspicious financial behavior and other potential threats under the federal Bank Secrecy Act, which was enacted in 1970 to crack down on money laundering and the financing of terrorism. There isn´t anything secretive about the planned system, either, as the blog post claims, Anthony noted. The Fed has provided regular updates on the process, launched a frequently asked questions page and even published a notice in the Federal Registe r early in the process in order to solicit public feedback. The blog post appears to wrongly conflate the forthcoming FedNow system with digital currency, commonly referred to as a \" central bank digital currency,\" or CBDC, which the Fed has also said it is exploring, Anthony and other experts say. Fed officials have stressed FedNow is unrelated to the notion of a government-run digital currency, which social media users also falsely claim would lead to the elimination of cash.",
        "- Associated Press writer Philip Marcelo in New York contributed this report.",
        "___Video of Kamala Harris saying `today is today´ was alteredCLAIM: A video shows Vice President Kamala Harris saying in a speech: \"Today is today. And yesterday was today yesterday. Tomorrow will be today tomorrow. So live today, so the future today will be as the past today as it is tomorrow.\"THE FACTS: The original footage, from a rally on reproductive rights at Howard University last week, does not contain this quote. In the days after Harris headlined the rally in Washington, D.C., a real clip of her speech was mocked by Republicans, with one critic dubbing it a \"word salad.\" In the real footage, Harris says: \"So I think it´s very important - as you have heard from so many incredible leaders - for us, at every moment in time, and certainly this one, to see the moment in time in which we exist and are present, and to be able to contextualize it, to understand where we exist in the history and in the moment as it relates not only to the past, but the future.\" But over the weekend, social media users began sharing a version of the video that had been altered to change the audio so that Harris appears to be rambling incoherently. \"Today is today. And yesterday was today yesterday. Tomorrow will be today tomorrow. So live today, so the future today will be as the past today as it is tomorrow,\" Harris appears to say in the 22-second clip. The altered clip was first posted by an account that frequently posts footage of politicians that have been edited for comedic effect. While many users shared their video as a joke, others suggested it was real. The original footage was live streamed by NARAL Pro-Choice America, an abortion rights nonprofit. The White House´s transcript of Harris´ remarks also does not include the statement from the altered video.",
        "- Associated Press writer Karena Phan in Los Angeles contributed this report.__Video spreads false notion of unlimited oil supplyCLAIM: The planet has an unlimited supply of oil.THE FACTS: Crude oil supplies are not unlimited, experts say. Crude oil is not a renewable resource. Those facts are contrary to a video claiming that oil is an \"unlimited\" resource, which has spread widely among social media users in recent days. The video features the text, \"Oil is unlimited\" while a man says, \"There is an unlimited amount of oil.\" He goes on to suggest that the public is being misled into thinking the oil and other resources are scarce. But the notion is false, according to experts and government agencies. Crude oil is not a renewable resource and takes millions of years to form. While crude oil resources are thought to be abundant, humans are consuming oil much faster than it takes to form, and current technological and financial limitations prevent humans from extracting all potential oil resources. \"Oil is not a renewable resource,\" Marianne Kah, an adjunct senior research scholar at the Columbia University Center on Global Energy Policy, wrote in an email to the AP. Kah added that oil supplies are limited by current technology, the financial viability of what can be produced, and other constraints, like resource access, permitting and geopolitics. \"We´re depleting a fossil resource base that doesn´t get replenished, except on 100 million year time scales,\" Carey King, an energy researcher at the University of Texas at Austin, said in a phone interview. \"And we´re depleting it on 100 year time scales.\" Humans won´t be able to extract all of the world´s oil resources because it won´t be cost effective or technology limitations will still exist, King said. According to the U.S. Energy Information Administration, the global supply of crude oil, other liquid carbons, and biofuels is expected to meet global demand through 2050. \"The world´s underground oil and natural gas accumulations are limited and non-renewable,\" Energy Information Administration spokesperson Chris Higginbotham wrote in an email to the AP. Mark Finley, a fellow in energy and global oil at Rice University´s Baker Institute, wrote in an email that according to a BP report, there were 1.7 trillion barrels of proven crude oil reserves, or oil that is currently technically and economically viable to recover, at the end of 2020, which was enough to cover more than 50 years of that year´s global production. Proven oil reserves have increased as technological developments make more resources accessible and financially viable. He added that while it´s \"doubtful\" that the world will run out of proven oil reserves or supplies, this will be due to decreasing demand for oil and increasing demand for cheaper sustainable energy sources.",
        "- Associated Press writer Josh Kelety in Phoenix contributed this report.__No, MH370 hasn´t been found, underwater photo is a different planeCLAIM: A photo of a plane underwater shows the wreckage of Malaysia Airlines Flight 370 has finally been found.THE FACTS: The photo shows an old Lockheed Martin L1011 Tristar airplane in the Red Sea. The image comes from a video posted online by the Deep Blue Dive Center, a scuba diving company in Aqaba, Jordan. Social media users are falsely claiming the photo shows the wreckage of Malaysia Airlines Flight 370, which has been missing since it went down in 2014 with 239 people aboard. That Boeing 777 that vanished in 2014 remains missing. The photo circulating with the erroneous claim shows the front of a rusty airplane covered in algae. The image actually shows an abandoned plane that was sunk off the coast of Jordan to create an artificial reef. The photo comes from an Instagram video posted on April 6 by the Deep Blue Dive Center, a company that offers scuba diving lessons and other underwater activities in the Gulf of Aqaba. The original video also matches the other shots of the plane that were in the Facebook post. \"Tristar Airplane Wreck Red Sea, Aqaba JO,\" reads the caption. The company noted on the post that the plane was scuttled, or deliberately sunk, in 2019, and has become an artificial reef. Deep Blue Dive Center did not immediately respond to the AP´s request for comment. The plane is an old Lockheed Martin L1011 Tristar plane, according to Aqaba´s official tourism page. The plane was out of service and parked at nearby King Hussein International Airport for several years before the Aqaba Special Economic Zone Authority purchased the aircraft and sank it to become a destination for divers. Brett Hoelzer, who works with Deep Blue Dive Center as a photographer and a dive master, confirmed to the AP over Instagram that the image shared online was the Tristar. Hoelzer had taken similar photos of the same plane for his Instagram page. The Malaysian Airlines flight vanished on March 8, 2014, while flying from Kuala Lumpur to Beijing. An official search by Malaysia, Australia and China was suspended in 2016 and the countries agreed that an official search would only resume if there was credible evidence that identified a location, according to AP reporting.",
        "- Karena Phan___Find AP Fact Checks here: https://apnews.com/APFactCheck___Follow @APFactCheck on Twitter: https://twitter.com/APFactCheck"
    ]
}