{
    "articleURL": "/wires/afp/article-12055773/Thais-queue-temples-schools-early-voting-begins.html",
    "content": [
        "Thais queued under the blistering sun outside temples, shopping centres and schools to cast their early ballots Sunday ahead of a much-anticipated election next week.",
        "More than two million Thais nationwide are registered to vote early ahead of the kingdom's May 14 election, which is shaping up to be a clash between army-backed establishment parties and resurgent opposition movements.Prime Minister Prayut Chan-o-Cha, who took power in a 2014 coup before cementing control in a controversial 2019 election, has been languishing in opinion polls with voters favouring old-school opposition party Pheu Thai and the more radical Move Forward Party.But with an electoral system heavily stacked in favour of the army-backed parties, challengers must achieve a landslide victory to have any hope of forming the next government.\"I hope this election will change the country in a better way,\" said shopping mall worker Srisuda Wongsa-ad, 28, after casting her ballot.She was among hundreds queuing quietly at a polling station in the city's fashionable Ekkamai district to vote at the Wat That Thong temple, overlooked by golden standing buddhas.\"I am voting for a candidate and party that I like, that can answer my needs,\" she said, adding that she was voting early as it was more convenient for her.Elsewhere in the city, the Royal Paragon Hall shopping centre was packed with voters, albeit cooler ones, enjoying the complex's air conditioning.Despite the early hour, temperatures across the capital -- which like much of Thailand endured a vicious April heatwave -- were soaring and expected to hit 39 degrees Celsius later Sunday.",
        "But crowds were still out in force, with traffic and congestion around busy polling stations.\"I am quite excited,\" said first-time voter Pasawee Sriarunothai, 20, who will be out of Bangkok on May 14.\"I decide to cast my vote based on the party's policies, and I hope this election will bring the country a better future,\" Pasawee said.Polls will close at 5 pm (1000 GMT), with alcohol sales across Thailand banned until 6 pm.Authorities had anticipated large numbers of early voters.Police told local media Saturday there would be around 3,000 security officers deployed across the capital, and warned residents to expect heavier traffic congestion around poll sites.An additional 100,000 Thais living overseas will also vote early, with some having already done so.More than 52 million citizens are eligible to vote in this election."
    ]
}