{
    "articleURL": "/femail/article-12038121/Im-professional-dumpster-diver-earn-5-000-month-selling-trash.html",
    "content": [
        "Veronica Taylor, 32, turned dumpster diving into her full time job She makes $4,000 to $5,000 a month by digging through trash The Pennsylvania native has found Louis Vuitton wallets and Michael Kors shoesA woman has turned dumpster diving into her full-time job - raking in $5,000 a month by digging through trash cans and striking gold with designer items. ",
        "Veronica Taylor, 32, makes a fortune by searching through discarded items and then later reselling them. The Quakertown, Pennsylvania native first began jumping into bins as a hobby with her longtime pal Liz Wilson, 38, but soon turned it into a thriving business. Now, the pair make around $4,000 to $5,000 each and have found everything from Louis Vuitton Wallets to Michael Kors shoes. ",
        "Louis Vuitton walletMichael Kors shoesBooksNew magazinesCoatsClothesMannequinsSpray paintPaintChristmas lightsPeriod productsWooden decorationsDispenserColoring booksPrinterRecord playerChristmas lightsPizza cutters",
        "Veronica gets a thrill from diving into the trash, describing it as a 'real life treasure hunt.'She said: 'It's fantastic. It's really like a real life treasure hunt.'You've no idea what you're going to find. And I can hang out with my best friend and make a living from finding things.' While Veronica finds a variety of items - from food, hygiene products, and luxury items, she tends to rake in the cash through the designer finds. Her and Liz tend to donate most of the food and hygiene products to charities and the homeless, but sells the Louis Vuitton and other luxury finds. And searching in Pennsylvania became a game changer for the two pals. Veronica moved from her previous home in California across the country to live with Liz in Pennsylvania and make dumpster diving their full-time gig. Veronica said: 'Pennsylvania is a completely different ball game. We've saved between $10,000 and $15,000 in two months.",
        "'We find Louis Vuitton, Michael Kors. That's in thrift stores - we thought there's no way this was in the dumpster.'We assume it's older people working in the stores who don't know much about the brands and throw them out.'The trash enthusiast loves her job because she feels like she is on a never-ending 'vacation' as they often travel from city to city to find the best discarded items. 'We just spent three days in Boston searching and just hanging out. Every single day is just getting in the car and driving somewhere and seeing what we can find.'It really is like being on vacation all the time. The typical places that we do really well at we go every single night - 10pm to 3am usually.'Then other days we go to rich people neighborhoods, it's fantastic,' Veronica explained. ",
        "And now that she has had a taste of the trash, she revealed she's never going back to a nine to five. Veronica said: 'We split everything 50/50 and I want to say each we've be getting $4,000 to $5,000 a month. It's definitely not worth working a real job for.'There's no words to describe this, it just gives you so much freedom.'The 32-year-old first began dumpster diving in June of 2022 and hasn't given it up since. ",
        "She said: 'Liz took me out last year, she is the reason that I started. It was just a hobby doing that with her. It's so much fun.'After they began raking in the cash, they turned their hobby into a business in February 2023, selling their salvaged items on the online auction app, WhatNot.  ",
        "They list their finds and livestream while people bid - often selling up to 100 items per show.Veronica said: 'It's all auction, so people bid. We did have a thrift store and people can send offers and we pretty much take any offer as we're already making 100 per cent profit.She added that throughout the year, they have also managed to make regular customers who continue to come back to them. Veronica added: 'We also give a lot away too and that's why our supporters keep coming back, they know we hook them up.' And the duo has mastered auctions, making them enticing to everyone. 'Another reason why auctions are so enticing because every item starts at a dollar. We do a big auction every Saturday and then multiple pop-ups throughout the week.'On the big actions we sell over 100 items and the pop-ups we usually sell 40 to 70,' she explained. "
    ]
}