{
    "articleURL": "/news/article-12039921/Biden-attend-swanky-25K-person-fundraiser-hosted-multi-billionaire-donor.html",
    "content": [
        "President Joe Biden will attend fundraisers at the homes of wealthy New YorkersOne fundraiser will be at the apartment of former Blackstone executive Hamilton 'Tony' James, who previously raised millions for Biden and Barack ObamaAnother event will be at the townhouse of hotel and shipping magnate George Logothetis, who has donated to Democrat candidates for yearsPresident Joe Biden will attend a pair of swanky fundraising events at the homes of a pair of well-heeled New Yorkers this month.",
        "On May 10, Biden will first attend an event at the home of Hamilton 'Tony' James, 72, a former Blackstone executive worth around $3.3billion who has previously hosted similar fundraisers for Biden and former president Barack Obama.Tickets for the event at James' home — a Fifth Avenue duplex on Central Park he bought in 2011 for $24.9million — cost at least $25,000 each, according to CNBC. Transportation Secretary Pete Buttigieg will also attend the event.Later, Biden will head uptown for a fundraising dinner at the Upper East Side home of George Logothetis, 48, a Greek shipping magnate who also previously hosted the Obamas for a similar dinner in 2015.The events are the President's first NYC fundraising events since he announced his plans to run for re-election in April.",
        "James' ties to Biden go beyond mere fundraising— just last March the president announced his plans to appoint him to his Intelligence Advisory Board.He was previously offered but turned down the role of commerce secretary by Obama after raising about $2million for the then-president.Then, during Biden's 2020 election, James raised another $2million for the campaign, according to OpenSecrets.James joined the investment management group Blackstone in 2002, rising to the role of CEO and vastly expanding the firm's presence.He remained in charge until late 2021, announcing his retirement after he sold $500million worth of Blackstone stock.",
        "James married his wife, Amabel Boyce James, in 1973. The pair have three children together.He is also the co-chairman of the  Metropolitan Museum of Art, the chairman of the Mount Sinai Hospital System's finance committee, and also chairman at Costco Wholesale Corp, according to the Wall Street Journal.A graduate of Harvard College, James received his business degree from Harvard Business School. Logothetis bought his Upper East Side home for $12.5 million, where he held his fundraiser for the Obamas that cost $33,400-a-head. That was one of many fundraisers for Democrat politicians he has hosted over the years, according to OpenSecrets.Obama appointed him to the board of My Brother's Keeper, an initiative launched in April to help young black men stay on track and realize their potential.And over the years London-born Logothesis has shown he tends to get what he wants.He started work in his father's company, Lomar Shipping, when he was just 18. Within 10 years he was CEO and bent on expanding. He grew the company from just two ships to 70.With his younger brother Constantine, he turned the company into the Libra Group which now runs hotels, leases planes and helicopters and is heavily involved in renewable energy.",
        "But life for the father-of-three is not all work. He insists on taking three months off every five years to give himself time to think about his goals for the next five, refusing to look at work e-mails or take business-related phone calls. 'Ideas need time to breathe,' he says.",
        "During his first sabbatical he hit upon the idea of 'asking inappropriate people to do appropriate tasks' and set out on the company's expansion.'We took all the great people from our shipping business, and sent them around the world to start companies. We ended up with a ship's captain running a $200 million real estate company and a Russian fruit seller who runs six biogas plants in Latvia,' he told Fortune Magazine.His family's net worth is unclear, but is believed to be over $1billion. Logothetis and his glamorous wife Nitzia, a psychotherapist who also comes from a Greek shipping family, are regulars on the Democratic fundraising circuit. The hosted a fundraiser in upstate New York for Obama last year.In 2015, the couple were on the guest list for the White House state dinner for Japanese Prime Minister Shinzo Abe.",
        "Both events indicated the president still holds a base of loyal wealthy Democrat voters, despite a number having voiced they would rather see another candidate leading the ticket.Biden previously leaned on Wall Street wealth to fund his campaign, reeling in about $74million during his 2020 race against Donald Trump, according to CNBC.That sum was far larger than what Trump raised from Wall Street.It comes as a new poll from NBC showed 70 percent of Republican voters preferred Trump over his rival, Florida Governor Ron DeSantis.",
        "A majority of voters did not support Biden, who is 80 years-old, running again, largely over fears of his age."
    ]
}