{
    "articleURL": "/wires/reuters/article-12044837/White-Sox-squeak-Twins-nab-series-victory.html",
    "content": [
        "Eloy Jimenez lined a go-ahead, RBI single in the seventh inning among his two hits and Tim Anderson and Yasmani Grandal had three hits apiece to spark the host Chicago White Sox to a 6-4 win against the Minnesota Twins on Wednesday night.",
        "Chicago secured its first series victory of the season while winning for the third straight time following a 10-game losing streak. The Twins have lost two in a row and three of four.Keynan Middleton worked around a walk to strike out the side in the ninth to notch his first save since May 2021. The White Sox tallied a vital insurance run in the eighth, as pinch runner Billy Hamilton scored from second base on a groundout.Jorge Polanco had two hits for the Twins.Minnesota loaded the bases with no outs in the seventh but didn't score, as winner Gregory Santos (1-0) escaped the jam with two groundouts and a strikeout of Trevor Larnach, who whiffed four times.The Twins' Griffin Jax (1-3) allowed a run on three hits in the seventh to take the loss.Luis Robert Jr. put Chicago on the board first, launching a three-run home run to center field with two outs in the first inning. Robert connected against right-hander Louie Varland on a 2-2 count.Minnesota tied things up in the third, getting a two-run double from Carlos Correa before Byron Buxton doubled home Correa one batter later.Nick Gordon reached Dylan Cease for a solo homer to give the Twins a 4-3 lead in the fourth. Anderson singled home the tying run in the bottom half of the inning, but the rally ended when Minnesota right fielder Max Kepler nabbed Grandal at the plate.",
        "Both starters had no-decisions with similar lines. Cease scattered four runs and five hits in five innings with four walks and six strikeouts.Varland allowed four runs and seven hits in 4 2/3 innings. He walked two and struck out six.White Sox third baseman Jake Burger left the game in the fifth inning with left side discomfort. Burger winced following an awkward swing in his fourth-inning at-bat, and later was called out on strikes. He is being further evaluated.Hanser Alberto replaced Burger in the lineup.--Field Level Media"
    ]
}