{
    "articleURL": "/money/investing/article-12052033/Tap-profits-water-firms.html",
    "content": [
        "The views of King Charles on the environment, once regarded as radical, have moved into the mainstream. ",
        "On the day of his Coronation, it is worth assessing whether this shift is reflected in your portfolio.Has the image and growth potential of stocks you own been dented by heightened concern for the planet?You may, for example, have a lot of cash in the three listed water companies: Pennon Group, supplier to the south-west, Severn Trent, which operates in the Midlands and Wales, and United Utilities, the north-west's provider. The last two are members of the FTSE 100.These monopolies face political and regulatory challenges, and higher interest rates. As a result, the analysts at brokers Jefferies argue that a 'sizeable downside risk' hangs over the sector.This is disturbing news for private investors, some of whom have held these stocks since privatisation in 1989 when the King's environmental activism was still surrounded with scepticism.Sewage is dumped in rivers every two-and-a-half minutes, with United Utilities seen as one of the worst culprits.The Government wants the private and listed water companies to spend about £60billion to remedy sewer and storm overflow problems.If Labour forms the next government, it will impose immediate fines for sewage leaks.Water firms have, traditionally, been considered 'bond proxies' – businesses that offer dependable returns superior to those on bonds. But Ofwat, the industry watchdog, now has the power to prevent dividends if these could endanger financial strength – and such payouts must be linked to performance standards.",
        "However, most analysts still view Pennon, Severn Trent and United Utilities as a hold. This may be surprising, but they pay a good income. Their bosses are also aware of the transformation that they must deliver, and the public and political censure that failure would bring.The need to tackle climate changeThe consequences of climate change also make a strong argument for having a long-term stake in the global water sector, with exposure to the businesses creating the technologies that should help tackle the industry's problems, which include the ageing infrastructure through which 30 per cent of supply is lost.The global water and sewage treatment market, worth $299.8billion (£237billion) in 2022, is expected to reach $497.5billion (£393billion) by 2030 according to US analysts Precedence Research. Such is the range of businesses in this field that there are several water stock market indices, the best known being the S&amp;P Global Water and the ISE Clean Water Edge.Both include the US powerhouse Xylem, which this year paid £5.9billion (£4.7billion) for Evoqua, a US group which claims to have solutions to ensure water is safe, reliable and available, now and in the future. This deal underlines the attention being paid to the sector when the availability of fresh water is threatened by rising temperatures. Global water use rose at more than twice the rate of population growth over the past 100 years.",
        "David Harrison, at the Rathbone Greenbank Global Sustainability Fund, says: 'There is a focus on water scarcity, but also on making water cleaner and safer, especially in the US. 'We look for companies that are a key part of the eco-system because they supply the equivalent of the picks and shovels – tools essential for change.'Badger Meter is one. This US business specialises in the digitally-linked meters that identify issues in water infrastructure, reducing leakage. We have also invested in Halma, a British business whose activities include wastewater inspection products and water disinfection.'Such is the King's commitment to water conservation that rainwater is used to irrigate gardens at Highgrove and the loos. Investors who want to support such systems can look into water funds, such as the Legal &amp; General Clean Water ETF. Ben Yearsley of Shore Financial Planning likes the Schroder ISF Global Sustainable Food and Water fund, based on the thesis that the world must 'produce 70 per cent more food and water, needing 70 per cent fewer resources'.These and other forecasts have led me to examine my eco-conscious holdings. Fundsmith Sustainable Equity has served me well and I am pleased to see it has a stake in Idexx Laboratories, which has a water testing division. ",
        "The planned surge in spending Stateside means I am looking at Quilter Investors Ethical Equity fund, which invests in American Water Works, the colossus which should be boosted by infrastructure renewal expenditure.The combination of payback for people, the planet and my portfolio is the kind of proposition I am looking for.",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}