{
    "articleURL": "/news/article-12051387/Marine-vet-Jordan-Neely-chokehold-named-Daniel-Penny.html",
    "content": [
        "Daniel J. Penny named by the Marine Corps as the man involved in Monday's incidentPenny served in the Marines between 2018 and 2021 and was stationed at Camp Lejeune  The former Marine who put homeless man Jordan Neely in a fatal chokehold on the NYC subway has been formally identified as Daniel J. Penny. ",
        "A Marine Corps spokesman confirmed Penny's identity to DailyMail.com. He served in the 1st Battalion, 2nd Marines, 2nd Marine Division as a sergeant in Camp Lejeune, North Carolina, but left the service in June 2021. He had served four years and was the recipient of seven medals. ",
        "Penny was deployed between December 2018 and July 2019 in the 22nd Marine Expeditionary Unit across the Mediterranean. He has not yet commented on the incident on Monday which has now been classified by NYC officials as a 'homicide'. Penny was riding the F train when Neely, a 30-year-old homeless man and Michael Jackson impersonator, began throwing garbage and yelling, according to others on the train. As the train approached Broadway Lafayette station, Penny put Neely in a chokehold to subdue him.Some of those onboard say he had him in the chokehold for 15 minutes. Video shows him holding him on the ground by the neck while two other male passengers also try to restrain Neely.",
        "Neely was later taken to the hospital, where he was pronounced dead. Penny was questioned by the NYPD but was released on Monday. On Wednesday, the NYC Medical Examiner's office announced that Neely's death was homicide by manner of pressure on the neck. The ruling sparked protests in the city and led to furious calls for Penny to be arrested. ",
        "He has not been arrested, but his attorneys tell DailyMail.com they have reached out to both the NYPD and DA Alvin Bragg's office. Neely's death has sparked an angry debate. On one side, Democrats like AOC and activist groups including BLM have called his death a 'murder' and 'lynching'. They say Penny should be prosecuted for murder. ",
        "Others are calling him a hero for stepping in to protect himself and other passengers from an erratic straphanger. Their support of him is wrapped up in the notorious crime and lack of police on New York City's subway. Mayor Eric Adams, a former cop, has urged the public to be patient while awaiting the result of the DA investigation. He slammed AOC and NYC Comptroller Brad Lander for their incendiary comments about Neely's death. Neely's family earlier this week spoke of the deterioration of his mental health after his mother's murder in 2007. 'My sister Christie was murdered in ‘07 and after that, he has never been the same. 'It had a big impact on him. He developed depression and it grew and became more serious. He was schizophrenic, PTSD. 'Doctors knew his condition and he needed to be treated for that,' his aunt told The New York Post. "
    ]
}