{
    "articleURL": "/wires/ap/article-12056845/Milan-sprints-win-crash-affected-Stage-2-Evenepoel-leads.html",
    "content": [
        "SAN SALVO, Italy (AP) - Jonathan Milan sprinted to victory in a crash-affected finale of the second stage of the Giro d´Italia on Sunday, while pre-race favorite Remco Evenepoel held on to the leader´s pink jersey.",
        "It is Milan's first Grand Tour and the 22-year-old Italian punched his fist in the air in delight as he crossed the line. The Bahrain Victorious rider edged out David Dekker and Kaden Groves in a bunch sprint at the end of the 202-kilometer (126-mile) route from Teramo to San Salvo.\"It´s something that is incredible, I´m without words,\" Milan said. \"I cannot believe it because it´s my first Giro, second stage.\"Yesterday I did a nice time trial, I was quite happy, I was pushing good but I could never imagine that today was coming a victory.\"Mads Pedersen and Mark Cavendish, two of the riders who would have hoped to contest the sprint, were caught up in a crash near the end. That came shortly before the three-kilometer mark and so also caused time gaps in the general classification.Evenepoel finished safely in the peloton to maintain his 22-second advantage over Filippo Ganna, with João Almeida seven seconds further back.",
        "\"Everything was pretty fine,\" said Evenepoel, who rides for Soudal Quick-Step. \"We were in the front so we were out of trouble but it was a pretty nasty crash I think.\"I actually saw it happen so we know who we actually can blame for this crash, but that´s racing ... it wasn´t a nice move so luckily we stayed out of trouble and arrived safe.\"",
        "Evenepoel had stormed to victory in the opening time trial on Saturday. Primoz Roglic, who is considered Evenepoel´s strongest challenger, was 43 seconds behind the Belgian.There was an early breakaway in the opening road stage of the race as Paul Lapeira, Thomas Champion, Mattia Bais, Stefano Gandin and Alessandro Verre got away from the start.Verre sat up shortly after the first of two category-four climbs and Lapeira dropped back to the peloton after the second. The rest of the breakaway were swept up not long after, with 38 kilometers (24 miles) remaining, and they gave each other fistbumps after a long time out front.Monday´s third stage is a 216-kilometer (134-mile) route from Vasto that features two categorised climbs before the uphill finish in Melfi.The Giro ends in Rome on May 28.___More AP sports: https://apnews.com/apf-sports and https://twitter.com/AP_Sports"
    ]
}