{
    "articleURL": "/wires/pa/article-12048869/Ukraine-war-warning-shot-possible-future-energy-shortages.html",
    "content": [
        "The war in Ukraine is a “warning shot” for the possibility of a future with energy shortages, the new chair of the Commons Energy Security and Net Zero Committee has said.",
        "SNP MP Angus MacNeil has been elected as chairman of the cross-party committee of MPs tasked with scrutinising the work of the new Government department of the same name.Speaking to the PA news agency, Mr MacNeil was critical of what he described as a lack of investment in energy security during the austerity agenda, followed by a lack of focus during the years of Brexit wrangling, and highlighted the importance of renewable energy for future supplies. I think the word security is very important going forward, the security of supply, and a focus on that, and I’m glad to see it’s heading in that direction  SNP MP Angus MacNeil  He said: “I think there’s been a penny-wise pound-foolish pressure on the UK energy market for a number of years. I’m talking what bill payers might have had to pay seven to 10 years ago would have been very modest compared to what they have had to pay lately.“And I think some things could have been in place that weren’t in place. And I think people have learned from that, and I think the word security is very important going forward, the security of supply, and a focus on that, and I’m glad to see it’s heading in that direction.”",
        "He added: “I think it was short-term political expediency from the Cameron and May years, with George Osborne as ever being very, very pound-foolish … on energy security.",
        "“Investing a little bit today to reap huge benefits tomorrow – I think if George Osborne had been a farmer he would never have bought any plant seed because it was unnecessary expenditure, oblivious to the harvest that would be coming from that.” Perhaps the Ukraine war tells us another thing about energy. This energy crisis has not been because forms of energy have run out  SNP MP Angus MacNeil  Asked if scrutiny in terms of drawing the public’s attention to the importance of energy security had been sufficient in recent years, he said: “Quite obviously not. Hopefully it will in the future.”Mr MacNeil is familiar with energy and climate policy, having served for a time as chairman of the Energy and Climate Change Committee, which was originally set up in 2009 and dissolved when that department merged with business and industrial strategy in 2016 under former prime minister Theresa May.He said there had since been “a rude awakening” on the importance of energy security.He told PA: “Perhaps the Ukraine war tells us another thing about energy. This energy crisis has not been because forms of energy have run out.”",
        "He went on: “It may come to it at another point in the future where it’s not any sort of man-made constraint or conflict-made constraint, but it’s natural constraint – the stuff isn’t there. What I’m saying is that there has been a constraint on energy that has been created by the war, there may be a constraint in the future that’s created just by the availability of our energy  SNP MP Angus MacNeil  “And so the more sustainable you look to make your energy supply, and the more renewable, the less of a problem you might have in the future.“So you might be able to look at this moment in history as being a sort of warning shot as to what might happen in the future when there are genuine difficulties around energy.“I’m not saying that war isn’t a genuine difficulty, but what I’m saying is that there has been a constraint on energy that has been created by the war, there may be a constraint in the future that’s created just by the availability of our energy.”One possible place to start looking for more alternatives to fossil fuels could be his own constituency of Na h-Eileanan an Iar, Gaelic for the Western Isles, which he describes as “probably the Saudi Arabia of wind energy and renewable energy”.",
        "Addressing the Government’s 2050 net-zero target, he said he did not want to be “presumptuous” on the adequacy or likelihood of reaching it, but said: “We haven’t had a department for energy for about seven years. That’s only four seven-year periods to 2050. It’s not a long time.”"
    ]
}