{
    "articleURL": "/news/article-12052689/Mother-parties-erupts-Mall-eve-Charless-coronation.html",
    "content": [
        "Royal fans camping out before the big day have started a party on The MallPeople danced in the street and sang - fittingly - Queen songs in the nightThe mother of all street parties has erupted on The Mall last night as royal fans enjoy themselves ahead of the Coronation of King Charles.",
        "Hundreds of revellers cracked open drinks, danced in the street and - fittingly - belted out songs by Queen as the big day inched closer.Even a lack of toilets - the public loos close to the procession route appeared to be shut until Saturday morning - couldn't dampen the enthusiasm of those there with more than half a day to spare. Groups of loyal monarchists have been camped out on The Mall for days as they try to get the best seats in the house for this morning's procession to Westminster Abbey.On Friday afternoon those in attendance were given a special treat as the King himself, as well as the Prince and Princess of Wales, went on a walkabout to thank them for their support.",
        "The excitement on The Mall ahead of the big day has been steadily building, with people eager to see the historic event.",
        "And it reached fever pitch last night, as revellers - pushed on by their drinks and the warm spring air - started to party as the sun went down.Among those having a good time was Dawn Britton, from Manchester, who had travelled down with her daughters. She told MailOnline it was her third time camping out on The Mall for a big royal event, saying: 'It’s fun being with my daughters. This is what Britain does so well, this and queuing.'",
        "People were filmed dancing along and singing tunes by Queen, as the alcohol flowed hours before Charles and Camilla will make their way to Westminster Abbey on Saturday morning.One reveller dressed in mock royal regalia, who gave his name as Freddie, simply said: 'What a time to be alive.'  Earlier in the day, one younger group of royal fans pitched up to get a good spot for the procession. The men, who are all in their early 20s, described themselves as 'Royalists' and brought a party atmosphere with them, blasting out 'Ghost Town' by The Specials on their speakers. One of them, who gave his name as Henry, told MailOnline: 'I'm here because we're supporting the King and this is a once in a lifetime opportunity. This is all of our first coronation.'The festivities tonight were dampened slightly after it was discovered the toilets on one side of The Mall appeared to be closed.The Met Police confirmed to MailOnline it had made no request for the toilets to be closed, while The Royal Parks website reported its toilets normally close at 10.00pm and reopen at 8am.",
        "With the party expected to go long into the night, those lighting the midnight oil will have to showcase their powers of recovery ahead of the event.",
        "The King and Queen Consort's procession will set off from Buckingham Palace at around 10.20am, when there is likely to be light wind and rain.Temperatures will then reach highs of 17C by the afternoon, which is around average for the time of year and 5C warmer than Queen Elizabeth II's 1953 Coronation.After the service at Westminster Abbey ends, Charles and Camilla are expected to enter Buckingham Palace through the centre arch at 1.33pm.Met Office meteorologist Alex Deakin said: 'There will be outbreaks of rain in London from 8am onwards, nothing too heavy, it's just going to be a bit grey, damp and drizzly.'It won't rain all morning, just a bit on-and-off with some drizzle, it may stop for half an hour or so and come back again, that kind of thing.'It will probably stay like that into the afternoon before it perhaps gets a little brighter but generally staying drab for most of the day.'King Charles and Queen Consort Camilla will receive a salute from the military in the palace gardens at 1.45pm and the flypast, which will include 60 aircraft from the Royal Navy, British Army and Royal Air Force, is expected at around 2.15pm."
    ]
}