{
    "articleURL": "/wires/ap/article-12044285/Washington-governor-rolls-limitations-police-chases.html",
    "content": [
        "SEATTLE (AP) - With the stroke of a pen Wednesday, Washington Gov. Jay Inslee rolled back some requirements for police to chase people in vehicles, a partial reversal of a controversial pursuit policy first enacted in the state at the height of racial injustice protests following George Floyd´s murder.",
        "Under the new law, police no longer need probable cause to initiate a pursuit. Instead, reasonable suspicion that a person inside a vehicle has committed or is committing a crime would be enough to give chase.The bill reflects a call for a return to more flexibility for law enforcement after Washington lawmakers passed an array of reforms to reduce violence and death in police response, covering everything from background checks officers undergo before they´re hired to the circumstances under which they can pursue vehicles.\"Sometimes the pendulum swings too fast,\" said John Bandler, a lecturer at John Jay College of Criminal Justice. \"The criminal justice system is not a well-oiled wheel, and rapid changes aren´t the best for efficiencies. You have to retrain people. You have to recalibrate.\"Historically in the state, police have been authorized to use force to briefly detain someone if they have reasonable suspicion - a commonsense notion based on specific facts - that someone might be involved in a crime. Probable cause, however, is based on evidence that the person committed the crime and is considered a higher standard.The shift from allowing suspicion to justify pursuit to requiring proof was controversial.Those seeking greater police accountability contended a decline in high-speed chases made communities safer with fewer innocent bystanders being injured or killed. Crashes during law enforcement pursuits killed more than 7,000 people nationwide between 1996 and 2015, or 355 annually on average, according to the last comprehensive report by the Bureau of Justice Statistics on the issue. Nearly 30% of the people killed were in vehicles not involved in pursuits, 4% were bystanders, 65% were suspects and 1% were officers.",
        "Some law enforcement and city officials argued that limiting the ability of officers to initiate a pursuit impedes police investigations and emboldens suspected criminals to flee crime scenes before authorities can question them. A study in the FBI Law Enforcement Bulletin in 2010 said some officers can´t stomach allowing a suspect to drive off, even if it´s the safer option.Under the new Washington law, pursuit can be undertaken for suspicion of a limited set of crimes: a violent offense, a sex offense, domestic violence-related offenses, driving under the influence of alcohol or trying to escape arrest. Vehicular pursuits, however, must be limited to situations where the chase subject poses serious harm to others.Democratic Sen. John Lovick, of Mill Creek, a former state trooper and Snohomish County sheriff who sponsored the Washington bill, said the back-and-forth over pursuit policy represents a balancing act that is common in the shaping of law.Adjustments over time, he said, are needed on the path to effective policing policy.\"I don't think we went overboard,\" Lovick said. \"It brings it back to center. It gives officers the tools to do their jobs to the best of their ability.\""
    ]
}