{
    "articleURL": "/wires/pa/article-12041601/Huge-fires-rage-oil-depot-Russian-lines.html",
    "content": [
        "A massive blaze has broken out at an oil depot behind Russian lines as the war in Ukraine stretches into its 15th month, officials said.",
        "The oil depot erupted in flames in Russia’s southern Krasnodar region, located east of the Russian-held Crimean Peninsula, according to Krasnodar governor Veniamin Kondratyev.He did not say what caused the fire, which was described as extremely difficult to put out. Some Russian media outlets said it was likely to have been caused by a Ukrainian drone attack overnight.Local residents heard an explosion shortly before the fire erupted, Russian news site Baza said.Military analysts reckon Ukraine is targeting supply lines in the Russian rear as Kyiv gears up for a possible counter-offensive amid improving weather conditions and as it receives large amounts of weapons and ammunition from its Western allies.At the same time, anticipating a Ukrainian counter-offensive, Russian forces are focused on destroying logistical routes and centres of Ukraine’s armed forces, Kyiv military officials said.Meanwhile, the Kremlin’s forces used 26 Iranian-made drones in another night-time attack on Ukraine.Explosions were heard in Kyiv and elsewhere during the night as Ukrainian air defences shot down 21 of the Russian drones, Ukraine’s Air Force Command said.No damage or casualties were reported in the third attempt in six days by the Kremlin’s forces to hit Kyiv.Both sides reportedly have experienced ammunition shortages after a winter of long-range shelling and missile strikes as the conflict became bogged down in a war of attrition.",
        "Ukraine’s government has been pressing its allies to give it more as officials consider when and how they might start trying to drive Russian forces out of the Ukrainian territory they have occupied.The US plans to send Ukraine about 300 million dollars (£240 million) in additional military aid, including an enormous number of artillery rounds, howitzers, air-to-ground rockets and ammunition, US officials said.The new package includes Hydra-70 rockets, which are unguided rockets that are fired from aircraft. It also includes an undisclosed number of rockets for the High Mobility Artillery Rocket Systems, or HIMARS, mortars, howitzer rounds, missiles and Carl Gustaf anti-tank rifles.The weapons will all be pulled from Pentagon stocks, so they can go quickly to the front lines, according to the officials.New Zealand also said it was increasing its support for Ukraine by adding another year to the deployment of about 100 military personnel who, among other tasks, have been helping train Ukrainian troops in Britain on operating howitzers.New Zealand’s Prime Minister Chris Hipkins said it will also donate an additional 3.3 million dollars (£2.6 million) towards Ukrainian humanitarian, refugee and legal justice efforts.He said New Zealand has spent about 50 million dollars (£40 million) on financial and military support to Ukraine since the war began."
    ]
}