{
    "articleURL": "/wires/reuters/article-12048353/Crypto-exchange-Coinbase-posts-smaller-quarter-loss.html",
    "content": [
        "By Mehnaz Yasmin",
        "May 4 (Reuters) - Cryptocurrency exchange Coinbase Global Inc posted a smaller-than-feared loss in the first quarter, benefiting from cost cuts and diversification of revenue sources, sending its shares up 7% in extended trading on Thursday.The company has benefited from its deal for One River Digital Asset Management to ramp up product offerings in subscription and services revenue, while it also launched wallet-as-a-service and other products to scale blockchain.\"We're also seeing the benefits of increased cost efficiencies, and we've taken deep lessons from growing too quickly and believe that we are going to be prudent in our spend going forward,\" Chief Financial Officer Alesia Haas said.Coinbase posted a loss of 34 cents a share, while analysts estimated a loss of $1.35 as investors tiptoe back to the speculative asset class to hedge against elevated market risks after a brutal selloff last year.But the trend is yet to power gains for the cryptocurrency exchange as trading volumes more than halved to $145 million while retail trading volumes, which had been instrumental in making Coinbase a household name in 2021, sank 72%.Earlier this year, the company said it will cut 950 more jobs in its the third round of layoffs since last year.Haas said the improved cost-structure will help the company hit its 2023 goal to improve core profit year-over-year.",
        "The company lowered operating expenses by 24% from last quarter and reported $607 million in expenses, much lower than its prior range of between $625 million and $675 million.\"Everyone was expecting disastrous results, and it does not look to be a disaster for Coinbase at all,\" said Dave Weisberger, CEO of CoinRoutes, an algorithmic-trading platform for the digital asset industry.Coinbase shares, which lost 85% of their value in 2022, have risen nearly 40% this year as of Thursday's close as cryptocurrencies gain some ground. (Reporting by Mehnaz Yasmin in Bengaluru; Editing by Maju Samuel and Arun Koyyur)"
    ]
}