{
    "articleURL": "/wires/reuters/article-12045321/Fed-shrinking-savings-Europeans-drain-billions-banks.html",
    "content": [
        "By Sinead Cruise, John O'Donnell and Tom Sims",
        "LONDON/DUBLIN, May 4 (Reuters) - European savers are pulling more of their money from banks, looking for a better deal as lenders resist paying up to hold on to deposits some feel they can currently live without.The trend emerged as some of the region's biggest lenders outlined a profitable start to the year in results that also offered a glimpse of a phenomenon dubbed a \"bank walk\" - a slow but notable outflow of customer cash.Lenders wasted little time in charging more for loans when interest rates rapidly rose from an almost 15-year slumber around zero last year, but most have dragged their feet on boosting deposit rates paid to millions of their customers.That has boosted profits at many major banks beyond many analysts' expectations but left savers disgruntled, raising fresh questions over the longer-term stability of the sector.\"Traditional banks need to decide whether to maximise their return by keeping rates on deposits as low as possible, or to prioritise their liquidity and stability by increasing rates and retaining customers' funds,\" Nicola Marinelli, assistant professor of finance at Regent's University London, said.Money market funds are proving popular among savers seeking bigger returns on their cash as high levels of inflation persist.In recent years, returns on these funds have only narrowly beaten bank deposit rates but the Crane sterling denominated Money Market Fund index reported a 7-day annualised yield of 4.12% as of April 25, compared with some bank interest rates still stuck below 1%. The euro-denominated equivalent was 2.81%.",
        "Data from Refinitiv Lipper showed more than 34 billion euros ($37.6 billion) of net flows into European money market funds in March, the best-selling asset type that month.The fund class was already worth more than 1.4 trillion euros at the end of last year although it remains tiny compared to the 9.45 trillion euros held in current, or checking, accounts at banks across the euro zone.Fidelity International also reported an 8% year-on-year uplift in flows into money market funds on its investment platform between Jan. 1 and April 26.SUFFICIENT LIQUIDITYSenior bankers have been dismissive of the threat posed by lower deposits, in a region where consumer interest groups claim people are more likely to dump spouses than banks.Asked about a 1.6% decline in deposits in the first quarter, UniCredit CEO Andrea Orcel said the bank had such a solid liquidity position - with a coverage ratio of 163% - it could afford to chase profitability in managing its deposit base.The broader fall in deposits may also help banks balance their liabilities - chiefly what they owe depositors - against a future fall in their assets, as demand for loans shows signs of a slowdown.But lenders must also ensure they have sufficient liquidity and capital on hand to cover lending bets which can suddenly turn sour.",
        "Most banks boast liquidity and capital levels above regulatory requirements but the demise of U.S. lender Silicon Valley Bank and Switzerland's Credit Suisse are cautionary tales of what can happen when customers desert lenders at greater pace.WITHDRAWALSIn Britain, NatWest customers withdrew 11.1 billion pounds in the first three months of the year, HSBC's deposits excluding one-off inflows dropped by $10 billion to $1.6 trillion, while Barclays and Lloyds Banking Group recorded falls of 5 billion and 2.2 billion pounds respectively.In Germany, Bundesbank data showed households' deposits dropped nearly 8% from a year earlier, with Deutsche Bank, the country's largest bank, partly attributing its own 4.7% fall in the first quarter to contagion fears from the banking crisis in the United States and Switzerland.Chief Financial Officer James von Moltke conceded, however, that more competition with \"some price-sensitive deposits leaving the bank\", and some clients shifting to higher-yielding alternatives like money market funds, also played a role.France's BNP Paribas also reported a modest dip in first quarter deposits, while Spain's Santander was the only European heavyweight to report a rise, of 6%, over the same period.Some lawmakers have criticised banks for the mismatch between what they charge borrowers and the interest rates offered to savers.\"It is about profitability. It is to preserve your own profits. Is that not the answer?\", British lawmaker Angela Eagle asked bank chiefs at a UK parliamentary hearing in February.",
        "HSBC CEO Noel Quinn described his bank's deposit loss as \"nothing significant\", while Andy Halford, chief financial officer at Standard Chartered, told Reuters he thought people would ultimately prioritise security over interest payouts.\"We will see people parking their money where it is safe,\" he said. ($1 = 0.9048 euros)(Additional reporting by Valentina Za in Milan, Iain Withers, Lawrence White and David Milliken in London, and Balazs Koranyi and Francesco Canepa in Frankfurt; Editing by Kirsten Donovan)"
    ]
}