{
    "articleURL": "/tvshowbiz/article-12047025/Selling-Sunset-season-six-trailer-Nicole-Young-Nick-Cannons-baby-mama-Bre-Tiesi-join-cast.html",
    "content": [
        "Sparks flew in the season six trailer of the Netflix hit Selling Sunset, as the cast was served two new helpings of sizzling drama.",
        "Bre Tiesi, one of the growing list of women who have had children with Nick Cannon, entered the cast this season and scandalized Chelsea Lakzani with her lifestyle.Meanwhile Nicole Young, a years-long veteran of the Oppenheim Group, has now joined the show and instantly found herself locked in a feud with Chrishell Stause.The trailer introduced Bre strutting her stuff in a string of glamorous, busty ensembles and promising to 'show the caliber of houses I can sell.'But it was her unconventional love life that drew attention from Chelsea, who said crisply: 'As a Christian, I find Bre's relationship rather off-putting.'",
        "Nick has 12 children with six different women, with five of them arriving in 2022 alone amid his open relationship with Bre.'Who I have children with is my business,' Bre defiantly said in the new trailer for Selling Sunset. 'I don't need a judge and a jury.'At one point Bre said of one of her co-stars, who remained unnamed in the trailer: 'She just can't take accountability for what comes out of her mouth.'Even early on in the trailer, as Bre is being introduced, Chelsea was seen to remark: 'People say there's something alluring about mystery. I can't stand it.' Chelsea throughout the trailer remained open about her judgements of the way her castmates on Selling Sunset conduct themselves.",
        "'Over lies, over falseness, over things that I don't understand or agree with, that's what triggers me,' Chelsea declared.As she spoke, the clips in the trailer showed not just Bre, but also Chrishell, who is seen sharing a kiss with her nonbinary lover G-Flip.Nicole on the other hand has entered into a professional rivalry with Chrishell, and over the course of the trailer, tension mounted between the dueling blondes.",
        "'I've been at the Oppenheim Group for over eight years,' Nicole said by way of introduction. 'Real estate's everything for me.' However she swiftly landed in the snake pit of Selling Sunset drama, prefigured by Emma Hernan telling Chelsea: 'We have some bad f***ing eggs in the office!' 'Chrishell will do anything that will benefit her,' Nicole hinted darkly in a confessional over a clip of her nemesis serving up a mischievous grin.Eventually the two women confronted each other over cocktails at the beach and Nicole laid out her grievances to Chrishell directly.'You took credit for two listings that I sold,' said Nicole, while Chrishell countered: 'You're clearly out to get me and I wanna get to the bottom of it.'Matters came to a head at a fiery cast dinner, with barbs flying in every direction across the table, including between Chrishell and Nicole.",
        "'Don't go there,' Nicole said at one point, only for Chrishell to sneer: 'Nicole, I will go there every time and I'm not scared of you at all.' Meanwhile the brokerage's dashing chief Jason Oppenheim, who used to date Chrishell, was seen moving on with the Teutonic blonde Marie-Lou Nurk.",
        "Mary Fitzgerald was saddled with the task of deputizing for Jason while he jetted off to Europe to spend time with Marie-Lou amid their blossoming romance.When Mary brought a problem to Jason, he sloughed her off with: 'I'm not handling it,' and when she protested: 'Yes, you are,' he said: 'You're handling it!'Chelsea summed up the ructions to come within the cast, teasing with undisguised excitement: 'Light that fuse - boom!' Selling Sunset, which dropped its first season on Netflix in 2019, will release all 11 of its season six episodes at once on May 19. "
    ]
}