{
    "articleURL": "/wires/pa/article-12057503/British-superstars-perform-Windsor-coronation-spectacular.html",
    "content": [
        "A host of global superstars came together at Windsor Castle on Sunday night for a star-studded concert to mark the coronation.",
        "The Coronation Concert, beamed onto large screens across the country, saw the Prince of Wales make a speech honouring his father the King before performances by Katy Perry, Take That, Lionel Richie, and Nicole Scherzinger.",
        "Stars including Hugh Jackman, Pierce Brosnan, Dame Joan Collins, Bear Grylls OBE, Alan Titchmarsh, and Sir Tom Jones gave pre-recorded video messages in honour of the King throughout the concert, which was hosted by Hugh Bonneville.Top Gun star Tom Cruise delivered a video message from his War Bird plane, saying: “Pilot to pilot. Your Majesty, you can be my wingman any time,” before saluting and banking off.",
        "Muppets stars Kermit and Miss Piggy also gave speeches, with the frog saying he was “honoured” to have been invited to the coronation.At the same time, 10 towns and cities across the country were treated to “spectacular” light displays, while 1,000 drones took to the sky for a UK-first “multi-location drone show”.",
        "The light display included the Welsh dragon, spanning 140m, beamed into the sky above Cardiff to the soundtrack of Paloma Faith singing Lullaby, while James Nesbitt performed a spoken word piece written by Daljit Nagra, chair of the Royal Society of Literature.Hit makers including Katy Perry, who sang Roar and Firework, and Lionel Richie, who played renditions of Easy and All Night Long, entertained the 20,000 strong audience backed by a world-class 70-piece orchestra.",
        "Take That then took to the stage with Greatest Day, Shine and, to close the show, Never Forget, featuring an intro from The Choristers of St George’s Chapel, Windsor Castle.The 300-strong Coronation Choir, conducted by Gareth Malone, performed an uplifting version of the Emeli Sande song Brighter Days, while Steve Winwood sang his hit song Higher Love, accompanied by the Commonwealth virtual choir, with singers from more than 40 Commonwealth countries.The evening also saw a collaboration between five Royal patronages – The Royal Ballet, The Royal Opera, the Royal Shakespeare Company, The Royal College of Music and The Royal College of Art – who came together for the first time to perform Somewhere from West Side Story.Other collaborations included Andrea Bocelli and Sir Bryn Terfel, who sang You’ll Never Walk Alone, and Lang Lang and Nicole Scherzinger, who performed Reflection from Mulan."
    ]
}