{
    "articleURL": "/sport/football/article-12053997/Chelsea-Womens-striker-Sam-Kerr-leads-Australias-delegation-King-Charles-IIIs-coronation.html",
    "content": [
        "Australian captain Sam Kerr bore the flag for her country on the historic dayShe was joined by the likes of comedian Adam Hills and musician Nick Cave Follow MailOnline's dedicated LIVE blog for King Charles III's coronationChelsea star Sam Kerr has been given the honour of leading Australia's delegation at the coronation of King Charles III on Saturday. ",
        "The Blues forward was chosen by her country's Prime Minister Anthony Albanese as flag-bearer for Australia. As part of her role, Kerr makes up one of a number of delegations to precede the monarch inside Westminster Abbey representing several Commonwealth nations and religious groups. As a result, the forward play a key role in representing her nation on the world stage, accompanied by Albanese, governor-general David Hurley, the Earl of Loudoun, and state governors.Kerr spoke of her pride in receiving the nod, but admitted it had been 'in the back of my mind' with Chelsea still fighting to stay in the race for a WSL title.  ",
        "‘It will be massive and obviously it’s an amazing honour,’ said Kerr. ‘We’ve had so many big games recently that it’s kind of been in the back of my mind and I hadn’t had a chance to really think about it until it was coming up, so I’m a bit nervous.‘I found out I’d been offered the role from a phone call but I wasn’t sure if I could do it because we have a game on Sunday, but Emma’s been kind enough to let me miss a practice for it, which is very nice of her.’The Australian contingent will in fact be the first to enter Westminster Abbey on what will surely be a historic day in London. ",
        "That contingent will also include the likes of comedian Adam Hills, and artist Jasmine Coe, as well as nurse Emily Regan and musician Nick Cave.Albanese also spoke of his pride in being part of a 'remarkable' group of his compatriots attending the event.'I'm honoured to represent Australia at the coronation of the King and the queen consort, a historic occasion,' Albanese said. 'I am proud to join a group of remarkable Australians who will also attend the coronation, showcasing our truly diverse and dynamic nation.'Alongside her glittering array of silverware won with Emma Hayes' Blues, the Matildas' captain was also named the Young Australian of the Year in 2022, and awarded an Order of Australia Medal for her services in football. ",
        "Ms Sam Kerr OAMMs Leanne Benjamin AM OBEMr Nick Cave AOMs Jasmine CoeMr Adam Hills MBEDr Daniel NourMiss Yasmin PooleMs Emily ReganMs Minette SalmonMs Claire Spencer AMProfessor Merryn VoyseyCorporal Daniel Keighran VCMr Richard Joyes CVMs Yvonne Kenny AM"
    ]
}