{
    "articleURL": "/tvshowbiz/article-12051051/Natalie-Portman-jokes-shes-definitely-soccer-mom-ferocious-player-son-Aleph-12.html",
    "content": [
        "She helped found the rising Los Angeles-based women's soccer team Angel City Football Club.",
        "And Natalie Portman joked that she had officially become a 'soccer mom' after her son Aleph, 12, had taken to the sport.The 41-year-old actress chatted about how her son had turned into a 'ferocious soccer player' to People on Thursday night at the premiere of her three-part HBO docuseries Angel City, which charts the first year of the women's soccer club that she co-founded along with other celebrity soccer fans.'I mean, we definitely come to a lot of the City games,' she said at the premiere. 'And then also, my son is a ferocious soccer player, so I'm going back and forth to practice.''I'm definitely a soccer mom,' she said of her new routine. ",
        "Portman co-founded Angel City FC in 2020 with Eva Longoria, Serena Williams and the soccer legend Mia Hamm.The soccer club filled a niche as Los Angeles' first professional women's soccer team since the Los Angeles Sol ceased operations a decade earlier. According to her, Aleph — whom she shares with husband Benjamin Millepied, 45 — had been inspired by Angel City and female soccer players' recent struggles to earn equal pay to their male colleagues.'I was so inspired by the women at the Women's World Cup, the last one, who were fighting for pay equity alongside their incredible game,' she explained. 'And I saw my son looking up to the female athletes the same way that he looked up to his male heroes, and I was like, \"Wow, this is really culture-shifting.\"'",
        "At the premiere, Portman told ET that she had been considering having a 'friendly' match between Angel City and Ryan Reynolds and Rob McElhenney's team Wrexham AFC Women.'I've been lucky enough to talk to him about his journey, and he's so inspirational for what he's done with Wrexham, and they have a women's team also,' she said of Reynolds. 'So, we have talked about kind of having some friendly matches at some point.'She also discussed her struggles getting backers to get Angel City FC off the ground. 'It was incredible to get the support from all of those friends and it was, it was really moving when people came on board, because it wasn't obvious, and we got a lot of noes before we got yeses,' she shared. 'And I feel like I didn't realize what a big lift it was, and that might have stopped me from doing it if I understood how hard it was going to be.'",
        "She described it as either 'ignorance or optimism' that kept her going in the early stages of trying to found the team. 'I believed in it so much. I believed in it because these players are the best players in the world, and it's the most popular sport in the world and I thought, \"There's no way that you don't provide greater accessibility, and this isn't the biggest hit,\"' she said.",
        "In addition to her soccer player son Aleph, Portman also shares her six-year-old daughter Amalia, six, with Millepied.She and the French choreographer began dating in 2009, and they tied the knot in 2012 in Big Sur, California. "
    ]
}