{
    "articleURL": "/news/article-12055379/Mother-tells-Scouts-son-identifies-PIRATE-ask-gender-identifies-as.html",
    "content": [
        "Sarah Heath said her son identifies as a pirate when signing him up to Beavers Jonathan, aged three, was wearing an eye patch and had a cutglass at the time The Scout Association now asks parents their child's gender when signing up  A mother told a Scout leader her son identifies as a pirate when ask about his gender, as she prepared to sign him up to Beavers. ",
        "Sarah Heath made the quip about her son, three-year-old Jonathan, when she was asked the 'silly' question. 'I don't have a problem with the question, but it did seem a little silly watching Jonathan with his eye patch and his cutlass', Sarah, 38, told The Sun. 'He isn't aware of gender'. Little Jonathan's brother, seven-year-old Sam, is already a member of the 15th Norwich Beaver group, which prompted Sarah and her husband Chris, 42, to sign their youngest up early.But it was all met with good humour, as she said everyone saw the funny side of the exchange. ",
        "'The local Scout leader is a great chap and does a brilliant job and I'm sure he is only doing what he is told', she said. 'You have to see the funny side though.'Last year, it was revealed that the Scout Association now asks parents for the gender of their child when signing them up to a club. Parents are able to choose the gender their child identifies as from a list which includes, male, female, self-identify or prefer not to say. It's the latest in a line of actions to promote inclusivity within Scouts, which became mixed gender in 1991. Cubs are for girls and boys aged eight to ten and scouts for those up to 14. Its youth section Squirrels, which is being funded by the Government in disadvantaged areas, also welcomes girls as well as boys aged from just four to six. ",
        "In 2017, leaders were instructed to stop calling the children boys or girls, and to use more inclusive and gender neutral phrases such as 'Hello everyone'. And last year, the association faced backlash for introducing a 'trans fun badge' for members as young as four. Youngsters were also offered a 'bisexual fun badge', a 'lesbian fun badge' and a 'Pride fun badge'.The woven designs featured rainbow or striped patterns behind the traditional fleur-de-lis symbol which was introduced by scouting's war hero founder Robert Baden-Powell in 1907.A Scouts spokesman said: 'Scouts is open to everyone — especially young pirates.'They added that data is collected to 'provide the best support'."
    ]
}