{
    "articleURL": "/wires/reuters/article-12053711/King-Charles-coronation-draws-tens-thousands-paper-crowns-plastic-tiaras.html",
    "content": [
        "By Paul Sandle, Suban Abdulla and Muvija M",
        "LONDON, May 6 (Reuters) - Young and old, from Britain and across the globe, tens of thousands of people amassed in central London on Saturday, drawn by the allure of what they said was the chance to witness a moment in history.From the early hours, people dressed in red, white and blue and clutching union flags lined the streets to watch the crowning of King Charles, the first coronation in Britain for 70 years that will be marked by a vast display of pomp and pageantry.Those gathered had different reasons to be there: many older visitors wanted to show their support for Charles and the monarchy, others noted the beginning of a new era, several younger observers spoke of a desire to witness history and others wanted to party.Antonina Strain, 53, travelled from Toronto with her sister Yvonne Havery, saying she had been born in London and coming back for the coronation was a once in a lifetime opportunity.\"I couldn't imagine the United Kingdom without a monarch,\" she said. \"It's ingrained into the soul of the country.\"The coronation is taking place amid a cost of living crisis and public scepticism, particularly among the young, about the role and relevance of the monarchy, and its finances.Charles, who had the longest wait for the throne of any British monarch, is not as popular as his mother, Queen Elizabeth, and his coronation is unlikely to draw the millions who thronged the streets to watch her crowning in 1953.",
        "But polls show the public generally approves of Charles as king and a majority still support the monarchy, even if younger people are far less interested.By 7 a.m. (0600 GMT) crowds on the grand Mall boulevard leading up to Buckingham Palace were 20-deep in places, with many wearing paper crowns and waving flags.At Waterloo station, military divisions in ceremonial dress led by their marching bands disembarked from trains to make their way towards the palace.Sam Mindenhall, a 27-year-old cafe worker from Bristol, south west England, said he thought Charles had sought to balance the tradition of a monarchy that dates back almost 1,000 years with the modern face of Britain, by referencing the country's multiple faiths.\"I think a lot of the issues that he cares about are quite important,\" he said, adding that Charles appeared to be \"trying to be more inclusive and bring more people into our nation\".Fabrizio, a 47-year-old who moved from Italy nine years ago, said he also thought Charles would do a better job of connecting with younger people, given his decades-long interest in environmental issues and support for many different communities.\"I think regardless of his age the king will reach out to younger people, I think he'll be more connected to the youth than the queen,\" he said. (Reporting by Andrew MacAskill, Paul Sandle, Muvija M, Suban Abdulla, Farouq Suleiman; writing by Kate Holton, editing by Alexandra Hudson)"
    ]
}