{
    "articleURL": "/wires/reuters/article-12059935/Covalis-criticises-Italys-institutional-investor-club-ahead-Enel-AGM.html",
    "content": [
        "MILAN, May 8 (Reuters) - Rebel Enel investor Covalis criticised Italy's institutional investor club Assogestioni for not seeking an independent chair at the utility and called for a new organisation to promote corporate governance reform.",
        "Hedge fund Covalis, which owns around 1% of state-controlled Enel, has presented a slate of six nominees for the board of the energy group, challenging the list presented by Italy's Treasury.Assogestioni proposed a slate of three candidates but did not put forward names for the CEO and chair positions.In a new letter sent to Enel's investors and seen by Reuters, Covalis said it disagreed with Assogestioni not proposing an independent chair.The Treasury last month proposed AC Milan soccer club chair Paolo Scaroni, a former CEO of both Enel and energy group Eni , to chair the utility.The ministry also proposed Flavio Cattaneo, vice-president of high speed train operator Italo, to replace Francesco Starace, who has been Enel chief executive since 2014.Investors in Enel will vote to renew the group's nine-seat board at a shareholders meeting on May 10.Covalis urged Enel's investors to vote for its candidates and support its pick of top banker Marco Mazzucchelli for the chair position.If it gets enough backing and Mazzucchelli is elected chair, Covalis intends to reopen discussions on a new CEO, the hedge fund said in the letter.\"I have full confidence that the candidate board members and independent chair proposed by Covalis will run a transparent process to select the CEO at Enel, including candidates from other slates, internal and external candidates,\" Zach Mecelis, founder of Covalis Capital, said in the letter.",
        "Assogestioni and Covalis were not immediately available for comment. (Reporting by Francesca Landini Editing by Alvise Armellini and Mark Potter)"
    ]
}