{
    "articleURL": "/wires/afp/article-12048245/Six-Nigerians-join-NFL-clubs.html",
    "content": [
        "A record eight international players, six of them linemen from Nigeria, were assigned to NFL clubs on Thursday under the league's International Player Pathway program for the 2023 season.",
        "Australia and France will also be represented at clubs by players starting with training camps in July.It's the most players ever allocated to squads in a single year under the NFL's global development program, established in 2017 to give global athletes a chance to learn and train with NFL clubs and perhaps find jobs on elite American football rosters.After 38 athletes from 13 nations tried out at Tottenham Hotspur Stadium in London, 13 were chosen for the 2023 program and spent 10 weeks training in Florida with a chance to showcase their skills in front of NFL scouts.All 32 NFL teams have now received a player through the program since it began.French defensive lineman Junior Aho, 24, will join the Minnesota Vikings. Aho played three seasons at Southern Methodist University, making 25 solo tackles.In addition to Aho in the NFC North, Australian tight end Patrick Murtagh, 23, will join Detroit with Nigerian defensive lineman Kenneth Odumegwu, 22, going to Green Bay and Nigerian offensive lineman Roy Mbaeteka, 23, joining Chicago.Four Nigerian players will join AFC West lineups with the reigning Super Bowl champion Kansas City Chiefs welcoming 22-year-old offensive lineman Chukwuebuka Godrick.Others include defensive linemen Haggai Chisom Ndubuisi, 22, to Denver; David Ebuka Agoha, 21, to Las Vegas and Basil Chijioke Okoye, 21, to the Los Angeles Chargers.",
        "Two-time Super Bowl champion Osi Umenyiora, born in London to Nigerian parents, is directing NFL development efforts in Africa and helped bring the Nigerians to the league's program.\"To see these fantastic young Nigerian men achieve their dream to be on an NFL roster is incredibly exciting,\" he said.Since the program began, 37 global players have signed with NFL clubs with four IPP players on active rosters -- Mailata, Germans David Bada of Washington and Jakob Johnson of Las Vegas and Nigerian-born Briton Efe Obada of Washington."
    ]
}