{
    "articleURL": "/wires/reuters/article-12050785/AMC-Entertainment-beats-estimates-quarterly-revenue.html",
    "content": [
        "By Tiyashi Datta",
        "May 5 (Reuters) - AMC Entertainment Holdings Inc on Friday provided an upbeat assessment of box office recovery this year, after beating quarterly revenue estimates as films including the latest installment of \"Ant-Man\" drew moviegoers to theaters.Movie theaters have started to see a revival in footfalls after an uneven recovery from pandemic lows, thanks to a steady stream of movie releases during the year.\"We could not be more optimistic about the prospects for the 2023 box office, except to say that 2024 looks even better,\" said CEO Adam Aron.Shares of the world's largest cinema chain operator were last up 0.5% in choppy trading, having rallied more than 4% before the bell. The stock, a hot favorite of retail investors, has climbed more than 45% so far this year.Peer Cinemark Holdings Inc, earlier in the day, posted a 33% rise in revenue for the first quarter, driven by a stronger-than-expected box office performance.AMC also signaled a boost to current quarter from the release of the much-awaited \"The Super Mario Bros. Movie\" and said it expected \"The Little Mermaid\", \"Guardians of the Galaxy Vol. 3\" and \"Spider-Man: Across the Spider-Verse\" to generate box-office sales for the rest of the year.Revenue for the world's largest cinema chain operator rose 21.5% to $954.4 million in the first quarter, topping expectation of $948.5 million, according to Refinitiv data.",
        "AMC is experimenting with different combinations to attract audiences, including options allowing moviegoers to choose seating options that match their viewing preferences.\"With moviegoers continuing to trend toward premium screens and concessions, it stands to reason that as volume normalizes, theater-level revenue could exceed pre-pandemic levels,\" said Wedbush analyst Alicia Reese.On an adjusted basis, AMC lost 9 cents per share, compared with expectations for a loss of 16 cents.(Reporting by Tiyashi Datta and Yamini Kalia in Bengaluru; Editing by Anil D'Silva and Sriraj Kalluvila)"
    ]
}