{
    "articleURL": "/wires/aap/article-12061421/Housing-tower-COVID-19-lockdown-reaches-5m-settlement.html",
    "content": [
        "Thousands of residents forced into a sudden COVID-19 lockdown of public housing towers in Melbourne are set to collectively reap $5m in compensation.",
        "The Victorian government has offered to settle a class action over measures intended to stop an outbreak of the virus in nine towers at the beginning of the state's deadly second wave in 2020.About 3000 residents lived in the Flemington and North Melbourne towers at the time of the lockdown, which led to police surrounding buildings and temporary fences being set up.The plaintiffs claim people were wrongly detained for up to 14 days and threatened with physical harm if they tried to leave the towers.A notice of the settlement was posted to the Department of Health's website last week but still needs to be approved in the Supreme Court.Community leader Barry Berih, who lives in the Alfred Street tower, said residents would discuss the offer but wanted an apology instead of a financial settlement.\"I feel very disgusted in terms of this offer, but we have to actually work together as a community to move forward,\" Mr Berih told ABC Radio Melbourne.Under the settlement terms, impacted adults who opt in to the scheme would receive equal shares and children would receive half of that.Legal fees would not be taken out of the $5m fund for residents and instead paid for by the state.The government has repeatedly refused to apologise to the residents despite the state complaints watchdog recommending one was in order for the harm and distress caused by the suddenness of the lockdown.",
        "In a 2020 review, Victorian Ombudsman Deborah Glass found the state government breached the human rights of residents by locking down the towers without notice and its timing did not follow health advice.Senior health officials agreed to the lockdown at a morning meeting on July 4 2020 and expected it would be another 36 hours before coming into effect.But Mr Andrews announced it would start immediately at a 4pm press conference, with many residents unaware of the order until police arrived outside.The premier refused to reflect on whether the multimillion-dollar offer could have been avoided if he or his government had apologised, citing the settlement was not finalised.\"I would, however, direct you to my earlier comments I've made on numerous occasions well before this was in the courts,\" he said on Tuesday.\"We made very difficult decisions and those decisions saved lives. There's no question about that.\"But the state opposition has called on the government to apologise.\"Any settlement should come with a full apology to residents and a promise that this will never happen again,\" Liberal MP Evan Mulholland told AAP in a statement.\"These are the most vulnerable members of our community and they were treated like prisoners.\""
    ]
}