{
    "articleURL": "/wires/reuters/article-12058271/Clutch-hits-10th-lead-Dodgers-Padres.html",
    "content": [
        "The Los Angeles Dodgers scored three runs in the top of the 10th on Michael Busch's tie-breaking single and James Outman's two-run homer to rally for a 5-2 win over the host San Diego Padres in the rubber-match of a three-game series.",
        "The Dodgers tied the game in the ninth on Mookie Betts' two-out homer to left-center off Padres closer Josh Hader, who suffered his first blown save after 11 successes. Betts drove a 3-1 sinker 395 feet for the first homer off Hader in his last 23 save situations.Busch had struck out as a pinch hitter in the eighth with the tying run on second and no one out. But with two outs in the 10th, he lined a full-count pitch from Brent Honeywell to left to score automatic runner Freddie Freeman from third. Outman then pulled his eighth homer of the season into the seats down the line in right.Caleb Ferguson (2-0) struck out two in a perfect ninth to earn the win. Evan Phillips worked a perfect 10th to earn his second save in as many days and his fifth on the season. Honeywell (2-1) took the loss.Until Betts' clutch home run, it appeared the Padres were going to win 2-1 on two first-inning runs scored on three doubles -- two of which could have been caught.Fernando Tatis Jr. opened the Padres first with a double off Dodgers starter Julio Urias on a fly to short center that ticked off the glove of Outman, who first took a step on the ball. Manny Machado followed with a double to right center, driving in Tatis with the game's first run. After Urias retired Juan Soto on a fly to right, Xander Bogaerts hit a fly to right that bounced off Betts' glove as the right fielder was reaching for the wall. Machado scored on what was ruled the third double of the inning.",
        "Padres starter Joe Musgrove had a no-hitter going until Chris Taylor hit a soft liner just over the glove of Padres first baseman Jake Cronenworth with two outs in the fifth.The Dodgers scored their first run in the top of the sixth. Freeman opened the inning with a drive to left that bounced out of Soto's glove. Originally, it was scored a double but then changed to a two-base error. Will Smith drove in Freeman with a line-drive double to left.Smith was on second with no one out but didn't score -- marking the first of two times in the next three innings that the Dodgers couldn't get the tying run home from second with no outs.Musgrove held the Dodgers to an unearned run on two hits and three walks with five strikeouts over five-plus innings. Urias gave up two runs on eight hits and a walk with three strikeouts in 5 2/3 innings.--Field Level Media"
    ]
}