{
    "articleURL": "/wires/reuters/article-12038501/Western-countries-pile-pressure-Mali-Wagner-Group-role.html",
    "content": [
        "By Emma Farge",
        "GENEVA, May 2 (Reuters) - Western countries on Tuesday raised concerns over Russian private military contractor Wagner Group's activities in Mali, including allegations of its role in the killings of civilians, at a U.N. human rights meeting in Geneva.The United States, Canada, Great Britain and Ukraine were among countries that raised the alleged role of Wagner contractors in supporting Mali's armed forces.Mali, whose leaders seized power in a 2021 coup, and Russia have previously maintained that Russian forces there are not mercenaries but trainers helping local troops with equipment bought from Russia. Russian President Vladimir Putin has said Mali has the right to work with private Russian firms.\"We are particularly concerned by the presence and actions of the Wagner group,\" Canada's envoy Patricia Lyn McCullagh told the Human Rights Council during a review of Mali's rights record - a process which all U.N. member states are subject to.Several countries asked Mali to conduct an independent investigation into an incident in March 2022 in Moura, central Mali, where local troops and suspected Russian fighters allegedly killed hundreds of civilians.The U.N. has said its investigators were denied access to the site.Russia has denied civilians were killed in Moura. Wagner did not immediately respond to an e-mailed request for comment.",
        "\"We recommend that Mali conduct a credible investigation into human rights violations and abuses committed during security operations conducted with Kremlin-backed Wagner forces in Moura in March 2022 as promised at the U.N. Security Council and hold those responsible to account,\" said U.S. ambassador to the council Michele Taylor.Mali's director of military justice Colonel Boubacar Maiga said that an investigation was already underway.\"The government of Mali is determined to bring (the investigation) to a successful conclusion in respect for human rights and in a spirit of full independence,\" he said, adding access was difficult as Mali is \"at war\".Russia's envoy Maria Molodtsova said \"those killed (in Moura) were militants from terrorist groups that had oppressed the population for years\". The military operation \"contributed to peace and tranquility in Moura,\" she said.Mali is overrun with militants linked to al Qaeda and Islamic State who have waged a decade-long insurgency that has killed hundreds. French forces intervened in 2013, initially forcing the insurgents to retreat, but they have since rebounded and control much of the centre and north.French forces left last year amid a diplomatic spat with Mali's military junta just as Wagner Group moved in. (Additional reporting by Edward McAllister in Dakar and Gabrielle Tetrault-Farber in Geneva; Editing by Conor Humphries)"
    ]
}