{
    "articleURL": "/sport/football/article-12050033/Liverpool-likely-play-God-Save-King-mark-Coronation.html",
    "content": [
        "Liverpool feel they can't win whether they play the national anthem or notIt has been booed by their fans in the past but respect was shown for the QueenReds host Brentford in televised teatime kick-off after Saturday's CoronationLiverpool 'are likely to play God Save the King' ahead of Saturday's Anfield fixture against Brentford to mark the Coronation of Charles III - despite fears their fans will boo it.",
        "The Premier League has 'strongly suggested' all its teams hosting fixtures on Coronation Day play the national anthem while displaying the official portrait of the King and Queen Consort on big screens.They are also encouraging clubs to mark the occasion with articles in their matchday programmes and for announcements to be made over the stadium PA system.While Tottenham, Newcastle and Wolves will play the national anthem and stage other events ahead of their fixtures this weekend, there is 'unease' at Liverpool, where it has been given a mixed reception in recent years.Some Liverpool supporters booed the anthem when it was played at Wembley ahead of last season's FA Cup final and chanted 'you can stick your Coronation up your a***' during Wednesday's win over Fulham.",
        "However, a minute's silence at Anfield following the death of Queen Elizabeth II last year was largely well observed.The i report that Liverpool are leaning towards playing 'God Save the King' ahead of the 5.30pm kick-off on Saturday - which will be televised live on Sky Sports - despite fears of further dissent.Although the Premier League has not made it mandatory to do so, Liverpool reportedly feel it's a situation in which they can't really win.They will be criticised if they don't play the anthem, but also criticised if they do and it isn't respected.",
        "Manager Jurgen Klopp said earlier this week that 'the club will decide' as to whether Liverpool play the national anthem.Asked if he had an opinion on the subject, Klopp said: 'No, that's a club decision. I am the German guy in the club, so what should I say about that?' 'That would be really great. If my opinion would count even, it's nothing to do with me.' Liverpool supporters noticeably booed the national anthem ahead of the 2022 FA Cup Final at Wembley. ",
        "Before July's Community Shield victory over Manchester City at Leicester's King Power Stadium Prince William was jeered as he shook the hands of players.This weekend's Premier League fixtures are split over the three days of the Bank Holiday, with five of them on Saturday, the day of the Coronation in London.Tottenham have revealed a programme of events to mark the historic event. They will show the ceremony on a big screen at Park Lane Square, outside the Tottenham Hotspur Stadium, from 11am ahead of their match with Crystal Palace.Their match programme will also feature an article on the club's participation in the Coronation Cup in Glasgow to mark the start of Queen Elizabeth's reign in 1953."
    ]
}