{
    "articleURL": "/wires/reuters/article-12048419/FOCUS-Hollywood-insiders-predict-writers-strike-drag-summer.html",
    "content": [
        "By Dawn Chmielewski and Lisa Richwine",
        "LOS ANGELES, May 4 (Reuters) - The Hollywood writers' strike that kicked off this week could last well into the summer and likely beyond, top executives close to the discussions told Reuters this week.On day three of the walkout that has roiled the industry, the two sides remained so far apart that each side blamed the other for the abrupt end of 11th-hour negotiations to avert the strike. No new talks have been scheduled.The dispute represents a clash between writers, who see themselves working more but earning less in the streaming era, and studios attempting to rein in costs to make their money-draining services profitable amid the rapid decline of the traditional television business and threats of another recession.\"There´s no driving force to get a deal done now. I think it will go on for a while,\" said one media chief, who, like other executives requested anonymity to discuss private talks.A protracted strike could be damaging to media companies that rely on scripted material and have a dearth of other content to fill scheduling gaps caused by an extended work stoppage, such as sports rights or news programming, according to an analysis from Moody´s investors service.Moody´s estimates a three-year contract with writers ultimately will cost the media industry $250 million to $350 million per year, a more modest estimate than the guild's projections of about $429 million per year.",
        "\"Obviously, we've been planning for this,\" Paramount Global CEO Bob Bakish told investors Thursday, during the company´s quarterly investor call. But \"in terms of financial impact, it really ultimately depends on the duration of the strike.\"One film industry executive worried that a prolonged work stoppage could drive consumers to more deeply embrace other forms of entertainment, like the social media feeds flowing into their smartphones.\"You´re burning down the house and there´s not going to be a house to come back to,\" said the executive. \"Look at COVID. It accelerated streaming because there really were no movie theaters to go to. It changed consumer behavior and expectations.\"FAR APARTStudio executives have characterized the Writers Guild of America´s demands, which it shared on social media, as a nostalgic yearning for a bygone era of television, when writers earned a healthy wage working on a network television show, then reaped continued financial rewards when it entered syndication and reruns.Television writers say their pay has suffered, as studios squeeze writers into smaller rooms for fewer weeks at minimum pay, despite financing lavishly produced streaming series. The union is seeking staffing and wage guarantees, as well as increases in the residual payments for the reuse of shows.\"We need to make a deal that recoups for writers some of the money taken from us between those (negotiation) cycles,\" Christopher Keyser, co-chair of the WGA bargaining committee, said on Wednesday. \"And we need to have a negotiation that puts in place some systemic structural protection that will allow writing to continue as a profession.\"",
        "Studio executives counter that the industry employs more TV writers than ever in a time of \"peak TV,\" as it churned out 599 scripted shows last year across broadcast, cable and streaming services, according to FX Research.\"There´s more money being paid into the deal than ever before -- but it's spread out more,\" said the film industry executive, who spoke on background because of the sensitivity of negotiations.A TV writer who spends 14 weeks on a streaming series would earn about $69,000 to $115,000 when paid at minimum scale, according to WGA statistics. Some also earn residuals of up to $41,000 for an hourlong show.The Alliance of Motion Picture and Television Producers, a trade group that negotiates with Hollywood's labor unions on behalf of the studios, issued a statement Thursday saying writer-producers, who it said represent the largest category of TV writers, can earn $150,000 to $180,000 over the course of 20 to 24 weeks.Hollywood writers must pay their agents and managers out of their wages -- and, unlike staff writers, can go long periods between gigs.Another sticking point is how screenwriters for films are compensated. The guild says its members typically are paid for a single draft, though they´ll often continue to revise a film script repeatedly, in response to notes from the producers, before turning in a final document.",
        "That amounts to \"free work,\" said Keyser.\"This exploitative process suits them, and they have offered to address the issue with meetings -- knowing that such meetings have been happening for decades with zero impact,\" the guild said in a statement to Reuters.The union is seeking a guarantee of payment for rewrites -- a proposal the studios balked at, because the first writer would continue to get paid, even if a second writer is hired to doctor the script.(Reporting by Dawn Chmielewski and Lisa Richwine in Los Angeles; Edited by Kenneth Li and Jonathan Oatis)"
    ]
}