{
    "articleURL": "/wires/reuters/article-12045361/Maersk-keeps-year-guidance-unchanged-despite-lower-container-volumes.html",
    "content": [
        "By Jacob Gronholt-Pedersen",
        "COPENHAGEN, May 4 (Reuters) - Shipping group Maersk on Thursday reported first-quarter earnings above expectations and maintained its 2023 profit guidance as it expects a recent drop in demand for container shipments to stabilize around mid-year.Maersk, which transports goods for retailers and consumer companies such as Walmart, Nike and Unilever, said the number of containers it loaded onto ships between January and March fell by 9% from a year earlier, while freight rates fell by 37% on average.\"We delivered a solid financial performance in a challenging market with lower demand caused by continued destocking,\" Chief Executive Vincent Clerc said in a statement.The company saw record profits last year as a surge in consumer demand and pandemic-related logjams at ports boosted freight rates.But freight rates have since tumbled amid a global economic downturn and as pandemic-fuelled import bubbles deflate in the United States and other major consuming countries.The company said it expects global demand for shipping containers by sea to fall by as much as 2.5% as a build-up in inventories is unwound.\"Visibility remains low for the remainder of the year and moving through this market normalization, we remain focused on proactively managing costs,\" Clerc said, adding that the January to March period is expected to be the best quarter of the year.",
        "Maersk, one of the world's biggest container shippers with a market share of around 17%, kept its forecast for the full year unchanged with earnings before interest, taxation, depreciation and amortisation (EBITDA) expected between $8 billion and $11 billion, compared with a record $36.8 billion last year.Maersk said its 2023 guidance was based on \"muted\" economic growth and that the decline in container shipments will stabilize around mid-year.EBITDA fell to $3.97 billion in the quarter from $9.08 billion a year earlier, beating analysts' expectations of $3.71 billion in a Refinitiv poll. Revenues fell 26% to $14.21 billion. (Reporting by Jacob Gronholt-Pedersen and Louise Rasmussen; editing by Terje Solsvik and Kim Coghill)"
    ]
}