{
    "articleURL": "/news/article-12061317/Jackie-Os-childhood-Hamptons-home-hits-market-55-million.html",
    "content": [
        "A Hampton house once owned by Jackie O's grandfather is listed at $55 millionThe former First Lady spent her summers in the estate as a young childThe seven-acre estate has an eight-bedroom main house and a guest cottageThe Hamptons estate where Jacqueline Kennedy Onassis spent her childhood summers has been listed for sale at $55 million.",
        "The seven-acre New York estate includes an eight-bedroom main house, designed by renowned architect Arthur C. Jackson and built in 1917 for a Manhattan lawyer, George Wellington Schurman.It is now being sold by film and TV producer David Zander, who bought it from Tiffany &amp; Co.'s chief artistic officer, Reed Krakoff, in 2018 for $24 million. Since making the purchase in 2019, Zander told the Wall Street Journal he spent 'gobs and gobs' of money on a restoration, which involved more than 30 people working on the estate - among them a specialist crew of painters from Paris. ",
        "Jackie O spent summers at the property as a young child when it was owned by her grandfather, John Vernou Bouvier Jr, a Wall Street lawyer and stockbroker.Bouvier, Jr. owned the property in the 1920s and named it Lasata - a native American word meaning 'place of peace'.  Zander, who produced Spring Breakers, told the Wall Street Journal he is a collector of 'architecturally interesting' houses and that he bought it on a whim in 2017 when he fell in love with the property. He told the newspaper he was surprised by the size of the windows and large rooms which filled with light. 'For all of its beauty, it was restrained and subtle,' he said.",
        "He also said the connection between Lasata and Jackie O did not alter his appreciation of the house. 'It's a fun fact but nothing beyond that,' he told the Journal.But the Hamptons real estate agency charged with selling the house, Compass,  seemed to suggest its connection to the former First Lady enhanced its value, and in its listing described it as 'a piece of American history'.",
        "'It's so well known in town,' Eileen O'Neill of the Corcoran Group, one of the listing agents, told the Journal. 'It's such a part of East Hampton history as well as American history. So that definitely is a draw for people.' Zander commissioned the Paris-based interior designer Pierre Yovanovitch to renovate the interior and the French landscape architect Louis Benech to tend to the gardens. The estate is lined with various trees, including century-old Linden, London Planes, Cork and American Elm trees.It also has a pool and separate pool house, as well as a four-acre parcel with a grass tennis court. In addition to the main house it has a two-bedroom guest cottage and a three-car garage equipped with a workshop. ",
        "Krakoff and his wife, interior designer Delphine Krakoff, purchased the estate for $25 million in 2007. When they did, they also carried out a significant restoration.",
        "'They took it to like 91 percent and we've taken it to 150 percent,' Zander said. 'Meticulously restored in 2007 and again in 2019, the estate's integrity has been carefully preserved while infusing modern elegance,' read the listing. Zander told the Journal he was selling Lasata because he had only spent a month there since he bought it. He owns six homes across California, New York and St. Barts. 'It seems like a crazy waste,' he said."
    ]
}