{
    "articleURL": "/news/article-12046465/Civil-war-breaks-plan-chop-tree-used-Roundheads-spy-King-Charles-army.html",
    "content": [
        "There are plans to replace the ancient 'King's Spy Oak' with a three bed home But locals vehemently oppose the plans, objecting to them to Reading CouncilA battle is brewing over a developers' plan to chop down a massive 700-year-old tree that was used to spy on King Charles I's army.",
        "The ancient oak was once used as a lookout area by the Parliamentary 'Roundhead' forces to secretly watch Royalist armies during the English Civil War in April, 1643.However, there are now plans to replace the ancient 'King's Spy Oak' - which is located in Caversham, Berkshire - with a three-bed house. In fact, the plans have already been submitted by Chair Homes Ltd, despite the oak having a Tree Preservation Oder, and is designated in the Woodland Trust Ancient Tree Inventory as an Ancient Tree of National Special Interest.The developer has described the potential felling of the tree on land in Gayhurst Close as 'diseased' and of 'relatively significant ecological merit'. The development company say that they would replace the oak with two new trees - one at the front and one at the back of the proposed home - despite locals vehemently opposing the plans.",
        "On the issue of the oak tree, the agents on behalf of the applicants wrote in a planning statement: 'No buildings would be demolished to facilitate the development. The only impact would be the loss of the existing tree.'Due to the limited canopy, the species and the fact the tree is diseased and in a state of decline, the biodiversity offering of this tree is limited.",
        "'Typically, an old tree such as this Oak would have relatively significant ecological merit, however, the fact that the tree is in decline must be considered.'But the plans have been met with massive opposition from local residents, with hundreds writing their objections on Reading Council's planning portal.One local resident, Emma Bennett, says that a rotting oak tree like this one is 'a vital and increasingly rare eco-system'. Another local, Zoe Baird, said: 'Please do not allow this planning application to proceed which in the process will fell a beautiful old oak tree. This tree is valued and well documented. It is of historic significance, and to the beauty and wildlife of the local area, it adds to the well being of the community. 'The reason given of the tree being damaged and diseased is unsubstantiated and a full environmental impact assessment should be completed. The protection of our trees is essential and must be upheld by the law laid down for this purpose.'And Alison Weir put: 'I object to this application as it includes the destruction of an ancient oak tree. Trees of this age should be regarded as National Treasures, to be honoured and respected for the benefits they bring, not treated as a 'nuisance', to be removed at the whim of a landowner. We must learn to respect and preserve our natural heritage.'",
        "While another resident, Gavin Andrews, wrote: 'Objection to tree felling. This tree is of massive scientific, historical and environmental value. It would be morally reprehensible to destroy it. A crying shame that it is even being proposed.'And fellow objector Jennifer Leach said: 'The ancient tree standing on this site is exceptional - historically, ecologically, and in terms of statuesque beauty.'It would be an act of vandalism if it were to be felled for any reason; to be felled in order to make way for a highly unimaginative private dwelling squeezed into a small garden, would be the epitome of greed.'Greed was never pretty; in end times such as these, it has become ecocidal..'Local biodiversity group Reading Tree Wardens have also objected to the plans, while The Woodland Trust are also apparently planning to submit an objection.A spokesperson for Reading Tree Wardens said: 'Reading Tree Wardens strongly object to the application to build a house in a way which would result in the loss of this ancient and historic 700 year old English Oak.'The tree holds a Tree Preservation Order and is recognised by The Woodland Trust in their Ancient Tree Inventory, also having the special designation of a Tree of National Special Interest.'Ancient trees are exceptionally valuable as very few trees of any species become ancient.",
        "'They are irreplaceable - nothing can compensate for their loss which cannot be mitigated by replacement tree planting.'They added: 'By their very nature, ancient trees have areas of decay and hollowing, this only goes to enhance their biodiversity and habitat value.'The vast response to the Reading Tree Wardens' information campaign indicate that it is considered a National Treasure.'You can view the application by typing reference 221909 into the council’s planning portal. "
    ]
}