{
    "articleURL": "/wires/reuters/article-12048233/GRAINS-Chicago-wheat-closes-Black-Sea-doubts-send-one-week-high.html",
    "content": [
        "Wheat touches one-week high and closes up",
        "Cancelled China sales weigh on corn pricesTechnical personnel due to meet Friday to discuss Black Sea deal(Rewrites with market settlement; adds details of Black Sea grains deal in paragraphs 6-7, market comment in paragraph 8)By Cassandra GarrisonMEXICO CITY, May 4 (Reuters) -Chicago wheat hit a one-week high and closed up on Thursday as markets cautiously eye developments on the Black Sea grains corridor following a wave of fresh tensions between Russia and Ukraine.Corn clawed back some ground lost early in the day to close nearly flat after news of cancelled sales to China weighed on prices. Soybean futures also ended practically even after dropping earlier in the session on expected U.S. planting progress.The most-active wheat contract on the Chicago Board of Trade (CBOT) gained 5-1/4 cents to settle at $6.45 a bushel, after climbing earlier in the session to its highest level since April 26 at $6.50-3/4.Corn ended a 1/2 cent higher at $5.89 a bushel and soybeans settled up 1/4 cent at $14.17-3/4 a bushel.Technical personnel from Turkey, Russia, Ukraine, and the United Nationswill meet on Fridayto discuss a deal that allows the exports of Ukrainian grains on the Black Sea, Turkish Defence Minister Hulusi Akar said.",
        "Ukraine President Volodymyr Zelenskiy said a day earlier that Russia did not appear to be interested in extending the Black Sea grain deal, but that Kyiv was focused on looking for partners to fulfil the deal and was not looking for Russian interest.\"It will probably go down to the 23rd or 24th hour before a decision is reached,\" said Dan Smith, a senior risk manager at U.S. consultancy Top Third Ag Marketing, noting continued market anticipation.U.S. export sales of corn fell to their lowest weekly total on record, government data showed, as overseas buyers cancelled purchases made earlier in the year. The U.S. Department of Agriculture reported corn export sales were a net -194,600 tonnes, largely due to cancellations by China.Wheat and soybean export sales were in line with expectations.\"It's the lack of exports that we're seeing going forward,\" Smith added.Markets also had eyes towards the USDA's monthly World Agricultural Supply and Demand Estimates (WASDE) coming on May 12, with an expected decrease in exports. (Reporting by Cassandra Garrison in Mexico City, Naveen Thukral; Editing by Marguerita Choy)"
    ]
}