{
    "articleURL": "/news/article-12043771/Sir-Keir-wooing-Sue-Gray-four-months-unveiling-Labour-job.html",
    "content": [
        "Warnings Sir Keir's silence dealings with Ms Gray could damage public trustIt was revealed earlier Ms Gray refused to co-operate with Cabinet Office probe Sue Gray had 'multiple contacts' with Sir Keir Starmer about joining Labour while still advising ministers in government, it emerged tonight.",
        "The Labour leader faced fresh pressure to 'come clean' about the controversial poaching of the Partygate investigator, amid reports they were in secret talks for four months.Downing Street warned that Sir Keir's silence over his secret dealings with Ms Gray was damaging public trust in the impartiality of the civil service.No 10 said it was 'obviously disappointing' that Ms Gray has refused to co-operate with a Cabinet Office investigation into whether she broke civil service guidelines in talking to Labour behind ministers' backs.Rishi Sunak's spokesman also rounded on Labour for failing to clarify exactly when Sir Keir first contacted Ms Gray about the role in his top team.",
        "'It is obviously disappointing that Sue Gray was offered (the chance) to co-operate and has chosen not to do so,' she said. 'What is more disappointing is that Keir Starmer is in a position where he could clear up very quickly when contact was made by his office or by him to Sue Gray to uphold the integrity of the civil service and ensure that it is transparent and open.'Sky News reported that Sir Keir first contacted Ms Gray about becoming his chief of staff last October, more than four months before the appointment became public.",
        "A Whitehall source told the Mail that it appeared there had been 'multiple contacts' between Ms Gray and Sir Keir in the following months.",
        "'This was not just one conversation, there were multiple contacts with senior Labour figures continuing for months,' the source said. Insiders say Ms Gray was still advising the Government during this period on what information to hand over to Parliament's Partygate inquiry led by former deputy Labour leader Harriet Harman.The claim is denied by Labour. But a spokesman for Sir Keir again refused to say when talks with Ms Gray began.In a tetchy letter to the Cabinet Office, Ms Gray is said to have questioned the standing of the investigation into the circumstances surrounding her departure. Ministers believe it will show that she broke civil service guidelines. Senior civil servants are expected to get clearance from ministers before talking to opposition figures.They are also required to declare any meetings which might create the perception of a conflict of interest, and they are supposed to consult the independent Advisory Committee on Business Appointments (Acoba) before taking an outside job.'She didn't do any of that,' said one source.Tory MP Mark Jenkinson said: 'Angela Rayner tells us Sue Gray is famed for her integrity. She knows this system inside out and her lack of co-operation screams guilt to me. Perhaps it's time 'Mr Rules' himself calls out this behaviour and encourages her to come clean.'",
        "But a Labour spokesman said Ms Gray was co-operating with a separate process run by Acoba which is meant to vet the appointments of former ministers and senior officials.Labour shadow chancellor Rachel Reeves accused ministers of waging a 'vendetta' against the former civil service fixer.",
        "Ms Gray stunned Whitehall last month by quitting her civil service job to help Labour try to win the next election. The move has led to renewed questions about the impartiality of the civil service and has angered some former colleagues.Ministers are pressing for Acoba to impose the maximum two-year delay on Ms Gray taking up the role with Labour.Sir Keir's spokesman said Labour would accept the committee's ruling.But he was unable to say whether Labour would pay Ms Gray during any period of gardening leave."
    ]
}