{
    "articleURL": "/tvshowbiz/jamie-foxx/article-12043627/Jamie-Foxx-BREAKS-SILENCE-suffering-mystery-medical-emergency.html",
    "content": [
        "Foxx, 55, was taken ill in Atlanta where he was filming with Cameron DiazThe actor's family shared the news of his hospitalization last month  No details have been released about the nature of his health emergency READ MORE: 'He's getting better': Friend Kevin Hart says there is 'progression'Jamie Foxx has broken his silence after suffering a medical emergency three weeks ago which caused him to be hospitalized.",
        "The Oscar-winning actor, 55, took to Instagram on Wednesday with a post which read: 'Appreciate all the love, feeling blessed' followed by praying hands, heart and fox emojis.Foxx is at a medical facility in Georgia where he is undergoing tests after taking ill in Atlanta on April 11 - where he was filming his upcoming Netflix movie Back in Action alongside Cameron Diaz. The star also gave a shout-out to friend Nick Cannon who has filled in hosting duties for him on popular game show Beat Shazam.Jamie's daughter Corinne Foxx, 29, serves as DJ on the program but will also take leave to aid in her famous father's recovery. ",
        "Resharing a post from Corinne about Nick taking over the presenting mantle, Foxx wrote on his stories: 'Appreciate ya my boy @nickcannon, see you all soon'.Corinne will be replaced by Kelly Osbourne who shared a video from the DJ booth on set of the reality competition show recently.Sources close to Jamie recently told TMZ he 'needs all the prayers and well-wishes his fans can muster'.Last Friday, People spoke with a source who confirmed Foxx (born Eric Bishop) was 'awake and alert' in a 'Georgia medical facility.''He's OK, thank God,' the source said. 'He's still in the hospital and doctors are running tests but he's awake and alert. They're keeping him under observation.'",
        "Foxx was taken ill on April 11 in Atlanta where he is filming his upcoming Netflix movie Back in Action, alongside Cameron Diaz and Glenn Close .While his family has shared news of his health scare, they have not provided any details.",
        "However a source previously told People that Foxx was steadily improving.Fans were initially alerted about the health scare when Corinne shared a grave statement on social media earlier this month.The actress wrote, 'We wanted to share that, my father, Jamie Foxx, experienced a medical complication yesterday.'Luckily, due to quick action and great care, he is already on his way to recovery,' she continued.'We know how beloved he is and appreciate your prayers. The family asks for privacy during this time,' the statement concluded.At the time, sources confirmed to TMZ that Foxx's condition was serious enough to require him to go to a hospital.Limited details have been shared and it's unclear what symptoms the comedian may have been suffering from.",
        "CNN previously reported tests were being conducted to determine what led to his health scare and that the actor was under observation at the hospital.'They are running tests and still trying to figure out what exactly happened,' an insider said.Despite his improving condition, there's no word yet on when he will be able to leave the hospital or get back to filming.",
        "The film has been marketed as the return to acting for his co-star Diaz, whom he helped to lure out of retirement, though she reportedly plans to retire for good after a string of catastrophes on the film set.Glenn Close is also featured in the film.The hospitalization was serious enough that the actor's family came from out of town to be with him.One source told TMZ, 'He's communicating now, and that's good news,' which may imply that he was at one point unable to communicate due to the medical emergency.Foxx shares his daughter Corinne with his ex-girlfriend Connie Kline. He also has a 13-year-old daughter Annalise, whom he shares with Kristin Grannis.His latest film shoot in Atlanta appears to have been a surprisingly stressful ordeal for the Baby Driver actor, as well as his colleagues.",
        "It was reported last month that Foxx 'had an absolute meltdown' while the film was shooting in the UK, which led to the firing of multiple people.He reportedly booted an executive producer from the project, along with two directors and even his own driver.According to The Sun, one staffer was fired in relation to an apparent scam to access £33,000 in cash from the actor, which was reportedly in relation to the sale of a Rolex watch.",
        "There was even more drama when it was revealed that production was paused last month after an unexploded WWII-era bomb was discovered on the film's set in London, just before two major action scenes were set to be filmed."
    ]
}