{
    "articleURL": "/news/article-12054157/Royalists-hit-NYC-celebrate-coronation-King-Charles.html",
    "content": [
        "Early morning royalists packed into British pubs as King Charles was formally crowned KingThe Churchill pub in Manhattan was packed with locals and ex-pats looking to watch the ceremony unfold  Corks were being popped as the sun rose over the East CoastRoyal family fans in New York City celebrated King Charles coronation by flocking to English pubs and a famed tea shops in the city.  ",
        "Manhattanites witnessed King Charles' official coronation at 7am, with The Churchill Tavern in Kips Bay and Tea &amp; Sympathy cafe in Greenwich Village among popular spots to celebrate. And the early start did little to calm excitement, as thousands of champagne popping revelers headed for monarchy-themed deals and bunting-clad bars to mark the occasion. After kicking off the day in a traditional English pub, DailyMail.com has trawled through New York to showcase how the historic day was commemorated across the pond. ",
        "Corks were already popping as the sun rose over the East Coast on Saturday, with numerous New York hotspots relishing in the coronation day boost. Among the excited revelers was friends Maddie McDermott, Hannah Wall, and Christina Vientimilla, who all gathered at British restaurant Tea &amp; Sympathy for a taste of British culture with a cup of tea and scones.  The trio said that they are big fans of the Princess of Wales, Princess Charlotte, and The Crown.Maddie said: 'We tuned in towards the end - it was awesome! It was a beautiful ceremony and it was something new for us.'We’re big Kate Middleton fans, we love her, and princess Charlotte because she’s adorable.'",
        "Millie Gibbons, 23, who is originally from Suffolk, England, donned a Union Jack coat in celebration outside the tea shop. ",
        "She said: 'Charles represents a more modern turn for the monarchy which is exciting.‘You feel connected, you’re so far away from home so to be able to enjoy this ‘little England’ here is nice to have, it brings you home.‘All the celebrations back in London, you sometimes feel you miss out being out here. When the queen passed it was so eerie, but this is nice as it's very celebratory.’Earlier in the day, a large crowd gathered at The Churchill pub in Manhattan to celebrate the occasion.  British ex-pat Ben Lawson and his American wife Leslie Lynn got up at 5am to be at the pub to celebrate the ceremony. Ben said: 'We’re grateful that we’re both here to watch it. It’s a very interesting sort of feeling.'We’re grateful that we’re both here to watch it,' Ben said. 'It’s a very interesting sort of feeling. 'My grandmother is watching from the UK, and she was alive for the Queen’s coronation, and it’s a lovely feeling to know that she’s watching it, and I’m watching it with her. I'm always proud to be British.’",
        "‘I'm just terribly excited to be out here celebrating King Charles’ coronation, and we’re very proud of him,' added fellow-pub goer Jonathan Athamwood. ‘This is a celebration, so it would be rude not to libate the occasion. It’s an early pint for myself. ",
        "‘Very exciting occasion, and it’s something I will be talking to my kids about.'Herbert Westphalian, who claims he is a member of the Prussian Royal Family and is distantly related to the new King, told DailyMail.com: ‘I have been a big fan of the royal family my whole life, and we are distantly related.'At Tea &amp; Sympathy in Greenwich Village, owner Nicky Perry said she was expecting over 1000 people to come through the small boutique due to the Coronation. Speaking to DailyMail.com, she said: 'It was marvelous, the coronation boost will be mad, it will be loads and loads of customers.'",
        "American Brenda Halkias, who is a regular at the restaurant, said she loves the 'grandeur' and 'pomp' of British culture. ‘I was up at 6am watching it live,' she said. 'It’s quite pomp and circumstance, but all the years it’s been going on I really respect that tradition. I find it moving in many ways.‘I like all that grandeur, people don’t get dressed up anymore so I quite like that.'Diana Utech was up at 4am to watch the proceedings, she said: ‘Being a New Yorker, I love celebrations in the city. We do things in a big way.' ",
        "Uptown from the midtown store, droves of coronation watchers moved to Central Park to enjoy the rest of their day in the sun.",
        "Georgia native Charlie Austin, who travelled to the UK last year for the Queen's funeral, said he felt compelled to enjoy the historic event because America and the UK are still 'tied together by a common heritage'.His friend Barbara Sullivan, an American who previously liked in the UK, added: 'I thought the ceremony was so impressive! I love the pageantry. I like Charles and think he will do a good job, but I really love William and Kate.' Dressed in an all-red suit, Anne Akiri said the coronation was 'one of the best British days' during her 20 years of living in New York. 'I didn't miss the rain,' she joked. 'It was great to see all the uniforms and pageantry, but seeing all the everyday people enjoy the day was great as well.' And British mum Charlotte Mizel, who was joined by her family in the iconic park, said she 'loved' the ceremony, because of the 'new elements they introduced'. 'As a woman I really felt the presence of women in the service - and then obviously the balcony moment was a real highlight'.  ",
        "British-themed bodega Myers of Keswick has built a following in the Big Apple through its offerings of British staples including tea bags, English mustard and HP Sauce. ",
        "Providing such rarities in New York leads British ex-pats to flock to the store to pick up their long-lost favorites - and today, to celebrate the coronation from across the Atlantic. The store's social media manager Terry Gaffney was running a pop up stand outside the store, selling Coronation branded goods. She said: 'It’s busier than Christmas time, which is really saying something because we always have a line down the road for Christmas.‘This whole week has been insane. We were up early to catch the coronation, and it was beautiful.'",
        "The store was opened 1985 by husband and wife Peter and Irene Myers, with Peter being originally from Keswick, a market town in England.In 2019, Peter retired back to England and his daughter Jennifer now runs the store. "
    ]
}