{
    "articleURL": "/news/article-12052911/Megyn-Kelly-slams-Meghan-Markle-Im-glad-shes-not-going-coronation.html",
    "content": [
        "Former Fox News host Megyn Kelly savaged the Duchess of Sussex Meghan Markle on Friday's episode of her hit SiriusXM showKelly stated that she was 'glad' that Markle was not going to be attending the coronation of King Charles on SaturdayMarkle's husband, Prince Harry, is reportedly only going to spend 24 hours with his family in London before returning to LA following the ceremony Conservative firebrand Megyn Kelly came for the Duchess of Sussex Meghan Markle on the May 5th edition of her hugely popular SiriusXM show. ",
        "'I'm glad she's [Markle] not going. Who wants to sit and look at her try to pretend like she's there in any way supportive of the royal family? She hates them, despite the fact that they made her a megastar,' Kelly, 52, said. Earlier this year, it emerged that Markle, 41, would not be attending her father-in-law's coronation as king and will remain at home in California with her and Prince Harry's children, Prince Archie and Princess Lilibet. 'They gave her all this opportunity to earn millions and millions of dollars ... And gave her a royal wedding and Diana's jewels and the Queen's and all of it. She hates them, so why would we have to look at her sitting there pretending otherwise? It was annoying enough at the Queen's funeral,' the former Fox News and NBC host said. Markle attended Queen Elizabeth II's funeral in London in September 2022 alongside her family. ",
        "'[Prince Harry's] going to come – in front of that same group and I pray that they break decorum and boo him like I will be doing from my home,' she added. It has been widely reported that Prince Harry is intending to remain in London for just 24 hours around the coronation. The Duke of Sussex is intending to fly back to California straight after the historic ceremony ends tomorrow afternoon so he can make it back to see Archie on his fourth birthday.",
        "Prince Harry jetted into the UK for the coronation on a commercial American Airlines flight shocking his fellow passengers, MailOnline can reveal.Harry flew in from Los Angeles on American Airlines flight AA136, which landed at 11.23am at London Heathrow on Friday.",
        "Harry was expected to spend Friday night at Frogmore Cottage, the home that he and his wife were evicted from just days after the release of his memoir Spare.The Duke of Sussex will see his father King Charles III crowned at Westminster Abbey. But there is speculation he will have no formal role in the service and may even be sat several rows back from his brother William and other working royals.  Asked in an interview in January whether he would attend the Coronation if invited, Harry said ‘the door is always open.'Earlier this year, Kelly brought up Meghan and Harry after the pair were mocked on an episode of South Park. ",
        "The host said that being mocked on the long-running Comedy Central cartoon is a sign that it's over for them.'I feel this is a pronouncement that they have jumped the shark, they are not beloved and her hopes of running for president, reported hopes, are all but dashed,' Kelly said.Markle has become more involved in politics of late, with whispers of presidential ambitions being heard as recently as last summer. Her biographer went as far as to call a White House bid 'likely'.",
        "'That's not happening,' Kelly added. 'When 'South Park' turns on you, there's no recovering.'Creators Trey Parker and Matt Stone’s show follows the young royals, the Prince and Princess of Canada, flying around the world on a Global Privacy Tour to promote his autobiography ‘Aaargh’. "
    ]
}