{
    "articleURL": "/money/cars/article-12054031/Got-personalised-number-plate-tripled-value.html",
    "content": [
        "Private number plates are increasingly big business. Prices on many are surging, and collectors who know how to spot a winning combination of letters and numbers are making profits in the tens of thousands on a single plate. And since the DVLA started selling them in 1989, sales of the plates have raked in more than £2billion for the Treasury.",
        "Most of the six million buyers are car owners wanting to give their vehicle a bit of va-va-voom. They are also popular as a thoughtful and personal present. But a growing number are starting collections as an investment. As not all plates are seeing their value grow, here's how to spot the potential winners.Popular platesMany pick one that has special meaning to them personally, for example, with their initials or as a reminder of a particular date. But to make money from plates, you need to work out what combinations are likely to be most popular in future. With more than 64 million plates up for grabs on the DVLA website and online marketplaces, collectors need to pick carefully.Peter Johnson, managing director of online marketplace Primo Registrations, says licence plates with just one, two or three characters have proved a good investment. 'They are shooting up in value,' he says. 'In 2015, those were worth less than £10,000, but now you would be lucky if you buy one for £30,000. They are hard to get hold of and will get even scarcer over time.'Numbers that point to a year of birth are also highly sought out, he says. 'The numbers 65 to 80 would have been worth a lot in past years, but now anything between 80 and 95 sells much better because a growing number of people born between 1980 and 1995 are buying these registrations,' Johnson explains.",
        "Not surprisingly, Jody Davies, of the DVLA, adds that plates that include letters such as A and O that can easily be used in names are also very popular. 'Any with the numbers 1 to 99 are very popular, as well as round numbers or triple and quadruple numbers,' she says.Plates that feature common names command high prices and tend to hold their value because they are in short supply.The DVLA makes a limited number of plates that spell out certain words or names so as to help maximize the value of ones already sold.'A lot of people ask for their name, but some, like David or Simon, were all sold many moons ago,' Ms Davies says. 'We look for alternatives that include certain letters and numbers, but we only make a limited number for certain words or names because otherwise we risk devaluing them.'How can you buy one?Anyone can buy a new registration of their choosing to replace their existing one. The DVLA sells new number plates that have never been owned before and takes requests if there is a specific combination that you would like. If your request is accepted, it is auctioned by the DVLA, and you can bid on it.The DVLA holds nine auctions a year – three in person and six online – and there is no charge to bid. Its next auction will run online from May 10 to 16, with starting prices from £70. Bidding on some of the more alluring plates will start at £2,500, including '25I A', '82 O' and '8888 A'. A range of fresh plates issued to new cars made from September 2023, with the number 73, were made available last week. ",
        "There will be close to eight million new registrations added to circulation, with many names and words becoming available to buy for the first time. These dated registrations are issued every year. They have two letters, followed by two numbers (73 this year) and three letters at the end. For example, we will have 'HA73 VEY' spelling Harvey or 'EL73 BTH', spelling Elizabeth. To buy a private plate already in circulation – or to sell one you own – you can go to an online marketplace. Most of these, including Regtransfers.co.uk and Primo Registrations, offer free valuations. It costs £80 to transfer the plate to your car.Following the trendRegistrations that tie in with current trends, such as football, celebrity names or new car models, are also popular. The DVLA has a specialist team that comes up with such registrations to auction. For example, a recent spate of Bitcoin-related combinations were sought after by cryptocurrency fans and fetched tens of thousands of pounds. In February, the DVLA sold 'BTC 1M' for £10,000 while 'BTC 500X' went for £51,010 in May 2021.Eye-catching combinations can command huge prices. The number plate 'DEV 1L' was sold by the DVLA for £308,253 in 2021. This is the registration that appeared on Cruella De Vil's iconic car in the films 101 Dalmatians from 2016 and its sequel 102 Dalmatians. The plate was just a prop for the film but was subsequently issued.",
        "The owner of registration 'I BNK' made a whopping 743 per cent return – £66,100 profit – in just seven years. They bought it for £8,900 in 2014 and sold it on for £75,000 in 2021, according to sales company Regtransfers.co.uk.Mr Johnson, 49, who has personally invested in thousands of registrations, has made a tenfold profit on some thanks to his keen eye. He bought '49 P' for his company in 2004 for £8,000, and sold it a couple of weeks ago for £85,000. He bought the number plate 'FLA 55H' – spelling 'flash' – a couple of years ago for £10,000. It is for sale at £25,000. His favourite 'O45', which he has on his car, is on sale for a staggering £110,000 – more than double what he paid in 2020. The plate, first issued in Birmingham, is more than 120 years old.",
        "Cheeky numberThe DVLA bans number plates it deems too cheeky for Britain's roads, but many issued decades ago before strict rules were put in place are still in circulation and are passed from owner to owner.Angela Bahn, of Regtransfers.co.uk, says there are several of these legacy plates up for sale on the website, including 'ORG 45M', going for £112,500. Another, 'BOT 7OM', is on the market for £18,746.",
        "However, these plates do not make the best investments because many people consider them too embarrassing to put on their car.£65,000...on a plate!Lee Hill, 39, from Surrey, has bought hundreds of private number plates over the years and made profits of up to £65,000 on each one. 'They just don't seem to go down in value and I hate having money sitting in the bank. The plates are tangible,' he says.A recent sale bagged him £65,000 in profit for a plate that he owned for just two weeks and had just one letter and one number.Lee, who owns a company that ships super cars, currently has 20 plates, but there are four or five that he says he would never sell because he uses them on his cars and they have sentimental value. 'I have 'HII LEE', which spells my full name. Both '84 LEE' and 'LEE 84' feature my year of birth,' he says.",
        "Car insurance bills have a habit of creeping up, so comparing prices for the best deal is a wise move. New rules introduced to stop insurers bumping up renewal quotes haven't had the desired effect and it still makes sense to check for better deals on the comparison sites. We suggest:MoneySupermarket*Confused.com*GoCompare*Uswitch*Mail Finance* Also check Direct Line and Aviva, which do not appear on comparison sites.* Affiliate links: If you take out a product This is Money may earn a commission. This does not affect our editorial independence. Car insurance: can you save money? &gt; Tips to cut the cost of car insurance &gt; Beware of these sneaky car cover fees ",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}