{
    "articleURL": "/news/article-12059013/Pictured-Horrific-dog-attack-injuries-boy-7-suffered-mauled-pub-beer-garden.html",
    "content": [
        "WARNING: GRAPHIC CONTENTPaul Ciardini was bitten on the head by a large dog on Tuesday in a pub gardenThe furious family of a boy who was mauled by a dog in a pub beer garden have shared pictures of his horrific injuries after blasting the animal's owners for not handing themselves in.",
        "Paul Ciardini, seven, was bitten on the head by a large dog on Tuesday when he was playing in the garden of the Crows Nest Inn in Swanage, Dorset.His mother Wiktoria Matusiak said he was walking towards the children's play area in the garden when he was set upon by the pet, possibly a German Wirehaired Pointer. The schoolboy was bitten on top of his head and the 2in long wound was so deep his skull was exposed and required surgery.Ms Matusiak then picked her child up and rushed him inside while an ambulance was summoned. He was then airlifted to hospital. ",
        "The 29-year-old said a couple believed to be the owners ignored calls from customers to stay put until the police arrived and swiftly left with the pet.She said it was unforgivable that days after the attack the man and woman, aged in their late 40s or early 50s, had still not come forward.Ms Matusiak said: 'I can understand that they could have been in shock at seeing what had happened and that could be why they did what they did.'But you would have thought that days afterwards it would have sunk in and coming forward to see if my son is OK is absolutely wrong.'When we got to the hospital the doctors didn't have the information such as what breed of dog it was and whether it was vaccinated - information that could have assisted them.",
        "'They need to come forward because I don't want another child to be attacked by this dog.'Ms Matusiak works as bar staff at the pub. She had popped in with her son briefly to speak to her boss when Paul went off towards the play area outside.She has been told by customers that although the dog had a lead on it was not being held at the time.",
        "She said: 'He went to the kids play area while I was talking to my boss. Then I heard a scream and I saw him covered in blood on the grass screaming.'The woman was holding him and the man was with the dog. I just grabbed my son and ran inside and asked people to call an ambulance.'I could see just how deep the wound to his head was. We went into the kitchen to try and stem the blood and my boss rang the police.'She went outside and customers told her they told the couple to stay there but they just walked away. There was a lot going on at the time and nobody really saw them leave.'As well as the severe head wound, Paul also suffered bruising and bite marks to his back and side.",
        "He underwent an operation under general anaesthetic to treat the head wound and he remained in Poole Hospital for two nights.Ms Matusiak added: 'The owners couldn't have been sure how their dog would react to children yet they were sat in the garden where there is a play area for kids. They should have had the dog on the lead.'It is not my place to say whether the dog should be put down but it needs to be looked at as to whether it is safe around people.'",
        "It is thought that the couple were visitors to the area and had been staying in their own campervan at a local holiday park.Paul's aunt, Jennifer Latimer, said: 'I can't believe they still haven't been found or why they have not come forward. What kind of people are they? Absolutely shocking.'After the attack the couple took their dog and immediately left. The police are still looking for them.'This is extremely serious and is important that they find this dog. This dog was not on a lead. My nephew did not do anything to provoke the attack.'He had surgery on his head and thank god is recovering.'They need to be caught before it happens again as maybe that person/child might not be so lucky next time.'",
        "Dorset Police have issued a photo of the man and woman restraining their dog moments after the attack.The man has short cropped grey hair and was wearing black-rimmed glasses at the time.The woman has shoulder-length brown hair and was wearing a dark blue or black jacket and blue and white shorts at the time.The dog is believed to be either a German wirehaired pointer or an Italian spinone breed. It has brown and white shaggy fur.A spokesman for Dorset Police said that there was 'no further update at this time and our enquiries remain ongoing'.PC Alistair James, of Purbeck Police, said: 'This was understandably a distressing incident for the young boy involved and his family and we hope he makes a full recovery from his injury.'We are conducting enquiries into this matter and have obtained an image of a man and woman with the dog that was believed to be involved.'We are keen to speak to these people so we can take their account of what happened.'I would urge anyone with information relating to their identity to please come forward. I would also ask the man and woman pictured to please do the right thing and come forward.'I would also like to hear from any witnesses to the incident who have not already spoken to police.'",
        "The attack took place at about 5.10pm on May 2."
    ]
}