{
    "articleURL": "/sport/football/article-12045271/Pep-Guardiola-AGREES-Sam-Allardyces-claim-good-Jurgen-Klopp.html",
    "content": [
        "Sam Allardyce has been made Leeds manager in bid to save club from relegationIn first interview as boss he said he's as good as Pep Guardiola and Jurgen Klopp Guardiola said he is right and there's a preference to favour young managersPep Guardiola agrees with Sam Allardyce's assertion that he is as good as him as the Manchester City boss launched a defence of experienced English managers.",
        "Embattled Leeds raised eyebrows this week by turning to the 68-year-old Allardyce in a last-ditch attempt to stave off relegation.Allardyce's unveiling on Wednesday was similarly surprising as he claimed 'there's nobody ahead of me in football terms - not Pep, not (Jurgen) Klopp, not (Mikel) Arteta'.The new Leeds boss will get a chance to show that on Saturday afternoon when his relegation-threatened side travel to treble-chasing City.Allardyce's comments were put to Guardiola after Wednesday's 3-0 win against West Ham and elicited a surprisingly positive response.",
        "'He is right,' the City boss said. 'I want to be honest. Now look what happened with, for example, Neil Warnock in Huddersfield.'Now there's a tendency for these incredible managers, they have done this Premier League or this competition in better position.'It looks like now the young managers are there with the tactics or whatever... so they are really good, they help us to be what we are.'Look at the managers, Roy Hodgson for Crystal Palace, what they have done.'They are really good, they have incredible experience, they know the game perfectly and if he feels that it is because of this.'It will be tough because he has the charisma, he will put out the pressure to the players and he knows exactly what to do in this kind of situation in a relegation battle.",
        "'It looks like this type of old managers... I'm honest, so what they have done for the club (is dismissed as) 'they are old, whatever'.'Now the people who are 35, 40, 45, we invent football or we create football.'No, football is already created and these guys belong to that league and helped us to do it and that's why.",
        "'So, Neil Warnock, Huddersfield was in the last (spot) and now already out of the dangerous positions.'I could not experience what Harry Redknapp has done in this country.'There are many, many English managers that have done really, really well.'You don't have to be young to be a good manager. As much experience you have, you are good.'"
    ]
}