{
    "articleURL": "/wires/aap/article-12054127/Waratahs-leapfrog-Reds-Super-derby-win.html",
    "content": [
        "The NSW Waratahs have taken an important step in a race for the last three Super Rugby Pacific finals berths by leapfrogging interstate rivals Queensland with a 32-24 victory.",
        "Darren Coleman's side spoke about addressing inconsistencies in the lead-up to Saturday's contest in Townsville and their second-half performance had the coach pleased after shutting out the Reds for almost the entirety of the half.Their victory ended a four-game slide against their rivals.\"We pride ourselves on being able to represent our people and our state well,\" Coleman said after the win.\"I challenged the boys at halftime to get a bit between our teeth ... I wanted our team to show more spirit and show more fight.\"Then we played some good footy on top of it - our ad-lib footy was awesome.\"Following a tug-of-war opening 40 minutes and with the score at 17-17, the Waratahs did as they had in the first half and found points early.In a certain club try of the year moment, the 'Tahs attacked from within their own territory in the 45th minute via a Max Jorgensen break.Jake Gordon's offload off the ground found Lalakai Foketi who goose-stepped the covering defence before Ben Donaldson converted.The Reds had their chances for a swift reply but errors proved costly in what were clear point-scoring opportunities.A swift right-edge play cut the Waratahs to shreds before several phases led to a two-on-one for Jordan Petaia whose pass missed his man and found the touchline.",
        "The men in sky blue had no issues when presented another attacking opportunity, this time Harry Johnson-Holmes scoring after consecutive maul attempts.Donaldson's penalty four minutes from time put the margin well beyond doubt before a late Peni Ravai try sweetened the deficit for Queensland.Fixtures don't get much easier for Brad Thorn's Reds with a daunting away trip to competition leaders Waikato Chiefs next week before a tough task against the Auckland Blues at home.\"They're looking strong aren't they?\" Thorn said of their looming fixture against the undefeated Chiefs.\"We've got a tough assignment there so we've got to lick our wounds, take your learnings and there's still four games to go.\"His side enjoyed more than half the possession, territory and also led the run metres by over 100 at the break but found themselves down early on.Waratahs hooker David Porecki opened the scoring in the sixth minute from a five-metre maul before the Reds did the exact same six minutes later with his opposite number Matt Faessler reeling off the back of one of their own.Taleni Niu was next to cross for the 'Tahs after a kick behind the defensive line forced a five-metre scrum and the big flanker showed good footwork to spin and score.",
        "Six minutes from the break Suliasi Vunivalu burrowed over from the base of a ruck after his side managed 12 phases inside their opposition's 22m line to give the hosts their first lead.A bruising back-rower duel between Langi Gleeson and Harry Wilson was the highlight of a physical first-half contest that saw neither side willing to attack from within their own halves until fatigue set-in late.With the win, the Waratahs secured consecutive victories for the first time this season."
    ]
}