{
    "articleURL": "/wires/afp/article-12050469/Maduro-accuses-Biden-administration-looting-Venezuelan-oil-firm.html",
    "content": [
        "Venezuelan President Nicolas Maduro on Thursday accused US President Joe Biden's government of \"looting\" over the proposed sale of Caracas' most valuable overseas asset, oil refiner Citgo.",
        "A court in the US state of Delaware ruled that shares of Citgo, a subsidiary of Venezuelan state oil company PDVSA, can be sold to pay off its creditors, with the US Treasury Department's Office of Foreign Assets Control endorsing the move on Monday.\"What Joe Biden's government is doing is one of the thefts, one of the biggest lootings that has ever taken place against any nation in the world and we reject it,\" Maduro said during an event in Caracas.Venezuelan Vice President Delcy Rodriguez indicated Wednesday that the acts \"are absolutely null and void,\" while accusing Washington of green-lighting the \"judicial auction of Citgo.\"Maduro's 2018 reelection was not recognized by Washington, which considers the results of those polls fraudulent, and for some time recognized opposition candidate Juan Guaido as the country's leader.The next year, Washington ramped up sanctions against Caracas, which were first imposed in 2015 over the brutal repression of anti-government protests.On Thursday, Maduro also pointed the finger at Guaido -- who last month arrived in the United States -- saying he had backed the sale of Citgo.After a summit in Colombia, delegations from 20 countries -- including the United States -- said they favored easing sanctions on Venezuela, if its government committed to holding elections with guarantees for the opposition in 2024.",
        "Maduro said the Citgo decision was an attempt to undermine those efforts, spearheaded by Colombian President Gustavo Petro.The Citgo case dates from 2011, when the Venezuelan government seized a mine awarded to Canadian firm Crystallex, but then failed to repay $1.2 billion to the company, which was agreed in international arbitration.Other creditors have tried to go after Houston-based Citgo to settle debts that the cash-strapped government in Caracas is unable or unwilling to pay."
    ]
}