{
    "articleURL": "/tvshowbiz/article-12057297/North-West-leads-mom-Kim-Kardashian-aunts-Khloe-Kylie-dance-train-cute-TikTok.html",
    "content": [
        "Kim Kardashian and her daughter North created their own dance train in a cute TikTok video on Saturday.",
        "Kim, 42, who was spotted at an NBA playoff game recently, let North, nine, take the lead in the nine-second clip on the Kim and North account, Kim's sisters Khloé Kardashian, 38, and Kylie Jenner, 25, joining in.North stood at the front of the line, wearing black shorts, a black T-shirt and slide sandals.The grade schooler's hair was straight and styled in high pig tails.Kylie was second in line, donning a strapless black dress with an A-line skirt and black socks.",
        "The Kylie Beauty founder styled her long dark hair in a loose bun and seemed to be wearing natural makeup with a neutral red lip.Kim showed off her toned curves in a white tank top and faded wide leg jeans that appeared to be pieced together from two vintage pairs, with a waistband and pockets at the mid-thigh level.The Skims founders long dark hair was styled in a sleek chignon and she wore natural-looking makeup with a smoky eye.Khloé took up the rear, showcasing her pert derriere in distressed bootcut jeans and a white long-sleeve top.Her long blonde hair was styled straight, and she upped the cool factor with shades and a bold red lip. The family quartet grooved by moving their legs in a simulated walk, leaning back and forth to the beat of a sped up track from Kendrick Lamar's Money Trees.",
        "The group appeared to be wearing the same outfits they wore to the lavish Firefighter themed birthday Kim threw for her son Psalm's fourth birthday on Saturday. The video was likely shot before or after the fete.The Skims founder went all out for the celebration, providing personalized firefighter jackets for guests. ",
        "The party planners created a child size firehouse to in keeping with the theme.Decorations included a locker for Psalm and a bunk bed. Real firefighters were on hand to add an air of authenticity.Kids and adults seemed to enjoy going on a ride on a fire engine before digging into treats that included pizza, ice cream and a variety of cupcakes."
    ]
}