{
    "articleURL": "/tvshowbiz/article-12054309/Carol-Vordermans-PT-reveals-secrets-helped-Im-Celeb-star-shape.html",
    "content": [
        "Carol Vorderman's personal trainer has revealed the secrets which helped to get her in shape.",
        "The I'm A Celeb star's phenomenal frame has wowed fans who have tuned in to see her take part in the All Stars series in South Africa.Carol, 62, hired former professional rugby player Mel Deane -  who has trained everyone from Niall Horan to Jamie Dornan - back in October.The former Countdown star previously revealed that she trains with her PT four times per week, and has branded the gym her 'happy place.'Carol regularly shares glimpses of her workouts to Instagram, which includes lifting heavy weights to strengthen and tone her body.",
        "On Mel's official website, he reveals that 'variation' is one of the main secrets to achieving a toned physique.The fitness pro tells prospective clients: 'I adapt techniques proven in professional sport and remedial therapy into templates which enable individuals and groups, both male and female, to achieve their fitness goals.'Adapting high-level professional approaches to the needs of people at different levels is the most effective way to bring people to their target levels of fitness. 'Each session is specifically designed to meet individual needs – and a vast array of goals and fitness objectives are catered for and can be accommodated. 'Variation is one of the keys to success, so no two sessions will ever be exactly the same.' ",
        "Mel - who is Rio and Kate Ferdinand's favourite coach - previously played professional rugby for Richmond, Sale Sharks, Harlequins, Connacht and Ireland A.  He graduated from Brunel University with a BSc Sports Science degree and has since worked towards a series of level one and two coaching qualifications.Mel has also bossed about Kirsty Gallacher, Katherine Jenkins and Nick Frost in the gym. ",
        "It comes after Carol left viewers in hysterics on Tuesday night's episode of I'm A Celebrity South Africa as she claimed she has 'Britain's most buoyant bottom'.She was taking part in a terrifying underwater challenge 'Tanks of Torment' that saw her swim through sea creatures to gain stars and meals for the camp.Carol was joined by Olympic athlete Fatima Whitbread, also 62, who showed off her almighty strength by using a lever to raise up trapdoors for Carol to swim through.Before starting the challenge, Carol confessed that an unusual problem could likely impair her in the task, telling  a very amused Ant and Dec: 'The only problem I really have is, right, my bottom always floats to the top. It's the most buoyant thing in Britain!'"
    ]
}