{
    "articleURL": "/tvshowbiz/article-12053301/Kim-Kardashian-flaunts-curvaceous-assets-sexy-black-vinyl-dress-NYC.html",
    "content": [
        "Kim Kardashian brought major sex appeal to a Manhattan birthday party on Friday night by turning up in a skintight black vinyl dress.",
        "The 42-year-old bombshell – who kicked off the week by draping her killer body in pearls for the Met Gala – arrived at Cipriani Soho with her mother Kris Jenner to celebrate the 31st birthday of billionaire scion Alexandre Arnault.Kardashian's sexy look hugged her curvaceous assets and featured a thigh-high slit and a chocker neckline.Spaghetti straps added extra edge to Kim's stilettos while her glam brought out the intensity of her plump pout and dark eyes.The reality star's raven hair was slicked back in a tight bun and she carried a small black leather clutch.",
        "Kim's mother Kris looked chic and classic in her elegant black getup.The momager's dress featured flashy embellishments on both arms and she kept the rest of her look simple with minimal jewelry.The pair were attending the bash of Alexandre Arnault – the son of french tycoon Bernard Arnault, who is estimated to be worth somewhere in the realm of $230 billion. The Arnaults own many of the world's most iconic luxury goods, from liquor brands like Moet &amp; Chandon champagne and Hennessy cognac, to legendary fashion houses such as Louis Vuitton, Christian Dior and Fendi, just to name few.They also control jewelry powerhouses Tiffany &amp; Co and Bulgari, and have amassed one of the largest private art collections in the world.",
        "Kim's glitzy evening with one of the richest heirs on the planet comes after her show-stopping appearance at the Met Gala on Monday night.The bombshell did not disappoint in her white pearl creation, and her reunion with Pete Davidson became one of the most talked about moments. Kim and Pete's chat appeared to be cordial, which was later confirmed by a source who said that the playboy funnyman acted like a 'gentleman.'",
        "Speaking to Entertainment Tonight, the source said: 'They both really respect each other and there are zero hard feelings.'The source added: 'He knows Kim was looking to have fun when they dated, and he was totally fine with it. He also enjoyed their time together.' The former couple's nine-month relationship took Hollywood by storm last year when Kim jumped into a high-profile rebound with the playboy funnyman. Pete was the reality star's first fling after her marriage collapsed to Kanye West, and even though their whirlwind romance was short-lived, a source said that the SNL alum still considers the bombshell to be a 'great person.'"
    ]
}