{
    "articleURL": "/news/article-12044253/PM-faces-test-local-elections-good-bad-night-major-parties.html",
    "content": [
        "Losing fewer than 500 seats overall would be a good night for the ConservativesMeanwhile, Labour will be hoping to gain 700 seats at Thursday's elections Rishi Sunak faces his first major test with voters in today's local elections, with around 27.6million people eligible to cast ballots across 230 councils.",
        "So, with 8,057 council seats up for grabs, what would a good or bad night look like for the major parties?TORIESGood night: Losing fewer than 500 seats overall would leave them feeling relatively unscathed and be considered a success, given how low they plummeted in the polls after Liz Truss's premiership. Even at 500 to 750 net losses, they could say that Labour is not performing as well at the ballot box as the polls suggest and that it is all to play for at the next general election.Either of these results would be considerably below previous predictions that they could haemorrhage 1,000 seats. A narrowing in the polls suggests it is achievable.Following Ms Truss's premiership, the party plummeted so low in the polls that they faced losing up to 2,000 seats – meaning it would also point to a major turn-around by Mr Sunak.",
        "Bad night: Losing 1,000 or more seats would be difficult to spin as anything other than a bad defeat. It would suggest that the party is far off where it needs to be to win the next general election, expected to be in autumn 2024.The tally would also be close to the more than 1,300 seats the Tories lost the last time today's councils were fought over in 2019, when Theresa May was PM.",
        "LABOURGood night: Gaining 700 seats or more as it would be the party's best local election performance for at least ten years. ",
        "It would suggest it is on course to win the keys to Downing Street, even if short of an outright majority. Gains of 450 seats or more would also be a little better than last year and could be spun as a decent result.Bad night: Gaining just 250 seats or fewer.This would not reflect their lead in the polls and suggest that they will struggle to win back Red Wall voters at the next general election. Fewer than 150 would effectively be a step backwards.LIBERAL DEMOCRATSGood night: Gaining 150 or more seats, particularly in Conservative vs Lib Dem battlegrounds. This would suggest they could steal constituencies from the Tories at the general election in middle class shires.Fifty to 100 would represent modest progress.Bad night: Fewer than 50 would suggest voters have put trust back in the Tories."
    ]
}