{
    "articleURL": "/wires/reuters/article-12060445/Mexican-officials-roll-investment-plans-southern-corridor.html",
    "content": [
        "By Kylie Madry",
        "MEXICO CITY, May 8 (Reuters) - The Mexican government on Monday set out fresh details of a plan to attract businesses to a corridor straddling a narrow isthmus of southern Mexico, part of a larger push to pump investment into the relatively poor region.The plan, called the Inter-Oceanic Corridor, will include 10 new industrial parks along the stretch connecting the Pacific port of Salina Cruz in Oaxaca state with the Gulf coast hub of Coatzacoalcos in Veracruz state, officials said.The government will provide incentives for companies who set up business in the parks, including waiving taxes on rent and value-added taxes (VAT), in return for creating a minimum number of jobs, the economy ministry said.Officials also hinted at plans to construct four wind plants across the area, home to major installations of state-run oil company Pemex. They did not provide further details.The scheme, which aims to encourage manufacturing in poorer states rather than northern and central industrial hubs, is a priority for President Andres Manuel Lopez Obrador, complementing his plan for a transoceanic freight rail line.\"A big worry of this administration has been focused on lowering the asymmetries between north and south,\" Economy Minister Raquel Buenrostro said at a presentation of the plan.Another reason to push manufacturing to the south is that the north - which benefits from its proximity with the United States - is facing a drought, officials say.",
        "Buenrostro noted that Lopez Obrador would soon issue a decree altering rules for water-usage concessions in areas - including the north - where the resource is scarce, and decide which companies should receive exemptions.The industrial parks plan will be pitched to firms from the United States, Canada, Taiwan and Germany, among others who may wish to bid, Buenrostro added, with auto makers, tech companies, and semiconductor producers tipped as potential park investors.The project's anchor project, the freight rail line linking Mexico's Pacific and Gulf coasts, is scheduled to be finished this year and ultimately aims to compete with the Panama Canal as a channel to move goods. (Reporting by Kylie Madry; Writing by Brendan O'Boyle and Kylie Madry; Editing by Bill Berkrot and Stephen Coates)"
    ]
}