{
    "articleURL": "/wires/aap/article-12058051/Simmons-Baynes-miss-Boomers-18-man-Cup-squad.html",
    "content": [
        "Ben Simmons' bad back is all that's stopping him from a World Cup appearance but veteran centre Aron Baynes' Boomers career appears over after his omission from Brian Goorjian's 18-man extended squad.",
        "Three-time NBA All-Star Simmons missed the late stages of the NBA season with Brooklyn due to a back complaint and has become one of the sport's most divisive figures since a messy trade from Philadelphia.But Goorjian is adamant the versatile talent would add to a stacked World Cup side that could include 10 active NBA players even without him as they look to improve on a gut-wrenching fourth place in China four years ago.Simmons wasn't named in Monday's 18-man squad but, if fit, could still take part in a pre-tournament camp in Cairns and then suit up in Japan for their first game on August 25.\"He definitely wants to be a part of this and is working right now to get healthy,\" Goorjian told SEN of the prospect of Simmons ending a nine-year Boomers absence.\"We've made a spot for him if he's available by the time of the Cairns camp, we'll put him in there and give him a good look.\"The communication's been really good ... I'm preparing with what we have here. I'm not dependent but I'm hopeful.\"It's good for us, it's good for him ... I know he's working hard.\"Former NBA champion Baynes was badly injured during the Boomers' Tokyo Olympics campaign, but recovered to spend last season in the NBL with Brisbane.",
        "\"He's been a great Boomer,\" Goorjian said of the 36-year-old. \"There's some young ones coming into it and it's about the time for Aron.\"Opportunity knocks for the next man.\"There are more current NBA players in the squad than ever before, including Oklahoma City star Josh Giddey, veteran guard Matthew Dellavedova and NBL MVP Xavier Cooks.Giddey was cut from the Tokyo team that won a breakthrough bronze but has put up historic numbers for the Thunder in two NBA seasons since, while Dyson Daniels also impressed in his maiden NBA season to demand inclusion.Ingles, Mills and Tokyo stand-outs Jock Landale and Matisse Thybulle have been selected, along with Dallas Mavericks swingman Josh Green, Europe-based Dante Exum and NBL sharp-shooter Chris Goulding.NBL guns Keanu Pinder, Sam Froling and William McDowell-White have been included and will provide competition for spots in the front court with Thon Maker, Nick Kay, Jack White and Duop Reath.Australia will face Finland, Germany and co-hosts Japan in Okinawa, with the champion to be crowned in the Philippines on September 10.BOOMERS EXTENDED SQUAD: Xavier Cooks, Dyson Daniels, Matthew Dellavedova, Dante Exum, Sam Froling, Josh Giddey, Chris Goulding, Josh Green, Joe Ingles, Nick Kay, Jock Landale, Thon Maker, Will McDowell-White, Patty Mills, Keanu Pinder, Duop Reath, Matisse Thybulle, Jack White."
    ]
}