{
    "articleURL": "/wires/afp/article-12050315/Iran-Syria-vow-strengthen-ties-Raisi-wraps-Damascus-visit.html",
    "content": [
        "Iran and Syria agreed to boost ties and develop economic relations, with a focus on reconstruction, as the Islamic republic's President Ebrahim Raisi on Friday concluded a landmark visit to Damascus.",
        "Tehran has been a key ally to Damascus throughout Syria's long-running civil war, offering vital economic and military assistance that has helped the Syrian government claw back most of the territory it lost at the start of the conflict.During late-night talks Thursday, Raisi and his Syrian counterpart Bashar al-Assad discussed \"ways to develop and strengthen bilateral relations\" and \"emphasised existing cooperation in the field of reconstruction\", according to a joint statement released Friday.Raisi concluded his two-day trip early Friday and had described the visit, the first by an Iranian president to Syria since 2010, as a \"turning point\" in bilateral relations.The visit positions Tehran in a leading role in Syria's reconstruction, with Assad seeking to focus on reviving his country's devastated economy and infrastructure, despite Western sanctions on both countries.The pair also expressed a \"willingness to take any action to develop commercial-economic relations\".On Thursday, Raisi said Iran and Syria had signed 15 \"cooperation documents\" that would allow \"both countries to open a new chapter in economic relations\".He also praised Syria for \"achieving victory\" in the country's war and invited Assad to officially visit Tehran.The Syrian conflict was sparked by the repression of peaceful protesters in 2011 and has killed more than 500,000 people and displaced millions.",
        "Large parts of northern Syria remain outside government control.- Diplomatic shake-up -Raisi's visit comes weeks after Iran and arch-rival Saudi Arabia agreed to restore ties, prompting regional capitals to re-engage with the internationally isolated Damascus and Tehran governments.\"Iran and Saudi Arabia are two great nations,\" Raisi said during an interview broadcast on Syrian television on Friday evening, according to an official Arabic translation provided by state news agency SANA.The restoration of ties between the countries would change and \"bring order\" to the region, Raisi said.\"We refuse to consider Saudi Arabia as an enemy or be hostile to it\".On Sunday, Arab League foreign ministers will hold an emergency meeting, discussing the conflict in Sudan and Syria's readmission to the bloc, after it was suspended in 2011 for its brutal crackdown on protesters.Raisi also said during his interview that Iran was playing a mediating role in Russian-facilitated talks aiming to normalise ties between Syria and Turkey.Moscow has encouraged renewed diplomatic relations between its Syrian ally and Ankara, which has supported rebels and the opposition in a bid to remove Assad from power.A meeting of Syrian, Iranian, Russian and Turkish foreign ministers is scheduled in the next few days in Moscow."
    ]
}