{
    "articleURL": "/sport/football/article-12045961/Why-Man-City-vs-Leeds-United-Premier-League-TV.html",
    "content": [
        "Manchester City host Leeds United in the Premier League this weekend The game will be broadcast on TV despite it taking place at 3pm on SaturdayPep Guardiola's City side will be looking to go four points clear of ArsenalPep Guardiola's Manchester City host strugglers Leeds United in the Premier League with the game set to be shown live on TV despite it taking place at 3pm on Saturday.",
        "The Citizens come into the game off the back of a 3-0 win against West Ham United last night - with Nathan Ake, Erling Haaland and Phil Foden all scoring for City. A win over Leeds this weekend will see them go four points clear of Arsenal, who face Newcastle United on Sunday. As for Leeds, the side recently appointed Sam Allardyce as their new manager after sacking Javi Gracia - who was dismissed having only won three games in 12. It followed a dramatic 24 hours at Elland Road after director of football Victor Orta was also sacked on Tuesday.Leeds come into the game off the back of a heavy 4-1 defeat to Bournemouth last weekend. The side currently sit 17th in the league table and are outside the drop zone on goal difference. Mail Sport breaks down why Manchester City's fixture with Leeds is set to be shown live on TV despite the game taking place at 3pm on a Saturday.",
        "Why is Manchester City vs Leeds on TV?City's clash with Leeds on Saturday will be broadcast live on TV despite now being a Saturday 3pm kick-off.The Premier League has been forced to overrule the blackout regulations, which prohibit fixtures between 2.45pm and 5.15pm from being broadcast on television in the United Kingdom on Saturday afternoons, owing to King Charles III's coronation.",
        "Originally, the clash between the two sides was due to take place on the Sunday.The fixture was moved back day due to City's continued participation in the Champions League.Guardiola's side is set to travel to Madrid for the first leg of their semi-final tie on Tuesday, May 9.Carlo Ancelotti's Real Madrid will then travel to Manchester on Wednesday, May 17, for the second leg.The Saturday 12:30pm slot was available, but with King Charles's coronation and a lack of police resources, it was ruled out as well as the 5.30pm kick-off.The Premier League's statement on the matter read: 'With Manchester City visiting Real Madrid in the first leg of the UEFA Champions League semi-finals on Tuesday 9 May, their home match with Leeds United has moved from Sunday 7 May to 15:00 BST on Saturday 6 May.",
        "'The match will remain live on Sky Sports in the UK, subject to further consultation with relevant stakeholders regarding Article 48.'The usual Saturday 12:30 BST UK live broadcast slot has been avoided so as not to clash with the King's Coronation.'A later kick-off is not possible due to police resourcing.'How to watchCity's clash with Leeds will be shown on Sky Sports Main Event and Sky Sports Premier League, with coverage getting underway at 2pm.",
        "The game between the two sides will also be streamed on the Sky Go app.Highlights will be uploaded to the official Sky Sports YouTube channel after the game.Mail Sport will also be providing live coverage of Manchester City vs Leeds United, so you can keep up-to-date with all the latest developments here.",
        "What happened in the reverse fixture?The two sides have already met this season, with the first fixture taking place back in December at Elland Road.Goals from Rodri and Erling Haaland secured a 3-1 win for Guardiola's men.City's result against Leeds wasn't enough to push the side into first place and left the club five points behind Arsenal.The fixture with Leeds was City's first league game following the completion of the World Cup in Qatar. "
    ]
}