{
    "articleURL": "/wires/reuters/article-12056265/Russia-keeps-missile-attacks-Ukraine-ahead-expected-Kyiv-offensive.html",
    "content": [
        "KYIV, May 7 (Reuters) - Russia kept up its missile attacks on Ukraine on Sunday ahead of a widely anticipated Ukrainian counteroffensive, targeting an industrial site in the southern Mykolaiv region, authorities said.",
        "Mykolaiv governor Vitaliy Kim said in a social media post that a building and territory belonging to an unspecified enterprise were damaged overnight after Russian long-range bombers targeted his region with five Kh-22 cruise missiles.Ukrainian air force spokesman Yuriy Ihnat told local television on Sunday morning that a total of six of those missiles had been fired at Ukraine overnight but that none had hit their targets.In the eastern Kharkiv region, at least five people were injured after an S-300 missile struck a car park in the city of Balakliya, said governor Oleh Synyehubov.Russian forces have stepped up their long-range missile strikes on civilian and infrastructure targets in recent days.Air raid alerts blared for several hours overnight into early Sunday over roughly two-thirds of Ukraine, extending from Kyiv and regions to the west of the capital through to the entire east and south.Officials in the capital Kyiv and the southeastern Dnipropetrovsk region also reported shooting down a reconnaissance and attack drone in the early hours, respectively.The overnight strikes coincided with Ukrainian and Russian media reports of multiple explosions across Russian-occupied Crimea.Baza, a Telegram channel with links to Russia's law enforcement agencies, reported that Ukraine sent a series of drones over the peninsula, with Russian air defence shooting down at least one over the port of Sevastopol.",
        "Reuters was not able to independently verify the reports.Strikes on Russian-held targets have intensified in the past two weeks, especially in Crimea. Ukraine, without confirming any role in those attacks, says destroying enemy infrastructure is preparation for a planned ground assault.Kyiv's military is widely expected to mount a counteroffensive in coming weeks to reclaim Russian-occupied territory in the east and south.In the southern city of Kherson, which Ukraine liberated last November but has been under constant Russian attack, six people were killed over the past 24 hours in a variety of strikes, said governor Oleksandr Prokudin. (Reporting by Dan Peleschuk and Lidia Kelly; Writing by Dan Peleschuk and Lidia Kelly; Editing by Hugh Lawson)"
    ]
}