{
    "articleURL": "/sport/racing/article-12055001/Kentucky-Derby-Mage-wins-149th-edition-3m-race.html",
    "content": [
        "Mage, ridden by Javier Castellano, was victorious in the 149th edition of big raceFavorite Angel Of Empire finished third in 1 1/4 miles Kentucky Derby SaturdayDailyMail.com provides all the latest international sports newsMage has won the Kentucky Derby, beating Two Phil's and favorite Angel Of Empire on Saturday evening.",
        "Around 150,000 fans turned out at Churchill Downs, Louisville, to witness the 149th edition of the $3million race.The premier event was overshadowed by the death of seven horses in the build-up to the first race of the Triple Crown. Mage, at odds of 15-1, had only one victory before covering 1 1/4 miles in 2:01.57 under jockey Javier Castellano. The three-year-old colt is trained by Gustavo Delgado.Mage was in the rear of the field at the start of the Kentucky Derby but was always traveling well. ",
        "Castellano bided his time and pulled him out wide to make a challenge heading into the turn. Mage responded and produced a turn of foot to challenge Two Phil's and kicked on with a furlong to go.Winning rider Castellano said post-win: 'I never give up. I always try to do the right thing. I'm blessed.'Trainer Delgado told NBC: 'I still can't believe it, I've lost my words. It's an amazing feeling. I have all my family here,' he told NBC.'Sometimes you have to follow your intuition, your guts, sometimes it plays out, sometimes it doesn't,' he added on purchasing the horse.'When he starts making his move I felt confident.'I just knew it was a sustained move.'The Hall of Fame jockey snapped an 0-for-15 skid in the Derby. Both he and Delgado are from Venezuela. ",
        "Forte, the early favorite, was scratched in the morning with a bruised foot, one of five horses that dropped out in the days leading to the race. ",
        "Mage paid $32.42, $14.58 and $9.08.Two Phil's returned $10.44 and $6.52 at 9-1 odds. Angel of Empire paid $4.70 to show.Mage, who finished second in the Florida Derby in his last start, had the bloodlines to win the race. He's a son of Good Magic, who finished third behind Triple Crown winner Justify in 2018. His dam, Puca, was produced by 2008 Derby winner Big Brown.He is expected to head to the second leg of the Triple Crown, the Preakness in Baltimore on May 20. "
    ]
}