{
    "articleURL": "/news/article-12041279/Extremely-rare-albino-echidna-named-Raffie-spotted-locals-warned-stay-away.html",
    "content": [
        "Albino echidna seen in central west NSW One of only a handful every spotted Locals told not approach 'Raffie' One of Australia's most rarely seen marsupials has been spotted - but locals have been warned to stay away.",
        "Bathurst Regional Council, which sits in central west NSW, posted photos of a snow white albino echidna, which an employee had come across.'We thought he is just too beautiful not to share, and particularly rare with only a handful of the mammals ever sighted in Australia,' the council wrote in the post.Council have christened the unusual animal 'Raffie' but have warned admirers not to get too close.'If you see Raffie out, please feel free to take a couple of snaps but do not approach, touch, or try and contain him,' the post said.'It is important to leave wildlife alone, as you could risk them losing their scent trail or leaving young unattended in the burrow.'",
        "Council are keeping the echidna's last-known location under wraps so it can enjoy some privacy. Geoff Hadley told the ABC he had seen Raffie on a road and decided to give him a helping hand to get across safely.'I thought it had been hit by a car originally because it just wasn't walking,' he said. Mr Hadley said it was an 'out of this world' and once in a lifetime experience.  John Grant, a spokesperson from wildlife rescue organisation WIRES, said albino echidnas are very rare but and infrequently spotted because they nocturnal. .",
        "'They're not common, that's for sure,' he said.",
        "'We get the occasional rare wallaby that you'll see that's albino [and] I know last year we got an albino kookaburra, which was pretty rare.'Raffie was certainly proving a hit online with many people commenting how 'beautiful', 'special' and 'awesome' he was under the council's post. One person wrote they had a Raffie lookalike as a tenant. 'We have a blonde one on our property (NW Tasmania). So cute,' the commentator said. "
    ]
}