{
    "articleURL": "/news/article-12059129/At-260-migrants-cross-Channel-boats-Coronation-weekend.html",
    "content": [
        "On Saturday and Sunday, the Home Office recorded 269 migrant arrivals READ: Albanian PM accuses UK of 'nervous breakdown' over Channel crisisAt least 260 migrants arrived in the UK after crossing the Channel this weekend while the rest of the country celebrated the Coronation of King Charles III, according to official figures.",
        "On Saturday and Sunday the Home Office recorded 269 migrant arrivals into the UK.The latest arrivals were seen this morning after being rescued by a Border Force vessel following a small boat incident in the Channel.The group of adults and small children, all thought to be migrants, were seen wearing life jackets and disembarking Dover earlier today.Government figures reveal that a total of 6,549 asylum seekers have crossed the Channel in 156 boats to date in 2023. In the eight days of May alone, there have already been 603 migrants arriving in the UK.",
        "Last month month saw 1,859 migrants arrive on British soil by inflatable dinghy or other small craft, making it the busiest this year, and April 22 saw 497 people undertake the perilous journey over a 24-hour period - a record day for 2023 at this stage. Last week Albanian Prime Minister Edi Rama launched another scathing attack on the UK, stating that the country was in 'a bad place' and having a 'nervous breakdown' over the flow of thousands of people from the Continent in small boats.Prime Minister Rama signed a deal with Prime Minister Rishi Sunak in December to stem the flow of illegal immigration as part of one of Sunak's key pledges but has made no secret of his dislike of incendiary rhetoric used by senior British politicians.",
        "Figures showed that at least 13,000 Albanians entered Britain on small boats last year - just under a third of all arrivals. And Albanians made up the biggest proportion of the more than 45,000 people who crossed the Channel illegally last year.At one stage last summer, they represented 60 per cent of arrivals in small boats.Thousands sought asylum, even though Albania is considered 'safe and hospitable' by the Foreign Office.Overall, 45,755 migrants undertook the treacherous journey in 2022 - a 60 per cent increase on 2021’s total of 28,526.However, officials have predicted that as many as 80,000 people could make the crossing this year.",
        "In a statement, a Home Office spokesperson said: 'The unacceptable number of people risking their lives by making these dangerous crossings is placing an unprecedented strain on our asylum system.'Our priority is to stop this illegal trade, and our Small Boats Operational Command is working alongside our French partners and other agencies to disrupt the people smugglers.'The government has gone further by introducing legislation which will ensure that those people arriving in the UK illegally are detained and promptly removed to their country of origin or a safe third country.'"
    ]
}