{
    "articleURL": "/tvshowbiz/article-12042931/Theyre-related-worlds-famous-stars-guess-celebrity-sibling.html",
    "content": [
        "No one knows what the rich and famous are truly like better than their family.",
        "Some of the most well known stars on the planet have brothers and sisters who have managed to stay largely out of the public eye.While some have used their siblings' fame to launch a podcast or garner a large social media following, others have chosen to avoid the limelight entirely. Stars like Ed Sheeran and Lewis Capaldi both have siblings working in showbusiness, although flying more under the radar than their A-list siblings.MailOnline takes a look at the lives of several of Hollywood's celebrity siblings - but can you guess who is related to who?",
        "Harry Styles' sister Gemma As the older sibling of one of the most famous pop star's in the world, Gemma Styles has carved out a successful career as a writer and podcaster.Gemma is a graduate of Sheffield Hallam University, she has her own line of sunglasses and hosts the Good Influence podcast.Being Harry's older sibling has certainly benefited Gemma's burgeoning media career as she boasts over 2.6million followers on Instagram.Gemma is in a relationship with Michal Miynowski, who shared a snap of the couple enjoying a date for Valentine's Day earlier this year.Gemma last posted about her famous brother on his birthday on February 1, writing: 'Happy birthday not-so-little brother' alongside a photo of them together.",
        "James Corden's sisters Ange and RuthComedy runs in Corden family as James' sisters Ange and Ruth co-host a podcast together called Finding The Funny.The pair describe the venture as two 'straight talking, sisters who spend half an hour a week finding the funny in the s**t that is life'.The sisters, who have appeared on This Morning together, also have day jobs with Ange working as a social worker and Ruth as a PA.Ruth previously revealed that James is actually the quietest of the three siblings, telling The Sun: 'James is probably the most introverted of the three of us. 'When we are all together Ange and I are cracking up and James is giving it the, 'Oh yeah, you two... 'course you're finding that funny'.'Obviously when he is on stage and working he has huge amounts of confidence. But I would say he is the quietest out of the three of us, which is difficult for people to understand.'",
        "David Beckham's sister JoanneDavid has a close family bond with his two sisters Joanne and Lynne.Joanne, who is the younger of the pair, resides in Essex and was previously in a relationship with Big Brother contestant Kris Donnelly.She gave birth to the couple's daughter Peggy in 2017 with proud uncle David congratulating her on Instagram.",
        "He wrote: 'Welcome to the world little Peggy So proud of my little sis and congrats @krissydonners #Daddy such a beautiful family #proudUncle@joannebeckham'.The couple split up just a few months after Peggy was born however as they were reported to have drifted apart amid the stresses of new parenthood.Joanne is also close with her nieces and nephews, with Brooklyn's wife Nicola Peltz wishing her a happy birthday in February.She wrote: 'Happy birthday @jo_jo_beckham I love you so much! I can't wait to see you so soon we miss you so so much!'",
        "Ed Sheeran's brother MatthewEd's brother Matthew Sheeran is an accomplished musician in his own right, albeit more under the radar than his famous sibling.Matthew works as a composer and has previously arranged scores for the promotion of Oscar-winning film The Shape of Water and the series Vikings.Matthew, who bears a strong resemblance to his brother, always dreamed of a career in music.He previously told Little Black Book: 'I always planned to go into composing for commercials and films after university. This was an opportunity that presented itself.'I saw three different publishing companies that were all really good, but BMG was really exceptional. It wasn’t a difficult decision. It definitely felt like the right place to go.'",
        "Matthew has worked with Ed in the past and previously co-worte a new version of Ed's UK number one single Perfect. ",
        "Lewis Capaldi's brother AnthonyWhile Lewis has been pursuing his love of music, his older brother Anthony, 28, has been plugging away at his acting career.In 2020, Anthony - who was born in Glasgow - made his big screen debut in the BBC Scotland film Haggis, which he was scouted for while working in his father Mark's fishmongers.Speaking to Glasgow Times in 2020, Anthony explained how he was captivated by the pantomime performances his parents Mark and Carol used to take them to as children.But it was only when Anthony turned 17 years old that it dawned on him that acting could be a potential career path.He explained: 'I just remembered that year I saw how happy all the actors seemed on stage.'Even after the show, they all seemed ecstatic when they were walking about. I wanted to try and give it a little shot.'",
        "Paul Mescal's siblings Nell and Donnacha Paul Mescal's siblings were thrust into the spotlight when they flew to LA to party with their brother ahead of this year's Academy Awards where he was nominated for Best Actor for Aftersun.Donnacha is currently living in New York and works in HR while Nell has enjoyed a taste of the spotlight with her music career.",
        "Nell, living in Haringey, North London, has released three singles and has a management deal with American firm Q Prime, which looks after Metallica, Muse and Foals, as well as being signed with Manchester indie label LAB Records.And after her brother was nominated for a Best Actor Oscar for his role in Aftersun, she found herself further thrust into the spotlight as fans on Twitter suddenly discovered her music, and comments quickly flooded in along the lines of 'realising Paul Mescal might not be the most talented member of his family'.Nell, who has just released her second single Homesick, has only been living in London for 17 months after dropping out of school in October 2021.At the age of 17, Nell left Ireland and lived alone for three months in Brighton, where she started her musical career.However, on returning home she found herself alienated from her former friends and decided to leave school permanently and move to London. "
    ]
}