{
    "articleURL": "/wires/ap/article-12049495/Faster-IRS-offering-better-picture-looming-debt-X-date.html",
    "content": [
        "WASHINGTON (AP) - That big infusion of cash that Congress approved last year to shape up the beleaguered IRS is having an unexpected side benefit.",
        "The funding increase has helped the agency to catch up on processing new and backlogged tax returns. And that, in turn, has allowed federal bean-counters to give policymakers a more precise picture of when the Treasury could run out of money - the so-called X-date - if the government isn't able to take on more debt.The nation is stepping uncomfortably close to an unprecedented default that could have catastrophic effects on the global economy because it is bumping up against its legal limit for borrowing. Congress and the White House have been unable to agree on a plan to lift or suspend the borrowing limit. The debt covers the gap between revenues collected by the government and the programs, projects and services it provides.In the meantime, the Treasury is using \"extraordinary measures\" to keep the U.S. from running out of cash. The X-date arrives when Treasury has exhausted those accounting workarounds.Nina Olson, a former head of the Office of the Taxpayer Advocate, said the latest X-date calculation, provided through IRS data, offers a contrast to how underfunded the agency was in previous years.During the pandemic, the IRS was so backlogged that it was still processing 2020 returns at the start of 2022.",
        "\"They have a better picture of what receipts will be,\" Olson said. IRS and Treasury spokespeople declined to comment.",
        "Treasury Secretary Janet Yellen informed Congress this week that the U.S. could default on its debt as early as June 1, if lawmakers do not raise or suspend the nation´s borrowing authority. That same day, the Congressional Budget Office reported that it, too, was able to zero in on a more accurate X-date because the IRS is \"processing tax returns more rapidly than it did last year.\"Tax and policy experts say the up-to-date IRS data is invaluable to understanding the nation's financial position as the debate over whether to raise the debt ceiling drags on.\"That, in combination with less-than-expected receipts through April, means that the Treasury´s extraordinary measures will be exhausted sooner than we previously projected,\" CBO Director Phil Swagel said in his report.The X-date is typically not a specific date - it's a time range. That's because it reflects not just the money coming into the government, but the cash that goes out. Even if the government has a better sense of tax revenues, it could have to reimburse a state government, pay a contractor or face expenses that make the X-date a moving target.Natasha Sarin, a Yale Law School professor who previously worked as a counselor for Yellen on IRS issues, said the latest tax data reveals the \"tremendous uncertainty that exists in determining the precise X-date.\"",
        "The CBO, Moody's Analytics and the private Bipartisan Policy Center all try to calculate the time frame for potential default using data on government cash flows and changes in debt. But even their leaders say that no one knows exactly when the X-date could arrive.That depends on the billions of dollars flowing in and out of federal coffers all the time.Mark Zandi, chief economist of Moody´s Analytics, said Thursday at a Senate Budget Committee hearing that he estimates the X-date to fall around June 8.The closer the nation gets to potential default, the more perilous the nation's financial standing and the more accurate X-date forecasts become, economists say. President Joe Biden has invited the top four congressional leaders to the White House on Tuesday for talks - signaling the growing fears of a default.Daleep Singh, who served as deputy national security adviser earlier in the Biden administration, said the new tax data gives credibility to Treasury's most recent assessment of the projected default date.He called the debt ceiling brinkmanship a national security issue, especially as the U.S. government's relationship becomes more strained with China, as a major creditor holding U.S. debt.\"This is a matter affecting our financial stability,\" he said. \"If we commit an unforced error, we're handing a gift to our adversaries.\""
    ]
}