{
    "articleURL": "/news/article-12059811/New-Orleans-senior-going-Cornell-inundated-10-MILLION-scholarships.html",
    "content": [
        "Dennis 'Maliq' Barnes said he was honored to be going to the Ivy League schoolBarnes applied for almost 200 schools and received offers from 186 of themThe teenager wants to study computer science and is considering law school A 16-year-old from New Orleans has decided to go to Cornell University, after receiving scholarship offers worth $10 million from 149 colleges and universities. ",
        "Dennis 'Maliq' Barnes plans to study computer science at the Ivy League school in Ithaca, New York, and said he is also considering law school.The gifted student has an impressive 4.98 grade point average and is graduating high school two years early on May 24.Barnes started applying to schools in August 2022 and was awarded a place at 186 colleges - and offered a scholarship from 149 of them.His high school, the International High School of New Orleans, said it believes the $10 million he received in scholarship offers is a record for U.S. college-bound seniors.",
        "Barnes said that he did not initially intend to set any records when he started out applying to almost 200 schools, but cranked out so many applications in order to have an array of educational and financial options.  He told CNN: 'As I applied to more schools, as my numbers went up, with the financial aid and acceptances into universities, I became intrigued.He added that when he was told he was close to the record, he 'just went for it.'The talented student also has 27 college credits through a dual enrollment program with Southern University of New Orleans.With the record-breaking number of offers the high schooler received, there was much anticipation to see which school he would choose. ",
        "Making an announcement from his high school, Barnes said: 'I have committed to attend Cornell University and intend to pursue computer science and to later move on to practice software development.'The teenager put on a red Cornell University hoodie once he made his announcement. 'Today is an exciting day for me and my family, and I look forward to working with Cornell´s College of Engineering over the course of my undergraduate education,' he continued. ",
        "He said that he chose the university as it is the 'best Ivy League for engineering.' He said he wanted to attend a school that would 'set me up for success, that would give me a quality education.'Barnes added that he is excited to explore new places by going to the New York school.  'I would like to get away from New Orleans. I love my city, but I do want to venture out and experience new things and see the new things that I haven’t seen before,' he added. The student said he hoped his story would help other prospective students realize how much academic aid is out there. Adierah Berger, the head of International High, said in a statement: 'Dennis is already a bright star and I know his star will shine even brighter when he sets foot on Cornell’s campus.'",
        "Cornell also congratulated the student in a statement, and said it looked forward to welcoming Barnes and his peers to campus in just a few months. ",
        "Barnes holds leadership positions in the National Honor Society chapter at his high school, and is also fluent in Spanish.He competed on the basketball and track-and-field teams at his school, which promoted him out of his sophomore and junior years, and then he was able to maintain an unusually high GPA.  However he has previously said he was not always top of his class.'I will say I haven't always been a straight-A student. I've always been devoted to getting my school work done and get good grades like the average child,' he told WWL-TV.'It's not normal, I know it's not of course, but I started at someplace. There's a starting point for everything. I started and then realized where I was going and as I realized the path I was heading down, I rolled my momentum and I ended up farther than I ever thought I would've been,' Barnes told the station.According to this mother, Reba Barnes, his success was to be expected.'[He] has been like this since a baby. He's always been very inquisitive, always on top of everything,' she said.",
        "He is not the only incoming college freshman from Louisiana to have made headlines for receiving a jaw-dropping number of offers.In 2019, Normandie Cormier was accepted into 139 colleges, receiving just over $9.4 million in scholarship money. She applied to schools through the Common App and the Common Black College App, which allows students to apply to hundreds of schools at once.She is now doing a masters degree at Louisiana State University and runs XollegePass, a company that advises disadvantaged students and children from low-income families on how to find academic success.At the time, Cormier sought recognition from Guinness World Records, but the institution said it could not establish a world record as higher education is structured differently around the world."
    ]
}