{
    "articleURL": "/wires/reuters/article-12049859/Jailed-deported-blacklisted-Qatars-outspoken-World-Cup-guards.html",
    "content": [
        "By Andrew Mills",
        "DOHA/MOMBASA, May 5 (Reuters) - Andrew Maganga seized the chance to work as a World Cup security guard in Qatar last year, only to be fired along with some 200 others on the last day of the tournament, jailed for protesting over wages, and deported back to his native Kenya.At home in Mombasa, he has little to show for four years working various jobs in gas-wealthy Qatar, having spent his savings paying recruitment agents and to support his family.Maganga's deportation order, seen by Reuters, cited a charge of \"labour strike\" and banned him from Qatar, which like other Gulf states forbids workers from organising and striking.\"It's a difficult moment for me, but we are hoping maybe justice will prevail,\" Maganga, 32, said.Qatar's international media office confirmed that approximately 200 employees of Stark Security, which hired Maganga, were involved in a protest in January.It also said Qatar does not \"arrest or deport workers for seeking to resolve their employment disputes\".Maganga and two former colleagues said over 200 guards were deported in January. Labour rights charity Equidem has documented the deportation of 38 former Stark Security guards to Kenya, India, Pakistan and Nepal.Stark hired Maganga on a six-month contract last October, as Qatar faced intense scrutiny over its rights record, including the treatment of workers.",
        "When Stark Security terminated Maganga, it did not comply with a legally required monthlong paid notice period, introduced in 2020 amid labour reforms.Qatar's media office said Stark would be penalized for violating the labour law. Stark's parent company, Estithmar Holdings, declined to comment on the case.Rights groups had warned that security workers were especially vulnerable during the World Cup.Qatar's World Cup organising committee declined to comment.Qatari authorities have previously described criticism of their country as unfair and misinformed, pointing to labour law reforms enacted since 2018 and accusing some critics of racism and double standards.Maganga and his fellow guards appointed leaders, demanded pay for the full six months and refused to leave Stark's housing. The firm stopped providing meals and cut off the internet, Maganga and two others said.\"They were not responding,\" Maganga said. \"We decided, let us go to the main office.\"On Jan. 23, the men boarded buses for Stark's offices. Maganga said police stopped them and forced the buses to drive to a jail where Qatar detains foreigners for deportation.Maganga said they were locked in a dormitory for a week and then, after being paid around $450 for 18 days worked in December, deported.\"We (tried) to explain our issue but it was all in vain,\" he said.",
        "Qatar's media office said the state has established \"new channels for reporting grievances,\" which labour activists criticise as favouring employers.\"Any attempt by those workers to organise even in the most informal, non-political way, gets punished and workers know that,\" said Mustafa Qadri, executive director of Equidem.\"It sends a very clear signal: 'Do what you're told, don't complain.'\" (Reporting and writing by Andrew Mills; Editing by Ghaida Ghantous and Hugh Lawson)"
    ]
}