{
    "articleURL": "/health/article-12058659/NHS-patients-getting-CANCER-record-7-2m-long-waiting-list-nations-GP-warns.html",
    "content": [
        "Latest NHS data shows there were 7.21million patients queuing for operationsProfessor Kamila Hawthorne said patients have been left feeling 'forgotten' Patients should be seen within 18 weeks but target has not been met since 2016 NHS patients are developing cancer while waiting to be treated, Britain's leading GP has warned. ",
        "Professor Kamila Hawthorne, chair of the Royal College of GPs, claimed huge delays in receiving hospital care also means Brits are left being in so much agony they can't  even climb stairs.She wants the ailing health service to adopt an Amazon-style system so patients can track exactly where they are on the record waiting list. Implementing such a system would reassure patients who are 'anxious, worried and frustrated', Professor Hawthorne said. NHS data shows there were an agonising 7.22million patients in England queuing for routine procedures in February, nearly 3m more than pre-Covid levels. ",
        "These patients include those with potential signs of cancer, heart problems or those waiting for hip or knee replacements. Speaking to The Guardian, Professor Hawthorne, said patients were witnessing their health deteriorate as a direct result of the delays in hospital care — which they were referred for.Professor Hawthorne, who represents 54,000 GPs, revealed the queues were leaving patients feeling 'helpless and forgotten'. She said: 'Patients getting sicker while they are on the waiting list is something GPs see and worry about, because the risk to the patient is so much greater. ",
        "'It's inevitable some people stuck will get sicker, because that's the nature of illness.'It could be someone awaiting a hip or knee replacement. They come and see you and say, 'it's been three months and I've heard nothing'. ",
        "'Often the waiting times for orthopaedics can be a year or two, so you know that it's going to take ages.' She added: 'Then they'll tell you their toilet is upstairs, and in order to get up there they're having to crawl. 'Or it could be that their hip or knee pain is coming to the point where they can't sleep at night. That's the kind of thing we hear.'Professor Hawthorne added that a tracker system — similar to ones used by online retailers once goods have been shipped — would 'help patients understand' where they are on the list.She said the NHS would adopt such a system in an 'ideal world'. It comes as damning data released last month revealed suspected cancer patients face a wait of up to two years for a diagnosis and a year to start treatment. At the time, charities warned the 'unacceptable' delays could give tumours time to spread, slash survival chances and make treatment more expensive. Under NHS guidelines, patients should be seen within 18 weeks once referred to a specialist.  But this treatment target has not been met since 2016. Tomorrow the government will publish its primary care recovery plan, designed to tackle the dire access issue surrounding GPs. Ministers have already announced GP practices will be given £240million for new phone systems so patients no longer face engaged tones or lengthy waits during the 8am scramble for appointments.",
        "Receptionists will also receive more training to direct callers to the medic best suited to their needs.It comes after surveys revealed public satisfaction with GPs has hit an all-time low, with patients particularly frustrated by difficulties accessing a doctor and getting through on the phone.An average-sized practice of 10,000 patients often receives more than 100 calls in the first hour every Monday but many patients could be seen by someone other than a family doctor."
    ]
}