{
    "articleURL": "/news/article-12043231/Florida-prosecutors-seek-death-penalty-man-accused-murdering-Microsoft-exec.html",
    "content": [
        "Jared Bridegan, 33, was shot execution style in February 2022 after dropping two of his children off at his ex-wife's house in Florida His ex-wife's new husband was charged with orchestrating his murder and is now facing prosecutors who are seeking the death penaltyMario Saldana-Fernandez allegedly plotted the fatal shooting in a 'cold, calculated and premeditated manner'Florida prosecutors will seek the death penalty for the man accused of plotting the brutal murder of Microsoft executive Jared Bridegan in front of his two-year-old daughter last year.",
        "Mario Saldana-Fernandez allegedly orchestrated the fatal shooting of Bridegan in a 'cold, calculated and premeditated manner without any pretense of moral or legal justification,' said prosecutors Wednesday in court.Bridegan was gunned down last year after dropping off two of his children at the Jacksonville Beach home of his ex-wife, Shanna Gardner-Fernandez, who had married Saldana-Fernandez.The father of four, 33, was shot execution style after getting out of his car to move the tire, as his toddler daughter looked on from the backseat ",
        "Bridegan and his ex were, at the time, splitting custody of their two children, but the arrangement had become increasingly contentious.Henry Tenon, a former tenant at one of Saldana-Fernandez's rental properties, was also arrested in connection with Bridegan's untimely death.Authorities said they eventually discovered several payments from Saldana-Fernandez to Tenon and that the pair communicated regularly in the months leading up to Bridegan's killing.Saldana-Fernandez was charged with first-degree murder, conspiracy to commit murder, solicitation to commit a capital felony and child abuse. In March, Tenon - who was allegedly the gunman - took a plea deal on a second-degree murder charge that required him to truthfully testify about about any co-defendants in the case.He told police that Fernandez had hired him, and is now willing to testify against him at trial. ",
        "Shanna Gardner-Fernandez remains a suspect in the case, but has not been charged. Following the murder, she moved to Washington, without her current husband.Shanna is from a wealthy Mormon family in Utah, where her relatives run the successful Stampin' Up paper company. She has denied any involvement in her ex-husband's murder, and announced that she had separated from Saldana-Fernandez.Following her ex's murder, Shanna told the Florida Times-Union that she had once asked a tattoo parlor employee if he knew someone who could make Bridegan 'disappear,' but the request was made in jest.",
        "Bridegan, who was a father of four, was driving an SUV in February 2022 with his then 2-year-old daughter Bexley in the car when he stopped because a tire was blocking his path.Police say the tire was placed there deliberately. After Bridegan exited the vehicle to move the tire, he was fatally shot as his toddler watched. She remained on the scene near her father's lifeless body for several minutes until a passerby called the cops.In addition to the twins he shared with his ex-wife, Bridegan had two more daughters with his new wife, Kristen Bridegan. "
    ]
}