{
    "articleURL": "/wires/ap/article-12044193/Lakers-withstood-Warriors-run-hope-Game-2.html",
    "content": [
        "SAN FRANCISCO (AP) - The Los Angeles Lakers expected a furious, final push by Stephen Curry, Draymond Green, Klay Thompson and the defending NBA champions. Golden State can score in bunches in literally no time at all.",
        "So Anthony Davis, LeBron James and their teammates vowed to play at maximum effort and energy from the opening tip to the final buzzer facing the Warriors and their raucous home crowd.And that's what it took to win 117-112 in a wild Game 1 of their Western Conference semifinals at Chase Center, with the Warriors making a late 14-0 run. Now, the Lakers will try to take that intensity to another level when the best-of-seven series resumes Thursday night, knowing the urgency the Warriors face.\"We just locked in for 48 minutes from the start to the finish,\" D'Angelo Russell said. \"That team´s dangerous. They shoot a lot of 3s, a lot of 3s can get you back in the game when you´re down by a few possessions. Knowing that they can explode at any time and get themselves back within one point or a one-possession game, whatever it may be, knowing that, every possession matters.\"Curry, Thompson and Jordan Poole each made six 3-pointers as the Warriors attempted 53 of them among their 106 total shots - so, yes, that's half their attempts.Davis expects Golden State to bring it at another level come Thursday.",
        "\"It's going to be a different game,\" Davis said. \"They're going to make adjustments, we're going to make adjustments, the building's probably going to be a little bit louder, obviously they don't want to go down 0-2. The crowd will be more into it.\"",
        "The Warriors will need to be, too.They realize how challenging it was to win Game 7 at Sacramento on Sunday then come right back for Game 1 of the next round two days later. Curry is counting on a more focused performance.\"We´ll make those adjustments. Understand, again, quick turnaround from Game 7 against Sac, and locking in on what the Lakers do well,\" he said. \"Confidence is high, we can bounce back.\"Finding an answer to Davis will be one of Golden State's most important tasks after he dominated on both ends of the floor with 30 points, 23 rebounds, five assists and four blocked shots. He made 9 of his first 10 field goals and finished 11 for 19.\"Great rim protector and his shot was going,\" Green said. \"I felt like he made every one of those mid-rangers he took. You´ve got to live with some of those, but I think we can do a better job individually and collectively taking some of those away.\"Steve Kerr was eager to get Golden State back into the film room Wednesday to find ways to counter the Lakers' strengths.\"I think when you start the series, you really have to go through a game to really feel it and watch the tape and figure out what possible adjustments (to make),\" Kerr said.",
        "The Lakers have won Game 1 on the road for a second straight series.\"Game 1´s always important, especially on their home floor, we wanted to be 100% locked in to try to get that one,\" guard Dennis Schröder said.James credited his team's fight.\"That´s been us since we made acquisitions with our new guys,\" he said. \"We´ve been able to be very resilient in games.\"Still, he noted, defensively against a superstar roster with so many shooters: \"We got to be better.\"LAKERS AT WARRIORSLakers lead 1-0. Game 2, 9 p.m. EDT Thursday, ESPN- NEED TO KNOW: Kevon Looney grabbed a career-high 23 rebounds in Game 1 and is the first player with four 20-plus rebound games in a postseason since Dwight Howard in 2009.Looney is averaging an NBA-leading 16.1 rebounds during these playoffs - ranked first for total rebounds (129) and offensive boards (44).- KEEP AN EYE ON: Free-throw chances. The Lakers went 25 of 29 from the line while Golden State got just six chances total in the series opener, making five. The Warriors didn´t shoot a free throw until Jordan Poole converted a three-point play 38 seconds before halftime. Davis made all eight of his free throws.Both teams committed just eight turnovers, so taking care of the ball is paramount.",
        "- PRESSURE IS ON: Warriors. Green challenged himself to be more assertive on both ends in Game 2, allowing foul trouble to affect him in the opener. Golden State is now counting on salvaging a split on its home court to avoid falling a 2-0 hole like it did in the first round against the Kings before winning in seven. The series shifts to Los Angeles for Saturday's Game 3 and then Game 4 on Monday. \"I've just got to stay out of foul trouble. It's kind of been a thing for me lately,\" Green said.- INJURY WATCH: Golden State will grab rest whenever possible, and that means few formal practices between games with only one day off this series.\"Given that the series is every other day, we won´t have anything other than walk-throughs on the off days,\" Kerr said. \"It´s kind of what the playoffs are about and then you might run into a situation where all of a sudden, you´ve got nine days off, which would be really nice.\"___AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP_Sports"
    ]
}