{
    "articleURL": "/wires/reuters/article-12058951/Bank-stocks-help-Shanghai-index-post-biggest-one-day-gains-2-months.html",
    "content": [
        "By Georgina Lee",
        "HONG KONG, MAY 8 (Reuters) - China and Hong Kong stocks rose on Monday, as banks and energy shares climbed on hopes that a rebound in the country's services consumption would benefit the sectors.** China's blue-chip CSI300 index added 1.14%, while the Shanghai Composite Index gained 1.81%. During early trade, it briefly rose above the 3,400 level - the highest in 10 months and biggest one-day percentage gain in over two months.** Hong Kong benchmark Hang Seng Index was up 1.24%, and the Hang Seng China Enterprises Index rose 1.47%.** \"Chinese banks and insurance stocks bolstered the Shanghai blue-chip index, as investors are pinning on hopes that China's consumption recovery would benefit banks' profit this year,\" said Kenny Ng, a strategist at China Everbright Securities International.** Shanghai-listed state-owned banks such as Industrial and Commercial Bank of China and Agricultural Bank of China were up 6.21% and 7.46%, respectively.** The strong performance came after mid-sized lenders China Bohai Bank, China Zheshang Bank and Hengfeng Bank on Friday reduced interest rates on some deposits by 10 basis points (bps) and 30 bps, following smaller peers.** State-owned financial stocks account for 15%-20% of the Shanghai Composite and CSI300 index weighting and nearly half of A-share earnings, according to a Bank of America report published last week.",
        "** Household consumption per capita rose 5.4% in Q1, compared with a year earlier, up from 2.4% year-on-year increase in Q4, according to a Goldman Sachs report. The increase was led by a strong services consumption rebound. ** In Hong Kong, HSBC shares rose 1.8%, the highest in two months. Last Friday, it defeated a proposal backed by its biggest Asian shareholder Ping An to break up the bank and spin out its lucrative Asian business at its annual investor meeting in Birmingham in England.** Insurer AIA also contributed to the Hang Seng's gain, up 3%.** The Hang Seng Mainland Oil &amp;amp; Gas Index rose 4.98%. China Petroleum &amp;amp; Chemical Corp surged 5.91%, a four-year high. (Reporting by Hong Kong Newsroom; editing by Uttaresh Venkateshwaran and Sohini Goswami)"
    ]
}