{
    "articleURL": "/wires/pa/article-12050867/Humpback-whale-beach-died-entanglement-creel-lines-tests-show.html",
    "content": [
        "A humpback whale which washed up at a Scottish nature reserve died after becoming tangled in creel lines, tests have suggested.",
        "The juvenile female was found dead on a sand bank at Loch Fleet nature reserve, which is about 45 miles north of Inverness on the Sutherland coast.NatureScot, which manages the reserve, reported the discovery to the Scottish Marine Animal Stranding Scheme (SMASS).Nick Davison, research associate at the scheme, said initial examinations indicate the creature “died due to entanglement in creel lines”.Humpbacks are being spotted with increasing regularity in Scottish waters, which they migrate through between their breeding grounds off Africa to their feeding grounds around Iceland and Norway.When fully grown the mammals can reach up to 56 feet (17 metres) in length and may live for around 50 years.",
        "They can weigh up to 40 tonnes, with females normally slightly larger than males.The inquisitive mammals sometimes approach boats, and can dive for up to 40 minutes. They are normally seen alone or in small groups of up to seven.Historically they were hunted by whalers, but they now face a range of threats including entanglement in fishing gear and pollution.SMASS is a dedicated research and reporting project for stranded cetaceans, pinnipeds, marine turtles and large sharks in Scotland.Stranded whales longer than 25ft (7.62m) are considered Royal Fish, with the Scottish Government having first claim on these found dead or stranded on the shoreline north of the border on behalf of the crown.",
        "If it does not want to claim it, it will speak to the local authority and environmental officers, who can then arrange to collect the carcass.Responsibility for smaller whales, as well as all porpoises, dolphins and sturgeons, lies with the local authority.The discovery at Loch Fleet came about two weeks after a minke whale washed up on a beach in North Berwick, East Lothian, which saw workers spend hours removing the nine-tonne carcass."
    ]
}