{
    "articleURL": "/money/markets/article-12038969/BP-commits-bumper-share-buyback-plan-raking-quarter-profits-4bn.html",
    "content": [
        "BP is ploughing ahead with plans to deliver billions of pounds’ worth of buybacks per year – in a bumper day for City investors.",
        "The energy giant said it was ‘committed’ to a stellar programme, with an initiative to deliver buybacks of around £3.2billion per year based on current forecasts.It announced a further share buyback yesterday, announcing it would repurchase £1.4billion worth of shares over the next three months. This follows profits of £4billion for the first three months of the year.",
        "Chief executive Bernard Looney said: ‘This has been a quarter of strong performance and strategic delivery.’But some investors were disappointed that profits did not match last year’s equivalent of £5billion. Shares slumped 8.6 per cent, or 46.05p, to 488.35p.Profits were boosted by a strong commodity trading performance. Chief financial officer Murray Auchincloss said its gas traders had made ‘the right call’ on price declines and its oil traders also had a ‘very good’ quarter.Oil prices have dipped from a peak following Russia’s invasion of Ukraine early last year.The results again saw BP come under fire, with the mammoth profits reigniting calls for energy giants to be forced to pay more tax.Energy groups have faced scrutiny over the past year after raking in monster profits while households have grappled with higher bills.BP has already forked out £800million under the existing windfall tax but yesterday politicians called for the company to be taxed more.",
        "Labour leader Sir Keir Starmer said BP’s profits were those ‘that they didn’t expect to make, these are profits that are over and above because the world price of energy is so high’.Luke Hildyard, director of the High Pay Centre think tank, said: ‘Supersized profits made by oil companies and other corporate giants overwhelmingly accrue to the super-rich.‘These huge windfalls are pure geopolitical accident.’But speaking to the media yesterday, Auchincloss added: ‘We know how difficult a time it is. We get it.’But he brushed aside calls for a tougher windfall tax, saying: ‘Taxes are for government, not us. We are not going to speculate.’",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}