{
    "articleURL": "/wires/reuters/article-12048819/Mariners-sweep-A-s-5-3-victory.html",
    "content": [
        "Kolten Wong broke a tie with a two-run single, George Kirby overcame a shaky start to throw seven effective innings, and the Seattle Mariners completed a three-game road sweep over the Oakland Athletics with a 5-3 victory Thursday afternoon.",
        "Taylor Trammell drove in three runs -- including a two-run home run -- for the Mariners, who trailed 1-0, then 3-2 before a decisive three-run fourth inning.A's starter Drew Rucinski (0-2) got the first two outs in the fourth before walking Cal Raleigh and J.P. Crawford, sandwiching a Teoscar Hernandez double, to load the bases. Trammell drew another walk to plate the tying run before Wong hit Rucinski's second pitch into center field to make it 5-3.That was the last of the game's scoring, thanks to Kirby (3-2). The right-hander rebounded from a JJ Bleday homer in the second inning and a two-hit, two-run Oakland third that featured an RBI triple by Esteury Ruiz.Kirby allowed just three more hits -- no runs -- over the duration of his seven-inning outing, in which he allowed three runs and seven hits. He walked one and struck out two.Justin Topa and Paul Sewald wrapped up Seattle's fourth straight win with a scoreless inning apiece. Sewald earned his ninth save.Trammell's homer came in the third inning, after Bleday's homer, a solo shot that was his first of the season, had given Oakland a 1-0 lead in the second. Trammell's homer was his second of the year.Rucinski was pulled with two outs in the fourth, charged with five runs on four hits and five walks in 3 2/3 innings. He struck out three.",
        "The Oakland bullpen gave its team a shot with 5 1/3 innings of three-hit, no run relief.Wong finished with two hits and Crawford scored twice for the Mariners, who had recorded 2-1 and 7-2 victories in the first two games of the series.Bleday and Ramon Laureano had two hits apiece for the A's, who completed a 1-5 homestand.--Field Level Media"
    ]
}