{
    "articleURL": "/news/article-12052243/The-frantic-race-CBS-NBC-Queen-Elizabeths-1953-coronation-US.html",
    "content": [
        "It was a high-stakes race against time, involving top-secret missions across the Atlantic, with jet bombers and fighters flying special payloads – and a chimpanzee TV star who nearly ruined it all.",
        "As royal fans around the world prepare for the coronation of King Charles III on Saturday, they can rest assured that whatever happens on the day, any backstage drama is unlikely to match what unfolded at his mother’s crowning 70 years ago.On June 2, 1953, the world turned to London’s Westminster Abbey. Elizabeth II was to be anointed as Queen to some 2.5 billion people in a moment of supreme pomp and pageantry.But while the ceremony would be steeped in 1000-year-old traditions, it would also reflect the modern post-war world: For the first time ever, the coronation was to be televised. This posed unprecedent challenges. After all, it was a time before videotape, let alone satellite transmission.But, for a US TV industry in its infancy, it was an opportunity too good to pass up.In fact, it proved to be the first great battle for supremacy between networks – at the time limited to CBS, NBC and a fledgling ABC.",
        "In 1953, around half of Americans had access to a television and, on the day, some 85 million people tuned in to watch here.In London, only the BBC was allowed inside the Abbey, with live footage made available to foreign broadcasters for free.But with no way at the time of broadcasting across the Atlantic, that live footage first had to be transferred on to movie film in the UK – and then physically transported across the ocean to be broadcast on US networks.",
        "The question was then: who could do it fastest?It was quickly apparent that newcomer ABC was too small and cash-strapped to compete, and instead arranged a deal to piggyback off the Canadian Broadcasting Corporation’s coverage (as a member of the Commonwealth, Canada received special delivery of the film by Royal Air Force jet).For CBS and NBC, however, the race was on to beat each other, and Canada – and executives from both networks traveled in secret to Britain months in advance to lay their plans.Though exact figures are not know, the expenses must have been vast.First, processing laboratories for both networks had to be set up in central London so film could be quickly developed and packaged for travel.Next was the rather bigger issue of flights.At the time, jet travel was even more in its infancy than television. There was only one type of international civilian jet plane in the world, the de Havilland Comet, all models of which were operated by British Overseas Airways Corporation (BOAC), the forerunner of British Airways.",
        "In secret, NBC made an offer to BOAC who were initially happy to rent them a Comet – but the airline later pulled out after suffering a string of setbacks, including a crash in India that killed 43 people.",
        "The only other option available, then, seemed to be to form a deal with the RAF Canberra jet bomber – which would be flying to Goose Bay, Labrador, with Canada’s copy of the BBC film – to get them to carry the CBS and NBC reels.Now, Goose Bay is a long way up the Canadian Eastern seaboard, so there would still be a dash to get the reels back down to the US.CBS and NBC both had their headquarters in New York City – but, since every minute was going to count, it was obvious they would need to get closer to the Canadian border. And attention turned further north to Boston’s Logan Airport.There, both networks spared no expense custom-building entire broadcasting facilities on site – CBS converting a hangar and NBC adapting the administration building. Meanwhile, privately owned P-51 Mustangs, the fastest propeller-driven World War II fighters, were chartered to collect the film at Goose Bay and race down to Logan.For added excitement, CBS constructed a podium right out on the runway, so that their anchor could be captured rushing up to the arriving plane to collect the film reels live on camera.And so, the stage was set for the great coronation TV race. Or at least, that’s what CBS thought.",
        "For, over at NBC, deputy news chief Charles Colledge hatched a rather ingenious plan, codename Operation Astro, in a final attempt to trounce their rival.In a great stroke of luck, it was discovered that British jet manufacturer English Electric was due to deliver one of its long-range Canberra bombers to the Venezuelan Air Force at the end of May or beginning of June. ",
        "And, with the help of a hefty financial inducement of $1000 (more than $11,000 in today’s money), NBC persuaded them to make the journey across Atlantic on the day of the coronation, with a copy of its footage onboard.Importantly, the flight was direct to Boston – cutting out the need for the change at Goose Bay, and potentially saving hours.If NBC could pull it off, they would surely win.But, sadly, it wasn’t that simple. On the day itself, disaster struck.Mid-flight, NBC were told that the Canberra bomber had developed problems with its fuel feed and had to turn back to Britain.Reluctantly, they had to accept the race from Canada to Boston was back on.Both NBC and CBS had hired some of the best racing pilots to be found – but in the end that didn’t greatly matter. For the CBS plane, piloted by Joe DeBona, managed to take off from Goose Bay at 2.02pm Eastern Time, an entire 13 minutes before NBC, whose plane was hampered by ‘ice problems’.",
        "It was a lead DeBona never lost. And, as he provided CBS with regular radio updates during the two and a half hour flight, his employers started to feel sure they would win even before he touched down in Boston at exactly 4.12pm.While the champagne was being put on ice in the CBS hangar and its news anchors – stationed in Logan’s air-traffic control tower – gave viewers excited updates on DeBona’s progress, a mood of silent despondency prevailed over at NBC.But then, one of their staff had a brainwave: bribe ABC to use the coronation footage they were getting from the Canadians.",
        "Of course, NBS would ideally not have relied upon another broadcaster – especially one in the relative TV backwater of Canada. Indeed, that was the entire reasoning for entering this elaborate transatlantic race in the first place. But, since the battle had now been all but lost to CBS, it was certainly worth a try. A hasty phone call and an offer to pay for the same TV lines from Montreal that ABC was using to obtain the footage – and, at 3.56pm, with the CBS plane still in flight,  NBC and ABC rolled out the first footage of the coronation.Against the odds, they thought they’d won.",
        "But then – again – disaster struck for NBC.The Canadian broadcaster was showing the wrong footage – of Canada’s coronation ceremonies, instead of events in London.All the while, the CBS plane edged ever closer to Boston, and NBC executives sat helpless waiting for the Canadians to roll the correct BBC footage.This was going right up to the wire.But then, at 4.17pm it was over. The London footage appeared from Canada. NBC had won by just 13 minutes.",
        "Life magazine later published a photo of four stunned CBS executives, struggling to work out how their rival was showing coronation footage while the plane carrying their footage was still in the air.In a final twist to this epic race, however, it was also later revealed that CBS actually managed to pull a fast one itself, by starting off its coronation coverage not at the beginning (as NBC had) but half-way through, closer to the actual crowning ceremony.This, they cheekily now claim, meant they were the real winner.And the US news networks weren’t alone in playing dirty tricks that day.Years later, it emerged that the secret Canberra bomber bringing the NBC film hadn’t actually developed fuel difficulties at all.Instead, the BBC had got wind of NBC’s plan and had told the British Air Ministry. Anxious to ensure the Canadians weren’t scooped by enterprising Americans, officials ordered the Canberra pilots – both members of the RAF Reserve and therefore answerable to the UK government – to return home.Meanwhile, there was also a rather bizarre row over NBC’s use of a chimpanzee during their coronation coverage.Yes – the network’s line-up of commentators included a chimp named J. Fred Muggs who was their immensely popular mascot. This incensed politicians back in the UK who denounced it as 'an insult to the Queen' and even debated the issue in parliament.It was a bizarre, but perhaps fitting end, to this mad media battle. If only Saturday’s coronation could be a fraction so exciting."
    ]
}