{
    "articleURL": "/wires/reuters/article-12044591/GRAINS-Wheat-climbs-one-week-high-Black-Sea-supply-concerns.html",
    "content": [
        "SINGAPORE, May 4 (Reuters) - Chicago wheat futures climbed to a one-week high on Thursday, as the market continued to recover from multi-month lows, after concerns over renewed tensions between Russia and Ukraine fuelled doubts on the future of a Black Sea export corridor.",
        "Corn and soybeans inched higher.FUNDAMENTALS* The most-active wheat contract on the Chicago Board of Trade (CBOT) was up 0.7% at $6.44-1/4 a bushel, as of 0017 GMT, after climbing earlier in the session to its highest since April 26. The market hit its lowest since April 2021 at $6.04 a bushel on Wednesday.* Corn rose 0.5% to $5.91-1/4 a bushel and soybeans climbed 0.1% to $14.18-1/4 a bushel.* Russia accused Ukraine on Wednesday of attacking the Kremlin with drones overnight in a failed attempt to kill President Vladimir Putin.* Later, Ukraine President Volodymyr Zelenskiy said Russia did not appear to be interested in extending the Black Sea grain deal, but that Kyiv was focused on looking for partners to fulfil the deal and was not looking for Russian interest.* However, Russia said on Wednesday it will keep talking to the United Nations about the future of the deal that allows the safe Black Sea export of Ukraine grain, but would not do anything to harm its own interests.* Egypt's state grains buyer, the General Authority for Supply Commodities, bought 655,000 tonnes of wheat in an international tender on Tuesday with cheap Russian wheat dominating the business, traders said on Wednesday.* The total is believed to involve an estimated 535,000 tonnes sourced from Russia and 120,000 tonnes from Romania.",
        "* French consultancy Agritel raised its forecast for this year's Ukrainian wheat crop to 16.34 million tonnes, from 15.04 million tonnes pegged in November, to take account of a higher-than-expected area to be harvested, it said on Wednesday.* Commodity funds were net buyers of CBOT corn, soybeans, wheat and soyoil futures contracts on Wednesday, traders said. Funds were net sellers of soymeal.MARKET NEWS* MSCI's gauge of stock markets around the world was advancing, but trading was choppy on Wednesday while U.S. Treasury yields and the U.S. dollar steepened declines after the U.S. Federal Reserve raised interest rates but indicated that it could hold off on further hikes.DATA/EVENTS (GMT) 0145 China Caixin Mfg PMI Final April 0750 France S&amp;amp;P Global Serv, Comp PMIs April 0755 Germany S&amp;amp;P Global Serv PMI April 0755 Germany S&amp;amp;P Global Comp Final PMI April 0800 EU S&amp;amp;P Global Serv, Comp Final PMIs April 0830 UK Composite PMI Final April 0830 UK Reserve Assets Total April 1215 EU ECB Refinancing Rate May 1215 EU ECB Deposit Rate May 1230 US International Trade March 1230 US Initial Jobless Clm Weekly (Reporting by Naveen Thukral; Editing by Sherry Jacob-Phillips)"
    ]
}