{
    "articleURL": "/news/article-12057287/Couple-gets-hitched-Arizona-White-Castle-brand-helped-feed-homeless-kid.html",
    "content": [
        "Jamie West and Drew Schmitt tied the knot at an Arizona White Castle on May 5West claimed White Castles were her safe haven as a 12-year-old runaway She recalled never being turned away from a meal and a place to wash up  Sliders and sliding down the aisle.  ",
        "A couple recently tied the knot at an Arizona White Castle - one the bride found as a safe haven when she was homeless as a kid.For Jamie West, saying 'I do' to her partner of 15 years Drew Schmitt at the Scottsdale fast food chain on May 5 was bittersweet. West recalled being under the care of some employees who always assured she was well-fed whenever she would stumble into the restaurant as a 12-year-old runaway from the foster system.'The first time I walked into a White Castle, the woman behind the counter goes, \"You poor thing.\" She handed me a fresh cup of water, a stack of sliders and let me use the bathroom. I got to clean my face and wash my hands,' West told PEOPLE.She added: 'I only exist today through the love and kindness of strangers who have helped me out along the way.' In true White Castle fashion, West and Schmitt hosted a medieval-themed wedding. The bride styled a blue and gold gown with a tinted-sheer cape and crown. Meanwhile, the groom wore armor and a crown with colors to match his bride.",
        "At the mere age of 4, West was put into the foster system and made her way through 94 different homes until she fled and never looked back.",
        "While in foster care she was abused, both sexually and physically, and would go days without food, West said. She referred to the first eight years of her life as a 'terrifying experience.' On a whim, she decided to take a chance on herself and climbed out of a bathroom window - for what would become her five-year homeless journey.'I realized that I wasn't going to survive the system, unless I took off on my own,' she told the news outlet.It's unclear where West stayed or how she managed to survive, but she found a safety net at a White Castle as she traveled throughout the country.'For an underage homeless kid, having any kind of safe space is life changing,' West said. 'White Castle was the only place that no matter where I was, if I saw it, I knew it was safe. I knew they'd feed me. I knew they'd have water. I knew I could use the bathroom. I never once got turned away.' ",
        "West has been a loyal customer of White Castle ever since meeting her now-husband about 15 years ago.In 2020, the two were sworn into a ritzy club created by restaurant officials in the early 2000s known as the Cravers Hall of Fame.",
        "As the two were being honored, West gave a speech about how White Castle saved her life.It was then that Schmitt got down on one knee and asked West to marry him.'I still can't talk about it without crying. It's incredible,' West told the news outlet.Now, she hopes to help others who might be in the same situation."
    ]
}