{
    "articleURL": "/tvshowbiz/article-12044413/Channel-Ten-divides-viewers-announcing-air-date-MasterChef-death-Jock-Zonfrillo.html",
    "content": [
        "Channel Ten's decision to air the new season of MasterChef following the death of judge Jock Zonfrillo has divided viewers of the cooking show.",
        "The fifteenth season had been scheduled to launch on May 1 but it was pushed back after the Scottish chef was found dead at a Melbourne hotel at 2am on Monday.Ten announced on Wednesday the new season will premiere at 7.30pm on Sunday, May 7.Some fans praised the network for continuing with the season with the family's blessing, while others said it would be difficult to watch in light of Zonfrillo's death.'This is going to be so hard to watch, but I will. His family will be in my thoughts,' one viewer wrote on Instagram.",
        "'While it will be sad knowing this is the last we will see of Jock, it'll be a great honour to see him off in his last work on TV,' another said.'Oh man, it's going to be an extremely hard watch but I wouldn't miss it,' a third viewer commented.'I was so excited for this season to start, but it's going to hurt when it ends. Give it up for Jock Zonfrillo, everybody,' another wrote.One fan said: 'Man, this'll be hard to watch. I don't know if I can.''Watching this season is going to be utterly heartbreaking. Still in total disbelief. I cannot imagine how his family must be feeling,' another agreed.",
        "Production wrapped on the 62-episode season at MasterChef HQ in Flemington, Melbourne, last month.The new season reportedly cost 'millions' to make, and producers are now looking to add a special 'tribute' episode to Zonfrillo before confirming his replacement.Zonfrillo is survived by his third wife, Lauren Fried, and his four children: grown-up daughters Ava and Sophia, from his first two marriages, and six-year-old Alfie and two-year-old Isla, with Fried.A Victoria Police spokesperson told Daily Mail Australia: 'Police attended a Lygon Street address for a welfare check and located a man deceased about 2am on May 1.'The 46-year-old man's death is not being treated as suspicious. A report will be prepared for the coroner.'Zonfrillo filmed season 15 alongside fellow judges Melissa Leong and Andy Allen, who both pulled out of their scheduled media interviews after his sudden death.Allen and Leong were locked in for several TV and radio appearances this week to promote the launch of the culinary competition.The publicity blitz had already begun on Monday morning in the hours before the network and production company Endemol Shine learned of Zonfrillo's death.",
        "Channel 10's entertainment reporter Angela Bishop was a guest on The Project on Monday evening - where Zonfrillo was scheduled to appear before his death - and said she had heard his co-stars were struggling to come to terms with the news.",
        "'It is a loss of a member of the family here at 10... [He was] only 46. That is why this is such a shocking piece of news,' Bishop said.'As you say, they would work 16-hour days together for MasterChef. You couldn't find closer work mates and confidantes.'They are devastated. 'Broken' is the word described to me. They are trying to process this news.'Zonfrillo's MasterChef colleagues did not seem to know he died until shortly before the news broke on Monday afternoon, as the publicity machine for the new season was in motion as late as 11.30am when Leong posted a countdown clock for the premiere on her Instagram account.For confidential support call the Lifeline 24-hour crisis support on 13 11 14"
    ]
}