{
    "articleURL": "/wires/ap/article-12042519/Former-World-Rugby-chairman-Bernard-Lapasset-dies-75.html",
    "content": [
        "Bernard Lapasset, the French administrator who was chairman of World Rugby for eight years and helped see the sport return to the Olympic program after a 92-year gap, has died, rugby's governing body said Wednesday. He was 75.",
        "Lapasset served two teams as World Rugby chairman from 2008-16, during which time the game worked its way back to Olympic recognition and was included - in the form of seven-a-side rugby - at the 2016 Rio de Janeiro Games.Rugby had last been part of the Olympics in 1924 as the traditional 15-a-side game. Rugby Sevens was also played at the Tokyo Games in 2021 and will again be on the program at next year's Paris Olympics.After stepping down as World Rugby chairman in 2016, Lapasset served as co-chairman of the organizing committee for the 2024 Paris Olympics and Paralympics.Lapasset was the long-serving president of the French Rugby Federation from 1991-2008.Under his guidance, France won the right to host the 2007 Rugby World Cup, a tournament World Rugby said \"broke all audience, attendance and commercial records\" and helped raise the game's profile.",
        "\"Throughout his tenure, his passion and dedication was always evident, and he was a champion of the sport´s values from the field of play to the boardroom and beyond,\" said current World Rugby chairman Bill Beaumont, who succeeded Lapasset. \"The sport can be proud of what World Rugby, its unions and the sport has achieved during his chairmanship.\"Lapasset's service to the game was recognized by numerous rugby-playing countries. He was appointed an honorary Officer of the New Zealand Order of Merit and was awarded Japan´s Grand Cordon of the Order of the Rising Sun for his role in helping Japan become the first Asian country to host the Rugby World Cup in 2019.",
        "Lapasset was given the Olympic Order last year for his contribution to the Olympic movement.___More AP rugby: https://apnews.com/hub/rugby and https://twitter.com/AP_Sports"
    ]
}