{
    "articleURL": "/news/article-12054691/The-Metropolitan-Police-said-total-52-arrests-coronation.html",
    "content": [
        "Follow our live blog for all the latest updates on the King's Coronation The Metropolitan Police made a total of 52 arrests to around the Coronation yesterday for affray, public order offences, breach of the peace and conspiracy to cause a public nuisance.",
        "The Met said it received information that protesters were 'determined to disrupt' the Coronation procession - including defacing public monuments with paint, breaching barriers and disrupting official movements. Among those arrested was Patrick Thelwell - who tried to egg the King in a visit to York on November 9 last year.The 23-year-old was convicted of threatening behaviour at York magistrates court last month and sentenced to a 12-month community order with 100 hours of unpaid work and ordered to pay £600 in court costs.Commander Karen Findlay, who lead yesterday's operation, said: 'This has been a magnificent team effort and everyone in the Met is hugely proud to have played our role.",
        "'Our first priority has been to ensure that the tens of thousands who travelled into London yesterday, and millions more around the world, were able to enjoy a safe, secure and dignified Coronation.'Our heartfelt thanks goes to everyone. I know our colleagues take great satisfaction from the warm comments from the public they have met.'But police service have been slammed by campaign groups who described the arrests as 'incredibly alarming' detentions.Protesters from the anti-monarchy group Republic, including its chief executive Graham Smith, were apprehended during the day - as well as demonstrators from Just Stop Oil and Animal Rising.",
        "Smith, who is now out of prison, declared the arrests show ther 'there is no longer a right to peaceful protest in the UK.'He continued: 'I have been told many times the monarch is there to defend our freedoms. Now our freedoms are under attack in his name.'But campaigners said the protests were 'peaceful', describing the arrests as 'a dangerous precedent for us as a democratic nation'.The force confirmed reports from Just Stop Oil that 13 demonstrators were detained on the Mall and six public nuisance arrests on St Martin's Lane following protests from Republic.In a graphic video posted by Thelwell on social media, he was shown shouting at the crowd: 'This is fascism. I am being arrested just for being here. What have I done.'",
        "Wearing a yellow 'Not My King' sticker, the ex-University of York student was held by two uniformed officers as he was escorted past a huge banner reading 'Abolish the Monarchy'.Others around him hold signs bearing republican slogans while supporters chant: 'shame on you'.Speaking on social media, the self-employed ecological landscape garener claimed: 'Today I was arrested at the Coronation on suspicion of carrying eggs. 'I was identified by facial recognition cameras, and snatched from the protest in handcuffs so tight they cut my skin. ",
        "'For the second time I was dragged through a crowd of monarchists baying for my blood.'I was searched, and when they found nothing, was released after half an hour. 'The police had to escort me back through the monarchist crowds because so many people were assaulting me.'In the run up to the Coronation, the green-fingered protestor announced his intention to go south to London from his home in Heslington, York and protest.",
        "He told his social media followers: 'I'm expecing to be arrested', York Mix reported.He later compared the UK to authoritarian Russia, saying: 'I'd love to throw eggs at Putin, and I'd support anyone who did. 'In both countries peaceful protest is now banned.Anti-monarchy activists hailed Meghan Markle as the 'People's Princess' during their protest against the Coronation yesterday.Supporters of the campaign group Republic assembled in Trafalgar Square in London to express their opposition of the crowning of King Charles III and Queen Camilla.The Met Police also arrested one for suspicion of racially aggravated behaviour, one on suspicion of sexual assault, one for possession of drugs and possession of a knife, and one for religiously aggravated behaviour.The protesters held up placards saying 'Not My King' and showing their support of Meghan who they claim is the 'Princess of our Hearts.'",
        "Meghan and her husband Prince Harry stepped down from their roles as working royals in 2020. Since then the couple has been a source of controversy for the family.The Sussexes have given a series of high-voltage interviews and starred in a Netflix docuseries which saw them take aim at the King, Camilla, Prince William and his wife, Princess Kate. ",
        "Harry, who is attending the coronation without his wife, also published a tell-all memoir in which he claimed William attacked him and claimed some members of the royal family exhibited 'unconscious bias.' Republic protesters, dressed in yellow t-shirts to make themselves stand out, gathered in Trafalager Square yesterday demanding an elected head of state.Up to 2,000 people are expected to join the protests amid fears eco-zealots could also target the historic occasion. The group, which ramped up its rallies against the King ahead the Coronation, claims the royal family has no place in a modern constitutional democracy and is staggeringly expensive to maintain. Director of Republic, Harry Stratton, told MailOnline that some of the group were cuffed by Metropolitan Police officers as they arrived at Trafalgar Square this morning. The group's megaphone-wielding chief executive Graham Smith was among those arrested, while police said they had seized multiple lock-on devices and hundreds of posters.",
        "New legislation passed this week means protesters who have an object with the intention of using it to 'lock on' are liable to a fine, with those who block roads facing 12 months in prison.Mr Stratton accused police of 'intentionally picking them out', insisting the protesters had not broken any of the rules laid out by the force in a series of meetings in recent weeks, while another campaigner claimed straps holding their placards had been 'misconstrued' as something that could be used for locking on.",
        "Footage shared on Twitter showed officers using their powers under the new Public Order Act, with a number of demonstrators in yellow 'Not My King' T-shirts having their details taken. Met Police confirmed four people were arrested on suspicion of conspiracy to cause a public nuisance on St Martin's Lane and that lock-on devices were seized.The force also said they made a number of breaching-the-peace arrests in the area of Carlton House Terrace and a further three arrests in the Wellington Arch area on suspicion of possessing articles to cause criminal damage.Just Stop Oil said approximately 13 protesters were arrested on the Mall ahead of the coronation. A spokeswoman for the campaign group said five demonstrators were also arrested at Downing Street and one at Piccadilly.",
        "Footage from the Mall showed the Just Stop Oil protesters being handcuffed and taken away by a heavy police presence.Campaign group Human Rights Watch described the arrests as 'incredibly alarming', adding: 'This is something you would expect to see in Moscow not London.'One Just Stop Oil protester Ben Larsen, 25, said he was there to see the coronation and peacefully protestGrinning at police officers, he told them: 'You've searched me and haven't found shit.'A police officer told him: 'You need to educate yourself on what peaceful protest is.'",
        "On Wednesday, Met Police said they would have an 'extremely low threshold' for protests during the coronation celebrations, and that demonstrators could expect 'swift action'.Under the controversial new Public Order Act, protesters who have an object with the intention of using it to 'lock on' are liable to a fine, with those who block roads facing 12 months in prison.Critics previously hit out at plans from the Met to use facial recognition software on crowds to assist their policing operations.An official letter warning of the new powers was sent to Republic, which said its campaign around the coronation would proceed as planned.Just after 7.30am yesterday, one woman in a Republic T-shirt was carried away by officers. Before being arrested, she said: 'We had a delivery of placards ready for the protest and then the tactical support unit questioned us as to how we we had got through the road closures.'They questioned whether what we were doing was a delivery.'They then said they found evidence of means of locking on, of items that could be used to lock on, and they arrested us.'Officers carried her away from where she had been standing outside a Tesco store.",
        "Two men who appeared to have been part of the same demonstration were carried away by officers into a marked police van.After the apparent arrests, Republic activist Luke Whiting, 26, told PA: 'Six Republic members have been arrested including the CEO as the demonstration was starting at the edge of Trafalgar Square.'It is unclear why, potentially it is because one of them was carrying a megaphone.'It is unclear exactly whether the police are using these new powers and whether they are misusing them to stop protest happening.'The policing operation will see 11,500 police on duty yesterday.Meanwhile, Prince Harry cut a solo figure as he arrived at Westminster Abbey for his father's historic coronation.The Duke of Sussex, 38, emerged this morning as he joined other members of the royal family in entering the church in central London, before being seen walking down the aisle by himself to take his seat in the third row.He was seen laughing and smiling as he walked alongside Princess Eugenie and Beatrice and their respective husbands Jack Brooksbank and Edo Mapelli Mozzi.The Prince had not been seen for over 24 hours after his arrival and accommodation plans remained shrouded in secrecy - before it emerged he had flown into the UK on a commercial American Airlines flight yesterday morning. The King's youngest son, who was expected to stay at Frogmore Cottage overnight, is invited to lunch at Buckingham Palace yesterday following the historic service, reported Sky News. It is not yet known, however, if the Duke will accept, given that he is expected to rush back to California to reunite with Meghan to celebrate their son Archie's fourth birthday. The invitation will be seen by many as an olive branch from Charles after Harry's explosive memoir Spare left several members of the Royal Family reeling - most notably his brother Prince William.",
        "Sources last month said Charles was very pleased that Harry was coming and his mood was described as 'generally quite forgiving', however, his brother William was understood to still feel betrayed and angry, particularly by the revelations in the memoirs.One source told The Telegraph that the 'gulf' between the brothers, who were once as close as siblings could be, is now so large they cannot see how their relationship can ever be repaired.When Harry and Meghan came to the UK for Queen Elizabeth's Platinum Jubilee they joined other members of the Royal Family at St Paul's Cathedral for a service of thanksgiving. But, notably and rather awkwardly, they were seated on the other side of the nave from Charles, Camilla, William and Kate.The Duke and Duchess of Sussex have been shunted away from the main seats as their rift with the Royal Family has grown.There had been hopes the Coronation could provide an opportunity for reconciliation - but as of last month, members of the Royal Family were understood not to have an appetite for it.One source told the Daily Express: 'The Royal Family are focused on planning for the historic occasion and have no appetite or time at this stage to think about reconciliation.' "
    ]
}