{
    "articleURL": "/sport/nfl/article-12057565/Packers-coach-Matt-LaFleur-credits-QB-coach-Tom-Clements-helping-Jordan-Love-make-huge-strides.html",
    "content": [
        "Love served as Aaron Rodgers backup since he was drafted No. 26 in 2020Tom Clements was also praised by Aaron Rodgers during his time in Green Bay DailyMail.com provides all the latest international sports news Green Bay Packers head coach Matt LaFleur expressed his excitement for what he has been seeing from quarterback Jordan Love under the direction of quarterbacks coach Tom Clements.",
        "'Just watching him last year. I think Jordan's made some huge strides,' LaFleur said.'I really do and I think a lot of it is a credit to Tom, and just, he knows how to train these guys. He knows how to drill them and he's very, very consistent. He doesn't sugarcoat anything. He just is matter of fact and I think there's no doubt.' Clements joined Green Bay in 2022 after coming out of retirement, two years after Love was drafted. Love and the Packers recently agreed to a new deal that was more team friendly than if the team had allowed him to play on the fifth-year option in his rookie contract.With Aaron Rodgers now enjoying life as the new signal caller for the New York Jets following a long-awaited trade that became official just before the NFL Draft, Love is needed to step up.",
        "'I asked Jordan after the season how he felt about him and he said he loved Tom, and thought he did a helluva job helping him, you know, develop over the course of the year,' LaFleur said.'For me, it was a no-brainer. It was just whether or not Tom wanted to come back, so I'm happy he wanted to be here, and you know, we're lucky to have him.'",
        "'He does a great job, too, not only with the quarterbacks but just helping out with our offense and bringing suggestions and great ideas.'You know, it's been a fun process getting to know him and just the standards that he holds, that room, too, and he does a helluva job.' Before his departure Rodgers was also fond of being coached by Clements, according to LaFleur.'Aaron would praise him and give him so much credit in his own development,' LeFleur said. 'I think anytime you got a player like that, especially of that talent and how much you respect a guy like Aaron, you always listen to that.' ",
        "Love has played sparingly since entering the league in 2020 and spending majority of his time a Rodgers backup until he was finally elevated to the starting position this year.The comments from LaFleur, along with ones made by Clements back in December however indicate that the coaching staff feel Love is ready to step up and replace one of the franchise's all-time greats.'He's probably getting to the point where the game has slowed down for him,' Clements said in December. 'When that happens, you kind of see things in slow motion.' 'You see where guys are moving, you see where guys should go, and you're able to react quickly... His footwork, rhythm and getting the ball off on time is where he's gotten a lot better.' "
    ]
}