{
    "articleURL": "/wires/ap/article-12048631/US-womens-hockey-contract-lags-Canada.html",
    "content": [
        "United States women´s hockey players have fallen behind their Canadian rivals in terms of compensation, two people with direct knowledge of each national team's contracts revealed to The Associated Press this week.",
        "Not only do the Canadian players share from a larger pool of funds than their U.S. counterparts, Hockey Canada also allots an additional pool of money for up to as many as five developmental players beyond its 23-women national team roster, the people said.Under terms of its three-year deal, USA Hockey limits its monetary pool to its 23-player roster, the people added. This is considered a sticking point for non-rostered U.S. players, who have fewer resources to continue pursuing hockey.Both people spoke to The AP on condition of anonymity because USA Hockey´s contract includes a confidentiality clause to not share the information with a third party. USA Hockey confirmed a contract was signed in January, but declined further comment.The contents of USA Hockey´s contract were revealed after the Americans won their 10th world championship - and first since 2019 - by defeating archrival Canada 6-3 in the gold medal game in suburban Toronto last month.According to the people, U.S players split a pool of $1.045 million in the first year. The pool grows to $1.095 million in the second year and increases to $1.145 million in the final year of the contract, which runs through Aug. 31, 2025. The deal expires before the start of USA Hockey´s residency program in which players spend months training together in advance of the 2026 Winter Games in Italy.",
        "Without revealing how much, NHL deputy commissioner Bill Daly wrote in an email to The AP that the league provided funding for U.S. players in the new deal. That is similar to what the NHL did in 2017, when the Americans threatened to boycott the world championships on home soil before reaching an agreement.Though the pool of money allotted to U.S. players in the current contract is more than in 2017, it has not kept pace with inflation, one of the people told AP.In 2017, players received a boost in their monthly pay - going from $1,000 to between $3,000-$4,000 - and a chance to earn around $71,000 annually. Those potential earnings increased up to $129,000 in Olympic years when combined with contributions from the U.S. Olympic Committee.The landscape of women's hockey in North America has changed drastically since 2017.The seven-team Premier Hockey Federation enters its ninth season with a $1.5 million salary cap per franchise - double that of last season. The Professional Women's Hockey Players' Association, whose membership includes a majority of American and Canadian national team players, is also planning to launch its own professional league this fall.Both people told AP that player compensation is higher in Canada, with one saying it´s difficult to determine how much more because of tax and health benefit reasons, and how Hockey Canada receives its funding from various government agencies. While Canada has universal health care, the U.S. does not, and U.S. Olympic and Paralympic Committee rules bar individual associations from negotiating those types of benefits.",
        "Canadian players also get a percentage of ticket revenue from annual Rivalry Series games against the Americans played in Canada, according to Hockey Canada. Americans do not get any share of series games played in the U.S., one of the people said.In both the U.S. and Canada, players get an equal share of the pool. Because college players are not eligible to be paid, USA Hockey can deem fewer than 23 players as being eligible, with the total amount of money split among the smaller group.The new contract followed six months of negotiations after U.S. players agreed to extend the previous contract into September in order to compete in the world championships in Denmark.U.S. captain Kendall Coyne Schofield at the time was unhappy with the delay, telling the AP: \"Yeah, of course we´d like to have it done by now, but we don´t for a reason. So we´ll see what happens.\"Hockey Canada, by comparison, issued a lengthy press release outlining the parameters and benefits included in the one-year deal it reached with its players in December.___AP sports: https://apnews.com/hub/apf-sports and https://twitter.com/AP_Sports"
    ]
}