{
    "articleURL": "/wires/afp/article-12044379/US-Republicans-subpoena-FBI-unverified-Biden-allegation.html",
    "content": [
        "US Republicans subpoenaed the FBI Wednesday for a document they said details an \"alleged criminal scheme\" involving a foreign national and Joe Biden -- although they made no specific allegations against the president.",
        "The June 2020 record outlines a whistleblower's information on \"then-vice president Biden and a foreign national relating to the exchange of money for policy decisions,\" two senior lawmakers said in a letter to the bureau.The Republicans in the House of Representatives, who have been criticized in the past for expensive investigations targeting top Democrats that ended up falling flat, are giving the FBI a week to turn over any relevant information.The document they are seeking is \"an FBI-generated FD-1023 form,\" House Oversight Committee chairman James Comer and Iowa Senator Chuck Grassley said in a joint statement.\"It has been alleged that the document includes a precise description of how the alleged criminal scheme was employed as well as its purpose,\" they wrote to FBI director Christopher Wray and his boss, Attorney General Merrick Garland.Comer and other Republicans have been leading sprawling investigations into Biden and his family that have been criticized as lacking focus and failing to come up with a \"smoking gun\" to support corruption claims.Wednesday's subpoena was their first to mention the president directly -- marking an escalation in their attempts to link the 80-year-old Democrat to wrongdoing.\"The American people need to know if President Biden sold out the United States of America to make money for himself,\" Comer said, without providing details of any accusations against the Democrat.",
        "- 'Trafficking in innuendo' -The White House dismissed the probe as another example of Republicans improperly targeting the president for partisan ends.\"For going on five years now, Republicans in Congress have been lobbing unfounded politically motivated attacks against (the president) without offering evidence for their claims. Or evidence of decisions influenced by anything other than US interests. They prefer trafficking in innuendo,\" Biden's spokesman Ian Sams said.\"When it comes to President Biden's personal finances, anybody can take a look: he has offered an unprecedented level of transparency, releasing a total of 25 years of tax returns to the American public.\"The House Republicans have long signaled plans to turn the tables on Democrats after years of criminal and civil investigations into former president Donald Trump.Kevin McCarthy signposted sweeping plans to \"hold the Swamp accountable\" after winning the speaker's gavel in January, launching probes on topics ranging from the chaotic withdrawal from Afghanistan to \"the weaponization of the FBI.\"Democrats say the point is to undermine ongoing investigations into Trump misconduct, including around the 2021 assault on the US Capitol, and more broadly to muddy the waters ahead of the 2024 presidential election.Republicans spent two years and $7 million in taxpayer money investigating the deadly 2012 attack on the US mission in Benghazi, Libya, but fell short of concluding that then-secretary of state Hillary Clinton or then-president Barack Obama bore direct personal responsibility",
        "McCarthy admitted in 2015 the Benghazi select committee was launched to damage Clinton's credibility in advance of the 2016 presidential campaign, which she eventually lost to Trump."
    ]
}