{
    "articleURL": "/wires/pa/article-12052763/Alexis-Ffrench-Charles-powerful-voice-championing-conservation-matches-own.html",
    "content": [
        "Alexis Ffrench said his own thoughts and feelings on environmental issues are “very much in tune with King Charles”.",
        "The classical-soul composer will be performing with British singer Zak Abel, a 70-piece orchestra and the house band comprising the Massed Bands of the Household Division and the Countess of Wessex’s String Orchestra during the Coronation Concert on Sunday.Ffrench was initially billed to duet with singer-songwriter Freya Ridings during the concert, but on Friday it was announced that she has had to pull out “due to being unwell”, the BBC said.",
        "The 53-year-old, whose songwriting work has been “influenced by the natural world”, spoke about Charles’ history as an environmental campaigner.He told the PA news agency: “I met King Charles when I was 14 and I remember him voicing these opinions when it was less fashionable to do so.“He’s been championing these causes for most of his adult life. Not only that, but arts education as well. He’s been such a strong, powerful and persuasive voice.“I remember when we were 14 years old, we were very proud of that fact, and we were also minded to think about conservation, environmental issues.“It was a source of enormous pride for me back then, wind forward to now, conservation is such a key part of what I do as an artist.“My own thoughts and feelings are very much in tune with King Charles.”",
        "The classical musician said his latest single Peace is influenced by the Scottish Highlands from which he “derives a great sense of comfort and nourishment”.Ffrench, who most recently performed in front of the King during the Together At Christmas carol service at Westminster Abbey curated by the Princess of Wales who he described as “gracious funny and charming”, recalled his first meeting with the then-Prince Charles as a teenager.He told PA: “I met Prince Charles when I was 14, I used to go to school called The Purcell School for Young Musicians – of which he is patron.“We met Charles in an art class and I was drawing, a few of my friends were there too. He came and spoke to me and he was so warm, so generous, kind hearted.“We were thrilled actually because he was such a giving patron, took such a keen interest.”",
        "Speaking about the Coronation Concert, Ffrench said it is logistically a “massive challenge” with the orchestras but described it as a “powerful medium”.“There’s nothing I love more than playing with orchestras and going on this beautiful creative journey together,” he said.The composer also spoke about the other acts set to appear on the same stage.He told PA: “I’m a huge fan of Lionel Richie actually, always have been. But to be honest with you, Katy Perry, what a performer she is as well, and she’s going to knock it out of the park for sure.",
        "“Of course great admiration for all the other artists on the stage as well, Andrea Bocelli, Sir Bryn Terfel, who went to the same college as me actually Guildhall School of Music many years ago.”He joked: “So I shall be there with my little autograph book at the side of the stage, I’m sure I’ll have a fanboy moment at some stage.”"
    ]
}