{
    "articleURL": "/news/article-12044143/Howard-Stern-moans-black-NBA-players-hug-black-celebrities-courtside-NOT-him.html",
    "content": [
        "Stern claimed on his show that members of the Knicks don't approach him He said players often embrace black celebs like Tracy Morgan and Chris Rock 'I'd like to think it's a white thing, not my personality,' Stern added Howard Stern claimed on his show Monday that members of the New York Knicks don't approach him courtside at their games - but at the same time they embrace black celebrities.",
        "Celebrities are often a huge part of the atmosphere at Madison Square Garden when the Knicks are in the NBA's post-season and Stern is often a fixture on the sidelines with other big names.However, the long-time shock jock - speaking from Miami Beach where he's opening a new SiriusXM studio - said that he gets a bit of a cold shoulder from his hometown team and wonders if its about race.'Yeah, maybe they don't like me. I don't know,' Stern responded. 'I'd like to think it's a white thing, not my personality. I hope it's racial. That's all.'He clarified that New York's most famous NBA team is often generous to him, putting him at celebrity row at the Garden. ",
        "'The Knicks have been very kind to me,' Stern admitted. 'They put me right in the front row. That's when I knew I was famous. When I, you know, I have courtside, they put me courtside and the Black players won't come over and say hello to me, but they go over to Spike Lee.'Lee is perhaps the Knicks' most famous fan, on some occasions making himself apart of the action, most famously antagonizing Indiana Pacers legend Reggie Miller in the 1990s.Sidekick Robin Quivers questioned Stern when he made this point: 'They don't acknowledge you at all?'",
        "Stern said they didn't and then brought up that the team was significantly friendlier to black celebrities, in his opinion.'No. I'll be sitting next to Tracy Morgan or Chris Rock. You know, they seat you where they seat you. And a lot of times when I'm there, I'm next to Tracy Morgan, who is so funny. And he's sitting there and like, couple of the players will come over. They like give him that bro shake and stuff.' The radio legend admitted he wanted some of that love himself and felt that he could relate to the lifestyles of NBA superstars. 'And I'm like - these guys should hug me too. I mean, what am I? I grew up in a Black neighborhood, you know what I mean? I mean they should know that. But I get ignored,' Stern said. Quivers, who is black, then questioned Stern as to whether or not 'it's a racial thing.'",
        "'I'm sure they talk to some white people,' she added.'No, not that I saw. I want them to. I want them to talk to me,' Stern said. 'I want them to come up and go, 'Hey Howard, fan of the show or something.' I don't get that.'Stern has hosted his radio show on various stations since 1981, having moved exclusively to SiriusXM in 2005.    ",
        "He then admitted that there was at least one participant in the games that would reach out to him. 'And, you know who comes up to me sometimes? The referees. White guys and Black guys, they'll come up to me, White referees and Black. Like, 'Hey Howard, hey.' But yeah, a lot of the White referees. So I'm like, oh, is everything racial now? Can I get a shout-out from some of the players?' Stern said.Stern was joking but also said that 'I just get upset. I'm like, you know, fame to me is very important. I'll admit it. I like people to recognize me.'",
        "Quivers then consoled him by suggesting that the players 'might be recognizing you. Just not speaking to you.' The Knicks are perhaps currently more concerned with their second round playoff series against the Miami Heat, which is heading for South Beach tied up at 1-1. Perhaps with Stern in Miami Beach for the week, he can make amends with some of the players when Game 3 takes place Saturday afternoon.  "
    ]
}