{
    "articleURL": "/sport/nrl/article-12059839/Roosters-boss-insists-Joseph-Suaalii-NOT-leave-NRL-season.html",
    "content": [
        "Joseph Suaalii signed a three-year deal with Rugby Australia in MarchRoosters is under contract until 2024 and will switch codes in 2025Nick Politis dismissed rumours the Roosters could release Suaalii this year Roosters boss Nick Politis has dismissed rumours Joseph Suaalii could leave the NRL this season and join the Wallabies ahead of schedule.",
        "On Monday, Nine News reported the Tricolours were considering cutting ties with the 19-year-old before his contract expires at the end of next season. Suaalii will switch codes in 2025 after agreeing a three-year deal worth $1.6million-a-year with Rugby Australia in March and releasing him now would save the Roosters $700,000 on the salary cap for next season.Politis, however, insisted the Samoa international would not be leaving Bondi Beach until his deal runs out.'We have no plans to release him at this stage. The final say on recruitment is always with Robbo anyway. [Trent Robinson],' he told News Corp.",
        "'He’s working very hard with all the players to turn things around for our next game.'One of the most talented players in the NRL, Suaalii has struggled to live up to his potential since his deal with Rugby Australia became public.According to Nine News, Suaalii's recent lack of form could be a factor if the Roosters decided to release him. Politis, however, insisted the teenager could not be blamed 'for the way the team is performing' after the Tricolours lost 20-6 against the Cowboys in Magic Round.Meanwhile, Rugby Australia chairman Hamish McLennan said the Wallabies would happily take Suaalii immediately if the opportunity arose.'We’d take him straight away,' he told Nine. 'We made a good profit this year.",
        "'We’ll make $100million out of the [2025 British and Irish] Lions [tour] and another $100million out of the World Cup. Everything is heading in the right direction.'So we could afford to take him now and we’d be delighted to take him earlier if league didn’t want him.'",
        "Suaalii's switch is rugby's biggest coup out of the NRL in two decades, after Mat Rogers, Wendell Sailor and Lote Tuqiri all crossed codes in the early 2000s during Eddie Jones' first stint in charge of the Wallabies.Since replacing Dave Rennie in charge of the Wallabies in January, the 63-year-old has bullishly suggested he may raid league to convince some of the game's biggest stars to move to rugby union. Suaalii's defection to rugby has reignited a feud between the codes, with NRL boss Peter V'Landys accusing the Sydney Roosters gun of chasing 'easy money' and Canterbury supremo Phil Gould suggesting Suaalii would be better off making an immediate move.McLennan has returned fire by branding the NRL 'cry babies' and last month it emerged he held a secret meeting with Suaalii in Sydney, a move which raised questions about the latter's commitment to the Roosters."
    ]
}