{
    "articleURL": "/wires/reuters/article-12038643/Biden-administration-pledges-fight-climate-friendly-farming-funds.html",
    "content": [
        "By Leah Douglas",
        "WASHINGTON, May 2 (Reuters) - The Biden administration will defend funding for climate-smart farming in the $430 billion U.S. Inflation Reduction Act (IRA) if Republican lawmakers seek to cut it during negotiations for the next farm bill, an official said Tuesday.The IRA, which aims to cut emissions across the U.S. economy, includes $20 billion to support farmers in implementing carbon-sequestering conservation practices on their land.As negotiations begin over the next farm bill, which funds farm commodity, conservation, and nutrition programs, some Republicans have raised concerns about how the IRA funds would be spent and floated reallocating some of the money.The Biden administration would resist any effort to reallocate the funds, said White House deputy chief of staff John Podesta in a conversation with Reuters reporters on Tuesday.\"The program is popular,\" Podesta said. \"We´ll fight for it and I think we´ll be successful in the upcoming farm bill negotiations.\"Podesta said President Joe Biden's administration has heard support for the climate-friendly funds from farmers across the country. The money would provide farmers with technical and financial assistance to implement practices like planting cover crops or reducing soil tillage.\"We´re not hearing any complaints from farmers. We´re hearing complaints from Republican politicians,\" he said.Some Republicans have expressed concerns that the funds are too narrowly tailored or could be distributed unevenly.",
        "At a March 1 hearing of the Senate Agriculture Committee, John Boozman of Arkansas, ranking member of the committee, asked U.S. Department of Agriculture officials whether some crops would receive more support from the IRA money than others.Terry Cosby, the chief of USDA's Natural Resources Conservation Service, said USDA has a methodology in place to ensure fair allocation of the money. (Reporting by Leah Douglas; Editing by David Gregorio)"
    ]
}