{
    "articleURL": "/news/article-12047781/Olympic-gold-medalist-Tori-Bowie-pregnant-dead-home-neighbors-say.html",
    "content": [
        "Friends and neighbors have revealed Tori Bowie appeared to be heavily pregnant when she died this week at her home in the Orlando suburb of Winter Garden, FL Neighbor Zehra Ugurlu told DailyMail.com the track star's life was 'erratic and unhealthy' and she was once seen clutching a knife on the street 'We've heard shouting and screaming, loud music in the middle of the night ... but she appeared to have gotten much better lately,' said another neighborREAD MORE: Family of US track and field star Tori Bowie share their grief after she was found dead at Florida home aged 32Olympic gold medalist Tori Bowie appeared to be heavily pregnant before she was mysteriously found dead this week at her Florida home, DailyMail.com has exclusively learned.",
        "The former track and field world champion also had a long history of erratic and troubling behavior, according to friends and neighbors living beside her in Winter Garden, a smart Orlando suburb.One recalled encountering 32-year-old Bowie in the street clutching a knife and screaming at a boyfriend.In another unsettling incident, the celebrated sprinter – who won gold in the women's 4 x 100m relay at the 2016 Olympic Games – is said to have pelted eggs at the house opposite.",
        "At least two neighbors separately told DailyMail.com that Bowie appeared to be around seven or eight months pregnant when Orange County deputies carried out a welfare check at 1pm Tuesday and found her body.'She was a thin woman and it looked like she had half a basketball under her shirt,' said one. Investigators have ruled out foul play but are yet to release a cause of death.'I came out of my house one time, and she was standing there in the street clutching a knife and shouting at a man,' recalled next-door neighbor Zehra Ugurlu, 52.'A family friend of mine managed to talk to her and calm her down but it was scary, it made my daughters uncomfortable.'Her life was erratic and unhealthy but I'm very sorry about what happened to her. She was so young. Why didn't her friends help her?'",
        "Bowie's $500,000 home had been on the verge of being repossessed over the past two years because she owed more than $22,000 to her homeowners' association, according to court filings seen by DailyMail.com.The garage door had been left wide open for the past three months and the front door and windows were frequently left ajar, prompting locals to wonder whether the two-bed property had been taken over by squatters.Drying laundry was sometimes seen draped over the front balcony railing.",
        "'We've heard shouting and screaming, loud music in the middle of the night. But what shocked me was that she appeared to have gotten much better lately,' said another neighbor and friend, who declined to be named.'Having a baby seemed like it had made her happier. That's what makes it so sad – we are talking about two lost lives.'It goes to show that you can have fame, success, everything in the world but it won't fix what's going wrong on the inside. She had personal demons but she was a good person.'",
        "Orange County Court Records reveal Bowie, a standout track star and two-time NCAA long-jump champion at the University of Southern Mississippi, had chalked up 16 traffic infractions since 2019.The Overlook at Hamlin Homeowners Association sued Bowie and an 'unnamed spouse' in April 2021 for non-payment of assessments on her property, which she bought for $299,000 in March 2017.",
        "It was scheduled for foreclosure in 2022 but the auction was cancelled and the case was voluntarily dismissed last July.Bowie last competed on the world stage in 2019 at the Qatar World Championships but has spent the last four years living quietly in Florida, occasionally doing modeling work for Valentino and ESPN.On social media, her grieving sister Tamarra, 36, hinted at mental health problems.'People who pretend to be happy have some of the saddest souls and people who do not try to convince the world that they are happy have the most genuine souls, because they are content with just being them for them and nobody else,' she said in a Facebook post.Bowie grew up in Sand Hill, Mississippi. Her mother dropped her and her sister off at foster care when she was an infant but they were later adopted by their biological grandmother.",
        "In a video after she shot to stardom, Bowie said she'd struggled her 'entire life' but was inspired by her family and faith.'I come from a small town called Sand Hill, Mississippi. Where I come from, we're not supposed to succeed. It's been a struggle since day one. My birth mom dropped me off in foster care when I was two years old.",
        "'My entire life has been a struggle. It's amazing hearing it, it's something I always dreamed of. It's humbling. I've been through so much and I haven't let anything defeat me yet.'I'm a champion in that sense, not just on the track. I want to be up there with Naomi Campbell, taking over the runway not just the sport.'We're blessed when we get to wake up and we get a whole new day to do something different. I feel like every day is a celebration for me.'Bowie’s uncle Timothy Bowie, 58, told DailyMail.com he had not spoken to his niece for a number of years but was incredibly proud of her achievements.‘To come from the situation she did, with a mama that didn’t do anything for her, she did really great,’ he said‘Her sister too, she’s a lawyer. For them to do as well as they did, yes I’m very proud.'US record holder and three-time world champion Noah Lyles led the tributes to Bowie.'I can't believe this. I had just heard word of her going to be with her sister back home and now this,' he wrote on Twitter.'This breaks my heart to hear and I will keep the family in my prayers.'One of Bowie's competitors, Jamaican Olympic champion Shelly-Ann Fraser-Pryce also paid tribute, tweeting, 'My heart breaks for the family of Tori Bowie.'",
        "After winning bronze at the 2015 World Championships, Bowie qualified for the US Olympic Team for Rio 2016, where she raced to silver in the 100m and took bronze in the 200m.Alongside fellow sprinters English Gardner, Allyson Felix, and Tianna Bartoletta she bagged a gold medal for Team USA in the 4x100 meter relay.",
        "A year later at the 2017 World Athletics Championships in London, Bowie took home the gold in the 100m and again in the 4x100m relay.At the 2019 World Championships in Qatar, Bowie made the semifinals of the 100m but did not start after qualifying.Bowie's final Instagram post from October 2019 showed video of her competing in the long jump at the same event, with the caption: 'What a journey ... finishing 4th in the world considering I've been away from it for 5 years is a huge accomplishment for me!'Let's just say I'm looking forward to Tokyo! To everyone chasing their dreams out there keep the courage and determination! I know I will.'Bowie didn't compete in qualifying for the 100m, 200m or the long jump in the 2020 US Olympic Team Trials, however.According to Runners World, she had not competed since June 4 last year, when she finished 5th in a 200m race in Florida.",
        "Bowie's management team confirmed her death in a statement Wednesday morning on Twitter.'We're devastated to share the very sad news that Tori Bowie has passed away,' Icon Management wrote.'We've lost a client, dear friend, daughter and sister. Tori was a champion … a beacon of light that shined so bright! We're truly heartbroken and our prayers are with the family and friends.'A spokesman for the Orange County Sheriff's Office told DailyMail.com that deputies responded to Bowie's home 'to conduct a well-being check of a woman in her 30s who had not been seen or heard from in several days.'Entry was made into the residence and a woman, tentatively identified as Frentorish 'Tori' Bowie was found dead in the home. There were no signs of foul play.'Information about the cause and manner of death will need to come from the Medical Examiner's Office. We have no additional information to release at this time.'"
    ]
}