{
    "articleURL": "/health/article-12059645/Sorry-chaps-scientists-say-theres-no-thing-beautiful-scrotum.html",
    "content": [
        "German scientists analyzed survey responses of 653 participantsParticipants were presented with 36 images of four different scrotums Researchers concluded 'we must instead speak of the least ugly' scrotums Scrotox, scrotal webbing surgery and the scrotal lift: they're three of the latest trends in male groin tweakments and surgery.",
        "With men more body conscious than ever, doctors say scrotum cosmetic procedures are rising in popularity as word spreads about them.But men now need not worry. For German researchers have concluded 'ultimately' it is 'barely possible to identify a \"beautiful' scrotum'.Writing in the Journal of Cosmetic Dermatology, scientists said: 'We must instead speak of the least ugly'.",
        "In a study by researchers at the Medical School Hamburg, 673 participants were asked to each complete a questionnaire and rate the attractiveness of 36 different photographs of scrotums on a sliding scale.A total of 374 women, with an average age of 25 took part, while 279 men, with a mean age of 27, also completed the survey.Around half were in relationships and the majority had had at least one sexual partner in the previous six months. In total, 461 participants - 200 female and 257 make - also shared they had consumed sexually explicit material online in the last six months. Each participant was then presented with frontal photographs of four different scrotums. There were nine versions of each scrotum, which the researchers had edited to have differences in width and length.",
        "Participants were then asked to rate all 36 images on a sliding scale from −3, 'very unattractive,' to +3, 'very attractive.'",
        "Results showed that almost none of the scrotums were rated as 'attractive', with most scores being negative.The researchers found that participants' age and pornography use did not affect the score they awarded each image, while there were a few differences between gender.The researchers noted that previous studies have shown that women 'perceive a prominent, large penis as a measure of masculinity'. So any penis that does not meet this criteria could lead to a less positive review, they said. However, their findings show that this was not true of the scrotum. 'The reason for this may be that the scrotum does not have the same importance for women as does the penis,' they wrote. However, scientists acknowledged that their images showed scrotums in a 'normal range' with 'relatively small differences' in size, which may have limited the findings. 'If image editing had made the scrotums unusually large, small, or bulky, the participants might have shown stronger preferences,' they noted. All men whose scrotums were photographed were also between the ages of 23 and 30 years of age.They added: 'In the majority of cases, it is older adults who seek scrotum tightening, future work may elect to include models from a larger age range or focus on scrotums belonging to older men.'"
    ]
}