{
    "articleURL": "/wires/aap/article-12058449/Prosecutor-cautioned-Wilkinson-Logies-speech.html",
    "content": [
        "The ACT's top prosecutor says he should have more clearly warned journalist Lisa Wilkinson against giving a speech that later caused ex-Liberal Party staffer Bruce Lehrmann's rape trial to be delayed.",
        "Director of Public Prosecutions Shane Drumgold is the first witness at an independent inquiry into how the territory's justice system handled rape allegations made by Mr Lehrmann's ex-colleague Brittany Higgins.Mr Drumgold was asked about a pre-trial meeting with Ms Wilkinson, where she told him she had been nominated for a Logies award based on her 2021 interview with Ms Higgins about her alleged rape.Ms Wilkinson later won the award and gave a speech which generated intense media reporting about the case, resulting in ACT Supreme Court Chief Justice Lucy McCallum postponing proceedings to protect Mr Lehrmann's right to a fair trial.Mr Drumgold said while he had not told the Network Ten journalist not to give the speech, he thought he had clearly stated that any publicity could impact the impending trial.\"I'm not her legal adviser, what (I was) doing is cautioning her that any publicity could give rise to a stay,\" he said.\"In hindsight, (the speech) was not an unlikely hypothetical, it actually came to fruition so if I had known that I may have paid closer attention at the time.\"Mr Drumgold said at the time he felt confident he had given Ms Wilkinson \"sufficient guidance\" about any potential speech, but in hindsight he could have been clearer.",
        "\"I should have listened to the whole speech and said, 'if I were a defence lawyer, I would make an application for a stay on the basis of that',\" he said.Ms Wilkinson experienced intense media criticism following the trial's delay.Mr Lehrmann later faced an ACT Supreme Court trial in October 2022 but juror misconduct meant a verdict was not reached and the charges against him were later dropped.He denies raping Ms Higgins inside Parliament House in 2019.The inquiry also heard Ms Wilkinson's lawyers asked Mr Drumgold to consider making a public statement that her Logies speech had not been a contempt of court, on the same day he announced he was dropping the rape charges.In a letter to Mr Drumgold, the lawyers said Ms Wilkinson had left her role on The Project because of the \"unwarranted media attention\" she had received.\"Ms Wilkinson is very concerned that the injustice she has experienced be addressed at the earliest opportunity,\" the letter said.Mr Drumgold said media reporting about his meeting with Ms Wilkinson had largely been inaccurate, but he did not want to \"feed the storm\" by commenting on it.\"What I was being asked to do (by Ms Wilkinson's lawyers) was completely beyond my remit,\" he said.",
        "\"Whatever sympathy I have for Ms Wilkinson, I'm not a publicist. I'm the Director of Public Prosecutions.\""
    ]
}