{
    "articleURL": "/wires/afp/article-12038617/Democrats-push-US-Supreme-Court-ethics-code.html",
    "content": [
        "US senators pressed Tuesday for a binding code of conduct to be forced on the Supreme Court amid a mushrooming scandal over justices accepting lavish gifts and benefiting from undisclosed real estate transactions.",
        "Members of the nation's highest judicial body are the only federal judges not explicitly subject to ethical oversight, Democrats on the Senate Judiciary Committee pointed out, as they voiced dismay over the refusal of Chief Justice John Roberts to appear before them to discuss reform.Senator Dick Durbin, the chairman of the Democratic-led panel, opened the session by detailing a litany of expensive gifts conservative Justice Clarence Thomas had welcomed from rich Republican donor Harlan Crow over two decades.Durbin said Thomas had faced \"no apparent consequences\" for accepting numerous luxury trips, including on a mega-yacht and private jet, from the real estate billionaire without disclosing them.\"We wouldn't tolerate this from a city council member or an alderman,\" Durbin told the committee.\"It falls short of ethical standards we expect of any public servant in America and yet the Supreme Court won't even acknowledge it's a problem.\"Durbin said he was \"troubled\" by Roberts declining his invitation to testify by citing separation of powers concerns, adding that sitting justices have testified in 92 congressional hearings since 1960.The Senate Judiciary Committee hearing came with polls showing that a majority of Americans disapprove of the job being done by the bench of six conservative and three liberal justices.- 'Honest ethics process' -",
        "Questions have also been raised about another conservative justice, Neil Gorsuch who, according to Politico, neglected to disclose the buyer of a large vacation home on the Colorado River -- the head of a major US law firm which regularly handles cases before the high court.Democrats called the hearing in a bid to ratchet public pressure on the justices, with Congress divided between the two parties and a series of bills aimed at strengthening oversight standing little chance of becoming law.",
        "Democrats have a 51-49 majority in the Senate but would need an unlikely 60 votes to pass any ethics bill, which would not get the consent of the Republican-led House of Representatives in any case.\"Until there is an honest ethics process at the Supreme Court, these messes will continue,\" Rhode Island Democrat Sheldon Whitehouse said.\"The court has conclusively proven that it cannot police itself.\"Experts called by Republicans to testify were skeptical over the concept of Congress legislating to bring the high court into line, however, pointing to its status as a coequal branch of government.\"It is the Supreme Court and not the Congress that has the constitutional prerogative to decide whether to adopt a formal code of conduct governing the individual justices,\" said Michael Mukasey, a former attorney general during president George W. Bush's administration.",
        "- 'Sour grapes' -Republicans accused Democrats of mudslinging, \"alarmism\" and \"sour grapes\" over decisions led by conservative justices that had not gone their way.They pointed to what they said was inflammatory language by Democratic Senate leader Chuck Schumer, who warned justices in 2020 they would \"pay the price\" for poor decisions, and to activists picketing justices' homes and threatening them.\"My Democratic colleagues should file a 'hurt feelings' report and move on for the sake of the Constitution,\" said Louisiana Senator John Kennedy, while South Carolina's Lindsey Graham called the hearing an \"unseemly effort of the Democratic Left to destroy the legitimacy of the Roberts Court.\"",
        "Jeremy Fogel, a former federal judge called to testify by Democrats, acknowledged the Supreme Court's need to defend its independence but suggested a panel of retired judges could help justices comply with ethical guidelines.\"The point is that a formal code of conduct would provide clearly stated, visible rules and procedures to which the justices are expressly committed,\" he said.\"Adoption of such an ethical framework wouldn't make controversies about the court or its decisions disappear, but it would be a statement to the American people that their faith in the court's adherence to core ethical principles matters.\""
    ]
}