{
    "articleURL": "/health/article-12046977/Man-44-wins-NHS-payout-left-severe-burns-buttocks.html",
    "content": [
        "Paul Hickman, 44, received an NHS payout after being burned during surgeryDudley Group NHS Foundation Trust admitted a breach of duty led to his burnsA man has won an NHS payout after being left with severe burns on his buttocks and thighs from a freak accident involving a banned heated mattress.",
        "Paul Hickman, 44, of Walsall in the West Midlands, was injured while having surgery to improve circulation in his legs in March 2021.  Before the botched procedure, doctors at the Russells Hall Hospital applied an alcohol-based antiseptic on Mr Hickman's thighs and buttocks. They then placed him on a heated mattress. Dudley Group NHS Foundation Trust, which runs the hospital, carried out an internal investigation and found: 'The unusual combination created the ideal circumstances to create a significant burn.' Mr Hickman took legal action against the Trust and has now received an apology and an undisclosed payout.",
        "He underwent an unspecified vascular procedure on March 29, 2021. After the operation, he complained of severe pain and it emerged that he had burns to his thigh and buttocks.He remained in hospital until April 2, 2021 - leading to the Trust declaring a major incident.Following an investigation, the Trust admitted that a breach of duty led to Mr Hickman's 'prolonged stay in hospital'.The investigation found the use of alcohol-based solution during Mr Hickman's preparation for surgery and the 'inappropriate use' of a heated mattress in surgery led to his burns.The probe also uncovered a similar incident had previously occurred at the Trust. ",
        "The use of the heated mattress had been banned in the type of procedure Mr Hickman underwent since 2016, when a different patient was burnt. There were no further details given about this case. ",
        "The payout awarded to Mr Hickman was said to be for him 'to access the ongoing support he needs following his injuries'.  Mr Hickman said: 'The pain from the burns and scars I had all down the back of the tops of my legs was unbearable. I was in so much pain and painkillers didn't really take the edge off.'Alexandra Roberts, the medical negligence specialist at Irwin Mitchell representing Mr Hickman, said: 'This is an extremely worrying incident in which Paul received severe but avoidable burns.'What's even more concerning is that Paul's injuries came after another patient was injured in a similar incident and the Trust had taken measures to apparently avoid a repeat of such an incident.'What happened to Paul and how it has impacted on his life has been incredibly tough for him both physically and emotionally.'She added: 'While nothing will make up what he's been through, we're pleased to have provided him with the answers he deserves.'We now call on the Trust to ensure it learns all lessons possible from Paul's case so that its guidance around the use of heated mattresses is upheld at all times.'Mr Hickman said he has scarring for life as a result of the incident.",
        "He claims he now sits differently and has to lean to the side now because of the scars, which feel dry and scaly and require him to apply cream every day. ",
        "'What makes what happened to me even more shocking is hearing about the previous incident,' he added'I hope by speaking out I can help prevent yet another similar incident happening. This has happened twice and I don't want it to happen again.'Diane Wake, chief executive of the Dudley Group NHS Foundation Trust, told MailOnline last year: 'We offer our sincere and wholehearted apologies to Mr Hickman who sadly sustained his burns during life-saving surgery.'We have carried out a comprehensive review into the incident and this particular type of heated mattress, while appropriate in most surgical procedures, is no longer used for the type of vascular procedure undertaken on Mr Hickman.'"
    ]
}