{
    "articleURL": "/wires/reuters/article-12047887/Chokehold-death-homeless-man-New-York-subway-ruled-homicide.html",
    "content": [
        "May 4 (Reuters) - The death of a man who was placed in a chokehold by a fellow passenger on a New York City subway train earlier this week has been ruled a homicide by the city's medical examiner as calls for an arrest in the incident have intensified.",
        "The deceased man, identified as 30-year-old Jordan Neely, died on Monday from a compression of the neck while riding on the F train in Manhattan, a spokesperson for the medical examiner said on Thursday, noting that homicide is not a ruling on intent or culpability. Neely, according to local media reports, was homeless.A video of the incident that has circulated on social media showed an unidentified passenger applying a chokehold to a man identified as Neely on the floor of a subway train for more than three minutes. Two other men are seen in the video restraining Neely's arms before he went limp.Reuters could not verify the authenticity of the video.Neely was known to impersonate Michael Jackson, dressing and dancing like the legendary music artist on New York's busy trains and stations. The altercation occurred after he boarded the train and began saying he was hungry and ready to die, the New York Times reported, citing police.The 24-year-old former Marine who placed Neely in the chokehold was questioned by police and released on Monday, local media reported. Authorities have not released his name.The Manhattan District Attorney´s Office said it was investigating the incident by reviewing the medical examiner´s report, viewing video and photo footage of the altercation, and conducting interviews with witnesses. It said it was also examining Neely's medical records.",
        "The incident has led to calls for the man who put Neely in the chokehold to be arrested, and for the city to do more for the homeless and those who are struggling with mental illness. Some also have claimed that race - Neely is black and the man who choked him is white - has played a part in the city's handling of the case.Democratic U.S. Representative Alexandria Ocasio-Cortez, whose district includes neighborhoods in the New York City boroughs of the Bronx and Queens, said Neely was murdered.\"Jordan was houseless and crying for food in a time when the city is raising rents and stripping services,\" she wrote on Twitter. \"The murderer gets protected w/passive headlines + no charges.\"New York Mayor Eric Adams cited mental health issues as having a role in the incident, but said he would refrain from commenting further while the investigation is under way.\"We do know that there were serious mental health issues in play here,\" he said, noting that his administration has worked to care for homeless individuals and get them off the streets and subways. (Reporting by Brendan O'Brien in Chicago; Editing by Leslie Adler)"
    ]
}