{
    "articleURL": "/news/article-12048059/Trump-wants-hush-money-trial-moved-federal-court.html",
    "content": [
        "Former President Donald Trump is trying to get the Stormy Daniels hush-money case moved from Manhattan state court to federal courtIt would allow him a broader, more politically diverse jury pool that's more likely to include suburban Republicans 'This effort is extremely unlikely to succeed,' one legal expert said  Former President Donald Trump's lawyer said Thursday that the former president will seek to move the Stormy Daniels hush-money case to federal court, a long-shot bid to avoid a trial in the state court where the historic indictment was brought.",
        "Such a move, while rare, would have significant advantages for Trump, including a broader, more politically diverse jury pool that's more likely to include suburban Republicans. In state court in Manhattan, juries are drawn only from that borough, where voters have heavily favored his Democratic rivals.'This effort is extremely unlikely to succeed,' said Rebecca Roiphe, a professor at New York Law School. 'It's not even clear that this would be a particularly effective delay tactic.'Trump's attorney, Todd Blanche, raised the prospect of a move to federal court during a state court hearing Thursday where a judge indicated he would put limits on Trump's access to certain evidence, as prosecutors had requested, but wouldn't issue a gag order or bar him from speaking publicly about the case.",
        "Blanche told the state court judge that the defense team plans to file a motion Thursday asking to transfer the case from state court to federal court. He did not give a reason and did not comment to reporters as he left court.Trump's lawyers face a Thursday deadline to file paperwork listing their grounds for moving the case - 30 days after the April 4 state court arraignment where he pleaded not guilty to 34 felony counts of falsifying business records.A federal judge would then have to rule on whether the case can be moved. Such requests are more common in civil lawsuits and are rarely granted in criminal cases.",
        "While that process plays out, the case will proceed in state court and all pretrial deadlines will remain in effect.Prosecutors didn't address the impending request during Thursday's hearing. A message seeking comment was left with Manhattan District Attorney Alvin Bragg's office.'It is possible to remove a state prosecution to federal court but the reasons for doing so are narrow and none seem to apply in this case,' Roiphe, a former Manhattan prosecutor, said.Trump´s charges, the first brought against a former president, are related to hush-money payments made during the 2016 campaign to bury allegations of extramarital sexual encounters.Federal prosecutors in Manhattan previously investigated those arrangements and only charged one person: Trump's former lawyer and fixer Michael Cohen, who pleaded guilty to violating federal campaign finance law in connection with the payments. Cohen is a key witness in the state case against Trump.",
        "Trump, a Republican, has denied wrongdoing and pleaded not guilty.Earlier in the hearing Thursday, Judge Juan Manuel Merchan sought to broker a compromise between Trump's lawyers and prosecutors, who raised concerns that he would use evidence obtained in the pretrial discovery process to attack witnesses and other people involved in the case, as he has in the past.The judge, a target of Trump's social media ire in the wake of his indictment, did not rule on the prosecution's request for what's known as a protective order. ",
        "But he suggested he wants to balance the sanctity of the case, the safety of people involved, and Trump's free speech rights.'Obviously, Mr. Trump is different. It would be foolish for me to say he's not. He´s the former president of the United States and he´s running again,' Merchan said.The judge said Trump's fame and megaphone make him different from other criminal defendants, but 'with that comes responsibility that his words, especially when used in the form of rhetoric, can have consequences.'Blanche said Trump wasn't seeking to put evidence on social media nor was he objecting to a prosecution request, based in part on safety concerns, to keep identifying information about district attorney's office employees secret until the trial starts.Once he rules, Merchan said, he will hold a hybrid conference - lawyers in court, Trump appearing by video - where he will apprise him of the dos and don'ts of his impending order.Merchan asked Trump's lawyers and the prosecution to confer and agree on a trial date in either February or March 2024. Barring removal to federal court, that could land Trump, who's making a comeback run for the White House, in court during next year's primaries.William Dow III, a Connecticut attorney for more than 50 years, said he had never heard of a state criminal case being removed to federal court. ",
        "He called such a move a delaying ploy.'It's interesting that sometimes people who want to run away from their problems take any avenue that´s available, whether it´s accurate or not. I think this [Trump's case] is subject to that interpretation,' said Dow, whose clients have included former Connecticut Gov. John Rowland in a political corruption case that forced him to resign in 2004."
    ]
}