{
    "articleURL": "/wires/reuters/article-12051933/2023-AdventHealth-400-Preview-Best-Bets-Longshot-Pick.html",
    "content": [
        "Kansas Speedway featured six winners in the past six races at the 1.5-mile track.",
        "That includes Kurt Busch, last year's winner of the AdventHealth 400 who will be in the FS1 broadcast booth for Sunday's race. Bubba Wallace was the most recent to visit Victory Lane in Kansas in the fall race, filling in for the injured Busch and giving the 23XI team both wins at the track in 2022.It was the first time since 1972 that a car swept races at a track with two different drivers in the same year. Tyler Reddick is driving the No. 45 on Sunday with an opportunity to stretch the streak to three and set a new record.Of the three most successful active drivers at Kansas -- three-time winners Joey Logano, Denny Hamlin and Kevin Harvick -- only Logano has a victory (at Atlanta) through the first 11 races of this season.Three drivers who currently sit among the top five in the championship points standings -- including leader Ross Chastain, Harvick and Ryan Blaney -- are still seeking their first wins of the season.ADVENTHEALTH 400The Place: Kansas SpeedwayThe Date: Sunday, 3 p.m. ETThe Distance: 400 milesDefending Champion: Kurt BuschTV: FS1Radio: SiriusXM NASCAR RadioBEST BETS - 6 PACKKyle Larson (+500)The pre-race favorite, Larson is already a three-time winner at Kansas and has finished sixth or better in eight of his past eight starts at the track. After opening at +500, Larson's odds have shortened while being backed by 10.6 percent of the outright winner money at BetMGM, second most among the drivers on Sunday's grid.",
        "Denny Hamlin (+700)Also a three-time winner at Kansas, Hamlin is seventh in the championship standings. He earned back-to-back wins at Kansas in 2019-20 and also won there in 2012. Hamlin has two top-fives in the past three races, and is a part owner of the 3XI Racing team that swept the Kansas races last year. \"Kansas has been a great track for us the past few years, so I'm looking forward to this weekend,\" Hamlin said. He was one of seven drivers to post two top-10 finishes at Kansas last year, and leads the Cup Series by a large margin with 2,262 laps run in the top 10 this season.William Byron (+800)Byron, who has six top-10s in his past sevens starts at Kansas, opened at +650 and leads the grid with 7.0 percent of the total winning bets backing him. He finished sixth at Kansas in the fall.Martin Truex Jr. (+900)Coming off his first win of the season at the rain-delayed Wurth 400 at Dover, Truex Jr. stops at another track where he has enjoyed significant success. That includes 11 top-10s in his past 12 Kansas races, including a pair of wins in 2017.Kevin Harvick (+1600)Harvick is not only tied for the most career wins at Kansas, he has the most top-five (12) and top-10 (19) finishes and most poles (five) among active drivers, and his 949 laps led is 100 more than anyone else on Sunday's grid. He has not won since Richmond last summer, but Harvick does own five top 10s through the first 12 races of the season - although none in the past three races.",
        "Bubba Wallace (+1600)The winner in Kansas last fall, Wallace is BetMGM's biggest liability this week. He has been backed by the second most tickets at the sportsbook at 6.8 percent while Wallace's odds have lengthened since opening at +1400. He needs a good weekend as Wallace enters Kansas 21st in the Cup Series standings, 15 points out of the playoff cutline.LONGSHOT PICKRicky Stenhouse Jr. (+12500)Stenhouse Jr. is the BetMGM's second biggest liability this week while the Daytona 500 winner has drawn 3.6 percent of the bets and 1.6 percent of the money. However, all three of his career victories have come on superspeedways - a pair at Daytona and one at Talladega.--Field Level Media (NASCAR Wire Service contributed to this story)"
    ]
}