{
    "articleURL": "/tvshowbiz/article-12049235/ABC-supports-Bluey-producers-cave-pressure-viewers-fat-shaming-episode.html",
    "content": [
        "The ABC has agreed to re-cut a controversial episode of the kids show Bluey following pressure from viewers.",
        "The beloved animated series about a family of dogs landed in hot water with fans last month over a 'fat shaming' scene.And the offending moment, only seconds long, has now been altered by the show's producers, Ludo Studios, with the support of the national broadcaster reports TV Blackbox.The controversy centred around the episode Exercise, in which Bluey's dad, Bandit decided he needed to get fit, after complaining about his expanding stomach.Some parents were left disappointed by what they saw  as 'toxic' messaging.",
        "Critics of the scene said it created anxiety over body image rather than the health benefits of exercise.Meanwhile, an ABC spokesperson said: 'The new version provides families with the opportunity to manage important conversations in their own way. 'As the home of Bluey, the ABC supports the decision to re-edit the program and we have updated the episode on our platforms.'",
        "According to the report, the global distributor of Bluey, BBC Studios will be carrying the edited version of the controversial Exercise episode. It comes after diehard Bluey fans claimed they had to switch the show off after seeing the so-called 'fat shame' scene.The episode began with Bandit and Chilli hopping on the bathroom scales before sighing 'aww man' after seeing the number flash up on the screen.",
        "Bandit, the father figure in the iconic children's show, went on to grab his stomach before deciding he needed to get out and exercise.Parents appear divided over the episode, with some so uncomfortable they switched it off and others claiming conversations around weight should be normalised.'It could have been such a wonderful episode about not letting your kids hold you back from moving your body, but instead it just seems like a story about Bandit's weight loss and the assumption he had high blood pressure when he was \"fat\",' one mum fumed.Meanwhile, Karl Stefanovic and Sarah Abo came out to defend the show against the viewer backlash. ",
        "Speaking up about the divisive issue on the Today breakfast show Karl, 48, told critics to 'give it a rest'. 'Can you believe this, I think that is just fantastic. I mean, it is a bit of Australiana,' he said. 'It plays out in households across Australia and all of these influencers are coming out now going, \"Oh, Bluey is fat-shaming, it's disgusting.\" Give it a rest!'Karl went on to say the episode spreads 'a really good message' before adding he's 'had enough of these influencers'. Co-host Sarah, 37, agreed, saying: 'You can't say anything or do anything anymore.'"
    ]
}