{
    "articleURL": "/tvshowbiz/article-12046933/Emmerdale-SPOILERS-Cheating-Mack-vows-win-Charitys-forgiveness.html",
    "content": [
        "Mackenzie Boyd will be determined to win back Charity's forgiveness on next week's Emmerdale, after she finally learned he was the father of Chloe Harris' baby.",
        "In upcoming scenes, Mack is shamed by his sister Moira after she finally pieces his months of lies together, after Charity figured out her husband's connection to the newborn.It comes after a devastated Charity finally realises that Mack cheating on her and fathered baby Reuben with Chloe.In the coming episodes, Mack is shamed as Moira pieces his months of lies together, but her words eventually leave him spurred-on to fix things with Charity. When Amy arrives at the hospital for cuddles with Reuben, self-loathing Chloe breaks the news that Mack is his father - and she can't believe what Chloe's done…Will the newlyweds' marriage survive this shocking betrayal? ",
        "The scenes will air just days after viewers see the moment Charity (Emma Atkins) finally learns the truth about Reuben's paternity. For months, Mack and Chloe kept their secret one night stand and resulting child under wraps, with only Nate Robinson and Sarah Sugden knowing the truth.However, things are finally set to come to a head this week as Mack's wife Charity works out his shocking secret after he struggled to cope with baby Reuben's recent bacterial meningitis diagnosis.In upcoming scenes, Mack's pal Nate worries he's deluding himself as he contemplates balancing his marriage to the landlady with a secret life with his son.",
        "Meanwhile, Chloe (Jessie Elland) reels when doctors inform her that Reuben may have a bleed on his brain. Over at the Woolpack, Dan Spencer attempts to stay positive about Reuben's chances but Mack (Lawrence Robb), who's been drowning his sorrows amid his son's health woes, reaches his breaking point.And wife Charity is left astonished when he then punches Dan before stalking off into the night.Later, a worried Mack sits outside the hospital, unable to bring himself to go in.",
        "He then ignores a call from Charity, who's become increasingly concerned about what's truly causing their rift. Inside the hospital, Chloe's desperately worried when the consultant tells her they'll need to do another scan on Reuben, whose condition doesn't appear to be improving. Elsewhere, Nate urges Mack to visit Reuben in hospital after realising the extent of his pal's concern for the tot. However, with Charity already suspicious over his unusual behaviour, Mack is soon risking his relationship as he heads to the hospital.Soon, both parents are utterly relieved when the consultant tells them Reuben is showing no signs of brain damage. And when Chloe asks if he wants to come and see Reuben with her, Mack jumps at the chance to spend time with his son. Unbeknownst to him meanwhile, Charity and Chloe's half-sister Amy Wyatt arrive at the hospital for a surprise visit after learning that Reuben is on the mend.",
        "But Charity is in for a shock when she spots an unaware but emotional Mack doting over baby Reuben, and works out he is the tot's father.Emmerdale airs weekdays at 7:30pm on ITV1 and ITVX."
    ]
}