{
    "articleURL": "/wires/pa/article-12043751/Woman-killed-four-wounded-shooting-Atlanta-medical-facility.html",
    "content": [
        "A gunman has opened fire in the waiting room of an Atlanta medical facility, killing one woman and injuring four others, police said, as authorities swarmed the city’s bustling midtown neighbourhood in search of a 24-year-old suspect.",
        "Police said there had been no additional shots fired since the initial shooting inside a Northside Medical building on West Peachtree Street in a commercial area with many office towers and high-rise apartments.Officers said the gunman is believed to be Deion Patterson and that he is considered armed and dangerous.Atlanta Police Chief Darin Schierbaum told reporters that a 39-year-old woman was pronounced dead at the scene.The four injured women, aged 25, 39, 56 and 71, are “fighting for their lives at Grady Hospital”, Atlanta mayor Andre Dickens said during a news conference.More than two hours after the shooting, police said they had no information indicating that Patterson was still in the area.They lifted a shelter-in-place advisory but asked people to stay away from the area due to the active investigation.Authorities put out a photo of Patterson showing his face and asked anyone with information about his whereabouts to call 911 and not approach him.Crime Stoppers was offering a reward of up to 10,000 dollars for information leading to his arrest and indictment.The shooting comes as cities around the US have been wracked by gun violence and mass shootings in 2023.In surveillance photos released by police, the suspect was wearing dark trousers and a light-coloured hoodie with the hood pulled up.",
        "He had a mask on his face and appeared to be wearing a bag across his front.Police said they are aware of a carjacking that happened a few blocks away not long after the shooting. They said the vehicle has been recovered in suburban Cobb County, and they are working to determine whether it was connected to the shooting.Dozens of police and fire vehicles were gathered along West Peachtree Street as officers with assault-style rifles, helmets and vests continued to arrive more than an hour after the shooting.Many officers clustered outside the front entrance of the Northside Medical building, and helicopters hovered overhead while police tried to keep traffic moving on nearby streets.Construction workers watched from the nearest corner in the midtown neighbourhood where many new high-rises are being built."
    ]
}