{
    "articleURL": "/sport/football/article-12055089/Thirty-five-football-stars-including-current-players-treated-gambling-issues.html",
    "content": [
        "Thirty-five players required residential rehabilitation in England last seasonSubstance abuse, of alcohol and drugs, was the next most common reasonPeter Shilton's wife wants to change the narrative around gambling addiction Thirty-five football players, including some current stars, required residential rehabilitation in England last season to deal with addictive disorders, most commonly gambling addiction, we can reveal.",
        "Substance abuse, of alcohol and drugs, was the next most common reason players were admitted to the Sporting Chance clinic.But in a sport saturated in gambling advertising and in a professional league system where the vast majority of clubs have one or more gambling partners, the gambling epidemic is arguably the most shameful.Sporting Chance was founded in 2000 by Arsenal and England legend Tony Adams, who himself has battled alcoholism, to support former and current players with various mental, emotional and addiction issues.Among players known to have sought help specifically for gambling addiction are Paul Merson, Michael Chopra, Matthew Etherington, David Bentley and Dominic Matteo but there have been hundreds more. ",
        "On two visits to the clinic in the late Noughties, On The Money met a group of players fighting gambling addiction, including two who were contemporary England internationals whose stories remain private to this day.Former England goalkeeper Peter Shilton is another who has spoken openly about his gambling problems, and has sought help via Sporting Chance and the NHS. His wife Steffi told the Mail on Sunday: ‘The likes of Sporting Chance and the NHS national clinics are doing such a great job.‘It is important to try to change the narrative around gambling addiction, it is a mental illness and players should not be embarrassed. The best thing players can do is reach out to organisations or loved ones.",
        "‘They should feel proud if they do decide to reach out as that is a proactive step to doing something about their situation.‘Going forward, it would be great to see even more help out there for loved ones. Family members can be a key to the success of a player’s recovery. They are the silent victims and are often left traumatised too.’The numbers detailed above were outlined in the latest financial records for the Players’ Foundation, formerly known as the PFA Charity, which spent almost £4million last year to provide counselling and treatment to 520 players and former players.",
        "Just under half were current players, just under half were former players and five per cent were family members of players in desperate situations. The interventions were necessary for a wide variety of reasons ranging from depression (almost half of all cases), substance addiction (78 players) and gambling addiction, afflicting 42 players, and many of those so badly they went into rehab for up to a month at a time.Of the 520 players helped in total, 40 of them were current female professional footballers. No identities or specifics were provided but aside from the problems detailed above, assistance was sought for psychiatric assessment, anger management, eating disorders and suicidal ideation.",
        "A total of 83 former players among the 520 were helped with PFA counselling and support as thy continued to come to terms with being survivors of football’s sex abuse scandal, perpetrated by convicted paedophile Barry Bennell and many other predatory coaches of that era."
    ]
}