{
    "articleURL": "/wires/reuters/article-12051229/Arsenals-Arteta-wary-coached-Newcastles-record-St-James-Park.html",
    "content": [
        "May 5 (Reuters) - Arsenal will have to play much better than they did last year at Newcastle United if they are to keep their slim title hopes alive, manager Mikel Arteta said, after a loss last year effectively ended their hopes of qualifying for the Champions League.",
        "A 2-0 defeat at St James' Park last season saw Arsenal eventually finish fifth in the league while Newcastle finished 11th when relegation was a possibility midway through the season before Eddie Howe took over.Sunday's contest is a stark contrast to last season with Arsenal now second in the standings and Champions League qualification in the bag while third-placed Newcastle -- who have lost only once at home -- look to seal a top-four spot.\"It's a very different game. A year ago it was different players, different game. We're going to have to play much better than we did last year, that's for sure,\" Arteta told reporters ahead of Sunday's trip.\"We know it's going to be a really tough game because especially at home they've been really, really good.\"The two teams shared the spoils in January at the Emirates Stadium in what was Arsenal's only goalless draw of the season.\"That was a game we deserved to win, we didn't at the end,\" Arteta added.\"They're a really good side, they are well coached, good players, the right environment around the club right now. So they're in a good place.\"\"They're third in the league and they've merited that... they deserve to be where they are.\"Arteta said they have to wait and see if centre back Gabriel is fit for the game while his defensive partner William Saliba has not yet been ruled out of the season with four games left as the Frenchman is still pushing to play.",
        "Since Saliba was sidelined, Arsenal have dropped points in the title race, playing out three straight draws before losing to Manchester City who now lead the league by a point with a game in hand.\"It's about the healing process. Pain-wise and the things he (Saliba) can do now off the pitch, he's in a good place,\" Arteta said.\"But we have to build that capacity to have the right impact, the right load and to be in good condition to play for the team.\" (Reporting by Rohith Nair in Bengaluru; editing by Pritha Sarkar)"
    ]
}