{
    "articleURL": "/wires/reuters/article-12058361/Japans-Nikkei-falls-amid-stronger-yen-US-bank-jitters.html",
    "content": [
        "TOKYO, May 8 (Reuters) - Japan's Nikkei share average fell on Monday, as investors sold stocks amid the yen's strength against the dollar, while investor concerns surrounding U.S. banks drove a sell-off in banking shares.",
        "The Nikkei index was down 0.65% to 28,969.68 by the midday break, trading below the 29,000-mark for the first time since April 28.The index hit its highest since January 2022 last Tuesday before the market closed for a three-day holiday for the Golden Week break.The broader Topix was down 0.23% to 2,070.67.\"The market fell today partly due to the stronger yen, but also investor sentiment was weak as the Dow ended at a lower level on Friday compared with the beginning of the long weekend in Japan,\" said Jun Morita, general manager of the research department at Chibagin Asset Management.\"There are also lingering worries about another failure of a bank in the U.S.\"The yen gained against the dollar last week after the Federal Reserve hinted at a pause in its monetary tightening cycle.A stronger yen tends to push exporter shares lower as it decreases the value of overseas profits in yen terms when firms repatriate them to Japan.Oil explorers lost 1.57% to become the worst performers among the Tokyo Stock Exchange's 33 industry sub-indexes, followed by banks, which fell 1.08%.Uniqlo brand owner Fast Retailing Co Ltd fell 2.56%, dragging down the Nikkei the most. Technology investor SoftBank Group Corp lost 1.57%.Trading houses rose after Warren Buffet said on Saturday he is more comfortable with Berkshire Hathaway Inc deploying capital in Japan than Taiwan, reflecting the growing tensions between the United States and China.",
        "The billionaire investor recently increased investments in five Japanese trading houses, including Itochu Corp and Marubeni Corp.Itochu rose 1.43% and Marubeni was up 0.37%. (Reporting by Junko Fujita; Editing by Sonia Cheema)"
    ]
}