{
    "articleURL": "/news/article-12052329/Fox-News-warns-media-watchdog-organization-stop-drip-feeding-Tucker-Carlson-clips.html",
    "content": [
        "A letter from lawyers for Fox Corp to Media Matters for America demanded it 'cease and desist' publishing leaked clips of Tucker CarlsonThe watchdog has published several clips of Carlson making off-the-cuff remarks between filming for his showsCarlson departed Fox News, where he hosted the network's most-watched show, on April 25 Fox has warned a media watchdog which leaked behind-the-scenes footage of Tucker Carlson to stop sharing the clips because it is 'confidential intellectual property'.",
        "A letter from lawyers for Fox Corp to Media Matters for America demanded it 'cease and desist' after the left-leaning organization published a series of clips of Carlson making off-the-cuff comments in between filming for his shows.In one, Carlson joked about 'post-menopausal fans' and makes a comment about someone's girlfriend being 'yummy'. In another, he calls a lawyer for Dominion a 'slimy little motherf***er'.The letter addressed to Media Matters for America CEO Angelo Carusone, sent by a lawyer for Fox on Friday, said: 'The unaired footage is FOX's confidential intellectual property; FOX did not consent to its distribution or publication; and FOX does not consent to its further distribution or publication.'Carlson departed Fox News, where his Tucker Carlson Tonight show was the most-watched on the network, on April 25. Sources have linked his firing to his comments about bosses.",
        "Media Matters for America has since shared a series of clips under the banner 'Tucker Carlson tapes.  In another, Carlson said Fox Nation 'sucks' and 'no one' watches it.The legal letter adds: 'This proprietary material was given to you without FOX's authorization.'FOX demands that Media Matters cease and desist from distribution, publication, and misuse of Fox's misappropriated proprietary footage, which you are now on notice was unlawfully obtained.",
        "'We reserve all rights and remedies.' Reacting to the letter, Carusone told the Daily Beast: 'Reporting on newsworthy leaked material is a cornerstone of journalism. For Fox to argue otherwise is absurd and further dispels any pretense that they're a news operation.'Perhaps if I tell them that the footage came from a combination of WikiLeaks and Hunter Biden's laptop, it will alleviate their concerns.'One of the recently leaked clips appeared to have been recorded the same day Carlson had his deposition for the Dominion lawsuit - August 26, 2022.Fox News agreed to pay Dominion $787.5million in an 11th-hour settlement on April 18, moments before a trial was due to begin.Carlson can be seen wiping his face with a makeup wipe and telling his staff the opposition's lawyer 'triggered' him.'That guy, he triggered the s**t out of me,' he can be heard saying on the video, obtained by Media Matters.",
        "''Where are you now? Where do you live?' The amount of times I had: 'First of all, f**k you,' on my lips was like, it was unbelievable. Suggesting that I was - that I was cheating on my taxes?'Holy s**t, 10 hours [with] that slimy little motherf**ker sitting across from me,' he said. 'The amount, it was so unhealthy, the hate...the hate that I felt for that guy.'",
        "The day before, the outlet published more leaked footage of Carlson, where he joked about his 'post-menopausal fans' with his senior staff.Carlson made his first public appearance on Thursday night following his Fox departure with a speech at Oxford Performing Arts Center in Oxford, Alabama, for the annual fundraiser for Rainbow Omega.Carlson, who earned $20 million a year at Fox, joked: 'I'm probably the first unemployed person you ever invited to speak.'It's funny. I never give speeches because I'm working. When I accepted this speech six months ago or something, I didn't realize how much free time I would have.'One never knows, does one?'"
    ]
}