{
    "articleURL": "/wires/reuters/article-12043235/ROY-Garrett-Wilson-embraces-No-1-role-Aaron-Rodgers-endorsement.html",
    "content": [
        "On the day he reported to voluntary workouts with the New York Jets, reigning NFL Offensive Rookie of the Year Garrett Wilson admits being star struck when four-time MVP quarterback Aaron Rodgers entered the weight room.",
        "\"It takes a little time, it probably didn't set in all the way until I caught the first ball from him,\" the wide receiver said of the realization that Rodgers is his quarterback. \"That's a legend out there. He's a Hall of Fame player. We're all blessed. This is something 20-30 years from now, I'll tell my kid -- I played with Aaron Rodgers.\"Wilson said Wednesday he's come around to the reality that Rodgers is his teammate.It took no time for Rodgers to recognize what he could have in Wilson, who drew a quick comparison to former Packers teammate Davante Adams, who also wore No. 17.\"He's a talented guy,\" Rodgers told the Pat McAfee Show. \"I threw him a pass (Tuesday) and just kind of turned and was like: 'Wow.' His ability to kind of get in and out of his breaks ... there's another (No.) 17 I played with for a long time who does it better than anybody. The explosiveness in and out of breaks, the 17 here, is pretty similar.\"Wilson led the Jets with 83 receptions for 1,103 yards and caught four TD passes as a rookie in 2022. Not all of the \"wow\" moments were positive.New York shuttled through four quarterbacks, from Joe Flacco to Zach Wilson, Mike White and Chris Streveler. The Jets scored just 44 total points in the final five games of the regular season.",
        "Wilson had just two games with TD receptions -- hauling in two scores in wins over the Bears and Browns -- and had only one catch for 8 yards when the Jets visited Rodgers at Green Bay on Oct. 16.Wilson said he's humbled and honored by the comparison to Adams, but knows there is a \"long way to go\" for him to reach the same level.He understands there is a delta, but can't quite grasp why Rodgers didn't take him to the New York Knicks' playoff game on Tuesday night. Defensive Rookie of the Year Sauce Gardner and linebacker C.J. Mosley attended Game 2 of the Eastern Conference semifinals series at Madison Square Garden with Jets head coach Robert Saleh.\"I just asked him this morning. I'm trying to figure out why I couldn't get no tickets to the Knicks game,\" Wilson said with a grin. \"I would love to tag along on one of those little trips to the city.\"--Field Level Media"
    ]
}