{
    "articleURL": "/wires/reuters/article-12060517/Abortion-pill-case-heard-conservative-anti-abortion-panel.html",
    "content": [
        "By Brendan Pierson and Jacqueline Thomsen",
        "May 8 (Reuters) - A case brought by anti-abortion groups seeking to ban the abortion pill mifepristone nationwide will be heard next week by a panel of three deeply conservative judges hostile to abortion rights, a federal appeals court revealed on Monday.The Biden administration is expected to urge the 5th U.S. Circuit Court of Appeals panel in New Orleans on May 17 to overturn a court order that suspended the federal government's approval of mifepristone.The administration will be appealing to Circuit Judges Jennifer Walker Elrod, who upheld a Texas law making it more difficult for abortion clinics to operate in the state; James Ho, who has called abortion a \"moral tragedy\"; and Cory Wilson, who supported abortion bans as a Mississippi state legislator.The U.S. Food and Drug Administration, which is named as the defendant in the lawsuit, did not immediately respond to requests for comment.Ho did not immediately return a request for comment. A Wilson staffer said he does not comment on pending cases, and a staffer for Elrod referred Reuters to the court's clerk's office, which said it could not comment.Mifepristone is part of the two-drug regimen used in medication abortion, which accounts for more than half of U.S. abortions.Led by the recently formed Alliance for Hippocratic Medicine, abortion foes claimed in a lawsuit last year that mifepristone is dangerous and that the FDA approved it unlawfully in 2000. Scientific studies have overwhelmingly concluded that the drug, which has been used by millions of women, is safe.",
        "U.S. District Judge Matthew Kacsmaryk in Amarillo, Texas last month sided with the plaintiffs, finding they were likely to win, and suspended mifepristone's approval while their lawsuit goes forward. The U.S. Supreme Court put that order on hold, meaning that mifepristone remains available while the case is appealed.In filings last week, the FDA and mifepristone maker Danco Laboratories said Kacsmaryk's order would both harm the public and destabilize the pharmaceutical industry.The plaintiffs are expected to file a response brief later on Monday.\"Despite those who insist on playing politics and endangering the lives of girls and women, we look forward to a final outcome in this case that will hold the FDA accountable,\" Erik Baptist, a lawyer for the plaintiffs, said in a statement.Ho, who was appointed by former Republican president Donald Trump, was part of a 5th Circuit panel that in 2019 blocked Mississippi's 15-week ban on abortions, but in a separate opinion spoke out against the constitutional right to abortion.The Supreme Court's conservative majority last year used the same case to overturn its landmark 1973 Roe v. Wade decision and find there was no right to abortion enshrined in the U.S. Constitution.In 2021, Ho was in the majority in a 2-1 ruling refusing to block Texas's six-week abortion ban. The Supreme Court later let that law go into effect.",
        "Ho last month also spoke to the conservative Federalist Society's Dallas chapter in defense of Kacsmaryk, who he called a friend, after the Washington Post reported the then-nominee did not disclose to the U.S. Senate ahead of his confirmation hearing a law review article he helped write that criticized protections for people seeking abortions.Elrod, who was appointed by former Republican president George W. Bush, in 2019 wrote the majority opinion for a 5th Circuit decision striking down a key part of the Obamacare health insurance law.Wilson, another Trump appointee, as a state legislator voted to ban abortion once fetal cardiac activity is detected, around six weeks.Whichever party loses the appeal would be able to ask for en banc rehearing from the full 5th Circuit, which has 12 Republican appointees among 16 active judges serving on the court, and then appeal to the Supreme Court.(Reporting By Brendan Pierson in New York and Jacqueline Thomsen in Washington, D.C., Editing by Alexia Garamfalvi and Bill Berkrot)"
    ]
}