{
    "articleURL": "/wires/reuters/article-12058611/Unhappy-return-Sudan-crisis-forces-South-Sudanese-refugees-troubled-home.html",
    "content": [
        "UN: more than 30,000 have fled into South Sudan",
        "Pushed out by civil war, now pushed back by conflictSouth Sudan already facing humanitarian crisisBy Denis ElamuRENK, South Sudan, May 8 (Reuters) - The last place Lina Mijok wanted to go as she fled fighting in Sudan was back to her own country, South Sudan, which she had left as civil war erupted in 2013.But when Sudan's army started battling the paramilitary Rapid Support Forces in the streets around to her home last month, South Sudan was the only place she and her two young children could reach.\"I would not have come back to South Sudan. I would have gone anywhere, but I had no choice,\" the 26-year-old said.She had managed to carve out a new life for herself as a housemaid in the city of Omdurman, across the River Nile from Sudan's capital Khartoum.Then the shots started ringing out and her family had to pack up and leave that behind them - all of them apart from Mijok's husband.He had to stay behind as they did not have enough money to pay for his place on the trucks and buses that carried Mijok, their son and their daughter to the border, a nerve-wracking two days on bush roads.They are now among thousands camping out in South Sudan's Renk County, in a dilapidated university campus, its buildings pockmarked by bullets from fighting a decade ago.",
        "The refugees have made basic shelters out of sticks and pieces of fabric. The United Nations refugee agency, UNHCR, and other aid groups are distributing food, water, buckets, blankets and mats.\"The heat is killing us and some people have gone four days without eating, and there is no place to sleep, and the children are getting sick,\" Mijok said. She hopes the United Nations will help her move to another country.'WHAT SHOULD WE DO? WE DON'T KNOW'The fighting has turned the humanitarian situation on its head.Up to last month, more than 800,000 South Sudanese refugees lived in Sudan, refugees from decades of conflict.Since the fighting erupted in Khartoum, the UNHCR has registered more than 30,000 people crossing into South Sudan, more than 90% of them South Sudanese. The true number is likely much higher, it says.Aid agencies fear the influx will worsen an already dire humanitarian crisis in South Sudan where more than 2 million people are displaced and three quarters of the 11-million-strong population need aid.South Sudan gained independence from Sudan in 2011 after two decades of north-south conflict. Civil war broke out there barely two years later, killing an estimated 400,000 people.\"South Sudan is one of UNHCR´s most underfunded crises already and we are now mobilising to support this new influx,\" agency spokesperson Charlotte Hallqvist said. \"We urge the international community not to forget about South Sudan.\"",
        "Like Mijok, Suzan William, 36, fled the civil war in 2013 and rebuilt her life in Sudan, working as a nurse in Khartoum. Now she is back in her homeland, camping in Renk with her four children.\"People say there is no stability in South Sudan, so we decided to build houses in Sudan. But now also there is no stability in Sudan. What should we do? We don´t know.\" (Reporting by Denis Elamu; Writing by Estelle Shirbon; Editing by Aaron Ross and Andrew Heavens)"
    ]
}