{
    "articleURL": "/sciencetech/article-12060313/Elon-Musk-purge-active-Twitter-accounts-week.html",
    "content": [
        "Elon Musk tweeted on Monday that Twitter is purging inactive accountsMany users are concerned accounts of their dead loved ones will disappearREAD MORE:  How to get YOUR blue tick backElon Musk announced Monday that Twitter is 'purging accounts that have had no activity at all for several years.'",
        "Users immediately shared concerns over losing accounts of their loved ones, noting the tweets are a way to memorialize them.It seems the purge is geared toward lurkers who use the platform yet rarely share updates. Donald Trump has not tweeted since 2021, even though he was banned for over a year, and Apple has never shared anything on its account.According to Twitter's policy, users should log in to their accounts at least once every 30 days to avoid permanent removal due to prolonged inactivity. ",
        "Andrew Tate, an internet personality who was just released from jail for suspicion of organized crime and human trafficking, shared his concerns about the purge.'Very good idea. But my father died and I still read his account daily. Please keep him active,' Tate tweeted.Other people are asking Musk to find a way to memorialize the accounts. While many users fear their loved ones' accounts will be part of the purge, these users can export an archive of the tweets if they can access the account. Go to your Account settings by clicking the 'more' icon in the navigation bar and selecting Your account from the menu.Then click on Download an archive of your data.Another option is to see All My Tweets, connect the website to your account and then enter a person’s Twitter handle. ",
        "All My Tweets creates a file with the last 3,200 tweets shared from that account, which you can then download, save or print - but only if their account is not private.The announcement has also been met with some excitement - removing such accounts would free up long-coveted usernames.But how people can scoop up these names has not been confirmed. Musk warned that the move would cause users' follower counts to drop dramatically.Trump was booted from Twitter on January 8, 2021 due to 'the risk of the US president using the platform to incite further violence.'",
        "The end of an era on Tuesday as Twitter finally removed its famed blue ticks, used to denote the official accounts of world leaders, celebrities and sports stars, from those who refused to pay up at least.",
        "However, the ban was lifted in November 2022, about one month after Musk took the platform over.It has yet to be seen if Trump's account will be removed.However, Apple has never shared a single tweet since joining in September 2011.The account has more than nine million followers but is not following a single person - not even CEO Tim Cook.Twitter has, on several occasions, threatened a purge to kickoff inactive users and let others take the handles - one of the last announcements was in 2019. ",
        "Musk has made several major changes since purchasing Twitter for $44 billion in October 2021, including firing more than 80 percent of the original staff.The CEO has also overhauled the platform, notably allowing anyone to be verified by paying for Twitter Blue and pulling legacy checkmarks from those who do not want to pay the monthly fee.The legacy checkmarks disappeared last month.Under the original blue tick system, Twitter had roughly 400,000 verified users, including Hollywood actors, star athletes, journalists, human rights activists, and public agencies.In the past, the checks meant that Twitter had verified that users were who they said they were as a method to prevent impersonation and the spread of misinformation.But now anyone can buy a Twitter Blue subscription, and it no longer means the user is verified - other than confirming a phone number."
    ]
}