{
    "articleURL": "/wires/reuters/article-12051203/Norway-plans-wider-gas-transport-nationalisation-including-Nyhamna.html",
    "content": [
        "By Nora Buli",
        "OSLO, May 5 (Reuters) - Norway's plan to nationalise gas pipelines owned by the Gassled company also includes an additional goal to take over other assets, including at the Nyhamna processing plant, a letter from the Norwegian energy ministry to the owners showed.In a surprise move, Norway's government last week announced a nationalisation plan that will take effect when many existing Gassled pipeline concessions expire in 2028, but did not say which other assets it would seek to acquire.Norway has become Europe's largest supplier following a sharp fall in Russian gas deliveries amid the war in Ukraine. The country's vast network of pipelines stretch some 9,000 kms (5,600 miles), and is thus a key asset of national interest.The energy ministry said in a letter to licensees, which was seen by Reuters on Friday, its plan included \"other central parts of the Norwegian gas infrastructure that are currently owned by Nyhamna and Polarled, as well as Vestprosess DA\".Much of Norway's gas transportation pipeline network is owned by Gassled, a partnership set up in 2003 by oil companies that were producing gas offshore Norway at the time. It cost billions of dollars to build.In its letter to all licensees, including Shell, ConocoPhillips, Equinor and others, the government said its goal was to have \"complete state ownership of Norwegian gas infrastructure\".",
        "It named the Nyhamna plant, which processes gas from the Ormen Lange field as well as gas delivered via the Polarled pipeline, as one of the assets it aimed to take over.The Polarled pipeline itself, completed in 2015, was also on the government's takeover list, as was Vestprosess, a pipeline and processing system for gas from the Kollsnes and Sture terminals.\"Where takeover possibly requires remuneration, the state's position is that (this) should be based on the present value of future expected tariffs minus ownership costs,\" the letter said.The ministry will now seek consultation with the licensees on its plans, it added.Shell, ConocoPhillips and Equinor were not immediately available for comment when contacted by Reuters. (Reporting by Nora Buli, editing by Terje Solsvik and Jane Merriman)"
    ]
}