{
    "articleURL": "/wires/reuters/article-12039969/Thousands-union-contracts-dissolve-Mexicos-fight-against-pro-company-deals.html",
    "content": [
        "Mexico committed to contract ratification votes under trade deal",
        "After four years, unions have aimed to ratify 24% of contractsRemaining contracts will expireBy Daina Beth SolomonMEXICO CITY, May 2 (Reuters) - Thousands of pro-business union contracts in Mexico are set to expire as Mexico ends a historic campaign to wipe out deals between employers and unions cozy with management that have kept wages low, a key commitment under a North American trade deal.Of 139,000 collective contracts in Mexico, unions will ultimately aim to ratify 33,000, or about a quarter, via worker votes, a requirement to keep them active, Labor Minister Luisa Alcalde said on Tuesday, hours after a final deadline.The remainder will dissolve, although workers will maintain the same pay and benefits.Mexico committed to eliminating these so-called \"protection contracts\" under the United States-Mexico-Canada Agreement (USMCA), a trade pact that replaced the 1994 NAFTA.Labor authorities expected unions to forego holding votes for most contracts, largely because many were designed to protect company interests and had no worker backing or active unions.\"This is historic, because we finally managed to rid the labor market of pretend contracts and fake unions,\" Labor Minister Alcalde said in an interview.\"This is all about having good representatives to defend worker rights and obtain better benefits and salaries.\"",
        "Since the vote process began four years ago, workers have cast ballots on some 20,000 contracts in sectors spanning autos, retail and mining. The remaining 13,000 votes are scheduled through July, although some unions may pull out.Only about 400 contracts have so far been voted down, which some experts see as a sign of conflict of interest in the union-run votes.The Independent Mexico Labor Expert Board, a U.S. advisory committee, said in March the small number of rejected contracts \"raises serious doubts about the credibility\" of the process.The Labor Ministry last month accused a powerful union of stealing ballots during a vote at a Goodyear tire plant, echoing similar allegations at automaker General Motors in 2021, which led to the first USMCA labor complaint.Alcalde said she expects unions to aim to establish new contracts in place of ones that were canceled.\"The first thing is they need to convince workers that they will represent them better,\" she said. (Reporting by Daina Beth Solomon; Editing by Stephen Coates)"
    ]
}