{
    "articleURL": "/wires/pa/article-12038063/Amber-Hill-s-new-approach-paying-traumatic-Olympic-heartbreak.html",
    "content": [
        "Amber Hill has admitted she will never get over the moment she discovered her dream of competing at the Tokyo Olympics had been dashed due to a positive test for coronavirus.",
        "The 23-year-old skeet shooter had her bags packed and had bade farewell to her family when she received the news just two days prior to the opening ceremony in the Japanese capital.All the stars had seemed to align for Hill, who was to have gone into her second Games as the reigning world number one and one of Team GB’s strongest hopes to stand on top of the podium.Instead, she found herself isolating at home where her mental health deteriorated and she spent sleepless nights seriously considering quitting her sport.",
        "“It was one of the hardest moments of my life and it’s something I don’t feel like I’ll ever get over,” Hill told the PA news agency.“What I found really hard was that I was at the best point of my career, my training was perfect, and I was genuinely feeling as happy as I ever had.“The disappointment of not knowing how that Olympic journey was going to end for me was heartbreaking. I had resentment towards the sport, I was bitter towards it all. I’d lie awake at night worrying about everything.",
        "“I didn’t realise at the time, but I was going through a traumatic experience. I got into a very dark place with it all and I was ready to quit.”",
        "Hill, a precocious junior who became her sport’s youngest winner of a World Cup series at the age of 15 in 2013 and had made her debut at the Rio Olympics, soon realised she required more than just the support of her family and friends to help her through.Working with a psychologist recommended to her by British Shooting, Hill learned to take a step back from the sport to which she had devoted most of her life since the age of eight, and began to prioritise her life away from the range.She married her long-term partner in February this year – something she admitted she would have previously struggled to schedule – and is also spending more time pursuing business interests that remain, for the time being, under wraps.Quietly, Hill’s shooting career began to flourish again. In 2022, she won three medals at the World Championships in Osijek, European gold in Nicosia, World Cup golds in Nicosia and Changwon, and a trio of European golds in Larnaca.She said: “I began to understand that as much as I believed that I was putting myself first, I really wasn’t. Everything was put on hold because of my shooting schedule. I realised I had to start focusing on the things that make me happy in daily life.",
        "“I wasn’t in a great place with the sport, but I knew I had people who relied on me. I went to competitions with no expectations again, like I had when I first started competing, and that’s where the success really came from.“It was totally unexpected, but last year was my most successful to date. I’ve had some massive low points and I’m surprised I’ve managed to push through. But I feel like I have a much healthier relationship with my sport.”",
        "Arguably the most significant of Hill’s sporting achievements in 2022 was her European title in September that confirmed a quota place for Paris – meaning she has effectively spared herself the potential insecurity of qualifying going down to the wire for what will be her second Games.She is likely to go the French capital as a gold medal favourite but confesses to still struggling to come to terms with her gruelling ascent to the summit of her sport – and much better equipped should she come up short against those inevitable external expectations.“Regardless of what the outcome is, I realise now that there is so much more to my sport than just a medal around my neck,” Hill added.“It’s got to fit in with what I want to do and what makes me happy. If the day comes when it doesn’t, then it’s clearly not for me any more.”"
    ]
}