{
    "articleURL": "/tvshowbiz/article-12054397/Gemma-Collins-splashes-Fortnum-Mason-haul-lavish-Coronation-bash.html",
    "content": [
        "Gemma Collins threw a party fit for a King on Saturday as she celebrated the Coronation in lavish style at her £1.3m Essex mansion. ",
        "The former TOWIE star, 42, who is no stranger to splashing the cash, spared no expense as she purchased an enormous two trollies worth of Fortnum and Mason goodies for the occasion.Making no secret of her excessive purchases, she gave a followers a glimpse inside her 'very Royal afternoon tea party' as she shared photos to her Instagram Story. The TV personality enjoyed a King Charles cake and themed cookie box amongst other treats, while decorating her house with flags and masks. As she got ready for the main event, Gemma's preparations began the day before with her travelling into London to collect food and stop off for a quick photo in front of Buckingham Palace. ",
        "Speaking on her Story from Fortnum and Mason, she said: 'So I am all ready for the Coronation tomorrow guys the limited edition stuff here for the Coronation is unbelievable.'She later added: I’m so excited about the coronation #king how are you all feeling mixed reviews however I do love the King Charles because of all his work he does with animals and nature and @princestrust I’m doing a very royal afternoon tea party with my family how are you celebrating?'Gemma shot onto our screens in 2011 when she joined the cast of The Only Way Is Essex as a humble car sales woman, but her life has changed drastically since.",
        "And for the four years that followed she became a household name on the much-loved reality show with her iconic one liners and dramatic arguments.Since leaving the show she's amassed a huge platform and 2.2million Instagram followers and has gone on to make millions form various businesses, TV appearances and brand deals.After stacking up the cash Gemma - who is reportedly net worth of £7.3million - has not been shy showing off her lavish trips away and designer wardrobe. Gemma spent the pandemic living in The Dorchester, 'like Judy Garland', she told MailOnline -  although Judy Garland would have sent out for KFC Bargain Buckets, which Gemma did.There have been book deals, clothing deals -she's the current face of New Look - endorsements and a lot of shopping along the way.",
        "Speaking about her spending habits, the TV star previously told MailOnline: 'At one point I had money to burn. I had Knightsbridge Fever.'I was spending £50K a day in Gucci. But shopping gets boring after a while when you can afford it.''For me, it was a form of self-harm. Sometimes it's the thrill you are after — not the stuff. 'I can understand why Winona Ryder nicked that stuff [the actress was convicted in 2002 of shoplifting designer goods worth $5,000 from Saks Fifth Avenue].' "
    ]
}