{
    "articleURL": "/wires/ap/article-12060661/Stalled-gun-bill-advances-Texas-new-mass-shootings.html",
    "content": [
        "AUSTIN, Texas (AP) - Facing new pressure over gun violence in Texas after two more mass shootings, Republicans on Monday unexpectedly allowed a bill that would raise the purchase age for semiautomatic rifles from 18 to 21 to advance out of a House committee - even though the proposal has almost no chance of becoming law.",
        "The surprise move revealed faint momentum for gun control advocates after a weekend mass shooting at an outdoor mall near Dallas, but at the same time underscored how Texas Republicans are so resistant to gun restrictions that even clearing a small legislative hurdle caused supporters to celebrate.Two Republicans joined Democrats in an 8-5 vote on the House Select Committee on Community Safety to advance the bill, which Republican Gov. Greg Abbott has previously spoken against. It is unclear when or if the proposal would get a full vote in the Texas House with just a few weeks left to pass any new laws.\"It doesn't have the support of the Legislature,\" said Republican state Rep. Ryan Guillen, who chairs the committee and voted against the measure.Abbott has shown no appetite for revisiting gun restrictions after two mass shootings in the span of a week. The first took place in Cleveland, northeast of Houston, where a man killed five of his neighbors with an AR-style rifle after they confronted him about shooting rounds in his yard.The bill that advanced Monday had languished for weeks prior to Saturday's shooting that left eight people dead at Allen Premium Outlets, a sprawling outdoor shopping center.",
        "Before the vote, protesters´ chants of \"Do Something!\" echoed through the hallways of the Capitol in the country´s largest red state. Protesters eventually camped outside the House chamber and chanted at lawmakers as they entered.",
        "They included several relatives of victims of a mass shooting a year ago at Robb Elementary School in Uvalde. Some of them stood holding photos of their slain children, and some wept following the vote.One of the Republicans who voted in favor of the bill was state Rep. Sam Harless, who through his office declined to be interviewed. \"It is not his intention to capitalize with media coverage on the misery and suffering of those who have lost loved ones in these tragedies for simply voting his heart, his conscience, and his district,\" Ron Hickman, Harless' chief of staff, said in an email.The push to raise the purchasing age has been led for months in the Capitol by relatives of the 19 children and two teachers who were killed in Uvalde when an 18-year-old gunman with an AR-style rifle opened fire in a fourth-grade classroom.Mack Segovia, whose stepdaughter, Eliahna, was killed at Robb Elementary, attended Monday's rally wearing a shirt with a photo of the girl in her softball uniform.\"It happened again. And it´s going to happen again and again and again,\" Segovia said. \"It happened this weekend in a mall. You´re not safe anywhere. ... It´s going to strike again, we just don´t know where.\""
    ]
}