{
    "articleURL": "/tvshowbiz/article-12039803/Nicola-Peltz-poses-underwear-extravagant-Met-Gala-jewellery.html",
    "content": [
        "Nicola Peltz looked sensational as she posed in her underwear in a pictured shared on Instagram on Tuesday.",
        "The actress, 28, could be seen sitting in front of a mirror in New York as she was being dressed for this year's Met Gala in the city.She wore a black tube top and some matching underwear, as well as a pair of sheer stockings.A member of her style and make-up team could be seen dressing her for the event which she attended with her husband Brooklyn Beckham, 24, at the Metropolitan Museum of Art in Manhattan.In another picture, Nicola gave a close-up look at the dazzling costume jewellery she wore for the evening. ",
        "Brooklyn and Nicola put on a loved-up display as they arrived at the Met Gala on Monday.The son of fashion designer Victoria Beckham and her football club owner husband David showed off his edgy sense of style as he wore a semi-sheer black shirt which left his chest on show.He wore a black jacket and matching trousers with a pair of chunky-souled shoes in the same colour.Aspiring chef Brooklyn stood arm-in-arm with Nicola as she wore an off-the-shoulder white dress which featured an expansive sheer train.The pair both added a touch of sparkle to their outfit by wearing matching diamond and pearl necklaces as they posed-up at the star-studded event.Nicola's glamorous gown featured delicate ruffled detail on the corset top section, with the shaped dress perfectly accentuating her hourglass figure.",
        "The skirt reached right down to the ground while a black bow sat on her waist.She wore lashings of make-up to highlight her pretty features and accessorised with a pair of dazzling earrings. ",
        "The 2023 Met Gala returned to the Metropolitan Museum of Art in New York City on Monday evening, with everyone from Kim Kardashian to Paris Hilton attending the annual fundraising event.Since 1948, stars have ascended the majestic staircase into a very exclusive party where no selfies are allowed. In keeping with tradition, the event was held on the first Monday of May. It was scheduled to begin at 6:30PM EST on May 1, 2023. This year, the ball's theme was Karl Lagerfeld: A Line of Beauty. The late German designer was Chanel's long-time creative director. He passed at age 85 in 2019. His beloved cat, Choupette, was even invited to the festivities.The decision to honour Karl has sparked controversy given the many offensive remarks he made over the years, from slamming the #MeToo movement to opposing same-sex marriage.'I’m against it for a very simple reason: In the 60s they all said we had the right to the difference. And now, suddenly, they want a bourgeois life,' he told Vice of same-sex marriage. ",
        "'It’s difficult to imagine—one of the papas at work and the other at home with the baby. How would that be for the baby? I don’t know. I see more lesbians married with babies than I see boys married with babies. And I also believe more in the relationship between mother and child than in that between father and child.' ",
        "While he ultimately showed his support for same-sex marriage at his spring 2013 Chanel haute couture show, he still said he was 'less keen' on same-sex couples adopting children, according to AP.Along with the Vogue editor-in-chief, Anna Wintour, who runs and hosts the annual event, the 2023 Met Gala was also co-hosted by Penelope Cruz, Dua Lipa, Michaela Coel and also Roger Federer. While the show may be known for its glitzy and over-the-top red carpet - with details of what occurs inside often remaining mysterious - at its heart, it is a fundraising event for the Metropolitan Museum of Art's Costume Institute. Last year, the 2022 Met Gala alone raised a grand total of $17.4 million, reported Billboard. This year the price of admission has been raised from $30,000 to $50,000, according to Page Six.",
        "Even if you have the funds, that doesn't guarantee you entry into the party.Every guest has to be invited, and a waiting list exists for the coveted golden ticket.And status matters, according to The New York Times, meaning the hottest stars are a shoo in for an invite. Paris Hilton was among the big names attending this year, in what was her first Met Gala.Meanwhile, Blake Lively, a frequent attendee, announced she would not be at the party.",
        "'I will be watching,' she said, according to People.Elle Fanning, Kim Kardashian and La La Anthony were among the other celebs attending. As for Wintour's role in the bash, Vogue's editor-in-chief organises the party and oversees the guest list and even the menu. She has served as the Met Gala's chairwoman since 1994 and continues to serve look after look at every event.  "
    ]
}