{
    "articleURL": "/wires/reuters/article-12049445/7-Eleven-spin-jeopardise-growth-CEO-says-pushing-ValueAct.html",
    "content": [
        "By Ritsuko Shimizu",
        "TOKYO, May 5 (Reuters) - A spin-off of 7-Eleven would jeopardise the convenience store chain's future growth by cutting it off from its parent's strength in the food business, the chief executive of Japan's Seven &amp;amp; i Holdings Co Ltd told Reuters.The comments from Ryuichi Isaka come as he faces a call for his ouster from shareholder ValueAct Capital, the San Francisco-based investment firm that holds a 4.4% stake in the sprawling Japanese retail conglomerate.ValueAct has long been critical of Seven &amp;amp; i's conglomerate structure, calling for a spin-off of the 7-Eleven chain or for a sale of the entire company, but Isaka said that would not be in the chain's best interests.\"When we think about the growth of the convenience store business over the next five to ten years, we are open to considering all options but think it is not the right decision to spin off right now,\" Isaka said in an interview late on Thursday.\"The risk and probability of 7-Eleven Japan's growth coming to a halt would be very high if the company's product development resources were to be cut off,\" he said.In April, ValueAct ratcheted up the pressure on the company, calling for Isaka's departure and saying he was responsible for a \"flawed strategy\".",
        "The contentious battle highlights the vocal role shareholders - including foreign ones - are increasingly taking as they push for better returns at some of Japan Inc's heavyweight companies.ValueAct also wants to replace three other directors at an annual shareholder meeting later this month. Seven &amp;amp; i says such proposals would hurt long-term value by disrupting its ongoing transformation. It has urged shareholders to back its slate of board nominees.Isaka said 7-Eleven is reliant on staff and know-how from Seven &amp;amp; i's supermarket businesses, such as Ito-Yokado, in developing products for its \"Seven Premium\" private brand.In overseas markets, not just Japan, there is a correlation between sales of fresh foods such as bento boxed lunches and the number of customers, he said.To take advantage of its strength in food, the company is looking to build a supply network of original products in the United States and Vietnam, he said. (Reporting by Ritsuko Shimizu; Writing by David Dolan; Editing by Sonali Paul)"
    ]
}