{
    "articleURL": "/news/article-12039917/RBA-rate-hike-slammed-Mark-Bouris-Ex-Celebrity-Apprentice-host-calls-unncessary.html",
    "content": [
        "Interest rate raised again on TuesdayRaise comes despite expert predictionsA decision by the Reserve Bank of Australia to raise interest rates has been slammed as a 'slap in the face' for Aussies. ",
        "On Tuesday, the RBA surprised experts by raising interest rates and taking the cash rate to an 11-year high of 3.85 per cent.The move - the 11th rate rise during the past year - came despite widespread predictions that the rate would be held by the RBA. Businessman and ex-Celebrity Apprentice host Mark Bouris has slammed the hike as 'completely unnecessary' in a fiery video message. ",
        "'Are they serious? Are they really, really serious? Do they want to break this economy?' he said.'Do they want to break the backbone of Australian mortgage holders?'This is going to force something to break, from my point of view. I just think they've gone way too far. They have to stop this. 'They have to stop worrying about what the data says. They've got to look at the human impact.'Mr Bouris is one of Australia's top financial advisors and founder of mortgage lender Wizard Home Loans. The latest increase means a borrower with an average $600,000 mortgage will see  monthly repayments rise by $95 to $3,555.That's based on a Commonwealth Bank variable rate rising by 25 basis points to 5.89 per cent, up from 5.64 per cent.The 30-day interbank futures market had wrongly predicted a rate pause, and the cash rate peaking at 3.6 per cent, following March's rate rise. ",
        "A Bloomberg survey of 30 analysts had 21 expecting no change to the cash rate and only nine correctly predicting a 25 basis point rate hike.Mr Bouris said the interest rate hike was 'completely unnecessary'.'They’re saying inflation is still too high at 7 per cent. They’re saying that unemployment is still too low at 3.5 per cent,' he said.'For me, they should have just paused and waited to see what happens with the interest rate increases they’ve already jammed us with.'It's all about data. What about the impact on people? 'The people you are crushing around the country. This interest rate increase is a slap in the face, from my point of view, and I think it was completely unnecessary.'His comment comes as new data released by the Finance Brokers Association of Australia revealed how Aussies around the country were struggling with finances. ",
        "The data found people are cancelling holidays taking on additional work and cutting back on spending in record numbers.The 11th rate increase since May 2022 means borrowers have copped the most severe pace of monetary policy tightening since the era of the target cash rate began in January 1990. The 3.75 percentage points of increases in a year is the most since 1989, during an era of 18 per cent interbank lending rates. ",
        "The RBA is expecting inflation to remain above its two to three per cent target until mid-2025. Treasurer Jim Chalmers, due to deliver his second Budget on Tuesday next week, said the latest rate rise would be difficult for borrowers.'This is a really difficult decision for a lot of Australians under the pump,' he said. 'This is a reminder that inflation remains the primary challenge in our economy.' "
    ]
}