{
    "articleURL": "/tvshowbiz/article-12044989/Blake-Lively-sizzles-photos-recent-night-jokes-took-hair-date.html",
    "content": [
        "Blake Lively took to Instagram on Wednesday to share sultry snapshots from her night out at the reopening of the Tiffany &amp; Co. flagship store in NYC.",
        "The 35-year-old actress - who has joined her husband Ryan Reynolds in Wrexham - looked gorgeous in a brown leather Brandon Maxwell dress.She teamed the ensemble with extra voluminous, springy curls that swelled around her head.Blake joked on social media, '@tiffanyandco givin' me a reason to take my hair out on a date. We're goin' steady now.' The long-sleeved, clinging look featured buttons down the front and a matching belt that accentuated the star's slim waist.",
        "In another snapshot posted in her Instagram Stories the mother-of-four shared a blurry image of herself flipping her blonde locks.She wrote over the outtake: 'For anyone wondering how to get the look...'The photo showed the bombshell against a gray wall as she modeled her stunning outfit.Blake left the top portion of her dress unbuttoned, making it a plunging look that exposed her cleavage.And on the lower end she also left the garment unfastened, making it an even sexier look as she flaunted her legs.The silver screen siren rounded out the presentation with a pair of chunky, brown, open-toe heels.Lively wrote in a caption to her 39.6 million fans, 'My kinda breakfast spot: @tiffanyandco. #thetiffanylandmark.'Thank you for having me &amp; my mama. What. A. New. York. Moment.'",
        "The Hollywood fixture also gave her audience a closeup look at her coordinating mocha-colored manicure.",
        "She showed off her incredible post-baby body just two months after she welcomed her fourth child in February.Like their other three children — James, seven; Inez, six; Betty, three — Blake and Ryan are opting to keep their youngest child's name a secret. Blake attended the celebrity-packed affair with her mother Elaine Lively. Blake's mother Elaine looked classy in a black suit, which she wore with the jacket open.She had on a powder blue shirt that complemented the robin egg blue of the carpet, which is associated with Tiffany &amp; Co.Missing from the outing was Blake's husband Ryan, who purchased the Welsh football team Wrexham in 2020 with Rob McElhenney.",
        "Last month Wrexham made history by earning promotion back into the English Football League.And Blake joined her spouse at the open top bus parade in Wrexham on Tuesday evening, after the couple missed Monday's Met Gala.The actress took to Instagram hours before the swanky event to confirm she wouldn't be attending.The team's journey to promotion has earned worldwide attention, with viewers rejoicing when they finally earned the upgrade with a 3-1 victory over Borehamwood. "
    ]
}