{
    "articleURL": "/wires/pa/article-12054527/Buckingham-Palace-balcony-appearance-serves-poignant-finale-memorable-day.html",
    "content": [
        "It was the ceremonial finale of a day for the history books – the Buckingham Palace balcony moment featuring the newly crowned King and Queen.",
        "Charles and Camilla – joined by family members including the Prince and Princess of Wales, Prince George, Princess Charlotte and Prince Louis, the Duke and Duchess of Edinburgh, and the Princess Royal – stepped out into the rain at 2.25pm.In the minutes beforehand, members of the public made their way slowly towards the Palace behind controlled lines of police officers, before a final excited scurry over to the railings to claim a front-row view.Smiling and waving, the determined royal fans were undeterred by the grey drizzly day which had resulted in a sea of raincoats, ponchos and umbrellas.",
        "The sound of cheers swelled when the royals appeared on the balcony and shouts of “God save the King” could be heard.There were even screams from the thousands of excited fans and the volume of cheers turned up a notch when Charles and Camilla waved.After a momentous morning, the royal family could perhaps pause for a moment, look out across the crowds on The Mall and take in the atmosphere which has been building all week.The Queen smiled as she appeared to speak to the King about the wet weather, raising her outstretched palm towards the sky.",
        "At one point, the Princess of Wales placed a reassuring hand on her son Prince Louis’ shoulder when they joined the King and Queen on the balcony at Buckingham Palace.",
        "While Prince George stood with the King’s other pages of honour, Louis and his sister Princess Charlotte joined their parents.Kate, with some help from the Duchess of Edinburgh, encouraged Louis and Charlotte to move to their left to stand in front of her.Before long, ears pricked up to the unmistakable whir of approaching aircraft and eyes turned to the sky.It was not the spectacular six-minute flypast that was hoped for, and was instead scaled down to two minutes and 30 seconds due to “unsuitable weather conditions”.More than 60 aircraft from the Royal Navy, British Army and Royal Air Force had been due to take part.",
        "But the event only involved helicopters and the Red Arrows aerobatic display team – however, the crowd appeared no less thrilled.The royal family spent a little under 10 minutes on the balcony before going back inside.The King and Queen then re-emerged moments later to the delight of the crowds watching below.Camilla then called for their pages to help them rearrange their trains, and they went back into the palace shortly before 2.40pm, with the King lingering for one final wave.Michelle Roycroft, from London, was one of the first people to make it to the palace ahead of the big moment.",
        "“I’m absolutely blown away. So excited,” she said as she reached the railings.Ms Roycroft had been waiting since 7am but was not bothered by the rain.“It didn’t matter at all,” she said.Speaking about her experience of watching the balcony appearance and the flypast, she said afterwards: “Absolutely made my day. The most memorable, magical day.”The Buckingham Palace balcony is one of the most famous in the world and one the royal family have stepped out onto many times before, often as part of a celebration.Memorable appearances from the last few years include William and Kate’s wedding in 2011 – when the crowd was treated to not one but two kisses – and the late Queen’s Platinum Jubilee last June where Louis’s comical reactions stole the show.The first recorded royal balcony appearance took place in 1851, when Queen Victoria stepped onto it during celebrations for the opening of the Great Exhibition.Since then, royal balcony appearances have marked many occasions from Queen Elizabeth II’s annual official birthday celebrations to watch the RAF Flypast at the end of Trooping the Colour, royal weddings, jubilees, as well as special events of national significance such as the 75th anniversary of the Battle of Britain."
    ]
}