{
    "articleURL": "/travel/article-12052015/Flight-attendant-reveals-alcohol-wipes-carry-on.html",
    "content": [
        "Cici, from the US, shared her four tips to using alcohol wipes on a flightThe first tip she recommends is for passengers who start feeling ill on planesOther uses include putting one in your shoe, and wiping underarms and phone A flight attendant has shared a handy item that people should always bring on their carry-on.",
        "Cici, who goes by @cici.inthesky on TikTok and is from the United States, has earned more than 280,000 followers on the video-sharing platform, providing tips for fliers to make their trips more comfortable.In one of her latest videos, which has more than 320,000 views at the time of writing, she recommends people bring a box of alcohol wipes.'Something you want to make sure you have on your carry-on for your next flight,' Cici, who started her career as a flight attendant aged 46, begins with in the video.",
        "'Head over to the drug store… go to the first aid section, grab some alcohol wipes. Here's four uses for your next trip.'The first tip Cici recommends is for passengers who start feeling ill on planes. 'Next time you're on a flight and you're feeling a little nauseous you can take one of them out, just open it up and smell it, and it helps with nausea,' she said.The second use for the alcohol wipes was to get rid of nasty odors in footwear. Cici advises people to pop one inside their shoes and 'it'll help with smells.'Speaking of personal hygiene, the flight attendant said a third way to use an alcohol wipe was to use it on your underarms if you had forgotten deodorant.",
        "And finally, Cici says people can use a wipe to clean their phones.People in the comments thanked the flight attendant for enlightening them.",
        "'I had no idea for nausea. I am going to borrow some from work,' one person wrote.'For nausea! Genius. My tummy gets a little nervous on flights and I just started a traveling job. Thanks!' another added.'All of these are great, everyday, not even on a plane, tips,' a third social media user said.Someone else added: 'I get nauseous all the damn time and I use alcohol at home to calm it down but I never thought to travel with it! Putting a few in my makeup bag now.''The underarm trick definitely works! But do it only in a pinch, it's very drying on that sensitive skin. But it works!' one comment read.'As a nurse I used them for all of these mentioned uses!!' another person said. On her blog, the flight attendant gave a glimpse into how she was landed a job in the industry after her sister also made the switch.'I did not tell anyone what I was doing except my sisters. I updated my resume and my sister coached me through the hiring process. I did a lot of research on the internet and started practicing my interviewing techniques,' Cici said.",
        "She applied to a number of airlines during their open hiring windows, and got calls back from Delta and American Airlines.Cici described the recruitment process as 'rigorous' and she made it through 'multiple steps' before she was interviewed in person.",
        "Despite it being a highly competitive field, she said she was 'lucky' to get a job offer from Delta.She was then put through an 'intense' eight-week training course, but she noted it had dropped down to six for a majority airlines these days. 'We were taught safety procedures, emergency protocols, and customer service techniques. We also had to pass numerous written and practical exams before we could graduate,' the flight attendant said.Cici added it was 'one of the hardest things I've done in my life' and likened it to 'boot camp.'Previously another flight attendant Cierra Mistt, who worked for American Airlines, shared secrets that she had learned - including how to score cheap tickets. According to the TikToker, airlines release deals on Tuesday, Wednesday, and Thursdays - and she even suggested using an app to change the location of your IP address to lower prices.'If you want a cheap flight, look for flights on Tuesdays, Wednesdays, and Thursdays,' she suggested in a viral video.'That's when flights are the cheapest.",
        "'I highly suggest you use a VPN so they don't know what country you're searching from because normally, if you're looking in the United States, they're going to jack those prices way up.'"
    ]
}