{
    "articleURL": "/wires/reuters/article-12048687/Marcos-says-U-S-access-Philippines-bases-not-meant-offensive-action.html",
    "content": [
        "By Matt Spetalnick and David Brunnstrom",
        "WASHINGTON, May 4 (Reuters) - Philippines President Ferdinand Marcos Jr said on Thursday his agreement this year to grant the United States access to more military bases in his country was not intended for use for \"offensive action\" against any country.Speaking to a U.S. think-tank in Washington, Marcos said he had made that point to Chinese officials during recent talks. He also said the U.S. had not asked the Philippines to provide troops in case of war between China and the U.S. over Taiwan.Marcos told the Center for Strategic and International Studies that the 2014 Enhanced Defense Cooperation Agreement (EDCA) that allows access to bases in the Philippines was conceived to deal with the effects of climate change.\"The foreign minister of China just visited with me ... and I told him and I assured him that no, these are not ... intended to be military bases to attack, to move against anyone, any country, not China, not any country,\" Marcos said.He said use of EDCA bases for \"offensive action\" would be outside the parameters of what Manila had discussed with the United States and added that Washington had never brought up the possibility that they would be used as \"staging areas\" for offensive action against any country.",
        "Manila's ties with Washington have deepened under Marcos and he granted the U.S. military access to four more bases in February, something China said was \"stoking the fire\" of regional tension.Experts say the United States sees the Philippines as a potential location for rockets, missiles and artillery systems to counter a Chinese amphibious invasion of Taiwan, which China claims as its own territory.U.S. Defense Secretary Lloyd Austin said after a meeting of the defense and foreign ministers of the United States and the Philippines last month that it was \"too early\" to discuss what assets the United States would like to station at Philippine bases.Marcos came to Washington for a summit with President Joe Biden seeking clarity on the extent of Washington's commitment to protect his country under a 1951 security pact, amid rising tensions in the South China Sea, where Manila has rival claims to Beijing's, as well as tensions over Taiwan and North Korea.Biden said after their meeting on Monday the U.S. commitment to the defense of its ally was \"ironclad,\" including in the South China Sea, and after a visit by Marcos to the Pentagon on Wednesday the two sides issued a six-page document of \"bilateral defense guidelines\" laying out the extent of U.S. commitments to the Philippines under their 1951 mutual defense treaty.",
        "Marcos said relations between Washington and Manila were back on a \"normal road of partnership\" and needed to evolve to make them more responsive to present and emerging challenges.Under his predecessor Rodrigo Duterte, relations with U.S. had soured as Duterte turned the Philippines sharply away from its former colonial ruler and built closer ties with Beijing. (Reporting By David Brunnstrom, Matt Spetalnick and Eric Beech; Editing by Leslie Adler and Sandra Maler)"
    ]
}