{
    "articleURL": "/wires/reuters/article-12049397/Marcos-says-Philippines-bases-useful-Taiwan-attacked.html",
    "content": [
        "By Michael Martina, Don Durfee and David Brunnstrom",
        "WASHINGTON, May 4 (Reuters) - Philippines President Ferdinand Marcos Jr said on Thursday that granting U.S. access to Philippine military bases was a defensive step that would be \"useful\" if China attacked Taiwan.Marcos, speaking at the end of a four-day visit to Washington that included a summit with President Joe Biden and an agreement to update the countries' nearly 72-year defensive alliance, did not respond directly when asked whether the United States could place weapons at the bases if China attacked Taiwan.Marcos told Reuters the Enhanced Defense Cooperation Agreement (EDCA) reached with the United States in 2014 was originally conceived to improve disaster responses.\"Now there's an additional aspect to it,\" he said. \"And that is ... tensions across the Taiwan Straits seem to be continuing to increase. Then the safety of our Filipino nationals in Taiwan becomes of primordial importance.\"\"And so these EDCA sites will also prove to be useful for us should that terrible occurrence come about,\" he added, referring to an invasion of Taiwan.A February agreement to allow the U.S. to use four additional Philippines military bases is highly sensitive for Manila, which wants closer military ties to the United States without alarming China, its largest trading partner.China has said that decision was \"stoking the fire\" of regional tension.",
        "Marcos said Washington \"has not proposed any kind of action for the Philippines in terms of taking part in the defense of Taiwan.\"\"It's of a defensive nature and maybe a civil-defense nature, when I talk about the disasters and the evacuation of our Filipino nationals,\" he said.CONCERN ABOUT CHINAMarcos came to Washington seeking clarity on the extent of Washington's commitment to protect his country amid rising tensions in the South China Sea, where Manila and Beijing have rival claims, as well as tensions over Taiwan and North Korea.The trip, which included the first White House visit by a Philippine leader in 10 years, marked a sharp change in tone from the administration of his predecessor Rodrigo Duterte, who turned the Philippines away from its old ally and sought closer ties with China.Experts say the U.S., for its part, sees the Philippines as a potential location for weapons to counter a Chinese amphibious invasion of Taiwan, which China claims as its own territory.U.S. Defense Secretary Lloyd Austin said after a meeting with Philippine officials last month it was \"too early\" to discuss what assets the United States would like to station at Philippine bases.Speaking earlier on Thursday to a U.S. think thank, Marcos said he told China's foreign minister that the EDCA sites were not intended for \"offensive action\". He also said Washington had not asked the Philippines to provide troops if there were a war over Taiwan.",
        "Biden said on Monday that the U.S. commitment to the defense of its ally was \"ironclad,\" including in the South China Sea, and that the guidelines issued on Wednesday laid out treaty commitments if either side were attacked in the South China Sea.JOINT PATROLS TO START THIS YEARMarcos said that Manila had agreed in principle to joint South China Sea patrols with the United States, Australia, Japan \"and even South Korea\" and that he expected them to start this year. He said the patrols would help preserve freedom of navigation in the South China Sea, where China has a growing military presence.He said Manila was also discussing a trilateral defense treaty with the United States and Japan. Marcos did not specify what that agreement would entail.Marcos said the Philippines had \"made a good start\" in talks with China about contentious fishing rights.\"I explained to President Xi that last year was the first year in the entire history of the Philippines where we had to import fish, which is a ridiculous situation for a country that consists of 7,100-plus islands,\" he said.\"I told President Xi ... perhaps we can take the little step of allowing, once again, our fishermen to ply their trade,\" he added.Marcos also said his country and China needed to resolve disputes over oil and gas exploration as quickly as possible.",
        "(Writing by David Brunnstrom. Editing by Gerry Doyle)"
    ]
}