{
    "articleURL": "/wires/ap/article-12060321/Sick-Chastain-drawing-ire-fellow-NASCAR-drivers.html",
    "content": [
        "KANSAS CITY, Kan. (AP) - Ross Chastain used to be known primarily as the driver with the family roots in watermelon farming, and whose victory lane celebrations usually involved standing on the roof of his car and smashing a melon to pieces on the pavement.",
        "Now, he´s becoming known for an aggressive driving style that is repeatedly rubbing others the wrong way.The latest incident came Sunday at Kansas Speedway, where Chastain first earned a torrent of expletives over the radio from Kyle Busch, then squeezed Noah Gragson into the wall with about 60 laps to go. The latter dust-up led to a wild scene on pit road, where Chastain threw a haymaker at Gragson and the two had to be pulled apart by security.\"I´m sick and tired of it,\" Gragson said afterward, while dropping a few expletives of his own. \"The guy runs into everyone. When you have guys like Chase Elliott and other guys telling you to beat his ass, everyone is just sick of him.\"The incident came six days after the NASCAR Cup Series ran its rain-delayed race at Dover, and Chastain got into the back of Brennan Poole, sending him up the track and taking Kyle Larson out of the race in the process.Larson vented over his radio about Chastain while Poole was more pointed in his criticism during a televised interview.",
        "\"I haven´t really seen the replay, but it felt like I just got ran over really for no reason 80 laps into the race,\" he said. \"Doesn´t make any sense to me. I guess that´s something he´s been known to do here recently. Probably needs to get his butt whooped.\"",
        "Last month, Denny Hamlin had a $50,000 fine and 25-point penalty upheld after he acknowledged on his weekly podcast that he intentionally wrecked Chastain on the last lap of the Phoenix race in March.\"I got no respect from him,\" said Hamlin, who won Sunday's race at Kansas, \"so I chose not to give him any.\"Chastain, who was fifth at Kansas and leads the NASCAR Cup Series points standings, was even criticized by Hall of Famer Rusty Wallace, who was a guest analyst on the Fox broadcast at Dover: \"He's got a steering wheel in his hand and a brake and a gas (pedal) at his feet. He could have controlled that a little better. That was a little too aggressive, in my opinion.\"Back in Wallace's day, it wouldn't have taken long for someone to retaliate. Dale Earnhardt had a reputation for policing the way drivers acted on the drack, and many others from NASCAR's heyday did the same thing.Yet the furor also begs the question: Is Chastain exactly what NASCAR needs these days?The series has struggled to attract audiences, and sections of empty seats at Kansas Speedway on a bright, sunny Sunday were the latest evidence of it. Many drivers have told The Associated Press that one of the series' problems is the lack of identifiable stars in the Cup Series.",
        "Perhaps Chastain can embrace the role of the villain. There's a fine line to walk between creating drama and creating havoc, though.Take the incident with Busch on Sunday. Chastain was racing him hard shortly before Busch crashed out of the race - Chastain had nothing to do with that - and the two-time series champion often regarded as something of a villain himself lit into him over the radio.\"He's pissed because I'm pissed that he races like an (expletive),\" Busch told his team, \"and so I doored him twice down the backstretch like, `This is your warning, boy.´\"Apparently the warning wasn't heeded. Or at least, not where Gragson was concerned.\"Just got fenced by him,\" Gragson said in explaining their pit-road altercation. \"Nobody else has the balls to at least confront him, at least just grab him and do something. He´s going to keep doing it. I´m over it. I´m ready to fight him. I didn´t even get a shot in because the security guards got in the middle of it.\"Chastain acknowledged racing Gragson hard and defended the swipe he took on pit road.\"Noah and I have a very similar attitude on the racetrack, and we train together, we prepare together, we know every little bit about each other,\" Chastain said. \"Definitely crowded him up off of four, and he took a swipe at us in three, and then he came down and grabbed ahold of me, and a very big man once told me we have a no-push policy here at Trackhouse.\"",
        "That policy will surely be tested in the coming weeks.___AP auto racing: https://apnews.com/hub/auto-racing and https://twitter.com/AP_Sports"
    ]
}