{
    "articleURL": "/femail/article-12042689/I-got-ick-partner-drinks-fizzy-soft-drinks-day-long-bottle.html",
    "content": [
        "British woman took to Mumsnet as she spoke about getting the ick from partnerRead More: Single women share the dating 'icks' they can't STAND about menA women revealed that her partner has given her the ick because he drinks fizzy drinks all day.",
        "Taking to parenting platform Mumsnet, the British mother explained that she feels embarrassed watching him slug bottles of fizzy drinks all day.She claimed he also pulls a weird face at the mention of vegetables and eats sweets and chocolate constantly, despite being almost 40 years old. The woman asked others if she was just blowing it out of proportion as he has only been her partner for five months. However many rushed to the comments saying it would also give them the ick as he is acting like a 'teenage boy.'",
        "The woman explained: 'To have gotten the ick with my partner over his drinking habits?'So this is likely a me problem as I have mild OCD and often get irritated at small things that I know aren’t a real problem, I never say anything because I know it’s my issue not theirs. 'Looking for some perspective on this one though because it’s really putting me off my newish partner (of five months).'He has a lot of good points but the fact that he drinks soft drinks/fizzy pop all day long out of the bottle is really putting me off. 'I can’t even articulate why, it sort of feels embarrassing somehow? He also pulls his face at veg and eats sweets and chocolate constantly, he’s not overweight though.",
        "'I haven’t said anything and just tried to put it out of my mind because I don’t trust my own judgment on what’s annoying and what isn’t, but today we went for a day out together and he pulled a 2 litre bottle of Coca Cola out of his bag and started drinking from it in public. 'I felt sick and mortified, I didn’t want to be seen with him and I said I had a headache so that we could leave early.",
        "'Would that really put you off a partner or is my mind just blowing it out of proportion?'Many women suggested she should break up with the block as it was a big turn off for them too. One person wrote: 'I'd hate that, I'm imagining other gross habits will reveal themselves in time. Move on!'Another said: 'Sounds chavvy to me. Not exactly a classy gentleman. If it's bothering you then end it sooner rather than later.'Someone else wrote: 'It would be like dating a teenage boy who has just been given his pocket money. 'Think what his teeth will be like. He'd also be full of gas and I wouldn't stick around for the explosion!'",
        "While a fourth wrote: 'Yanbu, it screams immaturity which would be a huge turn off for me.'",
        "The original poster added: 'Thanks all, good to know that it’s not just me. I think you’re all right that it seems childish, it somehow makes me think of a teenager holed up in their pigsty of a room gaming until 5am so I think that’s what unsettles me. 'He’s almost 40 though so I think he’s past the point of outgrowing it by now.'However others suggested the use of the term 'ick' is more off putting them someone drinking fizzy drinks. ",
        "One person wrote: 'I also find an adult saying “gotten the ick” more annoying than drinking fizzy drinks.'I initially assumed you meant he had an individual sized bottle of Diet Coke or whatever and to be honest, no I wouldn’t find that particularly odd or offensive. It is very odd that he carries a 2 litre bottle around though and yes I dare say I would be embarrassed if my husband carried a bottle that size around with him.'Another wrote: 'I don't care what someone eats or drinks but I couldn't be with an adult who used the phrase \"gotten the ick\". "
    ]
}