{
    "articleURL": "/news/article-12054951/Even-downpours-dampen-Coronation-crowds-broke-chorus-Singing-Rain.html",
    "content": [
        "Crowds assembled to be part of the Coronation in London, despite wet weather As the heavens opened, thousands belted out Gene Kelly's Singing in the Rain As the heavens opened, a rousing chorus built into a crescendo near Buckingham Palace.",
        "‘We’re singing in the rain, just singing in the rain. What a glorious feeling, we’re happy again!’Determined the showers wouldn’t dampen their spirits, the crowds assembled for the Coronation in Central London belted out this Gene Kelly classic as the ceremony got under way.They had come prepared – with sturdy umbrellas, plastic ponchos and bottles of fizz to warm the cockles – and stoically lined the 1.3-mile procession route from the Palace to Westminster Abbey in their thousands.Among them was Anita Brook, who had hired a minibus to drive her family from Oxford to London in the early hours.",
        "‘We travelled down at 4am and we arrived at The Mall just after 5am,’ said Ms Brook, who was wearing a Union Jack dress and a tiara. ‘We’ve got ages ranging from 82 to five. We had a little buck’s fizz on the way down.’Earlier, at the entrance to the Abbey, a shelter had been erected to shield arriving guests from the worst of the rain.When the King emerged several hours later bearing his crown, he was flanked by servicemen holding thoroughly soaked umbrellas. But as Charles said when he greeted well-wishers on Friday, the rain was, for him, a ‘blessing’.Perhaps he was recalling that his mother and grandfather endured similar conditions when they were crowned. The weather on the Queen’s Coronation in June 1953 was described as ‘really quite miserable’ and chillier than yesterday’s 15C (59F), with temperatures barely creeping above 11C (52F). Her father George VI’s in May 1937 was remembered as a ‘washout’.",
        "The soggy conditions were felt across the country. In Henley-on-Thames, Oxfordshire, one Royal fan was wrapped up in three weather-proof layers – a cagoule, poncho and umbrella – as she watched proceedings on a screen in the town centre.And in Birmingham, about 100 people sheltered from steady rain under the canopy of the city library to take in the procession being beamed into Centenary Square.Christopher Matthews, 60, had cycled 12 miles from outside Walsall to be there. The retail worker, dressed in Union flag cycling helmet, jersey, shorts and socks, said: ‘You have got to be patriotic, especially on a special day. It’s once in a lifetime, isn’t it?’"
    ]
}