{
    "articleURL": "/news/article-12048907/DAILY-MAIL-COMMENT-China-threat-not-friend-Mr-Sunak.html",
    "content": [
        "China is a menacing superpower that has been identified as an unparalleled danger to the West.",
        "It shows contempt for freedom and democracy, and has an appalling record of industrial espionage and human rights abuses. Rishi Sunak has branded the regime a threat. Yet in thrall to Beijing's economic riches, he is unwilling to pursue anything other than an amicable relationship.And how has President Xi Jinping responded? With unfettered disdain.How else to explain the Communist regime's decision to send the architect of the plan to brutally suppress democracy in Hong Kong, which breached a treaty with Britain, as its representative at the Coronation? It is sticking two fingers up at us.",
        "And given that it is the ultimate surveillance society, it is horrifying that CCTV cameras made by a controversial Chinese company will monitor crowds at the royal occasion.Last year, ministers banned Hikvision devices from government buildings and other sensitive sites on national security grounds. Given the company is subject to China's intelligence laws, it can be compelled to send crucial data to spies in Beijing.Who in their right mind would allow its cameras to be installed along the parade route? It is the height of negligence and a failure of common sense.Ministers must quickly learn that China is not our friend – and cannot be trusted.Coronation cynicsA joyous case of Coronation fever has infected the country. With one day to go until the greatest show of pomp and splendour for 70 years, excited crowds are already thronging the Mall.",
        "But amid the outpouring of joy, how tediously predictable the curmudgeonly Left are trying to rain on the King's parade.Militant union Unison, Labour and SNP politicians are grumbling that the estimated £100million cost to the taxpayer is 'unjustifiable'. Leave aside the fact the predicted £1billion boost from the influx of tourists combined with the celebrations will pay for the spectacular several times over.In recent months, the havoc-wreaking public sector strikes that the hard-Left wholeheartedly supported have lost billions in working hours, trade and taxes.We didn't hear them moan about the cost to the public purse then. It's rich for them to do so now.Signs of recovery?",
        "In spite of Labour constantly talking it down and the determination of public sector unions to sabotage it, the British economy continues stubbornly to defy gravity.Contrary to the doom-laden prophecies of almost every major forecaster, the UK has not fallen into recession – and the signs are it probably won't.A new survey shows service sector companies are at their most optimistic for a year, while mortgage approvals have hit their highest level since Liz Truss's mini-Budget triggered a lending crunch.And this is all before enthusiasm for the Coronation delivers a bumper weekend for retail, tourism and hospitality.What a pity Chancellor Jeremy Hunt refuses to scrap the senseless and self-defeating tourist tax, which would help capitalise on the national celebrations – and nourish the green shoots of economic growth.",
        "We all know where a road paved with good intentions leads. And there are few more depressing examples than the Modern Slavery Act. Intended to protect genuine victims of trafficking, the legislation is so loosely written it is being manipulated by Albanian small boat migrants to avoid deportation. Their nation may be poor but it is a peaceful democracy. Mr Sunak's proposed crackdown on abuse of these laws has prompted a paroxysm of outrage from the Left. But it can't come soon enough."
    ]
}