{
    "articleURL": "/femail/article-12053703/Royal-fans-mark-Prince-Harry-Meghans-sons-birthday.html",
    "content": [
        "Royal fans have been sharing birthday messages for Archie on social media CORONATION LIVEBLOG: Click here to follow live updates throughout today  How are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.uk Royal fans have been sharing birthday messages for Prince Harry and Meghan Markle's son Archie as he turns four today. ",
        "As Coronation fever sweeps the UK and much of the world, the Duchess of Sussex, 41, will be hosting a 'low-key' party in the couple's Santa Barbara home, according to reports. The Duchess is said to be planning a small-scale event at their $14.7million (£11.6million) Montecito mansion supported by her mother Doria Ragland and a select group of friends. Prince Harry, 38, landed in the UK for the King's Coronation yesterday - and is believed to be using a private jet to help him get back home quickly, apparently adopting a schedule to get 'in and out of the UK in 24 hours'.Many of the Sussexes' followers shared birthday messages for the little prince online, with one writing: 'Happy birthday Prince Archie of Sussex!'",
        "Meanwhile another added: 'Happy birthday to little Prince Archie.' A third wrote: 'Happy birthday to little Archie who turns four today.'A fourth commented: 'Happy Birthday Prince Archie Harrison Mountbatten Windsor. Wishing you the brightest and happiest long life future.'We love you.'Another added: 'Happy birthday nephew Archie Harrison Mountbatten-Windsor.'The Royal Family, and Prince Harry and Meghan, are yet to acknowledge Archie's birthday online. While rain has been falling in London, Meghan, who declined her invite to the Coronation, could choose to throw the party in the family's manicured gardens for Archie and his friends because the weather is set to be fair for Saturday in California.",
        "A source told People: 'It's going to be a low-key party at home. They'll have friends around them and Meghan's mom, Doria [Ragland]. Meghan will definitely have support that weekend.'",
        "Lilibet, who turns two in June, will also be at the centre of the party because Archie and his little sister are inseparable. 'They are so sweet together. Archie loves Lili. He's such a sweet boy. When she's not around, he asks, \"Where's Lili?\"', the insider said.Along with Doria and Archie's friends, Tyler Perry, Princess Lilibet's billionaire godfather, is likely to be a guest. Archie's godparents are Tiggy Pettifer, Harry and William's former nanny, and Mark Dyer, Harry's friend and former royal aide, but they are believed to be in the UK.   The mother-of-two apparently crafted a strawberry and cream smash cake while Prince Harry decorated their home with balloons to mark his first birthday, a source told People magazine at the time.Sources told how the couple crafted a 'really simple but incredibly joyous' celebration for their son, with the trio taking time to video call his godparents and family.The source explained: 'Meghan made the cake — strawberries and cream. And Harry helped with decorations and blew up balloons.'Meanwhile, Lilibet's first birthday was celebrated at Frogmore Cottage in Windsor (the couple's former UK home), with birthday cake, balloons, party games and picnic snacks. The family were in the UK for the Queen's Platinum Jubilee.",
        "Among the gifts were apparently a pastel pink VW Beetle ride-on car, £75 from Selfridges, while Sussex supporters donated $100,000 to charity in her honour. King Charles, then Prince of Wales, may have bought her a swing similar to one he bought for Prince George - after an aide to the Sussexes was seen unloading it from their private jet in Santa Barbara.East London baker Claire Ptak – who made the couple’s wedding cake in 2018 – created new treats for the low-key bash. She later shared a picture of a small peony-covered cake that could be the one enjoyed by guests.Harry is expected to return to the US immediately after the Coronation so that he can celebrate Archie's birthday, and will not be staying in the UK for any of the other Coronation celebrations, beyond seeing his father crowned in Westminster Abbey. If Harry shuns all other royal events and is back in the air by 3pm UK time tomorrow, he will land in Los Angeles by around 5pm Californian time, meaning he could be back home for the tail-end of the party and putting his two children to bed.Recently, Harry and Meghan's celebrity friend Gayle King declared they are in a 'really good place' and have made the 'best' decision for Meghan to stay in the US while Harry attends the Coronation in London. ",
        "Ms King has said it is 'right' that Harry will fly to the UK because he will be supporting his father in Westminster Abbey."
    ]
}