{
    "articleURL": "/tvshowbiz/article-12060475/Selma-Blair-service-dog-Scout-promoting-memoir-Mean-Baby-NYC.html",
    "content": [
        "Selma Blair supported herself with a cane and the help of her service dog Scout as she arrived at CBS Studios in New York City on Monday morning.",
        "The 50-year-old performer flashed a wide smile as she stepped out of her vehicle and was greeted by her fans as she entered the production center.Blair wore a jet-black button-up jacket and a pair of striped trousers with flared bottoms during her arrival.The Cruel Intentions actress also wore leather high-heeled shoes and accessorized with a pair of wide-framed sunglasses.The Hellboy actress, who recently revealed that she previously attempted suicide, subsequently appeared on CBS Mornings to promote the paperback release of her book Mean Baby: A Memoir of Growing Up.",
        "The performer's platinum blonde hair contrasted perfectly with the dark tone of her outerwear.Blair previously revealed that she had been diagnosed with multiple sclerosis in an Instagram post that was shared in 2018. Mean Baby: A Memoir of Growing Up, which partially covers her struggle with the disease, was originally published in May of last year, and it subsequently became a New York Times bestseller.The performer spoke about being made aware of her condition during her time on CBS Mornings, where she expressed that the diagnosis unexpectedly came as a relief after years of suffering various physical ailments.'When I got the diagnosis at late 40-something it seems, I was surprised, but then I was like \"Oh of course,\" and when the doctor said the first night, \"You've had this at least 25, 30 years, at least,\" I was happy. I needed it,' she said.",
        "Blair went on to speak about how she subsequently began battling alcoholism, and expressed that she would often drink to 'check out.' The actress also discussed how a particularly unhinged family trip to Cancun left her at 'rock bottom.' 'I spent that whole trip drinking and throwing up and drinking, and by the time I got on the plane...and then I woke up in the hospital,' she recalled.",
        "However, Blair, who described herself as being 'in remission' from multiple sclerosis, eventually recovered from alcoholism and turned to writing in an attempt to inspire other individuals struggling with similar conditions.'To.. think, \"Oh, there's a story I can put together,\" it was life-changing,' she recalled. The performer went on to speak about the overarching message of her memoir.She stated: 'I thought, \"I hope someone can see that maybe there's more or if they've done shameful things, you know choices they made, go easy on yourself, because you need to come out of it. It's not going to help anyone to stay down.\"'"
    ]
}