{
    "articleURL": "/news/article-12056449/Let-banquets-begin-PM-holds-Big-Lunch-Downing-St.html",
    "content": [
        "Banquets are taking place on streets across the UK, including Downing Street, to celebrate the Coronation Read more about what's happening at King Charles's coronation with MailOnline's up-to-the-minute live blog Are you having a coronation party? Email jamie.phillips@mailonline.co.uk to share your picturesMillions of Brits are holding Coronation banquets across the UK in honour of King Charles III with mile-long tables,  paper crowns and streets lined with bunting.  ",
        "Royal fans across the country have shared pictures of British flag-decked tables as communities come together to honour the historic event with fancy cakes and quiches. Guests have also filled Downing Street for the lunch, and there was a hum of excited chatter as those invited - including volunteers, Ukrainian refugees and youth group members - sipped fruit drinks and took photos in front of the famous Number 10 door as they awaited the arrival of Rishi Sunak.The street was bedecked in Union flag bunting and music was being played by the RAF Northolt brass quintet. Mr Sunak and Akshata Murty are hosting the event as part of the Big Lunch celebrations taking place across the country over the coronation weekend.Elsewhere, the Duke and Duchess of Edinburgh have attended a big lunch in Cranleigh, the Princess Royal and Vice Admiral Sir Tim Laurence have joined a community street party in Swindon, and Princess Beatrice and Princess Eugenie are taking part in a big lunch in Windsor.",
        "Many will be putting their aprons on to produce a veritable feast for lunch today - including the coronation quiche, which has broad beans, spinach and tarragon in the recipe. The scene in Gloucester Road, South Kensington, just a stone's throw from  only a stone's throw from Kensington Palace, was reminiscent of streets across the UK as residents tucked into a bewildering array of international food.",
        "Estonian President Alar Karis, whose Embassy is just around the corner, dropped into join the celebration and enjoyed a plateful of Indian food.'It's great that people can get together an enjoy traditions like this, despite all the less peaceful things which are going on in the world right now', he said.'This has been a wonderful occasion and no matter what else is happening, these things are valuable.'Retired TV producer Anthony Garrick, wearing a Help the Heroes top and a blue and green kilt, was enjoying the sunshine and the occasion.",
        "'It's really nice just to get together like this and see people of all ages enjoying themselves,' he said.'I'm really encouraged to hear about the King's idea for more people to Help Out and volunteer, and I think it would be so good if we could all reach out to those people who are struggling to find enough to eat or living on the streets.'Pictures of Coronation Big Lunch preparations showed bunting-full set-ups, with tables lined with cakes, scones and quiches. The King's younger brother Prince Edward, his sister Princess Anne and Princess Beatrice and Princess Eugenie, the daughter of Charles' other brother Prince Andrew, were due to attend 'Big Lunch' events, joining some of the estimated 50,000 street parties being held around the country.",
        "And hosting his own big lunch in Downing Street today, Mr Sunak said: 'Come rain or shine, thousands of friends and neighbours are coming together this weekend to put up the bunting, pour the tea and cut the cake at street parties and community events across the UK.'In a message shared on the Royal Family's Instagram page, the King and Queen added: 'Whether this is your first ever Big Lunch or whether it is an annual part of your local calendar, we send our warmest good wishes to each one of you, and all those who will be with you, at what we hope will be a truly enjoyable event for everyone.' Fiona Chapman and Lorna Dodwell crafted their own special capes to try and impress the King and Queen at the coronation.Mrs Chapman said: 'We went down on the train yesterday from Windsor and found our way to the Mall. We did not see very much but we had a great laugh. Everyone was taking our photo. We are royalists. I have always stuck up for Charles.'",
        "Mrs Chapman's husband spent six weeks making special crowns for the pair.They will both be attending a street party in Eton before watching the coronation celebration on a big screen in a nearby park.",
        "They applied for tickets for the concert at Windsor Castle but they did not manage to get any.Mrs Chapman added: 'Gary Barlow will miss me. I'm his biggest fan. We wanted Charles and Camilla to notice us yesterday.'Speaking from a street party in East Sheen in west London, TV presenter Mel Giedroyc said she has 'absolutely loved' the day's festivities.'I've been involved in the Big Lunch for eleven years now, rather grandly I call myself an ambassador, but what I actually do is just go along to amazing events like this beautiful one today in East Sheen in west London, and meet fabulous people and sample their delicious food,' she said.She added: 'I think it brings the best out of British people, not just British people, human beings. It's an amazing example of how doing things on a small scale can have a big effect. It's about us taking responsibility for our fellow humans, who are close to us and near to us.",
        "'That sounds very heavy, it's also about having a laugh and making new friends. The first one I went to was in 2012 down the Mall, that was its inaugural day, it had exactly the same atmosphere as this, it's gone from strength to strength.",
        "'I've absolutely loved this. I was thinking back to our silver jubilee, the street party we had in Leatherhead in our cul de sac when I was a kid. There's something about the continuity of it, whether you're a monarchist or not. The idea of a continuity is quite powerful and reassuring. We've got to show our children that this is the way we should be.'A woman in a Union flag dress and headboppers at the Big Coronation Lunch in Canterbury curtsied when she met the Archbishop as he spoke to attendees.Michelle Downer, 45, from Canterbury, said: 'I did this really embarrassing thing. I curtsied to him!'But isn't it amazing to be at the cathedral and meeting Justin Welby?'On the Big Lunch, she said: 'I love seeing everyone come together. Why would you not want to be here?'Regarding the coronation, she said: 'I didn't move from the TV.'Ms Downer then explained how her husband had been decorating and she told him he needed to change before coming in to watch the ceremony - which he took very seriously, changing into a waistcoat and tails for the occasion.Sheila Holmes, 79, attended the Coronation Big Lunch in Burn, North Yorkshire, with her husband Gordon, 88, who served on the parish council for 43 years.",
        "Mrs Holmes said: 'It's marvellous for such a small village to make such a supreme effort.'I thought the service yesterday was beautiful. It's what we do best, being British.'Parish council chair Chris Phillipson said: 'I've lived in the village all my life.'We used to have sports days but as the village got older and children got older and moved away, they stopped, so it's nice to resurrect some sort of community event.'It's really good to get people back together after Covid.'Around 150 North Yorkshire villagers were expected to pack into a marquee festooned with red, white and blue to celebrate the Coronation Big Lunch.Burn, near Selby, has been putting on a Big Lunch event since 2009, making it one of the longest running events of its kind.The village's decorations include a life-size recreation of the Gold State Coach, complete with horses and featuring cut-outs of the King and Queen.Neighbours gathered in a marquee outside the The Wheatsheaf pub for a barbecue, royal-themed quizzes and a treasure hunt, with activities for children including royal hopscotch and a throne photo booth.Sonia Hearld, who started organising Burn's Big Lunch in 2009 in a bid to bring her rural community together and combat loneliness, said: 'Whatever you think about the royal family, I think it's just a great historic event, the like of which many of us will never see again.'It's an excuse to get people together, whatever your allegiances, however you vote, whatever you think, and as we all know from Covid, Zoom doesn't take the place of real interaction.'The event also raises money for the village's charity of the year, which this year is Emergency Ukraine.",
        "Police were seen walking up the castle's Long Walk and cardboard cutouts of the monarch were being positioned near bunting-clad street party tables as decoration. Tonight's show in Windsor, hosted by Paddington and Downton Abbey actor Hugh Bonneville, will include video messages from Hollywood star Tom Cruise, Dynasty actress Dame Joan Collins, adventurer Bear Grylls and Welsh singer Sir Tom Jones.Zoe Ball was due to present a show from the grounds of Windsor Castle but has said she is 'absolutely gutted' at having to pull out of covering the Coronation Concert for BBC Radio 2 at the last minute after falling ill.Scott Mills will take over from Ball to chat to the crowd ahead of the concert, while Dermot O'Leary will be backstage speaking to the stars before they perform.The series of pre-recorded sketches will reveal little-known facts about the monarch and will also include moments from beloved literary figure Winnie the Pooh - seemingly echoing the famous moment Paddington Bear drank tea with the Queen during her Platinum Jubilee celebrations.There will also be performances by Paloma Faith, Olly Murs, veteran rock guitarist Steve Winwood, and Nicole Scherzinger of The Pussycat Dolls.Classical acts including Andrea Bocelli, Welsh bass-baritone Sir Bryn Terfel and Chinese pianist Lang Lang will perform too.",
        "The Royal Ballet, the Royal Opera, the Royal Shakespeare Company, the Royal College of Music and the Royal College of Art will come together for the first time to create a one-off performance featuring Sex Education and Doctor Who star Ncuti Gatwa and Olivier Award nominee Mei Mac.And the weather looks likely to be lovely for most with highs of up to 22C - the hottest day of the year so far. The best of the weather will be in London and the South East this afternoon, with pleasant conditions also expected in Windsor for the Coronation Concert tonight.Most of the UK will see good periods of sunshine today and it will be mainly dry, but large areas of cloud cover will bring a threat of showers to some eastern areas.Overnight, steel barriers standing at 10 feet high were erected around Windsor Castle's Town Gate, where 20,000 spectators will pour through for the event.Before entering the concert to mark the crowing of King Charles and Queen Camilla fans will undergo extensive searches watched by police snipers.",
        "For the late Queen Elizabeth II's coronation in 1953, Coronation Chicken – cold chicken in a curry cream sauce with a well-seasoned dressed salad of rice, green peas and mixed herbs – was invented to feed the foreign guests who were entertained at Buckingham Palace after the ceremony.Buckingham Palace said the quiche was chosen because it worked as a sharing dish, can be served hot or cold, suits a wide variety of dietary requirements and can be easily adapted to suit different tastes. It's also rumoured that it features some of the King's favourite foods, namely cheese and eggs. Millions of cakes - from Victoria sponges with cream and jam to carrot cakes with cream cheese icing - will be lovingly baked as people join their neighbours to celebrate. Pictures from early this morning show police and contractors setting up for tonight's Coronation Concert in Windsor, which will see 20,000 spectators flock to the castle's East Lawn. The Coronation Concert will feature stars including Katy Perry, Take That and Lionel Richie and will be broadcast across the BBC from 8pm. Anti-terrorist vehicle barriers, designed to stop trucks of up to seven-and-a- half tonnes, were being positioned around the castle.Metal spikes which can pierce tyres were being brought in along with eCCTV cameras and floodlights.Police armed with automatic rifles patrolled the streets while others took up position on rooftops.Police have not revealed any specific threats, but will also be on guard for any intrusion by anti monarchists who were present at yesterday's coronation procession in Trafalgar Square.The heavy security did not deter tourists and royal well-wishers from pouring into Windsor at breakfast time to be part of the party.",
        "The Long Walk was sealed off as giant TV screens were being installed in to allow fans to watch the concert which will be attended by the King and Queen.Evelyn Karrier, 30, from Austria, said: 'It is such a wonderful time to be here. The atmosphere is a happy one and anyone who is here at this historical time is very lucky.'American royal fan Susan Keys, 55, from Houston said : ' being from Texas, I just love all the tradition surrounding his coronation and this historic place.'You Brits do pageantry, pomp, and everything else so well. It's no surprise to me that so many people come from all over the world to visit Windsor and to be here at the coronation time is such a bonus.'Greg and Gina Watkins travelled from Gwent to be in the Castle town with their toddler son.Greg,47, said: 'Charles will be a wonderful King. He was already great as a Prince, but we can expect even greater things from him, as he has such incredible foresight.'",
        "Bartley Graham,48, from Durham walked around Windsor in his Union Jack suit and said: 'I am a royal super fan. I will be watching the concert here tonight.'It's such an important time for our country and for our own family. What we are doing, is seal in the future, everyone for centuries to come with this wonderful series of events to celebrate Charles.'Royal fans have started arriving in Windsor hours before the coronation concert at 8pm.People draped with Union flags and dressed in Union flag dresses have been flooding off trains at the station.Garry and Donna Howarth travelled down from Bolton after winning tickets to the event.Mr Howarth, dressed in a Union flag blazer, said: 'We are here just for the concert. We have come down for the weekend.",
        "'We are about 10 hours early but we will have a look around and see what we can.'Mrs Howarth said: 'I'm so excited to be here.'The pair are keen to see opera singers perform at the concert and decided to avoid the coronation on Saturday because of the rain.The Coronation concert features a union flag shaped stage, which was barely visible to tourists who paid for a nearby field to try to catch a glimpse.It is set on the eastern facade of the castle with multiple levels, and will hold a 70 piece orchestra with four cat walks around Launch out like the union flag into the crowd.As part of the Coronation Concert, choreographed lasers, projections and drone displays will radiate over historic bridges and buildings around the country.Seven of the 10 locations involved in the event, Lighting up the Nation, have been disclosed so far, including Blackpool seafront in Lancashire, where people can join a viewing party from Blackpool Tower.",
        "Sheffield Town Hall will showcase a display in the Peace Gardens, while Newcastle's Tyne Bridge and Gateshead's Millennium Bridge lights will cast riverside reflections for an audience stretching between the quays.A drone show will light up the sky above the Eden Project in Cornwall, and its biomes will become multicoloured for spectators invited from the local volunteer community.Light shows will also brighten up Belfast, Edinburgh and Cardiff at various locations.The remaining three locations will be revealed during the concert.The Coronation Concert will be broadcast on BBC One, BBC iPlayer, BBC Radio 2 and BBC Sounds from 8pm. Are you having a coronation party? Email jamie.phillips@mailonline.co.uk to share your pictures"
    ]
}