{
    "articleURL": "/tvshowbiz/article-12048627/Im-Celeb-South-Africa-Helen-Flanagan-forced-apologise-SWEARING-Ant-Dec.html",
    "content": [
        "I'm A Celebrity South Africa star Helen Flanagan was forced to apologise for swearing at hosts Ant and Dec as she took part in the latest Bushtucker trial on Thursday.",
        "The former Coronation Street actress, 32, went head-to-head with ex Royal butler Paul Burrell, 64, in the escape room-style challenge in a bid to win a picnic for their respective tribes.However, as she faced a number of creepy crawlies, foul-smelling offal and crocodiles during the challenge, Helen couldn't help but turn the air blue, even telling Ant and Dec to 'f**k off' as they giggled on the sidelines.Meanwhile her competitor Paul, who screamed his way through the trial, picked up on the actress' 'potty mouth' leaving her embarrassed by her actions. As the trial came to an end, Helen said sorry to her mum watching at home as the presenters also remarked on her language.",
        "Ant told her: 'I mean it was a bit hairy for a few moments wasn't it? There were a lot of F-bombs.'To which a red-faced Helen replied: 'I'm sorry guys and I'm sorry mum!'I promise guys I'm not normally a swearer but it was worth everything.'Despite her bad language, Helen triumphed the trial and beat Paul, meaning the yellow team were treated to a picnic feast for a second day in a row.Watching her efforts at home, I'm A Celeb viewers were quick to praise Helen for smashing the trial, as they noted how different she was from her first stint a decade ago.  ",
        "'Helen Flanagan volunteering for a trial and smashing it. What universe is this?' tweeted one person.A second shared: 'Fair play to Helen that trial looked freaking difficult.'A third person said: Awww the fact that Helen got picked last and she went and won that picnic for her team proving everyone wrong by the minute.'",
        "'Helen is a changed women. Her fear has totally gone. Fair play' came the response from a fourth watcher.While another predicted she'll win the whole show, writing: 'Helen will win this and become the first 'legend' I'm calling it now.'Meanwhile on the show, Joe Swash likened his I'm A Celebrity campmate Fatima Whitbread to his wife Stacey Solomon as they can both order him around without him realising.During the episode, Fatima woke up Joe while the campmates were asleep and asked him to put logs on the fire.The former EastEnders actor obliged and got out of bed but admitted in the Bush Telegraph he didn't understand why Fatima couldn't just put the logs on herself if she was already awake.However, soap star Joe said he did as she asked as he has a 'soft spot' for the former Olympic athlete. He said: 'If you're awake, just chuck the wood on the fire? But it's Fatima, she gets away with it. I do feel love for Fatima.'",
        "Fatima later dished out which campmates would handle the daily chores and wrote them all out on a witeboard.The former javelin thrower went around to each campmate and explained why she had given them each task.In the Bush Telegraph, Joe said: 'Stacey's the only other woman who could boss me around in a really nice way and without me realising I'm being bossed around, which is really clever.'I'm A Celebrity...South Africa continues tomorrow at 9pm on ITV1 and ITVX. "
    ]
}