{
    "articleURL": "/wires/ap/article-12054271/176-dead-missing-Congo-floods.html",
    "content": [
        "KALEHE, Congo (AP) - The death toll from flash floods and landslides in eastern Congo has risen beyond 200, with many more people still missing, according to local authorities in the province of South Kivu.",
        "Thomas Bakenge, administrator of Kalehe, the worst-hit territory, told reporters on the scene Saturday that 203 bodies had been recovered so far, but that efforts to find others were continuing.In the village of Nyamukubi, where hundreds of homes were washed away, rescue workers and survivors dug through the ruins Saturday looking for more bodies in the mud.Villagers wept as they gathered around some of the bodies recovered so far, which lay on the grass covered in muddy cloths near a rescue workers post.Grieving survivor Anuarite Zikujuwa said she had lost her entire family, including her in-laws, as well as many of her neighbors. \"The whole village has been turned into a wasteland. There's only stones left and we can't even tell where our land once was,\" she said.Michake Ntamana, a rescue worker helping look for and bury the dead, said villagers were trying to identify and collect the bodies of loved ones found so far. He said some bodies washed down from villages higher in the hills were being buried shrouded just in leaves off the trees. \"It's truly sad because we have nothing else here,\" he said.",
        "Rivers broke their banks in villages in the territory of Kalehe, close to the shores of Lake Kivu on Thursday. Authorities have reported scores of people injured. One surivor told AP the flash floods came so fast that they took everyone by surprise.",
        "South Kivu Gov. Théo Ngwabidje visited the area to see the destruction for himself. He posted on his Twitter account that the provincial government had dispatched medical, shelter and food supplies.Several main roads to the affected area have been been made impassable by the rains, hampering the relief efforts.President Felix Tshisekedi has declared a national day of mourning on Monday to honor the victims, and the central government is sending a crisis management team to South Kivu to support the provincial government.Heavy rains in recent days have brought misery to thousands in East Africa, with parts of Uganda and Kenya also seeing heavy rainfall.Flooding and landslides in Rwanda, which borders Congo, left 129 people dead earlier this week.Local government official Bakenge told AP, \"This is the fourth time that such damage has been caused by the same rivers. Not 10 years pass without them causing enormous damage.\"Jean Yves Kamale in Kinshasa contributed to this story."
    ]
}