{
    "articleURL": "/wires/reuters/article-12043303/POLL-Canadian-dollar-expected-rise-closer-fair-value.html",
    "content": [
        "reuters://realtime/verb=Open/url=cpurl://apps.cp./Apps/fx-polls?RIC=CAD= poll data",
        "By Fergal SmithTORONTO, May 3 (Reuters) - Bullish Canadian dollar bets have been raised despite an expected global economic slowdown that could cloud the near-term outlook, with analysts in a Reuters poll saying the currency's current level doesn't reflect its fair value.The median forecast of nearly 40 currency analysts was for the loonie to strengthen to 1.345 per U.S. dollar in three months compared to 1.350 in last month's forecast. It was then expected to rally to 1.292 in a year, a gain of 5.4%.\"Fundamentally, the Canadian dollar is still undervalued by any longer-term metric of fair value. That anchors my longer term view,\" said Jay Zhao-Murray, market analyst at Monex Canada.\"The only issue is timing. It is very easy for markets to deviate from fair value for an extended period of time.\"Measures of fair value include purchasing power parity (PPP) - the exchange rate that equalises the purchasing power of separate currencies. The IMF estimates the PPP of USD-CAD to be 1.19.The loonie has lost ground in recent weeks as the price of oil, one of Canada's major exports, fell sharply and investors worried the U.S. economy could be headed for a recession. Canada sends about 75% of its exports to its neighbour.\"The data is presenting a very uncertain picture,\" Zhao-Murray said. \"If the U.S. goes into recession, the question for the loonie is still unclear. It is a matter of when does the recession start and how deep is it going to be.\"",
        "U.S. and Canadian jobs data are due on Friday, which could offer clues on the outlook for the U.S. and local economies.The Bank of Canada has forecast higher borrowing costs will crimp the country's economic growth in coming quarters after stronger-than-expected activity at the start of the year.The central bank paused its interest rate hiking campaign in January after lifting the benchmark rate to a 15-year high of 4.50%.(For other stories from the May Reuters foreign exchange poll:)(Reporting by Fergal Smith; Polling by Sarupya Ganguly and Sujith Pai; Editing by Jonathan Cable, Kirsten Donovan)"
    ]
}