{
    "articleURL": "/sport/football/article-12051541/Liverpool-fans-DROWN-God-Save-King-Coronation-Day.html",
    "content": [
        "Liverpool only reluctantly agreed to play the national anthem before the matchPremier League had 'strongly suggested' clubs mark the Coronation Supporters booed and chanted 'Liverpool' throughout the national anthem Liverpool football supporters have drowned out God Save the King on the day of the Coronation with a huge chorus of boos.",
        "The national anthem was played ahead of the Premier League fixture between Liverpool and Brentford at Anfield, which the Reds won 1-0, on Saturday afternoon to mark the crowning of King Charles III and the Queen Consort.But supporters inside the stadium did not respect the anthem as the two teams lined up around the centre circle.The jeering started immediately after the PA announcer confirmed that the national anthem would be played moments before kick-off, with Mo Salah then going on to score the winning goal.As the players uncomfortably moved toward the centre-circle where they gathered shoulder to shoulder, huge chants of 'Liverpool, Liverpool' took over from the boos.",
        "Boos were then heard almost entirely around the ground, with the anthem only faintly heard, as Reds skipper Jordan  Henderson appeared to sing along with the anthem from the touchline as a substitute.Meanwhile, the Reds players from multiple nationalities decided to keep silent as they observed protocol, with chants of 'Liverpool' soon taking over once more. As soon as the anthem finished, the traditional song played at Anfield before kick-off, 'You'll Never Walk Alone', was blasted around the stadium.May supporters brought banners to air their grievances, saying 'not my king' while others featured a banner of legendary former player and manager Kenny Dalglish - referring to his traditional nickname of 'King Kenny'.",
        "Liverpool only reluctantly played it ahead of the televised fixture after the Premier League 'strongly suggested' clubs hosting fixtures this weekend mark the Coronation.Their fans have booed the anthem in recent years and some chanted 'you can stick your coronation up your a**e' at last week's match against Fulham.",
        "The club were aware that to not play God Save the King would subject them to a nationwide backlash, so announced on Friday they would acquiesce to the league's suggestion, which wasn't mandatory.Liverpool supporters did respect a minute of silence for Queen Elizabeth II following her death last September.But the national anthem had been jeered by some of their fans prior to last season's FA Cup final at Wembley.Privately, there was anger at Liverpool at being put in this position by the Premier League.Liverpool had been planning to use the Brentford game as an opportunity to celebrate the start of Eurovision week in the city and showcase the event.They were also going to tie in their Foundation Day, marking 20 years of its charitable work in the city.But their fans' actions and the wider backlash to it will now dominate the agenda.Liverpool manager Jurgen Klopp said on Friday he agreed with the club's decision to play the anthem.",
        "Asked about the coronation in the first question of the press conference, he responded: 'The club's position is my position. That is clear. 'Besides that, this is definitely a subject which I cannot really have a proper opinion about. I am from Germany, we don't have a king or a queen, I am 55-years-old and I have no experience of that. 'Watching from the outside, it is a nice thing to watch when all the weddings are massive things in Germany but no one really knows what it is like. It is like watching a movie. We don't feel that. 'That is it pretty much. I am pretty sure a lot of people in this country will enjoy the coronation, some will not be interested and some will not like it. That is it and that is over the whole country. That is all I can say about it. The club's position is my position.'Anfield stadium DJ George Sephton, 77, tweeted he would 'happily' play the national anthem before deleting the post.In reply to a message suggesting Sephton plays 'God Save the Queen' by punk band Sex Pistols instead, he wrote: 'I will happily playing the National Anthem. It's coronation Day.' In response, Liverpool fans told him it would 'be the worst received song you'll ever play'. "
    ]
}