{
    "articleURL": "/wires/pa/article-12039693/Two-five-65s-bank-account-not-manage-money-online.html",
    "content": [
        "Nearly four in 10 (39%) older people are not managing their money online and could therefore be at risk of financial exclusion, according to Age UK.",
        "A survey found a high level of support for in-person banking, with three-quarters (75%) of over-65s with a bank account wanting to undertake at least one banking task in person at a bank branch, building society or Post Office.Age UK commissioned a poll by Ipsos of more than 1,000 people aged 65 and over across Britain in March and April to make the findings.The research also found that nearly a third (31%) of older people with a bank account feel uncomfortable with online banking. Even older people who do bank online often want the ability to talk to a bank employee in the flesh about some kind of transaction  Caroline Abrahams, Age UK  The research participants who were most likely to feel uncomfortable using online banking included those aged 85-plus, women, and people on a low income.Among those who were uncomfortable with online banking, not wanting to be defrauded or scammed, a lack of trust in online banking services, and a lack of IT skills were cited as the main reasons.The charity wants to see an accelerated rollout of banking hubs, which are places where banks share facilities, helping to plug gaps left by branch closures.Caroline Abrahams, charity director at Age UK, said: “We need to face up to the fact that huge numbers of older people, the oldest old, especially, are not banking online.",
        "“In addition, our new research also shows that even older people who do bank online often want the ability to talk to a bank employee in the flesh about some kind of transaction.”John Howells, chief executive of cash machine and cash access network Link, said: “It’s vital to protect face-to-face banking services for the millions of consumers who rely on cash.“The proposed national network of shared banking hubs being provided by the banking industry are proving a popular and easy to use way to do that.”",
        "The findings were released as consumer group Which? highlighted security concerns around mobile app banking.Which? wants banks to stop relying on text messages to send sensitive information and fraud warnings. In the event of a phone being stolen, criminals can either view messages sent by text message or put the victim’s sim card into a different phone and continue to receive messages, the consumer group said.It highlighted an incident involving a 46-year-old Barclays customer who was in a London pub when his mobile phone was stolen from the pocket of his jacket, which was on the back of a chair.By the time he had woken up the next morning, £73,000 had been transferred from his accounts to one controlled by a fraudster, the consumer group said.",
        "Which? suggested someone may have potentially “shoulder surfed” to see the code the man had used to unlock his phone and then tried similar combinations to access the app.The bank sent a fraud warning via SMS, which is of no use to the account holder if their phone has been stolen, Which? said.The consumer group said Barclays refunded £15,000 stolen from the man’s personal account, but refused to reimburse his business account. Cyber insurance taken out by the man’s business meant he got the money transferred from his business account back. There is no higher priority than the protection of our customers' funds and data  Barclays  Which? said it has concerns generally about some banks’ security measures to reset login details.A spokesman for Barclays said: “There is no higher priority than the protection of our customers’ funds and data. The Barclays app has multiple layers of security, continually undergoing rigorous forms of testing, to provide our customers with the highest level of protection.“We have every sympathy with our customer, who has reported being a victim of a sophisticated and targeted mobile phone theft. Funds sent to a third-party account outside our customer’s control have been returned in full, as a gesture of goodwill.“We assess each case on its individual merits and, although we don’t see signs of fraud, we recognise that this is a complex case involving a loyal customer.”",
        "The Barclays customer said: “At no time did I feel that the bank listened to me, and they only returned the money to my personal account when put under serious scrutiny by the reporter from Which?“They still maintain that they can see no evidence of fraud, which is completely absurd given the weight of evidence shared, including from the police officer who I reported the crime to at the time.”Jenny Ross, Which? Money editor, said: “A lack of strong security protections in some banks’ mobile apps is a huge concern, and could leave many more consumers at risk of being defrauded.“Banks must up their game to protect customers. Banks also need to ensure they meet their legal obligations to reimburse customers for unauthorised transactions.”Here are some tips from Which? to protect your mobile phone:1. Add a pin to your sim to stop someone stealing the card and putting it in another phone. You can do this in your phone’s settings app.2. Disable preview notifications on your phone to stop thieves viewing messages when your phone is locked. On an iPhone, you can change notification settings under “messages”. On Android devices, it is “notifications on lock screen” in your settings app.3. Consider registering for “find my phone” using Google’s Find My Device or Apple’s Find My iPhone, so your phone can be located, locked or wiped of data remotely if it is lost or stolen."
    ]
}