{
    "articleURL": "/wires/pa/article-12047147/SNP-MP-Cherry-dismisses-Scottish-Government-independence-plans-lightweight.html",
    "content": [
        "The Scottish Government’s plans for an independent Scotland are “lightweight”, Joanna Cherry has said.",
        "An outspoken internal critic of the party, the Edinburgh SNP MP said she is unaware of what the strategy is for achieving independence, as she attacked the prospectus for Scotland after separation.Under Nicola Sturgeon, the Scottish Government published three in a series of policy papers that laid out the plans for an independent Scotland.The first – described as a scene setter – made comparisons between Scotland and other independent countries in Europe, while the subsequent publications discussed the economy, currency and democracy.",
        "Speaking to the Holyrood Sources podcast, Ms Cherry said: “These policy papers that have been produced are absolutely lightweight stuff.“I know there are a lot of successful, small, independent countries in Europe and I think most of us know that, but what I think voters, what people in Scotland, want to know is how are we going to get from where we are now – enmeshed in the United Kingdom – to being one of those successful countries?“That’s where the difficult questions lie in relation to questions to do with currency, to do with pension payments, to do with cross-border trade, to how long will it take us to get back into the EU? Do we sit in an association agreement while we do so?",
        "“I think there’s answers to all these questions – in politics there’s never a right answer, there has to be an answer that can be justified and an argument that can be made, but the party’s not put enough energy into doing that.”She went on to say that she and her activists have not been given the required “ammunition” to persuade voters to come over to the independence side.In the hour-long podcast, Ms Cherry hit out at former leader Ms Sturgeon a number of times, including suggesting that her administration did not further the cause of independence, and claimed the “party is intellectually dead from the neck up” because it “has not been allowed to have an intellectual debate for years”.",
        "She also accused the former first minister of increasing the “toxicity” of the debate around controversial gender reforms.Ms Cherry has been a vocal critic of allowing trans people to change their gender without a medical diagnosis – in a process known as self-ID – in recent years, which has caused run-ins with the party’s hierarchy.In January, Ms Sturgeon told the News Agents podcast that opponents of the legislation – which was blocked by the UK Government with the Scottish Government looking to overturn the move in court – are using women’s rights as a “cloak”.",
        "Ms Sturgeon said: “There are people who have opposed this Bill that cloak themselves in women’s rights to make it acceptable, but just as they’re transphobic you’ll also find that they’re deeply misogynist, often homophobic, possibly some of them racist as well.”Ms Cherry described the language from the former first minister as “intemperate” and “grossly irresponsible”, claiming it “fed the toxicity of the debate”."
    ]
}