{
    "articleURL": "/sport/football/article-12050185/Liverpool-play-God-Save-King-mark-King-Charles-Coronation.html",
    "content": [
        "Reds have confirmed they will play national anthem ahead of Brentford gamePremier League 'strongly suggested' all clubs hosting matches mark CoronationSome Liverpool fans have booed the national anthem at games in the past Liverpool have confirmed they will play the national anthem today — but have made the decision reluctantly and are privately angry at the Premier League.",
        "There has been a huge focus on the club since the League advised members last week to mark the Coronation by playing God Save the King, although there was no directive from the governing body that this was compulsory.Mail Sport understands clubs were first contacted about the proposals last Friday. They, in turn, had been in dialogue with the Department for Culture, Media and Sport, who had talked to all sports about planning for the occasion.There was no prospect of games being switched — Championship fixtures, for instance, are being played on Monday — and the Premier League insist it was the right thing to do to let clubs make their own decision on the national anthem.Liverpool contemplated not following the lead of others after stakeholders made it clear they did not want the anthem played and there were small pockets of chanting from fans about the Coronation during Wednesday’s 1-0 win over Fulham.",
        "The club were aware, however, that not playing God Save the King would see them subjected to a nationwide backlash. As such, players and officials will gather around the centre circle before kick-off for the anthem.Manager Jurgen Klopp said: ‘The club’s position is my position, that is clear. Besides that, this is definitely a subject which I cannot really have a proper opinion about. I am from Germany, we don’t have a king or a queen, I am 55 years old and I have no experience of that.",
        "‘Watching from the outside, it is a nice thing to watch when all the weddings are massive things in Germany, but no one really knows what it is like. It is like watching a movie. We don’t feel that.",
        "‘I am pretty sure a lot of people in this country will enjoy the Coronation, some will not be interested and some will not like it. That is over the whole country. That is all I can say about it.’Quite what happens when the anthem is played remains to be seen. Critics assume Liverpool fans will boo or chant, others believe there will be a spontaneous chorus of the club’s anthem You’ll Never Walk Alone.It has not been considered, however, that there might be supporters who want to join in.Liverpool do not want to be in a position where they disrespect anyone and it is for that reason they will go along with the other Premier League clubs. Privately, though, there is anger towards the Premier League. Liverpool had been planning to use the game against Brentford as an opportunity to celebrate the start of Eurovision week in the city.They were also going to tie-in their Foundation Day to mark 20 years of its charitable work in the city.",
        "Last season, more than 80,000 children and families in need in the area benefited from its work.But it is now the case that whatever happens with the national anthem will dominate the day.",
        "DOMINIC KING: Why Liverpool fans are likely to sing their own anthem You'll Never Walk Alone - and not God Save the King - during the Premier League's Coronation weekend The King and Queen visited Liverpool last week. A trip to the M&amp;S Bank Arena, where the Eurovision Song Contest will be hosted later this month, then on to the grand Central Library.Everything, unsurprisingly, passed without incident. People in this city are proud to showcase all that is good about their home, especially so when members of the royal family visit. The respect is mutual, the feelings are warm.All over Liverpool this weekend, plenty will be sitting down to watch the pageantry and pomp of the coronation and will celebrate the official start of the New Carolean era. The point must be stressed because not everyone would believe that to be the case.When Mail Sport broke a story on Saturday that the Premier League have asked their clubs to play the national anthem ahead of this weekend's fixtures, the first thing that many wondered was: what will happen at Anfield?",
        "Will there be booing? Will there be widespread dissent? Never mind that there can be anti-royal sentiments in other parts of the country, the gaze was immediately focused on Liverpool. It was the same when the Queen died last September.How will they react?",
        "First things first, it should be said that the Premier League, again, have abdicated responsibility. This is their mess. If they were serious about honouring the coronation, they would have made Saturday a clear day and switched all fixtures to Friday, Sunday and Monday.Don't listen to any guff from them about schedules and difficulties. They have had seven months to prepare for this, they could easily have worked something out. Instead, we have had this situation where faceless league officials are contacting clubs 'strongly advising them' to play God Save the King.What happens if Liverpool don't do it? They can't be fined or docked points because they aren't breaking any rules. Don't we live in a democracy where everyone has the freedom to make their own choices within the law? Why the pressure then for enforced patriotism?Those who are working themselves up into a frenzy about something happening at Anfield are, once again, failing to understand the bigger picture and making a lazy assumption that there has always been ill will towards the royal family on Merseyside.",
        "Not so. Let's turn the clock back to one of Liverpool's greatest and most significant days, when their captain, Ron Yeats, climbed Wembley's 39 steps to a booming soundtrack after they had just defeated Leeds in May 1965 to win the FA Cup for the first time.",
        "The travelling Kop were exultant and had spotted the guest of honour — who was about to hand over the trophy — was resplendent in a chic coat in their team's colours. Instinctively, this was acknowledged. 'The Queen's wearing red!' they bellowed, claiming Her Majesty as one of their own. 'The Queen's wearing red! Ee-ay-aadio, The Queen's wearing red!'Things, however, changed and that light touch of humour will never be repeated. But, to be clear, the booing of the national anthem you will have heard at Wembley in recent years has never been anything to do with personal attacks on individuals within the monarchy.When the Queen passed away, 54,000 fell silent before Liverpool's first match after the event against Ajax in the Champions League and all bar one cretin wanted to peacefully honour the life of a remarkable woman.So why now a furore about singing God Save the King before Brentford's visit?It is all to do with the establishment. Liverpool, a multi-cultural metropolis with vast Gaelic links, is thriving and vibrant now but it will never be forgotten that Margaret Thatcher was advised by Sir Geoffrey Howe to 'manage its decline' and leave it to rot after the Toxteth riots in 1981.",
        "None of this was the Queen's fault but Her Majesty's Government and Her Majesty's police were complicit in spreading lies and covering up the truth about the unforgivable events at Hillsborough in April 1989 when 97 fans were unlawfully killed.Does this not make you wonder why there would be a reluctance to sing the national anthem? A national anthem that, in football, is a refrain synonymous with boorish England fans who slur it out before internationals in European cities in between songs about the war.Liverpool and Everton fans have never been able to connect with such behaviour and, yes, they do see themselves as having a different outlook on situations from the rest of the country, but is that really a bad thing?What is bad is the spotlight that Liverpool, as a club and a city, have been put under via a wishy-washy brief from the Premier League, leaving critics of the club and city watching on and waiting to get angry if God Save the King isn't belted out with the gusto of the last night of the Proms.",
        "How many people outside Liverpool have truly tried to understand all this? In this observer's experience, the answer would be 'not very many at all' and I am reminded of an exchange with a Manchester City official after the Community Shield at Wembley in 2019.He couldn't accept that the booing had nothing to do with Prince William being in the stadium, it was all about venting at the establishment. He wouldn't listen to why there are grievances and wouldn't consider a different point of view.This, neatly, takes us to where we are today. Liverpool, a club who have always placed the greatest stock on respect and doing things properly, will be vilified by people if they don't fall into line but then come under attack if they do play it and there is booing.This has become unnecessarily complex. My own educated guess is that Liverpool will play God Save the King before the clash with Brentford but the stadium will end up singing the one anthem it truly believes in: You'll Never Walk Alone. And, perhaps, now you know why."
    ]
}