{
    "articleURL": "/tvshowbiz/article-12061229/Mila-Jovovich-debuts-unusual-new-haircut-gave-Four-Seasons-hotel-Los-Angeles.html",
    "content": [
        "Mila Jovovich adopted an upscale casual look as she arrived the Four Season hotel in Los Angeles Monday, along with an interesting new hair style.",
        "The Resident Evil star, who was seen with a bob hair style enjoying breakfast with her daughter in February, showcased her toned legs in a pair of navy blue shorts and red and black polka dot pumps.The action star paired the shorts with a loose fitting navy and white striped T-shirt and a camel jacket.She showcased her flawless complexion wearing natural looking makeup with a touch of red lipstick.Her dark hair was styled in an unusual way. ",
        "The looked revealed short spikes in the in the front.It was followed with sections cropped so closely, part of the Scream Award winner's scalp was visible.Longer, wavy strands were styled in a sort of pony tail in the back. Mila explained the new do sharing a couple of post-haircut photos on Instagram Thursday.'BLAAAH!! Felt I needed a change and had some clippers on hand,' she wrote.The Hellboy star then adopted a philosophical attitude. 'Anyway, it grows back. Love it or hate it, it’s done and now we’ll see what it grows into.'Famous pal Alyssa Milano gave her approval for the new style and asked for help creating a new look for herself. 'Come do mine! Bring the clippers!' The Ukrainian-born actress has recently wrapped work two action packed films and prepping for another.",
        "She has completed production on the futuristic Breathe.The plot focuses on mother and daughter living on a planet with a scare air supply who meet two strangers looking for an oxygenated haven.Sam Worthington, Common and Jennifer Hudson are costarring in the high action thriller. ",
        "Mila will star as a sorceress named Gray Alys who is in search of a magical power that allows a person to turn into a werewolf in the fantasy film In The Lost Lands.Guardians of the Galaxy star Dave Bautista costars in the action adventure co-written by Game of Thrones creator George RR Martin. The action hero's next project Hummingbird is currently listed as being in pre-production. Mila will star as a black ops assassin who questions her job after being given a questionable assignment.  "
    ]
}