{
    "articleURL": "/news/article-12060733/I-pay-Amazon-Prime-ads.html",
    "content": [
        "Amazon Prime Video viewers are complaining about an increase in advertsTrend is blamed on Prime's merger with other streaming services Dailymail.com takes a look at all the other platforms now showing commercials When streaming services first arrived, they promised to rid us of irritating ad breaks.",
        "So why are viewers noticing an uptick in commercials during their favorite shows? Frustrated Amazon Prime customers have taken to social media in their droves to complain about having to sit through commercials - despite forking out monthly fees for the service.'Why am I paying for Amazon prime if when I put a film on they slap 300 metaverse adverts in it?' wrote one user on Twitter.An Amazon Prime membership - which includes free shipping on the retail site - is currently priced at $14.99 per month but a video-only plan is just $8.99. ",
        "The increase in adverts was sparked by the firm's merger with IMDB TV - which was renamed to Freevee - and Twitch, a livestreaming service originally known for its gaming content.Both Freevee and Twitch are free to watch and paid for through commercials in the same vein as traditional TV.Now Prime integrates Freevee content into its homepage - meaning the commercials appear on both platforms.On top of that Prime - which features more than 20,000 movies and 2,000 television shows - also hosts content from other networks, some of which include commercials.Again, these adverts continue to appear on shows when they are added to Prime's gallery.But Amazon Prime is not the only offender. A host of other major streaming services including Netflix and HBO Max now offer plans which include adverts.",
        "Typically these plans are cheaper.Netflix offers a standard plan with adverts for $6.99 a month. A basic membership without commercials is then $9.99, a 'standard' plan is $15.49 while a 'premium' plan costs viewers $19.99. Similarly HBO Max charges customers $9.99 a month for a plan with adverts while its one without is $15.99.Paramount's ad plan is $4.99 but its commercial-free plans start at $9.99.Disney+ and Hulu offer a combined membership to both of their platforms with adverts for $9.99. Access to ESPN as well - with adverts - is $12.99. Its ad-free plan is $19.99.  It comes as streaming services grapple with financial losses across the board. ",
        "Last week it emerged Paramount Global missed its first-quarter revenue estimates as its subscription base stalled. Shares of the New York company fell six per cent in trading.And Netflix has suffered a volatile few years which has seen its stock plummet by as much as 47 percent at times.In the last quarter of 2022, the streaming giant saw its subscription base grow by a paltry 4 percent from the same period a year earlier. The stall in membership has in part been sparked by a clampdown on account sharing this year. According to Netflix's rules, people who do not live in the same household cannot stream from the same account. ",
        "While this was always a rule, the streaming giant is bringing in a new device verification feature which makes viewers prove where they are viewing from.It will then charge for 'sub-accounts' - though the cost varies between countries.The scheme has been rolled out in Chile where it charges sub-account holders $2.99 a month.But in Canada the fee is $7.99 per member - the equivalent of $5.95 in US dollars. The crackdown has yet to be implemented in the US after roll-out in Spain and Canada prompted a drop in its subscriptions.As a result Netflix delayed bringing in the new rules to the US from the first quarter of the year to the second.It means account sharing is expected to be banned in the next three months - though no official date has been given."
    ]
}