{
    "articleURL": "/sport/college-basketball/article-12055307/Bronny-commits-USC-LeBron-James-son-staying-LA-play-college-hoops-Trojans.html",
    "content": [
        "Not only will Bronny, 18, stay in the LA area, but he's going to a Nike schoolHe also considered Ohio State and Oregon - two other Nike universities  DailyMail.com provides all the latest international sports newsBronny James, the 18-year-old son of Los Angeles Lakers star LeBron James, has committed to play basketball at the University of Southern California. ",
        "The younger James announced his decision on Instagram, ending more than a year of speculation about his future. 'Fight On,' he wrote, referencing a Trojans slogan and adding the hashtag, '#committed.'Unsurprisingly, Bronny chose a Nike school, aligning him with the apparel giant that has helped turn his father into a billionaire. And as an added benefit, he'll remain in the LA area, playing less than an hour from his high school, Sierra Canyon. The elder James initially reacted to the news with enthusiasm on social media before expanding on his thoughts following the Lakers' blowout win Saturday night vs. the Warriors. 'One of the best days of my life,' LeBron said postgame via SportsNet. 'First of all, congratulations to Bronny... I'm super proud of him. For me, personally it's even more special to me because it's the first time someone out of my family [will] go to college. ",
        "'I couldn't lose today. No matter the outcome of this game, I couldn't lose today, personally.''FIGHT ON!!!' LeBron wrote on Instagram. 'So damn proud of you kid! I have no words besides I LOVE YOU!!! LET'S GO!!!!!!!!'Bronny's tenure with the Trojans may not be a long one if all goes according to plan. His father has often stated his desire to play on an NBA team with his son, and LeBron can opt out of his current Lakers contract in 2024, when Bronny is eligible to be drafted into the league. ",
        "'Man, Bronny definitely better than some of these cats I've been watching on league pass today,' LeBron tweeted in March. 'S*** lightweight hilarious.' The USC men's basketball Twitter account gave a muted reaction to the news with a single 'eyeballs' emoji. Bronny's commitment is a major coup for a basketball program that has traditionally been overshadowed by Trojans football.Coach Andy Enfield's team has reached the NCAA Tournament for three consecutive seasons, but has been bounced in the first round in each of the last two years.Enfield previously got commitments from Isaiah Collier, who is considered by many to be the top recruit in the class of 2023. The 6-foot-3 guard could team in the Trojan backcourt with Bronny next season. Furthermore, four-star center Arrinten Page has also committed to USC.The team also returns Reese Dixon-Waters, a 6-foot-5 guard who averaged 9.8 points a game last season.",
        "Bronny is not pegged to be the 'Next LeBron,' nor is he some watered-down version of the Los Angeles Lakers superstar. For starters, his father skipped the NCAA level in 2003 because the NBA had yet to implement its controversial one-and-done rule, requiring prospects to be one year removed from their high school class's graduation before being draft eligible. Instead, Bronny is very much his own player, and one that some insiders see as a potential top-10 pick in 2024.",
        "He's always been a highly visible part of LeBron's orbit alongside mother Savannah – LeBron's high school sweetheart from Akron – as well as younger sister Zhuri and brother Bryce, another highly recruited player. But it wasn't until 2019, when Bronny enrolled at Sierra Canyon alongside the son of his father's former teammate, Dwyane Wade, that he began drawing attention for his own play.Since then, Bronny has filled out to 6-foot-3 and 180 pounds, a far cry from his 6-foot-9 father, but plenty tall enough to get scholarship offers from Ohio State, Oregon, and USC, among others.'As most of his peers have flatlined the past 12 to 18 months, James has grown, filled out his frame, found another gear with his explosiveness and become an absolute terror off the ball defensively thanks to his outstanding intensity and feel for the game,' NBA Draft guru Jonathan Givony wrote for ESPN.'He still has plenty of room to improve his ballhandling and pull-up jumper to become a more prolific and efficient shot creator, but he has already caught the eyes of NBA decision-makers with the way he contributes to winning and likely will continue to grow and fill out his game.'",
        "Bronny, as he's known, has been a celebrity for nearly as long as LeBron, having been born in 2004 as the elder James was embarking on his illustrious NBA career with the Cleveland Cavaliers. ",
        "And as he's grown from LeBron's adorable sidekick into one of the most prized college recruits in the country, 18-year-old Bronny has become a product spokesman, endorsing the same brands that already pay his father: Nike, Beats by Dre.Bronny's production was deemed good enough to qualify for the 2023 McDonald's All-American Game alongside two other NBA scions: Andrej Stojakovic, the son of Peja, and D.J Wagner, the son of LeBron's former teammate, Dajuan.'His vert has improved as much as any kid in the class,' McDonald's voting committee member Brandon Clay told USA Today's Josh Peter.'Every time I've seen him play live, he's been really good, man,' Clay continued. 'He's played great competition. He always looks like he belongs at the table. He doesn't look out of place.'",
        "Bronny had 15 points in the game and showed off his improved shooting range, while draining 5 of 8 3-point attempts in the McDonald's All-American Game. He followed that with another 15-point performance at the Nike Hoops Summit.  Scouting agencies have Bronny ranked anywhere from 34 (247 Sports) to 28 (ESPN) in the class of 2023, but those figures have more to do with current ability than future projections.",
        "Writing for ESPN with an eye towards the 2024 NBA Draft, Givony sees Bronny as a top-10 pick given his recent growth, much of which cannot be measured by a box score. Whereas his father might be the NBA's All-Time leading scorer, Bronny doesn't need to score to impact winning, according to 247 Sports' Adam Finkelstein.",
        "'What is counterintuitive is that LeBron James' son and namesake isn't necessarily the guy who's going to go out and put 30 points on the board on any given night,' Finkelstein told USA Today. 'That's the part that I think surprises people at first glance who haven't been watching him.'What I think is most impressive is given the microscope he's been under for his entire high school career, he has always played the right way. It means he's shared the basketball, hasn't forced bad shots, hasn't forced himself into a starring role, plays within the flow of the game, doesn't overdribble. It means he is engaged and competitive defensively.'Even though he may not go out and get you 30, he does things that will impact winning not just at this level but at the next level.'And LeBron clearly expects Bronny to reach the next level, where he plans on playing alongside his son. 'My last year will be played with my son,' James told The Athletic in February of 2022. 'Wherever Bronny is at, that's where I'll be. I would do whatever it takes to play with my son for one year. It's not about the money at that point.' ",
        "James would not be the first professional athlete to play alongside their child.",
        "NHL legend Gordie Howe teamed with sons Mark and Marty on the WHA's Houston Aeros in the 1970s. Mark and Gordie also played together on the Hartford Whalers before and after the WHA's merger with the NHL.During the 1990 MLB season, former All-Star Ken Griffey Sr. signed with the Seattle Mariners, where his son and namesake had already begun his Hall of Fame career. In fact, that father-son duo hit back-to-back home runs against the California Angels on September 14, 1990.Whether or not Bronny and LeBron can have a similar impact playing together is anyone's guess."
    ]
}