{
    "articleURL": "/tvshowbiz/article-12053679/Katy-Perry-Edward-Enninful-arrive-King-Charles-Coronation.html",
    "content": [
        "How are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.uk Westminster Abbey was rammed with the great and good from Britain and around the world as Charles III's day of destiny finally arrived on Saturday. ",
        "And, Katy Perry, 38, paid homage to Vivienne Westwood in a lilac outfit from the late designer as she and Edward Enninful, 51, arrived at King Charles' Coronation.The pop star commanded attention in her vintage-style lavender ensemble, while the editor of British Vogue opted for a sleek suit to watch Charles be crowned.Katy showcased her slim frame in a pencil dress teamed with a co-ordinating short-sleeved jacket, boasting a nipped-in waist and matching opera gloves.She accessorised with an enormous dish-style net fascinator, while wearing a Vivienne Westwood necklace and carrying her belongings in a white top-handle bag from the designer. ",
        "Magaszine maestro Edward cut a dapper figure as he arrived in a bespoke Huntsman morning suit and proudly wore his OBE on his left breast pocket. He layered his perfectly tailored black wool single breasted morning coat by the swanky Saville Rowe designer over a blue wool vest and crisp white shirt with tie.Fans took to social media to voice their approval of her stunning Coronation look, with one person tweeting: 'MOTHERRRR OH MA GAD KATY PERRY LOOKS GORGEOUS #Coronation.''The fact that Katy Perry is [more] slaying than most of the royals is sending me,' wrote another, while a third added: 'Katy Perry wearing a Westwood orb choker cos she always understands the assignment. #Coronation.' ",
        "Some fans poked fun at the size of Katy's headwear, with one noting: 'Katy Perry’s brought her own satellite dish with her, no doubt to catch up on what CNN are getting wrong… #Coronation2023.''Basically Katy Perry and her huge hat at the #Coronation searching for her seat,' tweeted someone else, with a funny GIF.'Looks like everyone who is sitting near Katy Perry will be getting great 5G reception #Coronation,' wrote another fan. Other celebrities seen taking their seats in the church included Lionel Richie, Sir Andrew Lloyd Webber, Stephen Fry, Nick Cave and magician Dynamo, while Dame Emma Thompson gave a thumbs up in excitement.",
        "VIP guests queued for a mile from 6am to get one of the prime 2,300 seats inside. The abbey was full at just before 9am. Some 100 heads of state are in London, with representatives from 203 countries due to attend.They will watch Charles be crowned in a Christian ceremony that dates back for 1,000 years on a day dripping with glorious displays of pageantry.It will also shine a spotlight on Britain’s place on the world stage in the UK's biggest ceremonial military operation since the state funeral of Sir Winston Churchill in 1965 with 7,000 servicemen and women marching with the King and Queen.",
        "A rich royal blue carpet - chosen to highlight the regal red, gold and purple robes of the King and Queen - adorned the dais in the Coronation theatre. Stunning flowers in reds, burgundies and yellow golds covered the top of the ornate golden High Altar.A smiling Dean of Westminster in his vivid red clerical robe was seen hurriedly carrying the holy oil for the anointing down the length of the abbey from the altar through the quire, clutching the precious ornate silver vessel in both hands.",
        "Today’s Coronation will see 7,000 servicemen and women accompanying Their Majesties, making it the country’s biggest ceremonial event since 1953. Indeed, the Coronation procession back from the Abbey after the ceremony is so large that when the King and Queen arrive at Buckingham Palace, the rear will only have reached Downing Street, a mile away. More than 100million people around the world are about to watch the historic first Coronation of a British monarch in 70 years - with an estimated two million people on the streets of London to watch history unfold.The monarch had been heir since the age of three, and is now ready to finally embrace his day of destiny with the woman he loves by his side. His family, including Prince Andrew and Princess Anne, enjoyed a dinner at Mayfair club Oswald's on Friday night. Mike and Zara Tindall were out until 2am.",
        "Prince Harry flew in from Los Angeles for his 24-hour trip. It emerged on Friday night he has been relegated to the third row in the Abbey with other non-working royals.",
        "Katy Perry is set to perform at Sunday's Coronation Concert as part of a star-studded line-up, which includes Take That, and Lionel Richie, as well as including Italian opera singer Andrea Bocelli and Welsh bass-baritone Sir Bryn Terfel.The event, which will take place in the grounds of Windsor Castle, will be in front of a crowd of 20,000 members of the public and invited guests and broadcast across BBC television and radio stations.As a special honour in return for her performance, Katy is being allowed an exclusive stay in the royal residence of the 1,000-year-old castle."
    ]
}