{
    "articleURL": "/wires/pa/article-12055229/Dean-Smith-believes-Jamie-Vardy-lot-offer-Leicester.html",
    "content": [
        "Leicester boss Dean Smith believes Jamie Vardy can still flourish in the autumn of his career.",
        "The 36-year-old has returned to form in recent weeks, scoring in the last two games to help the Foxes out of the Premier League relegation zone, having previously gone 19 outings without a goal.The story of Vardy’s ascent to the top of the game is well known and Smith believes that him not coming through the system in a traditional way can help him now.“It doesn’t surprise me at all – this is someone who’s scored 136 Premier League goals,” Smith said of Vardy’s resurgence ahead of Monday’s vital clash with Fulham.“You don’t lose that. I expected that (pace) to still be there.“What I’ve seen from him is the desire to still keep wanting it, from the runs he’s making. His running numbers are really good from Monday night.",
        "“His story is synonymous with someone who came into the professional game a little bit later.“So he’s probably not had all of those games before – at academy level for instance. So I don’t see why he can’t flourish in his later years.”Much was made of whether former boss Brendan Rodgers played to Vardy’s strengths, something that Smith has seemed to do in the last few games.“I didn’t watch too many of the games to see if he was playing to his strengths,” Smith added.",
        "“He didn’t get as much pitch time as probably he would’ve liked, but I wasn’t here so I don’t really know.“Shakey’s (assistant boss Craig Shakespeare) worked with him before and knows him as a person and a player.“I know him as a player who’s been up against teams I’ve managed before.“He’s always a threat on the shoulder – just talking to their coaches after the game, they just tell their centre-halves to keep an eye on their shoulders, because he’ll be on one of them, and he was.”"
    ]
}