{
    "articleURL": "/sport/mlb/article-12061579/MLB-Akil-Baddoo-hit-hurts-throw-Guardians-catcher-Mike-Zunino.html",
    "content": [
        "Akil Baddoo took the hit while racing toward second base for the TigersHe ended up being on the winning team though - the Tigers won 6-2DailyMail.com provides all the latest international sports newsThere's bad luck, and then there's what happened to Akil Baddoo in the Detroit Tigers game against the Guardians on Monday night.",
        "At the top of the second inning Baddoo tried to steal a base for his team, when the Cleveland catcher Mike Zunino took the pitch at Miguel Cabrera and fired the ball towards second.Baddoo was scrambling to get there in time and made a desperate slide to get to the base before the ball, only for the ball to hit him right where it hurts.And if matters weren't painful enough for the 24-year-old, the ball then bounced off his groin and into the glove of Guardians second baseman Andes Gimenez.Baddoo was recoiling in pain on the floor after the hit and initially, commentators thought he had hurt his ankle or leg until they saw a replay.",
        "And the Guardians themselves didn't want to celebrate too excessively for getting Baddoo out.They tweeted the clip out and said: 'We don't know what to say. Just watch.'Baddoo played on for his team though, despite the very obvious pain that he was in. The Tigers won 6-2 in the end.Andy Ibanez singled, homered and scored three times to help the visiting Tigers post a win in the opener of a three-game series. Eric Haase had three hits and scored two runs and Riley Greene added two hits and two RBIs for the Tigers, who have won six of seven.",
        "Tigers starter Joey Wentz (1-3) allowed two runs and three hits in 5 2/3 innings. He struck out five and walked three.Guardians starter Tanner Bibee (1-1) gave up four runs and seven hits in 3 2/3 innings, striking out two and walking four.Jose Ramirez homered for Cleveland, which had won two in a row.The Guardians took a 1-0 lead in the first inning when Steven Kwan led off with a double, took second on Amed Rosario's single and scored on a double-play grounder by Ramirez.Ibanez and Haase opened the third with back-to-back singles to put runners on the corners. Ibanez scored on a slow roller to short by Zach McKinstry, who was initially called out at first, but the ruling was overturned.Haase came home on a one-out single by Javier Baez for a 2-1 lead, and Nick Maton made it 3-1 with a double off the wall in right.Ibanez and Haase reached base again to start the fourth. With one out, Greene doubled into the gap in right-center to score Ibanez and make it 4-1, but Haase was thrown out at the plate.",
        "Ramirez went deep to start the fourth and cut the deficit to 4-2.Ibanez hit the first pitch from Eli Morgan in the sixth inning deep over the fence in left for a 5-2 lead.",
        "Wentz walked the first two batters to open the sixth, but Ramirez popped out and Josh Bell flied out before Will Vest entered and got pinch hitter Josh Naylor to ground out to end the inning.The Guardians had runners on the corners with one out in the seventh but again failed to capitalize.Detroit tacked on another run in the eighth on an RBI single by Greene to make it 6-2."
    ]
}