{
    "articleURL": "/wires/aap/article-12054107/Tbirds-Giants-Super-Netball.html",
    "content": [
        "The Adelaide Thunderbirds have responded to a rocket from coach Tania Obst to jet to the top of the Super Netball ladder with a gutsy 54-50 win over the Giants at Ken Rosewall Arena.",
        "The Thunderbirds saw their eight-goal second-quarter lead disappear during an error-strewn third term on Saturday night before recovering strongly in the fourth to steal first place, prohibitively, from West Coast Fever who can pinch it back with victory against the NSW Swifts on Sunday.Georgie Horjus was an ever-present threat at wing attack, captain Hannah Petty injected much-needed second-half life when promoted off the bench and Shamera Sterling slowly but surely had Giants skipper Jo Harten's measure.\"We started really well, converting off our gains, then we started throwing a few balls away,\" Horjus said.\"We find it really hard to play in front of the Giants' crowd.\"We're really happy we could finish it off in the end.\"An 11-2 spree either side of quarter time saw the Thunderbirds break apart an early stalemate and sprint ahead by eight goals.Lauren Moore and April Brandley lifted the defensive resolve of the Giants who began chipping away at the deficit in the second period.The Giants then started the third stanza with a 5-0 bang, prompting Obst to call a time-out and deliver some home truths.\"We look like we don't even want to be out there,\" she said angrily.\"We're actually winning this game - so look like winners.\"Get involved!\"",
        "Obst had every right to be upset.Adelaide fell apart in that quarter, missing six shots, throwing away eight turnovers and amassing a whopping 27 penalties to be outscored 13-9 as the Giants eased ahead by one at three-quarter time.But the T'birds showed why they are regarded as one of this season's prime title contenders by flipping the script with a 14-9 fourth term.Harten and Sophie Dwyer lost their radar in attack as the Giants missed five of their last seven shots over the last five minutes in the face of Adelaide's relentless defence, led as always by Sterling."
    ]
}