{
    "articleURL": "/wires/ap/article-12049825/Key-dates-career-Turkeys-Recep-Tayyip-Erdogan.html",
    "content": [
        "ANKARA, Turkey (AP) - Turkish President Recep Tayyip Erdogan, who earlier this year marked 20 years in power - first as prime minister and later as president - is seeking a third consecutive presidential term in elections on May 14.",
        "The 69-year-old started as a reformist who expanded rights and freedoms, allowing his majority-Muslim country to start European Union membership negotiations.He later reversed course, cracking down on dissent, stifling the media and passing measures that eroded democracy.The presidential and parliamentary elections could be Erdogan´s most challenging yet. They will be held amid economic turmoil and high inflation, just three months after a devastating earthquake.Here´s a look at some of the key dates in Erdogan´s rule:- March 27, 1994: Erdogan is elected mayor of Istanbul, running on the pro-Islamic Welfare Party ticket.",
        "- Dec. 12, 1997: Erdogan is convicted of \"inciting hatred\" for reading a poem that the courts say violated secular laws. He is sentenced to four months in prison.- Aug. 14, 2001: Erdogan, having broken away from the Welfare Party with other members of its reformist wing, forms the conservative Justice and Development Party, or AKP.- Nov. 3, 2002: A year after it is founded, AKP wins a parliamentary majority in general elections. Erdogan however, is barred from running due to his conviction.- March 9, 2003: Erdogan is elected to parliament in a special election after his political ban is lifted. He replaces his AKP colleague as prime minister five days later.- Oct. 3, 2005: Turkey begins accession talks with the European Union.",
        "- July 22, 2007: Erdogan wins 46.6% of the votes in general elections.- October 20, 2008: The first of a series of trials against military officers and other public figures begins. The suspects are accused of plotting to overthrow the government, in what turn out to be sham trials designed to eliminate Erdogan´s opponents. The trials were later blamed on the network of U.S.-based cleric Fethullah Gulen.- Sept. 12, 2010: Erdogan wins a referendum on constitutional changes that allow the government to appoint high court judges, curb the powers of the military and ensure presidents are elected by a national vote rather than by parliament.- June 12, 2011: Erdogan wins general elections with 49.8% of the vote.- May 28, 2013: Nationwide anti-government protests erupt over plans to cut down trees at an Istanbul park. The government is accused of using excessive force against protesters.- Aug. 10, 2014: Erdogan wins Turkey´s first presidential election held by direct popular vote.- June 7, 2015: The AKP loses its majority in parliamentary elections. It regains a majority in re-run elections in November, following months of insecurity, including suicide bombings.- July 15, 2016: Erdogan´s government survives a military coup attempt blamed on followers of Gulen, a former ally. The government then embarks on a large-scale crackdown on members of Gulen´s network.",
        "- April 16, 2017: Voters in a referendum narrowly approve switching the country´s political system from a parliamentary democracy to an executive presidential system. Critics call it \"one-man rule\" by Erdogan.- June 24, 2018: Erdogan wins presidential elections with 52.59% of the vote, becoming Turkey´s first president with executive powers.- June 22, 2019: In a major blow to the AKP, Erdogan´s party loses a re-run election for Istanbul mayor, having contested March elections that the main opposition party´s candidate had also narrowly won.- Feb. 6, 2023: A powerful earthquake devastates parts of Turkey and Syria, killing more than 50,000 people in Turkey. Erdogan´s government is criticized for its poor response to the disaster. ___ Associated Press writer Zeynep Bilginsoy contributed from Istanbul."
    ]
}