{
    "articleURL": "/travel/article-12038039/We-flight-attendants-happened-scenes-training.html",
    "content": [
        "Kirsten Carriere from Toronto says closing the cabin door is tricky to master@millatheangel shared a video montage of her training with American Airlines'We have to be in business casual apparel,' @Nicks.Travels said of his courseWhat do inflatable slides, fire extinguishers and heavy doors have in common?",
        "They are all features of flight attendant training school, as highlighted by a fleet of TikTokers. Cabin crew from across the globe have shared behind the scenes clips from their grueling training camps, with some airline courses lasting up to six weeks.   Kirsten Carriere from Toronto took to social media to share one of the most difficult parts of her session, which involved closing the very heavy cabin door.In her video - which has been viewed more than 7.5 million times - she can be seen using all of her body weight to tug the door shut. But her efforts have little impact.  ",
        "In a bid to quash any viewer concerns, she highlights in an accompanying caption that this 'isn't something I struggle with anymore if you were wondering.'The now qualified flight attendant for Sunwing Airlines goes on to explain in the comment section that the 'gust lock was on... this was our first time trying the doors and we weren't told about it, hence the struggle!'Also regardless, these doors are not easy to open especially for the first time. They're heavy and there's a technique. You have to learn!'In another clip, a montage captures some of the other tasks she was required to carry out including giving safety briefings, whizzing down an inflatable emergency slide and operating a fire extinguisher. ",
        "Many viewers asked her if the flight attendant training was hard, to which she responded: 'It was! It was hard but it was manageable. 'You get out what you put in, and you really have to engage to get a hold of everything. But worth it!' Like Kirsten, TikToker @grracebaeb said closing the main cabin door was the hardest part of her training with American Airlines. She also shared a video of her struggling to pull it forward and into place.In an overlaid caption, Grace revealed that she finally managed to complete the task around five minutes later.",
        "Many fellow flight attendants sympathized with her struggles. One commenter wrote: 'I also struggled a lot with that door on the B737, but we make it through. You got this!'Another added: 'They are actually so much harder than they look! The first time I opened one I was shocked!'TikToker @millatheangel, who also trained as a flight attendant for American Airlines, shared a video montage showing what her training involved. She revealed in an overlaid caption that the training took six weeks in total. Some of the more intense moments shown in her clip see her with fellow trainees inside a life raft during a swimming pool drill and later putting out a blaze armed with a fire extinguisher and wearing a protective piece of headgear. ",
        "Milla captioned her video - which has been watched more than 620,000 times - 'best decision of my life!' in a bid to encourage others to pursue their 'wings.' ",
        "Giving further insight into what cabin crew training entails, @Nicks.Travels reveals what he needed to pack for his four week course with an unnamed airline in Florida. He tells viewers: 'We have to be in like business casual apparel... we're allowed to wear kind of like khaki chinos and black or khaki colors for our pants no jeans.. and then for our shirts we can wear anything that's like a full button down in black or white or two button polos.'Since my training is in Florida I got mostly short sleeves.'On the footwear side of things, he invested in some comfortable, simple black dress shoes. Then for daily training, Nick explains that 'it's like class, like we're going back to school and I have to have a binder and a notebook and a whole bunch of new pens and everything.' In a follow up video he explains that the flight attendant program includes a rigorous test process that many people aren't aware of. He says: 'It's so so stressful, but so rewarding at the same time.' The keen traveler is still awaiting his results and is set to update his followers on TikTok in due course. "
    ]
}