{
    "articleURL": "/tvshowbiz/article-12054141/Tess-Daly-reveals-unusual-tip-good-nights-sleep.html",
    "content": [
        "Tess Daly revealed her unusual tip for a good night's sleep on Friday evening.",
        "The Strictly Come Dancing presenter, 54, took to her Instagram to share a photograph of herself in bed with a piece of white tape on her mouth.She went on to reveal that is called mouth taping and she does it in a bid to encourage nose breathing when she nods off.Tess captioned her post related to her new book: 'I know this might look crazy, but there's method to my madness.' 'It's mouth taping! A method that helps to encourage nose breathing, for a deeper, more restful sleep.'",
        "The post attracted a swathe of interested fans who expressed their views on the unusual method.One person wrote: 'I do this... but it's to stop me snoring so my hubby can get a better sleep.'Another said: 'Can we use more tape than that... asking for a friend.'A third revealed that the method was making them feel uneasy, writing: 'That instantly makes me feel anxious.'It comes after Tess revealed last month that working and looking after her first child almost led her to 'burnout'. The presenter, 54, had Phoebe, 18, with husband Vernon Kay in 2005, and admitted hosting the show and breastfeeding was tough.Speaking to Psychologies Magazine, Tess, who was also recovering from a C-section, said: 'That was the closest I've ever come to burnout.",
        "'I was lucky that I had a job to go back to, because the industry I work in is incredibly fickle.'But breastfeeding and live television are not the easiest things to manage, and on top of that the sleep deprivation was intense and debilitating.'",
        "She admitted that she was physically and mentally exhausted although she was able to do her job and present live on television.The experience left her in a different headspace as she was putting her all into looking after her baby and working and not replenishing herself too.  Tess also shares Amber, 13, with Vernon, and has been married to him for more than 20 years.She stood by him in 2010 when he was caught texting another woman.The television personality has revealed that life has not always been easy for her but she is grateful for where she is now."
    ]
}