{
    "articleURL": "/sport/football/article-12060717/Rodri-insists-Manchester-City-revenge-Champions-League-clash-against-Real-Madrid.html",
    "content": [
        "Rodri insists that Manchester City are out for revenge against Real Madrid However, Pep Guardiola says it's an opportunity, not a chance for revenge OLIVER HOLT: Erling Haaland, your hunger makes you my Footballer of the Year  Manchester City's stars are going to the Bernabeu seeking revenge for last season’s dramatic Champions League exit at the hands of Real Madrid.",
        "Rodri insisted that the Premier League champions have learned lessons from the capitulation in last year’s semi-final, when they blew a two-goal lead in stoppage time of the second leg.The midfielder has never watched that game back but, with Real the obstacle to another final, claimed City are in the Spanish capital to settle scores on Tuesday.‘Football gives you the option for revenge,’ Rodri said. ‘We’re in a great moment, afraid of nothing. We trust 100 per cent that we’re going to be able to qualify.‘We have motivation with the feeling that we are doing things very good this year and we arrive in our best moment.",
        "‘Last year we did 180 brilliant minutes but sometimes it isn’t enough, you can lose in five minutes. We didn’t handle it in the right way and we have learned from that. The environment has changed a lot.‘Tomorrow we will try to give nothing to them and kill them when we can. Score goals in the moment you can punish.‘We need to fight like a small team, and then we have top quality players. We will fight hard again. We’ve been brilliant. The Treble? Not many teams can say this.’Rodri’s manager, Pep Guardiola, however chose to warn his players against becoming side-tracked by the potential for revenge, worrying it could make the tie too emotional.",
        "‘It would be a huge mistake,’ Guardiola said. ‘We’re not here for revenge, just an opportunity. We can learn a little bit from what happened. You cannot become crazy. It's a football game.‘I reviewed the games over the last two days and we couldn’t have played better in the home leg. Last season was the end of the world and we’re back. One day we will reach the final again and one day we will win it.’Bernardo Silva has also referenced the potential for revenge in recent weeks, while Guardiola revealed that he feels pressure to deliver the only trophy missing from City’s cabinet.",
        "‘The demand to win the Champions League, I know it,’ the Catalan added. ‘I had the feeling when I arrived. They [the club] never asked me but I had the feeling after the first Premier League [title] that the target would be to win a trophy that you don’t have.’Despite perennially crowned as kings of Europe, Real were downplaying their prospects of progressing past City in consecutive seasons on Monday night. Carlo Ancelotti fears that paying too much attention to 51-goal Erling Haaland could prove fateful.‘Obviously he is a very dangerous player, he is showing impressive quality especially in scoring goals, but only talking about him means not talking about a very complete team,’ Ancelotti said.",
        "‘They defend well, attacks, has ideas, so we are not thinking about a game to stop him but to stop a team that seems unstoppable. But I think we can have a chance to do a good, equal, competitive game that we can win.’"
    ]
}