{
    "articleURL": "/wires/afp/article-12060647/US-UAE-announced-climate-farming-fund-grown-13-bn.html",
    "content": [
        "Funding for a global initiative aimed at creating more environmentally friendly and climate-resilient farming has grown to $13 billion, co-leaders the United States and the United Arab Emirates said Monday.",
        "That money means the Agriculture Innovation Mission (AIM) for Climate, launched in 2021, now exceeds its $10 billion target for the COP28 climate talks, to be hosted by the UAE in November and December.\"Climate change continues to impact longstanding agricultural practices in every country and a strong global commitment is necessary to face the challenges of climate change head-on,\" US Secretary of Agriculture Tom Vilsack said in a statement.Vilsack and his Emirati counterpart Mariam bint Mohammed Almheiri, the UAE Minister of Climate Change and Environment, are co-hosting an AIM for Climate Summit in Washington this week.\"I think the beauty of this is that of the $13 billion, $10 billion comes from government and three billion is coming from the private sector,\" said Almheiri.Between a quarter and a third of global greenhouse emissions come from food systems, from factors like deforestation to make way for agricultural land, methane emissions from livestock, the energy costs associated with supply chains and energy used by consumers to store and prepare food.At the same time, the changing climate is threatening food security across the world, as global warming increases the frequency of punishing heat waves, droughts and extreme weather events.Projects underway include developing newer, greener fertilizers that use less fossil fuels to create, and returning to so-called \"regenerative agriculture\" practices that restore soil biodiversity, thus improving both yield and carbon sequestration while reducing the need for fertilization.",
        "Artificial intelligence-enhanced tools meanwhile are being developed to take data from sources including satellites and ground sensors to then accurately estimate how carbon-rich any given plot of land is, which could help farmers boost soil health or enable the creation of a viable carbon offset market.",
        "Also on the group's agenda are efforts to adopt more efficient farming techniques and to switch to growing crops that require less water in some climate-impacted areas.\"Black farmers, Indigenous farmers, low-income farmers, they need access to this innovation as well,\" former US vice president Al Gore and climate activist told the summit's opening meeting.US climate envoy John Kerry, as well as ministers from Britain, the European Commission, Australia, Kenya, Mexico and Panama are all set to address the conference."
    ]
}