{
    "articleURL": "/news/article-12052861/Gold-Coast-Powerball-winner-scooped-20million-pool-won-nearly-500-000-night.html",
    "content": [
        "A man won the $20m division one prizeHe won 159 more times in other divisionsHe'd bought the winning tickets hours priorA man who bought a last-minute lotto ticket thought someone from his work was calling with a problem when he discovered he'd claimed the $20million top prize. ",
        "The father from the Gold Coast man was heading to bed after work on Thursday when he mistook the call from Powerball officials as a call from work.'I thought it was someone from work calling me with a problem,' he told The Lott officials.He'd bought his ticket online just hours before the draw.But his 11th hour purchase not only netted him the division one prize of $20 million but sizeable additional wins in the second, third, and fourth divisions. ",
        "The man from Oxenford, 60kms south of Brisbane, has been routinely buying tickets for the $20 million Powerball because 'it was a nice number'.'I tend not to play Powerball every week, but as soon as the jackpot is over $20 million I'll get an entry,' he said.'I've just always thought $20 million was a nice number, and now I know it is a very nice number.The best win I've ever had is $100, and I was pretty chuffed with that. This is something else.'On the way home from work, he'd decided to continue this tradition even though he had to buy it online - breaking the usual tradition. 'I didn't get the chance today as I left it quite late. It was after 5pm, and I almost didn't grab a ticket at all. I'm glad I did,' he said. ",
        "'I was literally walking into the bedroom to go to bed when you called.'I've always wanted a call like this.'His division one draw of $20,053,292 was immediately followed by several System 8 PowerHit QuickPick prizes.His winning numbers were 35, 31, 20,18, 13, 2 and 34, with Powerball number 9. He was the only entry to win the massive division one prize. The additional wins including winning division two 19 times, division three 7 times and division four 133 times, adding another $442,070 to his windfall.",
        "After realising he'd just won a total of $20,495,362, the man immediately started looking toward the future.'I'd like to retire earlier than planned, and I'd like to set the kids up with a house,' he said.'I still can't believe it - I don't think I'll even believe it's real when it's in my bank account.'I just want to wake up in the morning and make sure it's not a dream.'"
    ]
}