{
    "articleURL": "/news/article-12052451/Has-Kevin-Costner-given-Yellowstone-save-marriage.html",
    "content": [
        "Christine Baumgartner, 49, filed for divorce, citing 'irreconcilable differences'Kevin Costner was totally surprised by Christine's decision to end their marriageWithin hours of the divorce news breaking, leaks said Yellowstone was endingA cheery date with a girlfriend in the California ­sunshine, poignantly with her wedding ring removed, was a clear — and yet rather obvious — ­signal from Kevin Costner's wife ­Christine that all was not well their 18-year marriage.",
        "Yet it was the puzzling statement put out by the Hollywood actor himself about his impending divorce that got everyone talking.Most celebrities, after all, go out of their way to put a positive spin on their partings and to present painful break-ups as joint decisions that have been carefully thought out.'We happily remain committed and caring friends with great love and admiration for one another,' gushed Jennifer Aniston and Brad Pitt in 2005.'We go forward with love and friendship... and a commitment to co-parenting our children,' Jennifer Garner and Ben Affleck said solemnly in 2015. Then, of course, there was Gwyneth Paltrow and Chris Martin's famously effusive statement in 2014 in which the twosome did not even mention the D-word, revealing they were 'consciously uncoupling'. ",
        "But there has been no joint statement this week from Costner, star of the television blockbuster Yellowstone, and ­Christine Baumgartner.Watch the epic final instalment of Yellowstone returns this November, only on Stan. Christine filed for divorce on May 1, citing 'irreconcilable differences'. Unusually, it was left to Costner's representative to confirm the couple are ending their marriage.'It is with great sadness that circumstances beyond his control have transpired which have resulted in Mr Costner having to participate in a dissolution of marriage action,' the ­statement said.",
        "And it's a statement which raises more ­questions than it answers.Clearly, Costner, 68, doesn't want to get a divorce. Sources indicate that he sincerely loves his 49-year-old wife, whom he calls Chris, and he treasured spending more time with her and their family during lockdown. And as a California resident, where assets are divided along 50/50 lines, he has much to lose, given a reputed fortune of $250 million (although there is a pre-nup.)He has taken the precaution of already hiring the 'disso queen' lawyer Laura Wasser, whose clients have included Angelina Jolie, Johnny Depp and Kim Kardashian.But the other question is what on earth could these 'circumstances beyond his control' be which have forced him to 'participate' in a divorce?In the absence of concrete information, a global guessing game has sprung up, with some news websites reporting on Thursday that Costner had got a co-worker on Yellowstone pregnant.",
        "His publicist Arnold Robinson told this paper: 'The rumour referred to regarding Mr Costner impregnating a woman on the set of Yellowstone is absolutely not true and is defamatory.'Another suggestion — neither confirmed nor denied — is that Christine dumped Costner because he was unwilling to scale back on his work schedule.Last year it was suggested that Christine had told him to quit the show or else she would leave him.",
        "Curiously, within a few hours of the news of the divorce breaking, leaks suggested that Yellowstone was coming to an end after the filming of this current series.Could it be that Costner has pulled the plug on his starring role in the biggest TV show in America, for which he is reportedly paid an eye-watering $1.2 million per episode, in a bid to save his marriage?What is certain is that the actor, famed for being difficult (more of which later), has been locking horns with Yellowstone's writer and director, Taylor Sheridan, lately.The first hints that all was not well between Costner and the show's executives came in January when the actor was surprisingly absent from the Golden Globe awards. He explained that he couldn't get to the ceremony due to flooding.In a Twitter video, Costner said: 'Hi everyone. Look, I'm so sorry for everyone who might have been tuning in to watch the Golden Globes — Chris and I aren't going to be there.",
        "'Yesterday we had to pull the kids out of school in Santa Barbara. This is the second time in five years that the freeway has flooded out, we found ourselves on the wrong side of the town and we couldn't get back last night. We're going to sit at the television and see what happens.'",
        "What happened on the night was that he was crowned winner of the 2023 Actor in Drama Series award. By this point, however, a ferocious behind-the-scenes row was brewing with the executives.Matt Belloni, of the respected industry website Puck, said in February: 'Costner tried noting (giving suggestions to) Sheridan during the first couple seasons of Yellowstone, which I'm told didn't go over well.'Once the show became a smash hit, Costner is said to have begun 'squeezing', i.e. demanding to be compensated for promotion days, on top of his already generous contract. Negotiations became so heated, Belloni noted, that Costner's agent of ten years, Brad Slater, left his team.Then came the suggestion that Costner was only prepared to give a week of his time to shoot the second part of series five.This was vigorously denied by his lawyer, Marty Singer. 'It's an absolute lie. It's ridiculous and anyone suggesting it shouldn't be believed for one second,' he said.Soon after, a new version of events appeared in the New York Post. In this version, Taylor Sheridan was said to have a 'God complex' and was to blame for all the ill-feeling Publicist Robinson has also stepped in to deny rumours of health issues: 'Any suggestion that Mr. Costner is in bad health is also untrue,' he said.",
        "What is undisputed, however, is that Costner was totally surprised by Christine's decision to end their marriage. 'He obviously doesn't want the divorce. He was blindsided,' said a source. The couple has each applied for joint custody of their three children Cayden, 15, Hayes, 14 and 12-year-old Grace.",
        "Whatever the reasons behind the split are, it's an embarrassing and unhappy moment in the life of the popular actor.Growing up in Compton, California, Costner first started acting in school plays and in musicals performed at the Baptist church his family attended.His father, who worked for an electric company, was constantly transferred for work and the young Costner went to four schools in four years, a period of his childhood that he once described as the 'unstable years.'He found it hard to make friends, especially with girls. 'I was real short as a sophomore in high school – 5ft 2in,' the actor who is now 6ft 1in tall said in a 1998 interview. 'It was embarrassing with girls, who were all taller than me. I was a little guy – maturity came late.'He went to California State University where he studied marketing and finance and met his first wife Cindy Silva at a college party. They married after graduation and went on to have three children together: Annie, 39, Lily, 36 and Joe, 35.",
        "For six years, while seeking success as an actor, he worked on building sites and took behind-the-scenes jobs in theatres. However, at least one company recognised the good looks that would make his fortune.His first break came in 1983 in the film The Big Chill, but his scenes were cut before the film was released. However, the director Lawrence Kasdan remembered the laconic and handsome young man who reminded him of an old-fashioned Hollywood star and put him in his next film Silverado in 1985.He went on to co-star with Sean Connery and Robert DeNiro in The Untouchables and played a Navy officer investigating a suspicious death in the film No Way Out, complete with steamy sex scene with actress Sean Young.",
        "His next big hit was the 1990 hit Dances With Wolves in which he played a Civil War soldier who develops a relationship with a tribe of Lakota Indians. Costner also directed and produced the three hour epic which won seven Academy Awards, including two for Costner for best picture and best director.He took the starring role in the 1991 film Robin Hood: Prince of Thieves and nonchalantly played the legendary folk hero in an accent that veered between English and American.Another smash hit was in 1992 with the romantic drama The Bodyguard, alongside Whitney Houston in her debut screen role. Made for $25m, the film grossed $411m worldwide.But Costner's career has had its share of disappointments, too – and he developed a reputation in some circles for being difficult.The actor's 1995 Waterworld, depicting a future when ice caps have melted and flooded the earth, was deemed a flop. And at the peak of his fame in the 1990s he was known for leveraging his star power. There was a fight over the editing of the 1999 film, For The Love of the Game, which culminated in a highly unusual public rebuke from the then head of Universal, Stacy Snider, who said: 'Kevin's not the director and it's not fair for him to hijack a $50 million asset.'Mid-shoot he lost directors on both Robin Hood: Prince of Thieves and Waterworld and most notoriously he was intransigent about his post apocalyptic film The Postman, which he insisted run at a full three hours. It bombed and lost millions.Costner's marriage to his college sweetheart lasted 16 years but the couple split in 1994 amid reports of infidelity, which he denied. Cindy received a then-record $80m divorce payout.Post-divorce, he went on to have a short-lived romance with socialite and television reporter Bridget Rooney with whom he has a 28-year-old son Liam.",
        "Baumgartner first met Costner in the early 90s on a golf course when he was preparing for his role as a washed-up golf pro eking out a living on a driving range in the comedy Tin Cup. She ran into him again in a restaurant in 1998 and they exchanged numbers. They split up briefly in 2002 over his reluctance to have more children: 'Fear kept me from marrying Christine,' he recalled in an interview. 'She wanted a child, but I was afraid I couldn't be an effective father,' but rekindled their romance after Costner changed his mind.They married in 2004 at Costner's 160-acre ranch The Dunbar in Aspen, Colorado, which is named after his character in Dances With Wolves. Their friend David Giammarco said at the time that, despite the 20-year age difference, they were 'like two little kids together, really in love'.A model when she met Costner, Christine started a handbag company called Cat Bag Couture.The couple, who have a $145m beachfront spread in Ventura, California, were frequently seen at Hollywood events and seemed blissfully happy.In 2020, when the Covid pandemic happened, the pair home-schooled their three children and Costner said they became closer. 'Our partnership has really come into focus about what we do for each other and how we deal with our family.' he said in an interview.Last November, Costner was still speaking fondly of Christine. 'The house is prettier because of her. Everything is warmer because of her. There's these little things that she does and I think it's the power of love, but that she makes her home that way.'These snapshots of marital harmony are certainly at odds with this week's news of the divorce, but rumours have been circulating for some time of friction between the couple because of Costner's self-imposed and heavy workload.",
        "A perfectionist who wants to be involved with every aspect of the films he is making, his latest project, Horizon, is being shot in Utah, once again far from home. One can see how Christine might finally have put her foot down.Because he and his wife have a pre-nuptial agreement in place, any financial losses are not likely to reach the record-breaking levels of his first divorce.But the actor once said that going through that initial split was one of the toughest times of his life. 'No-one wants their marriage to end, and it did, you are going to see the people you love most, your children, only half as much. That's a huge loss,' he recalled.He clearly, therefore, will not relish this latest marriage failure. A hearing in the couple's divorce case is set for July. That gives him two months to turn events around."
    ]
}