{
    "articleURL": "/sport/mma/article-12041205/Aljamain-Sterling-Henry-Cejudo-share-awkward-12-SECOND-handshake-ahead-UFC-288.html",
    "content": [
        "Aljamain Sterling faces Henry Cejudo in the main event of UFC 288 this SaturdayBantamweight stars crossed paths in New Jersey in awkward hotel encounterSterling said: 'It's how the game goes, you have to crush another man's dreams' Henry Cejudo and Aljamain Sterling were filmed running into each other in an awkward hotel encounter before their UFC 288 headliner this Saturday. ",
        "The bantamweight champion, fighting on home turf in New Jersey, approached Cejudo, who had his large entourage positioned behind him.The pair shared a brief exchange of words and a strange 12-second handshake.  Cejudo asked: 'Are you ready? And Sterling responded: 'I'm always ready!'Cejudo then replied: 'Well good luck cause I'm ready. I'm ready.'",
        "'I do appreciate it, seriously', Sterling admitted. 'Not the whole… so, I didn't think you were serious but I'm glad.''This has been a good camp for me', said Cejudo. 'It's been a good camp, we have a solid team and my job is to get it done, you know and I know how much you want, you know, defend in your backyard but I'm ready dude.'To which Sterling said: 'I hope so man. It's gonna be a good show for the fans, that's all I care about. As long as it's a good show. 'I know I'm going to make my money. I'm sorry, this is how the game goes, gotta crush another guys dreams you know.'Cejudo finished with: '145 pounds. Good luck.'Sterling later reflected on the exchange. He told The MMA Hour: 'Any takeaways... him being unsure of himself. 'Him saying he had a great camp, those are certain things that don't need to be said. We're going to fight, the fight is a couple of days away, you don't need to tell me that.",
        "'Like, dude, I respect you took the fight and wasn't sure if you were serious but now I look forward to match up, I know neither of us will back down.'",
        "Cejudo has been out of action for three years having retired after his last title defence against Dominic Cruz. Sterling, however, has been keeping busy, winning the belt in controversial circumstances due to an illegal knee from Petr Yan, before beating the Russian in their rematch. He also overcame an injured TJ Dillashaw and will look to add even more credibility to his reign with a win over the former two-weight champion on Saturday night.  "
    ]
}