{
    "articleURL": "/sport/formulaone/article-12058425/World-famous-Aussie-sports-superstars-childhood-photos-revealed-guess-is.html",
    "content": [
        "Sport star has revealed childhood photos Some of the images foretell his future careerMany of his character traits remain the same He's been one of Australia's biggest global sports stars since he cracked the big time in 2011 - and as you can see from his childhood photos, that trademark grin has been a habit of his since a very young age.",
        "Lively and full of energy, the sportsman has built a career on marketing himself almost as much as his sporting ability.He's a practical joker who loves a laugh and has gotten on the nerves of some of his sporting contemporaries over the years - and when he was young he tormented his poor teachers and parents.'The teachers would say I had ants in my pants. Like I couldn't sit still. I was always like fidgety,' he said.'Kinda just like high energy and certainly cheeky.'",
        "Still haven't guessed? It's none other than F1 driver Daniel Ricciardo.His father was a racecar driver and as the pictures show, the former McLaren star developed a need for speed at a very young age. 'Two, three years old, like I've got faint memories of being at the track, putting the earmuffs on and that was like the first kind of attraction where I was kind of like scared by the noise,' he said.'But I also loved it, because I knew that represented like the speed and there was excitement that was with that.'While Ricciardo is currently biding his time between races after joining Red Bull as a reserve driver after his split with the British team last year, back in the day he couldn't wait to get into the hot seat.",
        "'I remember the first time I drove a go-kart, I didn't meet the height requirement,' he said.'It felt like an eternity till I like grew enough to be able to get in there myself.'And I remember just being on like the little straight and all I think of is, like, freedom.'",
        "Ricciardo was born in Perth, Western Australia on July 1, 1989. His parents were Italian-Australians with his father, Giuseppe 'Joe' Ricciardo, hailing from Ficarra [Messina] and his mother, Grace, born in Australia with her parents originally from Casignana [Calabria]. The Monaco Grand Prix winner grew up in Duncraig, one of the northern suburbs of Perth, where he attended Newman College. He was raised Catholic and had an early introduction to motorsport through his father's races at the nearby Barbagallo Raceway in Wanneroo.",
        "At the age of nine Ricciardo began his racing journey in karts with the Tiger Kart Club. He quickly progressed to National and International karting levels before moving onto single-seater racing cars and eventually reaching Formula 1.In 2005, he participated in the Western Australian Formula Ford championship driving a 15-year-old Van Diemen and finished eighth overall. Towards the end of the season, Ricciardo traveled to Melbourne's Sandown Raceway to compete in the national Formula Ford series with a leased 13-year-old Van Diemen. ",
        "Unfortunately, his car was uncompetitive, and he finished 16th, 17th, and retired during the weekend's three races. In 2007, after finishing sixth in the Formula Renault 2.0 Italia, Ricciardo was selected by Red Bull Junior Team to continue his racing career - and the rest is history."
    ]
}