{
    "articleURL": "/sport/rugbyunion/article-12044501/How-NRL-played-right-Rugby-Australias-hands-Joseph-Suaalii-defection.html",
    "content": [
        " NRL's response to raid was perfect for Rugby Australia Embattled code got priceless free publicity Suaalii defection has reunited rugby faithfulWhen the NRL responded to Joseph Suaalii's defection to rugby they did precisely what their rivals wanted, it has been revealed - with the head of the 15-a-side code in Australia insisting the youngster is already worth 10 times his record-breaking salary.",
        "The 19-year-old is set to become one of the best-paid rugby players in Australia after signing a three-year deal worth $1.6million per season and is expected to be available to play for the Wallabies from the end of 2024.His departure is a huge blow to the NRL and comes just months after new Wallabies boss Eddie Jones warned he would raid the code in an attempt to lure some of its biggest stars to rugby.The complaints from the NRL about losing Suaalii both reunited long-suffering union diehards and gave the code much-needed free publicity, according to Rugby Australia chairman Hamish McLennan.'The media reaction has been extraordinary,' McLennan told News Corp.'He's an amazing talent that has already paid us back tenfold. It was a well-considered decision.' ",
        "'As Gus [Phil] Gould quite rightly said, 'Every time they see Joseph everyone will correlate that with his return to union'.'Joseph will be a sponsor's dream, he'll put bums on seats.'Suaalii grew up playing rugby union and excelled in the sport during his time at Sydney's exclusive King's School, where he was spotted by NRL scouts.Originally signed to South Sydney, he penned a contract with the Roosters in 2019 and rugby league Immortal Andrew Johns soon branded him a generational talent.",
        "Rugby Australia, which has been on life support for a number of years, have pulled off a huge coup by signing one of the country's hottest prospects and it has fired up the supporter base.'We've been raided for years by the NRL and this is part of a long-term strategy to get a select few cross-code winners back into our game, McLennan said.'There's a greater risk that we do nothing. So we're on the move and this is just the start.'We've been plundered for years, so let's be clear, it's been one-way traffic so we've fought back and we have a golden decade coming up and the way we're going to improve performance is through getting better players. That's quite obvious.'",
        "There's no guarantee that Suaalii, who is still a teenager, will transition smoothly to union at the highest level - but McLennan believes his enormous investment was worth it.'He's an amazing talent that has already paid us back tenfold,' McLennan said. 'It was a well-considered decision.'"
    ]
}