{
    "articleURL": "/wires/reuters/article-12058943/Japans-Marubeni-sees-2023-24-profit-years-record-4-bln.html",
    "content": [
        "By Katya Golubkova and Yuka Obayashi",
        "TOKYO, May 8 (Reuters) - Japan's Marubeni Corp expects its net profit to fall 23% in the current fiscal year to 420 billion yen ($3.1 billion), from a record posted in 2022/23, as lower commodity prices coupled with economic slowdown take a toll.Japanese trading house Marubeni posted a record 543 billion yen ($4 billion) in 2022/23 fiscal year net profit on Monday, a 28% increase from the year before, helped by robust earnings in its UK power unit and higher prices of coal, oil and liquefied natural gas (LNG).Its peers, Mitsui &amp;amp; Co and Sojitz, also saw record profits in the 2022/23 fiscal year but warned of lower results in the current year as commodity prices are retreating from last year's peaks.\"Our profit is expected to decline significantly this year due to rising U.S. interest rates, a decline in commodity prices amid economic slowdown and an uncertain business environment for non-resource businesses,\" Marubeni Chief Executive Officer Masumi Kakinoki told a news conference.\"But we believe the profitability of non-resource segments will steadily increase over the next few years,\" he said.In the latest tightening cycle aimed at fighting inflation, the Bank of England looks set to raise interest rates to 4.5% on May 11, a Reuters poll showed, following increases by the U.S. Federal Reserve and the European Central Bank.",
        "For the current year, Marubeni plans to spend 400 billion yen in new projects as well as on capital expenditure of existing projects.\"The main part will be the expansion and extension of our existing businesses,\" Kakinoki said, pointing to food, agri-business and U.S. business investments as an example.\"But we'd also like to consider investing in the resource sector which made a significant contribution the previous year, if we find a good project,\" he added.Marubeni would buy back up to 2.1% of its shares worth 30 billion yen and which would be then cancelled. Marubeni's shares closed up 0.1% after the announcement, outperforming the broader Nikkei 225 index, which ended down 0.7%. ($1 = 134.9700 yen) (Reporting by Katya Golubkova and Yuka Obayashi; Editing by Eileen Soreng and Jacqueline Wong)"
    ]
}