{
    "articleURL": "/sport/football/article-12057871/Rio-Ferdinand-insists-Wout-Weghorst-doesnt-creativity-play-No-10-Man-United.html",
    "content": [
        "Manchester United lost 1-0 to West Ham at the London Stadium on Sunday nightRio Ferdinand felt Wout Weghorst lacked the creativity to play as a number 10Peter Crouch agreed, arguing Erik ten Hag should use him further forwardPeter Crouch and Rio Ferdinand have questioned Erik ten Hag's decision to play Wout Weghorst as a number 10 after Manchester United's 1-0 loss to West Ham on Sunday.",
        "Erik ten Hag's side went behind in the first half after an error from David de Gea allowed Said Benrahma to score from 20 yards out.United created a number of chances as the game progressed, but could not find a way back into the game after a string of tame finishes.Weghorst, who remains goalless after 14 Premier League appearances for the Red Devils, came under particular criticism after being deployed behind main striker Marcus Rashford, an unusual position for a 6ft 6in centre forward.'I just can't understand it,' said fellow tall striker Peter Crouch on BT Sport,  'I can’t get my head around what he offers in that position.'",
        "On now to get the best out of the Dutchman, he added: 'If you play Weghorst you’ve got to play him high up so the likes of Rashford and [Jadon] Sancho can bounce balls of him, you can play one touch and then he’s in the box for any crosses.'The Dutchman is currently on loan at the club from Burnley, but reports this week have suggested he is unlikely to join the club permanently this summer.Ferdinand agreed that Weghorst was not well-suited to the role he played on Sunday. He added: 'Man United’s Number 10 doesn’t look like Weghorst in my eyes.",
        "'If I am Sancho, Bruno [Fernandes], [Alejandro] Garnacho, [Anthony] Martial and I’m seeing him line up as a no 10 in front of me, the number 10 shirt means something else. ",
        "'It’s a player that can create, who has got guile, who’s going to get between the lines and get on the half turn and bring other people into play in that sense and get goals. He doesn’t offer enough of those things I’ve said.' United remain in the Champions League places after Sunday's loss, but are now just one point ahead of fifth place Liverpool with a game in hand.Jurgen Klopp's side are ending the season on a hot streak after winning their last six games, and face a relatively easy run in with games against Leicester, Aston Villa and Southampton.United's end to the season also looks straightforward on paper as they face Wolves, Bournemouth, Chelsea and Fulham, but they have now lost consecutive games 1-0 and won just once in their last four. "
    ]
}