{
    "articleURL": "/tvshowbiz/article-12049205/Pregnant-Stassi-Schroeder-looks-chic-covers-baby-bump-beige-dress-new-selfie.html",
    "content": [
        "Stassi Schroeder showed off her chic maternity style on Thursday.",
        "The Vanderpump Rules alum, 34 - who's currently expecting her second child - took to Instagram with a stylish bathroom mirror selfie showing off her look of the day.The reality TV star covered up her burgeoning bump in a cream dress and a trendy tan blazer with sparkling fringe details. The beauty wore her blonde tresses parted in the middle and cascading down in light waves. Schroeder is currently expecting her second child - a boy - with husband Beau Clark. The couple already share daughter Hartford, two. ",
        "Stassi opted for a touch of glam in her selfie, wearing black eyeliner and a swipe of blush. 'Dallas OOTD,' she wrote in a text overlay on the snap. Stassi went on share a second snap showing off her full outfit, which featured silver heels.'The sparklies on the beige has got me,' she wrote on the snap.A week prior the star confidently showed off her growing baby bump by posing for a nude mirror selfie.She held up her smartphone as she quickly posed for the photo inside a brightly lit bathroom.Her blonde locks were pulled up into a simple up do while also opting for a natural, no makeup look, flaunting her glowy skin.The TV personality penned a short caption that she added towards the bottom of the snap, which read, 'Didn't feel like an absolute beast today so...pregnant thirst trap.'",
        "The New Orleans native and her husband tied the knot in September 2020, and later again in 2022 during a larger ceremony. The pair announced that they were expecting a second child in March. Stassi and Beau haven't said when their little boy will make his debut, but have revealed he was conceived during a trip to Las Vegas in December, putting his due date sometime in September or October. Stassi has been traveling around the United States to take part in her Mommy Dearest Tour, which concludes later this year on June 24 in Los Angeles.The tour features her successful Straight Up With Stassi podcast live in front of an audience and fans, and the beauty is also accompanied by her husband, Beau, and Taylor Strecker."
    ]
}