{
    "articleURL": "/news/article-12055873/They-make-vomit-Richard-Dreyfuss-slams-Oscars-new-woke-inclusivity-rules.html",
    "content": [
        "Academy Award-winning actor Richard Dreyfuss has slammed the Oscars' new diversity and inclusion requirements and said 'they make me vomit'The Jaws star hit out at the woke rules during an episode of PBS’ Firing Line and claimed the Academy was treating people like children by implementing thisHe also defended Laurence Olivier’s performance in the 1965 film Othello in which he played the lead character in blackfaceAcademy Award-winning actor Richard Dreyfuss has slammed the Oscars' new diversity and inclusion requirements and said 'they make me vomit'. ",
        "Films will have to meet minimum requirements related to representation and inclusion to be eligible for the best picture award under new rules. The Academy of Motion Picture will disqualify films from Best Picture contention that do not have enough black, gay and disabled actors in the cast and crew from 2024. But Jaws star Dreyfuss, 75, hit out at the woke rules during an episode of PBS’ Firing Line, which aired on Friday, and claimed the Academy was treating people like children by implementing the new criteria.The actor also defended Laurence Olivier’s performance in the 1965 film Othello in which he played the lead character in blackface.",
        "Host Margaret Hoover asked Dreyfuss what he thought about the incoming inclusivity rules and he replied: 'They make me vomit.'No one should be telling me as an artist that I have to give in to the latest, most current idea of what morality is. What are we risking? Are we really risking hurting people’s feelings? 'You can’t legislate that. You have to let life be life and I’m sorry, I don’t think there is a minority or majority in the country that has to be catered to like that.Dreyfuss, who won the best actor Oscar in 1978 for his leading role for The Goodbye Girl, added: 'This is an art form. It’s also a form of commerce, and it makes money, but it’s an art. ",
        "'And no one should be telling me as an artist that I have to give in to the latest, most current idea of what morality is.'He then went on to defend English actor Olivier who wore blackface to portray Othello in the 1965 Shakespeare adaption.'Laurence Olivier was the last white actor to play Othello, and he did it in 1965,' Dreyfuss said. 'And he did it in blackface. And he played a black man brilliantly.'Am I being told that I will never have a chance to play a Black man? Is someone else being told that if they’re not Jewish, they shouldn’t play The Merchant of Venice? 'Are we crazy? Do we not know that art is art? This is so patronizing. It’s so, it’s so thoughtless, and treating people like children.'Hoover asked him if 'there’s a difference between the question of representation and who is allowed to represent other groups?' She highlighted the case of blackface and said: 'explicitly in this country, given the history of slavery and the sensitivities around black racism.'But Dreyfuss responded: 'There shouldn’t be. … Because it’s patronizing. Because it says we’re so fragile that we can’t have our feelings hurt. 'We have to anticipate having our feelings hurt, our children’s feelings hurt. We don’t know how to stand up and bop the bully in the face.'",
        "The Academy Awards shake-up means films hoping to win Best Picture from 2024 will have to hire more black, female, LGBT or disabled cast and crew or address themes that affect those communities. Those seeking best picture nominations have to meet two out of four requirements.They include having at least one lead character in the movie be from an 'an underrepresented racial or ethnic group', having at least 30 per cent of the cast be from at least two underrepresented groups- ethnic minorities, women LGBTQ+ people or people with disabilities- or having the movie’s subject focus on one.The organization passed its Aperture 2025 initiative in 2020, five years after the #OscarsSoWhite controversy in order to promote more diversity in the industry, but the move has been under fire ever since.It was spearheaded by black filmmaker Ava DuVernay and developed by the academy to set criteria - which included diversifying nearly every aspect of a movie, from cast and crew to production, marketing, financing, distribution and even internships by 30 per cent.But critics say woke Hollywood bosses are turning the awards ceremony into a political weapon. Dreyfuss' actor son Ben, 36, sparked fury on Twitter earlier this year when he declared he'd never date or sleep with a 'fat person' and would encourage a partner to lose weight.",
        "Ben, a writer and self-styled comedian, made the remarks in a thread on January 18. Spring-boarding from an unrelated article titled 'You need help: You fat-shamed your beautiful girlfriend,' he began his 'schtick'.'That is outrageous! I've never dated a fat person!' he declared, before launching a multi-tweet thread on the topic."
    ]
}