{
    "articleURL": "/money/markets/article-12051981/Revolut-boss-throws-bank-licence-tantrum.html",
    "content": [
        "The boss of Revolut has slammed regulators for failing to hand it a UK banking licence – just months after the payment app said that it was expecting a green light 'imminently'.",
        "Revolut has been trying for more than two years to win approval from regulators, which would allow it to expand its services in Britain into taking deposits and giving loans.In early March the company said a licence from the Financial Conduct Authority (FCA) and the Prudential Regulation Authority (PRA) would be granted 'imminently' – possibly within days.But following a warning from its auditor that parts of its accounts were 'materially mis-stated', it is still waiting.Smaller rivals such as Monzo and Starling already have UK banking licences, while Estonia's LHV bank was granted one this week.In an outburst yesterday – labelled 'sour grapes' by one City observer – Revolut co-founder and chief executive Nik Storonsky said winning approval has been a 'long and tiring process' and warned Britain was an undesirable place to do business.'You wait for emails or letters for months. This is not the business environment to operate in the modern world,' he told The Times, adding that there was a 'slowing down' in British tech despite political ambitions to become the next Silicon Valley. 'In the past a lot of people would come to London; it was the place to be. That has now changed.'Storonksy's comments come as his business faces increasing scrutiny. London-based Revolut raised eyebrows after its latest accounts were five months overdue, with its auditor BDO stating that some parts were 'materially mis-stated'.",
        "This included three-quarters of its £636m revenue in 2021, which BDO said it could not independently verify. Revolut was also criticised by the FCA in March and ordered to change or remove an advert within 48 hours.The watchdog declined to give details but its rules state: 'All adverts and promotions for financial services must be fair, clear and not misleading.'The firm also suffered a setback last month when Schroders valued it at £14billion, a far cry from the £27billion price tag it boasted in its last funding round in 2021.Danni Hewson, financial analyst at AJ Bell, said there was an element of 'sour grapes' in Storonsky's comments. 'I think Britain has become a bit of a punchbag for people who don't get their way in business,' she said.Revolut was set up in 2015 by Storonsky and Vlad Yatsenko. It has 28m customers and operates in more than 200 countries.Storonsky told The Times that he would choose New York over London if he was ever going to list the company.",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}