{
    "articleURL": "/wires/pa/article-12052511/Adam-Hills-plans-toilet-breaks-limits-drinking-preparation-coronation.html",
    "content": [
        "Comedian Adam Hills said he has mapped out his toilet breaks given the “limited availability” at the coronation as well as practising limiting his fluid intake in preparation for the big day.",
        "The host of Channel 4’s The Last Leg, 52, was chosen as part of a group of 14 “outstanding Australians” to join Prime Minister Anthony Albanese in representing the country at the coronation.The eclectic Australian delegation includes post-punk pioneer and Bad Seeds musician Nick Cave and Australian women’s football star Sam Kerr, who currently plays for Chelsea.",
        "Hills explained being asked to attend the coronation was “a bit overwhelming”, but he “couldn’t say no to any of it”.He told the PA news agency: “I’ve done a little bit of research and studied what’s going on and I’m suddenly realising I’m going to be in Westminster Abbey where coronations have been taking place since 1066.“I’m going to watch the King sit on a chair that was built in the 1300s and I can’t believe I get to witness a piece of history.”Hills described attending the Australian High Commissioner’s Residence with the delegation ahead of the coronation.",
        "He said: “There was a speech yesterday, we were at the High Commissioner’s residence and the Governor General gave a speech and he said ‘Australians will be seeing the coronation through your eyes’.“It was a lovely level of responsibility that was placed on our shoulders. It feels like I got the call to represent my country.",
        "“Everyone was a little bit starstruck by Nick Cave,” he said, before adding: “But the main topic of conversation that I was involved in was planning out our toilet breaks for the day.”Hills told PA: “We need to be there at 7.30 in the morning, we’ve been told that where we check in there are toilets, but that is 600 metres from Westminster Abbey and once once we’re seated, there’s limited toilet availability.“I’ve been doing literal dry runs where I’ve tried to take in as little amount of fluid as possible and space out the caffeine consumption and see how long I can go.“I made it five hours earlier on, I think I’m looking pretty good for tomorrow,” he joked.",
        "The comedian said he was not nervous to attend the coronation, having performed for royalty on several occasions.He said: “I’ve performed in front of the royal family three or four times, that’s nerve racking. I don’t have to do anything tomorrow, I’m just watching, the pressure’s off.”Hills added that he would do his “level best” to take Cave, Kerr and Mr Albanese for dinner at his restaurant in London following the coronation celebrations.",
        "He told PA: “I invested in a restaurant earlier this year in Parsons Green and I love the idea that I can say the phrase ‘my restaurant’.",
        "“So I think there’s no better way to end the day attending a coronation than by having a meal in my restaurant.“I’m going to do my level best to bring Nick Cave, Sam Kerr and the Prime Minister along.”"
    ]
}