{
    "articleURL": "/wires/reuters/article-12042995/Canadas-spy-agency-withheld-information-Chinas-threats-lawmaker-PM-Trudeau.html",
    "content": [
        "By Ismail Shakil",
        "OTTAWA, May 3 (Reuters) - Canada's spy agency withheld information about Chinese threats against a Canadian lawmaker and his family in 2021, Prime Minister Justin Trudeau said on Wednesday, adding that he had told the agency that in the future such threats must be revealed immediately.The Canadian Security Intelligence Service (CSIS) had determined that information about the threats against Michael Chong, a member of parliament with Canada's main opposition Conservative party, were not concerning enough to inform him, Trudeau told reporters in Ottawa.Chong said he was \"profoundly disappointed\" to find out about the threat to his family in Hong Kong from a newspaper and slammed the Trudeau government for inaction on Monday, after the Globe and Mail newspaper reported on the threats, citing a CSIS report.The Globe reported that Beijing had sought information about Chong's relatives who may be in China in a likely effort to \"make an example of this MP and deter others from taking anti-PRC positions.\"Canadian media outlets have published several reports, citing anonymous intelligence sources, alleging schemes run by the Chinese government to interfere in Canada's last two elections. Beijing has denied those allegations, saying it has no interest in interfering in Canada's internal affairs.Trudeau has previously said China attempted to meddle in the 2019 and 2021 votes, but did not change the outcome. He has appointed an independent special investigator to probe the allegations.",
        "On Wednesday, Trudeau said he learned about the threats against Chong from the Globe report and upon enquiring about it, found out that CSIS had decided to withhold information.\"Going forward, we're making it very, very clear to CSIS and all our intelligence officials that when there are concerns that talk specifically about any MP, particularly about their family, those need to be elevated,\" Trudeau said.\"Even if CSIS doesn't feel that it's a sufficient level of concern for them to take more direct action, we still need to know about it at the upper government level,\" he said.Chong was sanctioned by Beijing in 2021 after his motion passed the Canadian parliament declaring China's treatment of the Uighur Muslim minority genocide. (Reporting by Ismail Shakil in Ottawa; editing by Jonathan Oatis)"
    ]
}