{
    "articleURL": "/money/markets/article-12038957/Watchdog-unveils-shake-plan-bids-stop-City-exodus.html",
    "content": [
        "The City watchdog has unveiled plans for a shake-up of stock market listing rules designed to help halt an exodus of companies from London to New York.",
        "Reforms proposed by the Financial Conduct Authority (FCA), representing the biggest change in the rule book since the 1980s, are hoped to be in place by the end of this year or start of 2024.Lord Hill, the author of an earlier review into the listings regime, said that, if implemented, they would enable London ‘to stand toe to toe with our international competitors’.",
        "However, the Institute of Directors warned that the City’s high standards were themselves an advantage for the UK ‘and should not be watered down’.The decision by Cambridge-based chip designer Arm to opt for a float on Wall Street this year prompted soul-searching in the Square Mile, adding to pressure for change.The shake-up would aim to simplify rules by ending the distinction between ‘standard’ and ‘premium’ listings – the latter of which are subject to more stringent tests. Only companies with premium listings are eligible to enter the FTSE 100 and FTSE 250 so abolishing the distinction would clear the way for more to join them.There would also be a further leeway for companies with dual-class share structures – which allow founders to exercise greater voting rights than other investors over their companies. And there would be a removal of the obligation for shareholder votes to approve big takeover deals.",
        "Britain’s listings regime is among the factors blamed for a 40 per cent fall in the number of firms choosing to float here since 2008. Last week, London Stock Exchange boss Julia Hoggett told MPs the rules were ‘stuck in aspic’.",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}