{
    "articleURL": "/wires/reuters/article-12047749/Warren-Buffett-Berkshire-Hathaway-glance.html",
    "content": [
        "May 4 (Reuters) - Tens of thousands of people are descending on Omaha, Nebraska to attend the annual shareholder weekend for billionaire investor Warren Buffett's Berkshire Hathaway Inc.",
        "Buffett, 92, and Vice Chairman Charlie Munger, 99, are due to answer about five hours of shareholder questions at Berkshire's annual meeting on Saturday. The meeting will be broadcast on CNBC and livestreamed on cnbc.com.Here are some facts about Buffett and Berkshire.FACTS ABOUT WARREN EDWARD BUFFETTBorn: Aug. 30, 1930, in OmahaEducation: University of Nebraska-Lincoln, Columbia Business SchoolFamily: Buffett has been married to Astrid Menks since 2006. His first wife Susan Thompson Buffett died in 2004, and he had three children with her: Susan, Howard and Peter. Susan Buffett and Howard Buffett are Berkshire directors.Net worth: $112.1 billion as of May 3, ranking sixth worldwide. Bernard Arnault, who leads luxury goods company LVMH Moet Hennessy Louis Vuitton SE, and his family ranked first. (Source: Forbes)Berkshire ownership stake: 15.6% as of March 8, 2023Berkshire voting power: 31.5% as of March 8, 2023How Buffett took charge: In 1965, Buffett was a shareholder in Berkshire, then a struggling New England textile company. He agreed to sell back his shares for $11.50 each, but management sent him a term sheet that showed $11.375. Angered, Buffett responded by buying all the shares he could. He won control of Berkshire on May 10, 1965. The textile business closed in 1985.",
        "Famous Buffett quotation: \"Lose money for the firm, and I will be understanding. Lose a shred of reputation for the firm, and I will be ruthless.\" - Sept. 4, 1991 congressional testimony about Salomon Inc, where Buffett became interim chairman to restore order after a Treasury auction bidding scandal.Philanthropy: Buffett has since 2006 donated about $35.7 billion to the Bill &amp;amp; Melinda Gates Foundation and $10.7 billion to four family charities, according to public disclosures. His Berkshire stock will go to philanthropy after he dies.Home: Buffett has lived since 1958 in the same house on a well-trafficked Omaha street, and does much of his work there. Built in 1921, the five-bedroom, 2-1/2-bath home on 0.72 acres was assessed at $1,003,500 in 2023. (Source: Douglas County, Nebraska)Diet: Buffett likes steaks and eats candies from See's, which Berkshire owns. He estimates that one-fourth of his caloric intake comes from Coca-Cola, a longtime Berkshire investment.Buffett on his investing record: \"In 58 years of Berkshire management, most of my capital-allocation decisions have been no better than so-so. In some cases, also, bad moves by me have been rescued by very large doses of luck. ... Our satisfactory results have been the product of about a dozen truly good decisions - that would be about one every five years - and a sometimes-forgotten advantage that favors long-term investors such as Berkshire. ... The weeds wither away in significance as the flowers bloom.\" (Shareholder letter, Feb. 25, 2023)",
        "FACTS ABOUT BERKSHIRE HATHAWAYLeadership: Warren Buffett, chairman and chief executive officer; Charlie Munger, Greg Abel and Ajit Jain, vice chairmen; Todd Combs and Ted Weschler, investment managers.2022 net loss: $22.82 billion, including $53.61 billion of investment losses2022 operating income: $30.79 billion, up 12% from 20212022 revenue: $302.09 billion, up 9% from 20212022 share repurchases: $7.9 billionCash, equivalents and Treasury bills: $128.6 billion as of Dec. 31, 2022Stock price: $488,606.05 per Class A share as of May 3, 2023. Class B shares are worth about 1/1,500th as much.Market value: about $708 billion as of May 3, 2023, based on reported shares outstandingCompounded annual gain from 1965-2022: stock price: 19.8%; S&amp;amp;P 500 including dividends: 9.9% (pre-tax)Overall gain from 1965-2022: stock price: 3,787,464%; S&amp;amp;P 500 including dividends: 24,708% (pre-tax)Float (insurance premiums collected before claims are paid, which help fund investments): $164 billion as of Dec. 31, 2022Selected businesses: Alleghany, Benjamin Moore, Berkshire Hathaway Automotive, Berkshire Hathaway Energy, Berkshire Hathaway Specialty Insurance, BNSF, Borsheims Fine Jewelry, Brooks, Business Wire, Clayton Homes, Duracell, Fruit of the Loom, Geico, General Re, HomeServices of America, IMC International Metalworking, International Dairy Queen, Jazwares, Johns Manville, Lubrizol, Marmon, McLane, National Indemnity, Nebraska Furniture Mart, NetJets, Oriental Trading, Pampered Chef, Pilot Travel Centers, Precision Castparts, See's Candies",
        "Selected acquisitions: See's Candies, $25 million (1972); Geico, $2.3 billion (1996); Dairy Queen, $590 million (1998); General Re, $15.9 billion (1998); NetJets, $725 million (1998); Clayton Homes, $1.7 billion (2003); PacifiCorp, $5.1 billion (2006); Iscar, $4 billion (2006); Marmon, $4.5 billion (2008); Burlington Northern Santa Fe, $26.5 billion (2010); Lubrizol, $9 billion (2011); NV Energy, $5.6 billion (2013); H.J. Heinz, $12.1 billion (majority stake, 2013); Van Tuyl (now Berkshire Hathaway Automotive), $4.1 billion (2015); Precision Castparts, $32.1 billion (2016); Duracell, $2.9 billion (2016); Pilot Travel Centers, $11 billion ($2.8 billion for 38.6% stake in 2017, plus $8.2 billion for 41.4% stake in 2023); Alleghany, $11.5 billion (2022). (Sources: Barclays, Berkshire)Major stock investments: American Express, Apple, Bank of America, Chevron, Coca-Cola, Kraft Heinz, Occidental PetroleumStocks in which Berkshire was the largest investor on Dec. 31, 2022: American Express, Bank of America, Chevron, Coca-Cola, HP, Kraft Heinz, Moody's, Occidental Petroleum, Paramount GlobalBuffett on stock buybacks: \"When you are told that all repurchases are harmful to shareholders or to the country, or particularly beneficial to CEOs, you are listening to either an economic illiterate or a silver-tongued demagogue.\" (Shareholder letter, Feb. 25, 2023)Employees: 382,651Employees in main office: 26, including BuffettSuccession: Buffett and Munger have not publicly signaled any plans to retire. Abel is expected to become CEO when Buffett retires, cannot continue or dies. Combs, who has also been Geico's chief executive since 2020, and Weschler may succeed Buffett as chief investment officer. Buffett's eldest son, Howard, is expected to become non-executive chairman.",
        "Management responsibilities: Abel, 60, and Jain, 71, have since 2018 had day-to-day oversight of Berkshire's non-insurance and insurance units, respectively. Combs and Weschler handle some Berkshire investments. Buffett and Munger handle major capital allocation decisions and investments.Annual meeting attendance: 12 (1965), about 24 (1979), 1,000 (1986), 4,100 (1995), 13,000 (2000), 21,000 (2005), 42,000 (2015, Buffett's 50th anniversary running Berkshire). (Sources: Omaha World-Herald, Berkshire, Reuters)Buffett on managing risk: \"It's my job to think about risks that nobody else thinks about.\" (Interview with CNBC, April 12, 2023)Abel on Berkshire managers' relationship with him: \"It's not the same as working for Warren. I've understood that, and I've effectively apologized to them many times for that outcome. But they also realize that they still have an opportunity to go run their businesses, what they love and what they wake up to do every day. ... We'll provide the same opportunity long term.\" (Interview with CNBC, April 12, 2023)(Compiled by Jonathan Stempel in Omaha, Nebraska; Editing by Will Dunham)"
    ]
}