{
    "articleURL": "/news/article-12048913/Shocking-moment-student-pulls-knife-stabs-injures-classmate-school-Columbus-Ohio.html",
    "content": [
        "Video posted online shows a student in a black hoodie pulling a knife and stabbing a classmate passing by on FridayColumbus police say the victim had multiple stab wounds and the assailant was taken into Franklin County Juvenile DetentionHe is charged with one count of felony assaultShocking video showed the moment a student pulled out a knife and stabbed one of his classmates as he was passing by.",
        "The footage showed a student in a white sweatshirt going by another student in a black hoodie. The student in the black hoodie was waiting against the wall in a common area of Mifflin High School in Columbus, Ohio, around dismissal time on Friday.When the student in the white hoodie approached the student, the teen in the black hoodie could be seen pulling out a knife from his waist and stabbing the student in the white hoodie.The victim immediately flinched back and tried to run away, but his assailant chased after him in an attempt to stab him again.By the time police arrived on the scene, they said the victim had multiple stab wounds and was treated at the scene by first responders and the school nurse.The stabber — who has not been named — was charged with one count of felony assault, the Columbus Dispatch reported, and was taken into Franklin County Juvenile Detention.",
        "It remains unclear how the student smuggled the knife into the school, as the Columbus City School District had already invested more than $3million to roll out 20 Evolv Express advanced weapons detection systems at its 17 high schools.The systems use advanced sensor technology that uses extremely low-frequency waves to induce magnetization in metal objects passing through.",
        "Its manufacturer said the system can distinguish between weapons threats like guns, knives and metal explosives from laptops, cellphones and keys. Now, the district — which does not have school resource officers inside each facility — stated it will begin conducting additional random screenings of students' bags before school, and will layer that measure with the use of hand-held metal detection scanners and the Evolv Express machines.'The district remains committed to providing all buildings with a safe and secure learning environment,' officials said in a statement. 'We will continue to explore all available measures to ensure the highest level of safety.' ",
        "The stabbing comes amid an uptick in violence in the school district.In just the first three months of the school year, the Columbus Dispatch reports, there were 5,202 fights, assaults, sexual offenses, guns brought to school or other 'major incidents.'The Columbus City school district, with more than 45,000 students, has not had school resource officers since the district let its contract with the Columbus Division of Police expire in June 2020 amid racial justice protests following the death of George Floyd.It instead employs more than 170 safety and security staff members who do not carry weapons. "
    ]
}