{
    "articleURL": "/news/article-12039523/Nick-Cave-Aussie-goth-rocker-responds-going-coronation-King-Charles-III.html",
    "content": [
        "'Dark lord' of music also praised the late Queen Sarcastically said he had to pick out what to wear Aussie rocker Nick Cave – known as the 'dark lord' of goth music – has hit back at fans who slammed him for planning to attend King Charles' coronation on Saturday, and praised the late Queen Elizabeth.  ",
        "But if they hoped to change the longtime UK resident's mind with questions such as 'Why the f*** are you going to the King's coronation?', they got no satisfaction.Cave used that question - from Jon in Brisbane - to headline his response on his Red Hand Files website where he regularly gives no holds barred answers to fans.Addressing Jon and other shocked fans, he sarcastically opened by saying 'I'll make this a quick one because I've got to work out what I am going to wear to the Coronation.'I am not a monarchist ... nor am I an ardent republican,' he said. 'What I am also not is so spectacularly incurious about the world and the way it works.'",
        "He added that he was not 'so ideologically captured, so damn grouchy, as to refuse an invitation to what will more than likely be the most important historical event in the UK of our age.'Not just the most important, but the strangest, the weirdest.'But if that stunned his fans, there was a bigger surprise to come when Cave expressed his great respect for Charles' mother and how it made his mother proud.'I once met the late Queen at an event at Buckingham Palace for \"Aspirational Australians living in the UK\" (or something like that). ",
        "'It was a mostly awkward affair, but the Queen herself, dressed in a salmon coloured twin-set, seemed almost extraterrestrial and was the most charismatic woman I have ever met.'Maybe it was the lighting, but she actually glowed. As I told my mother – who was the same age as the Queen and, like the Queen, died in her nineties – about that day, her old eyes filled with tears.'Cave, who grew up in Warracknabeal and Wangaratta in rural Victoria, also shed tears for the Queen himself.'When I watched the Queen's funeral on the television last year I found, to my bafflement, that I was weeping myself as the coffin was stripped of the crown, orb and sceptre and lowered through the floor of St George's Chapel.'Though he acknowledged what he called the 'necessary debates about the abolition of the monarchy', Cave said he holds 'an inexplicable emotional attachment to the Royals'. 'The strangeness of them, the deeply eccentric nature of the whole affair that so perfectly reflects the unique weirdness of Britain itself. 'I'm just drawn to that kind of thing – the bizarre, the uncanny, the stupefyingly spectacular, the awe-inspiring. The post ended with a joke at his own expense, saying 'with all that in mind, I am looking forward to going to the Coronation. I think I’ll wear a suit.' ",
        "The joke being that Cave, who was named an Officer of the Order of Australia for distinguished service to the performing arts in 2017, is very rarely seen without a suit, onstage or off. One Sydney-based fan told Daily Mail Australia she had mixed feelings about Cave's royal leanings. 'I was shocked to hear it, but because it's Nick Cave of course it's OK,' said Cecilia McKenna.",
        "'He's not just post modern, he's post everything. I'm a staunch republican, but Cave can do little wrong in my eyes.'Ms McKenna couldn't resist a gag at how Cave's hair is still black, despite him being 65 years old. 'He should get his roots done before he goes to the coronation, though,' she said. Other fans were less forgiving, though, with one saying they were surprised that Cave supports 'such a waste of money', and another saying 'He's gone soft in his old age.' ",
        "Ms Sam Kerr OAMMs Leanne Benjamin AM OBEMr Nick Cave AOMs Jasmine CoeMr Adam Hills MBEDr Daniel NourMiss Yasmin PooleMs Emily ReganMs Minette SalmonMs Claire Spencer AMProfessor Merryn VoyseyCorporal Daniel Keighran VCMr Richard Joyes CVMs Yvonne Kenny AMJulie BishopTayla Green-AldridgeAnthony Albanese and Jodie HaydonDavid Hurley and Linda Hurley "
    ]
}