{
    "articleURL": "/wires/pa/article-12055319/Rodrygo-fires-Real-Madrid-Copa-del-Rey-glory-Inter-continue-Serie-A-rise.html",
    "content": [
        "Rodrygo scored twice as Real Madrid lifted the Copa del Rey for the first time in nine years with a 2-1 win against Osasuna in Seville.",
        "The Brazilian forward fired Madrid into an early lead at the Ramon Sanchez-Pizjuan Stadium and tapped home a second-half winner after Osasuna’s Lucas Torro had equalised after the interval.Carlo Ancelotti’s side, who play the first leg of their Champions League semi-final against Manchester City at home on Tuesday, won the trophy for the 20th time.Ancelotti, whose team trail LaLiga leaders Barcelona by 14 points, was in charge of Madrid when they last won the competition in 2014, while Osasuna were in their second final.In Serie A, Inter Milan maintained their charge for a top-four finish with a 2-0 win at Roma to stay fourth and climb to within a point of second-placed Lazio, who lost 2-0 at AC Milan.Federico Dimarco and Romelu Lukaku scored in either half as Inter sealed their fourth straight league win ahead of next week’s Champions League semi-final first leg against city rivals Milan.",
        "Milan are two points further back in fifth after first-half goals from Ismael Bennacer and Theo Hernandez against Lazio extended their unbeaten league run to seven matches.Lowly Cremonese’s fourth league win of the season boosted their survival hopes as goals from Daniel Ciofani and Johan Vasquez sealed a 2-0 victory over relegation rivals Spezia.Bayern Munich extended their lead at the top of the Bundesliga to four points after holding on to win 2-1 at Werder Bremen.",
        "Serge Gnabry and Leroy Sane scored second-half goals before Niklas Schmidt’s stunner for Bremen set up a nervy finale.Second-placed Borussia Dortmund play at home against Wolfsburg on Sunday.Kevin Kampl’s solitary second-half strike clinched RB Leipzig a 1-0 win at Freiburg and saw them leapfrog into third place above Union Berlin, who lost 1-0 at Augsburg.Dion Beljo’s goal for Augsburg eight minutes after the interval lifted them six points clear of the bottom three.Hoffenheim boosted their survival chances with a 3-1 home win against Eintracht Frankfurt despite playing most of the second half with 10 men.Christoph Baumgartner, Andrej Kramaric’s penalty and Ihlas Bebou put Hoffenheim 3-0 up at half-time and although Mario Gotze struck soon after Stanley N’Soki’s dismissal, Frankfurt failed to capitalise on their advantage.Bottom club Hertha Berlin climbed to within five points of safety after clinching their first win in nine, 2-1 at home against third-bottom Stuttgart, while Bochum remain in the bottom two after losing 2-0 at Borussia Monchengladbach.In Ligue 1, Lens held on to beat Marseille 2-1 and leapfrog them into second place, three points behind leaders Paris St Germain, who play at Troyes on Sunday.Seko Fofana and Lois Openda scored in either half for Lens, who have won seven of their last eight matches to keep pace with PSG, before Dimitri Payet’s late effort for Marseille ensured a nervy finish.",
        "Lille missed the chance to leapfrog Monaco into fourth spot as they lost 1-0 at Reims, for whom Marshall Munetsi headed a first-half winner.Sixth-paced Rennes also failed to make up ground in the race for European football next season after going down 2-1 at Nice."
    ]
}