{
    "articleURL": "/sciencetech/article-12042719/Interactive-map-shows-precisely-countries-directly-sea-UK-coastline.html",
    "content": [
        "An interactive map reveals destinations directly across the sea from the UK'Geodesic' lines were drawn from nearly 2,000 points around the coastline From Norfolk you can 'see' Russia, and from south Wales you could sail to BrazilAs you gaze out to sea, you can't help but wonder what lies beyond the endless horizon.",
        "Well, wonder no more, as a fascinating interactive map can tell you exactly what you are looking at - and it may not be what you expect.The visualisation, developed by Esri UK, plots 37 countries that you would reach if you travelled in straight line from almost 2,000 coastal locations in the UK.From looking at a flat world map you may assume it would be Ireland, France and Scandinavia, but the curvature of the Earth means there's actually a lot more that can be 'seen'.From Norfolk you could gaze at Russia, from south Wales you could look longingly out to Brazil or catch a glimpse all the way towards Antarctica, the map reveals.",
        "Cuba - Pabbay, ScotlandAntarctica - Pembroke, WalesFalkland Islands - St Anne's Head, WalesRussia - Stiffkey, NorfolkBahamas - Land's End, CornwallPuerto Rico - Bideford, DevonBrazil - Barmouth, Wales ",
        "Countries on the distant horizon for Britons include Norway, Portugal, the US, the Turks and Caicos, the Falkland Islands, Russia, Cuba, Canada and Spain.The cartographers plotted points around the UK, imagining that there was a person was facing outwards, perpendicular to the coastline, at each one.They placed a new one every time there was a major change of direction in the coastline.From these points they drew lines outwards until they struck land, taking into account the Earth's curvature.",
        "These are called 'geodesic lines', which give the shortest distance between two points on a curved surface.The word 'geodesic' comes from the Greek words 'geo' meaning 'earth' and 'desic' meaning 'division'.The map reveals that from a vantage point in Stiffkey, Norfolk, you could enjoy uninterrupted views of Russia, some 8,810 miles away.If you sailed in a straight line from the Orkney islands in Scotland you could reach the Dominican Republic in just 4,522 miles.",
        "In Pembroke, Wales, if you could see 7,898 miles into the distance you’d spot Antarctica.If your holiday in Land's End was a little chilly, you could swim 4,559 miles over to the Bahamas, in theory.With a really good telescope, you could peep Brazil from Barmouth, north Wales, as it is 4,447 miles away directly.Beachgoers in Bideford, North Devon, could stare out to Puerto Rico, 4,327 miles away.On Chesil Beach, Dorset, eagle-eyed viewers - with a very tall stepladder - could see past France and Spain, all the way to Brazil, 4,233 miles into the distance.But there is only one location which looks directly at the Falkland Islands 7,345 miles away, and that is St Anne's Head in south Wales.",
        "Of course, Britain wasn't Britain when dinosaurs walked the Earth, but where exactly was your home at the time of T-Rex, Stegosaurus and Diplodocus?Well, an interactive map lets you travel back in time to find out.'Ancient Earth Globe' reveals how the continents have split and reformed while oceans advanced and receded across 750million years of our planet's history.   It also features a range of tools that make it easy to discover more about the Earth, such as where the first reptiles lived or when the first flower bloomed.Check out the map HERE "
    ]
}