{
    "articleURL": "/sport/boxing/article-12040491/Boxer-Harry-Garside-shows-fans-crude-joke-baby-nephew-arrest-alleged-assault.html",
    "content": [
        " Garside shows fans crude joke about nephew Boxer was arrested on Tuesday at Sydney airport Garside was charged with common assault Harry Garside posted an extremely crude joke on social media in order to tell his followers that he'd just become an uncle with the post going up just a day before his dramatic arrest for allegedly assaulting his ex-girlfriend. ",
        "The Olympic medallist, 25, has been charged with assaulting fitness trainer Ashley Ruscoe at her home in Bellevue Hill, in Sydney's east, on March 1. It was reported on Wednesday that police will allege Garside hit his former partner in the head with his elbow and spat in her face, and that there was a physical clash involving a mobile phone.Garside was arrested as he flew into Sydney Airport on Tuesday night as he travelled home from South Africa, where just hours earlier he had placed second on the reality TV show I'm A Celebrity... Get Me Out Of Here.Police have hit the boxer with a provisional AVO. He been granted conditional bail on the assault charge and has pledged to defend it when he appears in Sydney's Downing Centre Local Court on May 24.",
        "One of Garside's last posts to social media before he was arrested was an announcement that he'd become an uncle for the first time.He posted a screen shot of a family group chat that featured the message: 'Good to be back in the family group chat. Also great to be an uncle for the first time (black heart emoji)'.The message in the chat, which may or may not have been written by Garside, said: 'Miss ya all, love you all (black heart emoji) so happy to hear about the newest addition to the Garside clan, I now have the second smallest penis in the family, won't be for long though I'm sure brax will grow very quickly'.",
        "He had deleted the post by Wednesday morning. On Wednesday afternoon Garside responded to the allegations levelled against him with a social media statement, explaining that he was 'blindsided' by the arrest on Tuesday.'The conduct of police in the presence of the media at Sydney International Airport yesterday took me completely by surprise,' Garside wrote in a post to Instagram.'I categorically deny the allegations of violence and dispute the account given to police. I have nothing to hide and will defend myself against the charge. 'The police have not been provided with all of the facts and I am confident that my reputation will be vindicated through the legal process. 'Because the matter is before the courts, I won't be saying anything further.'",
        "Last week it was revealed that Garside will be facing another ugly legal battle, with the boxer's manager launching a defamation case against him and Channel 10 for comments made during an episode of I'm A Celebrity... Get Me Out Of Here.Garside's manager Peter Mitrevski was angered by comments made by the boxer, which he regards as both offensive and inaccurate."
    ]
}