{
    "articleURL": "/sport/football/article-12042947/Sheikh-Jassim-wants-sign-KYLIAN-MBAPPE-buys-Manchester-United.html",
    "content": [
        "Sheikh Jassim is leading Qatari group looking to take over at Manchester UnitedKingsley Coman and Eduardo Camavinga are also reportedly being targetedJassim is in competition with Sir Jim Ratcliffe to purchase United from Glazers Sheikh Jassim is keen to land Kylian Mbappe from Paris Saint-Germain if he can complete a takeover of Manchester United, according to reports.",
        "As part of a Qatari group looking to take over at United, Jassim is among the front runners aiming to buy a controlling stake in the club.He is one of two parties thought to be among the serious contenders along with Sir Jim Ratcliffe as they compete to purchase a significant stake of the Old Trafford outfit from the Glazer family.But reports are suggesting Jassim already has a list of transfer targets lined up for when he takes over including Mbappe.In addition to the France international, Jassim also 'want to go for' Kingsley Coman and Eduardo Camavinga from Bayern Munich and Real Madrid respectively in an attempt to bolster Manchester United's first team, according to Bild.",
        "United though can expect strong competition if they were to pursue Mbappe, with Real Madrid holding a long term interest in the France international.The 24-year-old is contracted to the Parisian side until the summer of 2024, an option he can extend a further year at the end of this season.Third and final bids were submitted last week for United, with Ratcliffe believed to value the club higher than Sheikh Jassim, who for much of the process had appeared the favourite in the running.",
        "Ratcliffe's bid, in its current form, would see the Glazer brothers, Joel and Avram, remain stakeholders in the club.",
        "Those close to the process, which is being run by US merchant bank Raine Group, say the prospect may well prove to be the preferred option with the two Glazer brothers – the members of the family most-heavily involved in the running of the club - given an opportunity to stay.It is thought the final portion currently owned by various investment groups would also remain in place.In a long and drawn out process that has seen Ratcliffe and Sheikh Jassim submit three bids it has become increasingly uncertain as to whether the American family will sell the club."
    ]
}