{
    "articleURL": "/sport/football/article-12050503/Why-Champions-League-anthem-played-King-Charles-IIIs-coronation.html",
    "content": [
        "King Charles III's coronation is set to take place in London on Saturday at 11amMillions will view the ceremony on TV, while thousands will flock to the streetsDuring Saturday's ceremony, football fans will be familiar with one of the hymns  Football fans tuning into King Charles III's coronation this weekend may come across a familiar anthem during Saturday's ceremony.",
        "The Champions League introduction music has been one of the most iconic anthems in the sport for years and is set to be played during the coronation.Millions are expected to tune in to watch Charles crowned King of England on television, while thousands will flock to the streets of London to witness the historic event.The ceremony, due to take place at Westminster Abbey, will include several hymns and classical music, including 'Zadok the Priest' - which is used as the basis for the Champions League anthem.But why will it be played a the coronation? Mail Sport provides the answers below.",
        "Why will the Champions League anthem be played at the coronation? The Champions League anthem was written by composer Tony Britten, who was tasked with producing the song after Europe's famous club football competition was rebranded in 1992.Britten presented UEFA with a selection of classic pieces that would fit the Champions League theme, with Zadok the Priest being chosen as the template. Speaking to the BBC in 2020, Britten said: 'UEFA wanted this competition to be about the best of football, rather than the worst.' His piece was based on the work of German composer George Frideric Handel.'Some say the tune is nicked from Handel, but it's not,' he insisted. 'It's just the first writing string phrase, and the rest is me.' ",
        "In 1727, Handel composed 'Zadok the Priest: The Coronation Anthem' ahead of King George II's coronation.Ever since, the song has been used at the coronation of every British monarch. It is traditionally sung before the monarch is anointed with holy oil.Zadok the Priest is set to be performed again on Saturday for the coronation of King Charles III. ",
        "What are the lyrics to the Champions League anthem?UEFA's official Champions League anthem is sung in three languages: English, French and German. The full English translation is as followed: They are the best teamsThey are the best teamsThe main eventThe masterThe bestThe great teamsThe championsA big meetingA great sporting eventThe main eventThe masterThe bestThe great teamsThe championsThey are the bestThey are the bestThese are the championsThe masterThe bestThe champions",
        "When is the coronation?The coronation will begin at 11am on Saturday, once the royals have completed their arrival procession from Buckingham Palace. Following the ceremony, a return procession, following the same route back, will begin.In the afternoon, 15 members of the royal family will gather on the balcony of Buckingham Palace for the traditional fly-past to pay homage to Charles and Camilla.The ceremony itself is believed to last around an hour, although exact details on the timings of service and its duration remain unclear."
    ]
}