{
    "articleURL": "/sport/football/article-12059957/Millwall-3-4-Blackburn-sides-miss-reaching-Championship-play-offs.html",
    "content": [
        "Duncan Watmore's brace and Oliver Burke gave Millwall a 3-1 half-time leadBen Brereton Diaz's second half double helped Blackburn storm back to winRe-live all the action from the final day as both sides miss out on the play-offsMillwall's play-off ambitions collapsed in calamitous fashion at The Den as Ben Brereton-Diaz capped an incredible comeback for visitors Blackburn.",
        "The home side led 3-1 at half-time and seemed set fair to make the play-offs at their visitors’ expense. That was to reckon without Brereton-Diaz and the unquenchable spirit of a Blackburn that also missed out due to results elsewhere.The Chile striker scored two and set up another to cap a thrilling fightback which silenced The Den.The game was a kaleidoscope of patterns and action from the first minute, played out to the backdrop of a cacophonous din generated by 17,588 fans who could not quite believe what they were witnessing.Both sides had stuttered in recent weeks, especially Blackburn who had not win a match since March 15.",
        "Their respective collapses in form meant that, at best, only one side could make the play-offs by the final whistle and both might miss out.Millwall were adamant it would not be them and almost went ahead after three minutes when Tom Bradshaw just failed to connect with a Zian Flemming long throw.Five minutes later another throw-in from Flemming caused more consternation in the Blackburn defence before Duncan Watmore walloped a rising shot in off the underside of the bar with referee Craig Pawson confirming it had crossed the line before bouncing out.When Bradshaw then followed up a Flemming free-kick that struck the post, The Den erupted again until an offside flag curtailed the home celebrations.",
        "No matter. Millwall continued to flood forward until out of nowhere, Adam Wharton ended a period of Blackburn possession when he turned to sweep a left-foot shot past George Long.The Millwall keeper then had to cling onto a Joe Rankin-Costello shot as Blackburn held sway.Just as quickly, the momentum shifted again when Blackburn left-back Harry Pickering headed an Oliver Burke cross away from keeper Aynsley Pears and Watmore gleefully steered in from an acute angle.Within two minutes, Burke drove an angled shot into the far corner and Millwall appeared set fair for the play-offs.Blackburn manager Jon Dahl Tomasson made two half-time substitutions. One of them, Callum Brittain, played a pivotal role in reducing his side’s arrears five minutes into the second period.",
        "Millwall (4-3-2-1): Long, McNamara, Hutchinson, Cooper, Styles, Mitchell, Saville (Bennett 82), Burke (Burey 73), Flemming, Watmore (Malone 73), Bradshaw (Voglsammer 82)Subs not used: Bialkowski, Evans, ShackletonScorers: Watmore 8, 37, Burke 39 Booked: CooperManager: Gary Rowett Blackburn (4-3-3): Pears, Rankin-Costello, Carter, Hyam, Pickering, Travis (Brittain 45), Wharton, Szmodics (Dack 90+2), Thomas (Dolan 45), Hedges, Brereton (Ayala 89)Subs not used: Kaminski, Garrett, LeonardScorers: Wharton 22, Rankin-Costello 51, Brereton 63, 86Booked: Manager: Jon Dahl Tomasson Referee: Craig Pawson",
        "A Brereton-Diaz free-kick was parried by Long, who also saved Brittain’s follow-up, but not could deny Rankin-Costello.",
        "Brereton-Diaz then silenced three sides of The Den as he seized on the growing hesitancy in the Millwall side to curl home from the edge of the area.That equaliser was almost followed by Rovers taking the lead 60 seconds later when the Chile international struck the post and Tyrhys Dolan steered the rebound inches wide.That miss merely delayed the completion of a comeback for the ages when Brereton-Diaz turned the ball home at the far post to end the scoring on a surreal afternoon with both sides missing out on a play-off berth."
    ]
}