{
    "articleURL": "/wires/reuters/article-12056457/Mariners-Bryce-Miller-looks-subdue-Astros.html",
    "content": [
        "Bryce Miller might be more eager for his second start in the major leagues than he was for his first.",
        "On Sunday afternoon, the Seattle Mariners' right-hander is scheduled to make his home debut against the defending World Series champion Houston Astros, the team the Texas native grew up watching.Miller (0-0, 1.50 ERA) made his first start Tuesday at Oakland in front of a crowd of just 2,583 at the Coliseum.He retired the first 16 batters he faced and allowed one run on two hits in six innings. He struck out 10 and didn't issue a base on balls, becoming just the third pitcher in MLB history with double-digit strikeouts and no walks in his debut, joining Johnny Cueto (2008) and Stephen Strasburg (2010).\"Obviously the stage was bigger, but I think the atmosphere kind of helped me ease into it,\" Miller said. \"I had a lot of fun. I just went out and threw.\"Though the numbers are just from one appearance, analysis from Statcast showed Miller's fastball has the most extreme vertical movement of any pitch in the majors, \"rising\" 4.7 inches more than the average fastball.\"The fastball is just unique,\" Mariners pitching coach Pete Woodworth said. \"It's heavy, and it can just dominate guys. And that's what he did.\"The Astros plan to send right-hander Brandon Bielak (0-0, 4.50) to the mound Sunday for his first start of the season and just the ninth of his MLB career. Bielak is 1-0 with a 3.00 ERA in seven previous relief appearances against Seattle.",
        "The Mariners rallied for a 7-5 victory Saturday night, scoring all seven of their runs with two outs in the bottom of the eighth inning. J.P. Crawford sparked the comeback with a three-run double.\"It started with the walk, two-out walk, a couple infield hits. And it started just like a feeding frenzy,\" Astros manager Dusty Baker said. \"Yeah, that was tough. Tough to take.\"It was Seattle's fifth victory in the team's past six games. The Mariners have trailed in each of those contests.\"That eighth inning, take our walks, some little hits and then some clutch ones,\" Crawford said. \"That's our kind of baseball.\"Astros right-hander J.P. France, making his major-league debut, blanked Seattle for the first five innings.The Astros took a 3-0 lead into the bottom of the eighth, and reliever Rafael Montero retired the first two batters he faced before nine consecutive Mariners reached base.\"We were due,\" Seattle manager Scott Servais said. \"That big inning couldn't have come at a better time. When you have an inning like that, you're gonna need a few things go your way. We got a few breaks, and we hadn't had a lot on the offensive side lately.\"Servais thanked the fans at T-Mobile Park for sticking with their team.",
        "\"There was a really good feel in the ballpark,\" Servais said. \"Credit to the fans that were there. They're sitting there for seven or eight innings, and we're not looking so great. But when we started to get the ball rolling down the hill a little bit, they jumped on board. You could feel just the atmosphere in the ballpark change. That's a credit to all the people here.\"--Field Level Media"
    ]
}