{
    "articleURL": "/tvshowbiz/article-12046697/Karen-Gillan-puts-leggy-display-black-coat-steps-New-York-City.html",
    "content": [
        "Karen Gillan caught the eye as she stepped out in New York City on Thursday.",
        "The actress, 35, put on a leggy display in a black button-up coat featuring arm cutouts while seen in Midtown Manhattan.She elevated her height with sparkly knee-high boots while toting her essentials around in a brown Louis Vuitton handbag.Having flawlessly applied a full face of make-up to enhance her natural beauty, her gorgeous ginger tresses had been styled over her shoulders. Karen flashed a beaming smile and waved towards onlookers while strutting through the Big Apple.",
        "Karen looked elegant at a screening of Guardians Of The Galaxy Vol. 3 Wednesday at iPic Theater in New York City.The Scottish star donned a black double breasted blazer over a sparkling tan ensemble to the cinematic event in the Big Apple, rounding out her ensemble with silver strappy heels.Gillan, who plays the role of Nebula in the Marvel Cinematic Universe, had her straight red locks parted and wore a light layer of makeup.She was pictured in a group shot with her collaborators in the highly-anticipated sequel, including James Gunn, Chris Pratt, Chukwudi Iwuji, Miriam Shor and Bradley Cooper.Gillan told The Hollywood Reporter on Tuesday that being involved of the third film in the series has been an impassioned experience.'I can’t stop thinking about it,' Gillan said. 'We shot it a year ago, and it was still such an emotional rollercoaster.",
        "'I was crying hysterically and then I was laughing hysterically, and I would just alternate between those emotions.'In the chat, Gillan spoke about her chemistry with actress Zoe Salana, who plays the character Gamora, as well as an alternate version of the character.",
        "'It did take a little bit of adjusting, just because I have come to know Gamora very well and to be a certain way,' she said of the alternate version. 'And now she’s a very different version of the character, but I thought that [Zoe’s] performance injected it with so much life, because it was so different.'So I love this version of Gamora. She’s really badass, and she’s just willing to do these crazy things in crazy situations, which makes her a bit unpredictable as a character. So I quite enjoyed that.'In the chat, Gillan opened up about her character, saying 'she’s got a new arm courtesy of Rocket.'It is so cool and it basically does everything that anyone needs at any given time. It turns into all sorts of things.'She said of enjoying making the film with the cast, 'It’s just all the little moments where we connected as human beings ... especially because we were all dressed as aliens.'It’s actually so funny because we forget we’re dressed as aliens half the time. I don’t even notice, and that must look really weird from the outside.'",
        "Guardians Of The Galaxy Vol. 3 is slated to hit theaters Friday.  "
    ]
}