{
    "articleURL": "/wires/afp/article-12040733/Islamic-Jihad-announces-truce-Gaza-rocket-fire.html",
    "content": [
        "Palestinian militant group Islamic Jihad announced a truce around Gaza Wednesday, after militants traded fire with Israel following the death in Israeli custody of a hunger striker from its ranks.",
        "Mediators from Qatar, Egypt and the United Nations intervened to broker a return to calm from 4 am (0100 GMT), sources in Islamic Jihad and fellow militant group Hamas told AFP.Israel did not immediately confirm the agreement.The Israeli army said the last warning sirens sounded near the Gaza border at around 5:30 am (0230 GMT).Witnesses in the blockaded Palestinian territory told AFP that several rockets were fired at Israel around this time.\"One round of confrontation has ended, but the march of resistance continues and will not stop,\" said Tariq Salmi, a spokesperson for Islamic Jihad in a statement.\"Our brave fighters have proven their loyalty and commitment to defending their people,\" he added.Hamas chief Ismail Haniyeh demanded that Israel return the hunger striker's body to his family.\"We stress - and as we have informed all the mediators who intervened - the necessity of handing over the body of the martyr Khader Adnan to his patient family,\" Haniyeh said in a statement.Adnan, 45, from Jenin in the occupied West Bank, died early Tuesday after an 87-day hunger strike following his arrest by Israel over ties to Islamic Jihad.A string of high-profile hunger strikes during at least 13 stints in Israeli custody had turned Adnan into a national hero, and revitalised hunger striking as a form of protest among Palestinians incarcerated in Israeli jails.",
        "From Tuesday morning, around 100 rockets were fired by militant groups from Gaza towards Israel, according to Islamic Jihad.In response, the Israeli army said it carried out a number of air strikes on Gaza early Wednesday, targeting \"weapons manufacturing sites, outposts, military complexes and an underground terror tunnel\" belonging to Hamas.\"It (Hamas) will face the consequences,\" the army added.Israel generally holds Hamas responsible for all rocket fire from Gaza, regardless of which militant group launched it. The Islamist group has controlled the territory since ousting loyalists of Palestinian president Mahmud Abbas in 2007."
    ]
}