{
    "articleURL": "/news/article-12061131/Australian-flight-delays-cancellations-airline-passengers-soon-receive-compensation.html",
    "content": [
        "Consumer groups calling for better compensationThey want to see government adopt EU model  Australian airlines could soon be forced to pay passengers compensation for delayed or cancelled flights. ",
        "Four organisations have all separately raised the idea of a compensation scheme with the government as it considers its aviation white paper due to be released next year.The Australian Competition and Consumer Commission (ACCC), consumer advocate Choice, the Australian Lawyers Alliance (ALA) and advocacy group Consumer Champion all claim Australia's laws are a 'long way behind' the rest of the world. ",
        "They point to the European Union's airline laws - where passengers who arrive with a delay of over three hours are entitled to between €250 ($405) and €600 ($970) each, depending on the distance of the trip - as a model for the Australian government to consider.  In the EU, longer delays mean passengers can opt to be refunded, which must be repaid to them within seven days. However, the rules do not apply if flight disruption can be blamed on something outside the airline's control, such as weather, medical emergencies or air traffic control restrictions.  Whereas, in Australia, different airlines offer differing compensation schemes.",
        "And although the Australian Consumer Law applies, there are no flight-specific rules around the amount of compensation paid or the timeframe. Adam Glezer, founder of consumer advocacy group Consumer Champion, told Daily Mail Australia he had brought Australia's paltry flight compensation cover to the attention of the government back in 2020.",
        "'The reality is Australia is a long way behind other countries,' he said. 'Until we actually have consequences for airlines delaying or cancelling flights willy-nilly then nothing will change.' Mr Glezer said passengers would be 'lucky to get $15 in food vouchers to spend in the airport' if their flight was delayed or cancelled. 'The Australian government, whether its Liberal or Labour, has repeatedly put off and ignored the issue despite them being well aware of the desperate need for changes to be implemented,' he added. The ACCC outline in their March submission to the aviation white paper that in the post-pandemic period, Australian 'consumers experienced extensive cancellations, delays and mishandled bags'.   ",
        "'In July 2022, 6.4 per cent of domestic flights were cancelled and a record 46 per cent of domestic flights were delayed,' the commission wrote.It added: 'Some advocates have called for consumer protection measures to be introduced in Australia that set out more specific consumer compensation entitlements for delayed or cancelled flights.'Current laws effectively allow airlines to sell tickets that do not guarantee departure times, which means there are little to no repercussions if they cancel flights last-minute. 'There is currently no real incentive for airlines not to cancel or delay flights … there is no obligation to deliver a service,' Jodi Bird, Choice Australia's money and travel expert told The Guardian. ",
        "Mr Bird aid compensation offered by Australian airlines is often buried in terms and conditions, which means passengers are not aware of what they can access.'Typically in Australia, if your flight with a cheaper carrier is delayed you might get a voucher, which at the airport can buy you a coffee if you're lucky,' he said. Bird said that while the EU model 'is very clear and consistent across airlines so people know what they are entitled to', the US and Indonesia also have forms of regulated compensation, meaning 'Australia is really lagging behind the rest of the world here'.'Australian airlines don't seem to care much about customer service after they've sold you the ticket, and something like this would mean they'd have to,' he said.Separately, the ALA has also urged the Albanese government to include a compensation scheme as part of its aviation white paper.'The lack of compensation for flight delays and cancellations in Australia puts us behind much of the world when it comes to protecting traveller’s rights. 'Rather than Australian passengers having to jump through legal loopholes to receive flight delay compensation, in the rare instances where it is available, it is time for Australia to have its own simple and straightforward compensation regime,' the ALA told The Guardian. "
    ]
}