{
    "articleURL": "/tvshowbiz/article-12056873/Millie-Bobby-Brown-marks-fianc-Jake-Bongiovis-21st-birthday-series-loved-snaps.html",
    "content": [
        "Millie Bobby Brown marked her new fiancé Jake Bongiovi's 21st birthday on Sunday as she shared a number of loved-up Instagram photos.",
        "The actress, 19, celebrated her soon-to-be husband's big day with a sweet tribute post which showed the couple holding hands in every photo. In one snap the couple cosied up at they wrapped their arms around each other while exploring what seems to be Japan.The Stranger Things star looked effortlessly cool in a black leather blazer and a white skater skirt as the pair walked away from the camera. She toted her belongings around in a cute fluffy white bag while her beau who is Jon Bon Jovi's son rocked a pair of shorts and an oversized T-shirt. ",
        "Millie looked simply stunning in another picture which was taken at her Enola Holmes sequel premiere in New York City, back in October of 2022.The actress dressed to impress in a glamorous pink backless down while Jake looked dapper in a suit.  Millie also added similar other photos of the newly engaged couple holding hands while exploring cities around the world. She penned: 'This sums us up. In bliss, exploring together. I am eternally holding your hand. Happy birthday fiancé. I love you ❤️'.The post comes after the pair announced their engagement on April 11, which came after almost two years together.Millie recently flashed her stunning engagement ring on Instagram. ",
        "The Enola Holmes star announced her engagement with a post showing off her glimmering rock in a monochrome picture.She penned in the caption: 'I've loved you three summers now, honey, I want 'em all'.",
        "While Jake also shared an announcement post to his own page, simply writing 'forever' alongside two snaps of the couple.Celebrating the joyous news, the smitten couple took part in a beachy photoshoot - with Millie dressed in a crochet dress while Jake donned a cream polo shirt.The announcement confirms some speculation that has been circulating on social media over recent weeks, after she flashed a glimpse at the ring in a recent post.Posing behind the wheel of a convertible car in a picture last month, Millie looked away from the camera and lifted her hand in the air, showing the prominent diamond ring on her finger.While she also sparked rumours in August when she was seen wearing a gold diamond ring on her wedding finger during a PDA-packed outing.Sharing that they had spent 'three summers' together in the announcement post, it comes after the actress recently dished the dirt on how she and Jake met.Millie explained they connected on Instagram and became friends through the platform, before romance was sparked.",
        "Answering the internet's most searched questions about her, she said: 'We met on Instagram. And we were friends for a bit, and then, what can I say?'She introduced Jake to her 62.7M followers in June 2021 with a cute photo of him posted to Instagram, but it wasn't until she posted a picture of him planting a kiss on her cheek that they were 'Instagram official.'Millie called Jake her 'partner for life', in a gushing post where she shared a series of pictures of the couple back in January 2023."
    ]
}