{
    "articleURL": "/femail/article-12054341/Princess-Dianas-bridesmaid-India-Hicks-discusses-wasnt-invited-coronation.html",
    "content": [
        "British designer and Princess Diana's bridesmaid India Hicks discussed guest listRead more about Lady Pamela Hicks and her role in Her Majesty's inner circleOne of Princess Diana's bridesmaids has spoken out about why she wasn't invited to the coronation, defending the king's meritocratic guest list.",
        "India Hicks, also a goddaughter of King Charles, appeared today during the BBC's coverage of the event, discussing her lack of invitation - something she has discussed before.The 55-years-old has previously said it is 'exciting' that the monarch, who she described as a 'considerate and patient man, opted to reduce the number of aristocrats on the list, choosing instead to invite 'ordinary' people with achievements in different sectors.However, Daily Mail columnist Sarah Vine has claimed there may be another reason that India - and her mother Pamela Hicks - were left off the list.Lady Pamela Hicks, whose father, the 1st Earl Mountbatten of Burma was Prince Philip 's uncle, is one of only two surviving bridesmaids from Queen Elizabeth and Prince Philip's wedding in 1947.",
        "Daily Mail columnist Sarah Vine has claimed the lack of invitation is because Lady Pamela Hick's father Mountbatten 'convinced the Queen not to let Charles marry Camilla.'Sarah said: 'I don't think Charles has forgotten.'  India, who spends much of her time in Barbados, donned a chic cream dress and a matching tweed jacket, to take photos of herself outside Buckingham Palace, which she shared on Instgram.In the caption for the images, she revealed she had been on television talking about Charles' charity The Princes Trust. In the photo's caption, she described the king as 'considerate', and 'patient'.",
        "She also posted a video of horses and a carriage travelling through a street in Westminster and joked: 'The traffic's been interesting.'Later, India also sat down with a Canadian interviewer.In a post on her Instagram grid, she added: 'Talking on telly today about The Prince's Trust, the remarkable man behind it, and a very considerate, very patient godfather (with an annoying five-year-old India).'India's busy day comes after she posted a photo of herself on Instagram with a long caption discussing the commentary over Charles's invitation list. ",
        "She wrote: 'There has been so much heated discussion about who has, or has not, been invited to this Coronation, why? Surely it’s exciting to see so many invitations based on meritocracy?'Does it not show we have a King who understands both tradition and what it takes to evolve with the times? 'Although this should come as no surprise from a man who upon completing his duty in the Royal Navy, used his severance pay to fund a community of initiatives, which were the founding projects of The Prince’s Trust.'The Prince's Trust has always focused on equality, diversity and inclusion and isn’t that what we are seeing with a guest list mainly awarded on effort, not rank?'India is an ambassador for the charity's Women Supporting Women project and last year raised money for the initiative with a sponsored cycle.",
        "Shortly after the death of Queen Elizabeth, when King Charles ascended the throne, she undertook the ride from Buckingham Palace to Windsor Castle.Posting on Instagram, she wrote: 'Tomorrow I am biking from Buckingham Place to Windsor Castle, along with several thousand other people, in the hopes of raising awareness and funds to help transform the lives of youngsters who are facing a frankly s***** future.'King Charles (still feels strange saying that) set up the charity in 1976 with a few thousand pounds of his severance pay from the Navy, to tackle high youth unemployment which he feared would leave young people marginalised.'"
    ]
}