{
    "articleURL": "/wires/reuters/article-12041385/Three-civilians-killed-Russian-attack-Ukrainian-hypermarket--officials.html",
    "content": [
        "Ukraine recaptured Kherson city last November",
        "Kherson city is frequently shelled by Russian troopsWednesday's attacks killed 23, wounded 46 - governor(Updates death toll, adds quote)By Elizabeth Piper and Carlos BarriaKHERSON, Ukraine, May 3 (Reuters) - Russian shelling killed 23 people in and near the southern Ukrainian city of Kherson on Wednesday, hitting a hypermarket, a railway station and residential buildings, the regional governor said.\"The enemy's targets are the places where we live. Their targets are our lives, and the lives of our children,\" governor Oleksandr Prokudin said, announcing the latest death toll in an online video on Thursday.President Volodymyr Zelenskiy on Wednesday decried the attacks on Kherson, condemning \"the bloody trail that Russia leaves behind with its shells\".Prokudin said 46 people had also been wounded in Wednesday's attacks.The dead included three engineers trying to repair damage inflicted on the power grid in earlier Russian bombardments, local officials said.Pools of blood and piles of debris lay on the ground outside the Kherson hypermarket after the attacks, Reuters correspondents on the scene said.Russia did not immediately comment on the attacks in Kherson, one of four Ukrainian regions it said it annexed last September. Moscow has denied targeting civilians in its invasion of Ukraine that began in February 2022.",
        "Many windows were smashed at the railway station. Three women who had been eating at the time of the attack said they took cover under a table.Moscow has stepped up air strikes on Ukraine in the past few days as Kyiv prepares for a counteroffensive in which it is expected to try to retake occupied territory in Kherson region.Ukrainian troops recaptured Kherson city last November after nearly eight months of occupation, but Russian troops retreated only as far as the opposite side of the Dnipro River, from where they now shell the city.Regional governor Oleksandr Prokudin on Wednesday announced a curfew in Kherson city to last from Friday evening until Monday morning for \"law enforcement\" reasons. He gave no other details. (Additional reporting by Pavel Polityuk, Olena Harmash and Max Hunder in Kyiv; Editing by Ron Popeski, Grant McCool and Timothy Heritage)"
    ]
}