{
    "articleURL": "/tvshowbiz/article-12046557/Bruce-Springsteen-pays-Shane-MacGowan-visit-Dublin-home.html",
    "content": [
        "Bruce Springsteen delighted Shane MacGowan with a visit to his Dublin home. ",
        "The Dancing In The Dark singer, 73, who goes by the moniker 'The Boss', was seen beaming at The Pogues hitmaker, 65, while looming over him in an image shared by the latter's wife Victoria Mary Clarke on Twitter on Wednesday. Taking to the site, Victoria delightedly penned: 'What an amazing honour and a beautiful experience to get a visit from The Boss!!! Such a truly wonderful man and a total genius!', while Shane shared the image and simply wrote 'The Boss'. The iconic US star landed in Dublin ahead of taking to the stage for his Bruce Springsteen and the E Street Band tour to the RDS Arena on May 5, 7 and 9. Shane was looking healthier than his recent appearances, after suffering poor health late last year. Noting his healthy look, a follower penned: 'Is that Shane McGowan looking awesome &amp; healthy sitting on the couch? (Springsteen looks good too).'",
        "In December Shane was taken to hospital, after which Victoria asked fans to 'send prayers and healing vibes'. The Fairytale Of New York singer, who has used a wheelchair since he broke his pelvis in 2015, has been in and out of hospital in recent years. Victoria shared a picture of the musician smiling and said he had been admitted again",
        "She wrote: 'Please send prayers and healing vibes to Shane MacGowan in hospital again and really hoping to get out asap!! Thank you.'Victoria told the Irish Mirror that Shane is finding it 'frustrating' and wants to get out after being admitted last Friday.She said: 'I’m definitely hoping he gets out this week. He’s a bit frustrated, I think. He finds it very frustrating… he wants to get out.'",
        "The couple have been together for more than 35 years and tied the knot at Copenhagen City Hall in Denmark in November 2018. The intimate ceremony was attended by their close friend Johnny Depp, who performed.he Irish singer-songwriter has had health troubles since he broke his pelvis. In 2021 he fell and broke a knee, before tearing ligaments in his left knee, never fully recovering from the injuries. In April he confirmed that he 'can't walk any more'.He has also been open about his battle with addiction and in 2015 had to get a full set of teeth implants after decades of drinking and drugs destroyed his real one"
    ]
}