{
    "articleURL": "/wires/pa/article-12050005/Tom-Parkes-hoping-good-fortune-returning-fitness.html",
    "content": [
        "Livingston defender Tom Parkes is desperate to get back on the pitch after finally recovering from a horror knee problem that has kept him sidelined for 17 months.",
        "The 31-year-old Englishman has not played since December 2021 after damaging his anterior cruciate ligament and then suffering a setback just as he was closing in on a return to action last summer.Parkes was on the bench for the Lions’ last outing against Dundee United a fortnight ago, but manager David Martindale has said he is wary of throwing him into action after so long out without a pre-season under his belt.The centre-back is delighted to be back in the mix and is eager to get himself some game time after managing just 11 appearances for the Lions since joining from Exeter almost two years ago.“It’s been a long time but I’ve worked hard to get where I am now and I’m feeling good,” he said. “Just being on the bench against Dundee United was amazing but my main priority is to get up to the standards that other boys are at and try and take it into next season.“I don’t think people have seen enough of me to see what kind of player I can be, so being back among the lads and training with them every day is a big step. Hopefully it stays this way and I can try and get back on the pitch and show people what I can do.”",
        "After fighting back to fitness last summer and taking part in pre-season training, Parkes was gutted when he suffered a setback and had to undergo a second knee operation that wrecked his hopes of getting back on track in the current campaign.“It was tough, especially after the second operation,” he said of his lengthy lay-off. “I had to spend nearly 12 weeks sat at home. I couldn’t walk, I was on crutches, and I didn’t really want to do anything.“But once that was out the way and I was able to come in and be around the lads and all the staff, it helped me massively.“The main thing when I came back is that I was ready to come back and enjoy it. It’s been a long time but I’m just looking forward to getting game time.”Parkes is set to be on the bench again when Livi return to action for their first post-split fixture away to bottom-of-the-table Ross County on Saturday after missing out on the top six.“It was disappointing to miss out on the top six but our aim now is to finish seventh, like we did last season,” he said. “After Christmas we’ve not played as well as we did before, so that’s probably where it’s gone wrong.",
        "“We’ve still done better on points this season than we did last season so it’s hard to take that we didn’t make the top six. As disappointing as it is, we’ve got to make sure we finish the season on a high.”"
    ]
}