{
    "articleURL": "/tvshowbiz/article-12049817/Lizzo-cancels-Montreal-illness-singer-reveals-news-resting-bed.html",
    "content": [
        "Lizzo's ongoing tour, in support of her fourth studio album Special, has hit a snag.",
        "The rapper, singer and flutist had to cancel her scheduled show at Bell Centre in Montreal, Canada on Thursday after getting sick with flu-like symptoms.In an Instagram video showing the Truth Hurts star wearing a face mask and covered up in a blanket, she laid out the various symptoms she's been feeling since Wednesday night.'Hey Montreal, I had a sore throat last night (Wednesday) and a headache. And I went to bed and I woke up this morning (Thursday) and I was worse,' she said, while sounding as if she was about to cry.'My body is weak and i have chills and my heard hurts, she continued. 'Normally, if it's just a cold, I'll show and I will eat, take some medicine and it gets better. But this is getting worse.'",
        " Lizzo (born Melissa Viviane Jefferson), 35, went on to reveal that she suspects she has 'the flu.'She would eventually share a tweet about having a 102-degree fever, as reported by TMZ.It's at this point in the clip where she said she had to make 'the unfortunate decision to cancel tonight,' which is the show at Bell Centre.'I want to find a date to reschedule, but I just can't perform tonight (Thursday),' she added, while sounding remorseful. The Detroit, Michigan native claims this is just the second time she has ever had to 'cancel something due to health in my entire career.'",
        "She concluded the post by promising to 'make it up to you Montreal. So sorry.'In the caption of the post, Lizzo also promised fans she will honor tickets at a makeup show.Her next performance is set for Saturday, May 6, at the XL Center in Hartford, Connecticut. So far, there's no official word on whether she will be feeling well enough to perform the show.",
        "Lizzo is currently out on The Special Tour, which is in support of her fourth studio album, Special.The tour began with a show at FLA Live Arena in Sunrise, Florida on September 23, 2022, and is set to go on through until her performance at the Fuji Rock Festival on in Nigata, Prefecture, Japan on July 30, 2023.The musician foirst gained prominence in 2013 as one of five artists to form the hip-hop group Grrrl Prty, who released two EPs before playing their final show at Rock The Garden and disbanding in 2016.In 2013, she also dropped her first solo studio album, Lizzobangers, the was then re-released by Virgin Records the following year.She has since released Big Grrrl Small World (2015), then Cuz I Love You (2019), which is considered her breakthrough album due in part to the hit singles Juice, Temp and the title track Cuz I Love You. ",
        "Lizzo dropped Special (2022) last July and features the hits About Damn Time, 2 Be Loved (I Am Ready)."
    ]
}