{
    "articleURL": "/wires/ap/article-12052997/FBI-Colombians-drugged-US-soldiers-stole-money-phones.html",
    "content": [
        "FORT LAUDERDALE, Fla. (AP) - Three Colombian nationals are facing federal charges in Miami accusing them of drugging two U.S. Army soldiers at a Bogota bar three years ago to steal their debit and credit cards and their phones, U.S. law enforcement officials announced Friday.",
        "Jeffersson Arango, Kenneth Uribe and Pedro Silva have been indicted on kidnapping, assault and conspiracy charges for the alleged March 2020 drugging, abduction and robbery that left the soldiers with little memory of what happened.According to court documents, the soldiers went to an upscale Bogota bar late one night shortly before most of the world shutdown due to the coronavirus pandemic to drink, watch a soccer game and dance with local women.Hours later, one soldier was found stumbling down a Bogota street and the other was found passed out in his apartment, with both missing their wallets, cellphones and other possessions. Blood tests showed they had been drugged.A joint investigation by the FBI and the Colombian National Police found bar surveillance video that shows the three and possibly others drugging the soldiers' drinks and then escorting them out of the bar after 2 a.m. and into a waiting car. Bank and other surveillance video shows Arango using their debit and credit cards at ATMs and stores, the U.S. government alleges.After the trio were identified, Colombian police began intercepting their phone communications where they allegedly talked about robbing people they drugged at bars and complaining that the pandemic shutdown had halted their conspiracy. Arango and Uribe were arrested in December. Documents do not show if Silva has been arrested.",
        "FBI Special Agent Orlando Quant said in affidavit that when he interviewed Arango, he admitted drugging the soldiers with the others and taking them to a hotel. He said he was able to get one soldier's debit card PIN by convincing him he needed to pay for something. He then told the drugged soldier that a cellphone was a payment pad and had him type in the number, which he later used to withdraw money.They then left the soldiers on the street. It is unclear how one got back to his apartment.Arango made his first appearance in Miami's federal court Friday after being extradited. Court documents do not show that Uribe or Silva have been extradited. No attorneys were listed in court documents for the three."
    ]
}