{
    "articleURL": "/wires/ap/article-12048069/Texas-president-says-building-relationships-priority-SEC.html",
    "content": [
        "AUSTIN, Texas (AP) - Oklahoma and Texas have taken their final steps toward leaving the Big 12 for the Southeastern Conference.",
        "Texas' Board of Regents this week approved allowing Texas president Jay Hartzell to sign agreements to move the Longhorns to the SEC, and Oklahoma´s Board of Regents on Friday approved the necessary contractual agreements with both conferences to make the switch.The schools will join their new league on July 1, 2024.Oklahoma and Texas will play one season in a 14-team Big 12 that will include new members BYU, Central Florida, Cincinnati and Houston. Oklahoma athletic director Joe Castiglione said Friday's meeting was a necessary step, but he doesn't want to jump too far ahead.\"We have a year of competing there and competing for Big 12 championships before we move on to the SEC, so we want to continue to be very respectful, very positive and a contributing member of the Big 12,\" Castiglione said. \"But obviously, that moves us to do the right things to make sure we´re planning every aspect of our transition next year from this summer.\"Hartzell said Thursday he'll attend the Southeastern Conference's annual meeting later this month with a goal of building relationships, not immediately trying to flex Longhorns muscle in their new league. Castiglione said Oklahoma also will be represented. Neither will yet have voting rights.Hartzell said he'll be watching how the conference addresses its football scheduling dilemma - eight or nine conference games - and its potential impact on future media rights contracts. The SEC meets May 30 in Destin, Florida.",
        "\"My impression is scheduling is tough for them, probably will be the topic of the day, and then figuring out what is the latest in terms of media discussions and how those two interact,\" Hartzell said. \"I´ll be there mainly to start building relationships.\"Hartzell said he wasn´t ready to take a position on the scheduling issue, and said he won't go to the meeting with a Texas agenda.\"I don't want to come in here and guns blazing,\" Hartzell said. \"Texas on occasion has a reputation as, you know, being an alpha. I´m happy to come in and start just being part of the team. ... It´s a great league, and we´re excited about it and we want to fit in and be a good partner with the league with all the other presidents and chancellors. We've got a role to play, but also want to be a team player.\"Texas' vote was expected after the Big 12 announced in February it had reached an agreement with Texas and Oklahoma to leave a year earlier than planned, leaving behind the $50 million each school would have received over the next two seasons under the Big 12´s media contracts.Castiglione said realignment in other leagues played a role in Oklahoma, Texas and Big 12 commissioner Brett Yormark agreeing to accelerate the process.",
        "\"It became more and more apparent to everybody involved that ... it might be to everyone´s benefit for us to talk about a path to leave a year early. And I think everybody agrees that for everybody's best interests going forward ... it´s a great decision,\" Castiglione said.___AP Sports Writer Cliff Brunt in Norman, Oklahoma, contributed to this report.___AP college football: https://apnews.com/hub/college-football and https://twitter.com/ap_top25. Sign up for the AP Top 25 newsletter here: https://link.apnews.com/join/6nr/morning-wire-newsletter-footer-internal-ads"
    ]
}