{
    "articleURL": "/wires/aap/article-12060407/Tight-focus-cost-living-balanced-Labor-budget.html",
    "content": [
        "Electricity bill subsidies, wage increases for aged-care workers and a slim surplus are all on the table for the federal budget.",
        "Treasurer Jim Chalmers will announce a near $4 billion surplus forecast in his second budget on Tuesday night, along with smaller than initially forecast deficits each year over the next four years.It will be the first budget in the black in 15 years if it comes to fruition at the end of the financial year.The bottom line is set to improve by more than $143b over the four years to 2025/26.Dr Chalmers says the government is striking the right balance between taming inflation and providing targeted relief for struggling Australians.Prime Minister Anthony Albanese said growing the economy, helping vulnerable Australians and investing in health and aged care are among his top priorities.Mr Albanese defended his government against criticism it should have raised more than $2.4 billion in revenue through a tax on oil and gas producers.\"What we want to do is to make sure we got the balance right,\" he told ABC radio.Some 5.5 million households and one million small businesses will be eligible for up to $500 in electricity bill relief.Single parents of young children will gain, with the cut-off age for benefits to rise from eight to 14, while aged-care workers will get a 15 per cent pay rise.Medical prescription changes will save Australians up to $180 a year.",
        "Dr Chalmers said the government was using spending restraint to avoid adding to inflation.\"Responsible economic management is more important than ever,\" he said.\"We are putting the budget on a much more sustainable footing at the same time as we provide cost-of-living relief and invest in the future.\"Despite spruiking fiscal prudence to pay back mounting interest payments on the national debt, the government is under pressure to boost welfare and cost-of-living relief instead of banking the extra income.The government will return just over 80 per cent of the increased revenue in this budget, bringing the total saved over the first two Labor budgets to 87 per cent.The interest bill on the debt is expected to hit $110b over five years.But some money will be clawed back through changes to tax breaks for fossil fuel companies, super tax changes and an increase in tariffs on cigarettes.There will be $17.8b in savings measures and redirected money, putting the total savings over the two budgets at $40b.Opposition finance spokeswoman Jane Hume said a drover's dog could deliver a surplus in this environment with high commodity prices.She said the coalition's prudent economic management through the COVID-19 pandemic put the budget in a strong position.\"Labor is reaping the benefits of that,\" she told AAP.",
        "\"But the real test is whether you can deliver a surplus next year and the year after that and the year after that.\"She said reducing inflation needed to be the top priority."
    ]
}