{
    "articleURL": "/wires/ap/article-12059723/Wisconsin-election-officials-want-revive-critical-plan.html",
    "content": [
        "MADISON, Wis. (AP) - Election officials in battleground Wisconsin hope to revive a bipartisan plan they say is critical to rebuilding confidence in elections but that was killed last week by Republicans without debate.",
        "The state's chief elections official said a new division designed to handle voters' concerns and deal with an onslaught of records requests and complaints was \"exactly what Wisconsin needs\" and of critical importance.The Legislature's Republican-controlled budget-writing committee rejected the commission's request along with more than 500 other spending proposals from Democratic Gov. Tony Evers in a single vote last Tuesday.The move is contrary to other battleground states that are taking steps to invest in trust in elections ahead of the 2024 presidential race.\"I certainly hope it comes back,\" said Don Millis, the Republican chair of the bipartisan Wisconsin Elections Commission, which proposed the plan. \"There are things we can do to improve confidence, and that´s where this inspector general office comes in.\"Millis said he intended to ask lawmakers whether the plan could be revived as a bill, but the head of the Assembly elections committee told The Associated Press he's already looking elsewhere for ways to build trust in elections.",
        "\"I think it makes more sense for the municipalities to be in charge of their decision making and problem solving,\" Republican Rep. Scott Krug said. Krug said lawmakers are working on plans to fund grants for local election officials, instead of more staff for the statewide elections commission. He had not heard from any lawmakers trying to revive the commission's request.",
        "\"We would need to see details, but will always support additional funding for election administration and security, including at the local level,\" said Meagan Wolfe, the nonpartisan administrator of the commission and the state´s top elections official. But she also pressed the Legislature to reconsider the commission's request for 10 full-time staff for a new inspector general office at a cost of $1.9 million over two years.The Wisconsin Elections Commission was created by Republicans in 2016, but it has increasingly been the target of GOP criticism since former President Donald Trump spread false claims that election fraud led to his defeat in Wisconsin in 2020.There is no evidence of widespread fraud in Wisconsin in 2020, and the election outcome has withstood two partial recounts, a nonpartisan audit, a conservative law firm´s review, numerous state and federal lawsuits and even a Republican-ordered investigation by a former state Supreme Court justice.Still, some Republicans have pushed to eliminate the elections commission entirely.The primary responsibility for administering elections in Wisconsin falls to more than 1,800 local clerks in one of the most decentralized systems nationwide. The commission sets rules, certifies results and provides clerks with training and grants. Until recently, the agency had only one attorney and one public information officer to process complaints and respond to voters´ questions.",
        "Conspiracy theorists, skeptics and even lawmakers looking for evidence of election fraud have inundated the elections commission with requests in recent years. Ahead of the 2022 midterm, the agency was receiving more than three times the number of complaints it had in 2020, and records requests topped eight times its 2016 average, according to an August report.The three Republican and three Democratic election commissioners, who are appointed by the governor and legislative leaders, unanimously approved the request for an inspector general office last year.\"These investments are critical to boosting resiliency in our election infrastructure ahead of next year´s General Election,\" Wolfe said in a statement after lawmakers killed the plan.Millis, the Republican chair of the commission, said \"it's not fatal\" if the plan fails. But he wanted lawmakers to at least consider new ways to build trust in elections and ease the workload of commission staff.In addition to investigating complaints and responding to records requests, the new inspector general office would have been tasked with reviewing the accessibility of polling sites, engaging directly with concerned voters and helping to train local election officials.___Harm Venhuizen is a corps member for the Associated Press/Report for America Statehouse News Initiative. Report for America is a nonprofit national service program that places journalists in local newsrooms to report on undercovered issues. Follow Harm on Twitter."
    ]
}