{
    "articleURL": "/news/article-12049755/Andrew-Lloyd-Webber-reveals-King-Charles-wrote-death-son-Nick.html",
    "content": [
        "Lord Lloyd-Webber's son died in March following a long battle with cancer  Andrew Lloyd Webber has revealed that King Charles wrote to him twice following the death of his son Nick. ",
        "The 43-year-old record producer died in March after a protracted battle with gastric cancer and pneumonia. Speaking to The Telegraph, Lord Lloyd-Webber revealed he was not 'prepared for the loss' of his son and that the King had offered his personal condolences following the tragedy.'He not only sent me two letters about my son but, typically for him, rather than sending flowers, he has sent bulbs that could be planted,' the Phantom Of The Opera composer said.Lord Lloyd-Webber added that writing the Coronation anthem had been a 'kind of antidote' to dealing with his son's death. ",
        "The theatre impresario's song, Make A Joyful Noise, will be played publicly for the first time as the King is enthroned in Westminster Abbey tomorrow. Speaking out ahead of the spectacle, the acclaimed composer said it would be a 'bleak moment', adding: 'It will be of considerable sadness to be in the Abbey.'Supported by his wife Madeleine, he will be one of 2,200 in the congregation at Westminster Abbey. Lord Lloyd-Webber, who is known for hit musicals including Evita and Jesus Christ Superstar, has drawn on the words of Psalm 98 for his anthem.Speaking with Channel 4 News, he described it as a 'joyful noise' which has helped him cope with his son's passing, adding: 'Obviously writing the anthem, because it's joyful, it was a wonderful thing to do as a kind of antidote to what I knew was going on in my private life.",
        "'Music is my life. Music is what I do. The music and what I may have written for the Coronation - I do obviously have the thought of my son in my mind and there will be a moment when I'm in the abbey, I know, as there was the other day, when I'm thinking of my lovely Nick. And thinking that making a joyful noise is also for him.'Speaking to the Daily Telegraph, Lord Lloyd-Webber also revealed the King insisted the piece should be 'hummable' and cheerful because 'he wants the anthem sung in churches'. ",
        "The composer said he hoped the anthem would be sung during celebratory occasions such as weddings and christenings.The theatre star also reflected on what his future may hold after the Coronation is over. 'One of the things is that I haven't properly taken it all in yet, and I think once the Coronation is over, and my small part of it is done, I do need to think about what I will do next,' he told The Telegraph. Following the Coronation, the tune will be released as a single to raise money for the Royal British Legion and Age UK."
    ]
}