{
    "articleURL": "/wires/reuters/article-12045607/Euro-zone-bond-yields-steady-ECB-Fed-hike-stride.html",
    "content": [
        "By Harry Robertson",
        "LONDON, May 4 (Reuters) - Euro zone government bond yields were little changed on Thursday ahead of an expected decision by the European Central Bank to raise interest rates for the seventh month in a row.The U.S. Federal Reserve raised interest rates on Wednesday by 25 basis points (bps), and signalled that it may hold them at the new 5% to 5.25% range.U.S. Treasury yields dropped after the Fed's decision, but euro zone yields failed to follow suit on Thursday.Germany's 10-year yield, the euro zone benchmark, was up 1 bp at 2.261%. Yields move inversely to prices.Italy's 10-year yield was up 2 bps at 4.152%. The closely watched gap between Italian and German borrowing costs rose slightly to 188 bps.Traders think there is roughly a 77% chance of a 25 bps interest rate hike from the ECB later on Thursday, and a 23% possibility of 50 bps, with more expected.The main interest rate currently stands at 3%, up 350 bps since July.\"We're basically in limbo right now until the decision,\" said Piet Haines Christiansen, chief strategist for fixed income at Danske Bank.\"There is the risk of the ECB doing 50. My baseline is still for 50. It is limiting how much bond markets can rally.\"",
        "Pricing in derivatives markets shows traders expect rates to climb at subsequent meetings to a peak of around 3.75% in the autumn.Christiansen said he expects rates to hit 4%, however, given that data this week showed inflationary pressures remain strong.Germany's 2-year bond yield, which is sensitive to interest rate expectations, was down 2 bps to 2.662%, just above a one-month low.Euro zone yields have fallen sharply since the start of March, with problems in the banking system sending investors towards safe-have assets.Germany's 10-year yield is around 52 bps below the almost 12-year high of 2.77% hit in early March.Yet yields have also risen from their mid-March lows as central bankers have made clear that squelching inflation remains the priority.The Fed on Wednesday dropped from its policy statement language saying that it \"anticipates\" further rate increases would be needed, as it entered a new phase after a year of aggressive rate hikes.Yet Fed Chair Jerome Powell pushed back against market expectations that the Fed will cut interest rates any time soon.He said it will \"take some time\" for inflation to fall and so \"it would not be appropriate to cut rates\" this year.(Reporting by Harry Robertson; Editing by Kim Coghill)"
    ]
}