{
    "articleURL": "/wires/reuters/article-12053759/Corbin-Carroll-D-backs-try-secure-series-win-Nats.html",
    "content": [
        "Corbin Carroll, an early favorite to win National League Rookie of the Year by MLB Pipeline, returned to the Arizona Diamondbacks' lineup in left field for the first time in six days on Friday against the Washington Nationals after nursing a knee injury.",
        "He banged his left knee last weekend at Colorado when he crashed into the outfield fence.In his second at-bat in Friday's 3-1 series-opening win over Washington, belted his fifth home run of the season, a solo shot to extend his hitting streak to 10 games.Carroll had a pinch-hitting appearance against the Texas Rangers on Wednesday.He came to the plate twice because of a sustained rally. He singled and struck out and reported to Arizona manager Torey Lovullo that his knee felt fine, but Lovullo said, \"I don't think he turned it totally loose.\"\"We know how hard he's been working to get back in the lineup and help us win the game,\" Lovullo said. \"He did it the other day coming off the bench. Obviously did it today again, getting us right back in it with a solo home run and then we just chipped away in the fourth inning, we just started to have some quality at-bats, kept passing on to the next guy.\"Carroll said he had fluid in his knee but he did not feel pain.\"I just had to wait for the knee to heal and become stronger,\" he said. \"It felt good.\"Two left-handers in their second seasons will face off Saturday -- Washington's MacKenzie Gore (3-2, 3.77 ERA) and Arizona's Tommy Henry (1-0, 6.52).",
        "Gore, picked third overall by the San Diego Padres in the 2017 MLB Draft, was involved in the Nationals' seven-player trade last year with the Padres that included Juan Soto going to San Diego.In Gore's only experience against the Diamondbacks, he pitched one-third of an inning of relief last year for the Padres. He allowed a hit and had two walks while allowing two runs with a strikeout in San Diego's 3-1 loss at home.Henry, a second-round pick by the Diamondbacks in 2019, will face the Nationals for the first time.Washington rookie right-hander Jake Irvin will not pitch against Arizona coming off his big league debut Wednesday in a 2-1 win over the Chicago Cubs. He allowed two hits in 4 1/3 innings with four walks and three strikeouts.Washington manager Dave Martinez said Irvin will likely start at San Francisco on Monday.Irvin, a 2018 fourth-round draft pick by the Nationals, was 2-2 with a 5.64 ERA in five starts (22 1/3 innings) with Triple-A Rochester this season.He missed the 2021 season because of Tommy John surgery.\"We are going to keep him around,\" Martinez said. \"We haven't decided yet what we are going to do for that starter spot, but if he's here until then, he will get the chance to start again.\"",
        "Lovullo said that right-hander Zach Davies, who suffered an oblique strain on April 8, threw a 41-pitch bullpen session at Arizona's spring training complex in Phoenix on Friday.--Field Level Media"
    ]
}