{
    "articleURL": "/wires/afp/article-12041303/New-autopsies-Kenya-cult-case-confirm-murder.html",
    "content": [
        "Autopsies carried out on dozens of bodies found in mass graves linked to a Kenyan cult that practised starvation have found that some of the victims were strangled, beaten or suffocated, the authorities said.",
        "The discovery of mass graves last month near the Indian Ocean coastal town of Malindi has shocked Kenyans, with children accounting for more than half of the 109 victims who were allegedly incited to starve to death by self-styled pastor Paul Nthenge Mackenzie.Experts carried out 30 autopsies on Tuesday, adding to 10 post-mortems performed a day earlier, with chief government pathologist Johansen Oduor saying that while starvation appeared to be the main cause of death, some victims appeared to have been murdered.Out of 40 bodies in total, four -- including two children -- showed signs of suffocation, he said.A third child appeared to have been hit in the head with a blunt object, he told reporters late Tuesday.A fourth child was choked to death, he said, adding: \"we could clearly see marks of someone who has been strangled and breaking of some bones in the neck.\"\"We are certain that the child was strangulated.\"The 40 bodies include at least 16 adults and 18 children, with experts unable to determine the age of six people because of severe decomposition of their remains.\"Most of them died because of starvation in that 20 of the autopsies we did (on Tuesday) had features of people who died with starvation,\" Oduor said.",
        "Mackenzie is due in court in Kenya's second-largest city of Mombasa on Friday, with police asking to detain him for 90 days while they investigate what has been dubbed the \"Shakahola forest massacre\".He and 17 other suspects will face terrorism charges over the deaths, with Mackenzie also accused of murder, kidnapping, cruelty towards children among other crimes in court documents seen by AFP.- Calls for regulation -Ezekiel Odero, a wealthy and high-profile televangelist, is also facing charges in connection with the same case and will appear in court on Thursday.Odero is suspected of murder, aiding suicide, abduction, radicalisation, crimes against humanity, child cruelty, fraud and money laundering.Prosecutors say they have credible information linking the corpses exhumed at Shakahola to the deaths of several \"innocent and vulnerable followers\" from Odero's New Life Prayer Centre and Church.Questions have been raised about how Mackenzie, a former taxi driver turned self-proclaimed pastor with a history of extremism, managed to evade law enforcement despite previous legal cases.The horrific saga has seen President William Ruto vow to intervene in Kenya's homegrown religious movements and thrown a spotlight on failed efforts to regulate unscrupulous churches and cults that have dabbled in criminality."
    ]
}