{
    "articleURL": "/tvshowbiz/article-12045521/Tess-Daly-admits-tracks-daughter-Phoebe-app.html",
    "content": [
        "Tess Daly has admitted she tracks her daughter Phoebe on an app because she worries about her safety while she's driving alone. ",
        "The presenter, 54, who shares Phoebe, 18, and Amber, 13, with husband Vernon Kay, revealed that her eldest is a new driver which is the reason for her concerns. She said: 'When your child starts to drive, that's a whole new minefield. I've got that app LIFE360 and I track Phoebe on it obsessively until she gets to her destination.'It's because she's a new driver. And the relief when I see she's reached it . . . you never stop worrying.The Strictly host joked: 'She's only gone for 20 minutes and I'm a nervous wreck. It's ridiculous. Loosen the leash!'",
        "Speaking on the Spinning Plates podcast, she revealed that while she does still have her concerns about her girls, she is letting them forge their own life paths. The television personality also gushed that she and Vernon have a 'great relationship' with them.  She said: 'You just have to advise them and gently guide the way. It has to feel like they're reaching their own decisions in life.'But they're needing more as they get older. They need more life advice, there seems to be more mental hand-holding.'You never stop parenting. I don't know when that all-seeing eye ends.'It comes after Tess Daly admitted she was 'in denial' in March as she braced herself for a 'big change' in her family life.",
        "Speaking on Loose Women she said she 'couldn't believe' her eldest daughter was now 18-years-old and knew change was imminent.Tess explained how Phoebe will soon be leaving home to go to drama school but joked that she 'didn't want to think about it.'",
        "Panellist Jane Moore said that she couldn't believe how old her daughter was, with Tess replying: 'I know, same, I'm in denial.'She continued: 'She's not ever leaving, I can't think about it,' as she pretended to sob to the rest of the panel. In February, Vernon said he doesn't want his children to live off his and wife Tess' fame, insisting they form 'their own careers.'He told MailOnline he's currently looking at drama schools to send Phoebe to where she can combine her passions for acting and business.Unlike some showbiz couples, Vernon says himself and Tess believe it's important for their offspring 'to find themselves' and not be given their 'life on a plate', crediting the pair's Northern backgrounds for shaping their parenting beliefs. ",
        "Vernon said: 'We let them be independent when it comes to them and their futures because it's important that you allow them to find themselves, which is character building and personality development.'Sometimes I think that the old silver spoon and life on a plate in front of them… I think that's quite contradictory to how you want them to be.",
        "'Tess and I grew up in hearty, wholesome Northern families and that's a huge trait that helped us in our personal development and I think that's really important.'He added: 'I don't disagree with anyone that does that by helping their kids, which is great, but I just think sometimes for us, personally, it's whatever they're into, they can go and discover themselves.' "
    ]
}