{
    "articleURL": "/wires/pa/article-12048551/Last-gasp-Alexis-Mac-Allister-penalty-sends-Brighton-sixth.html",
    "content": [
        "Alexis Mac Allister fired Brighton to sixth in the Premier League by converting a dramatic added-time penalty to dent Manchester United’s Champions League hopes.",
        "The Argentina World Cup winner emphatically dispatched the ball into the top left corner nine minutes beyond the regulatory 90 after Luke Shaw was penalised for handball following VAR intervention.Albion’s 1-0 win from a pulsating Amex Stadium contest moves them above Tottenham and Aston Villa, while leaving United looking over their shoulders at fifth-placed Liverpool.The Seagulls sit just four points behind Jurgen Klopp’s Reds with two games in hand thanks to the stunning late twist.Brighton’s success partially avenges the spot-kick heartache they suffered at the hands of their opponents in the FA Cup semi-finals just 11 days ago and completes a league double over United.The Seagulls also smashed their club-record top-flight points tally – moving on to 55, three more than they managed in the the 42-game 1981-82 season.Antony and Anthony Martial wasted golden opportunities for United, who still have work to do to reach European football’s premier club competition next term following a painful climax.",
        "Prior to Mac Allister’s last-gasp breakthrough, Kaoru Mitoma missed the Seagulls’ best opening of a feisty encounter, thumping the ball into the head of David De Gea during a rapid start.United keeper De Gea was visibly dazed by the unconventional stop but was deemed fit to carry on following on-field treatment.",
        "With plenty at stake in the battle for continental qualification, players from both sides clashed in a heated second half after Antony’s crude challenge on Mac Allister sparked a mass brawl.United travelled to Sussex with bitter memories of Wembley still lingering in the minds of the high-flying hosts.",
        "The frantic opening exchanges suggested there would be no repeat of that cagey 0-0 draw, with both sides passing up glorious chances.Antony fired wide after Bruno Fernandes’ pass carved open Albion’s defence inside two minutes, before Mitoma intercepted an under-hit Victor Lindelof pass and raced clear only to thump his effort into the face of De Gea with Julio Enciso awaiting a tap-in.Brighton boss Roberto De Zerbi overcame the illness which led to the cancellation of his pre-match press conference to take his place on the touchline.The Italian was his usual animated self and passionately appealed for a penalty when Mitoma went to ground following minimal contact from Aaron Wan-Bissaka’s outstretched leg.United, who were thrashed 4-0 on this ground last May, remained dangerous on the counter-attack and caused constant issues for the home defence as they created the best first-half chances.",
        "Casemiro headed narrowly over for Erik Ten Hag’s men, while Brighton keeper Jason Steele produced smart saves to deny low efforts from Marcus Rashford and Martial.",
        "Travelling fans had once again unveiled a ‘Glazers out’ banner ahead of kick-off as ongoing protests against their club’s ownership continue.Yet the sold-out away end would have taken plenty of encouragement from the opening 45 minutes.Rashford tumbled easily inside the Brighton box just after the restart before the hosts enjoyed a period of dominance, albeit initially creating little.",
        "Casemiro, who was earlier booked for scything down Mac Allister, escaped a second yellow in the 65th minute for a foul on the same player.Home fans then felt further aggrieved when Mitoma went down in the penalty area for a second time, before tempers flared after Brazilian Antony chopped down fellow South American Mac Allister, leading to a booking for the United man and Brighton captain Lewis Dunk.Casemiro drilled over, while Seagulls substitute Solly March, who missed the decisive spot-kick at Wembley, lashed wide and De Gea superbly denied Moises Caicedo as an enthralling affair looked set end all square.But Shaw inexplicably handled a corner and, after referee Andre Marriner consulted the pitchside monitor and pointed to the spot, Mac Allister thumped home."
    ]
}