{
    "articleURL": "/news/article-12038933/CALLAHAN-Met-just-desperate-Z-listers-peddling-flesh-Wintours-reign-terror-dead.html",
    "content": [
        "It’s over.",
        "Monday night’s Met Gala was a desperate last gasp for elitism, cultural tone-setting, celebrity worship and Anna Wintour’s reign of terror.Add this one-time legendary event, the subject of its own documentary called 'The First Monday in May,' to the list of flagging entities killed by Covid-19.Absent were A-listers once Met Gala vanguards of high-style and theatricality. Sarah Jessica Parker, Beyoncé, the Olsen twins, Zendaya, Taylor Swift, Anya Taylor-Joy, Harry Styles, Lady Gaga — all took a pass on the former ‘Oscars of fashion’.Instead we got a stream of Z-listers peddling filth and flesh, their thirst palpable.Really, who among us was waiting to see what Maude Apatow, that great beneficiary of nepotism, was wearing?Her compatriot Brooklyn Beckham? Devon Aoki? Camila Morrone?Even the few true stars who attended got it wrong. Margot Robbie may have been in Chanel, but her torso was sheathed in plastic. Imagine the body heat trapped within. To paraphrase an infamous Real Housewife: Even Chanel makes mistakes.",
        "Jennifer Lopez, 53, cosplayed - per usual - as a dewy twenty-something perpetually surprised by her own glamour, abdomen out.Janelle Monae wore a cartoonish Thom Browne coat over an impossible-to-sit-in spherical dress. Doja Cat was made up to look like an alien feline.Olivia Wilde showed up in the same dress as Vogue China editor, Margaret Zhang — an absolute horror for a night such as this.",
        "Lil Nas X wore a thong and silver body paint, his face looking encrusted by some kind of parasite. (Perhaps not the best post-pandemic look.)Rihanna, usually queen of the Met, showed up two hours late, long after the livestream ended, looking swallowed whole in custom Valentino, boyfriend A$AP Rocky in jeans — bedazzled jeans at that.One can only imagine what the late Karl Lagerfeld, the gala’s honoree, would have made of this mess. One thing’s for sure: Lizzo would never have made his guest list.Lagerfeld may have been a genius, but he was also a monster, earning the sobriquet Kaiser Karl for his ruthless diktats.Among them: ‘No one wants to see curvy women… You’ve got fat mothers with their bags of chips sitting in front of the television and saying that thin models are ugly. The world of beautiful clothing is about dreams and illusions.’Well, we’ve all seen behind the curtain and we know: Few businesses are as ugly as high fashion.As that great trend prognosticator Gwyneth Paltrow said after the 2013 ceremony: ‘I’m never going again. It was so un-fun. It was boiling. It was too crowded. I did not enjoy it at all.’",
        "Seems most of the cool kids have finally agreed.Despite excluding once-welcomed social media ‘influencers’ and most reality stars, Wintour’s attempt to class up the event, to make it feel chic and exclusive, failed miserably. Despite what seemed a lifetime ban, Paris Hilton was allowed to attend.",
        "One can date the moment Vogue lost its authority to Wintour's decision to put Kim Kardashian and Kanye West on the cover in 2014. The magazine has never recovered.Even Wintour couldn’t exclude all the Kardashians from this year’s gala, and what did we get?Kim serving up a soft-core porn look, wrapped as she was in none-too-subtle pearl necklaces, an homage to her 2007 Playboy shoot.Hey — at least she didn’t ruin a one-of-a-kind historic dress, as she did with Marilyn Monroe’s beaded gown last year.Jared Leto dressed as Lagerfeld’s beloved cat Choupette, resembling nothing so much as a live Disney character removing his head for a smoke break.Pete Davidson looked grubby and out-of-place, trying so hard to appear above it all. Jack Harlow looked like a roadie.These are the people we're supposed to admire? To emulate? Glamour, it seems, is on life-support.The afterparty looks were even worse.",
        "‘Naked Dressing,’ Vogue called it in its own coverage – and here were Kendall Jenner, Emily Ratajkowski, Olivia Wilde, and a very pregnant Rihanna all in various states of undress.Monae was the nadir, dressed in nothing but bra and panties, miming intercourse with a giant fake cat.As anyone who has ever worn a uniform knows, it matters not where you are — you are always representing the institution. What a mark of Wintour’s lost power. Not a single invitee fears her wrath for underdressing or inelegance or besmirching the brand as a whole.",
        "Perhaps all the recent hypocrisy was just too much. Recall New York City mayor Eric Adams on last year’s red carpet, wearing a flashy tuxedo jacket emblazoned with the words, ‘End Gun Violence.’Or socialist congresswoman Alexandria Ocasio-Cortez the year before in a white gown that looked spray-painted with the slogan ‘Tax the Rich’ — the exorbitant cost of her dress, hair, make-up and hotel room subject of a House ethics investigation last year (AOC since cleared).And that’s to say nothing of Lagerfeld’s own troubling history. He was a hardcore misogynist, openly critical of #MeToo and its impact on the fashion industry.‘If you don’t want your pants pulled about, don’t become a model,’ he said in 2018. ‘I’m fed up with it. What shocks me most in all of this are the starlets who have taken 20 years to remember what happened.’This was one year after fashion photographer Terry Richardson was dropped by the entire industry over rape allegations.Lagerfeld called those who models who complained of industry-wide sex abuse 'stupid,' 'toxic' and 'sordid creatures.'Creatures!",
        "He also put models in blackface and yellowface. Feminists, he said, were feminists because they were ugly. He sent flowers to Dominique Strauss-Kahn, former chief of the International Monetary Fund, after he was accused of rape.",
        "Women, Lagerfeld said, ‘get horny from politics, from power,’ yet admitted that DSK had a problem.‘Sweet guy,’ Lagerfeld said, ‘as long as you’re not a woman.’WOW. Shame on Wintour for ignoring this.Lagerfeld, true to form, shunned his blue-collar American family, sister included, for being unglamorous. And wouldn't you know: there was no invite to this year's Met Gala for them.But there was one for Lagerfeld's cat, whose reps declined at the last minute. Eat the rich, indeed.Lagerfeld even blamed Kim Kardashian for getting robbed at gunpoint in a Paris hotel suite in 2016.‘You cannot display your wealth then be surprised that some people want to share it,’ he said. ‘If you’re that famous and you put all your jewelry on the [internet], you go to hotels where nobody can come near to the room.’ How on-brand for a misogynist — blaming the victim.It says everything about how the fashion world, its fakery and hypocrisy, that Kim showed up to this year’s gala. No slight is too cruel, no insult too personal to matter.And if nothing matters, how can anything? There is artistry and there is artifice, and in a post-pandemic world, we commonfolk increasingly have less tolerance for the latter. Times change, even if Lagerfeld would never understand."
    ]
}