{
    "articleURL": "/wires/aap/article-12058885/Curbing-crime-boosting-tourism-focus-NT-budget.html",
    "content": [
        "A $39m crime-fighting package will be unveiled in the Northern Territory budget as community concern grows over mounting violence.",
        "Attorney-General Chansey Paech announced the multimillion-dollar investment in alternatives to custody and jail programs as hundreds gathered at Charles Darwin University for the funeral of student Md \"Sifat\" Isfaqur Rahman.The death of the 23-year-old after a home invasion last week has reignited widespread community concerns about crime rates.Mr Paech said the NT budget on Tuesday would include programs to address the \"social determinants\" of crime.\"Certainly, when the budget is released tomorrow, there will be a comprehensive breakdown around where the alternative custody funding is going,\" he said.\"We've worked tirelessly with the community and with the governance committee on the Aboriginal Justice Agreement to make sure that we are investing in the right areas.\"The territory has an alternatives to custody program in Alice Springs for women serving prison terms.Instead of being sentenced to jail, the women can live at a custodial facility which runs programs to deal with addiction, domestic violence, financial insecurity, housing and family matters.It boasts a 90 per cent success rate of reducing recidivism in the 12 months after people in the program are released.The budget will allocate $15m to expand the Alice Springs facility and to start one on Groote Eylandt, a small island off the NT.Mr Paech said $12.3m would be spent alleviating \"demand pressures\" and $14m over the next four years for bail accommodation and probation officers.",
        "Luring international visitors to the NT is also a budget priority.Tourism Minister Nicole Manison said $35.5m would be spent trying to draw people to visit the NT and stay longer, adding to a record $3.12b visitor spend in 2022.But the NT's international visitors have failed to return to pre-pandemic numbers.\"A lot of that has to do with the airlines not being back up to full capacity and the confidence of people to travel internationally still, so we've got to get in there because generally people have far longer lead times,'' Ms Manison said.\"(It) is all about making sure that we are marketing card to Australia and right across the world.\""
    ]
}