{
    "articleURL": "/wires/reuters/article-12046119/Soccer-Bayern-focused-Bundesliga-delay-board-meeting.html",
    "content": [
        "MUNICH, Germany, May 4 (Reuters) - Bayern Munich want as few distractions as possible as they look to salvage a disappointing season by at least retaining their Bundesliga title, delaying a much-anticipated board meeting until after the end of the season.",
        "The Bavarians were in the running for three titles as recently as late March when coach Thomas Tuchel replaced Julian Nagelsmann but are now only left with a possible league crown.After a shock German Cup exit with a home loss to Freiburg, Bayern were also eliminated in the Champions League last eight by Manchester City.They then briefly lost the Bundesliga lead to Borussia Dortmund before reclaiming it last week with a win over Hertha Berlin as their rivals stumbled to a draw at VfL Bochum. Bayern are a point ahead of Dortmund.With four games left and Bayern travelling to 12th placed Werder Bremen on Saturday, the club announced this week it would delay a May 22 board meeting until after the end of the season.Club directors were set to discuss the team's recent poor run of form plus decisions taken in recent months by embattled club CEO Oliver Kahn and sports director Hasan Salihamidzic, including sacking Nagelsmann which many fans criticised.\"The Bayern Munich board has set a new date of May 30 for its scheduled second quarter board meeting,\" it said in a statement.\"It was rescheduled until after the season finale against Cologne (on May 27) so the club can focus on the sporting aspect in the decisive stretch of the championship.\"",
        "The Bavarians have failed to impress under Tuchel and have won only one of their last three league matches.There was some good news off the pitch this week with keeper Manuel Neuer upping his recovery training following a broken leg in December and sounding confident of their title chances.\"The title is now again in our own hands,\" Neuer, who is expected to return next season, said on the club website. \"I am certain that in the end it is us who will be champions.\"Bayern are chasing a record-extending 11th straight league crown.Dortmund, who have 61 points from 30 games, host in-form European hopefuls VfL Wolfsburg on Sunday, while third-placed Union Berlin, on 56, travel to Augsburg.Freiburg, in fourth on 56 points, host fifth-placed Leipzig, who have 54, in the battle for Champions League places. (Reporting by Karolos Grohmann; Editing by Ken Ferris)"
    ]
}