{
    "articleURL": "/sport/football/article-12041559/Chelsea-2022-23-transfers-ranked-best-worst.html",
    "content": [
        "Chelsea slumped to perhaps their most alarming defeat of the season at ArsenalIt has been a disastrous campaign on and off the pitch for new co-owner BoehlyMail Sport has taken a look at his 13 signings as Blues chief and ranked themAs they gladly close out what has been a disastrous season both on and off the pitch, Chelsea seem to be saving the worst until last after one of their most spineless and calamitous displays yet against Arsenal on Tuesday night.",
        "It took the Gunners just 34 minutes to wipe out Frank Lampard's sorry side at the Emirates, with most visiting supporters heading for the exits long before the half-time whistle after watching their team fall three goals behind.While they did manage to pull a goal back after the break, Noni Madueke's strike was not enough to spark a miraculous comeback and Chelsea instead slumped to a sixth defeat in six under floundering caretaker boss Lampard.The Blues, Champions League winners just two years ago under Thomas Tuchel, are now languishing nine points above the relegation zone in 12th place, despite co-owners Todd Boehly and Behdad Eghbali forking out over £600million on new signings.After their latest horror show, Mail Sport has taken a look at the 13 players Chelsea have signed under Boehly and Eghbali - only taking into account those who have featured in 2022-23 - and ranked them from best to worst.",
        "1. Benoit BadiashilePerhaps the only player on this list who can hold his head high, Badiashile has barely put a foot wrong when called upon this season and, with that in mind, his lack of minutes under Lampard is incredibly puzzling.The French centre back is physically strong, quick and reliable in the air, and at 22 years of age he looks a mature head on young shoulders. ",
        "Yet he has only been afforded one appearance in Lampard's six games at the helm so far.After moving to Stamford Bridge as part of an unprecedented January transfer spend, former boss Graham Potter could not find room for him in his Champions League squad, and his calming presence at the back was ultimately missed in their quarter-final thrashing by Real Madrid.One of the few positives for Boehly to take from an otherwise catastrophic couple of transfer windows is Badiashile, who looks capable of one day filling Thiago Silva's shoes when the 38-year-old eventually bows out.2. Enzo FernandezWhile he has certainly enjoyed a decent start from an individual standpoint, Chelsea will be expecting their club-record £107m signing to kick on and truly justify his mammoth price tag next season.After joining from Benfica in January, Fernandez instantly became one of the first names on the team sheet - albeit his transfer fee perhaps guaranteed that - and he has shown glimpses of his technical quality in 17 appearances for the Blues.",
        "His lack of pace was exposed rather brutally during their Champions League last-16 first leg defeat at Borussia Dortmund in February, when Karim Adeyemi burst away from him with ease and tucked away what proved the only goal of the first leg.",
        "Yet in a more settled team next term alongside a sharper N'Golo Kante in midfield, and with compatriot Mauricio Pochettino potentially in charge, the Argentina World Cup winner can begin to show his worth.3. Wesley FofanaUp until recent disasterclasses away at Arsenal and Real Madrid, Fofana was proving a key man at the back after returning from a lengthy spell out injured in February.Like Badiashile, the 22-year-old is another centre back whose calming nature on the ball often defies his years, and paying £70m to prise him away from Leicester is likely to prove superb business later down the line.As Lampard's men were ripped apart by both Arsenal and Real Madrid, he endured torrid nights against the likes of Gabriel Jesus and Vinicius Jnr, though it is fair to say he was not alone in capitulating on both evenings in question.The positives from his debut season at Chelsea undoubtedly outweigh the negatives and he has all the tools to lead the Blues' backline for the next decade, meaning Boehly can mark Fofana down as one of his few business successes this season.",
        "4. Joao Felix (LOAN)The Portuguese forward made the worst start imaginable after joining on loan from Atletico Madrid in January when he was sent off for a reckless challenge on his debut at Fulham.",
        "After serving a three-match suspension, he began demonstrating his mouthwatering ability on the ball upon his return and got on the scoresheet twice in his first six Premier League outings thereafter.But for a player as talented as Felix, chances do not come at a premium and the one glaring flaw in his arsenal is a lack of end product. In 12 Premier League appearances so far, the 23-year-old has averaged 1.8 shots from inside the box per game, meaning his tally of two goals speaks volumes about the number of opportunities he wastes. His ambiguous playing position, with Lampard admitting prior to Tuesday's defeat at Arsenal that he is unclear which role suits him best, also represents a problem and suggests Chelsea will not seek a permanent deal this summer.",
        "5. Kalidou KoulibalyAfter arriving from Napoli last summer with a reputation as one of the best central defenders in European football, Koulibaly has somewhat failed to live up to the hype in a rollercoaster of a debut campaign.A terrific strike on his home bow against Tottenham was followed by an encouraging first few months, only for his form to drop off in dramatic fashion after the World Cup break.And just when he seemed to be finding his feet again last month, the Senegal international picked up a hamstring injury which may well have ended his season prematurely.",
        "While he has hopped on board a sinking ship, and it can also be argued that he rocked up in English football with his best years behind him at 31, Koulibaly's first season at Chelsea will go down as a slight disappointment.6. Raheem SterlingSterling only cost Chelsea £50m last summer which, considering the scale of his achievements at Manchester City, where he scored 131 goals in 339 games while winning four Premier League titles, was rightly considered a bargain at the time.Yet glancing back at that fee 10 months on, the same assessment can't be made after what has been a miserable debut season at the Bridge.",
        "The England winger has scored just four times in 23 league outings this term and looks a shadow of the player who previously flourished under Pep Guardiola at City, although when considering he spent the majority of this campaign operating in a disjointed Blues side led by an underqualified Potter maybe that is no surprise.There is no doubting the quality Sterling possesses. His CV in English football speaks for itself. However, as a senior member of the squad at 28 years of age, Chelsea needed him to step up to the plate and inspire those around him throughout testing periods this season, and it is difficult to pick out many occasions when he has done so. His move therefore can't be considered anything but a failure as of yet.",
        "7. Noni Madueke Prior to this week's clash with Arsenal, the England Under 21 star's first half-season at Chelsea would have been graded as unsuccessful given his lack of action.Lampard threw him in at the deep end on Tuesday night by handing him only his third league start, and first since February, at the home of Mikel Arteta's title contenders.And despite only playing 50 minutes of senior football in almost two months, Madueke proved the sole positive of an otherwise traumatising evening for Chelsea at the Emirates, where he added a consolation goal by converting from close range with 25 minutes remaining.It may have only been one game, but Madueke's spirited and at times inventive performance was a sneak peek of the potential he clearly obtains. And at £29m, the Blues will not be concerned about taking a huge financial hit.",
        "8. Denis Zakaria (LOAN)Zakaria was made to wait until December to make his Premier League debut for Chelsea after joining on loan from Juventus last summer, with Potter initially taking a while to warm to the Swiss midfielder.When he was finally brought into the side, it was baffling as to what took so long. After being given a run of starts after the World Cup break, Zakaria's ball-winning abilities in midfield were clear for all to see, and he had fully emerged as one of the first names on the team sheet before a hamstring injury derailed his rise in January.Since returning in February, the Juventus man has only played 124 minutes of league football and appears quite far down in Lampard's pecking order, meaning a return to Turin looks likely this summer.9. Marc CucurellaGiven the £62m price tag and teacher's pet jibes after following Potter from Brighton, not to mention his eye-catching hair, Cucurella has almost become a poster boy and scapegoat for Chelsea's expensive struggles throughout this season.Criticism of the Spaniard has at times crossed the line - no player deserves to be jeered by his own supporters - yet when taking that out of consideration it can only be concluded that he has looked worryingly out of his depth.",
        "Particularly in home defeats against Arsenal, Manchester City and Aston Villa earlier in the campaign, as well as the draw at West Ham, which sparked unjustified booing from the away end, Cucurella has struggled defensively and offered very little going forward.In a 3-4-3 system, it is still unclear whether he is most comfortable at left wing-back or on the left side of a defensive trio, and if not for a probable lack of suitors Chelsea may be better off cutting their losses this summer.10. Mykhaylo MudrykChelsea's second most expensive buy of the season was Mudryk, who snubbed interest from Arsenal to complete a stunning £88m switch from Shakhtar Donetsk in January.Many argued at the time that Boehly and Co had paid well over the odds considering the 22-year-old only racked up 44 senior appearances in Ukraine before sealing a mega-money move to one of Europe's major clubs.And following an underwhelming start to life in England, that £88m fee is already looking rather questionable.",
        "While it must again be stressed for all the signings on this list that Chelsea are a club whose turmoil transcends the pitch this season - hardly an environment for young players to thrive in - and that he has only made 13 appearances so far, Mudryk is yet to produce a league goal and has often resembled a player devoid of confidence.A breathtaking debut off the bench at Liverpool has been followed by flashes of quality in recent weeks, but the Ukrainian youngster is clearly a work in progress and needs time to adjust to the pace and power of the Premier League.11. Carney ChukwuemekaOne of their cheaper recruits last summer at £20m, Chukwuemeka hardly represents a financial gamble for Chelsea and he has impressed when used off the bench this season.Yet considering he has only started one match, a 1-0 win at home to Crystal Palace in January, it is impossible to rate his first season in SW6 as a success.A loan move to a fellow Premier League club this summer would be an ideal next step in the 19-year-old midfielder's development.12. Pierre-Emerick AubameyangEyebrows were raised when Chelsea paid £10m to prise Aubameyang away from Barcelona last summer, given his prior fall from grace at Arsenal and bust-up with Mikel Arteta.Those question marks initially seemed out of place when the Gabon international powered home three goals in his first four matches, however since then his Blues career has very much been on a downward trajectory.",
        "Since opening his account for the Blues against Crystal Palace in October, Aubameyang has failed to score another Premier League goal and was left out of their Champions League squad for the knockout stages.On Tuesday night he made a surprise return to the starting lineup on a hostile return to Arsenal, and his abject display in a shambolic Chelsea performance pretty much encapsulated his spell at the club.13. David Datro FofanaAnother signing who has barely featured this season, it is impossible to properly grade Fofana's debut campaign at Chelsea after just 60 minutes of league football.The 20-year-old striker looked sharp on his first start against Southampton in February, though since being hooked at half time by Potter for reasons which were unclear he has not been seen since.Like Chukwuemeka, a loan move next season would surely be beneficial."
    ]
}