{
    "articleURL": "/news/royals/article-12051421/I-soldier-marching-Coronation-70-years-ago.html",
    "content": [
        "Lieutenant Colonel John Jones, 92, marched as a Royal Welch Fusiliers soldier He was selected to march in front of Queen Elizabeth II's golden state coach Follow MailOnline's new Royals channel for all the latest news and updates A veteran former Army officer has told of the painstaking preparations and gruelling training regime he underwent as a young soldier chosen to take part in the late Queen’s Coronation procession 70 years ago. ",
        "Lieutenant Colonel John Jones, 92, was one of 10 fresh faced soldiers from the Royal Welch Fusiliers selected to march in front of Queen Elizabeth II’s golden state coach as she made her way to and from Buckingham Palace. He gave a rare insight into the extraordinary plans drawn up by military top brass for the big day which were his personal recollections of the historic event. It comes after it was revealed military organisers of the King’s Coronation this weekend studied footage from 1953 to help plan the largest military ceremonial operation for 70 years. Mr Jones, from Camberley, Surrey, completed tours of duty in Northern Ireland, Korea, Malaya, Sudan and Cyprus during a distinguished 37 year military career. ",
        "The retired officer, who was also posted to Singapore and Germany and later went on to work at the Royal Military Academy in Sandhurst, was made an MBE by the late Queen in 1980. But in 1953, he was a young sergeant in the regiment after joining up just three years earlier. He told how 10 soldiers from each regiment in the British Army were selected to march on the route. As one of the senior regiments the Royal Welch Fusiliers were positioned close by as they marched in front of the Royal Carriage, he said. ",
        "Mr Jones, who grew up in Llansantffraid-ym-Mechain, Powys, said that because of the length of the route, which saw them march for around 15 miles on the day, a high level of fitness was required. ",
        "He told MailOnline: ‘The ten of us who were selected were sent to Wrexham to train for a month before the Coronation to ensure we could handle the march. ‘This involved cross country runs and long marches in full kit rifles and the regimental colours. ‘There would be no stopping on the route on the day. Anyone who failed the fitness training would be replaced. ‘After the fitness training we were sent to another base in Birmingham to join up with the other regiments participating in the ceremony to practise with them. ‘All of the training was done on the parade ground/square to rehearse the intricate movements that were required on the march. 'Several days before the coronation all those taking part moved to Earls Court which was crammed with three tier bunk beds. ‘We were well looked after, catering wise, the food being supplied by the Lyons Company. ‘The week before the coronation, we had to get up early to march and familiarise ourselves with the route. This was the only way we could rehearse. ",
        "‘It was very much like the rehearsals for King Charles’ Coronation this week.’ Describing the day of the Coronation when three million people lined the streets of the capital he said: ‘London was vibrant with thousands of visitors from across the world. ‘One has to realise that it wasn’t long since the war ended and Britain was still rationing. In fact, rationing didn’t end until the end of 1954. ‘It was a great opportunity to have something to celebrate and bring the country together. ‘Everything was timed to perfection. Heads of state from around the world were invited. Those from Africa and the Commonwealth wearing their national dress. ‘On Coronation day we rose very early, had very little breakfast and hardly any fluids as we would not be able to stop en route to answer the call of nature. ‘We formed up at 6am. It was raining heavily so we were issued with ponchos, then marched to Constitution Hill. ",
        "‘The parade started at 12 noon when the Queen left Westminster Abbey. ‘The procession formed in front of the Royal Carriage. By the time the Queen left the Abbey it had stopped raining so the ponchos were discarded. ‘The route was absolutely packed and the crowd were ecstatic and very noisy. ‘There were commentators, probably the BBC, along the route providing commentary as the procession marched past. ",
        "‘The planning was so meticulous, we arrived back at Earls Court at 5.55pm - five minutes ahead of schedule. ‘There was a mad rush to get to the toilets after we had discarded their rifles - there were some who didn’t make it!",
        "‘After that I went out with my mates to celebrate and witness the firework display.’ Mr Jones, who is now a grandfather and has three grow- up sons, is planning to watch the King’s Coronation from the comfort of his own home with relatives. Mr Jones’ son Nick told how his father would like to trace comrades who were with him and lived in hope that some were still alive. He told how his father is a ‘modest chap’ who rarely spoke about his military days but asked him to recount his memories of the historic day. He said the family only discovered by chance the role he played in the Coronation after seeing a photograph he had kept in a box when he and his late wife Eileen were moving home 10 years ago. Nick, 68, said: ‘He’s not one for blowing his own trumpet. It almost came out by accident when we saw the photograph. ‘I knew he had been involved in the Coronation but had no idea of any of the details until 10 years ago. ",
        "‘He met the Queen quite a few times during his career. She was Colonel in Chief of the regiment. He’s always been a royalist and the Queen was always quite important in our house. ‘We’re all very proud of his achievements. He’s quite a remarkable bloke. He served in all the hotspots. He was in Northern Ireland during the Troubles. He went out there four times. ‘He has never really spoken about any of that so I’m making him write up his memoirs now.’"
    ]
}