{
    "articleURL": "/wires/aap/article-12040799/Fan-abused-Souths-Latrell-Mitchell-faces-NRL-ban.html",
    "content": [
        "The spectator who targeted Latrell Mitchell with racial abuse in Penrith will be banned from attending future NRL games until he has apologised to the South Sydney fullback and undertaken education and training programs.",
        "The incident occurred at half-time in the Panthers' round-two win over the Rabbitohs at BlueBet Stadium, where the 14-year-old hurled a racial remark from the stands as Mitchell left the field.Photographs from inside the tunnel captured Rabbitohs players reacting to the slur that led to the teenager receiving widespread condemnation.According to The Sydney Morning Herald, the spectator disputed his comment was racially motivated.After the game, the Rabbitohs indicated they would file a police report into the matter and NSW Police gave the spectator a formal warning in the days that followed.The NRL finalised its own investigation into the matter on Wednesday afternoon, nearly two months on, and stopped short of banning the spectator for life.Instead, the teenager will be able to attend games once he has formally apologised to Mitchell and completed education and training programs facilitated by the NRL.\"The NRL confirmed today it had issued a notice intending to ban a spectator from attending NRL events until such time as the young person can establish that sufficient steps have been taken to address their behaviour,\" an NRL statement read.\"These steps will include apologising and completing appropriate training and education in respectful behaviour and cultural awareness.\"The NRL thanks Latrell Mitchell for reporting this matter and reaffirms that no form of vilification will be tolerated in rugby league.\"",
        "The spectator has five days to respond to the NRL's notice.The Panthers assisted the NRL in their investigation and welcomed the punishment handed down to the spectator, who is believed to be a Sydney Roosters fan.\"After working closely with the NRL throughout the investigation process, Panthers supports the decision made by NRL,\" the Panthers' statement read.\"Panthers will continue to work towards making all players, staff and fans feel safe and welcome at games at BlueBet Stadium.\"Mitchell scored two tries and was instrumental in the Rabbitohs beating the Panthers 20-18 in their follow-up meeting last month."
    ]
}