{
    "articleURL": "/wires/reuters/article-12048845/Trainer-suspended-horse-deaths-Lord-Miles-Derby.html",
    "content": [
        "Trainer Saffie Joseph Jr. was suspended indefinitely by Churchill Downs on Thursday evening and his Kentucky Derby entry, Lord Miles, was scratched from Saturday's race following the sudden deaths of two of Joseph's horses.",
        "Four horses died in five days in Louisville, Ky., including Parents Pride on Saturday and Chasing Artie on Tuesday. Those horses are trained by Joseph and owned by Ken Ramsey.\"For the betterment of racing, the health and welfare of our equine athletes and the safety of our jockeys, all horses trained by trained Saffie Joseph Jr. are scratched effective immediately and until further notice,\" the Kentucky Horse Racing Commission Board of Stewards said in a statement Thursday. \"This action is taken after consultation with Mr. Joseph, and includes Lord Miles, who was entered into the 149th running of the Kentucky Derby.\"Churchill Downs Incorporated called the deaths of Parents Pride and Chasing Artie \"highly unusual\" in a news release.\"Given the unexplained sudden deaths, we have reasonable concerns about the condition of his (Joseph's) horses, and decided to suspend him indefinitely until details are analyzed and understood,\" Bill Mudd, president and chief operating officer of CDI, said in a statement. \"The safety of our equine and human athletes and integrity of our sport is our highest priority. We feel these measures are our duty and responsibility.\"While suspended, Joseph is prohibited from entering horses in races or applying for stall occupancy across all Churchill Downs-owned tracks.Churchill Downs ordered full necropsies of the deceased horses and said Joseph's horses died suddenly of unknown causes. Two other horses from different trainers -- Wild On Ice and Take Charge Briana -- died as the result of \"musculoskeletal injuries from which they could not recover\" during training or racing at Churchill Downs and were euthanized.",
        "Joseph spoke to reporters Wednesday and said he was uneasy not knowing the cause of the tragic deaths.\"It shatters me,\" Joseph said of the loss of his two horses this week. \"We don't have the answer. And that's what -- that's what we need to get the answer. We've had them get hurt. That's different. I've never had a horse like this, of something internally in race? No. Basically it's mind-boggling. I mean, in a race, twice in three days and the first two runners, like, I mean, the same owner? It's mind-boggling.\"Lord Miles had won the Wood Memorial Stakes, drew the No. 19 position and opened at 30-1 odds before being scratched. Mandarin Hero was added to the field, bringing the total to three Japanese entries.--Field Level Media"
    ]
}