{
    "articleURL": "/news/article-12039031/Man-killed-New-York-City-subway-behaving-erratically-headlock.html",
    "content": [
        "A fight broke out at Broadway-Lafayette station when a passenger, 30, threateningly entered the subway carA former marine, 24, then put him in a headlock until he was unconscious The man later died in hospital - the former marine from Queens will not be chargedA 24-year-old former Marine who put an erratic New York subway passenger in a headlock before he later died will not be charged, according to police. ",
        "The fight broke out at the Broadway-Lafayette station on Monday afternoon when a 30-year-old man entered the subway car and started threatening passengers.Witnesses said he was acting in a 'hostile and erratic manner' before the younger man put him in a headlock and held him there until he was unconscious.The younger man was arrested after the fight and the older man was taken to Lenox Hill Hospital, where he was pronounced dead.",
        "The incident happened just before 2.30pm on the northbound F train platform at Broadway-Lafayette station in downtown Manhattan. The 30-year-old entered the northbound train and reportedly started yelling and throwing garbage at other commuters, prompting an argument with the former Marine, who NY Daily News reported was from Queens.The other passenger then intervened by putting the other man in a headlock until he was unconscious, police said. When an EMS team boarded the train, which remained at the platform, they were unable to revive him. Police have chosen not to identify the 24-year-old man, who was released without charges Tuesday. The man who died has also not been identified because police are still working to notify his family.",
        "The decision not to charge the younger man aligns with recent decisions by the Manhattan DA, Alvin Bragg.In April his office U-turned by saying it would not charge a garage security guard who shot a suspected thief with his own gun.",
        "The garage attendant was himself shot twice by the alleged thief before tussling for the same gun and firing back.Both were initially charged with attempted murder, assault and firearms charges before the DA's office changed its position.Bragg's office said at the time it would dismiss the case 'pending further investigation'."
    ]
}