{
    "articleURL": "/wires/pa/article-12041487/Nick-Cave-attend-coronation-admits-emotional-attachment-royals.html",
    "content": [
        "Nick Cave has defended his decision to attend the King’s coronation, explaining he has an “inexplicable emotional attachment” to the British royal family.",
        "The Bad Seeds musician, 65, denied being a “monarchist or a royalist” but said he would not be “so damn grouchy” as to refuse an invitation to “what will more than likely be the most important historical event in the UK of our age”.Cave was chosen as part of a group of 14 “outstanding Australians”, including comedian and Channel 4’s The Last Leg host Adam Hills, to represent the country at the coronation, which will be led by Prime Minister Anthony Albanese.",
        "Writing in his newsletter the Red Hand Files in reply to letters from three Australians and one British fan, singer-songwriter Cave defended his decision to attend the royal celebrations.He said: “I am not a monarchist, nor am I a royalist, nor am I an ardent republican for that matter; what I am also not is so spectacularly incurious about the world and the way it works, so ideologically captured, so damn grouchy, as to refuse an invitation to what will more than likely be the most important historical event in the UK of our age.“Not just the most important, but the strangest, the weirdest.”Cave also wrote about meeting the late Queen during an event at Buckingham Palace, describing her as “almost extra terrestrial” and “the most charismatic woman I have ever met”.",
        "He said: “When I watched the Queen’s funeral on the television last year I found, to my bafflement, that I was weeping myself as the coffin was stripped of the crown, orb and sceptre and lowered through the floor of St George’s Chapel.“I guess what I am trying to say is that, beyond the interminable but necessary debates about the abolition of the monarchy, I hold an inexplicable emotional attachment to the royals – the strangeness of them, the deeply eccentric nature of the whole affair that so perfectly reflects the unique weirdness of Britain itself.“I’m just drawn to that kind of thing – the bizarre, the uncanny, the stupefyingly spectacular, the awe-inspiring.”Replying to the message from the British fan which asked “what would the young Nick Cave have thought” of his attendance at the coronation, he replied: “…the young Nick Cave was, in all due respect to the young Nick Cave, young, and like many young people, mostly demented, so I’m a little cautious around using him as a benchmark for what I should or should not do”.He added: “He was cute though, I’ll give him that. Deranged, but cute.”Cave, who was named an Officer of the Order of Australia in 2017 for his “distinguished service to the performing arts and a “major contributor to Australian music, culture and heritage”, signed off the letter saying he was “looking forward” to the coronation, adding that he thinks he will wear a suit."
    ]
}