{
    "articleURL": "/wires/aap/article-12053887/Demons-hang-mighty-Suns-AFL-scare.html",
    "content": [
        "Gold Coast coach Stuart Dew has bitten his lip after Melbourne escaped with a five-point win in a controversial finish that helped the Demons back to the top of the AFL table.",
        "The Demons' 13.12 (90) to 13.7 (85) win, an 11th straight over the Suns, came despite Gold Coast's midfield matching their all-star cast.Darcy Macpherson missed his shot to tie the game with 20 seconds on the clock, while key forward Ben King was earlier controversially denied a free kick as the hosts hunted the go-ahead goal.Gold Coast were without injured trio Touk Miller, Ben Ainsworth and Lachie Weller but up stepped Noah Anderson (36 touches, one goal).He and Matt Rowell (11 clearances, 13 contested possessions) held sway with Christian Petracca (26 touches, one goal) and Clayton Oliver (28 touches).Macpherson (30 disposals) and Wil Powell (25 disposals) were influential for the stoic Suns, who dropped to 3-5.\"That's for other people to decide,\" Dew said of the King no-call.\"No doubt there's commentary. I'll stick to our own backyard.\"The parochial 11,440-strong crowd's protests set the scene, Dew saying he was proud of how his side repeatedly fought back from adversity.\"Yeah, you've to no choice have you? You can't stop and say 'Excuse me, can we have another look at that one?',\" he said.\"I don't want to be too buoyant about a loss but geez, there's a fair bit of heart and togetherness about this group.\"",
        "The Demons skipped clear early in the first term and again in the second but the Gold Coast rallied on both occasions, only a late Alex Neal-Bullen goal handing them a seven-point halftime lead.A Ben King goal locked up the scores at three-quarter time but the Demons leant into their reputation as final-quarter specialists to pull ahead by 15.That's when Suns fullback Charlie Ballard was stretchered off after copping a knock from Jacob van Rooyen's errant spoil.Ballard was later cleared of injury and it proved a handy juncture for the home side when Anderson soccered to himself then banged home a major.When Malcolm Rosas Jnr snapped his fourth after more great up-field pressure it was a four-point game.The Suns pressed for the go-ahead goal but with four minutes to play King wasn't rewarded, despite appearing to be dragged down as he led for a mark.Macpherson still had the chance to tie the game inside the final minute, but his set shot went right for a behind and the Demons were able to see out the clock and improve to 6-2.Max Gawn was everywhere for Melbourne in the first half, adding two goals, but was kept honest in a stoic ruck battle with Jarrod Witts.",
        "\"It was a game we thought was going to take place,\" Dees coach Simon Goodwin said.\"It's one you walk away pretty pleased with the result ... just our last quarter (was the difference).\"\"You build character off those types of wins but it's starting to be a hallmark, how we finish games off.\""
    ]
}