{
    "articleURL": "/wires/pa/article-12038435/Ocado-shareholders-rebel-bumper-pay-bonuses-bosses.html",
    "content": [
        "Over 30% of Ocado shareholders revolted against bumper bonuses and pay for bosses at the online retail giant.",
        "The group handed chief executive officer Tim Steiner a pay packet of around £2 million for 2022 despite Ocado’s losses ballooning to £501 million over the year and its share price falling by more than 50%.Mr Steiner, who also co-founder of the firm, received a £755,000 salary for the year and an annual bonus payment of £1.19 million, alongside other benefits such as pension.",
        "The company’s remuneration deal for bosses also handed finance chief Stephen Daintith a £1.39 million total pay deal, with its five top directors receiving almost £7 million between them.The firm confirmed after its annual general meeting that 30.14% of shareholder votes were cast against the remuneration package, although this saw the deal secure the necessary majority vote to pass.Ocado said it believed the vote against its pay policy was related to its annual bonuses for the year and its separate value creation plan.The firm’s directors received no pay-out from the value creation plan (VCP) for the year but the firm saw a similar voting backlash from shareholders a year ago after it confirmed that the VCP, which could hand Mr Steiner up to £20 million a year if targets are met, would be extended.“The board continues to believe that the implementation of the current directors’ remuneration policy, which was approved at the 2022 annual general meeting, offers the best way to incentivise management and drive exceptional and sustainable long-term growth of the group while also rewarding short-term operational and strategic decisions,” the company said.",
        "Ocado previously faced the ire of shareholders in 2019 when Mr Steiner received a £58.7 million pay package."
    ]
}