{
    "articleURL": "/wires/reuters/article-12048049/US-STOCKS-Wall-Street-drops-PacWest-fuels-fears-deeper-bank-crisis.html",
    "content": [
        "PacWest slumps as it looks at strategic options",
        "First Horizon tanks as Canada's TD calls off buyout dealInterest rate futures point to July interest rate cutIndexes fall: S&amp;amp;P 500 -0.51%, Nasdaq -0.16%, Dow -0.93%(New throughout, updates prices, market activity and comments to include afternoon trading)By Noel Randewich and Ankika BiswasMay 4 (Reuters) -Wall Street fell on Thursday after PacWest's move to explore strategic options deepened fears about the health of U.S. lenders and hit shares of regional banks as well as JPMorgan Chase, Wells Fargo &amp;amp; Co and other major financial players.PacWest Bancorp tumbled 43% after it confirmed it was exploring strategic options, including a sale, after shares of the regional lender and peers got hammered recently on fears of a worsening banking crisis.The fears reverberated across other lenders. Western Alliance Bancorp tumbled 35%, with trading in the stock halted multiple times. At its session low, Western Alliance shares were down more than 60% and the lender denied a report that it was exploring a potential sale.KeyCorp, Valley National Bancorp and Zions Bancorp fell between 4% and 12%. The KBW Regional Banking index dropped 3%.Canada's Toronto-Dominion Bank Group called off its $13.4 billion acquisition of First Horizon Corp, triggering a 37% drop in the U.S. bank's shares.",
        "Regulators seized troubled First Republic Bank on Sunday and JPMorgan Chase agreed to buy majority of its assets, marking the largest U.S. bank failure since the 2008 financial crisis.\"Regional banks and tightening credit conditions are weighing on the market as investors try to recalibrate on where we are in terms of credit cycles and bank lending standards, and when a potential recession may hit,\" said Zhe Shen, managing director of diversifying strategies at TIFF Investment Management.The CBOE volatility index, also known as Wall Street's fear gauge, rose to 21 points to touch its highest since late March.With investors increasingly worried a widening banking crisis and an economic downturn, U.S. interest rate futures prices now imply traders expect the U.S. Federal Reserve to cut rates by the central bank's July meeting, according to CME Group's FedWatch Tool.The Fed on Wednesday raised interest rates by 25 basis points, while Chair Jerome Powell said that it was too soon to say with certainty that the rate-hike cycle was over as inflation remains the chief concern.Of the 11 S&amp;amp;P 500 sector indexes, nine declined, led lower by financials, down 1.29%, followed by a 0.97% loss in health care.Among the largest U.S. banks, JPMorgan dropped 1.3% and Wells Fargo lost 4.3%.",
        "Data on Thursday showed the number of Americans filing new claims for jobless benefits increased last week as the labor market gradually softens amid higher interest rates, which are cooling demand in the economy.Apple Inc fell 0.7%. The iPhone maker is set to report quarterly results after the closing bell, including an update on its funds set aside for buybacks.The S&amp;amp;P 500 was down 0.51% at 4,069.72 points.The Nasdaq declined 0.16% to 12,006.67 points, while the Dow Jones Industrial Average was down 0.93% at 33,104.20 points.Moderna Inc jumped 3.6% on stronger-than-expected sales for its COVID-19 vaccine for the first quarter.Qualcomm Inc slumped 5.7% after the chip designer's third-quarter forecasts missed estimates, while Paramount Global Inc tanked about 27% after missing first-quarter revenue estimates amid a weak advertising market in its TV business.Declining stocks outnumbered rising ones within the S&amp;amp;P 500 by a 2.0-to-one ratio.The S&amp;amp;P 500 posted 4 new highs and 26 new lows; the Nasdaq recorded 41 new highs and 392 new lows.(Reporting by Ankika Biswas and Sruthi Shankar in Bengaluru, and by Noel Randewich in Oakland, Calif.; Additional reporting by Caroline Mandl in New York; editing by Shounak Dasgupta and David Gregorio)"
    ]
}