{
    "articleURL": "/news/article-12056929/Stars-arrive-Coronation-concert-Windsor-Castle-Katy-Perry-perform.html",
    "content": [
        "Follow all the latest royal news and updates on Coronation events on MailOnline's live blog hereNicole Scherzinger sang a popular Disney hit, Olly Murs took to the stage to show off his moves and Steve Winwood sang to a cheering audience of 20,000 spectators including the King and Queen and dozens of celebrities at Windsor Castle this evening as the Coronation Concert got underway. ",
        "Excitement was palpable as the celebrations for the King and Queen's crowning ramped up again in the star-studded show hosted by Downton Abbey star Hugh Bonneville.Olly Murs put on an energetic performance of his hit song Dance With Me Tonight while Pussycat Dolls frontwoman Sherzinger opted for a rendition of Reflection, which was written and produced for Disney's 1998 animated film Mulan. The powerful performance prompted applause from both the King and Queen - with Charles turning to the Queen afterwards to say a few words.Paloma Faith, Olly Murs, veteran rock guitarist Steve Winwood, as well as classical acts including Andrea Bocelli, Welsh bass-baritone Sir Bryn Terfel and Chinese pianist Lang Lang were also on the bill. Hollywood star Tom Cruise, Dynasty actress Dame Joan Collins, adventurer Bear Grylls, singer Sir Tom Jones and former Strictly Come Dancing professional Oti Mabuse will also make an appearance via video. ",
        "Nicole Scherzinger has said she felt like a Disney princess when she was rehearsing her song for the Coronation Concert, which is taking place in the grounds of Windsor Castle.Scherzinger, who was accompanied by pianist Lang Lang, said backstage ahead of the event that she felt 'overjoyed' and 'honoured' to take the stage.'Now that I'm here, it just feels really surreal. Being on the ground and having Windsor Castle as your backdrop is the dream,' she added.",
        "The singer said she found the coronation service on Saturday to be 'remarkable', as her home country of America does not have the same type of pageantry.The introductory number by Pete Tong was quickly followed by the emergence of the evening's host: Downton Abbey star Hugh Bonneville, 59.Olly Murs then took to the stage, followed by the Coronation Choir, led by Gareth Malone. The choir, made up of dozens from around the UK, included BSL signers and emergency service workers, who all sung a rendition of Brighter Days.The Coronation Choir sang, signed and smiled through a performance of Emile Sande's Brighter Days. The 300-strong choir included an all-deaf sign performance organisation, a traditional male voice choir from Caerphilly, Wales, Yorkshire's only female South Asian choir, the London Fire Brigade, and a troupe of RNLI sea shanty singers from Portishead, Somerset.The King and Queen and other members of the royal family will join members of the public at the event to continue the celebrations after their crowning at Westminster Abbey on Saturday.The concert is considered by many to be a crowning touch on the magnificent weekend, after joyous big lunch celebrations today and a surprise walkabout by the Prince and Princess of Wales.Among the celebrities to perform on stage will be the royal family's own Prince William, who will deliver a speech. ",
        "Reflecting on his thoughts surrounding the royal family ahead of the concert, host Mr Bonneville said: 'I think each generation will need to make its own definition of what monarchy means.'And I think that is the challenge for the future. In our ever-changing world, where does the monarchy stand? What does it mean?'I mean, for my generation, and for my parents' generation, it was the glue that bound our nations together, and that glue will need to shift and evolve in order to keep the strength that it's had in the past.'Bonneville said he thought the coronation service was 'extraordinary' and admitted that he found the moment the King swapped his 'robes of status and honour' for a simple white shirt for the private anointing as 'particularly touching'.He added: 'It's a crazy old service, it's strange to think how it's accreted over the years, over the centuries to what it is today and it obviously will have a new meaning, a different meaning for our generation, the generation that witnessed it with the late majesty.'I found it moving and an extraordinary change-marker in the sand for our culture and for our generation.'The actor added that he feels the concert this evening will be a 'magical' way to continue the festivities.",
        "The show in Windsor will also see performances by Paloma Faith, Olly Murs, veteran rock guitarist Steve Winwood, and Nicole Scherzinger of The Pussycat Dolls.Classical acts including Andrea Bocelli, Welsh bass-baritone Sir Bryn Terfel and Chinese pianist Lang Lang are also on the bill.Hollywood star Tom Cruise, Dynasty actress Dame Joan Collins, adventurer Bear Grylls, singer Sir Tom Jones and former Strictly Come Dancing professional Oti Mabuse will also make an appearance via video.",
        "The series of pre-recorded sketches will reveal little-known facts about the monarch and will also include moments from beloved literary character Winnie the Pooh - seemingly echoing the famous moment Paddington Bear drank tea with the Queen during her Platinum Jubilee celebrations.",
        "Nigerian singer Tiwa Savage, DJ Pete Tong with his Ibiza Classics project, and winner of The Piano TV talent show, 13-year-old Lucy, will also perform.Mr Tong revealed the King specifically requested Ibiza classics songs as part of his coronation concert.The BBC Radio 1 DJ, who has been tasked with delivering the King's wish at the event being held on Sunday evening, said he hopes it will be a 'brilliant' way to start the show in the grounds of Windsor Castle.Backstage ahead of the event, Tong said: 'He wanted Ibiza classics, that was very specific.",
        "'And then they asked us to suggest a couple of songs so we suggested three or four, and he came back with one of them and that's the one that's starting the show, so they very much had an involvement in what they wanted us to perform.'Asked why he felt this genre was among the playlist requests, he added: 'I think they want to put across a big variety of UK talent and touch all different demographics and be relevant to different age groups.'I mean, the shows we do we literally get kids up to pensioners. Relapse ravers, we call them - so maybe there's a few relapsed ravers in the royal household, we don't know.'Meanwhile, fashion designer Stella McCartney will deliver a spoken word performance with a conservation theme which will reflect her and the King's 'shared passion for environmental sustainability', the BBC has said.Her performance will be part of a broader nature-themed section of the concert which will also include a rendition of a 1980s hit by classical-soul composer Alexis Ffrench and London-based singer-songwriter Zak Abel alongside a house orchestra, band and choir.Gareth Malone has said he hopes he can redeem himself during the Coronation Concert after he suffered a major technical issue when he performed in front of the King during a Royal Variety Performance.",
        "The choirmaster will conduct the 300-strong Coronation Choir during the celebratory event on Sunday evening in the grounds of Windsor Castle.Speaking ahead of the event, Malone said: 'I performed at the Royal Variety Performance in front of the then-Prince Charles and my backing track went completely wrong and so the whole thing fell apart and it was the worst ever performance I've ever had in my whole career.'For years I wouldn't use any technology and I'm hoping that I'm going to lay that ghost to rest this very night.'Malone, along with Amanda Holden, Rose Ayling-Ellis and Motsi Mabuse, were part of a celebrity coaching line-up who mentored the choir ahead of their performance.Holden and Malone revealed they drove around Croydon in London as they considered a number of options including classical songs and Disney tracks, before deciding on Emeli Sande's Brighter Days.'It was a long, long list but it had to be a song that was about hope and about the future,' Malone said.Bollywood star Sonam Kapoor will also deliver a spoken-word performance.The Royal Ballet, the Royal Opera, the Royal Shakespeare Company, the Royal College of Music and the Royal College of Art will come together for the first time to create a one-off performance featuring Sex Education and Doctor Who star Ncuti Gatwa and Olivier Award nominee Mei Mac.Former Desert Island Discs and Crimewatch presenter Kirsty Young will anchor the special live broadcast of the concert in the grounds of Windsor Castle after reporting from a studio at Buckingham Palace on Saturday's coronation day.The concert on the castle's East Lawn will also see TV presenter Clara Amfo and Diversity dance troupe member Jordan Banjo speaking to the artists backstage.Classical acts including Andrea Bocelli, Welsh bass-baritone Sir Bryn Terfel and Chinese pianist Lang Lang are also on the bill.Lang said it was a 'tremendous honour' to be on the bill with 'many great artists from different parts of the world to celebrate music and love for music'.Reflecting on how the coronation was viewed in China, he added: 'It's a big country and people have different opinions but I think from what I see from the media, it's basically quite positive from the media.'There's a lot of pictures from it and they talk about it a lot because of the music so I would say overall it was a positive feedback.'Rendered images released last month revealed that the concert will feature a Union flag-shaped stage which fans out to the audience.The stage will also have a halo-like screen surrounding the roof, which the BBC said will 'symbolise the Crown protecting the nation'.Together with the parapet wall steps in the middle, the broadcaster said the staging creates multiple levels for the 74-piece classical ensemble - formed from the strings of the Countess of Wessex's String Orchestra and woodwind, brass and percussion sections from the Bands of the Household Division - to make an abstracted Union flag.There are four additional catwalks, which also form the flag shape, so fans can see acts close up.Some of the 20,000 audience members have told of their excitement ahead of the concert.Take That superfans Dawn Fenwick and Sian Gould are excited to see the group perform at Windsor Castle.Ms Fenwick has been taking her daughter Ms Gould to Take That concerts since she was a child.The pair travelled from High Wycombe to see one of their favourite groups and to try and see the royal family dancing along.Ms Fenwick said: 'I'm looking forward to seeing Charles having a bop.'Being a part of it is why we are here. It's a shame it's not the full five (members of Take That).'Faatimah and Hafsah Malik took the short journey from Slough to the coronation concert. The pair were excited to watch Katy Perry and to try and catch a glimpse of the King.Hafsah Malik said: 'I would like to meet them. This is a once in a lifetime opportunity. It was really shocking to win the tickets.'I love Kate. She has a really beautiful style. It's very simple but elegant.'Faatimah Malik met King Charles when he was still a Prince on a visit in Birmingham and she has come to Windsor to try and see him again.Sarah Edwards travelled with her daughter Charlotte from Ipswich for the concert.The journey took them more than two hours.Sarah said: 'We watched all the coronation on TV yesterday. It made us really excited to be here today. I think it's a big part of history for my daughter to be a part of.'I'm really excited to be part of such a big day.'",
        "Earlier on Sunday members of the royal family attended several of the thousands of Big Lunch events taking place across the UK to celebrate the Coronation. The Prince and Princess of Wales stunned crowds during an unannounced walkabout. William and Kate greeted those who had made the trip to Windsor Castle's Long Walk, shaking hands and chatting to revellers in some welcome sunshine after a rainy Coronation day.The heir to the throne divulged that his father was suffering from a sore neck from wearing the 22-carat gold crown which had to be carefully adjusted by the Archbishop of Canterbury to ensure it didn't topple off his head.Speaking to one group of fans, the prince said: 'I think his neck hurt last night, having the crown…it does weigh a hell of a lot.'The St Edward's crown, worn upon the exact moment of coronation, was one of two that the King had placed on his head yesterday - the other being the Imperial State Crown which weighs considerably less at around 2.2lbs.A delighted William was also handed a can of Coronation ale as tens of thousands of royal fans descended on Windsor ahead of tonight's concert which will see pop icons Lionel Richie, Katy Perry and Take That perform in a star-studded bash.At one point, Kate, wearing a pale blue blazer and white top, picked up a small union flag on a stick which had fallen on the floor and handed it to the well-wisher who dropped it. She also comforted a little girl who was overwhelmed to meet her. Alongside the thousands of smaller street parties expected to be held at the weekend, people are encouraged to come together across the country for the Coronation Big Lunch.In Cranleigh, the Duke and Duchess of Edinburgh joined residents and representatives from the Royal British Legion, the Scouts and the Guides - of which Sophie is president.Elsewhere, the Princess Royal and Vice Admiral Sir Tim Laurence visited a community street party in Swindon, and Princess Beatrice and Princess Eugenie joined a big lunch in Windsor."
    ]
}