{
    "articleURL": "/news/royals/article-12044135/Big-Ben-beacon-King-Charles-colourful-rehearsal-coronation-Saturday.html",
    "content": [
        "As tower is lit up, more projections planned for sunset for the rest of the weekPoignant messages appear across 96m tower, including national anthemIn tribute to the UK's four nations, it is projected with images of national plants Big Ben has been lit up in a colourful tribute to the King as preparations for this Saturday's Coronation get into full swing.",
        "The nation's most famous landmark turned red and blue, with poignant messages projected on to the 96m tower.More stunning images will be projected at sunset every day for the rest of this week between 8.30pm and 11pm, including on the evening of the Coronation.The Department of Culture, Media and Sport showed off the amazing transformation on Twitter, saying: 'Big Ben looking spectacular as it gets ready for the weekend’s Coronation celebrations, with projections set for sunset tomorrow, Saturday and Sunday.'At one point images of the national plants of England, Scotland, Wales and Northern Ireland - the rose, thistle, daffodil and shamrock - were projected on to the 160-year-old building.",
        "The clock tower sweeps from blue to red, while the letters and images are picked out in white - the colours of the Union Jack. Another frame shows the words of the national anthem wrapped around the tower, while a third reveals the flowers surrounding the words 'Happy and Glorious'.A further image shows the touching phrase: 'Long may he reign.'The projection culminates with the Coronation emblem, designed by Sir Jony Ive, a British product designer and chancellor of the Royal College of Art.The projections snaked on to the Elizabeth Tower, with the flowers and plants blooming on the side of the historic landmark.",
        "The King is known for his love of nature and the environment.When the invitations for the ceremony were sent out last month, they were adorned with images of flowers, birds, insects and the Green Man - while the royal couple's thrones are being re-used rather than made new, as would be customary.The Princess of Wales is even set to wear a floral headpiece instead of a tiara, while an ornate, three-sided screen shielding Charles as he is anointed King depicts a tree with 56 leaves representing the Commonwealth nations.",
        "A five-year restoration on Big Ben was completed in April last year, with the tower and the clockwork and bell mechanism within it undergoing the biggest repair and conservation project in the building's history.The bell at the famous London landmark was barely rung and the tower was covered in scaffolding, which was removed in late 2021 to reveal a view of the clock face's restored original paint colour.The clock was designed and installed in 1859 with the aim of creating the most accurate public timepiece in the world.The last extensive conservation work on the Unesco World Heritage landmark was completed between 1983 and 1985.The tower was designed by architects Charles Barry and Augstus Wellby Pugin - although it is said there has been a clock tower on the site since the 1290s.",
        "Having ascended to the throne in September 2022, following the death of Queen Elizabeth II, King Charles III will be officially crowned as the reigning monarch of the United Kingdom on Saturday.It will be the first coronation of a British monarch in well over half a century, after the late Queen enjoyed a 70-year reign.",
        "The ceremony will begin at 11am, once the royals have completed their procession from Buckingham Palace. Huge crowds are expected to line the streets of London to catch a glimpse of the royals.In the afternoon, after the King returns by the same route, the Royal Family will gather on Buckingham Palace's balcony for a fly-past.Some of the keenest fans of the monarchy got there early to beat the last-minute rush for the prime spots along The Mall. Royal super-fans waiting for the Coronation have already been camped near Buckingham Palace for nearly a week ahead of the big day on Saturday.They include a retired chef who waited for a month for the birth of Princess Charlotte and a carer from Newcastle.John Loughrey, 68, arrived to stake his claim to a front-row position on April 27 and was later joined by Maria Scott and Patrick O'Neil who flew in from Belfast. Mr Loughrey, from Streatham, south London, is no stranger to camping out overnight for royal events. He spent a month outside a London hospital waiting for the birth of William and Kate's daughter Charlotte. ",
        "The first chiming clock was installed on the site of Big Ben in 1367, although this was pulled down after falling into disrepair and was replaced with a sun dial in 1698.After the Palace of Westminster was almost completely destroyed by fire in 1834, plans for the Big Ben we know today were put in place and the foundation stone was laid in 1843.Construction finally finished in 1859 - and the bell tower was renamed the Elizabeth Tower to honour the late Queen's Diamond Jubilee."
    ]
}