{
    "articleURL": "/news/article-12043507/Royal-glovemaker-reveals-late-Queens-195-favourite-pair-NEVER-wore-leather.html",
    "content": [
        "Royal Warrant holder Cornelia James made gloves for the late Queen ElizabethThey have also supplied royals such as Princess Diana and the Princess of Wales The roar of the engine must have been deafening as a powerful BMW motorbike sped toward Buckingham Palace. No wonder security was sceptical about whether its rider was a bona fide visitor.",
        "'It's an emergency, I've got to get these gloves through for Her Majesty The Queen!' shouted the biker.'Yes, Sir, of course you do,' came the sarcastic reply.It took several minutes of touch-and-go negotiation before he was allowed inside, much to the relief of Queen Elizabeth's dressers.It was 1999 and the late monarch was about to embark on a high-profile state visit to South Korea. But as her staff went to pack her cases, they discovered a vital component of her wardrobe was missing: her iconic white gloves.",
        "Urgent investigations discovered that a whole new order had gone astray in the post.With just a day's notice, the team at Royal Warrant holder Cornelia James worked round-the-clock to rustle up a set of pristine replacements.But the only way to get them to the Palace in time was for head designer Genevieve James's husband Andrew Lawson to 'roar off heroically' from their office on a sheep farm in Sussex with the precious gloves strapped to the back of his bike.'Truthfully, the only reason they let me in was because the sergeant on duty wanted to know how fast my bike could go — but thank God he did,' Andrew admits.Cornelia James likes to go the extra mile for its clients, whose gracious hands include everyone from model Claudia Schiffer to singer Madonna. But it is best known for dressing Queen Elizabeth and other senior royals.",
        "Genevieve is far too discreet to say whether she is making gloves for the future Queen to wear at the Coronation on Saturday, but they will no doubt be worn by a number of high-profile guests.The team has been 'inundated' with orders for formal gloves and has even been commissioned by stylist Bailey Moon to make a pair for U.S. First Lady Jill Biden, who will be representing her husband at Westminster Abbey.'We never know if our clients will actually wear them until the day, but it's all very exciting,' says Genevieve.'Gloves are the finishing touch to any outfit and it's wonderful that a new generation is discovering that now.'The company was started by her mother — the eponymous Cornelia — who fled Vienna on a false passport in 1937 to escape the Nazi annexation of Poland.Family legend has it that she took just a suitcase full of coloured leather because she knew she wanted to continue her glove-making when she reached the UK.She set up her design business in 1946 — a bold move for a young woman at a time of wartime rationing — creating leather gloves in a rainbow array of bright colours.'People couldn't afford new clothes, but ladies would save up their coupons for a pair of emerald-green gloves as it would spruce up an old outfit,' says Genevieve.",
        "Vogue magazine was soon calling Cornelia the 'colour queen of England'. She got her big break after catching the eye of leading designer Norman Hartnell, who went on to design Princess Elizabeth's Coronation gown.'My mother became his muse and when Princess Elizabeth got married Hartnell asked her to make a trousseau of gloves for her honeymoon. Everything took off from there,' Genevieve says.From society figures to suburban housewives saving up for a special splurge, women in the 1950s couldn't get enough of Cornelia James gloves.There wasn't a member of the Royal Family who didn't own at least several pairs: Queen Elizabeth, obviously, but also the Queen Mother, Princess Margaret, Princess Anne (when she was older) and Princess Alexandra.Cornelia would go on to make gloves for Princess Diana, the Duchess of York, and eventually the Duchess of Cambridge — now the Princess of Wales — as well as Princesses Beatrice and Eugenie.Securing Diana as a client was down to Cornelia's particular brand of chutzpah, Genevieve reveals.",
        "She met the Princess at a garden in party in 1986 and bluntly asked why she rarely saw her wearing gloves.A few days later, Cornelia received a call from Diana's office asking if they could make a bespoke — and very glamorous — pair of elbow-length gloves to complement a stunning Murray Arbeid dress she intended to wear for a function at Claridge's in London.",
        "Cornelia made the gloves in bright pink. Diana was a style icon — and the pictures went round the world.That was a high point. The low came in the late 1960s when gloves fell out of fashion. Her mother always blamed model Jean Shrimpton, who — rather scandalously — turned up to the Melbourne races without stockings or gloves.'Everything changed overnight,' says Genevieve. 'Fortunately, my mother had grit and diversified into scarves, belts and other accessories, even swimsuits. She kept ploughing on.'Gloves, however, remained de rigueur for the royals. In 1979, Cornelia secured a coveted Royal Warrant as Glove Manufacturer to Her Majesty The Queen, one of the proudest moments of her life.The Queen was always very particular in her choice of gloves, a favourite being Regina (which now cost £195 a pair) in white 'sueded cotton'. Genevieve won't discuss Her Majesty's size, even though she has passed away, saying: 'I'm just not allowed to say anything too personal about her, it's an absolute no-no as a Royal Warrant holder.'But she does concede that the Queen was very loyal to the brand and had around 40 pairs of Cornelia James gloves, all in a special size and length so as not to show any skin.'Her taste never really wavered over the years despite the ebbs and flows of fashion,' Genevieve says.",
        "'The Queen simply loved her gloves, not just practically, because she had to shake hundreds of hands every day, but they were part of her style.'Existing warrant holders for HM Queen Elizabeth are able to retain the accolade for two years after her death, but the team at Cornelia James has no idea yet whether it will be honoured by another senior royal.The company was making gloves for Her Majesty right until the end of her life, even providing her with new pairs for her Platinum Jubilee last year.'But she never threw anything away,' says Genevieve. 'In some of her most recent photographs she was wearing pairs of gloves we had made for her back in the 1960s. These are products made for life and she was most definitely the make-do-and-mend generation.'Cornelia herself died in 1999, after which Genevieve and her husband took on the business. They decided on a new direction, however, ditching the accessories and focusing on what they do best — gloves — by embracing the internet and taking the brand online. The business has never looked back.The Queen remained loyal, allowing Genevieve to keep her mother's coveted Royal Warrant as they moved to a former dairy cow shed on a farm in Ripe, East Sussex, with views of the rolling South Downs.",
        "What happens there is an enchantingly traditional process, undertaken by a team of around 12 seamstresses.The gloves are cut using a manually-operated lever press made by a Somerset firm more than 100 years ago. Eight feet of stitching goes into each pair, worked with Singer sewing machines and a buttonhole maker purchased from Germany in 1957.When the gloves are sent out, hand-wrapped and boxed, they are accompanied with a tag bearing the name of the 'girl' who made them. It was a tradition started by Cornelia that Genevieve adores.",
        "'They really are a labour of love,' she says.Partly thanks to TV shows such as The Crown and Bridgerton — both of which are supplied by Cornelia James — a new generation of young fans and brides are now snapping up their products.That includes the new generation of the Royal Family. The Princess of Wales first wore a pair to Remembrance Sunday in 2012, which prompted a flurry of interest worldwide.She now has several dozen: from £135 merino wool 'Imogen', featuring a jazzy little bows ('warm but stylish'), to the £180 fur-trimmed 'Clementine', which she sported on an official tour to Oslo, Norway, as well as £135 'Beatrice' and £235 silk gloves for state banquets.The future Queen has even followed in her predecessor's footsteps by purchasing several pairs of 'Reginas' in grey and parchment.'The Princess of Wales has all these designers making beautiful clothes for her, so she should have lovely gloves as well,' says Genevieve. 'It makes the look so polished.'Alas, there was one little recent hiccup. Catherine had put in a last-minute order for gloves as she and William prepared to travel to the U.S. just before Christmas — a pair of £180 'Charlotte' in cognac.The well-known courier firm Genevieve had opted for owing to the postal strike — bizarrely — claimed its courier couldn't deliver because there was a rubbish truck in the way, so the gloves failed to arrive.If only her husband had been able to roar up to London again on his motorbike and save the day."
    ]
}