{
    "articleURL": "/femail/article-12058635/The-closest-divorc-es-Sarah-Ferguson-fulfils-promise-stand-Andrew.html",
    "content": [
        "Duchess of York wasn't invited to King Charles' Coronation on SaturdayCORONATION LIVEBLOG: Click here to follow live updates throughout today They've been divorced for over 27 years now - but that hasn't stopped Prince Andrew and Sarah Ferguson from maintaining an exceptionally close relationship.",
        "Although the Duchess of York wasn't invited to King Charles's Coronation on Saturday, the mother of two was welcomed back into the royal fold at the live concert in Windsor last night.  The ex-husband and wife - who were married for ten years - put on a friendly display in the royal box as they watched the musical extravaganza in the grounds of Windsor Castle.Despite the controversy surrounding their separation in 1996, the proud parents still live together in Royal Lodge in Windsor and even look after the late Queen's corgis Muick and Sandy.In 2018, Sarah told the Daily Mail: 'We're the happiest divorced couple in the world. We're divorced to each other, not from each other [...] My duty is to him. I am so proud of him. I stand by him and always will. The way we are is our fairytale.'",
        "Here FEMAIL takes a look back at how Prince Andrew and Sarah Ferguson have become the closest ex-couple in the Royal Family's history.Marriage and unconventional divorcePrince Andrew and Sarah Ferguson's relationship goes all the way back to 1963.Ahead of their 1986 wedding, Sarah's parents told the Washington Post that the pair were only three years old when they met at a polo match their fathers were both participating in.As well as playing with Prince Philip, Sarah's late father Ronald Ferguson was also the polo manager for King Charles too.  ",
        "However, it was Princess Diana who was responsible for reintroducing Andrew and Sarah in the 1980s.In their engagement interview, Prince Andrew joked that him and Sarah were 'made to sit next to each other' at a party hosted by the Queen during Royal Ascot in 1985. He said: 'It was at Ascot, as it were, that the whole thing took off.'",
        "Three months after their engagement was announced, Sarah and Andrew married at Westminster Abbey in July 1986.Speaking to Piers Morgan in 2011, Sarah said: 'We married for total love. And when I went up that aisle, I had... I married my man.'The couple had their first child Princess Beatrice in August 1988 and Princess Eugenie followed in March 1990. However, the couple legally separated just two years later. At the time, Sarah cited Prince Andrew's naval commitments as the reason the marriage broke down.She told US presenter Ernie Manouse in 2010: 'My deal was that I was marrying my man, who happened to be a prince and a naval officer. 'But what I got was not the man, I got the palace and didn’t get him... and the courtiers told me I had to go to Buckingham Palace and he had to go to sea. For our marriage, I saw him 40 days a year.'",
        "That year, photos of the royal's financial advisor John Bryan sucking Fergie's toes on holiday made headlines around the world.The notorious photographs were taken in August 1992 at a secluded private villa in the South of France, a few months after the Duchess of York had officially separated from Prince Andrew.'The attraction was mutual – and instant,' he told MailOnline last year. 'I loved her then and I adore her now. In 1996, Andrew and Sarah divorced - with the Duchess claiming that she had taken this decision so she could pursue a career independent of the Royal Family.Speaking to Harper's Bazaar, Sarah explained: 'I didn't want a divorce but had to because of circumstance'I wanted to work; it's not right for a princess of the royal house to be commercial, so Andrew and I decided to make the divorce official so I could go off and get a job.'The Duchess of York has since gone on to publish 46 books - including her most recent novel A Very Intriguing Lady.'Fairytale' Friendship ",
        "While they were married, Sarah and Andrew lived in Sunninghill Park in Ascot with their daughters.In 2004, Prince Andrew moved into the 30-room Royal Lodge on the Windsor estate - with Sarah joining him in the grounds four years later. ",
        "Speaking to The Sunday Times last year, Sarah explained: 'I travel a lot and I’ve always been able to make wherever I am home. If I am staying in a hotel I have the same family photographs and scented candles around me.'When I’m in the UK I’m lucky enough to stay at Royal Lodge. I wouldn’t call it my home as that would be presumptuous.'In 2010, Sarah opened up about her regrets over her relationship with Andrew.She said: 'Both Andrew and I… both of us say now if we could go back we would definitely play it differently and we should have learnt how to play the chess game differently.'And maybe we have still been together because we would have said no to being separated just after our wedding.'In 2014, the couple purchased a £13million ski chalet in Switzerland. However, Prince Andrew reportedly sold it for £19million last year as he was wrangling over a '£1.6million business debt'.Opening up about how they've been able to maintain a close relationship in the wake of their split, Sarah told the Daily Mail in 2018: 'The Yorks are a united family. We’ve shown it. You saw it at the wedding. ",
        "'My duty is to him. I am so proud of him. I stand by him and always will. The way we are is our fairytale.'",
        "What's more, Sarah said that their close living arrangements mean they still enjoy daily catch-ups.She added: 'We sit round the table and have afternoon tea together. It’s a very important part of our lives.' Although the couple share the same residence, Sarah previously said they have separate rooms and live on different sides of Royal Lodge. Sarah has also previously said the couple 'never really left each other' while being interviewed on Australian radio.Last year, the Duchess was questioned about the possibility of a romantic reunion with Prince Andrew during an appearance on Loose Women.She simply replied: 'Andrew and I remain steadfast. In the past, we've been co-parenting, and now we're co-grandparenting [...]'He is so good with August. It's a joy to be able to spend time as a family.' Jeffrey Epstein controversyIn recent years, Prince Andrew has stepped back from royal life due to the scandal surrounding his friendship with Jeffrey Epstein.",
        "Last February, it was announced that Prince Andrew had settled out of court with Virginia Roberts - who alleged she was forced to have sex with the duke three times when she was 17 under the orders of the late paedophile Jeffrey Epstein.Throughout the controversy, Sarah Ferguson has come out several times to publicly support her ex-husband.",
        "Following the duke's Newsnight interview with Emily Maitlis in November 2019, Sarah wrote on Instagram: 'It is so rare to meet people that are able to speak from their hearts with honesty and pure real truth, that remain steadfast and strong to their beliefs.'Andrew is a true and real gentleman and is stoically steadfast to not only his duty but also his kindness and goodness of always seeing the best in people.'I am deeply supportive and proud of this giant of a principled man, that dares to put his shoulder to the wind and stands firm with his sense of honour and truth.'For so many years he has gone about his duties for Great Britain and The Monarch. It is time for Andrew to stand firm now, and that he has, and I am with him every step of the way and that is my honour.",
        "'We have always walked tall and strong, he for me and me for him. We are the best examples of joint parenting, with both our girls and I go back to my three C's... Communicate, compromise, compassion.'The duchess has consistently defended her ex-husband and branded him a 'thoroughly good, very gentle man' who 'shines' as a grandfather during an appearance on Lorraine in August 2021.'Prince Andrew is just such a good man, he's a really thoroughly good man,' she said during the TV interview.'He's a very gentle man, he's a really good father and we did co-parent very well, hence the reason our girls are very solid and have their feet on the ground. But now as a grandfather he's really good, he can go for hours talking about football, and those things. It's a joy to see him really shine as a grandfather.'Earlier this year, MailOnine revealed Prince Andrew should be slung out of his grace-and-favour mansion unless he agrees to pays more than the £250-a-week peppercorn rent he is reportedly being charged.In an interview with Hello, Fergie said she feels 'really pleased and proud' to support Andrew 'through her work' because he 'doesn't take taxpayers' money' having stepped back from royal duty. She explained: 'I'm in a position where I can support him and the rest of the family through my work. And I’m really pleased and proud to do that.' Queen's corgisPhilip studiously avoided the duchess since surreptitiously taken photographs of her sunbathing topless were published in 1992. The duchess’s toes were being sucked by American financial manager John Bryan at the time.",
        "But despite recently describing her late father-in-law as 'terrifying', the Queen left her beloved corgis to Sarah and Andrew following her death in September 2022.To mark her 63rd birthday in October, Sarah branded Sandy and Muick the 'present that keeps on giving'.Shortly after the Queen's death, the duchess said that being asked to take care of Sandy and Muick has been a 'big honour', according to The Telegraph.Speaking at the Henley Literary Festival, Sarah said that she's well aware that the two new additions to her household are 'national treasures' who have been 'trained well'.As Sarah and Andrew already shared five Norfolk terriers, the two corgis have had to integrate with them.",
        "She said: 'They all balance out, the carpet moves as I move but I’ve got used to it now.'The dogs had been a gift to the Queen from Andrew and his daughters Princess Beatrice and Eugenie following the death of the Duke of Edinburgh.On Saturday, the Duchess of York congratulated the newly crowned King and Queen on social media. She marked the moment on Instagram, sharing a sweet snap of the royal couple from the day's celebrations.She posted a picture of King Charles and Queen Camilla waving at royal fans as they left Westminster Abbey with a short and sweet message of congratulations. Sarah wrote: 'Sincerest congratulations to Their Majesties, the King and Queen.' "
    ]
}