{
    "articleURL": "/health/article-12060479/Do-really-need-taking-statins-DR-MARTIN-SCURR-answers-health-questions.html",
    "content": [
        " READ MORE: Has Covid created a generation of germaphobesI’ve been taking statins for over 30 years. I am now on my fourth type, as each one causes me bad side-effects. How important is it that I take them?",
        "Name and address supplied.This question will be of interest to many of the eight million people in the UK who take statins to lower their cholesterol.Cholesterol, a natural fatty substance in your blood, is important for the functioning of many processes in the body (for example, it’s used by skin cells to make vitamin D from sunlight). However, high levels increase the risk of heart disease and stroke by contributing to fatty deposits in artery walls.Despite the benefit of statins, as many as one in two people reduce their dose or stop taking them because of the side-effects, such as muscle pain and constipation.",
        "However, a study of four million patients, published in the European Heart Journal last year, suggested the true prevalence of side-effects is likely closer to 10 per cent. Other research suggests muscle pain, for example, may be a result of ageing rather than the medication.It is difficult for me to advise whether statins are essential for you without knowing all your risk factors for heart disease (such as age, ethnicity, blood pressure and family history, for instance). You say in your longer letter that your cholesterol is 7mmol/l, which is above the recommended limit of 5, and you are also pre-diabetic.The fact that you eat healthily is helpful, but it’s unlikely that this lowers your cholesterol enough. That’s because most cholesterol is made in the liver and a host of factors, including genes, determine how much the body makes.",
        "There are other medications that lower cholesterol. One possible option for you is the drug ezetimibe, which can be prescribed alone or in combination with a statin. While statins work by suppressing cholesterol production in the liver, ezetimibe lowers cholesterol absorption in the intestine. But it, too, has potential side-effects, such as stomach pain.Another option is a new class of drugs called PCSK9 inhibitors — these work by inhibiting a protein (PCSK9) in the liver that breaks down receptors that ‘bad’ LDL cholesterol latch on to. The more of these receptors that you have, the lower your LDL.The two PCSK9 inhibitors currently available are only prescribed for patients unable to take a statin or to control their cholesterol with ezetimibe. They’re given by injection every two to four weeks, but they, too, have potential side-effects: 1-10 per cent of patients get flu-like symptoms for a day or two after the injection.PCSK9 inhibitors have to be prescribed by a cardiologist or in a lipid treatment clinic, and so you would need to request a referral via your GP. But do persist with finding a treatment that works for you, as the health benefits of lower cholesterol could be significant.My father experiences pain in his toes when the weather is cold, and they can be purple, swollen and sore to touch. What do you think is the problem?",
        "Hayden Wan, Glasgow.I believe your father has chilblains, a complaint that affects 10 per cent of people at some point.They’re triggered by exposure to cold or damp air: as the skin warms up, small, itchy, red or purple swellings can develop. These swellings can be painful and blister.They occur when the small arteries near the surface of the skin become narrow when it’s cold; they then widen as warmth returns but in some people, if the skin warms too quickly the blood vessels can’t handle the increased blood flow. The blood leaks into nearby tissue, causing the symptoms associated with chilblains.While the toes are the most common site, in fact any of the body’s extremities — fingers, heels, ears, nose — can be affected.Chilblains can last for months, especially in the UK, thanks to our damp, cold weather. While they normally clear at this time of year, they can persist through summer as any sudden cooling or heating can trigger them. Even walking barefoot on cold floors can be a trigger, so I’d recommend wearing socks and warm slippers at home.Smoking and vaping significantly increase the risk as they constrict blood vessels, so if your father is a tobacco user, stopping will help.Soothing lotions based on witchhazel can help with itching, but it may be worth asking his GP about the drug, nifedipine. Taken as a daily tablet, it works by relaxing the blood vessels, improving circulation. But it does bring a risk of side-effects such as dizziness (as it lowers blood pressure), so I’d urge your father to focus on prevention. ",
        "Write to Dr Scurr at Good Health, Daily Mail, 9 Derry Street, London, W8 5HY or email: drmartin@dailymail.co.uk. Dr Scurr cannot enter into personal correspondence. Replies should be taken in a general context. Consult your own GP with any health worries.In my view: Setting the bar high for fellow doctorsEvery now and then I hear of something that reaffirms my faith in my profession.",
        "Last Saturday, an old friend was returning from a concert with his wife on a dark rainy night. As they walked back to their car, his wife — increasingly breathless — said that she was unable to continue and had to rest. Coming the other way was their GP.He sat her on a nearby bench, conducted a brief examination (in the dark and rain) and advised she see a cardiologist, stating that he would arrange it.On the Monday, he visited her at home and spent an hour conducting a physical examination. The patient was seen the following day by a cardiologist and full investigations are under way.The pity is it happened in Toulouse, France, where the couple have recently retired. Nevertheless, this is the kind of standard of care that we should aspire to."
    ]
}