{
    "articleURL": "/wires/pa/article-12050387/UK-housebuilding-weakest-May-2020-wider-construction-sector-grows.html",
    "content": [
        "UK housebuilding activity declined at the sharpest rate in almost three years in April amid weaker demand and higher mortgages rates, according to figures.",
        "However, the overall construction sector grew further as the decline in the residential market was offset by rising volumes of commercial and civil engineering activity.The latest S&amp;P Global/CIPS construction purchasing managers’ index scored 51.1 last month, lifting slightly from 50.7 in March.Any score below 50 is considered a decline, whereas anything above is seen as growth. With a further rate rise expected next week there will be concerns that things will get worse before they get better for UK housebuilders  John Glen  Tim Moore, economics director at S&amp;P Global Market Intelligence, said: “The construction sector stretched out its current phase of expansion to three months in April, signalling a modest rebound from the downturn seen at the turn of the year.“Commercial building work continued to outperform, helped by stabilising domestic economic conditions and a gradual rebound in business confidence.",
        "“Civil engineering activity was also a driver of construction growth during April, with rising infrastructure work contributing to the best phase of expansion in this segment since the first half of 2022.”Commercial building was the fastest-growing area of the sector, reporting a reading of 53.9, as firms reported that improved economic conditions boosted clients’ willingness to spend.Meanwhile, “resilient pipelines” of infrastructure projects helped to support continued growth in civil engineering.",
        "However, housebuilding had the weakest reading since the heavy impact of the Covid-19 pandemic in May 2020.Companies blamed delays on new projects as well as the impact of softer market conditions and higher mortgage rates due to interest rate increases.John Glen, chief economist at the Chartered Institute of Procurement and Supply (CIPS), said: “The sharp decline in UK housebuilding in April will be a cause for concern, as it becomes clear that the recent interest rate rises will continue to hamper consumer demand for some time to come.“With a further rate rise expected next week there will be concerns that things will get worse before they get better for UK housebuilders.”"
    ]
}