{
    "articleURL": "/wires/pa/article-12042493/George-Michael-Kate-Bush-Rock--Roll-Hall-Fame-inductees.html",
    "content": [
        "Missy Elliott, Willie Nelson, Sheryl Crow, Chaka Khan and the late George Michael have been inducted into the Rock &amp; Roll Hall of Fame, with Kate Bush also finally reaching the top of that hill.",
        "The Cleveland-based institution on Wednesday announced the artists and groups entering the hall as the class of 2023, including The Spinners, Rage Against the Machine, DJ Kool Herc, Link Wray, Al Kooper, Soul Train creator Don Cornelius and Sir Elton John’s longtime co-songwriter Bernie Taupin.“When you can go from Link Wray, who was one of the early influencers, to Missy Elliott and Kate Bush and The Spinners and Rage Against the Machine and Willie Nelson, you have a very diverse body of work,” said Joel Peresman, president and chief executive of the Rock &amp; Roll Hall of Fame Foundation ahead of the unveiling.",
        "Elliott, the first female rapper inducted into the Songwriters Hall of Fame, an MTV Video Vanguard Award recipient and a four-time Grammy Award winner, is the first female hip-hop artist in the rock hall, which called her “a true pathbreaker in a male-dominated genre”.Artists must have released their first commercial recording at least 25 years beforehand to be eligible for induction. Eight out of 14 nominees were on the ballot for the first time, including Crow, Elliott, Michael and Nelson. This is the first year of eligibility for Elliott.Bush was a nominee last year but did not make the final cut. She got in this year due to a new wave of popularity after the show Stranger Things featured her song Running Up That Hill (A Deal With God).",
        "The hall hailed her for “using lush soundscapes, radical experimentation, literary themes, sampling and theatricality to captivate audiences and inspire countless musicians”.Michael, first as a member of Wham! and then as a solo artist, was cited for “paving the way for a generation of proud LGBTQIA+ artists, from Sam Smith to Lil Nas X to Troye Sivan” and 90-year-old Nelson was simply described as “an American institution”.Crow was recognised for key 1990s songs like All I Wanna Do and Every Day Is A Winding Road, while Rage Against the Machine “forged brazen protest music for the modern world”.The hall called DJ Kool Herc “a founding father of hip-hop music” who “helped create the blueprint for hip-hop”, and Chaka Khan was described as “one of the mightiest and most influential voices in music” – a “streetwise but sensual hip-hop-soul diva” who paved the way for women like Mary J Blige, Erykah Badu and Janelle Monae.",
        "The Spinners became a hit-making machine with four No 1 R&amp;B hits in less than 18 months, including I’ll Be Around and Could It Be I’m Falling In Love. Rock guitarist Wray was said to be ahead of his time, influencing Jeff Beck, Jimmy Page, Eric Clapton, Jimi Hendrix and Bruce Springsteen.Taupin, who made it into the Songwriters Hall of Fame in 1992 and has a Golden Globe and an Oscar for (I’m Gonna) Love Me Again from the biopic Rocketman, makes it into the rock hall 29 years after writing partner Sir Elton.",
        "Cornelius was celebrated for creating a nationally televised platform for African American music and culture. He “became a visionary entrepreneur who opened the door — and held it open — for many others to follow him through”.“Does a Willie Nelson fan know anything about Missy Elliott? Probably not, and vice versa,” said Mr Peresman. “But this is an opportunity for someone who is into one of these artists to take a look at it and say, ‘Gee, I love Missy Elliott’ or ‘I love Rage Against the Machine. But The Spinners, who were they? Let me check that out’. If that can open some minds and open some attitudes, then we’ve done our job.”Nominees Iron Maiden, Cyndi Lauper, A Tribe Called Quest, The White Stripes, Warren Zevon, Joy Division/New Order and Soundgarden did not earn a spot in the hall this time.The induction ceremony will take place November 3 at the Barclays Centre in New York City.Nominees were voted on by more than 1,000 artists, historians and music industry professionals. Fans could vote online or in person at the museum, with the top five artists picked by the public making up a “fans’ ballot” that was tallied with the other professional ballots."
    ]
}