{
    "articleURL": "/wires/reuters/article-12060829/Webb-telescope-spots-three-debris-belts-luminous-star-Fomalhaut.html",
    "content": [
        "By Will Dunham",
        "WASHINGTON, May 8 (Reuters) - There has been plenty of excitement in recent decades about planets detected orbiting various stars beyond our solar system. But planets provide an incomplete picture of the complex framework that exists around stars, leaving out components like the belts of rocky and icy debris orbiting our sun.Scientists on Monday unveiled observations by the James Webb Space Telescope showing new details about such features around a luminous star called Fomalhaut in our own neighborhood of the Milky Way galaxy. These observations of three concentric dusty rings of debris orbiting Fomalhaut provide the fullest view to date of such structures outside our solar system.Fomalhaut, one of the brightest stars in our night sky and the brightest in the southern constellation Piscis Austrinus, is located 25 light years from Earth. A light year is the distance light travels in a year, 5.9 trillion miles (9.5 trillion km).Astronomers first discovered a single belt of debris around Fomalhaut in 1983. Webb's observations revealed two additional rings nearer the star - a bright inner one and a narrow intermediate one.These three belts appear to be populated by objects called planetesimals, some of which are thought to join together early in a star system's history to form planets while others remain as debris like asteroids and comets.",
        "\"Much like our solar system, other planetary systems harbor disks of asteroids and comets - leftover planetesimals from the epoch of planet formation - that continuously grind themselves down to micron-sized particles via collisional interactions,\" said University of Arizona astronomer Andras Gaspar, lead author of the study published in the journal Nature Astronomy.Fomalhaut is 16 times more luminous than the sun and almost twice as massive. It is about 440 million years old - less than a tenth the age of the sun - but is probably nearly halfway through its lifespan.The three nested belts extend out to 14 billion miles (23 billion km) from Fomalhaut, about 150 times the distance of Earth to the sun.While no planets have been discovered yet around Fomalhaut, the researchers suspect the belts were carved out by gravitational forces exerted by unseen planets. Our solar system has two such belts - the main asteroid belt between the rocky planet Mars and the gas giant Jupiter, and the Kuiper belt beyond the ice giant Neptune.The gravitational influence of Jupiter, our solar system's largest planet, corrals the main asteroid belt. The inner edge of the Kuiper belt, which is home to dwarf planets Pluto and Eris as well as other icy bodies of varying sizes, is shaped by the outermost planet Neptune.",
        "\"The secondary gap we see in the system is a strong indication for the presence of an ice giant in the system,\" Gaspar said.The observations from Webb, which was launched in 2021 and began collecting data last year, were made by its Mid-Infrared Instrument (MIRI).\"Nearly all of the resolved images of debris disks thus far had been for the cold, outer regions analogous to the solar system's Kuiper belt,\" like Fomalhaut's outer belt, said astronomer and study co-author Schuyler Wolff of the University of Arizona's Steward Observatory.MIRI now can resolve the relatively warmer belts of material analogous to our main asteroid belt, Wolff said.Studying these debris belts offers insight into planetary beginnings.\"Planets form within the primordial disks surrounding young stars. Understanding this formation process requires a complete understanding of how these disks form and evolve,\" Wolff said.\"There are many open questions about how the dust in these disks coalesces to form planetary embryos, how the planetary atmospheres form, et cetera. Debris disks are remnants of this planet formation process and their structure can provide valuable clues to the underlying planet population and the dynamical histories,\" Wolff added.(Reporting by Will Dunham, Editing by Rosalba O'Brien)"
    ]
}