{
    "articleURL": "/sport/cricket/article-12054395/Michael-Nesers-delivers-timely-reminder-Australias-selectors-stunning-HAT-TRICK.html",
    "content": [
        "Michael Neser took a hat-trick for Glamorgan against YorkshireThe Aussie bowler has not been named in the Ashes squad for the first two TestsNeser is still harbouring hopes he may feature in the series Amid all the clamour over the ethics of Steve Smith’s first foray into the County Championship this week, another Australian has undertaken some much more subtle pre-Ashes tuning.",
        "Michael Neser was not named in Australia’s 17-strong squad for next month’s first two Tests versus England, but has been told by chief selector George Bailey to be prepared for the final three when the tourists re-evaluate their personnel.It therefore might be significant that the first of that trio of matches is at Headingley, where until his spectacular entrance a few days ago, Glamorgan’s Neser had never played a first-class match.The 33-year-old immediately showed himself to be a thoroughbred horse for this particular Leeds course with a hat-trick in career-best figures of seven for 32, as Yorkshire folded for just 106 in perfect seam and swing conditions.Lingering doubts over Josh Hazlewood’s fitness, following an Achilles strain, mean a call-up may come sooner, but the Sheffield Shield’s reigning player of the year intends to be oven-ready should he be thrust straight into the heat of the Ashes.",
        "‘I would love to be part of that squad but Bails [George Bailey] was very clear where I stood and the scenarios in which I might come in,’ Neser told Mail Sport.‘He pretty much encouraged me to keep going because a spot might open up and at least if that does arise, I will have games under my belt.‘I don’t know if I am next in line but I will be sticking my hand up if something does come up.’",
        "Neser was a non-playing member of Australia’s tour party here four years ago, and has developed his skills bowling with the Duke’s ball on British pitches either side of his making his Test debut in the 2021-22 Ashes.His previous five-wicket haul in the Championship was also against Yorkshire two years ago - on that occasion in Cardiff he failed to convert a hat-trick opportunity - amongst a hugely impressive first-class record here of 72 victims at 21.65 runs each.So what has three seasons with the Welsh county taught a bowler who is quick enough rather than express in pace terms and very much in the traditional seamer’s mould?‘There’s a couple of things. 'Obviously, you can get such a different variety of conditions here in England,’ Neser continued.",
        "‘One day, we rock up and it’s nipping around and swinging, but then the sun can come out and it stops swinging and the pitch can then seem quite flat and nice to bat on, so you have to go through the tempos with the bat and with the ball, knowing when to hold and when to attack. ‘I guess length is key because as soon as you’re off it can be quite an easy place to score runs, especially square because your blocks are so big here and the ball races off them. ",
        "'So consistency is important.’If Neser maintains that particular discipline, do not rule out a similarly dramatic entrance from stage left to that of his Queensland and Glamorgan team-mate Marnus Labuschagne midway through the 2019 series."
    ]
}