{
    "articleURL": "/wires/ap/article-12044175/Michelle-Obama-works-new-company-child-nutrition.html",
    "content": [
        "WASHINGTON (AP) - Michelle Obama announced Wednesday that she has co-founded a new company to make and sell healthier food and drinks for kids, products that she says will be less detrimental to their long-term health because of their lower sugar and higher nutrient content.",
        "The former first lady's work with PLEZi Nutrition is an extension of her efforts to improve child nutrition when she was in the White House.\"I´ve learned that on this issue, if you want to change the game, you can´t just work from the outside,\" she said during a keynote address in New York at a conference on the future sponsored by The Wall Street Journal. \"You´ve got to get inside. You've got to find ways to change the food and beverage industry itself.\"\"So today, I´m proud to announce the national launch of a company designed not just to provide better products, but to jumpstart what I hope will be a race to the top that will transform the entire food industry,\" she said.Mrs. Obama said she is a co-founder and strategic partner of PLEZi Nutrition. She will work behind the scenes on its educational and philanthropic efforts, according to aides, who stressed that she will not be a spokesperson or public face of the company. It was unclear whether she put any money down to help launch PLEZi Nutrition or whether she will draw a salary.As first lady, Mrs. Obama sought through a White House initiative called \"Let's Move\" to improve the health of U.S. children by encouraging them to engage in physical activity and eat healthier food. She worked to improve federal nutrition standards for school lunches and extracted commitments from food companies and restaurant chains to cut calories, salt, sugar and trans fats in their meals.",
        "But she said Wednesday that kids still are not getting the recommended levels of nutrients and are eating and drinking too much added sugar, an average of 53 pounds per year. Sugary drinks are youngsters' main source of added sugar, she said, adding that nearly two-thirds of them have such a drink every day.PLEZi Nutrition, based in the District of Columbia, is a public benefit corporation, meaning that the for-profit company was created specifically for the public's benefit and will balance its profit needs with its mission to help improve child nutrition.Mrs. Obama also announced that the company is donating $1 million to an initiative by FoodCorps, a nonprofit organization that is working to help all 50 million students in the U.S. receive education about nutrition and free school meals by 2030. PLEZi Nutrition will also contribute 10 percent of its profits to the broader movement to improve child nutrition."
    ]
}