{
    "articleURL": "/wires/reuters/article-12038529/QUOTES-US-regional-banks-fall-FRC-failure-shakes-faith-banking-sector-recovery.html",
    "content": [
        "May 2 (Reuters) - Shares of major U.S. regional banks fell further on Tuesday in the aftermath of the collapse of First Republic Bank, the largest U.S. bank failure since the 2008 financial crisis.",
        "JPMorgan Chase &amp;amp; Co on Monday bought a majority of First Republic Bank's assets.Here is what analysts are saying about the sell-off in regional banks:JAKE DOLLARHIDE, CHIEF EXECUTIVE OFFICER OF LONGBOW ASSET MANAGEMENT\"If a 'confidence crisis' can happen to First Republic, it can happen to any bank in this country.\"\"First Republic bank failure means unfortunately that the other 'so called' troubled regional banks should probably continue to sleep with one eye open.\"TERRY McEVOY, BANKING ANALYST AT STEPHENS INC\"It's a continuation of fears that were ongoing from yesterday. Debt ceiling fears is also impacting markets overall today.\"JIM GRANT, AUTHOR OF GRANT'S INTEREST RATE OBSERVER:\"The immediate banking consequence of the suppression of bond yields has been to load up many banks, not just Silicon Valley, not just First Republic, with low-yielding securities that are now during crisis much less than par.\"\"These weigh heavily, depending on how they´re accounted for, in banking capital and liquidity, so I don´t think the resolution of First Republic marks the end of this by any means.\"\"I think the forces are in place to deliver (further) trouble in the world of banking. That´s going to spill over necessarily into monetary policy, into bond prices and stock prices.\"BRANDON PIZZURRO, DIRECTOR OF PUBLIC INVESTMENTS AT GUIDESTONE CAPITAL MANAGEMENT:",
        "\"It's been interesting to see how there was a sort of a complacency that took hold after it (FRC news). It felt like there wasn't going to be any continued spillover effects from those initial issues that cropped up in late march. We had JPMorgan taking over First Republic that seemed like was kind of maybe an end point for this whole drama. But then this morning, I suppose people woke up and realized that we still have another rate hike. We still have an increasingly weaker consumer and by and large, to assume that these complicated issues from a banking standpoint have been sorted out in their entirety is a somewhat early conclusion and I believe that's what people are waking up to today.\"Layoffs are starting to continue to take hold. First, we saw layoffs in the tech pace, and then you started seeing that happen in the banks and what you saw throughout the pandemic era was that banks had largely held off in laying people off because they needed people. You're starting to see some of these bigger banks and investment boutiques saying that they don't have the necessary work for this number of people that were employing.\"\"When you just kind of mix it into the ingredients of everything else that people are concerned about, it gives investors one more reason to hit the exits for the day at least. It seems to be just a good old-fashioned risk-off day.\"",
        "PHIL BLANCATO, CEO of LADENBURG THALMANN ASSET MANAGEMENT:\"The concern is it seems almost a guarantee that the Fed's going to hike 25 basis points tomorrow, and now the selloff in the banking sector is reflective of that much more pressure on any bank that has long-dated assets like the three banks that failed.\"\"But I'm of the view that it is a bit overdone simply because the market is reflecting lower interest rates now than we did a few months back. Some of the pressure on the balance sheets is better. The Fed programs of providing liquidity is working and some of the bigger banks like JPMorgan can step in when necessary to either buy or rescue a bank.\"\"Banks are somewhat reluctant to seek help because they're being faced with closure. We are in this sort of waiting period here. The reason why the market sold off is the threat of higher interest rates would make the situation worse, but I don't think that the threat is going to be a reality. I would hope that any bank that does source liquidity would not run into a scenario where it must close because the federal government has prudently either found a buyer or provided liquidity to make it work.\"",
        "\"There certainly are enough signs suggesting that interest rates, inflation, core inflation are all coming down, rents and wages still being a bit high. But the trend suggests to them that they're closer to the end of monetary policy tightening and probably one or two rate hikes to go tomorrow, maybe one more in June. Then I think we´ll get rather a significant relief rally. Nothing to the tune of adding 5% or 6% on the S&amp;amp;P 500 because we've come too far, too fast already.\"THOMAS HAYES, CHAIRMAN AND MANAGING MEMBER AT GREAT HILL CAPITAL:\"It's not what changed, it's what hasn't changed since the failure of Silicon Valley Bank and what hasn't changed is the executive branch, which has the power to do so, has not woken up to the fact that there needs to be an increased deposit insurance. Otherwise, you're gonna wind up with four to five major banks and the rest are going to be impaired if not consolidated. Until the executive branch steps up and does a temporary backstop of deposit or an increase in the insurance levels until Congress can actually pass a bill, you're gonna see this type of uncertainty around banks. Then you have the Fed tomorrow that has been tone-deaf to the message of the market for many months now.\"",
        "\"You can no longer blame management when the only common denominator is the Fed with the steepest hiking cycle in over 45 years. The message the market is sending today is the Fed needs to come out with the press conference and pause tomorrow, otherwise you're going to see continued turmoil in the in the banking system. Every 25 basis points they hike impairs the portfolios of banks. So the more they tighten the more banks are gonna get pushed into receivership.\" (Reporting by Jaiveer Singh Shekhawat, Niket Nishant, Medha Singh, Ankika Biswas and Sruthi Shankar in Bengaluru and Matt Tracy in New York; Editing by Shinjini Ganguli and Maju Samuel)"
    ]
}