{
    "articleURL": "/wires/pa/article-12050063/Thomas-Frank-convinced-Kevin-Schade-form-Brentford.html",
    "content": [
        "Thomas Frank is convinced one-time Liverpool target Kevin Schade will become a key player for Brentford.",
        "The Bees travel to Anfield on Saturday, with German international Schade still waiting for his first goal in England since a January switch from Freiburg.Attacker Schade moved to Brentford on an initial loan but is expected to make the transfer permanent in the summer despite previous interest from Liverpool.While the 21-year-old has failed to score in 15 appearances for the west London club and missed an open goal in a recent draw with Aston Villa, his manager has no doubts about his potential.“Kevin is a young player that needs a lot of development but he has shown very good signs of what he is capable of,” Frank said.“I am convinced he will be a very good player for us in the future. That is who we are. We need to develop players that can go to the next level and hopefully Kevin is one of them.",
        "“That would be a nice story (to score against Liverpool). I understand why he would have been linked with them. I think he would fit their style so I’m pleased he came to us.”Frank accepted had Liverpool “really, really” chased Schade he may have ended up on Merseyside, but the forward himself revealed in his interview with Brentford’s website upon signing earlier this year that he wanted to join a team where he would play.",
        "The Bees boss also feels it is a compliment if they are bringing in players tracked by top-six clubs.Frank said: “I think if Liverpool really, really went for him he would be out of reach for us.“On the flipside, when you go to a club you like to have a decent chance for getting playing minutes.“There is no doubt he needs playing minutes before he can go to the next level potentially, but of course it is nice we get players who are linked to other clubs because it also shows that other clubs can see the potential of the player.”Schade will aim to help Brentford secure a first ever double over Liverpool this weekend, but the Reds are currently on a lengthy unbeaten home run in the Premier League.Leeds were the last top-flight club to visit Anfield and win back in October, with Klopp’s side currently on a five-match winning streak in pursuit of an unlikely top-four finish.Frank has masterminded victories at Manchester City and Chelsea this season in addition to a draw at Arsenal in March, but knows the size of the task on Saturday.“Probably, when it is rocking, Anfield is the most difficult away ground to go to,” he said.“As we experienced last year, we lost 3-0 and it was a clear defeat so we have a mountain to climb on Saturday. Flipside is we also believe we can do something in any game.",
        "“We have confidence and we have belief, but we also know that Liverpool is a team that against Tottenham is 3-0 up after 13 minutes, against Man United, in such a big game, big rivalry, with everything at stake, they won 7-0. So we need to be absolutely on it.“We need a top performance from us to go there and win.”Frank has confirmed Christian Norgaard (Achilles) and Keane Lewis-Potter (knee) are unlikely to play again this season."
    ]
}