{
    "articleURL": "/wires/reuters/article-12045635/Germanys-Uniper-rides-gas-price-fall-quarterly-net-profit.html",
    "content": [
        "Strong net profit in Q1 as gas prices fall",
        "Also results in lower provisions for gas purchasesGas prices risks remainShares +6.5%(Recasts, adds details on results)By Vera Eckert and Christoph SteitzFRANKFURT, May 4 (Reuters) - German state-owned utility Uniper reported a first quarter net profit of 6.7 billion euros ($7.43 billion) on Thursday after releasing significant provisions it previously made in the wake of Moscow's move to stop gas supplies.Uniper is turning a corner thanks to markedly lower gas prices. It was bailed out by the German state last year after record losses incurred by making expensive gas purchases to replace curtailed Russian exports.Falling gas prices were the key driver behind the provision release, Uniper said, adding this improved the outlook relating to the replacement of gas from Russia, its former main supplier.\"However, we can't allow this success to make us forget that there are still risks in connection with gas replacement procurement,\" Chief Financial Officer Jutta Doenges said.\"Uniper's earnings in future quarters will continue to depend to a large extent on the level of costs for gas replacement procurement and thus on gas prices.\"Uniper had last year posted a first-quarter net loss of 3.1 billion euros, mainly due to impairments both on its majority stake in Russian division Unipro and a loan it provided to the collapsed Nord Stream 2 pipeline.",
        "Uniper maintained its expectations for positive group adjusted net income and adjusted EBIT in 2023, adding it still had 33.5 billion euros in equity and state-backed loans it could access should gas prices skyrocket again.Its shares were 6.5% higher.Uniper's main supplier Gazprom in late August had fully suspended gas deliveries via the Nord Stream pipeline, which was later damaged in an act of sabotage.Uniper, in which Berlin now owns 99%, operates Germany's first terminal for liquefied natural gas (LNG) at the port of Wihelmshaven, which can meet 6% of German gas demand. ($1 = 0.9022 euros) (Reporting by Vera Eckert and Christoph Steitz; Editing by Maria Sheahan, Sonia Cheema and Alexander Smith)"
    ]
}