{
    "articleURL": "/wires/pa/article-12045915/Serbs-urged-lock-guns-eight-killed-school-shooting.html",
    "content": [
        "Serbian police have urged people to lock up their guns after a 13-year-old boy used his father’s weapons in a shooting rampage that killed eight fellow students and a school guard.",
        "Thousands of people in Belgrade and other cities lined up to lay flowers, light candles and leave toys to commemorate the victims of the shooting that happened in a central district in the Serbian capital on Wednesday morning.Police said the teenager had planned the attack for a month, drew sketches of classrooms and made lists of children he planned to kill. The boy took two guns from his father’s safe and had visited shooting ranges with him, police said.Serbia is awash with weapons left over from the wars of the 1990s but mass shootings have been extremely rare – this is the first school shooting in Serbia’s modern history.“The Ministry of Interior is appealing to all gun owners to store their guns with care, locked up in safes or closets so they are out of reach of others, particularly children,” police said in a statement that also announced tighter controls on gun owners in the future.The shooting on Wednesday morning in Vladislav Ribnikar primary school also left six children and a teacher in hospital.One girl who was shot in the head remains in a life-threatening condition, and a boy is in a serious condition with spinal injuries, doctors said on Thursday morning.To help people cope with the tragedy, authorities announced a helpline and hundreds answered a call to donate blood for the victims.",
        "Serbian teachers’ unions announced protests to demand changes and warn about a crisis in the school system. Hundreds of students and their parents protested in front of the education ministry, demanding resignations.The killer, whom the police identified as Kosta Kecmanovic, has not given any motive for his actions.Upon entering his school, Kecmanovic first killed the guard and three students in the hallway. He then went to the history classroom where he shot the teacher before turning his gun on the students.Kecmanovic then unloaded the gun in the school yard and called the police himself, although they had already received an alert from a school official. When he called, Kecmanovic told duty officers he was a “psychopath who needs to calm down”, police said.Those killed included seven girls, one boy and the school security guard. One of the girls was a French citizen, France’s foreign ministry said.Gun culture is widespread in Serbia and elsewhere in the Balkans – the region is among the top in Europe in the number of guns per capita.Guns are often fired into the air at celebrations and the cult of the warrior is part of national identity. Still, the last mass shooting was in 2013 when a war veteran killed 13 people in a central Serbian village.",
        "While such attacks are rare, experts have repeatedly warned of the danger posed by the number of weapons in a highly divided country, where convicted war criminals are glorified and violence against minority groups often goes unpunished.They also note that decades of instability stemming from the conflicts of the 1990s as well as ongoing economic hardship could trigger such outbursts.“We have had too much violence for too long,” psychologist Zarko Trebjesanin told N1 television. “Children copy models. We need to eliminate negative models… and create a different system of values.”"
    ]
}