{
    "articleURL": "/tvshowbiz/article-12057533/Jock-Zonfrillo-dies-MasterChef-drops-Secrets-Surprises-tagline.html",
    "content": [
        "Channel Ten has dropped the tagline 'Secrets &amp; Surprises' from the new season of MasterChef Australia following the unexpected death of judge Jock Zonfrillo.",
        "Recent seasons of MasterChef are known to use taglines to highlight gimmicks or format changes, including Back to Win (season 12) and Fans &amp; Favourites (season 14).But 'Secrets &amp; Surprises' has been cut from all promotional material for season 15 out of respect for the Scottish-born celebrity chef, reports The Australian.Production company Endemol Shine is also working around the clock to scrub the new season of any references that could potentially seem insensitive in light of Zonfrillo's death.One insider said the changes made to the show 'won't be too heavy-handed' and will 'try to remain true' to Zonfrillo's personality.",
        "MasterChef's major sponsors, including Coles and Leggo's, have also said they will continue to support the program this year following Zonfrillo's passing. Season 15 had been due to launch on May 1 but it was pushed back to May 7. The decision to postpone the show was made by Ten just hours after the restaurateur was found dead by police at a Melbourne hotel at 2am last Monday.Ahead of Sunday's rescheduled season premiere, fellow MasterChef judge Andy Allen paid tribute to his co-star during a special episode of The Sunday Project.In his first interview since the shocking news, Allen, 35, sat down with Sarah Harris and spoke of the devastating impact of Zonfrillo's death.",
        "'I want to say I'm okay, but I am not great,' Allen told Harris. 'This has hit me like a ton of bricks. He's the heart and soul of this place... I'm just struggling to realise that he's actually gone.'Allen went on to say that being on the MasterChef set without Zonfrillo felt strange, before detailing the last time he saw him.Recalling their last lunch together, he said, 'We went to Tipo 00. He ordered the whole menu. We hadn't seen each other for a while. It was a good old catch-up about what we've been doing, what we were excited about.' Zonfrillo and his family had recently relocated to Rome, with the MasterChef judge flying back to Melbourne solo ahead of the show's premiere.",
        "Allen said Zonfrillo was eager to return to Rome and start a new life with his family.When asked what he would miss the most about his mate, Allen said: 'Everything. I probably spend more time - in the six months that we film - with him than my wife.'I am gonna miss everything that this guy has brought into my life... He couldn't wait for Alex and I to have kids as well. He always said I was gonna be a great dad. And I just wish he was around to see that.' "
    ]
}