{
    "articleURL": "/tvshowbiz/article-12040241/A-AP-Rocky-apologizes-fan-jumping-hotel-ahead-Met-Gala.html",
    "content": [
        "A$AP Rocky has apologized to the fan he jumped over before the Met Gala held at the Metropolitan Museum of Art in New York City.",
        "The 34-year-old rapper — who arrived fashionably late to the event with Rihanna, 35 — responded to a selfie shared by the fan after the incident and wrote on Twitter: 'LOL MY FAULT $WEETHEART'.Before hitting the red carpet with the mother of his children, the record producer had jumped over a barricade to get to the appropriate entrance of their hotel, The Carlyle. In the process, he accidentally used the fan's shoulder as support and knocked the glasses off of her face.'ASAP Rocky just literally jumped over me,' the starstruck fan had tweeted with an amusing close-up of her face.",
        "The record executive responded the next day and issued his virtual apology before following her on the social media platform.She then joked about the exchange with the Fashion Killa hitmaker and wrote back: 'I'm printing this on a T-shirt'.The day before, Rocky and Rihanna — who are currently expecting their second child together — made their show-stopping arrival at the event frequently dubbed fashion's biggest night.Rocky looked sharp in a black tuxedo jacket and a white button-up top teamed with a skinny tie.He donned a kilt over a pair of bedazzled denim jeans and accessorized with four different Gucci belts.He finished off the look with chrome-capped black boots and shielded his eyes from the flashing cameras with black sunglasses. ",
        "The Anti singer dazzled in an extravagant, white Valentino dress — reminiscent of a wedding gown — and a shawl adorned with camellia flowers.The couple hit the red carpet about two hours late after all of the other A-list attendees had made their arrival and even started to leave.",
        "Previously, the pair reportedly started dating in 2020 and welcomed their first child together — a baby boy — last May.While performing at the Super Bowl half-time show in February, Rihanna announced that they were expecting their second child by showing off her baby bump.This year, the theme of the extravagant and exclusive event was Karl Lagerfeld: A Line of Beauty. The late German designer — who passed away at the age of 85 in 2019 — was Chanel's long-time creative director. "
    ]
}