{
    "articleURL": "/wires/afp/article-12038979/White-House-not-negotiate-debt-ceiling.html",
    "content": [
        "President Joe Biden, the Republicans and the US economy were on a disastrous collision course Tuesday after the White House made clear it will not negotiate over extending the nation's debt limit.",
        "Treasury Secretary Janet Yellen warns that the government will run out of money and default on its debts as soon as June 1, if there is no authorization for more borrowing.That would mean inability to pay for everything from social programs to the military and -- in a cataclysmic blow to world financial markets -- the national debt.Congressional leaders have been invited to meet with Biden on May 9, next week.Republicans, who control the House of Representatives, insist they will only extend the debt limit if Biden first agrees to steep cuts in the federal budget. That, says the White House, is a no-no.\"This is not an issue that we will negotiate on,\" Press Secretary Karine Jean-Pierre said.Jean-Pierre said Biden was willing to discuss \"a separate process to address the budget\" cuts but said the debt ceiling issue should be entirely set aside.\"It is Congress' constitutional duty to prevent default,\" she said. \"Given the limited time Congress now has, it is clear that the only practical path to avoid default is for Congress to suspend the debt limit without conditions.\"The test of political will -- often likened to a game of chicken in the face of an oncoming train -- comes right after Biden announced that he will seek a second term in 2024.",
        "Failure, triggering a default and potential economic chaos, would throw the election into dangerous new territory for the 80-year-old, who is staking his bid on a record of rebuilding the economy after the Covid-19 pandemic.- 'What has changed?' -Debt limit extensions are generally an uncontroversial annual accounting maneuver that allows the government to pay for extra expenses already incurred.However, Republicans -- whose party has come under the sway of a hard-right-wing faction in the House -- have chosen to use the issue as leverage on their broader bid to slash government spending and reduce the deficit.House Republicans passed a bill laying out exactly this -- a combination of extending the debt ceiling in return for steep spending cuts across an array of government programs.The bill has virtually no chance of passing the Democratic-led Senate and would in any case be vetoed by Biden. Jean-Pierre said Biden sees the proposed Republican cuts as \"unreasonable\" and \"dangerous.\".Asked repeatedly whether Biden will eventually have to cave into Republican demands in order to save the country from default, Jean-Pierre insisted that the onus rests entirely on Congress.\"It is Congress' duty to get this done,\" she said. \"It's a question for them.\"Jean-Pierre noted that Republicans in Congress had backed three annual debt limit extensions with little opposition when Donald Trump had been in power, prior to Biden.",
        "\"What has changed?\" she asked."
    ]
}