{
    "articleURL": "/wires/reuters/article-12047207/Atlanta-shooting-suspect-appear-court-dead-victim-identified.html",
    "content": [
        "By Rich McKay",
        "ATLANTA, May 4 (Reuters) - A former U.S. Coast Guardsman accused of killing a woman and wounding four others in a shooting in an Atlanta medical building was expected to make his first court appearance on Thursday.The suspected gunman, identified as 24-year-old Deion Patterson, was scheduled to appear before a Fulton County magistrate judge for a bail hearing via a video feed from jail at 11:30 a.m. EST (1630 GMT) local time. He has been charged with one count of murder and four counts of aggravated assault.The suspect is accused of opening fire in the Northside Medical facility in the city's busy Midtown area at about 12:30 p.m. local time on Wednesday. He then fled on foot and headed to a nearby gasoline station, where he commandeered a pickup truck that had been left running unattended and drove away.He was taken into custody eight hours later without incident after an undercover officer spotted him north of the city in suburban Cobb County, police said.The woman killed in the shooting was 39-year-old Amy St. Pierre, an employee of the U.S. Centers for Disease Control and Prevention, the agency said.The four wounded women ranged in age from 25 to 71. Three of them were in critical condition and underwent surgery at Grady Memorial Hospital, officials said on Wednesday. The fourth was treated at the hospital's emergency room.",
        "Patterson had an appointment at the facility but the motive for the shooting and whether the suspect knew or specifically targeted any of his victims had yet to be determined, police said.The mother of the suspect told a local ABC affiliate he was upset that doctors would not refill for him a prescription for Ativan, an anti-anxiety drug.The gunman arrived at the medical center with his mother but she was not injured, police said, noting that she and other family members were cooperating with investigators.Little was immediately known about the suspect's background.The U.S. Coast Guard said Patterson joined the force in July 2018 and was discharged from active duty in January, after having last served as an electrician's mate second class. No reason for his discharge was given. (Additional reporting by Brendan O'Brien in Chicago; Editing by Mark Porter)"
    ]
}