{
    "articleURL": "/femail/article-12048065/The-Views-Sunny-Hostin-reveals-Sherri-Shepherd-shared-salary-help-negotiate-higher-pay.html",
    "content": [
        "Sunny also divulged Sherri told her salaries of Rosie O'Donnell, Jenny McCarthyThe View cohost said Sherri went through deal sheet on the phone to help her'She got me paid. You gave me everyone's salary,' Sunny said during interview The View cohost Sunny Hostin revealed Sherri Shepherd helped her negotiate a higher salary after she shared what she got paid.",
        "Sunny, 54, also divulged Sherri, who was on the daytime talk show's panel for seven seasons until her 2014 exit, told her how much former hosts Rosie O'Donnell and Jenny McCarthy earned during their time on the program.The 54-year-old host joined the panel - which includes Whoopi Goldberg, Joy Behar, Sara Haines, Alyssa Farah Griffin and Ana Navarro - in 2016.'I don't even know if you remember this, but when I signed my deal sheet you gave me a call. I don't know how you got my number,' Sunny, who is also ABC News's Legal Analyst, shared during an interview on the Sherri show.",
        "'You were like, \"I heard you're coming on the show,\" and I was like, \"Yeah, I'm joining the show.\" She was like, \"Did they give you a car stipend?\" I was like, \"No.\"'Sunny said Sherri, now 56, then got a hold of her own deal sheet and went through what she got paid during her time on The View over the phone.'You basically went over your salary for the entire time you were there, and you also gave me Jenny McCarthy's salary,' Sunny added.'She got me paid. You gave me everyone's salary and I went back to my agent and I was like, \"You did not get me enough money.\"'",
        "Sherri then revealed she was prompted to share the knowledge after ex-host Rosie O'Donnell did the same for her when she was negotiating her own salary when she accepted a seat on The View panel.'Rosie O'Donnell gave me everybody's salary and hers, and you've got to pay it forward,' the Sherri host added.'You've gotta stick together.'Rosie had two tenures on The View - in 2006 to 2007 and returned again in 2014, leaving just months later - while Jenny McCarthy left the same time as Sherri after joining the show in 2013.",
        "In 2022, Sunny signed a multimillion-dollar deal to remain as a host of The View for a number of years, Variety reported at the time.Prior to joining ABC, Sunny was a legal analyst for CNN, using her in-depth knowledge of the Justice Department to provide commentary.In the past, The View has stirred up controversy after Whoopi came under fire for declaring that the Holocaust 'wasn't about race.'She sparked fury last year when she made the claim on air before apologizing, and ABC suspended her for two weeks.Whoopi doubled down on the comments in an interview with The Times of London in December, saying: 'They were killing people they considered to be mentally defective. And then they made this decision.'",
        "She also claimed to have been 'canceled' unfairly, despite still having her high-paying job.Meanwhile Rosie has been very outspoken about her time on The View.She first left the show in 2006 after she felt she was 'thrown under the bus' by then co-host Elisabeth Hasselbeck.Rosie returned to the show in 2014 before departing for good in 2015 as tension continued onset.",
        "The mother-of-two took aim at Elisabeth and then-producer Bill Geddie during a chat with actress Brooke Shields on her podcast Now What? in April.She blamed the pair for her abrupt departure in 2007 and said Bill was an 'old, cis, white man, Republican who was against everything that I believed in and stood for' and was giving the blonde host 'talking points of the Republican press that they would release daily.'Rosie continued: 'And then one day on the show, she kind of threw me under the bus and I was like: \"Are you f**king kidding me?\"'I finished the show, got my coat, walked out, and said: \"I'm not going back\" — and I didn't until a few years later when they asked me to come back.'She accused Elisabeth's fans of attacking her for a controversial comment that was taken out of context about supporting military troops and she accused her then-cohost of setting her up. "
    ]
}