{
    "articleURL": "/wires/reuters/article-12038811/No-charges-Memphis-officer-testify-Nichols-death-trial.html",
    "content": [
        "By Tyler Clifford",
        "May 2 (Reuters) - One of the former Memphis police officers involved in the attempted arrest of Tyre Nichols will not face criminal charges and is expected to testify against five others accused of brutalizing the Black motorist to death, a prosecutor said on Tuesday.Shelby County District Attorney Steve Mulroy said his office declined to charge the 26-year-old officer, Preston Hemphill, because he was not at the scene where five other officers battered Nichols, a 29-year-old Black father.\"We're not endorsing what happened, but we do not believe that criminal charges are appropriate,\" Mulroy told reporters. \"He had to make his decisions based on what he knew or what he thought was happening, and following the lead and in support of the other officers.\"An autopsy will be available soon and is expected to confirm that Nichols died of injuries from the beating, Mulroy added.Police video of the incident showed officers kicking, punching and beating Nichols with a baton on Jan. 7. Nichols died of his injuries three days later.The beating came after the car Nichols was driving was pulled over and officers tried to arrest him. He ran on foot to a second site where the beating took place.Hemphill, who is white, could be seen on bodycam video arriving at the initial traffic stop and deploying a Taser on Nichols next to his vehicle. But Hemphill was not involved in the pursuit of Nichols after he fled. The five former officers charged with second-degree murder are all Black. Ben Crump and Antonio Romanucci, attorneys for the Nichols family, said in a statement that they understood Hemphill will continue to assist in investigations.",
        "\"In light of this, we are supportive of no charges for this individual,\" the statement said.Hemphill, along with those accused of murder and a seventh officer, were relieved of their duties by the Memphis Police Department.In firing Hemphill, the department said he violated department policies on personal conduct, truthfulness, and compliance with regulations regarding the use of a Taser, among other violations.Prosecutors will not charge any other officer who arrived to the scene after the beating, but are still investigating actions by fire department staff, Mulroy said.Three members of the Memphis Fire Department were fired and one was suspended. (Reporting by Tyler Clifford in New York; Editing by Bill Berkrot)"
    ]
}