{
    "articleURL": "/wires/afp/article-12059327/Airstrikes-rock-Sudan-truce-talks-yield-no-breakthrough.html",
    "content": [
        "Air strikes again shook Sudan's capital Monday while the latest truce talks in Jeddah yielded no progress and a Saudi diplomat said both sides consider themselves \"capable of winning the battle\".",
        "Sudan was thrown into deadly chaos when fighting broke out on April 15 between the forces of army chief Abdel Fattah al-Burhan and his deputy turned rival Mohamed Hamdan Daglo, who heads the paramilitary Rapid Support Forces (RSF).Battles have since killed hundreds, wounded thousands and uprooted hundreds of thousands, leading to fears of security fallout beyond Sudan's borders.The warring generals have sent representatives to Saudi Arabia for talks on establishing a humanitarian truce in an effort also backed by the United States.Washington and Riyadh have labelled these \"pre-negotiation talks\".By Monday, the discussions had yielded \"no major progress\", a Saudi diplomat told AFP, speaking on condition of anonymity.\"A permanent ceasefire isn't on the table... Every side believes it is capable of winning the battle,\" the diplomat added.",
        "For Kholood Khair, founder of the Khartoum-based think tank Confluence Advisory, the delegations \"are there mostly to curry favour with the Saudis and the Americans, rather than to credibly use this platform as a means to reach an agreement.\"In Khartoum, terrified residents reported more combat.A southern Khartoum resident told AFP the family could hear \"the sound of airstrikes which appeared to come from near a market in central Khartoum\".- 'Dangerous everywhere' -The fighting has sparked a mass exodus of foreigners and of Sudanese, in land, air and sea evacuations.",
        "\"It's very dangerous everywhere,\" said Rawaa Hamad, who escaped from Port Sudan on an evacuation flight carrying 71 people to Qatar on Monday.In Sudan, she said, people endure \"a lack of everything -- a lack of water, lack of fuel, lack of medicine, lack of even hospitals and doctors\".The battles in the capital and in other parts of the country have killed more than 750 people and injured over 5,000, according to the Armed Conflict Location and Event Data Project.In Sudan's long-troubled western region, almost 200 people have been killed in West Darfur state over the past two weeks, the United Nations said.It has warned of a widening humanitarian crisis, even as facilities of the UN and other aid groups have faced \"large-scale looting\", including at the World Food Programme in Khartoum over the weekend, a UN spokesperson said on Monday.Fighting has already displaced 335,000 people and created in excess of 120,000 refugees who have fled north into Egypt, west to Chad, and to South Sudan as well as elsewhere, according to the UN.Egypt's foreign ministry warned of \"the great humanitarian tragedy\" of the conflict, \"directly affecting Sudan's neighbouring countries\", in a statement on Foreign Minister Sameh Shoukry's visit Monday to Chad and then South Sudan.",
        "The UN top humanitarian official, Martin Griffiths, has travelled to the Saudi coastal city of Jeddah, and a UN official said Griffiths had \"asked to join the negotiations\" between the warring sides, but his request had not been approved so far.- Mediation efforts -Saudi Arabia is pushing for \"a timetable for expanded negotiations to reach a permanent cessation of hostilities\", its foreign ministry said.The Jeddah talks, which are set to continue \"in the following days\", aim to reach \"an effective short-term halt\" to the fighting, facilitating aid delivery and restoring basic services, it added.US ambassador John Godfrey, while not commenting directly on the Jeddah talks, said in a statement: \"Our immediate priority is to reach a durable ceasefire\" and enable humanitarian assistance.",
        "Multiple truce deals have been declared and quickly violated during the current fighting, in a country with a history of instability.Mediation efforts have multiplied.Heavyweights in the pan-Arab bloc are divided on Sudan, with Egypt supporting Burhan and the United Arab Emirates seen to be backing the RSF, according to experts.The absence of Cairo and Abu Dhabi from the Jeddah talks, according to Sudanese analyst Khair, further dampens hopes for an agreement.",
        "Saudi and US mediators \"have played this very close to their chest\", instead of creating an international \"critical mass around these talks\", she told AFP.",
        "The African Union -- which suspended Sudan following a coup in 2021 -- and East African regional bloc IGAD are pushing for discussions mediated by South Sudan's President Salva Kiir.Dafaallah al-Haj, the envoy of Sudanese army chief Burhan, met with Kiir in South Sudan's capital Juba on Monday. Haj later told reporters that, \"Our response to the initiative of Saudi Arabia and the United States doesn't exclude the role of IGAD\" and Kiir.Haj added that if the RSF \"rebels put down their arms, we will pardon them.\"Since together orchestrating a coup in October 2021 that upended a fragile transition to civilian rule, Burhan and Daglo fell out in a power struggle, most recently over integration of the RSF into the regular army.burs/fz/jsa/it/ami"
    ]
}