{
    "articleURL": "/wires/ap/article-12044393/Churchill-Downs-investigates-4-horse-deaths-ahead-Derby.html",
    "content": [
        "LOUISVILLE, Ky. (AP) - The death of four horses at Churchill Downs over a span of five days has overshadowed preparations for the Kentucky Derby.",
        "Two horses trained by Saffie Joseph Jr. collapsed on the track and died over the past week. Two other horses also died as either a result of racing or training, including Derby entrant Wild On Ice.Joseph is set to saddle Lord Miles in the first jewel of the Triple Crown on Saturday. But he has said he´s unsure of plans after the two deaths from his barn.Churchill Downs Racetrack, in a statement Wednesday, expressed concern over the deaths and said officials would press for answers.\"While a series of events like this is highly unusual, it is completely unacceptable,\" Churchill Downs said. \"We take this very seriously and acknowledge that these troubling incidents are alarming and must be addressed. We feel a tremendous responsibility to our fans, the participants in our sport and the entire industry to be a leader in safety and continue to make significant investments to eliminate risk to our athletes.\"The deaths happening in different manners points to factors beyond the racing surface.",
        "There was no cause of death immediately available for either of Joseph´s horses, 4-year-old Parents Pride, who died after a race Saturday, and 5-year-old Chasing Artie, who died after a race Tuesday.Wild On Ice and 3-year-old filly Take Charge Briana broke down with musculoskeletal injuries during training or racing and each was transported to Rood &amp; Riddle Equine Hospital for assessment before being euthanized.",
        "Wild On Ice was trained by Joel Marr, and Take Charge Briana by Hall of Famer D. Wayne Lukas.Joseph told reporters at the track Wednesday that blood work showed nothing out of the ordinary.\"When you don´t know something, that´s when it worries you the most,\" Joseph said. \"Something is wrong. A lot of thoughts run through your head, but you can drive yourself insane. But I´m very uneasy right now. It´s not something I would wish on anybody.\"Lisa Lazarus, CEO of the Horseracing Integrity and Safety Authority, said in a statement sent to The Associated Press that the welfare of horses and riders is paramount.\"When horses die unexpectedly, we all suffer, but we take comfort in the tools and practices we have collectively developed to investigate contributing factors and deploy those learnings to minimize future risk,\" Lazarus said, adding the organization is in contact with the Kentucky Horse Racing Commission and Churchill Downs. \"HISA also intends to conduct its own in-depth analysis of the fatalities and will share those findings once the full investigation is complete.\"The deaths brought back unpleasant memories of 2019, when 42 horses died at Santa Anita Park in California before reforms were instituted.California and New York, which hosts the Belmont Stakes, each have thorough reporting requirements and a database cataloging equine injuries and fatalities, while Kentucky does not.",
        "___AP sports: https://apnews.com/hub/sports and https://twitter.com/AP_Sports"
    ]
}