{
    "articleURL": "/news/article-12046637/Former-homeless-hero-stopped-runaway-stroller-reveals-just-finished-job-interview.html",
    "content": [
        "Hero Ron Nessman has spoken out about making the heart-stopping save The baby's great aunt, who has not been named, fell and lost grip on the stroller Nessman has been living with his sister after being homeless for eight years A Good Samaritan who rescued a baby boy in a stroller from rolling into speeding traffic has spoken out - revealing that he had just finished a job interview when he made the heart-stopping save. ",
        "Ron Nessman had previously been homeless for eight years, and had just interviewed at a nearby Applebee's restaurant in Hesperia, California, when he saw the stroller rolling directly toward the main road. Agonizing video footage shows Nessman saving the baby after his great aunt suddenly tripped and fell down onto the ground losing her grip on the baby stroller.Nessman had been sitting on the bench of a nearby carwash when he saw the baby propelling towards the four-lane Bear Valley Road, pushed by strong winds blowing through the high desert.'I didn't have time to even think about it. You just react,' he told KCAL News.",
        "'I seen her and I felt so bad for the lady,' he told the outlet. 'I got nephews and nieces and I couldn't imagine something like that.'I wouldn't be able to live with myself I did nothing. I'm just glad I realized it and was on it.'He said he could imagine being in the kind of distress that he saw the baby boy's great aunt in at that crisis moment. Nessman, a former truck driver, lost his girlfriend in 2018. The tragedy sent him spiraling into depression, and he was homeless for eight years. He had only recently moved back to Hesperia to reconnect with his family, and has been living with his sister for three months. ",
        "'My girlfriend passed away in 2018,' he said. 'It was sudden and I didn't want to do anything.'He told NBCLA: 'I decided to get right. If you want something different in your life, you do something different and that's where I am at today.''I thank my sister for helping me out. She's always been there for me.'Nessman's sister Donna Gunderson told the outlet about seeing her hero brother leaping into action to save the baby boy.",
        "'I heard screaming to the right, she said. And I look back and I see a stroller going down the driveway and my heart dropped.'At that moment, she saw her brother grab the stroller before it rolled into the road, where she said cars do '50 to 55 and it was a busy time of day.'Nessman said he was thankful the child and his unidentified great aunt are both OK. He said: 'I knew I could get it and I got it and I'm thankful for that because I really wouldn't want to see the end result if I wasn't there.'She tried everything she possibly could to get up. Her knees were bleeding when I got up to her. She was still shocked and she was crying.'",
        "The video was originally posted on Monday around 7:30pm by USSGoodGirl with the caption: 'Windy AF here today and the stroller rolled away… Thank god a man catches the stroller before anything bad happens to this lady’s baby.' ",
        "The post has garnered more than 58 million views after being shared on Twitter.Many users have taken to social media to say they hope Nessman gets the job at Applebees. One person wrote: 'I hope he gets that job he applied for. Incredible!!!' and another said 'Please give him the job.'Someone else wrote: 'I wish this man happiness and I hope he is able to get a job and move ahead with his life.' Some people who watched the video wondered if there should have been a lock on the stroller.'Holy s**t!!; wrote one person. 'Why wasn’t it locked?! No way I’d let my hands off a stroller if it was windy like that.'Before he was identified, many shocked viewers were grateful for Nessman's intervention. 'I hope the guy who saved the day by catching the stroller got some kind of kudos locally. Impressive feat,' wrote someone.'I watched that with my heart in my throat,' wrote another user. 'God bless that man.'"
    ]
}