{
    "articleURL": "/news/article-12045733/Wollongong-man-flies-rage-finding-girlfriend-bed-bloke.html",
    "content": [
        "James Michael South, 34, bashed a love rivalHe had discovered the man in his ex-partner's bedroomSouth handed a two-year community correction orderDo you know more? Email tips@dailymail.com A devastated boyfriend bashed a love rival when he discovered him in his ex-partner's bedroom after bringing her coffee to rekindle their relationship. ",
        "James Michael South, 34, yelled 'who the f*** are you' before pummeling the man with his fists, causing his scalp to split and blood to pour down his face. South then yelled at the love rival: 'This is my f***ing missus, you f***!' ",
        "Tendered court documents showed South and the woman had been in a relationship for almost a year before mutually deciding to spend time apart, reported the Illawarra Mercury. On the morning of September 10 last year, South took a coffee to the woman's home with the hope of rekindling their relationship.However, he was shocked to find another man standing beside her bed and yelled 'who the f*** are you?'.The woman stood between South and the other man and asked South to leave. However the men got into a scuffle, with South punching the victim several times, causing his head to bleed.'Stop, stop, get out!' the woman yelled. South yelled back at the man, 'this is my f***ing missus, you f***!' as he began to film the incident.He left the home but returned shortly after with a friend. The woman threatened to call triple-0, asking him to leave again, however South snatched the phone and threw it.South and the man left, with South uploading the video he took to social media, which has since been deleted. Police arrested him about 1pm that same day.",
        "South pleaded guilty to assault and intimidation in court. His lawyer Matt Ward said South faced recent 'devastation in his life' prior to the incident and argued that his offending was not premeditated or planned.",
        "Magistrate Claire Girotto said South's reaction was 'understandable' but criticised his decision to resort to violence. 'Seeing another man there, you would be startled and angry, but you don't beat someone up,' she said.South was handed a two-year community correction order. A fortnight after the incident, South posted a picture of himself working out at the gym on Facebook.'Three devastating scenarios in 3 months and I still get my a-- up everyday and put a smile on my face like it's all eets (sic),' he captioned it.'I'll never buckle or fold I'm built different'."
    ]
}