{
    "articleURL": "/news/article-12050515/Gunman-shot-two-children-park-fleeing-stolen-car-arrested-armed-cops.html",
    "content": [
        "West Midlands Police release image of car believed to been involved in the chaseThe two children were rushed to hospital and remain in a stable conditionA suspected gunman accused of shooting two children in a park before fleeing has been arrested for attempted murder.",
        "Emergency services were called to Shelley Road, Bushbury in Wolverhampton, around 3pm on Monday 1 May, following reports of gunshots. After attending to the scene, officers found a 15-year-old boy with a bullet wound to his leg, and an 11-year-old girl with similar injuries at a park nearby.   The children were rushed to hospital and remain in a stable condition, police say, as they are both expected to make a full recovery.West Midlands Police said after the children were shot, stolen cars were involved in a chase - with one of the vehicles being dumped nearby. Detectives have today released an image of another vehicle they want to identify.The suspect was arrested yesterday after police officers stopped a car believed to have been used in the shooting.",
        "Armed police swooped on the car on Emerson Road in Wolverhampton just after 5pm on Thursday 4 May.Detectives investigating the shooting have this morning released an image of a car believed to have been involved in the chase.  They have said that if anyone recognises the vehicle or knows anyone connected to it, they should contact the police force.Meanwhile, the police force confirmed that on Tuesday they recovered the Focus after it was abandoned in Bushbury Lane, adding they believe it had been stolen in Wolverhampton on 29 April.",
        "And on Monday evening they recovered an abandoned Mini from Third Avenue, which has also been seized and will undergo forensic examinations.West Midlands Police are also urging anyone with information or who has footage of the incident to come forward, as they say it will assist with their enquiries.They said: 'And we're asking any drivers who were in Wolverhampton on Monday afternoon, especially in Bushbury and Low Hill, to check their dashcam, as they may have footage which will assist with our enquiries.' The police force added that they have set up a special online portal for people to submit information, dashcam or doorbell footage.",
        "Speaking about the incident, Detective Inspector Francis Nock, from the major crime team, said: 'We're making good progress on as we these investigations into these shootings, which have rightly shocked the community in Wolverhampton.'Our absolute priority is bringing all of those involved into our custody and we'll continue to work around the clock to make sure that is done.'Three people, including two children, have been injured in these two shootings.'I'd urge people to examine their conscience and do the right thing by telling us what they know about who was involved.'   The double shooting comes after a similar incident in the Whitmore Reans area of the city last month. ",
        "Police are not linking it to the Bushbury attack.Detectives arrested a 21-year-old man on suspicion of attempted murder following the Whitmore Reans shooting.A woman in her 20s suffered a leg injury when shots were fired in Bitterne Drive at around 1am on April 23.A gun shot also damaged a window at an address in nearby.The suspect was held by firearms officers who stopped the car he was travelling in on the M6 near Crewe at around 8pm on Thursday.Cash and drugs were also recovered from the vehicle."
    ]
}