{
    "articleURL": "/tvshowbiz/article-12057811/Love-Island-star-turned-influencer-shocks-fans-wild-sex-confession.html",
    "content": [
        "Love Island star-turned-influencer Kim Harnett has shocked fans by sharing the  controversial contraception method she uses to prevent unwanted pregnancies. ",
        "The former hairdresser, 27, explained she uses the 'pull out' method during a candid Q&amp;A with fans last week. The mother-of-two, who is dating Bachelor in Paradise star Matt Whyatt, 30, said she skips the pill due to the 'side effects' on the body and prefers to 'pull and pray'.Popular types of contraception available on the market include condoms, the pill, an IUD. According to WebMD, 'pulling out' is the 'age-old method that relies on the man withdrawing their penis from the vagina before ejaculation,' but it fails to offer protection from STDs and in most cases, pregnancy. ",
        "'What birth control do you use?' one follower asked her. 'None. I don't like the side effects they have on your body. Pull and pray,' she wrote, alongside a crying with laughter emoji. Her post was shared by Influencer Updates Au, an influencer sleuth account. Many followers said she shouldn't be 'critiqued' for her choices, while others said 'pull and pray misses the mark'.",
        "'I mean that's her choice and her body. Share away. She isn't promoting it for others. She is just answering a question honestly. Lots of my friends use this method,' MAFS star Clare Verall said. 'How about we don't critique a woman based on the contraception she chooses for HER body?' another user wrote.",
        "'I just find it strange that people even ask these kinds of questions to influencers,' one wrote. ",
        "'I'm definitely not against someone choosing not to use hormonal contraceptives and other methods... I just think the added notion of ''pull and pray'' misses the mark. That statement is a little bit off and could have used the post to encourage research and education not joke about pull out methods and pray you don't end up pregnant,' another said.   According to the Cleveland Clinic, 'the pull-out method is 80 per cent effective. About one in five people who rely on the pull-out method for birth control become pregnant.'Kim rose to fame on season one of Love Island Australia back in 2018.Matt, who is a BMX rider and Nitro Circus star, starred on both The Bachelorette and Bachelor in Paradise."
    ]
}