{
    "articleURL": "/wires/pa/article-12052907/Max-Verstappen-fastest-Miami-practice-Mercedes-set-surprise-early-pace.html",
    "content": [
        "Max Verstappen restored Formula One’s natural order by posting the fastest time in second practice for Sunday’s Miami Grand Prix as Charles Leclerc crashed out.",
        "After George Russell finished ahead of Lewis Hamilton in a surprise one-two finish for Mercedes in the earlier sun-cooked running at Miami’s Hard Rock Stadium, Verstappen took the spoils in the day’s concluding running.The double world champion finished 0.385 seconds clear of Carlos Sainz with Leclerc, whose day ended in the barriers at Turn 7 with 10 minutes remaining, third in the other Ferrari.Verstappen’s Red Bull team-mate Sergio Perez claimed fourth spot with Hamilton only seventh, nine tenths back, and team-mate Russell down in 15th.F1 is back in Miami for a second time at a 3.36-mile circuit constructed around the home of NFL side the Miami Dolphins – 15 miles north of the city.The race marks the first of three rounds to be staged in the United States this year as F1’s American owners Liberty Media continue to build on the rise of the sport across the Atlantic.A debut event on the Las Vegas strip will take place in November, while Austin’s grand prix at the Circuit of the Americas – a permanent fixture on the F1 schedule since 2012 – also features.Despite the boom of the sport, the actual competition is facing accusations of being “predictable” and “boring” with Red Bull winning 14 of the last 15 races.",
        "Verstappen leads Red Bull team-mate Perez in the standings by six points after the opening four rounds.Mercedes’ encouraging start here provided hope that Red Bull might not have it all their own way in Florida.But Verstappen’s pace later in the day indicates they will again be the team to beat heading into the remainder of the weekend.Hamilton was asked for his assessment after second practice.“The same as every weekend,” said the seven-time world champion, whose Mercedes team are due to introduce an upgrade at the next round in Imola.“We are a second down. “We are just not particularly quick. It is a struggle out there.“We are trying different things. First practice looked good and then we got to second practice and the true pace came out. It is a kick in the guts. It is difficult to take sometimes.“I am going to stay optimistic but we desperately need those upgrades. We have to keep our heads down for one more race.”The opening session was suspended for nine minutes when Nico Hulkenberg crashed into the wall after he lost control of his Haas coming through the third corner.With Hulkenberg’s broken machine in a precarious position, the red flags were deployed. The second running almost saw another Haas in the barriers after Hulkenberg’s team-mate Kevin Magnussen span at Turn 14 and drifted backwards into the wall. The Dane thudded the armco but escaped without significant damage.",
        "The same could not be said for Leclerc after he carried too much speed into Turn 7, and headed straight for the tyre wall.Leclerc broke his front wing and suffered possible suspension damage in the accident before he headed back to the pits on the back of a moped.The running was red-flagged for six minutes as Leclerc’s Ferrari was removed from danger. The cars returned to the track for a four-minute splurge but it was Verstappen who remained at the summit."
    ]
}