{
    "articleURL": "/wires/pa/article-12056961/Ange-Postecoglou-says-Celtic-s-title-winning-performances-ridiculous.html",
    "content": [
        "Celtic manager Ange Postecoglou hailed his title-winning squad for showing the hunger to be even better in their second season together and setting “ridiculous” standards.",
        "The Hoops retained the cinch Premiership title thanks to a 2-0 win over Hearts at Tynecastle.Second-half goals from Kyogo Furuhashi and Oh Hyeon-gyu kept Celtic on track to set a new top-flight Scottish points record of 107 points if they win their remaining four games.Postecoglou, whose side have only lost to St Mirren, Real Madrid and RB Leipzig this season, said: “After the success of last year, you wonder, it’s still a young group, is the hunger going to be there, are they going to be as motivated?“From the first day of pre-season they came back, they wanted to be a better team, they wanted to be a stronger team.“I just think they have maintained a ridiculous standard this year of performance, results, it’s just been incredible.“I have rarely had to intervene at any stage to get them back on track. I have had the easiest job in the world in terms of allowing these guys to drive how good they want to be, players and staff. I am just super proud.” I just think they have maintained a ridiculous standard this year of performance, results, it's just been incredible  Ange Postecoglou  Celtic regained the title against the odds last season after a major squad rebuild and Postecoglou immediately set his players the challenge of improving as they celebrated their success in May last year.",
        "“I don’t know if it feels more special but it makes me immensely proud that the group embraced that, because it would have been very easy after winning it last year and me throwing some words out there that we are going to be stronger and better and bigger and all those kind of things,” he said.“But I purposely did that to throw out a challenge to the lads that we have got to be a better team.“I thought we needed to be a better team this year if we were going to defend our title because, particularly knowing we were going to be in the Champions League, you shouldn’t under-estimate the physical and mental toll that playing Champions League takes out of you.",
        "“Through that time our league form was outstanding and that’s because the whole group were prepared to drive through that time that our main goal of being champions again was never going to be derailed.“I am immensely proud the lads took on that mantra of being better than we were last year, not resting on our laurels, not being comfortable, and again the standard they have set has been unbelievable.”The 57-year-old admitted he was emotional during the post-match celebrations.",
        "“I am because you put a lot into it,” he said. “I realise I am doing what I live and I am pretty good at it but it doesn’t happen in isolation.",
        "“The people around you, whether it’s my family, my wife and kids, my friends, and the support I have had inside and outside the football club, you want to pay that back as well.“It’s not just about having success, it’s a little bit of giving back to all those people who are prepared to support me on a daily basis to do what I do.“Everything you do is hard-earned. All the sacrifices people make and the commitment and support they give me, it makes you emotional to think about.”",
        "Celtic did not have it all their own way at Tynecastle. Hearts were the better side until Alex Cochrane was sent off in the 45th minute after being adjudged to have denied Daizen Maeda an obvious goalscoring opportunity.Referee Nick Walsh initially booked the defender before issuing a red card after being called to his monitor, and Hearts manager Steven Naismith could not believe video assistant Willie Collum had intervened.“I don’t agree with it,” he said. “I think there is still a bit of work to do by Maeda as he is going into the box. He is travelling at speed, the ball is moving, and we have got some covering players.“That was really disappointing because up until then, we had the best chances, the game was mainly played in the Celtic half, and we had a real belief we could get something from the game.",
        "“It then becomes harder and as soon as the red card happens the game hinges on the first goal.”When asked if he was surprised there was a VAR intervention, Naismith said: “I thought the referee made the right call. He is closest to it, he sees it, and our players were in a bit of disbelief when the decision gets checked to be overturned, because he still has a lot of work to do before he gets a finish.”"
    ]
}