{
    "articleURL": "/wires/ap/article-12049389/Albanese-says-served-US-pursuing-Assange.html",
    "content": [
        "CANBERRA, Australia (AP) - Australian Prime Minister Anthony Albanese expressed frustration at the United States´ continuing efforts to extradite WikiLeaks founder and Australian citizen Julian Assange, saying: \"There is nothing to be served by his ongoing incarceration.\"",
        "Albanese´s comments Friday in an Australian Broadcasting Corp. interview appeared to escalate diplomatic pressure on the United States to drop the charges against the 51-year-old Assange, who has spent four years in Britain´s Belmarsh Prison fighting extradition to the United States.Before that, Assange had taken asylum for seven years in the Ecuadorian Embassy in London.Albanese said Assange´s case had to be examined in terms of whether the time Assange had \"effectively served\" was in excess of what would be \"reasonable\" if the allegations against him were proved.\"I just say that enough is enough. There is nothing to be served by his ongoing incarceration,\" Albanese said.\"I know it´s frustrating, I share the frustration. I can´t do more than make very clear what my position is and the U.S. administration is certainly very aware of what the Australian government´s position is,\" Albanese added.",
        "Assange has battled in British courts for years to avoid being sent to the U.S., where he faces 17 charges of espionage and one charge of computer misuse that stem from WikiLeaks´ publication of a huge trove of classified documents in 2010.American prosecutors allege he helped U.S. Army intelligence analyst Chelsea Manning steal classified diplomatic cables and military files that WikiLeaks later published, putting lives at risk.",
        "To his supporters, Assange is a secrecy-busting journalist who exposed U.S. military wrongdoing in Iraq and Afghanistan.Albanese said there was a \"disconnect\" between the U.S. treatment of Assange and Manning. Then-U.S. President Barack Obama commuted Manning´s 35-year sentence to seven years, which allowed her release in 2017.Albanese has said he has advocated for Assange in meetings with Biden administration officials. On Friday, he declined to say whether he would raise Assange with Biden when Albanese hosts the U.S. leader along with leaders of India and Japan in Sydney on May 24.\"The way that diplomacy works ... is probably not to forecast the discussions that you will have, or have had with leaders of other nations,\" Albanese said. \"I´ll engage diplomatically in order to achieve an outcome.\"Albanese said he did not want to get into an argument about whether Assange´s alleged actions were right or wrong.Albanese noted a British district court decision, since overturned, that rejected the extradition request on the grounds that Assange was likely to kill himself if held under harsh U.S. prison conditions.\"I am concerned about Mr. Assange´s mental health,\" Albanese said."
    ]
}