{
    "articleURL": "/sport/college-basketball/article-12052449/Ex-NM-State-basketball-players-say-teammates-PANTSED-assistant-amid-sexual-assault-lawsuit.html",
    "content": [
        "Benjamin &amp; Odunewu spoke publicly for the first time this week since the lawsuitThe pair filed a sexual assault lawsuit in April against ex-players among othersDailyMail.com provides all the latest international sports news Two former New Mexico State basketball players who alleged they were sexually assaulted by teammates say assistant coaches on the team were also attacked.",
        "Deuce Benjamin and Shakiru Odunewu also revealed to ESPN certain assistants had their pants pulled down in public by the alleged sexual assault perpetrators.'After the [game] at UTEP, when we lost, they pantsed one of the assistants,' Benjamin said. One assistant coach had his pants pulled down while he slept on the bus, he said, and another was targeted but yelled enough to dissuade the attackers. '[Other coaches acted] like they didn't see it,' Benjamin told the outlet.Odunewu also alleged his attackers intentionally manipulated teammates into keeping quiet regarding the bizarre series of events initially referred to by the program as 'hazing.''There were most definitely other players that got attacked the way that we got attacked,' he said.",
        "'But... these other guys, I feel like they manipulated them to believe that if they came out, that they were snitching.'The pair filed a lawsuit against the school in April, speaking publicly for the first time Wednesday on the edge of New Mexico State's campus. Defendants listed were the NMSU board of regents, two former members of the coaching staff and three former players. It seeks 'amounts to reasonably compensate' the plaintiffs for their damages, and for punitive damages against the defendants. One count in the lawsuit alleges sexual assault, battery and false imprisonment.",
        "Benjamin previously made the allegations public while announcing his intention to transfer away from the school in Las Cruces. He says three teammates forced him and the other plaintiff to pull down their pants below their ankles before sexually assaulting the two.'I used to have respect for people,' Benjamin told the AP in an interview that came a few hours after an emotional news conference to discuss the suit. 'I've lost all that now. Pretty much just a lot of anger. I can't put my trust in people, and I've just come to despise people, really.' Chancellor Dan Arvizu canceled the season in February after Benjamin took his allegations to school police. Arvizu framed the allegations as stemming from a hazing episode. The civil lawsuit, filed in district court in Las Cruces, took issue with that description, saying 'when the behavior goes too far, and crosses the line into nonconsensual touching, it is not mere hazing; it is battery and sexual assault.'The lawsuit says when Odunewu first approached an assistant coach about the incidents, the coach reacted by laughing and saying 'What do you want me to do about it?' It says the player discussed the incidents three times with another coach, who 'said that he was looking into it and would issue some suspensions,' but no action was taken.",
        "One of a number of assaults against Benjamin came in front of a group of women in a hotel room where the players were staying before a road game, per the suit. It says one of the players 'exposed Deuce's backside and forcefully grabbed (him), inflicting great pain and humiliation. All this occurred in front of the women, which only added to Deuce's degradation.'Benjamin ultimately told his father, a former New Mexico State star and current high school coach in Las Cruces, about the assaults. His father, William Benjamin, tried to reach coaches and the school's athletic director, Mario Moccia, but neither returned his calls, the lawsuit said. That led to the player taking his story to campus police, who opened an investigation.",
        "The lawsuit said the school's new coach, Jason Hooten, told Benjamin, who was New Mexico's Gatorade high school player of the year before signing with the Aggies, that he should try to find a new place to play.Odunewu said his Muslim faith made him hesitant to come forward with his case.'Even though they did something unforgiveable, they're still human beings with goals and aspirations and dreams,' he told AP Wednesday. 'I didn't want to come out and mess up their futures. But it just got to the point where I just couldn't bear any more.'",
        "Not until some three months after Odunewu was laughed at by the coach did Benjamin, with prodding from his father, go to campus police with details from another episode in which he said he was ganged up on and assaulted. In between, the relationship grew strained between the son and his father, former NMSU star William Benjamin, who is also a plaintiff in the lawsuit.'I was smoking a lot, just trying to deal with the pain and start forgetting,' the younger Benjamin said. 'Trying to find an escape route. It got to the point where I didn't even want to live with my pops,' who remains a well-known figure in the community as coach of the Las Cruces High hoops team.The police report led to the school chancellor canceling the season and firing coach Greg Heiar for what were then termed as 'hazing' allegations.New Mexico State spokesman Justin Bannister released a statement saying the school 'continues to regard this matter as extremely important... The kind of behavior described in those allegations has no place on our campus,' he added.",
        "Bannister said in April New Mexico State was working with a law firm to investigate the allegations. NMSU head coach Greg Heiar was fired on February 14 as a result of the scandal. ",
        "Both Benjamin and Odunewu are unsure of what they'll do next. They both figure basketball will be part of that plan, in part because it offers something of an escape from the realities of where that sport left them after their troubling stays at New Mexico State. They've been taking classes online and Wednesday is as close to campus as they've been in months.'I have days where I don't feel like talking to anybody,' Benjamin said. 'And days where I'm mad at myself. I'm just a real isolated person now. 'I feel like the only way I'll get better is if I'm playing somewhere and just being where I'm wanted. I haven't been in the right mind space in I don't know how long. I'm not happy.'"
    ]
}