{
    "articleURL": "/wires/pa/article-12059985/Kris-Doolan-feels-momentum-key-Partick-Thistle-s-promotion-bid.html",
    "content": [
        "Kris Doolan believes momentum is key for Partick Thistle’s bid to return to the cinch Premiership through the play-offs.",
        "The Jags finished their Championship campaign in fourth place, one point behind Queen’s Park, whom they play in the first leg of the Premiership play-off quarter-final at Firhill on Tuesday night, with the second leg on Friday at Ochilview.The Maryhill side are unbeaten in six matches and as he prepared for the first of a possible six extra games this season, boss Doolan said: “We have come into the play-offs in really good form.“We are probably one of the stronger form teams, if not the top, in terms of form in the Championship so we feel we are in good shape and we have a full squad now.“I have been on the other side of it, I have been in the Premiership team going into the play-offs having not had a good season and you come up against a side, regardless of whether they finished third or fourth, and they have good form and momentum and it is such a difficult situation to be in.“I was with Partick in 2017-18 when we played Livingston who were going really well in the Championship (and lost).",
        "“So I understand that form coming into the play-offs is massive and momentum is massive. You build up more steam with victories and that can carry you a long way.",
        "“I am hoping that form can continue and those good spirits and that momentum can carry on through the play-offs.”Queen’s Park have won three of the four league meetings between the sides this season but they suffered a 4-0 defeat at Firhill last month.Owen Coyle’s men lost 5-3 to Dundee in their thrilling title decider on Friday night and are now without a win in three.However, Doolan is focused mainly on his side and said: “They are in the play-offs for a reason like the rest of us.“They are there on merit. They will be disappointed that they didn’t get the result they wanted but they will still be a dangerous side, they have a lot of threats.“First and foremost, we are at home which is great.“The last time we played them at home we played really well and the style of play worked well so there is a lot of positives to take from that and we hope to see that again.“The fans will back us from start to finish and it drove the players on the last time they played Queen’s Park so we are hoping for more of the same.”"
    ]
}