{
    "articleURL": "/money/investing/article-12054057/MIDAS-SHARE-TIPS-UPDATE-Warpaint-make-looking-good.html",
    "content": [
        "As usual, the weather is misbehaving. As usual, we are making the best of it. The British love a party and this weekend has given us the perfect excuse. For most women (and some men) parties mean make-up, whether that is a dab of lipstick or the full works – foundation, blusher, eyeshadow and the rest.",
        "Warpaint specialises in all things cosmetic, at a price that even cost-conscious consumers can afford – and the business is firing on all cylinders.Founded in the 1990s by two young entrepreneurs, Sam Bazini and Eoin Macleod, the company has its roots in the discount market, originally selling surplus stock from brands such as L'Oreal, Revlon and Max Factor to cut-price retailers including B&amp;M, TK Maxx and Savers. In 2002, they began selling their own range, W7, designed to be fun, affordable but also good quality.Today, Warpaint is listed on the stock market and last year generated a 24 per cent increase in sales to £64million, while profits soared 45 per cent to £10million and the dividend rose 18 per cent to 7.1p.Bazini and Macleod still run the business and W7 still accounts for most of Warpaint's sales. But several in-house brands are now on offer, including Technic, Very Vegan and Man'Stuff – all appealing to young people who want to look good without paying over the odds to do so.Midas recommended the shares in 2017, when the group sold most of its wares to discount stores and independent retailers. Since then, however, there has been a determined effort to move into large, mainstream chains, including Tesco, which started selling W7 cosmetics in 2020 and now offers its range in 1,400 stores across the UK.",
        "Boots has joined the roster too, Asda came on board last month and other well-known names should come on stream this year. Bazini and Macleod have made great strides overseas too. European sales grew 56 per cent last year and now account for more than 40 per cent of group turnover. US sales surged 80 per cent last year to £5.3million, with further expansion expected this year and beyond.Internet sales are booming as well, both via Amazon and the group's own websites. Looking ahead, prospects are bright. Brokers expect double-digit growth for the foreseeable future, predicting sales of £74million and profits of £12million this year, and further strong gains in 2024 and 2025.The dividend is a focus of attention too. Bazini and Macleod own 25 per cent of the business each so they are not only motivated to succeed, they also recognise the importance of rewarding shareholders. A 7.7p payout is expected this year, rising to 8.7p next year and over 10p in 2025.Midas verdict: Most women want to look good but, when times are tough, they would prefer to pay a little less for it. Warpaint goods cost far less than top-notch brands, the products are well-made and customers tend to stick with the business.There is even a 'Coronation Flash Sale' this weekend. The shares have risen 10 per cent to £2.46 since 2017 but the best is yet to come – and the dividend is attractive too. Existing shareholders should stick with the business. New investors could also benefit from snapping up a few shares.",
        "Traded on: AIM Ticker: W7L Contact: warpaintlondonplc.com or 01753 639130",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}