{
    "articleURL": "/wires/reuters/article-12051819/Biden-picks-Neera-Tanden-domestic-policy-adviser.html",
    "content": [
        "By Trevor Hunnicutt and Andrea Shalal",
        "WASHINGTON, May 5 (Reuters) - U.S. President Joe Biden picked a senior aide, Neera Tanden, to replace Susan Rice as his domestic policy adviser, the White House said in a statement.Tanden, a longtime Democratic aide who served in two prior presidential administrations, will take on one of the most senior policy jobs in the administration, covering most areas outside of national security and the economy.As Biden's staff secretary, Tanden already played a major role in the West Wing, controlling the schedules, briefing books and other paperwork that reach the president's desk.Stefanie Feldman, an aide to Rice who has long been a top policy mind in Biden's orbit, will replace Tanden as staff secretary.\"Neera oversaw decision-making processes across my domestic, economic and national security teams,\" Biden said in a statement touting 25 years of public policy experience. \"She was a key architect of the Affordable Care Act and helped drive key domestic policies that became part of my agenda, including clean energy subsidies and sensible gun reform.\"Tanden's predecessor at the domestic policy council, Susan Rice, departed after a two-year term that included wrangling over tense issues from immigration to healthcare, guns and police reform.The move comes as Biden continues to face some headwinds on immigration after promising to roll back almost all of the restrictive policies imposed under his Republican predecessor, Donald Trump. The United States plans next week to",
        "lift COVID-19 restrictionsthat block migrants trying to cross illegally at the U.S.-Mexico border.Tanden, long seen as alightning rodfor her sharply worded tweets, was named to her current behind-the-scenes job after beingforced to withdraw her nominationto be budget chief amid fierce opposition from Republicans and Senator Joe Manchin, a Democrat from West Virginia.While Republicans have attacked Tanden for her left-leaning views, she has also sparred with the progressive camp over her support for Clinton against Senator Bernie Sanders in the 2016 Democratic presidential race, and drew fire for backing cuts to the Social Security retirement program to balance the budget nearly a decade ago. (Reporting by Trevor Hunnicutt; Editing by Chizu Nomiyama)"
    ]
}