{
    "articleURL": "/sciencetech/article-12045907/Film-company-targeted-fake-AI-Benedict-Cumberbatch.html",
    "content": [
        "Fake Cumberbatch voice was ‘100 percent’ realistic star the director saidAI can now clone voices from a three-second sample and bad actors are using itREAD MORE: AI is fueling a rise in online voice scams ",
        "A film production company was targeted by fraudsters using a voice ‘clone’ of Benedict Cumberbatch created by AI, the company revealed to DailyMail.com.",
        "An eerily convincing Benedict Cumberbatch phoned the company to discuss a film deal, says Bob William, screenwriter and director at Peabody Films, a company based in Malaga, Spain.The AI Cumberbatch was ‘100 percent the voice’, says Mr William, adding that the company was convinced it was the real actor at first.When 'Cumberbatch' and his agent refused to meet in-person, they realized the ruse, saving themselves from losing money.But, many others have fallen for similar scams, as AI is opening the door for new tools that bad actors can use to steal money from unsuspecting people. ",
        "'At first, the email seemed like a dream come true. Benedict Cumberbatch had apparently read the script for our upcoming movie and was interested in discussing a potential role,' Mr William said.‘As we read further, we couldn't believe our luck. 'Here was one of the most talented actors of our time, reaching out to us and showing interest in our project.‘We were shocked and disappointed to discover that we had been the victim of an AI program posing as a famous actor.'The director says it’s an ‘example of the increasing sophistication of AI technology and its potential to deceive.’Mr William said they were initially emailed by someone claiming to be the Avengers star's agent, who then suggested setting up a call.",
        "He realized it was a scam when the number he had called from seemed to have too many digits - and the fake ‘Cumberbatch’ was also very reluctant to meet in person. ",
        "These fake accounts are being used for 'romance scams', where a person catfishes a person for money.",
        "The technology to impersonate people’s voices is already here - and already being used by fraudsters.Cybersecurity firm McAfee found that across the US, UK, France, Germany, Japan, Australia and India, ten percent of people have been targeted by an AI voice scam.They show remarkable effectiveness too, with 78 percent of those reported to have been targeted losing money as a result. Earlier this year, Microsoft researchers demonstrated a text-to-speech AI model which can synthesize anyone’s voice from a three-second audio sample.The model, VALL-E, can preserve the speaker’s emotional tone, and can make the person say anything — with its creators suggesting it can be used to create audio content scripted by other AI models.The fake ‘Cumberbatch’ was 100 percent convincing, Mr William said.‘It was the voice. No question about it,’ he continued. 'AI must have been the source. We thought at first it might be a voice actor playing a practical joke - but then it went on and they started asking for money. ‘",
        "The company had several conversations with ‘Cumberbatch’, but then noticed ‘some red flags’, William says - including his reluctance to meet in person.‘There were also some strange requests, such as asking us to pay a sign-up fee of £200,000 before even meeting us in person.’William says he challenged the fake agent about where he had seen the script for the upcoming movie, Emma, which had not been widely circulated.The question was not even acknowledged.When he called the real company switchboard, he asked for James Hayes - but was told that no one of that name worked for the company.William says he believes he was targeted because, as a small production company, they would not have the resources to check the detail.He says he will now notify the company the alleged agent claimed to come from — Conway VanGelder, and says he is considering reporting the attack to the police.AI-generated fake images and audio are already being widely used in business fraud, said AI and fraud expert Alexey Khitrov, Founder and President at ID R&amp;D, speaking to DailyMail.com.He said, ‘We've done a survey there with the enterprise participants. What we've seen is that 42 percent of them have seen the deep fakes being used in fraudulent attempts within their line of work. So it's real, it's there already.’",
        "Peabody Films is an independent production company founded by iconic British film director Barney Platts-Mills, known for award-winning films including Bronco Bullfrog and Private Road.Since Platts-Mills death in 2021, the company has produced feature films including The Way We Are, The Way We Were, slated for release in 2024."
    ]
}