{
    "articleURL": "/tvshowbiz/article-12047103/Chris-Pratt-gushes-father-law-Arnold-Schwarzeneggers-support-means-world.html",
    "content": [
        "Chris Pratt couldn't be more grateful for the support of his father-in-law Arnold Schwarzenegger, who has emerged as one of his most dedicated boosters.",
        "Prior to a special screening at New York City's iPic Theater Fulton Market of his new Marvel film Guardians Of The Galaxy Vol. 3 — which arrives in theaters today — Pratt told People that Schwarzenegger's support for him and his career was 'mind-blowing.''Arnold's support means the world to me on a couple different levels. Just being his son-in-law and being part of his family, it obviously means a lot to have his support,' said the 43-year-old Jurassic World star.'But then on another level, just being somebody who grew up loving his movies, the big action hero — I dreamed of being Commando and dreamed of being the soldier from Predator and I loved Terminator,' he continued. 'So him to give me kudos for going out and being on the marquee is really kind of mind-blowing.'Schwarzenegger, 75, shared his effusive praise for the third and final Guardians film last week on Twitter after getting a chance to see the film.",
        "'I saw #GuardiansOfTheGalaxyVol3 last night and WOW. @prattprattpratt, you crushed it. A non-stop, perfect mix of comedy and action. I loved it and I’m very, very proud of you,' he wrote.Pratt also describe dhow his character Peter Quill, who goes by the name Star-Lord, had changed over the course of a decade filming the trilogy, though his character has also made appearances in the Avengers films Infinity War and Endgame, as well as the latest Thor film.",
        "'The heart of this character, the soul of this character, has always been mine,' Pratt claimed. 'That divine spark that is in me is also in this character.'His different set of life experiences and the circumstances that created him make him different than me, and in the past 10 years, the circumstances that have created me make me different than who I was 10 years ago in that way,' he continued.'So I'm not sure it was so much Star-Lord that changed me — although being cast as Star-Lord has certainly had a profound impact on me and how I manage day to day. And how my grandchildren will be able to go to college,' he joked.Pratt's connection to Schwarzenegger began in 2018, when he started dating the Total Recall star's daughter Katherine Schwarzenegger, whom he shares with his ex-wife Maria Shriver, 67.The lovebirds announced their engagement in January of 2019, and they got engaged in June of that year in Montecito, California.The couple welcomed their first daughter Lyla, two, in 2020, and their daughter Eloise was born on May 21 of last year.Pratt also shares a 10-year-old son Jack from his previous marriage to his former costar Anna Faris from 2009 until their split in 2017. ",
        "He joked that his current wife Katherine usually doesn't watch his films, and that her favorite among them is one of his worst-reviewed efforts.'Her favorite movie [of mine] is Bride Wars. Katherine is a huge fan of Bride Wars. She calls that \"true cinema.\" And I think that might be one of the only movies of mine she's seen,' he joked.The film stars Anne Hathaway and Kate Hudson as best friends–turned–enemies after they both fight to have their dream wedding on the same date. Pratt starred in it as Hathaway's love interest.The movie was savaged by critics and received a measly seven percent rotten rating from the most high-profile critics surveyed by Rotten Tomatoes, though it proved to be a commercial success."
    ]
}