{
    "articleURL": "/news/article-12046687/Clontarf-House-Sydneys-northern-beaches-sells-32million.html",
    "content": [
        "Clontarf Sydney house sells for $32millonLandmark modernist house is on beach Original owners sold for $11million in 2016A stunning Sydney property owned by one of Cambodia's most elite families has sold privately for an eye-watering $32.18million, as the high-end real estate market in the Harbour City continues to boom.",
        "The seven-bedroom modernist design beachfront 'Portovenere' house in the northern beaches suburb of Clontarf is believed to have been bought by a Chinese buyer.The house, which has 3000 square metres of beachfront reserve and includes a swimming pool, half-basketball court, day spa, home theatre, gym, sauna and a cheese room, last sold in 2016 for $11million.Franco Belgiorno-Nettis, who was co-founder of construction giant Transfield, and his wife Amina bought the land in 1952 for £22,500 ($42,390).The house was built in 1961 and the Belgiorno-Nettis family owned the property up until Amina's death. ",
        "It then was sold to Madina Tao and Mongkol Phara, who come from Cambodia's ruling families, the Sydney Morning Herald reported.Tao and Phara gutted the residence and added many of the house's amenities along with with opulent finishes showing off furnishings and decoration by Italian designers Fendi, Versace and Cavalli.The property was listed last June by BlackDiamondz Property Concierge's Monika Tu and Jad Khattar with an asking price of $35million to $38million.At the reported price the Clontarf sale sits near the top of prices for a northern beaches property. The Marara estate in Avalon Beach sold earlier this year for about $40million after being on the market for more than a decade and waste disposal entrepreneur Ian Malouf agreed to pay $40million for his house on Palm Beach in December.",
        "Jennifer Hawkins and her husband Jake Wall, who are both models, are building a mansion on a northern beaches Whale Beach clifftop and reportedly have a buyer willing to shell out $30million for it. However, there have been a number of other lavish Sydney homes on the other side of the harbour that have gone for even more stratospheric amoung. Historic Lavender Bay mansion Idlemere sold for $42.2million in February whie a waterfront house in Vaucluse fetched $40million. A Spanish Mission house in Point Piper was sold for an incredible $69million last week, which puts it in the top 10 priciest Sydney private home sales of all time. "
    ]
}