{
    "articleURL": "/news/article-12058633/Read-Lisa-Wilkinsons-private-emails-prosecutor-pleading-publicly-clear-name.html",
    "content": [
        "Lisa Wilkinson thought her Logies speech was OKLeft out Bruce Lehrmann's name, his charge, and trial details  DPP thought she was 'bragging' about Logies nomination",
        "Lisa Wilkinson made two phone calls and sent three emails begging a top prosecutor leading the trial against Brittany Higgins' alleged rapist to tell the world that she did nothing wrong following her Logies acceptance speech - but he ignored her.",
        "The tv presenter was publicly slammed in June last year after she won the television award for her interview with Ms Higgins on The Project, when the former Liberal staffer first publicly alleged she was raped by Bruce Lehrmann in Parliament House in 2019.During her speech, which was broadcast nationally, Wilkinson appeared to side with Ms Higgins - saying she 'believed' her allegations and thanking her for coming forward. Mr Lehrmann has continually denied any wrongdoing.The speech was delivered eight days before Mr Lehrmann's jury trial in the ACT Supreme Court was due to start, but the hearing was subsequently moved to October because defence lawyers were worried Wilkinson's comments would bias jurors.Wilkinson was widely criticised for being irresponsible due to a comment by the presiding judge, who told the court the journalist was warned against making public comments about the impending court case.However, private emails shown to a Board of Inquiry on Monday revealed Wilkinson did not believe she was warned at all and that the ACT Director of Public Prosecutions Shane Drumgold said her speech did not jeopardise the case.Furthermore, she thought her speech was fine because she was only warned not to ensure she did not do anything to jeopardise the trial - as such, she took care to omit any reference to trial itself, Mr Lehrmann, the charges against him, or Parliament House.",
        "One email shown to the Inquiry was sent by Channel Ten's lawyer Marlia Saunders to Mr Drumgold on December 1 last year - the day before he announced the case against Mr Lehrmann would be dropped due to concerns over Ms Higgins' mental health.It referred to a conversation Ms Saunders had with the DPP on October 24, regarding Wilkinson's Logies speech.'We discussed your intention to make a public statement following the resolution of the Lehrmann proceedings to the effect that no contempt of court was committed by Ms Wilkinson and the DPP has no intention of pursuing contempt charges,' it read. 'I note that you will be making a statement tomorrow at 10am ... I request that consideration be given to you also making a statement in relation to Ms Wilkinson.'Ms Wilkinson is very concerned that the injustice she has experienced be addressed at the earliest convenience.'However, Mr Drumgold told the inquiry on Monday that he did not recall seeing the email, nor did he respond to it.On December 13, Ms Saunders wrote another email on behalf of Wilkinson and asked why he still had not cleared her name - despite their two phone conversations and two emails after June 22.",
        "From Marlia Saunders, on behalf of Lisa Wilkinson, to Shane DrumgoldDecember 1: 'We discussed your intention to make a public statement following the resolution of the Lehrmann proceedings to the effect that no contempt of court was committed by Ms Wilkinson and the DPP has no intention of pursuing contempt charges,' it read. 'I note that you will be making a statement tomorrow at 10am ... I request that consideration be given to you also making a statement in relation to Ms Wilkinson.'December 13: 'Our client continues to be extremely concerned about the targeted, widespread and ongoing media reports which have criticised her role in the three-month delay of the trial.''In this regard, we refer to our phone calls with you on June 22 and October 24 and our emails to you on December 2 and December 6. 'Ms Wilkinson was never warned by you, during your meeting on June 15 2022 or otherwise, not to give a Logies speech,' the email read. 'The reason Ms Wilkinson voluntarily raised the issue of the Logies speech with you during your meeting was because she was concerned to ensure that she did not do anything that may jeopardise the approaching trial.'",
        "'Our client continues to be extremely concerned about the targeted, widespread and ongoing media reports which have criticised her role in the three-month delay of the trial,' it read.She referred to a Microsoft Teams meeting Wilkinson, and her Channel 10 producer had with Mr Drumgold and his junior counsel, Skye Jerome, on June 15 - four days before the Logies.'Ms Wilkinson was never warned by you, during your meeting on June 15 2022 or otherwise, not to give a Logies speech,' the email read.'The reason Ms Wilkinson voluntarily raised the issue of the Logies speech with you during your meeting was because she was concerned to ensure that she did not do anything that may jeopardise the approaching trial.'On Monday, the counsel assisting the inquiry Erin Longbottom grilled Mr Drumgold about whether he responded to Ms Saunders at all, and whether he properly warned Wilkinson about her Logies speech.The prosecutor said he thought she was boasting about her nomination and told her to stop.When Ms Longbottom asked why else Wilkinson would have tried to read her speech to him, if not to ask whether it would cause legal issues, Mr Drumgold said 'I don't know'.'Frankly, when I was hearing it I thought it was Ms Wilkinson pointing out that she was up for a Logie,' he continued.",
        "Walter Sofronoff, who is leading the inquiry, interjected: 'You thought she was bragging about being nominated?'Mr Drumgold replied: 'Of that flavour, yes.'He argued he 'probably' didn't respond Ms Saunders email on December 1 because he was concerned about Brittany Higgins' mental health at the time, and didn't think the emails warranted a response.When asked why he never publicly cleared Wilkinson's name, he told the inquiry: 'I'm not a publicist, I'm the Director of Public Prosecutions.'",
        "Mr Drumgold then said it was not his responsibility to rectify calls for Wilkinson to be charged with contempt because the information was not in the public record.'What you're suggesting is that me, as the DPP, should monitor media and rebut false media,' he told the inquiry.Ms Longbottom and retired judge Walter Sofronoff, who is leading the inquiry, interjected and said that was not the suggestion at all.Mr Sofronoff said: '[In the email] Ms Saunders is putting to you that her client feels she has been treated unfairly. You don't get that every day, do you?'Mr Drumgold said he did not often receive emails like that.The inquiry, which is the Territory's version of a royal commission, will examine interactions between prosecutors and ACT Police regarding the charge against Mr Lehrmann, and the decisions to go ahead with a first trial and then not proceed with a retrial.",
        "Conflict arose between ACT Police and prosecutors about whether it was appropriate for police to interview Ms Higgins for a second time. There was also 'confusion' about whether Mr Lehrmann should be charged.Wilkinson won a news and current affairs Logie award for her interview with Brittany Higgins on The Project in February 2021, during which the former parliamentary staffer first aired her sexual assault allegations against Mr Lehrmann.The ACT government established the inquiry following accusations by police and prosecutors about each other's conduct during Mr Lehrmann's 12-day rape trial. The inquiry will continue on Tuesday. "
    ]
}