{
    "articleURL": "/sport/football/article-12050857/Man-City-Guardiola-hints-hell-heavily-rotate-against-Leeds-tiredness.html",
    "content": [
        "The manager cited the packed fixture list for taking it out of his in-form playersCity continue to compete across three fronts and will face Madrid on TuesdayGuardiola didn't rule out any players' inclusion adding that all were 'ready' Pep Guardiola dropped a major hint that Manchester City may rotate their starting XI heavily against Leeds United on Saturday as the Catalan manager seeks to avoid his players getting 'tired' amidst a packed fixture list. ",
        "Still competiting across three fronts, Guardiola's side will have three days to recover before facing Real Madrid at the Santiago Bernabeu in the first leg of their Champions League semi-final. Speaking ahead of Saturday's home tie against Sam Allardyce's side, Guardiola also shared that he was monitoring the condition of a number of players, including Rodri and Ederson. When asked if he was thinking about the Real Madrid tie on Friday, Guardiola said that he focused much more on the short term. 'No, I'm thinking... it's a lot of games,' Guardiola admitted 'Yesterday I saw the team really tired after the demands from Fulham and West Ham was so big. ",
        "'I'll have to see how the players are, how they recover after just three days; again my decision will be on how their physical and mental [conditions] are to play the game. '[Focusing on] the Premier League is so nice, we want to go four points above Arsenal and all focus is on tomorrow. The coach added that Ederson, who was rested against West Ham as Stefan Ortega started in the 3-0 victory, could be back in contention for the match at the Etihad, but when asked about Rodri – who has started almost every Premier League match this season for the Manchester club – Guardiola said that he would wait and 'see'. ",
        "'We will see today,' he continued. 'We see the training session. Talk to a few players [about how they feel] and we will see.'",
        "Kevin De Bruyne, who has been absent for two games due to injury, could yet make a Premier League return on Saturday after joining training again this week. 'He trained yesterday, Guardiola said of his talismanic midfielder. 'He trained good. Today we are going to train and decide after training.' But Guardiola spared a moment to thank City's backroom staff for ensuring that the players were all fit and firing amidst the fatigue. 'Every player is ready,' he finished. 'Again, doctors, physios, sports scientists [have done] an incredible job this season to keep players fit, and we arrive at the end of the season with almost all the players ready.' "
    ]
}