{
    "articleURL": "/wires/pa/article-12060211/Real-Madrid-s-Luka-Modric-fit-face-Manchester-City-injury-scare.html",
    "content": [
        "Real Madrid’s Luka Modric has been passed fit to face Manchester City in the first leg of their Champions League semi-final on Tuesday.",
        "The 2018 Ballon d’Or winner has been sidelined with an unspecified knock in recent weeks which initial reports suggested could rule him out for the rest of the season.However, the Croatia midfielder has recovered sooner than expected and appeared as a late substitute in the European champions’ Copa del Rey final victory over Osasuna on Saturday.“He can play without problem,” said manager Carlo Ancelotti at his pre-match press conference in the Spanish capital. “He is going to play.”Modric’s return for the clash at the Bernabeu is a further boost to the holders’ confidence on the back of their weekend triumph.Real had lost two of their previous three games in LaLiga but, with the domestic title seemingly destined for Barcelona, it seems Ancelotti has been prioritising the knockout competitions.The Italian said: “We want to play a complete game, to give the best we have. The decisive leg will be over there. We want to go with an advantage.“We want to play well. It is not only about the result, but how we play and if we avoid problems. It will be very demanding.”",
        "The tie is a rematch of last year’s semi-final when Real prevailed in dramatic circumstances in the second leg at the Bernabeu.City had been leading 1-0 on the night and 5-3 on aggregate when they capitulated in added time and conceded twice before losing in extra time.",
        "Since then the treble-chasing Premier League leaders have regrouped and, in new signing Erling Haaland, boast one of the most feared strikers in the game.Haaland has scored a remarkable 51 goals this term and Ancelotti recognises the Norwegian has made an already formidable side even stronger.Ancelotti said: “The team is more complete than last year.“Gabriel Jesus was very dangerous but different to Haaland. The style is the same but they can now take advantage more of long balls and second options.“Haaland is very dangerous. We have to watch him, and it is not just him. They play very good football and we have to work to stop a team that seems unstoppable.“But we have options. We arrive here well, at the same level as last season. What matters is our motivation and winning the cup was a bonus.”"
    ]
}