{
    "articleURL": "/sport/nfl/article-12057149/NFL-San-Francisco-49ers-sign-free-agent-WR-Isaiah-Winstead-highlight-video-goes-viral.html",
    "content": [
        "Winstead played five years of college at Norfolk State, Toledo and East CarolinaThe six-foot-four, 213-pounds wideout grew up poor in Richmond, VirginiaDailyMail.com provides all the latest international sports news The San Francisco 49ers have offered a professional deal to free agent wide receiver Isaiah Winstead after he shared his highlight video on social media -- a day following the end of the NFL Draft. ",
        "The six-foot-four, 213-pounds wideout took to Twitter to show the world his talent on April 30, despite receiving bad news that no team wanted to take a gamble on him. His highlight reel, which lasts barely over a minute, received more than 20.1k likes, 4.7million views, 3,3995 retweets and over 1k comments. In the footage of his fifth season playing college football at North Carolina's fourth-biggest university, the Virginia-native showed off his ability to impressively catch passes with just one hand, drawing comparisons to Baltimore Ravens' new wide receiver, Odell Beckham Jr.. He also showed quick feet, easily beating defensive cornerbacks to get himself wide open. '6'4 210 moving like this,' Winstead captioned his highlight tape on Twitter. 'No mini camp invite or UDFA deal. Behind the scenes on what I can do. With 88 catches &amp; 1100 yds this past season… God makes no mistakes tho thank you in advanced.' ",
        "The former college player later told USA Today Sports that after his clip went viral, that he was on the phone with at least half a dozen NFL teams, as well as interested teams from the Canadian Football League, XFL and USFL.'I've never been one to just give up,' Winstead said. 'Don't feel sorry for me. I'm just going to work. I'm going to get to where I've got to go.",
        "'My situation coming up as a kid, all that stuff – that's what motivated me to at least try to put myself out there,' he added. 'Because I've been through a lot. I came from the bottom of the bottom.'Winstead was raised by his adoptive father, Michael, in Richmond, Virginia, though times were tough and 'we didn't really have nothing,' even alluding to time periods where there would be water or electricity cuts at the family's home. 'I don't really want to get into all the details of what it really was,' Winstead further told USA Today. 'I just always felt like I was destined to be something. I didn't want to be where I came from. I didn't want to be a product of that. I always wanted to be something greater.'After winning a pair of state championships with Highland Springs High, Winstead experienced his first taste of college football at Norfolk State in 2017. He eventually transferring to NCAA Div. 1 Toledo, where he played for two seasons, leaving his mark as one of the team's leaders in receptions. He then enrolled for a fifth season of college football at East Carolina in 2022. There, he was ranked third in the American Athletic Conference in catches (88) and fourth in receiving yards (1,085). ",
        "The two players ending up with more productive statistics in those two categories are Nathaniel Dell and Rashee Rice, who were respectively picked by the Houston Texans and the Kansas City Chiefs in the third and second rounds of this year's draft.",
        "Winstead admitted to expectations of being drafted, too, due to his inspiring season at East Carolina but teams were wary of his speed, despite his athletic frame. NFL scouts were reportedly put off by the wideout's 40-yard dash in 4.7 seconds at the Pirates' Pro Day, according to USA Today. However, 49ers general manager John Lynch told San Francisco-based radio station KNBR that he had always kept an eye on Winstead and didn't need his highlight video to know what the former college player could do. 'Our scouts had just been on him for some time,' he said. 'The 49ers, they're going to get a dog. I'm going to approach practice every day like I've been doing,' a bullish Winstead added. 'It's not like I'm there to be somebody I'm not.''I'm humble. I don't brag on myself. I just wanted a chance.'"
    ]
}