{
    "articleURL": "/sport/football/article-12059161/The-Premier-Leagues-worst-time-wasters-does-club-rank.html",
    "content": [
        "Newcastle were angry about Arsenal's time-wasting in their 2-0 loss on SundayMany have accused Newcastle of hypocrisy given their own 'gamesmanship' The league's worst time-wasters have been revealed, but Magpies are NOT top The Premier League's worst offenders for time-wasting have been revealed - but surprising new data shows that Newcastle are not the biggest culprits despite their criticism for 'gamesmanship' this season.",
        "Time-wasting is dramatically affecting the English top-flight this season, with the average ball-in play percentage lower than France's Ligue 1, Italy's Serie A and the German Bundesliga, with managers constantly complaining about it and referees under pressure to do more to stop it.The issue came to a head once again on Sunday afternoon, with Newcastle United particularly unhappy with the perceived delaying tactics of Arsenal, who beat them 2-0 at St James' Park.Manager Eddie Howe and No 2 Jason Tindall were not afraid to make their frustration known on the touchline, with their players similarly frustrated, though many have accused Newcastle of hypocrisy given their own frequent time-wasting tactics.However, statistics from Opta Analyst have shown the Magpies are not the worst offenders in the division - though their goalkeeper Nick Pope is a serial offender at taking his time with goal-kicks.",
        "Ball-in-play data shows Newcastle spend the least time with the ball on the field in their games, an average of just 52 per cent, 51min 15 sec, with Leeds (52.7 per cent), Brentford (52.8 per cent) and Aston Villa (54.4 per cent) also among the lowest.Manchester City (61.8 per cent) and Liverpool, 58 per cent, are the teams with the highest average ball-in-play time, which makes sense given their preference for quick, incisive play and their trust in their team to deliver. ",
        "But it takes two to tango. It is also possible that in Newcastle's games, their opponents are equally, if not more, complicit in slowing the game down - as Crystal Palace did in securing a 0-0 draw on Tyneside earlier this season.So it is more revealing to isolate individual teams based on how long they take on average to restart the game (after getting throw-ins, goal kicks and free kicks, for example). In that graphic, Newcastle are still pretty culpable, but are not the biggest time-wasters. That dubious honour belongs to Thomas Frank's streetwise Brentford, who take an average 31.4 seconds to restart play.In the below chart, the 'delay' marks the average time between the ball going out and play recommencing across corners, free kicks, throw-ins, goal kicks, kick-offs, penalties and drop balls.Howe and Co trail them on 29.9 seconds, marking them as the second-worst team in the division and suggesting their players and staff do not have a leg to stand on when complaining about Arsenal doing the same thing on Sunday.",
        "Different teams use different techniques to time-waste, the statistics show.Newcastle take by far the longest to restart after a goal kick, with their goalkeeper Nick Pope clearly the worst in the league. Everton's Jordan Pickford and Brentford's David Raya are also among those who have the biggest delays.",
        "Among teams who have taken more than 10 goal kicks in a game, Palace's Vicente Guaita took an average of more than a minute (63 seconds) over every goal kick - ironically, at Newcastle - giving them a taste of their own medicine. While Bees stopper Raya burned a whopping 13 minutes and 29 seconds from goal kicks in their 2-0 win against West Ham.From throw-ins, Leicester (13.7sec) are above the usual quickest two sides Manchester City (14sec) and Liverpool, a clear tactic to get things going swiftly and try to catch their opponents cold.The Reds, who have been praised for their innovation in hiring a specialist throw-in coach Thomas Gronnemark, are third with an average delay of just 14.3 seconds. Brentford (18.7sec) - perhaps unsurprisingly - take the second-longest, while struggling Southampton (18.9sec) are the biggest delayers when it comes to throw-ins."
    ]
}