{
    "articleURL": "/wires/reuters/article-12052331/U-S-finalize-rule-May-11-limit-asylum-access-Mexico-border.html",
    "content": [
        "By Ted Hesson",
        "WASHINGTON, May 5 (Reuters) - The U.S. will finalize by May 11 a new regulation that will deny asylum to many migrants caught crossing the U.S.-Mexico border illegally, the same day sweeping COVID-19 restrictions at the border are set to end, Homeland Security Secretary Alejandro Mayorkas said on Friday.Under the new regulation, migrants will be presumed ineligible for asylum if they passed through another country en route to the U.S. without seeking protection or if they failed to use other legal pathways to the United States.The measure is a key part of U.S. President Joe Biden's plan to address an expected rise in illegal immigration when COVID restrictions known as Title 42 end next week, along with the broader pandemic public health emergency.The administration is encouraging migrants to use legal pathways to enter the country or face new, sped-up deportation processes that will come with the implementation of the asylum rule.Title 42 was first implemented in March 2020 at the beginning of the pandemic to stem the spread of the coronavirus in crowded detention settings. It allows border agents to rapidly expel many migrants to Mexico.Its repeal is expected to lead to a rise in border arrivals as a result of pent-up demand and the perception among migrants that they will be allowed in.",
        "The anticipated increase in border crossings will be \"extremely challenging,\" Mayorkas said during a press conference in Brownsville, Texas.The Mexican government will step up border security in southern Mexico as part of an agreement reached this week, Mayorkas said. Mexico's Defense Ministry said it did not have information on the matter.Migrant arrests at the U.S.-Mexico border have risen in recent weeks, which Mayorkas attributed to a spike in Venezuelan crossers.Also ahead of Title 42's end, the Biden administration is expanding access to CBP One, an app that allows migrants to schedule an appointment to approach a border port of entry.Beginning May 12, roughly 1,000 appointments will be available each day, according to U.S. Customs and Border Protection (CBP). (Reporting by Ted Hesson in Washington; Additional reporting by Paul Grant in Washington and Daina Beth Solomon in Mexico City; Editing by Mica Rosenberg and Rosalba O'Brien)"
    ]
}