{
    "articleURL": "/femail/article-12039201/Im-chef-heres-make-vegan-caviar-just-26-using-chia-seeds.html",
    "content": [
        "California-based chef Lexy has revealed a vegan recipe that's a caviar alternativeShe and her pal, Amy, made the fish-free dish for under $30 in a YouTube video  Herbivores will need soy sauce, ginger, chia seeds and sushi nori for the recipeA chef has given all vegans and vegetarians a way to indulge in the delicious taste of caviar by making a cheaper fish-free alternative to the costly seafood dish. ",
        "California-based culinary expert Lexy is helping herbivores enjoy the tastiness of caviar sans fish with her vegan recipe that costs less than $30.Instead of paying anywhere from a few hundred to a few thousand dollars for a pound of the delicacy, you can now spend $26 on a near-exact replica of caviar. Made from soy sauce, chia seeds, water, and sushi nori, this recipe will have you questioning why you ever coughed up the cash for the pricey fish dish.",
        "Ingredients:One cup of water1/4 cup of soy sauce 1/2 teaspoon of gingerOne large sheet sushi noriFour tablespoons of chia seedsRecipe:Whisk together 1/4 cup of soy sauce, one cup of water and 1/2 teaspoon in a bowl Break up the sushi nori into small pieces with your fingers and add them into the bowlStir the liquid mixture until it's dissolved as much as possibleAdd four tablespoons of chia to the mixture and let it sit for one to two hours before indulging",
        "In a YouTube video, Lexy and her pal, Amy, showed their subscribers how to cook up the delicious alternative. 'We are going to make some vegan caviar dupe,' the chef said as she and Amy headed to Whole Foods to pick up the ingredients.The two pals grabbed sushi nori ($5.79), chia seeds ($8.79), and minced ginger ($4.79). They also purchased rosemary crackers ($5.29) and French bread ($2.49) to spread the caviar alternative on.Amy and Lexy put their savvy skills to the test and spent just $26.15 in total. As soon as they arrived home, the duo got straight to cooking.They began by whisking together 1/4 cup of soy sauce, one cup of water, and 1/2 teaspoon of ginger in a bowl. After using their fingers to break up one large sushi nori sheet, they added the chunks into the bowl.",
        "They stirred it into the liquid mixture until it was dissolved as much as possible.While preparing the fish-free dish, they gushed about how much they loved cooking.Lexy even compared her cooking style to having magical powers. 'I feel like I didn't tap into my true witch capabilities until I started cooking again and baking specifically,' she said.'There's just a connection to something.'Amy agreed, adding: 'Especially when you take things out of your witch cupboard, and they all come together to magically make something they were not prior.'",
        "After discussing their love of putting ingredients together to make meals, they got back to cooking their vegan caviar.  They mixed four tablespoons of chia seeds into the bowl before setting the mixture aside for one to two hours to allow the chia seeds to absorb the liquid.The two even made a dairy-free version of crème fraiche to pair with the vegan caviar.To make the crème fraiche they used one cup of raw cashews, 1/2 cup of water, 1/4 cup of fresh lime juice, and 1/2 teaspoon of salt.Amy and Lexy began by soaking the cashews in boiling water for about 30 minutes. ",
        "Then, they added the soft cashews, lime juice, and salt to the blender. The duo added water in increments beginning with 1/4 and increased by tablespoons until the mixture reached a creamy consistency. ",
        "Finally, they were ready to eat their vegan-friendly dish.'I like to prepare for the perfect bite,' the chef said as she spread crème fraiche and the fish-free caviar on a piece of bread.The two pals described their dish as having the 'same flavor' as caviar and rated it a '10 out of 10' because the snack was both healthy and delicious. "
    ]
}