{
    "articleURL": "/wires/reuters/article-12043733/Green-Thumb-revenue-rises-US-states-allow-marijuana-use.html",
    "content": [
        "By Mrinalika Roy",
        "May 3 (Reuters) - Green Thumb Industries Inc reported higher first-quarter sales on Wednesday, as customer traffic rose at the cannabis producer's retail stores after more U.S. states legalized the recreational use of marijuana.The company said its quarterly revenue grew despite continued price compression, helped by strong business performance in states like New Jersey, Rhode Island, Connecticut, Virginia and Minnesota.Its total revenue for the quarter rose 2.4% to $248.5 million from $242.6 million last year.Same-store sales, which account for sales in stores open for more than a year, in the quarter rose 6.3% from a year earlier.\"There's demand from Americans for cannabis products and we continue to execute,\" CEO Ben Kovler told Reuters.The Chicago-based company, however, reported a decline in net income, blaming pressure from the tax regime that continues to be unfavourable for federally illegal businesses like cannabis.Still, adjusted earnings before interest, tax, depreciation and amortization (EBITDA) rose 13.7% to $76.2 million.\"For us to be able to year-over-year expand the margin 300 basis points with pricing pressure is a pretty good situation. Keep in mind pricing is down about mid-teens across the country,\" Kovler said.The cannabis industry is in a tight spot due to the lack of access to capital and the banking system, but Green Thumb has continued to generate positive cash flow, which the company said it would invest in building facilities.",
        "\"Our $185 million cash balance continues to give us the optionality to make investment decisions that will position us for the increasing demand for legal cannabis, a market estimated by analysts to grow to $75 billion over the next decade,\" Kovler added.Capital expenditure is expected to be about $150 million or more for 2023, Kovler said, compared with $240 million last year. (Reporting by Mrinalika Roy in Bengaluru; Editing by Shweta Agarwal)"
    ]
}