{
    "articleURL": "/health/article-12054327/Sex-SIXTIES-romance-alive.html",
    "content": [
        "I will never forget the woman who came to see me with agonising hip pain after what she called a ‘sex injury’. In the heat of the moment, she had rolled on top of her new partner when both of her hips went into full muscle spasm.",
        "She collapsed in an inglorious heap, yelling in pain. Let’s just say she quickly realised she wasn’t as flexible as she used to be.Fortunately, she was able to laugh it off. Even her partner saw the funny side.These kinds of injuries can be a problem for older adults – and they’re becoming increasingly common.Why? Because older people are having sex more than ever before. Advances in medicine are keeping people healthy well into their golden years, and treatments such as hormone replacement therapy (HRT) and erectile dysfunction drugs are also helping to maintain libido.",
        "Put that alongside the fact that divorce rates have doubled since 1993 and the rise of dating apps means new romances are easy to embark on. It’s no surprise more older people are looking for love.On the whole, it’s a great thing.There’s evidence that a healthy sex life can protect against a host of chronic illnesses, including cancer, and can make you happier. But, as a family doctor with 20 years’ experience specialising in sexual health, I see many older adults being over-enthusiastic, without much consideration for what might go wrong.And quite a lot can go wrong.Aside from sex injuries, I have seen the rapidly rising tide of sexually transmitted infections among older adults. They’re at an all-time high both in the UK and the US, where I have a practice in North Carolina.",
        "In England alone, cases of common STIs such as chlamydia and gonorrhoea jumped by a fifth in the over-65s between 2017 and 2019. It means the baby boomer generation, who explored free love in the 1960s, are now one of the fastest growing demographics contracting STIs.The good news is that most can be treated and cured.But if left untreated, some can cause long-term health complications – and even kill.Other sex-related ailments such as injuries can also be easily avoided with a little know-how.Simple modifications – such as keeping kneeling to a minimum if you’ve had a knee replacement or sticking to comfortable positions which don’t put you at risk if prone to back injuries – can allow you to pursue your relationships with age-appropriate vigour.Below is everything you need to know for a long, exciting and safe sex life – in your 60s and beyond.There are a host of new STIs on the blockThe most common sexually transmitted infections are still gonorrhoea, chlamydia and syphilis. But there are others to add to the list.Something called mycoplasma genitalium, or Mgen, has cropped up recently. It’s a bacteria that can cause the urethra – the tube through which urine leaves the body – and, in women, the vagina, to become inflamed, causing all sorts of symptoms.",
        "Men can experience pain when going to the toilet, while women tend to suffer abnormal bleeding. It can cause an unusual discharge in both men and women.Make sure you get tested for Mgen and many others at a sexual health clinic. Another new infection is Monkeypox, which was first identified as a sexually transmitted infection in the UK last year and has affected around 3,500 people in England, according to Government figures.It has mostly been identified in gay men and can be spread by kissing, cuddling and sharing towels, as well as through sex.The virus causes fever-like symptoms at first but after a few days patients develop a rash that looks similar to chicken pox. Call a sexual health clinic and get vaccinated if you’re at risk.",
        "One that few people have heard of is trichomonas – a relatively common infection caused by a nasty parasite. It can go undetected in men but causes an internal rash, inflammation and unusual discharge in women.I recently treated a 67-year-old happily married woman who tested positive for this, thanks to her husband’s secret affair.Happily, the vast majority of STIs can be treated with a simple course of antibiotics.Having said that, cases of drug-resistant infections are on the rise, due to the global over-use of antibiotics. In 2019, doctors reported the first drug-resistant case of gonorrhoea in the UK, which some experts called ‘super gonorrhoea’.",
        "So, better to avoid the infection in the first place. The most effective way is by using a condom.It’s also worth knowing that sexually transmitted infections can also affect areas other than the genitals, such as the throat.Human papillomavirus, or HPV, is a cancer-causing virus that spreads via sexual acts. And some types of HPV can lead to throat and mouth cancer.Rising rates of head and neck cancers in middle-aged adults are said to be mostly HPV related.The best way to protect yourself is by using a condom during all sexual acts.Be aware of DIY fixes for little leaksOf all the bonkers home remedies I’ve heard, the most absurd has to be one patient’s intriguing DIY treatment for incontinence.The problem, which affects a fifth of women over 65, can destroy confidence in the bedroom, making intimacy virtually impossible.But one woman I knew came up with what she thought to be a genius solution. Like many women who have had children, her leaking was caused by an organ prolapse – where one of the pelvic organs, such as the womb or bladder, drops down and bulges into the vagina.",
        "So she inserted an object to keep things in place. Her choice? A potato. Please don’t do this!",
        "While this is an extreme example, it illustrates the astonishing levels women go to to avoid telling doctors about these types of problems, because of embarrassment. Incontinence is so common – particularly during sex. The loss of the sex hormone oestrogen during menopause can cause many women to leak urine during orgasm. Usually a GP can offer a solution.If a prolapse is the problem, losing weight or eating a high-fibre diet to avoid constipation and unnecessary straining can help.Others might be better suited to physiotherapy to strengthen their pelvic floor muscles or an oestrogen cream – which reduces the feeling or urgency. There are also vaginal pessaries – rubber or silicone devices that support the vaginal walls and pelvic organs.In the most severe cases, surgery might be necessary to lift and stitch the pelvic organs in place or to remove the womb altogether.For other forms of incontinence, drugs can be given. Some reduce the impulses passing from the bladder to the brain, while others relax the muscles around the bladder, allowing it to hold more liquid.Make sure to start early with lubricant  It is no secret that sex can be more uncomfortable as women get older. The drop in the female sex hormone, oestrogen, causes the vaginal tissue to become dry, thin and sore. Sometimes these changes impair sensation and friction that used to feel amazing suddenly burns. The friction that comes with sex can create tiny tears in the genital tissue that make it more prone to infection.",
        "If women ask their GP for help with this, they will most likely be told to try a lubricant. Those without flavourings or scents will reduce friction without irritating the skin further.",
        "HRT and oestrogen creams can help too, by injecting moisture back into the skin.The problem is, a lot of patients wait too long before asking for help. It means many end up giving up on sex – and feeling miserable as a result.Some women eventually develop something called vaginal adhesion, where the tissue is so damaged the vaginal opening seals up.A friend of mine in her 70s attempted sex for the first time in nearly two decades and found it impossible – despite using two different types of lubricant. Her doctor later diagnosed adhesion.Don’t wait to seek help – the problem will only get worse.The pros and cons of dating apps Dating apps are said to be behind a surge in over-65s getting married, as ‘silver splitters’ – divorced older people – seek new chapters in their lives.It doesn’t just have to be about romance: they can help find tennis partners, dinner dates, travel companions and mentors.One of my patients, 71-year-old Alexa, created a profile on one popular app to find a new companion after her husband died.Her husband had been ill for many years and their fabulous sex life had waned. Alexa assumed sex was over for her.She ended up being pleasantly surprised when she met a man on the dating app who she connected with both physically and emotionally. They are still together after three years.",
        "But do a bit of digging before you agree to meeting someone in person. Catfishing is the term used to describe the phenomenon where someone creates a false persona to lure people into their lives.Perhaps they delight in manipulating others, or are scammers or financial predators. It could just be a harmless attempt to reinvent themselves. But the outcome is rarely good.Try to confirm someone is who they say they are, using social media platforms or a business website. And always tell a trusted person your whereabouts if you meet a stranger.Bear in mind that the apps can become addictive. It is also tempting to engage in more risky or compulsive behaviour when communicating through a screen. Try to limit your swiping time to a few minutes a day.But the apps aren’t everything. These days, there’s a dating website for every group – from sports fanatics to dog lovers.The world is your romantic oyster. But as with anything, always remember to be careful.Never Too Late by Dr Shannon Dowler is published by Johns Hopkins University Press and available at WHSmith, priced £16.50."
    ]
}