{
    "articleURL": "/femail/article-12051597/Relive-horrifying-tale-killer-Menendez-brothers-murdered-parents-alleged-abuse.html",
    "content": [
        "Lyle, 55, and Erik Menendez, 52, were convicted in 1996 of killing their parentsThey said their dad, Jose Menendez, abused them for years before the murdersNetflix is now retelling the story - amid new evidence that has reignited the case Netflix is set to lay bare the horrifying story of the killer Menendez brothers - who gunned down their own parents in their Beverly Hills mansion, but claimed they were driven to murder after facing a lifetime of physical, emotional, and sexual abuse.",
        "Lyle, 55, and Erik Menendez, 52, were convicted in 1996 of brutally killing their father, Jose Menendez, a powerful music executive, and their mother, Mary Louise 'Kitty' Menendez, a former beauty queen.During the trial, the siblings told a disturbing tale of how they were molested by their father from a young age, and were forced to touch one another when they were little - ultimately leaving them fearing for their life and desperate for a way out.While the two men were ultimately found guilty and their claims of abuse ruled inadmissible by a judge, the sensational story captured the nation, leaving many divided over whether or not they deserved to spend the rest of their lives in jail.",
        "Now, Netflix is going to break down the haunting murders and recap the dramatic trial from start to finish in the upcoming second season of its anthology series Monster.Helmed by Ryan Murphy, the show will premiere in 2024 and pose as a follow-up to his highly successful Dahmer - Monster: The Jeffrey Dahmer Story. Separately, the streaming giant is also working on a feature-length documentary on the brothers.The announcement comes amid a shocking new update to the Menendez siblings' case.Nearly three decades after they were both found guilty of first degree murder and sentenced to life in prison without parole, former Menudo singer Roy Rossello made the bombshell accusation that Jose had sexually assaulted him when he was a teen.",
        "Speaking in a recent three-part Peacock docuseries about the band, entitled Menendez + Menudo: Boys Betrayed, Roy - who performed with the group from age 13 to 16 - alleged that Jose anally raped him twice when he was 13 or 14.In the Peacock doc, Erik and Lyle said Roy's allegations against their father could have made an 'enormous difference' at their trials, and that they hoped it would help them get the case reopened. 'Frankly I feel horrible. It's sad to know that there was another victim of my father,' Erik said.'I always hoped and believed that one day the truth about my dad would come out but I never wished for it to come out like this the result of trauma that another child has suffered and it makes me very sad. '",
        "Lyle added: 'It's pretty overwhelming to hear that. We'd heard rumors that something might have happened through the years.'It's a remarkable thing to happen so many decades later. That would have made a difference at trial.'Certainly, that would have made an enormous difference because the entire trial centered on the belief of these events. Hopefully it will make a difference [now] - you think in a fair world it would.'",
        "Days after the documentary premiered, the Menendez's lawyers filed a petition seeking their release from prison, citing newly discovered evidence that supports their claims of sexual abuse by their father - a letter Erik sent his cousin Andy Cano about eight months before the killings. ",
        "'I’ve been trying to avoid dad. It’s still happening, Andy, but it’s worse for me now. I can’t explain it. He so overweight that I can’t stand to see him,' the chilling, hand-scrawled message reads.'I never know when when it’s going to happen and it’s driving me crazy. Every night, I stay up thinking he might to come in. I need to put it out of my mind.'I know what you said before but I’m afraid. You just don’t know dad like I do. He’s crazy. He’s warned me a hundred times about telling anyone, especially Lyle.''The theory of defense at both trials was straightforward. Neither Erik nor Lyle denied the shooting,' the new court filing reads. 'Instead, the crime was manslaughter, not murder. The killings occurred in imperfect self-defense, after a lifetime of physical and sexual abuse from their parents.'The state’s theory in both trials was also straightforward. Erik and Lyle were lying about the sexual abuse. It never happened.'They had killed their parents not in imperfect self-defense, but to inherit their parents’ money.",
        "'Had jurors seen the letter Erik Menendez wrote to Andy Cano, and learned that Jose Menendez anally raped and orally copulated a 13 or 14 year-old boy in 1984, the prosecutor would not have been able to argue that “the abuse never happened.\"'",
        "'In short, the new evidence not only shows that Jose Menendez was very much a violent and brutal man who would sexually abuse children, but it strongly suggests that - in fact - he was still abusing Erik Menendez as late as December 1988. Just as the defense had argued all along.' Jose had immigrated from Cuba to the US as a teen, and met his future wife Kitty while he was a student at Southern Illinois University. The two married in 1963 and moved to New York City soon after. They welcomed their first son, Joseph, who goes by his middle name, Lyle, in 1968, followed by Erik two years after that.After becoming parents, the couple relocated to New Jersey with their two young kids.Kitty quit her job as a teacher to focus on raising their two kids, while Jose's career continued to flourish.He first started of working for the car rental company Hertz, where he quickly rose through the ranks - and by 1979, he was the brand's worldwide general manager. He eventually left Hertz to work for RCA records, where he managed bands like Eurythmics and Menudo.",
        "In 1986, the family moved to Beverly Hills, California, and three years later, he landed a job at the film studio Carolco Pictures.",
        "On the outside, the Menendez family seemed like an average, happy household, but behind closed doors, the brothers claimed they faced years of trauma at the hands of their father.",
        "On August 20, 1989, Lyle, a then-22-year-old Princeton student, and Erik, a then-19-year-old professional tennis player, walked into the den of their $5 million Beverly Hills mansion and shot Jose point blank in the back of the head, before turning the gun on their mother as she tried to run from the room. In total, they shot Jose five times and Kitty nine. Prosecutors believed that Lyle and Erik killed their parents because they wanted unfettered access to their $14 million estate. Both bought Rolex watches, condominiums, sports cars, and expensive other items in the months after the murders.The brothers had two trials - the first had a hung jury and was ultimately ruled a mistrial, but when they were retried together in 1996, they were found guilty.During the first trial, the brothers claimed that they confronted their father about his alleged abuse, and he became enraged – forcing them to kill out of concern for their safety. Their cousin testified that when Erik was 13, he came to him and told him that his father Jose was touching and 'massaging' his genitals, asking if that was normal. ",
        "Another one of their cousins' named Diane Vander Molen, also said that Lyle spoke about the abuse to her when he was eight years old, and that she went to his mother about his confession, but was told he was lying. "
    ]
}