{
    "articleURL": "/wires/ap/article-12038879/White-Sox-activate-SS-Tim-Anderson-flurry-moves.html",
    "content": [
        "CHICAGO (AP) - Tim Anderson is back, and he is looking to bring his usual positive energy to the Chicago White Sox.",
        "The All-Star shortstop also realizes his own limitations.\"I´m just one guy. I´m one guy and I come to the ballpark every day to do my job,\" he said.Anderson returned to the White Sox on Tuesday, part of a flurry of moves by the sputtering ballclub.Anderson and infielder Hanser Alberto were reinstated from the 10-day injured list. Anderson sprained his left knee on April 10 at Minnesota, and Alberto is coming back from a strained left quad.Chicago also optioned rookie outfielder Oscar Colás and infielder Lenyn Sosa to Triple-A Charlotte. The 24-year-old Colás, one of the team's top prospects, hit .211 with a homer and seven RBIs in 25 games in his first stint in the majors.",
        "\"He wasn´t producing the way we anticipated and that happens,\" first-year manager Pedro Grifol said. \"This is a tough level to play at. Some guys get here and produce right away, some guys don´t. Some guys need to go back down and continue to develop.\"With Colás back in the minors, Gavin Sheets, Eloy Jiménez and Adam Haseley likely will get most of the time in right field.Sheets was in right and Jiménez was the designated hitter for Tuesday night's 3-2 victory over the Twins. Anderson, Andrew Benintendi and Luis Robert Jr. also were in the lineup. It was the first start for Benintendi since he was hit by a pitch Friday, and Robert was limited to pinch-hitting duties Sunday because of some right hamstring tightness.",
        "Veteran reliever Alexander Colomé, outfielder Billy Hamilton and left-hander Sammy Peralta were promoted from Charlotte. Reliever Joe Kelly was placed on the paternity list, and utilityman Romy Gonzalez went on the 10-day IL with right shoulder inflammation.The White Sox also designated relievers Jake Diekman and Frank German for assignment. Diekman, a lefty who was acquired in an August trade with Boston, is 0-1 with a 7.94 ERA in 13 big league appearances this season.\"He´s going to correct some things in his delivery and his mechanics and he´s going to find himself in another place and he´s going to do what Diekman does,\" Grifol said. \"He´s had a really good career and he´s got something left in the tank as well.\"Depending on how the situation with Diekman is resolved, the White Sox could owe the reliever as much as $3,879,032 remaining under his contract.Chicago had dropped 10 in a row before rallying for a wild 12-9 victory against Tampa Bay on Sunday.The return of Anderson could provide a big lift. The White Sox went 3-15 while Anderson was on the IL.\"We've got a long season ahead. We got time to catch up,\" said Anderson, who went 0 for 4 with a 12-pitch walk in the win against the Twins. \"I think that´s enough. Just try to bring positive energy and have fun.\"",
        "The 29-year-old Anderson got off to a strong start this season, batting .298 with four RBIs and five steals in his first 11 games. He hit a major league-best .335 in 2019.\"We go as he goes. He´s a table setter, he´s a leader. He´s Tim Anderson,\" Grifol said. \"He´s a big part of what we do here, a big part of who we are.\"Alberto, 30, went on the IL on April 16. He is hitting .200 with a homer and four RBIs in nine games in his first season with Chicago.The 34-year-old Colomé signed a minor league deal on April 6. He made eight appearances for Charlotte, going 1-0 with a 3.38 ERA and a save.Under Colomé's one-year contract, he is paid $1 million while he is in the majors and $168,000 in the minors.Colomé also played for the White Sox in 2019 and 2020, going 6-5 with a 2.27 ERA and 42 saves in 83 appearances.___Follow Jay Cohen at https://twitter.com/jcohenap___AP MLB: https://apnews.com/hub/MLB and https://twitter.com/AP_Sports"
    ]
}