{
    "articleURL": "/wires/pa/article-12050413/Incredible-talent-Tao-Geoghegan-Hart-return--Alberto-Contador.html",
    "content": [
        "Tao Geoghegan Hart can show he is back to his best at the Giro d’Italia over the next three weeks, according to two-time former winner Alberto Contador.",
        "Londoner Geoghegan Hart enjoyed his breakout moment at the pandemic-affected 2020 edition of the Italian Grand Tour, claiming the pink jersey on the final day by beating Jai Hindley in the decisive time trial in Milan.Since then, the 28-year-old has endured a difficult period with illness and injury, but last month he took two stage wins and overall victory at the Tour of the Alps last month – his first general classification win since the Giro.Geoghegan Hart will go into the Giro as a co-leader of the Ineos Grenadiers alongside 2018 Tour de France winner Geraint Thomas, 36, while the squad also includes emerging talent Thymen Arensman.“I think that the 2020 Giro was a little bit different (because of Covid-19) but we know that Tao has an incredible talent,” Contador told the PA news agency.“At the Tour of the Alps he was very strong. Many riders that will be at the Giro were there and he won two stages and also the GC so for sure he is a good option and Tao can come back at the top.”But, although Geoghegan Hart is seen as a contender, the main focus going into the race is on world champion Remco Evenepoel and three-time Vuelta a Espana winner Primoz Roglic.",
        "“Everyone expects a big battle between Remco and Roglic but there are some up riders who can shake things up like Arensman, Thomas, (Joao) Almeida, and Tao, and they can make things difficult for the two big favourites,” added Contador, part of Eurosport’s analysis team for the race.",
        "“If those two riders make a mistake they can have their chance. I cannot give to you one name. Both are very strong in the time trials and also the climbs, but the important thing in the Giro is always to not have a bad day as you can lose many minutes.”An imposing Giro route – which covers a total of 3,489 kilometres and includes 51,400 metres of climbing – begins with an 19.6km time trial from Fossacesia Marina to Ortona on Saturday, the first of three time trials that cover a total of 73km over the three weeks.There are also summit finishes on the Crans Montana, Monte Bondone, Val di Zoldo and Tre Cime di Lavaredo, plus seven stages of more than 200 kilometres and four others that come within a whisker, promising a gruelling three weeks for those intending to go all the way to Rome.“This year the Giro comes back to the old style, the traditional long stages, days with more than 5,000 metres of climbing and 11 stages close to 200 kilometres,” Contador said. “It will be very important to recover day by day because the last week is normally the hardest week.",
        "“I think the last time trial (18.6km from Tarvisio to Monte Lussari Tudor on stage 20) will make the difference because some riders can lose everything there.”Contador won the Giro in 2008 and 2015, part of a career that also brought two Tour wins and three Vuelta crowns. The Spaniard was additionally stripped of the 2010 Tour and 2011 Giro title after testing positive for clenbuterol.“For me, the Giro is my favourite race for sure,” he said. “I was there my first time in 2008, going at the last minute because of a sponsor, and three weeks later I won the Giro. The Tifosi love me and for me it is the most beautiful because you can break from the script and go on the attack.“The Vuelta is special for me, my home race, and the Tour de France is the biggest race in the world, but my favourite is the Giro.”:: Watch live and exclusive coverage of the Giro d’Italia on Eurosport, discovery+ and GCN+"
    ]
}