{
    "articleURL": "/wires/reuters/article-12054383/Prince-Harry-takes-seat-King-Charles-coronation-no-balcony-appearance.html",
    "content": [
        "By Suban Abdulla, Farouq Suleiman and Hani Richter",
        "LONDON, May 6 (Reuters) - Prince Harry, the younger son of King Charles III, attended his father's coronation in Westminster Abbey on Saturday although he sat in the third row and did not appear on the Buckingham Palace balcony at the pinnacle of the celebration.It had been unclear until early April whether Harry, who now lives in California, would attend the historic occasion following a very public falling out with his family.The 38-year-old army veteran who served in Afghanistan arrived in the abbey smiling and dressed in a morning suit, wearing his medals on his chest. His wife Meghan and two young children remained in the United States.He played no formal role in the service and watched on while his elder brother William, the heir-to-the-throne, knelt before his father to pledge his loyalty as his \"liege man of life and limb\", a moment that was greeted by cheers from crowds outside.He was later absent from the palace balcony as Charles and Camilla joined William and his family, two of Charles' siblings and the page boys from the service to wave to the crowds.Charles' disgraced brother Andrew who was forced to quit royal duties because of his friendship with late U.S. financier Jeffrey Epstein, a convicted sex offender, was also not present on the balcony.",
        "DIVIDED OPINIONHarry was once one of the most popular members of the royal family and his wedding to Meghan, a U.S. actor, at Windsor Castle in May 2018 was a grand affair which drew enthusiastic crowds. But his decision to quit royal duties and the rift with his family has divided public opinion. Lisa Penny, 53, a supermarket worker from Dorset, said it still felt a \"bit raw\" after everything that had been said. \"I think he's done a fair amount of damage and I think they need a bit of time to get over that.\"She added though: \"I'm pleased he is here for his father.\"Others said they were happy to see him there, noting that no one really knows what goes on behind closed doors with families.Jacqueline Brown, 28, a museum caretaker who had come from Missouri in the United States to witness the events, was one who was pleased to see him there.\"He's the king's son, he should be here to support him. It's nice he's doing that despite everything,\" she said.Jeremy Roberts, 39, said \"every family has their own issues, and this just plays out in the media unfortunately.\"In his book \"Spare\", published in January, Harry criticized his father, his stepmother Queen Camilla, and his brother Prince William, and accused the institution of treating he and his wife without compassion.",
        "Harry, known officially as the Duke of Sussex, moved to the United States with Meghan in 2020 and has only been seen back in Britain on a handful of occasions. His eldest son Archie was celebrating his fourth birthday on Saturday and Harry was thought to be keen to return as soon as possible.(Writing by Angus MacSwan and Kate Holton, Editing by Alexandra Hudson)"
    ]
}