{
    "articleURL": "/news/article-12044521/Sydney-teen-Jessica-Boatwrights-desperate-plea-mum-dumped-newborn-Blacktown-home.html",
    "content": [
        "Hunt for mum of abandoned baby continuesSydney teen joins calls for woman to come forwardJessica was abandoned as a baby 18 years agoHopes the baby girl will get the answers she needsA teenage girl who was abandoned as a newborn has issued a heartfelt plea to the mother who dumped her baby in a complete stranger's backyard.",
        "It's been almost fortnight since a western Sydney family came across the shocking discovery of a naked baby girl barely an hour old lying in a chair on their Blacktown back patio, still covered with birth fluids and with the umbilical cord still attached.The mother is yet to come forward, despite assurances from police she isn't in any trouble and that they just want to know she's okay as detectives continue to trawl through hours of CCTV.The harrowing story has struck a chord with Jessica Boatwright, 18 years after she made headlines as a newborn when she was dumped by her own mum in the emergency department of a Sydney hospital.She pleaded for the woman to find the courage to come forward and not go through life wracked with regret.",
        "'Just even knowing a name or even a photo would help this child move through life,' Jessica told A Current Affair.'I thought straight away of the mother, that's all I thought, 'wow, the emotions she must be feeling right now'.'She deserves all the love in the world. That mother-daughter connection is something that you cannot recreate.'She also issued a plea to anyone with information about the newborn girl before she was dumped in the Blacktown backyard on April 21.",
        "'Even if you have the smallest, smallest bit of information, it would help this child's life and help complete her story,' Jessica said.The 13-day-old baby remains in Blacktown Hospital where she's said to be doing well. She'll be cared for by the Department of Communities and Justice after she's discharged from hospital unless the mother comes forward.Jessica is grateful the mother left the baby in a child-friendly backyard filled with play equipment, children's bikes and toys.",
        "'This mother could have left this baby anywhere but she thought intuitively like a mother,' Jessica said.'That actually resonates with me as I was left in a hospital, one of the safest places you could leave a newborn.'So I'm grateful for that mother that she still had some love for that baby to leave in a safe place or a place she thought where she would be safe.' With the full support of her adopted parents, Jessica, then aged 14, broke hearts across Australia in 2019 when she launched a public appeal to track down her biological mother.She broke down while watching CCTV for the first time of her mum entering the Liverpool Hospital emergency department in the middle of the night in 2005, cradling her newborn daughter wrapped in a towel before sneaking out without her baby several hours later.",
        "The incident sparked a five-month search by police to track down the mum but it would be another 14 years before the mystery was solved.",
        "Her birth mother came forward as a result and met the daughter she abandoned 14 years earlier.She had kept a newspaper photo of baby Jessica in her purse for all those years.'Hearing from my mother and how she felt when she had to leave me really made my heart break and that's why I can see that this mother is feeling afraid and fearful,' Jessica recalled.Meanwhile, the desperate search for the baby's mother is about to enter its third week as NSW Police renewed calls for the woman to come forward.'You can't understand what's going through someone's mind at that point in time to think this is a viable option,' Detective Inspector Jason Pietruszka said.'The mum's not in trouble from our point of view. It is all about her welfare. We want to make sure the mum's okay. We're not looking to charge her with anything.'Police have turned to DNA in their mission to solve the mystery.'The DNA obviously looks at the child's link through any of our systems where there may be similar DNA,' Det Insp Pietruszka said.'So we are looking at it from that point of view to see if there are any links known throughout the family,' "
    ]
}