{
    "articleURL": "/wires/reuters/article-12055315/Police-responding-shooting-Texas-mall-multiple-people-injured.html",
    "content": [
        "By Brad Brooks and Brendan O'Brien",
        "May 6 (Reuters) - A gunman shot and killed eight people and wounded at least seven others at a busy mall north of Dallas on Saturday, police said.The gunman, whom authorities said they think acted alone and whose motive was not yet known, was killed by a police officer after he began firing outside of the Allen Premium Outlets mall in Allen, Texas, the city's police chief Brian Harvey said at a press conference.Allen fire department chief Jon Boyd told the same press conference that his department took at least nine victims with gunshot wounds to area hospitals.Two of those people died at the hospital, Boyd said at a second press conference Saturday night. Three of the victims were in critical condition and four others were stable.Medical City Healthcare, which runs 16 hospitals in the area, said in a statement that its trauma centers were treating eight of the wounded victims, who ranged in age from 5 to 61.Collin County Judge Chris Hill, the top elected official in the county where Allen sits, praised police and other first responders at a press conference, but expressed deep anger with \"those that would do evil in our community, in our backyard.\"Separately, police in the nearby city of Frisco, Texas, said they had evacuated the Stonebriar mall late Saturday after receiving reports of shots fired there. It was not yet clear if a shooting had actually taken place.",
        "SHOOTING EVERYWHERETV aerial images showed hundreds of people calmly walking out of the mall, located about 25 miles (40 km) northeast of Dallas, after the violence unfolded, many with their hands up as scores of police stood guard.One unidentified eyewitness told local ABC affiliate WFAA TV that the gunman was \"walking down the sidewalk just ... shooting his gun outside,\" and that \"he was just shooting his gun everywhere for the most part.\"Blood could be seen on sidewalks outside the mall and white sheets covering what appeared to be bodies.Texas Governor Greg Abbott, calling the shooting an \"unspeakable tragedy,\" said in a statement that the state was prepared to offer any assistance local authorities may need.Allen, Texas, is a community of about 100,000 people.Mass shootings have become commonplace in the United States, with at least 198 so far in 2023, the most at this point in the year since at least 2016, according to the Gun Violence Archive. The nonprofit group defines a mass shooting as any in which four or more people are wounded or killed, not including the shooter. (Reporting by Brad Brooks in Lubbock, Texas, Moira Warburton in Washington, and Brendan O'Brien in Chicago; Editing by Chizu Nomiyama, Daniel Wallis and Kim Coghill)"
    ]
}