{
    "articleURL": "/wires/reuters/article-12045209/China-yuan-gains-Fed-tempers-tightening-stance-domestic-tourism-booms.html",
    "content": [
        "SHANGHAI, May 4 (Reuters) - The yuan rose on Thursday on broad selling of the U.S. dollar after the Federal Reserve signalled a pause in its tightening cycle, while China's robust tourism data during the May Day holiday also supported to the local currency. The spot yuan touched a one-week high of 6.8888 per dollar in the onshore market as traders returned from a three-day holiday. Prior to the market open, the People's Bank of China set the midpoint rate at 6.9054 per dollar, firmer than the previous fix. The Fed raised its benchmark overnight interest rate by a quarter of a percentage point, as expected, but in doing so dropped from its policy statement language that it \"anticipates\" further rate increases would be needed. The dollar index against a basket of its rival currencies extended its decline on Thursday. \"The Fed is preparing to put a pause or even end its most aggressive rate hike cycle since 1980s,\" wrote Ken Cheung, chief Asian FX strategist at Mizuho Bak Ltd. That gave a boost to Asian currencies, including the yuan, helped by the moderating headwind of capital outflow pressure, he added. In addition, \"the travel and spending data in China during the holiday was encouraging, showing that the revenge-style consumption is taking place,\" Cheung said. China's tourism rebounded to pre-COVID 19 levels in the May Day holiday as the number of domestic trips rose by more than two-thirds from a year earlier, government data showed, a welcome boost for the world's second-biggest economy. But some traders and analysts expect to see yuan volatility ahead, as the Fed rate decision had been largely priced in, while questions remain about the durability and strength of China's economic recovery. \"The swift recovery in in-person services has been the major driver of China's post-Covid recovery this year, while the lackluster property recovery, a global slowdown and rising geopolitical conflict remain major challenges for China's recovery to be sustained,\" Ting Lu, Chief China Economist at Nomura wrote in a note. \"We expect growth in in-person services to drop in coming months as pent-up demand wanes.\" The yuan market at 4:49AM GMT: ONSHORE SPOT: Item Current Previous Change PBOC midpoint 6.924 0.27% 6.9054 Spot yuan 6.9 0.26% 6.9179 Divergence from midpoint* -0.08% Spot change YTD 0.00% Spot change since 2005 revaluation 19.95% Key indexes: Item Current Previous Change Dollar index 101.074 -0.3 101.343 *Divergence of the dollar/yuan exchange rate. Negative number indicates that spot yuan is trading stronger than the midpoint. The People's Bank of China (PBOC) allows the exchange rate to rise or fall 2% from official midpoint rate it sets each morning. OFFSHORE CNH MARKET Instrument Current Difference from onshore Offshore spot yuan * 6.905 -0.07% Offshore non-deliverable 2.44% forwards 6.7407 ** *Premium for offshore spot over onshore **Figure reflects difference from PBOC's official midpoint, since non-deliverable forwards are settled against the midpoint. . (Reporting by Samuel Shen Editing by Shri Navaratnam)"
    ]
}