{
    "articleURL": "/sport/boxing/article-12056277/Joshua-Buatsi-left-fighting-near-venue-long-awaited-return.html",
    "content": [
        "There were masses of empty seats for Joshua Buatsi's first fight in 350 daysUnimpressed supporters left the Birmingham venue mid-fight on SaturdayLight-heavyweight Buatsi went on to beat Pawel Stepien by unanimous decisionJoshua Buatsi's return to the ring on Saturday evening was played out in front of a sparse Birmingham crowd as supporters left the venue mid-fight.",
        "The British light-heavyweight was fighting for the first time in nearly a year as he took on Poland's Pawel Stepien for his first appearance under new promoter Boxxer.But fans were left less than impressed as plenty of those in attendance at the near 16,000 seater venue decided to exit early while Buatsi competed in the ring.A video on social media shows fans vacating their seats and walking down the stairs towards the various exits as the little atmosphere left in the venue was extinguished.Boxing fans from different sections of the indoor stadium decided they would rather beat traffic than watch the 30-year-old extend his undefeated record.",
        "Aftermath pictures then showed massive gaps in the crowd with empty seats dotted around the outer stands and fans mocking the event on social media afterwards.Buatsi went on to claim his 17th professional victory by unanimous decision against , however some onlookers questioned the heavily one-sided scorecards as the home favourite struggled to break down his opponent's defence.Social media then mocked the poorly-attended event that saw Buatsi headline an uninspiring card bosting eight fights.One post slating the event read: 'It was brutal - mass evacuation.'Another uninterested viewer added: 'Was there a knock down in the fight let me know please.'",
        "Further ridicule followed as another stated: 'The only ones put to sleep were those who watched the fight, if the rematch took place in my back garden I'd close the curtains.'",
        "One comment joked: 'Was literally half empty by round 6', while another added, 'Could tell on tv crowd was light. Very few cheering on Buatsi. Ring rust or not the fight was a bore fest.'Speaking after the fight, Buatsi admitted he wants to not wait another 350 days for his next match.'Ultimately, it was about the win, because if I hadn't it would have made my next fight very difficult for me,' Buatsi said. 'It was an OK performance, but it was good for me to be back out there,' he told the BBC.'Ideally I would like a step-up opponent, and be out there in July, maybe August,' Buatsi said. 'I'll be heading out to camp very soon. Domestic or international I don't mind, I just want a big fight to take my ranking up,' he added."
    ]
}