{
    "articleURL": "/wires/ap/article-12042045/For-open-water-swimmers-chilly-choppy-water-beckons.html",
    "content": [
        "Many beaches won´t open for weeks, but already one dedicated group is quietly pacing the shore.",
        "You might not have noticed them, but these quiet few are the ones who seem most keen on noting the shifting tides, the current, the wind. They´ll gush about the color of the water, the angle of the sun, the shape of the clouds. They are the first to plunge in when those on the shore are still shivering in sweaters. And they are the last to, very reluctantly, call it a season in late fall. And occasionally not even then.\"A lot of us look longingly at the water all year long, but it´s still a little cold for me now,\" says Dorothy Harza, 93, of Evanston, Illinois, who swims nearly daily in Lake Michigan from May to November.\"It makes my body feel so good!\" she exclaims. \"Like most people my age, I have various aches and pains that one just lives with at my point of life. Swimming makes me feel so much better.\"Her passion for open water swimming is about much more than physical exercise.\"It´s so beautiful when you´re swimming in the lake. The sky is different every day. The water is different every day. And then there´s the camaraderie of it,\" she says.",
        "\"Some people think it´s just too cold to swim, but it´s not cold at all once you´re in the water.\"",
        "Unlike many athletic endeavors, open water swimming is a pastime embraced by many in their 50s and up, way up. It favors the hardy, the persistent, the well-insulated. It doesn´t matter much how old you are. And it´s nothing like pool swimming.\"People don´t care if you´re rich or poor or what you do for a living. All that matters is, are you going to be safe? Do you have an idea of your own tolerance? Will you cheer on other people, and keep an eye out for them?\" says Maura Twomey of Boston, who grew up in a suburb of Dublin, Ireland, where she taught herself to swim.She didn´t take on her first serious open water swim until age 50 - off Alcatraz, in San Francisco Bay - and went on to swim the English Channel.\" During Covid, when we had no pools, a group of us would meet in a place called Pleasure Bay near Boston. It´s like a lake that´s fed by sea water. Sometimes we were there very early and it was very cold, and semi-dark,\" she says. \"It was a truly spiritual moment swimming in the open water and watching the dawn come up.\"\"Once you´ve been out there shivering with someone, they´re your pal. You are connected in a certain way,\" she adds.",
        "Some open water enthusiasts are or were competitive swimmers, or runners, dancers or tennis players whose joints now prefer the water. Many are simply there for the beauty of it.There may be schools of tiny fish near the surface, or dragonflies lingering just above, snowy egrets or other birds along the shore, or maybe sea birds diving for fish. And there is the ever-changing sky and water, the occasional rainbow.\"We´ve had cormorants swim within a few feet of our faces, and seen different kinds of bird life and schools of fish,\" says Mark Schaefer of Branford, Connecticut, who started swimming in Long Island Sound with his wife, Beth Weinberger, after he threw his back out during the pandemic.\"I´ve run in my neighborhood for 25 years, always looking out at the water. And it´s a neat idea to flip that around and do a workout out in the water, looking back at the shore,\" he says.For Martha Wood, a world champion ice swimmer (swimming in water under 40 degrees), \"It´s the meditative empowerment that drives me. Women really do well at things like ice swimming and ultramarathon swimming.\"And unlike in other sports, \"it´s an advantage to put on weight.\"\"The beautiful thing about the water is it´s not the hard-pounding wear and tear of running or other sports. And the cold really forces you to focus,\" says Wood, who lives in the Boston area. \"When you get out, you feel this euphoria. It´s addictive.\"",
        "For anyone interested in trying open water swimming, experienced swimmers advise going with a small group so you can watch out for each other. Take it slow to acclimate yourself to the water, know what temperature the water is, and be aware of the risks.Some swimmers swim with an inflatable buoy so they can be seen by boats. Some wear wetsuits to protect against jellyfish. Others put on a layer of Vaseline or wear a shark bracelet, which uses magnetic technology and is supposed to help deter curious sharks.There are Facebook pages for open water swimmers that aim to build community.Those who swim in very cold water say the danger isn't over when you emerge from it. It's important to have a hot drink at hand - or better yet a sauna - to avoid a phenomenon called \"afterdrop,\" when your body temperature continues to drop even after you´re out of the water.In her new book, \"Why We Swim\" (Algonquin), author Bonnie Tsui writes that after a particularly frigid yet exhilarating swim at the Dolphin Club in San Francisco, she realized that the dangers inherent in swimming, particlarly in the \"deep, alien\" sea, are part of its intensity.\"We are pulled to the paradox of water as a source of life and death, and we have figured out myriad ways to conduct ourselves in it,\" she writes.",
        "Liz Adams, also in the Boston area, has been a swimmer all her life, and says, \"It´s almost like yoga in the water, with its breathing patterns.\"She, too, fell in love with open water swimming during the pandemic. \"I can´t tell you what happened within me,\" she says. \"Sometimes I´m so in awe of the nature around me when I´m swimming that I pause and say, `This is heaven.´\"For more AP Lifestyles stories, go to https://apnews.com/hub/lifestyle."
    ]
}