{
    "articleURL": "/tvshowbiz/article-12058851/Jamie-Oliver-shares-rare-family-snap-celebrate-daughter-Poppys-21st-birthday.html",
    "content": [
        "Jamie Oliver shared a rare family snap on Sunday as he celebrated his eldest daughter Poppy turning 21.  ",
        "The celebrity chef, 47, shares Poppy Honey, 21, Daisy Boo, 20, Petal Blossom, 14, Buddy Bear, 12, and River Rocket, six, with his wife Jools Oliver. Posting to Instagram, the TV cook shared stunning black-and-white photographs of the lavish party, as the happy family posed by two disco balls. Jamie grinned proudly as he was front and centre of the snap with an arm around his childhood sweetheart Jools, 48, with whom he has recently renewed his wedding vows. However, fans were quick to spot that his youngest child, River Rocket, was missing from the celebrations. ",
        "Jamie wrote: 'Me and the gang on my daughter Poppy’s 21 st birthday party…..what’s a night …'Thanks to all that celebrated with us and who helped put the party together big love jamie xx'Jamie looked dapper in a velvet jacket, while Jools also turned heads in an elegant off-the-shoulder maxi dress with statement glittery earrings. Meanwhile his daughter Poppy was very much the birthday girl in a semi-sheer black ensemble with tiny snaps, as she posed for a more colourful snap with her brother Buddy.   It comes after teenage sweethearts Jamie and Jools renewed their wedding vows in April - 23 years after tying the knot. The celebrity chef shared an intimate carousel of family snaps to Instagram, after saying 'I do' for a second time at the Soneva Fushi Resort in the Maldives.",
        "For the special occasion, Jamie looked dapper in a blue blazer and matching trousers, teamed with a crisp white shirt and a lapel flower.Jools looked elegant in an off-the-shoulder wedding dress, complete with a ruffled design and a thigh-high slit.",
        "Her brunette locks were styled straight with a white bow holding her hair in place, while she accessorised with pearl drop earrings.She opted for a bronzed makeup palette which accentuated her natural features, teamed with a swipe of nude lipstick.Alongside the photos, Jamie penned: 'Morning all, Me &amp; @joolsoliver got married again! Yep After 23 years together, we thought it would be a special moment to celebrate renewing our wedding vows before the kids all start leaving the nest. 'It was really special, funny and romantic with the words in the ceremony making more sense having come this far together. 'It seems like a blink since the first wedding which we kept very privet apart from the paparazzi at the village church we thought it would be a happy and joyful moment to share with you all this Easter. 'We’ve always dreamed of going to the Maldives and it was just as you would have dreamed, simply amazing ! a massive thank you to all the team at @discoversoneva for blowing our minds and making this moment so special and memorable big love guys Jamie x'",
        "Jamie later shared more snaps of the ceremony on his Instagram Stories, including a selfie with his wife and daughters which he captioned: 'My queens'.Jools also shared her own selection of snaps on her social media, writing: 'So wonderful the first time we did it again. What an incredible memory to treasure so happy, emotional, romantic and beautiful. Seeing the children’s little faces made the whole experience so special. I could only have dreamed of being on a holiday this magical thank you so much Discover Soneva.",
        "'Your care, attention to detail and unbelievable kindness made everything so special almost feels like it was a dream xxxJools and Jamie first began dating when they were teenagers and tied the knot in the chef's home village of Rickling, Essex, on June 24, 2000. Speaking in 2019 about renewing their vows, Jools said: 'Next year, we’ll have been married 20 years, and we’re going to get married again, but do things differently – outside and barefoot.Looking back on their first trip down the aisle, she recalled: 'Our first dance was to Dusty Springfield’s I Only Want To Be With You, but Jamie doesn’t like dancing, so I threw him off. I was in my element!' Chef Jamie, who hails from Essex, reportedly has a net worth over £240million. "
    ]
}