{
    "articleURL": "/news/article-12041167/Parents-teen-killed-Jesse-McFadden-say-texted-pretending-lay-dead.html",
    "content": [
        "Seven people, including pedophile Jesse McFadden, found dead on MondaySex offender McFadden was due in court on child porn charges same day Ivy Webster's parents believe McFadden was pretending to be their daughterThe devastated parents of a 14-year-old girl killed by pedophile Jesse McFadden have revealed that he texted them pretending to be her while she lay dead next to her friend and four others a day before he was due in court on child porn charges.",
        "Ivy Webster and her friend Brittany Brewer, 16, were among six victims discovered on Monday after being slain by the convicted sex offender who was found dead alongside them.Janette Mayo, 59, said the Okmulgee County Sheriff's Office notified her late on Monday that the other four victims were her daughter, Holly Guess, 35, and her grandchildren, Rylee Elizabeth Allen, 17; Michael James Mayo, 15; and Tiffany Dore Guess, 13. Officials had issued an amber alert for Ivy and Brittany - who were reportedly seen travelling with McFadden, 39, after vanishing - but it was called off when the bodies were discovered later the same day at the home near Henryetta, a town of about 6,000 about 90 miles (145 kilometers) east of Oklahoma City.While details from police have been scant, grieving relatives are trying to piece together the horror started that began with two teenagers being reported missing.",
        "Ms Mayo was told her daughter and grandchildren were all found shot dead in various locations on McFadden's property but the Oklahoma State Bureau Investigation, which is assisting in the investigation, have not confirmed this. Meanwhile Ivy's father, Justin Webster, said all of the victims suffered gunshot wounds and that some had been lined up and were located across the property. In an emotional interview this morning, Ivy's parents suggested that McFadden had impersonated their daughter over text after killing her.",
        "Ivy's mother Ashleigh Webster explained how she had been speaking to her daughter on Snapchat late on Saturday night but when she received a message from her the next morning, something didn't feel right.",
        "'I got a message the next morning, Sunday morning that was her phone but I don't believe it was from her anymore saying that they were going to McAlester and she would be home later,' she told NewsNation.Mr Webster added: 'We think Jesse wrote that and probably had already happened at that point.'Speaking about why they had concerns, Ms Webster added: 'The way Ivy is, she's my best friend, she's constantly 'Mum I love you, ok mum we're going to eat, ok mum we're done eating we're going to go do this now'. She lets me know everything.'This message was kind of 'ok we're going to McAlester, I'll see you around 5.'It was just different but I also didn't think anything of it because they were maybe in a hurry.'Officials discovered seven bodies on the property around 3pm at 14600 Holly Road in the rural town of Henryetta, Interim PIO Gerald Davidson Oklahoma State Bureau of Investigations told DailyMail.com.The Oklahoma Department of Corrections prison records show McFadden was convicted of first-degree rape in 2003 and released in October 2020, the news outlet said.",
        "McFadden had been scheduled to appear in court Monday for the start of a jury trial on charges of soliciting sexual conduct with a minor and possession of child pornography. ",
        "Court records show he was communicating with a then-16-year-old girl using a contraband cellphone while he was incarcerated at a state prison near Muskogee. The teen's grandfather reported their communications to prison officials, according to an affidavit from a Department of Corrections investigator. The Websters, who moved to the area two years ago, revealed that they were completely unaware of McFadden's past, adding: 'We had a read on him that he was a little weird but we felt comfortable  especially knowing several of our daughters' friends would go over there all the time and hang out.'Tiffany would come over here to our house  and stay here on the weekends and we never suspected any kind of maliciousness.'Brittany's father Nathan, who called his daughter his 'right hand side kick' also said that his daughter had spent the weekend with the McFadden's family several times before.He told News On 6 that his daughter was selected to be Miss Henryetta at the [National American Miss pageant] in Tulsa and represent her town this summer. ",
        "'And now she ain't gonna make it because she's dead, she's gone,' the grief-stricken father said.",
        "He said during a vigil on Monday that his daughter had dreams of becoming a veterinarian or a teacher.He added: 'It's just a parent's worst nightmare, and I'm living it. I am just lost.' The grim discovery in Oklahoma keeps the U.S. on a torrid pace for mass killings in 2023 and could push the number of people slain in mass killings past 100 for the year, according to a database maintained by The Associated Press and USA Today in a partnership with Northeastern University.  "
    ]
}