{
    "articleURL": "/wires/pa/article-12046873/King-relaxed-ahead-jaw-dropping-coronation-dean-says.html",
    "content": [
        "The King’s coronation will be “jaw-dropping” but the monarch remains “relaxed and very gracious” despite the “huge burden” ahead of him, the Dean of Westminster has said.",
        "The Very Reverend Dr David Hoyle said rehearsals for the big day have gone well and Charles was not at all anxious about the momentous occasion.Replica crowns have been used for the dry runs, and the children, which includes Prince George, Princess Charlotte and Prince Louis, attending were “watching with huge interest”, the dean revealed.",
        "The dean, speaking at Westminster Abbey ahead of the May 6 ceremony, told Sky News: “The King was relaxed and very gracious.“He took time to thank all the people around him who are making this happen.“So whilst he has a huge burden on him, there’s a lot for him to do, he doesn’t give the sense of being a man who’s really anxious about this, not at all.”The dean, who will take part in the ceremony conducted by the Archbishop Canterbury, said: “I’m the Dean of Westminster. I’m used to ceremony on a national level. Even I think this is pretty jaw-dropping.”He described the ceremonial dress and Crown Jewels being used as “extraordinary” and the music as “spine-tingling”.",
        "On occasion, St Edward’s Crown – used for the moment of crowning – has been put on back to front at previous coronations.King George VI recounted in great detail all the mishaps during his ceremony in 1937, including the crown being put on back to front after a piece of red cotton indicating the front was removed.",
        "The dean, who will have to handle the crown, said he has been practising its movements to ensure it is put on the King’s head the correct way.“Our secret is not to tie bits of thread to it because someone removes them,” he added."
    ]
}