{
    "articleURL": "/tvshowbiz/article-12060993/ABC-TV-chat-Frankly-hosted-Fran-Kelly-axed-one-season.html",
    "content": [
        "The ABC has cancelled the Friday night chat show Frankly, hosted by journalist Fran Kelly, after just a single season.",
        "A spokesperson for the public broadcaster confirmed the decision on Tuesday, saying in a statement: 'Frankly will not be returning this year.'Industry website TV Tonight, citing production sources, reports the show has been 'axed' and there are no plans to revive it.Kelly, 64, said late last year she was unsure whether her show would be back in 2023 following criticism she was 'too old' to host the series.She admitted at the time ABC management had yet to even discuss plans to renew the weekly half-hour arts and culture program.",
        "But she remained hopeful the show, which had fairly unspectacular ratings during its 2022 run, would return the following year.'We can see the numbers slowly building,' she said. 'They've gone up basically every week since week two,' Kelly told TV Tonight on November 24.'The social media is gangbusters,' the veteran journalist added.Past guests included AFL legend and 2014 Australian of the Year Adam Goodes, comedian Wil Anderson, actress Magda Szubanski and pop star Natalie Imbruglia.Other guests were offbeat choices, such as biomedical engineer Jordan Nguyen, Ukrainian ballet dancer Vladyslava Ihnatenko and screenwriter Hannah Carroll.",
        "Frankly launched on October 7, 2022, to 308,000 metro viewers. This audience fell to 259,000 two weeks later, but afterwards started to gradually pick up.Kelly said the audience feedback had been positive, though viewers complained that the show, which runs for just 35 minutes an episode, was too short.",
        "During her TV Tonight interview, she also commented on the media brawl over the ABC's decision to have her anchor a new prime-time show.Various critics, including Nine culture reporter Thomas Mitchell, said the role should have gone to a 'younger talent'. Progressive journalist Osman Faruqi also blasted the decision and accused the ABC of 'giving up on young people'.",
        "Kelly took on the role after stepping down from presenting ABC Radio National's breakfast show after 17 years.'I'm glad it quietened down,' she said of the age controversy. 'I'm glad I could just get on with what I was trying to do with Frankly, and I'm glad it worked.'The last episode of the arts show featured  British actor Richard E. Grant, comedian Joel Creasey and singers Vika and Linda Bull."
    ]
}