{
    "articleURL": "/tvshowbiz/article-12058827/Pink-suited-Christopher-Biggins-leaves-party-holding-champagne.html",
    "content": [
        "Christopher Biggins was his typical flamboyant self when she was pictured leaving the Park Theatre birthday bash on Sunday night. ",
        "The entertainer, 74, strolled out of the Park Theatre birthday party in Finsbury Park wearing a pink suit and carrying a bottle of champagne in hand. He looked like he had been having a lovely time as he leaned in to kiss EastEnders icon Michelle Collins and Blackadder star before diving into his taxi. Biggins as he is affectionately known, wore a contrasting pair of red spectacles as his night came to a close. No doubt his wallet was feeling a bit lighter because the tickets on the night were £500 each, but they did include food, drink and souvenir programme.",
        "Or guests could pay £15,000 and have the same experience but with Sir Ian McKellen hosted your table.Guests also got to watch a series of performances on the stage. The outing comes after Christopher was caught in a Twitter blunder after seemingly not realising that fans could see his 'liked' tweets. The pantomime legend had liked a number of X-rated videos of men performing various sex acts but quickly deleted them once he realised they could be seen by others. It was too late, however, as screengrabs of the content began to circulate online, with Biggins quickly trending on Twitter. Shocked fans immediately posted a slew of memes as they quipped they wouldn't be able to 'unsee' the content and vowed never to attend pantomime again. ",
        "Other Twitter users also cracked jokes about the fact that amid all the porn accounts, the septuagenarian had liked a lot of his own tweets.Fans tweeted: 'I was just invited to check out Christopher Biggins profile and look at his likes. Sweet Jesus I’m never going to be able to go to a pantomime again, can’t unsee that s**t'",
        "'Can someone PLEASE break it to Christopher Biggins that we can see his liked tweets'; 'I often forget that what you like on here can be seen by other users……. Christopher Biggins your saucy goose!!!'; 'you all know it's perfectly fine for christopher biggins to like a porn tweet, right? he's an adult.'; 'How bad could Christopher Biggins likes be? Oh dear God'; 'the worst thing about Christopher Biggins' likes isn't the porn, it's the fact most of his own tweets are there'; 'Whatever you do, do not go onto Christopher Biggins' profile and look at his likes (na, not really, go on...)''Did anyone else have Christopher Biggins'; 'liking loads of tweets of naked men masturbating on the Tuesday morning bingo card?'; 'I looked at Christopher Biggins' Twitter likes and I will never be the same again.; ''Don't make the same mistake I did.' Christopher was married to Australian actress Beatrice Norbury for three years but the couple divorced in 1974 and he is now openly gay. ",
        "He entered into a civil partnership with his partner Neil Sinclair in 2006 at Hackney Register Office"
    ]
}