{
    "articleURL": "/tvshowbiz/article-12056549/MasterChef-fans-question-Jock-Zonfrillos-star-Melissa-Leong-didnt-tribute.html",
    "content": [
        "The Sunday Project dedicated their entire show to a moving tribute to Jock Zonfrillo following the MasterChef Australia star's shock death at age 46. ",
        "Jock's fellow judge Andy Allen and renowned chefs Gordon Ramsay, Marco Pierre White and Curtis Stone all shared their memories in the heartbreaking special. Conspicuously missing was Jock's co-star Melissa Leong, who did not appear in the program. MasterChef fans posted to Twitter wondering why Melissa was absent, with several speculating that she was too grief-stricken to take part. 'Is it weird that Melissa isn't part of this?' asked one person on Twitter, with several others replying. ",
        "'It is a bit, yeah...' agreed one person, but others felt differently.  'No? Everyone grieves differently. It might be still too soon for her to speak/open up. I hope she's okay,' said one. Another wrote: 'Andy was struggling enough. I'm thinking Melissa just couldn't do it. Everybody grieves differently, and people only discuss that grief when they are ready (if ever).'Someone else said: 'Not at all. If you're not in the space to do it, you cannot do it', while one more agreed, 'I don't think she could do it. She was shattered. 'Maybe she's still processing it and it would be to much for her,' yet another said. ",
        "'She was his 'work wife' Would have been so hard. Well done to Andy for sharing his thoughts/grief. Saddest week ever,' one more speculated. This past week, Melissa pulled out of a scheduled event at the Sydney Opera House following the death of her co-host Jock.",
        "Leong was meant to host a live Q&amp;A with American cookbook writer Alison Roman on Tuesday, but it was announced on Thursday she would no longer be attending. 'Following the sad news of the passing of her colleague and friend Jock Zonfrillo, Melissa Leong is no longer able to join Alison Roman in conversation on Tuesday, May 9,' a Sydney Opera House spokesperson said in an email sent to ticketholders.Replacing Leong will be MasterChef Australia season two winner Adam Liaw. Zonfrillo was found dead by police at a hotel in Melbourne's inner-north at about 2am on May 1, the same day Channel Ten was meant to premiere the fifteenth season of MasterChef Australia.   "
    ]
}