{
    "articleURL": "/money/comment/article-12047369/ALEX-BRUMMER-Central-banks-lose-plot-fight-against-inflation.html",
    "content": [
        "Two down and one to go. Christine Lagarde and the European Central Bank (ECB) are carrying on with the great tightening – hiking rates by a further quarter of a percentage point to 3.25 per cent.",
        "It followed the US Federal Reserve, which raised rates by the same amount a day earlier to a 16-year high range of 5 per cent to 5.25 per cent.Now we await the words of Governor Andrew Bailey and the Bank of England decision next week. If form is followed, then the Bank will opt for another rise.The British headline inflation rate at 10.1 per cent in March is among the highest in the Western world, industrial disputes rage on and, in spite of efforts to slow demand, the latest purchasing managers’ index shows the services sector flourishing.",
        "Over the last quarter of a century, the Bank of England and other central banks became the most trusted institutions in the major democracies.Star former ECB chief Mario Draghi was drafted to be prime minister of Italy. In the US, ex-Fed chairman Janet Yellen was discarded by Donald Trump, then appointed as Treasury Secretary by Joe Biden.In Britain, former Governor Mark Carney was seen as a shoo-in for Canadian prime minister were it not for the dynastic rise of Justin Trudeau.The shine is off the ball.In the US and Britain, the transitory cost of living narrative in 2021 proved to be a colossal mistake. The Bank and the Fed moved too slowly to increase rates from emergency levels as prices soared.",
        "Followers of Andrew Bailey may recall that he flirted with negative rates, writing to the high street banks to test the waters.Europe has been so slow off the mark in tackling inflation that ECB president Christine Lagarde is threatening more to come as the Fed now hesitates amid a full-blown banking crisis. When one of her deputies was asked if Europe too could be threatened by the sharp reversal on interest rates, he dismissed the failure of Credit Suisse as something in the waters for a long time and the US banking meltdown as ‘idiosyncratic’.The ECB failed to acknowledge that the flight from Credit Suisse accelerated as Silicon Valley Bank and Signature were consigned to the scrapheap. Deutsche Bank, one of Europe’s largest lenders, wobbled as tremors from across the Atlantic spread.Shattered confidence has now killed a proposed £10billion deal between First Horizon and TD Bank that would have formed America’s sixth-largest lender.In March alone, cautious British households withdrew £4.8billion from banks and building societies and ploughed £3.5billion into National Savings &amp; Investments. If the cause of the withdrawals was simply low returns, the bird would have flown long ago.As much as one can admire the cool head of JP Morgan Chase chairman Jamie Dimon in a crisis, who suggested that the rescue of First Republic of San Francisco would end the tumult, he was wrong.",
        "Shares in Los Angeles-based Pacwest have imploded as it claimed to be exploring strategic options – code for ‘someone please come and save us’. Once Pacwest is resolved, attention is then likely to shift to the fall in the shares of Arizona’s Western Alliance Bancorp.The idea that, somehow, banking in Europe is rock steady needs correction.Data from Refinitiv Lipper shows £30billion of net flows from banks to European money market funds in March. In present, turbulent markets, the US has shown how fast a stream turns into a raging torrent.Central bankers have been so concerned about rescuing reputations as trusted inflation-fighting warriors that they risk undermining the stability they sought to retain after the three shocks of the great financial crisis, the pandemic and Russia’s war in Ukraine.It was critical that the battle against higher prices was joined.What has been missing from much of the action taken is any analysis of the distortions caused by aggressive rate hikes.The Liz Truss interlude in the UK and the doleful impact it had on gilts, pensions and fixed-rate mortgages offered a window on how sensitive the whole financial system is to interest rate changes.The American banking system finds itself under acute pressure and it is clear that the latest interest rate rise was an error.",
        "In the hurry to restore their reputations as inflation hawks, the central banks have acted rashly.",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}