{
    "articleURL": "/news/article-12039053/Big-Lots-manager-says-fired-following-shoplifter-store-stores-cart-back.html",
    "content": [
        "An ex-Big Lots manager claims she was fired after she followed a shoplifter out of her Southern California store to retrieve a cart owned by the storeLily Oxford, 52, says she and another manager were fired for exiting their store to take back a cart from a thief who had walked out 15 jugs of Tide Pods The woman says she was fired one week after the incident  An ex-Big Lots manager claims she was fired after she followed a shoplifter out of the store to retrieve a cart owned by the establishment. ",
        "Lily Oxford, 52, says she and another manager of the Big Lots location in Oildale, California followed a thief who had walked out with 15 jugs of Tide laundry detergent in his cart. The incident happened on April 5 and Oxford - who managed the furniture section - said she and her coworker were not attempting to stop the thief.  'For Christmas, we had just got 40 brand new carts,' she said. 'It's March, we're down to five carts. So, we are instructed, no carts are to leave that store whatsoever. No matter … customers are not allowed to take it,' she said of her reasoning. A week after following the customer out, she told KGET that she and her coworker were both out of jobs in connection to the incident. DailyMail.com reached out to Big Lots for a statement on the incident but did not receive a response from the major retailer. ",
        "According to Oxford, the pair was not attempting to stop the man, confront, or even detain him, they just wanted to get their cart back after the locking mechanism had already kicked in. 'Nobody's allowed to take them outside, so we follow them outside, we get the carts. So that was my goal to go outside. I didn't think it was going to get anything back from them,' the woman told KGET.",
        "The woman said the thief had been attempting to drag the cart after the locks had kicked in and that she unintentionally caught up with the man as he was loading the stolen items into his vehicle. Oxford and the other manager then took out their phones, and, from a distance of several feet, started recording the scene, according to the woman. The thief then reportedly climbed out of the car and took off running from the scene.Another person in the vehicle apologized for the entire scene. 'The other guy got out of his car and said, \"Here, ma'am, take it all, take it all,\" Oxford said. 'I'm thinking, 'Oh great, I'm getting all my stuff back.'At that point, Oxford said others had watched the situation unfold and came over to show their support for the two managers.'I had people, at least three different people out here, applauding me, because it happens so much,' Oxford said. 'So many customers see it happen on a daily basis. At least four to five times a day this happens whether they go out the front door or whether they go out the back door. … At least. Bare minimum,' she continued. Less than a week later, however, both managers were fired. ",
        "'We have a really bad problem with homeless and thieves!' Oxford wrote in a post. 'They come in our store at least 4 times a day and blatantly steal, they fill carts up and walk right on out the front door cause they know there’s nothing we can do about it,' she continued. In another Facebook post, Oxford said she was just 'doing the right thing.' 'Pretty sad when thieves have more rights then a hard working American …. Fired for doing the right thing what a shame,' Oxford wrote on April 24.   'I’m so glad the news covered your story! It’s so unfair how you have been treated,' one person responded on her post.  'Good for standing up to the wrong. In the meantime boycott Big Lots,' another wrote.Risk management consultant Mike Jelletich spoke with KGET and said he sees both sides of the coin in this incident. 'Some of these employees, they know what's right and what's wrong, and they feel, \"Hey, this is wrong.\" And they think it's almost their duty to step up and not let this kind of crap happen,' Jelletich said. 'However, from the employers' standpoint, flat out they do not want this employee injured, god forbid killed. … The financial aspect of a person, a guard, a cashier, being injured can really, really get into the high dollar,' he continued. ",
        "Oxford, a single mother to two teenagers, has since started a GoFundMe account to help cover her bills until she can get a new job. The fundraiser has brought in $2,700 of its $3,000 goal as of May 2. 'Sorry to hear about your job loss. Wishing you and your family good luck,' one donor wrote in a comment on the fund. DailyMail.com reached out to Big Lots for a statement on the incident but did not receive a response from the major retailer. "
    ]
}