{
    "articleURL": "/sport/football/article-12049721/Man-Uniteds-1-0-defeat-Brighton-leaves-ONE-point-road-nine-term.html",
    "content": [
        "Ten Hag admitted before Thursday's match that his side have struggled away The Red Devils have found the back of the net just eight times against their rivalsRe-live all the action after United conceded a late penalty to lose 1-0 at Brighton Manchester United's struggles on the road continued on Thursday night as a last-gasp penalty from Alexis Mac Allister condemned them to defeat at Brighton.",
        "Mac Allister clinched the victory for Roberto de Zerbi's men after successfully tucking home his spot-kick with the very final kick of the game deep into stoppage time.They had been awarded a late penalty after Luke Shaw was judged to have handled the ball in the box following a corner, with the call proving decisive as the hosts secured a memorable win.As a result, Erik ten Hag's side remain without a win - and have drawn only once - away from home against their top-nine rivals all season.That sole point came in late April, when they let slip a two-goal lead as beleaguered Tottenham fought back to secure a 2-2 draw late on, courtesy of Son Heung-min's strike.",
        "'It is absolutely true,' Ten Hag admitted ahead of the game when quizzed on his side's poor record on their travels. 'But it is to do with personality and character and this is where we need to step up and face this. We definitely need to improve.' United's struggles on the road came early on this season, with Brentford inflicting a stunning 4-0 defeat at the Gtech Community Stadium back in August, before a 6-3 derby-day thumping against arch-nemesis Manchester City followed in October. They were beaten 3-1 in Unai Emery's first game in charge at Aston Villa and a late 3-2 defeat at Arsenal, following a VAR call on Eddie Nketiah's dramatic winner, left United without a point from their first four trips to the top nine.",
        "Undoubtedly the most bruising result of all was their astonishing 7-0 capitulation against Liverpool at Anfield - after a goalless first 43 minutes - with their bitter rivals inflicting a memorable defeat despite their own indifferent season. A 2-0 loss at St. James' Park followed, before that sole point was picked up at the Tottenham Hotspur Stadium, with Brighton's win in the dying embers of the game completing their miserable run. As a result, United will end the season without a win over their top nine rivals, with trips to bottom-half sides Bournemouth and West Ham their last remaining away matches, and only a victory against Fulham at Craven Cottage has prevented them from going winless on the road against the entire top half of the table. At Old Trafford the Red Devils have been dominant - beating the likes of City, Liverpool, Arsenal and Tottenham this season. But away from home their ability to keep the ball out of their own net has proven their downfall, as they have conceded 28 times in eight games against the top nine.",
        "Worse still, they have only managed to find the back of the net eight times themselves, despite the fine goalscoring form of Marcus Rashford this season.  Former United icon Gary Neville believes these worrying signs point to a lack of 'spirit' and willingness to 'fight'.",
        "'There are emerging signs away from home, in the big games, when you really have to turn up and show that spirit, that fight, that courage to play, and have the quality to play, there is more evidence that they are not good enough in these type of matches,' Neville said after the club's 2-0 defeat at Newcastle in April.'They just do not turn up.'"
    ]
}