{
    "articleURL": "/sport/football/article-12051213/Chelsea-Frank-Lampard-refusing-feel-sorry-despite-threat-SEVENTH-straight-defeat.html",
    "content": [
        "Lampard has suffered six defeats out of six since returning to Chelsea last monthBut the floundering caretaker boss insists he is not 'hurting' despite that runCHRIS SUTTON: How a 'free hit' has turned into a reputation killer for LampardFrank Lampard refuses to feel sorry for himself when he has been part of Chelsea's most successful era.",
        "Lampard has suffered six straight defeats since returning to Stamford Bridge as interim boss and the team that was crowned world champions last year are languishing in the bottom half of the Premier League ahead of a trip to Bournemouth on Saturday.'I'm not \"hurting\" because I've been part of this club through big success and when you see the highs and lows any sport can give you moments of adversity,' said Lampard. 'We at Chelsea have been fortunate for 20 years.'And when that spotlight is on you it's on you. As a professional player or coach you have to understand and handle that because every other team will have their moments and these periods. 'Even as a fanbase, it can be frustrating and you want more but you can be understanding about the last 20 years at Chelsea Football Club.",
        "'It's not one for me to feel hurt by it's much more about what's the action that gets you out of it. The action this season is not going to get us in the Champions League. It's not going to get us in the top eight or whatever but it might be the first small step. Not all fans want to hear that but it's the reality I've come back into.'",
        "Lampard is feeding back his thoughts to the new regime led by Todd Boehly and Behdad Eghbali about the problems he has encountered during the last month.'I have communication about everything that I going on as that is part of my role,' he said.'As much as we are in a results business it is looking to how this cannot be the same next season. So of course my views having worked here before, having worked with the club and having an understanding of the club, a lot of the squad, my opinion can be valid. And I can express that as I go.'If you want to list the past four Premier league games, they are no good,' said Lampard. 'That is the full picture. The league position is the reality, our points are a reality, our goals scored are a reality.'We have had three, four managers, so there is a reality with the club where we are at. That is not my job to focus too much on that or think about what stats are produced on the outside. You can make any stat be in the moment and as a coach or player the biggest thing is your next games, next step.'"
    ]
}