{
    "articleURL": "/news/article-12049051/DOJ-investigating-Trumps-link-Saudi-backed-LIV-Golf-tour.html",
    "content": [
        "Donald Trump hosted the controversial Saudi Arabian LIV golf tour at his Bedminster course in July 2022, and his Doral course in October 2022On Thursday the New York Times reported that the Justice Department had issued a subpoena for documents relating to Trump's agreement with the tourIt is unclear what the subpoenas, sent to the Trump Organization, relate to but the New York Times said it suggested a probe into the family firm The Justice Department has subpoenaed the Trump Organization for documents relating to the Saudi-backed LIV golf tour, which Donald Trump hosted twice in 2022 and will again host in 2023.",
        "Trump welcomed the tournament to his Bedminster, New Jersey course in July 2022. The tour returned to his properties in October 2022, with a competition at his Doral, Florida course.Last year's events saw protests by relatives of the 9/11 victims, angered at Trump's cozying up to the Saudi leadership. In a letter, the group said the decision by Trump to welcome the Saudis brought them 'deep pain and anger' given Saudi Arabia's role in the 2001 attacks.The subpoenaing of the Trump Organization was reported on Thursday by The New York Times. It is not clear what the subpoena relates to, but the Times said it suggested investigators were looking into Trump's family business. It comes as it's revealed a Mar-a-Lago employee is also helping federal investigators probe if the former president hid documents at his Florida estate.  ",
        "LIV golf was founded in 2021, the year after Trump left the White House. In 2023 the LIV tour will be played at Trump's DC course on May 26 to 28. It will return to Bedminster from August 11 to 13, and Doral from October 20 to 22. Trump has defended his decision to host the Saudi-run tournament, which has sharply divided the golfing world.With their almost unlimited funds, the Saudis are luring some of the best players in the world away from the PGA tour.",
        "Those who go say the PGA has disrespected them. Those who turn down the Saudi cash, like Tiger Woods, say the PGA must be protected as the soul of the sport.Trump said he had no problem with supporting the breakaway tour, telling the New York Times in October 2022 that Saudi officials are 'good people with unlimited money' and that the U.S. has 'human rights issues here as much as anybody.'A month later, Trump's company agreed a deal with a Saudi real estate company that is planning a $4 billion project in Oman, including a Trump-branded hotel and golf course. The government of Oman owns the land where the complex is expected to be built, The New York Times reported, and it is collaborating with Dar Al Arkan, the Saudi firm that signed the contract with the former president.The Trump Organization declined to say how much they were being paid to host the tournaments.In a statement, Eric Trump, executive vice president of the Trump Organization, said the organization is 'honored to be hosting three LIV Golf events at our properties' in 2023. He added: 'What LIV Golf accomplished in their first season was truly remarkable, and we are excited to raise the bar even higher together in 2023.' ",
        "News of the golf tournament subpoena emerged at the same time as reports that prosecutors investigating Trump's handling of classified documents had secured the cooperation of a Mar-a-Lago insider.The unnamed employee helped the prosecutors learn more about the storage room where the classified documents were kept, The New York Times reported.It is not known when the insider began cooperating, but two people told the paper that nearly everyone who works at Mar-a-Lago has been subpoenaed.Some staff members have been asked back for further questioning - even if they do not serve in high profile or powerful roles.Prosecutors have subpoenaed footage from the surveillance cameras from inside Mar-a-Lago, and are asking why some of the footage is missing or unavailable - even subpoenaing the software company that deals with the cameras. On Thursday both Matthew Calamari Sr., veteran head of security at the Trump Organization and chief operating officer, and his son, Matthew Calamari Jr., corporate director of security, testified before the grand jury.A spokesperson for Trump called the case, overseen by the special counsel, Jack Smith,  'a targeted, politically motivated witch hunt' that is 'concocted to meddle in an election and prevent the American people from returning him to the White House.' The spokesperson accused Smith's office of harassing 'anyone who has worked for President Trump'.",
        "They said Smith's inquiry was now being used to target Trump's business. "
    ]
}