{
    "articleURL": "/wires/reuters/article-12042967/Texas-authorities-arrest-wife-friend-fugitive-wanted-shooting.html",
    "content": [
        "May 3 (Reuters) - Texas authorities have arrested the wife and a friend of a man accused of killing five of his neighbors, saying the two helped the suspect evade capture for four days, a local prosecutor said on Wednesday.",
        "Francisco Oropesa was apprehended on Tuesday after a manhunt conducted by local, state and federal officials. He was found in a closet under some laundry in a home in Montgomery County.The bloodshed erupted on Friday in nearby San Jacinto County after neighbors asked the suspect to stop firing his semiautomatic rifle in his yard because it was keeping their baby awake. Instead, the 38-year-old man reloaded, entered the home of the neighbors and killed five, including an 8-year-old boy, officials said.The suspect's wife, identified as Divimara Nava, 52, was arrested Wednesday morning and was being held in Montgomery County, San Jacinto County District Attorney Todd Dillon said at a news conference.\"We believe that Nava was providing him with material aid and encouragement, food and clothes, and had arranged transport to this house,\" Dillon said.Nava was facing a felony charge of hindering apprehension and prosecution of a known felon, according to jail records.A friend of the suspect was also arrested on a marijuana charge and will be charged with helping the suspect flee the neighborhood in Cleveland, Texas, where the crime took place, Dillon said.A $5 million bond will be set for the suspected gunman when he appears later Wednesday before a judge in a local jail where he is being held on five counts of murder, San Jacinto County Chief Deputy Tim Kean said at an earlier news conference on Wednesday.",
        "The suspect was arrested in the town of Cut and Shoot, Texas, roughly 17 miles (27 km) west of Cleveland. Both are about 50 miles (80 km) north of Houston.Officials acted on a tip from an unidentified person who was eligible for an $80,000 reward offered for information leading to the arrest, San Jacinto County Sheriff Greg Capers said on Tuesday.Most of the victims were shot in the head. All were from Honduras and among the 10 people living at the address, but they were not all family members, Capers said.The suspect is a Mexican national who was deported from the United States four times since 2009, U.S. immigration officials said.(Reporting by Brendan O'Brien in Chicago; Editing by Mark Porter and Lisa Shumaker)"
    ]
}