{
    "articleURL": "/wires/ap/article-12041109/UN-258-million-people-faced-acute-food-insecurity-2022.html",
    "content": [
        "ROME (AP) - More than a quarter-billion people in 58 countries faced acute food insecurity last year because of conflicts, climate change, the effects of the COVID-19 pandemic and Russia's war in Ukraine, according to a report published Wednesday.",
        "The Global Report on Food Crises, an alliance of humanitarian organizations founded by the U.N. and European Union, said people faced starvation and death in seven of those countries: Somalia, Afghanistan, Burkina Faso, Haiti, Nigeria, South Sudan and Yemen.The report found that that the number of people facing acute food insecurity and requiring urgent food aid - 258 million - had increased for the fourth consecutive year, a \"stinging indictment of humanity´s failure\" to implement U.N. goals to end world hunger, U.N. Secretary-General António Guterres said.While the increase last year was due in part to more populations being analyzed, the report also found that the severity of the problem increased as well, \"highlighting a concerning trend of a deterioration.\"Rein Paulsen, director of emergencies and resilience for the U.N. Food and Agriculture Organization, said an interplay of causes was driving hunger. They include conflicts, climate shocks, the impact of the pandemic and consequences of Russia's war in Ukraine that has had an impact on the global trade in fertilizers, wheat, maize and sunflower oil.The impact has been most acute on the poorest countries that are dependent on food imports. \"Prices have increased (and) those countries have been adversely affected,\" Paulsen said.",
        "He called for a \"paradigm shift\" so that more funding is spent investing in agricultural interventions that anticipate food crises and aim to prevent them.",
        "\"The challenge that we have is the disequilibrium, the mismatch that exists between the amount of funding money that´s given, what that funding is spent on, and the types of interventions that are required to make a change,\" he said.The U.N. World Food Program's new chief issued a warning that the Rome-based agency's resources to provide food aid amid the surging needs are \"running dangerously low.\" Executive Director Cindy McCain told panelists at an event to present the report that the agency could be forced to make \"heart-breaking decisions to slash\" assistance if substantial new funding doesn't materialize quickly.McCain noted that she had just returned from Somalia, where, she said, \"millions are teetering on the edge of hunger and catastrophe.\" She sounded a poignant note: \"We all know it doesn't have to be that way.\"Acute food insecurity is when a person´s inability to consume adequate food puts their lives or livelihoods in immediate danger.The EU's commissioner for international partnership, Jutta Urpilainen, said that the bloc's strategy to fight hunger includes supporting initiatives aimed to \"boost local production and reduce dependence on unsustainable imports.\""
    ]
}