{
    "articleURL": "/news/article-12058741/Pictured-Albanian-runaway-detainees-broke-Yarls-Wood-immigration-removal-centre.html",
    "content": [
        "Thirteen detainees escaped the detention centre in Bedfordshire on April 2810 were arrested and Arnold Lleshaj, Ervin Morati and Luftim Hallaci are wantedThree runaway detainees wanted by police have been pictured after breaking out of Yarl's Wood immigration removal centre during a riot. ",
        "Albanian men Arnold Lleshaj, 27, Ervin Morati, 20, and Luftim Hallaci, 20, are three of thirteen people who escaped through the perimeter fence at the site in Milton Ernest, Bedfordshire, after a row over access to a gym on April 28. Ten have been arrested on suspicion of escape or assisting an offender, while three remain missing. Five people were quickly caught after the riot while eight - including seven Albanian men - managed to get away.  It is believed some of the eight are convicted drug dealers.  ",
        "The riot is said to have started when 40 detainees - who are held at the centre while awaiting deportation - were prevented from using the gym. A crew of prison staff and a tactical response group were sent to restore order as the detainees used gym equipment to damage the property and grounds. Det Supt William Hodgkinson said: 'I would appeal directly to these three men to hand yourselves in - you should also know that anyone who is helping you in any way will also be arrested and put before the courts.'",
        "'This has been a co-ordinated effort from police forces across multiple counties and has resulted in 10 people being arrested for a variety of offences including suspicion of escaping from the centre or assisting or harbouring those who involved.",
        "'We will continue to do everything we can to identify and track down those responsible.'Detectives have seized 'significant amounts of drugs and cash' as part of their enquiries into the mass escape, which saw thirteen men flee through the perimeter fence. Det Supt Hodgkinson said: 'This is a serious crime and is being treated as such by our officers and those in law enforcement across the country.'I would urge anyone involved in this to strongly consider handing themselves in. This would be in their best interests to mitigate the kind of serious criminal sanctions we will look to impose on them when we catch them.'A number of people who remained at Yarl's Wood have also been moved into alternative accommodation in the prison estate following the disturbance, as we and our partners continue to take steps to ensure these kinds of unacceptable scenes do not happen again.'",
        "They added: 'I understand that this incident has caused concern among local residents, and I wish to reassure people that there is no risk to the local community as a result of what has happened.'The immigration removal centre itself is calm and has returned to normal and I know staff there are working hard to prevent any further incidents like this from happening.'",
        "Yarl's Wood is an immigration removal centre where people with disputed immigration status can be detained without a defined time limit. It has been run by Serco since 2007."
    ]
}