{
    "articleURL": "/wires/afp/article-12043677/Sheeran-copyright-battle-stoke-songwriting-paranoia.html",
    "content": [
        "Ed Sheeran is preparing for a blockbuster tour and album release amid regular trips to Manhattan's federal court, where he's defending his songwriting in a closely watched copyright case.",
        "The trial centers on whether the British pop phenom plagiarized Marvin Gaye's 1973 soul classic \"Let's Get It On\" in his 2014 hit \"Thinking Out Loud.\"The heirs of Ed Townsend, who co-wrote Gaye's smash, are behind the civil suit, and allege \"striking similarities and overt common elements\" between the songs.It's the latest in a series of high-profile music copyright cases that have the industry on edge, leaving some songwriters paranoid about their own creative processes and vulnerability to litigation.Sheeran, 32, has spent days testifying with guitar in hand, playing demos for the court to prove the 1-3-4-5 chord progression that's primarily in question is a basic building block of pop music that can't be owned.His legal team argues that Gaye and Townsend were far from the first to record it, citing, for example, a number of Van Morrison songs that use the sequence and that were released prior to \"Let's Get It On.\"It's a notion echoed by forensic musicologist Joe Bennett.",
        "\"The world I want to live in is one where nobody sues anyone for a one- or two-bar melodic or harmonic similarity, because those similarities can so easily occur through coincidence,\" the professor at Massachusetts' Berklee College of Music told AFP.\"They shouldn't be protectable by copyright.\"",
        "The case hinges on the actual composition of the songs rather than the recorded versions -- think sheet music, not vibes.In theory that's a specificity that could help Sheeran's case, but once a music copyright suit reaches the point of jury trial, anything can happen.Winning demands significant funding and resources, and defendants are beholden to the volatility of opinions from jury members who almost certainly don't have a background in musicology.Both sides have hired expert witnesses to explain the technical details to jurors, but, of course, their conclusions differ significantly.\"If you play music to a jury, it could go either way,\" Bennett said.- 'Chilling effect' -",
        "There have been a handful of landmark music copyright cases in recent years, notably in 2016 when Gaye's family -- who is not part of the New York lawsuit against Sheeran -- successfully sued the artists Robin Thicke and Pharrell Williams over similarities between the song \"Blurred Lines\" and Gaye's \"Got to Give it Up.\"The result surprised many in the industry, including legal experts, who considered many of the musical components cited as foundational, and existing largely in the public domain.Shortly thereafter an appeals court decision confirmed Led Zeppelin's victory over a similar case centered on the classic \"Stairway to Heaven\" -- a boon for songwriters.",
        "\"One reason that this Ed Sheeran case may be really important to the industry is that it's a data point that would show well is the pendulum actually back on the other side, or are we just going back and forth?\" said Joseph Fishman, a law professor specialized in intellectual property at Vanderbilt University.\"If it's going back and forth, that could still have a chilling effect on how songwriters write, because you never know -- is my case going to be the one?\"And unintended infringement is a weak defense: in 1976, George Harrison was found liable for \"subconsciously\" plagiarizing \"He's So Fine\" by the Chiffons for his first solo hit \"My Sweet Lord.\"In his memoir Harrison later wrote that he suffered a \"paranoia about songwriting that had started to build up in me.\"",
        "This week Sheeran told the court that fellow songwriters have told him \"you have to win this for us\" adding with a tone of exasperation that if the Townsend estate prevails, \"I'm done.\"\"I find it really insulting to work my whole life... and have someone diminish it by saying that I stole it,\" Sheeran said on the stand Monday.Bennett said many of his students at Berklee -- a prestigious conservatory of contemporary music -- have voiced concern over the Sheeran case, speaking as the next generation of songwriters.",
        "One of them, 21-year-old Mary Jo Swank, told AFP that \"I've definitely grown a fear that the idea of being completely original and unique is going to put the emotional and creative process of a songwriter in jeopardy.\"\"It'd be nice if I'd be allowed to write my take on a 1-3-4-5 progression without having to worry that it's not unique enough.\""
    ]
}