{
    "articleURL": "/wires/aap/article-12040665/Bulldogs-teenager-Oloapu-real-deal-Burton.html",
    "content": [
        "Matt Burton insists Karl Oloapu is worthy of the hype, declaring the 18-year-old rookie has what it takes to become his long-term NRL halves partner at Canterbury.",
        "But the Bulldogs captain is keen to keep out-of-favour Kyle Flanagan away from rival clubs as the halfback prepares for another week of making way for Oloapu in reserve grade.Rated one of the top young prospects in rugby league, Oloapu joined the Bulldogs in January after the club coughed up a $500,000 transfer fee to allow him to break his three-year Brisbane contract.The Wellington-born playmaker arrived at the Bulldogs to fanfare and speculation, immediately becoming a member of the top-30 squad before making his debut off the bench against St George Illawarra on Sunday.Replacing veteran Josh Reynolds in the halves, Oloapu did not look out of place at NRL level, finishing with a line break and 76 run metres as the injury-hit Bulldogs eked out their first win in a month.\"He was great for us on the weekend,\" Burton said.\"He's got a great attitude, he comes into training every day and works hard, really focuses on his craft and tries to help out the team as much as he can.\"Playing against Oloapu in training sessions has convinced Burton the 18-year-old deserves his plaudits and has the ability to become his long-term co-pilot.\"When he was doing opposed against us the last couple of weeks, he's been towelling us up,\" Burton said.",
        "\"He stands up to the hype.\"He's a great young talent and hopefully we see him a bit more.\"He's got a long future. If he keeps working hard and doing the little things right, there's no doubt we'll see him in for a long time.\"Oloapu's rise into first-grade calculations have left Flanagan the odd man out.Flanagan is in the final season of his three-year Bulldogs contract but was dropped to reserve grade last week to make way for the double act of veteran Reynolds and Oloapu.The 24-year-old has again missed out on selection for round 10 and has been linked with a possible move to Manly, where Josh Schuster has had an unconvincing start to life as a five-eighth and father Shane Flanagan is an assistant coach.On social media on Wednesday, Bulldogs general manager of football Phil Gould strenuously denied such a move was in the works, with Burton hopeful Flanagan would remain at the club well into the future.\"There's obviously a lot of talk and speculation around it but we'd love to have Kyle here in the long-term,\" Burton said.\"We see him as a great teammate.\"Flanagan recovered from a similar axing in 2022, returning to the first-grade side after starting the year in the reserves, and played hooker for Canterbury's NSW Cup side on the weekend.",
        "Burton switched to centre in Penrith's run to the 2021 grand final so he knows first hand that utility value could strengthen Flanagan's case for an NRL recall.\"It's obviously good to have a few positions under your belt. I've obviously had the opportunity to do that with centre,\" he said.\"If he works on that, he can add that (string) to his bow. That'd be great.\""
    ]
}