{
    "articleURL": "/wires/reuters/article-12048339/Lyfts-second-quarter-forecast-disappoints-shares-fall-13.html",
    "content": [
        "Lyft beats Q1 core profit, revenue expectations",
        "Sees Q2 adj profit, revenue below estimatesCEO Risher expects $330 mln a year savings from cost cuts(Rewrites throughout, adds CEO, CFO comments in paragraph 6; updates shares)By Akash SriramMay 4 (Reuters) - Lyft Inc forecast a dull second quarter as price cuts in its race with bigger rival Uber to add more riders take a toll on margins, sending the shares of the ride hailing company down 14% in extended trading on Thursday.Under new CEO David Risher, Lyft is pushing hard to turn around its business by cutting costs even as it lowers prices to catch up with Uber, which has a larger global presence and a diversified source of revenue.\"We view the guidance on the bottom line to be extremely disappointing after the announced cost cuts and given recent execution from larger peer Uber,\" said CFRA Research analyst Angelo Zino.Uber's growth in the rideshare segment is way ahead of Lyft. In the first quarter, it surged 72% compared to Lyft's 14% growth.Cost savings, Risher said in a call with analysts, would be passed on to riders as \"competitive prices\" and drivers as earnings. But finance chief Elaine Paul said pricing in line with Uber would lead to lower revenue per ride and margin deterioration.",
        "Analyst Zino expects Uber's pricing declines to be moderate while Lyft's cuts could be more aggressive.The price cuts led Lyft to add 10% more riders to its platform in the first three months of the year.\"We've seen really nice growth, our share is now north of 30% and earlier this year it was sort of in the mid-to-high 20s,\" Risher said in an interview to Reuters.He said the company should be a \"strong second player\" in the North American rideshare market by the end of the year and expected to save about $330 million a year from cost cuts.Lyft's adjusted core earnings of $22.7 million in the first quarter exceeded expectations of $12 million, according to Refinitiv data, despite a 13.2% rise in costs to $1.22 billion from a year ago.The company said it expected revenue of $1 billion to $1.02 billion, below estimates of $1.08 billion and core earnings of $20 million to $30 million, way behind expectations of $49.3 million.(Reporting by Akash Sriram in Bengaluru; Editing by Arun Koyyur)"
    ]
}