{
    "articleURL": "/wires/reuters/article-12042117/Trevor-Bauer-wins-game-22-months-Yokohama-debut.html",
    "content": [
        "Trevor Bauer was warmly welcomed by a record crowd before the game and delivered a stellar start to win his first game in 22 months in his debut for the Yokohama DeNA Baystars on Wednesday.",
        "Matt Davidson, a former MLB teammate of Bauer's with the Cincinnati Reds, hit a solo home run in the second inning for Hiroshima Toyo Carp's lone run in a 4-1 victory for Yokohama. Bauer struck out nine in seven innings and advanced a runner with a sacrifice bunt in the fifth inning to plate the go-ahead run for the Baystars.Bauer, 32, signed a one-year, $4 million contract with Yokohama to return to baseball after serving a suspension that covered parts of multiple seasons.He described anxiety prior to the game, which led to a nosebleed just before taking the mound. Once the game began, Bauer said everything felt routine.\"I felt great,\" Bauer said. \"I just felt normal. The body felt good: command, velocity, results. All good. It was a great day.\"Bauer had 17 strikeouts in 16 innings in three minor league appearances with Yokohama before Wednesday's start. There are billboards around the stadium promoting Bauer, including one exceeding 100 feet top to bottom that reads in Japanese \"He's here.\"Following the win, Bauer shared a caricature of his performance on Twitter.A capacity crowd received him warmly, with multiple ovations including after the game when Bauer spoke a few words in Japanese translated to \"Nobody beats Yokohama.\"\"The atmosphere in the U.S. doesn't compare to here at all,\" Bauer said. \"The only time it comes anywhere close is sometimes in playoff baseball. I played in a World Series in 2016, and the Cleveland stadium was very loud. But the sustained energy here is just so much different.\"",
        "Bauer is cashing in on his opportunity in Japan. The team is sharing proceeds from his No. 96 jersey, which was prominent before, during and after his first start on Wednesday, while also cooperating on the \"Trevor Bauer Official Fanclub\" which costs around $16,000 (US) for VIP access, including limousine service to games and events and Bauer autographed merchandise.No MLB team offered Bauer a contract when he was reinstated by commissioner Rob Manfred.Bauer, who won the National League Cy Young Award in 2020, last pitched in the majors on June 28, 2021, before allegations of sexual assault surfaced. He was placed on paid leave amid an MLB investigation and ultimately received a record suspension for violating the league's domestic violence policy.Following the investigation, Manfred suspended Bauer for two full seasons over allegations made by a woman who claimed Bauer sexually assaulted her over two encounters. Los Angeles County prosecutors declined to file charges in the case and a judge overseeing the matter called the claims \"misleading.\"On Dec. 22 a neutral arbitrator reinstated Bauer, reducing his punishment from 324 games to 194 -- covering 144 games he was suspended for in 2022 and another 50 games of docked pay this coming season. Bauer was eligible to pitch immediately in 2023.",
        "Bauer was granted his unconditional release by the Los Angeles Dodgers on Jan. 12 after clearing waivers. He had signed a three-year, $102 million contract with the Dodgers after winning the Cy Young with the Cincinnati Reds.--Field Level Media"
    ]
}