{
    "articleURL": "/wires/ap/article-12057867/Brewers-end-6-game-skid-7-3-victory-Giants.html",
    "content": [
        "SAN FRANCISCO (AP) - Willy Adames and William Contreras each hit two-run home runs and the Milwaukee Brewers defeated the San Francisco Giants 7-3 on Sunday to end a six-game losing streak.",
        "Contreras opened up the scoring for the Brewers with a two-run home run in the second inning.The Giants tied it in the second inning. Brett Wisely drove in Blake Sabol one day after hitting his first career home run. LaMonte Wade Jr. singled in Austin Slater.Adames´ sac fly scored Christian Yelich in the third to give the Brewers a 3-2 lead.Adames homered in the fifth for his 100th career home run to make it 5-2.Yelich and Adames added RBI singles in the ninth. Adames finished with two hits and four RBIs.",
        "\"We swung the bats well,\" Brewers manager Craig Counsell said. \"I thought the bullpen guys did an excellent job today. Hats off to those guys. Adrian (Houser) did his job and gave us a chance. ... I thought he did a nice job.\"Thairo Estrada homered in the ninth for the Giants, who ended a four-game winning streak.\"Those are opportunities we need to capitalize on as much as possible,\" Giants manager Gabe Kapler said after his team left 10 runners on base and went 3 for 12 with runners in scoring position.\"It's always disappointing when those rallies are cut short. We have been able to capitalize on some of those and get some big knocks and today we weren't able to.\"",
        "Adrian Houser pitched 4 2/3 innings, allowed seven hits and two runs and struck out five in his first start of the season. Joel Payamps (1-0) earned the win in relief. He struck out three in 1 2/3 innings.Ross Stripling (0-2) allowed seven hits, five runs and two walks in five innings. Stripling hasn´t won a start since Oct. 1 of last year when he was with the Toronto Blue Jays.HONORING VIDA BLUEThe Giants held a moment of silence to honor Vida Blue prior to the game. The three-time World Series champion and former Giants pitcher died on Saturday at the age of 73. He played in San Francisco from 1978-81 and 1985-1986 and won the AL Cy Young and AL MVP during the 1971 season.TRAINER´S ROOMBrewers: Houser made his 2023 debut on Sunday after missing the start of the season because of a strained groin injury suffered during his final spring training start. He spent the past three weeks on a rehab assignment with Triple-A Nashville, where he had a 3.07 ERA in 14 2/3 innings over four starts. ... RHP Tyson Miller was optioned to Triple-A Nashville.Giants: LHP Alex Wood was set to start a rehab assignment with Triple-A Sacramento on Sunday. Wood last pitched on April 18, when he left in the third inning against the Miami Marlins. Wood is dealing with a right hamstring strain.",
        "UP NEXTBrewers: Return home after a six-game road trip and start a three-game series on Monday against the Dodgers. Milwaukee's Freddy Peralta (3-2, 3.63) is scheduled to face Tony Gonsolin (0-0, 3.38).Giants: Start a three-game series at home on Monday against Washington where Anthony DeSclafani (3-1, 2.13 ERA) will take the mound against Jake Irvin (0-0, 2.08).___AP MLB: https://apnews.com/hub/MLB and https://twitter.com/AP_Sports"
    ]
}