{
    "articleURL": "/news/article-12038145/Notorious-short-seller-accuses-Carl-Icahn-running-ponzi-like-scheme.html",
    "content": [
        "Hindenburg Research targeted Icahn Enterprises in its latest scathing report Accused the conglomerate worth $18B of using 'ponzi-like economic structures'Shares of Carl Icahn's company plunged as much as 20% on TuesdayA notorious short-seller has targeted billionaire activist investor Carl Icahn, accusing his company of relying on 'ponzi-like economic structures' to pay unsustainable shareholder dividends.",
        "Hindenburg Research on Tuesday disclosed a short position in Icahn Enterprises (IEP), and issued a report accusing the holding company of inflating the value of its units and taking on too much debt.In a public statement, Ichan slammed the Hindenburg report a 'self-serving', adding: 'We stand by our public disclosures and we believe that IEP's performance will speak for itself over the long term as it always has.' The report sets up a fight between two renowned activist investors, with Hindenburg, run by infamous short-seller Nathan Anderson, taking aim at Icahn, a Wall Street legend who made his fortune as a corporate raider.Shares of IEP, which is controlled by Icahn and had a market valuation of roughly $18 billion at last close, plunged as much as 20 percent in afternoon trading on Tuesday.Hindenburg's report accuses the company of selling its units to new investors to support whopping and 'unsustainable' dividend payouts, which at roughly 15.8 percent are the biggest of any large US company.",
        "'In brief, Icahn has been using money taken in from new investors to pay out dividends to old investors,' the Hindenburg report said. 'Such ponzi-like economic structures are sustainable only to the extent that new money is willing to risk being the last one 'holding the bag'.' ",
        "The report claims that Icahn Enterprises' rich cash dividends are 'mathematically unsustainable' and unsupported by the company's free cash flow.'In the past 4 years alone, IEP has paid out $980 million in cash dividends, despite cumulatively burning almost $1.6 billion in free cash flow,' wrote Hindenburg.Hindenburg also alleged that the valuation of Icahn Enterprises units was inflated by more than 75 percent, and that the company's stock 'trades at a 218 percent premium to its last reported net asset value (NAV), vastly higher than all comparables.' The report also notes that only one large investment bank offers research coverage on Icahn Enterprises: Jefferies, which has maintained a continuous 'buy' rating on IEP while also running all of the company's fresh share offerings since 2019.Hindenburg also notes that Jeffries research reports assume IEP's dividend will continue in perpetuity, even in its pessimistic scenario, a projection the report calls 'one of the worst cases of sell-side research malpractice we've seen.'The report adds: 'Overall, we think Icahn, a legend of Wall Street, has made a classic mistake of taking on too much leverage in the face of sustained losses: a combination that rarely ends well.' Jefferies did not immediately respond to requests for comment from DailyMail.com, and Hindenburg's claims could not immediately be independently verified. ",
        "Far from being an unbiased watchdog, Hindenburg profits from taking large sort positions in the companies it issues reports on, betting that their shares will plunge as markets digest the research.However, Hindenburg's research has previously led to criminal charges and convictions, including that of Nikola founder Trevor Milton, who was found guilty of deceiving investors with exaggerated claims about his electric truck company.In January, Hindenburg targeted Indian billionaire Gautam Adani, in a report alleging his conglomerate Adani Group 'has engaged in a brazen stock manipulation and accounting fraud scheme over the course of decades.'Adani Group vehemently denied the claims and expressed shock at the allegations, which wiped billions off the company's market capitalization and its founder's net worth. In March, Hindenburg issued a scathing report on Jack Dorsey's payments company Block, accusing the firm of misleading investors and embracing a criminal user base. Block fired back in a statement to DailyMail.com, saying it would explore legal action against the short seller for its 'factually inaccurate and misleading report' that was 'designed to deceive and confuse investors'. ",
        "Founded in 2017 by Nathan Anderson, Hindenburg Research is a forensic financial research firm that seeks out corporate fraud, corruption or malfeasance.  It is named after the high-profile 1937 tragedy of the Hindenburg airship, which ignited as it flew into New Jersey, an incident the company describes as the 'epitome of a totally man-made, totally avoidable disaster.' ",
        "Hindenburg says it looks for similar 'man-made disasters' in financial markets 'before they lure in more unsuspecting victims.'The firm typically spends months on its investigations, poring over financial disclosures and talking to current and former employees. The company invests its own capital, and distributes its reports to limited partners who, together with Hindenburg, take short positions in the target companies.",
        "Icahn Enterprises LP issued the following statement in response to the short-seller report:'We believe the self-serving short seller report published by Hindenburg Research today was intended solely to generate profits on Hindenburg's short position at the expense of IEP's long-term unitholders. We stand by our public disclosures and we believe that IEP's performance will speak for itself over the long term as it always has. Today, IEP operates from a position of strength with approximately $2 billion of cash and cash-equivalents on its balance sheet as of March 31, 2023 to execute on our strategy,' stated Carl Icahn, Chairman of the Board of Icahn Enterprises.Mr. Icahn continued: 'We continue to believe that activism is the best paradigm for investing and my activist investments over the last 25 years have well proved this out. We regularly put our activist principles into effect at our majority-controlled companies as well as the minority positions held in our investment segment, and currently have representatives on 14 public company boards. Additionally, we believe strongly in hedging our positions to mitigate risk, especially in markets that we are living in today.'The claims in this short seller report will not deter IEP from fulfilling its commitments to IEP's unitholders and employees. To receive accurate information about the Company, all investors are encouraged to review materials filed by IEP with the Securities and Exchange Commission and available on its investor relations website."
    ]
}