{
    "articleURL": "/wires/ap/article-12047859/Heat-waiting-Butler-play-Game-3.html",
    "content": [
        "MIAMI (AP) - NBA playoff scoring leader Jimmy Butler was with the Miami Heat for their film session Thursday, without any clarity yet if his sprained ankle will be healed enough for him to play in Game 3 of their Eastern Conference semifinal series against the New York Knicks on Saturday.",
        "And if Heat coach Erik Spoelstra has an answer, he's not tipping his hand.\"No update. ... I´m not going to get into all the minutiae of it,\" Spoelstra said. \"When we find out how he is feeling on Saturday, we´ll let you know. That´s what the deal is.\"Butler missed Game 2 of the series - a 111-105 win for the Knicks - because of the ankle, which he sprained with about 5 minutes left in Miami´s Game 1 victory at Madison Square Garden.It was only the fourth game Butler has missed since the last week of January, and two of those were the final two games of the regular season with the Heat locked into the play-in tournament at that point.Knicks coach Tom Thibodeau, after Game 2, made clear that his team will be ready for a Butler comeback.",
        "\"You already know the answer to that,\" Thibodeau said. \"We will. That´s sort of the nature of the beast right now for everyone. You go in, you know guys are nicked-up this time of the year and so there´s always possibilities that guys could be in or out. ... If Jimmy´s available, then we´ll have a plan for him.\"The training room has been a busy place this week for Miami, which has already lost shooting guard Victor Oladipo (knee) for the remainder of the season and shooting guard Tyler Herro (hand) for several more weeks. Wing players Max Strus and Caleb Martin both were dealing with some back pain at times in Game 2, though were able to finish the game.",
        "\"I'm good,\" Strus said Thursday. \"Nothing's wrong with me.\"Having Wednesday, Thursday and Friday with no games sounds like a needed breather for both sides. New York's Julius Randle returned in Game 2 from an ankle sprain, and point guard Jalen Brunson has been playing through an ankle issue.Brunson \"didn't do much\" in practice on Thursday, Thibodeau said, noting his status is day-to-day.\"I think the time off does us well, does us justice,\" Heat guard Kyle Lowry said. \"We're not complaining about it at all. I think it´s good for our team. I think it´s good for our brains to kind of get a little bit of a break from it, but we still can get the mental reps and all that stuff, so it's good from that aspect.\"Lowry indicated that he wouldn't be surprised if Butler tries to play.\"I know how competitive he is,\" Lowry said. \"I would be optimistic, but who knows. Honestly, we've got to go day by day with Jimmy, so we´ll see what happens on Saturday at 3:30.\"Going back to the final two games of last season's Eastern Conference finals, Butler has been on a playoff tear. He´s averaged 36.9 points - and 40.5 minutes - in his last eight postseason games, on 57% shooting from the field while averaging 7.4 rebounds and 4.6 assists.",
        "In the six playoff games so far this season, he´s averaging the league-best 35.5 points on 59% shooting, with 6.8 rebounds and 4.7 assists per game. Included in that: a career-high 56-point effort against Milwaukee in Game 4 of Round 1, followed by a 42-point outburst two nights later as the Heat became the first No. 8 seed in NBA history to lose no more than one game on the way to beating a No. 1 seed.Butler's 35.5-point average is just ahead of Phoenix's Devin Booker, who will take a 35.4-point-per-game average in these playoffs into Game 3 of the Suns' Western Conference semifinal series against Denver on Friday.___AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP_Sports"
    ]
}