{
    "articleURL": "/wires/reuters/article-12047601/Kremlin-drone-incident-gives-Putin-cover-deepen-Ukraine-war.html",
    "content": [
        "Incident is embarrassing but could be useful to Putin",
        "Kremlin sends message that Russia's existence is at stakeEscalation could involve targeting Zelenskiy and team'Terrorist' threat may provide pretext for more repressionBy Andrew OsbornLONDON, May 4 (Reuters) - The humiliating spectacle for Russia of two drones flying over the walls of the Kremlin, its historic seat of power, has spawned conflicting theories about who did it and why - but for Vladimir Putin the incident could yet prove useful politically.Although the drones were destroyed before causing serious damage, the incident highlighted the apparent vulnerability of central Moscow to enemy drones, and prompted angry commentators to query the efficacy of Russia's air defences.Inside Russia, it helped reinforce the Kremlin-backed narrative that its war in Ukraine is an existential one for the Russian state and people.Coming in the run-up to its annual May 9 World War Two victory parade on Moscow's Red Square - a sacred event for many Russians - and at a time when Russia is reported by the West to be racking up further heavy casualties with scant territorial gain in Ukraine, some Kremlin watchers believe its spin doctors may be hoping for a rally-around-the-flag effect.\"It's an attempt to gather all the sacred things in one statement,\" Alexander Baunov, a former Russian diplomat and Kremlin watcher, said of the Kremlin's response.",
        "According to the Kremlin's version, the alleged attack had taken aim at Putin, the Russian flag on the top of the Kremlin senate building, and had cast a shadow over \"Victory Day,\" Baunov told the 'Live Nail' YouTube channel.\"They are trying...to rally people around this (alleged) failed attack. It really is a patriotic mobilisation,\" said Baunov.Such unity - potentially based on a combination of outrage, fear and patriotism - could prove handy at a time when Russia is bracing itself for a long-awaited Ukrainian counter-offensive that Kyiv hopes will see it retake swathes of its territory.After Putin's office framed the drone incident as a Ukrainian attempt on the president's life - something Kyiv denies - politicians from across Russia's political spectrum called for revenge and for Moscow to prosecute what it calls its \"special military operation\" in Ukraine in a much harsher way.Some commentators based in the West queried whether Russia has any options left to escalate, beyond using a tactical nuclear weapon in Ukraine - a scenario that even many hardcore Russian nationalist commentators are not yet advocating.But Moscow does still have some options to escalate - albeit ones that would be condemned as barbaric and illegal in the West - such as targeting Ukraine's presidential administration and other government buildings in central Kyiv and openly trying to assassinate Ukrainian President Volodymyr Zelenskiy and members of his team in a targeted campaign.",
        "Former president Dmitry Medvedev and Vladimir Solovyov, one of the most prominent pro-Kremlin TV commentators, both argued for precisely such action in the aftermath of the drone incident.'COUNTER-TERRORISM OPERATION?'One way for the Kremlin to change tack on Ukraine to pave the way for such action would be to officially designate its campaign in Ukraine as a counter-terrorism operation, something that some nationalist politicians have been lobbying for.It could also designate the Ukrainian government a terrorist organisation and its Western backers like the United States as sponsors of terrorism, something which Vyacheslav Volodin, the lower house of parliament's speaker, spoke about.\"The Kyiv Nazi regime must be recognised as a terrorist organisation. (It) is no less dangerous than Al Qaeda,\" Volodin said in a statement.\"Politicians in Western countries pumping weapons into Zelenskiy's regime should realise that they have become not only sponsors, but also direct accomplices of terrorist activity.\"According to Sam Greene, co-author of a book on Putin and a professor at King's College in London, such a move could pave the way for the Russian authorities to increase repression on the home front even further.\"I would look to see whether the Kremlin doubles down on the terrorism thing and designates the U.S. and others as state sponsors of terrorism,\" said Greene.",
        "\"It would open up massive new avenues for prosecuting any Russian citizen who has contacts with Western governments, and would thus be a logical continuation of existing policy.\"Another option open to Putin, albeit likely to be unpopular, would be to order a new wave of military mobilisation to draft and train up more soldiers for the war. Legislation has recently been updated to bring in electronic draft notices and to tighten loopholes after tens of thousands of draft dodgers fled abroad.Incidents like the drone one could provide political cover.To be sure, in Russia's highly centralised and controlled political system, Putin does not need other politicians demanding payback for him to do what he wants anyway.But major policy shifts and decisions likely to be unpopular with the wider public at home or condemned by the West do need some kind of cover - even if critics deem it flimsy or illegitimate - to explain and justify certain actions.An investigation into the drone incident is certain to uncover shortcomings in Russia's own air defences. That could become a trigger for dismissals or a wider reshuffle if Putin wants one.(Reporting by Andrew Osborn Editing by Mark Trevelyan and William Maclean)"
    ]
}