{
    "articleURL": "/wires/reuters/article-12057837/Rookie-Bryce-Miller-pitches-Mariners-past-Astros.html",
    "content": [
        "Rookie right-hander Bryce Miller pitched six scoreless innings for his first major-league victory as the Seattle Mariners defeated the visiting Houston Astros 3-1 Sunday afternoon.",
        "Julio Rodriguez hit a mammoth home run for Seattle, which won for the sixth time in its past seven games and sent Houston to its fourth loss in five games.Miller (1-0), who retired the first 16 batters he faced in his MLB debut last week in Oakland, gave up two hits to the Astros, walked one and struck out five.Justin Topa pitched the ninth, converting his first career save opportunity.Astros right-hander Brandon Bielak (0-1), making his first start since 2021, allowed three runs -- two earned -- on 10 hits in 4 2/3 innings. Bielak walked two and didn't strike out a batter but limited the damage by getting the Mariners to hit into three double plays.Rodriguez opened the scoring in the bottom of the third, leading off by hitting a 2-2 pitch an estimated 454 feet over the center-field wall, the longest of his two-year career. It was Rodriguez's sixth home run of the season. With two outs, Eugenio Suarez doubled to left and scored when Cal Raleigh hit a hard grounder through the legs of Astros first baseman Jose Abreu for a two-base error.The Mariners added a run in the fifth. Jarred Kelenic hit a one-out double to left and advanced to third on Suarez's infield single. Teoscar Hernandez drew a two-out walk to load the bases and the Astros called on left-hander Matt Gage to face J.P. Crawford, whose three-run double the previous night sparked Seattle's rally for a 7-5 victory. Gage was called for a balk by home-plate umpire Phil Cuzzi because of an illegal toe tap, scoring Kelenic to make it 3-0.",
        "The Astros got on the scoreboard in the seventh. With one out, Abreu doubled to center off reliever Gabe Speier and Kyle Tucker followed with a run-scoring single to right. Matt Brash relieved Speier and got two strikeouts around a single by Corey Julks to end the inning.--Field Level Media"
    ]
}