{
    "articleURL": "/wires/afp/article-12051077/US-hiring-shows-surprise-surge-unemployment-falls.html",
    "content": [
        "Hiring in the United States picked up pace in April and unemployment returned to a multidecade low, government data showed Friday, signaling labor market resilience despite higher interest rates to tackle inflation.",
        "The unexpected surge comes amid banking sector upheaval, higher borrowing costs and uncertainty surrounding a potential government default.The world's biggest economy added 253,000 jobs last month, up from a revised 165,000 figure in March, said the Labor Department.Meanwhile, the jobless rate ticked back down to 3.4 percent, a level last seen in January and before then, the late 1960s.\"Employment continued to trend up in professional and business services, health care, leisure and hospitality, and social assistance,\" the Labor Department said in a statement.Pay gains accelerated as well, with average hourly earnings rising 0.5 percent to $33.36, data showed. Compared with a year ago, the figure is up 4.4 percent.President Joe Biden hailed the figures, saying in a Twitter post: \"My plan to invest in America is working.\"- Slowing trend? -While job gains in March were initially pegged at 236,000, the numbers were revised in the latest report -- alongside a similarly big downward revision to February's figures.\"The aggregate revision is split roughly evenly between February and March, with most of the downshift in the private services sector,\" said Ian Shepherdson, chief economist at Pantheon Macroeconomics.Within the sector, the shift was concentrated in leisure and hospitality, as well as professional and business services components.",
        "But he added: \"The trend in private payrolls is slowing, even after allowing for the unexpectedly big April print.\"For now, economists say the employment report does not change their views that the central bank will hold interest rates steady in June after a series of hikes.The expectation -- following 10 rate hikes -- is that the Federal Reserve will hold rates \"at the current level for some time\" while waiting for the full effects of policy to ripple through the economy, said economist Rubeela Farooqi at High Frequency Economics.- More cooling needed -To rein in stubborn inflation, the Federal Reserve has lifted the benchmark lending rate ten consecutive times since early 2022, with higher lending costs making it pricier to borrow funds for big-ticket purchases or business expansion.Analysts are closely eyeing the job market for signs that the economy is cooling enough for the central bank to pause its cycle of increases.\"For the Fed, this report clearly is not weak enough,\" said Shepherdson of Pantheon Macroeconomics.But if a broader downward trend in payrolls continues, numbers will enter a range in which central banker officials can \"back away\" from their position that the labor market is too tight, opening the door to lower rates, he added.",
        "On Wednesday, the Fed lifted interest rates another quarter-point to the highest range in around 16 years, while noting that tighter credit conditions for households and businesses are likely to weigh on the economy.Although it hinted at the possibility of halting further increases as the economy cooled and first quarter GDP growth slowed to an annual rate of 1.1 percent, the latest figures could complicate matters.\"The Fed's pause was a hawkish one, and if job growth and earnings don't moderate from the April pace, rate hikes could be back in play,\" warned economist Nancy Vanden Houten of Oxford Economics.But this is unlikely, with Vanden Houten noting that her expectation is for job growth to slow as the US economy enters a \"mild recession.\"This comes as the impact of rate hikes and a tightening in lending standards weigh on the economy and the labor market in the second half of the year, she said."
    ]
}