{
    "articleURL": "/wires/reuters/article-12058715/MUFG-launch-venture-debt-funds-worth-400-mln-Japan-Europe.html",
    "content": [
        "By Makiko Yamazaki",
        "TOKYO, May 8 (Reuters) - Mitsubishi UFJ Financial Group Inc (MUFG) said it would launch two new venture debt funds worth $400 million in total for Japanese and European startups, reflecting strong funding demand as the market for initial public offerings remains dull.The debt funds, with $250 million for Europe and 20 billion yen ($148.35 million) for Japan, will be created through Mars Growth Capital, a Singapore-based joint venture between MUFG and Israeli financial tech firm Liquidity Capital, the top Japanese lender said on Monday.With a rise in interest rates and market volatility hurting investment flows and demand for new stock listings globally, demand for venture debt has risen among startups.Since its inception in 2021, Mars has provided debt financing to 30 middle and later stage startups in Asia through two existing funds worth $750 million in total.\"We've seen very strong needs for debt financing in the (startup) market,\" Ryutaro Hiroshima, co-CEO of Mars, said at a briefing. \"We've decided to expand our business to meet such demand.\"Debt financing is also in high demand as it allows startups to raise funds without diluting their existing shareholder equity or ownership, MUFG said.The new Europe fund will take over its capital from the existing funds, while the Japan fund will take in fresh money from MUFG and other investors.",
        "Offering debt to startups with no proven track record of stable revenue involves higher risks for lenders, but Mars controls such risks with its artificial intelligence-driven credit scoring model that forecasts future cash flows from real-time financial and accounting data.If Mars' portfolio firms eventually choose to go public, MUFG plans to support their IPOs with its U.S. alliance partner Morgan Stanley.The Japanese lender said it is also studying the feasibility of expanding the Mars business to the United States. ($1 = 134.8200 yen) (Reporting by Makiko Yamazaki; Editing by Edmund Klamann and Jacqueline Wong)"
    ]
}