{
    "articleURL": "/wires/reuters/article-12042789/Stocks-meander-Treasuries-dollar-fall-traders-wait-Fed.html",
    "content": [
        "MSCI index up slightly; gold above $2,000 an ounce",
        "Dollar dips with Treasury yields, stocks lose some steamOil down ~4%, deepening Tuesday's slumpFed decision due 1800 GMT, 25bps hike expected(Updates prices after U.S. market opens, adds commentary, byline, previous dateline LONDON/SINGAPORE)By Sinéad CarewNEW YORK, May 3 (Reuters) - Wall Street's major indexes were struggling for direction on Wednesday while U.S. Treasury yields fell with traders awaiting an interest rate hike from the U.S. Federal Reserve and for its view on the path forward for rates.Oil futures sold off sharply after a 5% slump on Tuesday as investors worried about the health of the economy ahead of the Fed's statement and a press conference by Chair Jerome Powell Wednesday afternoon.While the dollar index fell, long-term U.S. Treasury yields drifted lower while yields on shorter-dated bills ticked up, as investors positioned themselves before the end of the Federal Open Market Committee (FOMC) meeting.A majority of traders are betting that Powell will announce a 25-basis-point rate hike but investors are waiting for reassurance that the central bank will pause hiking after today.Shares in U.S. banks stabilized after being hammered on Tuesday and causing a ripple effect sell-off in the broader market on concerns that the failure of a third major U.S. bank over the weekend may not be the end of the banking crisis.",
        "While the major indexes opened slightly higher on Wednesday they had lost some steam by late morning.\"It could be a completely different day once we hear from Jerome Powell,\" said Alex Coffey, senior trading strategist at TD Ameritrade who sees investors mostly be focused on Powell's commentary.\"We haven't really had a surprise when it comes to the Fed funds rate in some time. It's going to hinge on the forward guidance,\" he said.Along with clues about the rate hiking path investors will also be listening carefully for Powell's view on the U.S. banking industry, according to Coffey.This week they also have to watch for earnings reports and wait for Friday's U.S. jobs report, and what it might reveal about the economy.And Wall Street is also keeping a wary eye on the U.S. debt ceiling, with lawmakers squabbling and Treasury Secretary Janet Yellen warning of a potential money shortfall as soon as June 1.The Dow Jones Industrial Average fell 69.01 points, or 0.2%, to 33,615.52, the S&amp;amp;P 500 lost 4.03 points, or 0.10%, to 4,115.55 and the Nasdaq Composite added 18.24 points, or 0.15%, to 12,098.74.The pan-European STOXX 600 index rose 0.29% and MSCI's gauge of stocks across the globe gained 0.12%.The dollar fell ahead of the Fed statement indicating bets that it make indicate a pause in the hiking cycle, which could lead to further dollar declines.",
        "The dollar index fell 0.461%, with the euro up 0.5% to $1.1054.The Japanese yen strengthened 1.04% versus the greenback at 135.13 per dollar, while Sterling was last trading at $1.2539, up 0.60% on the day.\"There´s every indication and every anticipation that the Fed will raise today and then it will pause,\" said Joseph Trevisani, senior analyst at FXStreet.com.In U.S. Treasuries, benchmark 10-year notes were down 6.4 basis points to 3.375%, from 3.439% late on Tuesday. The 30-year bond was last down 6.4 basis points to yield 3.6681%, from 3.732% while the 2-year note was last down 4.5 basis points to yield 3.9346%, from 3.98%.In energy, U.S. crude recently fell 4.06% to $68.75 per barrel and Brent was at $72.44, down 3.82%.Gold held its gains from the previous session on Wednesday as economic uncertainty countered strong private payrolls data, while investors positioned for the Fed.Spot gold added 0.3% to $2,022.10 an ounce. U.S. gold futures gained 0.22% to $2,018.70 an ounce. (Reporting by Sinéad Carew in New York and Karen Brettell, additional reporting by Nell Mackenzie in London, Tom Westbrook in Singapore, Editing by Lincoln Feast and Kim Coghill; Editing by Emelia Sithole-Matarise and Angus MacSwan)"
    ]
}