{
    "articleURL": "/wires/ap/article-12041985/Russia-says-foiled-alleged-drone-attack-Kremlin.html",
    "content": [
        "MOSCOW (AP) - Russian authorities accused Ukraine on Wednesday of attempting to attack the Kremlin with two drones overnight in an effort to assassinate President Vladimir Putin. The Ukrainian government denied any involvement.",
        "The Kremlin decried the alleged attack attempt as a \"terrorist act\" and said Russian military and security forces \"disabled\" the drones before they could strike. It did not elaborate.A statement on the Kremlin's website said debris from the unmanned aerial vehicles fell on the grounds of the seat of Russia's government but did not cause any damage. The statement, which did not explain what caused the drones to break up, said no casualties were reported.A video published overnight on a local Moscow news Telegram channel, which appeared to have been shot across the river from the Kremlin, showed what looked like smoke rising over the Kremlin.According to the text accompanying the video, residents of a nearby apartment building reported hearing bangs and seeing smoke at around 2:30 a.m. local time (7:30 p.m. Eastern.) It was impossible to independently verify the posted footage.Ukraine´s presidential advisor, Mykhailo Podolyak, argued that it would not make sense to target the Kremlin during Russia's war on his country.",
        "\"We do not attack the Kremlin because, first of all, it does not solve any military problems. Absolutely. And this is extremely disadvantageous from the point of view of preparing our offensive measures,\" Podolyak said.\"And most importantly, it would allow Russia to justify massive strikes on Ukrainian cities, on the civilian population, on infrastructure facilities. Why do we need this?\" he added.",
        "The Kremlin didn´t present any evidence to back up its account, including the allegation of an assassination attempt as Russia prepares to observe its annual Victory Day on Tuesday.\"We consider these actions as a planned terrorist act and an attempt on the life of the president of Russia, carried out on the eve of the Victory Day, the parade on May 9, where foreign dignitaries are expected,\" the Kremlin's statement read.Russia retains the right to respond \"when and where it sees fit,\" the statement said.Kremlin spokesman Dmitry Peskov told Russian state news agency RIA Novosti that Putin wasn´t in the Kremlin at the time and worked Wednesday from his Novo-Ogaryovo residence outside Moscow.The Kremlin added that Putin was safe and his schedule was unchanged. Peskov said the Victory Day parade would take place as scheduled.Shortly before the news about the alleged attack broke, Moscow Mayor Sergei Sobyanin issued a ban on using drones in the Russian capital, with an exception for drones launched by authorities.Sobyanin didn't cite a reason for the ban, saying only that it would prevent \"illegal use of drones that can hinder the work of law enforcement.\"A lawmaker who represents Crimea in Moscow, Mikhail Sheremet, told Russian state media that the Kremlin should order a missile strike on Ukrainian President Volodymyr Zelenskyy´s residence in Kyiv in retaliation for Wednesday's alleged incident."
    ]
}