{
    "articleURL": "/wires/ap/article-12058119/Jokic-gets-technical-tries-ball-Suns-owner.html",
    "content": [
        "DENVER (AP) - Denver Nuggets center Nikola Jokic was fined $25,000 by the league Monday for making improper contact in the stands with Phoenix Suns owner Mat Ishbia.",
        "No suspension, though. The two-time NBA MVP is all set for Game 5 on Tuesday night in Denver, with the second-round series tied at 2-2.It was nearly the outcome Ishbia was hoping for in a series where the home team has won every game.On his Twitter account Monday, Ishbia praised his team's performance and urged no further disciplinary action for Jokic.\"Great win for the Suns last night in an amazing series so far!\" Ishbia posted. \"That should be and is the only story. Suspending or fining anyone over last nights incident would not be right. I have alot of respect for Jokic and don´t want to see anything like that. Excited for game 5! Go Suns!\"Jokic was assessed a technical foul in the second quarter of Game 4 on Sunday night when the big man tried to snatch the ball back from Ishbia, who was sitting courtside, and hit Ishbia with an elbow.",
        "The situation set social media ablaze and overshadowed a game in which the Suns won 129-124. One of the topics up for debate was whether it was a flop by Ishbia, a former walk-on basketball player at Michigan State, or excessive contact from Jokic.\"I was hoping they´d give him a flopping charge,\" Nuggets coach Michael Malone said Monday about Ishbia. \"That would probably be the only fine I could imagine, but I have no idea.\"",
        "Suns standout Kevin Durant figured the incident and resulting fine would be a story, but was glad it's been resolved.\"None of that can get in the way,\" Durant said after practice Monday night at Ball Arena. \"We can just focus on basketball.\"The mini-fracas began when Suns guard Josh Okogie crashed into the seats while trying to save a loose ball. He landed in a group of fans on the baseline that included Ishbia, who held on to the basketball.Jokic was trying to get the ball quickly - apparently so the Nuggets could start getting into their offensive possession - when he attempted to grab the ball away from Ishbia. The ball flew backward into the crowd, and then Ishbia was knocked backward by Jokic's elbow.Jokic defended his actions after a game in which he had 53 points and 11 assists.\"The fan put the hand on me first,\" Jokic explained. \"I thought the league was supposed to protect us. Maybe I am wrong. I know who he is, but he is a fan. Isn´t he?\"Malone agreed.\"That´s not an owner in the stands. He´s a fan,\" Malone said Monday. \"We don´t designate who´s in the stands. I just felt after watching that whole incident, Nikola is just trying to get the ball. I felt the embellishment was almost comical, from my standpoint.\"",
        "There were a few minutes of confusion as officials sorted out the weird scene, and then Jokic was assessed a technical foul. The Suns made the ensuing free throw.Devin Booker finished with 36 points and 12 assists. He also gave a shout-out to the Suns owner.\"He got us a point!\" Booker said with a grin.Ishbia has been the Suns´ owner for only a few months, purchasing the team from the embattled Robert Sarver.Ishbia told The Associated Press at halftime that he was \"fine\" and more worried about the game than the altercation. He was back in his usual seats in the second half.The tiff didn't seem to bother Jokic, either - the MVP runner-up scored or assisted on 78 points Sunday, which was the most in a playoff game by a center in NBA history, according to ESPN Stats &amp; Info.___Brandt reported from Phoenix.___AP NBA: https://apnews.com/hub/NBA and https://twitter.com/AP_Sports"
    ]
}