{
    "articleURL": "/wires/ap/article-12058251/Angel-City-hangs-3-2-win-Kansas-City.html",
    "content": [
        "Alyssa Thompson, Claire Emslie and Jun Endo scored in the first half to give Angel City a 3-2 win over the Kansas City Current on Sunday.",
        "The National Women's Soccer League match was played in front of 19,219 fans at BMO Stadium in Los Angeles.CeCe Kizer had a goal and an assist for Kansas City in the second half to keep it close, but Angel City (2-2-2) hung on for the win.Thompson, who was named the league's March/April Rookie of the Month, scored her third goal of the season in the 32nd minute. The forward ran onto a pass from Emslie and cut the ball to her right foot near the end line. From a tight angle, Thompson chipped a shot off the far post and into the goal.Emslie doubled Angle City's lead in the 43rd, sliding to connect with a cross from Endo, before Endo's left-footed shot made it 3-0 in first-half stoppage time.Running onto a dropped pass from Kizer in the 57th, Isabel Rodriguez blasted a one-touch shot with her left foot into the goal. It was her first professional goal.Kizer pounced on a rebound from midfielder Debinha's shot, making it 3-2 in the 61st.Kansas City (2-4-0) finished with 11 shots, but goalkeeper DiDi Haracic made six saves to secure the win for Angel City.GOTHAM 2, RED STARS 1Goals from Lynn Williams and Jenna Nighswonger gave NJ/NY Gotham a road win over the Chicago Red Stars.",
        "Rookie Nighswonger scored her first NWSL goal in the 5th minute, sprinting to the far post to tap in a deflected cross.In first-half stoppage time, Williams received a pass from Sinead Farrelly. She turned and sent a low, driven shot into the lower left corner. It was Williams' fourth regular-season goal and her 103rd career goal contribution in all NWSL competitions, the most in league history.In the 54th minute, Ella Stevens headed in Julia Bianchi's cross for the Red Stars (1-4-1) to bring it within one.Gotham (4-2-0) finished with 14 shots, and Red Stars goalkeeper Alyssa Naeher made five saves.___AP soccer: https://apnews.com/hub/soccer and https://twitter.com/AP_Sports"
    ]
}