{
    "articleURL": "/wires/ap/article-12042017/Airbnb-push-rooms-low-cost-option-house-rentals.html",
    "content": [
        "DALLAS (AP) - Airbnb is making a renewed push into renting single rooms in a nod to its beginnings and a realization that renting an entire house is too expensive for many travelers, especially younger ones.",
        "The short-term rental company rolled out a new offering Wednesday that it calls Airbnb Rooms. Guests can rent a room in the same house or apartment as their host at prices that Airbnb says will average $67 a night.\"It is an admission that travelers care more about affordability than they did a year ago,\" said CEO Brian Chesky.Airbnb has always listed single rooms in houses and apartments. The company said the new offering will give more biographical information about hosts, and consumers can sort listings to learn details including whether their bedroom door locks and the bathroom is private or shared.It's a throwback to the original concept that Chesky and Joe Gebbia - now chairman of Airbnb - had in 2007, when they took guests in their San Francisco apartment to help pay the rent. Since then, Airbnb listings have shifted toward whole houses, and prices have soared, to an average daily rate of $153 late last year.\"This is going to be especially popular for the next generation of travelers,\" Chesky said of the new offering. \"The average Gen Z traveler wants to pay less than $100 a night.\" (Generation Z is usually defined as people born between roughly the mid-1990s and 2010.)",
        "It's an interesting gambit. During the pandemic, Airbnb took business from hotels because travelers wanted rentals where they could avoid contact with strangers. Rival Vrbo, owned by Expedia, is still running advertisements bragging that it only rents whole houses.",
        "Separately on Wednesday, Uber also announced a move to cater to cost-conscious consumers. The ride-hailing company said it is expanding discounts for sharing a ride to make its service more affordable and reduce the number of cars on the road. The discounts are available in a dozen cities, and Uber said it will add five more in the U.S., including Washington and Miami.Uber's move comes two weeks after rival Lyft informed employees that it will lay off about a quarter of its work force to cut costs and reduce fares.Airbnb made $1.9 billion last year - the first full-year profit in its history - on higher bookings and revenue. Analysts expect the San Francisco company to be even more profitable this year.Airbnb has had its stumbles too. Resistance to high cleaning fees led the company to change the way prices are displayed in November, which it says will rein in runaway fees. Airbnb declined to provide figures when asked if fees have dropped.And social media posts about long checkout instructions went viral. Some hosts asked guests to perform tasks such as taking out the trash and laundering the sheets - even though the guests were paying a hefty cleaning fee.Airbnb said it will let consumers see checkout lists before they book. It is also tweaking the hosting side of the application to nudge owners against adding chores that could lead to poor reviews and get them booted off the platform.",
        "\"In six months to a year, there should be a material reduction in onerous checkout tasks,\" Chesky said. \"This should hopefully not be a meme anymore.\""
    ]
}