{
    "articleURL": "/wires/ap/article-12039283/Navy-commander-pulled-job-connection-SEAL-death.html",
    "content": [
        "WASHINGTON (AP) - The commander of the Naval Special Warfare Center who was reprimanded in connection with the death last year of a Navy SEAL candidate has been pulled out of his job about two months early, U.S. officials said Tuesday.",
        "Navy Capt. Brian Drechsler is being moved to another job as Navy officials seek new leadership for the Center, more than a year after SEAL candidate Kyle Mullen collapsed and died of acute pneumonia just hours after completing the grueling Hell Week test.Drechsler was one of three Navy officers who received administrative \"non-punitive\" letters as a result of Mullen's death. They were not directly blamed for his death and Drechsler has not been formally relieved of duty, although such an investigation is likely a career-ender. His transfer is the first step in an ongoing review to determine if any additional punishment is warranted. Officials said Drechsler will be serving as a special assistant at Naval Special Warfare Command, and had been planning to retire.Mullen´s death has shined a light on the brutal Hell Week that pushes SEAL candidates to their limits. The five-and-a-half day test involves basic underwater demolition, survival and other combat tactics, and during the test sailors get to sleep just twice, for two-hour periods only. It tests physical, mental and psychological strength along with leadership skills, and is so grueling that at least 50% to 60% don´t finish it.In a brief statement released Tuesday, the command announced the change in leadership, but made no mention of Mullen. It said Navy Capt. Mark Burke will take over command of the center. The decision was made by Rear Adm. Keith Davids, who took over as commander of Naval Special Warfare Command last August. Officials said the change was done to bring new leadership in to address the ongoing challenges and not due to poor performance or wrongdoing.",
        "Two others got non-punitive letters: Capt. Brad Geary, commanding officer of Naval Special Warfare´s Basic Training Command, and an unnamed senior medical officer. The medical officer remains in his same job and Geary moved to a staff job, in a change that was planned before the death.",
        "In a message to his command, obtained by The Associated Press, Drechsler said, \"It is crucial that we maintain the momentum we have made to improve our training, safety, and medical oversight while balancing the need to forge the world´s greatest warriors.\"A report released last October by the command concluded that Mullen, 24, from Manalapan, New Jersey, died \"in the line of duty, not due to his own misconduct.\" It said he had an enlarged heart that also contributed to his death, which came soon after he successfully finished Hell Week, which is part of the first phase of assessment for SEAL candidates striving to get into the Basic Underwater Demolition/SEAL, or BUD/S, class. The training was at the Naval Special Warfare Training Center in Coronado, California.The report also raised questions about the monitoring of SEAL candidates as they grind through the arduous tests, and the adequacy of medical scrutiny on the sailors, who often avoid seeking medical help out of fear it will disqualify them.",
        "Since Mullen's death, Drechsler and the command have instituted a number of changes, including advanced cardiology screening of SEAL candidates for heart problems; pneumonia prevention shots; more medical scrutiny after Hell Week ends; increased training regarding performance-enhancing drugs; and expanded training for instructors.The medical examiner´s autopsy report found that there was no evidence of performance-enhancing drugs in Mullen´s system and that they were not a contributing cause of death.Mullen first began BUD/S in July 2021, but suffered heat stroke and left the class for recovery. He was cleared to join another class, went through orientation and began again in January 2022.The report said that during his first week, classmates said he had breathing issues, and they believed it to be swimming-induced pulmonary edema, which occurs when fluid accumulates in the lungs. The breathing problems were not reported to medical staff, the report said.It said he was seen by medical staff during during the Hell Week test due to shortness of breath and problems with his knee. In medical checks after the test ended, his lungs were deemed \"abnormal\" and he went to the barracks in a wheelchair due to swelling in his legs. His condition worsened, and a medical officer recommended they call 911, but that wasn´t done until about 90 minutes later. He was taken to the hospital and died.",
        "The reluctance by some candidates to seek medical help as well as the potential use of banned drugs by SEAL candidates are issues the Navy has been looking into.Officials acknowledge that the use of performance-enhancing drugs has been a persistent problem, particularly with special operations forces and service members trying to get through rigorous training and evaluation courses. Some additional testing for the drugs is already being done in connection with the SEAL course. Since February 2022, more than 75 candidates - out of 2,500 - tested for higher testosterone levels, indicating possible drug use. Most returned to training after additional tests, or dropped out. About a dozen were determined to be using performance-enhancing drugs.The banned drugs were a key focus of the ongoing investigation by the Naval Education and Training Command, or NETC. The command is taking a deeper look at the entire SEAL training course, including policies, procedures and proper oversight by commanders. The results of that investigation are expected to be released in about a month.NETC is also reviewing the personnel decisions to determine if they were adequate or if any actions should be taken against others at the command.Drechsler is a 1999 graduate of the Naval Academy, served in SEAL units throughout his career, deployed to Iraq and Afghanistan and has received the Legion of Merit award and three Bronze Stars, including two with a combat \"v\" for heroism. Burke is also a 1999 graduate of the Naval Academy and served in SEAL units through his career, deployed to Iraq and Afghanistan, and received a Silver Star, five Bronze Stars with combat \"v\" for heroism and a Purple Heart."
    ]
}