{
    "articleURL": "/wires/reuters/article-12039849/Montana-transgender-legislator-loses-court-bid-return-floor.html",
    "content": [
        "May 2 (Reuters) - Censured Montana transgender Representative Zooey Zephyr on Tuesday lost a last-minute legal attempt to rejoin debate on the House floor, as a Montana judge rejected her attempt to overturn the legislature's punishment that silenced her.",
        "Republicans controlling Montana's House of Representatives on April 26 barred Zephyr, a Democrat, from the House floor, anteroom or gallery for the remainder of the legislative session, which could end as soon as Tuesday night.The censure was punishment for breaking decorum during debates on transgender bills including one that would deny healthcare treatment for transgender youth.Zephyr told Republicans they would have \"blood on your hands,\" prompting them to cut off her microphone, and days later she was later denied floor privileges for encouraging a noisy but peaceful demonstration that disrupted a House session.The American Civil Liberties Union of Montana had argued that Speaker of the House Matt Regier and Sergeant at Arms Bradley Murfitt had \"unfairly, unjustly, and unconstitutionally\" silenced Zephyr's constituents.District Court Judge Mike Menahan found the court's authority was limited due to the constitutional separation of powers between the legislative and judicial branches.\"Even if the Court ultimately finds the House of Representatives, Speaker Regier, and Sergeant at Arms Murfitt acted unlawfully under the facts of this case, it does not have the authority to issue a broad permanent injunction to effectively remove all legislative authority ... in relation to a single member,\" Menahan wrote in his order.The ACLU of Montana was considering its options including appeal but acknowledged a practical difficulty considering the legislative session was expected to end Tuesday night or Wednesday, a spokesperson said.",
        "Montana's governor signed the bill denying gender-affirming care to minors into law on Friday, two days after the House voted to censure Zephyr. (Reporting by Daniel Trotta; Editing by Richard Chang)"
    ]
}