{
    "articleURL": "/wires/reuters/article-12061237/Twins-Padres-look-improvement-entering-interleague-set.html",
    "content": [
        "After losing their 10th straight regular-season series to the rival Los Angeles Dodgers, the San Diego Padres will head to Minneapolis for a three-game interleague series with the Minnesota Twins starting Tuesday night.",
        "It's the start of a six-game road trip that ends with a rematch with the National League West leaders at Dodger Stadium beginning on Friday.Right-hander Michael Wacha (2-1, 5.46 ERA), who is 3-1 with a 4.13 ERA in five career starts against the Twins, will start the series opener for San Diego. Wacha is 1-1 with a 7.36 ERA in two career starts at Target Field.Minnesota will counter with right-hander Louie Varland (0-0, 5.91), who will be making his eighth major league start and facing San Diego for the first time.San Diego had an off day on Monday to try to regroup after a bitter 5-2 loss in 10 innings in the series finale against the Dodgers. Closer Josh Hader was one out away from closing out a 2-1 victory in the rubber game of the series when Mookie Betts homered to left-center to tie it.The Dodgers then scored three times in the 10th off reliever Brent Honeywell on Michael Busch's go-ahead single and a two-run homer by James Outman to pull out the dramatic win.\"It's going to happen sometimes,\" San Diego manager Bob Melvin said of Hader blowing his first save opportunity in 12 tries. \"Hader's been absolutely fantastic. He had one more out to get, and Mookie Betts is a tough customer.",
        "\"We would have loved to have taken the first series (with the Dodgers), especially here at home. We had a chance to. We just couldn't finish it off.\"Despite the loss, the Padres, who sputtered out of the gate with an 8-11 start, trail the Dodgers by just three games heading into Monday's action.\"We're still above .500 (18-17),\" shortstop Xander Bogaerts told MLB.com. \"That's not the baseball we want to play, but we started off pretty bad. Sometimes you lose tough games against a really good team.\"Minnesota is coming off a 2-4 road trip that concluded with back-to-back losses at Cleveland. The Twins are trying to jump-start an offense that managed a total of just five runs and 12 hits in Cleveland over the weekend.The Twins, who rank last in the majors with a .220 team batting average, managed just one hit in a 2-0 loss in Sunday's finale. Cal Quantrill threw 6 2/3 no-hit innings before yielding a line single to Alex Kirilloff. Guardians rookie Peyton Battenfield retired the first 17 Twins he faced in the series opener won by Minnesota, 2-0, on a two-run homer by Max Kepler.\"Our team has been hitting the ball over the fence when we do hit the ball,\" Twins manager Rocco Baldelli said.",
        "Led by Byron Buxton (eight) and Joey Gallo (seven), Minnesota ranked eighth in the majors with 45 home runs and also was a respectable 14th in runs scored (152) as of Monday. The Twins enter the new week leading the American League Central by 2 1/2 games in strong part due to a pitching staff that ranks third with a 3.33 ERA, behind only Tampa Bay (3.01) and Houston (3.32).Third baseman Jose Miranda is in the middle of a 3-for-24 slump while Gallo is 0-for-23 with six walks in his last 29 plate appearances. Shortstop Carlos Correa is batting just .193 with five home runs.\"I think there's a few guys that don't feel comfortable with the strike zone right now, and which pitches to attack or which areas of the plate they're trying to really look towards,\" Baldelli said. \"We've got to do better. We've got to swing at better pitches. We've got to find a way to find the barrel (of the bat).\"--Field Level Media"
    ]
}