{
    "articleURL": "/news/article-12044537/DAN-HODGES-votes-Starmer-Crescent-Darlington-reveal-Rishis-battle-Labour.html",
    "content": [
        "Patch of asphalt could be seen as emblematic of Tories' hopes in local electionsOriginally named Sunak's Pothole after PM visit, it still took two weeks to fill What the votes in Starmer Crescent, Darlington, reveal about Rishi's battle with Labour to hold the Red Wall",
        "A patch of asphalt in Emley Moore Road, Darlington, could be seen as emblematic of the Tories' hopes in tomorrow's local council elections.The spot on the ground was originally nicknamed Sunak's Pothole after the Prime Minister was photographed looking at the offending crater while visiting the County Durham town on a campaign visit.Despite its sudden notoriety, it took two weeks before the pothole was finally filled.Yesterday, I asked a Darlington pensioner called Andy if he was impressed. Staring quizzically over his garden fence, he replied: 'Not really.'",
        "Was his lukewarm response down to the quality of the workmanship of the pothole-filling, or of Rishi Sunak himself?'Neither. But I'm certainly not impressed by him. I'm not impressed by any of them politicians. You can't trust 'em.'Darlington Council is one of the key battlegrounds in tomorrow's elections. It is a litmus test for the strength of the so-called Tory Red Wall — that phalanx of traditional Labour voters who helped Boris Johnson's Tories score a resounding victory at the 2019 general election.Currently, control rests on a knife-edge, with 22 Tory councillors, 16 Labour and 11 assorted Lib Dems, Greens and Independents. Hence the PM's studied interest during his March visit in the tarmac ringing the tightly packed terraced newbuilds of the Firthmoor housing estate.",
        "But will his high-profile stopover bear political fruit? 'Rishi who?' asks Linda, who works behind the counter of the corner shop. 'Sunak. The Prime Minister!' chips in Sofie, who has popped in to do some shopping.What does she think of the Prime Minister's pothole diplomacy? 'Fixing one pothole? There's hundreds round here. He could do with fixing the country.'The Firthmoor estate is in the Eastbourne ward, the redoubt of Tory council leader Jonathan Dunston. And it appears to be hotly contested. Red and Blue election posters jostle for prominence in numerous windows, while a formidable-looking Labour canvassing team braves the rain — and a small posse of local children zoom around on their bicycles.",
        "But delivery driver Alastair Cole isn't sure any of the parties are really focusing on the priorities of local residents. 'Yeah, fixing the potholes is nice. But that's not the biggest issue round here. The main problem is anti-social behaviour.'He gestures to a grassy play area opposite, which is scarred by wheel treads. 'Youngsters keep turning up here late at night, and doing donuts in their four-by-fours. Someone's put a security camera up. But it's pointing at the shops, not here. So it's no use to us.'It quickly becomes clear that Rishi Sunak's trip hasn't exactly created a sea-change in the Firthmoor political weather, which you would assume creates an opening for his chief opponent.",
        " He could do with fixing the country  As I take a stroll along the nearby — and fortuitously named — Starmer Crescent, where the average house is valued at £146,000, I come across Darren Henneyman washing his car. He is an engineer and a former trade union rep. His father was a trade union rep before him. I assume he'll be voting Labour tomorrow.While he admits, 'Sunak doesn't do anything for me', he says he hasn't made his mind up. 'As working people, we're fighting to find a bit of light at the end of the tunnel.'He then forms his thumb and index finger into a tiny circle to show how small that end of the tunnel is. And then throws out his arms wide to show how big the light is for people such as Sunak.And Keir Starmer? 'Is he really any different?' wonders Darren. 'He's like all the rest. Just interested in tearing lumps out of the other guy.'To an outsider, Darlington is primarily associated with Britain's golden age of industrialism. George Stephenson, the 'Father of Railways', chose the town as the hub of the first steam-operated passenger line.Local company Whessoe started as an ironmonger's shop on nearby Tubwell Row, and became one of the world's greatest engineering companies. But, as a whole, the borough is quite rural. ",
        "Driving out of the town centre along the tree-lined Coniscliffe Road, the compact newbuilds are replaced by elegant Georgian terraces.Instinctively, this looks like fertile ground for the Tories. But there are a significant number of 'Vote Green' posters poking out from well-appointed front yards.In the snug of the Baydale Beck Inn, I met Sharon and Neil. She is a teacher and is solid Labour. 'What's happening to education is horrific,' she says.But Neil – a former youth worker who now works in a local factory – has joined the swelling ranks of those disillusioned by both main parties. 'I'm voting for the Greens,' he says. 'I'm going to give them a chance. I want to see who'll just do what's right for the country, rather than themselves.'He says the area used to have 36 youth workers and two youth centres. 'Now they've gone. And then people wonder about why youth crime is soaring.'He shakes his head. 'They ask you to move mountains. But they're not even prepared to give you the shovel to do it.' Life is very different on the picturesque village green of Heighington. There are no yobs' tyre marks here — the stone pump-head built in 1815 by the vicar Samuel Gamien has a sign saying 'Damage to the village greens is an offence liable to prosecution'. ",
        " I've never known it this hard  Around the perimeter there is bunting ready for the Coronation, and even the oppressive grey clouds can't spoil what the BBC once declared was 'the most perfect village in Britain'.Unsurprisingly, Heighington sits in the safest Tory ward in the borough. As I chat to retired postman Mark Stephenson, out walking his dog, it initially appears this brick of Sunak's Blue Wall is holding firm. 'I always vote Tory,' Mark explains. He says Tory councillor Gerald Lee has 'done a lot of good things for this village'.But then Mark says: 'I'm not sure how I'm voting this time. I'm sure Rishi Sunak is a lovely person. But he's just too out of touch. Or maybe he does understand ordinary people; but if he does, he doesn't know how to show it'.Council elections invariably provide an imperfect snapshot of the electoral landscape. Turn-out is low. Myriad local issues confound efforts to divine a national mood.But listen hard, and in the background you can detect a low but steady political drumbeat. And it can be heard reverberating across Darlington.Yes, there is disillusionment across the whole political class, one that the minor parties will almost certainly capitalise on. Yes, there is scant enthusiasm for Starmer or his anaemic political offer.",
        "But when Rishi Sunak steps out of his armour-plated limo on to places like the Firthmoor Housing Estate, he may as well be stepping out of a flying saucer.There is no overt hostility. But to ordinary working Britain, he carries with him the empathy and affinity of a visitor from another world.Before leaving Heighington, I pop into the George And Dragon pub where Karen, the landlady, is studiously supervising the hanging of a banner of the King. But she's not really in a celebratory mood.'I've never known it this hard,' she says. 'The cost of living crisis is hitting everyone round here. I've lived through a lot of recessions. But this is the hardest. 'I've just had to raise the price of beer by 30p a pint. That may not be much to you, in London. But for my regulars that means a lot.'Rishi Sunak managed to get his pothole filled in, eventually. It's unlikely to be enough."
    ]
}