{
    "articleURL": "/wires/ap/article-12047795/Cyprus-freezing-Russian-assets-EU-official-says.html",
    "content": [
        "NICOSIA, Cyprus (AP) - The European Union´s executive arm wants to delve deeper into why Cyprus has only frozen 100 million euros ($110 million) worth of assets belonging to Russians facing sanctions amid the war in Ukraine, the bloc's justice commissioner said Thursday.",
        "Compared with other EU member states that have each frozen as much as 2 billion to 4 billion euros worth of Russian assets, Cyprus´ reported sum \"seems to be a little low,\" European Commissioner for Justice Didier Reynders said.After talks with Cyprus Justice Minister Anna Koukkides-Procopiou, the EU wants to review sanctions enforcement in the east Mediterranean island nation given the large amount of Russian investments there, Reynders said.He cited a Cyprus Central Bank report saying that in 2020 alone, the country received 96 billion euros in Russian investments.\"It´s a real concern, but for the moment, we are in the phase where we ask to receive more and more (information) about the reason why it´s so low or about the fact it may be possible to increase\" the amount of frozen assets, Reynders told reporters.He said the bloc also wants to look into how Russian assets flowed out of Cyprus and other EU member states \"sometimes with the support of service providers at the national level\" following Russia´s invasion of Ukraine.The EU official said a delegation from the EU´s Financial Services, Financial Stability and Capital Markets Union Directorate will visit Cyprus at some point to discuss the issues in depth.Cyprus President Nikos Christodoulides pledged last month to crack down on any sanction breaches after the U.S. and U.K. included 13 Cypriot nationals and other legal entities in a new round of sanctions targeting the financial networks of two Russian oligarchs.",
        "Christodoulides said Cyprus had \"suffered enough\" from such allegations given the country´s financial ties with Moscow, adding that the crackdown afforded authorities the opportunity to stop its name from being sullied further.Authorities in Cyprus have launched their own probe into whether the 13 individuals and other entities had indeed broken the EU's sanctions against Russia and has asked for assistance from U.S. and U.K. authorities."
    ]
}