{
    "articleURL": "/sport/othersports/article-12038271/Sir-Steve-Redgrave-admits-struggled-depression-discovering-low-testosterone-levels.html",
    "content": [
        "A friend suggested recently that his situation could be related to the deficiencyHe got checked out and discovered the cause for his latest health strugglesThe ex-rower also lives with diabetes but is determined to make the most of lifeSir Steve Redgrave has opened up on his health issues after his recent struggles.",
        "The former rower, now 61, has been dealing with several symptoms related to testosterone deficiency in recent months, with knock on effects causing other damaging impacts.He was diagnosed with type 2 diabetes when he was 35, just years before he retired from rowing.He also found out he had ulcerative colitis in 1992, a condition which causes an inflammation of ulcers in the colon and rectum.Speaking to The Mirror, Redgrave admitted his recent battles have resulted in symptoms of tiredness and depression, along with other noticeable feats.",
        "'What I’ve been noticing is more weight gain, especially around the stomach area,' he said. 'A little bit more tiredness, culminating in depression, which I would class as the worst side of it.'At first, I thought it was just getting older,' he said. 'I just accepted it. It just wasn’t something I had really considered.'The five-time Olympic champion also discussed his battle with diabetes and the struggled he had to go through with the condition while still being an elite athlete.He credited his medical team for their help, but it wasn't easy.'When I was an athlete I was finger pricking my blood 10 times a day,' he revealed. 'Things have come a long way in treatment. The pump has made a big difference and my general health got a little bit better when I was being given a small amount of insulin all the time, 24 hours a day, compared to when you were injecting.",
        "'I had an amazing medical team to help me find the way through.''My control is so much better than it was 20 years ago, though my wife Ann, who is a doctor, would say not as good as it should be.'Redgrave's health appears to be on the decline, but he's determined to be as fit as he can be for the rest of his days. ",
        "He also urged more men to keep on top of their health, particularly when it comes to testosterone levels.'I am starting to notice less feeling in my feet which is another one of the problems, especially being very tall,' he said. 'You’ve got all these complications that don’t hit you here and now, but will creep up on you sooner or later.'My eldest daughter is expecting at the moment and I’m looking forward to being a grandparent. I want to be fit and healthy, and there are a lot of projects I want to get done around the house.",
        "'Us blokes don’t help ourselves. We think, \"I’ll ignore that\" and we don’t tell our mates because they’ll take the mickey out of us. I mean, it took me nine years to get help.'But if you have weight control issues, tiredness, depression or low libido, you can rule things out with a simple blood test. It’s about finding things earlier.",
        "'There’s a lot of evidence that testosterone therapy can even help reverse type 2 diabetes. 'It’s known that diabetics will probably die earlier than they would have done. If there is a way to improve your health and mortality, why not take it?'"
    ]
}