{
    "articleURL": "/sport/football/article-12057347/SPORTS-AGENDA-new-Sky-Sports-explain-VAR-decisions-viewers.html",
    "content": [
        "A 30-minute show will air ahead of Howard Webb's appearance on Sky SportsDavid de Gea is expected to agree a new deal on a reduced wage at Man UnitedThe IPL may launch a 10-over competition to boost cricket's Olympics hopes A groundbreaking television programme on which audio from referees and VAR officials is made public is set to air a week today. ",
        "Agenda understands that Howard Webb, the new chief of refs' body PGMOL, is keen to increase transparency and has been instrumental in the creation of a planned 30-minute show which is expected to be screened on Monday, with Webb himself later taking to the airwaves on Monday Night Football ahead of Liverpool's visit to Leicester City. It is hoped the show, which will be shown internationally via Premier League Productions, will help clubs and fans understand how decisions are reached and reduce confusion and animosity. The pilot programme will include audio from on-field officials and interactions with those operating VAR. While the incidents to be used are yet to be selected it is thought that Webb will also go through the chosen flashpoints ahead of Jurgen Klopp's side's visit to the King Power Stadium. ",
        "Warnock takes to Yorkshire's countryside after Huddersfield heroics While champagne may have been the order of the day, Huddersfield's Houdini Neil Warnock was spotted strolling the pretty lanes of Last of the Summer Wine country after he masterminded the club's great escape. Warnock, who previously managed the Terriers in the early 1990s, also popped into his old barber's for a trim — about 25 years after his last visit.Clubs ask how funds from record EFL deal will be distributed ",
        "At the recent meeting of EFL clubs to approve the new broadcast deal with Sky Sports, a number of representatives from sides in Leagues One and Two tried to raise the issue of how all funds are distributed.Those who spoke were told that the meeting was not the right forum. Expect further discussions at this summer's AGM. Sources on the call disclosed that the much-improved £935million five-year package 'sailed through' and hailed the work of EFL commercial chief Ben Wright.Man United remain hopeful over sealing David de Gea's new deal Positive discussions are continuing between Manchester United and long-serving keeper David de Gea over a new deal. The Spaniard broke Alex Stepney's goalkeeping appearance record for the club when he hit 540 in United's Premier League clash with West Ham at the London Stadium. While he has faced criticism from certain quarters — and he certainly made a howler on Sunday — De Gea has eclipsed Peter Schmeichel's clean sheet record and currently tops the Premier League charts for that stat this season. De Gea's contract expires shortly, although the club have the option to extend by 12 months. Should agreement be reached, the 32-year-old is expected to have to take a cut on his current £375,000-a-week deal.",
        "IPL eyeing 10-over format to boost cricket's Olympic hopes",
        "Strong rumours in India that the IPL is looking to form a 10-over IPL2. It will be interesting to see where this fits politically, where it could sit in the schedule and how it would work with the Saudis, who are looking at setting up their own Twenty20 competition that could blow all others out of the water financially. There are officials within India's top brass who feel that the 10-over format could well be something that could be on the radar for future Olympic Games.Disney follow Australia's progress ahead of the Women's World Cup Fresh from seeing star forward Sam Kerr carrying Australia's flag at the Coronation on Saturday, Australian women's football is continuing to make its mark ahead of this summer's World Cup (which they are co-hosting with New Zealand).The new Disney+ show Matildas: The World At Our Feet tracks the progress of the Aussie women's team over the past 12 months and shows the preparations that enabled them to beat the Lionesses last month — ending their 30-game unbeaten run. One key scene in episode 3 involves high-performance director Paddy Steinfort, who has previously helped NFL star Patrick Mahomes in the past. Steinfort explains that Kerr and other key players must be rested before a high-profile friendly with Spain to reduce the risk of injury and exhaustion.",
        "The team went on to lose 7-0, but is the benefit of thinking long term now paying off and will the Matildas, as a result of giving players a much-needed break last summer, have an advantage when the World Cup starts in July?",
        "Big Sam bases himself in Leeds to boost their survival bid Sam Allardyce believes the task ahead of him in saving Leeds from relegation is so huge that he has decided to base himself in the city.Allardyce wants to spend most of his waking hours at the training ground and since starting his new job on Wednesday has been arriving at the Thorp Arch before 8am every morning — and sometimes even earlier.The former England, Everton and Newcastle boss, whose side showed signs of promise in Saturday's 2-1 defeat at Manchester City, gets there before most of the other staff.While he lives in Bolton, which is within an hour and 30 minute's drive from Wetherby, Allardyce is refusing to commute. Instead, he is choosing largely to stay in a hotel on the outskirts of Leeds until the season has finished, while spending the occasional night at home.Meanwhile, after a judge refused Sammy Lee's attempt to be excused from a jury to join his old pal in Yorkshire, an SOS was sent out to Robbie Keane.",
        "He told chief exec Angus Kinnear he wanted Keane at 9.30am. A call was made and former Whites man Keane agreed to come in without discussing terms. At 1pm he was on a flight from Dublin before landing at Leeds-Bradford Airport at 2pm and arriving at training for 2.45pm.",
        "Bournemouth physio to leave to pursue a television career There cannot be many physios who have left football to pursue a career in television but Agenda understands that was the motivation behind Bournemouth medic Stuart Douglas's decision to depart the club. Readers may remember that the former Luton man jetted to the Australian jungle last year where his sister Scarlette, the former A Place in the Sun presenter, was appearing. The pair have already fronted shows together on Channel 4 and the aim is now for Stuart, 45, to free up time to focus solely on roles on-screen with his sister. He will stay with the Cherries, who have already advertised for a replacement, until the season ends.Lord Coe remains in Qatar's gaze at King Charles III's Coronation Qatar's ambition to host the 2036 Olympics remains on track. On Friday, the Athletics Diamond League was held in Doha with many VIPs in attendance. The prize guests for Qatar are IOC members and one of them, Seb Coe, might have been expected to attend. ",
        "However, if Lord Coe thought he could diplomatically escape Qatar's gaze by attending King Charles III's Coronation, he may have been mistaken — as he found himself seated almost within lobbying distance of fellow IOC member, the Emir of Qatar! "
    ]
}