{
    "articleURL": "/news/article-12046099/Kate-McCanns-best-friend-family-mark-16th-anniversary-Madeleines-disappearance.html",
    "content": [
        "Fiona Payne, 50, has been described as Kate's 'rock' over the yearsKate McCann's best friend was at her side last night as Madeleine McCann's family poignantly marked the 16th anniversary of her disappearance.",
        "Fiona Payne, 50, who was one of the seven friends with the McCanns on the night Maddie vanished, has often been described as Kate's 'rock' over the years.Both doctors, the best friends, who were nicknamed 'Charlie's Angels' by a colleague at the hospital where they worked together, bear an uncanny likeness with their long blonde hair and both wearing reading glasses now.During Wednesday evening's gathering to remember Madeleine in Rothley, Leicestershire, Fiona and Kate chatted together alone and with other well-wishers.Fiona read a moving poem 'Hope is the thing with feathers' by Emily Dickinson.",
        "Dressed in a sky-blue shirt, causal beige trousers and trainers with a long dark coat, she took to the front of the 70-strong crowd to recite the touching words.She later shared a warm embrace with Kate.Kate, 54, has previously said of her rock Fiona, a mother-of-two: 'She has remained such a wonderful support. Her support is very important to me.'And it was Fiona, who has moved to neighbouring Rutland from Kate and husband Gerry's home county, who consoled her remotely during lockdown when convicted rapist Christian Brueckner was first made a suspect nearly three years ago.She urged former GP turned medical worker Kate: 'Don't give up hope now' as German police insisted Madeleine was dead.",
        "A local villager at the outdoor service said: 'It was so nice to see Kate and Fiona standing side by side again, talking and hugging.'Fiona has been a tower of strength and comfort to Kate over the years and has always been a shoulder to cry on.'Kate first met Fiona in a staff coffee room at Leicester General Intensive Care Unit in December 2000 when they were both working as anaesthetic registrars.",
        "Kate previously recalled: 'We became such great mates that one of our consultant colleagues rather cheekily used to refer to us as Charlie's Angels.'When three-year-old Madeleine went missing from a holiday apartment in Praia da Luz, Portugal, in May 2007, it was Fiona who helped comfort her devastated friend, and has been there for her ever since.Kate had said: 'We talked and cried and held onto each other. It was like a horror movie that refused to end.'Fiona and her husband David, were among seven friends of Kate and heart doctor Gerry who had been dining together in a nearby tapas restaurant that night.The seven friends - three couples and the mother of one of the mums – had joined the McCanns in Praia da Luz for a joint holiday and the nine adults along with their eight children.",
        "The group of adults were dubbed the Tapas 7 as they were dining with Gerry and Kate at the hotel complex's tapas restaurant on the night Madeleine went missing.Each of them willingly co-operated with the Portuguese and British police investigation and none were ever made 'arguido' - persons of interest - in the enquiries.As well as Fiona and her husband Dr David Payne, there was Fiona's mother Dianne Webster, Rachael Oldfield, a recruitment consultant, and her husband Matthew and Jane Tanner and her husband Dr Russell O'Brien.All of the couples remain living near to the McCanns in Leicestershire besides Mrs Tanner and her husband who have relocated together to Exeter, Devon.It was Mrs Tanner who provided what was believed to have been crucial evidence by saying she saw a man carry a child from the McCann's apartment at 9.15pm - 45 minutes before Kate raised the alarm. She claimed to have seen a child in floral patterned pyjama bottoms being carried in the arms of a white, dark-haired man who did not look like a tourist.",
        "Her testimony - known as the Tanner Sighting - was later disregarded when a British man stepped forward to say it was him carrying his daughter from the night creche - her PJs matched the ones Jane had described to the police.",
        "Fiona, for her part as Kate's closest friend was hugely supportive of her in the days and weeks after Madeleine vanished.When the McCanns were made suspects in the case, Fiona told a reporter: 'These accusations are absolutely outrageous. We are reeling with shock over this. Kate and Gerry are totally innocent.'Fiona has turned up at every anniversary gathering to support Kate and pray with her - the public event was not held during two Covid-restricted years of 2020 and 2021.On the milestone 10th anniversary service held at St Mary and St John Church in Rothley she took centre stage, remaining composed as she recited a poem with the words: 'Each branch that it grows be our hope and prayers, and every bloom bear a colour for the ones that we miss.'When Kate and Gerry missed one gathering due to family commitment in Liverpool, it was Fiona who stepped into to address well-wishers and supporters.Kate and Gerry - their family and close circle of friends - hold onto a glimmer of hope that Madeleine could still be alive.She would now be aged 19, nearly 20."
    ]
}