{
    "articleURL": "/wires/reuters/article-12057785/Stephen-Ames-wins-Mitsubishi-Electric-second-title-2023.html",
    "content": [
        "Stephen Ames of Canada wrapped up a stellar weekend of golf with a bogey-free, 4-under-par 68 to win the Mitsubishi Electric Classic by four shots on Sunday in Duluth, Ga.",
        "Ames held at least a share of the lead after each round in order to secure his second win of the season and his fourth career title on the PGA Tour Champions. He had previously won the Trophy Hassan II in Morocco in February.Ames carded a 19-under 197 at TPC Sugarloaf, where he also won this event in 2017, to finish well ahead of Spaniard Miguel Angel Jimenez (68 Sunday).Making the victory sweeter, Ames' son Ryan served as his caddie for the week.\"(It was) different for me, going through each shot and what my thoughts were and stuff like that, and the things that we needed to work on and stuff like that,\" Ames said. \"I think this week overall, I think the fact that I ended up winning as well, it kind of adds icing on the cake.\"Ames got off to a careful start, with a birdie on the par-5 third hole joining eight pars on his front nine. He got another birdie to drop at the par-5 10th before adding the final two at the par-4 14th and 17th holes. Ames made a long par putt at the last hole to remain bogey-free.The golfer best known for winning The Players Championship in 2006 chalked up his success to remaining \"quiet\" and calm when he addresses the ball.",
        "\"I think overall it's just realizing how important the mindset is and how important the focus part of it is when I'm playing golf,\" Ames said. \"I tend to be very technical in my golf swing and after -- in the last year and a half I've let that go quite a bit and funny enough, in letting that go, my swing has actually gotten better because I've gotten quieter mentally.\"Ames is projected to remain in fourth in the Schwab Cup money standings following the win.Jimenez had three birdies and two bogeys on the front nine and never seriously threatened the lead. He picked up three birdies on the back nine to ensure sole possession of second.Ken Tanigawa began the day in second place and shot a quiet 71 to finish in third at 13 under. Brett Quigley (69) was fourth at 12 under, and Lee Janzen and Steve Stricker shot rounds of 68 to tie for fifth at 11 under.--Field Level Media"
    ]
}