{
    "articleURL": "/wires/pa/article-12054005/Kate-ivory-Alexander-McQueen-gown-regal-robe-coronation.html",
    "content": [
        "The Princess of Wales stepped out in regal robes at the coronation, wearing a deep blue Royal Victorian Order mantle edged in scarlet over an Alexander McQueen embroidered ivory silk crepe dress.",
        "Her silver bullion, crystal and silver thread work three-dimensional leaf embroidery headpiece was by Jess Collett x Alexander McQueen.Princess Charlotte was dressed in a mini-me version, with her similar silver bullion, crystal and silver thread headpiece by the same milliner.Eight-year-old Charlotte also wore an Alexander McQueen dress – with a cape – in ivory silk crepe.",
        "Kate’s dress featured silver bullion and thread work embroidery featuring rose, thistle, daffodil and shamrock motifs – with the emblems signifying the four nations also appearing on Charlotte’s dress in ivory satin stitch embroidery.Meanwhile, Prince Louis, five, was smartly decked out in a Hainsworth Garter Blue Doeskin Tunic with specially designed lace work embellishment to the collar, cuffs and fronts, made by bespoke Savile Row tailors Dege and Skinner.The youngster’s leg garment was black, complete with Garter Blue stripe.Kate, who chose a Sarah Burton for Alexander McQueen gown for her wedding in 2011, and the Prince of Wales both wore formal robes and mantels, with the princess without a tiara, at the request of the King and Queen.",
        "The princess’ earrings were a touching tribute to William’s late mother, with the pearl and diamond pieces belonging to Diana, Princess of Wales.She also wore Queen Elizabeth II’s George VI Festoon Necklace, which George VI commissioned for his daughter Princess Elizabeth in 1950.",
        "The glittering three strand necklace – a favourite of the late monarch’s – was made using 105 loose collet-set diamonds.The princess was made a Dame Grand Cross of the Royal Victorian Order (GCVO) by the late Queen in 2019, so is entitled to wear the Grand Cross Mantles of the Royal Victorian Order.Made from dark blue silk satin, the grand floor-length cloak is edged with scarlet and lined with white silk taffeta, with a hand embroidered badge and hood attached to right shoulder.William wore his navy blue Order of the Garter mantle over his red Welsh Guards’ ceremonial dress uniform as Colonel of the regiment.",
        "The cloak – which the prince wears to the Order of the Garter ceremony in June at Windsor each year – is made from deep blue silk velvet with white satin ribbons and a lining of white taffeta.The mantles are hand-embroidered with a gold badge on the left-hand side, with a crimson silk velvet hood over the right shoulder.His dress uniform, single-breasted in style with a stand-up collar, is made from Hainsworth Scarlet Wool Doeskin.The collar, cuffs and back skirts feature gold wire hand embroidery, with a silver leek – the emblem of the Welsh Guards – on the collar.",
        "The Gilt buttons depict the Regimental insignia of the Welsh Guards.William wore his Pilots Wings badge, and his Queen’s Golden, Diamond and Platinum Jubilee medals.His leg garments – known as overalls in the Army – are made from a blue-black wool barathea with two inch scarlet stripes.The prince also wore his Order of the Thistle sash and badge, Garter Star and Thistle Star, Order of the Garter Collar and Great George of the Order of the Garter."
    ]
}