{
    "articleURL": "/wires/ap/article-12055717/Edmonton-ties-series-Knights-5-1-victory-Vegas.html",
    "content": [
        "LAS VEGAS (AP) - Asked whether an extra day off on the road could hurt his Edmonton Oilers, after a schedule change moved Game 2 of the Western Conference semifinal series from Friday to Saturday, coach Jay Woodcroft chuckled and answered with confidence.",
        "\"Whether we´re home, away, or in Hudson Bay, it doesn´t matter to us where we play - we are one of the top road teams in the National Hockey League,\" Woodcroft said before the game.Then the Oilers proved it.Leon Draisaitl and Connor McDavid each scored twice and Edmonton tied their series at one game apiece with a 5-1 victory over the Vegas Golden Knights.\"I liked our start. I thought we did some things that we wanted to do, we asserted ourselves right off the bat and played the game at the pace that we wanted to play,\" Woodcroft said after the game. \"Part of that was how we managed pucks, and part of it was the way the game played itself out.\"It was a vast difference from Game 1 on Wednesday, when Vegas dictated the pace and showed resiliency in matching the Oilers goal for goal before pulling away for a 6-4 victory.",
        "Game 3 will be Monday in Edmonton, where the Oilers were 23-12-6 during the regular season.\"We played a lot faster, I thought we were more connected, I thought we were a little bit more aggressive, you know, all the things that we´ve been building towards,\" said McDavid, who is on a seven-game point streak, with five goals and 10 assists.",
        "Drasaitl, who scored four goals in the first game, has now tallied at least one point in the first eight games of the postseason, posting 17 points (13 goals, 4 assists).Evan Bouchard also scored for the Oilers, while rookie goaltender Stuart Skinner stopped 30 shots.\"Our emphasis on that (defensive) side of things showed up, and when called upon tonight, Stuart answered admirably,\" Woodcroft added. \"He was excellent when called upon.\"Ivan Barbashev ruined Skinner´s bid for a shutout less than two minutes into the third period by scoring his third goal of the series, the lone goal for the Golden Knights.Vegas goaltender Laurent Brossoit stopped 27 of the 32 shots he faced before being pulled after two periods. Brossoit came into the game 5-0 in his previous five appearances dating to Game 2 of the opening round. Adin Hill finished the game and made four saves in the third period.Edmonton got an early power-play opportunity, and after Brossoit made three incredible saves, Draisaitl scored his 12th goal of the postseason to put Edmonton up early, 1-0.The Oilers made it 2-0 just seven minutes into the game with their second power-play opportunity thanks to Bouchard´s blast from the blue line.The point production on special teams continued midway through the opening stanza when McDavid poked the puck away from Vegas´ Shea Theodore and turned on the afterburners for a breakaway shorthanded goal to push Edmonton´s lead to 3-0.",
        "And when Draisaitl scored his second of the game to put Edmonton on top 4-0, the Oilers had more goals at the time than the Golden Knights had shots on goal (3).Vegas finished the first period with four shots on goal, while Edmonton had thrown 19 at Brossoit.With Jack Eichel in the box for Vegas, it took only eight seconds into the power play for the Oilers to build on their lead, as McDavid beat Brossoit to make it 5-0.\"They were a lot better than us, they were ready to play,\" Vegas coach Bruce Cassidy said. \"We weren´t, for whatever reason, falls on the coach to prepare your team to play, so didn´t do a good enough job there. They were just much better than us.\"MORE LEONDraisaitl became the second player in NHL history to score 12 or more through his first eight games in a single postseason, following Newsy Lalonde (15) with the Canadiens in 1919. Draisaitl also became the second player in Stanley Cup Playoffs history to score eight or more goals through his first five road games in a postseason, joining Frederick Taylor (9) with the Vancouver Millionaires in 1918.EDMONTON POWERAfter going 3 for 6 on Saturday, the Oilers´ power play is now 14 for 25 in the postseason, ranking first amongst all playoff teams with a percentage of 56%.",
        "ROAD WARRIORSRoad teams improved to 35-23 overall this postseason. The 2023 Stanley Cup Playoffs have now matched the entire total from 2022 when visitors finished 35-54. ___AP NHL Playoffs: https://apnews.com/hub/stanley-cup and https://twitter.com/AP_Sports"
    ]
}