{
    "articleURL": "/wires/reuters/article-12040149/Willie-Calhoun-helps-Yankees-Guardians-end-four-game-skid.html",
    "content": [
        "Willie Calhoun's first home run as a member of the New York Yankees snapped a seventh-inning tie Tuesday night and lifted the slumping Yankees to a 4-2 win over the visiting Cleveland Guardians.",
        "Rookie Anthony Volpe homered with one out in the sixth to begin the comeback from a 2-0 deficit, as the Yankees snapped a four-game losing streak and won for just the third time in 10 games. New York entered Tuesday in sole possession of last place in the American League East.Anthony Rizzo had an RBI single later in the sixth before Calhoun, playing his 14th game with the Yankees after signing with the team in January, homered with one out in the seventh off James Karinchak (0-4).Volpe helped build an insurance run in the eighth when he singled, stole second and third and scored on DJ LeMahieu's two-out single.Rizzo also had two hits for the Yankees.Josh Naylor (double) and Andres Gimenez (groundout) each had RBIs in the third for the Guardians, who have lost seven of 11. Jose Ramirez finished with two hits.Wandy Peralta (2-0), the third of four Yankees pitchers, allowed one hit while recording two outs spanning the seventh and eighth before Michael King struck out three over 1 2/3 hitless innings to earn his second save.Gerrit Cole, who entered Tuesday tied for first in the AL with five wins and second with a 1.11 ERA, allowed the two runs on five hits and three walks while striking out eight over six innings. Cole had just one 1-2-3 inning but the Guardians stranded seven runners against him.",
        "Rookie Tanner Bibee, making his second big-league start, allowed two runs on four hits and no walks while striking out five over 5 1/3 innings. The Yankees got just one runner beyond first base against Bibee before Volpe homered. Gleyber Torres chased Bibee with a double, after which Rizzo singled against Karinchak.--Field Level Media"
    ]
}