{
    "articleURL": "/wires/reuters/article-12047755/Scholz-backs-African-Union-bid-G20-seat-second-trip-continent.html",
    "content": [
        "By Sarah Marsh and Andreas Rinke",
        "BERLIN, May 4 (Reuters) - Germany supports the African Union's bid to get a seat at the G20 group of large economies, Chancellor Olaf Scholz said on Thursday during his second trip to Africa, as the West seeks to woo the continent away from growing rivals like China.Scholz was speaking after meeting African Union Commission Chairperson Moussa Faki Mahamat in Addis Ababa on the first leg of a three day trip to Ethiopia and Kenya.\"Africa must play a bigger role in international relations, a role that does justice to the continent and its growing population,\" he said at a joint news conference, noting he was \"convinced\" the African Union would get a seat at the G20 soon.South African President Cyril Ramaphosa was the first representative of a G20 member state to call for the inclusion of the 55-country bloc, last year. South Africa is currently the only member of the G20, which consists of 19 countries and the European Union, from the African continent.Ramaphosa's proposal swiftly received support from U.S. President Joe Biden and French President Emmanuel Macron as the West vies to position itself as a partner to African countries amid growing competition with authoritarian countries like Russia and China.The latter has sought to expand its influence there by funding infrastructure projects.",
        "A G20 seat would give one of the fastest-growing regions of the world a bigger voice on key issues such as climate change.\"We also want to contribute to peace and security,\" Scholz said, noting the two leaders had discussed the crisis in Sudan.Scholz has already made two trips to Sub-Saharan Africa since taking office in late 2021 - whereas his predecessor Angela Merkel made only one throughout her entire first term.This, he said, reflected his view that the West needed to improve its ties with the Global South as the world becomes more multipolar.However, the West has found itself struggling to get some countries there on board with its stance on Russia in the wake of its attack on Ukraine, in particular sanctions. This in turn has undermined attempts to hit the Russian economy.\"African states are divided,\" said Faki. \"A certain number of U.N. resolutions have been approved by some others have abstained for their own reasons, whether historic or current.\"The AU leader said the bloc hoped for a political solution for Ukraine.(Reporting by Sarah Marsh and Andreas Rinke, Editing by Alexandra Hudson)"
    ]
}