{
    "articleURL": "/wires/ap/article-12048027/Evenepoel-Roglic-favorites-upcoming-Giro-dItalia.html",
    "content": [
        "MILAN (AP) - This year´s Giro d´Italia is being billed as a two-horse race between the experienced Primoz Roglic and the younger Remco Evenepoel.",
        "But the Italian Grand Tour, which starts on Saturday, is often wet, wild and unpredictable - especially with a brutal final week.Both Roglic and Evenepoel know that anything can happen over a three-week race and that even unheralded outsiders could lift the \"Trofeo Senza Fine\" in Rome at the end of the month.Evenepoel became world champion last year and the Belgian also claimed his first Grand Tour success when he won the Spanish Vuelta, ending a run of three straight victories for Roglic.The 23-year-old Evenepoel comes into the Giro having won the prestigious Liège-Bastogne-Liège last month for the second year in a row.\"I think I can be here only with a positive feeling,\" Evenepoel said Thursday. \"I just won Liège for a second time, so that´s a good way to start the Giro. The season has been very good so far. I won the UAE tour, we came second in Catalunya with a small margin and a nice race.",
        "\"So I think here I can be with a lot of confidence and a lot of trust and belief at the start ... I´m here with a lot of positive vibes and good feelings for the start of the Giro.\"Evenepoel finished second to Roglic by just six seconds in the Catalonia Volta and the week-long race boosted the Soudal Quick-Step rider´s confidence in his ability to compete with the Slovenian.",
        "\"Last year I had still some doubts that I could have the same level as him in the mountains,\" Evenepoel said. \"But I think these doubts, I could wash them away after Catalunya. We were on the very same level when we speak about climbing.\"So I hope that I can be on the same level as him in the climbs and just be on a better level in the time trials. That´s the good recipe to try and beat him. But of course, he´s Olympic champion in time trial as well, so it´s not going to be easy.\"Evenepoel crashed out of the 2021 Giro, the only time he has competed in the Italian Grand Tour. That was his first race back after a serious accident the previous year that left him with a broken pelvis after a crash sent him flying off the side of a bridge.That also happened in Italy, in the Tour of Lombardy.\"It's true that the results haven't been the greatest in Italy, so it's time to change that,\" Evenepoel said.Roglic was third in the 2019 Giro but has failed to finish three of his past four Grand Tours. The Jumbo-Visma rider had to withdraw from both the Spanish Vuelta and Tour de France last year following crashes during the races.",
        "\"I´m now for quite a while at the best level, or competing with top guys and when you are all the time there a lot of nice things happen, but there´s also a lot of not so nice things ... it´s a part of it,\" Roglic said.\"But now we are here and looking forward to this next adventure.\"At 33, Roglic is a decade older than Evenepoel and he hopes that plays out in his favor.\"I´m like a wine, the older the better,\" he said with a laugh. \"For sure you grow up, while getting older you are definitely wiser, you have more experiences.\"For sure he (Evenepoel) is one of the strongest ones. I mean, he just recently won Liège, he´s in super great shape. The rest of us will try to make his life a bit harder going towards Rome.\"Two-time Tour de France champion Tadej Pogacar hadn't planned to make his Giro debut this year and remains sidelined after wrist surgery.INEOS ARMADAIneos Grenadiers heads into the Giro looking for a third success in four years.And the team isn´t leaving anything to chance as it seeks to end a two-year wait for success in a Grand Tour, since Egan Bernal won the Giro in 2021.",
        "Ineos will be spearheaded by joint leaders Tao Geoghegan Hart and Geraint Thomas, whose Giro fortunes have been very different.Thomas had to abandon the Italian Grand Tour twice. In 2017, he was involved in a crash caused by a police motorbike, and three years later he fractured his hip after a drinks bottle became lodged under his wheel.Geoghegan Hart is the only previous Giro winner (2020) in this year´s race.\"It doesn´t matter what happened before Saturday,\" Geoghegan Hart said. \"The deeper you go into the race, nothing matters what you´ve done before. Even how you rode on stage one, two, three, four doesn´t mean anything when you´re in stage 18, 19, 20.\"So we´re looking forward to the race and getting stuck into it and doing our best together. We´ve done a lot of races together and we can communicate well.\"THE FINAL WEEKThe race will likely be decided in the Dolomites Range in what promises to be an action-packed, demanding week before the final day's ride through the streets of Rome on May 28.Three of the last six stages have been given the maximum difficulty rating of five stars, including the penultimate day´s time trial. The week kicks off with the Sabbio Chiese to Monte Bondone stage, with over 5,000 meters of elevation.",
        "Stage 19 has no flat sections and has five classified climbs including the Passo Giau, the Passo Tre Croci and the finish up the Tre Cime di Lavaredo, with gradients of up to 18%.\"The last week is so hard and so brutal that you can even take the (leader´s) jersey on stage 20 and become the winner of of the Giro this year,\" Evenepoel said. \"So it´s all about the last days.\"___More AP sports: https://apnews.com/apf-sports and https://twitter.com/AP_Sports"
    ]
}