{
    "articleURL": "/wires/afp/article-12051209/Nigerian-politician-jailed-landmark-UK-organ-trial.html",
    "content": [
        "A UK court on Friday jailed Nigeria's former deputy Senate president for nine years and eight months, following his landmark conviction for plotting to harvest a man's kidney for his sick daughter.",
        "In the first UK case of its kind, judge Jeremy Johnson handed Ike Ekweremadu, 60, the prison sentence for his part in a \"despicable trade\" that took advantage of the \"poverty, misery and desperation\" of vulnerable people.\"People-trafficking across international borders for the harvesting of human organs is a form of slavery,\" the judge at London's Old Bailey criminal court said as he handed down the jail term.\"It treats human beings and their body parts as commodities to be bought and sold,\" he added, noting the sentence represented a \"substantial fall from grace\" for Ekweremadu.The multi-millionaire Nigerian politician was found guilty in March of conspiring to traffic the young street trader into Britain for his body part.Also convicted were Ekweremadu's wife Beatrice, 56, and Obinna Obeta, 51, a doctor who acted as a middleman in the plot.Beatrice Ekweremadu was jailed for four years and six months and Obeta for 10 years.The Ekweremadus' daughter Sonia, 25, had shed tears back in March as she was cleared of the same charge after jurors deliberated for nearly 14 hours.On Friday, she waved to her parents from the public gallery as they were led out to start their sentence. Neither of them showed any emotion as they were sentenced.",
        "- 'Bravery' -In Britain, it is legal to donate a kidney, but not for financial or material reward.It was the first time organ harvesting conspiracy charges had been brought under the UK's 2015 Modern Slavery Act.Andy Furphy, the Metropolitan Police's Modern Slavery and Exploitation lead, said the Ekweremadus had \"exerted their political influence and power and control over a young man who was vulnerable by his economic circumstances\".He urged the public to be more \"curious\" when coming into contact with people they suspected might be victims of exploitation.During the weeks-long trial, the 21-year-old victim from Lagos, who cannot be named for legal reasons, testified that the Ekweremadus had flown him to Britain to harvest his kidney.The kidney was said to be intended for Sonia, who remains on dialysis with a renal condition, in return for up to £7,000 ($8,800).",
        "The man said he had been recruited by a doctor working for the politician and had thought he was coming to the UK to work.He only realised it was for a kidney transplant when he was taken to London's Royal Free Hospital last year, the court was told.He fled and slept on the streets for three days after doctors there told him he would not be a suitable donor following preliminary tests.",
        "He eventually walked into a police station last May and said he was \"looking for someone to save my life\".The court heard he was now living a \"solitary\" life in the UK far from family and friends and afraid to return to Nigeria due to the risk of \"retribution\" from people sympathetic to the Ekweremadus.- 'Vital' -Ekweremadu has represented the Enugu West constituency in southeast Nigeria for the opposition Peoples Democratic Party since 2003.Leaders in Nigeria's parliament this week appealed to the London court for clemency, arguing Ekweremadu was a first-time offender who had made valuable contributions to politics in West Africa.He did not contest recent National Assembly elections as he was in custody before and during the trial.Around 20 people a day in Britain are diagnosed with kidney failure, necessitating prolonged dialysis treatment, and around 7,000 are waiting for a transplant from a suitable donor.Informed consent is \"a vital part of the organ donation programme\" and thorough checks are made to ensure there is \"no coercion\", Fiona Loud, policy director at the charity Kidney Care UK, told AFP.Voluntary donors engage in \"an act of great generosity\", she said."
    ]
}