{
    "articleURL": "/tvshowbiz/article-12038125/Jodie-Comer-theatre-feet-picking-Tony-nomination-latest-play.html",
    "content": [
        "Jodie Comer was nominated for her first Tony award for her role in her latest show  on Tuesday.",
        "The actress is up for a gong in the category Best Leading Actress Of A Play for the one-woman theatre spectacle Prima Facie, which debuted at the Harold Pinter Theatre in London. Jodie stars as a barrister called Tessa in the play, which transferred to New York in April after critical acclaim and saw her make her Broadway debut.In the show, Tessa defends men charged with rape and then finds herself in the witness box after being assaulted.Jodie is up against Jessica Chastain in A Doll's House, Jessica Hecht in Summer, 1976 and Audra McDonald in Ohio State Murders in her category. ",
        "The actress previously won Best Actress at the Olivier Awards for her role in the West End show which is now running at the John Golden Theatre in New York until July.Elsewhere, best new musical nominees were Juliet, Kimberly Akimbo, New York, New York, Shucked and Some Like it Hot.Sweeney Todd and Into the Woods were among the productions earning nods for best musical revival.Best new play nominees were Ain't No Mo', Between Riverside and Crazy, Cost of Living, Fat Ham and Leopoldstadt.August Wilson's The Piano Lesson and Suzan-Lori Parks' Topdog/Underdog earned nominations for best revival of a play, among other productions.Several Hollywood stars were nominated including A Doll’s House‘s Jessica Chastain, Prima Facie’s Jodie Comer, The Piano Lesson’s Samuel L. Jackson, and Topdog/Underdog‘s Corey Hawkins and Yahya Abdul-Mateen II.",
        "But Laura Linney for Summer 1976, and Oscar Isaac and Rachel Brosnahan for The Sign in Sidney Brustein’s Window were snubbed.This will be the 76th annual awards and the show is put on by the Tony Awards committee in New York City.The nominations were announced by Funny Girl star Lea Michele and Myles Frost, who won last year for his performance in MJ: The Musical. ",
        "Actress Ariana DeBose will again host the ceremony, scheduled for June 11 at New York City's United Palace theater.'I was honoured to serve as host last year and even more so to be asked back,' DeBose previously said in a statement. 'So looking forward to celebrating this incredible season and the people who make the work happen. Here's to adding some uptown flavour to the magic of the Tony Awards.'The show will air live on CBS and on demand on Paramount+.On Tuesday morning, Lea, 36, appeared bright eyed and bushy tailed as she arrived at CBS Studios to announce the Tony Award nominations in New York.The Funny Girl star looked lovely in a grey ensemble, which included a strapless peplum top styled with matching trousers and an oversized blazer.Lea wore her glossy cropped locks in a loose, straight style and and opted for a glamorous coat of make-up to complete the look. ",
        "The Glee star boosted her frame with a pair of strappy silver heels, while otherwise keeping her accessories to a minimum.Lea was joined by her co-host Myles, who picked up the Best Actor In A Musical award at last year's Tony's for his portrayal of Michael Jackson in MJ the Musical.Myles went shirtless underneath a black waistcoat and floral jacket, which he teamed with velvet trousers and glittery shoes.",
        "Just hours earlier, Lea put on a leggy display as she headed to the Standard Hotel afterparty following the Met Gala on Monday night.The actress donned a stunning glittery black mini dress for the event, showcasing her slender figure.She changed into the gorgeous ensemble, which also featured a giant bow at the back, after donning a shiny sequinned frock for the Met Gala.The beauty complemented her show stopping afterparty ensemble with a pair of black bejewelled heels.",
        "Best Musical&amp;JulietKimberly AkimboNew York, New YorkShuckedSome Like It Hot",
        "Best PlayAin't No Mo'Between Riverside and CrazyCost of LivingFat HamLeopoldstadtBest Musical RevivalBob Fosse's Dancin'CamelotInto the WoodsParadeSweeney Todd: The Demon Barber of Fleet StreetBest Play RevivalA Doll's HouseThe Piano LessonThe Sign in Sidney Brustein's WindowTopdog/UnderdogBest Leading Actress of a MusicalAnnaleigh Ashford, Sweeney Todd: The Demon Barber of Fleet StreetSara Bareilles, Into the WoodsVictoria Clark, Kimberly AkimboLorna Courtney, &amp; JulietMicaela Diamond, Parade",
        "Best Leading Actress of a PlayJessica Chastain, A Doll's HouseSponsor MessageJodie Comer, Prima FacieJessica Hecht, Summer, 1976Audra McDonald, Ohio State MurdersBest Leading Actor of a MusicalChristian Borle, Some Like It HotJ. Harrison Ghee, Some Like It HotJosh Groban, Sweeney Todd: The Demon Barber of Fleet StreetBrian D'Arcy James, Into The Woods",
        "Ben Platt, ParadeColton Ryan, New York, New YorkBest Leading Actor of a PlayYahya Abdul-Mateen II, Topdog/UnderdogCorey Hawkins, Topdog/UnderdogSean Hayes, Good Night, OscarStephen McKinley Henderson, Between Riverside and CrazyWendell Pierce, Death of a Salesman"
    ]
}