{
    "articleURL": "/wires/aap/article-12055637/Millions-households-track-energy-bill-relief.html",
    "content": [
        "More than 5.5 million households and around one million small businesses are in line for energy bill relief in the federal budget.",
        "The Labor government committed to power bill relief as part of its intervention in the energy market last year.\"People will be getting several hundred dollars if they're on pensions and payments or a small business,\" Treasurer Jim Chalmers told ABC News on Sunday.\"But as I said, (the rebate amount is) depending on where you live, depending on what the price pressures are, depending on how much the states and territories are prepared to kick in, because this is a co-investment with them.\"The government has struck separate deals with each of the states and territories as part of the cost-of-living support package targeted at soaring energy prices.In the lead-up to the May budget, due on Tuesday, the federal government has been cognisant that it is in the challenging position of needing to provide some targeted cost-of-living relief at a time when inflation is high.Shadow treasurer Angus Taylor said inflation was \"a big tax on everyone\" and if the Labor government's budget as a whole fails to take pressure off, Australians will pay the price.\"The critical point here is inflation is impacted by the overall budget, not just any individual initiative,\" he told ABC's Insiders program on Sunday.Responding to questions about the increase to the tobacco excise and changes to the petroleum resources rent tax (PRRT) on gas producers, Mr Taylor said hitting it with tax would not help.",
        "\"When you're trying to fight inflation, when you want to get the price of something down, hitting it with a tax is not the obvious answer,\" he said.But Mr Taylor did not rule out supporting the PRRT changes, which will need to be legislated, and said the \"devil would be in the detail\".\"The real test for everything that the government is doing now is 'is it putting downward pressure on inflation?' If you want to get prices down, typically you don't tax it more,\" he said.The federal coalition also agrees Australia might be on track to land its first budget surplus in years.Some are predicting a small, albeit temporary, budget surplus for this financial year followed by smaller deficits over the following years.Dr Chalmers said the budget position would be made clear on Tuesday night.\"What's already clear, is that you wouldn't even be asking me this question if we hadn't taken a really responsible approach to these upward revisions to revenue in the budget - banking almost all of it so that we can get the budget in a much stronger position,\" he said.Dr Chalmers added it was a misconception that commodities were solely responsible for the improvement in the budget bottom line.Higher commodity prices are responsible for about a fifth of the improvement and the strong labour market has contributed around 40 per cent via lower unemployment and higher wages growth.",
        "\"Commodity prices are important, but not the biggest part of the contribution,\" Dr Chalmers said.Financial market economists have tipped the budget to be back in the black in 2022/23 to the tune of up to $2 billion, compared to the previous Treasury forecast in October of a deficit of $36.9b.The market is also watching to see if Dr Chalmers reveals smaller deficits for the forward estimates period, including a possible $25b deficit in 2023/24 compared to a previously forecast $44b."
    ]
}