{
    "articleURL": "/tvshowbiz/article-12054491/Anna-Nicole-Smiths-ex-Larry-Birkhead-brings-daughter-Dannielynn-16-Kentucky-Derby-gala.html",
    "content": [
        "Anna Nicole Smith's ex Larry Birkhead brought their daughter Dannielynn, 15, to the Barnstable Brown Gala in Louisville on Friday, the eve of the Kentucky Derby.",
        "The event has a special significance for the father–daughter pair, as Anna Nicole first met Larry at the 2003 Barnstable Brown Gala.Dannielynn and her father have been a fixture at the annual beano for years, and this year they gave a special tip of the hat to the teen's late mother.As seen on Larry's Instagram, Dannielynn arrived in a Guess top splashed with Anna Nicole's own modeling shots for the brand.It was back in 1992 that Anna Nicole became the face of the fashion brand, which rocketed the rising young model to international fame.",
        "Dannielynn was a dead ringer for Anna Nicole as she posed smiling on her father's arm for a brace of snaps he posted to his Instagram page.'Heading to the annual Barnstable-Brown Derby Eve Gala. Tonight is the 20th anniversary where I met Dannielynn’s Mom at the same event,' he noted.While offering a string of fashion credits at the bottom of the caption, he touchingly revealed that Dannielynn was wearing the jewelry she inherited from Anna Nicole.'More Barnstable-Gala pre-party pics,' he wrote with another Instagram caption. 'Can’t believe Dannielynn is almost 17. Time for a great Derby weekend.'Ahead of this year's Derby, Larry gave DailyMail.com an exclusive interview lifting the curtain back on his two-and-a-half years with Anna Nicole. ",
        "'I met Anna first in 2003 and she blew me kisses. I was intrigued by her but we didn't have too much interaction,' he candidly revealed. 'She came back the next year and she had totally transformed. I always thought she was so beautiful. She has a unique look. But when she returned to the Derby in 2004 she was in her tip top shape.'The dashing blond recalled: 'She was blowing me kisses, but I thought she was doing that for everyone. Being flirtatious for the camera. I never thought that she would want some guy like me from Kentucky when she could have any guys who wants.' Larry, a photographer, was later summoned by Anna Nicole's team to snap her at a children's charity event 'and the sparks were there again.'They remained in contact for a few weeks, until 'I got a call from Anna and she said that she wanted me to move in with her in LA and be her personal photographer.'Larry fondly remembered: 'Of course I said yes. When I first went there, I looked around her house and I asked her: \"Where am I going to stay?\" She laughed and responded: \"In here with me,\" pointing to her bedroom.' They carried on a live-in romance that lasted until months into Anna Nicole's pregnancy with Dannielynn, when she suddenly decamped to the Bahamas.",
        "Her rupture with Larry came amid her legal battle over the $30 million that she insisted she was promised by her billionaire late husband J. Howard Marshall, whom she infamously married just 14 months before his death when he was 89 and she 26. ",
        "'They took her to the Bahamas because she was in a lawsuit for all that money, and they thought that I was going to try and take it from her, so they saw me as a threat and Anna believed it,' Larry claimed. Three days after Dannielynn was born her half-brother Daniel died of a drug overdose, and five months later so did Anna Nicole.Anna Nicole, who listed her boyfriend Howard K. Stern as Dannielynn's father on the birth certificate, left her entire estate to her daughter upon her death.A string of men including Zsa Zsa Gabor's ninth husband claimed to be Dannielynn's real father until a DNA test confirmed that it was Larry."
    ]
}