{
    "articleURL": "/tvshowbiz/article-12060605/Eurovision-viewers-SHOCKED-Shirley-Ballas-speaks-stage-totally-different-accent.html",
    "content": [
        "Viewers of Eurovision's Big Welcome concert were left shocked by Shirley Ballas' 'ridiculously Northern' accent on Monday.",
        "The Strictly star, 62, surprised many when it was revealed she was born in nearby Merseyside before taking to the stage at the pre-recorded event in Liverpool.Shirley read a poem to the packed out audience, with fans at home shocked by her very different speaking voice. Taking to Twitter one viewer remarked: 'Shirley Ballas usually sounds a bit posher when she isn't reading poems about Liverpool'.While another added: 'I totally get being proud of where you come from. I’m straight out of SE15 … Peckham to be exact (don’t diss Rye Lane). BUT why did Shirley Ballas put on such a ridiculously strong Liverpool accent to read a poem; an accent we never hear on Strictly?'.",
        "Nevertheless viewers loved seeing Shirley back on screens with one fan commenting: 'Shirley Ballas is camp. I’m not even sorry Glasgow isn’t hosting - Liverpool have absolutely understood the assignment'.And gushing about her poem another said: 'Wow! powerful, beautiful words'.Shirley was born in 1960 Wallasey, five miles from Liverpool, at 15 she moved to North Yorkshire to follow her dancing dream before going on to travel the world. The stars were out in force on Sunday evening to attend the National Lottery's Big Eurovision Welcome event outside St George's Hall in Liverpool.Taking to the stage at the event were a slew of performers - some affiliated with past competitions and others adding to the roster - including Alexandra Burke, Zara Larsson and the return of Conchita. ",
        "Pregnant Alexandra took to the stage in a flowing white dress which masked her bump. Zara meanwhile was sizzling in a tiny flesh flashing ensemble alongside Conchita, real name Thomas Neuwirth, who opted for trademark glamour. Among the artists who performed for the crowd of 30,000 on Sunday were Alexandra, Zara, Conchita alongside Atomic Kitten and Frankie Goes to Hollywood, who will reunite after their split in 1987. Other acts with a Liverpool connection on the line-up included funk band The Real Thing, and The Lightning Seeds - singers of the football anthem Three Lions.",
        "Zara was turning up the heat in the scanty ensemble comprising a glittery top and tiny skort - skirt and shorts hybrid - as she joined a team of dancers. She wore sparkly boots which complemented her cowl neck top. Her blonde locks were styled into loose curls and she was sporting over the top stage make-up comprising shimmering eyes and a glossy lip. Zara shot to fame when she won the 2008 season of Talang, the Swedish adaptation of the Got Talent franchise, at the age of 10, winning 500,000 kronor.",
        "Former X factor winner Alexandra's garment whipped around as she moved about the stage. The star boosted her height by wearing a pair of open-toed heels and accessorised with gold hoop earrings to match the straps of her footwear.",
        "Conchita made her big return to the Eurovision stage after winning in 2014. The dramatic performer - the work of Thomas - became an icon following her win on the show. Thomas has previously stated that he is not a trans woman. He is gay, and has also described himself as a drag queen. He uses pronouns to describe his Conchita Wurst character, but he/him pronouns when referring to himself."
    ]
}