{
    "articleURL": "/sport/cricket/article-12058677/Aussie-Test-cricket-captain-Pat-Cummins-opens-Rio-Ferdinand-grieving-mum-Maria.html",
    "content": [
        "Lost his mother to breast cancer in March Has taken time away from the sport Reveals how grief has changed himPat Cummins has told football icon Rio Ferdinand that he is a changed man since the passing of his mother.",
        "He has kept a low profile since Maria Cummins lost her battle with breast cancer in March, a difficult thing to do when you are captain of the Australian cricket team.Cummins was forced to leave his team midway through the Test series against India to be by his stricken mother's side in her final hours and withdrew from his $1.3million Indian Premier League contract with the Kolkata Knight Riders.",
        "However, there is an Ashes series on the horizon and Cummins has a duty to his country as well as himself.So the Aussie Test skipper has re-emerged from his private mourning, hoping he can use the pain that haunts him daily to help others.It is not just the death of his mother that has changed Cummins, it is also the arrival of his first child Albie who is now 18 months old and the responsibilities of being a parent.Cummins always wanted to make a difference with his life by addressing climate change and helping cricket clubs convert their operations to solar.Now he feels he is duty bound to make that difference for the inevitable day his son asks him what he has done with his life.So Cummins has picked himself up and signed up as an ambassador for new social media platform WeAre8, a platform that aims to create real environmental differences around the world.",
        "As part of his duties Cummins was asked to do an interview with Premier League great Rio Ferdinand, who lost his mother six years ago.",
        "The interview started out like most others, general chit chat, big smiles, warm conversation.But when Ferdinand asked about Maria, there was a noticeable change in Cummins as his bottom lip trembled slightly and his eyes glazed over.'I'm speaking to a lot of people […] people who have similar stories,' he says softly.'I know them telling how they've dealt with it and been through it has helped me kind of rationalise it.'If I can help some other people down the track by speaking about it, potentially I will.'I've been really bad in the past, a couple of mates have gone through some things and just not knowing what's going on and not being there to talk about it.'Now, going through it, I realise just how hard it is and unfortunately how common it can be.''It's something I will keep working through and hopefully I can help some others.'Cummins has leaned heavily into family to help with his recovery.",
        "Spending time with his brothers Tim and Matt, sisters Kara and Laura and father Peter has been a cathartic time to share stories and remember all of the good times they had with Maria. ",
        "'It is still pretty raw at the moment but the last few months I have been lucky enough to spend loads of time with mum and us kids and dad and just sharing all those memories,' Cummins said.'I think it really hits home the kind of person you want to be, the kind of father you want to be.'From that side it's been quite good, lots of memories, but in terms of the grief, I guess you keep working through that.'",
        "During his sabbatical from cricket, Cummins had to find ways to re-energise himself, to prepare himself for the battle against the old enemy in The Ashes.So he drew on the past, revealing there was a period in his career where he felt broken and lost to the sport.'I played non-stop for a year or two, this is about four or five years ago when I had just come back from injury,' he said.'I was just spent, burned out.'I just remember thinking: \"Jeez, I am 25, if I am going to do this until I am 35 I've got to find a way to balance all these different things\".'So I stepped away, spending time with family and friends, going to the farm, getting a coffee by the beach.",
        "'I did a university degree, those things I find give me energy. So when I go and play cricket I can switch on a bit more.'Cummins emulated that period of his life this year to help with his recovery.Spending time on his 'pretend farm' with wife Becky and their son, enjoying simple pleasures like coffee by the beach in Sydney and opening himself to spending time with family and friends.'In the last couple of years, you just try and embrace every day.",
        "'He is changing every single day and you don't want to miss a minute.'So I am really precious with my time now.'I always kind of have to remind myself it's not forever like there will be a day where I won't be missing all the weddings or you know Christmases and stuff.'I love my job so it's kind of not ideal but it's part of it, it's important to love your job and love what you're doing.'"
    ]
}