{
    "articleURL": "/news/article-12050991/Gold-State-Coach-vs-Diamond-Jubilee-State-Coach-Inside-King-Charles-coronation-carriages.html",
    "content": [
        "King Charles and Queen Camilla arrived at Westminster Abbey in the sleek Diamond Jubilee State CoachThe royals head back to Buckingham Palace after today's ceremony in the 260-year-old Gold State CoachThe late Queen Elizabeth II said the Gold State Coach 'not very comfortable' because it is 'sprung on leather'How are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.uk King Charles III is travelling to his coronation in a sleek, air-conditioned coach, however, he will return to Buckingham Palace in its 200-year-old counterpart.",
        "Charles and Camilla arrived at Westminster Abbey at 11am in the Diamond Jubilee State Coach.This modern coach was originally meant to commemorate Queen Elizabeth II's 80th birthday, but its construction was delayed and so it was instead made to mark 60 years of her reign in 2012. However, the King and Queen Consort made the return journey to Buckingham Palace in the even grander Gold State Coach, used at the coronation of every monarch since William IV in 1831.King Charles's decision to choose the Diamond Jubilee State Coach for today's procession up to Westminster Abbey is a break from tradition but is thought to be a nod to his late mother because it was the last coach made during her reign.Here, MailOnline compares the Gold State Coach to the Diamond Jubilee State Coach, detailing all you need to know ahead of today's coronation proceedings...",
        "AgeThe Gold State Coach Now over 260 years old, having been built for King George III in 1762, the Gold State Coach's first outing was for his Opening of Parliament on 25 November 1762.Only the monarch and their consort are permitted to travel in the gilded carriage.The older coach has survived through two World Wars and yet it still looks almost exactly the same now as it was when it was originally built.",
        "The Gold State Coach is the third oldest surviving coach in Britain, following the Speaker of the House of Common’s Coach which is the oldest dating from 1698 and the Lord Mayor of London’s Coach was built in 1758.The Gold State Coach has been used at every coronation since William IV’s 1831 - a tradition the King is not looking to break today.The Diamond Jubilee State CoachThe Diamond Jubilee State Coach, on the other hand, was built in Australia by Jim Frecklington and then bought by the Royal Collection Trust. It was finished in 2010, but due to funding issues it did not arrive in London until March 2014.Yet, while it may be a newer build, the interior wooden panels of the coach are made from objects donated by more than 100 historic sites and organisations from across Britain.The window frames and interior panels include material from the Tower of London, Westminster Abbey, Balmoral, Kensington Palace Caenarfon Castle, Canterbury Cathedral, the Mary Rose (Henry VIII's flagship), 10 Downing Street and the Antarctic bases of Captain Scott and Sir Ernest Shackleton.The seat handrails are from the Royal Yacht Britannia, the vessel that was beloved by the Queen until it was retired from royal service in 1997.The coach also incudes a fragment of the bronze cannon from which every Victoria Cross is cast, and a piece of metal from the wreckage of a 617 Squadron Dambuster.",
        "SizeThe Gold State Coach The iconic gilded carriage, which is 23feet long (seven metres) and stands at 12feet (three point seven metres), weights almost four tons and is pulled by eight horses.Due to its age and weight, this carriage only ever travels at walking pace. But while Queen Elizabeth II had to endure a two-hour, five-mile route back to the palace via Regent Street, Oxford Street and Park Lane, her son and heir has decided on a much more direct procession via Whitehall, Admiralty Arch and The Mall. Martin Oates, senior carriage restorer at the Royal Mews, will walk behind the four-tonne carriage in the King's coronation procession and act as the 'brake man' pulling the hand-held T-bar at the back to secure it in place when it stops.It will take 20 people to push it out of its permanent home in the Royal Mews into the courtyard ready for the coronation, and a window and a door will have to be removed to create enough space for the huge carriage to pass through into the open air. ",
        "The Diamond Jubilee State CoachThe newest coach at the Royal Mews, however, is more than 16feet (five metres) long, weighs more than three tons and needs only six horses to pull it.",
        "Comfort The Gold State CoachAt 260 years old, however, the Gold State Coach is 'not very comfortable', according to the late Queen. Elizabeth II spoke candidly about the coach in 2018, saying: 'Horrible. Not meant for travelling in at all.'I mean it's just not... it's only sprung on leather.'She described how, at her coronation in 1953, they travelled 'half way around London' in the carriage during the royal procession, covering around five miles at a walking pace.It has been reported that Royal Mews staff strapped a hot water bottle under the seat on the day of the Queen's coronation, because the day was unseasonably cold and wet.Queen Elizabeth was not the only monarch to not be particularly fond of this coach - Queen Victoria was also not a fan and, after the death of Prince Albert in 1861, did not make use of it again.",
        "Queen Victoria much preferred to use the more comfortable State Landau coach on subsequent occasions following her own Coronation Day, for instance for both her gold and diamond jubilees and her wedding. The Diamond Jubilee State CoachWhile its unrivalled in how rich and beautiful it looks, the newer Diamond Jubilee State Coach combines traditional craftsmanship with the benefits of modern technology.",
        "Said to be one of the most comfortable royal coaches, it has an aluminium body, electric windows, air-conditioning and it is upholstered in yellow silk.What's more, it is prevented from swaying by six hydraulic stabilisers, while the gilded crown on top, carved from the oak of HMS Victory, can hold a camera to film journeys.Cost The Gold State CoachThe Gold State Coach, built in 1762, was most recently used during Her Majesty's Platinum Jubilee celebrations in 2022 and was fitted for the day with a hologram of the monarch in the coach windows.Designed by William Chambers and made by Samuel Butler, the coach is made of giltwood, which is a thin layer of gold leaf over wood. ",
        "It features gilded sculptures including three cherubs on the roof, which represent England, Scotland, and Ireland, and above each wheel there is a massive triton figure.Also decorating the outside are incredibly ornate panels of Roman gods and goddesses painted by Giovanni Battista Cipriani.The Gold State Coach is the third oldest surviving coach in the UK, coming only after the Speaker of the House of Common's Coach, dating from 1698, and the Lord Mayor of London's Coach, built in 1758. The Gold State Coach cost £7,661, 18 shillings and 11 pennies when it was first built in 1762, which would be around £2 million today.",
        " The Diamond Jubilee State CoachThe Diamond Jubilee State Coach was purchased by the Royal Collection Trust for an undisclosed fee, paid by a private donation.There is also uncertainty around who commissioned the coach and how much for as the maker claimed it was endorsed by Buckingham Palace, but not commissioned.",
        "The official Coronation Weekend plansThe three-day coronation extravaganza kicked off at 6am this morning, when the viewing areas open along the procession route.Between 7.15am and 8.30am, Westminster Abbey guests started to arrive at checkpoints in Victoria Tower Gardens, before being seated at 9am.The most important members of the congregation, including heads of state, foreign royals, members of the British Royal Family, overseas government representatives, UK Government ministers, First Ministers and former Prime Ministers arrived between 9.30am and 10.45am.Meanwhile, the Sovereign's Escort of the Household Cavalry began to gather ready for the King's Procession from Buckingham Palace at 9.45am.The King's procession started at 10.20am, where Charles and Camilla travelled from Buckingham Palace to Westminster Abbey, around 1.3miles, with thousands of well-wishers lining the procession route waving flags and trying to catch a glimpse of the royals.They travelled down The Mall via Admiralty Arch, take the south side of Trafalgar Square, then go along Whitehall and Parliament Street, take the east and south sides of Parliament Square to Broad Sanctuary, before arriving at the Abbey. ",
        "Today's coronation ceremony started at 11am and last for around two hours. During the coronation, Charles took his oath and was anointed by the Archbishop of Canterbury.The Crown of St Edward, which is made of solid gold and decorated with more than 400 gemstones, including rubies and sapphires, will be placed on his head.However, he swapped this for the Imperial State Crown before the end of the ceremony. The King sat in the coronation chair, holding his sceptre and rod, and the sovereign's orb, which represent his control of the nation and the Christian world.After the ceremony, Charles and his Queen Consort Camilla, took the same route back to Buckingham Palace, where the Royal Family will gather on the balcony.",
        "There will be around 2,000 guests at today's coronation celebrations, including members of the British Royal Family like Charles' sons Prince William and Prince Harry, his daughter in-law Catherine, Princess of Wales, his sister Princess Anne and brother Prince Edward. His grandson Prince George was page of honour at the coronation.There were also members of Camilla's family there including her son Tom Parker Bowles, her daughter Laura Lopes and their families, her ex-husband Andrew Parker Bowles, her sister Annabel Elliot, her nieces and nephew, three grandsons and one grandnephew.",
        "Here is a rundown of all the timings for the Coronation day:6am - Viewing areas open along the procession route.7.15-8.30am - Guests for Westminster Abbey begin to arrive at security check points in Victoria Tower Gardens.9am - Congregation to be seated inside the Abbey.9.30-10.45am - Heads of state, overseas government representatives, Government ministers, First Ministers, former PMs, foreign royals and members of the royal family arrive.9.45am - The Sovereign's Escort of the Household Cavalry begin to gather ready for the procession from Buckingham Palace.10.20am - The King and Queen Consort's procession sets off from the Palace.10.53am - The King and Queen Consort arrive at Westminster Abbey.11am - Charles and Camilla enter the Abbey through the Great West Door and the service begins.12pm - The King is crowned. The Archbishop of Canterbury places the St Edward's Crown on Charles's head. Trumpets will sound and gun salutes will be fired across the UK.1pm - The service ends and the newly crowned King and Queen begin their coronation procession back to Buckingham Palace in the Gold State Coach.1.33pm - Charles and Camilla are expected to enter Buckingham Palace through the Centre Arch.1.45pm - The King and Queen Consort receive a royal salute from the military in the Palace gardensAround 2.15pm - The King, Queen Consort and members of the royal family appear on the Palace balcony to watch the flypast.",
        "Many foreign royals are expected to attend too, such as Prince Albert and Princess Charlene of Monoco, King Filipe and Queen Letizia of Spain, Crown Prince Akishino and Crown Princess Kiko of Japan, King Philippe and Queen Mathilde of Belgium, King Willem-Alexander and Queen Máxima of the Netherlands and Queen Anne-Marie and Crown Prince Pavlos of Greece.Prime Minister Rishi Sunak - attending with his wife Akshata - led politicians who are attending. Also among them were Sunak's seven surviving predecessors -  Liz Truss, Boris Johnson, Theresa May, David Cameron, Gordon Brown, Tony Blair and John Major.First Minister of Scotland Humza Yousaf, First Minister of Wales Mark Drakeford, the mayor of the City of London Nicholas Lyons and Sir Jeffrey Donaldson, leader of Northern Ireland's Democratic Unionist Party (DUP), were be there. Several members of the aristocracy attended including the event organiser Edward Fitzalan-Howard, the 18th Duke of Norfolk,  the current Lord Lyon King of Arms, Joseph Morrow, who took part in the King's procession, and Rupert Francis John Carrington, the 7th Baron Carrington, who took part in investing King Charles with regalia.A number of foreign political leaders attended including French President Emmanuel Macron, US First Lady Jill Biden, Australian Prime Minister Anthony Albanese and Australian Governor-General David Hurley, New Zealand Prime Minister Chris Hipkins and New Zealand Governor-General Dame Cindy Kiro, European Commission President Ursula von der Leyen and European Council President Charles Michel.There were also a number of religious leaders present, including Justin Welby, the Archbishop of Canterbury who will conduct the ceremony, Stephen Cottrell, Archbishop of York and Rabbi Ephraim Mirvis, chief rabbi of the UK.Several celebrities were in attendance including Rowan Atkinson, Joanna Lumley, Bear Grylls and Stella McCartney.Around 850 representatives of charities that Charles and Camilla support were there,  as well as 450 recipients of the British Empire Medal.Tomorrow, there will be the Coronation Concert at Windsor Castle, starting at 8.30pm and running for 90 minutes.The concert will feature 'music icons and contemporary stars' including Take That, Lionel Ritchie and Katy Perry.Various parts of the UK will then be lit up by drone displays, illuminations and projections and lasers in a feat named Lighting up the Nation."
    ]
}