{
    "articleURL": "/wires/reuters/article-12043793/SNAPSHOT-Russias-war-Ukraine-latest-Kremlin-says-Putin-targeted-Kyiv-denies.html",
    "content": [
        "May 4 (Reuters) - Ukrainian President Volodymyr Zelenskiy visited the International Criminal Courtin The Hague, which in March issued an arrest warrant for Russian President Vladimir Putin for alleged deportation of children from Ukraine.",
        "FIGHTING* Zelenskiy said Ukraine would launch a counteroffensive soon against occupying Russian forces.* Yevgeny Prigozhin, leader of Russia's Wagner Group mercenary force, said the counteroffensive had already begun and his forces were observing heightened activity along the front.* Russian shelling killed 23 people in and near the southern Ukrainian city ofKhersonon Wednesday, hitting a hypermarket, a railway station and residential buildings, the regional governor said.* Adrone attackset ablaze product storage facilities at one of the largest oil refineries in southern Russia, but emergency services extinguished the fire just over two hours later, and the plant was working normally, TASS news agency reported.* Ukrainian air defences said they downed 18 out of 24 kamikaze drones that Russia launched in a pre-dawn attack on Thursday. Kyiv city administration said that all missiles and drones targeting the Ukrainian capital for the third time in four days, were destroyed.DIPLOMACY/POLITICS* Zelenskiy will have a meeting at the International Criminal Court (ICC) in The Hague on Thursday, the court said without giving further detail.* German police said Zelenskiy would travel to Berlin on May 13, though a security source later said public disclosure of the visit was premature and it was now unclear if it would go ahead.",
        "* U.S. military aid for Ukraine includes for the first time the Hydra-70 short-range air-launched rocket, taken from U.S. excess stocks.ECONOMY* Russia said it will keep talking to the United Nations about the future of a deal that allows the safe Black Sea export of Ukraine grain, but would not do anything to harm its own interests.* Zelenskiy said Russia did not appear to be interested in extending the agreement beyond May 18.* Chicago wheat rebounded from a 25-month low to close higher, edging up on doubts about the future of the Black Sea grains corridor, market analysts said.* A Russian-U.S. joint venture has said it has abandoned plans to build large-capacity gas turbines in Russia under licence from General Electric CoRECENT IN-DEPTH STORIES* INSIGHT-Russia digs in as Ukraine prepares to attack* ANALYSIS-Russia crosses new lines in crackdown on Putin's enemies* EXCLUSIVE-The Russian military commandant who oversaw reign of fear in Ukraine town* EXCLUSIVE-Kazakhstan has ramped up oil exports bypassing Russia -sources* Liberated villages offer glimpse of precarious Ukrainian health system. (Compiled by Reuters editors)"
    ]
}