{
    "articleURL": "/sport/football/article-12058751/Man-City-defender-Joao-Cancelo-set-loan-Barcelona-Jorge-Mendes-meets-clubs.html",
    "content": [
        "Jorge Mendes is reportedly in talks Barcelona to secure a loan for Joao CanceloCancelo is adamant that he will not return to either Bayern Munich or Man CityManchester City defender Joao Cancelo is reportedly eyeing up a loan move to Barcelona when he returns from Bayern Munich this summer - with his agent Jorge Mendes said to be holding talks with the LaLiga side.",
        "The 28-year-old departed the Etihad in the January transfer window after falling out with Pep Guardiola as he joined Bundesliga giants Bayern Munich.However, he will not continue with Bayern next season, according to Spanish outlet Sport.It is believed that he doesn't wish to return to Man City either, and could join Barcelona as an 'ideal destination'.The report continues to reveal that his agent Mendes was in Barcelona recently to discuss his possible arrival at the Nou Camp.",
        "Mendes was 'mediating to achieve a favourable loan move' for his client for next season, with a purchase option. While Cancelo wishes to join Barceona, it is now believed that they are working on a deal for a player in his position despite it not being a priority in previous weeks.Initially, boss Xavi was keen to 'reinforce other positions and content without a right-back, but now work is underway to sign a defender under favourable economic decisions.Despite Cancelo being heavily linked, he is not thought to be the dream signing for Xavi, who prefers a move for Villarreal's Juan Foyth, the report goes on.However, the La Liga rivals are not keen to negotiate a deal for Foyth, insisting that his £55million release clause must be met.Due to Barcelona's financial situation, they are not able to afford to pay this as of now, so 'the arrival of Cancelo is taking shape'. ",
        "It remains to be seen as to whether a deal will be confirmed this summer, with Cancelo's long-term future at both Man City and Bayern Munich in doubt. "
    ]
}