{
    "articleURL": "/wires/reuters/article-12042081/U-S-private-payrolls-beat-expectations-April--ADP.html",
    "content": [
        "WASHINGTON, May 3 (Reuters) - U.S. private employers boosted hiring in April, but there are signs that the labor market is slowing amid higher interest rates.",
        "Private payrolls increased by 296,000 jobs last month, the ADP National Employment report showed on Wednesday. Data for March was revised lower to show 142,000 jobs added instead of 145,000 as previously reported. Economists polled by Reuters had forecast private employment increasing 148,000.The Federal Reserve is expected to raise its benchmark overnight interest rate by another 25 basis points to the 5.00%-5.25% range at the end of a two-day policy meeting on Wednesday before potentially pausing the U.S. central bank's fastest monetary policy tightening campaign since the 1980s.Higher interest rates are cooling demand for workers and hiring could be eroded by a tightening in bank lending following recent financial market turmoil. A standoff to raise the federal government's $31.4 trillion borrowing cap poses a grave risk to the economy and ultimately the labor market.Treasury Secretary Janet Yellen warned on Monday that the government could run out of money within a month.The government reported on Tuesday that there were 9.6 million job openings at the end of March, the lowest since May 2021. Nevertheless, the labor market remains tight, with 1.6 job openings for every unemployed worker in March, well above the 1.0-1.2 range that economists say is consistent with a jobs market that is not generating too much inflation.",
        "The ADP report, jointly developed with the Stanford Digital Economy Lab, was published ahead of the Labor Department's Bureau of Labor Statistics' more comprehensive and closely watched employment report for March on Friday.It has not been a reliable gauge in forecasting private payrolls in the BLS employment report.According to a Reuters survey of economists, private payrolls likely increased by 160,000 jobs in April.With gains anticipated in government employment, total nonfarm payrolls are forecast to have risen by 179,000 jobs last month after gaining 236,000 in March. (Reporting by Lucia Mutikani; Editing by Chizu Nomiyama)"
    ]
}