{
    "articleURL": "/femail/article-12059467/Eddie-Hall-stunned-surprising-contents-12k-storage-container-bought-auction.html",
    "content": [
        "Eddie 'The Beast' Hall successfully bid for the container at an auction for £12,500READ MORE: Eddie Hall reveals intruder broke into his garden and challenged him to a fightThe 'world's strongest man' Eddie Hall was left stunned by the contents of a mystery storage container he won for £12,500 auction. ",
        "In a video posted on YouTube, the boxer, 35, from Newcastle-under-Lyme, explained how he was encouraged to bid for the storage unit by a friend who discovered it once belonged to a jeweller.Filming outside the  Adam Partidge Auctioneer and Valuers in Macclesfield, Eddie said: 'I've got a tip-off from a pal that there's a container on auction today and it belonged to an old pal of his who was an old jeweller.'He was a jeweller for fifty years and then he went into a home and this container has been here for ten years. 'He's sadly passed away and this container is up for auction today.' ",
        "However, Eddie's bargain hunt got off to a rocky start after he accidentally knocked over a Victorian cut glass vase in the auction house and had to pay out £1,000 in compensation.But he eventually secured the container for a total of £12,500 which was delivered two days later to a car park in Stoke-on-Trent.After successfully winning the item at auction, Eddie then had to spend several hours breaking open the container to discover its unknown contents. With the assistance of his friend Paddy, the pair had to take a trip to buy some bolt cutters and a crowbar before they could open up the container.",
        "While sorting through the contents, Eddie explained: 'My mate told me this guy put all his stuff in the container to move...and then ended up going into a home because his mental health deteriorated.'Whilst he was in a home he died, so this is one of his containers...and this is the one on a certain plot of land that was rumoured to have some safes in.' The pair unpacked sofas, a television and a fire extinguisher before hitting upon the two locked safes. After piling up the furniture, Eddie discovered the safes contained gold coins and a diamond ring as well as a 2008 Bentley car - estimated to be worth £40,000.",
        "After making use of a sledgehammer and a series of drills, they resorted to running the box over with a tank and drilling it with a digger. This is how they uncovered what appeared to be 12 gold sovereign coins inside. In the second safe, the pair discovered a five pound coin from the 1970s and a penny, before they finally found a diamond ring.For their last find, the pair uncovered a Bentley - complete with some branded umbrellas. They managed to get the engine started again with the help of a booster pack.Signing off the video, Eddie estimated how much he could make from reselling some of the goods. ",
        "He concluded that the gold coins would sell for a minimum of £4,000, the diamond ring for £1,500, the rare coins for £100, tools for a total of £2,000, a train collection for £1000 and the car for approximately £40,000.Having spent £15,000 on the storage box in total, Eddie said his overall profit would reach around £33,600.He added: 'I'll take that all day.' Eddie was the UK's strongest man for six years in a row and is nicknamed 'the beast' for his massive size at six foot, three inches and 25 stone."
    ]
}