{
    "articleURL": "/wires/ap/article-12055291/Real-Madrid-overcomes-Osasuna-win-Copa-del-Rey.html",
    "content": [
        "SEVILLE, Spain (AP) - Rodrygo and Vinícius Júnior completed their collection of club trophies for Real Madrid on Saturday after helping win the club its first Copa del Rey in nearly a decade.",
        "Vinícius provided the playmaking and Rodrygo struck two goals in a 2-1 victory over a feisty Osasuna side that fell behind shortly after kickoff but was never out of the final.While Karim Benzema had a subdued performance, his attack partners were decisive.The pair of 22-year-old Brazil forwards have now won all the titles possible at the club level, after adding the Spanish cup to their European Cup, Spanish league, Club World Cup, UEFA Super Cup and Spanish Super Cup titles.Next up: defend the Champions League title that both were critical to winning last year for a record-extending 14th time.Manchester City arrives to the Spanish capital on Tuesday to start their rematch of last year's Champions League semifinal won by Madrid.",
        "\"(Vinícius and Rodrygo) made the difference,\" Madrid coach Carlo Ancelotti said. \"Vini caused them lots of problems in the first half, Rodrygo scored two goals. These two players decide games.\"\"Like all finals, it was suffering and then happiness. We are going to celebrate a little bit and then think about Tuesday.\"Rodrygo was set up by Vinícius after two minutes at La Cartuja Stadium. Osasuna´s Lucas Torró equalized in the 58th, but Rodrygo put Madrid back ahead for good in the 70th.Since winning its last Copa del Rey in 2014, the 14-time European Cup winner had won four Champions Leagues while falling short in the Spanish cup.",
        "That changed on Saturday, when it defeated an Osasuna that was seeking its first major title in club history after also losing its only other Copa del Rey final in 2005. Madrid has 20 Copa del Rey titles, behind only Barcelona (31) and Athletic Bilbao (23).\"We had been talking all week about how it had been a long time since Real Madrid had won this title,\" Rodrygo said. \"I really wanted to win this title since it was this that was the only (club) title I was missing.\"Benzema celebrated his club record-matching 25th title with Madrid after he received the cup from Spain´s King Felipe VI, who presided the game after he attended the coronation of King Charles III in London.Rodrygo was key to Madrid´s run to its record-extending 14th-European Cup last season. And against Osasuna he proved clutch in yet another big match, especially when cued by countryman Vinícius.Vinícius dribbled past both Jon Moncayola and Rubén Peña before slipping the ball past three other defenders to find Rodrygo in the middle of the area to score the early opener.\"It is very tough to defend Vinícius as City will see on Tuesday,\" said Osasuna coach Jagoba Arrasate, who wept after the final whistle from what he said was the \"built up tension.\"",
        "But Osasuna, a modest club from Pamplona in northern Spain, had its chances, too.Abde Ezzalzouli came close to leveling in the 26th when he broke past the defense and chipped goalkeeper Thibaut Courtois, only for Dani Carvajal to rush back and clear to safety.The action didn´t stop as David Alaba surprised with a long free kick that rattled the crossbar in the 28th.The vibrant start unfortunately was cut short when tempers flared mostly between Vinícius and a couple of Osasuna players after run-ins. The referee booked Vinícius apparently for protesting. The tempers spilled over into halftime when Vinícius and Osasuna reserve Chimy Ávila were separated by teammates as they went through the tunnel to the changing rooms.Osasuna started better in the second half and its insistence paid off when a cross from Abde was deflected by Carvajal and fell to Torró arriving unmarked at the top of the area. The midfielder could not have picked a better time of the season to score his first goal when he lashed a right-footed shot into the lower corner of Courtois´ net.\"We were right there in it in the second half,\" Torró said. \"We just didn´t know how to hang in there. Their second goal really hurt. We made a silly mistake (on their first goal) but we didn´t give up and gave Real Madrid a fight. I am proud of my team.\"",
        "Play was paused briefly after Torró´s goal when a flare was lit in a section packed with Osasuna´s thrilled fans.Rodrygo struck again after another run by Vinícius down the left side. Toni Kroos´ deflected shot was not cleared by Osasuna and Rodrygo once again knew just where to be to put it past goalie Sergio Herrera a second time. It was the his 16th goal of the season.It was Madrid´s third title of the season after it had won the Club World Cup and and the UEFA Super Cup. It lost the Spanish Super Cup final to Barcelona and is in third place in the Spanish league and with almost no chance of catching runaway leader Barcelona.___More AP soccer: https://apnews.com/hub/soccer and https://twitter.com/AP_Sport"
    ]
}