{
    "articleURL": "/wires/reuters/article-12052899/Stingy-Whitecaps-focus-Minnesota-United.html",
    "content": [
        "The Vancouver Whitecaps are closing in on a franchise record for not allowing a goal as they host Minnesota United on Saturday night.",
        "The Whitecaps have blanked four straight opponents and haven't allowed a goal in 410 minutes since playing Minnesota United to a 1-1 tie in Saint Paul on March 25.The club's single-season franchise record is 427 consecutive scoreless minutes in 2012, with the overall mark of 433 set across the 2011 and 2012 seasons.The stellar goalkeeping by Yohei Takaoka (four shutouts) and fine defensive play that combined to allow just seven goals isn't translating into victories. The Whitecaps (2-2-5, 11 points) are unbeaten in their past seven games (2-0-5) but have scored one goal or fewer in six of those matches.In fact, Vancouver has played to a scoreless draw in each of its past two games.\"I think it's obviously another shutout for us, which is the biggest thing,\" defender Tristan Blackmon said after last weekend's 0-0 tie with the visiting Colorado Rapids. \"You have a bunch of individual performances that come together and, obviously, that translates to the clean sheet.\"The Whitecaps have scored just 11 goals with five of them coming in a shutout win over CF Montreal on April 1.Minnesota (3-3-3, 12 points) has scored just eight goals all season.The Loons are 0-3-1 over their past four matches and have been blanked in each of their past two. The first was a 1-0 loss to the Seattle Sounders and the other was last weekend's home scoreless tie with FC Dallas.",
        "Minnesota goalkeeper Dayne St. Clair is enjoying a stellar season with three shutouts in eight starts.But offensively, Loons coach Adrian Heath is perplexed with the club's difficulties.\"The longer that goes, the more the pressure and anxiety builds and you start to overthink it instead of just being free,\" Heath said. \"That's easier said than done, but that's what they've got to do.\"Part of the struggles are due to the absence of suspended star Emanuel Reynoso.MLS suspended Reynoso when he didn't report to training camp with Minnesota. He remains away in his native Argentina and the team's latest attempt to lure him back came up empty.Reynoso, 27, led the Loons in goals (10) and assists (11) last season.In their first meeting, Mender Garcia scored in the 40th minute to give Minnesota a 1-0 lead. Simon Becher tallied the equalizer in the eighth minute of second-half stoppage time.--Field Level Media"
    ]
}