{
    "articleURL": "/news/article-12052205/Its-mutilation-DeSantis-sign-bill-banning-sex-change-surgeries-minors.html",
    "content": [
        "The bill passed by Florida's legislature Thursday would prohibit doctors from giving minors drugs or performing state-funded 'gender-affirming' medical proceduresDeSantis has long been expected to announce whether he'll enter the 2024 GOP primary after Florida's legislative session endsHe said 'you either gotta put or shut up' regarding entering the raceFlorida Gov. Ron DeSantis said he will announce his 2024 presidential ambitions 'relatively soon' at an event celebrating the end of the state's legislative session.",
        "The governor has long been expected to officially announce his intention to run for president in 2024 once the state's legislative session comes to an end, so an official announcement could be right around the corner.He addressed speculation on his 2024 plans Friday, saying it will happen 'soon.''I felt very confident going into November '22 we were gonna do very well, but you really had to put up or shut up on that.' 'What happens in the future? We'll get on that relatively soon. You either gotta put or shut up on that as well. So we'll see,' he continued.The governor is expected to sign one of the final bills that passed Thursday - banning sex change surgeries for minors as the state's legislative session comes to an end Friday,The bill would prohibit doctors from giving minors drugs or performing state-funded 'gender-affirming' medical procedures if they are under the age of 18.'Honestly, it's like, seriously, some of this stuff is just totally manufactured. And when you talk to people - and I know like people in your industry will dress it up with a euphemism - and they'll say it's healthcare, to cut off the private parts of a 14 or 15 year old,' DeSantis said.",
        "'That is not healthcare. That is mutilation and we're standing up against that,' DeSantis said Friday - the last day of the state's legislative session.",
        "On Friday, DeSantis appeared to be speaking to the 'corporate media,' who he regularly slams for changing the narrative on issues that he says they don't agree with. State Rep. Ralph Massullo, a Republican and co-sponsor of the bill, said that children 'need to come to a point where they realize their gender and are able to accept themselves.' Florida's Republican supermajorities in the state legislature propelled forward many signature DeSantis priorities including expanding a law to cover all public school students Kindergarten through 8th grade.He also signed laws banning abortions in the state after six weeks of pregnancy and allowing concealed carry throughout Florida.The governor is also expected to sign a law banning diversity, equity and inclusion in state-run colleges.'After a historic election cycle, we seized the opportunity to follow through on our promises and delivered unprecedented results for Floridians this Legislative Session,' DeSantis said Friday. 'We have secured $2.7 billion in tax cuts, and the legislature passed countless legislative priorities that will better the lives of Florida families. Thank you to the Legislature for such a productive session.' ",
        "It has been reported that DeSantis, now that the legislative session has ended, will make his official presidential run announcement in June. ",
        "Former President Donald Trump, who announced his reelection bid last November, has already come out swinging against DeSantis - despite him not being officially in the race.Trump urged DeSantis not to run against him in 2024 because he's not doing well in the polls, will divide the Republican party and 'lose the cherished and massive' MAGA vote.The ex-president also has called DeSantis 'young' and suggested that he might have a more bright political future if he remains governor of Florida to the end of his second term in 2026. "
    ]
}