{
    "articleURL": "/wires/ap/article-12045417/Not-king-UK-republicans-want-coronation-last.html",
    "content": [
        "LONDON (AP) - On his way to be crowned this week, King Charles III will travel by gilded coach through streets swathed in red, white and blue Union flags - and past a warning from history.",
        "At Trafalgar Square stands a large bronze statue of King Charles I, the 17th-century monarch deposed by Parliament and executed in 1649. On Saturday, more than 1,500 protesters, dressed in yellow for maximum visibility, plan to gather beside it to chant \"Not my king\" as the royal procession goes by.\"We´ll try and keep the atmosphere light, but our aim is to make it impossible to ignore,\" said Graham Smith, chief executive of the anti-monarchist group Republic.The coronation, he said, is \"a celebration of a corrupt institution. And it is a celebration of one man taking a job that he has not earned.\"Republican activists have long struggled to build momentum to dislodge Britain's 1,000-year-old monarchy. But they see the coronation as a moment of opportunity.Queen Elizabeth II, who died in September after 70 years on the throne, was widely respected because of her longevity and sense of duty. Charles is another matter, a 74-year-old whose family feuds and firm opinions on everything from architecture to the environment have been headline fodder for decades.",
        "Opinion polls suggest opposition and apathy to the monarchy are both growing. In a recent study by the National Center for Social Research, just 29% of respondents thought the monarchy was \"very important\" - the lowest level in the center´s 40 years of research on the subject. Opposition was highest among the young.",
        "\"I think it´s definitely shifting,\" said Smith, whose group wants to replace the monarch with an elected head of state. \"People are quite happy to criticize Charles in a way they weren´t willing to necessarily in public about the queen.\"Millions in Britain will watch broadcasts when Charles is crowned in Westminster Abbey. Tens of thousands will line the streets, and neighborhoods across the country will hold parties.But millions more will ignore the ceremonies. Some will attend alternative events, including a gig in Glasgow by tribute band the Scottish Sex Pistols, recapturing the spirit of punks who sang \"God save the queen, the fascist regime\" during the late queen´s 1977 silver jubilee.London´s Newington Green Meeting House, a gathering place for religious dissenters and radicals for 300 years, is holding an \"alternative community party,\" complete with food, drink and \"radical and republican\" music.General manager Nick Toner said that the event is for people who \"don´t want to sit through hours of footage of ceremonies, carriages and endless Union Jacks, perhaps because they think it´s a waste of taxpayers´ money or even just plain old boring.\"While the BBC, Britain´s publicly owned national broadcaster, will offer wall-to-wall coronation coverage on Saturday, rival Channel 4 offers an alternative schedule including a musical about disgraced royal Prince Andrew, irreverent sitcom \"The Windsors\" and documentary \"Farewell to the Monarchy.\"",
        "Some argue that it´s grotesque to spend millions on pomp and pageantry amid a cost-of-living crisis that has brought 10% inflation, driven thousands to food banks and triggered months of strikes by nurses, teachers and other workers seeking higher pay.Even Charles' slimmed-down ceremony - with about 2,000 guests instead of the 8,000 who attended the queen´s coronation in 1953 - carries a big price tag for British taxpayers. The full cost won´t be known until afterward, but Elizabeth´s 1953 coronation cost 912,000 pounds, the equivalent of 20.5 million pounds ($26 million) today.Deputy Prime Minister Oliver Dowden, who helps oversee coronation arrangements, has argued that \"people would not want a dour scrimping and scraping\" at such a \"marvelous moment in our history.\" Coronation supporters argue that the celebrations will be a boost for brand Britain, attracting tourists and stimulating sales.Not everyone is convinced.\"I disagree with it,\" said Philippa Higgins, a 24-year-old receptionist in London. \"I just think it seems a bit silly when we´ve got so many people struggling, to have something so extravagant right now. But some people argue tradition, I suppose.\"Opposition to the lavish coronation is especially strong in Scotland and Wales, where some pro-independence nationalists see the monarchy as part of the U.K. state they want to leave.",
        "Some Scottish nationalists object to the Stone of Destiny - a 275-pound (125-kilogram) chunk of sandstone linked to both Scottish and English monarchs - being sent from Edinburgh to London to take its traditional place under the coronation chair. The iconic rock, a symbol of Scottish nationhood seized by an English king in the 13th century and not returned until 1996, had to be moved to Westminster Abbey in secrecy and amid tight security.Charles is keen to be seen as a modern monarch, and Buckingham Palace has adapted some of the coronation´s ancient traditions for the 21st century. His coronation will be the first to feature contributions from Buddhist, Hindu, Jewish, Muslim and Sikh leaders, and the first to include female bishops.Still, a suggestion from the Church of England that people watching the coronation on TV might want to swear allegiance to the king from their sofas has struck a sour note with some.Charles is monarch of 14 former British colonies as well as the U.K., and the king has tentatively addressed the legacy of empire. He supports research into the monarchy´s links to the trans-Atlantic slave trade, and last year expressed \"personal sorrow\" at the suffering caused by slavery - though he stopped short of saying sorry.",
        "The number of Charles´ realms is likely to dwindle during his reign. Barbados became a republic in 2021 and Jamaica plans to do the same. New Zealand Prime Minister Chris Hipkins said this week he wants his country to jettison the crown, though he added that it´s not an \"urgent priority.\"Craig Prescott, a constitutional law expert at Bangor University in Wales, says that in the U.K., the monarchy is probably safe for now because of Britain´s tendency to \"muddle through\" and gradually adapt its politics and constitution to changing times.\"Clearly, if you were going to start from scratch, you would probably never choose one family and say, `They´re going to provide a head of state forever,´\" he said. But the arrangement mostly works, and abolishing the crown \"isn´t on the horizon of any political party.\"Still, he sees danger ahead if a young generation that has endured years of austerity, pandemic and economic pinch continues to struggle.\"If the monarchy stands for the status quo, the status quo isn´t necessarily great, in generational terms, for a certain section,\" Prescott said. \"If that continues, then that may be a problem for a lot of national institutions in 20 or 30 years´ time.\"___Associated Press videojournalist Kwiyeon Ha contributed to this story.",
        "______Follow AP´s coverage of King Charles III and the coronation at https://apnews.com/hub/king-charles-iii"
    ]
}