{
    "articleURL": "/wires/reuters/article-12049465/Twins-Guardians-look-kick-start-lineups.html",
    "content": [
        "The American League Central-leading Minnesota Twins travel to Cleveland to play the second-place Guardians Friday night in the first of a three-game weekend series.",
        "Many preseason pundits had these two teams so closely rated that Baseball Prospectus' PECOTA standings projected the Twins to win 88.4 games and lose 73.6 this season -- while they forecast the Guardians to finish with a record of 87.8-74.2.The two teams remain close in the standings just over a month into this season, but are both battling offensive problems. This series could provide some insight into where the clubs are heading.In Friday's series opener, Minnesota will start right-hander Bailey Ober (1-0, 1.59 ERA) and Cleveland will go with 25-year-old rookie righty Peyton Battenfield (0-2, 4.67).Last Saturday, the 6-foot-9 Ober returned to the Twins' rotation for his second start of the year and held the Kansas City Royals to one run in 5 2/3 innings with six strikeouts. He said he's trying not to think about a potential return to Triple-A Saint Paul.\"I try not to think about it too much,\" Ober said. \"I'm just trying to go out here and do my job, and hopefully, I perform well enough to make them decide that I should stay up here.\"For Guardians manager Terry Francona, the issue has been trying to find a way to generate offense, as Cleveland ranks only 14th in the American League with 116 runs scored.",
        "On a positive note, the Guardians have struck out an AL-low 237 times this season and top the AL in stolen bases with 37 steals in 44 attempts. But they are also last in the majors with a .338 slugging percentage.\"It has not been easy,\" Francona said about his offense after Wednesday's 4-3 walk-off loss in 10 innings against the New York Yankees. \"We've had chances to add on and we haven't added on. We're not taking advantage of mistakes, and that's what you need to do to score runs.\"Cleveland lost two of three in New York for its fifth straight series loss. After winning a series against the Washington Nationals in the middle of April, the Guardians have since lost series to the Detroit Tigers, Miami Marlins, Colorado Rockies, Boston Red Sox and Yankees.At least the Guardians will have the benefit of being a bit more rested than the Twins. Cleveland had a day off on Thursday, while Minnesota was forced to go 12 innings in Chicago to finally beat the White Sox 7-3 in a wild game that lasted three hours and 37 minutes before the team's flight to Cleveland.The Twins are scoring more (147 runs, seventh in AL) than Cleveland, but even Minnesota manager Rocco Baldelli bemoaned his team's lack of offense after losses in the first two games of the White Sox series.",
        "\"We've got to score more, there's no way around it,\" Baldelli told the Star Tribune. \"It's going to be hard to win games like these, not hitting too many balls on the barrel.\"--Field Level Media"
    ]
}