{
    "articleURL": "/wires/ap/article-12049753/Australia-PM-allegiance-king-wants-president.html",
    "content": [
        "CANBERRA, Australia (AP) - Australian Prime Minister Anthony Albanese said Friday he would declare his allegiance to King Charles III at the monarch´s coronation despite believing that Australia should have its own head of state.",
        "Albanese voted in a failed referendum in 1999 for an Australian citizen to replace the British monarch as the country's head of state. He said he accepted that a majority of Australians chose for the country to remain a constitutional monarchy instead of becoming a republic and would reflect that sentiment when he attended the king´s coronation Saturday in London.\"I haven´t changed my position on that and I´ve made that very clear. I want to see an Australian as Australia´s head of state,\" Albanese told Australian Broadcasting Corp.\"That doesn´t mean that you cannot have respect for the institution, which is the system of government that we have,\" he said. \"And I believe, as the Australian prime minister, I have a particular responsibility to represent the nation in a way that respects the constitutional arrangements, which are there.\"The Australian Republic Movement, which campaigns for Australia to become a republic, has urged Albanese to remain silent when the Archbishop of Canterbury invites \"all who desire\" among the congregation at Westminster Abbey to take the oath of allegiance to the king.But Albanese said he would follow protocol by taking the oath, though his office did not respond when asked if Albanese intended to affirm or swear his allegiance to the king.",
        "\"I think as the Australian prime minister, people expect me to not come to the king´s coronation in order to create a controversy,\" Albanese said.Brought up as a Roman Catholic, Albanese opted against swearing an oath on a Bible a year ago when he was appointed prime minister by Governor-General David Hurley, who was then Australia´s representative of Queen Elizabeth II.He took an affirmation of office, a secular alternative to the oath that doesn´t mention God or the monarch.Albanese´s eclectic Australian delegation to the coronation includes Hurley and all six state governors. The delegation will be led by Australian women´s soccer star Sam Kerr, who currently plays for the London-based club Chelsea; post-punk pioneer musician Nick Cave; and comedian Adam Hills.As a coronation gift, the Australian government will donate 10,000 Australian dollars ($6,700) to a charity that conserves the Western ground parrot, an endangered Australian bird.Albanese has ruled out holding a referendum to replace the British monarch with an Australian president during his first three-year term in office. This year, he is prioritizing a referendum that would recognize Indigenous Australians in the constitution and create a representative body to advise the Parliament on Indigenous issues.While Albanese has appointed a minister responsible for the republic, he has not provided a time frame for when Australians will get to vote on such a constitutional change.",
        "___Find more of AP´s Asia-Pacific coverage at https://apnews.com/hub/asia-pacific"
    ]
}