{
    "articleURL": "/wires/reuters/article-12049029/Dodgers-Padres-time-NLDS.html",
    "content": [
        "One of the more anticipated early-season series of 2023 will commence Friday night when the Los Angeles Dodgers visit the San Diego Padres.",
        "It's the first meeting between the Southern California rivals since the wild-card Padres defeated the powerful National League West champions in the playoffs last fall.The Dodgers will be seeking a measure of revenge -- although nothing will totally make up for the embarrassment of being eliminated in the NL Division Series by the Padres.The Padres will be seeking validation as the next step toward unseating the Dodgers as division champions en route to a first World Series title.Each team will have the top three starters in the rotation going in the series with Sunday's finale televised nationally. On Friday, Dodgers ace left-hander Clayton Kershaw (5-1, 1.89 ERA) will oppose Padres right-hander Joe Musgrove (1-0, 10.80 ERA).Count on plenty of replays on the Petco Park video board from last October's NLDS when the Padres unceremoniously ousted the Dodgers in four games in the best-of-five series.How much did it mean to the Padres?Jake Cronenworth's game-winning two-run single -- which capped a five-run seventh that erased a 3-0 Dodger lead in Game 4 at Petco Park -- has been turned into a mural at the stadium. And it's not the only moment of that series that has been memorialized in the Padres' home.\"I know what winning that game, that series, meant to San Diego,\" native San Diegan Musgrove said. \"Our fans went crazy that night. It's going to be loud again this weekend. It's the Dodgers.\"",
        "Since ousting the Dodgers in the 2022 NLDS, the Padres signed free agents Xander Bogaerts, Nelson Cruz, Matt Carpenter and Seth Lugo and regained the services of Fernando Tatis Jr. -- adding to roster that already included Manny Machado, Juan Soto, Josh Hader, Yu Darvish and Musgrove. The Padres' payroll this season is $249 million -- more than $26 million higher than the Dodgers'.But the Dodgers are still the defending champs of the National League West and they were 14-5 against the Padres during the regular season. They have won the season series against the Padres for 12 straight seasons -- with a 144-73 edge during the run.And the 35-year-old Kershaw is pitching like the Kershaw of his prime. In addition to leading the National League in wins with an ERA under two, the three-time Cy Young Award winner has a 0.763 WHIP and a .175 opponents' batting average. Kershaw, who earlier this season reaching the 200-win plateau -- has given up 11 runs (eight earned) on 24 hits and five walks with 41 strikeouts in 38 innings.During his career, Kershaw is 23-9 with a 2.03 ERA in 45 starts against San Diego with 310 strikeouts in 292 innings. And he is 11-4 with a 1.87 ERA in 20 career starts at Petco Park.",
        "Musgrove has made two starts since his 2023 debut was delayed by a big toe fracture suffered in spring training. Musgrove is 0-6 lifetime against the Dodgers with a 4.04 ERA, a 1.286 WHIP and a .246 opponents' batting average in nine starts.Both teams enter the series hot. The Padres took two of three from Cincinnati earlier this week and have won nine of their last 13 games. The Dodgers ride a six-game winning streak thanks to consecutive sweeps of St. Louis and Philadelphia.The Dodgers beat the Phillies 10-6 on Wednesday off Max Muncy's walk-off grand slam. Muncy leads the major leagues with 12 home runs.\"You hate to say that one guy is sort of a key figure, but if I had to pick one guy who is going well, guys feed off of Max and what he's doing in the batter's box,\" Dodgers manager Dave Roberts said.--Field Level Media"
    ]
}