{
    "articleURL": "/femail/article-12058929/How-Princess-Charlottes-Coronation-concert-dress.html",
    "content": [
        "Princess Charlotte wore Self Portrait dress and cost from Amaia Lonodon READ MORE: Princess Charlotte took a protective role over Prince LouisPrincess Charlotte looked adorable as she sported a new £210 chiffon dress at the Coronation concert yesterday evening. ",
        "Charlotte, eight, seemed to be taking after her stylish mother, The Princess of Wales, as she donned a new stylish gown for the special occasion at Windsor Castle. The elegant cream coloured dress from Self-Portrait Kids - one of Kate's favourite brands - features a bold scallop-edged collar with a black trim.On the neckline there is a black ribbon, which is tied neatly into a bow, while the ruffled chiffon skirt is triple tiered. As it started getting later into the evening, Princess Charlotte wore a Razorbil Summer Coat from Amaia London, which retails for £140.",
        "The third-in-line to the throne has donned this particular coat on previous occasions, making it a wardrobe staple for the young royal. The coat is 100 per cent cotton and is handcrafted in Spain at a small family owned atelier.Princess Charlotte then paired these with white Siena shoes from Papouelli London, which cost £85.Self Portrait is a staple in Kate's wardrobe and she's chosen the brand, which is seen as an affordable designer label, for several engagements over the years. For her first joint engagement with Princess Anne in 2022, she wore  an elegant £400 Self Portrait oatmeal dress, which was cinched at the waist with a dainty belt and featured delicate floral details, to visit the Royal College of Obstetricians and Gynaecologists (RCOG) and the Royal College of Midwives (RCM).",
        "And on her Caribbean tour in March 2022, she wore a £350 pastel green Self Portrait dress for a school visit - her first engagement in The Bahamas.  The young royal had a great time at the Coronation concert yesterday, as she sung along to Katy Perry.The princess and her mother, The Princess of Wales, were spotted having fun, with Charlotte showing her vocal prowess, as she adorably sang along to the US megastar's monster hit, Roar. The music extravaganza was put on in honour of the crowning of King Charles and Queen Camilla at the official Coronation on May 6, and featured music sensations Lionel Richie and Katy Perry.The Princess of Wales said her daughter was 'tired' after making sure her little brother, Louis, five, behaved himself during the Coronation service on Saturday. ",
        "She took on a protective role, as she was seen sitting alongside her little brother Prince Louis, in a royal car with their parents after leaving the palace, and in the front row of the Abbey a short time later. The siblings held hands during the opening moments of the historic service.Charlotte and Louis arrived without their older brother Prince George, nine, who was a Page of Honour for his grandfather. They were immaculately behaved during the service, with Charlotte proving a reassuring presence to her younger brother, who couldn't help stifle a few yawns during the sacred service. ",
        "George, Charlotte and Louis were reunited after the service when they rode away from Westminster Abbey to Buckingham Palace in a carriage with their parents. "
    ]
}