{
    "articleURL": "/tvshowbiz/article-12044339/Sir-Michael-Caine-90-looks-dapper-date-night-wife-Shakira-76.html",
    "content": [
        "Sir Michael Caine looked dapper in a navy suit as he went for a swanky date night with his wife Shakira in Mayfair on Wednesday evening.  ",
        "The iconic actor, 90, has been reliant on support after undergoing surgery on his back last year.He was assisted in getting out of his taxi before using a rollator to help himself stand.Sir Michael and his wife Shakira, 76, looked as much the power couple as ever as they headed into Scott's Restaurant in the affluent London district. The Deadfall star looked handsome in a navy blazer over a light blue shirt and paired with tailored black trousers. ",
        "Meanwhile Shakira put on an age-defying display in a white blazer and top with contrasting black trousers. Her complexion was glowing as she added black heels for a night out in the capital.  The Academy Award-winning actor has been using a walking stick in public since 2018 after a nasty fall on ice left him with a broken ankle. Earlier this year, he explained: 'I have a spine problem which affects my leg, so I can't walk very well.'It comes after his wife Shakira confirmed last year that Michael had undergone a major operation at a London hospital.'He had a back operation quite recently,' she told the Daily Mail at the private view of Sir Michael Caine: The Personal Collection, at Bonhams auction house. 'He had spinal stenosis.'She described her husband as a 'strong man' as she confirmed that he was doing 'great' and was 'recovering' following the operation.",
        "The Guyanese former model added: 'The operation was fantastic. He'll be up and dancing again soon.'Spinal stenosis is a condition that narrows the spinal canal and can cause back and leg pain. Surgery is usually recommended only when non-surgical treatments have not been effective.In October 2021, Michael announced that he would likely retire from acting as he described his movie Best Sellers co-starring Aubrey Plaza as 'my last part, really'.",
        "He noted that he has limited mobility and added: 'There's not exactly scripts pouring in for a leading man that's 88, you know?'But it seems that the actor is yet to star in other projects, as he is set to take part in Czech action historical drama film Medieval, while it is believed he will reprise his role as Arthur Tressler in Now You See Me 3.Sir Michael, who began acting in 1953 when he took a job at a repertory company in West Sussex, said: 'I haven't worked for two years and I have a spine problem which affects my legs so I can't walk very well'.Further he pointed to the memoirs he has been publishing over the past several years - The Elephant In Hollywood in 2010 and Blowing The Bloody Doors Off in 2018.",
        "'And I also wrote a book, a couple of books which were published and were successful so I'm now not an actor - I'm a writer,' he said."
    ]
}