{
    "articleURL": "/wires/aap/article-12043333/King-Charles-great-affection-Australia-PM.html",
    "content": [
        "Prominent Indigenous Australians have joined with leaders across the Commonwealth urging King Charles III to formally apologise for the effects of colonisation.",
        "Ahead of the King's coronation, representatives from 12 countries have written a joint letter calling for reparations, acknowledging the impact of slavery, along with returning the remains of Indigenous people and cultural artefacts.Australian signatories of the letter include Nova Peris, the first Indigenous woman elected to federal parliament and co-chair of the Australian Republican Movement, fellow ARM co-chair Craig Foster and Victorian independent senator Lidia Thorpe.\"We stand united in engaging a process to right the wrongs of the past and to continue the process of decolonisation,\" the letter said.\"We, the undersigned, call on the British monarch King Charles III, on the date of his coronation being May 6, 2023, to acknowledge the horrific impacts on and legacy of genocide and colonisation of the Indigenous and enslaved peoples.\"Countries represented in the joint letter include New Zealand, the Bahamas, Canada, Papua New Guinea, Jamaica and Saint Lucia.The letter called for the King to start the conversation about \"slavery's enduring impact\" and \"immediately commit to starting discussions about reparations for the oppression of our peoples\".Senator Thorpe said the effects of British colonisation on Indigenous people were still being felt.\"The genocidal project that commenced in 1788 continues and neither the British Crown nor the Australian government have been held to account for the crimes they have committed,\" she said.",
        "\"This country has a new king. The parliament and the prime minister are subjugated to someone we didn't elect. We don't need a new king, we need a head of state chosen by the people.\"The letter coincides with Prime Minister Anthony Albanese confirming he had invited the monarch to visit Australia.Mr Albanese described his private audience with the King at Buckingham Palace on Tuesday, local time, as \"very warm\".While he is a republican, the prime minister said he was looking forward to being at the coronation ceremony on Saturday.Mr Albanese has been criticised by the Australian Monarchist League for being hypocritical about his attendance while trying to introduce a republic by stealth.Opposition Leader Peter Dutton said Mr Albanese shouldn't be \"swanning around at Buckingham Palace\" while giving interviews talking about the republic.\"You're there for that occasion and save your interviews for when you get back to Australia,\" Mr Dutton told 2GB radio.Asked if Australia would stick with the monarchy for now, Assistant Minister for the Republic Matt Thistlethwaite said the Indigenous voice referendum was the priority.\"But the government does have a longer term vision for Australia as a mature, independent nation with one of our own as our head of state,\" he told Sky News.",
        "Mr Albanese is among a contingent of Australians invited to the coronation, along with Governor-General David Hurley and state governors.The Australian delegation includes Matildas captain and soccer star Sam Kerr, singer Nick Cave, Aboriginal artist Jasmine Coe, comedian Adam Hills and London-based nurse Emily Regan.The King, who is the monarch of 14 overseas realms including Australia, will host a lunch for prime ministers and governors-general at Buckingham Palace and also attend a Commonwealth Heads of Government Meeting on Friday, the day before his crowning.On Sunday, Australia's Federation Guard will fire a national 21-gun salute from the Parliament House forecourt, followed by a Royal Australian Air Force fly-past."
    ]
}