{
    "articleURL": "/wires/afp/article-12050495/Iran-islanders-hope-cash-Gulfs-shifting-geopolitics.html",
    "content": [
        "Years of sanctions on Iran have taken their toll, but on the strategically located island of Qeshm, people can still find goods from major global brands otherwise out of reach.",
        "Off Iran's southern coast, some 150 kilometres (93 miles) from the United Arab Emirates' commercial hub of Dubai, Qeshm's merchants have been closely watching regional shifts since Tehran's landmark rapprochement with Saudi Arabia in March.\"The main thing in life is to have good relations with your neighbours,\" said 50-year-old retailer Mohammad Bazmandegan, who imports electric appliances from Dubai.He has been following the diplomatic developments since his government resumed ties with Riyadh after a seven-year freeze, a shift affecting the entire Gulf region.Along with Saudi Arabia, Tehran is also seeking to mend relations with other neighbours including the UAE and Bahrain, which also severed ties in 2016.\"If relations with our neighbours improve, they will also improve with other parts of the world,\" said another trader in Qeshm, Hassan Ebrahimi, 52.Located in the Strait of Hormuz, the Gulf's key maritime corridor, the island of 150,000 residents has long served trade with the Arabian Peninsula, South Asia and Africa's eastern coast -- but this has also made Qeshm sensitive to the vagaries of geopolitics.- 'Trust' in face of instability -For 40 years, Hassan Rostam has plied the waters between Qeshm and the UAE in his lenj, a traditional wooden ship synonymous with the ports of the Gulf.",
        "The weathered-faced captain loads vegetables in Iran's ports and returns from Dubai with \"dried fruits and other products\", he said.",
        "Despite restrictions following the diplomatic break in 2016, the tradition of business, traffic and trade in the Gulf has not stopped.The retailer Bazmandegan said that even if \"the market has become more unstable... relations of mutual trust, the fruits of years of cooperation\", allowed Iranian and Emirati traders to continue their exchanges.He imports fans, coffee makers and washing machines from Western manufacturers like Philips, Tefal and Toshiba.The goods arrive \"thanks to our Emirati intermediaries\", Bazmandegan said, adding that \"90 percent of the products come from Dubai\".But the international sanctions and diplomatic ruptures have meant Qeshm's traders have struggled in recent years, pushing some of them into bankruptcy.\"One competitor died after a heart attack due to daily price changes,\" Bazmandegan said.- Tourism on the horizon -Nooradin Tata, who owns a guesthouse in central Qeshm, said the personal lives of islanders have also suffered amid the diplomatic troubles.Hundreds of thousands of Iranians live in the UAE and Tata said people from Qeshm with family abroad are \"stressed\" by the onerous administrative and logistical hurdles to \"bringing or going to visit family members\" living in Gulf countries.",
        "With improving relations, Iran is expected to relaunch flights to Gulf countries. Iranian authorities have already said three weekly flights will operate on the Riyadh-Tehran route.Tehran also hopes to benefit from renewed development of free trade zones, initiated some three decades ago to attract foreign investors and tourists to Iran's south.",
        "Along with the small, luxurious island of Kish and the Indian Ocean port of Chabahar, Qeshm is one of the main areas boasting tax exemptions and other special import and export regulations.The island hopes these advantages will attract Iranian tourists to its shopping centres, offering foreign products from chocolates to designer clothes.\"The stores no longer offer as many varieties and are less frequented\" since 2016, Tata said, but like many islanders, he hopes improving ties across the region would help put Qeshm on the map."
    ]
}