{
    "articleURL": "/news/article-12049325/Tom-Brady-checks-massive-home-Brentwood-California.html",
    "content": [
        "Tom Brady was seen checking out a mansion in Brentwood, CaliforniaThe massive house was still under construction, and had a pool in the yardIt remains unclear if Brady has any intentions of moving to California Tom Brady was seen checking out a sprawling home in Brentwood, California, sparking speculation he might be relocating to the west coast following his retirement from football and divorce from wife.",
        "Brady, 45, was photographed strolling the grounds of a mansion that was still fenced off and under construction.The home had two wings flanking a large central structure, and an in-ground pool could be seen stretched across a backyard that was still covered in dirt from construction. Brady was at the house alongside his lifelong friend Kevin Brady - no relation - as they checked out the property. The two exchanged a hug before parting ways.It comes days after Brady's ex-wife, supermodel Gisele Bundchen, was seen strutting the red carpet at the Met Gala in New York City— the first time either appeared at the ritzy event not on each other's arm.",
        "It remains unclear why Brady was viewing the home. Though he already has a home in Florida, he also has connections to California.He has had his eye on Hollywood since 2020 when he launched his media company, 199 Productions, which will produce television shows, documentaries and feature-length films.His clothing brand TB12 also has some stores in California and Hollywood.Brady was also born in San Mateo, California. The future Hall of Famer reportedly rented a $70,000-per-month apartment in Surfside, California, after his divorce from Bundchen was finalized last fall, according to Page Six.The pair split after 13 years of marriage as Brady wavered on his decision to leave professional football — initially he announced his retirement, then played another season, before finally retiring this year after he and his wife separated.",
        "That it had been an emotional and tumultuous 2022-23 season for Brady would be an understatement. On the field, Brady suffered the first losing season of his 23-year-long NFL career as his Tampa Bay Buccaneers squad fell to an 8-9 record.",
        "The seven-time Super Bowl winner has a broadcaster job with Fox lined up and waiting for him but he recently revealed that he will wait to transition into the booth until the fall of 2024. In other words: NFL fans will go an entire season without Brady in 2023 for the first time this millennium. Fox Sports said Brady's on-air partner will be longtime announcer Kevin Burkhardt. The five-time Super Bowl MVP will also work as a 'brand ambassador' for Fox, focusing on 'client and promotional initiatives.'The New York Post reported the deal is for 10 years and will pay Brady a record-breaking $375 million - the largest contract in sportscasting history.   ",
        "Gisele and Tom Brady announced in October 2022 they had decided 'amicably' to divorce and that they did so after 'much consideration.''We are blessed with beautiful and wonderful children who will continue to be the center of our world in every way. We will continue to work together as parents to always ensure they receive the love and attention they deserve,' the Super Bowl champ wrote on Instagram.",
        "In her own statement, the runway maven also put an emphasis on their children's wellbeing and that they've both vowed to 'give them the love, care and attention they greatly deserve.'She also expressed gratitude for the time her and Tom spent together as a married couple.'The decision to end a marriage is never easy but we have grown apart and while it is, of course, difficult to go through something like this, I feel blessed for the time we had together and only wish the best for Tom always,' Gisele concluded."
    ]
}