{
    "articleURL": "/wires/ap/article-12060777/Barbara-Kingsolver-Hernan-Diaz-share-fiction-Pulitzer-Prize.html",
    "content": [
        "NEW YORK (AP) - The Pulitzer Prize for fiction was awarded Monday to two class-conscious novels: \"Demon Copperhead,\" Barbara Kingsolver´s modern recasting of the Dickens classic \"David Copperfield,\" and Hernan Diaz´s \"Trust,\" an innovative narrative of wealth and deceit set in 1920s New York.",
        "It´s the first time the Pulitzers have awarded two fiction books in the category´s 105-year history. Officials have declined to name a fiction winner several times, mostly recently in 2012.\"Trust\" won the Kirkus Prize for fiction, was on the long list for the Booker Prize and was named by The New York Times and The Washington Post as one of the year´s best books. Kingsolver´s novel, the story of a young boy´s struggles and persistence as he grows up in southern Appalachia, was chosen by Oprah Winfrey last fall for her book club and named by The Washington Post as a top release of 2022.The 68-year-old Kingsolver has long woven social issues into her novels, which also include \"The Bean Trees\" and the Winfrey choice \"The Poisonwood Bible,\" and helped establish the PEN/Bellwether Prize for Socially Engaged Fiction. Speaking by phone Monday, the author said she regards the Pulitzer as an affirmation not just of her novel, but of a misunderstood and overlooked part of the country. Kingsolver is a longtime resident of Appalachia who currently lives on a farm in southwestern Virginia, and set \"Demon Copperhead\" close by.\"I wrote this book for my people because we are so invisible to the rest of the world and so persistently misrepresented,\" Kingsolver said. \"I couldn´t be happier (about the Pulitzer) for this reason.",
        "Diaz, also interviewed by phone, sees his book and Kingsolver's novel approaching a similar subject, class, from different perspectives. \"Demon Copperhead\" dramatizes life on the lower end of the extreme divide between rich and poor. \"Trust,\" which begins with a novel-within-the novel about a financial tycoon and his daughter, explores how such a world is created.",
        "\"I wanted to talk about the process itself of the accumulation of wealth,\" said Diaz, 49, whose debut novel \"In the Distance\" was a Pulitzer finalist. \"I wanted to deal with class and money, and how money is really made.\"Several works with racial themes were honored Monday. Beverly Gage´s \"G-Man,\" her widely acclaimed book on longtime FBI leader J. Edgar Hoover, was given the Pulitzer for biography after previously receiving the Bancroft Prize, the Los Angeles Times Book Prize and the Barbara and David Zalaznick Book Prize from the New-York Historical Society. It was the first major Hoover biography in decades and was cited by Pulitzer judges for its \"deeply researched and nuanced look\" at Hoover's \"monumental achievements and crippling flaws,\" including his persecution of the Rev. Martin Luther King Jr.\"His Name Is George Floyd: One Man´s Life and the Struggle for Racial Justice,\" by Robert Samuels and Toluse Olorunnipa, won for general nonfiction, and Jefferson Cowie´s \"Freedom´s Dominion: A Saga of White Resistance to Federal Power\" was honored for history. The Pulitzer for music was given to Rhiannon Giddens and Michael Abels for the opera \"Omar,\" about an Islamic scholar captured and sold into slavery.",
        "Sanaz Toossi´s play \"English\" won for drama. The Pulitzer board hailed \"English\" as \"a quietly powerful play about four Iranian adults preparing for an English language exam in a storefront school near Tehran, where family separations and travel restrictions drive them to learn a new language that may alter their identities and also represent a new life.\"Finalists included \"On Sugarland,\" by Aleshea Harris, \"an ambitious drama inspired by Sophocles of a community shaped by the trauma of a nameless war\" and \"The Far Country,\" by Lloyd Suh, \"an account of emigrants who traveled from China to San Francisco and suffered in the shadows of a strange new world.\"The one-act play \"English\" premiered off-Broadway at Atlantic Theater Company. Toossi is an Iranian American playwright from Orange County, California, who graduated with a master´s from New York University. Her other works include \"Wish You Were Here.\"The Pulitzer for memoir or autobiography was given to Hua Hsu´s \"Stay True,\" which judges praised as \"an elegant and poignant coming of age account that considers intense, youthful friendships but also random violence.\" One of the country´s most highly regarded poets, Carl Phillips, won in poetry for \"Then the War: And Selected Poems, 2007-2020.\"__ AP Entertainment Writer Mark Kennedy contributed to this report."
    ]
}