{
    "articleURL": "/wires/ap/article-12057613/Trump-rejects-chance-testify-New-York-civil-trial.html",
    "content": [
        "NEW YORK (AP) - Former President Donald Trump rejected his last chance Sunday to testify at a civil trial where a longtime advice columnist has accused him of raping her in a luxury department store dressing room in 1996.",
        "Trump, a Republican candidate for president in 2024, was given until 5 p.m. Sunday by U.S. District Judge Lewis A. Kaplan to file a request to testify. Nothing was filed.It was not a surprise. Trump has not shown up once during the two-week Manhattan trial where writer E. Jean Carroll testified for several days, repeating claims she first made publicly in a 2019 memoir. She is seeking compensatory and punitive damages totaling millions of dollars.The jury has also watched lengthy excerpts from an October videotaped deposition in which Trump vehemently denied raping Carroll or ever really knowing her.Without Trump's testimony, lawyers were scheduled to make closing arguments Monday, with deliberations likely to begin on Tuesday.After plaintiffs rested their case Thursday, Trump attorney Joe Tacopina immediately rested the defense case as well without calling any witnesses. He did not request additional time for Trump to decide to testify. Tacopina declined in an email to comment after the deadline passed Sunday.",
        "On Thursday, Kaplan had given Trump extra time to change his mind and request to testify, though the judge did not promise he would grant such a request to reopen the defense case so Trump could take the stand.At the time, Kaplan noted that he'd heard about news reports Thursday in which Trump told reporters while visiting his golf course in Doonbeg, Ireland, that he would \"probably attend\" the trial. Trump also criticized Kaplan, a Bill Clinton appointee, as an \"extremely hostile\" and \"rough judge\" who \"doesn't like me very much.\"",
        "On the witness stand, Carroll, 79, testified that Trump, 76, raped her in spring 1996 after they met at the entrance of the midtown Manhattan department store Bergdorf Goodman.She said the encounter began as a fun and flirtatious outing as Trump coaxed her into helping him shop for a gift for another woman. She said they ended up in the store's desolate lingerie section, where they teased each other to try on a see-through bodysuit.As Carroll recalled it, laughter accompanied them into a dressing room where Trump became violent, slamming her up against a wall, pulling aside her tights and raping her before she kneed him and fled the store.In his deposition, Trump said Carroll made it up. He called it \"a false, disgusting lie\" delivered by a \"nut job\" who was trying to stoke sales of her book.He also repeated comments he made in statements that she was not his \"type.\"\"She´s not my type and that´s 100% true,\" he said.And he repeated his claims in a 2005 \"Access Hollywood\" video in which he bragged that men who are celebrities can grab women by the genitals without asking.\"Historically that´s true with stars,\" he said.Carroll sued Trump in November, minutes after New York state enacted a law allowing adult sexual assault victims to sue others even if the attacks occurred decades earlier.",
        "Carroll's attorney, Roberta Kaplan, wrote a letter to the judge Sunday to complain that Trump still has not removed April 26 posts on his social media network in which he called Carroll's allegations \"a made up SCAM.\" And she noted that he repeated disparaging remarks about the trial three days ago in Ireland.After the April 26 postings on Truth Social, Judge Kaplan, who is not related to Carroll's lawyer, said Trump's comments were \"highly inappropriate\" and expressed concern that Trump was trying to communicate to the jury \"about stuff that has no business being spoken about.\"The Associated Press typically does not name people who say they have been sexually assaulted unless they come forward publicly, as Carroll has done."
    ]
}