{
    "articleURL": "/wires/ap/article-12060189/Ex-girlfriend-Tiger-Woods-used-lawyer-break-me.html",
    "content": [
        "Tiger Woods' ex-girlfriend said in an August 2017 email her only concern about signing a nondisclosure agreement was losing her job in Woods' restaurant if the relationship ended and having control of her future in the business.",
        "\"I don't have any problems with what's in the document because I wouldn't go public or use anything I know to hurt him or the kids,\" Erica Herman wrote in the email to the CFO of Tiger Woods Ventures.\"But with my whole life in his hands now I would want to have some control over my future in the business. If something happened 5-10 years down the road I don't want to be in my 40's heartbroken and jobless.\"The email exchange was part of documents filed Sunday evening in advance of a Tuesday hearing. Woods' attorneys are expected to ask Circuit Judge Elizabeth Metzger to halt Herman´s lawsuit against their billionaire client. They say the former couple´s NDA requires all disputes be settled privately by an arbitrator, not in court.Herman has filed a lawsuit against Woods, accusing golf's biggest star of beginning their sexual relationship when she was his employee and threatening to fire her if she didn't sign the NDA she now wants voided.Her email to Chris Hubman, the CFO of Woods' company, was sent Aug. 7, 2017.",
        "\"In my mind, your employment by The Woods Jupiter and your personal relationship with TW are two separate items,\" Hubman wrote back the next day. \"I don´t think the end of one automatically impacts the other ... although I admit it could be complicated. It will most likely depend on the terms, condition or reason for the relationship ending.",
        "\"The NDA doesn´t address the terms of your TWJ employment ... only the dissemination and control of information that you become privy to as a result of your personal and professional relationship with TW.\"She signed the NDA on Aug. 9, 2017, according to documents.Herman, in court documents filed late Friday, also accused Woods of having his lawyer break up with her at an airport last October after falsely telling her they were going on a weekend trip to the Bahamas. She says the lawyer then evicted her from Woods' $54 million mansion north of Palm Beach and tried to get her to sign another NDA, which she refused.Herman, who managed Woods' Palm Beach County restaurant before and during the first years of their romantic relationship, argues the NDA is unenforceable under a new federal law that says such contracts can be voided when sexual abuse or sexual harassment occurred. Her attorney, Benjamin Hodas, contends that Woods' alleged threat to fire her if she didn't sign the contract was harassment.\"A boss imposing different work conditions on his employee because of their sexual relationship is sexual harassment,\" Hodas said.Herman, 39, is separately suing the trust that owns Woods´ mansion for $30 million, saying he verbally promised in 2017 she could live there for at least 11 years, but kicked her out after five.",
        "Woods' attorney, J.B. Murray, denies that the 47-year-old Woods ever sexually assaulted or harassed Herman, calling her accusations in court documents, \"utterly meritless.\"Neither Hodas nor Murray responded to emails and phone calls seeking comment.It is unknown if Woods will attend Tuesday's hearing. He had ankle surgery last month stemming from his February 2021 car crash in Los Angeles and is likely to miss the rest of the major championships this year.In Herman's lawsuit against Woods, she wants Judge Metzger to either void the NDA or at least give her guidance about what she can say publicly. For example, can she discuss events that happened before their agreement or after their breakup? What about information she learned about Woods from others? She is also arguing the contract covers only her work relationship with Woods, not their personal matters.In her unlawful eviction lawsuit against the trust, she is basing her $30 million claim on how much it would cost to rent a property like Woods´ mansion for the six years of residence she was allegedly denied.When Hodas filed Herman's lawsuit against the trust in October, he checked a box on a standardized form saying the case did not involve sexual abuse. In Herman´s March lawsuit against Woods, Hodas checked the box saying that case does involve abuse. Hodas has not explained the apparent discrepancy.",
        "Herman says in her court filings that their romantic relationship began in 2015 and that in late 2016 she moved into Woods' nearly 30,000-square-foot (2,800-square-meter) mansion in the ritzy Hobe Sound community.Woods, in his court documents, says their romantic relationship began in 2017, shortly before she moved in with him that August - about the time the NDA was signed. In March 2017, Woods had placed the mansion into the Jupiter Island Irrevocable Homestead Trust, an entity he created that has only himself and his two children as beneficiaries.Forbes Magazine estimates Woods' net worth at $1.1 billion.They were first seen publicly as a couple at the Presidents Cup in late September 2017, and Herman had been a steady presence at the larger tournaments and events, such as the 2019 Masters. She was also with Woods at the White House in 2019 when then-President Donald Trump awarded him the Presidential Medal of Freedom.Herman says Woods pressured her to quit her job managing his restaurant in 2020, saying he wanted her to spend more time taking care of him and his children.In another email, Herman wrote on Feb. 17, 2020, that she had spoken with Woods and \"we realized it´s best if I remove myself from the daily operations of the restaurant.\"",
        "\"Our lives have evolved and after 4 years I´ve realized I´m spread to(o) thin and I don´t have the time or the desire to dedicate to the restaurant,\" Herman wrote to Hubman.When Woods' lawyers returned her personal belongings, they kept $40,000 in cash, \"making scurrilous and defamatory allegations\" about how she obtained it, she alleges.Woods and his former wife, Elin Nordegren, divorced in 2010, some nine months after he was caught in a series of extramarital affairs that cost him blue-chip corporate sponsors and tarnished an image that had been largely impeccable.___AP Golf Writer Doug Ferguson contributed to this report.___This version corrects that Woods received the Presidential Medal of Freedom in 2019, not 2018."
    ]
}