{
    "articleURL": "/tvshowbiz/article-12039791/Imogen-Anthony-lashes-critics-Kyle-Sandilands-wedding-post.html",
    "content": [
        "Imogen Anthony has lashed out at her critics after she drew backlash for her petty response to her ex-partner Kyle Sandilands' extravagant wedding to Tegan Kynaston.",
        "The model, 32, who dated Sandilands for eight years until 2019, told her haters 'I'm not your f**king punching bag' and urged critics to think before they speak.She expressed her frustration on Instagram on Wednesday, warning she would no longer tolerate her kindness and understanding being taken for granted.'No more, if you keep assuming you know a situation that I guarantee you have no idea about, then the culling will begin,' she wrote.Anthony went on to say she wouldn't think twice about blocking followers.",
        "'I don't care for follower numbers. I care for genuine people who see things below surface level and don't have a basic mindset,' she wrote.Her comments came after an unidentified troll sent her a private message apologising for having been rude to her previously.The sender expressed remorse for their behaviour, admitting they were going through personal issues and had reacted impulsively to Anthony's post.'I am so incredibly sorry I was rude to you on your post... I am just so very sorry for being a troll. If you knew me, I am just not that person on at all,' they said.",
        "It comes after Anthony reignited her long-running feud with Kynaston on Monday by sharing a video on Instagram of herself sipping on a large cocktail with her new partner in the background, alongside a lengthy caption in which she spoke of not 'settling' for a bad relationship.",
        "'You'll never know heaven 'till you've been to hell,' she wrote.'Please don't assume you know anything when it's taken this long to overcome. People are exactly what you think they are, conniving, vindictive and manipulative.'",
        "Anthony went on to emphasise the importance of living life on her own terms, before saying she harbours no hard feelings towards anyone.'My life is about making it a special one, living under zero control of others, doing and being as I please with no ill intent,' she said.Anthony also seemingly hinted at the lack of appreciation she received from Sandilands during their former relationship, writing: 'It's not my fault if someone didn't know how to treat or appreciate something while they had it.'",
        "She went on to express her desire to live life for herself and not to settle for anything less than what she feels she deserves. Her post concluded with Anthony asking others to 'leave her out' of the situation, stating: 'If someone else is willing to settle, that's on them. I ain't. So leave me out of it.'While Anthony's message did not specifically mention Sandilands or Kynaston, the timing of her post strongly suggested it was in reference to the newlyweds.",
        "She had earlier tried to steal the spotlight on the couple's wedding day by sharing a series of racy photos from her 'honeymoon' in Thailand with her new partner. ",
        "She uploaded the snaps on the very day Sandilands and Kynaston said 'I do' in a ceremony rumoured to have cost the KIIS FM host a cool $1million. In one of the photos, the words 'H. Moon' were spelled out in rose petals; however, it is unclear whether Anthony has actually legally married her new man."
    ]
}