{
    "articleURL": "/news/article-12040297/Millner-Darwin-student-pool-blood-home-invasion.html",
    "content": [
        "Student allegedly attacked by home invaderIs unlikely to survive significant injuriesMan, 29, currently in custody in Darwin A young international student is fighting for life after he was allegedly attacked and left for dead during a violent home invasion.",
        "Shocked flatmates found the Bangladeshi student, 23, in his bed surrounded by a pool of blood at their home in the Darwin suburb of Millner around 4.30am on Wednesday.The intruder allegedly fled the home armed with a fire extinguisher.The student was rushed to Royal Darwin Hospital in a critical condition, where doctors have warned he isn't expected to survive his 'significant' injuries. ",
        "'With that sort of prognosis he's likely to die within a day,' an unnamed surgeon told the NT News.'There was no point in doing anything except inserting an intracranial pressure monitor and giving him palliative care.'A post shared to a community Facebook page also claimed doctors have asked the students' friends to contact his parents as he's unlikely to survive his injuries.The student had been studying at Charles Darwin University.'When we hear about incidences of violence that involves our students it impacts the whole CDU community,' vice-Chancellor Professor Scott Bowman said in a statement.'Our thoughts and prayers are with family and friends at this very difficult time.'NT police minister Kate Worden added: 'Absolutely my heart breaks for this student and also their family, and for the CDU family.' ",
        "Northern Territory Police were called to the Trower Road home in Millner shortly after the alleged home invasion.",
        "A man, 29, was arrested in the area a short time later and remains in custody. No charges have yet been laid.The Millner home remained a crime scene on Wednesday as forensic officers scoured for evidence. Anyone who saw anything suspicious area in the area at the time or who may have CCTV is urged to contact police on on 131 444."
    ]
}