{
    "articleURL": "/sport/afl/article-12049209/Eddie-McGuire-blasts-AFL-blunder-saw-league-miss-golden-opportunity-NSW.html",
    "content": [
        " While the cat's away the Pies could have played AFL simply failed to see the opportunity 110,000 fans could have turned upControversial and colourful AFL powerbroker Eddie McGuire has come out swinging, claiming the league missed a golden opportunity to 'own Sydney' for a weekend - and he makes a very solid point.",
        "The outspoken former Collingwood president slammed the AFL for not scheduling a game in Sydney on the very weekend all NRL teams are up north at Magic Round in Brisbane.The harbour city isn't even hosting a Super Rugby game from Friday to Sunday, leaving the door wide open for Aussie Rules to be the only game in town.  'This was an opportunity to get a situation where the AFL owned NSW,' he said on Wednesday night's Footy Classified on Nine.'Instead of it being Collingwood vs Sydney at the MCG, if it was Sydney vs Collingwood at what was ANZ (now Accor Stadium), that would have been sensational.'  ",
        "Instead, there are zero AFL games at all in NSW on the NRL's 'away round' in Queensland.Apart from the Sydney Swans being in Victoria, the GWS Giants are playing in Canberra against the Western Bulldogs. 'I know the fixtures come in late but you've got to be nimble enough when the opportunity comes,' McGuire added.'We should have been there and owning Sydney this weekend.'Victorian footy matches where all the stars align, such as top-of-the-table clashes, and finals, can top 100,000 in attendance.The biggest crowd ever to gather for an AFL match in Sydney is 72,393 when, coincidentally, Collingwood came to Sydney and played the Swans at Stadium Australia in 2003.",
        "The simple maths supporting McGuire's theory and call for this weekend suggests topping 100,000 in NSW was a very real chance of happening.One third of Australia's 26million population lives in NSW, with 5.2million of them based in Sydney.",
        "As well as the NRL being completely away, the other big drawcard for crowds, horse racing, won't be held in Sydney due to a rare move to Gosford on Saturday.So the crowd at Accor, should a game have been played there, could have topped 85,000.And as a double-header, the Giants could have played next door at Giant Stadium in front of 25,000.McGuire's comments come hot on the heels of Swans boss John Longmire complaining that Aussie Rules is struggling badly to gain a foothold in NSW, which he branded 'the most competitive sporting market in the world'.The premiership-winning coach pointed out that while one-third of the country's population resides in the state, it only produces five per cent of AFL players.  "
    ]
}