{
    "articleURL": "/femail/article-12041321/Gardeners-warned-remain-vigilant-following-UK-sightings-potentially-deadly-invasive-insects.html",
    "content": [
        "Asian Hornets are a non-native, invasive predatory species which kill honeybeesREAD MORE: Warning as Asian hornet sighted in Kent for the first time in FOUR years amid fears 2023 is on track to be the worst-ever for the invasive species Britons have been warned to 'remain vigilant' after sightings of a potentially deadly invasive species in the country.",
        "Asian Hornets have been spotted in Northumberland, Kent and Dorset, according to the British Pest Control Association (BPCA).On April 5, one insect was found in a vegetable delivery in Northumberland around 20 miles north of Newcastle upon Tyne.The National Bee Unit reported that it was 'a single hornet incursion' and 'follow up activities' would be taking place with the producer/distributor/seller.On April 10, a hornet was spotted on the deck of a ferry from Poole to Cherbourg.",
        "As a result, traps have been set in Poole and Hamworthy by the British Beekeeper's Association, to capture any that may be in the area.The third sighting took place on April 13, in Folkestone, but the insect flew off before it could be captured. According to the British Beekeeper's Association, details from the report 'suggest this was a single hornet incursion'. Monitoring traps have been deployed in the area, while volunteer Asian hornet teams and beekeepers have been asked to maintain vigilance.Now the BPCA has urged people to take action if they believe they may have seen one of the insects.    Natalie Bungay, BPCA Technical Manager, said: 'If you're not sure what that stripy flying insect buzzing around your garden is, get in touch with a BPCA member who will have the technical knowledge to identify and deal with any infestation.  ",
        "'Anyone who has concerns about hornet activity should contact a pest professional such as a BPCA member, who will have the technical knowledge to spot the difference between an Asian hornet and a native insect.'The invasive bug made its first appearance in the UK in 2016, and since then there have been reports of them every year.The hornets are very defensive over their nests and can sting in 'mass attacks' if they feel threatened, making them a health risk to those who suffer from anaphylaxis.",
        "The Asian hornet (Vespa velutina) is an invasive species in Britain and is a predator of bees.Asian hornets were accidentally brought to France in 2004, probably in an imported shipment of goods.They have been seen in Britain since 2016 and are an invasive predatory species that could have a devastating impact on British wildlife. They’re slightly smaller than our native hornets and have a dark abdomen and a fourth yellow segment. Another way to tell the difference is that Asian hornets have bright yellow tips to the legs while our native hornets have dark legs. Asian hornets eat honeybees and if you spot one, it should be reported to the Department for Environment, Food and Rural Affairs (Defra) Non-native Species Secretariat immediately. Source: British Pest Control Association (BPCA)",
        "Kent beekeeper Sue Kittle, from Dover and District Beekeeping Association, said: 'This is an invasive species that can attack and eat our honey bees. It can change the whole nature of the bee hives here.'Sue, who has been a beekeeper for over 14 years, added: 'We need to track them down and find out if this sighting is the beginning of a nest.'She also noted that people should exercise caution if they believe they've spotted an Asian Hornet nest. 'These hornets are very defensive of their hives and can do what is called a mass attack,' she explained. 'You should not approach their nests.' In 2022, there were two sightings in Essex and Suffolk, and in 2021, two were spotted in Berkshire and Hampshire.A spokesperson said: 'The British Beekeepers Association is asking everyone to look out for Asian hornets.'Asian hornet team members in the Kent area have been notified of the positive identification of an Asian hornet in the Folkestone area.'Vespa velutina is an alien species that could decimate our pollinators if it gets established in this country.'Honeybees are a particular favourite of the Asian hornet but all pollinators are at risk from this invasive species.'The public can help by downloading the Asian hornet watch app now as it has photos of Asian hornet and other insects which are commonly confused with the Asian hornet.'",
        "The species has already become established in the Channel Islands.Last month, a nest with a queen hornet, ready to lay eggs, was found on Friday in Jersey on the Channel Islands. Since then another 22 nests have been discovered by frightened islanders, prompting fears that 2023 could be the worst year for sighting's in the UK on record. "
    ]
}