{
    "articleURL": "/wires/reuters/article-12048621/Motor-racing-No-air-cleared-Verstappen-says-Russell.html",
    "content": [
        "MIAMI, May 4 (Reuters) - George Russell said he has no need to clear the air with Red Bull's Max Verstappen after their Azerbaijan Grand Prix sprint clash, or do anything different in the way he races the Formula One champion.",
        "Asked by reporters ahead of the Miami Grand Prix on Thursday, the Mercedes driver said he had not discussed the incident in Baku with Verstappen.\"I´ll continue racing the same way as I always would. A lot's been said about that coming together but from my side, it was pretty straightforward. I went for a move, got the move done and moved on,\" he said.\"Obviously he was pretty upset about it but that´s racing and these things happen. We´re all here to fight so that´s what F1's about.\"From my side, there´s no air to be cleared. I´ll welcome and say hello to him if he passes by and I´m sure we´ll shake hands when we bump into each other,\" he continued.\"For me, it´s history now and it´s behind us. My view of him is still the same. I still respect him and still think he´s a great driver. Obviously things are always said in the heat of the moment but, yeah, we move on.\"Verstappen swore at Russell after the first lap clash in the Saturday sprint ripped a hole in the side of the Red Bull.The Dutch driver still finished third and went on to take second place in Sunday's main grand prix, leaving Baku six points clear of his Mexican team mate and race winner Sergio Perez in the standings.",
        "Verstappen sounded relaxed about the situation on Thursday, even making light of it when asked how things were between the two of them.\"Terrible,\" he said. \"No, of course not. That's what people maybe like to hear but no, it´s absolutely fine.\"Verstappen won in Miami last year when the Hard Rock Stadium hosted a race for the first time. Red Bull have so far dominated the season with four wins from four races, three one-two finishes.Mercedes are third overall, behind Aston Martin, with Russell yet to stand on the podium in 2023. (Reporting by Alan Baldwin in London, editing by Pritha Sarkar)"
    ]
}