{
    "articleURL": "/news/article-12053259/Police-DNA-test-CONFIRMS-Texas-woman-53-baby-abducted-minute-babysitter-51-years-ago.html",
    "content": [
        "DNA test has confirmed the identity of Texan woman Melissa Highsmith, now 53, who was reunited with her family last year after being abducted as a toddlerShe was taken from her parents' Fort Worth home in 1971 by a babysitter when she was just 22 months oldHer family eventually found her through her children's DNA sampled which were shared on genealogy website 23andMe A DNA test has confirmed the identity of a Texan woman who was reunited with her family last year after being abducted as a toddler 51 years ago. ",
        "Melissa Highsmith, now 53, was taken from her parents' Fort Worth home in 1971 by a babysitter when she was just 22 months old She was miraculously reunited with her biological parents - Jeffrie Higshmith, 72; Alta Alpantenco, 73 and siblings - Rebecca Del Bosque, 48; Vicitoria Highsmith, 47; Sharon Highsmith, 45 and Jeffrey Highsmith, 42 - on November 26. Fort Worth Police Department announced on Thursday it had completed official DNA testing which confirmed Melissa's identity as the missing child. For more than half a century her parents and siblings had been looking around the country for her - but she had been living just ten minutes away. They eventually found her through her children's DNA samples which were shared on genealogy website 23andMe. ",
        "Police issued a statement to confirm Melissa's identity after spending months working to complete their DNA testing.'It is our hope that this test result will offer additional closure for the Highsmith family,' it read. Melissa, who had a horrific childhood and suffered sexual abuse by her stepfather, has said she has no doubt in her mind that the person she called 'mama' was the same person who abducted her.'Before I met my new family I reached out to the mother that I thought raised me and asked her if there was something she needed to tell me,' she previously told Dailymail.com ",
        "'She told me she had purchased me on the street for $500.'I was shocked. My head was spinning. I didn't sleep. She never told me,' Melissa said, 'but she always told me that she had something to tell me that she had been wanting to tell me for a long time that is when I told her I already knew.'According to Melissa's family members the woman who posed as Melissa's mother was identified as Patricia 'Sugar' Lewis, who now lives in Missouri.The time spent away from her family is precious time she will never get back, a lost childhood, time away from her parents and siblings, but Melissa said 'she doesn't want to focus on the anger.''I am still angry but I am going to focus on the happiness that is to come not the pain that I left,' she said. 'God got this done and I have to focus on going forward.'Melissa’s brother Jeff, 42, explained that when she went missing on August 23, 1971 his mother was a single mom and needed help with childcare while she worked as a waitress.After putting up an advertisement in the local newspaper he said a woman who identified herself as Ruth Johnson, responded.He said the woman agreed to meet his mother at the restaurant she worked at, but never showed up.",
        "Then the potential babysitter called up again insisting she was right for the job.",
        "Melissa's birth mother told Fox4 in 2019 what the babysitter had told her before snatching her child.'She said, you know, I really love kids and I've got this huge backyard and the kids love to play out there, and I was desperate, I needed a babysitter because I was supporting myself,' she said.Melissa had been in the care of her mother's roommate, with whom she was living in the Spanish Gate Apartments on East Seminary Drive in Fort Worth, who handed Melissa over to the unknown babysitter.It would be the last time anyone would ever see baby Melissa again on that hot summer day in August 1971.After baby Melissa was reported missing, the roommate told the authorities that the mysterious woman who picked up the infant was wearing white gloves and a bonnet on her head.The next five decades would be one of agony for the Highsmith family.'My mom did the best she could with the limited resources she had. She couldn't risk getting fired. So, she trusted the person who said they'd care for her child,' Sharon Highsmith, Melissa's sister said.'For 50 years, my mom has lived with the guilt of losing Melissa. She's also lived with community and nationwide accusations that she hurt or killed her own baby.",
        "'I'm so glad we have Melissa back. I'm also grateful we have vindication for my mom.'The criminal statute of limitations expired 20 years ago when Melissa was 18, but her family is now determined to change the laws.Fort Worth Police said they are still looking into Melissa's case and have urged anyone with information to come forward. Melissa added: 'I don't want her to go to jail I just want her to be held accountable and to say, 'I'm sorry.'But, younger sibling Rebecca Del Bosque feels differently and said: 'She stole a sibling from us we never knew, a child from her parents, there is no justice for us at all.'She added: 'We need to find out if her siblings were kidnapped too. Right now we have no idea.'As her family spent decades looking for their family member, Melissa whose name was changed to Melanie was barely surviving.She shared with DailyMail.com some of the hardship and horror she endured at the hands of the woman she thought was her mother and her stepfather - having no idea she was adopted until last year- and had this giant family searching for her.'I thought she was my real mom but I thought she regretted having me. There was no closeness... no love. She told me all of my life I was brain damaged and I was mentally retarded,' she said.",
        "Melissa said when she was a child her mother had put her in special classes despite her teachers telling her that she did not belong in them. She said that her two other siblings, a younger and older brother, had lived with her too. She recalled her older brother, who she said she wasn't close to, getting treated differently than she and her younger brother.",
        "'My dad was very abusive to us. My little brother ended up moving in with my grandma and then it was just me and my stepfather,' she said. 'My mother was emotionally abusive and my stepfather was sexually abusive.'She told DailyMail.com that she never got pregnant during the years of abuse and said when she was 15 years old she ran away from home.'I tried to runaway when I was 14, but it was unsuccessful. I didn't have nowhere to go so it was easy for them to track me but the second time I had somewhere to go. When they found me the police came to get me and I told them I wasn't going back so I never went back.'She and her high school sweetheart, she described as her 'first love,' married and the pair endured a rough time and were living on and off the streets.",
        "Texas records show she was arrested at least four times and charged with misdemeanors related to prostitution, The Washington Post reported.'I did things I didn't want to do,' she told DailyMail.com 'but I supported me and my husband.'By the time she was 19, she was a mother of three but, said her children were taken away from her and put up for adoption- two boys and a girl. She said she had her tubes tied after that and was no longer able to have children.After leaving her first husband she started working in a host of different jobs from working at a bar, to a few fast food joints, and waitressing to support herself.She married again. Her husband, she said, was in and out of prison most of the time. They were together for 16 years and she finally left him because of his addiction.Eventually, Melissa found love again with a new man. She said they had a 'good marriage,' and were together for ten years but it ended, she said, after he fell into addiction'I couldn't go down the walk he was walking so I chose to go another path,' she said.During this period, she became more religious and relied on her faith to get her through and started cleaning churches and eventually people's homes to earn some income. A job that she proudly says, she still does today.'I had PTSD from things that happened in my past so I couldn't really work around a lot of crowds so I started the cleaning business so I could do one-on-one which was easier for me.''It keeps me busy. I do two or three jobs a day,' she said.Last year, Melissa married her soul mate a man named John Brown she wed in April 2022.On November 27, Brown posted on Facebook the emotional reunion that took place when Melissa met her birth mother for the first time.'This is my beautiful wife Melissa Brown meeting her mother for the first time in 51 years,' he wrote.In the video, the pair embrace and sob in each other's arms.",
        "'I have seen all the pictures of when we were young,' Melissa says to her mom.Her mother removes her sunglasses to get a better look of her long lost daughter, and responds: 'I used to be young and beautiful. I changed getting old,' she said, 'And missed all these years with you. Maybe we can get to know each other better.'Melissa asks: You live in Forth Worth?''I live in Forth Worth,' her mother says. 'Seventeen minutes away from you.'During the tear-jerking meeting, the video captures her meeting her father and one of her cousins named Melissa, who she learned was named after her, for the first time.Rebecca told DailyMail.com how she joined websleuth and was always trying to find Melissa and between 2005 and 2007 thought she came close but was heartbroken when she learned after a DNA test that the person she thought maybe her sister wasn't, after all.'When the DNA came back and it wasn't our sister it was pretty devastating because I had built a connection with her,' Rebecca said. 'I just couldn't put myself in my heart out like that.'She said her brother Jeff and sister-in-law created a Facebook page and started their own investigation.In September 2022, everything changed when Rebecca and Sharon Highsmith learned that their had been a possible sighting in Charleston, South Carolina of the their sister. That lead, although it ended up being a dead end, gave the family renewed hope.Jeff previously said that he never met his big sister and was only six years old when his parents told him about her abduction.He said at the time he was too young to understand, but around thirteen he began to do his own research and became obsessed with her disappearance.'It was a horrible tragedy and we never thought we would find her and we just moved on but it haunted me and consumed me,' Jeff said.He said his mother was only 20 years old when his sister was abducted, and his father, 19 at the time, had left his mother to run off with another woman. He said, his parents eventually reunited to help find their missing child.In an emotional clip filmed on Thanksgiving, Melissa was seen hugging her parents for for the first time in over 50 years - as they all embraced and wept in joy.'Jeff said each year the family would celebrate Melissa's birthday. During the last birthday they spent without her, Melissa's father told the Fort Worth Star-Telegram: 'We are looking for her and still care.'Later that day the family uncovered a lead that would unify them with her just weeks later, after decades of agony.It was brought about by a DNA test and detective work by Lisa Jo Schiele, a clinical laboratory scientist and amateur genealogist who encouraged the family to try a 23andMe DNA test.Melissa's father submitted a DNA sample to 23andMe, which returned a 100 percent match with three people. Those three people were the children of Brown and his wife Melissa.'It's overwhelming and incredible to me,' said Sharon Highsmith, Melissa's younger sister.'For decades, my parents have chased leads, hiring their own labs and investigators and yet, these DNA tests, which are available to anyone, helped us find our lost loved one.'",
        "Melissa said she would be changing her name officially to reflect the one she was given at birth.'Now that we have Melissa home all of us are going to be together - the grandkids the great grandkids, the great nephews for Christmas,' he said. 'We haven't all been together in 20 years.'Sharon now lives in Spain and had not seen Melissa but was looking forward to doing so this Christmas.Jeff said that the Forth Worth Police Department, Tarrant County and the FBI were looking at his mother in connection with his sister's disappearance.'The police never took the investigation off of my mom. They always thought my mom had something to do with it and they didn't pursue anything else,' he said.'I didn't understand. There was no justification. It was frustrating,' he said. 'From what I was told, in 1971 it was a different time for women. It was a time when Roe vs. Wade and the women's movement and women weren't treated as equal as meLast October the family traveled to Charleston, South Carolina to investigate a tip that Melissa had been seen there.She was identified based on a computer generated prediction of what Melissa would look like fifty years later - as an adult - from her baby photos.When the family got there they were faced with disappointment. That's when the they started thinking about DNA tests and were connected with her children.'We had coffee with her on Thanksgiving night, and when I looked at her, I just knew. I knew,' Jeff said, adding that she had a striking resemblance to their mother, he told Fox.'Our family has suffered at the hands of agencies who have mismanaged this case,' Sharon said.'Right now, we just want to get to know Melissa, welcome her to the family and make up for 50 years of lost time.'Sharon, her siblings and their parents encouraged other families with missing loved ones to keep on believing."
    ]
}