{
    "articleURL": "/wires/reuters/article-12043205/2023-Wells-Fargo-Championship-Preview-Props-Best-Bets.html",
    "content": [
        "The PGA Tour hits famed Quail Hollow Club for this week's Wells Fargo Championship, the seventh designated event of the 2022-23 season that begins Thursday in Charlotte, N.C.",
        "The 29th event of the season features six of the top 10 players in the world chasing a share of the $20 million prize pool. Our golf experts preview the event and provide their top prop picks along with the best bets to win this week.WELLS FARGO CHAMPIONSHIPLocation: Charlotte, N.C., May 4-7Course: Quail Hollow Club (Par 71, 7,538 yards)Purse: $20 million ($3.6 million)Defending Champion: Max HomaFedEx Cup leader: Jon RahmHOW TO FOLLOWTV: Thursday-Friday, 2-6 p.m. ET (Golf Channel); Saturday-Sunday, 1-3 p.m. (GC), 3-6 p.m. (CBS)Streaming on ESPN+: Thursday-Friday, 6:45 a.m.-6 p.m. ET; Saturday-Sunday, 7 a.m.-6 p.m.Twitter: @WellsFargoGolfPROP PICKS--Rory McIlroy to Finish Top 5 (+160 at BetMGM): McIlroy claims to be in a \"better headspace\" after taking a few weeks off following missed cuts at the Masters and the Players sandwichng a third at the Match Play. Quail Hollow traditionally has been one of his best tracks, and while the elevated event has drawn another strong field, it is missing the top two players in the world in Rahm and Scottie Scheffler.--Homa to beat Patrick Cantlay (+110 at DraftKings): Yes, Homa's victory last year came at a different course. But he did win at Quail Hollow four years ago and both gained significant experience on the course in last year's Presidents Cup. Cantlay missed the cut in his only previous start at the Wells Fargo, but he does enter this week in strong form with six consecutive top-20 finishes and three top-4s in that span. Meanwhile, Homa is coming off a missed cut at the RBC Heritage and a T43 at the Masters following a strong seven events to begin the year that included a win at Torrey Pines.",
        "--Adam Scott to Finish Top 40 (+120 at BetMGM): Scott hasn't been seen on the first page of the leaderboard in a while, but he is rolling along steadily picking up solid paychecks. The Australian hasn't missed a cut in nearly a year and finished top-40 in seven of eight starts this year. Granted, he also doesn't have a top-20 yet in 2023, but that's not what we're banking on here.2023 Prop Picks Record: 19-26-1BEST BETS--McIlroy (+750 at BetMGM) is a three-time winner of the Wells Fargo (2010, 2015, 2021) and is the highest-ranked player in the field at No. 3. He set the tournament scoring record of 267 in 2015. McIlroy is the BetMGM's third biggest liability this week as he has drawn the second-most money (16.6 percent) to win. He has been even more popular at DraftKings, where McIlroy leads the field in both total bets (22.8 percent) and money (27.7) at +700.--Cantlay (+1200) missed the cut in his event debut in 2021. However, the world's No. 4-ranked player has six top-10s in 11 starts this season.--Tony Finau (+1600) is coming off a victory in Mexico and is tied with Rahm with four victories since last year's Wells Fargo.--Viktor Hovland (+1800) is BetMGM's second biggest liability since opening at +2000. He leads the field with 9.3 percent of the total winning bets and is third with 12.3 percent of the money backing him. Hovland has the same odds at DraftKings, where he is third in total bets (8.6 percent) and fourth in money (9.2 percent) backing him.",
        "--Jordan Spieth (+1800) lost in a playoff at the RBC Heritage in his most recent start. He'll be making his first start at the Wells Fargo since 2013. Spieth is fourth at BetMGM with 6.9 percent of the total bets supporting him to win. He is second in field at DraftKings with 10 percent of the money backing him at +1800.--Cameron Young (+2000) has been a popular pick since opening at +2500. The rising star has yet to win on the PGA Tour, but he leads the field with 16.9 percent of the money backing him this week, making Young the biggest liability for BetMGM to open the tournament.--Homa (+2500), who won the event at TPC Potomac at Avenel last year, also won it at Quail Hollow in 2019. He is fifth with 5.2 percent of the total bets backing Homa at BetMGM, but he has drawn modest action with 3.9 percent of the money. He has been a more popular pick at +2800 at DraftKings, where Homa has been backed by 5.6 percent of the money.--Matt Fitzpatrick (+2500) is coming off a win at the RBC Heritage and finished T2 at last year's Wells Fargo at Avenel.NOTES--Homa is seeking to successfully defend a title for the second time this season (Fortinet Championship). No player has successfully defended at the Wells Fargo.",
        "--There are 18 players in the field who competed in the 2022 Presidents Cup held at Quail Hollow.--Finau called the three-hole stretch from Nos. 16-18 the most difficult stretch on the PGA Tour. Dubbed \"The Green Mile,\" it ranks as the toughest finishing three holes on tour outside of the majors since 2003 among courses that have hosted at least five events.--Justin Thomas won his first career major at the PGA Championship at Quail Hollow in 2017.--This is the second of four Open Qualifying Series events, with 12 spots available into The 151st Open at Royal Liverpool. The top three players who are not otherwise exempt and who make the cut at the Wells Fargo will earn an exemption.--Field Level Media"
    ]
}