{
    "articleURL": "/wires/reuters/article-12058613/Chinas-return-global-stage-checked-national-security-focus.html",
    "content": [
        "China's post-COVID diplomatic blitz sending mixed messages",
        "Security concern, US rivalry seen impeding outreachChina has \"progressively closed up\" - analystForeign firms wary of \"emboldened\" Chinese securityBy Yew Lun Tian and James PomfretBEIJING/HONG KONG, May 8 (Reuters) - China's increasing focus on its own security and intensifying rivalry with the United States threatens to turn its re-engagement with the world after years of COVID curbs into a new era of isolation from the West, analysts say.Since casting off pandemic controls that effectively shut its borders since 2020, Beijing has in recent months embarked on a series of seemingly contradictory diplomatic and business steps that have left many observers questioning its motives.These have included: promoting peace in Ukraine while holding talks with the aggressor Russia, rolling out the red carpet to Western leaders while escalating tensions over democratic Taiwan, and wooing foreign CEOs while taking measures seen as stifling China's business environment.Analysts say what may appear as mixed messaging is the result of President Xi Jinping's renewed focus on national security, steeled by rock-bottom relations with rival superpower, the United States.\"The stark reality in China...is that security now trumps everything, from economy to diplomacy,\" said Alfred Wu, associate professor, Lee Kuan Yew School of Public Policy in Singapore.Wu said the overwhelming focus on security is hurting some of China's diplomatic ties and its plans to rejuvenate the world's second largest economy, even as it seeks to stamp its authority on key geopolitical issues including the Ukraine crisis.",
        "\"For all that China says about wanting to be open to the outside world, it has progressively closed up.\"Xi singled out national security, a broad concept incorporating issues ranging from politics and economics to technology and territorial disputes, in a speech after securing a precedent-breaking third leadership term in October. A later speech in March at the National People's Congress was more pointed: China's security is being challenged by U.S. attempts to contain its rise, he said.While national security has always been among Xi's top concerns since taking office in 2012, his first two terms focused more on domestic issues like dissidents, rights activists and Muslim ethnic groups in China's northwestern Xinjiang region.In his October speech, he added \"external security\" and \"international security\", in what analysts say signals a new focus to counter foreign threats, namely Washington.Asked for its response to a list of questions for this story, China's foreign ministry said it was \"not aware of the situation\".Ministry officials have repeatedly asserted that China is a responsible power that supports multilateralism and globalisation and have accused other countries of hyping up the \"China threat\".'DIVERGENCE UNDERNEATH'But China's obsession with security has tainted several of its recent diplomatic initiatives, say analysts.For example, China's attempts to promote a peace plan for Ukraine has been met with scepticism due to its refusal to condemn Moscow, a close ally and its biggest oil supplier. When Xi last month held his first call with Ukrainian President Volodymyr Zelenskiy since the war started more than a year ago - an effort to stress Beijing is not taking sides - several analysts cast it as \"damage control\" after China's ambassador to France questioned Ukraine's sovereignty.",
        "Charles Parton, a fellow at British think tank Council of Geostrategy, said China's calls for peace in Ukraine are related to its own battle with the U.S.\"Beijing does not care if its peacemaking works...what matters is that this is an opportunity to portray the Americans in a bad light,\" he said, referring to China's assertions that the U.S. and its allies are fanning the flames of war by arming Kyiv.Michael Butler, associate professor of political science at Clark University, said Ukraine was a litmus test for U.S. resolve with parallels for Taiwan, the democratically ruled island China claims as its own.\"Of particular concern to Xi is gauging the lengths to which the U.S. will - or won´t - go to defend Ukraine´s sovereignty from Russian aggression, while publicly positioning China as a sober voice of reason and the U.S. as a meddlesome aggressor,\" he said. China's attempt to woo US allies in Europe is also part of its strategy to counter Washington's influence, but has had mixed success, say analysts.They point to last month's meeting in China between Xi and French President Emmanuel Macron. What appeared to be a friendly, constructive encounter was marred by Beijing beginning war games around Taiwan hours after Macron left. This, alongside comments by Macron perceived as weak on Taiwan, fuelled criticism of the trip in Europe as pandering to China. EU officials subsequently took a tougher line on China.",
        "BUSINESS JITTERSChina's security focus also risks isolating the country economically. At a pair of high-profile business summits in China in March, officials were at pains to stress the country was open for business after COVID. But in recent weeks, China has also passed a wide-ranging update of its anti-espionage law and taken what the U.S. said was \"punitive\" action toward some overseas firms in China.\"The security forces in China seem to have been emboldened, at the same time that China seeks to attract more foreign investment,\" Lester Ross, the head of the American Chamber of Commerce´s China policy committee, told Reuters.Chinese foreign ministry officials have previously said Beijing welcomes foreign firms as long as they abide by its laws. Instead of optimism about China's reopening, decades-long foreign bullishness on its capital markets is breaking down, with China's rivalry with the U.S. topping investor concerns.Ray Dalio, the founder of one of the world's biggest hedge funds Bridgewater and a high profile Sinophile, is among those concerned.\"(China and the U.S.) are very close to crossing red lines that, if crossed, will irrevocably push them over the brink into some type of war that damages these two countries and causes damage to the world order in severe and irrevocable ways,\" Dalio, who retired earlier this year, recently wrote on his personal LinkedIn account. (Reporting by Yew Lun Tian in Beijing and James Pomfret in Hong Kong; Editing by John Geddie and Lincoln Feast)"
    ]
}