{
    "articleURL": "/wires/reuters/article-12045261/Rays-hand-Pirates-fourth-straight-loss-sweep.html",
    "content": [
        "The Tampa Bay Rays lead the majors with 64 home runs, but there's more than power behind their torrid start to the season.",
        "The Rays, who have won 25 of their first 31 games, look to complete a three-game sweep of the Pittsburgh Pirates on Thursday in St. Petersburg, Fla.Shane McClanahan became the majors' first six-game winner on Wednesday, when the Rays cruised to an 8-1 victory. Josh Lowe and Wander Franco added solo homers for Tampa Bay, which has made an impression on the surprising Pirates.\"They're built well, they pitch well, they catch the ball, they execute offensively,\" Pittsburgh manager Derek Shelton said. \"It did not surprise me to see the start they've gotten off to because they are the model of consistency.\"Pittsburgh, which had won 11 of 13 games entering the series, has lost three straight for the first time this season. The Pirates are 0-for-17 with runners in scoring position in the first two games of the series.Tampa Bay has used power and speed to outscore the Pirates 12-2 in the last two games.\"You'd like to be as dynamic as possible and versatile as possible. You're not going to be able to hit home runs every night,\" Rays manager Kevin Cash said. \"You're going to have to scratch and claw for some runs here and there, and I think we've shown throughout the first part of this season that we've been able to score many, many different ways.\"",
        "Tampa Bay's speed was on display in the eighth inning on Wednesday, when Jose Siri raced around to score from first base on Luke Raley's double to left field.\"There's probably not a lot of guys that can score on the ball that he scored on,\" Cash said. \"We've got a couple of really fast guys, and I would put him at the top of the list. That's a big part of his game.\"The Rays will turn to right-hander Zach Eflin (3-0, 3.00 ERA) in the series finale. After winning his first three starts, he allowed two runs over five innings in a no-decision against the Chicago White Sox on Friday.Eflin, 29, signed with the Rays as a free agent following seven seasons with the Philadelphia Phillies. He is 1-1 with a 2.08 ERA in two career starts against the Pirates.Pittsburgh will counter with right-hander Vince Velasquez (4-2, 3.06), who has won his last four starts. He allowed five hits over six scoreless innings in a 16-1 victory over the Washington Nationals on Saturday.Velasquez, 30, has allowed just three runs across 25 innings with 28 strikeouts and seven walks in his past four outings.\"The hard work doesn't stop,\" Velasquez said. \"I think it's more of just a continuation, going back to the drawing board and seeing how I can get better. I think this is a year where I feel like I've made a lot of progress, I've established a lot of confidence in my secondary stuff.\"",
        "Velasquez is 0-1 with a 4.02 ERA in three career starts versus Tampa Bay.--Field Level Media"
    ]
}