{
    "articleURL": "/wires/pa/article-12052249/Group-led-China-Russia-criticises-global-institutions.html",
    "content": [
        "Foreign ministers from a group of nations led by China and Russia have criticised the ability of world institutions to resolve geopolitical problems, including the coronavirus pandemic.",
        "They said their organisation should do more to address such challenges.Indian Foreign Minister Subhramanyam Jaishankar said in remarks at a meeting of the Shanghai Cooperation Organisation (SCO) in Goa, India that the crises have disrupted global supply chains and have hit developing nations the hardest. With more than 40% of the world’s population within the SCO, our collective decisions will surely have a global impact  Subhramanyam Jaishankar  They have “exposed a credibility and trust deficit in the ability of global institutions to manage challenges in a timely and efficient manner,” he said, adding that alternative organisations like the SCO can help address such challenges.“With more than 40% of the world’s population within the SCO, our collective decisions will surely have a global impact,” he said.Russia and China founded the SCO in 2001 as a counterweight to US alliances across East Asia to the Indian Ocean. The group includes the four Central Asian nations of Kazakhstan, Kyrgyzstan, Tajikistan and Uzbekistan, which Russia considers its backyard.In 2017, India and Pakistan became members, and Iran and Belarus are set to join later this year.Russia and China have sought to reduce the dominance of what they see as US and Western-led global institutions and alliances, and China accuses Washington of attempting to contain its economic and military rise.",
        "Chinese Foreign Minister Qin Gang told the foreign ministers that “the world is faced with multiple crises and challenges featuring a resurgence of the Cold War mentality, headwinds of unilateral protectionism, as well as rising hegemonism and power politics”, China’s official Xinhua News Agency reported.“SCO members should support each other in safeguarding sovereignty, security and development interests, and oppose external forces interfering in regional issues,” he said.At a briefing after the meeting, Mr Jaishankar dismissed questions about whether the SCO is anti-Western, saying: “How people perceive it is something I cannot answer for.”Instead, he stressed India’s “multidirectional foreign policy” and said “it’s not always possible that all our partners get along with other partners”.India enjoys strong ties with Cold War ally Russia, while its relations with the United States have warmed in recent years and its ties with China have cooled over a border dispute. It is increasingly seen by the West as a counterweight to China’s growing global ambitions.Mr Jaishankar did not mention Russia’s war in Ukraine, and analysts said Moscow was unlikely to face a backlash over its invasion from the SCO and would instead use the meeting to flex its influence in the region.For Russia, the SCO remains one of the few international groups where it can still comfortably engage with members.",
        "The visit by Pakistan’s foreign minister to arch rival India to attend the meeting was the first by a high-ranking Pakistani official in nearly a decade.Mr Jaishankar stressed the need to stop cross-border terrorism in his remarks, a dig at Pakistan, which India accuses of arming and training rebels fighting for the independence of Indian-controlled Kashmir or its integration into Pakistan, a charge Islamabad denies.“Let’s not get caught up in weaponising terrorism for diplomatic point scoring,” Pakistan Foreign Minister Bilawal Bhutto Zardari said in his opening remarks.Despite speculation, India and Pakistan did not hold bilateral talks on the sidelines of the meeting.“Victims of terrorism do not sit together with perpetrators of terrorism to discuss terrorism,” Mr Jaishankar said at the briefing.Mr Jaishankar held separate talks with his Chinese and Russian counterparts on Thursday.The meeting with the Chinese Foreign Minister came amid continued tensions along their disputed border, where a three-year stand-off involves thousands of soldiers stationed in the eastern Ladakh region.Mr Qin earlier said the border situation was “stable overall” and that both sides should abide by existing agreements to “promote the further cooling and easing of the border situation and maintain sustainable peace and tranquility in the border area”, according to China’s Foreign Ministry.",
        "India did not release a statement after the meeting, but Mr Jaishankar said relations between the two countries were not normal and “cannot be if peace and tranquility in border areas is disturbed”.Mr Qin also met Russian Foreign Minister Sergei Lavrov on Thursday. China is the biggest buyer of Russian oil and gas exports, pumping billions of dollars into the Russian treasury and helping the Kremlin resist Western sanctions over its invasion of Ukraine.Beijing is also trying to present itself as a global diplomatic force and has said it is willing to serve as a mediator in the war.Last month, Chinese leader Xi Jinping said Beijing will send an envoy to Ukraine to discuss a possible political settlement.China has blamed the US and Nato for provoking Russia and refused to criticise Moscow’s actions. However, it has refrained from issuing a full-throated endorsement of the invasion and is not known to have provided arms or other material assistance to the Russian military effort."
    ]
}