{
    "articleURL": "/tvshowbiz/article-12057825/Pregnant-Dani-Dyer-shows-bump-grey-dress-supports-footballer-beau-Jarrod-Bowen.html",
    "content": [
        "Dani Dyer seemed in high spirits as she supported footballer beau Jarrod Bowen at the West Ham United v Manchester United match on Sunday.",
        "The former Love Island winner, 26, who is expecting twin girls this summer, displayed her growing baby bump in a figure hugging grey midi dress. She added a yellow jacket over the number and cradled her bump while sitting in the stand with pals. Dani, who is already mum to two-year-old son Santiago, left her long blonde tresses loose as they cascaded past her shoulders from a centre parting. The TV personality applied a radiant palette of makeup as she held onto a bottle of water and her phone.  ",
        "Dani was spotted out of her seat as West Ham's Saïd Benrahma found the back of the net giving her partners team the win. Earlier this week, Dani unveiled her unborn twins' nursery ahead of their arrival.Layered against JJ Heller's This Little Light of Mine, she gave fans a glimpse of the 'perfect princess haven', which comprises of lilac and pink tones.With soft balloon cushions and white baby grows hanging from the wall, the area features a large cream sofa and a coordinating foot stool.Two matching cribs and a canopy crib drape could also be seen in the footage, and so could a changing table, a cot mobile, soft toys and blankets.It comes as the TV personality took to her Instagram Story to answer a Q&amp;A last month and revealed she has been 'crying all the time' as she nears the end of her pregnancy.",
        "Dani admitted her symptoms have been extremely different to when she was expecting her son Santi.She said: 'I have been soooo emotional I cry all the time! The tiredness has been hard but I think that's from the low iron levels.. and just want spicy food all day long!'",
        "The reality star also said her mum will 'definitely be round all the time' to help her out after she gives birth to her twins.Dani is planning to dress her identical girls the same to start with and has already thought of a special way of identifying them.She wrote: 'I'm going to paint one of there toenails and then write in my notes whose toenail is painted. But they might have small differences that we notice? Not too sure but the painted toenail is the answer for me x [sic].'She continued: 'I definitely will dress them the same at the beginning because it excites me all the pink frilly dresses.'However as they start to get a bit older I'll dress them differently just so they have there own identities x [sic]'."
    ]
}