{
    "articleURL": "/wires/reuters/article-12051903/EU-needs-tiered-drug-pricing-improve-patient-access-Bayer-exec-says.html",
    "content": [
        "By Michael Erman and Maggie Fick",
        "BOSTON/LONDON, May 5 (Reuters) - The European Union should put mechanisms in place to allow drugmakers to charge higher prices in wealthy European countries and lower prices in poorer nations to assure more equitable patient access to life saving medicines, Bayer's global pharmaceuticals head said in an interview.That might be accomplished in part by restricting drug importation within the EU, Stefan Oelrich, head of Bayer's pharmaceuticals unit, told Reuters on Thursday.The EU published a long-awaited draft of its proposed overhaul of laws governing its pharmaceuticals industry last month. One of the main goals of the reforms would be more equitable access between wealthier and poorer EU states.Oelrich said the proposed laws would stifle innovation and reduce access to drugs in Europe, echoing pharmaceutical industry views.\"We have made clear proposals to the Commission how we could mend the access issues, for example, through tiered pricing opportunities inside the European Union,\" Oelrich said ahead of a Bayer event to launch a new research lab in Boston.EU prices are already set on a national level. The EU single market allows for the movement of goods and services.\"The trick today is if you do this just like that, then all of the product that you would ship to Lithuania at a discounted price would go immediately back to France because there's free circulation of goods. So then there would need to be a mechanism to actually make that manageable,\" he said.",
        "An EU source expressed doubts about whether tiered pricing schemes like the one proposed by Oelrich could solve the access problems the Commission's pharmaceutical legislation seeks to address.There would be no certainty companies would go to smaller or poorer EU countries as they do not have a profit incentive to prioritize them, the EU source said.Even if they do go (to poorer countries), they are unlikely to do so in a timely manner, since they will prioritize more lucrative sales in the larger and wealthier member states, the EU source added.Bayer's new CEO, former Roche pharmaceutical head Bill Anderson, starts at the company next month.The company is working to expand its pharmaceuticals business in the United States, and has stepped up spending on research and development there despite a new U.S. law that will allow the government to negotiate prices on some drugs for patients in its Medicare health program.\"If I compare the conditions between the U.S. and Europe in terms of drug pricing, they're still more favorable in the U.S. than they are in Europe,\" Oelrich said.(Reporting by Michael Erman in Boston and Maggie Fick in London; Editing by Bill Berkrot)"
    ]
}