{
    "articleURL": "/news/article-12043291/Doctor-85-killed-patient-routine-bone-marrow-biopsy-Oldham-hospital-struck-off.html",
    "content": [
        "Isyaka Mamman's negligence caused death of mum-of-three Shahida Parveen48-year-old died after routine bone marrow biopsy for Royal Oldham Hospital Mamman  struck off register of doctors and remains in prison serving sentenceAn elderly doctor jailed for killing a patient in a botched procedure after lying about his age to avoid retirement has now been struck off.",
        "Dr Isyaka Mamman, who had pretended to be 11 years younger than he was, bungled a bone marrow extraction so badly that Shahida Parveen, 48, bled to death in 2018.A court heard he plunged the needle in at the wrong point, puncturing the sac around her heart. As she died at Royal Oldham Hospital, her husband shouted: ‘He killed her!’Then 85, he was found guilty of Mrs Parveen’s manslaughter and imprisoned last July.Mamman did not attend yesterday’s Medical Practitioners’ Tribunal Service hearing and remains in prison serving his sentence.",
        "In its published report, the tribunal said that 'given the seriousness of Dr Mamman's conviction and the sanction imposed, and notwithstanding his custodial sentence, it is in the public interest to make an order suspending his registration with immediate effect, to protect patient safety, uphold and maintain professional standards and maintain public confidence in the profession'.The tribunal heard Mrs Parveen died after Mamman carried out a 'highly dangerous procedure' rarely used in the UK, instead of using the conventional technique.",
        "In the botched operation, he initially tried and failed to take a sample from her hip.He then tried her breastbone – a technique considered dangerous because of its proximity to the heart.Ignoring her husband Khizar Mahmood’s protests, and using the wrong needle, he made several attempts before piercing her heart sac, causing massive bleeding.",
        "Sentencing, Mrs Justice Yip said it was ‘hard to understand’ how Mamman had been allowed to carry on working as she gave him a sentence that – ironically – she said took into account his advancing age and ‘frail’ appearance.After the case, it emerged other patients had also suffered ill-treatment from Mamman.In 2015, Margaret Helliwell was left in agony during an identical biopsy by the haematologist, then 79, who shoved his knee into the grandmother’s back to force a needle into her hip with such pressure that the device bent.Speaking last year, the 81-year-old said that when she read about Mrs Parveen’s death, ‘I just thought, “That could have been me”.’But her terrifying experience was not even the only such incident of 2015.",
        "That same year, a bone marrow biopsy by Mamman led to a patient suffering internal bleeding and a heart attack. The unnamed man was left permanently disabled, and won a negligence claim.He had also lost a previous job in Kent over poor performance.During the crown court case, it emerged Mamman was only working in the NHS due to what the judge called the ‘astonishing’ decision to rehire him after he was caught lying about his age.Born in rural Nigeria, he arrived in Britain in 1965 and began working as a haematologist.",
        "But 20 years ago, managers at Medway Maritime Hospital in Kent noticed a discrepancy. Mamman, who had said he was born in 1936, was using a Nigerian passport that showed a birth year of 1941 – slicing five years off his true age.In about 2001, Mamman adopted an even later birth year – 1947 – which he relied upon for naturalisation as a British citizen, allowing him to continue working well beyond when he had actually turned 65.At Mamman's sentencing hearing, his barrister claimed that Mrs Parveen had also been failed by the trust running the Royal Oldham, alleging a 'catalogue of failings' between 2015 and 2018 in relation to the doctor.\"He should never have been allowed to be in the position that he was,\" Michael Hayton KC said.After the sentencing hearing, Dr Chris Brookes, Group Chief Doctor and Deputy Chief Executive for the Northern Care Alliance NHS Foundation Trust, said: ‘We wish again to offer our sincerest condolences to Mrs Parveen’s family and friends and we are deeply sorry for their loss. We would like to reiterate our sincere apology previously provided to Mrs Parveen’s family.‘Following Mrs Parveen’s death in September 2018, the trust launched a thorough internal investigation to examine the circumstances leading up to and following this tragic incident.",
        "‘The trust (has) implemented improvements which were shared with Mrs Parveen's family. The trust has admitted liability in relation to a civil claim brought by the family.’"
    ]
}