{
    "articleURL": "/wires/reuters/article-12043325/Argentina-fast-track-Brazilian-imports-return-help-financing--sources.html",
    "content": [
        "By Bernardo Caram",
        "BRASILIA, May 3 (Reuters) - Argentina has offered to fast-track imports from Brazil if its neighbor adopts a new credit system that reduces its dependence on the dollar, which it has in short supply, officials in both governments told Reuters.The proposal would cut the processing and payment time for Brazilian products to 30 days from 180 days at present, reducing trading risks with a country with high inflation and exchange rate variations, the sources said.Argentina's import system SIRA would be modified to be able to handle operations in the Brazilian currency, said one source.Payment in reais by Argentine importers would be made possible through the new financing system designed by the Brazilian government, though technical aspects have yet to be defined, the source said.Brazil offered to help cash-strapped Argentina and support Brazilian exporters so that they can continue to sell to their neighbor, the main export market for Brazilian manufactured goods. The plan was announced during a visit to Brasilia on Tuesday by Argentine President Alberto Fernandez.More than 200 Brazilian companies have stopped exporting to Argentina or are not receiving payments due to the lack of foreign currency there, Brazil's Finance Minister Fernando Haddad told reporters.The economic teams of Brazil and Argentina will meet further next week in Buenos Aires.",
        "\"Why will Argentina benefit? Because it can trade in reais and that lowers the pressure for dollars on its Central Bank, and lowers pressure on its international reserves,\" said the other source.The official, who requested anonymity, said one of the issues in the negotiations was what kind of guarantees Argentina can give to make the operations viable.He said a mechanism discussed was an \"escrow\" account in a Brazilian bank that would receive guarantees.Such guarantees could, for example, be Chinese bonds, or contracts for the future purchase of gas or wheat, assets with international liquidity which Brazil could access to compensate losses in the event of non-payment by an Argentine importer.One idea is for Brazil's development bank BNDES to manage the financing.The plan is to facilitate sales by 210 Brazilian businesses that have had trouble exporting to Argentina, including in the auto, steel, chemical, home appliances and food industries.Brazil has been losing ground in its bilateral trade, with its share of Argentine imports dropping $4 billion dollars from 2014 to 2019, one of the sources said.China, which has financing mechanisms that assist exports, took over that lost market share.On Tuesday, alongside Fernandez, President Luiz Inacio Lula da Silva said the New Development Bank of the BRICS group of leading emerging nations could help Argentina by giving guarantees for Brazilian exports, though that would require changes in the bank's operating rules.",
        "\"We don't even want them to lend money to Argentina. What we want is for them to give us guarantees, which then greatly facilitates Brazil's relationship with Argentina,\" he said. (Reporting by Bernardo Caram; Additional reporting by Lisandra Paraguassu; Editing by Richard Chang)"
    ]
}