{
    "articleURL": "/news/article-12042523/George-Foreman-accused-child-sexual-abuse-woman.html",
    "content": [
        "A third woman, now 64, related to George Foreman 'by marriage', has accused him of raping her at his Livermore, California ranch when she was 15In her complaint obtained by DailyMail.com, she claims she was left unattended when Foreman, then 24, began asking her sexually explicit questionsThe boxer and grill magnate is already facing lawsuits by two other accusers, Gwen Hunter and Denise Shipes, who claim he molested them as minors George Foreman has been accused of child sexual abuse by a third woman – a member of his family, DailyMail.com can reveal. ",
        "The boxer and grill magnate, 74, is already the subject of two lawsuits by women in their 60s who claim he molested them when they were as young as 13. He vehemently denies the claims.Now, an anonymous 64-year-old woman has filed a civil lawsuit claiming Foreman forced himself on her when she was 15 and he was over 24, around 1974 at his ranch in Livermore, California. The latest complaint comes just days after new biopic, Big George Foreman, based on the retired heavyweight champ's life and storied boxing career - including his infamous defeat against Muhammad Ali in the famous 'Rumble in the Jungle' match in 1974 -  premiered in theaters. But the lawsuits filed by the three women paint a different picture of the character of the man portrayed in the film.",
        "The new complaint, filed in Alameda County, California, says the woman was born in 1958, is 'a relative by marriage' of Foreman, and was 'born and raised in Houston, Texas'. Although it names Foreman only as 'Doe 1', it clearly identifies him saying 'Doe 1 defeated Joe Frazier in 1973 to become the heavy weight champion of the wor[l]d.'According to the legal complaint, a Foreman family member took the then-15-year-old from Houston to Livermore to help babysit the boxer's child around 1974. It said Foreman paid for 'all expenses' including the flight.",
        "The teen was 'excited about the opportunity to visit California and to meet her world famous relative,' it said. But when she was left unattended with Foreman during the visit, he 'began to ask Plaintiff sexually explicit, questions which Plaintiff replied that she had absolutely no experience of,' the papers said.The girl says she refused the famous boxer who 'began to proposition her with money in exchange for him sexually penetrating her' and 'stated that while penetrating her he wanted to climax inside of her'.She claims he then raped her.'After Plaintiff refused DOE 1's sexual advances, DOE 1 imposed his will upon the unsuspecting minor, and began engaging in immoral and unwanted sexual acts against her, which included oral copulation,' the complaint says.'After DOE 1 completed the sexual assault, Plaintiff was left in terror, and could not comprehend what had just happened to her. Because the incident involved a family member, Plaintiff had not [sic] one to turn to, and was in complete fear of what would happen to her if she said anything.",
        "'On that basis, in order to cope with the fear and pain, Plaintiff blocked the memory from mind as her only coping mechanism as to the sexual assault.'The woman claims that it wasn't until the last three years when sexual assault came up in a conversation with her friend 'Patricia', that the memories came flooding back.",
        "'Plaintiff began to develop frightful thoughts about DOE 1, as she suddenly began to have flash backs of the sexual assault that occurred in 1974,' the lawsuit said.The complaint was filed on December 30 by attorney James Bryant II of the Cochran Firm, a Los Angeles practice.The woman is the third to come forward alleging Foreman abused her as a child.Two women, Gwen Hunter and Denise Shipes say they were the daughters of Foreman's sparring partner and boxing manager respectively, and first met him when they were under 10, according to their Los Angeles County Superior Court lawsuits.",
        "They claim he groomed them for years, then forced them to have sex with him in a San Francisco Hotel, a Beverly Hills apartment, and other locations.Shipes's lawsuit, filed on September 9 last year, claims Foreman called her at home in Hayward, California, when she was 13 and told her how to masturbate, then had sex with her 'several times' when she was 15.Hunter, who filed first on August 24, claims Foreman threatened her saying 'you don't want your dad to lose his job, do you?' and then 'orally copulated her'. She claims he would 'molest and sexually abuse [Denise] until she was 16', including 'sexual intercourse'.Foreman sought to get ahead of the filings, issuing a statement last year accusing them of extortion.",
        "'Over the past six months, two women have been trying to extort millions of dollars each from me and my family. They are falsely claiming that I sexually abused them over 45 years ago in the 1970s. I adamantly and categorically deny these allegations,' he said.'I will work with my lawyers to fully and truthfully expose my accusers' scheme and defend myself in court. I don't pick fights, but I don't run away from them either.'He is currently counter-suing one of the women in federal court – claiming that at a press conference she made allegations that went beyond her lawsuit, leaving her open to a defamation claim. ",
        "His complaint claims their allegations are 'entirely fabricated' with 'zero corroborating evidence in the form of documents, photographs, letters, or witnesses to support ... false claims against Foreman.'Gwen and Denise's lawyer, Samuel Dordulian, told DailyMail.com he was struck by the similarities between the new Houston-based accuser and his two clients, including the manner of the sexual abuse.'It really is essentially a very similar allegation as Gwen and Denise,' he said.He said the alleged molestation led one of his clients into a spiral of drug and alcohol addiction and tangles with law enforcement.'It had a completely deep impact on her life's trajectory. It changed it entirely,' said the attorney, who formerly served as a LA County sex crimes prosecutor.",
        "Dordulian told DailyMail.com the two women were scared to come forward, but felt emboldened knowing there were others accusing Foreman of similar crimes.'You hear over and over again from sexual assault survivors, you really need somebody to come forward before the others are ready to come forward,' he said.'If you're gonna reveal it about somebody that is famous, a celebrity, much less a celebrity loved by the public, it's that much more difficult.'Dordulian encouraged any other victims of sexual abuse to come forward.'I've been dealing with survivors of sexual abuse for over 20 years,' he said. 'It really eats them up inside to keep their secret. It festers, and it bubbles up in various different, difficult ways.'When they finally come forward and deal with the truth, they can finally start the road to recovery.'I would encourage anybody who has any similar situation to come forward and tell their truth.'",
        "All three sex abuse claims were filed during a special period from 2020 to 2022 applied by the California legislature, temporarily extending the statute of limitations for historic child sex abuse claims.A biographical film based on the boxer's life, Big George Foreman, was released in theaters on April 28.Foreman, who was sensationally defeated by Muhammad Ali in the 1974 Rumble in the Jungle fight in Zaire (now the Democratic Republic of Congo), won gold at the 1968 Olympics.",
        "He went professional the next year and was unbeaten throughout his 40 pro fights, besting then-undefeated Joe Frazier to win the heavyweight title in 1973.'Big George' defended the belt twice before losing it to Ali in Zaire the following year.After being ordained as a Christian minister, Foreman returned to the ring and retook the heavyweight title aged 45, becoming the oldest world heavyweight champion in history.He retired in 1997 at 48, with a record of 76 wins (including 68 knock outs) and just five losses.He's since enjoyed a successful run as a pitchman, helping to sell hundreds of millions of George Foreman Grills.Foreman was dubbed 'Marketing Champ of the World' by Bloomberg in 2004."
    ]
}