{
    "articleURL": "/wires/ap/article-12053181/Arozarena-homers-hit-2-pitches-Rays-beat-Yankees-5-4.html",
    "content": [
        "ST. PETERSBURG, Fla. (AP) - Randy Arozarena homered in the first inning and then was hit by pitches in his next two plate appearances, leading to Tampa Bay manager Kevin Cash being ejected as the MLB-best Rays beat the New York Yankees 5-4 on Friday night in the first meeting this season between the AL East rivals.",
        "Tampa Bay (27-6) became the first major league team since 1901 to win 18 of its first 20 home games.Arozarena homered to center field off Jhony Brito before the rookie right-hander plunked the outfielder on the elbow guard in the third. Yankees reliever Albert Abreu then hit Arozarena in the ribs with a fifth-inning pitch.An angry Arozarena walked slowly toward first base and whipped his bat in disgust towards the Rays´ dugout.There was yelling between the benches, but no trouble on the field. The umpires gathered and issued warnings to both teams, which prompted Cash to rush out of the dugout to argue with crew chief and first base umpire Lance Barksdale.Cash, Arozarena and Yankees manager Aaron Boone all agreed the hit by pitches were unintentional.",
        "\"The first at-bat, hitting the home run on a breaking ball, and I think he just kind of let his sinker slip,\" Arozarena said through a translator. \"On the second one, I also don´t think it was intentional because after the third out he actually looked over and apologized. ... He gave me that look.\"Barksdale told a pool reporter the crew deemed no intent on both pitches, but with words being exchanged \"you've got to issue warnings to try and keep the game under control.\"",
        "Arozarena doesn't expect any carryover on Saturday.\"I think we're just going to come out there, and win,\" he said.Wander Franco put the Rays up 5-4 with an RBI double off Jimmy Cordero (1-1) in the seventh that went off the glove of left fielder Jake Bauers after he got twisted around trying to make the catch. Yandy Díaz was initially called out at the plate on the play, but the call was changed after a replay review.Díaz had a solo homer in a two-run third for the Rays, who opened a 10-game lead over the last-place Yankees (17-16) in the AL East.\"I don't care what the number is,\" Boone said. \"I get it. You've got to get right. We have to play well or none of it matters, right?\"The Yankees have lost five of seven.New York is without outfielder Aaron Judge (right hip), designated hitter Giancarlo Stanton (left hamstring) and third baseman Josh Donaldson (right hamstring), as well as starting pitchers Luis Severino (right lat) and Carlos Rodón (back).Kevin Kelly (3-0) pitched 1 1/3 scoreless innings to get the win. Jason Adam worked the ninth for his third save,Harrison Bader had a three-run homer off reliever Garrett Cleavinger during a four-run sixth that pulled the Yankees even at 4.",
        "SPECIAL PITCHHelen Kahan, a survivor of the Auschwitz-Birkenau concentration camp, threw a ceremonial first pitch on her 100th birthday. The native of Romania lives in St. Petersburg.FREE DRINKSArozarena's first-inning drive delighted fans in \"Randy Land,\" a seating section in left field that made its formal debut. Fans that purchase tickets there for Friday games get an Arozarena T-shirt, and those of legal age get a free beer if he homers.TRAINER'S ROOMYankees: Judge and Donaldson worked out at the team's complex in nearby Tampa. Severino threw in a minor league intrasquad game at Tampa's Steinbrenner Field.Rays: 2B Brandon Lowe was out of the lineup for the second consecutive game with back soreness. ... LHP Josh Fleming, who took a 113.1 mph infield single off his left foot Tuesday, threw off a bullpen mound and expects to pitch Sunday. ... RHP Tyler Glasnow (strained left oblique) gave up two hits, walked two and struck out four over 2 1/3 scoreless innings in his first rehab start for Triple-A Durham.UP NEXTYankees RHP Domingo Germán (2-2) and Tampa Bay RHP Drew Rasmussen (3-2) are Saturday's starters.___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}