{
    "articleURL": "/sport/nba/article-12049413/Golden-State-Warriors-defeat-Los-Angeles-Lakers-127-100-absolute-blowout-tie-series-1-1.html",
    "content": [
        "Thompson led the game with  scored with 30 points thanks to strong shooting Golden State outscored the Lakers 84-47 over the second and third quarters  DailyMail.com provides all the latest international sports news Klay Thompson scored 30 points with eight 3-pointers, Golden State limited Anthony Davis while allowing LeBron James 23 points, and the defending champion Warriors evened their Western Conference semifinal with the Los Angeles Lakers at one game apiece with a 127-100 win Thursday night.",
        "Stephen Curry added 20 points and 12 assists as Splash Brother Thompson shined to help Golden State make 21 more 3-pointers - giving the Warriors an NBA record for most in the first two games of a playoff series at 42. James' Cavaliers hit 40 against Atlanta in the 2016 second round.Coach Steve Kerr switched things up and inserted JaMychal Green into the starting lineup for Kevon Looney, who had a career-high 23 rebounds in Game 1 but has been dealing with an illness.Kerr aimed to give a different look with scoring options and perhaps more free-throw chances by going hard at Davis in the paint - where Golden State got thoroughly outplayed in a 117-112 loss in the opener.Thompson's basket with 7:48 left in the third gave Golden State its biggest lead at 82-64 and the Warriors rolled from there.",
        "The Warriors had more fast-break points and points in the paint. JaMychal Green matched his playoff career high with 15 points, while Draymond Green contributed 11 points, 11 rebounds and nine assists after insisting he had to get more aggressive.The best-of-seven series shifts to Los Angeles for Game 3 on Saturday.James shot 6 for 8 in the first with a pair of 3s for 14 points as the Lakers led 33-26. He retrieved a loose ball and let it fly for a pretty 3 with 7:47 before halftime but the Warriors were too much.",
        "Davis followed up his brilliant Game 1 performance - 30 points, 23 rebounds, five assists and four blocked shots and 11-for-19 shooting - with 11 points while shooting 5 for 11, seven rebounds, four assists and three blocks.Golden State outscored the Lakers 84-47 over the second and third quarters - recording two 40-point quarters in the same playoff game for the first time in franchise history.",
        "Looney received huge roars as he came off the bench for his first action with 3:41 left in the first. He grabbed eight rebounds and scored six points playing just less than 12 minutes.Kerr was hardly worried ahead of Game 2, pointing to how Golden State lost Game 1 of the NBA Finals at home to Boston last year before winning it all.The Warriors also rallied from a 2-0 deficit in their first-round series to beat Sacramento, the first defending champion to ever do so.Thompson shot 11 for 18 and 8 of 11 from deep. His 19 points in the first half were his most in a postseason contest since he scored 21 in Game 6 against the Rockets in 2019. "
    ]
}