{
    "articleURL": "/wires/reuters/article-12053039/New-York-protesters-demand-criminal-charges-chokehold-killing-subway.html",
    "content": [
        "By Julia Harte",
        "NEW YORK, May 4 (Reuters) - Protesters in New York City on Friday called for charges against a former U.S. Marine who choked a homeless man to death on the subway they were both riding in, as the veteran's lawyers said he never intended to harm the man.The death of Jordan Neely, 30, on Monday has stoked an outcry over the lack of city support for those suffering from mental illness and homelessness.Hundreds of demonstrators displayed signs saying \"Justice for Jordan Neely\" and \"Being poor is not a crime\" at one protest in Washington Square Park in lower Manhattan Friday evening.Authorities have yet to identify the former Marine. But criminal defense law firm Raiser &amp;amp; Kenniff said in a statement that it was representing him and identified the man as Daniel Penny.The statement said that Penny wanted to express \"condolences to those close to Mr. Neely.\" It alleged that Neely had aggressively threatened Penny and other passengers, and added that \"Daniel never intended to harm Mr. Neely and could not have foreseen his untimely death.\"Earlier on Friday, the New York Young Communist League protested at the Manhattan District Attorney's office demanding that Penny be charged. Protesters also demanded an investigation of the police who, according to media, let him go after questioning him.",
        "Penny, who placed Neely in a chokehold while both rode the F train, has not been charged. The district attorney's office said it was investigating the incident and would review the medical examiner's report, which ruled Neely's death a homicide due to compression of the neck.The examiner's homicide finding alone does not imply intent or culpability, which are issues that prosecutors will consider in deciding whether to bring criminal charges.Neely, who was Black, was homeless, according to media reports. The 24-year-old Penny, who was white, was questioned by police and released on Monday, media said. Protest organizers called the act a \"lynching\" and an example of \"white vigilantism\" against people of color.New York Mayor Eric Adams cited mental health issues as having a role in the incident, but said he would refrain from commenting further while the investigation is under way.A spate of attacks on train passengers last year, particularly Asian Americans, prompted Adams to increase police patrols and expand outreach to the mentally ill in the subway system, citing rising homelessness in the wake of the pandemic.A video of the incident that has circulated on social media showed Penny applying a chokehold to a man identified as Neely on the floor of a subway train for more than three minutes. Two other men are seen in the video restraining Neely's arms before he went limp.",
        "Reuters could not verify the authenticity of the video.Neely was known to impersonate Michael Jackson, dressing and dancing like the legendary music artist on New York's busy trains and stations. The altercation occurred after he boarded the train and began yelling at passengers, saying he was hungry and ready to die, the New York Times reported, citing police.Democratic U.S. Representative Alexandria Ocasio-Cortez, whose district includes neighborhoods in the New York City boroughs of the Bronx and Queens, said Neely was murdered and called for Penny's arrest. (Reporting by Julia Harte and Eduardo Munoz in New York, Brendan O'Brien in Chicago; Additional reporting by Brad Brooks in Lubbock, Texas; Editing by Diane Craft and Stephen Coates)"
    ]
}