{
    "articleURL": "/tvshowbiz/article-12039081/Laura-Whitmore-nails-boho-chic-white-broderie-anglaise-flares-pals-book-launch.html",
    "content": [
        "Laura Whitmore cut a stylish figure as she attended pal Samantha Baines' book launch at Waterstones in London on Tuesday.",
        "The former Love Island host, 37, nailed boho chic in a white broderie anglaise top that featured puff sleeves and a neon orange trim.She completed the look with a pair of black high-wasted flares as she celebrated her friend's moment in the spotlight.Accentuating her gorgeous features with make-up Laura wore her luscious blonde locks loose past her shoulders. The book entitled Living With Hearing Loss And Deafness follows author Samantha's life of living with the disability.  ",
        "It comes after Laura attended Keith Lemon's star-studded fancy dress 50th birthday bash on Saturday night.The guestlist included the likes of Emily Atack, Myleene Klass and Holly Willoughby, with everyone making a true effort with their costumes. Emily, 33, put on a glamorous display as she dressed the late Marilyn Monroe in a white off-the-shoulder dress with a thigh-high split and a matching wrap which she draped over her shoulders. She shared snaps from inside the party as she posed with the birthday boy and her former Celebrity Juice co-star Laura and her husband Iain Stirling.They looked like they were all having a great time as they hit the dance floor and sipped on Champagne.Elsewhere Myleene Klass and her husband Simon Motson dressed as Mozart and Salieri, with Simon dressing as a piano.Myleene, 45, looked like she was making the most of the party as she busted some moves and shared the clips on her Instagram Story. ",
        "Laura also gave a glimpse at the lavish venue which was decorated with huge light up 50 signs and the birthday cakes that had been made for Keith.",
        "Elsewhere Holly, 42, was seen wearing a bright pink flared jumpsuit with stars on the lapels and legs in the style of Barbie from the upcoming movie starring Margot Robbie.She was joined by her This Morning co-host Phillip Schofield, 61, who dressed as Ron Burgundy from the Anchorman movies.Also in attendance was Emma Bunton, 47, who stepped out with her husband Jade Jones, 44.Spice Girl Emma looked sensational as she put on a leggy display in a white shirt dress.Baby Spice added a few inches to her stature by wearing a pair of beige platform shoes and carried a handbag shaped like a seashell with her.She wore her long blonde hair in waves as she dressed as the character Madison from the 1984 film Splash.",
        "Played by actress Daryl Hannah, the movie follows the story of a young man who falls in love with a mysterious woman who is secretly a mermaid.Pop star Emma seemed in good spirits as she arrived with former boyband star Jade as the pair walked arm-in-arm.Elsewhere, Fearne Cotton, 41, who was also a regular on Celebrity Juice, wore a bright yellow top and a brown checked skirt as she arrived.",
        "She donned a beret and a scarf and boosted her height by wearing pair of black heels for the evening.TV and radio star Fearne was seen walking alongside husband Jesse Wood, 46, who looked dapper in a grey suit and brown hat."
    ]
}