{
    "articleURL": "/tvshowbiz/article-12040829/Idina-Menzel-keeps-classy-black-jumpsuit-attending-15th-annual-Music-benefit-LA.html",
    "content": [
        "The 51-year-old singing star was honored at the benefit held at The Novo in downtown Los Angeles along with Tom Morello and Babyface Babyface, real name Kenneth Brian Edmonds, looked sharp at the event in a light blue suit that he wore along with a white undershirt and black dress shoes Rage Against The Machine musician Tom, 58, kept it casual in a black T-shirt, matching jeans and bootsIdina Menzel kept it classy in an all-black outfit on Tuesday while attending the 15th annual Music Will benefit in Los Angeles.",
        "The 51-year-old singing star was honored at the benefit held downtown at The Novo along with Tom Morello and Babyface.Idina looked lovely in a black jumpsuit that featured black button embellishments on top and loose flared trousers.The Tony Award-winning entertainer accessorized with large sparkling earrings and accentuated her natural beauty with smoky eye makeup and pink lipstick.Idina carried a round black purse while walking the carpet at the benefit presented by the Hot Topic Foundation.",
        "The New York City native was selected as an honoree for her impact as an entertainer and philanthropist.Idina co-founded A BroaderWay Foundation in 2010 with former husband Taye Diggs, 52, to support young people in the arts.She also co-wrote a 2022 children's book with her sister, Cara Mentzel, called Loud Mouse about a mouse named Dee who loves to sing loudly.Babyface, real name Kenneth Brian Edmonds, looked sharp at the event in a light blue suit that he wore along with a white undershirt and black dress shoes.He accessorized with sunglasses and necklace while walking the carpet.Babyface, 64, was accompanied by his girlfriend Rika Tischendorf, 33, who wore a long pink dress with a high-thigh slit.Rage Against The Machine musician Tom, 58, kept it casual in a black T-shirt, matching jeans and boots.",
        "Tom was honored for his political activism while Baby was recognized for his impact as a songwriter, producer and mentor.Babyface and Tom at the event got together with Chuck D for a group photo. ",
        "Music Will, formerly known as Little Kids Rock, makes popular music more accessible to children.The New Jersey-based non-profit previously has honored such acts as Elvis Costello, Bonnie Raitt, Smokey Robinson, and Joan Jett, among others. Babyface in support of Music Will has committed to focus on launching programs in his hometown of Indianapolis, Tom has committed responsibilities among 20 schools between Los Angeles and Chicago and Idina will be spending her time between schools in Los Angeles and New York.The program dates back to 1996 when David Wish, a first grade teacher in East Palo Alto, California, started giving free guitar lessons to his students after becoming frustrated with the lack of music education at his school."
    ]
}