{
    "articleURL": "/wires/afp/article-12038481/Nearly-300-arrested-US-Europe-dark-web-drug-bust.html",
    "content": [
        "A multi-continental crackdown has halted a major \"dark web\" drugs marketplace, with international police arresting 288 suspects and recovering more than 50 million euros ($54.8 million) in cash and virtual currency, Europol said Tuesday.",
        "The operation called SpecTor by US, British, Brazilian and European law enforcement also netted almost a tonne of drugs and 117 firearms, Europe's policing agency said.\"In an operation coordinated by Europol and involving nine countries, law enforcement have seized the illegal dark web marketplace 'Monopoly Market' and arrested 288 suspects involved in buying or selling drugs on the dark web,\" the Hague-based Europol said in a statement.\"A number of these suspects were considered high-value targets,\" it said.The sting followed a successful 2021 operation by German police which saw it seize the Monopoly Market's criminal infrastructure.\"Europol has been compiling intelligence packages based on troves of evidence provided by the German authorities,\" Europol said.\"These target packages, created by cross-matching and analysing the collected data and evidence served as the basis for hundreds of national investigations,\" it said.\"As a result, 288 vendors and buyers who engaged in tens-of-thousands of sales of illicit goods were arrested across Europe, Britain, the United States and Brazil,\" Europol said.The largest number of arrests were in the United States with 153, Britain 55, Germany 52 and the Netherlands, 10. One suspect was also arrested in Brazil.The US Justice Department said several suspects have already been convicted or were being prosecuted following Operation SpecTor -- which it described as the \"largest international operation against darknet trafficking of fentanyl and opioids\".",
        "This included a Florida man who was sentenced to 16 years in December on drug possession and distribution charges, the DOJ said in a statement.Police also recovered 50.8 million euros ($53.4 million) in cash and virtual currency and seized 850 kilos of drugs, mainly amphetamines and opioids, Europol and the DOJ added.- 'Held accountable' -\"Our coalition of law enforcement authorities across three continents proves that we all do better when we work together,\" Europol's director Catherine De Bolle said.\"This operation sends a strong message to criminals on the dark web: international law enforcement has the means and the ability to identify and hold you accountable for your illegal activities,\" she said.Dutch cybercrime police team leader Nan van de Coevering said the intelligence helped police to start new investigations \"as well as enriching current probes.\"\"We published a list on the dark net containing all the nicknames of the arrested sellers,\" Van de Coevering added.\"Buyers know they cannot trust the sellers on the list,\" she said.- 'Whack-a-mole' -Operation SpecTor comes in the wake of last month's takedown of the world's largest online marketplace selling stolen identities and passwords on the open web.Led by the US Federal Bureau of Investigation (FBI) and Dutch police the operation called \"Cookie Monster\" saw 119 suspects arrested and involved 17 countries across the world.",
        "A cookie is a piece of computer data that makes it easier to reopen web pages. Cookie Monster is a blue, furry character from the US children's television series \"Sesame Street\".In April last year German and US law officials closed down the \"Hydra\" marketplace, estimated to be worth 1.23 billion euros.Previous operations targeting marketplaces on the dark web included \"DisrupTor\" in 2020 and \"Dark HunTor\" in 2021 leading to more than 320 arrests.US Attorney General Merrick Garland however admitted that these operations \"disrupt the situation for some time\".\"But people can reconstitute, there are other people,\" he told a Washington press conference.\"There is a bit of a whack-a-mole problem here and we are whacking as hard as we can,\" Garland said.burs-jhe/bp"
    ]
}