{
    "articleURL": "/wires/ap/article-12052757/Over-2-000-migrants-kidnapped-Mexico-year.html",
    "content": [
        "MEXICO CITY (AP) - Mexico´s government said Friday over 2,000 migrants were kidnapped by smuggling gangs and drug cartels last year, as authorities mounted a successful search for 10 Colombians abducted in northern Mexico this week.",
        "Mexico´s national immigration agency said authorities had freed 2,115 migrants of all nationalities kidnapped by gangs in 2022.Gangs and cartels appear to be increasingly charging migrants fees to cross Mexico, and then kidnapping them for ransom. There have been a string of such mass migrant abductions in Mexico in recent months.Prosecutors in the northern border state of Sonora said late Friday they had found 10 Colombians who went missing Tuesday in the border city of San Luis Rio Colorado, across the border from Arizona. The Colombians were found in good shape at a gasoline station, officials said.A relative of one of the missing Colombians said kidnappers had called to demand thousands of dollars from relatives in the United States.Reached by telephone in Bogotá, Colombia, Johan Morales - the son of a couple among those who went missing Tuesday - said his parents and other relatives had been planning to reach the Arizona border and turn themselves in to U.S. officials to request asylum. He said a cousin who lives in New York received a call from kidnappers Thursday demanding $2,500 apiece to release his relatives.Just a week before, Ecuador had contacted officials in Sonora to complain that 30 Ecuadorans had been abducted in the state. When officials arrived at the safehouse where they were being held in another border town, they found more people than they expected: 43 Ecuadorans and 20 other abducted migrants were being held there.",
        "That has not been uncommon in recent months: complaints about a few missing migrants have led police to investigate and find dozens more being held against their will.In April, a reported kidnapping of about 20 people in the north-central state of San Luis Potosí led police to mount a massive search by air and land - and they found not only the 20 migrants they were looking for, but about 80 more migrants being held against their will, apparently by the same gang."
    ]
}