{
    "articleURL": "/wires/ap/article-12042311/Napoli-coach-Spalletti-verge-biggest-moment-career.html",
    "content": [
        "Luciano Spalletti spent several years working as a coach in Udine, and it's in the same northern Italian city where he is now poised to reach his crowning achievement with Napoli.",
        "Napoli plays at Udinese on Thursday needing only one point to end its lengthy wait for the Serie A title. The team could even secure the scudetto on Wednesday if Lazio fails to beat Sassuolo.Spalletti´s innovative style first showed promise when he was coach of Udinese nearly two decades ago. He led the provincial club to a fourth-place finish and a spot in the Champions League.\"I´m very close to a lot of people in Udine,\" Spalletti said Wednesday. \"People say that I have a difficult character but that clashes with the fact that I have spent a long time on the bench of few teams.\"It´s difficult to find someone else who has spent most of his career with only four or five teams.\"Despite later coaching teams such as Inter Milan and Roma, the 64-year-old Spalletti has been waiting a lifetime for the Italian league title. He won Italian Cup titles with Roma in 2007 and 2008 and then Russian league trophies with Zenit St. Petersburg in 2010 and 2012.",
        "Napoli hasn't won the league since Diego Maradona led the team to its only two Serie A titles in 1987 and 1990.The southern team had a chance to secure the championship at home on Sunday but Salernitana scored a late equalizer in a 1-1 draw to put Napoli´s celebrations on hold.",
        "\"Seeing our fans disappointed mortified us,\" Spalletti said. \"Seeing the stadium like that made us understand what we are on the verge of accomplishing, it´s what I´ve dreamed of since I came here. I imagined a stadium like this, with scarves, flags, children all in the Napoli colors. It should be a party for all.\"Napoli has won only three Italian Cups in the 33 years since its last league title. And Spalletti hopes clinching the Serie A title this season will start a winning cycle for the club, which also reached the Champions League quarterfinals for the first time in its history this year.\"I have a team of thoroughbreds and I´m happy that in a short time the guys have shown all their qualities and their character,\" Spalletti said. \"I see the potential for the future, then of course it depends also on the transfer market, on the things we can manage to do.\"But in front of my eyes, apart from the sunshine, I have a great squad which has good future prospects and can give a continuation to these results.\"If Napoli fails to get the result it needs at Udine, it will have five more chances to secure the one point it needs to mathematically seal the title - regardless of how second-place Lazio performs.",
        "\"C´o stamm´ trezzianno chianu chianu,\" Spalletti said in Neapolitan dialect, meaning: \"We´re relishing it slowly, slowly.\"___More AP soccer: https://apnews.com/hub/Soccer and https://twitter.com/AP_Sports"
    ]
}