{
    "articleURL": "/wires/reuters/article-12050429/MORNING-BID-AMERICAS-Apple-comforts-payrolls-loom.html",
    "content": [
        "A look at the day ahead in U.S. and global markets from Mike Dolan Big Tech delivered again, as another earnings beat from the world's biggest firm soothed investor nerves over U.S. regional banks and the debt ceiling row - and Friday's release of the April employment report.",
        "Apple, the world's largest company by market capitalisation, surprised investors after the bell on Thursday with a rise in iPhone sales even in a slumping global smartphone market - sending its stock up 2% in pre-market trading.IPhone sales rose 1.5% to $51.3 billion - bamboozling forecasts for a 3.3% drop and contrasting with the 13% drop in overall global smartphone shipments during the first quarter.Apple upped its dividend and authorized another $90 billion share repurchase program, same as a year ago.Apple's stock has outperformed most of Wall Street in 2023, up 28% year-to-date. And its latest beat follows similarly above-forecast profit readouts from the 10 firms that make up the FANG-plus grouping of leading digital and technology firms.After a torrid 2022, that narrow index is up 35% so far this year - far outstripping the Nasdaq 100's 18% gain and accounting for the bulk of the more modest 6% rise in the S&amp;amp;P500 &amp;lt;.S&amp;amp;P500&gt;.And after three hefty daily retreats in a row for the S&amp;amp;P500 this week, futures are up 0.4% ahead of Friday's open.Even battered regional bank stocks showed some sign of settling, with the latest names in the crosshairs - PacWest, Western Alliance and First Horizon - up between 7% and 15% before Friday's open after another day of eye-watering losses.",
        "Attention has now shifted to what extent outsize bank stock moves are being driven by destabilising short selling rather than deposit flight or asset quality and how regulators can address that as well as deposit insurance funding more broadly in drawing a line under the disturbance.It's much harder to draw a line under the U.S. debt ceiling standoff, now that June 1 is identified as the day the government runs out of cash.As an indication of resulting debt default fears at the front end of the Treasury bill market, poor demand for the U.S. Treasury's auction of $50 billion in four-week bills that cover the assumed 'X date' saw 1-month yields hit 5.73% on Friday - more than half a point above the Fed's new policy rate ceiling of 5.25%.Six-month bill yields were calmer at 5.18% - but that's still more than 80 basis points above the 4.33% that futures markets see Fed rates falling to by November.Two-year U.S. Treasury yields recovered some ground as the banking stocks have calmed, but remain as low as 3.8% and the dollar is marginally weaker - partly eyeing the European Central Bank's commitment to keep hiking interest rates beyond this week's latest rise.Sterling outperformed and hit 11-month highs as British Prime Minister Rishi Sunak's Conservative Party faced a bleak set of local election results that increased the chances of a change of government at next year's general election.",
        "But with markets already assuming Wednesday's quarter-point Fed rate rise was the last in the brutal 13-month and 500bp cycle, a key test of that will be the April U.S. payrolls report released later on Friday.Employers likely hired the fewest workers in nearly 2-1/2 years last month, according to consensus forecasts for a 180,000 rise in jobs, as the cumulative and delayed effects of higher interest rates start to impact.Elsewhere in the U.S. earnings season, it was more of a mixed bag.Shares in cryptocurrency exchange Coinbase Global jumped 8% before the open after the firm posted a smaller-than-feared loss in the first quarter, benefiting from cost cuts and diversification of revenue sources.On the other hand, Lyft's stock plunged 14% after the ride-hailing company forecast a dull second quarter as price cuts in its race with bigger rival Uber to add more riders take a toll on margins.With almost 80% of the S&amp;amp;P500 firms now already reported, estimates of the overall annual decline in profits for the quarter have fallen to less than 1% - much shallower than the 5% contraction seen a month ago and casting doubt on assumptions an earnings recession was already under way. Events to watch for on Friday: * U.S. April employment report, March consumer credit. Canada April employment report * U.S. Federal Reserve Board governor Lisa Cook and St Louis Fed President James Bullard speak * U.S. corp earnings: Cigna, Dominion Energy, Warner Bros Discovery, AMC Entertainment, Cboe Global Markets, Johnson Controls, Epam Systems, Evergy, AES",
        "(By Mike Dolan, editing by Nick Macfie mike.dolan@thomsonreuters.com. Twitter: @reutersMikeD)"
    ]
}