{
    "articleURL": "/tvshowbiz/article-12049307/Jeremy-Renner-shares-update-physical-therapy-recovery-snowplow-accident.html",
    "content": [
        "Jeremy Renner shared an update on his recovery in a new social media post on Thursday.",
        "The 52-year-old Mayor Of Kingstown actor posted a photo of his lower body while performing physical therapy and wrote about the 'great progress' he has been making in his journey to full recovery.The Hawkeye star — who made his first red carpet since the near-fatal accident at the premiere of his Disney+ series, Rennervations — said: 'Lower pain levels mark great progress'.Earlier this year, Renner survived being crushed by a 14,000 pound snowplow and suffered from major injuries — including more than 30 broken bones.Since then, the Mission Impossible alum has been sharing his daily exercises to his Instagram account and keeping fans updated on his miraculous recovery.",
        "In the caption, the California native also wrote that he has been busy 'making recovery and surpassing goals a daily habit'.The snap shared by Renner did not show his face but instead just the lower half of his body as he exercised on an anti-gravity treadmill.Renner also shared a photo of himself using a bone growth stimulator and also ending off his busy day with a leg compression machine.Later, he posted a video of himself exercising and wrote: 'I've decided to push through the pain of progress (this d*** shattered tibia) and take the new parts for a tiny test drive.",
        "'The body is miraculous,' he continued. 'Even though I feel like the Tin Man, needing oil for all my new joints (hips, knees, ankles, tibia etc). Encouraged after this warm up to press on (don’t tell my PT)'. In April, the Academy Award nominee made an appearance on Jimmy Kimmel Live to promote his documentary miniseries.During the interview, he also spoke about how 'lucky' he was to survive the terrifying accident.He revealed that it was fortunate that the machine missed the critical parts of his anatomy.'It just missed every vertebrae, did not hit any organs, membrane did not swell,' he detailed.'My eye did pop out — that's weird — but I got pretty lucky that none of the organs got messed up,' he added.The New Year's Day accident left more than 30 of Renner's bones broken.",
        "He was hospitalized in 'critical condition' and underwent multiple surgical procedures. When Kimmel asked him about the best thing to come out of the incident, Renner joked and responded that it was getting time off for the rest of the year.'I was making so many plans,' he replied. 'I was going to buy a boat. I was going to live in Mexico ... because my year was pretty jammed up until I got crushed, right?' ",
        "'And then also it was like a New Year's resolution,' he continued. 'I did drop like 20 pounds.'Renner continued in good humor: 'I quit smoking. It's easy! Easiest way to quit smoking, I'm telling you!'"
    ]
}