{
    "articleURL": "/wires/aap/article-12040633/Chaos-Seibold-years-past-Broncos-Lockyer.html",
    "content": [
        "Brisbane Broncos great Darren Lockyer says the club has recovered from the chaos that unfolded during former coach Anthony Seibold's tenure, thanks largely to the work of current coach Kevin Walters.",
        "Seibold will coach Manly against ladder leaders Brisbane on Friday night at Suncorp Stadium during Magic Round - his first time as an NRL head coach since parting ways with the Queensland club mid-way through the 2020 season.The Broncos finished last in 2020 and appointed Walters as coach in 2021. Seibold had taken over at the Broncos in late 2018 and replaced Wayne Bennett, who was sacked.\"It was chaotic after Wayne left. There was a lot of movement of players and movement of staff,\" Lockyer, also a Broncos board member, said at the NRL's launch of Magic Round.\"It created a very unstable organisation. I felt more than anyone for Anthony. He went through a hell of a lot in those two years and I am really happy for him to see he got another start at Manly.\"I hope his season goes well, just not in Magic Round.\"Lockyer said Broncos coach Kevin Walters, CEO Dave Donaghy and recruitment chief Simon Scanlan had done a \"great job\" to turn the club around.\"Not disrespecting the previous guys, but the mandate was stability. We just had too much churn with players and staff and we had to stabilise the club,\" Lockyer said.\"Those guys have been integral in getting that done.\"",
        "Lockyer said Walters had done \"a really good job to create that enjoyment factor for the players\".\"Winning helps but they want to play with each other as you see after the game in the dressing rooms. It is really good to see those things and Kevvie has played a massive part in it,\" he said.Lockyer said having Seibold in charge of the Sea Eagles \"just adds to the rivalry between Manly and the Broncos\".\"Obviously there is the history from the first-ever game ( in 1988), but now with Seibs coaching Manly he is up against Kevvie,\" Lockyer said.Adding to the theatre is the fact that Walters was overlooked at the end of 2018 as Bennett's successor when the board elected to appoint Seibold.Broncos forward Pat Carrigan, who was handed his NRL debut by Seibold, said he held the Manly mentor in high regard.\"He was great for me. A lot of young guys here, (including) Payne (Haas) and Flegy (Tom Flegler), he taught us what it takes to be first graders and the work ethic you need,\" Carrigan said.\"He gave us opportunity here. You shouldn't get punted just because of what happens in one year.\"Carrigan said Seibold showed his quality as a coach by taking South Sydney to the preliminary final in 2018.",
        "\"It just didn't work here. He is a great fella, a great coach. Go ask the Manly boys what they think of him.\"He has got a Manly team he is doing wonders for. He can coach and they can play, and we are going to have to show up.\""
    ]
}