{
    "articleURL": "/wires/aap/article-12038591/Legacy-centenary-torch-relay-ignites-national-tour.html",
    "content": [
        "The Legacy centenary torch has been lit in Western Australia at its first stop on a six-month tour around the nation to commemorate the charity's important work supporting defence families over the past 100 years.",
        "The flame, which started its journey in Pozieres, France, last month, will travel 50,000km to 100 locations carried by 1500 torchbearers with a personal connection to the charity established in 1923.The relay started in Albany on Wednesday, which was the port where 21,500 Australian and 8500 New Zealand service men and women boarded a convoy of ships in November 1914 to travel to the World War I battlefields.Former deputy prime minister, diplomat and WA governor Kim Beazley was the first torch bearer after a Royal Australian Air Force flyover started the relay at 10am.Mr Beazley lit the torch before passing it on to the first of 20 other torch bearers in the port city.\"Legacy is one of the great Australian organisations,\" he said.He said the charity's support after his grandfather died from battlefield injuries allowed his mother to complete her teaching degree and compete in international athletic events where she became a world champion.\"This would not have been possible without Legacy,\" he said.Legacy Australia chair Eric Easterbrook said starting the torch journey at Albany was an \"impactful\" way to commemorate those who have served both in WWI and more recently.\"We hope that the relay will not only help to raise awareness and funds for Legacy's cause but (also) help to unite families who are carrying the torch to honour the sacrifices of loved ones,\" he said.",
        "Legacy WA chief executive Matt Granger said the event would give the community the opportunity to come together and honour the service of Australia's defence veterans and their families.\"The Legacy Torch Centenary is a momentous occasion,\" he said.\"Legacy has been an integral part of WA providing vital assistance to those affected by our fallen and injured service men and women.\"The Legacy Centenary Torch Relay 2023 will travel on Friday to Fremantle and Perth during a six-month campaign supported by Defence Health, visiting towns and cities around the country before finishing in Melbourne in October.An Australian Defence Force tri-service escort will accompany it.Legacy Australia supports families of more than 40,000 veterans and was founded on a promise made from one digger to another to \"look after the missus and the kids\".Lifeline 13 11 14Open Arms 1800 011 046"
    ]
}