{
    "articleURL": "/sport/othersports/article-12055029/Wimbledon-crown-jewel-Income-Championships-trumps-summer-event.html",
    "content": [
        "Income from Wimbledon soared to £346.6million in 2022 from £292m in 2019That puts every other summer sporting event in the shade in terms of moneyIt's understood that at least £180m of the £346.6m comes from broadcasters Wimbledon's status as the crown jewel in Britain's sporting summer each year is underpinned by the booming state of the tournament's finances. Income from the Championships soared to £346.6million in 2022, which was almost 20 per cent up on the previous record of £292m from 2019.",
        "That puts every other annual summer event in the shade in terms of money, whether that's a major Test cricket series, The Open, the British F1 Grand Prix, Royal Ascot, the Derby Festival at Epsom, any major boxing bout or indeed anything elsePutting Wimbledon's earnings in context, the 2022 Championships made almost twice as much in a fortnight as Everton and Newcastle United of the Premier League earned in the whole of last season. Wimbledon in two weeks last year earned more than Juventus in 2021-22.And while the price paid by the BBC for the live UK rights for Wimbledon fortnight is a tightly guarded secret, the Championships remain massively important to the corporation.There are enough clues in the most recent tennis accounts, just published, to strongly suggest the BBC is now paying more each year for Wimbledon fortnight that they pay each year for the content on Match of the Day.",
        "In the current three-year rights cycle, the Beeb are paying £211.5m for three years of MOTD rights or £70.5m per year.A note in the Wimbledon Championships accounts reveals that 'income from broadcasters represents more than half of the company's turnover, and a small number of key broadcast markets, notably the UK and the USA, provide the majority of that income.'",
        "It's understood that at least £180m of the £346m comes from broadcasters, and perhaps closer to £200m. With a majority of that sum, perhaps £130m-£140m coming from the BBC (for British rights) and ESPN (for rights in the USA), it becomes clearer that the BBC are paying top dollar for a treasured tournament.ESPN agreed a 12-year deal worth $40m a year (£32m) in 2011 to screen Wimbledon in America from 2012 to 2023 inclusive. In summer 2021, as the BBC signed a new deal keep the rights until 2027, ESPN also signed a new 12-year extension, from 2024 to 2035 inclusive, which sources say may be worth as much as $1bn, or $83m (£66m) a year. ",
        "Revenues hit £346m – that's more than all but 10 football clubs in the worldBBC paying more to broadcast championships than £70m Match of the DayCommercial deals worth more than ticket revenues ",
        "On the assumption that hasn't yet kicked in — and everyone involved is keeping tight-lipped — then it appears the Beeb are currently paying between £75m and £100m annually for Wimbledon rights.The next biggest revenue stream from the Championships is commercial cash from partner brands from Evian, Ralph Lauren and Slazenger to IBM, Land Rover and Pimm's among others.Collectively those deals are worth more each year than ticket sale income of around £55m.Last year's attendance of 515,164 people across the 14 days, including the new and permanent middle Sunday of play, was an all-time record.",
        "Sales of food and drink, and Wimbledon-branded merchandise, brought in approaching £15m combined last summer.The bond between Wimbledon and the national broadcaster runs deep: their partnership is longest running in the world between any one sports event and one broadcaster, dating back to 1927.It was in June that year that Captain Henry Blythe Thornhill Wakelam commentated for BBC radio on the first matches, from Centre Court.These days Wimbledon is wall-to-wall across BBC One, BBC Two, BBC online, BBC iPlayer and on BBC Radio 5 Live and 5 Live Sports Extra for the whole fortnight.",
        "Current stars treated for gambling issuesThirty-five football players, including some current stars, required residential rehabilitation in England last season to deal with addictive disorders, most commonly gambling addiction, we can reveal.Substance abuse, of alcohol and drugs, was the next most common reason players were admitted to the Sporting Chance clinic.But in a sport saturated in gambling advertising and in a professional league system where the vast majority of clubs have one or more gambling partners, the gambling epidemic is arguably the most shameful.Sporting Chance was founded in 2000 by Arsenal and England legend Tony Adams, who himself has battled alcoholism, to support former and current players with various mental, emotional and addiction issues.Among players known to have sought help specifically for gambling addiction are Paul Merson, Michael Chopra, Matthew Etherington, David Bentley and Dominic Matteo but there have been hundreds more. ",
        "On two visits to the clinic in the late Noughties, On The Money met a group of players fighting gambling addiction, including two who were contemporary England internationals whose stories remain private to this day.Former England goalkeeper Peter Shilton is another who has spoken openly about his gambling problems, and has sought help via Sporting Chance and the NHS. His wife Steffi told the Mail on Sunday: 'The likes of Sporting Chance and the NHS national clinics are doing such a great job.'It is important to try to change the narrative around gambling addiction, it is a mental illness and players should not be embarrassed. The best thing players can do is reach out to organisations or loved ones.'They should feel proud if they do decide to reach out as that is a proactive step to doing something about their situation.'Going forward, it would be great to see even more help out there for loved ones. Family members can be a key to the success of a player's recovery. They are the silent victims and are often left traumatised too.'The numbers detailed above were outlined in the latest financial records for the Players' Foundation, formerly known as the PFA Charity, which spent almost £4million last year to provide counselling and treatment to 520 players and former players.",
        "Just under half were current players, just under half were former players and five per cent were family members of players in desperate situations. The interventions were necessary for a wide variety of reasons ranging from depression (almost half of all cases), substance addiction (78 players) and gambling addiction, afflicting 42 players, and many of those so badly they went into rehab for up to a month at a time.Of the 520 players helped in total, 40 of them were current female professional footballers. No identities or specifics were provided but aside from the problems detailed above, assistance was sought for psychiatric assessment, anger management, eating disorders and suicidal ideation.A total of 83 former players among the 520 were helped with PFA counselling and support as thy continued to come to terms with being survivors of football's sex abuse scandal, perpetrated by convicted paedophile Barry Bennell and many other predatory coaches of that era.David de Gea’s a big saverDavid De Gea has stockpiled £20million of savings in the firm he uses to hold his image rights cash. Given all the gossip about the Spanish goalkeeper needing to take a big cut in his basic £350,000 a week salary — if he wants another United contract — it’s comforting to know the brilliant saver has a nest egg tucked away. ",
        "Sam Allardyce's bonusesMuch was made last week of the fact that Sam Allardyce will pocket a £2.5million bonus if he manages to keep Leeds United in the Premier League. But that’s nothing compared to the cash the Leeds players will receive between them if they can dodge the drop. Collectively they will split £42m if they can avoid going down to the Championship. A note in their recently published accounts discloses the sum and also reveals the squad shared £48.2m in survival bonuses last season when Leeds finished one place above the relegation zone. "
    ]
}