{
    "articleURL": "/sport/football/article-12059515/Newcastle-eye-Athletic-Bilbaos-Nico-Williams-drop-Moussa-Diaby.html",
    "content": [
        "Newcastle are reportedly interested in signing Athletic Bilbao's Nico WilliamsIt comes after they have reportedly dropped their interest in Moussa Diaby  Eddie Howe's side are also eyeing up a move for Blackburn's Adam WhartonNewcastle United have added Athletic Bilbao winger Nico Williams to their lengthy list of targets but Bayer Leverkusen's Moussa Diaby is off it.",
        "The 20-year-old Williams, with a £50million release clause, was the subject of an offer from Aston Villa in January and has been followed by Arsenal too.Newcastle have the likes of James Maddison, Mason Mount, Declan Rice and Kieran Tierney on their wish list but with competition fierce and prices even more so, they need alternatives. Spain international Williams is in the mix as is Bayer Leverkusen's Dominik Szoboszlai, who has a £65m release clause, but Diaby has drifted out of contention. Newcastle scouts have been continuing to keep an eye on Blackburn Rovers prospect Adam Wharton though.",
        "Sporting director Dan Ashworth and scout Mick Tait have both been spotted at Ewood Park to watch the 18-year-old central midfielder, who has three appearances for the England U19s side. Having risen through the Rovers' academy, Wharton has played an important part in Blackburn's bid for the play-offs this season, making 17 appearances (11 starts) in the Championship, while returning a goal and an assist. Mail Sport understands the midfielder has been described as a 'taller Jack Wilshere who can both play and tackle'. But Newcastle aren't the only club who have been scouting the young star, with Arsenal Tottenham and West Ham also keeping tabs on his availability.The Gunners are also a favourite to sign Diaby this summer, but their swoop to sign the 23-year-old could be thwarted by Paris Saint-Germain, who are also chasing his signature as a potential replacement for Lionel Messi, who could be off to Saudi Arabia next season. ",
        "While Arsenal and PSG will go toe-to-toe, it seems the Magpies are bowing out of the race to sign Diaby instead focusing on Williams. Having risen through the Athletic Bilbao youth system, the 20-year-old made his LaLiga debut back in 2021. ",
        "He has since gone on to amass 81 appearances and 12 goals for Athletic Bilbao, becoming a firm favourite in of Ernesto Valverde's squad, making 39 appearances and 28 starts in the league this season.Williams also rejected a £45m move to Villa during the January transfer window but it's becoming clear that Unai Emery will go up against Eddie Howe to sign the attacker this summer, with the Spanish coach 'determined' to get his man. Szoboszlai, meanwhile, has also been in impressive form for Leverkusen, scoring seven goals across 42 appearances in all competitions, including a brace of goals against Freiburg that helped the Bundesliga side reach the final of the German Cup. The 22-year-old, who has scored a total of 17 goals in 87 games for the club, has previously been a target of Arsenal, AC Milan and Real Madrid. "
    ]
}