{
    "articleURL": "/tvshowbiz/article-12061517/Influencer-bride-forced-deny-trashed-wedding-venue.html",
    "content": [
        "Model Ellie Gonsalves came forward on Monday to deny speculation she was the anonymous influencer who trashed her own wedding venue.",
        "A blind gossip item did the rounds last week alleging an Aussie social media identity was kicked out of their wedding venue, along with their guests, due to rowdy and abusive behaviour.When Ellie was asked during an Instagram Q&amp;A if she was the bride at the centre of the alleged incident, she denied anything like that happened at her recent nuptials on the Gold Coast.She added that she would never 'tolerate' that 'kind of behaviour'. 'No that definitely wasn't us. Firstly, I have a lot of respect for everyone I ever work with/surround myself with, and secondly, my friends would never do that to me either,' she told her followers.",
        "'It's sad to hear anybody, let alone someone with a social media following, would disrespect a person's business like that. It's not something I would ever do or the kind of behaviour I would tolerate from my guests.' Dutch Minty, the watchdog account that originally reported the blind gossip item, also confirmed Ellie was not the influencer who trashed her own wedding.'I can 100 per cent confirm the submission was not about Ellie. The influencer's wedding in question happened in early 2022,' the admin said.While Ellie was not booted from her wedding venue for poor behaviour, she did cause a stir last Saturday when she received backlash for wearing a 'naked' dress.",
        "Ellie spared no expense for her luxurious wedding to Ross Scutts in March, as she donned three different white gowns for her big day.Her main dress for the ceremony featured long sleeves, an illusion neckline and a dramatic train.However, it was her third dress that received a wave of negative comments, with many fans saying it was inappropriate for a wedding.",
        "Ellie posted a video of herself walking out to her bridal party in the barely there dress, and captioned it: 'My husband's face when he saw me in this dress reveal at our wedding.'She paired the corset-style 'naked' wedding dress with a pair of silver strappy heels.Some of her followers said the revealing mini-dress was more akin to lingerie, as it featured see-through tulle and a daringly high thigh split."
    ]
}