{
    "articleURL": "/tvshowbiz/article-12044515/Im-Celebrity-South-Africa-campmates-quake-amid-ferocious-storm.html",
    "content": [
        "The I'm A Celebrity... South Africa stars will be left shaken during Thursday evening's show as a ferocious storm hits the camp.",
        "In scenes yet to air, the famous campmates will be left quaking as a powerful rainstorm rumbles through Kruger National Park, where they slept out in the open while filming last September.Former Hear'Say singer Myleene Klass will be heard squealing while newcomer Joe Swash will shout: 'It's like Lord of the Flies!', as thunder claps above their head.The celebrities will be left drenched from head to toe as the heavens open, with Georgia Toffolo saying: 'The lights start flickering and then the lights go out. The lightning is all around us. The thunder is so loud.'A teaser heard ex-supermodel Janice Dickinson declares: 'The lightning is cracking right over head of us. I don't want to sleep out there.'",
        "While Georgia adds: 'It's bad. It's a big bad storm.'The campmates will be seen jumping to grab their belongings in a bid to cover them from the rain, with former cricketer Phil Tufnell saying: 'It was great fun. We sprung into action. We did well. We did well as a team to protect the area and it sort of worked.'It comes after The I'm A Celebrity... South Africa campmates were turned against each other during Wednesday's episode after hosts Anthony McPartlin and Declan Donnelly told them they would 'no longer work as one camp'.  ",
        "Newcomers Joe Swash, 41, and Dean Gaffney, 45, were chosen as the leaders of each pride and they took it in turns to pick the campmates they wanted for their group, with Joe choosing first after winning a coin toss.Dramatic scenes then unfolded as Dean sent Myleene Klass and Jordan Banjo from his yellow pride, while Joe sent Georgia Toffolo and Fatima Whitbread from his green team, to face it off in a snakes and ladders themed trial, which had a picnic by the waterfall as a prize.The four competing campmates screamed and jumped their way through trial as they shoved their hands in holes in a bid to get hold of pieces for ladders which would lead them up out of cages and onto the roof where they could hit a buzzer to win the trial.Former Hear'Say singer Myleene was seen screaming and hugging Jordan after they made it to the top, with the two returning to the camp in Kruger National Park to tell the rest of the yellow pride they would be heading off on their picnic.Joe and Dean were seen arriving in camp during Wednesday's episode after the second half of their gruesome drinking trial aired. ",
        "The actors were first seen trying to force disgusting cocktails down their throats in a bid to win treats for the campmates after they were revealed as late arrivals on the show on Tuesday.",
        "Both stars struggled to keep the drinks down, with the pair spluttering and projectile vomiting throughout the trial.Dean even entered the camp with vomit down his top while the rest of the campmates gleefully greeted him.On Tuesday, viewers were in hysterics as they watched the newcomers vomit and splutter gruesome cocktails of animal innards just minutes after arriving on the show on Tuesday.Joe, 41, who won on his first run on the series in 2008 and Dean, 45, who previously appeared on the 2006 series, were tasked with drinking a variety of concoctions to win treats for each existing member of the camp in Kruger National Park.Dean, who played Robbie Jackson on the BBC soap EastEnders from 1993 to 2003, did not fair well with his Bushtucker Trials during his first time in the jungle, when he screamed his way through the challenges, with not much changing this time.And while Joe - who also was also in EastEnders as Mickey Miller from 2003 to 2008 - forced himself through his I'm A Celeb trials and also tried out many more as the host of former ITV2 spin-off show I'm a Celebrity... Extra Camp, he didn't have an easy ride this week either.",
        "The pair were told by hosts Ant McPartlin and Declan Donnelly to stand in front of a table and choose a log to turn over, with Dean first picking the log named 'Helen Fanny-gan', before he was tasked with drinking a glass of blended cow vagina.",
        "Before he had even picked up the glass, a bright red Dean was shuddering and screaming.He tipped half the contents of the glass into his mouth, slopping much of it down his top, before attempting to swallow it, with Dean visibly bringing the drink back up into his mouth and spraying it out onto the table despite having his lips tightly closed.Dean proceeded to vomit much of what he had swallowed onto the table as Joe yelled at him to 'drink it like a shot', while signalling for him to quickly tip the glass back, instructing Dean to: 'Bang it!'The screen star gulped the rest of the glass and managed to keep it down, successfully winning a prize of some lemonade for Helen Flanagan.",
        "Joe selected the log named 'Phil Tough-hell' and he was given a glass of blended maggots to consume. Describing it as 'a real thicky' Joe looked repulsed before he picked the glass up and took a gulp before instantly vomiting the grey smoothie back up into the glass, to which Dec observed: 'Oh! It's going back in,' while Dean looked on, crying with laughter, spraying saliva as he was unable to contain his guffaws.A sweaty Joe eventually managed to down the majority of the drink, winning some wine gums for campmate Phil Tufnell.",
        "I'm A Celebrity...South Africa continues tomorrow at 9pm on ITV1 and ITVX. "
    ]
}