{
    "articleURL": "/tvshowbiz/article-12057207/Natasha-Hamilton-joins-Atomic-Kitten-bandmate-Liz-Amanda-McClarnon-Eurovision-event-Liverpool.html",
    "content": [
        "Pregnant Natasha Hamilton joined her Atomic Kitten bandmate Liz McClarnon at the Eurovision 2023 welcome event in their home city of Liverpool on Sunday.",
        "RHOCH star Natasha, 40, cut a chic figure in an oversized pale green suit which she teamed with a skimpy blue lace bralette. Lovingly cradling her blossoming bump, Natasha who is expecting her first child with husband Charles Gay, slipped her feet into a pair of comfy white trainers for the event.Accentuating her features with make-up she swept her auburn locks into a high ponytail and completed the look with a pair of statement making earrings. She is already a mother-of-four and shares son Josh, 20, with celebrity bodyguard Fran Cosgrave; Harry, 18, with actor Gavin Hatcher; Alfie, 12, with ex husband Riad Erraji, and daughter Ella, eight, with boyband star Ritchie Neville.",
        "Meanwhile Liz, 42, commanded attention in a gold and blue sequinned coat which she layered over a cream ensemble. The songstress donned a sparkly sweater with matching high-waisted trousers as she posed up a storm on the red carpet.Sporting a radiant complexion she styled her blonde locks poker straight as they fell down past her shoulders.   Hosted by Olympian Sam Quek and Ukrainian presenter Timur Miroshnychenko, the ceremony will see all 37 acts take to the carpet for a welcome to the city.Eurovision fans lined one side of the carpet, waving flags and scarves to support their countries.",
        "Preparations are in full swing in city, which is hosting the contest instead of Ukraine because of the Russian invasion.The Eurovision Village, at the city's Pier Head, opened on Friday with a performance from last year's winners Kalush Orchestra and Scissor Sisters' Jake Shears performed there on Saturday after a screening of the coronation.The first Eurovision semi-final will take place on Tuesday.",
        "Favourites for the contest include the UK's Mae Muller, France's La Zarra and Spain's Blanca Paloma.Muller has said her training for Eurovision has been 'like bootcamp' as she reflected on the challenges of being an up-and-coming artist in the music industry. The 25-year-old singer will represent the UK at the song contest in Liverpool in the grand final on May 13 with her track I Wrote A Song, which features tongue-in-cheek lyrics about a cheating ex-boyfriend and a propulsive dance beat. In an interview with The Sunday Times, Muller admitted she is keen to do well in the competition but that it has been 'non-stop for two months', describing it as 'like boot camp'. The London-born singer was confirmed as the UK's Eurovision act in early March and has since been at a number of Eurovision events ahead of the big day including meeting the King and Queen. ",
        "Muller joined the royal couple when they unveiled the contest's spectacular stage in Liverpool, with Charles telling her: 'We will be watching you with great interest - egging you on.' She also has pressure following in the footsteps of Sam Ryder who came in second place last year with his uplifting pop song Space Man, giving the UK its best result for more than 20 years. His success meant the UK was chosen to host this year's competition on behalf of war-torn Ukraine as it continues to face the Russian invasion. Alongside these pressures, Muller also reflected on how the evolution of the music industry towards streaming and viral moments has added extra strain. She told the newspaper: 'My label said not to rush. I came just before TikTok was a thing, so I didn't need viral success overnight. ",
        "'They wanted to develop me and that is a dying idea because after TikTok took over it's all about how fast you can go. That's sad. 'The whole point of a label is to give you time, but now they don't sign anyone unless they've had a viral hit already.' She added: 'It's no longer: 'My song is on the radio. I've made it.' There are a lot of boxes to tick. ",
        "'It depends on what your version of success is, but it is weird. I'm sat at home with seven million monthly listeners and think: 'But how well is it actually going?' It can be jarring.' "
    ]
}