{
    "articleURL": "/money/markets/article-12057243/Rates-pain-way.html",
    "content": [
        "Bank is expected to hike rates from 4.25% to 4.5% as it tries to curb inflationIt will mean a 4.4 percentage point jump since December 2021 That would mark the sharpest rise since 1989 Homeowners are set to see interest rates rise for the 12th time in 18 months this week – and have been warned they could jump as high as 5 per cent by December.",
        "The Bank of England is expected to hike rates from 4.25 per cent to 4.5 per cent on Thursday as it tries to curb inflation.It will mean a 4.4 percentage point jump since December 2021 – marking the sharpest rise since 1989.",
        "There have been hopes that this increase would be the final in a series of hikes by the Bank – especially since the US Federal Reserve hinted that it would be pausing its own aggressive stance.But economists have warned that if inflation – which is currently at 10.1 per cent in the UK – remains high, further measures will need to be taken.Prices have not dropped as quickly as the Bank had hoped – missing the 9.8 per cent rate expected in March.Analysts at Capital Economics believe rates could peak as high as 5 per cent if inflation keeps rocketing. This spells further misery for homeowners.Laith Khalaf, head of investment analysis at AJ Bell, said inflation is 'stickier than anticipated,' meaning that a 5 per cent base rate is feasible in the coming year.However, he said the ongoing turmoil in the global banking sector would help cool the economy and potentially lessen the need for interest rates to rise that significantly.The US Federal Reserve last week increased its key interest rate by 0.25 percentage points, pushing its benchmark rate to between 5 per cent and 5.25 per cent. It is the highest level in 16 years. ",
        "But the Fed hinted that it was ready to pause its aggressive path, amid a string of bank failures and a budget stand-off in Washington.A number of midsize US banks, including Silicon Valley Bank, Signature Bank and First Republic, have collapsed or been taken over in recent months.Fed chairman Jerome Powell said a decision had not been made about whether to pause but his comments seemed to lack the previous insistence that there was further to go. 'We are prepared to do more if greater monetary restraint is warranted,' he said.The European Central Bank (ECB) also recently raised interest rates by 0.25 percentage points to 3.25 per cent. Eurozone inflation stands at 7 per cent – more than triple the ECB's 2 per cent target rate.",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}