{
    "articleURL": "/wires/reuters/article-12043541/Mexico-president-asks-Biden-stop-USAID-funding-opposition-groups.html",
    "content": [
        "By Sarah Morland",
        "MEXICO CITY, May 3 (Reuters) -Mexico's president asked his U.S. counterpart Joe Biden to stop the United States Agency for International Development (USAID) from funding groups hostile to his government, according to a letter presented to journalists on Wednesday, echoing previous Mexican criticism of U.S. interventionism.President Andres Manuel Lopez Obrador did not specify which Mexican groups the U.S. should stop funding, but he has in the past accused several media organizations of being part of a conservative movement against his government.\"The U.S. government, specifically though USAID, has for some time been financing organizations openly against the legal and legitimate government I represent,\" he said in the letter.\"This is clearly an interventionist act, contrary to international law and the relations which should prevail between free and sovereign states.\"The letter calls for Biden's intervention, saying the U.S. State Department in recent days announced that USAID would increase its funding toward such organizations.Mexico had in 2021 sent a similar letter asking USAID to withdraw funding allocated to non-governmental organizations critical of the government.The president has previously criticized USAID-backed free speech group Article 19 as well as Mexicans against Corruption and Impunity (MCCI), which has for years reported on alleged corruption and lack of transparency in the current and previous administrations.",
        "The State Department, USAID, MCCI and Article 19 did not immediately respond to a request for comment.The latest letter comes days after the president backed a proposal to scrap Mexico's freedom of information body, INAI; Lopez Obrador argues many autonomous bodies are biased against him and waste public funds.On Tuesday, the U.S. launched a new program intended to defend journalists around the world from legal threats.The State Department has said there are credible reports on restrictions on free expression and media in Mexico - the deadliest country for journalists last year.The U.S. has proposed a $63.1 billion 2024 budget for the State Department and USAID, which it says \"will make it possible for us to continue to promote U.S. national interests and lead the world in tackling global challenges.\"(Reporting by Sarah Morland and Raul Cortes; Editing by Josie Kao)"
    ]
}