{
    "articleURL": "/tvshowbiz/article-12039783/Jackie-O-Henderson-reveals-got-radio-job-teenager-dating-older-host.html",
    "content": [
        "Jackie 'O' Henderson has opened up about how she got her start into Australian radio.",
        "The KIIS FM star, 48, told her fellow co-host Kyle Sandilands that her foot in the door was all thanks to her ex-husband and radio DJ, 'Ugly Phil' O'Neil.The ex-couple met when an 18-year-old Jackie called into the radio show Phil was hosting at the time to enter a competition, and they were married just a year later. Jackie explained that while she was living on the Gold Coast as a teen, she would ring up Sea FM in the early 90s in a bid to score Guns N' Roses concert tickets.'I never worked at Sea FM,' she said, adding that Ugly Phil took her out 'on a date' after asking her to come and visit the radio station and collect the concert tickets.",
        "Jackie recalled the pair had only been together for three months before he was offered a radio job in Canberra.'I moved with him because we were in a relationship,' she added.They then relocated to Adelaide where Jackie got offered a job 'on the phones' at the station where Phil hosted - after an employee got fired for 's**t-canning' staff members in her diary that someone found on her desk and read.'The rest is history,' Jackie said.",
        "Phil and Jackie previously worked together co-hosting the Hot30 Countdown in the 1990s.",
        "Their split in 1999 led to their radio show ending and Phil returning to the UK.Jackie separated from her second husband, Lee Henderson, in October 2018 after 15 years of marriage.The Hendersons met in the year 2000, married in 2003, and welcomed daughter Kitty in late 2010.",
        "She has not publicly dated anyone since the split, but British photographer Lee has moved on with jujitsu instructor Gabriella Motta.The former couple share custody of their daughter, who is now 12 years old.Last year, the Sydney-based radio presenter revealed she hasn't been on a date in almost four years because she's 'scared to get out there'.'I am definitely not ready other than what I have got going on right now,' Jackie said.",
        "'I just don't know when I'd have the time [to date]. I really like being on my own for now.' She added: 'I've never been on a date since I split with my husband. I am also really scared to get out there and have that first date.'Jackie also credited her KIIS FM co-host Kyle Sandilands and their radio show with helping her get through her separation.'It's almost my saving grace, in a way. Kyle is extremely supportive. He knew what was going on before anyone else did,' she explained.",
        "She added: '[Kyle] is a vault – he will never tell anyone.'"
    ]
}