{
    "articleURL": "/wires/reuters/article-12039455/MORNING-BID-ASIA-Crisis-Dont-bank-it.html",
    "content": [
        "By Jamie McGeever",
        "May 3 (Reuters) - A look at the day ahead in Asian markets from Jamie McGeever.Maybe the U.S. banking turmoil of March 2023 wasn't boxed up, tied with a bow, and neatly shelved for posterity after all.Shares in regional U.S. banks got clobbered on Tuesday - PacWest BanCorp lost a quarter of its market cap - setting a gloomy and defensive tone for Asian markets on Wednesday ahead of the Federal Reserve's latest interest rate decision.The U.S. regional banking index tanked 5.5% on Tuesday, its biggest fall since the depths of the crisis in mid-March. The index is at a two and a half year low and has lost a third of its value in the last two months.Not coincidentally, renewed fears over the U.S. banking system following JP Morgan's recent takeover of failed First Republic Bank also dovetailed with unexpectedly weak U.S. jobs data and increasing alarm over the U.S. debt ceiling standoff.In addition, global jitters intensified on Tuesday - the Reserve Bank of Australia's shock rate hike, a downbeat bank lending survey from the European Central Bank, and a 5% slump in oil prices painted a gloomy picture for the world economy.Brent crude oil is now down almost 30% year-on-year - a huge disinflationary impulse for the world economy.",
        "This may play into Malaysian policymakers' thinking as they prepare to deliver their latest interest rate decision on Wednesday. Twenty one of 25 economists polled by Reuters expect the key interest rate to be kept on hold at 2.75% for a third consecutive meeting, with the other four predicting a quarter point hike.Not only that, Bank Negara Malaysia is expected to keep rates on hold for the rest of this year and all of next, according to the Reuters poll.As the RBA reminded everyone on Tuesday, however, policymakers still retain the ability to surprise. Surely the Fed won't throw a curve ball later on Wednesday, will it?Markets are pricing in a 15% chance of no move, a small but not negligible chance, and an 85% probability the Fed will deliver one final 25 basis point hike.But that's what Asian markets will be waking up to on Thursday. Before that on Wednesday they have the Malaysian rate decision, services PMI data from Australia and India, and South Korean FX reserves to offer local direction.Here are three key developments that could provide more direction to markets on Wednesday:- Malaysia interest rate decision- India, Australia services PMIs (April)- U.S. Fed interest rate decision(By Jamie McGeever;)"
    ]
}