{
    "articleURL": "/news/article-12048805/Mongols-Penrith-president-Kaelib-Waititi-Fitzgerald-dead-33.html",
    "content": [
        "Bikie boss, 33, died of 'natural causes'Had previously admitted his drug habit A Sydney bikie boss has died suddenly at the age of 33 after previously begging a court to let him out of jail early to tackle his out-of-control drug habit.",
        "Kaelib Waititi-Fitzgerald, former president of the Mongols Penrith chapter in Sydney's west, died of 'natural causes' on Wednesday, his grieving family have revealed.'To know him was to love him,' his younger brother Steele Fitzgerald posted in a gushing online tribute.Waititi-Fitzgerald had been in and out of jail over the past eight years for gun crimes, including a six-year sentence for shooting up a car in a Penrith car park.He was out on bail for that when his Holden Commodore was pulled over by police in January, 2020 and they found a stolen loaded shotgun, ammo, meth and steroids.",
        "Waititi-Fitzgerald was immediately thrown back in jail for breaching his parole - but later pleaded with a court to set him free so he could go into rehab.He told the court he had a long-term drug problem which had worsened behind bars because of the 'unfortunate ease of obtaining drugs in custody'.His lawyer told Penrith Local Court that he wanted to be released from prison to go into a drug rehabilitation centre for the sake of his daughter, then seven.The bikie claimed he was at a 'crossroads' in his life and hoped 'to be the father he wants to be' to his child.But the bid for bail was revoked and he was returned to jail.",
        "Just five days before his death he posted a picture on Facebook of himself with his daughter at the Sydney Easter Show with a horde of showbags.He also posted a picture of his daughter with his nephews as his cover shot, which replaced an earlier photograph of a Mongols Inner West bikie club poster.'May the memories we all share with Kaelib give us strength in the days that lie ahead and we remember him for the loving, affectionate soul that he was,' posted his brother.",
        "'A father who wanted to give his daughter the world, an uncle who wanted to show his nephews the world, and a brother and son who’s family was his world.'His sister in law Rene Lock said the children were 'his all-time favourite people' and added: 'You were the biggest pain in my ass but I wouldn’t have had it any other way.'I feel lost already without your millions of calls today...thank you for loving us the way you did. Love you - always my favourite.'Police said there were no suspicious circumstances to the the death which was 'natural causes'. "
    ]
}