{
    "articleURL": "/wires/ap/article-12045449/Marseille-Lens-pivotal-contest-Champions-League-spot.html",
    "content": [
        "Lens has been almost invincible at home this season. Marseille has been flourishing on the road.",
        "The two meet this weekend in the former coal mining town for a showdown likely to decide who ends up runner-up in the French league.And, who knows, in light of leader Paris Saint-Germain´s troubles, the game in Lens on Saturday could produce a credible last-minute challenger for the title.With five rounds left, second-placed Marseille has closed the gap to just five points after Lorient inflicted a sixth defeat of the season on PSG by 3-1 at Parc des Princes last weekend.\"The title? We are still hoping for it,\" said Marseille defender Jonathan Clauss, who will be returning to his former club.PSG travels to Troyes on Sunday without Lionel Messi, who has been suspended for taking a trip to Saudi Arabia without the club´s permission.",
        "Under the guidance of coach Igor Tudor, Marseille has been building its quest for a first league title since 2010 away from Stade Velodrome, winning 12 of 16 matches on the road and losing just one.In addition to bringing back ambition to the nine-time champion, Tudor has developed an attacking and demanding style of play based on pace, tempo and hard press. Marseille has been transformed into one of the most attractive teams in the league.Last week, Tudor's coaching paid off when Matteo Guendouzi and club icon Dimitri Payet came off the bench at the same time to help their team come from behind in a much-needed 2-1 win against Auxerre.",
        "Up front, Chile international Alexis Sanchez has found his old form and has 17 goals in all competitions, more than in his previous two seasons combined at Inter Milan.Without the big names of star-studded PSG, Lens has also been impressive, boasting the best defensive record with only 25 goals conceded. Sitting just one point behind Marseille, the club hopes to claim a second league title although coach Franck Haise has played down his team´s chances.\"We took a big step towards a podium finish but we still have a lot of battles to fight,\" Haise said after Lens won at Toulouse midweek. \"Appetite will be needed (against Marseille), that´s for sure. There will be some on the other side. It´s a great game to play, the second against the third with five matches to go. It´s not insignificant.\"Lens combines solid defending with fast transitions to the wings in an enthralling counterattacking style that should pose serious problems to Tudor's players in front of the buoyant fans at Stade Bollaert-Delelis, where Lens has lost only once this season.\"It´s my favorite place to play. The fans and the atmosphere gives us that little bit extra,\" defender Kevin Danso said. \"It´s a fortress. We feel good here. All teams who come here should be worried, because we´re at 100%, and the fans are behind us.\"",
        "And with Loïs Openda's form growing stronger after losing his starting spot earlier this year, Lens has a strike weapon. The Belgium international has nine goals in his last seven league matches to take his season tally to 18.___More AP soccer: https://apnews.com/hub/soccer and https://twitter.com/AP_Sports"
    ]
}