{
    "articleURL": "/wires/reuters/article-12055697/Union-extend-unbeaten-streak-vs-Red-Bulls-10-win-1-0.html",
    "content": [
        "Daniel Gazdag scored on a penalty kick in the 31st minute and the Philadelphia Union extended their unbeaten streak over the New York Red Bulls to 10 games with a 1-0 victory Saturday night in Harrison, N.J.",
        "Gazdag scored after New York's Dylan Nealis fouled Julian Carranza near the left side of the box in the 26th minute, and the original call was upheld via video review. Gazdag stepped into the penalty kick and got New York goalie Carlos Coronel to go to the left as the ball sailed into the bottom of the net.Including two playoff games, the Union are 7-0-3 against the Red Bulls since a 2-0 loss on Sept. 22, 2019. Philadelphia (4-4-2, 14 points) also won its second straight game following a five-match winless skid, and the defending Eastern Conference champions bounced back from a disappointing 3-0 loss to Los Angeles FC in the semifinal of the CONCACAF Champions League on Tuesday.Goalkeeper Andre Blake made three saves while his teammates blocked eight of New York's 17 shots. Blake notched his second shutout this season and 67th of his career while also surviving a brief injury scare in the second half.Blake was tripped up in the open field outside the box by former teammate Cory Burke. Burke tripped Blake, whose right elbow hit the grass hard, and a yellow card went to Burke in the 68th minute.The Red Bulls (1-4-6, nine points) saw their winless skid reach seven games (0-3-4) and were blanked for the fifth time this season.",
        "Coronel made one save but also allowed a goal on a penalty kick for the sixth time in his career.Before Gazdag scored, Blake kept the game scoreless by making a leaping save on John Tolkin to prevent him from scoring into the top left corner in the 10th minute.Six minutes after Gazdag scored, Tolkin had consecutive attempts blocked from close range and Cristian Casseres Jr. missed the net in the 44th minute.Blake kept the shutout by stopping Tolkin in the 63rd, and 10 minutes later Burke missed the net on a header from the right side.--Field Level Media"
    ]
}