{
    "articleURL": "/tvshowbiz/molly-mae-hague/article-12061515/Inside-Tommy-Furys-24th-birthday-celebrations-girlfriend-Molly-Mae-Hague-daughter-Bambi.html",
    "content": [
        "Tommy Fury celebrated his 24th birthday on Sunday, with girlfriend Molly-Mae Hague pulling out all the stops for his special day.",
        "The former Love Island star, 23, spoiled the boxer with a number of lavish surprises along with their baby daughter Bambi.She took to her Instagram Stories to show her followers all of Tommy's birthday treats.Molly-Mae first surprised him by waking him up to a load of presents and a special cake made to look like a boxing ring decorated with a pair of gloves.She decorated their home with several colourful balloons and a large photo display which read: 'Happy birthday Daddy! We love you so much, our champ'.  ",
        "She then later surprised him with a night away in a fancy hotel which was decorated with more balloons and loved-up snaps of the couple.The PrettyLittleThing Creative Director went all out and the pair enjoyed a bottle of champagne together.Molly-Mae also took to her Instagram grid to share a sweet video of Tommy with their daughter Bambi. Alongside the clip, she penned: 'Happy Birthday to my dream man. You have no idea how much I love you. Just us, forever and always baby!'The couple kept the festivities going as they also visited a driving range with Bambi to enjoy a spot of golf.It comes after Molly shared a heartwarming snap of Tommy Fury 's mum with their little daughter Bambi.",
        "The influencer took to her page as she posted a rare picture of his mother Chantal cradling the little one in her arms.",
        "Earlier on Saturday, the influencer also shared a snap showing a bouquet of white roses in the backseat of the car as Tommy drives.She penned it: 'Tommy's mum's birthday.'The couple appeared to be meeting Chantal at the Trafford Centre in Manchester - as the grandma made one very rare appearance.Chantal - who is of Mauritian descent - has avoided the spotlight as much as possible in the past, but she did appear on the 2019 season of Love Island when her son was starring in the show.Meanwhile, Tommy's shares his father John with WBC heavyweight champion Tyson Fury - who trains him.Tommy and Tyson are also 11 years apart and have three other brothers.",
        "Molly-Mae kept delighting followers with sweet snaps of her daughter as shared an adorable photo of her daughter Bambi on Saturday morning. As the influencer celebrated the King's Coronation, she said that their child was a 'happy girl.' The snap she posted showed Bambi dressed in a comfy brown baby grow as she lay in a bouncer smiling.Molly-Mae wrote: 'Good morning happy girl' as a caption to the sweet Instagram story post."
    ]
}