{
    "articleURL": "/sport/football/article-12059157/Championship-permutations-five-teams-battle-make-play-offs.html",
    "content": [
        "Five teams will scrap it out to make the Championship play-offs on MondayCoventry and Millwall are in the driving seat to join Luton and MiddlesbroughSunderland, West Brom and Blackburn though could still make the play-offs The Championship season comes to an end this afternoon and there is a fierce race in the battle to make the play-offs.",
        "Burnley and Sheffield United have already been promoted, while Reading, Blackpool and Wigan have all been condemned to League One, but there are five teams looking to join Luton Town and Middlesbrough in the play-offs.  The final two spots are currently occupied by Coventry and Millwall, but Sunderland, West Brom and Blackburn all still have aspirations of promotion to the Premier League via the play-offs.As things stand, Coventry are in the strongest position on 69 points, one ahead of Millwall and three ahead of Sunderland, West Brom and ninth-placed Blackburn Rovers.  Mail Sport takes a look at the permutations and what each team needs to make the play-offs. ",
        "Play-off permutations Coventry go into the final day of the season in the strongest position. They simply need to avoid a defeat against Middlesbrough to join Michael Carrick's side and Luton in the play-offs.However, should they suffer a defeat in their tricky trip to Teeside, they will have to hope their superior goal difference advantage over Sunderland, West Brom and Blackburn will be enough to keep them up.Should they lose and Sunderland win, then it's likely the Black Cats will at the minimum match Coventry's goal difference tally which currently stands at +12. Then it will go down to goals scored which Sunderland have netted 65 times this season compared to Coventry's 57. ",
        "Millwall need a victory against Blackburn to safely secure their play-off spot, but a defeat will see them knocked out of the top-six by their opponents.A draw also might not be good enough as victories for Sunderland and West Brom could see them jump ahead on goal difference. ",
        "Sunderland travel to Preston hoping that Middlesbrough and Blackburn can do them a favour against Coventry and Millwall respectively.Should they take a win at Deepdale, they will need Coventry to suffer a defeat or Millwall to get no better than a point.Sunderland's superior goal difference (+10) compared to West Brom (+7) and Blackburn (-3) means they shouldn't need to worry about the sides behind them as long as they win - unless the Baggies pull off a big result away at Swansea. West Brom need a victory against Swansea to make sure they have a chance of promotion.Should they beat Swansea and Millwall draw, the Baggies would likely finish ahead as they would no longer have an inferior goal difference tally and have also scored three more goals this season.Even if they finish ahead of Millwall though they could still finish behind Sunderland on goal difference if the Black Cats also take three points. To avoid this, they would need their margin of victory to be four goals higher than what Sunderland are able to achieve.",
        "To finish ahead of Coventry, they need the Sky Blues to suffer a defeat and for there to be a swing of five in the goal difference tally. Blackburn's best hope is that they beat Millwall and that Sunderland and West Brom fail to beat their respective opponents.  Their goal difference tally of -3 makes it highly unlikely they will make the play-offs if it comes down to this tie-breaker.",
        "League Two permutations It is also the final day of the season in League Two where it has already been confirmed that Leyton Orient have been promoted as champions with Stevenage also joining them.Northampton Town and Stockport County will battle it out to join them in League One. Stockport need to beat already relegated Hartlepool at home and hope that Northampton fail to beat Tranmere. Northampton hold a two-point lead going into the final day, but Stockport have a +9 goal difference advantage on their rivals meaning even a draw for Jon Brady's side won't be enough.Whoever doesn't get automatically promoted is currently set to be joined by Carlisle United, Salford City and Bradford City in the play-offs - though Mansfield Town hope to knock one of those three teams out on the final day.Mansfield are three points behind Carlisle, Salford and Bradford and they will need to beat Colchester and hope one of the other teams suffer a heavy defeat.",
        "Carlisle's superior goal difference advantage means it's unlikely they will slip out with a defeat, though Salford would be vulnerable if there is a four-goal swing and Bradford with a three-goal swing. "
    ]
}