{
    "articleURL": "/wires/reuters/article-12059817/CANADA-STOCKS-TSX-starts-week-upbeat-note-energy-stock-rise.html",
    "content": [
        "Canaccord falls, flags risk to planned go-private deal",
        "Energy sector top gainer as oil prices climbTSX up 0.3%(Updates prices to market open, adds sector move in paragraph 3 and 5, adds analyst comment in paragraph 4, adds individual stock news in paragraphs 8-10)By Shashwat ChauhanMay 8 (Reuters) - Canada's main stock index extended gains on Monday, with energy stocks leading the surge in commodity-heavy bourse as oil prices inched nearly 3% higher.At 10:15 a.m. ET (1415 GMT), the Toronto Stock Exchange's S&amp;amp;P/TSX composite index was up 57.54 points, or 0.28%, at 20,599.57, after rising 1.5% on Friday.Canada's energy sector gained 0.7%, tracking a more than 2% rise in oil prices as fears of recession in the United States eased, while some traders said that crude's recent sell off was overdone with three straight weekly declines for the first time since November.\"It's the economically sensitive areas of the market driving the TSX higher as investors grow more optimistic about the prospects of a soft landing for the economy,\" said Brandon Michael, senior analyst at ABC Funds in Toronto.The materials sector, which houses precious and base metal miners and fertilizer companies, added 0.1% as gold prices edged higher against a softer dollar.The dollar weakened at the start of a week, which is packed with economic data as prospects for a interest rate cut in the U.S. gained traction.",
        "U.S. April inflation data expected later in the week is to help drive investors assess the economic conditions, while corporate earnings for the first quarter near completion.Canaccord Genuity Group Inc slumped 13.0% after a group led by its management said that there could be \"no assurance\" that their proposed C$1.13 billion ($850 million) take-private deal for the financial services firm would be completed, citing delay in securing regulatory approvals.AltaGas Ltd gained 1.5% after naming Enbridge Inc's Vern Yu as the company's next president and CEO, effective July 1, 2023.Westshore Terminals Investment Corp surged 5.2% after TD Securities and Scotibank raised their price target on the marine port services company. (Reporting by Shashwat Chauhan in Bengaluru; Editing by Shilpi Majumdar and Shweta Agarwal)"
    ]
}