{
    "articleURL": "/wires/ap/article-12045115/Golden-Knights-beat-Oilers-6-4-despite-Draisaitls-4-goals.html",
    "content": [
        "LAS VEGAS (AP) - Golden Knights coach Bruce Cassidy could only laugh at the brilliance that was Leon Draisaitl, who scored four goals to nearly beat Vegas by himself.",
        "However, the Golden Knights prevailed in Game 1 of the second-round playoff series because their depth was the difference in Wednesday night's 6-4 victory over the Edmonton Oilers.Ivan Barbashev scored two goals, including one that put Vegas ahead for good, and he was one of five Knights players to find the back of the net.It was the second night in a row a team had won despite allowing an opposing player to score four goals. Seattle beat Dallas 5-4 on Tuesday even with Joe Pavelski scoring four goals for the Stars. Teams with a player scoring four goals had been 36-3 before that game in the playoffs, and it had been 30 years since a team had overcome such a performance.This was the Oilers' first regulation loss since March 11.\"Overall, we weren't good enough,\" Draisaitl said. \"It's not even close to how we play. We've got to move on, and we'll be better.\"",
        "In addition to Barbashev, the Knights also received goals from Chandler Stephenson, Michael Amadio, Mark Stone and Jack Eichel. Eichel's goal was an empty netter from deep in his zone, and he and Stone also each had an assist. Zach Whitecloud had two assists.Evan Bouchard, Mattias Ekholm, Zach Lyman and Connor McDavid each had two assists for the Oilers.",
        "\"I don´t think our team was anywhere near where it needed to be in order to walk away with a road win in the playoffs,\" Edmonton coach Jay Woodcroft said. \"Leon had a great effort. He's been good all playoffs, but our team can do things a lot better than we did tonight.\"Game 2 is Saturday in Las Vegas.Draisaitl extended his goal streak to four games, and he has at least a point in all seven playoff games. He had never scored four goals in a playoff game, and had reached that mark just once in the regular season - March 2, 2020, against Nashville.Draisaitl has 11 goals in the postseason.\"Does that sound funny to you, 11 goals in the second round,\" Cassidy said. \"That is unbelievable.\"Two of his goals against Vegas came on the power play, making Edmonton 11 of 19 this postseason with the man advantage. The Oilers set an NHL record during the regular season by converting 32.4% of their chances.One goal, at even strength, came at the end of the first period when Draisaitl bounced a puck off Knights goalie Laurent Brossoit from the goal line.This series was billed as the Oilers' star power against the Knights' balanced attack, and that's how the opening game played out. Vegas found a way even with one of the NHL's most dynamic scorers having a career night.",
        "\"We used our four lines,\" Cassidy said. \"We didn't have to get too far away from our line combinations. We're aware of their top guys and the damage they can do, but we like our team. We feel like if our team plays well, we'll have success.\"After Draisaitl scored on a power play less than two minutes into the third period to make the score 3-3, the Knights took the lead for good with two goals in 50 seconds. Barbashev scored on a rebound and Stephenson from the right circle.\"It doesn't matter who scores, them or us, the next shift is huge,\" Barbashev said. \"I think we did a better job by that. It feels good.\"NOTESOilers forward Mattias Janmark took an awkward spill into the boards in the first period and was taken into the locker room. ... Edmonton goalie Stuart Skinner is one of three finalists for the Calder Trophy, which goes to the league's top rookie. ... In addition to Draisaitl, Bouchard also has points in all seven games this postseason, and McDavid has a six-game point streak. For Vegas, Mark Stone has points in five consecutive games.___AP NHL playoffs: https://apnews.com/hub/stanley-cup and https://twitter.com/AP_Sports"
    ]
}