{
    "articleURL": "/money/markets/article-12047487/Vodafone-Three-UK-close-15bn-mega-merger.html",
    "content": [
        "Vodafone and the owner of Three UK are closing in on a £15billion merger to create the country’s biggest mobile phone operator.",
        "Insiders suggest a deal could be made between Vodafone and Hong Kong-based CK Hutchison this month, putting roughly 28m customers in Britain on its combined books.However, analysts warn that regulators could be concerned about a lack of competition.The telecom giants have reportedly been in talks for nearly a year as both face pressure to drive down costs and streamline.",
        "The agreement is set to value the combined group at around £15billion, according to the Financial Times.It comes just a week after Vodafone said that temporary chief executive Margherita Della Valle will now fill the role permanently.She was the chief financial officer but became interim boss after Nick Read was ousted last year. The search for a replacement dragged on for nearly five months, sparking uncertainty about whether anyone was willing to take the role on.Karen Egan, telecoms expert at Enders Analysis, said the combination of Three and Vodafone could transform the fortunes of struggling operators, with Three UK on a ‘downward spiral’ as the country’s smallest player behind BT-owned EE, Virgin Media O2 and Vodafone.Analysts have criticised Britain’s overcrowded telecoms market, calling for consolidation to cut costs and boost investment in technology.But some are concerned about regulatory pushback, which prevented Three’s takeover of O2 in 2016.",
        "Paolo Pescatore, analyst at PP Foresight, said the Competition and Markets Authority (CMA), which blocked the takeover of Call of Duty owner Activision Blizzard by Microsoft, could pose a threat.‘The only chance it has of getting over the line is whether both parties can demonstrate that this is in the genuine interests of UK plc,’ he said.Analysts at Enders suggest that the CMA is not demonstrating the ‘pro-business approach’ needed for the deal to go through. Vodafone shares fell 1.7 per cent, or 1.64p, to 94.52p.Vodafone and CK Hutchison declined to comment.",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}