{
    "articleURL": "/wires/ap/article-12039549/South-Carolina-Democrats-frustrated-no-hate-crime-law.html",
    "content": [
        "COLUMBIA, S.C. (AP) - Democrats in the South Carolina Senate turned debate about a bill to set guidelines for history curriculum on subjects like slavery and segregation into discussion about why the body can't take a vote on a hate crimes bill.",
        "South Carolina and Wyoming are the only states in the U.S. without a law allowing extra punishment for hate crimes - which a judge or jury determines were motivated by hate over someone's race, ethnicity, religion, sex, gender, sexual orientation, age, national origin, or physical or mental ability.For the past three years, a hate crimes bill has made it through the South Carolina House and to the Senate floor, only to stop there. The outlook for the bill this year is grim. The Republican-dominated chamber has not held any debate or brought the proposal up for a vote despite the support of survivors of a racist attack that killed nine at a Charleston church, in addition to business leaders.\"You look at the news all day long, I think we can agree, hate is all around us. Hate exists. So why is this bill more important than the hate crime legislation?\" Democratic Sen. Kevin Johnson asked.\"This bill actually has the potential to address hate,\" said Republican Senate Majority Leader Shane Massey, about allowing students to come to their own conclusions based on facts about the history of slavery and segregation. \"That bill doesn´t. That bill isn´t going to change how people act.\"The bill would allow a judge to add an additional five years in prison to an offender's sentence - if they are indicted and convicted for a violent crime that is proven to be motivated by hate toward the victim´s race, religion or other backgrounds.",
        "It is named the \" Clementa C. Pinckney Hate Crimes Act \" after the Black South Carolina senator and pastor who was killed in June 2015, along with eight of his church members in a racist attack at a Charleston church. The shooter was convicted of federal hate crimes and sentenced to death.Supporters have brought in the survivors of the attack to urge lawmakers to pass the bill. They have gathered dozens of business leader s to say the lack of a hate crimes bill makes South Carolina look backward and less business-friendly.So far, Massey, who in his role as chair of the Senate Rules Committee and as the party leader in the chamber, is the public face against the proposal. He has said before that he doesn't think it will solve the problem of hate.Democratic Sen. Darrell Jackson said uncertainty over a bill's impact hasn't stopped the Senate from voting for meaures before that even if they don't have a huge impact, say something about what the state thinks is important or believes in.\"Why chose hate crimes as the one bill you are going to put the flag down on?\" Jackson asked. \"The one bill that we are going to say that is when we are putting an end to the feel-good stuff?\"",
        "Massey said he thinks it would further division.\"There are a number of people who think that not only is it feel-good legislation, it is bad legislation,\" Massey said.Debate on the education bill will continue Wednesday. Supporters said it will allow teachers to teach lessons about the history of racism and slavery in the U.S.It also sets up an appeal process for lessons or books that a parent thinks are inappropriate for a child starting at the principal, then moving to the superintendent, local school board and state school board. Appeals would be limited to parents and guardians.Despite the diversion Tuesday, there is no indication the hate crimes bill has a chance in the final five days of the 2023 session.Democrats, who only have 16 of the chamber´s 46 seats, can´t get past objections by a handful of Republican senators that have prevented the hate bill from coming up for debate.Republicans meanwhile can use special legislative maneuvers to get past Democratic objections to bills like Tuesday´s education proposal and have done so repeatedly since gaining three seats in the 2020 elections.The side debate on hate crimes between Jackson and Massey was at times contentious. Jackson suggested Massey knows he doesn't have the votes to defeat the bill, so he is thwarting the will of the people by not even letting it come up.",
        "\"Respectfully, if we have folks on the left who don´t like the agenda that is being set, go out and win a fricking election,\" Massey said."
    ]
}