{
    "articleURL": "/wires/aap/article-12044999/Bulldogs-brace-match-villain-Toby-Greene.html",
    "content": [
        "Western Bulldogs coach Luke Beveridge is backing his in-form defence to curtail the impact of match-winner Toby Greene in Saturday's grudge match against GWS.",
        "Greene booted seven goals in his most recent outing against the Bulldogs last year and enters Saturday night's clash at Manuka Oval in hot form having booted the match-winning goal in last week's one-point win over Sydney.The 29-year-old is viewed as a villain among Bulldogs fans after being charged with eye gouging Marcus Bontempelli in the 2019 elimination final.He was later cleared of that charge at the AFL Tribunal, instead being fined for the lesser offence of vigorously rubbing the face and pulling the hair of Bontempelli.Nevertheless tensions have remained heightened any time Greene comes up against the Bulldogs.The Bulldogs have conceded an average of just 68 points across the past three weeks and Beveridge is confident of continuing that strong defensive form this week.But he's well aware of the unique challenge of halting the influence of Greene.\"Even when we beat them at their home ground prior to the game at Marvel last year he (Greene) kicked seven against us,\" Beveridge told reporters on Thursday.\"We had some prolific forwards that day - (Aaron) Naughton and Cody (Weightman) both kicked five each.\"But we allowed GWS to score too easily. We weren't anywhere near as effective as we needed to be as a defensive unit and system.",
        "\"Toby Greene is a phenomenal player and we need to make sure we curtail him.\"I absolutely back in our back seven especially after their contributions over the last few weeks.\"We're in good order and he'll be a real challenge and handful for us, but so will be some of their other forwards.\"The Bulldogs and GWS have built up a strong rivalry, first sparked by the epic 2016 preliminary final won by the Bulldogs by six points, and spiteful clashes between the teams in 2019.Trades of Callan Ward (Bulldogs to GWS), Ryan Griffen (Bulldogs to GWS) and Tom Boyd (GWS to the Bulldogs) have added to the spice.First-year GWS coach Adam Kingsley talked up the rivalry against the Bulldogs this week, and Beveridge acknowledged the history.The Bulldogs have won four straight against GWS.\"There's been some great history there, some stimulus for rivalry absolutely,\" Beveridge said.\"They've been quite impressive with some of their wins but also their close games as well.\"I thought their win against Adelaide in the heat when they didn't have a bench and they had two or three guys cramping on the ground, I thought it was a phenomenal win for them.\"And a significant sign they are playing for each other.\""
    ]
}