{
    "articleURL": "/wires/reuters/article-12045323/Indias-exports-likely-touch-900-bln-2023-24-exporters.html",
    "content": [
        "By Manoj Kumar",
        "NEW DELHI, May 4 (Reuters) - India´s exports of goods and services could touch $900 billion in the current financial year, up from $770 billion in the previous year, keeping resilient despite global headwinds, a top official of a grouping of exporters said.Merchandise exports could expand to between $495 billion and $500 billion, while services exports could touch $400 billion in the year ending March 2024, said Ajay Sahai, director general of the Federation of Indian Export Organisations (FIEO).Overseas demand remains strong in many markets, he added.Trade Minister Piyush Goyal urged exporters to explore new markets, however, in view of the possible impact of war in Ukraine and a global slowdown.\"The times ahead are going to be very, very tough,\" Goyal said speaking at a industry event late on Wednesday, while warning of the fallout from the conflict.Prime Minister Narendra Modi´s government has set an export target of $2 trillion by 2030, offering benefits to boost exports of electronics, engineering, pharmaceutical, and other goods.India´s exports have increased by more than $200 billion in the last two years, led by a surge in exports of software, mobile exports, and agricultural and petroleum products.Exports of engineering, gems, and jewellery goods have slowed in the last few months, however.",
        "Exports of agricultural, petroleum, and electronic goods remained strong in the Western markets due to pricing factors while exports to Asian and Middle east countries have grown substantially, exporters said.Sahai, who was part of a 50-member business delegation to Russia last week, said there was a huge demand for Indian goods, particularly food, after the Western sanctions imposed over the Ukraine war.\"Indian exporters are hopeful that both countries would soon work out a mechanism allowing payments in local currencies that would facilitate the shipments of Indian goods to Russia,\" Sahai said.But Indian officials have said Russia was reluctant to accept payments in the rupee currency for its oil exports.India has not explicitly condemned Russia's February 2022 invasion of Ukraine and has called for dialogue to resolve hostilities. (Reporting by Manoj Kumar; Editing by Clarence Fernandez)"
    ]
}