{
    "articleURL": "/wires/pa/article-12056583/Derby-miss-play-offs-day-defeat-Sheffield-Wednesday.html",
    "content": [
        "Derby missed out on a League One play-off place following a crushing 1-0 defeat at Sheffield Wednesday.",
        "Captain Curtis Davies’ 41st-minute red card that led to Michael Smith’s match-winning penalty meant the Rams were dislodged from sixth place by Peterborough, who beat Barnsley 2-0.The Owls, who were already guaranteed to finish third in the table and will meet Posh in the play-offs, ended the regular season unbeaten in 23 home games – the club’s longest sequence since January 1981.Following a cagey start to the contest David McGoldrick’s fierce 20-yard drive was turned behind by Wednesday goalkeeper Cameron Dawson.The hosts did not threaten until midway through the first period and, even then, skipper Barry Bannan’s ambitious long-range effort sailed over former Hillsborough team-mate Joe Wildsmith’s crossbar.But Derby went on to press the self-destruct button on the stroke of half-time. Davies under-hit a back pass to Wildsmith and the keeper could only clear as far as Johnson, who Davies fouled to give away a penalty and earn a red card.",
        "Smith confidently went on to claim his 20th goal of the season by sending Wildsmith the wrong way from the spot.A frantic end to the first half might have seen McGoldrick level when his deft chip was clawed over the crossbar by Dawson.Will Vaulks went close to doubling the lead in the second half when he smashed an edge-of-the-box strike against the bar before his follow-up was blocked by Craig Forsyth.",
        "Bannan also fired narrowly wide from distance but the 10 men went close to equalising just before the hour mark when Max Bird’s scuffed shot beat Dawson but was kicked off the line by Aden Flint.McGoldrick warmed Dawson’s hands from long range late on, but Paul Warne’s men could not force the equaliser that would have secured a top-six spot."
    ]
}