{
    "articleURL": "/wires/pa/article-12059765/Carlisle-boss-Paul-Simpson-looking-forward-play-date-Bradford.html",
    "content": [
        "Carlisle boss Paul Simpson is relishing a play-off showdown with Bradford after his side’s 1-1 draw at Sutton secured them fifth place in League Two.",
        "The Cumbrians have limped into the top seven with just two wins from their final 11 games.Kylian Kouassi’s first-half effort was cancelled out by Joe Kizzi’s late own goal at Gander Green Lane.But Simpson’s side are now fully focused on playing Mark Hughes’ Bantams on Sunday before hosting them the following weekend.He said: “I’m absolutely delighted to get into the play-offs. Thankfully we got the point that sealed it and confirmed the play-offs.“It kept us in fifth position and, wow, what two incredible games to look forward to.",
        "“We’ve got Bradford City at their place and I’ve heard they’ve sold out 22,500 home tickets and I expect them to do that next week and I expect us to sell out for our support for that game.“And then what a game to look forward to at Brunton Park the following weekend.“We know we need to be better but it’s an incredible achievement from this group to be in the play-offs from where we started last season.“It’s a brilliant achievement and we have to go and make sure we finish it properly.“I’m not sure if playing the second leg at home makes a massive difference if I’m perfectly honest.“I’m delighted we’re at home for the second leg, that’s a big thing for us. We’ve just got to make sure we make it count.",
        "“We have to make sure we’re still in the tie after the first leg at Valley Parade. Second game you’ve got to go and finish it off.“I expect Mark Hughes and Bradford City to be saying the same thing.”Matt Gray’s U’s stopped the rot after six straight defeats with a final-day point.He said: “It’s so disappointing to concede at the end with a ball that’s taken a deflection off our defender and gone into the bottom corner.“It’s hard to take but overall it was a good performance and a decent result to send us off after another fantastic season.“We’ve been superb this season, to get through as many injuries as we did with the small squad we have here is probably the best spell I’ve had as a manager.“We knew we needed to take advantage of the breeze and the slope here in the first half and we did.“It was a typical Sutton performance, winning the ball high up, turning the ball over and getting on the counter attack.“I knew second half would be different and we’d need to be disciplined and resolute. Our goalkeeper only had one real save to make.“It’s a tight division. I don’t think there’s a big gap between the top and the bottom teams, it’s just the consistency of putting results together.",
        "“They’re a good side and I wish them well in the play-offs.”"
    ]
}