{
    "articleURL": "/sport/nfl/article-12039381/NFL-free-agent-Amani-Bledsoe-SUSPENDED-17-weeks-violating-leagues-PEDs-policy.html",
    "content": [
        "It's the 25-year-old defensive lineman's second PEDs violation in two years  Bledsoe served a six-game ban in 2022 and faced similar troubles in college DailyMail.com provides all the latest international sports news The NFL has suspended free-agent Amani Bledsoe for the first 17 weeks of the 2023 regular season for violating the league's policy on performance-enhancing substances, according to a report from Tom Pelissero. ",
        "It's the defensive lineman's second PEDs violation in two years, after he served a six-game suspension last season.Bledsoe appeared in five games, starting two, for the Tennessee Titans in 2021. He recorded just one tackle and one pass breakup before the Titans waived him on Nov. 15 and moved him onto the practice squad. He also spent the 2020 season with the Cincinnati Bengals, starting four games in 14 appearances and recording 17 tackles. ",
        "The defensive end also lost a year of eligibility in college at Oklahoma for failing a drug test in 2016.At the time, the 25-year-old claimed that he had accidentally digested PEDs because it was stirred up in protein powder that he downed in the form of a shake. He even sued the NCAA to lift his suspension but lost, according to The Oklahoman.",
        "The Falcons signed Bledsoe to a reserve/future contract after he joined the franchise midway through the 2022 season. He was released in April -- a month before the league slapped him with yet another violation of one its strictest policies.Bledsoe never made a professional appearance for Atlanta, though he was thought to be developing with the Falcons' practice squad. His latest suspension is largely assumed to be a threat to his young but stained NFL career.",
        "Since coming into the league undrafted in 2019, Bledsoe's registered 18 tackles and three passes defensed. "
    ]
}