{
    "articleURL": "/wires/pa/article-12058621/Intergenerational-holidays-popular-living-costs-squeeze-budgets-survey-finds.html",
    "content": [
        "Two-fifths (42%) of adults planning holidays this year will be taking a trip with their parents, as rising living costs squeeze families’ travel budgets, a survey has found.",
        "Among holidaymakers aged 35 to 44, many of whom will have their own children living at home, 58% are planning breaks with their parents.And one in 14 (7%) is planning a trip with their grandparents, the poll found.More than a quarter (27%) of parents who are going away with their grown-up children said they are paying some or all of their offspring’s travel expenses, to help them out during the cost-of-living crisis, according to the research.The survey. commissioned by Starling Bank, also indicates that families plan to spend an average of £2,671 on holidays this year, with Spain, France and Italy being popular as proposed destinations. Family trips can be expensive, especially when paying for other people, so making sure you are smart with your spending can help balance the holiday budget  Helen Bierton, Starling Bank  People living in the South East of England will be spending the most on family holidays this year, at an average cost of £3,051, the research suggests.",
        "Families in Yorkshire and the Humber are most likely to be staying in the UK for their getaway (58%) and plan to spend an average of £2,148 on their trip.And households based in Wales will be spending the least on their holidays, with a proposed average spend of £1,865, according to the findings.",
        "Nearly three in 10 (28%) of those surveyed plan to regularly check their spending while away.But nearly a fifth (18%) said they normally blow their budget when on holiday.Helen Bierton, chief banking officer at Starling Bank, said: “Holidays are becoming a priority again and the recent wet weather will have many people dreaming of sunnier climes.“But family trips can be expensive, especially when paying for other people, so making sure you are smart with your spending can help balance the holiday budget.”Censuswide carried out the research for Starling Bank, questioning more than 2,000 people across the UK in March.Here are some tips from Ms Bierton for sticking to a holiday budget:1. Saving in advance for holidays can help avoid interest rates on credit cards and overdrafts. Banking apps can help budget for certain events, such as a holiday, and some have “round-up” features to help people put small amounts of money aside regularly when they spend.2. Setting a budget will help to make it clear what you can and cannot afford.3. Get into the habit of checking currency conversion rates and watch out for any fees when spending overseas.4. Settling up with other holidaymakers at the end of the trip can be tricky but you could use bill splitting features on banking apps.",
        "5. Once you are back from your break and all settled up, use your banking app to analyse your spending to see exactly where your money has gone, so you can understand your holiday spending habits better for your next trip."
    ]
}