{
    "articleURL": "/wires/reuters/article-12051889/Britain-contribute-Brazils-Amazon-fund-PM-Sunak-says.html",
    "content": [
        "LONDON, May 5 (Reuters) - British Prime Minister Rishi Sunak on Friday announced that his country will contribute 80 million pounds ($101.15 million) to the Amazon Fund, a major development for Brazil as the South American nation tries to garner more donors to the initiative aimed at fighting deforestation.",
        "Sunak's pledge in a meeting with Brazilian President Luiz Inacio Lula da Silva at 10 Downing Street follows a similar commitment by U.S. President Joe Biden earlier this year, joining previous donors Norway and Germany.\"There are so many interests we have in common,\" Sunak told Lula at the meeting, mentioning higher trade and the fight against climate change. \"I'm delighted to announce we will be investing in your Amazon Fund and I pay tribute to your leadership in this initiative.\"The prime minister later wrote on Twitter that Britain would donate 80 million pounds.Lula thanked Sunak and said it was time to \"normalize\" relations between the United Kingdom and Brazil, adding that \"much more can be done in terms of trade.\"He again stated that countries with large forests need support - especially from developed nations - to protect them, while reaffirming Brazil's commitment to zero deforestation by 2030.First launched in 2009, the fund works to combat deforestation in the Amazon rainforest and spur sustainable development. It was reactivated by Lula this year after his predecessor, Jair Bolsonaro, froze it in 2019.British environment secretary Therese Coffey had already told Reuters in a January interview after Lula's inauguration that Britain was considering joining the initiative.Biden last month announced that he would request from Congress $500 million over five years to contribute to the fund and related activities. France and Spain have shown interest in contributing, according to Brazil. ($1 = 0.7909 pounds) (Reporting by Gabriel Araujo in Sao Paulo and Maria Carolina Marcello in Brasilia; Editing by Steven Grattan and Alistair Bell)"
    ]
}