{
    "articleURL": "/wires/ap/article-12039191/Ford-posts-1-76B-1Q-profit-largely-gas-powered-vehicles.html",
    "content": [
        "DETROIT (AP) - Ford Motor Co. made $1.76 billion last quarter, swinging into the black from a $3.1 billion net loss for the same period a year ago.",
        "Most of the profit came from Ford Blue, the company's internal-combustion engine vehicle unit, which made $2.62 billion before taxes during the quarter. Ford Pro, the commercial vehicle unit, added $1.37 billion. But Model e, Ford's electric vehicle unit, lost $722 million before taxes.The Dearborn, Michigan, automaker is seeing its fortunes improve, and reiterated its earlier pretax profit guidance for the full year of $9 billion to $11 billion.Excluding one-time items, Ford made 44 cents per share. That beat Wall Street estimates of 42 cents, according to FactSet.Revenue rose 20% to $41.74 billion, soundly beating the $39.25 billion that analysts expected.Previously Ford said it left $2 billion in profits on the table last year due to production losses from computer chip and parts shortages and high operational costs.",
        "\"This quarter was much smoother,\" Chief Financial Officer John Lawler told reporters Tuesday. \"We've done a lot of work on improving the rate and flow of semiconductors, production stability, working through potential other issues with the supply base outside of chips.\"Lawler said the results showed in the revenue increase, and that the company would continue to work on improvements that will boost the bottom line.Ford's profits were fueled largely by sales in the U.S., its most lucrative market. Ford sold just under 472,000 vehicles from January through March, up 9.9% from the previous year.",
        "The company continued to get strong prices for its vehicles during the quarter, driven by loaded out trucks and big SUVs. Ford´s average sale price was $56,534, according to Edmunds.Lawler predicted that as production gets back to normal and vehicle supplies increase, automakers will start to offer discounts. He predicted that Ford's prices would remain flat while the industry would be down about 5% for the year.Earlier Tuesday, Ford cut prices on its Mustang Mach E electric SUV, the same day Tesla raised prices slightly on the Model Y, the Mach E's main competitor.Ford also said it is reopening the order bank on Wednesday for the Mach E after upgrading a factory in Mexico to increase output.Lawler said the company lowered prices because it wants to stay competitive in the crowded small electric SUV segment of the market and attract new buyers. Over 60% of Mach E customers are new to Ford, he said.\"EV customers up front aren't loyal, but once they do purchase, they're loyal to that brand,\" he said. \"So we expect to have these customers across their whole lifetimes.\"But CEO Jim Farley said the company is going after a profitable electric vehicle business. \"We are not going to price just to gain market share,\" he told analysts.",
        "Ford says its first-generation electric vehicles will be profitable on a pretax basis by the end of 2024. Farley said that by the end of the year, Ford will have reduced costs on the Mach E by $5,000 per vehicle.The first-quarter loss last year was due mainly to a drop in valuation of Ford´s investment in electric vehicle startup Rivian, which saw its stock slide.Ford shares closed Tuesday down 2.2%, and they dropped another 2% in extended trading after the earnings were announced."
    ]
}