{
    "articleURL": "/wires/ap/article-12055313/Mexican-families-quick-reunions-migrant-relatives.html",
    "content": [
        "CIUDAD JUAREZ, Mexico (AP) - Tears flowed amid heartfelt embraces as Mexican families were allowed brief reunions at the border Saturday with relatives who migrated to the United States.",
        "As a mariachi band played the popular song \"Las Mañanitas,\" about 150 families passed over the Rio Grande to meet with loved ones they had not seen for years.Margarita Piña could not hide her emotion as she waited to greet her son, whom she hadn't seen since he left home two years ago in the middle of the pandemic to seek a better future in the U.S.\"It´s very hard because we don´t know what they´re suffering over there,\" Piña said.Knowing their meeting would be limited to only five minutes, Piña said she would take advantage of the limited time to tell him \"that we still love you very much.\"It was the 10th edition of the \"Hugs, not walls\" event, which was organized by humanitarian groups near the Casa de Adobe Museum in the border city of Ciudad Juárez, which sprawls across the border from El Paso, Texas.",
        "Unlike at earlier reunions, a strong guard of U.S. officers was present at the event, which came just days before Washington will lift Title 42 asylum rules imposed for the pandemic that allowed the U.S. to expel more than 2.8 million migrants since March 2020.The end to the provision Thursday is expected to encourage a surge of migrants toward the border, and U.S. authorities have beefed up security, including stringing barbed wire fencing. The government has said 1,500 troops will be sent to El Paso, in addition to 2,500 National Guardsmen already at the border.",
        "\"We have never had a border as militarized as today,\" said Fernando García, head of the Network in Defense of the Rights of Migrants.\"There is a war against migrants, refugees, against us border crossers,\" he added."
    ]
}