{
    "articleURL": "/news/article-12039351/ULEZ-obsession-cost-region-500m-Dire-economic-warning-Sadiq-Khans-expansion.html",
    "content": [
        "Issue is expected to cost Labour in local elections in areas surrounding capital READ MORE: Frustrated motorists are now STEALING Ulez cameras in protest Sadiq Khan's controversial expansion of London's clean air zone will blow an estimated £500million hole in the regional economy every year, say experts.",
        "The warning came as separate research by the Conservatives also reveals that more than 1.2million commuters will be clobbered by the London Labour mayor's changes to the Ultra Low Emission Zone, adding up to £4,500 to their commute each year.The issue is expected to cost Labour in tomorrow's local elections in council areas surrounding the capital. Pollsters say the ULEZ expansion's impact on voting intentions is particularly striking in Dartford, Kent, where Labour would have been tipped to make gains. Lord Hayward, a polling expert and Tory peer, said: 'Dartford is a classic example of a swing marginal council, and yet the Tories are going to retain control of it quite easily according to the polls.",
        "'Labour should be worried because Dartford is an indicator for a series of swing councils and marginal seats either side of the Thames Estuary.'Gareth Johnson, Tory MP for Dartford, said the issue has been coming up repeatedly on the doorstep. He said: 'We're finding Labour supporters who are not going to vote Labour because of ULEZ.' Small air quality improvements  The scheme was introduced in 2019 and expanded in 2021. The latest expansion, in effect from August 29, will see it cover all of Greater London. Non-compliant vehicles – typically pre-2015 diesel and pre-2006 petrol vehicles – will have to pay £12.50 a day to drive in the zone.",
        "Howard Cox, founder of campaign group FairFuelUK, which commissioned the study on the economic impact, said: 'Mayor Khan's fixation with an alleged air quality improvement scheme that unnecessarily fleeces drivers, sole traders and low-income motorists is way past time.'Hard-pressed drivers want to rid themselves of this dishonest career politician and support a new Mayor that will scrap ULEZ for good.'A report published today by the Centre for Economics and Business Research finds that the ULEZ expansion will cost the regional economy at least £538million every year.The Tories' separate research, based on Freedom of Information requests to the DVLA, found that more than 1.2million non-ULEZ compliant cars in London's commuter belt will be hit. In any event, motoring groups believe ULEZ expansion is just a 'cash cow' to plug a hole in City Hall's finances.Meanwhile, researchers at Imperial College London found the existing scheme had 'caused only small improvements in air quality in the context of a longer-term downward trend in London's air pollution levels.'Voters go to the polls tomorrow in 16 areas which border Greater London. Sadiq Khan's office insisted '90 per cent of cars driving in outer London now meet ULEZ standards.'"
    ]
}