{
    "articleURL": "/wires/aap/article-12054417/Wanderers-Ninkovic-embroiled-heated-post-game-spat.html",
    "content": [
        "Western Sydney coach Marko Rudan accused Sydney FC boss Steve Corica of provoking Milos Ninkovic to the extent that the Wanderers midfielder sought out his former manager at the end of an explosive derby.",
        "Sydney claimed a 2-1 win at CommBank Stadium on Saturday to set up a double-legged A-League Men semi-final against Melbourne City and knock their bitter rivals out of the finals in the process.It was the first finals encounter between the two clubs in the competition's history.On the field it was a nervy affair, and the tension spilled into the aftermath as Ninkovic made a beeline for the Sydney dressing rooms.Sydney say Ninkovic, who was quickly frogmarched out of their inner sanctum in view of the media, had gone to confront Corica.The Serb played for the Sky Blues for seven years before switching to the Wanderers after a fallout over his status as a visa player.Rudan, who did not refer to Corica by name, claimed the Sydney boss had laid the foundation for the post-game spat while aiming a barb at the veteran midfielder during Saturday's game.\"Milos went in there to congratulate his old teammates, and their coach didn't appreciate him being in there,\" Rudan said.\"Something occurred between those two, which wasn't pleasant, it was quite fiery.\"I haven't seen Milos yet, I haven't spoken to him about that.\"But I think it all started in the game where I think their coach said something not very nice on the sideline to Milos, I think that's where it started.",
        "\"That's football, these things kind of happen.\"Ninkovic, who continued to shout after being thrown out of the Sydney dressing rooms, had been involved in a running battle with former teammate Luke Brattan all evening.\"He's just upset with losing the game,\" Corica said.\"We have issues with him, obviously, but that's between me and him.\"Ninkovic was booked in the second half before being substituted off by Rudan.After his substitution his former roommate Adam Le Fondre scored the goal which knocked the Wanderers out of the final.\"I thought surely not. Ninko's very calm and I had heard there was kerfuffle,\" Le Fondre said.\"There is always niggle in a derby, you expect that sort of enemy, siege mentality from both teams.\""
    ]
}