{
    "articleURL": "/wires/pa/article-12054339/Salmond-leads-thousands-marchers-call-independence.html",
    "content": [
        "Former first minister Alex Salmond led a crowd of thousands in a chant calling for Scotland to be independent – encouraging them to shout louder for “the benefit of those in Westminster Abbey”.",
        "The Alba Party leader was speaking at a rally held by independence campaigners All Under One Banner and organisers told the crowd the estimated attendance was more than 20,000.Marchers set off from Kelvingrove Park in the city’s west end at around 11.30am – coinciding with the King’s coronation ceremony – to a rally at Glasgow Green.Mr Salmond told the crowd: “In London, the subjects are required to swear an oath of allegiance to the Crown.“In Scotland, in Glasgow, the citizens choose to swear an oath of loyalty to Scotland.“The homage of the people is now to be said silently – which will stop people having to swear at their TV sets.”He said England is a “country moving backwards” and said the march was “one of the greatest in Scotland ever”, claiming the nationalist movement is the “strongest political force in Scotland”.He called for parties backing Scottish independence to stand together at the election in seeking a mandate.He added: “We want our independence and we want it now.”He then led the crowd in a chant calling for independence, urging them to shout louder “for the benefit of those in Westminster Abbey”.Other speakers included Ash Regan, who lost out in the SNP leadership race to now first minister Humza Yousaf.",
        "She told urged to crowd to unite, saying “now is not the time for division”.She added: “An independent Scotland can only be built from a foundation of integrity.”Earlier in the week Mr Salmond said Scottish police should have staged a “standoff” outside Edinburgh Castle to prevent the Stone of Destiny from being moved to London for the coronation.He said such a move could have been used as a bargaining tool in the push for a second independence referendum.The stone was taken to London last week to be used in the coronation, with First Minister Humza Yousaf attending a ceremony during which it was removed from its resting place at the castle.The stone has been used to crown monarchs of Scotland – and later the UK – in a tradition dating back centuries.Mr Yousaf dismissed the suggestion of involving the police, saying it would have “not been the right thing to do”.",
        "Later, hundreds of people gathered on Calton Hill in Edinburgh for an anti-monarchy rally organised by Our Republic.Some waved Saltire flags while others wore them as cloaks, and held signs with slogans such as “Not our King” and “Down with the crown”.Speakers included Scottish Greens co-leader Lorna Slater who is a Scottish Government minister.",
        "Referring to the coronation ceremony she said: “It is a bit obscene to be watching £100 million worth of horses, carriages, jewels and wild costumes when something like one in four families in the UK is struggling to feed their kids, it is simply obscene.” So when it comes to the monarchy Scotland says no. Let’s do better, let’s build a better, brighter democratic future in an independent Scottish republic  Lorna Slater, Scottish Greens  She said that the inequality represented by the monarchy is a “fundamental bit of social injustice”.Ms Slater, the Scottish Government’s green skills, circular economy and biodiversity minister, added: “For the Scottish Greens we say that there is no social justice without climate justice, no climate justice without social justice. There are no kings on a dead planet.“So when it comes to the monarchy Scotland says no. Let’s do better, let’s build a better, brighter democratic future in an independent Scottish republic.”Other speakers included poet George Gunn, SNP MP Tommy Sheppard and Scottish Greens MSP Maggie Chapman who took the stage at Calton Hill saying she was speaking from “what I hope will soon be the capital of an independent socialist republic of Scotland”.After she finished speaking the crowd sang “you can stick your coronation up your arse” before the next speaker took to the stage."
    ]
}