{
    "articleURL": "/sport/nfl/article-12039305/Antonio-Browns-accused-not-properly-compensating-players-new-team-Albany-Empire.html",
    "content": [
        "Empire players have not been paid since April 21 and are turning on each otherBrown owns 95 percent of the franchise after buying out previous team ownersDailyMail.com provides all the latest international sports newsAntonio Brown has been accused of wildly locking out certain players of the Albany Empire from their hotel rooms as well as making 'violent threats' to them, following his 'hostile takeover' of the National Arena League team earlier this year. ",
        "Head coach Damon Ware and quarterback Sam Castronova have both revealed that they've been slowly set aside from other members of the organization after speaking out against the former NFL wide receiver, who's also been alleged to have not paid his players since April 21.Compensations issues have even led players to turn on each other after it was previously reported that there was a postgame incident on the team's bus on Sunday, which led to several suspensions and Ware's departure, according to published reports.It's claimed that Brown, who owns 95 percent of the Empire, has been mismanaging the franchise - located in upstate New York - since taking over in March after buying out the team's previous owners. Ware claims Brown has been difficult to deal with and that his ego has prevented him from recruiting new players to help improve the current squad. The controversy-ridden Super Bowl champion is said to also be disinterested in providing progress to the same team his dad played for while he was a kid growing up. ",
        "'It became all about him, not the football team,' Ware told TMZ Sports. 'We built a wonderful organization over three years -- he came in and killed it.'Albany's won consecutive NAL championships, but are starting the season slow this year with an overall 1-2 record, so far.",
        "Players usually receive payments after each game, believed to be almost weekly during the regular season. Players, however, reportedly have considered sitting out as a form of protest to Brown's ownership, given that no money has hit their bank accounts over the last 11 days. Eventually, the local stars gave in and geared up for Sunday's game after allegedly being told that they were paid, though Empire quarterback Sam Castronova denied the update, before several team captains reportedly clashed with senior officials on the coach back from North Carolina.",
        "What's more is that after arriving at the team hotel in Albany, Ware, the captains, and several other players allegedly found out that their room keys were no longer valid. Employees of the hotel reportedly eventually told them that they were provided instructions from Brown to not give them access to their beds. TMZ Sports also reported that players had to beg housekeeping to let them collect their belongings from their rooms. It seems like for now, Brown is one payment behind but that won't matter to Ware,  Castronova and several other key members of the team, who are said to be angry with the former Pro Bowler's ways of managing the franchise, as they are set to seek pastures new.'It's a happy day for me to be out of this crazy situation,' Ware said. 'Goodbye, good riddance.'"
    ]
}