{
    "articleURL": "/tvshowbiz/article-12052213/Zoe-Balls-splits-demanding-model-boyfriend-Michael-Reed-five-years.html",
    "content": [
        "Zoe Ball has reportedly split from her long term partner Michael Reed with friends allegedly saying she is 'better off without him'.",
        "The radio host, 52, had been dating the former construction worker for five-and-a-half years however sources told The Sun the relationship began to break down after Michael, 53, became 'a bit demanding'.The publication reported that Michael has since been asked by the TV star to move out of her £1.5million sprawling Sussex home.The source said: 'Zoe is gutted but she's better off without Michael.''This is a relief to many of her friends, who think she has done the right thing,' they added.",
        "They went on to say that the couple had began arguing over 'really silly things' like Zoe spending time on the phone chatting to friends.And despite Michael being a 'real gent' when they first began dating, he had allegedly since become 'a bit demanding'. Going on to say the couple also began to drift apart with Zoe heading off on a holiday with her family Cyprus last month without him. With the source saying: 'Now it seems the relationship has finally run its course. She asked him to move out and he has done so, although they have remained on good terms.'MailOnline have contacted Zoe's reps for comment. Zoe was previously married to DJ Norman 'Fatboy Slim' Cook, 59, from 1999 to 2016 and share two children together, a son Woody, 22, and daughter Nelly, 13. ",
        "Following the split she began dating cameraman and technician Billy Yates, who tragically took his own life in May 2017 after a long battle with depression. Thursday marked the anniversary of his death , with Zoe taking to Instagram writing: 'Six years Billy Wonder — missed madly by all who love you.'",
        "On her holiday without ex Michael, Zoe looked sensational as she spent quality time with her family in the sun.She was joined on the trip by her siblings as well as TV legend dad Johnny, 84, who playfully posed up a storm for the camera.Zoe slipped into a strapless black and white swimsuit and donned shades as she topped up her tan besides the pool. Meanwhile Johnny, who was married to Zoe's mum Julia until 1972, entertained his grandchildren with games of dominoes before the family enjoyed a trip on a pedalo. The former Play School host looked happier than ever in the sunshine with fans rushing to comment on his good health. ",
        "On wrote: 'Ahhhh your Dad looking so well. What a legend'.While another jokingly said: 'Your Dad simply does not age - is he a robot?'. Zoe captioned the snaps: 'My family &amp; other other animals'.   Johnny was a regular fixture on children's television in the late 1970s and 1980s presenting several series of mathematic and technology programmes.",
        "DJ Norman 'Fatboy Slim' CookZoe was wed to the musician, 59, from 2009 to 2016 and they share two children, a son Woody, 22, and daughter Nelly, 13.Despite the split Norman has praised his ex crediting his former wife for keeping him down to earth when he was at the height of his fame.",
        "Billy Yatestragically took his own life in May 2017 'in shock for two years'",
        "Michael Reed Zoe had been dating the former construction worker for five and a half years before it was reported they had gone their separate ways in May 2022.In 2000 he was slammed by his ex Lorraine Ashdown, who is the mother of his seven-year-old daughter.Lorraine has accused Michael, 50, of claiming benefits after being ordered to pay £20k in child support arrears."
    ]
}