{
    "articleURL": "/wires/ap/article-12043095/Rights-groups-call-probe-shooting-Lao-activist.html",
    "content": [
        "BANGKOK (AP) - Human rights groups on Wednesday called for an investigation into the shooting of a political and social activist in Laos whose posts on Facebook criticized the Southeast Asian nation´s communist government.",
        "Initial reports, repeated by human rights groups, had said Anousa Luangsuphom, 25, was killed in the attack Saturday night at a coffee shop in Vientiane, the capital. But Human Rights Watch issued an update Thursday saying Anousa's family and other sources provided evidence that he survived the shooting and was in a hospital receiving medical treatment.Video from security cameras uploaded onto a state media website and then circulated on social media shows a gunman in a cap and mask make a tentative entrance into the cafe, step out, walk back in again, and brush past a woman to fire two shots from a handgun into the sitting victim. Another video released online shows paramedics attending to him.Reports in Lao media and from fellow activists said Anousa later died. But a Lao activist in exile in Paris who knew Anousa, Joseph Akaravong, said on Facebook that he was still alive. A photo said to be of Anousa in the hospital, showing wounds in the spots cited in media reports, accompanied the post.The Associated Press was unable to confirm Anousa's condition and was not immediately able to contact Akaravong.No evidence has emerged of the gunman´s identity or motive. Lao authorities could not immediately be contacted for comment.Amnesty International described Anousa, also known as Jack, as a \"vocal critic of the Lao government and society.\"",
        "The group said Anousa ran a Facebook page called \"Driven by the Keyboard\" which featured posts \"on a wide range of social, environmental, economic and political issues in Laos, such as haze pollution, the human rights of school children and Lesbian, Gay, Bisexual, Transgender, and Intersex (LGBTI) rights.\"Human Rights Watch said Anousa \"was among the few people in Laos who regularly and openly expressed views that were critical of the Lao government,\" and described his \"Driven by the Keyboard\" page as \"a popular platform for people in Laos and abroad to express dissenting views about the Lao government, including corruption and repression of fundamental freedoms.\"Both Amnesty International and Human Rights Watch recalled the 2012 disappearance of another activist, Sombath Somphone, who was last seen in the custody of Lao security forces.Sombath´s disappearance was captured on video taken by a traffic monitoring camera, which shows him being stopped by security personnel at a police outpost in Vientiane and asked to step out of his vehicle, according to Amnesty International. Within a few minutes a man on a motorcycle arrives, drives away Sombath´s vehicle, and a pickup truck takes Sombath away with armed people on a motorcycle leading the way. A passenger on the motorcycle fires a gunshot into the air, Amnesty International said. Lao authorities did not acknowledge taking Sombath into custody, and he was never seen again.",
        "U.S.-educated Sombath mostly worked in rural development, showing farmers creative ways to raise fish and make handicrafts. But he was also vocal about land deals that left thousands of villagers homeless without compensation, sparking rare political protests.___Find more of AP´s Asia-Pacific coverage at https://apnews.com/hub/asia-pacific"
    ]
}