{
    "articleURL": "/sport/football/article-12041359/Todd-Boehlys-miserable-year-owner-Chelsea.html",
    "content": [
        "Todd Boehly is approaching the one-year anniversary of his takeover of ChelseaThe Blues co-owner has had a miserable first 12 months at Stamford Bridge Boehly has invested heavily but has paid even more for errors in judgement Speaking in a function room full of bankers and business associates at Stamford Bridge last month, Todd Boehly dropped a contender for understatement of the century. ",
        "Mistakes have been made in his first year as co-owner of Chelsea, he conceded. What those mistakes have been specifically he would not elaborate, but the event, said to be an opportunity for Boehly to discuss Chelsea's exciting future, had an undertone of disappointment.  It is almost two years on from the 2021 UEFA Champions League final that Chelsea won, defeating Manchester City 1-0, and eight of that starting XI remain at the club. And yet Chelsea now feel lightyears away from standing on the top of the European mountain with Boehly's first year as co-owner riddled with mistakes, as he put it, and costly errors in judgement.  There has been £600million invested in players - deals such as the £62m spent on Marc Cucurella now appear big overpays - and around £50m dropped on chopping and changing of managers. ",
        "Boehly is onto his third now and is searching for a fourth in the summer. Tuchel was unceremoniously binned following a Champions League group stage defeat to Dinamo Zagreb in a move that continues to perplex.  Back in January, talkSPORT presenter and former Crystal Palace owner Simon Jordan claimed there was 'a lot more' to the decision of sacking Tuchel than met the eye among fans.",
        "Enzo Fernandez - £107m Mykhailo Mudryk - £88.5m Wesley Fofana - £75m Marc Cucurella - £60m Raheem Sterling - £47.5m Benoit Badiashile - £35m Kalidou Koulibaly - £33m Noni Madueke - £29mMalo Gusto - £26mCarney Chukwuemeka - £20mAndrey Santos -  £18mPierre-Emerick Aubameyang - £10.3mGabriel Slonina - £9mDavid Datro Fofana - £8mDenis Zakaria - loanJoao Felix - £9.7m loan",
        "'There's a lot more behind the scenes of Tuchel that would make most people's eyes water as to the reasons why Todd Boehly made that decision and it wasn't just a case of losing to Dinamo Zagreb, it was case of a whole raft of other things - that's Todd Boehly's gift to tell people what that is,' Jordan said on talkSPORT.'But it opened my eyes and I would've done exactly the same thing as Todd Boehly did which is 'you can go mate'.'Nonetheless, life after Tuchel continues to make a mockery of the decision to ditch him. In came Graham Potter, costing £22m to prise from Brighton, and he failed to even make it to the end of the season. Now it's the turn of interim boss Frank Lampard, who has lost every league game thus far. Disastrous. Those decisions lay at Boehly and co-owner Clearlake Capital's door, frankly. Sacking Potter without a clear plan of who his successor would be felt like a fitting embodiment of the chaos that has engulfed Chelsea's season.Defeat to Arsenal consigned them to 12th in the table, just nine points ahead of the relegation zone. To show how big the gap is now, they are 49 points behind the league-leading Gunners - 10 more points than they have managed to get.  ",
        "So there will be no Champions League football next season. No Europa League football. No Europa Conference League football. Nothing. Chelsea's miserable season will see them go without, hurting both their finances and their draw in the player and managerial markets. Lampard knows the prospect of him staying on is slim-to-none - Mauricio Pochettino is widely expected to be the new manager in the summer - and he pulled no punches of life at Chelsea now in a scathing assessment on Tuesday. He was honest in his assessment of his side when speaking to Sky Sports, admitting that they had a long way to go to get back to the heights they once reached, while referencing the Blues' successes during the reign of Roman Abramovich - who Chelsea fans sang for at the game.'Chelsea has been a big success for 20 years but at the moment we aren't in that position,' Lampard, the Blues' all-time top goal-scorer, said.",
        "'In the time I've been here it's clear to see behind the scenes, on the training ground, the reasons why. If you're going to be a nice team to play against all the time it doesn't matter where you go. That won't change overnight but we better get there quickly.'The passive nature of our game you could attribute to many things. The players certainly care. They are low on confidence, but when you play for Chelsea you have to play a certain way even if you are low on confidence.",
        "'Whatever it is, it maybe doesn't even matter because the only thing that will get you out of it is understanding and working hard. The gap was the other way around for many years.''It's clear behind the scenes,' he said, in perhaps the most telling line of all amid the anarchy of post-Abramovich Chelsea.The lack of joined up thinking appears to have eroded the unity that played a key role in Tuchel's side dismantling City in that final two years back.Two examples.One, Boehly telling Chelsea's stars their season was 'embarrassing' after the home defeat by Brighton. He also named some individuals, speaking to them directly, saying words to the effect of: 'This isn't good enough, this isn't what we brought you to the club for, you're not taking responsibility.'Boehly's dressing room trips are not atypical but his post-Brighton rant was a clear sign of the strain this season has taken having invested so heavily to be successful. Two, Chelsea players were said to have been 'taken aback' when £88m Mykhaylo Mudryk and his entourage were granted entry to the dressing room prior to the Crystal Palace game in January.",
        "The changing room area is widely viewed as a sacred place for players, particularly prior to kick-off when they are mentally preparing for matches, with strict rules over who is allowed into the space on match-days. It did not go down well.",
        "Factor in too that this disastrous season has left a number of squad members privately questioning their futures at Stamford Bridge. There is more, too. So many new players emerged all at once that Chelsea, according to the Athletic, had to expand their dressing room just to fit them all in on a matchday. That report claimed Mudryk and Noni Madueke were among those who had to change in the corridor while it was sorted. This, the same club that won the UEFA Champions League, the pinnacle in European football, less than 24 months ago?Players, according to former Arsenal star Emmanuel Petit, were arguing on the bench during the loss to the Gunners in another alarming sign of strife.Petit told Premier League Productions he was shocked by the lack of unity in the squad, claiming he saw players arguing amongst themselves on the bench.'I was quite close to the Chelsea bench and I saw some of the players having arguments between them in the second half especially,' Petit said. 'I was very shocked in the first half the attitude of the players, the body language, no response, no pride, no unity, no friendship. I was thinking you could put 20 managers on the bench and it won't change anything at all at the moment.",
        "'They need to clear something in the dressing room first and then think about the manager afterwards. You can put the best manager on the bench now and he doesn't get the right answer, there are too many players. 'It's a mess and it was embarrassing to watch Chelsea in the first half and I feel sorry for the fans.'The Premier League is an unforgiving beast at the best of times and Boehly has learned quickly that a clear plan will trump wild spending every time.But 'mistakes' do not start and end with the above.Take the case of physio Jose Calvarro, who was re-hired following a campaign by senior players, seven months after the Spaniard was fired.  In September, Calvarro left the Blues after six years with the club, as part of an overhaul of backroom staff amid Boehly's new ownership.But player pressure forced Boehly and the club to accept it was a mistake to let Calvarro go, and the 43-year-old is now back involved with the club, as reported by the Evening Standard. There are grumblings that ownership have failed to rectify the lack of a centre forward and haven't sorted the future of midfielder Mason Mount. Performance-related contracts are another bone of contention a sMail Sport understands the club's most recent signings, or those who have agreed new contracts, will see their earning power slashed by at least 30 per cent due to no Champions League football. Sources have indicated that figure could be as high as 50 per cent.The decision to enforce an incentivised salary structure was designed to motivate players - but it also provides Chelsea with a degree of protection against the financial shortfall incurred by the failure to qualify for the hugely lucrative Champions League. 'This club is an absolute mess,' Jamie Carragher fumed during commentary of Chelsea's loss at Arsenal.",
        "'This could get an awful lot worse unfortunately for Lampard and his staff and supporters. Ben White puts the ball in, so easy to bring it down at that back post. 'It's embarrassing from Chelsea. It's like five a-side. Three of them sat on their backsides. It sums Chelsea's season up.'To see how far they have fallen in these last 12 months is astonishing.'Now the question will be how quickly and efficiently can Boehly and Chelsea learn from mistakes and rectify them? Pochettino would be Premier League proven with experience developing young players but would not be an instant fix."
    ]
}