{
    "articleURL": "/news/article-12041883/Killer-William-Matheson-wrote-disturbing-song-brutally-murdering-ex-girlfriend.html",
    "content": [
        "Mother pleads for killer to stay in jailHer daughter was murdered by ex-boyfriendThe mother of a teenage girl who was brutally murdered and her body hidden in a cricket bag is pleading with authorities to keep the killer behind bars, as a chilling song he wrote after the horrific deed is revealed. ",
        "William Matheson is serving 25 years in prison after brutally strangling his ex-girlfriend Lyndsay van Blanken to death with zip ties - who was just 18 at the time - in November 2003. Lyndsay's mother, Cynthia van Blanken, believes the killer will 'do it again' if he is released and the thought that he could soon be out in the community makes her 'sick'.'If they let him out next week, they will be responsible for what happens and it won't be good,' she told A Current Affair.Matheson is up for parole and if successful, he will live in the community for the last six years of his sentence, albeit under strict conditions.",
        "Seven weeks after Lyndsay disappeared, her body was found stuffed inside a cricket bag in a storage unit under a Queens Park apartment block, in Sydney's east. The evidence against Matheson quickly started to pile up and it was uncovered that the killer even wrote a disturbing song after murdering his ex-partner.The lyrics said: 'Just the other day. I watched you pass away. Close your eyes, where you go is where I'll be. Meet you there. Eternity'. Lyndsay met Matheson when she was just 16 when he performed at her mother's wedding as a cello player.Ms van Blanken said Matheson quickly became controlling and she soon became concerned about changes in her daughter's behaviour. ",
        "'He definitely controlled her to a point where she was speaking the same way as him,' she saidLyndsay split with Matheson, met someone else and got engaged, but Matheson became jealous and reportedly started stalking her and sending abusive texts.",
        "Ms van Blanken said her daughter was 'petrified' and that Matheson followed her 'everywhere'. On November 24, 2003 Lyndsay was seen having a fight with Matheson outside her workplace in Bondi before catching the train home.Matheson was waiting at the train station and Lyndsay was never seen again.Ms Van Blanken said she started to think the worst when her daughter didn't show up on Christmas Day, so she pleaded with the public for information.The breakthrough in the case came when Lyndsay's corpse was found in the cricket bag and it was discovered she had been tortured and murdered.The court found that Matheson had tightened zip ties around Lyndsay's throat, strangling her to death.Matheson was found with scratches on his body and admitted seeing Lyndsay the day she went missing, but claimed the scratches were from his pet cat and rats.",
        "Ms van Blanken believes 'he calculated the whole thing'.'All of it. (The) surgical gloves, divers boots, no footprints, no handprints. He had it right down pat,' she said.",
        "Matheson was sentenced to 27 years in jail, which came as a relief to Lyndsay's mother, but she is now pleading for him to stay behind bars.'He's actually served the equivalent of my daughter's age, which isn't fair,' she said.If he is not released this time, Ms van Blanken will keep fighting to have him remain locked up.'I'm going to fight it to the last minute,' she said."
    ]
}