{
    "articleURL": "/femail/real-life/article-12044141/Perth-mum-fighting-awareness-Tourettes-Syndrome-frustrating-interaction-police.html",
    "content": [
        "Sophie stack has tics due to Tourette SyndromeHer 'tics' lead to misunderstandings with police and doctorsFor Sophie Stack simple things like going through an airport, getting into nightclubs, taking exams and even talking to people face-to-face can be a battle.",
        "The 33-year-old has copped hefty fines and been barred from venues on a night out after police and bouncers wrongly thought she was incapacitated.These mix-ups are because Sophie suffers from Tourette Syndrome which causes her to 'tic' and twitch uncontrollably - and it's even caused confusion in hospitals.  ",
        "After she suffered a minor stroke, the mum-of-two was surprised she even had to explain her condition to doctors and nurses during her stay in the neurology ward.Because of her constant frustrations with first responders and medical staff, Sophie is fighting to raise awareness about the misunderstood condition.'How are we in this medical field and I'm in a neurology ward with a neurological condition and no one knows what Tourettes is?' Sophie told FEMAIL.Tourette Syndrome is a condition of the nervous system which causes people to have involuntary tics which are sudden movements, twitches or sounds. Sophie's tics manifest in clenching her limbs, blinking, coughing, sniffing and head flicks and are exacerbated when she is stressed or tired.  Back in October, a code 1 stroke shut down the left side of her body and she was rushed to hospital where her tics confused hospital staff. 'I was sitting in there waiting for my mum to arrive and one of the nurses thought I was having a seizure. I said \"I'm just ticing, is that not on my chart?\",' the Melbourne mum said.",
        "'I was in the neurology ward with a neurological condition, and I had to educate quite a lot of them who didn't know what Tourettes was or what was involved.' ",
        "Tourette Syndrome (TS) is a neurological disorder, which most often begins between the ages of two and 21, and lasts throughout life. TS is not degenerative and people with TS can expect to live a normal life span. TS is characterised by rapid, repetitive and involuntary muscle movements and vocalisations called 'tics', and often involves behavioural difficulties. Tics are experienced as a build up of tension, are irresistible and eventually must be performed. Typically tics increase as a result of tension or stress and decrease with relaxation or concentration on an absorbing task. TS symptoms have long been misconstrued as a sign of behavioural abnormality or 'nervous habits', which they are not. Tourette Syndrome Association of Australia",
        "She faced further challenges when doctors ordered MRI and CT scans which require patients to lie very still for up to 90 minutes. 'I was like, \"well I can't do that, how do you expect me to not move?\" and they told me to just be calm,' Sophie recalled. She said she spoke to multiple doctors and nurses before someone listened to her concerns and recommended sedation for the scans.  ",
        "'I didn't know that was an option. I still had to push quite hard after she sent the recommendation,' Sophie said. 'I feel like sometimes it's like knocking my head against a brick wall because I'm fighting for my rights and trying to educate at the same time.'     Sophie was diagnosed with Tourette Syndrome early at the age of five as both her mum, Leonie, and grandmother suffered from the same condition and identified her symptoms straight away. She said while awareness about the condition has been growing since she was bullied for it growing up, there is still a lot of misunderstanding. The mum explained people with Tourettes can have an increased number of intrusive thoughts which cause them to do or say inappropriate things uncontrollably. 'When Covid happened and I went to the supermarket, I was coughing and sniffing and clearing my throat. People were looking at me and nearly running away,' she said.'Our brain tells us \"this is a good time to do something inappropriate\", and it happens. What we do doesn't reflect who we are or what we believe in.'She has had many frustrating incidences with first responders such as paramedics and police officers as well as bouncers while out with friends.   ",
        "'I would come into contact with a few who would assume, even if I was designated driver, that I was under the influence or I was drunk. They would target or pinpoint me and say \"she needs to leave\" and I haven't even had a drink,' she said. ",
        "'Because of that now if I am driving and they're doing they're breath testing for everyone I get really nervous and scared.'While she was learning to drive aged 16, Sophie was in the car with her mum when she panicked after spotting a police officer. 'My leg started ticing so it's like a bit of shake and I accelerated and of course they pulled me over,' she said.While Sophie accepted her wrongdoing and was happy to cop the fine, it was the hostility from the cop who pulled her over that bothered her. ",
        "The two categories of the tics of TS and some common examples are:Simple Motor - eye blinking, head jerking, shoulder shrugging, facial grimacing, nose twitchingVocal - throat clearing, barking noises, squealing, grunting, gulping, sniffing, tongue clickingComplex Motor - jumping, touching other people and things, twirling about, repetitive movements of the torso or limbs, pulling at clothing and self-injurious actions including hitting or biting oneselfVocal - uttering words or phrases, coprolalia (the involuntary utterance of inappropriate or obscene words), echoalia (repeating a sound, word or phrase just heard) or palilalia(repeating one's own words)The variety and complexity of tics or tic-like symptoms that can be seen in TS is enormous.Source: Tourette Syndrome Association of Australia",
        "'They did not care – they said you're just making up excuses, I don't want to hear it, you're speeding you can't do this. It was the rudeness about it,' she said. If Sophie is ever in contact with first responders she 'suppresses' her tics which can cause a 'tic attack' later on. 'The longer you suppress, it's like holding in a sneeze... it feels like you're weighed down and it's all building up,' she said. Sophie even tries to contain her tics when talking to people face-to-face after years of being bullied about it at school. ",
        "'I was embarrassed and bullied a lot so when I saw people one-on-one I would just hold it in which doesn't help,' she said. 'As soon as they walk away then it all comes out – it is very hard to suppress.' Sophie's eldest son Franklin, eight, also has Tourette Syndrome and she hopes people become more aware and understanding of the condition. 'People think we can help it, that we can stop it or that we know what we're doing. Most of the time if we say or do something that's inappropriate, we'll apologise,' she said. 'We're also happy for people to laugh, just laugh with us not at us. We do like to explain and lot of us are open to it if we're asked nicely, not the judgement.' Tourette Syndrome Association of Australia is urging leaders in first responder professions to provide education and thorough training to staff to prevent negative interactions with the Tourettes community. For Tourette Syndrome Awareness Week the not-for-profit hopes to better educate the public about Tourette's and how best to respond to a person with the condition."
    ]
}