{
    "articleURL": "/wires/ap/article-12042423/US-sprinter-Olympic-medalist-Tori-Bowie-dies-32.html",
    "content": [
        "Tori Bowie, the sprinter who won three Olympic medals at the 2016 Rio de Janeiro Games, has died. She was 32.",
        "Bowie's death was announced Wednesday by her management company and USA Track and Field. No cause of death was given.\"USATF is deeply saddened by the passing of Tori Bowie, a three-time Olympic medalist and two-time world champion,\" USA Track and Field CEO Max Siegel said in a statement. \"A talented athlete, her impact on the sport is immeasurable, and she will be greatly missed.\"According to the Orange County Sheriff´s Office in Orlando, Florida, deputies responded Tuesday afternoon to a home in the area \"for a well-being check of a woman in her 30s who had not been seen or heard from in several days.\"The sheriff's office wrote that a woman, \"tentatively identified as Frentorish \"Tori\" Bowie (DOB: 8/27/1990), was found dead in the home. There were no signs of foul play.\"Growing up in Sandhill, Mississippi, Bowie was coaxed into track as a teenager and quickly rose up the ranks as a sprinter and long jumper. She attended Southern Mississippi, where she swept the long jump NCAA championships at the indoor and outdoor events in 2011.",
        "Bowie turned in an electric performance at the 2016 Rio Olympics, where she won silver in the 100 and bronze in the 200. She then ran the anchor leg on a 4x100 team with Tianna Bartoletta, Allyson Felix and English Gardner to take gold.",
        "A year later, she won the 100 meters at the 2017 world championships in London. She also helped the 4x100 team to gold.\"She was a very enthusiastic, sparkling personality,\" said track coach Craig Poole, who worked with Bowie early in her career and again later. \"She was really fun to work with.\"The track and field community mourned the loss of Bowie on social media. Jamaican sprint sensation Shelly-Ann Fraser-Pryce posted on Twitter: \"My heart breaks for the family of Tori Bowie. A great competitor and source of light. Your energy and smile will always be with me. Rest in peace.\"Added U.S. hurdler Lolo Jones: \"Too young. Gutted to hear about Tori Bowie. Incredible talent. A beautiful runner. I pray for the comfort of her family, thank your for blessing us with her. The running community mourns an incredible loss.\"Brittney Reese, a three-time Olympic medalist in the long jump, wrote: \"I´m so heartbroken over this ... You have made a lot of us proud thank you for representing our state of Mississippi like you did ... RIP!\"Bowie was taken in by her grandmother as an infant after she was left at a foster home. She considered herself a basketball player and only reluctantly showed up for track, but Bowie was a fast learner, becoming a state champion in the 100, 200 and long jump before going to college.",
        "Her first major international medal was a 100-meter bronze at worlds in 2015. After winning, she said, \"my entire life my grandmother told me I could do whatever I set my mind to.\"In a post on Twitter, Icon Management included a picture of Bowie holding up her hands in the shape of a heart. The management company wrote: \"We´ve lost a client, dear friend, daughter and sister. Tori was a champion...a beacon of light that shined so bright! We´re truly heartbroken and our prayers are with the family and friends.\"___AP National Writer Eddie Pells contributed to this report.___More AP Olympics: https://apnews.com/hub/olympic-games and https://twitter.com/AP_Sports"
    ]
}