{
    "articleURL": "/wires/ap/article-12044391/Atletico-routs-Cadiz-5-1-overtakes-Madrid-2nd-place.html",
    "content": [
        "MADRID (AP) - Atletico Madrid continued its winning form by routing Cadiz 5-1 and overtaking Real Madrid for second place in the Spanish league on Wednesday.",
        "Antoine Griezmann scored twice in the first half and Álvaro Morata, Yannick Carrasco and Nahuel Molina each added a goal in the second to give Atletico its 12th win in 14 league matches. Diego Simeone's team moved a point in front of Madrid with five rounds remaining.It is the first time this season Atletico moved into second spot in the standings, which is particularly important because it guarantees a spot in the lucrative Spanish Super Cup in Saudi Arabia.Madrid, which lost 2-0 at Real Sociedad on Tuesday, had been in the top two since the early rounds. It is now focused on Saturday's Copa del Rey final against Osasuna and the Champions League semifinal against Manchester City.Atletico would still make it to the Super Cup by finishing third behind Madrid, though, which earned its spot for the tournament in Saudi Arabia by reaching the Copa final. It wouldn't make it if it finished third behind another team.Atletico is 13 points behind leader Barcelona, which has the chance to clinch its first league title in four years in the next round.Atletico has been the hottest team in Spain in the final stretch of the season. Its only setbacks recently were a 1-1 draw against Getafe, a 1-1 draw at Madrid and a 1-0 loss at Barcelona. The domestic league is the only competition it is still participating after disappointing results in Europe and in the Copa.",
        "\"We have to enjoy this moment,\" Griezmann said. \"We can't think about what happened in the past. We have to look to what is ahead of us and try to finish as high as possible.\"Griezmann scored in the second and 27th minutes. Morata got on the board in the 49th, Carrasco in the 57th and Molina in the 73rd at the Metropolitano stadium.Anthony Lozano scored in the 72nd for Cadiz, which dropped to 15th place, only one point from the relegation zone.VALENCIA STALLSValencia, coming off a loss at Cadiz, was held to a 1-1 draw against Villarreal at home to stay near the relegation zone.It is in 17th place with 34 points, the same as 18th-place Getafe in the first drop position. Espanyol, which visits Sevilla on Thursday, was three points behind in 19th. Last-place Elche was mathematically relegated after a 2-1 loss at Almeria on Tuesday.Villarreal opened the scoring with Nicolas Jackson in the 62nd and Samuel Lino equalized in the 72nd.Villarreal had won five of its previous seven matches. It stayed seven points behind fourth-place Sociedad in the final Champions League place.GETAFE WINS AGAINGetafe kept alive its chances of escaping demotion with a 1-0 home victory against Celta Vigo.Enes Unal scored three minutes into the match to help end his team's six-match winless streak.",
        "Celta, sitting 13th, has only one win in its last seven matches. It had defender Joseph Aidoo sent off with a second yellow card in the 77th.___Tales Azzoni on Twitter: http://twitter.com/tazzoni___AP tennis: https://apnews.com/hub/tennis and https://twitter.com/AP_Sports"
    ]
}