{
    "articleURL": "/tvshowbiz/article-12044399/Love-Islands-Samie-Elishi-attends-House-Sims-launch-party-split-Tom-Clare.html",
    "content": [
        "Samie Elishi cut a stylish figure as she made a solo appearance at the House pf Sims launch party on Wednesday - just days after confirming her split from Tom Clare. ",
        "The Love Island star, 22, flashed her toned abs in a chic taupe co-ord as she rocked up to the event held at Jin Bo Law bar in London.Samie looked gorgeous as she modelled the two-piece, while draping a black leather jacket over her shoulders.She accessorised her look with a black handbag and black boots, while adding a touch of sparkle with a gold chain necklace and matching bracelet.Her brunette locks were worn in soft waves for the occasion, while she highlighted her features with a radiant make-up palette.",
        "Samie flashed a dazzling smile as she arrived at the event, somewhat masking her recent heartbreak after she broke her silence on her break-up. Her ex-boyfriend Tom had confirmed their split news on his Instagram stories last week, where he admitted he was 'gutted' their relationship had ended.And after receiving numerous messages about their split, Samie spoke out about the break-up on Thursday as she told how she 'didn't want to have to write an Instagram story on this'.Taking to her own social media, she penned: 'Really didn't want to have to write an Instagram story on this but the comments and messages I have been getting since Tom posted his story yesterday is just not fair.'I will be speaking about everything soon but at the moment the time isn't right (which I will also explain). ",
        "Samie concluded: 'Thank you for the kind messages, they don't go unnoticed.' It comes amid a difficult time for Samie which recently saw her share a tearful video as she discussed a recent cancer scare on her YouTube channel on Friday.The brunette beauty told her followers fans spotted a lump on her neck which doctors revealed to be 'grade 3' meaning they cannot tell if it is cancerous or not.",
        "Samie said: 'It's a 5cm lump on my thyroid', before revealing she was awaiting surgery where doctors will be able to take a biopsy. She admitted she had not posted a lengthy statement about her recent break up from beau Tom Clare due to her ongoing health concerns. She told the camera: 'It is intense, Me and Tom have broken up. It's ended on good terms. No one's done anything bad to each other, there's still lots and lots of love there'. 'It just wasn't working on the outside and we both agreed on the majority of the things.'There's no bad blood there, me and Tom. I would never say a bad word about him and he wouldn't about me.'Going on to say: 'We just weren't working on the outside. I feel like when you come out of the villa you've got so much pressure and so many other things to worry about that plays a huge factor in a relationship'. ",
        "'I thought me and Tom were going to live happily ever after but life happens'",
        "She then tearfully discussed her upcoming surgery saying: 'Basically what they do is they cut your neck... I shouldn't be upset because I'm so grateful that people messaged and I've caught it now. I'm so grateful'.Before adding: 'But it is still obviously really scary. I'm a young girl, I'm realising how common it is now. I even saw Demi Jones went through it.' Fellow reality star Demi, 24, announced in December 2021 she was cancer free, just seven months after being diagnosed with thyroid cancer. The main symptom of thyroid cancer is a lump in the front of the neck. But the disease tends to develop slowly and may not cause any symptoms at first.Thyroid cancer often causes a painless lump or swelling low down in the front of the neck."
    ]
}