{
    "articleURL": "/wires/reuters/article-12051029/Cignas-health-insurance-strength-drives-profit-forecast-raise.html",
    "content": [
        "By Leroy Leo and Khushi Mandowara",
        "May 5 (Reuters) - Cigna Group on Friday raised its annual profit forecast after lower medical costs at the company's health insurance business helped it beat estimates in the first quarter, lifting shares 7.5% in morning trade.The health insurer also cut the midpoint of its 2023 medical cost ratio - or spending on claims as a percentage of premiums - by 10 basis points to between 81.5% and 82.3%.Peers including UnitedHealth and Humana also beat profit estimates and raised forecasts this quarter thanks to strength in their government-backed plans and low medical costs.Still, that has largely failed to allay investor concerns around 2024, when regulatory pressure on insurers and drug middlemen is seen ramping up in light of the U.S. elections.Investors have also fretted over insurers recording softer medical costs even as hospitals and medical device makers saw a recovery in non-urgent procedures.\"Should we not see economic weakness transpire later in the year or should we pick up some unexpected customers from the Medicaid re-determinations, we may have some upside in our Cigna Healthcare customer accounts,\" Cigna CFO Brian Evanko said in an investor conference call.Insurers are hoping to re-absorb members who may be deemed ineligible for Medicaid as U.S. states resume dropping beneficiaries from the health insurance for low-income people, a process that was halted during the pandemic.",
        "Revenue from Cigna's Evernorth unit - home to its pharmacy benefit management business - rose nearly 8% to $36.18 billion.While revenue across segments was stronger than expected, the forecast increase primarily reflected strength in the insurance business, J.P. Morgan analyst Lisa Gill said in a note.Excluding one-off items, Cigna reported profit of $5.41 per share, beating estimates of $5.22, and raised its profit forecast by 10 cents to at least $24.70 per share. (Reporting by Khushi Mandowara and Leroy Leo in Bengaluru; Editing by Devika Syamnath)"
    ]
}