{
    "articleURL": "/wires/reuters/article-12051113/Gold-sheds-2-US-jobs-growth-Fed-led-rally-fizzles.html",
    "content": [
        "U.S. nonfarm payrolls +253,000 in April",
        "Global gold demand fell in first quarter of 2023- WGCPalladium up more than 3%(Updates prices in paragraphs 2, 3 and 11)By Deep Kaushik VakilMay 5 (Reuters) - Gold beat a fast retreat on Friday after stronger-than-expected U.S. payrolls data tempered expectations of interest rate cuts from the Federal Reserve.Spot gold lost 1.7% to $2,015.33 per ounce by 1:40 p.m. EDT (1740 GMT), but was up 1.3% for the week after surging to $2,072.19 on Thursday, just shy of its record high of $2,072.49, following the Fed's hint that its hiking cycle may be ending.U.S. gold futures settled 1.5% lower at $2,024.80.But those gains were quickly unwound as U.S. employers boosted hiring in April while raising wages.\"The data will not lead the Fed to hike rates in June, but it will likely remind the rate-cut fanciers to settle a bit,\" and this is pressuring zero-yield gold, said Tai Wong, an independent metals trader based in New York.Also weighing on gold, 10-year Treasury yields rose after the jobs data, dulling non-yielding bullion's appeal.Any further economic data \"that points to a cooling U.S. economy - and therefore to rate cuts in the mid to long term - is likely to support the price of gold. Conversely, positive surprises are likely to weigh\" on prices, said Alexander Zumpfe, a precious metals dealer at Heraeus.",
        "Also on the radar were developments surrounding the U.S. banking sector and the U.S. debt ceiling.Economic uncertainty and lower rates boost demand for zero-yielding gold.\"If we see further panic around the debt ceiling or U.S. banks, hold on to your hats as I fear price action could get nasty around these highs and punish bulls and bears,\" said Matt Simpson, senior market analyst at City Index, warning that in \"times of severe stress, all markets, including gold, can fall.\"Silver lost 1.8% to $25.60 per ounce, platinum rose 1.7% to $1,057.25, while palladium gained 3.4% to $1,496.96.(Reporting by Deep Vakil, Arundhati Sarkar and Ashitha Shivaprasad in Bengaluru; additional reporting by Arpan Varghese; Editing by Krishna Chandra Eluri, Emelia Sithole-Matarise, Nick Macfie and Shilpi Majumdar)"
    ]
}