{
    "articleURL": "/wires/reuters/article-12043249/Boeing-supplier-Spirit-Aero-flags-31-million-hit-737-fuselage-defect.html",
    "content": [
        "By Valerie Insinna and Abhijith Ganapavaram",
        "WASHINGTON, May 3 (Reuters) - Spirit AeroSystems Holdings Inc on Wednesday took a hefty $110 million loss in reach-forward charges on Airbus and Boeing jet production and expects a further hit of $31 million to full-year gross profit from disruptions related to a Boeing 737 MAX fuselage production problem.The company announced $110 million in charges on the Airbus A220, Airbus A350 and Boeing 787 during its first-quarter results. Losses on the A220 amounted to about $81 million, including $46 million in nonrecurring supply-chain costs that were due to a \"distressed supplier,\" Spirit CEO Tom Gentile told investors in an earnings call.Those losses are piling up just a month after Boeing paused deliveries of some 737 MAXs due to a problem involving two fittings that join the aft fuselage made by Spirit to the vertical tail, which were not attached correctly.Spirit's first-quarter profit decreased by $17 million as a result of the 737 issue, and \"additional costs are expected\" beyond the $31 million headwind to profit expected this year, \"including costs Boeing may assert to repair certain models of previously delivered units in their factory and warranty costs related to affected 737 units in service,\" the company said.\"However, the company cannot reasonably estimate the remaining potential costs at this time,\" it added.",
        "Spirit AeroSystems shares closed down 12.3% at $26.28 on Wednesday.Spirit now expects cash burn of about $100 million to $150 million in 2023 due to the risk of lowered 737 fuselage deliveries. It initially projected 420 deliveries this year, but may deliver only up to 390 fuselages for 737s, Gentile said.In addition to the A220 loss, the company took an $18 million A350 charge prompted by additional costs related to production schedule changes, and an $8 million loss on the 787 Dreamliner due to increased labor and supply-chain issues.Analysts had expected a tough quarter for Spirit due to the ongoing 737 problem, but \"it looks like the cost of 737 rework could be below some of the most dire estimates,\" said J.P. Morgan analyst Seth Seifman in a note to investors.Rework costs for affected 737 fuselages at Spirit's Wichita, Kansas-based production facility are projected to amount to $5 million, an expense of about $100,000-$150,000 per plane.Repair work to fuselages in Spirit's factory is expected to be completed by the end of July. The company has also started to build and deliver production-conforming 737 fuselages under a revised process, it said.About 500 in-service 737s are suspected of being affected by the bracket defect, Gentile said. Because the problem is not a flight safety issue, impacted jets will be inspected and fixed during maintenance, but Boeing and the Federal Aviation Administration have not yet determined the timing for inspections, Gentile said.",
        "Spirit expects to receive a $180 million cash advance from Boeing in the second quarter, which Gentile said would provide \"additional surplus and cushion.\" Boeing said last week it was contributing \"manufacturing and engineering resources\" to Spirit after the company discovered the 737 bracket issue.Spirit reported a first-quarter adjusted loss per share of $1.69, wider than analyst expectations of a 30-cent loss per share, as per Refinitiv data. It reported $1.4 billion in revenue, missing the analyst consensus of $1.5 billion.Cash burn was $69 million in the first quarter, compared with a cash burn of $298 million a year ago.(Reporting by Abhijith Ganapavaram in Bengaluru and Valerie Insinna in Washington; Editing by Sharon Singleton and Matthew Lewis)"
    ]
}