{
    "articleURL": "/femail/article-12052219/How-watch-King-Charles-coronation-US.html",
    "content": [
        "The event will take place at Westminster Abbey in London on Saturday morningA slew of government officials and famous faces will be in attedanceHere's how you can get a front row seat of all the action from AmericaThousands of Brits will be taking to the streets of London to celebrate King Charles' coronation on Saturday - but how can you get a front row seat of all the action from across the pond in America? Thankfully, numerous outlets will be streaming the event live, so you can watch it all play out from the comfort of your own home.",
        "King Charles III's historic crowning will take place at the Westminster Abbey in London on Saturday morning - and a slew of past and current government officials from all across the globe are going to attend the momentous occasion.And the celebrations will last far longer than the two-hour ceremony, with parties expected to occur throughout England all weekend long, concluding with a star-studded bash on Sunday that will feature performances from Katy Perry and Lionel Richie. ",
        "So how can you see it all go down? Where will it be streaming? What time will it begin? And most importantly, what exactly should you expect from the highly-anticipated event? FEMAIL went ahead and made you a complete guide to King Charles' big day, to ensure that you don't miss a beat.From what networks will be airing it live and which will be replaying it (in case you don't want to get up in the middle of the night to watch) to a minute-by-minute breakdown of the pomp and all the famous faces expected to attend, here's everything you need to know about the King Charles' coronation.Set your alarms: Where can you watch the coronation in the US and what time does it start? ",
        "Thankfully, many American networks will be broadcasting the event - including ABC, CBS, NBC, CNN, and Fox News - so it won't be hard for you to watch it. ",
        "Each of the outlets will also air it live it on their digital platforms, as well as through streaming services like Hulu+ Live TV, FuboTV, and Sling TV. The Associated Press will also be livestreaming the ceremony at APNnews.com.For those who don't want to miss anything, however, you'll have to get up pretty early - because the coronation is set to start at 5am EST/2am PST.ABC announced it will re-air the five-hour event from 10am EST/7am PST to 3pm EST/12pm PST for those who missed it. Minute-by-minute breakdown: What exactly will happen during the five-hour long event?",
        "5am EST/2am PST - Live coverage kicks off on ABC, CBS, NBC, CNN, and Fox News5:20am EST/2:20am PST - King Charles III and Queen Consort Camila's procession from Buckingham Palace begins6am EST/3am PST - The service begins at Westminster Abbey in London7am EST/4am PST - King Charles is crowned8am EST/5am PST - The service concludes and the newly crowned King and Queen begin the procession back to the Palace8:33am EST/5:33am PST - They arrive at Buckingham Palace8:45am EST/5:45am PST - King Charles and Camila receive a royal salute from the military in the Palace gardens9:15am EST/6:15am PST - The royal family appears on the Palace balcony to watch the flypast",
        "The coronation will take place on Saturday, May 6, at the Westminster Abbey in London. It will begin with King Charles III and Queen Consort Camila's procession from Buckingham Palace - which is set to start around 5:20am EST/2:20am PST and will last about 33 minutes.The service will kick off at 6am EST/3am PST and conclude at 8am EST/5am PST.King Charles, 74, is expected to be crowned around 7am EST/4am PST.As soon as the Archbishop of Canterbury places the St. Edward's Crown on his head, trumpets will go off and gun salutes will be fired all around the UK.After the event concludes, the newly-crowned King and Queen will embark on another procession back to the Palace in the Gold State Coach - a horse-drawn carriage that's more than 200 years old and has been used in every coronation since the 1800s.",
        "They will travel via Parliament Square, along Whitehall, around Trafalgar Square, through Admiralty Arch and down The Mall, on a 1.3 mile journey which will bring them back to Buckingham Palace around 8:33am EST/5:33am PST.At 8:45am EST/5:45am PST they will receive a royal salute from the military in the Palace gardens.Then, around 9:15am EST/6:15am PST, the royal family is expected to appear on the Palace balcony to watch the flypast.More than 60 aircraft from the Royal Navy, British Army, and Royal Air Force are expected to fly over Buckingham Palace. Star-studded guest list: Which famous faces are expected to attend the coronation - and who from the US will be there?",
        "Of course, King Charles' eldest son, Prince William, 40 - who is next in line to the throne - will be there with his wife, Kate Middleton, 41, and their three kids, George, nine, Charlotte, eight, and Louis, five. ",
        "Prince Harry, 38, is also confirmed to attend, but his spouse, Meghan Markle, 41, and their son and daughter, Archie, three, and Lilibet, one, will not be there.The couple's friend Omid Scobie said Archie's fourth birthday, which is the same day as the coronation, 'played a factor in the couple's decision' for Meghan to stay back in LA with the two kids.",
        "The King's siblings, Princess Anne, Prince Edward, and Prince Andrew are also expected to be by his side, while the Queen's former husband, Andrew Parker-Bowles, is reportedly going to be 'front and center.'He and Camilla, who married in 1973 and split in 1995, share two children, food critic Tom Parker Bowles and art curator Laura Lopes - both of whom will also attend. On top of the royal family, many former and current government officials from all around the world are expected to be in attendance, including US First Lady Jill Biden and her granddaughter Finnegan Biden.  ",
        "Jill, 71, and Finnegan, 23, who is the daughter of President Joe Biden's scandal-ridden son Hunter, were seen meeting the British Prime Minister's wife, Akshata Murty, on Friday.From there, the women traveled to Charles Dickens Primary School in London, where they met with a group of students who are taking part in a variety of coronation-themed activities. They then attended a reception at Buckingham Palace. Joe will not be in attendance, as the White House noted that no sitting US President has ever attended the coronation of a British monarch. The celebration will continue on Sunday with the Coronation Concert, which will feature performances from Lionel, 73, and Katy, 38. Unfortunately, the concert isn't going to be broadcasted in America.",
        "Sunday's show will see a slew of famous faces in the audience, including Katy's husband Orlando Bloom, and their two-year-old daughter Daisy.Tom Cruise, and David and Victoria Beckham are also rumored to be on the guest list."
    ]
}