{
    "articleURL": "/news/article-12058017/The-Virgin-islands-locate-Google-founder-Larry-Page.html",
    "content": [
        "The US Virgin Islands wants Google co-founder Larry Page to appear in courtPage has been tied to JPMorgan and Jeffrey Epstein over his pedophile ringProsecutors filed a motion to subpoena Page through Google-parent Alphabet The US Virgin Islands is unable to subpoena Google co-founder Larry Page over potential ties to Jeffrey Epstein because he cannot be physically located, federal court filings reveal.",
        "A motion filed by the attorney general for the US Virgin Islands said investigators  tried to identify a physical address at which Page, 50, could be personally summoned to appear in a court.After identifying four possible addresses, none of which were 'valid', prosecutors are requesting the federal government allow Page to be summoned via Alphabet, Google's parent company, as he is still a member of its board.The motion to subpoena Page by 'alternative' means was filed last Thursday and makes up part of a case in which the Virgin Islands alleges JPMorgan facilitated Epstein's sex trafficking ring by handling his payments to recruiters and victims. Page's whereabouts are largely unknown, though he was said in December to have spent the bulk of the COVID pandemic on one of his growing number of private islands - some of which are within the US Virgin Islands.Page purchased Hans Lollik and its smaller neighboring island, Little Hans Lollik, in 2014 for $23 million. ",
        "Prosecutors say Epstein 'may have referred or attempted to refer' Page to JPMorgan. 'Larry Page - the co-founder and co-owner of Alphabet Inc. (Google LLC's parent company) - is a high-net-worth individual who Epstein may have referred or attempted to refer to JPMorgan,' a filing in the case reads. ",
        "Page is one of several billionaire businessmen the Caribbean government has subpoenaed over alleged links to JPMorgan and Epstein. Virgin Islands prosecutors have previously subpoenaed JPMorgan's former chief executive Jes Staley, the other Google co-founder Sergey Brin, and former Disney executive Michael Ovitz.The motion comes just weeks before current JPMorgan CEO Jamie Dimon is due to be deposed later this month. JPMorgan is accused of servicing around 55 Epstein accounts from 1998 until 2013 - years after he was first arrested for soliciting minors in Florida in 2006. Many victims have alleged Epstein sexually abused them on his private island, known as Little St. James, which served as the center of a human trafficking operation in which Epstein trafficked underage girls for sexual exploitation.Attempts to subpoena Page coincide with the sale of the island to Stephen Deckoff, an entrepreneur and investor with plans to transform it into a luxury resort.",
        "'The Government made good-faith attempts to obtain an address for Larry Page, including hiring an investigative firm to search public records databases for possible addresses,' read the filing.'Our process server attempted service at the addresses identified by our investigative firm, but discovered the addresses were not valid for Mr. Page.'In the motion prosecutors justified seeking seeking a special way of demanding Page appear in court by emphasizing that evidence needed to be submitted before the end of the month.",
        "'Moreover, the fact-discovery end date is at the end of this month,' wrote prosecutors.'In these circumstances, the Court should in the interest of securing just and expeditious resolution authorize the Government to provide alternative service by serving Mr. Page by service upon Alphabet Inc.'s registered agent.'In 2021 it was reported by Insider that Page had been living in Fiji during the coronavirus pandemic - mostly on the island of Tavarua - which he owns, according to Insider. The publication claimed an investigation into Page and fellow co-founder Sergey Brin revealed he has been quietly acquiring the network of islands across the globe.",
        "At around the same time Page was also spotted on a smaller island called Namotu.It was reported by Fijian Broadcasting Company News in 2021 that he donated COVID medical supplies to Fiji during the pandemic, according to Insider, but the story miraculously disappeared later.Sources told Insider that health officials in Fiji asked for it to come down, claiming that the information should not have been made public.A later confirmed to DailyMail.com that the article had been removed after health officials said 'they didn't want the donation highlighted.'It remains unclear where Page has been since that stint in Fiji or where the four addresses referred to in the motion are."
    ]
}