{
    "articleURL": "/wires/ap/article-12055797/Blues-snatch-win-Moana-Pasifika-amid-4-shakeup.html",
    "content": [
        "WELLINGTON, New Zealand (AP) - Moana Pasifika´s last-second loss to the Auckland-based Blues on Saturday was the cruelest of the season so far, denying the gallant underdogs their first win this year and in 20 matches over the past two years.",
        "Just as victory seemed to be theirs it was snatched away from Moana Pasifika in heart-breaking circumstances.Moana Pasifika had rallied from 17-3 down to lead 30-24 when the full time siren sounded. They had lost two men to the sin bin in the final minutes of regular time and when the Blues called for a scrum from a penalty in the 83rd minute, Moana Pasifika´s six forwards couldn´t hold up the Blues eight.The scrum collapsed and the referee ran under the posts to award the penalty try that presented the match to the Blues. It was a sort of self-perpetuating penalty try that is becoming routine in rugby: a team is reduced in numbers until it can´t compete at a set piece, then is punished again for failing to do so.Moana Pasifika responded to the decision with a mixture of anger and horror. The Blues´ celebrations of a win which they achieved but didn´t earn were muted. There was a short shoving match between Blues and Moana Pasifika players at the final whistle, then handshakes and regrets on both sides.Captain Dalton Papali´i said the Blues would look back on the match with \"a bit of mixed emotions.\"We knew that Moana were going to come here and bring it to us and there´s a rivalry building here,\" he said. \"They´re a quality side and it goes to show, they came here and nearly took the win (but didn´t) get the rub of the green.\"",
        "Saturday´s win briefly hoisted the Blues from fourth at the start of the 11th of 15 regular season rounds to second place behind the Chiefs, who extended their winning start to the season to 10 matches with a 52-28 win over the Dunedin-based Highlanders.The ACT Brumbies moved past the Blues into second place on Sunday with a 33-26 win over the Melbourne Rebels. The Blues are now third on the table.Flyhalf Noah Lolesio scored two first half for the Brumbies as he sought to revive his selection chances after being cut from the first Wallabies camp of the season. He made his feelings plain during the match to Wallabies coach Eddie Jones who was watching from the grandstand.After the second try Lolesio looked to the stands and shouted \"Carter Gordon\", naming the Rebels playmaker who was preferred by Jones in the Wallabies squad.The Brumbies ended the match under pressure, holding on with a man in the bin as the Rebels attacked their line.The Hamilton-based Chiefs are nine points clear of the Brumbies in first place. The Fijian Drua´s shock win over the Wellington-based Hurricanes in Suva dropped the Hurricanes to fifth place by the end of the round and lifted the defending champion Crusaders to fourth after their 48-13 over the Western Force.",
        "There is then an 11 point gap between the Hurricanes and the sixth-placed NSW Waratahs on a table which is rapidly dividing into two predominant groups.There is the top group of five teams competing for top four placings and the home quarterfinals that go with them. Six teams then are in competition for sixth to eighth places ahead of the eight-team playoffs.The Drua currently are eighth which seems a lowly rank for a team which has already beaten two top-four teams this season; the Hurricanes and Crusaders.They set off major celebrations in Suva with their 27-24 win Saturday over the Hurricanes, clinched with two late penalties to Kemu Valetini, who in round three kicked a late penalty to edge the Crusaders 25-24.The next two rounds will see important matches which may shape the top four. The Crusaders meet the Blues next weekend, repeating the exciting fourth round match which the Crusaders won 34-28. The Chiefs take on the Hurricanes a week later, though the Hurricanes´ performance on Saturday suggests they will have to improve to keep their footing in fourth place.___More AP rugby: https://apnews.com/hub/rugby and https://twitter.com/AP_Sports"
    ]
}