{
    "articleURL": "/tvshowbiz/article-12052137/Serena-Williams-documents-pregnancy-reveal-lead-Met-Gala.html",
    "content": [
        "Serena Williams covered all her bases when she revealed she is pregnant with her second child on the Met Gala red carpet on Monday. ",
        "The tennis champ, 41, even recorded a video leading up to the instantly iconic moment when she stepped out of her car and revealed her secret. In a video she uploaded to YouTube, the mom of Olympia, 5, gave fans a behind-the-scenes look at her getting ready for the big reveal at New York City's Metropolitan Museum of Art. The four-time Olympic gold medal winner narrated the video, saying, 'Olympia does not know right now that I am pregnant.'So the big reveal will be at the Met and then before we leave, I'll tell Olympia.'",
        "She continued: 'The reason I haven't told her is because she can't keep a secret.'The short video showed Serena getting ready for the gala as well as a shot of her with her husband Alexis Ohanian, 40, in the car on their way to the Met Gala.The clip ended as Serena exited the car, revealing her pregnancy to the world.Serena wasn't the only Met Gala guest that revealed a pregnancy on the red carpet.Model Karlie Kloss, 30, also debuted her baby bump on Monday night. She is also expecting her second child. She already shares son Levi, 2, with husband Joshua Kushner.On Tuesday, Karlie shared a photo of herself and Serena at the gala.",
        "'Bumpin',' Karlie captioned her photo where they both show off their baby bumps in their Met Gala looks.",
        "Serena also posted a series of herself with her husband to her Instagram on Monday.In one photo, she holds her baby bump while in another the husband and wife stand together smiling. She captioned the post:  'Was so excited when Anna Wintour invited the 3 of us to the Met Gala.'When the seven-time Wimbledon winner retired from tennis, she revealed that she hoped to have a second child. "
    ]
}