{
    "articleURL": "/wires/reuters/article-12045547/Ukraine-president-visit-war-crimes-court-The-Hague-Thursday.html",
    "content": [
        "Ukraine's Zelenskiy backs new aggression tribunal in Hague visit",
        "U.S., Europe support aggression tribunal idea in some formDutch PM Rutte optimistic on talks on F-16s for UkraineZelenskiy meets Dutch king, parliament in surprise tour(Adds comments from Zelenskiy in paragraph two, context in paragraphs three to six, changes identifier for media clients)By Stephanie van den Berg and Toby SterlingTHE HAGUE, May 4 (Reuters) - Russian President Vladimir Putin must be brought to justice for his war in Ukraine, Ukrainian President Volodymyr Zelenskiy said on Thursday in The Hague, calling for a new international tribunal for the \"crime of aggression.\"\"We're going to set up a specific tribunal... to show that these people are not untouchables,\" Zelenskiy told a press conference, underlining that the invasion itself should be seen as the \"primary offence\" committed by Moscow.Zelenskiy's declaration was made during his surprise visit to The Hague, known as the capital of international justice. But it was largely symbolic - the idea of such a court has some support, but there is little prospect Moscow, which denies wrongdoing in Ukraine, would participate.In March, the International Criminal Court, a permanent war crimes tribunal that Zelenskiy also visited on Thursday, issued an arrest warrant for Putin for suspected deportation of children from Ukraine, which would be a war crime.",
        "But the ICC does not have jurisdiction to try any crime of aggression in Ukraine. The United Nations defines the crime of aggression as \"invasion or attack by the armed forces of a state (on) the territory of another state, or any military occupation\".The European Commission supports the creation of a separate international centre for the prosecution of the crime of aggression in Ukraine, and the U.S. has said it would like to see such a tribunal, though the allies differ over what form it should take.\"We all want to see a different Vladimir here in The Hague, the one who deserves to be sanctioned for his criminal actions here, in the capital of international law,\" Zelenskiy said in a speech earlier in the day, referring to Putin.\"I'm sure we will see that happen when we win, and we will win,\" he said.Major legal and practical questions remain as to how a legitimate aggression tribunal could be established, either by a group of countries supporting it or with approval from the U.N. General Assembly.Russia is not a member of the ICC and rejects its jurisdiction. It denies committing atrocities during its conflict with Ukraine, which it terms a \"special operation\" to \"demilitarise\" its neighbour.Earlier in the day, as he left the ICC after a visit of just under an hour, Zelenskiy, dressed in his trademark khaki, waved at a Ukrainian family standing outside the ICC building as they shouted \"Slava Ukraini\" - or Glory to Ukraine.",
        "The Netherlands has been a strong supporter of Ukraine, with Dutch Prime Minister Mark Rutte in February saying he did not rule out any kind of military support for Kyiv as long as it did not bring NATO into conflict with Russia.Pledging \"unwavering support,\" Rutte said there were \"no taboos\" on sending F-16 fighter jets to Ukraine, and that discussions were underway with other countries on the matter, before adding: \"We are not there yet.\"Russia has stepped up attacks as Ukraine prepares for a counteroffensive to try to retake Russian-occupied land in the south and east. Russian shelling in the frontline southern region of Kherson killed at least 23 civilians on Wednesday. (Reporting by Bart Meijer, Stephanie Van Den Berg, Toby Sterling; Writing by Ingrid Melander; Editing by Alexandra Hudson and Rosalba O'Brien)"
    ]
}