{
    "articleURL": "/wires/ap/article-12055073/Yankees-slugger-Judge-expected-Tuesday-hip-injury.html",
    "content": [
        "ST. PETERBURG, Fla. (AP) - New York Yankees manager Aaron Boone expects slugger Aaron Judge will return from a right hip strain for Tuesday night's game against the Oakland Athletics.",
        "Judge worked out Saturday at the team's minor league complex in Tampa, Florida, about 30 minutes from where the Yankees were playing the Rays.\"I think he´s doing really well,\" Boone said before playing the Rays. \"I think we´re going to be in a good spot come Tuesday to where he´s done everything for several days.\"\"That was the calculus in this weekend,\" Boone added. \"It´s like, do we want to push him back out there if he´s 85, 90%. I wasn´t comfortable doing that just because I don´t want a strain to turn into a bad situation where we´re talking six, eight weeks.\"Judge hasn't played since April 27 and missed his eighth games Saturday. The injury-depleted Yankees started Saturday with a 17-16 record and trailed the major league-best Rays by 10 games in the AL East.Third baseman Josh Donaldson, out since April 6 with a right hamstring strain, worked out with Judge and is to intensify his on-field drills during the upcoming week ahead of a possible minor league rehabilitation assignment.",
        "Boone said that designated hitter Giancarlo Stanton, sidelined since April 16 due to a strained left hamstring, is not as close as Donaldson to coming back but is making progress.\"He´s doing well.\" Boone said. \"I've been kind of encouraged with how is progress has gone pretty well.\"",
        "Right-hander Luis Severino is set to make the the first of at least three minor league starts Wednesday for Triple-A Scranton/Wilkes-Barre.Left-hander Carlos Rodón is scheduled to get an injection for his ailing back on Tuesday,___ AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}