{
    "articleURL": "/femail/article-12038797/Theres-good-chance-wife-cheating-says-TRACEY-COX.html",
    "content": [
        "Tracey Cox says social media has made it easier for women to cheat READ MORE:  There's a sex act that's worryingly becoming the normMost people have affairs as a transition out of a failing marriage or as a desperate attempt to prop up a relationship that is sexually unfulfilling. ",
        "These women do it for, well…different reasons. Reasons like fun, excitement and to keep sex hot with a husband they love and find attractive.Why play away when things are already pretty good at home?Here are some answers: written by three women who were willing to bare all.",
        "MY AFFAIR TURBO-CHARGES SEX WITH MY HUSBANDMartina, is 25, and has been having an affair for four years I have no complaints about my partner. He's a great dad, he's fit, funny and attractive. We laugh, we get on well. We'll pack the kids off to the grandparents on the weekend and go back to bed for a few hours on the weekends. Our sex is very, very good – but there's a reason for that. I keep it exciting by having an affair on the side.",
        "Told to me by the women who have succeeded. (But please note: this does not mean I condone affairs)Tell no-oneDon't swap social media detailsDon't have any written contact or leave any physical evidence anywherePay in cashDon't get drunkChoose someone who is also involved and has no intention or desire to leave their primary relationshipDon't give details about your spouseIf you don't have a good memory, forget it. Ground excuses in truth to make them believable but don't go into detailBuild excuses into your life: a gym class, a book club, regular meet ups with friends your partner doesn't knowIf your lover is known to your partner, hide in plain sight: let them see you are friendsUse protection: semen has an unmistakable smell and can reappear at the most inopportune timeMaintain the status quo at home",
        "I have a high sex drive but find monogamous sex boring. I used to fantasise about sex with other men while having sex with my husband. It worked but eventually lost the power to arouse me.I'm almost embarrassed to admit who I am having my affair with: my personal trainer. Yes, it's a cliché but it's hard NOT to build sexual tension when they are putting their hands on your body, and most are attractive. We started out flirty, there was lots of sexual innuendo, intense eye contact and 'moments'. I was desperate to sleep with him.My husband went to stay with his parents one weekend to do some jobs around their house. I knew this was my opportunity. I don't know what excuse he gave his girlfriend at the time, but we met for drinks which turned into dinner which turned into us making out like mad in an alleyway. I gave him a BJ. He kissed my breasts. I got home and let the babysitter go and was so horny, I masturbated the second she left while on the FaceTime to him.That was four years ago. I'd forgotten that sex could be in technicolour, not just black and white. I've never had sex like this. Affair sex is hot but the thrill wears off and this hasn't. He pushes me into doing things that are way out of my comfort zone. He tells me he's 'drunk on me', but knows I will never leave and doesn't want me to.",
        "The affair had the opposite effect to what I expected: it made me want sex with my husband more not less. I come back from seeing my lover and feel sexy and desired, still tingling from his touches. My husband picks up on the vibe and thinks I am simply in the mood for sex. I am getting more and more adventurous with what I suggest we do. I'm not sure where my husband thinks all this newfound sexual energy and inventiveness is coming from – I would be highly suspicious if it was me! – but he never questions it, just appreciates it.Why would I stop? It's benefitting both of us.'MY JOB MAKES IT TOO HARD TO RESISTAlyssa, 41, works in real estate and is three years into her second marriageMy first marriage didn't end because I had affairs, it ended because I outgrew my husband. I overtook him career wise and was mixing with men of a different calibre. Smarter, richer and more interesting. I'd never been exposed to men like this, and they were impossible to resist.Everyone has affairs in my business – the women and the men. We're away a lot and in hotel rooms all the time. There's a lot of drinking and socialising. I loved my first husband but more as a friend. We hadn't had sex in a year when I had my first affair, so it didn't feel like cheating.",
        "It started with a drunken, heavy kissing session with a colleague. I woke up to see love bites on my neck, but I wore polo necks for a week and my husband didn't have a clue. Once you've broken the fidelity seal and got away with cheating, it's hard to stop.",
        "US research (2020) shows men and women are now roughly equally likely to report having had sex with someone other than their spouse or partner: 16 per cent of men and 15 per cent of women.In the UK, the British Sexual Attitudes Survey found 20 per cent of men and 13 per cent of women had extramarital sex. But a study by a website that facilitates extramarital affairs found women make up nearly half of their members (45 percent) and the number of women using the site has increased by 60 per cent in the previous five years. Here's some of the reasons why... We're more independent: Our grandmothers didn't cheat (as much) because they didn't have the opportunity. Women have made tremendous strides in education, careers and financial independence. We're less reliant on our partners for money, more likely to work and are more ambitious. We seek affairs not just for sex but when we feel unfulfilled by partners who don't share our values or support our goals.It's easier to cheat: Social media and dating apps have made it easier to connect with new people outside our social circle. If you're feeling neglected, unappreciated or undervalued in your relationship, you're more likely to seek validation from strangers online. The anonymity creates a sense of novelty and excitement that's often lacking in long-term relationships.Society is less judgemental: Women's attitudes towards sexuality and monogamy have also contributed to the rise in infidelity. We're less judgemental of women who feel empowered to explore their wants and needs and more open to non-monogamous relationships.",
        "I slept with that guy two weeks later and the sex was charged and exciting. No foreplay: we got straight into it and I loved that. That's the sex I crave.My affairs didn't save my first marriage but regular sex did make me kinder and more tolerant of my husband for longer. We eventually split and I met my second husband a year later through work. He is dynamic and successful – though I now realise two ambitious people in a relationship doesn't work. We never see each other and when we do, only give each other half attention.In my first marriage, the affairs were for sex. In my second, I'm looking for emotional connection as well. My current affair has lasted six months. It's with someone I work with who is also married. Both of us enjoy our marriages but supplement what's missing with each other.I think it's naïve to expect to get all your needs met by one person. I'm not sure if my husband is doing the same but I expect he is. It really wouldn't bother me.ONE NIGHT STANDS KEEP MY MARRIAGE ALIVEEmilia, 33, has been married for 13 years and having extramarital sex for the last seven yearsI have one-night-stands with strangers. I'm not technically having affairs, but I am cheating on a long-term basis with no desire to stop. Comparing the two, I think one-off sex is far less of a betrayal than a long-term affair.",
        "I married very early and very quickly. We met and married within eight months. I was three months pregnant at the time. We have one child. I am only eight years younger than my husband but I feel 20 years younger. He's 38 and acts like he's in his sixties. He's constantly tired, I am full of energy. He likes routine, I like novelty. He hates to travel, I love it. We have sex once every three months, in the dark, missionary style. Despite our obvious differences, we have quite a nice life together – now, anyway.Five years ago, I felt alone and unhappy and had a mini mental breakdown. A very worried close friend begged me to leave but I wouldn't. So, she suggested I seek sex outside the marriage to bring some 'joy' into my life. I thought she was crazy but two months later, joined Tinder.My first hook up was with a guy in his 40s. I wasn't sure of my attractiveness and didn't aim high. We met in a coffee shop near the station where he lived. He looked thrilled when he saw me. The attention and obvious desire made me want to cry. I didn't realise how much I missed it until it was directed at me. The sex we had was very sweet: I think the guy sensed it was my first time hooking up and that I was vulnerable. He wanted to meet again but I already knew if I was going to do this, there would be a one night only rule.Since then, I've met men for sex every six weeks. Nearly all have been enjoyable, honest sexual encounters where everyone gets what they want. It's not just sex, I'll often hang around and chat for a while afterward. They're always during the day and there's no alcohol involved which helps to keep me safe – and reduce the chances of getting caught.My marriage isn't perfect but it also isn't bad enough to put my husband and son through the trauma of my leaving. This is my way of making it work.Check out traceycox.com for Tracey's weekly podcast, SexTok with Tracey and Kelsey, her two product ranges (sold through Lovehoney) and more information about love and sex."
    ]
}