{
    "articleURL": "/wires/aap/article-12053477/AOC-seeks-funding-boost-prospects-home-Games.html",
    "content": [
        "Australian Olympic Committee president Ian Chesterman has called for more funding if the host nation wants to succeed at the 2032 Games in Queensland.",
        "Chesterman said at Saturday's AOC AGM that the system which produced a successful Australian campaign at the last Olympics two years ago is struggling.\"Everything is going up except the funds to run the programs and results don't come at the flick of a switch,\" Chesterman said in Sydney.\"So if Australia is to have a successful team in 2032, the system, the people that took us to that success in Tokyo need nurturing now.\"While we are excited about Paris 2024, we know that campaign to qualify and the campaign at the Games themselves will be the most expensive yet.\"The AOC have a $25 million budget for Paris and an extra $1.1 million in contingency for the possibility of increased air fares.Chesterman said the AOC was increasing their financial support of Olympic sports that receive little or no government funding.The summer sports that fell into that category will have funding boosted in the quadrennial period between Games from $100,000 to $125,000, while winter sports in that situation will have support lifted from $100,000 to $150,000 in the new quad.Asked about the possibility of more funding coming out of next week's federal budget, Chesterman said the AOC had worked very closely with the government so they understood the need for increased support.",
        "\"We've not set the time frame of when we'll receive that boost in funding, I think everyone recognises the need to boost funding, whether it's this cycle or next cycle, we'll have to wait and see,\" Chesterman said.Commenting on the ongoing war between Russia and Ukraine, and what the IOC will decide in relation to the participation of Russian athletes, Chesterman said \"one senses there's still much to play out in the coming months and we do not expect this matter to be resolved any time soon.\"The AOC announced four deputy chefs de mission to join Anna Meares in managing the Australian Olympic team in Paris.All four are previous Olympians, gold medallists Ken Wallace (canoeing) and Mark Knowles (hockey), plus Bronwen Knox (water polo) and Kyle Vander-Kuyp (athletics).The AOC and their Athletes' Commission on Saturday announced their support for the Yes vote at the upcoming referendum."
    ]
}