{
    "articleURL": "/wires/ap/article-12047925/Oklahoma-inmate-supported-Dead-Man-Walking-author-nun.html",
    "content": [
        "OKLAHOMA CITY (AP) - Prominent death penalty opponent Sister Helen Prejean, whose book \"Dead Man Walking\" was turned into a movie, on Wednesday joined others calling on Oklahoma Gov. Kevin Stitt to grant death row inmate Richard Glossip a 60-day reprieve from his scheduled execution.",
        "Prejean joined Republican Reps. Kevin McDugle and Justin Humphrey and others in asking Stitt for a 60-day delay similar to the one he granted Glossip in November to give the state Court of Criminal Appeals time to rule on claims of innocence and prosecutorial misconduct that were eventually denied.\"The people of Oklahoma need to be the one to get to Gov. Stitt, who has that power to grant a reprieve,\" Prejean, a spiritual advisor to Glossip said during a news conference at the state Capital.Spokespeople in Stitt's office did not immediately return phone calls and messages asking for comment.McDugle, who says he supports the death penalty, called for Stitt to delay the execution while two appeals by Glossip are pending before the U.S. Supreme Court.\"Allowing this case to play out in federal courts would be following the law. Following the law means not rushing the execution process,\" McDugle said.",
        "The Oklahoma Pardon and Parole Board voted 2-2 last week to reject a clemency recommendation for Glossip with one member recusing himself because his spouse is a prosecutor who was previously involved in Glossip´s case, despite state Attorney General Gentner Drummond supporting clemency.Stitt can not grant clemency without a recommendation from the parole board, but can grant a delay.",
        "Glossip's attorney, Don Knight, objected at the start of the hearing to proceeding without a replacement for the recused board member.On Tuesday, Knight amended a lawsuit challenging the Pardon and Parole Board meeting with four members present, instead of the full five-member board.The amended lawsuit, filed in Oklahoma County District Court, asks for a stay of execution until Glossip has a clemency hearing before a full board and that the parole board's vote denying clemency be declared null and void.\"The State of Oklahoma has already agreed that Richard Glossip was denied a fair trial ... he has now been denied a fair clemency hearing,\" Knight said in a statement. \"The Board´s split decision is precisely the outcome this lawsuit sought to avoid, and it underscores the grave injustice of allowing (Glossip's) execution to proceed without a proper clemency hearing before a fully constituted Board.\"Drummond on Monday filed a request that the U.S. Supreme Court stay the execution after taking the unusual step of supporting the clemency request.\"Absent this Court´s intervention, an execution will move forward under circumstances where the Attorney General has already confessed error-a result that would be unthinkable,\" according to the stay request.During the clemency hearing, Drummond said he believes Glossip is guilty, at least, of accessary after the fact, but has numerous concerns about the fairness of the trial, including that Justin Sneed, the key witness against Glossip, lied to the jury about his psychiatric treatment and reasons for taking the mood-stabilizing drug lithium.",
        "Glossip, now 60, was convicted of the 1997 murder-for-hire killing of his boss, motel owner Barry Van Treese, at two separate trials based largely on the testimony of Sneed, a co-defendant in the case. Sneed admitted robbing and killing Van Treese, but claims he only did so after Glossip agreed to pay him $10,000. Sneed received a sentence of life in prison.Glossip has been scheduled to be executed three times, only to be spared shortly before the sentence was set to be carried out. He was only hours from being executed in September 2015 when prison officials realized they had received the wrong lethal drug, a mix-up that helped prompt a nearly seven-year moratorium on the death penalty in Oklahoma.Glossip´s case attracted international attention after actress Susan Sarandon - who won an Academy Award for her portrayal of Prejean´s fight to save a man on Louisiana´s death row in the 1995 movie based on Prejean's book - took up his cause in real life. His case also was featured in a 2017 documentary film titled \"Killing Richard Glossip.\""
    ]
}