{
    "articleURL": "/wires/reuters/article-12053315/Biden-says-not-ready-invoke-14th-Amendment-avoid-debt-default.html",
    "content": [
        "WASHINGTON, May 5 (Reuters) - President Joe Biden said on Friday he was not yet ready to invoke the 14th Amendment to avoid the United States defaulting on its debts as early as June 1, comments which for the first time suggested he has not ruled out the option.",
        "\"I've not gotten there yet,\" Biden said in an interview with MSNBC when asked about the possibility of invoking the amendment.The divided U.S. Congress is running out of time to raise the federal government's $31.4 trillion debt ceiling, with the Treasury Department warning it could be unable to pay its bills as soon as June 1.If Congress fails to act, some legal experts say Biden has another option to avert a crisis: Invoke the 14th Amendment to the U.S. Constitution to ensure the United States can continue to pay its bills.Section Four of the amendment, adopted after the 1861-1865 Civil War, states that the \"validity of the public debt of the United States ... shall not be questioned.\" But the clause has been largely unaddressed by the courts.Some experts have suggested that Biden could invoke this amendment to raise the debt ceiling on his own if Congress does not act. That would almost certainly lead to prolonged legal wrangling, which could unsettle financial marketsWhite House and other administration officials have examined the possibility but many have dismissed it as a last ditch solution unlikely to survive a court challenge, according to a person briefed on those discussions.Biden and top Republicans and Democrats from the U.S. Congress will sit down on Tuesday next week to try to end the three-month standoff over the federal debt ceiling and avoid a crippling default before the end of the month.",
        "The two sides go in with clear positions: Biden is calling on lawmakers to raise the federal government's self-imposed borrowing limit without conditions, and Republican House Speaker Kevin McCarthy says his chamber will not approve any deal that doesn't cut spending to address the nation's growing budget deficit.(Reporting by Nandita Bose and Trevor Hunnicutt in Washington; Editing by Kim Coghill)"
    ]
}