{
    "articleURL": "/wires/reuters/article-12053909/Russian-nationalist-writer-Prilepin-wounded-car-bombing--TASS.html",
    "content": [
        "Third bomb attack inside Russia on prominent war supporter",
        "Investigators say suspect admits acting on behalf of UkraineForeign ministry spokeswoman blames Kyiv and WestKremlin declines to comment pending investigation(Adds Russian foreign ministry, Ukrainian statement)By Mark TrevelyanMay 6 (Reuters) - A prominent Russian nationalist writer, Zakhar Prilepin, was wounded in a car bombing that killed his driver on Saturday and investigators said a detained suspect admitted acting on behalf of Ukraine.The attack took place three days after the Kremlin said Ukraine attempted to hit the Kremlin with drones - Ukraine denied it had anything to do with the attack.Russia's Foreign Ministry accused Ukraine and the Western states backing it, particularly the United States, for the latest attack on the writer, an ardent proponent of Moscow's military campaign in Ukraine.Ukraine's security services, in its standard response, refused to confirm or deny involvement. A senior Ukrainian official accused Russia of staging the incident.Russia's state Investigative Committee said Prilepin's Audi Q7 was blown up in a village in Nizny Novgorod region, about 400 km (250 miles) east of Moscow, which it was treating as an act of terrorism. It said Prilepin had been taken to hospital.The committee released a photograph showing the white vehicle lying overturned on a track next to a wood, with a deep crater beside it and pieces of metal strewn nearby.",
        "The committee later issued a statement saying investigators were questioning a suspect identified as Alexander Permyakov.\"The suspect was detained and, in the course of questioning, he provided testimony that he acted on the instructions of the Ukrainian special services,\" said the statement, read by a woman in uniform.The governor of Nizhny Novgorod region, Gleb Nikitin, said on Telegram that doctors had successfully operated on Prilepin and that he was now under sedation to help his recovery.Russia's Foreign Ministry, in a statement on its website said: \"Responsibility for this and other terrorist acts lies not only with Ukrainian authorities, but also their Western patrons, the United States in the first instance...\".It said Washington's failure to denounce this and other attacks was \"self-revealing\" for the U.S. administration.State news agency TASS quoted security sources as saying the suspect was a \"native of Ukraine\" with a past conviction for robbery with violence.Ukraine's SBU Security Service issued its standard response of declining to confirm or deny involvement in the bombing.Mykhailo Podolyak, a senior adviser to Ukrainian President Volodymyr Zelenskiy said he believed Russian authorities had staged the attack.\"Everyone understands that this is all a staged performance,\" Podolyak told Ukrainian television. \"This is staged and the bombings at the Kremlin are aimed at domestic audiences.\"",
        "The novelist was the third prominent pro-war figure to be targeted by a bomb since Moscow's full-scale invasion of its neighbour in February 2022.Russia has blamed Ukraine for the deaths of journalist Darya Dugina and war blogger Vladlen Tatarsky in the two previous attacks, and Kyiv has denied involvement.Ukrainian news site UNIAN ran an online poll asking readers who \"in the pantheon of Russian scum propagandists\" should be targeted next after Dugina, Tatarsky and Prilepin.Officials at the White House, Pentagon and State Department did not immediately respond to requests for comment. No comment was immediately available from Britain's Foreign Office.MOSCOW SAYS UKRAINE ACTING ON WEST'S BEHALFIt was the second time this week that Moscow has accused Ukraine of carrying out terrorist attacks on behalf of the West, a narrative it appears to be pushing with increasing urgency but which Kyiv and Washington reject as baseless.On Wednesday, Russia accused Ukraine of trying to kill President Vladimir Putin with a night-time drone attack on the Kremlin. Ukraine denied that too, and the White House said accusations that Washington had a hand in it were \"lies\".Prilepin often speaks out in support of the Ukraine war on social media, with more than 300,000 followers on Telegram and his own website and YouTube channel.",
        "He fought for Russian proxy forces in eastern Ukraine´s Donbas region before last year's invasion and led a military unit there, boasting in a 2019 YouTube interview that his unit \"killed people in big numbers\".\"These people are dead, they are buried and ... there are many of them,\" he said. \"Not a single unit among the Donetsk battalions had such results. It was outrageous chaos what we did there ... Not a single field commander had such results as I had.\" (Additional reporting by Olena Harmash in Kyiv; Writing by Mark Trevelyan; Editing by Hugh Lawson, Ron Popeski and Daniel Wallis)"
    ]
}