{
    "articleURL": "/news/article-12054249/Flypast-King-Charles-coronation-scaled-downpours-London-drenched.html",
    "content": [
        "The Met Office has predicted consistent rain over today's proceedings CORONATION LIVEBLOG: Click here to follow live updates throughout today  How are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.uk The military flypast over Buckingham Palace to mark the coronation of the King and Queen was scaled down because of the weather and was formed of just helicopters and The Red Arrows, the Ministry of Defence said.",
        "London has been drenched by heavy rain with storms around the UK on Saturday, and the previously-scheduled flypast had to be drastically cut back in response. An MoD statement said: 'Due to unsuitable weather conditions, the coronation flypast will now be formed of helicopters and the Royal Air Force aerobatic team The Red Arrows. The flypast will last for two minutes and 30 seconds.'The RAF's Red Arrows display team trailed red, white and blue smoke as their Hawk jets flew over the crowds gathered on The Mall and outside the palace.More than 60 aircraft from the Royal Navy, British Army and Royal Air Force had been due to take part in the flypast, but 'unsuitable weather conditions' meant that plan had to be abandoned. Instead, helicopters from the three services and the Red Arrows took part in the display which lasted for around two-and-a-half minutes.The news, which came as a disappointment to many royal fans, followed a soldier having to pause and tip rainwater out of his tuba while marching back to Buckingham Palace after the King and Queen's Coronation ceremony at Westminster Abbey on Saturday. Will you be braving the rain to head out and watch the coronation? Email stewart.carr@mailonline.co.uk ",
        "The announcement came just minutes before the royal family were due to appear on the Buckingham Palace balcony. ",
        "The final flypast involved 16 Juno, Wildcat, Merlin, Apache, Chinook and Puma helicopters and nine Red Arrow Hawks. The King and Queen appeared to watch the flypast from the balcony along with other members of the family, including the Prince and Princess of Wales and their children, Prince George, Princess Charlotte and Prince Louis.As the aircraft approached, the Princess of Wales was seen speaking to Prince Louis and encouraging him to look up from the Buckingham Palace balcony.The Prince of Wales made a remark as he leaned closer to his wife, prompting her to turn and smile.Prince Edward, his wife Sophie and their two children, Lady Louise Windsor and James, Earl of Wessex also watched from the balcony. The display over The Mall and Buckingham Palace was originally meant to last for six minutes, but the scaled-down version lasted for less than half of that time.At least seven military helicopters flew up the Mall and over the palace, followed by the Red Arrows with their signature red, white and blue smoke. The King and Queen set the seal on their historic coronation day with their Buckingham Palace balcony appearance, where they wore lavish robes and their crowns as they waved to cheering crowds.Footage from Royal Navy helicopters showed how poor the weather was in the skies above London. Rain streaked the windshields of the aircraft as they flew low over the heart of the capital. ",
        "Thousands of people who have camped overnight in the Mall are wearing rain ponchos and carrying umbrellas ready for King Charles' long-awaited coronation. It wouldn't be a classic British celebration without a spot of rain – and the King's big day followed a long tradition of rainy Coronation days in Britain in the last century.Similar scenes were seen outside Westminster Abbey, as excited crowds waving union jacks flags remain undeterred by the likelihood of the heavens opening up. The crowds got a front row seat at the first Coronation in 70 years and were able to watch a soldier's quick-thinking tuba performance as they were one of 5,000 servicemen and women to take part in the processions to and from the abbey.The soldier, who was one of dozens playing an instrument as he processed down the Mall, had to take the unusual step of upturning the tuba after it became full - making it impossible to play.The moment happened as the royal family made their way back to the Palace after a two-hour service in front of global leaders, other royal families and hundreds of community figures, where they will later appear on the Palace balcony.It was captured on camera as broadcasters Sky, ITV and the BBC all competed for viewers as they streamed the parade live to be watched by millions of people around the world.",
        "The Met Office has warned of a 60 per cent chance of light rain from 9am until midday, then an 80 to 90 per cent chance of heavy rain until 2pm.This period covers the key events of today's coronation - with Charles and Camilla's procession setting off from Buckingham Palace at 10.20am today - before the service at Westminster Abbey at 11am. But the King himself didn't seem fazed by the prospect of wet weather. When a fan on the Mall asked him about the weather yesterday, he replied simply: 'Rain is a blessing... except for the cameras.'",
        "Met OfficTemperatures will reach highs of 17C by the afternoon, which is around average for the time of year. The historic flypast moment, watched around the globe, was a fulfilment of the King's destiny, but followed the death of his mother, Queen Elizabeth II, last September after a 70-year reign.The coronation was a spiritual and deeply personal event for the King, a 'committed Anglican Christian', who was anointed, seen kneeling at the abbey's high altar and receiving homage from his son and heir the Prince of Wales.William's interaction with his father where he touched St Edward's Crown then kissed his father on the right cheek appeared a poignant moment for the King.As William knelt before Charles, who held his son's hand between his palms, the future monarch said: 'I, William, Prince of Wales, pledge my loyalty to you and faith and truth I will bear unto you, as your liege man of life and limb. So help me God.'",
        "The King's estranged son the Duke of Sussex was among the congregation, sitting two rows behind his brother with the Duke of York's family, and he was seen intently watching the crowning.And when a few minutes later the congregation was invited pay homage to the new monarch, Harry was seen, along with the other royals around him, speaking the words: 'God save King Charles. Long live King Charles. May the King live forever.'Charles delivered a King's Prayer, the first time a monarch has spoken words to God aloud during a coronation, and he prayed to be a 'blessing' to people of 'every faith and conviction'.Before the crowning the archbishop delivered a sermon to the 2,300 guests, a gathering of world leaders, celebrities, UK politicians, foreign royalty, everyday heroes and the royal family.",
        "WHILE the weather might not be on-side, at least the stars have put on a show for the Coronation.In what some may herald as a good omen, a meteor shower lit up the skies early this morning ahead of King Charles' big day.The Eta Aquariid meteor shower was forecast to peak - with up to 50 meteors per hour - from midnight until dawn.It occurred as the Earth passed through dust left over from Halley's Comet, which is only visible from Earth every 76 years.Appropriately, Halley's Comet is depicted in the Bayeux Tapestry, which tells the story of the Norman Conquest by William the Conqueror - Charles's ancestor who was crowned in Westminster Abbey on Christmas Day in 1066.Meteors are pieces of debris, sometimes as small as a grain of sand, that enter Earth's atmosphere at speeds of up to 70 kilometres per second, vaporising and causing the streaks of light that delight skygazers.The meteor show favoured the Southern Hemisphere and appeared low in the sky for northerly latitudes, such as the UK, in the early predawn hours.While it peaked early this morning, the Eta Aquariid shower will continue until May 28.According to the Greeks and Romans, the arrival of comets, meteors and meteor showers were signs that something good or bad had happened or was about to happen.In Ancient Greece, an astronomer named Ptolemy claimed that shooting stars would occur when the gods opened up the sky to watch the humans below.",
        "Mr Welby began by telling the congregation: 'We are here to crown a King, and we crown a King to serve.'What is given today is for the gain of all. For Jesus Christ announced a kingdom in which the poor and oppressed are freed from chains of injustice. The blind see. The bruised and broken-hearted are healed.'Speaking to Charles and Camilla, Mr Welby said: 'The weight of the task given you today, Your Majesties, is only bearable by the spirit of God, who gives us the strength to give our lives to others.'With the anointing of the Holy Spirit, the King is given freely what no ruler can ever attain through will, or politics, or war, or tyranny: the Holy Spirit draws us to love in action.'In the stillness of the abbey, Mr Welby held St Edward's Crown high above Charles and, after placing it on his head at 12.02pm, said 'God save the King' - words loudly repeated by the congregation.The archbishop had adjusted the position of the crown for several seconds before it sat comfortably, and even crouched down to briefly check it was positioned properly on the King's head.A fanfare was played and the abbey's bells rang for two minutes after the crowning, with gun salutes fired from nearby Horse Guards Parade, the Tower of London and saluting stations across the nation and from warships at sea.Volleys were heard at Hillsborough, Cardiff and Edinburgh castles, Stonehenge and HMS Lancaster, which had sailed to Sudan to help British citizens and others escape the fighting in Khartoum.The Queen was crowned with Queen Mary's Crown, with Camilla having been anointed in public in a break with tradition.During the crowning the Queen was seen adjusting her hair out of her face.Earlier, Charles and Camilla's Diamond Jubilee Coach arrived at the abbey, following a procession from Buckingham Palace, in the midst of a Sovereign's Escort provided by the Household Cavalry's Blues and Royals and Life Guards with their shining breastplates and plumed helmets and led by the Household Cavalry Mounted Regiment band.The monarch and his wife's entrance through the west door was heralded by a fanfare from four State Trumpeters of the Household Cavalry and the abbey congregation stood as one.A large ceremonial procession was lined up before the King and Queen with representatives of all elements of the nation's ceremonial and spiritual life.There were recipients of Orders of Chivalry and Gallantry, Heralds from the College of Arms in their colourful tunics, senior clergy associated with the monarchy and the glittering coronation regalia carried by leading figures.St Edward's Crown was carried by General Sir Gordon Messenger, Lord High Steward of England.With their lavish and unwieldy robes, the King and Queen walked single file along the nave of the abbey with Camilla ahead of Charles as the hymn I Was Glad As They Said Unto Me was sung.The coronation service began with a new element when the King was greeted by 14-year-old Samuel Strachan, the longest-serving chorister of the choir of the Chapel Royal, St James's Palace.The chorister, who attends the City of London School, welcomed the monarch in the name of the 'King of Kings' - a reference to Jesus Christ - and Charles replied: 'In his name, and after his example, I come not to be served, but to serve.'Before the King took the Oath - making a succession of promises, including to maintain in the UK the Protestant Reformed Religion established by law - the archbishop delivered a preface to Charles's declaration - another first.He told the congregation the Church of England, which is headed by the King, will seek to foster an environment where 'people of all faiths and beliefs may live freely' - echoing the words of the late Queen and Charles.Charles was anointed with holy oil away from public view, shielded by the Anointing Screen.The Dean of Westminster will have poured oil from the ampulla - an eagle-shaped vessel - into the coronation spoon - the oldest object in the coronation regalia.Using his fingers, the archbishop will then have anointed the King on his hands, breast, and head.The King and Queen left Westminster Abbey in the Gold State Coach shortly after 1pm for a procession back to Buckingham Palace.The newly-crowned pair then travelled back to the Palace between 1pm and 1.30pm, before a scheduled flypast at 2.15pm.There is a 70 per cent chance of showers at the same time the flypast to celebrate the King's coronation is due to take place, forecasters say.Royal fans who will be in London to celebrate the occasion are advised to bring umbrellas, cagoules and waterproof jackets with dreary weather expected.Linda Old came to look at Buckingham Palace after watching the coronation in Hyde Park.'We all stood up for 'God Save the King'. It's special, there's a lot of memories.'Royal Air Force (RAF) Air Chief Marshal Sir Michael Wigston has said 'it's 50/50' as to whether a flypast scheduled to fly over The Mall and Buckingham Palace after 2.15pm will take place if there is rain and low cloud.It will consist of more than 60 aircraft from the Royal Navy, British Army and Royal Air Force - including the Red Arrows, but a final decision will be made just one or two hours before it is due to start.After the service at Westminster Abbey ends, Charles and Camilla are expected to enter Buckingham Palace through the centre arch at 1.33pm.They will receive a salute from the military in the palace gardens at 1.45pm, and then at about 2.15pm they will be joined by members of the royal family on the palace balcony to watch the flypast.However, the RAF previously said low cloud and rain could mean it is cancelled.Sir Michael had said: 'The weather isn't looking brilliant, but there's nothing we can do about it. We have to be safe, we have to make sure that we aren't taking any unnecessary risks.'We'll make a weather call one or two hours before the actual moment, but if there's rain and low cloud then it will be almost impossible to get it through.'It's 50/50 at the moment, but we have lots of options, the decision will be made, at this stage we're hoping for the best.'A Ministry of Defence (MoD) spokesperson also said: 'The latest weather information will be obtained from both the Met Office and from our helicopters performing weather checks in advance of the main flypast on Saturday.'If suitable, the flypast will continue as planned. If not, then there are options available to reduce the numbers of aircraft, with cancellation being the last resort.'Elsewhere across the UK, there will be a 'north-south' split, with mostly grey and damp conditions across the Midlands, Wales and southern England, while northern England will be mostly dry until later in the day.Northern Ireland and Scotland are set to see a mixture of sunshine and heavy showers, with temperatures in parts of the Highlands up to 19C.Met Office Chief Meteorologist Matthew Lehnert said: 'An area of rain is expected to move into southwest England early on Saturday, moving northeast through the day with some heavy bursts at times. 'This is likely to bring some rain to London from mid-morning. Further north in Scotland, northern England and Northern Ireland it will be a day of sunshine and showers before the more persistent rain moves northwards overnight. 'Under the cloud and rain, temperatures will be subdued with 16 °C in London, whilst 20 °C is likely in sunnier northwest Scotland.' ",
        "According to Met Office analysis of coronations since Edward VII in 1902, the current warmest on record was that of George V on June 22, 1911, when temperatures reached 17C (63F).On the late Queen Elizabeth II's coronation, on June 2, 1953, the maximum temperature was just 11.8C (53.2F).Coronations during the 20th Century were also generally dull, with no sunshine recorded on George V or George VI's coronations and only 1.2 hours when Queen Elizabeth was crowned.The UK's warmest day of the year so far was April 17, when 21.2C (70.2F) was recorded at Kinlochewe in northern Scotland.However Thursday's weather ran close to this, with a UK high of 20.9C (69.6F) recorded at Charlwood in Surrey."
    ]
}