{
    "articleURL": "/tvshowbiz/article-12043075/Florence-Pugh-dominates-Dune-Two-official-trailer-Princess-Irulan.html",
    "content": [
        "A blood-pumping new trailer for Dune: Part Two dropped Wednesday - dominated by Florence Pugh as a new arrival to the cast.",
        "Florence stars as Princess Irulan, a character from the original 1965 novel by Frank Herbert, which has been adapted into a sprawling two-part film epic.Now in the second movie, she is finally making her appearance amid a glittering returning cast led by Timothée Chalamet as the dashing Prince Paul.Prince Paul is sure to set fans aflutter in the new trailer, which sees him share a kiss with Zendaya's character Chani - a tribal fighter who in Part One is a siren from his dreams but who is now his comrade in an armed struggle of resistance.Paul has united with Chani's desert tribe in their mutual battle against the imperial forces who have oppressed her people and killed his father Duke Leto (Oscar Isaac).",
        "The trailer sees Paul hellbent on retribution for the duke's death, despite his mother (Rebecca Ferguson) admonishing him: 'Your father didn't believe in revenge.'Florence's Princess Irulan meanwhile appears to imagine that Paul's entire family was wiped out, referring to 'the end of House Atreides.'As the trailer progresses the princess experiences a dawn of realization, wondering incredulously: 'What if Paul Atreides were still alive?'Paul meanwhile is far from his wealthy, verdant planet of Caladan and is training with Chani's tribe in their hostile desert climate of Arrakis.",
        "Despite its forbidding appearance and the threat posed by the colossal worms that wreak havoc through the landscape, Arrakis turns out to be a goldmine.The planet is lusted after for its massive quantities of 'spice,' a substance that does double duty as fuel for interstellar travel and a hallucinogen.Paul, now on Arrakis, has joined forces with Chani's people, the Fremen, led by a warrior called Stilgar (Javier Bardem), to rebel against the empire that rules them all.As they prepare for their revolt, the romance between Paul and Chani blossoms, and he tells her about bodies of water that she on her desert world has never seen.",
        "'It's breathtaking,' Paul says to Chani as they sit on a dune together. 'When you see sand here, imagine water. When you dive in, you cant reach the bottom.''You DIVE in?' says Chani doubtfully, and when Paul assures her that the activity he has described is called 'swimming,' she laughs: 'I don't believe you.' Against the backdrop of his love affair, Paul is also being trained by Stilgar in the skills necessary to become a warrior in Arrakis' brutal environment. In one heart-stopping sequence, Paul has to learn how to ride one of the gigantic worms that periodically rise to the surface and destroy their surroundings.",
        "'Don't try to impress anyone,' Stilgar instructs Paul, assuring him: 'You are brave, we all know that - be simple, be direct, nothing fancy.'Paul is then seen sprinting across the dunes as a worm begins to surface beneath him, the ground shaking and clouds of sand billowing.Ultimately Paul finds himself swept up by a full-blown sandstorm that whisks him off the ground and threatens to fling him to his death.But with Stilgar's advice and the pair of harpoons in his hands, he manages miraculously to attach himself to the back of the leviathan.",
        "A joyful smile breaks out on Chani's face when she sees Paul, alive, riding the worm, and her countrymen erupt into cheers.However his most serious physical foe, it appears, will not be his habitat but another man - Feyd-Rautha, Austin Butler's character.A stone-cold warrior with a fully shaved head and gleaming, predatory eyes, Feyd-Rautha is a scion of the Harkonnens, an enemy family to the Atreides. Feyd-Rautha is known for his fearsome skill in duels, shown in the trailer when he fights in an arena resembling the Colosseum.Paul himself is seen near the end of the sneak peek, preparing to face off in what promises to be a hair-raising one-on-one battle with Feyd-Rautha.",
        "Raising his blade before his face in a pre-fight salute, Paul whispers a saying he learned from the Fremen: 'May thy knife chip and shatter.'A new character played by French screen siren Léa Seydoux also puts in an appearance, draped in a plunging black frock with a beguiling hood.  At the very end of the trailer, Paul is seen standing at a precipice, raising his sword and rallying the massive army gathered below into a cacophony of applause.",
        "Dune: Part Two, like its prequel, is directed by the acclaimed Denis Villeneuve whose films include Sicario, Arrival and Blade Runner 2049. The movie is slated for release on November 3 this year, having filmed last year between July and December in Abu Dhabi, Budapest and Italy.A glittering set of actors from the first movie have returned from the second, including Josh Brolin, Dave Bautista and Stellan Skarsgård.Frank Herbert's original novel has become a sci-fi classic and was previously adapted in the 1980s by David Lynch, whose widely derided movie featured such stars as Kyle MacLachlan, Patrick Stewart, José Ferrer, Brad Dourif and Sting."
    ]
}