{
    "articleURL": "/wires/ap/article-12039747/Zhang-1st-Chinese-man-reach-Masters-1000-quarterfinals.html",
    "content": [
        "MADRID (AP) - Zhang Zhizhen needed to save three match points in his win over Taylor Fritz at the Madrid Open to become the first Chinese player to reach an ATP Masters 1000 quarterfinal on Tuesday.",
        "Zhang rallied from a set down against the eighth-seeded American to advance 3-6, 7-6 (5), 7-6 (8), winning in a final-set tiebreaker for the third straight time at the clay-court tournament in the Spanish capital. It was the first win against a top-10 opponent for the 26-year-old Zhang.\"Before the match, you know it´s a very tough player. There is no weakness, so (I) just tried what I can do,\" Zhang said. \"Then (after) losing the first set, (I was) thinking about trying to play a little bit closer match. In the end (that) I can win, that´s amazing.\"The 99th-ranked Zhang had upset No. 13 Cameron Norrie in the third round in Madrid for his biggest career win. Zhang had beaten 21st-seeded Denis Shapovalov in the second round. He has played seven tiebreakers in total in Madrid, winning six of them.In 2021, Zhang became the first man representing China to earn a spot in the main draw at Wimbledon in the Open era, which began in 1968 when professionals were admitted to Grand Slam tennis tournaments.China´s greatest success in the sport came via Li Na, who won women´s singles titles at the 2011 French Open and 2014 Australian Open. She was inducted to the International Tennis Hall of Fame in 2019.",
        "In February, Wu Yibing became the first Chinese player to win an ATP Tour title, beating John Isner in the final of the Dallas Open. Wu was the first man from China in a tour final. Last year at the U.S. Open, Wu became the first Chinese man to win a Grand Slam singles match in 63 years.Zhang will next face former No. 14 Aslan Karatsev, who upset second-seeded Daniil Medvedev in straight sets on Tuesday.\"I´ll tell you a secret,\" Zhang said. \"We had a practice, I lost 6-0 with Karatsev. I´ll do my best. Here everyone is a great player, huge player. They all have some very good results. (I will) try to do the best what I can do.\"Zhang is projected to enter the top 50 with a win against Karatsev, which would make him the highest-ranked Chinese man in history ahead of Wu, who earlier this year was at No. 55.___Tales Azzoni on Twitter: http://twitter.com/tazzoni___AP tennis: https://apnews.com/hub/tennis and https://twitter.com/AP_Sports"
    ]
}