{
    "articleURL": "/wires/ap/article-12055745/Harper-hits-HR-Phillies-lose-6th-straight.html",
    "content": [
        "PHILADELPHIA (AP) - Bryce Harper´s first homer of the season wasn´t enough to prevent the Boston Red Sox from winning their eighth straight game, 7-4 against the slumping Philadelphia Phillies on Saturday night.",
        "The 30-year-old Harper, batting as the designated hitter, was playing in his fourth game since returning from Tommy John surgery on his right elbow last Nov. 23. The two-time NL MVP drove a full-count 89 mph sinker from right-hander Corey Kluber (2-4) to the opposite field and over the wall in left-center with nobody on and one out in the fifth inning, cutting Philadelphia´s deficit to 5-3. It was his 286th homer and 102nd with the Phillies.The Phillies, though, were in no mood to celebrate the long ball after their sixth straight loss. In a somber home clubhouse, Harper, usually readily available to media, did not address reporters postgame. Asked about Harper's homer, Phillies catcher J.T. Realmuto curtly said, \"It was good.\"Right now, Philly's not having fun.For Boston, however, the locker-room music was blaring nearly as loud as the sound of the crack of Red Sox bats of late.Rafael Devers had three hits and two RBIs to lead the Red Sox to their longest winning streak since July 2021.",
        "\"Credit to the guys,\" Red Sox manager Alex Cora said. \"They work hard on their craft, they work hard on their game plan and they're executing.\"The Red Sox entered leading the majors in hits and doubles. Boston finished with 10 hits, upping their total to 331, and four doubles, giving them 79.",
        "Rob Refsnyder and Christian Arroyo each had two hits, a double and two RBIs. Boston has scored at least five runs in every game during the winning streak. They have 10 or more hits in 17 games this season.Trea Turner also went deep for Philadelphia.Kluber allowed three runs in five innings.\"He was really good,\" Cora said.Kenley Jansen tossed a scoreless ninth for his eighth save, getting Harper to ground out to end the game.Boston broke the game open with five runs and six hits in the fourth inning against Bailey Falter (0-6). Falter had been perfect through three innings before the Red Sox sent 10 batters to the plate in the fourth.\"All I know is I have a lot to do here,\" Falter said.Devers hit a two-run double, Arroyo connected on a two-run single and Reese McGuire also had an RBI single. Falter was lifted with two outs after McGuire´s hit. Devers, who began play tied for the MLB lead in RBIs increased his season total to 34.\"We just started putting the ball in play,\" Cora said.The sellout crowd of 43,832 cheered loudly as Harper rounded the bases, much the same as they did last postseason when he helped the Phillies reach the World Series. Harper was selected NL Championship Series MVP, and his go-ahead home run in the pennant-clinching victory over the San Diego immediately went down as one of the top moments in Philadelphia sports history.",
        "Harper also had a hard-hit single to right field in the third inning and now has six hits in 16 at-bats since his return.PHILLY'S STRUGGLESThe loss marked the longest losing streak for Philadelphia under manager Rob Thomson. A longtime bench coach with the Yankees and Phillies, Thomson took over last June when Joe Girardi was fired. He led the Phillies to an immediate turnaround, culminating with the club´s eighth pennant before losing to the Houston Astros in the World Series. Phillies president Dave Dombroski lifted the interim tag from Thomson during the postseason.Philadelphia had high hopes again this season, especially after signing shortstop Turner in the offseason and adding RHP Taijuan Walker to their rotation. The club played .500 baseball without Harper, and they now have fallen to four games under .500 after dropping all four contests in the slugger´s return.HELLO, HARPERRed Sox outfielder Masataka Yoshida met with his baseball idol Harper prior to Saturday´s game. Harper gave the Japanese native two bats, including a signed bat that he used in the NLCS last season. He also gifted Yoshida a pair of his cleats. Yoshida´s Instagram handle (BH_Masataka34) begins with Harper´s first and last initial and his former uniform number 34. Yoshida, riding a 15-game hitting streak, received a scheduled day off on Saturday.",
        "NEARING 400Jansen is one save away from career No. 400. Cora said it would be up to Jansen whether to go for it in Sunday´s finale, which would be the third straight contest in which he's pitched, if there's a save opportunity.TRAINER´S ROOMRed Sox: LHP James Paxton (right hamstring strain) allowed two runs and two hits with four strikeouts and five walks in five innings during a rehab outing with Triple-A Worcester on Friday. Fifty-six of his 96 pitches were strikes. Paxton is expected to join the Red Sox on their current road trip.Phillies: RHP Andrew Bellatti (right triceps tendinitis) tossed a scoreless inning, striking out two, during a rehab outing with Single-A Clearwater on Friday. Bellatti´s next step is expected to be continuing his rehab in Triple-A.UP NEXTRed Sox RHP Tanner Houck (3-1, 5.34) faces Walker (2-2, 6.91) in the series finale on Sunday afternoon.___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}