{
    "articleURL": "/wires/reuters/article-12038249/Mexican-factories-string-three-straight-months-growth.html",
    "content": [
        "MEXICO CITY, May 2 (Reuters) - Mexico's manufacturing sector grew for a third consecutive month in April, due to sustained increases in new business that supported a renewed expansion in production and another round of job creation, a survey showed on Tuesday.",
        "The S&amp;amp;P Global Mexico Manufacturing Purchasing Managers' Index was a seasonally-adjusted 51.1 in April, up from 51.0 in March, and above the 50 threshold that separates growth from contraction.\"Mexico's manufacturing industry performed relatively well in April, as receding cost pressures facilitated output charge stability and fuelled sales,\". said Pollyanna De Lima, Economics Associate Director at S&amp;amp;P Global Market Intelligence.De Lima added that although it was only slight, the third successive increase in new orders underpinned the first expansion in production in the year-to-date.Key to the latest expansion was a further improvement in underlying demand for Mexican goods.The string of expansions is good news for Mexico's manufacturing sector, which shrank for over 2-1/2 years from March 2020 due to the economic fallout of the COVID-19 pandemic. The index hit a record low of 35.0 in April 2020 at the height of the country's pandemic-related lockdowns.\"Input cost inflation faded further in April, slipping to its lowest rate in 19 months, with firms suggesting that lower prices for oil, metals and some raw materials restricted the overall increase,\" said De Lima.Mexican inflation has been slowing and reached its lowest level in a year and a half through mid-April, with the annual headline inflation figure hitting 6.24%, further declining from the 17-month low of 6.85% hit across March.",
        "\"This retreat, coupled with sales-boosting efforts, resulted in another month of broadly stable producer charges and supported input buying growth,\" said De Lima."
    ]
}