{
    "articleURL": "/news/article-12045803/Sydney-Cabarita-9-Collingwood-Avenue-house-Parramatta-River-set-fetch-8-million.html",
    "content": [
        "Two-bedroom house set to cost $8million Western Sydney house has river views It was last bought for $17,000 in 1969 A modest two-bedroom house in Sydney's west is set to fetch over $8million when it goes under the hammer later this month - maintaining the city's reputation as having among the most over-priced real estate in the world. ",
        "The 850sqm of land and the small house on it last sold in 1969 for just $17,000 (which adjusted for inflation equates to $139,815 today) to the Walker family, who have lived at 9 Collingwood Avenue in the suburb of Cabarita ever since.Bidders at the May 20 auction will have to be ready fork out because of the property's waterside location, sitting on the Parramatta River's Frances Bay. 'Realise your waterfront dreams with this first class parcel of land showcasing a sunlit Easterly aspect and direct water frontage to France Bay,' the property's listing by real estate agent Horwood Nolan reads.The listing goes on to claim the property 'offers the perfect blank canvas for luxury duplex development or to create the luxurious waterfront haven you have always dreamed of enjoying with family and friends'.",
        "It comes with a concrete boat ramp and a small private beach with 18 metres of frontage to the water. Horwood Nolan boasts that the 'prized waterfront playground' in the 'centre of Sydney' is 'located in one of Cabarita's most prestigious neighbourhoods'.The listing promises that there are 'elite private schools, cafes, restaurants and direct transport to the CBD at your doorstep'.Australian property prices are climbing again for the first time in a year despite 11 monthly interest rate rises over the past year.",
        "National house and unit prices together in March rose by 0.6 per cent to an average $704,723, CoreLogic data showed.This was the first increase since April 2022, back when the Reserve Bank of Australia cash rate was still at a record-low of 0.1 per cent.Australia's biggest cities Sydney and Melbourne had the biggest increases despite being the most sensitive to the RBA's 11 consecutive monthly increases that have taken the cash rate to an 11-year high of 3.85 per cent.",
        "CoreLogic research director Tim Lawless said Australia's influx of migrants - with at least 650,000 expected over the next two financial years - would keep pushing up prices as demand outstripped supply.'With rental markets this tight, it’s likely we are seeing some spillover from renting into purchasing, although, with mortgage rates so high, not everyone who wants to buy will be able to qualify for a loan,' he said.'Similarly, with net overseas migration at record levels and rising, there is a chance more permanent or long-term migrants who can afford to, will skip the rental phase and fast track a home purchase simply because they can’t find rental accommodation.'"
    ]
}