{
    "articleURL": "/tvshowbiz/article-12053065/Love-Islands-Mollie-Salmon-shows-bruised-face-fox-eye-surgery.html",
    "content": [
        "Love Island's Mollie Salmon revealed her bruised and swollen eye on Instagram on Friday after undergoing controversial 'fox eye' surgery.",
        "The reality personality, 24, who appeared on the summer series of the show last year, took to her Instagram Stories to give her followers an update, admitting she was 'struggling to see'.She wrote: 'My surgery went well and @monocosmeticsurgery have done a wonderful job looking after me with the help of my best friend @holliebayles I truly couldn't have done this without her.'I am very swollen and am struggling to currently see out of my eyes as that's where the surgery was so I just wanted to let you all know I'm not ignoring anyone, however thank you all for the lovely messages. I'll give you all recovering update pictures soon.'She added: 'I promised I'd take you all along this journey with my, this is my current healing process, my bruising and swelling will go down after a few days. The procedure I had was fox eyes.' ",
        "The £500 treatment uses dissolvable stitches to create almond shaped eyes with a lifted brow tail, and is aimed to giving women a lifted brow and upper eye lid lift without the downtime of surgery as it takes just half an hour - and should heal completely in less than two weeks.Called the fox-eye threadlift, clinics advertise the procedure on social media sites with videos of patients before and after, with the corner of their eyes swept up and back in dramatic fashion.",
        "The looks of American A-list models Bella Hadid and Kim Kardashian's sister Kendall Jenner are often cited as an inspiration, and in the UK, models Katie Price and Danielle Lloyd have admitted having the treatment.  Danielle had secret eye lift surgery in 2021 after being inspired by the Kardashians, but admitted her husband was furious after she told him.The former glamour model, 39, opted to have a fox-eye lift and also went under the knife for a thread-lift on her jawline in order to remove loose facial skin and give her face a more defined shape.  Speaking to Closer at the time, Danielle admitted she was keen to make the changes after being told various members of the Kardashian family had undertaken the same procedures.She explained: 'Seeing all these gorgeous young girls on Instagram also made me feel insecure and worry about my age - I turn 38 later this year, and the prospect of being 40 worries me.'I want to look my best, and this procedure prevents things like jowls and lines, so I thought, \"Prevention is better than cure!\" I know I'm a little bit obsessed but it makes me feel better.'",
        "However, last year, ex-Big Brother housemate Ryan Ruckledge warned against fox eye facelifts after claiming he was left in hospital with a serious infection following a freebie treatment.",
        "Ryan, 31, from Blackpool, told Holly Willoughby and Philip Schofield on This Morning how he was gifted the 20-minute procedure, which is a minimally invasive, non-surgical procedure lifts the brows and outer corners of your eyes.The influencer, who also previously appeared on The X Factor, said he woke up feeling like he had been hit by a bus afterwards, and two weeks later, his face was so infected it began to swell and leak with pus.He ended up in hospital, with medics at one stage worried the infection, which lasted six months, could have been sepsis.",
        "Ryan explained that after the surgery, he woke up at '6am in the morning', saying: 'When I woke up, I was like, \"Oh my god have I been hit by a bus?\" It was horrific.'Appearing on the programme, Ryan said he was offered the £500 fox eye facelift via a message for free in exchange for promoting the company on his Instagram and did not do any research beforehand.Describing the procedure, he said it wasn't 'too painful' because the area had been numbed beforehand.However he confessed: 'It was quite vigorous. She put a thread in my eyebrow but I also had cheek threads done as well. I wanted a more lifted look.'",
        "How it worksThe fox-eye threadlift procedure, which costs between £350 and £500, involves injections of local anaesthetic around the temples before a cannula – a thin, blunt-ended hollow tube – is pushed beneath the skin.A thread is inserted into the cannula and teased upwards using a needle and careful hand movements. On the bottom of the thread are tiny, corrugated discs which attach to the tissue in the face and allow the skin to be dragged upwards and secured in place.A finger is then placed on the very tip of the thread to ensure it stays tight while the cannula is withdrawn.As the procedure involves a single needle puncture, which heals on its own, it is not technically considered surgery.Down timeThe suture will dissolve overtime with minimal side effects. The skin folds and needle mark will fully heal over 3-10days leaving behind a natural lift.CostThe cost on average is £500-£750.How long does it last?Results last up to a year.How does it differ from surgery?There are no permanent changes to your face and you won't have part of your eyelid cut away as with a blepharoplasty. You can also adapt the changes after the treatment if you'd like a less dramatic look."
    ]
}