{
    "articleURL": "/femail/article-12054115/Prince-Louiss-boastful-words-sister-Princess-Charlotte.html",
    "content": [
        "The royal was inside the car with his mother, Kate, and older sister CharlotteCORONATION LIVE BLOG: Click here to follow live updates throughout the dayA lip reader has revealed the words that Prince Louis said to his sister, Princess Charlotte, during the Coronation this morning. ",
        "Prince Louis, five, was sat in a car with his eight-year-old sister, Charlotte, while travelling to Westminster Abbey when the two exchanged a few words. Lip reading expert Jacqui Press told FEMAIL the little royal told his sister: 'Yes,' before saying, 'Look waving.'According to the professional,  the young prince also said, 'Yes of course'  while smiling, as he waved from the window of the car to onlookers. Prince Louis always manages to steal the show at royal engagements, from sticking his tongue out at his mother or dramatically covering his ears on the Buckingham Palace balcony - and he didn't let his fans down today. ",
        "Prince Louis was given a break from the event to relax behind the scenes. He was reunited with his family at 1pm to leave Westminster Abbey.The cheeky royal, known for his hilarious funny faces at royal events, also took part in the Coronation procession. The event is truly special as it is the first Coronation in 70 years - where millions around the world saw Britain hail its new King and Queen.The Prince and the Princess of Wales's youngest son Louis - who turned five on St George's Day on April 23 - melted hearts again today at Westminster Abbey for the King's Coronation.",
        "The fourth in line to the throne, who looked regal in a bespoke outfit by a Savile Row tailor, appeared disinterested as he yawned throughout the ceremony.The cheeky prince looked around the Abbey and pointed at items as he sat next to his older sister Princess Charlotte during the opening moments of the historic service. When his sister tried to hold up the order of service for him to have a look at, he looked the other way and was seen yawning as he entered the Abbey while holding hands with Charlotte. ",
        "During the national broadcast, Louis was seen kicking his feet around, forcing his mother, Kate, to whisper to him.The adorable prince later grumpily slumped back in his seat proving that the long service was possibly too much for a five-year-old. The prince was not initially supposed to attend the Coronation, however it appears that at the last minute the family decided to include him in the service.It is thought that Prince Louis won't attend tomorrow's concert in Windsor.  ",
        "Previously, Prince Louis stole the show at the Trooping the Colour celebrations in June last year, where he pulled a series of hilarious faces - including covering his ears in front of the Queen when the sound of the roaring plane engines became too much during the fly past.",
        "Today, the siblings arrived without their older brother Prince George, nine, who is a Page of Honour for his grandfather and following in the procession behind the King. Princess Charlotte wore an Alexander McQueen dress and cape in ivory silk crepe with ivory stitch embroidery featuring rose, thistle, daffodil and shamrock motifs, to signify the four nations.   Charlotte also wore a Jess Collett x Alexander McQueen Headpiece silver bullion, crystal and silver thread work, similar to the headpiece the Princess of Wales is wearing."
    ]
}