{
    "articleURL": "/tvshowbiz/article-12058999/Ray-Liottas-cause-death-revealed-acute-heart-failure.html",
    "content": [
        "The Goodfellas star passed away on 26 May last year aged 67 from acute heart failure and fluid in the lungs - known medically as a pulmonary edema At the time, it was announced that he had died in his sleep at a hotel in the Dominican Republic, where he had been filming a new movie An emergency service team had rushed to the building but he could not be saved, with his body transferred to the forensic institute of Santo DomingoAt the time, his former co-star Robert De Niro led tributes to the star Ray was survived by his fiancée Jacy Nittolo, then-46, as well as his daughter Karsen, then-23, who he had with ex-wife Michelle Grace Ray Liotta's cause of death has been revealed, one year on from his death. ",
        "The Goodfellas star passed away on 26 May aged 67 from acute heart failure and fluid in the lungs - known medically as a pulmonary edema - while also suffering with atherosclerosis, which is a narrowing of the arteries.In documents obtained by TMZ, doctors categorised the manner of death as natural and nonviolent respiratory insufficiency, pulmonary edema and acute heart failure. At the time, it was announced that he had died in his sleep at Casas del XVI in Zona Colonial hotel in the Dominican Republic, where he had been filming a new movie. He passed away weeks after filming started on Dangerous Waters.An emergency service team had rushed to the building but he could not be saved, with his body transferred to the forensic institute of Santo Domingo.",
        "The esteemed actor is survived by his fiancée Jacy Nittolo, then-46, as well as his daughter Karsen, then-23, who he had with ex-wife Michelle Grace.The actor had been spotted out and about in LA in March 2022 where onlookers said he appeared 'noticeably pale' and 'needed help from the valet putting on his jacket'.The source added he was 'slow and steady on his feet' and Nittolo had to help him by carrying his bags from the car to the hotel.",
        "But he looked healthier in pictures taken at the start of May as he strolled through Pacific Palisades in Los Angeles with his fiancée.",
        "Pulmonary edema is a condition caused by excess fluid in the lungs, which leads to shortness of breathIt is caused by certain medication, kidney failure, congestive heart failure, lung damage and high altitude exposureTreatment can include surgery, heart medication, aspiration and diuretics",
        "Liotta had been a smoker but started appearing in adverts for Chantix - a brand run by vaccine guru's Pfizer - in 2018, with one saying: 'I tried to quit smoking for years on my own. I couldn't do it. I needed help.'His sudden death shocked fans as he was embarking on a huge resurgence in his career recent years, with him staring alongside Taron Egerton in Black Bird in 2022.He also featured in The Many Saints of Newark, Marriage Story and No Sudden Move in more recent years as his acting took off again.But he was best known for his incredible performance in Martin Scorsese's 1990 gangster classic Goodfellas, where he played Henry Hill while Robert De Niro, 78, took on the role of Jimmy Conway.Ray's co-stars and friends rushed to pay tribute, including Robert who wrote: 'I was very saddened to learn of Ray's passing. He is way too way young to have left us'On-screen wife in Goodfellas Lorraine Bracco added: 'I'm utterly shattered to hear this terrible news about Ray', while Josh Brolin penned: 'My buddy. My friend. How so soon? Why? I'll miss you. I will think about seeing you at Gold's'.",
        "Prior to his death, the actor most recently spoke on Instagram, where he plugged his new movie Cocaine Bear which was released last year.",
        "He wrote: 'Cocaine Bear follows an oddball group of cops, criminals, tourists and teens converging in a Georgia forest where a 500-pound apex predator has ingested a staggering amount of the white powder and goes on a coke-fueled rampage seeking more blow — and blood.'Liotta had been a smoker up until around 2018 where he started appearing in Pfizer's Chantix adverts, which he said helped him pack in the cigarrettes.In one he says: 'In the movies, a lot of times I tend to play the tough guy. But I wasn't tough enough to quit on my own – not until I tried Chantix.'A spokesman for the firm previously said the actor had 'wanted to share his story to help others' so joined its cast for the commercials.",
        "Liotta was born in New Jersey in 1954 but was abandoned by his mother at an orphanage before being adopted six months later.He went to live with a town clerk and auto-parts shop owner, who insisted he never contemplated acting while growing up in Newark.After graduating he moved to New York City and worked as a barman until he was cast in soap opera Another World in 1980.",
        "Liotta found fame playing ex-con Ray Sinclair in 1986 black comedy Something Wild, for which he received a Golden Globe nomination.He went on to star as Shoeless Joe Jackson in the 1989 film Field Of Dreams and is best known for his portrayal of Henry Hill in Goodfellas opposite Robert De Niro and Joe Pesci and directed by Martin Scorsese."
    ]
}