{
    "articleURL": "/wires/ap/article-12057913/White-House-national-security-adviser-meets-Saudi-prince.html",
    "content": [
        "DUBAI, United Arab Emirates (AP) - U.S. President Joe Biden's top national security aide met Sunday night with Saudi Arabia's crown prince amid long-standing tensions between the White House and the kingdom.",
        "The state-run Saudi Press Agency said the meeting between Jake Sullivan and Crown Prince Mohammed bin Salman took place in Jeddah, the Red Sea port city now at the heart of seaborne evacuations from the fighting in Sudan.The state news report said only that the men reviewed \"strategic relations\" in a meeting that included other American officials.Later, Sullivan took part in a meeting with the crown prince and Indian national security adviser Ajit Doval and Sheikh Tahnoon bin Zayed Al Nahyan, the national security adviser of the neighboring United Arab Emirates.A White House statement acknowledged the meetings, saying they aimed to \"to advance their shared vision of a more secure and prosperous Middle East region interconnected with India and the world.\" It did not elaborate.Saudi state media did not immediately publish either video or photographs of the meetings.Biden campaigned on a promise to make Saudi Arabia a \"pariah\" after the 2018 slaying of Washington Post columnist Jamal Khashoggi at the Saudi consulate in Istanbul. U.S. intelligence agencies believe the killing came at the crown prince's orders, though Riyadh denies it. However, Biden did make a trip to the kingdom last July as the U.S. sought the kingdom's assistance on keeping energy prices under control as Russia's war on Ukraine rages on.",
        "In the time since, Biden vowed there would be \"consequences\" over oil production cuts by OPEC+, a group that includes Russia. The benchmark Brent crude now sits at $75 a barrel as global markets remain concerned about nations making interest rate hikes to combat inflation and U.S. banks face turmoil.For its part, Saudi Arabia has sought a detente with Iran after years of tensions, even as U.S. sanctions remain imposed on Tehran as its nuclear program rapidly advances. That could help see an end to a Saudi-led military campaign in Yemen's war. The kingdom also has played a role in bringing Syria back into the Arab League as the U.S. and others remain opposed to President Bashar Assad's rule amid that country's long war.___Jon Gambrell on Twitter: www.twitter.com/jongambrellAP."
    ]
}