{
    "articleURL": "/wires/aap/article-12052061/Voss-understands-frustrated-Carlton-fans-booing.html",
    "content": [
        "Carlton coach Michael Voss says he understands the frustration of his club's long-suffering supporter base after Blues fans exited Marvel Stadium early against the Brisbane Lions.",
        "As the siren sounded for three-quarter time, a chorus of boos echoed around the roofed arena as Carlton trailed by 40 points in a Friday night blockbuster following a goal-less term.A strong section of the 45,848 fans - a record home-and-away crowd for a Blues-Lions match - were not there for a belated Blues fightback in the last quarter.Carlton rallied to kick 5.3 to 3.1 in the last quarter, but the Lions still recorded a resounding 26-point victory, inflicting a third defeat in four games on the Blues.Voss said the club welcomed the pressure of having almost 90,000 members to perform for.\"When you've got that wave of support, you want them to bring the noise,\" he said.\"With that, there's good, and with that there's also some things that you're going to have to go through as well.\"But what they should know is that they've got a group here that have a really strong desire to want to get better.\"We got some feedback that says that we need to go to work on a few things, so we understand the frustration and and we'll get after it - that's our promise.\"Voss said it was not up to him to \"determine what they can and can't do\".",
        "\"All I know is that I'd rather have our fanbase,\" he said.\"I'd rather have them there being able to create some noise for us.\"We're in a really privileged position in that we've got a very large supporter base so we will embrace that more than anything.\"After falling short of the top-eight in heartbreaking fashion last year, the pressure is on the Blues to play finals for the first time since 2013.This match was the first of a difficult run for Carlton, with the Western Bulldogs, Collingwood, Sydney and Melbourne to follow in the next month.The Blues were undefeated after the first month of the season but have slipped to 4-1-3 to be on the verge of being outside the top-eight.Carlton's premiership drought stretches back 28 years and their last grand final appearance came in 1999."
    ]
}