{
    "articleURL": "/wires/pa/article-12055019/Expat-remembers-1953-coronation-says-global-shows-love-ceremony.html",
    "content": [
        "A British expat who participated in preparations for the late Queen’s coronation in 1953 says worldwide interest in royal events shows that “human beings love ceremony”.",
        "Michael Vincent had been one of the “test groups” and had marched in a practice procession almost exactly 70 years ago – when he was 18 years old.Mr Vincent, now 88, watched replays of the King’s coronation on Saturday morning from Ye Olde King’s Head pub in Santa Monica, California, alongside fellow expats and US anglophiles.",
        "Recalling the build-up to the previous coronation, he told the PA news agency: “My aunt came down to see me march past.“I was playing the tenor drum because I couldn’t carry a tune so I had the easy job, just twirling the sticks.“You just did what you were told in those days. It was historic but we didn’t really think of it that way.”Asked his opinions on the coronation events going on back in the UK, he added: “Human beings love ceremony”.",
        "“Everywhere you go, whether you go to Cairo and look at the Pyramids, there is always ceremonies,” he told PA.“The weakness of human beings is that they’re always showing off, that’s why they go dancing on Saturday night.”A special schedule of royal-themed events is due to take place at Ye Olde King’s Head on Saturday to offer expats a slice of home, despite being more than 5,000 miles away.",
        "The pub often marks significant royal events and celebrations, having put on events for the Platinum Jubilee and funeral of Queen Elizabeth II.As well as ceremony replays on Saturday, a special coronation high-tea is on offer, followed by a “British bangers” DJ set and a Beatles tribute band.",
        "The gift shop is stocked with commemorative merchandise, which includes mugs, postcards, flags and tea towels, with Union flag bunting already proudly displayed, with a large cardboard cut-out of Charles in pride of place.Lara Ramdin, originally from St Albans, said it was “good for the world to see all the pomp and circumstance”.“It’s a momentous occasion and I didn’t necessarily want to get up at two o’clock in the morning and watch everything,” she told PA.“My friend is an anglophile and I knew that if I said I wanted to commemorate the coronation in some way by being in a British place surrounded by British people she would join me.”She added: “(And) why not celebrate with an English breakfast? Also you can get a decent cup of tea here and it wouldn’t seem right without that.”"
    ]
}