{
    "articleURL": "/sport/football/article-12058897/Mauricio-Pochettinos-wife-reveals-London-ahead-managers-expected-Chelsea-move.html",
    "content": [
        "Mauricio Pochettino's wife Karina has revealed she is in London on social mediaThe Argentine boss is the strong favourite to take over at Chelsea this summer But interim manager Frank Lampard is reportedly staying to the campaign's end Mauricio Pochettino's wife has disclosed she is in London on social media ahead of the Argentine's expected move to join Chelsea.",
        "Manager Pochettino, 51, a free agent since leaving Paris Saint-Germain in July 2022, is the heavy favourite to take over at Stamford Bridge.The Blues sacked Thomas Tuchel in September and his replacement Graham Potter in April, with Frank Lampard now in charge until the end of the season.According to the Athletic, the club's drawn-out manager search, which began on April 3 after Potter's sacking, is finally set to conclude this week.And before that expected announcement, Pochettino's partner Karina posted on her Instagram page showing a view of some greenery with the caption: 'London,' followed by a cloud emoji.",
        "The Athletic state the 'comprehensive search' carried out by sporting directors Paul Winstanley and Laurence Stewart will end in the coming days.It is added that under-pressure interim boss Frank Lampard will stay until the end of the season despite the decision on his long-term replacement being made soon.Club icon Lampard, who spent 18 months in charge from 2019-2021, lost his first six games as interim, a run which had some questioning whether he would even last for the rest of the campaign.But goals from Conor Gallagher, Benoit Badiashile and Joao Felix saw them beat Bournemouth 3-1 on Saturday and end a dire winless run of nine matches.",
        "And it now seems he will take charge of the Blues' last four league games before handing over to his successor.It is also said he will have an active role in collaborating with Stewart, Winstanley and the next manager.Pochettino won Ligue 1 in his one full campaign in Paris but failed in the Champions League, a competition where he had led Tottenham to the final in 2019 during a five-year spell in north London.Next up, Chelsea face struggling Nottingham Forest on Saturday as they aim to salvage a top-half position. "
    ]
}