{
    "articleURL": "/wires/afp/article-12061007/Suspected-Texas-shooter-kicked-US-Army.html",
    "content": [
        "The man suspected of murdering eight people at a Texas shopping mall was kicked out of the US Army in 2008 less than three months after joining, a spokeswoman said Monday.",
        "Mauricio Garcia, 33, was shot dead by police after opening fire with a semi-automatic rifle in the parking lot of Allen Premium Outlets north of Dallas on Saturday afternoon.\"Mauricio Garcia entered the regular Army in June 2008; he was terminated three months later without completing initial entry training,\" US Army spokeswoman Heather Hagan said in a statement, without specifying why he was removed.\"He was not awarded a military occupational specialty. He had no deployments or awards,\" Hagan added.US media and the independent Bellingcat research site reported that Garcia had a page on a Russian social media site that expressed neo-Nazi and misogynistic views, and revealed Garcia's concerns over his own mental health.The profile included photos of a shirtless torso bearing Nazi tattoos, though it was unclear if the person pictured was Garcia.US law enforcement officials declined to comment on the page, but one said media reports of Garcia's far-right leanings came out of a document leaked from the investigation, which is being handled by the Texas Department of Public Safety, along with the FBI.A GoFundMe page appeared to confirm that three of those killed in the shooting were Korean-American parents and their three-year-old son.\"After being released from the ICU, their six-year-old son William is the only surviving member of this horrific event,\" the page said.",
        "Others who lost their lives included two elementary school-aged sisters, a security guard and an engineer, according to US media.US President Joe Biden on Sunday renewed his call for lawmakers to pass a national assault weapons ban and other gun safety measures, saying fast action is needed to save lives.With more firearms than inhabitants, the United States has the highest rate of gun deaths of any developed country -- 49,000 in 2021, up from 45,000 the year before."
    ]
}