{
    "articleURL": "/wires/reuters/article-12041347/HK-stocks-snap-four-day-rally-Fed-rate-decision-focus.html",
    "content": [
        "By Georgina Lee",
        "Hong Kong, May 3 (Reuters) - Hong Kong stocks snapped a four-session rally on Wednesday, as investors remained concerned that a softening U.S. economy and troubles in the country's regional lenders could slow Asia's growth.** The Hang Seng Index ended 1.18% lower, while the Hang Seng China Enterprises Index fell 1.36%.** Asian stocks fell for a second straight session, as global investors contended with signs of a softening U.S. economy ahead of a widely expected Federal Reserve interest rate hike later in the day.** The International Monetary Fund (IMF) raised Asia's economic forecast on Tuesday as China's recovery underpinned growth, but warned of risks from global market volatility driven by Western banking sector woes.** Overnight, stocks of U.S. regional banks extended losses from Monday after the seizure and auction of First Republic Bank . Banking stocks in Hong Kong also fell.** U.S. job openings fell for a third straight month in March and layoffs increased to the highest level in more than two years, suggesting some softening in the labour market** On Wednesday the Federal Reserve is expected to raise its benchmark overnight interest rate by another 25 basis points to the 5.00%-5.25% range before potentially pausing their tightening cycle.** With China's A share market remaining closed investors have switched their focus on the U.S. market, analysts said.",
        "** HSBC's Hong Kong shares edged up 0.34% after declining earlier, supported by its strong first-quarter results, as it announced an up to $2 billion buyback plan on Tuesday.** Hang Seng Bank fell 1.18%, while Standard Chartered dipped 1.22%.** Hong Kong's interbank rates jumped, as traders braced for a U.S. interest rate hike.** The three-month Hong Kong Interbank Offer Rate (HIBOR) jumped 18.9 basis points to 3.89929%, its sharpest one-day leap in nearly two years.(Reporting by Hong Kong Newsroom; Editing by Sonia Cheema and Rashmi Aich)"
    ]
}