{
    "articleURL": "/sport/football/article-12046337/Graeme-Souness-slams-Manchester-United-star-Bruno-Fernandes-not-leader.html",
    "content": [
        "Fernandes was widely criticised for his sulky behaviour in 7-0 loss to LiverpoolGraeme Souness says 'you certainly wouldn't want him in the trenches with you' Erik ten Hag has entrusted Fernandes with captaincy for most of the season Graeme Souness believes Bruno Fernandes is 'obviously not a leader' as he slammed the Manchester United man's 'appalling' behaviour in their 7-0 defeat at Liverpool.",
        "The Portuguese midfielder, who has regularly captained United this season, didn't cover himself in glory with his petulant antics and sulky body language at Anfield in March.Fernandes would likely become United's club captain if Harry Maguire leaves the club this summer but Mail Sport columnist Souness has issued a warning to Erik ten Hag.'He is obviously not a leader, it's as plain as the nose on the end of your face,' he told William Hill's Up Front with Simon Jordan podcast.'His attitude when they went 3-0 down at Liverpool was appalling. You certainly would not want to be in the trenches with him, simple as.'",
        "Liverpool legend Souness can't understand why Ten Hag backed Fernandes after his histrionics at Anfield.'I think that is another example of modern management, the tail wags the dog in football today,' he added.'There is only one club in the country where that doesn't happen and that's Man City where the manager is all-powerful.'The manager is the boss in name only. He is thinking Fernandes is a good player, he will be a star when they're on top and on the front foot. He is creative and he is a real talent.'But showed a side to him that day at Anfield that was very unattractive.",
        "'Erik ten Hag has then chosen to overlook it because he knows going forward that Bruno will win him games and score him goals.'But in the manger's head, he will know the first time we come up against a really difficult situation again, is he doing to go missing?'And I think the manager already knows the answer to that.'",
        "Souness captained Liverpool from 1981 until 1984, leading them to three league championships, three League Cups and the European Cup.On the art of leadership, he added: 'When you become a captain of a football team it's about setting an example on the pitch and off it. To have a successful football club, you need good senior players and professionals.'I look at myself when I walked through the door in Liverpool, how I changed in the seven years I was there, and what I was like when I left.'I wasn't the best player when I walked through the door, but I learned from some very serious football players, and seven years later when I become a senior, I like to think that I passed that information on.'",
        "Fernandes, 28, has captained United in the majority of their matches this season after Ten Hag demoted Maguire to the bench.",
        "Despite his behaviour at Anfield, Fernandes has enjoyed a fine season, contributing 11 goals and 14 assists in 52 outings.Ten Hag's side will look to shore up their Champions League place for next season when they visit Brighton on Thursday night."
    ]
}