{
    "articleURL": "/wires/ap/article-12058009/Thailand-wins-International-Crown-LPGA-match-play-event.html",
    "content": [
        "SAN FRANCISCO (AP) - Ariya Jutanugarn helped launch Thailand as an emerging power in women's golf when she won the British Women's Open in 2016.",
        "The victory inspired younger golfers in Thailand and the results were evident during a dominating performance at the International Crown team match play event.Ariya Jutanugarn won the MVP after teaming with her sister Moriya Jutanugarn to win all five matches and 20-year-old Atthaya Thitikul capped a perfect weekend with a birdie on the 16th hole that clinched the championship for Thailand over Australia on Sunday.\"I would say when I´m growing up, when I´m turning pro, I always want to inspire the kids back home, and right now I feel even better because not only me right now,\" Ariya Jutanugarn said.It was a total team effort.Thitikul beat Stephanie Kyriacou 4 and 2 to improve to 5-0 on the week and earn the clinching point in the final. Patty Tavatanakit had already beaten Hannah Green 4 and 3 in the other singles match.",
        "The Jutanugarns won their match over Minjee Lee and Sarah Kemp 4 and 3 when Ariya Jutanugarn holed out a chip shot from the edge of the green on the 15th hole as sixth-seeded Thailand finished the week winning 11 of 12 matches.\"Us winning this event is huge for golf in Thailand,\" Tavatanakit said. \"It is already growing, and I think this is going to inspire a lot of people, even more than what we feel inspired 10 years ago. I´m really excited to see the future of Thai golf.\"",
        "The United States beat Sweden in the consolation match to finish third.The International Crown is a match-play tournament featuring teams of four players from eight countries split into two pools. The top two teams from each pool advanced to the semifinals, where the format was two singles matches and one alternate-shot match.The players on the winning team all received $125,000 in prize money with the runners up getting $75,900.It was a breakthrough weekend for Thailand, which had never finished better than fourth in the first three editions of this tournament.But the Thai team was dominant at Harding Park as the only country to win every match in pool play and then delivering a dominating championship match after surviving a tight semifinal against the United States earlier in the day.The top-seeded Americans split the two singles matches against Thailand with Lexi Thompson losing 3 and 2 to Thitikul and Lilia Vu fighting back from a two-hole deficit on the front nine to beat Tavatanakit 1 up.That put the fate of the semifinal on a tight alternate-shot match between world No. 1 Nelly Korda and Danielle Kang against the Jutanugarn sisters.Korda tied the match with an 8-foot birdie putt on the par-4 16th hole, generating chants of \"U-S-A!\" from the decent sized galleries.",
        "But the Jutanugarn sisters weren't flustered with Moriya Jutanugarn hitting her tee shot to within about 10 feet, setting up a birdie putt for Ariya Jutanugarn that put Thailand back ahead.Moriya Jutanugarn then got her second shot on the par-5 18th hole on the green, and Thailand two-putted for birdie to tie the hole and win the match.\"Obviously it´s a little disappointing not being in the final, but I think we played well,\" Korda said. \"We wish some more putts would have dropped, but overall I think our performance has been pretty good.\"Australia, which had never finished better than sixth in this event, swept Sweden in the first semifinal with Kyriacou beating Anna Nordqvist and Hannah Green besting Caroline Hedwall in singles, while Minjee Lee and Sarah Kemp beat Madelene Sagstrom and Maya Stark in the alternate shot match.But they fell short in the final.\"It´s obviously a little disappointing, but it´s still a big win for us,\" Kemp said.Thompson beat Sagstrom in singles in the consolation match and the U.S. won it when Kang and Korda beat Nordqvist and Hedwall 1 up.This is the fourth time this tournament has been held after being canceled in 2020 because of the COVID-19 pandemic. Spain won the inaugural tournament in 2014, followed by the United States in 2016 and South Korea in 2018.",
        "This is the first professional women´s event to be played at TPC Harding Park, which has hosted several big events for the men, including the 2009 Presidents Cup and the 2020 PGA Championship.\"It´s been a spectacular venue for us, and I think it shows the women´s game is moving in the right direction,\" Thompson said. \"We´re getting to play some spectacular golf courses like this one. We´re getting more and more fans each and every day, which we wanted to see, and the course is in great shape for us.\"___AP golf: https://apnews.com/hub/golf and https://twitter.com/AP_Sports"
    ]
}