{
    "articleURL": "/wires/reuters/article-12060973/Report-San-Diego-inching-closer-MLS-expansion-team.html",
    "content": [
        "San Diego expects to receive the long-awaited news that it will get an MLS expansion franchise by mid-May, The San Diego Union-Tribune reported.",
        "The community has heard rumblings of an MLS team coming to the city for almost 25 years, but it now appears poised to be granted a franchise.The Union-Tribune said the prospective ownership group, led by an unidentified Egyptian billionaire and the local Sycuan tribe, is expected to soon present its formal bid to the MLS board, with hopes of beginning play as early as 2025.The expansion fee for the franchise could hit $500 million, per the report. St. Louis City, the newest addition to the league, paid a $200,000 franchise fee, Forbes reported. Charlotte FC's ownership group paid a record $325 million, according to ESPN.Negotiations are underway between the group and San Diego State on a lease agreement for Snapdragon Stadium, which seats 35,000. While it was built for the school's football team, it was constructed to the specifications of international soccer.\"We've been having very good discussions,\" San Diego State athletic director John David Wicker told the newspaper, adding the stadium is scheduled to host a variety of international games. \"Based on the soccer we're having this summer, it shows that this venue is truly built for great soccer, and getting MLS is the last real piece of the puzzle.\"We're excited to get to the finish line.\"",
        "The Union-Tribune said representatives of the league, the university and the prospective ownership group are expected to meet in San Diego this week.\"We continue to push forward with confidence, and we are working together to make the deal a reality,\" said a joint statement from the prospective majority investors, Mohamed Mansour of the Mansour Group and Sycuan Tribal Chairman Cody Martinez, to the newspaper. \"While we are still in the due diligence process, we remain excited about the prospect of bringing Major League Soccer to San Diego, a city and community with such a rich cultural and sporting heritage.\"MLS has not commented about the prospects of putting a team -- its 30th -- in San Diego. Prospects also are high for a future MLS team in Las Vegas.The San Diego Wave, which joined the National Women's Soccer League in 2022, played occasional games at Snapdragon Stadium. On Sept. 17, the game between the Wave and Angel City FC set a league single-game attendance record at 32,000.--Field Level Media"
    ]
}