{
    "articleURL": "/news/article-12047397/Drink-drug-driver-killed-22-year-old-woman-ploughed-crowd-guilty-murder.html",
    "content": [
        " Stephen McHugh, 28, was driving after a night out drinking and killed a student Criminology student Rebecca Steer was killed in Shropshire on  October 9, 2022This is the chilling moment a drunk and drugged-up driver turned his car into a 'weapon' by mowing down a student as he drove at revellers outside a takeaway.",
        "Stephen McHugh was today convicted of the murder of criminology student Rebecca Steer after hitting her with his new Volvo in the Shropshire market town of Oswestry.Jurors heard the 28-year-old had been driving friends home from a night out drinking when the incident took place in Willow Street in the town at about 2.45am on Sunday October 9, last year.CCTV showed McHugh, who admitted at Stafford Crown Court he had 'next to none' driving experience having never had a driving lesson or held a licence, almost hitting Ms Steer after reversing suddenly in the road, before mounting the pavement and crashing into her.The convicted cocaine and cannabis dealer was found guilty by a majority 11-1 verdict after a two-week trial, and  shouted 'F**k off you pieces of shit', after the foreman delivered the verdict' before walking out of the dock.",
        "Prosecutor Kevin Hegarty KC said McHugh had been driving along Willow Street when he stopped in the road and 'exchanged words' with a group near the Grill Out takeaway.Mr Hegarty told the court: 'At that moment Rebecca Steer was crossing Willow Street.'All of a sudden, as she was crossing, the Volvo shot backwards. It narrowly missed her.'The court heard Ms Steer reached the opposite side of the road, only for McHugh to veer on to the pavement.",
        "'We say he used his car as a weapon - he used the power and the weight of the car to strike the group (on the pavement)', the prosecutor said.McHugh's vehicle - bought just eight days earlier - hit three people, the court heard, including two men who were 'knocked aside' by the front wing.But Ms Steer was towards the front of the car and was dragged under the wheels.Mr Hegarty added: 'The car then went over her - which is to say one or more of the wheels went over her. She was crushed - in effect she was left with rib fractures and catastrophic internal injuries.'The defendant, originally from Fazakerley, Liverpool, but who was living in Oswestry, had admitted manslaughter but denied murder.",
        "Jurors also convicted him of inflicting grievous bodily harm in relation to Kyle Roberts, who was one of those also struck by the car. He will be sentenced tomorrow.McHugh had told jurors he had drunk 10 double shots of spirits and taken numerous lines of cocaine before 'a moment of stupidity' when he drove over Ms Steer, who lived in the border village of Llanymynech, Powys and was studying at Liverpool John Moores University.McHugh said he was only trying to frighten the group Ms Steer was part of when he mounted the footpath after a drink and drugs binge at pubs, a friend's flat and a nightclub in the preceding hours.",
        "Ms Steer, the middle of three siblings, died shortly after being admitted to hospital.Miss Steer had also worked as a holiday rep in Turkey, and at a convenience store in the village of Pant, Shropshire, where staff remembered her fondly.Shop supervisor Sophie Owen told the Mail: 'Becky had such a beautiful soul and would do absolutely anything for anyone. She was the life of the party and it's beyond imaginable that she's no longer with us.'McHugh, who admitted possessing the firearm without a certificate, has six previous convictions for 10 offences, including possession of cocaine with intent to supply in 2012, when he was only 17.In July 2016 he was locked up for 17 months for possessing both cannabis and cannabis resin with intent to supply.",
        "Ms Steer's family were in court to see McHugh convicted, with some breaking down in tears after the verdicts were delivered.In a statement at the time of her death, relatives said: 'We are all completely devastated by the loss of our beautiful girl Rebecca.'She always had a smile and a laugh that made everybody love her.'She was the best daughter, sister, granddaughter and friend anyone could ask for.'"
    ]
}