{
    "articleURL": "/debate/article-12060901/RICHARD-KAY-spectacle-Coronation-triumph.html",
    "content": [
        "READ MORE: The hardest working royal you've never heard ofWhat are the lasting memories of the Coronation? The solemnity and costumes in Westminster Abbey? Or the pantomime moment when the Archbishop of Canterbury appeared to screw the crown to the King’s head like a bottle top?",
        "Perhaps it was the approval of the cheering, waving crowds as King and Queen took their curtain call from the Buckingham Palace balcony. And what about that spontaneous jig Charles performed at Sunday night’s concert? Was this the embodiment of a people’s monarch in action?For some, doubtless, it will be William’s failure to mention Camilla by name in his otherwise generous tribute to his father’s achievements — along with the distracting glamour of his wife Kate, a sublime figure of glacial impassivity.",
        "If nothing else here was proof that no matter how hard the Netflix show The Crown tries to recreate the dramas of the House of Windsor, it cannot compete with the real thing.Yes the three days of celebrations to mark the start of the reign of Charles III were a triumph, but, beyond the spectacle and the ceremony, the King faces some real challenges that will not just define how favourably the Coronation is remembered, but also the future direction of the monarchy.Charles never gives the impression of being a man in a hurry, but he knows that time now is pressing. In the eight months since the death of his mother, he has projected a reassuring mix of continuity and familiarity.But issues are crowding in: how in the era of a slimmed-down monarchy can he hope to meet both targets of having fewer working royals while fulfilling all the obligations of charity and patronage inherited from Queen Elizabeth?",
        "Abroad, the Commonwealth seethes with a clamour for change. Barely was the crown settled on Charles’s head than St Kitts and Nevis in the Caribbean became the latest country to demand a consultation about whether to become a republic.Closer to home he has to address the issue of the crown’s staggering property portfolio. In the midst of a cost of living and housing crisis, the sheer number of royal homes is an embarrassment.This, of course, reopens the debate about just who should receive these lavish houses. And, inevitably, whatever solution he finds, they are inextricably linked to the most pressing problem of all: the Andrew and Harry question.The King knows he will be judged more on this matter for his decisiveness — or lack of it — than by any other.Allowing Andrew to wear his robes as a member of the ancient Order of the Garter to Saturday’s ceremony was a kindly, fraternal gesture. But then relegating him to the also-rans of the Royal Family in the row behind his younger brother Edward’s teenage children was scarcely magnanimous.And what about Harry, the running sore of the Windsor story? If his blink-and-you’ll-miss-it appearance at the Coronation was a source of sadness for the King, the decision to banish him to the outer fringes of the Royal Family seats seems questionable.",
        "These first months, the transition between the reign of his mother and his own, were always likely to be unremarkable for Charles when the focus was the meticulous planning of his crowning.It meant, of course, that there was dither. He promoted William and Kate to Prince and Princess of Wales within a day of the Queen’s death. But he waited six months before elevating Edward to Duke of Edinburgh, while Prince Harry and the Duchess of Sussex didn’t bother to wait for his father to confirm Archie and Lilibet’s titles as prince and princess, they did it themselves.In the course of a reign such details probably do not matter. However, over the next year, there will be a series of announcements which will tell us about the King’s direction of travel and his priorities.They will be a mixture of public and personal. Included are the future of Highgrove.A sanctuary during the years of his unhappy marriage to Princess Diana, it remains his favourite home. But how many homes can the man who owns Buckingham Palace, Clarence House, Balmoral Castle, Windsor Castle, Sandringham and Birkhall — as well as boltholes in Wales, Scotland and Romania — possibly need?And it is not just Charles’s properties. Can Andrew, who has no official role, be permitted to remain in Royal Lodge? Evicting him risks the King being cast as vindictive. Allowing him to stay put might suggest weakness. The booing that greeted Andrew as he travelled down the Mall on Saturday may determine which option his brother chooses.",
        "There are likely to be changes for the Waleses, too. At the moment, William and Kate are living in homely Adelaide Cottage in Windsor Home Park, chosen for its convenience to their children’s school.",
        "There are now questions about whether it is practical for the prince’s enhanced role. Running the vast Duchy of Cornwall estate and the huge increase in the number of their day-to-day engagements may mean them relocating to their Kensington Palace apartment sooner than they planned.As for Harry, the housing issue has already been settled, he has forfeited Frogmore Cottage and has almost certainly spent his last night there. Charles who desperately wants to be reconciled with his son, will keep the door open and has assured him that he will always have somewhere to stay.For all his talk of the apology he says he wants from the Royal Family , there have so far been no concessions. Charles is aware that this is a situation of considerable delicacy. Not only was Camilla upset by many of Harry’s comments which included him accusing her of leaking stories about him, William has also insisted that it is he and Kate who deserve the apology because of his brother’s comments about them in his memoir.Many around Charles wonder if Harry will ever be seen at a royal event again, such is the depth of the rift.",
        "As heart-breaking as this undoubtedly is to the King, it is not the only testing problem he faces. With Commonwealth countries apparently lining up to register their wish to break away, the King faces a tricky dilemma.Should he simply wait as each makes their case for republic status, or does he get on the front foot and make the case for continued membership?‘It’s going to have to be finely judged,’ says one former royal adviser. ‘He needs to show he is not being driven by events but is in control of them.’In the short-term, he must answer the increasingly anxious calls from the charity world. What will happen to all those organisations he supported as Prince of Wales? And what about those that were served by the late Queen?These are almost certainly what Princess Anne had in mind when she suggested that slimming down the monarchy was beginning to look rather foolish. No Harry and Meghan and no Andrew meant the numbers of working royals had already been scaled back. How will Charles’s vision of a leaner monarchy actually function?As his reign formally begins, it is one of only countless problems the new King faces. Planning all the facets of the Coronation may seem simplicity itself in comparison."
    ]
}