{
    "articleURL": "/wires/reuters/article-12043855/Ex-OpenSea-manager-convicted-NFT-insider-trading-case.html",
    "content": [
        "By Luc Cohen",
        "NEW YORK, May 3 (Reuters) - A former product manager at OpenSea, the world's largest marketplace for non-fungible tokens (NFTs), was convicted on Wednesday of fraud and money laundering for using inside knowledge of which assets would be featured on its home page to trade NFTs.Nathaniel Chastain was accused of buying NFTs he had decided to feature on the OpenSea website and selling them shortly afterward to make more than $50,000 in illegal profit, in what federal prosecutors in Manhattan described as the first insider trading case involving digital assets.\"He abused his status at OpenSea to line his own pockets, and he lied to cover his tracks,\" prosecutor Thomas Burnett said in his closing argument on Monday.The charges against Chastain, announced last June, were the first in a series of high-profile cases related to digital assets launched by the U.S. Attorney's office in Manhattan last year.The case could have broader implications for assets that do not fit in to existing regulations preventing investment advisers, brokers and others from trading on material nonpublic information, legal experts have said.Chastain had pleaded not guilty. His lawyers argued that OpenSea did not treat knowledge of what NFTs would be featured on its home page as confidential information when Chastain worked at the company.",
        "\"You can't hold Nate to a standard that didn't exist,\" his lawyer Daniel Filor told jurors in his closing argument on Monday. \"Nobody told Nate that he couldn't use or share that information.\"Prosecutor Allison Nichols said Chastain used anonymous OpenSea accounts to make the illegal trades, showing he knew what he was doing was wrong.\"He hid what he was doing,\" Nichols told the jury in her rebuttal argument. \"He knew that he had violated OpenSea's confidentiality agreement.\" (Reporting by Luc Cohen in New York)"
    ]
}