{
    "articleURL": "/wires/afp/article-12058235/Sydney-Opera-House-row-coronation-snub.html",
    "content": [
        "A royal row has erupted in Australia over a decision to scrap the lighting-up of the Sydney Opera House in honour of King Charles III's coronation.",
        "The sails of the architectural masterpiece on Sydney Harbour are illuminated in colours for important occasions ranging from WorldPride to the Ukraine invasion anniversary and the death of Queen Elizabeth II.But for Saturday's coronation, the soaring curves of the emblematic 50-year-old building were left dark.New South Wales state premier Chris Minns said he had cancelled his predecessors' plans to light up the building for Charles, who is Australia's head of state.\"I would like to keep it for Australia and Australians and moments of sacrifice and heroism for the country, or when there's an important international event in Sydney,\" Minns told a radio interviewer on Monday.The premier said the building's sails had been illuminated 70 times last year -- compared with 23 times a decade earlier -- at an estimated cost of Aus$80,000-100,000 (US$54,000-67,000) for each occasion.People had many places to mark the coronation including on television, he told Sydney's 2GB radio.\"The event was not taking place in Sydney, it was taking place in London,\" Minns said.\"Of course, I respect the new king but I am mindful of where and when we spend taxpayer money.\"Minns became premier on March 25 after his Labor Party won the state elections.- 'Republicanism by stealth' -Labor Prime Minister Anthony Albanese, who attended the coronation, is an avowed republican whose government includes an assistant minister for the republic.",
        "Royalists said republican sentiments were behind the decision to not turn on the Opera House lights.\"We are facing a campaign of republicanism by stealth in Australia by the current government despite the parading of the prime minister in London declaring his allegiance to the king,\" said Australian Monarchist League chair Philip Benwell.Benwell said community organisations such as the monarchist league would have raised money to switch on the lights if they had been consulted.\"There are a lot of monarchists who voted Labor at the last state election and they are now regretting having done so,\" he told AFP.But the New South Wales premier said he would not apologise to those disappointed by his decision.\"I have got no interest in antagonising people that believe in the monarchy, people who are royalists -- of course not -- but obviously I have got to be careful about where I spend their money,\" he said.Polls show many Australians want to get rid of the monarchy in favour of a republic.But the republican question is taking second place to a referendum later this year on giving Indigenous people the constitutional right to be consulted about laws that affect them."
    ]
}