{
    "articleURL": "/news/article-12047591/Tucker-Carlson-delivers-pre-recorded-messages-conference-featuring-old-Fox-News-studio.html",
    "content": [
        "Tucker Carlson was fired from Fox News on April 23 after 14 years at the networkThe pre-recorded clip was shown at the Conservative Political Action Conference in Budapest, Hungary Carlson jokes about attending the conference if he had 'time and could leave'A pre-recorded video link has been aired at a conservative conference in Hungary featuring Tucker Carlson in his old Fox News studio and joking he would be there in person if he 'ever got fired' - despite the host being abruptly dismissed on April 23.",
        "The embarrassing clip of the commentator in his former Tucker Carlson Tonight studio was aired Thursday at the start of a 'No Woke Zone' panel discussion at the Conservative Political Action Conference (CPAC) in Budapest.Carlson was fired from Fox News last Monday after 14 years, for reasons that have not yet been made entirely clear.Since his departure, videos have been leaked from his axed streaming show showing Carlson unloading on Fox Nation and cracking jokes about his 'post-menopausal fans.'Carlson likely recorded the remarks weeks ago but they had not been updated before being broadcast at the conference - rather than the host joking about recent shock events.",
        "'Greetings to CPAC Hungary and all you Americans in the audience,' Carlson said in the clip. 'You are very brave. You’ve landed up on one of [U.S. Agency for International Development chief] Samantha Power’s list, the State Department is keeping track! You went to a forbidden country!'He continued: 'I wish I was there in Budapest. If I ever get fired and have some time and can leave, I will be there with you. 'But in the meantime, Godspeed, we are thinking of you and cheering you on.'The opening day of the conference also featured a speech from Hungary's far-right leader Viktor Orban, who Carlson has long been an advocate of. ",
        "Carlson formerly broadcast his primetime Fox News slot from the country and has also appeared at conferences.He often spoke on his show about what the US could 'learn' from Hungary and interviewed the Hungarian foreign minister on his primetime show in January 2022, despite the country's strict immigration and anti-LGBTQ policies garnering international criticism. During his CPAC Hungary speech last year, the populist prime minister called Carlson a 'friend', adding 'programs like his should be broadcasted day and night.'",
        "Carlson left his Fox News show on April 23, with no official reason given for why the company let their most-watched anchor go.The decision was made six days after Fox settled with Dominion Voting Systems for $787.5 million.It is thought his dismissal may have had to do with evidence presented to the Fox News board during preparation for the defamation trial. It has emerged that Carlson sent an incendiary text message the day after the January 6 storming of the Capitol - which the board of Fox News learnt about on the eve of their defamation trial - sparking, in part, his shock firing last week.The pivotal role played by the January 7, 2021, text message was reported Tuesday by The New York Times.In the text to one of his producers, Carlson recalls seeing a mob of three white men attacking an 'Antifa kid' and wanting the victim to be killed. But, Carlson wrote, he realized wanting the 'Antifa kid' to die was wrong.",
        "Carlson, whose critics call him a white supremacist, also asserted that white people in general do not act so dishonorably as to launch a three-against-one attack. He did not specify the race of the 'Antifa kid'.'It was three against one, at least,' Carlson wrote. 'Jumping a guy like that is dishonorable obviously. It's not how white men fight.'"
    ]
}