{
    "articleURL": "/tvshowbiz/article-12042145/TOWIEs-Dan-Edgar-seen-Amber-Turner-split.html",
    "content": [
        "Dan Edgar has been pictured for the first time since his ex-girlfriend and TOWIE co-star Amber Turner confirmed they had split up.",
        "The reality personality, 29, confirmed she had split from Dan after six years of dating in an Instagram statement on Tuesday evening.She claimed she felt forced to release a statement after split rumours swirled following Dan, 31, unfollowing her on social media.Amber told her followers: 'I wasn't going to post anything but due to speculation and questions I feel like I need to. Yes me and Dan have split'.She continued: 'I honestly wish him the best for the future. Please respect our privacy at this time. Thank you'. ",
        "Following the announcement, Amber was pictured driving away from the 'dream' Essex mansion they had recently purchased together just before Christmas.Amber was seen at the wheel of the white Mercedes 4x4 before heading to join her friend Courtney Green for a coffee in a local cafe.She was wearing a cropped leather jacket with a pair of leggings and rectangular sunglasses for their meet up. Later the same day, Dan was pictured arrived at the house. However it was previously understood that he has moved out of their home.The TV star was dressed down in a pale grey hoodie as he stood chatting on the phone. Amber has just returned from a UAE city celebrating her mum Suzanne's 60th birthday following the shock split.  ",
        "MailOnline contacted Amber and Dan's representatives for comment at the time.Despite being an item since 2017, it's certainly not the first time cracks have shown in Dan and Amber's relationship.",
        "Last year, Ella Rae Wise slammed the former electrician for acting 'inappropriately' in a nightclub and claimed Amber shouldn't trust him.TOWIE star Ella, then 22, told MailOnline Dan 'needs to keep his hands to himself' and she was shocked he behaved in such a way given he's in a long-term relationship.In an exclusive interview, Ella explained that Dan is yet to apologise for the incident, which allegedly took place during a night out last year, and she's been branded a 'liar' by her co-stars, including Amber's close friends Chloe Meadows and Courtney Green.She said: 'Dan needs to keep his hands to himself really. He shouldn't touch up other girls when he has a girlfriend.",
        "'He was hands on and given he has a girlfriend, it was inappropriate.'With his track record I don't know how she can allow her man to go out.'I'm not the biggest fan of theirs and they're not the biggest fans of me but I'm the worst person he could have touched up in a club because I'm not going to keep it a secret.",
        "'I've been called a liar, which is fine because I've been called a liar before on the show and I can see why they would have animosity towards me but if her boyfriend were to touch up someone – I'm not the best person because I am going to tell the truth.'Those girls automatically thought I was lying about it, but I wasn't. Dan was horrible to me afterwards, but you'll see on the new series.'A source close to the show told MailOnline: 'Dan put his hands around Ella's waist while they were in a club – nothing more.'",
        "MailOnline revealed last June that Amber's relationship with Dan had been rocked following claims he 'always wanted a piece of Ella.'In a voice note that will be aired on the new series, Ella described her account of events to co-star Harry Derbidge and the allegation quickly circulated in Essex.Speaking in defence of Amber and Dan's relationship, Chloe accused Ella of fabricating the incident and claims her only concern is raising her public profile.Chloe said: 'I just think the person that started that rumour is starving, absolutely starving. She's starving for storylines, clout, attention, fame; you name it she is gagging for it. Yes, I'm talking about Ella.'",
        "A statement posted by Ella on Instagram today, read: 'Some of you may have seen some press stories today saying that I said that Dan Edgar touched me inappropriately.'I do want to make it clear that Dan Edgar did not touch me inappropriately without my consent.'What I did mean is that I think how he has acted towards me whilst having a girlfriend is not okay.",
        "'No boyfriend should hold someone's hand or put his hands around another girl's waist while in a relationship.'This is a story that is covered in the upcoming series of TOWIE, where you will see both sides to the story from myself and Dan.'Ella explained that tension between herself and Dan caused a rift in the cast and Amber and her close group of friends ostracised her.She said: 'The other group don't let a lot of people in.'If they don't like the look of you, they don't want you in their group. With us, where we don't comply and we won't agree with everything they say, they would rather not get on with us and that sits completely fine with me because they're not my people either.'Ella, who's previously admitted to having a 'flirty relationship' with Pete Wicks, 33, says the pair dated this series – but their romance has never gone further than a kiss.",
        "She's also not fazed by the couple's 11-year age difference and says even her mum encourages her to date an older man.'I did have a few cheeky, little dates with Pete', Ella explained.'We have never gone any further than a kiss. With us it can't go any further than that because I don't want to ruin our friendship because I appreciate him a lot as a person.'Age is nothing but a number and it's more about their mindset than their age. I'm 22 but I'm going on 35. My mum said to me that I need an older man in my life.'"
    ]
}