{
    "articleURL": "/wires/ap/article-12040323/D-az-Tovar-homer-Rockies-beat-Brewers-3-2.html",
    "content": [
        "DENVER (AP) - Elías Díaz homered and drove in the go-ahead run with an eighth-inning single, and the Colorado Rockies beat the Milwaukee Brewers 3-2 on Tuesday night.",
        "Rookie shortstop Ezequiel Tovar hit his first major league home run for Colorado, which has won its last two home games after dropping seven straight at Coors Field.\"I wasn´t going up there trying to do that but luckily I got my first one,\" Tovar said through a translator.C.J. Cron led off the eighth with a double off Peter Strzelecki (2-1), and Díaz singled to bring home pinch-runner Yonathan Daza.Justin Lawrence (1-1) worked a scoreless eighth and Pierce Johnson handled the ninth for his fourth save.Rowdy Tellez, Brice Turang and Jesse Winker had two hits each for the Brewers.",
        "Brewers starter Freddy Peralta returned to the place where he struck out 13 batters in his 2018 major league debut. He allowed Tovar´s homer in the third that put Colorado ahead 1-0.\"Warming up before the game I was thinking about that day, my debut,\" Peralta said. \"Great memories for me, great experience to pitch here.\"Díaz led off the fourth with a 453-foot blast to the concourse over left field, but Peralta worked out of a jam when right-fielder Tyrone Taylor threw out Randal Grichuk trying to score on Tovar´s flyout.\"When you face the type of pitcher like Peralta and you win, you have to celebrate,\" Díaz said. \"He´s good, but we were better tonight.\"",
        "Peralta struck out 10 in six innings.\"I think that I that I threw the ball well. I just made two or three mistakes and I paid for them,\" Peralta said.The Brewers tied it in the sixth off Ryan Feltner, who allowed two runs in 5 1/3 innings. Christian Yelich led off with a double and later scored on a fielder´s choice. Tellez doubled and Willy Adames scored on William Contreras´ groundout.Feltner benefited from some strong defense, especially from Tovar, who made a spinning throw to get Brian Anderson at first in the fourth inning.Tovar also helped turn three double plays and jumped to snare Tellez´s line drive leading off the ninth.\"Defense like that brings a lot of confidence to the whole team,\" Feltner said.TRAINER´S ROOMBrewers: Taylor was activated from the 10-day injured list. Taylor missed the first month of the season with right elbow sprain. ... RHP Gus Varland was sent to Triple-A Nashville on a rehab assignment. He was placed on the injured list with a hand issue on April 16, a day after he was hit by a Manny Machado line drive.Rockies: Right-hander Germán Márquez said he will have Tommy John surgery and miss the remainder of the season.YER OUT!",
        "Winker became the second Brewers player to strike out on a pitch-clock violation. In the third, Winker was looking down before a 3-2 pitch when the clock hit 7 seconds. Plate umpire Edwin Jimenez rung him up for strike three.Winker had a few words for Jimenez as he walked away from the plate and was given a warning after he descended into the dugout. The Brewers didn´t think the clock was started properly.\"That was our argument,\" manager Craig Counsell said.Tellez was the first Milwaukee player to violate the pitch clock, on April 10 at Arizona.UP NEXTThe Brewers will send Eric Lauer (3-2, 5.19 ERA) to the mound against Kyle Freeland (2-3, 4.32) in a matchup of lefties on Wednesday night.___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}