{
    "articleURL": "/wires/ap/article-12059595/US-backs-study-safe-injection-sites-overdose-prevention.html",
    "content": [
        "For the first time, the U.S. government will pay for a large study measuring whether overdoses can be prevented by so-called safe injection sites, places where people can use heroin and other illegal drugs and be revived if they take too much.",
        "The grant provides more than $5 million over four years to New York University and Brown University to study two sites in New York City and one opening next year in Providence, Rhode Island.Researchers hope to enroll 1,000 adult drug users to study the sites' effects on overdoses, to estimate their costs and to gauge potential savings for the health care and criminal justice systems.The universities announced the grant Monday. The money will not be used to operate the sites, the universities said.With U.S. drug overdose deaths reaching nearly 107,000 in 2021, supporters contend safe injection sites, also called overdose preventions centers, can save lives and connect people with addiction treatment, mental health services and medical care.Opponents worry the sites encourage drug use and that they will lead to the deterioration of surrounding neighborhoods.",
        "\"There is a lot of discussion about overdose prevention centers, but ultimately, we need data to see if they are working or not, and what impact they may have on the community,\" said Dr. Nora Volkow, director of the National Institute on Drug Abuse, which awarded the grant.Sites operate in 14 countries, including Canada, Australia and France, according to the Drug Policy Alliance, a group working for decriminalization and safe drug use policies.",
        "In the U.S., New York City opened the first publicly recognized safe injection site in 2021 and Rhode Island became the first state to authorize them that year.States including Colorado, Nevada and New Mexico have considered allowing them. The governors of California and Vermont vetoed safe injection site bills last year, and Pennsylvania´s Senate last week voted for a ban on them.The grant marks another move by the Biden administration toward what is known as harm reduction, a strategy focused on preventing death and illness in drug users while helping them get care, as opposed to punishment.The White House's drug control strategy is the first to emphasize harm reduction, and the Justice Department has signaled it will allow safe injection sites.In December, the National Institutes of Health established a harm reduction research network to study programs providing services and supplies such as naloxone, a drug that can reverse overdoses, and materials to test drugs for fentanyl, a powerful opioid driving record numbers of overdoses. The new study will be part of that project.___The Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute´s Science and Educational Media Group. The AP is solely responsible for all content."
    ]
}