{
    "articleURL": "/tvshowbiz/article-12052897/Miranda-Kerr-Rachel-Zoe-rock-black-jackets-Eniko-Hart-beams-orange-Baby2Baby-event.html",
    "content": [
        "Miranda Kerr, Rachel Zoe, and Eniko Hart were fashion-forward as they attended a Baby2Baby event in Beverly Hills on Friday.",
        "Miranda, 40 - who was spotted in New York earlier this week - dressed in a long-sleeved black sweater topped by a structured, cropped jacket.Rachel, 51, also chose to wear a stylish black jacket as she opted for a longer variety with puffy shoulders.Eniko, 38, was bright in a clinging monochrome orange look with an off-the-shoulder top and matching pants.The gathering, hosted in the spirit of Mother's Day, was presented by Dave and held at The Maybourne.",
        "Supermodel Miranda, who shares a son with ex Orlando Bloom, teamed her look with medium wash jeans.The Australian beauty punctuated the ensemble with a pair of black, leather pointy-toe booties.Her shoulder-length, glossy, blonde-highlighted tresses fell over her chest, styled in a center part and soft curls.The former Victoria's Secret Angel flaunted a short, pale pink manicure as she distributed gift bags inscribed with the word 'MOM.'For her part, Rachel looked great in long, sultry, platinum blonde waves that reached her waist.Her coat boasted buttons that went from the collar to the midsection before the jacket flared out slightly at the bottom.Zoe, who hails from New York, added a pair of long, indigo blue jeans with a flared cut.She complemented the outfit with a chunky gold choker and wore makeup that gave her visage a gorgeous glow. ",
        "Eniko, who is married to actor and comedian Kevin Hart, commanded attention in her long-sleeved, low-cut top.The figure-hugging look teased her perky cleavage and was coordinated with slim-fitting bottoms.The bombshell added a pair of open-toe white sandals, showing off her pristine white pedicure.She wore a delicate gold necklace, a watch, and matching gold bangles while rocking a nude pink manicure.The mother-of-two, who shares son Kenzo, 5, and daughter Kaori, 2, with her husband, wore her bob haircut straight and in a center part.She looked typically beautiful in a face of pink-toned makeup worn on her cheeks and pout. ",
        "Baby2Baby is a Los Angeles-based charity whose aim is to get essential goods like diapers and clothes to underprivileged children.The organization's website stresses how important their work is at the moment in light of recent crises including the baby formula shortage earlier this year.Its board of directors includes but is not limited to a number of famous figures like Nicole Richie, Jessica Alba, Rachel Zoe, Kelly Rowland and Julie Bowen.Emma Grede, who helped co-found Good American with Khloe Kardashian as well as Kim Kardashian's SKIMS, is also one of the members of the board."
    ]
}