{
    "articleURL": "/femail/fashion/article-12057773/Shoppers-race-affordable-Marc-Jacobs-tote-bag-dupe-Seed-Heritage.html",
    "content": [
        "Seed's felt tote bag looks just like a Marc JacobsThe Seed bag is priced between $70-$80Marc Jacobs' tote can cost up to $1,300 Shoppers have been sent into a spin over an affordable bag that is a perfect dupe for a designer version worth hundreds of dollars. ",
        "Fashion lovers are racing to get their hands on Seed Heritage's felt tote bags that are priced between $69.95-$79.95.Many are saying the find is a 'better' version of Marc Jacobs' iconic tote bag which can cost up to $1,300. The Seed bag has already sold out online and starting to disappear from store shelves as the retailer runs a 20 per cent off everything promotion until Mother's Day on May 14. 'Run, don't walk, run to Seed right now. If you guys are like me and love the Marc Jacobs tote bag but can't justify the $400 price tag, you literally need to go to Seed right now,' customer Clancey said in a TikTok clip.  Scroll down for video",
        "Clancey bought several of the tote bags after she messaged her friends and family when she spotted the finds at her local Seed store. 'I got myself the big one because I need a big bag and I'm going to hold all my gym gear in here, my Frank Green is going to fit in here,' she said. 'It's so big, so good for travel and I don't know if you can tell but it's this gorg soft material.'Marc Jacobs's tote bag comes in a variety of colours, materials and sizes and has become a cult-favourite among high-end fashion lovers since its debut in 2019. ",
        "Seed's version of the designer bags are made from felt and are available in both cream and brown in a mini size for $69.95 and a larger size for $79.95.",
        "Shoppers can get an extra 20 per cent off the bags if they are lucky enough to find one in store for a limited time. 'The offer doesn't end until Mother's Day so you still have time but I swear to god these are going to sell out, they were selling out while I was in the store,' Clancey said. 'So cute, such a staple little bag, I could just never pay for the Marc Jacobs one.'Clancey's video racked up more than 424,500 views and has many women in the comments keen to find the stylish bag for themselves.  'I have never been influenced so quickly,' one viewer wrote and another said: 'Not a want but a NEED'.",
        "'I like it better than the Marc Jacobs!!' a third claimed. 'Yasss just added to cart,' one shopper replied while a second added: 'I literally left this video and purchase in 30 seconds.' Since the viral clip was posted just two days ago, the felt tote bags have sold out in both colours and sizes on the Seed website. 'Why didn't I see this video earlier? I wanted the big cream one and it is already out of stock everyone so fast,' one woman said. ",
        "'When I tell you I had my hands on the large cream one YESTERDAY and thought 'nah, it'll get too dirty' and now it's sold out everywhere! So mad!!!' someone else commented."
    ]
}