{
    "articleURL": "/wires/ap/article-12047265/Iowa-judge-favors-property-owners-pipeline-dispute.html",
    "content": [
        "SPENCER, Iowa (AP) - Opponents of planned liquid carbon dioxide pipelines in the Midwest won a victory when an Iowa judge ruled that a state law that gives surveyors the right to enter private property is unconstitutional.",
        "In his ruling Wednesday, District Judge John Sandy denied a pipeline company's request for an injunction that would allow survey crews access to Martin's Koenig's farmland near Sioux Rapids in northwest Iowa.Sandy said a law giving crews that access violated the state constitution because it doesn't provide just compensation for damages to landowners in exchange for the loss of their right to deny entry to their land, according to the Sioux City Journal.Pipeline company Navigator CO2 Ventures said it will appeal the ruling, arguing it deviated from decisions in similar cases in other states.Attorney Brian Jorde, who is representing Koenig, welcomed the ruling, calling it \"a good day for anyone who cares about property rights.\"Jorde, of Omaha, Nebraska, also represents another property owner in western Iowa who has made a similar claim against Navigator. A ruling in that case is expected soon.Navigator's planned pipeline would cut through five states - Iowa, Illinois, Minnesota, Nebraska and South Dakota - and carry carbon dioxide from ethanol and fertilizer processors to a site in Illinois. The gas would be converted to liquid form and sent under high pressure to a site where it would be pumped thousands of feet beneath the surface.The pipeline is one of three proposed in Iowa, and similar projects are planned in other Midwest states. Interest in the pipelines has grown because of lucrative federal tax credits and the hopes that capturing the carbon dioxide produced when creating ethanol will make the fuel additive more marketable in states with more strict air quality standards.",
        "Although the pipelines would capture carbon dioxide that otherwise would be released into the atmosphere, many environmental groups have opposed such projects. They question the safety of the pipelines and argue the nation should focus on renewable energy sources and break completely from fossil fuels."
    ]
}