{
    "articleURL": "/tvshowbiz/article-12043363/Daisy-Lowe-cuddles-baby-daughter-Ivy-four-weeks-countryside-walk.html",
    "content": [
        "Daisy Lowe has shared an array of adorable snaps of a countryside walk with her baby daughter Ivy. ",
        "The model, 34, was glowing as she held Ivy Love, four weeks, who she shares with fiancé Jordan Saul, in a baby carrier. Daisy held her newborn close to her heart as she wistfully looked into the distance, while keeping Ivy's face hidden from the camera. The new mother looked radiant in a leopard-print jumper, while her raven tresses were styled with chic bangs. Penning alongside her Instagram post on Wednesday, she said: 'I love having Ivy close to my heart, and being hands-free. ",
        "'It’s given me so much more freedom which feels like such a gift 4 weeks into my mum hood.'Fans were quick to praise how quickly Daisy has adapted to motherhood, with one commenting: 'Beautiful pictures', while a second said: 'Beautiful photos Daisy, wishing you both a wonderful day.'A third fan praised how quickly she has adapted to being a new mum, saying: 'Motherhood looks good on you babe.' Daisy took to Instagram in April to reveal she had given birth to her daughter as she shared a picture of her bundle of joy. In the caption of her post, Daisy gushed: 'Our Easter egg finally hatched! Ivy Love Saul you have made all my dreams come true - our dream girl.'I have never known happiness or love like this. I can’t stop crying tears of joy. Happy Easter Loves.'",
        "Her property developer partner also shared a post following their daughter's birth, writing: 'Welcome to the world Ivy Love Saul.'At the end of the month, Daisy shared an update with fans as baby Ivy reached two weeks.  ",
        "Snapping a selfie, the model looked radiant as she posed for the camera with her bundle of joy laid on her chest. Alongside the stunning snap, Daisy also posted pictures of the sky, an image of her 'first time baking as a mumma' and also a snap of her placenta pills.Her caption read: 'Postcards from the newborn bubble that are soothing my soul no end... Ivy cuddles... Chasing the sunshine, blue skies and blossom... Placenta encapsulation from @birthbetter_withelona... My first time baking as a mumma'. She had a Tiba + Marl x Etta Loves Sensory Muslin close by to wrap her little one in.She shared yet another a candid snap giving a peek into motherhood as she pumped milk from her breast and uploaded photos of her fiancé doting over their baby girl.Daisy called the breast pump her 'new secret weapon' and a 'game changer', five days after she announced she had given birth.The former Strictly star also said seeing Jordan become a father has been the most 'beautiful and emotional experience'.",
        "She wrote: 'Daddy appreciation post… watching you for the past week dote on our baby girl has been the most beautiful &amp; emotional experience.",
        "'Your care for us both is beyond anything I could have ever wished for… you are the greatest wind machine- keeping Ivy's tummy free and easy going…'You have made our home so clean and serene, filled my tummy with the yummiest meals &amp; all the fuel to feed our girl &amp; been such unwavering support for my hormonal tears, all the giggles and all the cuddles.'Thank you for doing everything in your power to keep our ship sailing peacefully. We are so lucky you are ours. We love you more than words could ever express x x x.'The former Strictly contestant also shared a photo of Jordan pushing their daughter in a pram.The couple headed to Babington House to support Daisy's mother Pearl Lowe who was running a fair. Daisy captioned the snap of proud dad Jordan out and about with their little one all snuggled up in a pram: 'More dad life diaries'. "
    ]
}