{
    "articleURL": "/wires/reuters/article-12053093/Dave-Hakstol-Jim-Montgomery-Lindy-Ruff-named-Jack-Adams-finalists.html",
    "content": [
        "Boston first-year coach Jim Montgomery, whose Bruins set NHL records for wins and points, is a finalist along with the Seattle Kraken's Dave Hakstol and the New Jersey Devils' Lindy Ruff for the 2022-23 Jack Adams Award as the head coach who has \"contributed the most to his team's success.\"",
        "NHL Broadcasters' Association members voted for the award at the end of the regular season. The finalists were revealed Friday, with the winner to be announced June 26 during the NHL Awards ceremony in Nashville, Tenn.The Bruins won the Presidents' Trophy for the most points in the regular season -- a league-record 135 -- as they also set the mark for wins in going 65-12-5.Boston -- which also set NHL records with a 14-game home winning streak to start the season and five seven-game-plus win streaks -- led the Atlantic Division from wire to wire. The top-seeded team, however, was eliminated by the Florida Panthers in the first round of the Eastern Conference playoffs.Hakstol led the Kraken (46-28-8, 100 points) to their first playoff berth in their second year of existence. They made improvements of 19 wins and 40 points from their debut season -- the largest jumps from an inaugural season in NHL history.Seattle had allowed the fourth-fewest shots on goal average (28.9) last season, and improved to 27.0 to rank second in the league this season.Ruff guided the Devils (52-22-8, 112 points) to franchise marks for wins and points as they finished third in the overall standings. That was their best regular-season finish since third place in 2000-01. The 112 points marked a 49-point gain from 2021-22 -- the largest year-over-year improvement since the 82-game schedule was introduced in 1995-96.",
        "A Jack Adams finalist for the fourth time for a third different franchise, Ruff won the award with the Buffalo Sabres in 2005-06.--Field Level Media"
    ]
}