{
    "articleURL": "/wires/aap/article-12054801/Young-GWS-star-Green-takes-Bont-challenge-head-on.html",
    "content": [
        "Not even a career night from \"special\" and \"next level\" midfielder Tom Green could save GWS from losing to the Western Bulldogs on Saturday, but his coach is licking his lips at what's to come from the Giants prodigy.",
        "Green, 22, went blow-for-blow with Bulldogs champion Marcus Bontempelli at Manuka Oval, and while master Bontempelli (25 contested possessions, 14 clearances) possibly got the points over apprentice Green (38 disposals, three goals), it was a tantalising display from the young Giant.Often labelled a 'bull' for his stoppage brutality, Green's coach Adam Kingsley said his increased running power and ability to find uncontested ball was taking his game to new heights.\"Typically he's been a really strong stoppage player, but he's now finding the ball in transition ... that's through work-rates, through positioning, and then tonight he's been able to finish his work,\" he said.\"He's (52) games into a career, it's a pretty special career already in terms of what he's capable of.\"I can't wait to see him progress and develop over the next two, three, five years, my belief is he could be an elite midfielder of the competition if he's not there already.\"Particularly in the second half tonight, that was next level, so that's the baseline for him, that's what I expect.\"Bontempelli, who's still only 27 despite his already strong legacy in the game, might boast four All-Australian blazers and a premiership medal, but he didn't produce a 30-disposal, three-goal game like Green until his 147th game.",
        "Green, who's just produced that kind of prolific night in his 52nd, led a late GWS comeback before the Bulldogs took the win 13.8 (86) to 10.11 (71).The Giants are hanging tough in every game of Kingsley's reign, but he demanded they stop letting deficits accumulate without firing a response.\"(Green) certainly was able to impact the game particularly in the last quarter, he kicked a couple in the last quarter and it ended up being a really special night for him,\" he said.\"But again, too little, too late, we need to be able to do our work a little better when we've lost momentum and right at the moment with the game slipping away, we don't quite have the ability to regain momentum and keep the margin close enough.\""
    ]
}