{
    "articleURL": "/sport/afl/article-12045559/Collingwood-star-Gavin-Crosisca-Australian-Idol-winners-unlikely-hero.html",
    "content": [
        "Gavin Crosisca helped an Australian Idol winner bounce back  Kate DeAraugo hit rock bottom after her arrest for drug possession in 2017 Collingwood hero Crosisca's rehab centre set DeAraugo on the right path Former Australian Idol winner Kate DeAraugo found support from the most unlikely source when she hit rock bottom - Collingwood hero Gavin Crosisca. ",
        "DeAraugo - who won the hit reality TV show in 2005 - began her journey to recovery following an arrest in 2017 for possession of crystal meth, a large knife and tomahawk in Bendigo. The 37-year-old then underwent a long-term stint at the Sober Living Rehab treatment centre - run by 1990 premiership winner Crosisca - and is now celebrating five years of sobriety.  'I was there for a long time,' she told the Herald Sun of her friendship with Crosisca. 'So we had many chats over the time and we were able to relate on another level again. 'But it wasn't about the fame, it was about two people being able to understand the feelings that got us to this place we ended up in.'",
        "Crosisca endured a lengthy two-decade battle with drug addiction and has admitted to snorting speed daily. He hit rock-bottom when he planned how to stage a robbery of a pub he co-owned so he could collect the $60,000 takings to fuel his habit.Yet regardless of the fame that both DeAraugo and Crosisca had enjoyed, the singer says that the footy star's understanding of her struggles is the point at which they connected. 'That was the greatest support and the greatest comfort,' she said. 'It didn't matter how famous or important he was and it didn't matter how famous or important I was. He understood how I felt. ",
        "'Despite all the noise and the fame, being able to relate to someone in the darkest times is the most important thing.'DeAraugo has since given birth to a 'miracle' baby boy, while Crosisca has been sober for 12 years - with the help of his devoted wife Nicole. The Australian Idol winner says that she reached a point where she'd either have to get clean or allow her addiction to kill her.",
        "'It was pretty heavy. I suppose it was to change or potentially die, for me. I was left with not much choice. And I didn't want to do that. I didn't want to do that to my family. And I didn't want to do that to myself. It was a matter of life or death for me at the end, so I had no choice but to go in and get better.' She says, with the help of therapy, she has now understood that feelings of self-doubt led to her drug addiction.'It was quite a long and complicated road that got me there. I spent that whole time running from myself and hating myself,' she said.'The addiction is the end result of a much greater problem. You would have thought winning a TV show and being put in the spotlight and having that success, that I would be able to believe in myself and be confident.",
        "'But I don't even remember a time growing up when I was sure about myself or confident in what I did.",
        "'I have always been pretty riddled with self-doubt and that was just exacerbated by being in the spotlight.'I live in this impostor syndrome. I spent my whole time believing that one day I would get caught and that people would know I didn't belong.'Crosisca explained that only two per cent of ice addicts manage to go 12 months sober if they only spend four weeks at an addiction or rehab centre. 'The simple fact is the percentage of people who get well straight away is very low,' he said. 'When they come in they are pretty broken. 'When Kate came in and first had a go at it, she would be the first to admit she was a troublesome child. That made it difficult for us, but she had great family support.'DeAraugo added: 'I went there for a short period of time and I wasn't actually ready to listen and I was still running my own race. I went back out for a little while and that's when the moment hit and I knew it was time to change. I actually contacted Gavin and (business partner Belinda Walsh) and said, 'I need help. I need help now'. "
    ]
}