{
    "articleURL": "/sport/nhl/article-12055815/Edmonton-Oilers-crush-Golden-Knights-5-1-Las-Vegas-level-second-round-series-one-each.html",
    "content": [
        "The Western Conference Second Round of the Stanley Cup playoffs is tied 1-1 Edmonton's star goaltender Stuart Skinner made 30 saves in the sizable victory DailyMail.com provides all the latest international sports news Connor McDavid had two goals and an assist and Leon Draisaitl scored two goals as the Edmonton Oilers jumped out to a 4-0 first-period lead and cruised to a 5-1 victory over the Vegas Golden Knights in Game 2 of the Western Conference Second Round of the Stanley Cup playoffs on Saturday afternoon in Las Vegas.",
        "Evan Bouchard had a goal and an assist, Zach Hyman had three assists and Ryan Nugent-Hopkins added two assists for Edmonton which bounced back from its first regulation loss since March 11 in Game 1 on Wednesday to even the series, 1-1. Game 3 is Monday night in Edmonton.Stuart Skinner finished with 30 saves for the Oilers.Ivan Barbashev scored for Vegas, which had a five-game winning streak snapped. Laurent Brossoit stopped 27 of 32 shots before being pulled after two periods. Adin Hill finished up and made four saves.Draisaitl, the first Edmonton player to score four goals in a playoff game since Hall of Famer Jari Kurri did it in 1987 in Wednesday's 6-4 loss, became the fifth player in NHL history to score five consecutive team goals in a postseason when he gave the Oilers a 1-0 lead at the 2:21 mark of the first period. ",
        "McDavid deflected a Bouchard point shot that bounced off Brossoit to the left side of the crease where Draisaitl shoveled in the rebound.Bouchard made it 2-0 with another power-play goal with a slap shot from above the right circle past a Hyman screen for his third goal of the playoffs.McDavid increased the lead to 3-0 at the 11:11 mark with a short-handed goal, stealing the puck from Shea Theodore at the blue line and then racing down the right wing before cutting in front of the net and sliding a one-armed shot through Brossoit's pads.",
        "Draisaitl scored his sixth goal in a four-period span to make it 4-0 when he put in a rebound of a Kailer Yamamoto shot into the left side of the net. It was Draisaitl's 13th goal over an eight-game span in the playoffs, the first time that has been accomplished since Kurri did it in 1985.Vegas, outshot 19-4 in the opening period, showed some signs of life early in the second period when defenseman Brayden McNabb rifled a shot from the high slot off the crossbar and Chandler Stephenson got loose on a breakaway that Skinner stopped with a pad save.McDavid then made it 5-0 midway through the period with his 26th career playoff goal on the power play, a bad-angle shot from just above the left goal line that caromed off Brossoit's right pad and inside the near post.The Golden Knights cut it to 5-1 at the 1:36 mark of the third period when Barbashev swatted a Mark Stone pass into the crease under the crossbar for his fourth goal of the playoffs."
    ]
}