{
    "articleURL": "/sciencetech/article-12046925/Terrifying-interactive-map-reveals-space-junk-orbiting-Earth.html",
    "content": [
        "Satellite monitoring and collision detection firm LeoLabs has map of space junkShows spent rockets, dead satellites and debris that is circling above our headsFrom spent rocket boosters to dead Soviet spy satellites, the sheer volume of space junk floating above our heads is scarcely believable.",
        "What's even harder to comprehend is that these 'ticking time bombs', as some of the debris has been dubbed, have all clogged up low-Earth orbit in less than 75 years.With more and more satellites being launched every day – including thousands from the likes of billionaires Elon Musk and Jeff Bezos – it is clear to see why governments and space agencies around the world are panicking.It's only going one way — and a terrifying interactive map reveals the scale of the problem.That's why treaties are hurriedly being drawn up by space-faring nations, while innovative start-ups are trying to come up with clever ways to remove all the junk left behind from sending probes, people and satellites into space since the 1950s.",
        "The map, which has been put together by satellite monitoring and collision detection firm LeoLabs, shows the space junk that is currently circling Earth in real time. ",
        "Rocket launches since 1957:  6,380Number of satellites in orbit: 15,430 Number still in space: 10,290 Number still functioning: 7,500Number of debris objects: 33,050Break-ups, explosions etc: 640 Mass of objects in orbit: 10,800 tons Prediction of the amount of debris in orbit using statistical models Over 10cm: 36,500 1cm to 10cm: 1,000,000 1mm to 1cm: 130 million Source: European Space Agency ",
        "From Elon Musk's Starlink satellites, to old Russian and Chinese rocket boosters and bits of debris from previous collisions, details are available in terms of the name of the rocket body, payload and debris, as well as its Perigee and Apogee (when it is closest to or furthest away from our planet).LeoLabs uses ground-based phased array radars — one in Alaska, one in Texas, two in New Zealand and two in Costa Rica — to monitor low Earth orbit.",
        "This allows the California-based company to track and measure any object that flies through its observational area. Its tracking system is also able to detect objects as small as 2 cm across, as opposed to the much larger 10 cm objects followed by others. You can scroll around the world and zoom in and out to see the debris floating over your country, while the LeoLabs even reveals the biggest culprits of putting it up there.The nation responsible for the most junk is the US, which is probably not surprising given NASA's success in the field of rocket launches and exploration, as well as the rising number of private American firms like Musk's SpaceX putting satellites in space.It has 8,497 objects such as rocket bodies, payloads and debris in low-Earth orbit, according to LeoLabs. Russia is next with 4,836, followed by China with 4,047. These three major players in space dwarf all other nations, although of course Europe has the European Space Agency (ESA) rather than individual countries putting up rockets.Relative newcomers India and Japan are responsible for 143 and 142 objects, respectively.Musk has faced intense scrutiny over his Starlink constellation.The satellites provide low-latency, high-speed internet at an affordable cost – often to remote areas without existing WiFi – and last year expanded to yachts, cruise ships and RVs. ",
        "But critics say his venture is hogging space, with both China and the European Space Agency taking aim at the billionaire. The Tesla founder has rubbished these fears, insisting that 'tens of billions' of spacecraft can orbit close to Earth and dismissing claims that his firm is 'squeezing out rivals in space'. Despite his reassurance, data shows that over half of all close encounters in orbit between objects are caused by SpaceX Starlink satellites — even with just 4,000 of a planned 12,000 launched so far. ",
        "It has also applied for approval to add another 30,000 on top of that. Bezos is also planning to put thousands of satellites into low-Earth orbit as part of Amazon's Project Kuiper.The project aims to provide broadband connections using a constellation of 3,236 satellites.But satellite operators such as SpaceX are constantly forced to make adjustments to avoid encounters with other spacecraft and pieces of debris. With thousands of Starlink satellites in orbit, the number of dangerous approaches will continue to grow, according to a study by the University of Southampton. Researchers found that Starlink satellites are involved in an average of 1,600 close encounters with other spacecraft every week, including some where the two objects come within about half a mile of each other.ESA estimates that there is more than 10,800 tons of space junk currently orbiting the Earth, including 200 so-called 'super-spreaders'. ",
        "These are large rocket bodies that have the potential to break into thousands of pieces and in turn create what is known as Kessler syndrome.",
        "This is a theoretical effect involving a runaway chain reaction of collisions that could create a cascade effect where each collision generates space debris that increases the likelihood of further collisions.",
        "The UK government last year announced a raft of new measures designed to drive sustainability in space and help clear up the millions of shards of debris clogging up near-Earth orbit.The measures include an 'Active Debris Removal' programme, which involves launching a new spacecraft to physically collect and destroy pieces of space junk floating around the Earth.The project, which will receive £5 million in funding from the UK government, is set to launch in 2026.It is not a new idea – private space companies such as ClearSpace and Astroscale are already building spacecraft to capture debris in near-Earth orbit. However, they are focused on removing just one bit of junk at a time.Britain wants to launch a spacecraft that is capable of capturing two dead satellites and forcing them back into Earth's atmosphere so they burn up.If successful, the first-of-its kind feat would prove that a single spacecraft can remove more than one piece of debris. The spacecraft could also potentially remain in orbit around the Earth, and be refuelled so that it can tackle more junk. ",
        "The phenomenon was popularised in the 2013 film Gravity, starring Sandra Bullock. Such is the enormity of the space junk problem, scientists have even warned there is a 10 per cent chance that a person could be struck and killed by a falling spacecraft or spent rocket booster within the next decade. Swift action is therefore required to clean up the Earth's orbit, as well as to ensure future projects minimise their footprint through recyclable manufacturing, retrieving satellites and mitigating any debris. An estimated 15,430 satellites have been launched into orbit since 1957, according to the European Space Agency, with 10,290 remaining in space and 7,500 still functioning.The total mass of all objects in orbit is said to equate to around 10,800 tons, while statistical models suggests there are 130 million pieces of debris from 1mm to 1cm in size.Some of the biggest objects of concern are spent Russian rocket boosters launched between 1992 and 2001.They include 18 examples of the nine-ton, 36ft (11m)-long upper stage of a Russian Zenit rocket, which are currently lurking in what has been termed a 'bad neighbourhood' around 520 miles (840km) high.'They're like a big yellow school bus without a driver, without brakes,' said Darren McKnight, a senior technical fellow at LeoLabs.",
        "There has also been a lot of controversy over China's Long March 5B rockets, which are of great concern due to their size.Just last year, there were warnings that debris from one out-of-control Long March booster could come down over a populated area. Fortunately it crashed to Earth over the Indian and Pacific oceans, but this rocket will not be the last of its kind that causes alarm. ",
        "Jonathan McDowell, an astrophysicist at the Harvard-Smithsonian Center for Astrophysics, told MailOnline the Long March 5B boosters were among 'the most worrying' because they are so large.The problem with China's rockets is rooted in the risky design of the country's launch process.Usually, discarded rocket stages re-enter the atmosphere soon after lift off, normally over water, and don't go into orbit. But the Long March 5B rocket does.There have been calls by NASA for the Chinese space agency to design rockets to disintegrate into smaller pieces upon re-entry, as is the international norm. But Beijing has previously rejected accusations of irresponsibility, with the Chinese Foreign Ministry saying the likelihood of damage to anything or anyone on the ground is 'extremely low'.",
        "There are an estimated 170 million pieces of so-called 'space junk' - left behind after missions that can be as big as spent rocket stages or as small as paint flakes - in orbit alongside some US$700 billion (£555bn) of space infrastructure.But only 27,000 are tracked, and with the fragments able to travel at speeds above 16,777 mph (27,000kmh), even tiny pieces could seriously damage or destroy satellites.However, traditional gripping methods don't work in space, as suction cups do not function in a vacuum and temperatures are too cold for substances like tape and glue.Grippers based around magnets are useless because most of the debris in orbit around Earth is not magnetic.",
        "Most proposed solutions, including debris harpoons, either require or cause forceful interaction with the debris, which could push those objects in unintended, unpredictable directions.Scientists point to two events that have badly worsened the problem of space junk.The first was in February 2009, when an Iridium telecoms satellite and Kosmos-2251, a Russian military satellite, accidentally collided.The second was in January 2007, when China tested an anti-satellite weapon on an old Fengyun weather satellite.Experts also pointed to two sites that have become worryingly cluttered.One is low Earth orbit which is used by satnav satellites, the ISS, China's manned missions and the Hubble telescope, among others.The other is in geostationary orbit, and is used by communications, weather and surveillance satellites that must maintain a fixed position relative to Earth. "
    ]
}