{
    "articleURL": "/news/article-12041745/Pictured-Knifeman-suspicious-package-triggered-Buckingham-Palace-security-scare.html",
    "content": [
        "The man had a mental health assessment and is said to be fit to be interviewedThe man who sparked a Buckingham Palace security scare last night by throwing shotgun cartridges over the gates was allegedly armed with a knife and warned officers his rucksack should be 'handled carefully', Scotland Yard has revealed.",
        "David Huber, 60, is understood to be the man arrested after allegedly approaching the gates and chucking items into the palace grounds.The Sun claims Huber travelled to London from his remote Cumbrian cottage, where he breeds Hungarian Vizslas, for Charles's crowning on Saturday. It is reported that on the day Queen Elizabeth II died, he wrote on Facebook: 'It's a massive loss to all.'Deputy Assistant Commissioner Ade Adelekan said the man had approached officers asking to see a soldier at around 7.15pm on Tuesday. When they said that was not possible, the man allegedly began throwing shotgun cartridges over the gates. He was searched and allegedly found to be in possession of a lock knife, and was arrested on suspicion of possession of a knife and ammunition. During the arrest, the man told officers they should handle his rucksack with care, which led to a controlled explosion being carried out on the bag that could be heard live on GB News. Though neither the King nor Queen were in residence, Camilla's grandchildren had been seen arriving at Buckingham Palace hours before - while Charles had held an audience with Australian Prime Minister Anthony Albanese earlier in the day. Mr Adelekan said the suspect was detained within seconds and arrested within five minutes. He said he had no knowledge of reports that the man had been shouting that he wanted to kill the King before he was arrested.",
        "The suspect has undergone a mental health assessment and has been deemed fit to be interviewed. Scotland Yard is not treating the incident as terror-related.",
        "Former head of Royal Protection Dai Davies warned the threat of an attack is 'as high now as it's ever been' and said 'you can never drop your guard' when working for the Royal Family.Mr Davies told MailOnline: 'As we saw the police's response was adequate - but if he's been there for days, I would have hoped someone would have noticed him. It is essential to watch the characteristics of people and to take action immediately. I would be very very angry to anyone who didn't do that.'He added: 'If a police officer heard him, he would have had a duty to catch him and detain him under the Mental Health Act.'The security expert also issued a warning that the risk for a potential attack is very high, saying not just the palace could be targeted but also railway and Tube stations. He said it is vital for police to 'know their history' and make sure they are aware of previous attacks and attempts.'Of course, for hundreds of years you might expect protesters at events such as this but never before have activists been able to organise on the scale of groups such as Just Stop Oil and Extinction Rebellion,' he added.",
        "'There are considerable groups that pose a threat. Often it is the lone wolf that wants publicity. This incident indicates that the police are on full alert.'",
        "Though neither the King nor Queen were in residence at the time, Camilla's grandchildren had been seen arriving at Buckingham Palace hours before - while Charles himself had held an audience with Australian Prime Minister Anthony Albanese earlier in the day.King Charles reportedly left the palace just minutes before the incident took place, The Sun reported. Police carried out a precautionary controlled explosion which could be heard live on GB News, while cordons were put up in the area. Scotland Yard is not treating the incident as terror-related, and it understood it is being treated as an isolated mental health incident.The suspicious bag that was found held two passports, a phone, wallet, keys, bank cards, laptop case, picture of a child, and a large brown letter, according to The Sun. There was also a copy of the book The Happiness Advantage by Harvard lecturer Shawn Achor. ",
        "Minister Tom Tugendhat this morning appeared to play down concerns about the scare and insisted 'we are in no way complacent' about the security challenge posed by the Coronation on Saturday.He told Times Radio: 'The police are, to put it mildly, all over it, and our intelligence and other security forces are extremely aware of the challenge that we face. What we've been planning for a number of months now is one of the most important security operations that the country has put into plan.'",
        "The arrest comes as a ring of steel is expected in the capital for the Coronation at Westminster Abbey.Witnesses said the man was seen throwing a 'number of items' in the residence grounds before he was arrested.Footage shows how the handcuffed suspect hung his head as officers took him into custody. Police later carried out a controlled explosion on a suspicious bag as a precaution."
    ]
}