{
    "articleURL": "/news/article-12051959/All-kings-horses-Gentle-giant-shire-drum-horses-equine-stars-Charles-today.html",
    "content": [
        "Shire horses Apollo and Atlas will head the procession from Buckingham Palace The horses which each weigh around 800kgs carry the military rank of MajorTwo ‘gentle giant’ drum horses are set to be the equine stars of the show as King Charles makes his way to his Coronation today.",
        "The shire horses called Apollo and Atlas, each carrying a rider and two drums, will lead out the Household Cavalry Mounted Band which will head the procession from Buckingham Palace to the historic ceremony at Westminster Abbey.The horses which each weigh around 800kgs carry the military rank of Major making them the most senior animals in the British Army.The pair are described as ‘big friendly giants’, chosen for their important role because of their ‘gentle’ temperament.They will be at the front of the Mounted Band which features a total of 48 soldier musicians on horseback, playing eight marches on the 1.3 mile route lined with service personnel.",
        "The spectacle of the drum horses leading the procession will be the first thing seen by spectators on the route and the millions of people around the world who are expected to watch on television.Following behind the Band will be The Sovereign’s Escort, consisting of four Divisions of Cavalry from the Household Cavalry Mounted Regiment, escorting King Charles and Queen Camilla in the Diamond Jubilee State coach.Each Division will consist of 24 horses and riders. Two Divisions of the Blues and Royals will be at the front of the carriage with two from the Life Guards bringing up the rear.",
        "Little is known about Atlas, although his presence in the parade has been confirmed in Ministry of Defence briefings.But Apollo is known to have plenty of experience of Royal occasions, having made his debut at the Windsor horse show which was part of the late Queen’s Platinum Jubilee celebrations last May.The nine-year-old horse which is 17 hands (68 inches) tall and his rider Lance Corporal Chris Diggle also led the Queen’s funeral procession last September.Lance Corporal Diggle, from Yorkshire, rode Apollo with reins attached to his feet as he held drumsticks for his two solid silver drums in his hands.But he did not use them to beat the drums during the Queen’s funeral march due to the solemnity of the procession.Speaking before the funeral procession, Lance Corporal Diggle admitted that Apollo ‘loves attention’.He added: ‘He's a big lad, gentle giant that he is, but he does have his quirks - he can be naughty like most horses but he is lovely on the whole.'He is really gentle, he is the most placid horse and that's why he is on today because he is so well behaved.’Drum horses normally take three years to train for their ceremonial role on State occasions – but Apollo was judged to be ready after just two years.",
        "Lance Corporal Diggle said: 'Some take longer than others and get on with it really well.'It's because of all the kit that they carry and the drums banging, some get through quicker, and some of it's just a lot slower for them.'Apollo joined the Household Cavalry in 2019 from the Dyfed Shire Horse Farm based in Pembrokeshire which has now provided three horses to the Household Cavalry Regiment.The horse was known as Ed during his time on the farm, and is still remembered fondly by staff.The farm’s Mark Cole said: ‘Ed is the most calm, laid back and relaxed of the gentle giant breed. We know that he will go on to do great things in London.’Apollo had his first brush with royalty in 2018, when he pulled a cart carrying the now Queen Consort, not flinching when she took his reins and drove like a pro on a visit to the farm.The farm’s founder Enid Cole spoke of her pride at Apollo’s role in the Coronation parade, saying: ‘It’s an honour for us.’She added in an interview with the Western Telegraph: ‘We are very proud. It is quite an accolade. We are only a small business in the sticks but we have sent three horses to the Royal Household in London.’",
        "Drum Horses belong to the sovereign and permissions must be sought from the monarch for their tails and mane to be clipped.The two horses are also expected to play a role in the much larger procession back to Buckingham Palace after the Coronation."
    ]
}