{
    "articleURL": "/wires/reuters/article-12041511/MORNING-BID-AMERICAS-Bank-reverb-frames-Fed-decision.html",
    "content": [
        "A look at the day ahead in U.S. and global markets from Mike Dolan Markets finally worked out May might be a bit bumpy after all.",
        "Another echo of March's bank stock stress on Tuesday along with the alarming prospect of the U.S. government running out of cash in less than a month was enough to finally jolt markets out of a recent slumber.And that reassessment of risk and implied volatility frame Wednesday's pivotal Federal Reserve policy decision - potentially its last interest rate rise of a brutal year-long tightening campaign.While there was some minor repricing of Fed probabilities in the futures market, the latest bout of bank stock nerves is unlikely to change the Fed's course on its own.Another quarter-point rate rise on Wednesday is still the best guess and the Fed is most likely to reiterate a wait-and-see stance on what happens after that - without committing either way on this week's move being the final hike.The bar is still high to justify futures market pricing of almost 75 basis points of cuts between today's hike and the end of the year.Another one-day wobble in regional bank stocks probably isn't enough to square that circle - even though the regional KBW bank stock index saw its biggest daily drop on Tuesday since the height of the March banking stress as First Republic at the weekend became the latest lender to be wound down, and eventually sold to JPMorgan.",
        "Pressure from government probably won't go down well among Fed policymakers. A White House economist on Tuesday said Fed rate hikes were having a negative impact on the banking sector.What may shift the dial for the Fed is the extent to which the banking troubles are squeezing lending to the wider economy. The Fed's own quarterly loan officer survey is due next week and policymakers will likely have some idea what that indicates already.Signs of some loosening of a very tight labor market may also encourage the Fed that its rate hiking job is done after this week. Even though the April employment report is not due until Friday, March numbers released yesterday showed the ratio of job openings to unemployed job seekers fell for the fourth consecutive month and hit the lowest level since October 2021.Private sector job readings for April are due later today along with service sector surveys for the month.Another slide in crude oil prices this week to their lowest in more than a month will also foster disinflation hopes. Oil prices have now dropped 6% in just three weeks and the year-on-year recoil is still running at almost 30%.But perhaps as important on the immediate horizon for markets and the Fed is how the U.S. debt ceiling standoff gets resolved, now that the 'X date' when government cash runs out and a possible sovereign debt default looms has been put at June 1.",
        "U.S. President Joe Biden on Monday summoned the four Senate and House of Representatives leaders - two fellow Democrats and two Republicans - to the White House on May 9 to help resolve the issue.U.S. Treasury bill yields that come due around June continued to gyrate. The yield on the 2-month Treasury bill, which matures on June 27, rose 27 bps to 5.254% on Wednesday.With the Fed in view alongside the debt ceiling crunch and bank stock retreat, longer-term Treasury bonds rallied. Two-year yields slipped back to 3.92%.With much of Asia on holiday, European stocks and Wall St futures were higher ahead of the U.S. open.The VIX index of implied volatility jumped back sharply from 18-month lows on Tuesday, but it remains more than a point below 30-year averages.As the first-quarter earnings season progresses, estimates of the aggregate annual drop in S&amp;amp;P500 earnings continue to recede to just 1.4% compared to more than 5% a month ago - spurring some to suggest a second straight quarter of contracting earnings could now be avoided.Elsewhere, there were few signs of March banking stress spilling over to euro zone banks. Shares in Italy's UniCredit jumped 5% as the lender raised its financial targets for the year after posting stronger-than-expected results.",
        "And Hindenburg Research, the short seller whose reports on companies have erased big chunks of their value, criticized Icahn Enterprises on Tuesday over the reporting of its finances - leading to a 20% drop in the shares of activist investor Carl Icahn's firm. Events to watch for on Wednesday: * U.S. April ADP private sector payrolls report, April ISM service sector survey * U.S. Federal Reserve's Federal Open Market Committee policy decision, statement and news conference * U.S. corp earnings: Kraft Heinz, Marathon Oil, MetLife, Qualcomm, Albemarle, Ingersoll Rand, Estee Lauder, Yum! Brands, CVS Health, Emerson Electric, Mosaic, Congnizant Technology, Atmost Energy, Realty Income, Aquinix, Allstate, ETSY, Eversource Energy etc(By Mike Dolan, editing by Christina Fincher, mike.dolan@thomsonreuters.com. Twitter: @reutersMikeD)"
    ]
}