{
    "articleURL": "/tvshowbiz/article-12058149/The-Project-host-Sarah-Harris-rumours-dating-Dr-Chris-Brown.html",
    "content": [
        "The Project host Sarah Harris has denied she is dating Dr Chris Brown.",
        "The 41-year-old, who announced her split from ex-husband Tom Ward in March 2021, was grilled about the rumours on The Kyle and Jackie O Show on Monday.Radio presenters Kyle Sandilands and Jackie 'O' Henderson weren't convinced by the reports so called up Harris live on air to get answers.'Oh, my God, you two!' said a surprised Harris after picking up the phone.When asked if she was 'sleeping with' the Bondi Vet star, 44, the journalist said, 'No!'",
        "She then revealed members of her family had been calling her ever since The Sunday Telegraph reported she was dating Brown.'You know my aunt called and checked as well. No, it's hogwash,' she said, adding that she had 'no idea' where the tabloids got the story from. 'I haven't even had my second coffee yet, you two,' Sarah laughed. 'I'm too busy and boring [for this].'",
        "Brown is yet to comment on the rumours. Kyle and Jackie O did attempt to call him on air on Monday, but he didn't pick up. The I'm a Celebrity host, who previously dated TV presenter Roz Kelly in 2012 and actress Kassandra Clementi in 2014, is known to keep his love life under wraps.His last relationship was with influencer Brooke Meredith from 2020 to 2022.",
        "Back in April, Brown told the Something to Talk About podcast he prefers not to open his love life to public scrutiny.",
        "'The challenge is that it's hard enough to meet the right person anyway,' he said.'That extra layer of speculation and interest… once you're actually in a relationship it's easy, but it's meeting that person at the start that's really hard.'",
        "Brown, who has quit Channel Ten and will join the Seven Network in July, said that media speculation about his romantic interests is 'funny' to him, but can be a lot to handle for his loved ones.Meanwhile, Harris announced her split from IT specialist husband Tom Ward in March 2021, after seven years of marriage.The former couple share custody of sons Paul, seven, and Harry, five."
    ]
}