{
    "articleURL": "/money/markets/article-12051963/BA-owner-banking-summer-travel-spree.html",
    "content": [
        "IAG made profits of £8m in the first three months of the yearThat was its first profit in the January to March quarter since 2019 Marked improvement on the £648m loss in the same period of 2022 The owner of British Airways is pinning its hopes on a summer holiday booking frenzy as it cashes in on booming demand for travel.",
        "IAG, which is also the parent company of Iberia, Aer Lingus and Vueling, made profits of £8m in the first three months of the year.That was its first profit in the January to March quarter since 2019, and a marked improvement on the £648m loss in the same period of 2022.The journey back to the black was driven by high demand for holidays combined with lower fuel prices.IAG flew 24m passengers in the first three months of this year, compared to 14m in the same period last year.",
        "It said there were 'healthy forward bookings' for the summer, echoing the easyJet and Tui bosses who recently posted their own sunny outlooks.And it now expects annual profits to come in at the top end of its previous guidance, flying above £2billion for 2023, representing a 90 per cent jump on last year.'All our airlines performed above expectations,' said chief executive Luis Gallego.The update sent shares up 2.3 per cent, or 3.4p, to 150.5p on investor hopes this strong performance plays out for the rest of the year. But the stock is still down over 60pc since the start of 2020, however, having been hammered when planes were grounded in the pandemic.Liberum analysts said the numbers were 'surprisingly strong' in the face of cost-of-living woes, which would potentially put travellers off jetting away. But IAG expects to fly 97 per cent of its 2019 capacity this year, with destinations such as Barcelona, Amsterdam and Malaga leading the way.",
        "Transatlantic flights were up 63 per cent on last year and around 2 per cent on 2019 for BA, with tourists eyeing trips to Las Vegas, Orlando and New York.Yet business flights, which BA is known for among City high-flyers and captains of industry, continue to drag.Business travel volumes are still only at 70 per cent of 2019 levels, with remote work and the continued use of video conferencing tools leaving noticeable gaps in corporate bookings.And despite the upbeat reaction from investors, Richard Hunter, analyst at Interactive Investor, said IAG's full road to recovery was a 'long-haul journey' with the real test being how it fares towards the end of the year. IAG must also grapple with the potential impact of French air traffic control strikes, which have caused major disruption.BA cancelled 300 flights at Easter due to strikes by airport security staff in the UK, something which is set to continue into this summer.But airlines and holiday companies have reported robust summer interest.Last month easyJet lifted profit expectations on the back of 'strong' summer bookings, in the latest sign that demand is holding up despite the cost-of-living crisis.Passenger numbers reached 15.6m during the first three months of the year, up by more than a third from 11.6m during the same period in 2022.",
        "Fellow budget airline Tui also said customers were unwilling to give up holidays after reporting strong Easter bookings.",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}