{
    "articleURL": "/sport/football/article-12050717/Erik-ten-Hag-tells-Man-Uniteds-Antony-dont-stay-focused-game.html",
    "content": [
        "Brazilian forward Antony cost Manchester United £82million over the summer Erik ten Hag claimed that his player's passionate playing style is a strength  Antony receives a yellow card for a rash challenge that sparked an on-field spatErik ten Hag has reminded Manchester United winger Antony to control his emotions on the pitch, but insists the Brazilian needs to play with passion.",
        "United’s £82million summer signing was booked for fouling Brighton’s Alexis Mac Allister and then becoming embroiled in a spat with Lewis Dunk when Ten Hag’s side lost 1-0 at the Amex Stadium on Thursday night.The United boss was critical of Antony for riling Sevilla players in the first leg of the Europa League quarter-final at Old Trafford last month, telling the 23-year-old that he had ‘warmed up’ the opposition.But Ten Hag accepts that Antony’s fiery temperament is part of his game, and is comfortable with that as long as he is able to keep his emotions in check.‘Passion is a strength,’ said the Dutchman. ‘Of course, until a certain level you have to control it. You need passion and desire to win your battles in the game.",
        "‘It is very strong with him and he is very ambitious. Don't go over the top: stay focused on your game and what the game needs. If he does that, he is a great player. I think his improvement is quite obvious and clear.’United are aiming to bounce back from the Brighton defeat when they face West Ham at the London Stadium on Sunday night.Ten Hag is looking forward to taking on David Moyes for the third time this season having beaten the former United boss twice at Old Trafford in the Premier League and FA Cup.",
        "‘It is an experience,’ added Ten Hag. ‘He is a fantastic manager, so long in the Premier League already. I am looking forward to it. We've faced them twice already this season, and it’s going to be another great game. Every game is a battle and a challenge so we have to be ready.’"
    ]
}