{
    "articleURL": "/tvshowbiz/article-12060867/John-Farnhams-family-says-Aussie-singer-recovery-recent-chest-infection.html",
    "content": [
        "Singer has recovered from latest health scareDoco about his life will premiere this weekThe family of John Farnham has provided a hopeful update on the Aussie legendary singer's health weeks after he was rushed to hospital.",
        "The 73-year-old was admitted to hospital in late March as he battled a chest infection.The latest health scare came seven months after Farnham underwent major surgery to remove a cancerous growth in his mouth.The 'You're The Voice' singer has since made a full recovery from the chest infection and is now 'comfortable' as he continues ongoing treatment.His wife Jill and sons Rob and James thanked doctors for his care releasing a statement on Monday night.",
        "'We're pleased to say that John made a full recovery from a recent chest infection in late March which required hospitalisation,' it read.'He is now comfortable and continues to receive ongoing treatment and rehabilitation care.'The family would like to reiterate their appreciation and deepest respect for all the medical staff that have attended to John over the past eight months and the many thousands of kind messages that (have) been received from across Australia and the world.'Gaynor Wheatley, the wife of Farnham's late music manager and friend, Glenn Wheatley spoke to 2GB'His chest infection has cleared. He's okay,' she said.Farnham underwent a grueling 12-hour surgery by 26 surgeons in August to remove a cancerous tumour from his mouth and part of his jaw.  He was placed in intensive care for more than a week following his surgery.",
        "Farnham only discovered he had the cancerous growth in his mouth after his wife insisted on taking him to the doctor for a check-up.The latest update on his recovery came hours before the premiere of a documentary about the singer's life.'John Farnham: Finding the Voice' will hit cinemas next week with a premiere to be held in Melbourne on Tuesday night and in Sydney later this week.Farnham's wife will make a rare pubic appearance at Tuesday night's premiere.'It's Jill's first time basically out tonight in front of the media,' Gaynor told Fordham.",
        "The trailer is filled with famous faces, including Celine Dion, Robbie Williams, Olivia Newton-John, Richard Thompson, Jimmy Barnes and Richard Marx. The biopic tells the untold story of Farnham's life from the quiet suburbs of Melbourne to early pop fame in the 1960s, the incredible highs and lows that followed to his record-breaking success after the release of the Whispering Jack album in 1986.In never-before-seen footage, John talks about his financial struggles, having depression, and fighting against people who didn't believe he could be a star again.'Either I was working or asleep, so when I was awake I was vulnerable,' Farnham says in the trailer. 'People never saw me as a credible singer.'",
        "The singer admitted that after his teen stardom had faded, his wife Jill suggested they treat themselves and their son Rob to dinner at McDonalds. With a tear in his eye, he explained: 'I actually couldn't take them. We didn't have the money.'",
        "In an interview with last month's issue of The Australian Women's Weekly, Robert and James Farnham detailed their father's bravery and resilience.'You have to keep positive and not get bogged down,' Robert, 43, said.'It's cruel and brutal but they're the cards you're dealt in life and cancer doesn't care who you are.'John's sons said they were incredibly proud of their father.'He's inspiring us every day, but then again, he always has,' Rob added. "
    ]
}