{
    "articleURL": "/tvshowbiz/article-12039939/Christine-McGuinness-displays-toned-black-halter-neck-dress-watches-sunset.html",
    "content": [
        "Christine McGuinness showcased her toned back as she watched the sunset during her idyllic getaway on Tuesday.",
        "The model, 35, slipped into a black halter neck dress for the Instagram snaps, which perfectly highlighted her slim figure and bronzed tan.Christine was sure to set pulses racing as she showed off a hint of sideboob after going braless beneath the slinky summer dress. In another shot, Christine turned to the camera and beamed away while sitting on a sun bed.The beauty looked radiant as she basked in the sunshine while taking in the stunning view.",
        "She tied her blonde locks into a ponytail for the day, while highlighting her features with a sleek make-up palette. Captioning her snaps, Christine shared a thoughtful quote which read; 'We all have two lives, the second starts when we realise we only have one.' It comes after Christine looked nothing short of sensational as she showed off her incredible figure during her recent getaway on social media.The TV personality flaunted her frame in a skimpy black bikini as she posed up a storm in front of the mirror of her lavish hotel room during the getaway.The mother of three worked her angles as she held a hand up to her blonde locks, which were styled in a high ponytail.Christine's snap came just before she stripped off for a topless photograph beside the pool, sporting just a pair of bikini bottoms.",
        "The thong-style bottoms showcased her peachy bottom as she flashed plenty of sideboob in the jaw-dropping image. Clearly having the time of her life, Christine posed with her arms in the air, flashing a backwards peace sign to the camera.",
        "The backdrop in Christine's saucy snap was a swimming pool surrounded by plush loungers, looking out onto the sea and cloudless blue sky.It is unclear who the TV personality is holidaying with, but she was recently pictured putting on a cosy display with her pal Chelcee Grimes.The close friends couldn't hide their excitement as they met up in Liverpool during the Bank Holiday weekend.Christine and Chelcee, who were spotted kissing and walking hand in hand at a night out together in London in December, met up at Ten Streets Socials bank holiday club event and filmed the female dancers there.The duo, who have been pictured publicly on a number of occasions following Christina's split from husband Paddy, were thrilled to see one another and embraced each other at the event."
    ]
}