{
    "articleURL": "/health/article-12041515/Lilly-drug-slows-Alzheimers-progression-35-trial.html",
    "content": [
        "Donanemab slowed Alzheimer's progression in patients by 35 percent in trialDoctors said the results were 'very exciting' and 'quite meaningful' READ MORE: US becomes first country in the world to approve LecanemabAn experimental Alzheimer's drug developed by Eli Lilly slows cognitive decline by more than a third, the company has said.",
        "In a phase 3 trial, donanemab slowed down the decline in patients' ability to think clearly and perform daily tasks by 35 percent compared to a placebo.The medicine works by clearing plaque clusters from the brain known as amyloid, which are closely associated with Alzheimer's disease.Eli Lilly plans to apply to the Food and Drug Administration (FDA) for approval by June, raising hopes that this could become the third approved Alzheimer's drug — after decades without an effective treatment.",
        "Dr Eric Reiman, executive director of the Banner Alzheimer's Institute, heralded the results as 'very exciting'. Dr Paresh Malhotra, a clinical neurologist at Imperial College London in the UK, added that the results were 'encouraging' and provided 'even further evidence' that treatments reducing amyloid in the brain slowed the progress of Alzheimer's.But Dr Jina Swartz, a neuroscientist at a Pennsylvania finance union's research laboratories, raised concerns over the side effects.",
        "The drug — administered every two weeks via infusion — was shown to slow the progression of cognitive decline by more than a quarter in patients with early stage Alzheimer's. ",
        "'The results look very impressive,' she said, 'although the side effect profile... remains concerning (to me, both as a neurologist clinician and a drug developer).'Eli Lilly recruited 1,700 people aged between 60 and 85 years old who had early-stage Alzheimer's disease. They were from eight countries, including the US, UK and Australia.",
        "All participants also had build-ups of amyloid and tau proteins in their brains, which were confirmed by scans.Participants were then randomized to receive either a monthly intravenous injection of donanemab or a placebo for up to 18 months. Treatment was stopped when it emerged that the amyloid plaques had been cleared.There were three fatalities, two of which were linked to serious adverse reactions from donanemab, such as brain swelling and microhemorrhages.Nearly a third of participants (31.4 percent) experienced a brain bleed, while about a quarter suffered brain swelling.Donanemab is administered to patients via once-a-month intravenous injections for up to 18 months, or until the amyloid clusters in the brain have been cleared.The drug is a monoclonal antibody, a man-made protein that binds to amyloid clusters in the brain, prompting other cells to remove them.Donanemab is not a silver bullet for curing Alzheimer's, but researchers argue that clearing these protein clumps can slow the disease.Previous research has shown that the clumps are toxic to neighboring cells, disrupting their function and leading to cell death.A cost for the drug is yet to be revealed, but researchers have suggested it will be priced at $1,600 per dose or $20,000 annually.",
        "Donanemab has been heralded as an 'encouraging' development in the fight against Alzheimer's disease after data showed it slowed the progression of the condition by 35 percent.The drug is a monoclonal antibody, a man-made protein that acts like an antibody.It is administered to patients via an intravenous injection and then travels to the brain.Once inside the organ, it binds to amyloid clumps that are already present.This then prompts other cells, called microglia which are responsible for maintaining neurons, to clear them.Researchers say that removing amyloid can help slow the progression of Alzheimer's disease, arguing that the clumps are toxic and disrupt communication between cells.About 90 percent of Alzheimer's patients have amyloid clumps in their brains. But studies have also found that the clumps can be present in the brains of people who do not have the condition.Scientists are still not certain what causes Alzheimer's disease, but another theory gaining traction is that it is linked to damage to blood vessels within the brain.",
        "The study also looked at 552 participants who had high levels of tau proteins in their brains.In this group, the disease progressed 22 percent more slowly based on an Eli Lilly-developed scale measuring Alzheimer's progression.On a separate scale more commonly used in clinical settings, the progression of the disease slowed by 29 percent.Results also showed that half of the participants had no amyloid plaques in their brains 12 months after starting the trial.A year after the trial began, 47 percent of those in the donanemab group had no disease progression at all compared to 29 percent in the placebo group.Billions of dollars have been poured into researching potential treatments for Alzheimer's.Researchers have focused on targeting drugs at amyloid proteins, which have been blamed for the disease.But evidence suggests other factors, such as damage to blood vessels within the brain may also cause it.About 90 percent of Alzheimer's patients have amyloid plaques in their brains, studies suggest. But others develop the disease without these ever emerging.Other theories suggest that the disease may, in fact, be caused by damage to blood vessels in the brain. Research is also ongoing into how to prevent the disease, which suggests that exercising regularly, eating a healthy diet and sleeping for at least seven hours per night can all help to prevent the condition. ",
        "Eli Lilly's drug, if approved, will be the third to come onto the market for fighting Alzheimer's.The FDA has already approved Leqembi, which trials showed slowed the progression of Alzheimer's disease by 27 percent over 18 months.They have also given the green light to Aduhelm, which trials showed could reduce amyloid plaques in the brain but not slow the disease.Medics and insurers have been loth to pick up the drugs however because of controversy over their approval process.Aduhelm was cleared after an 'accelerated approval' process that an investigation said was too close to its developer Biogen. A Congressional report said the process was 'rife with irregularities'.Medicaid has also refused to cover the controversial drug amid concerns over how well it works.The controversy over Aduhelm has also rubbed off on Leqembi, which was developed by the Japanese company Eisai alongside Biogen.Alzheimer's is a growing concern in the US, with the number of patients expected to double from six to 13million by 2050.Dr Daniel Skovronsky, Lilly's chief scientific officer, said of the trial results for donanemab: 'We are extremely pleased that donanemab yielded positive clinical results with compelling statistical significance for people with Alzheimer's disease in this trial.'This is the first phase three trial of any investigational medicine for Alzheimer's disease to deliver 35 percent slowing of clinical and functional decline.'",
        "Dr Mark Mintun, the vice president of neuroscience at Lilly, added: 'We are encouraged by the potential clinical benefits that donanemab may provide.'Although, like many effective treatments for debilitating and fatal diseases, there are associated risks that may be serious and life-threatening.'"
    ]
}