{
    "articleURL": "/wires/reuters/article-12039577/Clorox-rethinks-strategy-Kingsford-charcoal-ahead-summer-grilling-season.html",
    "content": [
        "By Jessica DiNapoli",
        "NEW YORK, May 2 (Reuters) -Clorox Co is revamping its sales plans for its Kingsford grilling briquettes and pellets, staples at summer barbecues across the United States, after hiking prices and losing market share to competitors, an executive told Reuters on Tuesday.The Oakland, California-based company bumped up prices on Kingsford charcoal in December along with other products it makes ranging from bleach to natural cosmetics, Chief Financial Officer Kevin Jacobsen said.But its competitors in grilling, including store brands, did not follow suit, making Kingsford far more expensive than similar products ahead of major summer cookout occasions including the Memorial Day and Independence Day U.S. holidays.For example, an 8-pound bag of Kingsford Original Charcoal briquettes costs $7.92 on Walmart Inc's website, while a 16-pound bag of the retailer's Expert Grill briquettes costs $7.88.\"You don't get it right in every country, every category,\" Jacobsen said. \"We're going back and making some adjustments.\"The misstep means Clorox's team focused on the brand is revising its marketing plans, Jacobsen said.\"We have to invest some more money here,\" he added, saying Clorox would work with retailers to better feature the product in stores in hopes it will boost sales despite the steep prices.Half of Kingsford's sales come in the three months ended June 30, Jacobsen said, adding that Clorox's financial results that quarter could be hit if the brand does not perform.",
        "\"(Kingsford) did not deliver what we expected,\" Jacobsen said, referring to its sales in the three months ended March 31. \"What we´re seeing is increased competitive activity early in the season in the grilling category.\"Clorox's competitors in its other categories closely followed the price hikes it announced in December, Jacobsen said.U.S. consumers have been accepting double-digit price increases on everyday basics although some major manufacturers, including Clorox, have seen their sales volumes fall.(Reporting by Jessica DiNapoli in New York Editing by Matthew Lewis)"
    ]
}