{
    "articleURL": "/wires/ap/article-12044825/Jim-nez-hits-tiebreaking-single-White-Sox-beat-Twins-6-4.html",
    "content": [
        "CHICAGO (AP) - Keynan Middleton finished his first save since 2021 when Carlos Correa struck out swinging on a 96.2 mph fastball.",
        "That last out was particularly sweet for Middleton.\"I knew I was going to face Correa, and I don't like him. So it was kind of cool,\" he said. \"I like that. I enjoyed that a lot. ... I mean, he's a cheater.\"Middleton closed out a strong effort by Chicago's bullpen and Eloy Jiménez hit a tiebreaking RBI single in the seventh inning, leading the White Sox over the Minnesota Twins 6-4 on Wednesday night.Luis Robert Jr. homered as Chicago secured its first series win of the season. Tim Anderson and Yasmani Grandal each had three hits in the team's third straight victory.The White Sox will try for a three-game series sweep Thursday afternoon. They dropped 10 in a row before their win streak.",
        "\"We´ve had a lot of guys step up the last couple of days,\" said Dylan Cease, who pitched five innings of four-run ball.Correa had two RBIs for Minnesota, and Nick Gordon homered for the second straight day.Correa played for Houston when it was disciplined by Major League Baseball after it found the team used electronics to steal signs during its run to the 2017 World Series title and again in the 2018 season.Middleton played in the AL West for his first five years in the majors, competing against Correa and the Astros. The right-hander is off to a solid start in his first season with Chicago, pitching 1 1/3 scoreless innings in a 3-2 victory against the Twins on Tuesday night.",
        "\"He wants to pitch every single day,\" Chicago manager Pedro Grifol said. \"We´re the ones that have to tell him you´re down today. He loves the moment.\"Jiménez drove in Andrew Benintendi with his single to left against Griffin Jax (1-3). The White Sox added an insurance run in the eighth when pinch-runner Billy Hamilton scored from second on Elvis Andrus' grounder to second.Aaron Bummer, Gregory Santos (1-0), Kendall Graveman and Middleton combined for four scoreless innings in relief of Cease. Santos earned his first major league win after working out of a bases-loaded, no-out jam in the top of the seventh.\"There's no one to blame,\" Minnesota manager Rocco Baldelli said. \"We can look in the mirror today and say we just needed more from ourselves, and that's really everywhere you look.\"Louie Varland made his second start of the season for Minnesota, stepping into the rotation after Tyler Mahle was sidelined by an elbow injury. The rookie right-hander allowed four runs and seven hits in 4 2/3 innings.The big blow was Robert's first homer since April 11, a three-run drive to center in the first. The slugging center fielder hit just .129 (9 for 70) in his previous 20 games.\"I didn´t have my best stuff that first inning,\" Varland said. \"I believe I bounced back a little bit and made it work.\"",
        "The Twins rallied with three two-out runs in the third. Correa hit a two-run double and scored on Byron Buxton's double.After Gordon homered in the top of the fourth, the White Sox tied it on Anderson's RBI single in the bottom half. Grandal was easily thrown out by right fielder Max Kepler when he tried to score from second on the liner to right.TRAINER'S ROOMTwins: Mahle was placed on the 15-day injured list to make room for Varland, who was recalled from Triple-A St. Paul. Mahle will be shut down for at least four weeks.White Sox: Closer Liam Hendriks is scheduled to begin a rehab assignment with Triple-A Charlotte on Friday night. Hendriks is coming back from stage 4 non-Hodgkin lymphoma. ... 3B Jake Burger departed after four innings because of left side discomfort. ... 3B Yoán Moncada (lower back soreness) has been ramping up his workouts. Grifol said they haven't decided when he might start a rehab appearance. ... LHP Garrett Crochet (Tommy John surgery) has another four or five rehab appearances before he could return to the majors, according to Grifol.UP NEXTRight-handers Pablo López (2-2, 4.00 ERA) and Lucas Giolito (1-2, 4.15 ERA) start the series finale. López is 1-2 with a 7.31 ERA in his last three starts for Minnesota. Giolito pitched 6 2/3 innings of two-run ball for Chicago in a no-decision against Tampa Bay last week.",
        "___Follow Jay Cohen at https://twitter.com/jcohenap___AP MLB: https://apnews.com/hub/MLB and https://twitter.com/AP_Sports"
    ]
}