{
    "articleURL": "/wires/pa/article-12052695/Joyful-coronation-powerful-celebration-diverse-nation-Archbishop-says.html",
    "content": [
        "The Archbishop of Canterbury has said the coronation serves as “a powerful reflection and celebration of who we are today, in all our wonderful diversity”.",
        "In a message issued on the eve of the historic occasion, Most Revd Justin Welby described the crowning of the King and Queen Camilla as “beautiful, joyful and historic”. He said people will be struck by the “majesty and sacred wonder” of the service, but also hoped they would find “ancient wisdom and new hope”.",
        "The Archbishop is conducting the service and has the momentous task of anointing and crowning Charles and Camilla in front of a global audience of millions during the live televised ceremony.Representatives from the nation’s faith communities will play an active role in the coronation of a British sovereign for the first time in history.When the regalia is presented to the King – Sikh, Hindu, Muslim and Jewish peers will take part, handing over items which do not have Christian meaning or symbolism.New ground has been broken in other areas, from the inclusion of female Bishops the first time, to the use of Welsh, Scottish Gaelic and Irish Gaelic languages and the opportunity for those watching around the globe to join in and swear allegiance to the King with the Homage of the People.Leaders from Jewish, Hindu, Sikh, Muslim and Buddhist groups will also deliver a greeting to the King in unison in the Abbey after the service.",
        "“The Coronation of King Charles III and Queen Camilla promises to be a beautiful, joyful and historic occasion,” the Archbishop said.",
        "“People can certainly expect to be struck by the majesty and sacred wonder of the service, but also to be invited to pause and reflect.“To reflect on our past, our future and, as we pray for our new sovereign, on our own lives and how we too are called to serve others.“This service reaches deep into our nation’s Christian history. From the ancient and sacred act of anointing monarchs, to the use of the sixth-century St Augustine Gospels, the service will link us in a profound way with our national story”.Charles III will be the 40th reigning monarch to be crowned in the Abbey when the golden bejewelled St Edward’s Crown is lowered onto his head at midday on Saturday.Every monarch since William the Conqueror in 1066 has had their coronation on the site, with the exception of Edward V – one of the disappeared Princes in the Tower – and the abdicated Edward VIII, whose coronations never happened.",
        "The Archbishop added: “But this is not simply history: I hope the service offers people an opportunity to hear the living words of God, which bring good news to every person in every generation.",
        "“I also hope and pray that the coronation will serve as a powerful reflection and celebration of who we are today, in all our wonderful diversity.“So I will be praying that everyone who shares in this service – in the Abbey, across the country and beyond – will find ancient wisdom and new hope.“I pray that it inspires us all, like the King and Queen, to live our lives in service to others.”"
    ]
}