{
    "articleURL": "/tvshowbiz/article-12038673/This-Oscar-nominated-movie-star-Hollywood-heartthrob-looks-unrecognizable-new-trailer.html",
    "content": [
        "He is a Hollywood heartthrob who has made waves in the acting world after notching up his very first Oscar nomination recently.",
        "But now, the actor in question could have his fan base scratching their heads after giving them a first glimpse at his latest role.In a new teaser for his new film released on Tuesday, the American performer can be seen with a bald head and shaved eyebrows making him difficult to recognize.From his terrifying stare it is clear that he will be playing a villain in the new sci-fi project - but can you guess who it is?",
        "It's Austin Butler, who is seen in a new teaser for the much-anticipated Dune: Part Two.Of course, fans fell in love with Austin for his role portraying Elvis Presley in the Baz Luhrmann biopic - but this is quite a different beast, as he plays the villainous Feyd-Rautha Harkonnen in the sci-fi sequel. The teaser trailer that was released Tuesday begins with an unidentified member of the Fremen (a sub-culture of humans descended from the Zensunni Wanderers) walking down a sand dune and placing a thumper device, used to attract sandworms, in the ground.After the device begins to function, the individual hurries back up the dune before the faces of several characters are shown, including Gurney Halleck, Lady Jessica and Feyd-Rautha. ",
        "An official poster for the feature was also released on Tuesday, which showed stars Timothee Chalamet and Zendaya, who portray Paul Atreides and Chani, respectively, holding crysknives and posing against a rising sun.",
        "Dune: Part Two, as well as its predecessor, were based on Frank Herbert's novel of the same name, which was originally published in 1965.The book is centered on Atreides, who moves to the desert planet Arrakis and becomes the leader of its native inhabitants as they wage war for control of their world.A large-scale film adaptation spearheaded by Alejandro Jodorowsky, known for directing features such as El Topo and The Holy Mountain, was developed in the mid-1970s, although the project eventually fell apart.",
        "Dune was later adapted into a feature by David Lynch and received negative reviews upon its 1984 release, although it has since become a cult classic. The novel was also the subject of a 2000 television adaptation, which was received positively by critics. Development on the 2021 feature began in the early 2010s, and Denis Villeneuve was confirmed as its director in 2017.The movie featured performances from an ensemble cast that included the likes of Oscar Isaac, Rebecca Ferguson and Jason Momoa, among numerous others.Dune eventually made its official debut during the 78th Venice International Film Festival in September of 2021, and the feature was also released to the public through the HBO Max streaming service, which greatly displeased Villeneuve.The movie was met with positive reviews from critics and currently holds an 83% rating on Rotten Tomatoes. ",
        "The cast and crew film also won numerous distinctions for their work on the project, which received six Academy Awards.Dune: Part Two was formally greenlit in October of 2021 and its team began filming the project in July of last year.",
        "In addition to Pugh and Butler, newcomers to the feature's cast include Cristopher Walken, Lea Seydoux and Florence Pugh. Although its premiere date was shuffled around several times, Dune: Part Two is currently scheduled to be released on November 3.Villeneuve has also expressed interest in helming a third film based on Herbert's 1969 novel Dune Messiah.A spinoff series entitled Dune: The Sisterhood will center on the formation of the Bene Gesserit and premiere on HBO Max at an unspecified date in the future. "
    ]
}