{
    "articleURL": "/health/article-12046183/Im-doctor-five-ways-slow-ageing-without-going-knife.html",
    "content": [
        "Botox, filler, and cosmetic surgery can be dangerous and costly, experts sayFace yoga and being outside could be just as effective at slowing down ageingThousands of Brits go under the knife every year in a bid to stay looking young.",
        "Botox, filler and cosmetic surgery are some of the most popular options to slow down the unwanted signs of aging.But these costly procedures can come with side effects and dangers, such as infection, pain and scarring, says Dr Asiya Maula, a GP and director of the Health Suite, private healthcare company in Leicester. She has shared her tips on how to stay youthful that don't require you to go under the knife.And some methods do not cost a penny. ",
        "Face yogaYoga helps you relax, strengthen your muscles and it stimulates blood flow. But yoga just for your face also has clock-rewinding benefits.Performing exercises isolate muscles in the face can help it appear more toned, tightened and plump, says Dr Maula. This is because face yoga stimulates the blood flow in the face, which encourages the production of collagen — the protein that supports the skin and other tissues.To see results, experts suggest starting by practicing face yoga twice a day, once in the morning when you wake up and once in the evening before you go to bed.All you need is five minutes at a time and choose three to four poses, which are held for 30 seconds each, after a quick warm-up.For the warm-up, open your jaw as if you're yawning and then raise your eyes to look up at the ceiling without moving your forehead and hold for 10 seconds and repeat.",
        "For one pose, she suggests moving the chin to one side and lifting it up slightly, puckering your lips into a kiss. Hold this for 10 seconds and switch sides to repeat.",
        "Hyperbaric oxygen therapyOxygen therapy is another way of rejuvenating the skin, according to Dr Maula.The air we breathe is only around 20 per cent oxygen, with other gases including nitrogen and carbon dioxide making up the rest.But Hyperbaric Oxygen Therapy (HBOT) involves breathing in 100 per cent oxygen while lying down in a tube shaped hyperbaric chamber.The pure oxygen encourages collagen production, which can reduce fine lines and wrinkles, insists Dr Maula. On top of the cosmetic effects, the therapy has also been found to boost concentration and memory — skills that tend to weaken with age.It also increases circulation, which Dr Maula says can improve age spots, saggy skin, wrinkles, poor collagen structure and skin cell damage, while also improving skin elasticity.This mans 'you can enjoy a more youthful appearance for longer', she says.Spending time outsideWe all feel better when the sun comes out.But the suns rays themselves could also help us steer clear of wrinkles. Exposure to sunlight is a natural source of vitamin D, which is essential for maintaining healthy bones, teeth, and muscles. ",
        "The same vitamin also plays a role in regulating the immune system and reducing inflammation which can help slow down the ageing process, says Dr Maula.The suns natural rays can also help reduce stress, which is linked with ageing conditions, such as high blood pressure, heart disease and cognitive decline.However, it is vital to enjoy the sun sensibly and wear sunscreen. To much exposure to UV radiation from the sun can damage DNA in skin cells and cause skin cancer, as well as prematurely ageing the skin. ",
        "Acupuncture The treatment is derived from ancient Chinese medicine. But acupuncture, which involves inserting fine needles into certain parts of the body, is now rising in popularity as an alternative to filler. In theory, it works by causing trauma to the skin, which triggers the release of fibroblasts, also known as 'healing cells' to fix these areas with collagen.Dr Maula says this process also triggers elastin production, which helps with loss of firmness in the skin.As a result, the treatment causes drooping muscles to tighten, lift and tone.It can take six or more sessions to start to see the rejuvenating effects, according to Dr Maula.Sleep Getting your beauty sleep is key to looking youthful. Temporary dark circles, puffy eyelids and pale skin are well-known side effects of not getting enough sleep.",
        "But studies suggest that not getting enough shut eye has unwanted ageing effects.A 2013 study, which saw US researchers examine 60 women aged 30 to 50, found that those who suffered from poor sleep were more likely to have fine lines and uneven skin tones.And a sleep experiment, published in the journal Royal Society Open Science in 2017, found that after a bad night's sleep you appear less attractive.As well as this cosmetic effect, a lack of sleep can make cells in the body age quicker, according to a 2015 study by researchers at the University of California."
    ]
}