{
    "articleURL": "/femail/food/article-12044259/Expensive-Woolworths-lamb-fat-not-value-money-claims-shopper-cost-living-soars.html",
    "content": [
        "Shopper unhappy with fat content in lamb shoulderShared images of the purchase on social mediaA Woolworths shopper was left infuriated after discovering a 'disappointing' find in her latest meat purchase.",
        "Nicole found what seemed like the perfect portion of lamb - but attempting to cook the meat left a sour taste in her mouth.The customer said she was frustrated that the 970g piece of Rosemary &amp; Mint Butterflied Lamb Shoulder contained 320g of fat.'Bought a butterflied lamb shoulder. It's lamb so you expect a little fat,' she shared on Twitter.'But at $24 per kilo I think having 1/3 of the weight as fat is beyond the pale.'",
        "The shopper shared an image of the fat on a kitchen scale, along with another one that showed the large, unusable chunks of meat laid across a chopping board.Woolworths reached out to Nicole and assured her that they have opened an investigation with their meat production partner.The supermarket giant is also providing her with a refund. ",
        "Several customers were not impressed by the piece of meat.'Big of them to offer a refund if you return it, but what does the family do for a meal when they open the packet to prepare dinner and find this and it may be all they have on hand?' a man asked. 'Very poor.' 'I bought 550g worth of chicken breast from Woolies once for a recipe that required 500g,' a woman shared. ",
        "'The sack under the chicken was so wet l only ended up with 350g. Won't be buying fresh chicken from Woolies again. What a scam!''About 10 years ago I picked up two packets of 1kg mince and it didn't feel the same,' wrote a third. 'Weighed in one of those fruit and veg weight things and both were way off by 200g.'",
        "But others sided with Woolworths.'Fat is edible. If you don't like to eat it, that's on you and you're the one making the choice to trim it all off rather than eating it,' a woman said. 'They're not selling something inedible. It's part of the product. If you want lean lamb don't buy a budget cut like a butterflied shoulder.'Another chimed in: 'How can you purchase a shoulder of lamb and expect anything different? Have you not bought one before?' Daily Mail Australia has reached out to Woolworths for comment. "
    ]
}