{
    "articleURL": "/news/article-12058683/Magaluf-mega-brawl-FIFTY-people-filmed-fighting-throwing-bottles-huge-punch-up.html",
    "content": [
        "Hooligans were seen kicking, punching and throwing bottles in violent clashesThe brutal bust-up went on for around 10 minutes before police intervenedPolice have revealed five officers were injured and 10 people were arrested in a mass early-hours brawl in Magaluf.",
        "They also confirmed local reports a staggering 50-odd people were involved in the violence which saw revellers trade blows and throw missiles at each other as well as police who intervened to stop the huge fight.Astonishing footage emerged overnight of the brawl around 5am yesterday near a popular nightspot called Panama Jack.It was thought the fight had lasted 10 minutes but local officials said this morning the police operation to restore order had lasted for around an hour and officers had to close the street where the violence occurred.One initial local report pointed to the incident being sparked by a fight between a group of North African youngsters and Spaniards - but a group of Portuguese holidaymakers were today identified as the main troublemakers.",
        "Civil Guard officers have yet to comment on the cause but confirmed the number of arrests and injuries as well as detailing the orgy of violence their officers and local town hall-employed police faced.In the force's first official comment on the incident a Civil Guard spokesman revealed: 'The Civil Guard arrested eight men and two women in the early hours of yesterday morning on suspicion of involvement in a mass fight involving around 50 people.'The brawl occurred in a street called S'Olivera Street in Magaluf.",
        "'Officers arrived to find approximately 50 people participating in the fight.'Two of the detainees were women, one Spaniard and one Argentinian. One of them tried to assault an officer and the other damaged a local police car.'A Romanian man was held on suspicion of assaulting a man he punched without warning and knocked unconscious. His alleged victim had to be taken to hospital.'Once the people involved in the incident were dispersed, the Civil Guard went through CCTV and identified a group of Portuguese nationals as the main group that started the brawl.",
        "'They were located and arrested the early hours of this morning at a hotel in the Majorcan municipality of Llucmajor where they were staying following an investigation.'Five Civil Guards were injured as a result of the incident in Magaluf. They needed medical assistance although their injuries were only light.'Six participants in the brawl were also injured, one seriously.'Those arrested are expected to appear in court in the coming hours.A local commenting on the scenes, which occurred following years of attempts by local authorities to clean up Magaluf's image, said sarcastically on social media this morning: 'Magaluf in modernisation phase and elimination of drunken tourism.'In March a British tourist was arrested after allegedly mowing down two holidaymakers including a UK teenager in Magaluf.",
        "No Brits are believed to have been involved in the weekend street violence."
    ]
}