{
    "articleURL": "/news/article-12039931/Jock-Zonfrillo-chefs-Anthony-Bourdain-Jeremy-Strode-Justin-Bull-Darren-Simpson-died-young.html",
    "content": [
        "Jock Zonfrillo's sudden death the latest among chefsLong hours, financial pressures are crushing for manyChefs love responsibility but over-sensitive to critics For help contact Lifeline on 13 11 14Jock Zonfrillo wasn't the first and won't the last top chef to die young, with an insider who also battled heroin addiction blaming the distinct personality types of the people drawn to the industry for the sad demise of so many kitchen commanders.",
        "When the 46-year-old MasterChef host died suddenly this week of natural causes, his name was added to the tragic roll call of chefs who passed before their time.The horrendous hours, brutal takedowns and next-level stresses have been blamed in other famous cases.Insiders have opened to Daily Mail Australia about the reality of becoming a successful chef, saying the unique challenges of operating a successful restaurant, as well as the cooks' own egos, are often a recipe for disaster. The most famous of those chefs was superstar Anthony Bourdain, who took his own life in 2018.The year before that, Jeremy Strode, the acclaimed executive chef of one of Australia's best restaurants, Bistrode CBD, also took his own life. The 53-year-old had been diagnosed as bipolar and suffered from bouts of depression and insomnia and was a mental health advocate for RUOK Day before his death. ",
        "Justin Bull, who once served as a personal chef to both Russell Crowe and James Packer, did the same. At 46, he was found dead in his Huxtons café at Bronte in 2019.In 2017, Darren Simpson, host of Ready Steady Cook, died after a long battle with alcohol addiction-related illness.He trained in some of the most acclaimed restaurants in the world, including Le Gavrouche, the River Cafe, and Sir Terence Conran's Sartoria in Savile Row.",
        "Michelin-starred Swiss chef Benoît Violier, and another Michelin-star winner, Chicago chef Homaro Cantu, known as a genius of molecular gastronomy, both took their own lives.Violier's restaurant, Le Restaurant de l'Hôtel de Ville was crowned by the French government as the best restaurant in the world only a month before he died on January 31, 2016.There are even more examples across the world. ",
        "Eugene Giesinger, Sydney chef and café owner who trained in Michelin-starred Pied A Terre in London, and overcame his own heroin addiction in his 20s, says one of the triggers behind issues in the profession is chefs being 'socially awkward'.'Chefs are not like everyone else,' Mr Giesinger said.'You don't decide to willingly work Friday and Saturday nights as a career unless you're a bit different. Sometimes they are socially disconnected. 'When I was a young chef, the kitchen crew made me feel like I belonged. There was a gay guy, a black guy, a punk. They made me feel part of something. 'Some people choose hospitality because they don't fit properly into social groups in the real world. So they're more inclined to work like mad men and women when everyone else is celebrating.'Jane Strode, Jeremy's wife, did her apprenticeship at Rockpool in the late 1990s and remembers how normal it was to work until you dropped.",
        "'Back then, if you weren't giving 80 hours a week, and sleeping in your car between shifts, then you weren't working hard enough,' she told Nine newspapers.She says work 'totally consumed' her husband.Twelve hour shifts were a minimum and when he finished he obsessed over trends at the world's best restaurants.",
        "'I really just think he was exhausted,' Ms Strode says of her husband's state before he died. 'And he got to that point where he just let the disease – or whatever you want to call it – get the job done.'Mr Giesinger believes the pressure of working in kitchen was '100 per cent' a factor in his developing a heroin addiction in his 20s.He's been clean now for over 20 years and has run three cafes. Two have closed but his HQ, Eugenes, remains open at Bronte.He also credits the responsibility of raising two young boys, aged 7 and 9, as keeping him out of trouble.  Contrary to armchair opinion, Mr Giesinger claims the industry's finest chefs are rarely out of control with drugs and alcohol.'It tends to happen more in the lower stratosphere. It's the RSL cooks who are working horror hours and pumping out meals in a busy kitchen that are snorting lines of coke in between pasta dishes and using the big spoon for their heroin.'",
        "The chaos that comes with addiction and self-medication in hospitality has come into focus in recent years, with several attempts to address mental health in the industry.One such effort was by Amber Kaba, a former sous chef at Marque.She started The White Jacket Effect, an industry support service for frontline workers abusing drugs and alcohol and suffering from mental health issues.'After the loss of my friend and mentor to depression and self-medication my thoughts kept circling around the possibility of somehow changing the drinking culture in Australia,' she said in a statement.'I set out to empower myself with more transformative learning and became a qualified mental health first aider.'",
        "Another is former Sydney chef and butcher, Liam Crawley, who launched Hospo for Life after the loss of several colleagues to suicide in the last decade. Hospo for Life provides members of the hospitality industry easy access to psychologists and mental health support services 24 hours a day, 7 days a week.Mr Giesinger believes a downfall for many chefs is a clash of personality traits that he's seen in many - supreme confidence mixed with fragile egos. He claims chefs often have 'big egos', which makes them willing to tackle the huge responsibility of perfecting a successful menu. ",
        "But they are also extra sensitive to criticism.'Chefs usually have huge egos and low self esteem. There's so much pressure to align with everyone else's expectations,' Mr Giesinger said. 'If you're going on MasterChef you need a huge ego, you have to basically deny your capacity to make mistakes. You have to believe you can never be wrong.'A problem for chefs is that criticism of their flows freely. Their work is scrutinized to a degree that most people's jobs are not. 'What other jobs are there where someone feels entitled to tell you that what you do is s*** according to their opinion?' Mr Giesinger said.'I didn't know Jock but he seemed like a nice guy, like someone aware of his own failings. Maybe the pressure was too much for him?'What did Jock have to cop?' In Mr Giesinger's 35 year hospitality career, the number one pressure he sees chefs under is financial.It's the pressure to make good food while being basically responsible for whether a restaurant lives or dies.'It's the financial pressure from what I can gather that takes chefs out. 'You're consumed with running a restaurant, you're doing everything by the book, like paying GST, you're trying to make it all work with the finest of margins and the business model often just doesn't work. ",
        "'When numbers don't add up it's devastating.'In March 2023, CreditorWatch insolvency data showed businesses in the food and beverage sector were at the highest risk of failure after government Covid payouts ended. ",
        "Industry data from the Business Risk Index revealed 0.97 of hospitality businesses went into insolvency in the 12 months to March 2023. But it is far from a new problem. CreditorWatch chief economist Anneke Thompson said 'the food and beverage sector has always been at higher risk of insolvency'.Australian Bureau of Statistics data show that of the food and beverage businesses trading in 2010, just 52 per cent were still operating in 2014. The two big risk factors for suicide at work are financial stress and work insecurity, according to Angela Martin, a research fellow specializing in work and mental health at the Menzies Institute for Medical Research Business and Economics.Readers wanting support and information about suicide prevention can contact Lifeline on 13 11 14, Suicide Call Back Service on 1300 659 467, and MensLine Australia on 1300 78 99 78. "
    ]
}