{
    "articleURL": "/femail/article-12038941/Crown-Princess-Victoria-Sweden-cuts-classy-figure-floral-gown.html",
    "content": [
        "The Princess beamed as she greeted this year's winner Laurie Halse AndersonREAD MORE: Crown Princess Victoria looks chic in all-black while skiingCrown Princess Victoria of Sweden looked effortlessly elegant as she attended an awards ceremony in Stockholm this evening.",
        "For the occasion, the royal, 45, wore a stunning £600 floor-length black and white floral gown by Swedish brand TOTEME.The mother-of-two swept her long brown hair into a chic and sophisticated low bun - which highlighted her mismatched dangly earrings.Allowing her natural beauty to shine through, Victoria opted for a neutral smokey eye and slick of nude lipstick.To finish off her ensemble, the stylish wore a pair of black patent high heels to take to the stage in. ",
        "The Princess beamed as she greeted this year's winner, Laurie Halse Anderson, onstage, and presented her with the award at the Stockholm Concert Hall.The global award was created in 2002 by the Swedish government to promote every child’s right to great stories. The award was created in the memory of children's author Astrid Lindgren - who penned the Pippi Longstocking series and passed away at the age of 94 in 2002.It is given annually to a person or organisation for their outstanding contribution to children’s and young adult literature. The award is one of the largest of it's kind, with the winner receiving a cool £389,000. Princess Victoria smiled posed for photographs with the winner, Laurie, at the Stockholm Concert Hall. Laurie Halse Anderson is an American writer for young adults. Her novel, Speak, was published in 1999 and has been adapted into a film.",
        "This black and white look is a direct contrast to her rather colourful two-piece suit Nordic food waste summit also Stockholm last week. ",
        "This evening, the Crown Princess' parents King Carl XVI Gustaf and Queen Silvia continued their tour of Estonia.The royal couple attended a state dinner at the Viimsi Artium in Tallinn - which was hosted by Estonian President Alar Karis and Mrs. Sirje Karis.The Queen looked suitably glamorous in a floor-length blue sequined dress with sheer sleeves. Over the top of her show-stopping dress, Silvia wore a contrasting pink ceremonial sash and finished off her outfit with a silver tiara. ",
        "Meanwhile, King Carl XVI Gustaf was smart in a black tuxedo - which had his military medals proudly on show. Earlier this week, the couple's grandson Prince Oscar of Sweden stole the show during a balcony appearance as the royals gathered to celebrate the King's birthday.The Prince, seven, took a leaf out of the UK's Prince Louis's book as he looked restless during a public appearance on the balcony at the courtyard of the Royal Palace in Stockholm as King Carl XVI Gustaf turned 77.The royal appeared with his mother Crown Princess Victoria, 45, father Prince Daniel, 49, and sister Princess Estelle, 11. He was also joined by Queen Silvia, Princess Sofia and Prince Gabriel.",
        "Oscar, who turned seven at the beginning of March, was pictured taking shelter in his mother's blue coat as the family waved to royal fans.As he stood towards the front of the balcony, he put his head in his hands and began brushing his hair away from his face with a look of anguish in antics that were reminiscent of Prince Louis's cheeky balcony appearance to mark the late Queen Elizabeth's Platinum Jubilee last June."
    ]
}