{
    "articleURL": "/wires/reuters/article-12059207/Tupperware-brings-Moelis--Co-help-explore-strategic-alternatives.html",
    "content": [
        "May 8 (Reuters) - Tupperware Brands Corp, which has warned of a possible bankruptcy, said on Monday it signed on investment bank Moelis &amp;amp; Co LLC to help explore strategic alternatives, and added it has also found additional prior period misstatements in its financial reporting.",
        "Shares of the company, known for its bright-colored plastic airtight containers, fell more than 6% to $1.02 in premarket trading.Orlando, Florida-based Tupperware in April raised doubts about its ability to continue as a going concern, as it struggled to contain a slump in sales amid a surge in usage of free restaurant to-go boxes and rising competition from cheaper food storage containers.On Monday, it said in a filing it expects a \"material decline\" in revenues for the first quarter - estimated in the range of $280 million to $290 million for the quarter ended April 1. It reported net sales of $348.1 million a year earlier.While it was not immediately clear if the year-ago revenue was comparable, the company said it was continuing its restatement of previously issued financial statements for the year ended Dec. 31, 2022.Tupperware, which is struggling to reinvent itself and struggling with higher costs, said it has appointed Brian Fox, managing director at turnaround firm Alvarez &amp;amp; Marsal North America LLC as its chief restructuring officer.The company has also been slow to pivot to e-commerce sales, at a time when retailers and brands across the board have capitalized on shoppers' preference to purchase items from the comfort of their homes.The Wall Street Journal last month reported the company had brought on advisers from Moelis &amp;amp; Co, Kirkland &amp;amp; Ellis LLP and Alvarez &amp;amp; Marsal.",
        "(Reporting by Granth Vanaik and Deborah Sophia in Bengaluru; Editing by Nivedita Bhattacharjee)"
    ]
}