{
    "articleURL": "/wires/pa/article-12038323/King-Queen-Consort-meet-MPs-peers-staff-Westminster-Hall-reception.html",
    "content": [
        "The King and Queen Consort met Prime Minister Rishi Sunak and Labour leader Sir Keir Starmer at a reception with MPs, peers and staff at Westminster Hall ahead of the coronation.",
        "Charles appeared relaxed as he shook hands with Mr Sunak and Sir Keir, who set party politics aside as they laughed and smiled with Commons Speaker Sir Lindsay Hoyle.Between 650 and 750 parliamentarians gathered in the hall for the reception, alongside staff from the House of Commons and the House of Lords.Charles spoke to members of both Houses who share his interests, including agriculture, business and communities.He was accompanied by Sir Lindsay and the Speaker of the House of Lords, Lord McFall of Alcluith.",
        "The Lord Great Chamberlain, Lord Carrington, and Black Rod Sarah Clarke welcomed the King to the hall.As the national anthem was played by members of the RAF band, MPs and peers sang while Charles watched from the entrance.Camilla later joined the King and met MPs and members of the House of Lords to discuss her charitable causes of literacy, domestic violence and osteoporosis.Orchestral music played throughout, including the La La Land film soundtrack and Billie Eilish.Coronation quiche of tarragon, spinach and broad beans was served alongside lemon and chocolate tarts with the King’s insignia on chocolate discs.",
        "At the end of the reception the King and Queen Consort viewed the Speaker’s coach, the golden carriage which was used at the coronations of the late Queen, George V and Edward VII.",
        "Sir Lindsay said: “Everyone wanted to be part of the coronation. This was his bit to Parliament, saying, I want to mingle, and he did.“He went around everyone shaking hands, he didn’t even have time for a piece of quiche. An amazing visit, a very, very warm welcome.“Excuse the pun, but this was levelling up.“For those who will not be there on Saturday, he wanted to give others the opportunity today.“Those peers and MPs who could not be there on Saturday, this is their opportunity to meet His Majesty, and Her Majesty.”",
        "Deputy Speaker Eleanor Laing said: “He’s always so well informed and involved in what we do, so it was a real privilege to have a quick chat with him about what it is like to be deputy speaker.“He is the personification of the constitutional settlement.”Former business secretary Jacob Rees-Mogg said the reception offered parliamentarians a chance to show their loyalty to the King.He said: “We dedicate our loyalty to our sovereign. We are here now to show our loyalty, not just to the King but in our constitutional sovereignty.”However, he added he would not be trying the coronation quiche, as he finds quiche “disgusting” and the broad beans “loathsome”.",
        "Former prime minister Theresa May said: “He’s speaking with people for quite a long time.",
        "“Everyone is hugely impressed by him but also excited about this event. It’s going to be an absolutely amazing event. It’s not just MPs and peers here but staff as well, which is really wonderful.”Labour grandee Harriet Harman commented on changes since the Queen’s coronation, with the huge increase in female MPs, and praised Camilla for playing an active part as Queen Consort.Westminster Hall, built between 1097 and 1099 by William II, is the oldest building on the parliamentary estate."
    ]
}