{
    "articleURL": "/wires/reuters/article-12060077/Texas-driver-charged-eight-counts-manslaughter-crash.html",
    "content": [
        "By Brendan O'Brien and Tyler Clifford",
        "May 8 (Reuters) - A Texas man accused of crashing his car into a group of pedestrians near a Brownsville homeless shelter housing migrants, killing eight people, has been charged with manslaughter and aggravated assault, police said on Monday.The driver, identified as 34-year-old George Alvarez, ran a red light, lost control of his sports utility vehicle, and struck 18 people as the car flipped on its side, Brownsville Police Chief Felix Sauceda said.Alvarez attempted to flee but was held down by several bystanders, Sauceda said. Investigators were waiting for toxicology reports on Alvarez to determine if he was impaired at the time of the crash.Police have not ruled out the possibility that the crash was intentional, Sauceda said.Alvarez appeared briefly in court on Monday wearing a white jumpsuit, responding \"yes, sir\" to questions from a judge. He was ordered held on $3.6 million bail. Police said Alvarez has an extensive criminal history.Investigators are working to identify the victims, some of whom were Venezuelan migrants.\"It has been a very tiresome process but we are deeply committed to doing and accomplishing,\" Sauceda said, adding that his department was working with the Venezuelan government and other embassies.In a statement on Monday, the Venezuelan government called for an investigation to determine if the incident was motivated by hate or xenophobia.",
        "Brownsville, a city of some 165,000 people on the U.S. border with Mexico, and other communities are bracing for a likely surge in migrants when a COVID-19 restriction known as Title 42 is set to end on Thursday.Title 42, in place since 2020, allows U.S. authorities to quickly expel migrants caught crossing the border illegally, without giving them the chance to seek U.S. asylum.Reuters could not immediately determine whether Alvarez had retained a lawyer.A video circulating online purporting to show the crash shows a speeding SUV plowing into a row of people sitting on a curb. A second video appears to show victims lying on the ground, some bloodied and writhing, others motionless.Reuters was unable to independently verify the authenticity of the videos. (Reporting by Brendan O'Brien in Chicago, Tyler Clifford in Washington and Dan Whitcomb in Los Angeles, Editing by Rosalba O'Brien)"
    ]
}