{
    "articleURL": "/wires/aap/article-12044813/Fit-Kennedy-pole-vault-action-Doha.html",
    "content": [
        "Confident and comfortable that she now truly belongs in the \"big girls\" pole vault club, fit-again Australian Nina Kennedy returns to action after an enforced eight-month layoff at the Doha Diamond League meet.",
        "Kennedy enjoyed a breakout season in 2022, highlighted by bronze at the world championships in Eugene, gold at the Birmingham Commonwealth Games and a shock triumph in the Diamond League final in Zurich.But after returning to training in early October after a short break, the 25-year-old quickly realised something was wrong.\"My back was pretty sore, so we put the pieces of the puzzle together and realised I'd been dealing with it for the whole season,\" Kennedy told AAP.\"I had some scans and it showed up a fracture in the L5 vertebra, so I had to sit still for four weeks before slowly getting back into it.\"It's like a stress fracture; it comes on when you push the limit too far, which I think we did last season.\"It must have been there in Zurich but they come on slowly, and I was taking low-level painkillers in that comp.\"The good news is that Kennedy has made a full recovery, so much so that she is entertaining the possibility of bettering her national record of 4.82m in Doha on Friday (early Saturday AEST) against a world-class field including Americans Sandi Morris and Katie Moon and Britain's Holly Bradshaw.\"My last comp was in Zurich and I got the win, so I'm just excited to go out and show the girls that that wasn't a fluke and I'm here with some big goals over the next two years,\" said Kennedy.",
        "\"I hope the big girls think of me as a threat now.\"Before last year I was a nobody - I'd never made an Olympics or a world champs final, I'd only been to one Diamond League.\"In the space of one season I go from a nobody to winning the Diamond League final.\"It all happened really quickly and for the other girls, that was probably a bit of a shock and I'm hoping to continue that.\"I want them to know I'm there and that I'm going after that world champs gold in Budapest this year and then Olympic gold in 2024.\"Kennedy is among an eight-strong Australian contingent at the opening event of the 2023 Diamond League season.AUSSIES IN ACTION IN DOHA:Women's pole vault - Nina KennedyWomen's 1500m - Jessica Hull, Georgia Griffith, Abbey CaldwellWomen's 100m hurdles - Michelle JennekeMen's 3000m - Stewart McSweyn, Matt RamsdenMen's discus - Matt Denny"
    ]
}