{
    "articleURL": "/news/article-12050099/Privacy-warnings-new-AI-speed-camera-uses-4D-scanning.html",
    "content": [
        "'Redspeed Sentio' camera can catch motorists breaking the law inside carTen-inch camera can detect whether too many people are inside a vehicle Privacy campaigners have raised warnings over Big Brother-style 'AI' speed cameras which use a 4D scanning system to watch drivers inside their cars.",
        "A new 'Redspeed Sentio' unit made by Kidderminster-based Redspeed International can also catch motorists using their mobile phone or not wearing a seatbelt.The ten-inch camera can detect whether too many people are inside a vehicle, as well as spotting those who are speeding or going through a red light.The device has not yet got Home Office approval - and Transport for London denied reports in The Sun today that it was already being trialled on the A23 in Lambeth.The camera can also be linked to databases from police forces and the Driver and Vehicle Licensing Agency to check vehicles are properly taxed and insured.",
        "But privacy campaigners have criticised the 'intrusive and creepy surveillance', with motoring experts calling for an 'easy means of drivers challenging penalties'.",
        "Speeding - Minimum fine of £100 and three penalty pointsUsing phone while driving - £200 fine and six penalty pointsFailing to wear a seatbelt - Maximum fine of £500 Failing to stop for a red light - £100 fine and three penalty pointsDriving without a valid MOT - Maximum fine of £1,000Driving without insurance - £300 fine and six penalty points",
        "Six lanes can be monitored around the clock by the solar-powered device, which can also work with other units to check average speeds.But Jake Hurfurt, head of research and investigations at privacy campaign group Big Brother Watch, told MailOnline: 'Unproven AI-powered video analytics should not be used to monitor and potentially criminalise drivers.'This kind of intrusive and creepy surveillance which treats every passer-by as a potential suspect is excessive and normalising it poses a threat to everone's privacy. People should be free to go about their lives without being analysed by faceless AI systems.",
        "'Last year the Information Commissioner warned that the use of immature biometric technologies could lead to discrimination and public bodies need to be careful to ensure they are not using privacy-threatening algorithms in place of human decision making.'And RAC road safety spokesman Simon Williams told MailOnline: 'While some drivers may criticise these cameras for unwanted snooping, the reality is that these days the police increasingly rely on technology to catch drivers breaking the law – after all, it's impossible to have a police officer stationed on every street corner.'When it comes to drivers using handheld phones illegally, we also know from research that drivers are broadly supportive of camera-based technology being used to enforce the law.",
        "'Having said that, given the increasing sophistication of cameras and the potential for AI to play a role in the future, it's absolutely vital these cameras are set up correctly and there's an easy means of drivers challenging penalties and fines which they think are unwarranted.",
        "'Drivers who stick to the speed limit and obey the law have nothing to worry about regardless of what cameras are in place. It's also worth remembering that – unlike in other countries – all cameras have to be painted yellow, so they're plainly visible to drivers.'",
        "An information page on the Redspeed International website said the device is 'designed to be whatever camera you want it to be'It adds: 'Perhaps your requirement is to combine a speed camera, red light camera and average speed camera in one box.'Maybe you want to incorporate detection of mobile phone use, high occupancy vehicles, seat belt infringement or misuse of railway crossings.'Either way, in combining several key enforcement applications in one box and having AI at its heart, Redspeed Sentio has the built-in modular flexibility, capability and scalability to meet virtually any future challenge.'It added that Redspeed Sentio is awaiting UK Home Office type approval. The Home Office declined to comment to MailOnline, instead directing queries to TfL.TfL confirmed it was not possible for the A23 camera referred to in The Sun article to be used to enforce the offences of using a mobile phone or not wearing a seatbelt.",
        "It added that the type of camera referred to in the newspaper's article is not being tested on the TfL road network. Redspeed did not respond to comment requests.During a trial in 2022, police cracked down on drivers using mobile phones and driving without wearing a seatbelt with a new van that has an AI camera mounted about 21ft above the road.",
        "The unit uses AI to identify motorists potentially breaking the law. Images are then sent to an officer for a secondary check and those breaking the law are prosecuted.The enforcement vehicle developed by Aecom and Acusensus has been deployed in Warwickshire, Merseyside, Humberside and East and West Sussex.",
        "It has been organised by National Highways – working alongside different police forces – as part of a road safety trial programme since last summer.The Acusensus cameras were permanently rolled out on roads in Queensland, Australia, in July 2021. Police have previously spied on motorists from unmarked HGVs and caught hundreds of drivers breaking the law.MailOnline reported in 2020 that officers used a 'stealthy' lorry's cab height to look inside vehicles and see if drivers were wearing seat belts or using mobile phones.They found some motorists completely disregarding safety rules, with one driver caught using his elbows to steer and another using his dashboard as a filing system."
    ]
}