{
    "articleURL": "/femail/article-12040639/What-star-sign-moon-warning-Rose-Smith-astrologer.html",
    "content": [
        "Saturday's moon will spark chaosAstrologer warns it will be 'intense and challenging'",
        "Emotions will be magnified this weekend, according to astrologers, who predict the 'flower' full moon and lunar eclipse will bring chaos for all.",
        "Intuitive astrologer Rose Smith claims the energy brought on by Mercury Retrograde will also be supercharged over the weekend and urges people to avoid making any big decisions.'Astrologically full moons are associated with our emotions, a time when we need to deal with issues from our subconscious; but a lunar eclipse, especially in Scorpio, adds to the mix and withheld emotions come to the forefront,' Ms Smith told FEMAIL.'Eclipse energy is like a full moon on steroids, and it's amplified! We need to be cautious of our emotions during the event as it will bring compelling hidden energies to the front of our minds.''Lunar eclipses represent feminine energy and typically don't last as long as solar eclipses – but that doesn't mean that lunar eclipses are less potent… they may actually be more potent in the short term so even more reason to watch our emotions.'Ms Smith, who also runs the largest psychic network based in the southern hemisphere, Absolute Soul Secrets, said to add to the emotional turmoil, Mercury and Pluto will be in retrograde.",
        "'With Mercury retrograde, be prepared for miscommunications and misunderstandings in relationships and problems with technology. It's not a great time for travel or signing important documents either,' she added.'It is a good time to complete things you started before beginning of Mercury Retrograde, that is before April 21. Mercury is also known as the 'trickster' – so beware of scams.'",
        "'Relationships will also be tested, so it's important to give your partner space. With Pluto retrograde (beginning on May 1st) a radical metamorphosis may take place.''Scorpio is a fixed water sign so take extra care of your emotions, and if you feel 'triggered' by anything… write it down,' said Ms Smith.",
        "The lunar eclipse will begin on Saturday, May 6th at 1.14am AEST and end at 5.31am, but best viewing will be at 3.22am. It may be hard to see as the shadowed part is only slightly fainter than the rest of the moon. ",
        "'Expressing your feelings on paper takes the edge off! It's an emotional time for many and there might be a special connection with women generally, or your mother.'Ms Smith said Scorpio could also bring with it the revelation of big secrets, and trouble could be brewing on many fronts.'Scorpios have an intensiveness and allure where they can magnetise people and things towards them. But it's a double-edged sword, some things brought to Scorpios they are better off not to have.'Ms Smith said all star signs will experience a few intense and challenging days around the lunar eclipse – but especially other fixed signs joining Scorpio – Taurus, Leo and Aquarius.She also said depending on what house your moon is in, behaviours, arguments and past traumas – may all come up into your consciousness.",
        "Aries (March 21 to April 19)Intensity is the name of the game, especially with a lunar eclipse in Scorpio.You could feel quite agitated about joint resources and things you share with another.Intimate matters could also be affected and the energies you share or wish to share could be blocked or hindered. Yes, it can be frustrating... so try a different approach. History repeats, so it's time to mix it up a little and do something different.Uranus influences you to take a risk, do something unpredictable especially with intimacy – 'to reveal your soul, you need to dare, open up and let others care'. Also, regarding investments, ensure you do some due diligence first before gambling away the house or doing anything silly. Joint investments, loans, wills or superannuation could also feature this month.Taurus (April 20 to May 20)Lots happening for you this month... there's a hard aspect with Mercury retrograde that the eclipse is making. So be extra cautious now with your communications. Misunderstandings could be flying all over the show, so keep your mouth under control. You can do this as you're normally fairly sensible and in control. Your close relationships can be especially affected so do remember 'arguments in love can be quite a fright, but good communication can make things right'. Venus your ruler is good at being diplomatic and she will serve you in good stead this month. Get some excitement into your life and approach the world in a considered and reliable manner.Gemini (May 21 to June 20)Your ruler Mercury looks like it's going backwards, but in reality... it's not! So, miscommunications and misunderstandings could abound, but they are not necessarily based on reality either. It's also not a good time for travel or sign important documents. Can you put these off until after say the 22nd? Remember this thought – 'miscommunications at work, oh what a mess, clear communication is the key to success'. You do have the power however, to right any tumult. You could also be looking at a health or wellbeing issue? Give yourself some time to come up with a solution. It won't happen overnight, but it can happen. Adjust your routine and daily life to suit anything changes that may play out in the next few weeks.Cancer (June 21 to July 22)You're pretty well affected by this Scorpionic eclipse... for some it's a total eclipse of the heart and you may be feeling it.If you fall into this category, then remember 'although my heart was eclipsed by the night, I wait patiently for dawn's first light!' I say this because it's true, a new day is coming for you.New beginnings and opportunities in love, creativity and childlike fun are possible soon. Get out 'n' about and spread your wings far and wide to move past your current situation.Leisure and pleasure can be your solution to any 'ick' you may be feeling. Start a new project, meet some new people &amp; all will improve soon. The moon is your ruler, and you are closely tied to her moves, including her capacity for staying power.Leo (July 23 to August 22)Home and family are where your heart is. This includes people who are like family too, so don't keep them on the outer, invite them in.You may be surprised how much love is actually around you. It's a great time for socialising too, especially close to home. Your sun is opposite the lunar eclipse, so despite any ructions, a peaceful home life with family is very important to you now. Some of these ructions can involve females, so remember 'when tempers flare with the women of kin, blame not the moon, but the mood we're in'.It's just that some people are more affected by the moon, and they/we become moody at times. But it's only for a time and this will soon pass. Choose to stay positive anyway.Virgo (August 23 to September 22)You could be feeling more assertive now, you want to kick on and get things done. There's likely plenty to keep you active too. However, your ruler Mercury is currently retrograde, and this could bring various misinterpretations of reality into your life. Stay on your toes and watch for anything that doesn't sound quite right as Mercury retrograde can lead you to think all sorts of things, but you may have the wrong end of the stick. Here's a clue - 'misunderstood, wires crossed! Conversations, opportunities lost!' If you're in business or promotion, it's not the best time for marketing as any campaigns could miss the mark now. Your flashes of brilliance would be best put off until another day, preferably after the 22nd. Study or local errands could be similarly affected.Libra (September 23 to October 22)Do double check your communications especially about money, possessions or the things that you value. Mercury retrograde doesn't always let you find a bargain, in fact things that you buy may be decidedly uncooperative now. It's not a good time for making important decisions about your finances, so put things off if you can. If you can't then be prepared to revisit a financial situation because when Mercury turns direct, something will change. Keep your eye on the money honey. There could also be some financial changes brought about by the eclipse – 'with money and change, we can rearrange our lives and futures, for better exchange.' Pick your moment and it will come. Be financially patient now.Scorpio (October 23 to November 21)The eclipsed moon is looking at you. You may find secrets revealed, but if there is something you're carrying hidden away deep inside, this could be a golden opportunity to unburden yourself. You may go through some sort of 'initiation' type experience – it's like walking down a tunnel without knowing your destination. Trust yourself, it will all be okay even if 'in the darkness of the moon's eclipse, emotions rise with secrets on our lips'. There is something new around the corner and it's likely to have real physical effects over the next few months at least. Prepare yourself for better things. Look for new opportunities as you approach the world in a new way. Maybe you change your identity in some manner?Sagittarius (November 22 to December 21)This lunar eclipse brings a great opportunity for you to look deeply into your spiritual life. What's that you may well ask? Well, now is the time for you to go within yourself. Look within, pay attention to your dreams, feelings, your aspirations and inspirations. These are every bit as valid as your thinking. You can find ways to incorporate spirituality into your life now which don't have to be noticeable to others. Just quiet little things you observe by yourself. Take some time out to get started. It's true that 'the moon's soft light shines on your face. Whilst in solitude, you feel Divine Grace. Grace is all around if we could perceive... you have the chance now to deeply believe!'Capricorn (December 22nd to January 19)Issues around friends, groups and your associates could come up this lunar eclipse. You may decide it's a good time to bring in some fresh energies as you become keener about meeting new people.  There's likely to be some quite intense emotions around these moves and it could also involve your hopes and dreams to some extent. There are some 'you beaut' opportunities too particularly around energetic committed relationships and communications regarding your spiritual beliefs. Do be a little cautious that these are not taken the wrong way however with Mercury retrograde doing his best to confuse matters when 'miscommunications and friends collide. But hopes and dreams can still abide'.Aquarius (January 20th to February 18)Life could become more public soon, so do be careful not to overshare on social media. The lunar eclipse could bring very intense feelings around your career, your reputation but also regarding a parent, particularly your mother. There's a bit of a shakeup so do watch your Ps &amp; Qs and try not to overreact. Get some distance from the issue – which you can do with that Aquarian detachment you're so capable of. It's time to know 'when life gives you a good shake - have faith, new opportunities will soon awake!' Something unpredictable may happen especially around home and family, so play it cool and don't invest too much emotional energy if you can help it. There could be some silver linings and golden prospects here.Pisces (February 19 to March 20)This eclipse brings you a great opportunity to start implementing your ideas about how to expand your horizons.There's likely to be some real concrete manifestations in your desire to travel, study or expand your spiritual awareness. Even if the moon is shaking your life up, it's ultimately a good thing as this will influence you to move out of your cubby hole and into the world at large!Yes, it's a big place and it's quite normal and usual to have some anxiety about changing your life. Your normal life, may have become a little bit too comfortable or predictable. You need some additional excitement and enlarging your scope can help. After the 22nd go on a trip or do something different but before this, do remember that 'when on the move, be ready for change.",
        "'People can release tension in healthy ways, sitting with their feelings, acknowledging them rather than denying them, and looking to channel them in appropriate ways,' said Ms Smith.The full moon is also known as the full Flower Moon, because of the abundant blooming that occurs in North America as Spring gets going properly.While this lunar eclipse is penumbral eclipse, like other eclipses it occurs when Earth passes between the moon and sun, obscuring the sun's light and casting a shadow onto the moon's surface. But Ms Smith said unlike other kinds of eclipses, they are very subtle to observe.The lunar eclipse will begin on Saturday, May 6th at 1.14am AEST and end at 5.31am, but best viewing will be at 3.22am. It may be hard to see as the shadowed part is only slightly fainter than the rest of the moon."
    ]
}