{
    "articleURL": "/news/article-12040689/Flames-erupt-sky-Ukrainian-drone-attack-strikes-oil-depot-close-key-Crimean-bridge.html",
    "content": [
        "A suspected Ukrainian drone attack was behind the blast at oil storage depotOne tank containing tons of fuel erupted into flames at port near VolnaAn oil storage depot in Russia exploded today after a drone attack thought to have been orchestrated by Ukraine.",
        "A tank containing tons of fuel erupted into flames at around 2am at a port near Volna village on the Black Sea, close to a key bridge linking Russia to the annexed Crimea peninsula.A plume of smoke was seen rising after dawn from the Taman port in the southern region of Krasnodar. Nobody was wounded in the attack.Video taken shortly after the strike showed one fuel tank spewing smoke and flames.A witness said: 'Something exploded at 2am. There was a sound of hissing in the air, and a drone trace in the sky. Now it's burning. Oil or something else is burning.'",
        "The strike, the latest in a rising tide of apparent attacks by Ukraine on Russian territory, was only six miles from the Kerch Bridge built by Vladimir Putin linking Krasnodar region to Crimea, which he annexed in 2014. The bridge, a key lifeline for the Kremlin's grip on the peninsula, has been repaired after a sabotage attack on 8 October 2022. This morning there were unconfirmed reports that people were being evacuated from homes near the inferno, some hours after the raging fire started.A report said Russian special services were at the scene.The suspected Ukrainian drone strike came after saboteurs derailed two Russian freight trains and destroyed power cables with explosive devices in a matter of days.",
        "And today, Russia's FSB security service said it had arrested members of a Ukrainian sabotage network planning a series of attacks in Russian-occupied Crimea, Russian news agencies reported.'The FSB has broken up the activities of an agent network of Ukrainian military intelligence planning to carry out major sabotage and terrorist attacks in Crimea,' the security service was quoted as saying.Krasnodar regional governor Veniamin Kondratyev said of today's strike: 'A tank with oil products caught fire. The fire was assigned the highest rank of difficulty. 'According to preliminary information, there are no victims or injured. I am keeping the situation under control.'Fire brigades, the Ministry of Emergency Situations and other emergency services were pulled into place.",
        "'Every effort is made to prevent the fire from spreading further. There is no threat to residents of the village.'The fire began after a drone - believed to be from Ukraine - dropped explosives into one of the fuel tanks, according to Pro-Kremlin Russian outlet Readovka - despite the site being some 170 miles from Ukrainian territory.Witnesses told the news outlet they heard two explosions before the fire erupted, covering almost 13,000 square feet with flames. In the early hours of this morning, 85 firefighters were battling the blaze. The latest suspected drone attack came a day after a blast hit the Black Sea port village of Vilna, destroying an oil depot.",
        "A day earlier, on Tuesday, saboteurs derailed a freight train transporting 20 oil tankers on the Snezhetskaya-Belye Berega line.It was carrying oil and fluorosilicic acid as well as lumber, according to reports.And on Monday, saboteurs again derailed a Russian freight train and destroyed power cables with explosive devices.The train, carrying oil and construction materials, burst into flames following a detonation on the tracks in the Bryansk region, 37 miles from the Ukrainian border.Video taken shortly after the attack showed several destroyed carriages ablaze and laying on their side, with dark grey smoke billowing into the air.Local governor Alexander Bogomaz said the explosive device went off 'on the 136th kilometre' of the railroad between Bryansk and the town of Unecha - a route used for transporting Moscow's military supplies.",
        "Russian authorities say the region - which borders both Ukraine and Belarus - has seen multiple attacks by pro-Ukrainian sabotage groups in the 14 months since Russia invaded.Separately, the governor of Russia's Leningrad region near St. Petersburg said a power line had been blown up on Monday and an explosive device found near a second line.A blast moments after midnight caused the collapse of the main power lines and officials said the attack was sabotage. Governor Alexander Drozdenko posted photos of destroyed power lines and metal supports near the village of Susanino on his Telegram page on Monday morning. ",
        "On Saturday a drone attack led to an explosion and giant fireball at an oil facility in Sevastopol, headquarters of the Russian Black Sea Fleet in occupied Crimea.",
        "It comes as Kyiv prepares for a widely expected counter-offensive this spring, with Ukraine building up mechanised brigades with armour supplied by Western allies. Ukraine almost never publicly claims responsibility for attacks in Russia and on Russian-controlled territory.But Ukraine's intelligence chief Major-General Kyrylo Budanov has previously said that some incidents in Russia are orchestrated by Ukraine.'Much of this is no accident,' he said. 'Something is constantly on fire [in Russia].'Signalling equipment on railways, it lights up several times a day, on various highways constantly for two to three hours, sometimes for five to six hours, traffic gets suspended.'Clearly it doesn't just happen like this... I would put it this way: money works wonders.'"
    ]
}