{
    "articleURL": "/wires/pa/article-12046639/European-Central-Bank-announces-quarter-point-rise-rates.html",
    "content": [
        "The European Central Bank has slowed the pace of its interest rate increases, stepping back like the US Federal Reserve from a string of larger hikes aimed at snuffing out inflation.",
        "The ECB’s quarter-point hike to 3.25% follows evidence that its efforts are working by making mortgages and business loans harder to get.The decision comes a day after the Fed approved a quarter-point increase and hinted that it may have reached the end of its cycle.But the central bank for the 20 countries that use the euro currency started raising rates later and may have further to go even as economic growth slows to a crawl and US bank instability stirs fears of financial turmoil.“Based on the information we have today, we have more ground to cover, and we are not pausing,” ECB president Christine Lagarde said at a news conference.The ECB said in a statement that inflation “has declined over recent months but underlying price pressures remain strong”.The bank said a series of six hikes of half or three-quarters of a point are being “transmitted forcefully” by making loans harder to get but how that affects the rest of the economy is not yet clear.The ECB eased the pace after its lending survey showed that banks are getting stricter about giving loans and that consumers and companies are asking for less credit and fewer mortgages.That is a sign that its streak of six hikes of either half or three-quarters of a point are taking effect.",
        "Making it more expensive to borrow can cool off spending, easing pressure on prices but potentially weighing on economic growth.Demand for housing loans plummeted in the first three months of the year following the sharpest decline since statistics started in 2003 at the end of 2022.Market observers were waiting for Ms Lagarde’s news conference for clues about the bank’s future steps, especially with inflation still high at 7%.It has been fuelled by Russia’s invasion of Ukraine, which drove up oil prices and led Moscow to cut off most natural gas to Europe. Energy costs have since fallen but the surge is still feeding through to higher prices for goods, services and food.Food prices jumped 13.6% in April from a year earlier, following a 15.5% annual increase the month before.So-called core inflation, which excludes volatile fuel and food prices fell only slightly in April, to 5.6% from a record 5.7% in March. It is considered a clearer picture of whether price pressures are building up in the economy from demand for goods and higher wages.Workers across Europe have been striking for wages that keep pace with inflation, with analysts saying average pay rises could hit 5% this year — driven by eye-catching deals like German public employees’ 11% salary increase over two years.",
        "The ECB slowed down as renewed turmoil in the US banking system appears not to be shaking the stability of Europe’s banks, the chief source of credit for businesses.US officials seized First Republic Bank this week and sold it to JPMorgan Chase, the third major bank failure following the collapse of Silicon Valley Bank and Signature Bank in March.The earlier turmoil enveloped long-troubled Swiss lender Credit Suisse and led to a government-orchestrated takeover by rival UBS, but European financial officials say their banks have minimal direct exposure to the US troubles.The central bank has pressed ahead with rate hikes despite concerns about their impact on economic growth. The eurozone barely scraped out 0.1% growth in the first three months of the year compared with the previous quarter.The ECB’s decision brings its benchmark rate on deposits from banks to 3.25%."
    ]
}