{
    "articleURL": "/wires/ap/article-12055743/Spirit-Thorns-remain-undefeated-NWSL-play.html",
    "content": [
        "Trinity Rodman, Ashley Sanchez and Paige Metayer each scored to give the Washington Spirit a 3-1 win against the San Diego Wave on Saturday afternoon.",
        "All four goals came in the second half in front of 12,232 fans at Audi Field in Washington, D.C.The Spirit outshot the Wave 9-1 in the first half, but San Diego goalkeeper Kailen Sheridan made seven saves to keep it scoreless.Rodman found the opening goal in the 56th minute, running onto a through ball that a Wave defender slid and missed. The Spirit forward slotted her one-touch shot around Sheridan.Sanchez doubled the lead in the 70th minute with a left-footed shot at the top of the box. Rodman assisted the goal and now has three goals and two assists this season.Metayer's header on a corner kick made it 3-0 in the 80th minute. It was the first National Women's Soccer League goal for the rookie midfielder, who signed with the Spirit after going undrafted.",
        "San Diego forward Alex Morgan scored a consolation goal in the 90th minute, pouncing on a rebound for her fourth goal this season.Washington remains undefeated with a 3-0-3 record. This was the second loss in a row for the Wave, who fell to 3-3-0.COURAGE 3, THORNS 3The Portland Thorns came from behind three times to earn a draw on the road against the North Carolina Courage.Crystal Dunn scored twice and Olivia Moultrie got Portland's third goal in Cary, North Carolina, and the Thorns (3-0-3) remained undefeated.",
        "The Courage (2-3-1) opened the scoring in the 1st minute when Ryan Williams' cross was deflected and snuck into the near-post corner.Dunn leveled the score in the 22nd minute, finishing a Sophia Smith assist with one touch.Kerolin scored four minutes later with a driven shot from distance, putting the home team up 2-1.Dunn evened the score again in the 53rd minute. After some crisp passing by the Thorns, Meghan Klingenberg found herself with the ball in the box. She sent a pass to her right for Dunn, who slid and poked the ball into the goal.In the 71st minute, rookie Olivia Wingate beat her defender and slipped a ball to Victoria Pickett, who scored with her first touch.Moultrie leveled the score for the third time in the 83rd minute, shooting with her left foot from distance.REIGN 2, DASH 0OL Reign moved to the top of the NWSL table with a victory over the Houston Dash at Lumen Field in Seattle.Veronica Latsko and Jordyn Huitema scored for the Reign (4-1-1).The first goal came in the 53rd minute when Latsko flicked Megan Rapinoe´s cross behind her and out of the reach of goalkeeper Jane Campbell.Huitema´s diving header went off the post in the 60th minute, but the forward got her goal eight minutes later when she rose up on the back post to head in a Latsko cross.",
        "The Reign became just the second club to reach 100 NWSL wins, after Portland.With the loss, Houston moved to 1-2-3 on the season.PRIDE 1, LOUISVILLE 0Messiah Bright scored the lone goal in the Orlando Pride's home win against Racing Louisville.After starting the season with four losses, Orlando (2-4-0) now has back-to-back victories.Bright got her head on Kylie Strom's cross in the 21st minute and her shot slipped out of the hands of goalkeeper Katie Lund. Bright nearly had a second in the 30th minute, but a Louisville defender blocked her first shot and it went off the post and Lund saved her second on the rebound.Racing Louisville (0-2-4) finished with 17 shots, but Pride goalkeeper Anna Moorhouse made seven saves to earn a clean sheet.___ AP soccer: https://apnews.com/hub/soccer and https://twitter.com/AP_Sports"
    ]
}