{
    "articleURL": "/wires/pa/article-12057803/First-UK-ministerial-trip-Hong-Kong-2018.html",
    "content": [
        "Talks on renewing Britain’s business ties with Hong Kong will be held during the first visit to the city by a UK minister since China’s crackdown on its civil rights.",
        "The Government has condemned the national security law imposed by Beijing on the former British territory in 2020 after mass protests.The move strained relations and led to the creation of a visa scheme allowing Hong Kongers to come to Britain.But the UK Government has recently made clear that it wants to maintain engagement with China despite political differences. For future generations we have an obligation to engage – robustly and also constructively  Investment minister Dominic Johnson  Investment minister Lord Dominic Johnson will discuss boosting trade in fintech and financial services with Hong Kong government representatives.He said he will also stress that the UK will “call out the violation of their (Hong Kongers’) freedoms and hold China to their international obligations”.It comes after the highly controversial attendance of China’s vice-president Han Zheng, who has been blamed for the curtailment of freedom in the former British territory, at the King’s coronation.The decision to invite Mr Han was strongly criticised by China hawks on the Tory benches and Lord Patten, the last British governor of Hong Kong.The Foreign Secretary said he “made plain” the UK’s position on Hong Kong when he met with the Chinese vice-president in London ahead of the royal event.But James Cleverly argued that the UK must engage directly with China in a recent foreign policy speech, angering some Tory critics of China who want ministers to go further in distancing the UK from Beijing and to be more outspoken in criticising its leadership.",
        "Ahead of his trip, Lord Dominic Johnson said: “Hong Kong is one of the world’s leading international finance centres, and my visit will promote cooperation on sectors where we both excel – from financial services and infrastructure to clean growth and sustainability.“The UK’s ties with Hong Kong run deep, not only in our shared history and connection between our people, but in business and our desire to succeed. For future generations we have an obligation to engage – robustly and also constructively – and our engagement with Hong Kong is an important part of that.“I am clear that we will not look the other way on Hong Kong or duck our historic responsibilities to its people, and that we will continue to stand up for them, call out the violation of their freedoms and hold China to their international obligations.”The UK says China remains in breach of the 1984 Sino-British Joint Declaration, under which it has a duty to uphold Hong Kong’s high degree of autonomy and rights and freedoms.Hong Kong was handed over from the UK to China in 1997 with a promise by Beijing to keep western-style liberties under a “one country, two systems” framework."
    ]
}