{
    "articleURL": "/news/article-12052759/Fresh-calls-Rishi-Sunak-growth-Conservatives-suffer-local-elections.html",
    "content": [
        "Sir John Redwood urged Rishi Sunak to 'cut taxes' to win back lost Tory votersFormer Cabinet minister David Jones said voters wanted a 'lower tax regime' Rishi Sunak faced fresh calls to cut taxes yesterday after the Conservatives suffered a drubbing at the local elections.",
        "Tory MPs warned that the party had been punished at the polls for presiding over the highest tax burden in modern history – and urged the Prime Minister to change course.Mr Sunak's first electoral test ended with the Conservatives losing around 1,000 seats across England, with key local authorities such as Stoke-on-Trent, Swindon, Plymouth and Dover all falling to Labour.The Tories lost control at more than 40 councils as Labour became the largest party in local government across the country.The Liberal Democrats also made inroads into traditional Conservative heartlands, taking control of Windsor and Maidenhead, Stratford-upon-Avon and Dacorum in Hertfordshire.",
        "Experts said the results looked set to translate to an eight or nine-point poll lead for Labour – enough for the Conservatives to lose office at the next general election, but still short of the level needed to give Sir Keir Starmer and his party an overall majority. Seizing on the prospect of a hung Parliament, the Scottish National Party's Westminster leader Stephen Flynn said his party could hold the balance of power, 'putting Scotland in prime position to pull the strings of a minority UK government'.Mr Sunak admitted it was 'disappointing' to lose Conservative councillors. But he said he was 'not detecting any massive groundswell of movement towards the Labour Party or excitement for its agenda' – and insisted he would not change course.",
        "'What I am going to carry on doing is delivering on the people's priorities,' he added.But Tory MPs warned that the party's prospects would not improve until the crippling tax burden is eased.Sir John Redwood said last night: 'If the PM wants to win back lost Conservative voters he should try offering some Conservative policies. Cut taxes, get better value for state spending and go for growth.'Former Cabinet minister David Jones said Tory voters wanted 'a lower tax regime and control over illegal immigration'. Mr Sunak has acknowledged voters' frustration with the Conservative turmoil of the past year, saying that people were tired of the 'box set drama' at Westminster.Some Tory MPs warned that the party was paying the price for ousting former prime minister Boris Johnson last year.One source said: 'Sunak can't blame these results on last year's chaos. He started that chaos by knifing the most successful Tory election winner in 50 years.'But former party leader Sir Iain Duncan Smith said the election results were 'not about Rishi', adding: 'Anyone out there saying we need to change leaders needs their head examined.'Sir Iain added that next year's general election was still 'game on', but insisted that lowering the tax burden was 'critical' to Tory prospects of success.",
        "'People are fed up with us, they are fed up with the level of taxation and the cost of living,' he said. 'But this is not 1996, when the whole thing was collapsing – and Starmer is not Tony Blair.'We are in a stand-off with the electorate – a lot of our supporters stayed at home. We have now got to finally, properly deliver Brexit, including getting rid of all those regulations.'Sir Iain added: 'And we have got to get the economy going and cut this oppressive tax burden, which is not what people want from the Conservatives.'Alan Jarrett, the outgoing Tory leader of Medway council in Kent, was one of several Conservative councillors to blame national factors for the losses, saying the Government needs to 'get its act together'.Sir Keir hailed Labour's results as a breakthrough and said he was on course for Downing Street.Addressing activists in Medway yesterday, where his party took charge for the first time in more than 20 years, the Labour leader said: 'Make no mistake, we are on course for a Labour majority at the next general election.'But elections experts said it was far from clear that Labour had the momentum to secure an overall majority next year.In an analysis for Sky News, Professor Michael Thrasher said the results translated into an eight-point lead for Labour, which could deliver a hung parliament.",
        "Mr Thrasher, a professor of politics at the University of Plymouth, added that, with a uniform national swing, the results 'suggest that Labour is on course to become the largest party at the next election but falling short of winning an outright majority'.Fellow elections expert Sir John Curtice, professor of politics at the University of Strathclyde, said that while the results were 'unambiguously bad' for the Conservatives, the 'jury is still out' on whether Labour has made significant progress towards winning an overall majority.In a separate analysis, Sir John predicted Thursday's vote would equate to a nine-point Labour lead at a general election – the party's best result since it lost power in 2010, but one which would potentially leave Sir Keir 20 seats short of a majority. His analysis concluded that Labour would have won 35 per cent of the vote had the election been nationwide, with the Conservatives on 26 per cent and the Liberal Democrats on 20 per cent.Tory sources were last night clinging to signs that the Labour Party was still struggling to break through in some parts of the country, particularly on Teesside in the North East where the Conservatives clocked up a number of gains – including securing 11 seats in Stockton to become the largest party.",
        "In some key swing seats, such as Peterborough and Harlow, Labour went backwards.But the Conservatives gained only two councils, taking control at Torbay, in Devon, and Wyre Forest in Worcestershire – both of which had been under no overall control.Rishi Sunak's just been given the rudest of wake-up calls by the local elections. He now faces a challenge to persuade his jittery party to hold its nerve and stick with his programme, writes JASON GROVESIf Rishi Sunak was in any doubt about the scale of the challenge he faces then the local election results have given him the rudest of wake up calls.By 8am the Conservatives had already lost more than 200 seats. By the end of the day that number could well rise to 1,000 or more – very much at the worse end of expectations.Across the country, angry Conservative councillors were blaming the Government for their woes – and there were signs that that the Tory Right will make a fresh bid to force the Prime Minister to change direction on issues like tax.No one expected these results to be good for the Tories. After 13 years in power it would be hard for any Government to generate much excitement at this point in the electoral cycle. Throw in the cost of living crisis, the political turmoil of the last 12 months and the highest taxes since the Second World War and it is not hard to see why many former Tory voters have switched sides in protest or simply stayed away.",
        "But there will be deep concern that Conservative support is collapsing in parts of the country like Stoke-on-Trent and Boston, in Lincolnshire, where support for Brexit was strongest.Conservative MPs in the traditional Tory heartlands of the Home Counties will also be alarmed to see the Liberal Democrats making significant inroads in True Blue areas like Windsor and Maidenhead.Alan Jarrett, outgoing Tory leader of Medway council, in Kent, where Labour seized control for the first time in 20 years, summed up the mood by saying the government needs to 'get its act together'.Yet despite Labour excitement at gains in key target areas such as Stoke, Plymouth and Medway, it is far from clear that Labour has sealed the deal with the electorate in the way Tony Blair did in the local elections ahead of his 1997 landslide.In the early results, Labour was picking up barely half of the seats lost by the Conservatives, with the rest spread between the Liberal Democrats, Greens and local independents.The swing to Labour looks to be roughly in line with that achieved by Ed Miliband ahead of the 2015 election, which he went on to lose.Labour sources suggest that improved prospects in Scotland mean this kind of swing is enough to put Sir Keir Starmer on course for No 10 next year.But the failure to secure a decisive breakthrough will make it easier for the Tories to stoke fears of a Lib-Lab pact – and fuel questions about whether the public will ever embrace Labour's stuffy leader.",
        "It will also give Mr Sunak a glimmer of hope that all is not lost.The fact he is not facing more outspoken criticism this morning is testament to the effort he has put in to calming his fractious party in recent months.But the uneasy truce with the Tory Right is set to be tested in the coming weeks.David Campbell-Bannerman, chairman of the broadly pro-Boris Conservative Democratic Organisation, said the results showed there was a 'price to be paid' for pushing up taxes to record levels and suggested that a return for Mr Johnson 'should not be ruled out as an option for the longer term'.Mr Sunak will try to 'move on' swiftly next week by unveiling long awaited plans to ease access to GP appointments.But he now faces a renewed challenge to persuade his jittery party to hold its nerve and stick with his programme."
    ]
}