{
    "articleURL": "/wires/pa/article-12052953/One-50p-pieces-bearing-King-s-image-swapped-sword-coronation.html",
    "content": [
        "One hundred newly-minted 50p pieces bearing an effigy of the crowned King will be exchanged for a glittering Jewelled Sword of Offering as part of an ancient custom during the coronation.",
        "The Lord President of the Privy Council, and Leader of the House of Commons, Penny Mordaunt, will carry out the task, redeeming the sword for the bag of silver-coloured coins, worth £50 in total, at the altar in Westminster Abbey.She will become the first woman in history to present the intricate, tapered, priceless sword, which was made for George IV’s extravagant 1821 coronation, to a monarch.The exchange – modernised in decimalised currency introduced since the last coronation 70 years ago – forms a traditional part of the ceremony, when a peer used to offer the price of 100 silver shillings in return.",
        "The commemorative coins, made of cupro-nickel, were released by the Royal Mint last month to mark the coronation.They depict Charles wearing a Tudor crown, and, on the reverse, feature a drawing of Westminster Abbey by the Royal Mint’s resident designer, Natasha Jenkins, above the King’s cypher and crown.The small velvet bag was used at the coronation of Charles’s grandfather, George VI, in 1937 for the same purpose.The sword, which has a hilt encrusted with diamonds, rubies and emeralds and a scabbard decorated with jewelled roses, thistles and shamrocks, symbolises royal power and the monarch accepting his duty and knightly virtues.",
        "It will be blessed by the Archbishop of Canterbury, carried to the King by Ms Mordaunt and placed in the King’s right hand, then clipped to the golden coronation sword belt also known as the girdle around his waist.",
        "Then it will be unclipped, with the King stepping forward to offer it to the Dean of Westminster who will place it on the altar.Ms Mordaunt then receives the sword after exchanging it for the redemption money which she places on an alms dish held by the Dean.She draws the sword and carries it in its “naked” form – without its scabbard – before the monarch for the rest of the service."
    ]
}