{
    "articleURL": "/health/article-12038027/Oklahoma-16th-state-outlaw-puberty-blockers-sex-change-surgery-children-18.html",
    "content": [
        "It is now a felony for health care workers to give children puberty-blocking drugsOklahoma joins at least 15 other Republican states with laws banning such careREAD MORE: Trans patients are stockpiling hormone medication bought onlineOklahoma has become the 16th Republican state to outlaw puberty blockers and sex change surgery for children under 18.",
        "Republican Gov Kevin Stitt signed a bill on Monday that makes it a felony for healthcare workers to provide pharmaceutical interventions for children with gender dysphoria.There are concerns among Republican lawmakers about the lack of long-term safety data, which has seen other countries like the UK and Scandinavia restrict access too.",
        "Mr Stitt, who was reelected in November, made the ban a priority of this year's legislative session, saying he wanted to protect children. Transgender advocates and parents of transgender children say such care is essential and improves patients' mental health.Stitt signed bills last year that prohibit transgender girls and women from playing on female sports teams and prevent transgender children from using school bathrooms that correspond to their gender identity.He said in a statement released after the signing: 'Last year, I called for a statewide ban on all irreversible gender transition surgeries and hormone therapies on minors, so I am thrilled to sign this into law today and protect our kids.'We cannot turn a blind eye to what's happening across our nation, and as governor, I am proud to stand up for what's right and ban life-altering transition surgeries on children in the state of Oklahoma.'The bill Stitt signed on Monday makes it illegal to provide gender-transition medical care for anyone under the age of 18. Such treatment can include surgery as well as hormones and drugs that suppress or delay normal puberty.",
        "Several civil liberty organizations, including the American Civil Liberties Union of Oklahoma, have promised to 'take any necessary legal action' to prevent the law from taking effect.",
        "'Gender-affirming care is a critical part of helping transgender adolescents succeed, establish healthy relationships with their friends and family, live authentically as themselves, and dream about their futures,' Lambda Legal, the ACLU and the ACLU said in a joint statement.At least 16 states have now enacted laws restricting or banning gender-affirming care for minors: Alabama, Arkansas, Arizona, Georgia, Idaho, Indiana, Iowa, Kentucky, Mississippi, Montana, North Dakota, Oklahoma, Tennessee, Utah, South Dakota and West Virginia. Federal judges have blocked the enforcement of laws in Alabama and Arkansas, and nearly two dozen states are considering bills to restrict or ban care this year.US District Judge Jay Moody said that allowing Arkansas' law to forbid doctors from providing gender confirming hormone treatment, puberty blockers or sex reassignment surgery to anyone under 18 years old would hurt transgender youth currently receiving the treatments.In Alabama, US. District Judge Liles Burke ruled that Alabama had produced no credible evidence to show that transitioning medications are 'experimental'.He added that 'the uncontradicted record evidence is that at least twenty-two major medical associations in the United States endorse transitioning medications as well-established, evidence-based treatments for gender dysphoria in minors'.",
        "He noted testimony from a mother who said she feared her child would commit suicide if she lost access to the medications. ",
        "Colorado will become the first state to legally protect teen transgender treatment 'tourism' as part of a trio of bills signed by its Democratic governor.",
        "Three states - Florida, Missouri and Texas - have banned or restricted the care via regulations or administrative orders, and Missouri is the only one that also limits the treatments for adults. A judge has blocked Missouri's restrictions. Texas' governor has ordered child welfare officials to investigate reports of children receiving such care as child abuse, though a judge has blocked those investigations.Republican lawmakers across the country have advanced hundreds of measures aimed at nearly every facet of trans existence this year.That includes bans on gender-affirming medical care for minors, restrictions on the types of restrooms transgender people can use, measures restricting classroom instruction on sexual orientation and gender identity, and bills that would out transgender students who want teachers to address them by the pronouns they use.The Food and Drug Administration approved puberty blockers 30 years ago to treat children with precocious puberty, which causes sexual development to begin much earlier than usual. Sex hormones - synthetic forms of estrogen and testosterone - were approved decades ago to treat hormone disorders or as birth control pills.",
        "The FDA has not approved the medications specifically to treat gender-questioning youth, but they have been used for many years for that purpose 'off label,' a common and accepted practice for many medical conditions. Doctors who treat transgender patients say those decades of use are proof the treatments are not experimental.Research has shown that transgender youths and adults can be prone to suicidal behavior when forced to live as the sex they were assigned at birth. Proponents of the measure have raised concerns about children changing their minds. Yet the evidence suggests de-transitioning is not as common as opponents of transgender medical treatment for youth contend, though few studies exist and they have their weaknesses."
    ]
}