{
    "articleURL": "/news/article-12056673/How-woke-mob-Nebraska-drove-white-military-vet-suicide-killing-black-man.html",
    "content": [
        "On May 30, 2020, Marines veteran Jacob Gardner, 38, shot and killed Black Lives Matter protestor James Scurlock, 22, who had attacked his barGardner was not initially charged in the killing as it was ruled self-defense, but after public outcry, he was indicted for manslaughter months laterFearing he would be killed in prison or legal fees to mount a defense would bankrupt his family, Gardner killed himself A U.S. Marine vet died by suicide shortly after a woke mob led the charge for him to be charged following a self-defense shooting at the height of Black Lives Matters riots in Nebraska.",
        "Now, details of the incident are available and describe the shooting and how two lives ended in the incident.On May 30, 2020, at the peak of the George Floyd protests, Jacob Gardner, a white United States Marines veteran, shot dead a black man involved in the Black Lives Matter rioter outside his bar in Omaha, Nebraska.The shooting was described as self-defense as the black protestor jumped on his back and the vet, Gardner fired a lone, fatal shot.Months later, Gardner was dead by suicide after a woke mob cried for his prosecution despite the fact charges were not initially filed.Gardner was charged with manslaughter, more than a month after the shooting, and faced upwards of 95 years behind bars.The vet faced mounting legal bills and the prospect of prison and decided to end his life.",
        "On that May night, 38-year-old Gardner was guarding his bar armed with pistols and a shotgun while rioters, including 22-year-old James Scurlock, vandalized nearby businesses and closed in.Gardner was holed up at the bar with his father, and when one of their windows shattered, the 69-year-old pursued the people who broke it. While confronting the group, the elder man was shoved violently to the ground, and Gardner ran over to help him.",
        "An argument broke out where Gardner and Scurlock came face to face, and as the rioters closed in, the veteran flashed his pistol and threatened them to stay away. A woman jumped on Gardner's back, and as he was tackled to the ground, he discharged his weapon twice.After Gardner shook the woman from him, Scurlock jumped on his back. As the two grappled, Gardner reportedly pleaded with Scurlock to get off him. When there was no relent, Gardner pointed his gun over his shoulder and fired a single shot. Scurlock was shot in the chest and later died at the hospital.Scurlock's death heightened the tensions already boiling in Omaha just five days after George Floyd was killed in Minnesota.Omaha, Nebraska, was no different and the riots led to the confrontation between Gardner and Scurlock.In the following days, people began to turn on Gardner and villainize him for the shooting.Further demonstrations were sparked by the killing, and protesters demanded that Gardner be charged as accusations flew that it was yet another racist murder. That included riots in various communities.Rumors began to swirl that Gardner had a swastika tattoo and that his bar's sign had white-supremacist imagery hidden within it and was known for turning people away at the door based on their race. People said his father had become a white supremacist while serving time in a Texas prison for drug charges.",
        "But there were no records of his father ever serving time in prison, according to the New York Times, and Gardner's medical files had no details about a swastika tattoo.What was known about Gardner was that he had been given a presidential award for being one of the first Marines deployed to Iraq in 2003, and after serving he returned to Omaha and ran a successful bar, The Hive.When the pandemic hit, he was forced to shut the bar down for weeks and was hemorrhaging money. Just before the BLM protests broke out Gardner restocked the bar with enough alcohol to gross up to $90,000 in much-needed profits, according to the Times. As riots broke out, he was desperate to defend the bar and his inventory.Scurlock grew up poor in a largely black neighborhood in Omaha. He'd had periods of homelessness throughout his childhood, had gone to jail at 16 years old and by May 2022, he had a newborn child and planned to enroll in community college.Videos from that night showed Scurlock vandalizing a number of businesses, including an architecture firm next door to Gardner's bar, and evidence suggested he was the one who'd broken the bar window.When the pair clashed that night, witnesses said Gardner had been hurling racist slurs at Scurlock and his friends, while the Marine always vehemently denied the accusation. There is video of the incident but no audio and it is unclear what anybody is saying.",
        "Omaha County Attorney Don Kleine - a progressive Democrat - ultimately determined after an investigation that Gardner had acted in genuine self-defense and chose not to pursue charges.Some were not pleased with the decision. One local lawyer, Ryan Wilkins, a white man who had expressed a desire to be more aware of racism, wrote a number of essays pushing unfounded claims about Gardner's racial beliefs that went viral online.White State Senator Megan Hunt said the decision played into the hand of white supremacists, which she claimed Gardner was.'White supremacist groups, including ones Jake Gardner was in communication with, rely on you thinking that none of this is a big deal so they can organize their support,' she said.As pressure mounted, Kleine stepped away and ceded his decision a special prosecutor appointed to the case, Fred Franklin, a black man and former federal prosecutor from Omaha.Franklin's office said Gardner could have been hiding armed in his bar with the hopes that he could shoot a rioter as they broke in, but that when nobody entered he pursued them out for blood.That theory placed Gardner as an aggressor and therefore ruled out self-defense. Franklin's office indicted Gardner for manslaughter that September.Fearing for his safety, Gardner had left Omaha and was staying in Portland, Oregon, shortly after the killing, and when the charges were handed down, he was ordered back to Nebraska.",
        "The morning of his flight back to Omaha, Gardner shot himself and died. Before his death, Gardner had expressed fears to his parents that he would be killed in prison and the family would be bankrupt by a defense trial.A year after his death, Gardner's parents sued the county and Franklin. They cited Franklin's comments about the incident, which they called misleading, and said they led to their son's suicide. The lawsuit was tossed shortly after it was filed.  "
    ]
}