{
    "articleURL": "/news/article-12059547/Shocking-images-Portlands-homeless-shows-encampments-taking-area.html",
    "content": [
        "Homeless camps are sprawling across the streets, sidewalks, and canals in Portland, OregonDemocrat lawmakers in Oregon want to decriminalize homeless camps - but many residents are against it Shocking new images show Portland's mounting homeless crisis as encampments take over streets and sidewalks - and fed-up residents want the city to take action. ",
        "Local authorities in Oregon are also considering calling in the National Guard to help with Portland's homeless issue - while residents reveal they now no longer walk in certain areas because of the drug and encampment problem.The Health and Human Services and Public Safety Committee met last month for an emergency meeting to deal with the crisis - with more than 5,000 estimated homeless people in the city. According to WGME, city leaders say there are more than 100 tents in the city.This follows news that Democrat lawmakers in Oregon want to decriminalize homeless camps with a law that would allow the people who live in them to sue for $1,000 if they're harassed or told to leave.The hugely-controversial bill claims 'decriminalization of rest' would allow city leaders to 'redirect' cash from law enforcement into measures that 'address the root causes of homelessness and poverty'.Speaking to DailyMail.com about the bill, one resident said: 'I think there's got to be better ways to do that. I've already signed something saying I'm against it. I don't think it's a great idea.'",
        "And when asked about how the city has responded to the growing crisis, one said: 'It feels like Portland has a mixture of different people wanting different things. ",
        "'I would personally prefer to not see drug deals to happen in the middle of the day, in the middle of the street. 'If you feel like you can get away with that, what else do you think you can get away with. It feels like this is a band aid.' Another local resident living in Portland said: 'Generally among the people in Portland the feeling is that they're disappointed in the city, and where things are heading. 'The crisis with homelessness is a super complicated issue, but I don't think its letting people pitch tents wherever they want. It attracts a different tone to parts of the city that used to be really beautiful. 'I saw two people on the street the other day just smoking crack. The problem is growing. Every time I turn a corner there is another homeless camp somewhere, and I don't want that to be the case. There are certain places I won't walk.'  ",
        "Rep. Margaret Craven said: 'A shelter will keep people safe temporarily. But then they need permanent housing.' Julia Brim-Edwards, who is running for Multnomah County Commissioner in District Three in Portland, said: 'The county needs to take immediate effective action and the fact that we have thousands of people living on the streets without basic services, without a path to shelter or to permanent supportive housing is completely unacceptable and it’s a humanitarian crisis. ",
        "'It’s heartbreaking for the individuals who are in that situation and also for the neighborhoods and the community in which they’re living.'As a county commissioner, I’m really going to push for more immediate, urgent action to end street camping, help move those individuals into shelters where they’re safe, they get stabilized and get on a path to permanent supportive housing.' The radical decriminalizing proposal comes amid an explosion in camps in cities such as Portland, which has one of the worst crime rates in America, causing some people to move.The new homelessness bill has been met with furious complaints from citizens who claim Oregon's metropolitan areas have been ravaged by progressive policies that have cut police budgets while crime and drug use has spiraled out of control.The bill, HB 3501, was sponsored by Democrat representative Farrah Chaichi and her colleague representative Khanh Pham. It will be discussed at a hearing of the state's House Committee On Housing and Homelessness on May 4.",
        "'Many persons in Oregon have experienced homelessness as a result of economic hardship, a shortage of safe and affordable housing, the inability to obtain gainful employment and a disintegrating social safety net system,' the bill states.'Decriminalization of rest allows local governments to redirect resources from local law enforcement activities to activities that address the root causes of homelessness and poverty.'",
        "More than 2,000 letters of opposition have been submitted, compared to just 41 in support.The bill would allow homeless people to 'use and move freely in public spaces without discrimination and time limitations' - essentially stating they can reside in parks and on other public land indefinitely without question.'A person experiencing homelessness has a privacy interest and a reasonable expectation of privacy in any property belonging to the person, regardless of whether the property is located in a public space,' the bill adds.It would grant people 'experiencing homelessness' the right to 'rest in public spaces and seek protection from adverse weather conditions'. The bill further promises the right to 'pray, meditate, worship or practice religion in public spaces without discrimination based on housing status.'The bill also specifies a right to live in a vehicle or RV on public land 'provided that the vehicle is legally parked'.Any person whose rights under the proposal are breached is entitled to 'compensatory damages or $1,000 per violation, whichever is greater'. Penalties of $1,000 could be given to anyone who's deemed to have harassed a homeless person.",
        "In March, DailyMail.com reported how some Portland residents think the city has become lawless and 'post-apocalyptic' because of rising rates of homelessness and drug abuse.",
        "Earlier this month, Walmart announced they were leaving the city. 'We have nearly 5,000 stores across the U.S. and unfortunately some do not meet our financial expectations,' Walmart said in its announcement.'While our underlying business is strong, these specific stores haven't performed as well as we hoped.'Staff members have speculated out of control shoplifting is partly to blame.'It's definitely the theft,' said one. 'There's nothing political about it.'The shoplifting has been fueled by runaway drug abuse after Oregon voted to decriminalize recreational drugs in 2020 – a law referred to as Measure 110.",
        "Portland also made headlines recently after numbers that showed in 2022 there were more than 5,000 homeless people throughout the city.Residents of one Portland neighborhood say they are fed up with the growing homeless crisis after their area was cleared just to see encampments pop back up hours later.In the southeast part of the city, Ronny McFarland said unhoused individuals have lived on his block for two years and has witnessed everything from fights to strewn garbage to drugs littered on the street.'Everybody wants to leave, all my neighbors are talking about moving,' McFarland told Portland station KOIN.'Everyone's starting to look for something else. We are too. At this point, we've been house shopping trying to find a neighborhood where we don't have to deal with it,' the man said.",
        "McFarland said the issue on his street has become so out of control that the homeless encampments take up the entire sidewalk."
    ]
}