{
    "articleURL": "/wires/aap/article-12061387/Broad-sympathy-AFL-rivals-tackle-bans.html",
    "content": [
        "Richmond defender Nathan Broad feels for some rival players banned over dangerous tackles and believes he still owes his AFL club after missing four matches through suspension.",
        "Broad served the longest ban of the season to date following his two-motion sling tackle which concussed Adelaide's Patrick Parnell in round two.A growing number of players have been rubbed out amid a crackdown on slinging and dumping actions that put opponents at risk of injury, in particular concussion.But Broad believes many of the incidents that have attracted match review officer scrutiny have contained elements of bad luck as players navigate their way through tighter rule interpretations.\"Mine was a bit different because it was a second motion (in the tackle) and you should know (not to do) that,\" Broad told AAP.\"But I really do feel sorry for some of these blokes when they're getting weeks because it's a split-second thing in the moment.\"The game's going so bloody fast and these things are going to happen.\"We know they're going to happen, we sign up for it, it's a 360-degree contact sport so they are going to happen.\"But it's getting harder to umpire and it's getting harder to play. We'll keep going and keep trying.\"Broad was a key contributor in Richmond's much-needed win over West Coast last weekend, in his second game back from suspension.He blanketed dangerous forward Jack Darling as the Tigers snapped a five-match losing streak.",
        "The 30-year-old defender will be important to Richmond's chances of upsetting Geelong on Friday night and is desperate to repay his teammates after missing a month of football.\"One hundred per cent (I still owe the team),\" Broad said.\"It (the Parnell tackle) was an action that I knew as soon as I did it that I was done.\"I was more disappointed firstly for what I did to him (Parnell) and you don't like to see him knocked out, but what I did for the team too.\"I let them down and we went on a losing streak and you can't be there to help them out.\"I was very disappointed but now I'm just trying to make up for it as much as I can.\"Broad said limiting Eagles forward Darling to one goal from four disposals gave him confidence to take the fight to Geelong superstars Tom Hawkins and Jeremy Cameron.Blunting the gun duo will require a team effort, with Dylan Grimes and Noah Balta also set for key roles in defence.\"It was awesome to play on a quality player like Jack and get the job done. It gives you a boost going into the next week,\" Broad said.\"(Geelong) were a bit slow to get going, which can happen after premierships, but they are definitely up and about now.",
        "\"They're full steam ahead so we're going to have to be at our best.\"We're keeping teams to low scores, which is good.\"Our defence is holding up but a bit of polish going forward would be nice.\"I'm confident in the backs that we've got that we can hold them off.\""
    ]
}