{
    "articleURL": "/wires/ap/article-12054907/Nice-piles-pressure-Rennes-French-league-win.html",
    "content": [
        "PARIS (AP) - Lens was too solid and too clinical for Marseille in their showdown for the runner-up spot in the French league on Saturday.",
        "Lens, the team with the best home record this season, defeated the best side on the road 2-1 to leapfrog Marseille into the second spot and put pressure on stumbling leader Paris Saint-Germain.Goals from Seko Fofana and Lois Openda gave Lens a 15th home win and moved it two points above Marseille, and just three behind PSG. The league leader travels to Troyes on Sunday.\"Frankly, it was an exceptional match, we knew it was a match to move past Marseille again,\" Openda said after taking his league tally to 19 goals. \"We showed what we wanted to achieve in this league. We have four matches left to play, they will be crucial.\"In a buoyant atmosphere at the packed Stade Delelis-Bollaert, Marseille had the upper hand for long spells and imposed its trademark high press to unbalance the host. But it struggled to get past Lens' solid three-man defense, which has conceded just 26 goals in 34 league matches.\"When you are not at your best against this team, it's normal to lose the match,\" Marseille goalkeeper Pau Lopez said. \"There are many things that we have done wrong and that we need to improve.\"",
        "The defeat ended Marseille's unbeaten run of 11 matches away from home. The visitors pushed hard until the end and substitute Dimitri Payet pulled one back in the 87th, but it was too late.",
        "\"It could have gone either way,\" Marseille defender Jonathan Clauss said.The match scenario could have been dramatically different if Marseille striker Alexis Sanchez's goal had not been disallowed after just eight minutes.Under pressure, Lens defender Kevin Danso was not fast enough in clearing a back pass and could not resist Sanchez´s challenge, giving the ball away to the Chile international. Sanchez then dribbled past goalkeeper Brice Samba to break the deadlock and silence the home fans.Marseille´s celebrations were shortlived, though. The goal was ruled out after a VAR review that convinced referee Clement Turpin that Sanchez fouled Danso in the buildup to the goal.Lens then gradually found its rhythm and spent more time in Marseille´s half. The host's first chance came in the 22nd minute when Fofana unleashed a powerful and precise strike that crashed onto the post.Fofana had another occasion to score from long range four minutes before halftime, and took it. Lurking outside the box, the Ivory Coast midfielder connected with a back pass and beautifully curled the ball into the right corner.Marseille did not release its pressure and Jordan Veretout´s low strike forced Samba to a diving save in first half stoppage time.The visitors looked less flamboyant after the interval following Sanchez's substitution with Vitinha and were punished a second time near the hour mark.",
        "Florian Sotoca and Przemyslaw Frankowski combined well down the right side from a throw-in, with the latter having the better of his marksman to deliver a perfect pass at the far post, where Openda headed the ball home.RENNES AND LILLE MISFIRENice striker Gaëtan Laborde scored in a win against his former club on Saturday and cost Rennes precious points in the race for European football next season.With four games left to play, the 2-1 loss left Rennes in sixth place, three points behind Lille, which lost at Reims 1-0. The fifth-placed side in Ligue 1 qualifies for the Conference League playoffs stage.Lille missed the chance to leapfrog fourth-placed Monaco when Reims snapped a three-match losing streak thanks to Marshall Munetsi's winner.___More AP soccer: https://apnews.com/hub/Soccer and https://twitter.com/AP_Sports"
    ]
}