{
    "articleURL": "/sport/football/article-12039063/West-Ham-boss-Moyes-says-defenders-physical-Haaland-bid-stop-Man-City-striker.html",
    "content": [
        "Haaland has already scored 50 goals for Manchester City in his debut seasonGuardiola admits even Man City are 'surprised' by Haaland’s goal-scoring feats West Ham boss Moyes says the only way to stop Haaland is to get tight to himThe only way to stop Erling Haaland is to leave him counting the bruises, David Moyes will tell West Ham’s defenders on Wednesday night.",
        "The Manchester City striker scored twice on his Premier League debut against the Hammers in August, one a penalty and the other thanks to his pace after he latched on to a Kevin De Bruyne pass.According to West Ham’s manager Haaland is already a Premier League great, up there with Thierry Henry and Dennis Bergkamp. And as a former defender himself, he was asked how he would have dealt with Alan Shearer in his heyday or Haaland today.‘I would have tried to battle them!’ said Moyes. ‘Shearer would have beaten you up as much as you would have beaten Shearer up.",
        "‘Haaland, you might be able to try to get into him a bit more. You would need to try to get as tight as you can, get as physical as you can and leave a bit on them.‘Sadly you can’t get away with that as much these days, but it would be hard to deal with him in any other way.’The problem for West Ham is they are without Kurt Zouma, their central defender who suffered ankle ligament damage at Crystal Palace on Saturday. So it is over to Nayef Aguerd and Angelo Ogbonna to try to stop Haaland.‘I have come up against loads of players I thought were unplayable,’ said Moyes.",
        "‘At the moment, Haaland is one of those brilliant players blowing everyone away. You are hoping he has a weakness, but he is all-round.’Earlier this season, some critics said City were a worse team with Haaland in it.‘I think he might have had a poor week and we all got a bit carried away,’ Moyes smiled."
    ]
}