{
    "articleURL": "/wires/ap/article-12053989/Pro-Kremlin-novelist-injured-car-explosion-Russia.html",
    "content": [
        "TALLINN, Estonia (AP) - Russia's top investigative agency on Saturday said the suspect in a car bombing that injured a prominent pro-Kremlin novelist and killed his driver has admitted acting at the behest of Ukraine's special services.",
        "The blast that hit the car of Zakhar Prilepin, a well-known nationalist writer and an ardent supporter of Russia's war in Ukraine, was the third explosion involving prominent pro-Kremlin figures since the start of the conflict.It took place in the region of Nizhny Novgorod, about 400 kilometers (250 miles) east of Moscow. Prilepin was hospitalized with broken bones, brusied lungs and other injuries; the regional governor daid he had been put into a \"medical sleep,\" but did not elaborate.Russia's Investigative Committee said the suspect was a Ukrainian native and had admitted under questioning that he was working under orders from Ukraine.The Foreign Ministry in turn blamed not only Ukraine but the United States as well.\"Responsibility for this and other terrorist acts lies not only with the Ukrainian authorities, but with their Western patrons, in the first place, the United States, who since the coup d´etat of February 2014 have painstakingly nurtured the anti-Russian neo-Nazi project in Ukraine,\" the ministry said, referring to the 2014 uprising in Kyiv that forced the Russia-friendly president to flee.",
        "In August 2022, a car bombing on the outskirts of Moscow killed Daria Dugina, the daughter of an influential Russian political theorist often referred to as \"Putin's brain.\" The authorities alleged that Ukraine was behind the blast.",
        "Last month, an explosion in a cafe in St. Petersburg killed a popular military blogger, Vladlen Tatarsky. Officials once again blamed Ukrainian intelligence agencies.Russian news outlet RBC reported, citing unnamed sources, that Prilepin was traveling back to Moscow on Saturday from Ukraine´s partially occupied Donetsk and Luhansk regions and stopped in the Nizhny Novogorod region for a meal.Prilepin became a supporter of Russian President Vladimir Putin in 2014, after Putin illegally annexed the Crimean peninsula. He was involved in the conflict in eastern Ukraine on the side of Russian-backed separatists. Last year, he was sanctioned by the European Union for his support of Russia's full-scale invasion of Ukraine.In 2020, he founded a political party, For the Truth, which Russian media reported was backed by the Kremlin. A year later, Prilepin's party merged with the nationalist A Just Russia party that has seats in the parliament.A co-chair of the newly formed party, Prilepin won a seat in the State Duma, Russia's lower house of parliament, in the 2021 election, but gave it up.Party leader Sergei Mironov called the incident on Saturday \"a terrorist act\" and blamed Ukraine. Russian Foreign Ministry spokeswoman Maria Zakharova echoed Mironov's sentiment in a post on the messaging app Telegram, adding that responsibility also lay with the U.S. and NATO.",
        "\"Washington and NATO have nursed yet another international terrorist cell - the Kyiv regime,\" Zakharova wrote. \"Direct responsibility of the U.S. and Britain. We're praying for Zakhar.\"The deputy chair of Russia's Security Council, former President Dmitry Medvedev put the blame on \"Nazi extremists\" in a telegram he sent to Prilepin.Ukrainian officials haven't commented directly on the allegations. However, Ukraine's presidential adviser, Mykhailo Podolyak, in a tweet on Saturday, appeared to point the finger at the Kremlin, saying that \"to prolong the agony of Putin´s clan and maintain the illusionary `total control,´ the Russian repression machine picks up the pace and catches up with everyone,\" including supporters of the Ukraine war."
    ]
}