{
    "articleURL": "/wires/ap/article-12046673/In-Ukraine-s-forests-soldiers-race-push.html",
    "content": [
        "SOMEWHERE IN CENTRAL UKRAINE (AP) - The fighters depart at dawn, single-file, rifles slung, compasses in hand, and disappear like chameleons into the lush greenery of central Ukraine´s dense forests.",
        "They´re training for a long-anticipated campaign that Ukraine hopes will shift the momentum of its war with Russia.It´s a crash course in new assault tactics for the National Guard squad, a mix of volunteers whose ages range from 22 to 51. The squad is part of a brigade that´s been chosen to prepare for a counteroffensive, and it´s had just a few months to train on new skills and incorporate new recruits. By their own admission, the servicemen have outdated weapons, and many feared not enough training or resources. But they said when the time comes, they will be ready to fight.The Associated Press joined a unit of the Stalevy Kordon or Steel Border, a brigade of Ukraine´s National Guard. Over a year since Russia invaded Ukraine, the war´s front lines have been all but static for months, with Russian forces holding nearly a fifth of the country. The U.S. and other allies have boosted Ukraine´s arsenal with modern weaponry, but critical shortages of ammunition and manpower persist.The squad´s men, and its leaders, have no idea when or where the counteroffensive will begin. But they know they haven´t got long to prepare.\"We are preparing for big actions right now. No one will tell us what they are. We get an order - maybe tomorrow, maybe in one month, we don´t know - to go to point `X,'\" said one of the squad´s leaders, known by his call sign Grunwald. \"We are preparing every day.\"",
        "The unit spoke to the AP on the condition that they be identified only by first names or call signs and that the region where the trainings are taking place not be named.Defense Minister Oleksii Reznikov has said preparations for the advance \"are coming to an end.\"Details beyond that are scarce.\"As soon as it is God´s will, the weather and the commanders´ decision, we will do it,\" Reznikov added in a online briefing on Friday.In the forest, the servicemen tread carefully, the earth crunching underfoot as their eyes and ears stay alert for signs of enemy drones or vehicles passing by. Every few minutes they halt to assess unusual sounds, crouching low and ready to shoot.Serhii, a former airport immigration officer, chain smokes and checks his compass every few meters. They were supposed to go 8 kilometers (about 5 miles) over two hours, but they have been walking for nearly three hours already.They stop for a break under the shade of giant pines. Roma, among the youngest fighters there, is worried.\"I think we went too far,\" he said.The day´s test, prepared by Grunwald, contains multiple elements: Move through the thick woodlands undetected, launch drones to uncover exact enemy coordinates, pass the coordinates to the artillery unit, and then dive in for the assault.",
        "Most important, the fighters must not be seen. One small error, and the entire operation - and squad - is lost.To prepare for the possibility of Russian GPS jamming, they´re using only compasses to navigate.Russia has spent years building up high-power jamming systems capable of emitting radio waves to spoof or throw off GPS navigation. The traditional compass can´t be jammed.But it´s harder to use. A single degree of compass error could throw the squad 100 meters (yards) off course. The squad must learn how to reach the target despite this.When squad commander Mazhor - a call sign meaning \"rich guy\" - presents the plan, one fighter scoffs. \"He thinks that one person is a robot capable of assaulting a trench, securing the enemy´s logistics hub, capturing an airport, stealing an MiG jet and landing it in Moscow, right?\" Ihor said.\"This is a war of artillery and drones,\" said Grunwald. But the unit does not have enough of either. The fighters carry old rifles and use simple quadcopter drones for reconnaissance missions.Grunwald is currently trying to raise money to buy more advanced drones that would be easier to use, ideally ones that can carry bombs.Squad members often bring up the limits of their training. Some tell Mazhor his directives would be confusing on a real battlefield. They criticize comrades for not being more vigilant.",
        "But every serviceman asked said he'd be ready when ordered into battle.\"At beginning of war, we didn´t know anything, but now we are more experienced,\" said Serhii. \"All these trainings are making us sharper. We will be ready.\"After a long detour, the squad members eventually find their way to the point where the reconnaissance drone is launched to pinpoint enemy positions. The coordinates are passed to the mortar unit.\"Victory in five minutes,\" said Serhii, speaking into a walkie-talkie.In the end, they emerged after eight hours, having trekked 18 kilometers (11 miles) through swamp, dirt and brush. The coordinates they sent were a little off, missing the key targets in the enemy position.\"The personnel completed the objective to 90%,\" said Mazhor. In a real battle, an operation like this takes days, with painstaking planning done in advance. \"They were disoriented at some point, they went a bit off course.\"\"A 10% mistake,\" he added. \"As the unit commander, I think 10% is a very good result.\"___Follow AP´s coverage of the war in Ukraine: https://apnews.com/hub/russia-ukraine"
    ]
}