{
    "articleURL": "/news/article-12046001/Just-Stop-Oil-eco-zealots-bring-London-standstill-23-arrested-yesterday.html",
    "content": [
        "The environmental activist group pledged to continue protesting until they 'win'They are calling on Government to halt all new oil and gas consents and licencesJust Stop Oil activists brought parts of London to a standstill again this morning, as a former royal protection officer warned they could be shot if they disrupt the Coronation.",
        "Thirty supporters of the environmental activist group continued to slowly and 'peacefully' march from Queen Victoria Street in the City, as they call on the Government to end licensing and consents for any new fossil fuel projects in the UK.The group has pledged to 'slow march' in the early mornings on selected weekdays and midday every Sunday at Parliament Square until they 'win'. Today's disruption at Bank and Blackfriars Station follows the arrest of 23 members of the eco group yesterday after they marched from Downing Street to Parliament. But a former royal protection officer has warned protesters planning to disrupt the Coronation on Saturday, May 6, could be shot by police if they run out towards a carriage just in case they are carrying a bomb.",
        "A record 11,500 police officers – a large number of them armed – will guard London this weekend in what is set to be the biggest security operation in British history. This warning comes after the group have caused chaos across London for more than a week, holding slow marches in the middle of the capital's busy roads. In a statement released by Just Stop Oil today, they said: 'From around 8am, over 30 Just Stop Oil supporters began marching from Queen Victoria Street in the City of London. Just Stop Oil supporters have been slow marching in the capital every day since the 24th April.'",
        "Yesterday, an eco-zealot from Just Stop Oil was accused of 'faking injuries' after footage emerged of a car appearing to drive into the activist stood in the road. A video was released showing a driver making their way down the road, regardless of the protesters in the street, as an activist can be seen falling onto the ground. The group claimed the vehicle had 'rammed into a peaceful protester' - but the footage has been branded by some critics as 'terrible acting'. In speaking out about yesterday's arrests, a Just Stop Oil spokesperson said: 'Yesterday, 23 good people were arrested for peacefully marching between Downing Street and Parliament, in accordance with their fundamental human rights. Rights that are protected under international law. All legal avenues for dissent have now been banned by this illegitimate, criminal government. 'The protesters continued to state they will halt their campaign when the government makes a 'meaningful statement to end licensing and consents for any new fossil fuel projects in the UK'. ",
        "They added that they will 'slow march from 7am every weekday and midday every Saturday, at Parliament Square until we win.' One of those arrested yesterday, Sam Johnson, 39, a construction worker from Norwich, spoke while in handcuffs. He said: 'I've been arrested outside the Houses of Parliament. We have, under British law, the right of necessity to protect ourselves and the ones we love. ",
        "'We are here today on behalf of our sons, daughters, nieces and nephews. We have been detained and arrested, purely for peacefully demonstrating. 'We are simply demanding the British Government halt all new fossil fuel licences. This is the most basic, reasonable demand, upheld by the entirety of the world's experts.'But former royal protection officer Simon Morgan, now director of operations at security firm Trojan Consultancy, said demonstrators need to be aware that they will be in the middle of an armed policing operation during Charles' Coronation this weekend.Mr Morgan said: 'It's an armed policing operation because of the threat that the UK faces, the threat that the royal family faces, dignitaries that are attending. So we have to be very careful.'Somebody that's going to run out in front of the carriage, fiddling with something in their rucksack, who's to say that's not an IED rather than a banner that's just going to be unfolded.'These demonstrators have to be very careful as to the environment that they're going into, the police are acutely aware of it.'",
        "The most serious risk factors that police chiefs have to plan for include terror attacks and the threat from fixated individuals who are obsessed with certain people in the public eye, he said.",
        "'Then you'll be looking at the single cause issue,' Mr Morgan said. 'Those people that will use the glare of the media spotlight to highlight their cause globally, and for that I include Just Stop Oil, Extinction Rebellion, the Not My King anti-monarchist movement.'And then ultimately you still have the common or garden criminals who will look to pick pockets and steal things; sex offenders who will come in and commit indecent assaults, things like that - all that will be part of the policing plan.'Mr Morgan, who also has experience in public order policing and firearms, said measures could be taken to avoid vehicle attacks or bomb attacks as seen in London and Manchester in 2017.The procession route will be lined by thousands of police officers watching the crowd, with plain clothes colleagues also mixing with members of the public. Therefore, road closures and vehicle barriers would reduce the risk of a Westminster Bridge-style attack, while searching anyone with a big bag or in unseasonal clothing could help stop a bomber.International events also need to be taken into consideration, and MI5 and MI6 will have been monitoring 'chatter' to disrupt any potential plots, Mr Morgan said. A HMS Diamond, a Type 45 destroyer capable of tracking drones from 250 miles away, will also stand guard on the Thames over the King's Coronation weekend.",
        "The warship will be docked at Greenwich to 'celebrate the Coronation' and host VIP cocktail parties and performances by the Royal Marines band.But naval sources told The Sun it would just take a 'flick of a switch' to trigger its air defence systems - which includes up to 48 Sea Viper missiles."
    ]
}