{
    "articleURL": "/wires/reuters/article-12050193/Norway-wealth-fund-vote-against-Paolo-Scaroni-Enel-chair.html",
    "content": [
        "OSLO/ROME, May 5 (Reuters) - Norway's sovereign wealth fund, the world's largest single stock market investor, will vote against Paolo Scaroni becoming chair of the board at utility Enel, adding to a growing revolt over the Italian Treasury's nomination.",
        "The Norway fund joins other Enel shareholders which are opposed to Scaroni's appointment because of concerns over governance at the state-backed utility.The fund will vote in favour of Marco Mazzucchelli, it said on its website on Friday. He is a former banker who is the candidate for chairman proposed by hedge fund Covalis Capital in a challenge to Italy's Treasury, Enel's largest shareholder with almost a 24% stake.The tussle over board nominations is developing into a broader test of Rome's sway over state-backed companies which are listed on the stock exchange, and the outcome of Enel's shareholder vote on May 10 appears uncertain.The Treasury last month nominated AC Milan soccer club chairman Scaroni, a former CEO of both Enel and energy group Eni, to chair the utility.Rome also proposed Flavio Cattaneo, vice-president of high speed train operator Italo, to replace Francesco Starace, who has been chief executive since 2014.Covalis, which has a stake of around 1% in Enel, has put forward its own list of board candidates, and said the Treasury nominations undermined \"shareholder democracy.\"While supporting Mazzucchelli for chairman, the Norwegian wealth fund said it would back other board nominees proposed by asset manager association Assogestioni, which represents institutional investors.The Norwegian fund owns a 2.17% stake in Enel, as of the end of 2022, the latest fund data available.",
        "Italian unions Filctem Cgil, Flaei Cisl and Uiltec Uil have expressed concerns about the impact of the battle on how the company is run, calling for increased investment and protection of workers' rights.\"We won't be passive spectators of financial disputes, we want to have an impact on the strategic choices made by the companies,\" the three unions said in a joint statement. (Reporting by Gwladys Fouche in Oslo and Francesca Landini in Milan, Writing by Keith Weir. Editing by Terje Solsvik and Jane Merriman)"
    ]
}