{
    "articleURL": "/money/bills/article-12038299/Could-save-885-bills-tap-unclaimed-discounts.html",
    "content": [
        "Some £19bn left unclaimed each year according to consultant Policy in PracticePeople on low income or benefits may be eligible for 100% council tax reductionAround 4.3m households are eligible for special broadband and phone dealsWould you turn down £885 a year? That's the amount more than 21 million households in the UK are failing to claim in benefits and discounts, a study reveals.",
        "It amounts to a staggering £19 billion that is left unclaimed each year, according to consultancy Policy in Practice.From water bills to council tax and telecoms, there are substantial savings out there for pensioners, those on low incomes or in receipt of certain benefits.Yet millions are missing out because they simply do not know these deals exist. In some cases, providers are so bad at flagging them to customers that it appears they may not want them to claim them. ",
        "Confusing rules around who is eligible can also make it difficult to know where to start.Here, Money Mail guides you through what is exactly up for grabs.WaterWater companies offer social tariffs for low-income households. However, 5.7 million eligible households are missing out, leaving an estimated £900 million on the table, according to Policy in Practice. That equates to £158 per person. This is because, rather confusingly, eligibility and the kind of support provided varies between water companies.For example, Affinity, which supplies drinking water to 3.8 million people in the South-East, has a social tariff called 'Lift'. It is available to households with an income lower than £17,005, or who are in receipt of universal or pension credit.Annual bills are capped at £115.10, while those on council tax reduction or support might be eligible for a higher rate discount where the clean water bill will be fixed at £76.70.",
        "South West Water has 'WaterCare', which can reduce bills by between 15 per cent and 85 per cent. It is designed for those with an annual household income of less than £15,340, of which your water bill has to make up more than 5 per cent.The Consumer Council for Water has a list of all the tariffs at ccw.org.uk.",
        "Council TaxIf you are on a low income or claim benefits, you could be eligible for a reduction in council tax of up to 100 per cent.What you receive depends on your income, number of dependants and where you live, as each council runs its own scheme. For example, Brighton and Hove City Council applies discounts on a sliding scale depending on earnings. Anyone on less than £3,992 a year can apply for an 82 per cent discount on their council tax, while those on £14,258.40 a year are eligible for 10 per cent off.Apply to your local council for Council Tax Reduction (also called Council Tax Support).EnergyThere is no social tariff in the energy sector. However, charitable bodies such as Citizens Advice and Age UK have been calling on the Government to put a scheme in place, and it is considering recommendations for a 50 per cent energy discount for those in need.",
        "Help currently in place includes the Cold Weather Payment over the winter months, which pays £25 if the average temperature in your area is recorded, or forecast to be, zero degrees celsius or below over a period of seven consecutive days between November 1 and March 31. This is payable to those on pension credit or other benefits.",
        "Other schemes include the Winter Fuel Payment for pensioners to help with their heating bills and the Warm Home Discount for those on low income or pension credit. More than two million households fail to claim the Warm Home Discount, worth a combined £314 million, according to Policy in Practice.The scheme provides a one-off £150 discount on electricity bills in winter. It will reopen in October 2023. Find out more at gov.uk/ the-warm-home-discount-scheme. To qualify you must either get the 'guarantee credit' element of pension credit, or receive certain means-tested benefits or tax credits and have high energy costs.Meanwhile, the Winter Fuel Payment is available to those born before September 26, 1956 — they are eligible for between £250 and £600 towards their heating bills.BroadbandAround 4.3 million households who receive Government benefits are eligible for special broadband and mobile phone deals, also known as social tariffs.These offer superfast internet speeds, and a price freeze for the duration of the contract, for as little as £12 a month, which could save households £200 a year.",
        "But research by telecoms watchdog Ofcom has found that just 5 per cent of eligible households are signed up to a discounted package.If you or someone in your household claims universal credit, pension credit or other means-tested benefits, you could switch to any of the tariffs available.Known as 'the best kept secret in broadband', Ofcom and consumer champion Which? are urging people to contact their providers to see if they are eligible. Ofcom has a list of social tariffs and providers at ofcom.org.uk.Pension credit Pension credit tops up your weekly income to £201.05 if you're single, or to a joint income of £306.85 if you have a partner. However, 850,000 eligible households fail to claim it, found Policy in Practice.If your income from pensions, employment and most social security benefits is below these thresholds, you may be eligible. You can still claim if you have savings. But if you have more than £10,000, every £500 over £10,000 counts as £1 of income a week.If you receive pension credit and are over 75, you are also entitled to a free TV licence.Leisure &amp; SportMany councils and venues offer discounts to low-income households, benefit claimants, pensioners and people who have mobility issues.Derby City Council, for example, offers 40 per cent off activities such as gym membership and golfing for the over-65s, disabled people, the unemployed and students.",
        "The National Trust and English Heritage have discounted rates for membership for the over-60s. Many theatres and cinemas around the UK offer special rates for pensioners and the unemployed.Odeon cinemas run special screenings for the over-60s for as little as £3.50 as part of its Silver Cinema scheme — and coffee, tea and biscuits are often provided with your ticket.A chain of 261 gyms and leisure centres, called Better, has concessionary membership for anyone in receipt of government benefits.Sports such as football, cricket and rugby have discounted tickets for older fans, usually the over-65s, and also offer free or discounted tickets for accompanying carers.moneymail@dailymail.co.uk",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}