{
    "articleURL": "/health/article-12050183/500-NHS-nurses-Nigeria-struck-fraudulent-incorrect-exam-results.html",
    "content": [
        "Exam results testing nurses' math skills and clinical expertise are now in doubtRead more: The £130,000 job ad tempting NHS junior drs to move to AustraliaMore than 500 midwives and nurses working in the UK could be struck off following a probe into a test centre in Nigeria, the regulator has warned.",
        "The Nursing and Midwifery Council said the registrations of those who passed exams at the centre could be 'fraudulent or incorrect'.To make sure internationally educated professionals have the right knowledge and skills to provide high-quality care in the UK, they must take a two-part test of competence before joining the NMC register - a computer-based test (CBT) usually sat in their home country, and a practical test (OSCE) in the UK.The CBT covers numeracy, including questions on drug dosage, as well as clinical questions, such as what health problems patients with diabetes are vulnerable to suffering from. An organisation called Pearson VUE, which runs the CBT programme on the NMC's behalf, recently alerted the regulator to 'anomalous data' at one of its third-party CBT test centres in Ibadan, Nigeria.",
        "Pearson VUE stopped testing at this centre immediately. A total of 512 people on the NMC register - around 5 per cent of all on the register who qualified in Nigeria - took their CBT at the test centre.The NMC is now writing to them to set out what has happened and to tell them they are opening cases 'to determine whether or not they gained fraudulent or incorrect entry to the register'.It added that there are more people who have applied to join the register after passing their exam at the centre but have yet to be added to it. They have had their applications paused and are being invited to retake the test.",
        "The NMC said: 'Our paramount concern is to maintain the integrity of the register to protect the public.",
        "'At the same time, it's critical we approach any investigations about individuals objectively and transparently, avoiding any unfair discrimination.'It's also important to remember that we've not yet made any determinations about individuals.'Pearson VUE has reviewed all data relating to the NMC's CBT from every test site globally, and there is no evidence of similar activity at any other site.'Andrea Sutcliffe, NMC Chief Executive and Registrar, said: 'Data from one test site in Nigeria is unusual and concerning.'We have regulatory processes which we will now follow, and if necessary, we can refuse registration or remove people from our register, to protect the public and people who use health and care services.'We know the public and people who use services may find this worrying.'This affects just over 500 out of the 771,445 professionals on our register.'They will all have passed the practical test in this country before they were accepted onto the register and to date no concerns have been referred to us about their fitness to practise.'We should remember that thousands of nurses and midwives who were educated overseas have safely joined our register recently and continue to provide safe, effective and kind care across the UK.'",
        "The NMC uses a Test of Competence (ToC) to assess the skills and knowledge of people applying to join our register from overseas.This has two main parts: a multiple-choice computer-based test known as the CBT which applicants usually sit in their home country; and a practical test known as the OSCE which people take in the UK.",
        "A company called Pearson VUE runs the CBT. They have been the NMC's test provider since 2014, when the test was introduced.A total of 1,970 candidates took their CBT at this centre, of whom 512 are on the NMC register.The NMC has since been working urgently with Pearson VUE to examine data and evidence about this. It is also scrutinising the full applications of those who have joined the register.The NMC is giving people the option to retake the and the test provider is covering the candidate exam fee costs.The regulator cannot make people resit – it will be their decision.If somebody does retake and passes, it will not guarantee that they will gain entry to the register or be able to stay on it, but it will form part of the information the NMC will use to make a final decision.",
        "The NMC said it will consider the need for interim orders on an evidenced basis as part of each case it is opening to determine whether or not individuals gained incorrect or fraudulent entry to the register.",
        "It is looking into concerns and 'if necessary to manage risk' it can apply to panels to restrict individuals' practice.The NMC confirmed that at this stage, no fitness to practise concerns have been raised about anyone on the register in this group.But it added: 'Clearly, if someone has gained entry to the register incorrectly or fraudulently then the NMC will need to take action.''The NMC is approaching investigations about individuals objectively and transparently, avoiding any unfair discrimination.'It has not yet made any determinations about individuals.'Unless the NMC decide there is sufficient evidence to seek an interim suspension order, individuals will be able to continue to work.'It comes after the NMC yesterday announced it will withdraw approval for the midwifery course at Canterbury Christ Church University over 'serious concerns' it has with the quality of its training.The regulator said: 'We're concerned that the university, in partnership with the NHS trusts that provide placements for its students, is not equipping midwifery students to meet our requirements.'In particular we are concerned about students not gaining the skills and expertise to deliver safe, effective and kind care when they join our register.'That means, from May 10, the midwifery programme will no longer lead to registration as a midwife in the UK.",
        "The NMC and NHS England are working to see if existing students can transfer to a different university in order to finish their studies and graduate."
    ]
}