{
    "articleURL": "/health/article-12042615/Packaged-food-marketed-children-60-PERCENT-higher-sugar-lower-nutrient.html",
    "content": [
        "Snacks with child-friendly packaging had 14.7g total sugars compared to 9gThey were also lower in protein, fiber, calcium and iron than adult packagingREAD MORE: I'm a cardiologist. These are the seven foods I'll never eat - and whyFood marketed to children is 60 percent higher in sugar and far less nutritious than snacks aimed at adults, a study has warned. ",
        "Researchers from the University of Toronto, Canada, found that snacks with child-friendly packaging like cartoon characters and multicolored designs contain on average 63 percent more sugar, the equivalent of one-and-a-half teaspoons.They are also lower in protein, fiber, calcium and iron — nutrients that are important for growth and development, particularly in younger children. The researchers said that the current lack of standards for child-friendly marketing on food is 'concerning'. More than one in five US children and teens are obese. They are more likely to remain overweight for the rest of their lives, putting them at risk for a multitude of health issues.",
        "The Food and Drug Administration approved Wegovy to try and fight the obesity epidemic but drew criticism for not tackling the issue at its root by encouraging healthier lifestyles. According to the Canadian study of almost 6,000 items, products with child-appealing packaging had an average of 14.7g total sugars compared to 9g in non-child-appealing — 63 percent higher.Some 5,850 items of child-relevant packaged food were evaluated from the Food Label Information Program database.Researchers looked at the foods which they deemed a top priority for analyses of child-appealing marketing, including cakes, grain bars, cereals, cookies and pudding.Some of the examples of marketing they mentioned include branded characters such as Cap'n Crunch, Tony the Tiger, Toucan Sam, Kraft Bears and Pillsbury Doughboy. ",
        "The categories with the highest proportion of products displaying child-appealing marketing on their packages were toaster pastries, cereals and crackers.Candy, ice cream, cookies, meals and juice also had a high prevalence of child-friendly packaging.All products were evaluated under the nutrient thresholds proposed by Health Canada as part of an upcoming Bill.The thresholds for sodium, total sugars and saturated fat are roughly five percent of the daily value for each.According to the proposal, if a product exceeds one or more of the nutrient thresholds, it would not be permitted to be marketed to children.They found that 98 percent of child-appealing packaging exceeded Health Canada's proposed thresholds, compared to 94 percent of non-child appealing packaging. The child-appealing packaging items were also lower in all other 'positive' nutrients measured.Techniques such as the use of characters, promotions, games, toys, and child-appealing graphic designs like unusual colors and shapes are displayed frequently on food packaging.Within products with child-appealing packaging, 79.6 percent exceeded the sugars threshold, 42.2 percent exceeded the sodium threshold, and 27.2 percent exceeded the saturated fat threshold.",
        "WeightWatchers is moving into the booming fat-loss injection market, it announced today. ",
        "Within products with non-child-appealing packaging, 53.6 percent exceeded the sugars threshold, 54.0 percent exceeded the sodium threshold, and 32.4 percent exceeded the saturated fat threshold.",
        "The researchers found that in the cereals category, there was no difference in energy, sodium or saturated fats between products with child-appealing and non-child-appealing packaging. However, cereals with child-appealing packaging had significantly higher levels of total sugars and free sugars, and lower levels of protein than cereals with non-child-appealing packaging. Cereals that were more powerfully marketed were also more likely to be higher in total and free sugars.The study, published in the journal PLOS ONE, concluded that 'implementing marketing restrictions that protect children' should be a 'priority'.A Pew Research study found that Americans are eating 23 percent more calories now than they were in previous decades.This is combined with a more sedentary lifestyle that many are living. Children are less likely to get the recommended one hour of daily physical activity now than they were in previous years.The pandemic likely exacerbated these issues. Children who stayed home from school were less likely to go and play outdoors where they would get more exercise.They were also more likely to snack throughout the day, adding calories that they previously would not have in a more structured school environment.While obese children still have time to shed weight and eventually live a healthy life, it does set them up for more health problems later down the line.",
        "Many obese children are diagnosed with diabetes or prediabetes, the former is a lifelong condition that much be managed daily to live a healthy life.They are also more likely to stay obese throughout the rest of their lives, setting them up for health problems down the line like diabetes, heart disease and high blood pressure among others."
    ]
}