{
    "articleURL": "/news/article-12044383/Woman-asks-donations-young-boxer-shes-euthanising-behavioural-issues.html",
    "content": [
        "Woman asks public to fund pup's euthanasia and cremationChief the boxer is being put down because owner is movingShe says he has anxiety and isn't a good candidate for rehomingA dog owner who runs a popular Instagram account for her boxer Chief is crowdfunding his euthanasia, saying he's 'too anxious' to cope with her upcoming house move. ",
        "Chief's owner Chelsea Jackson, who found him on Gumtree during the Covid pandemic, told her followers he 'wasn't a good candidate for rehoming' due to his 'high risk'.The Instagram account is full of posts fawning over the two-year-old dog, showing him walking happily alongside her - and even declaring Chief is a 'sook' and 'just misunderstood'.In pictures posted online, Chief regularly cuddles up to Ms Jackson and is seen playing happily around the house and outside, with the owner saying she 'wouldn't change him for the world'. But speaking to Daily Mail Australia, Chelsea's mother Lisa said that while they are both devastated - euthanasia is the only option she has left, for Chief's wellbeing and others.Ms Jackson is also fundraising to fulfil a bucket list for Chief before he dies. ",
        "Behavioural euthanasia is defined as the humane ending of an animal’s life for behaviour or quality of life concerns stemming from behaviour. Source: beyonthewalkdogs ",
        "'Chief was purchased from a young man on Gumtree when he was 10 months old and formed an instant bond with Chelsea,' Ms Jackson said.'However, from day one he has always had issues in public, being very reactive and will go ballistic if sees people across roads and we believe he must have had some trauma from before we got him.",
        "'Since taking him in we have spent up to $6,000 if not more on intensive training and medication, behavioural experts, you name it we have done it to try to help Chief, especially my daughter who spends almost all her disability support money on him.'The comments under both the Instagram post and GoFundMe have generally offered support for the dog owner.Many other pet owners praised the family for making the tough decision to 'put Chief's welfare first' and calling it 'selfless' with some even using the hashtag #behaviouraleuthansia.In fact, some other pet accounts also talked about doing the same with their dogs, in a sign the practice is more widespread than people would assume.A spokeswoman for Boxer Rescue Network Australia said behavioural euthanasia should only be considered when all other options have been explored.'The dog could have some anxiety issues from being reactive to having anxiety by itself,' the spokeswoman said.The spokeswoman also said in her experience 95 per cent of behavioural issues in dogs are caused by the owner.'People not knowing about dogs and how to care for dogs and that specific breed, that's where the big behavioural issues are,' she said.'It is almost always a misunderstood dog that is not being cared for properly and given what it needs.'",
        "It is not suggested that Chelsea was responsible for Chief’s behavioural issues. But Ms Jackson believes the family has done everything they possibly can to help the boxer and have been left with no other option but to put him down.'He's my daughter's best friend and we can't even look to rehome him as he is a major bite threat and would hate for him to bite someone and then get thrown in a cell and put down,' she said.",
        "'We have picked the day to behaviourally euthanise him and until then he is getting unconditional love and everything he could possibly want and need.'On the day we are getting a vet to come to his home, he will be sedated and surrounded by the family he loves and trusts and then will be cremated so my daughter will have him with her forever.'The Sunshine Coast family say Chief has bitten someone before in public but the man didn't press charges.They insisted to Daily Mail Australia they have tried every conceivable option to improve Chief's quality of life and while this is the last thing they wanted, believe it is what is best for their pup.'It is not fair on him anymore as he lives with major anxiety and stress and is on that much medication he can hardly move and that is just no quality of life for a dog,' Ms Jackson said.",
        "'We are struggling so much with this, Chelsea has barely eaten since making the decision but we know we need to stay strong for Chief, to give him the best last few days.'The family's  'bucket list' for Chief's final days includes; a canvas painted with peanut butter with the owner's hand and Chief's paw, a whole chicken, a steak, box of full leaves and grass from his favourite spots, triple cheeseburger, ice cream and a photoshoot. Announcing her intention to get Chief euthanised online, Chelsea wrote: 'The past few months I have been thinking of behavioural euthanasia as an option for Chief as he is not a good candidate for rehoming due to his high risk.'She explained a 'lovely' behavioural vet agreed that euthanasia was in Chief's 'best interest' because he is a 'bite risk' making it difficult to rehome him due to the 'stressful' upcoming house move. ",
        "She also explained on Instagram that he is anxious when out and about and is always muzzled in public.She also said she will soon be living in 'a very busy area and close to neighbours, other dogs, traffic etc' and therefore will be getting at-home euthanasia in a fortnight.'This is not an overnight decision, I have thought about this for ages and talking with a professional brought out my concerns for my dog and what would be best for him,' she wrote to her 1,000 Instagram followers.",
        "'I hope you can understand why I've chosen this route. Any and all hate will be blocked, I don't want negativity.'What the lady said was \"some dogs just live a happy, loving SHORT life\" and Chief is one of them.'The charity Dogs Rescue Home said 'it was so heartbreaking to hear' about Chief potentially being euthanised.A charity spokesperson explained that under 1 per cent of their total intake of around 1,500 dogs per year require behavioural euthanasia.'Dogs are sensitive animals and of course changing homes is always a stressful experience for dogs, but there are things new owners can do to ease the transition and make it as positive as possible for their new furry friend,' a spokesperson for Dogs Rescue Home said.'With the right approach, we are advocates for for settling in a new dog. 'The 3-3-3 rule is a general guideline that represents the phases of a rescue dog or common milestones your new dog or puppy will go through, it is the first three days, three weeks, and three months after bringing your dog home from the shelter.'",
        "A spokesperson for RSPCA Queensland said some pets do suffer from severe behaviour issues but urged any owner facing such problem to exhaust all options before considering behavioural euthanasia.",
        "Fearless and self-assured, the Boxer can cast a striking and imposing figure when alert and watchful. This is a lively dog, bouncy and energetic and be prepared for your Boxer to take up to two years to be fully mature.Aggression in Boxer dogs is a common type of behaviour mostly seen in untrained dogs of misinformed owners.Because Boxers are extremely loyal to their families and feel a deep attachment to their people, separation anxiety can develop. Proper levels of physical activity and mental activity can keep separation anxiety from becoming a problem.Source: www.australiandoglover.com",
        "'We would hope in any situation where owners are facing these tough decisions that all other options have been exhausted,' they said.'For example, seeking advice and training from dog behaviour specialists and taking pets to veterinarians for medical options that are available. 'At the RSPCA we work with pets on a daily basis that may suffer from behavioural issues and for some animals, rehabilitation can take weeks or several months.'For those looking to move home that are struggling to find appropriate rentals or proprieties to suit their pet's needs, surrendering a pet for rehoming into another family is also another option.Just a week ago the Instagram account posted a reel of Chief which said: 'He's just misunderstood and scared'.'He's a big 30kg baby, he's a sook,' the post reads.'Once he knows you that's it, you're in his circle and never leaving, he will do anything for attention and cuddles.'He is a one of a kind dog and I wouldn't change him for the world.'"
    ]
}