{
    "articleURL": "/wires/ap/article-12039199/New-Patriots-receiver-Smith-Schuster-feeling-home.html",
    "content": [
        "FOXBOROUGH, Mass. (AP) - JuJu Smith-Schuster's first few weeks with the New England Patriots have made him feel as if he´s back in college.",
        "Every day has been a new learning experience.He´s entering the second phase of the team´s offseason conditioning program and aside from getting his body ready for upcoming organized team activities, the receiver has also been diving into the third new playbook of his career after joining the Patriots in free agency.Smith-Schuster said arriving in Foxborough early this offseason is crucial as he tries to acclimate himself after spending last season with the Kansas City Chiefs and the previous five in Pittsburgh.\"Every day I´m growing here,\" Smith-Schuster said. \"That´s that I love about here.\"He was a hot commodity when free agency opened in March, and quickly garnered a three-year deal that reportedly could be worth as much as $33 million.",
        "A Pro Bowler in 2018 with Pittsburgh, injuries limited him to just five games his final season there in 2021. He went to Kansas City looking for a fresh start and finished with 78 receptions for 933 yards and three touchdowns last season. All were second on the team behind star tight end Travis Kelce.It made him one of the biggest splashes for New England in what has been an offseason that has featured multiple new additions. It´s all been an effort to beef up an offense that underwhelmed under the direction former assistant Matt Patricia.",
        "Coach Bill Belichick replaced him with Bill O´Brien, who returns to New England as offensive coordinator and quarterbacks coach.O´Brien is being tasked not only with getting the best out of quarterback Mac Jones, but a receiver room that now features lots of speed and ability to stretch the field via Smith-Schuster, DeVante Parker, Kendrick Bourne and Tyquan Thornton.Smith-Schuster said he´s been taken aback by the intricacies of the Patriots´ playbook, joking that he was going to make himself flashcards to help him study.\"I would say that it is a varied offense, where it´s kind of like I definitely am studying more,\" he said. \"I´m getting the offense down and terminology is different from what I´ve learned in the past. But that just goes to say that these coaches are really smart when it comes to football and just knowing the game.\"He hasn´t had any throwing sessions with Jones, but has been spending some off the field time getting to know some of his fellow receivers.\"We´ve got guys that can do a lot of different things,\" Smith-Schuster said. \"What´s crazy about this offense that I didn´t know until I got here was there´s guys that play both ways. There´s guys that can play receiver, that can play in the backfield.",
        "\"Seeing that you can have so many different weapons with these players, it just gives Mac opportunities to do whatever he wants.\"___AP NFL: https://apnews.com/hub/nfl and https://twitter.com/AP_NFL"
    ]
}