{
    "articleURL": "/wires/reuters/article-12055365/Jimmy-Butler-Heat-strong-Knicks-Game-3.html",
    "content": [
        "Jimmy Butler, returning from an injury absence, scored 28 points to lead the host Miami Heat to a 105-86 win over the New York Knicks in Game 3 of their Eastern Conference semifinal series.",
        "Miami leads the series 2-1. The Heat will host Game 4 on Monday night.Knicks sixth man Immanuel Quickley left the game with 6:15 left in the fourth quarter due to his injured left knee.The game got ugly with 14.7 seconds left in the third quarter as the teams scuffled underneath the Knicks' basket. Three technical fouls were assessed: on Miami's Cody Zeller for pushing Julius Randle; on New York's Isaiah Hartenstein for pushing Zeller; and on Miami's Caleb Martin for pushing Hartenstein.Earlier in the game, the Knicks were so frustrated that two of their players -- RJ Barrett and Josh Hart -- were called for technical fouls.Butler, who missed Game 2 won by New York, came back from his injured right ankle after five full days of rest. Butler rated a game-high plus-28 when he was on the court.He got help from Bam Adebayo (17 points, 12 rebounds), Max Strus (19 points) and Kyle Lowry (14 points).New York was led by Jalen Brunson, who had 20 points and a game-high eight assists. Hart (15 points, 12 rebounds) and Randle (10 points, 14 rebounds) had double-doubles for the Knicks.Miami never trailed in the first quarter, led by as many as 13 and settled for a 29-21 advantage by the end of the period.",
        "New York, which missed its first 15 shots from outside the paint, trailed by as many as 19 points in the second quarter. By halftime, Miami led 58-44. The Heat in the first half turned the ball over just three times.Barrett scored six points in New York's first two possessions of the third quarter as the Knicks cut their deficit to 61-50. But the Heat dominated the rest of the quarter, leading by as many as 21 points.Miami, which entered the fourth quarter with an 87-70 lead, cruised from there.For the game, Miami shot 38.9 percent from the floor, including 7-for-32 on 3-pointers (21.9 percent). New York shot 34.1 percent overall and 8-for-40 from deep (20.0 percent).--Field Level Media"
    ]
}