{
    "articleURL": "/wires/reuters/article-12052819/David-Toms-Stephen-Ames-share-lead-Mitsubishi-Electric.html",
    "content": [
        "David Toms and Canada's Stephen Ames shot bogey-free rounds of 7-under 65 to share the lead after one round at the Mitsubishi Electric Classic on Friday in Duluth, Ga.",
        "The PGA Tour Champions veterans have already won this season and are hunting for another title. They have a one-shot edge over Ken Tanigawa, Lee Janzen, South Korea's Y.E. Yang and Australian Rod Pampling, who are tied for third at 6-under 66.Not far behind are Paul Goydos, Spaniard Miguel Angel Jimenez and German Bernhard Langer at 5-under 67. Langer, age 65, would break the all-time Champions Tour record with one more victory; he is tied with Hale Irwin at 45 for his career.Toms picked up a pair of victories in March at the Cologuard Classic and the Galleri Classic. After tying for third last week at the Insperity Invitational, he's in second place in the Charles Schwab Cup money standings.Toms started his round on the back nine at TPC Sugarloaf and made three birdies going out before piling on four more on the second nine. It was posed to Toms in the media center that he was on a heater.\"That's what I tried to do when I was on the (PGA) Tour. When you felt good about your game, you needed to capitalize on it,\" Toms said. \"When you were confident, you needed to play well. There's so many days that can beat you up and you can't score that when you are playing well, you need to take advantage of it.",
        "\"That's where I feel like I am right now. I feel good about my tee ball, I feel good about iron shots, judging distance properly, speed's been pretty good on the greens lately and I've made my fair share.\"Ames, who won the Trophy Hassan II in February, also opened on the back nine. He made the turn with a pair of birdies -- the par-5 18th and the par-4 first -- and added three straight at Nos. 6-8 before finishing up.Ames won the Mitsubishi Electric in 2017, though he said TPC Sugarloaf is a different course these days.\"I think overall the condition of the golf course is awesome,\" Ames said. \"A little thin in some areas, but overall the condition of the golf course is very nice, and the weather's been holding off, which is even better. So we'll see what happens for the rest of the weekend.\"--Field Level Media"
    ]
}