{
    "articleURL": "/news/article-12042217/Moment-mentally-ill-man-AR-15-tries-SHOOT-Memphis-Fox-HQ.html",
    "content": [
        "Jarrad Nathan, 26, went to the offices of FOX13 and said he wanted to share a message from GodNathan opened fire through a ballistic glass door then ran to a nearby restaurant and barricaded himself in the restroomHe appeared in court on Wednesday charged with aggravated assault and reckless endangermentA gunman stormed a Fox news headquarters in Memphis and fired an AR-15 before bolting himself in the restroom of a nearby restaurant during a standoff with police.",
        "Jarrad Nathan, 26, went to the offices of FOX13 and claimed he'd been given a message from God about the murder of Tyre Nichols in Memphis in January.He then fired a round through a ballistic glass door - which requires a keycard to open - which struck the front desk. The incident unfolded at about 11.30am on Tuesday and Nathan was detained about two hours later.Nathan, a mental health patient, then ran to the nearby Ubee's restaurant and shared a now-deleted Facebook Live video of himself barricaded inside.Police were able to deescalate the situation and detain Nathan after his mother, Marsha McKinney, was brought to the scene to aid with negotiations.",
        "Nathan appeared in court on Wednesday charged with aggravated assault and reckless endangerment.Dramatic surveillance footage from inside the reception area of the Fox office shows Nathan fire a round through the door, causing terrified reception staff to flee. He then starts kicking and pulling at the door in a failed attempt to gain entry.Surveillance footage from outside the building also showed Nathan was dropped off at the station in a gray SUV and walked with a limp towards the building. He is seen holding an object in his right hand which appears to be a firearm.",
        "Fox staff were evacuated from the building as the drama unfolded, before they were allowed back inside 30 minutes later after Nathan holed up in the restaurant. The main road through the area was also shut. Fox13 production manager Ron Crawford crossed paths with Nathan outside the station after the shot was fired.The gunman told him: 'God's told me that I need to tell the world a message.'He asked to enter the station, Crawford said, adding: 'I said no, you can't come in, but I can take your message.'I saw that he still had the weapon on him,' said Crawford.'Some more individuals came out of our newsroom doors into the lobby area and said get away from him, he shot into the building.'During the 16-minute Facebook Live stream from inside the restaurant, which has since been deleted, Nathan recorded himself shouting at officers: 'I need to talk to the news people!'",
        "He also refused requests to hand over his weapon to police. He was arrested at about 1.30pmAuthorities are now working to learn how Nathan acquired the weapon.His Facebook page, which uses the name Jay Nathan, shows him posing with several firearms, including an AR-15 style rifle and a pistol. It's unclear if the rifle is the same one used in the attack.  ",
        "McKinney said her son has had mental health problems since he was young and that he was shot eight times two months ago.'He's one of the nicest, kindest (people, but) everybody has another side, too,' she said. 'I think that my son is crying out for attention because he needs some help.'She told Fox13: 'His mamma going to get him some help, today. This is a reflection of why his daddy should have been there. You teach your boys how to be men. They need their fathers... It has not been an easy road for me, as a parent.' The gunman's father and stepmother also spoke with police at the scene. Nathan is being held on $275,000 bond. He said he could not afford bond and he is 'dead broke'. He appeared in court in a wheelchair. Police said there were no injuries when he was taken into custody. "
    ]
}