{
    "articleURL": "/sport/nrl/article-12048665/Ryan-Papenhuyzens-season-doubt-theres-chance-hell-NEVER-play-Storm-insider-claims.html",
    "content": [
        "Footy career of Ryan Papenhuyzen could be overMelbourne Storm fullback shattered his kneecap last JulyBelieved Papenhuyzen's body isn't responding to rehabMade his NRL debut in 2019, won premiership in 2020 The career of Melbourne Storm star Ryan Papenhuyzen could be over as he struggles to recover from a badly broken kneecap.",
        "Papenhuyzen, 24, has been sidelined since last July following an on-field collision with Canberra Raiders five-eighth Jack Wighton – and a insider revealed the club has privately started preparing for life without the 2020 NRL premiership winner.Utility back Nick Meaney - who inked a contract extension in January until 2024 at AAMI Park - is reportedly now being viewed as the club's long term fullback by Craig Bellamy and his coaching staff.It is understood Papenhuyzen is lagging in several areas of his recovery. Speaking on the Matty Johns Show on Sunday night, the Clive Churchill Medallist in 2020 confirmed his playing future remains up in the air.",
        "'I wish I had a proper answer to this question, but I guess for everyone to understand, it's still a bit complicated,' he said.'I've got a bit of a deficiency in the right quad which I did my knee on and it's all about just getting it to under 10 per cent. Once it's under 10 per cent, it should ramp up, but we've just had a few difficulties.'It's annoying. I have to be patient, it's frustrating for me as well, but that's the best way to explain it.'Before Papenhuyzen shattered his kneecap last July, the electric no.1 was arguably the standout player in the competition, scoring 12 tries before suffering knee and hamstring injuries that ruled him out for six weeks.",
        "Following a further delay due to contracting Covid-19, the star fullback scored another two tries on his return - only to then collide with Wighton in a sickening clash.As part of his ongoing rehab, 'Paps' then flew to the US in January to work with renowned reconditioning specialist Bill Knowles, who stressed patience was key.'He [Papenhuyzen] looked like a guy that was one, ready to work. He also looked like a guy, like many of them do, they are frustrated,' Knowles said in a documentary In Due Time which screened in the off-season.",
        "'They have been out of their game. They are not frustrated with the process they've been going through, they're frustrated at being out of the game, and they all are.'It's most important to be extremely honest and let the athlete know where I feel they're currently in the process and strip away timeframes and timetables of when you can make it back and get them really hyper-focused on the process of what it needs to take.'Once they understand that, Ryan included, they start relaxing and working better.'NRL Physio uploaded an image on their Twitter page of the fullback's shattered patella days after Papenhuyzen was carried off AAMI Park by trainers - and labelled it 'one of the most brutal injuries we have seen in years.'",
        "An Australian Schoolboys representative, Papenhuyzen played in the NYC under-20s competition for the Wests Tigers before signing for the Storm.He made his NRL debut in 2019 and quickly became one of the code's elite players due to his pace and try-scoring prowess. "
    ]
}