{
    "articleURL": "/news/article-12047563/Hollywood-writers-strike-explained-streaming-wars-boosted-profits-hit-pay.html",
    "content": [
        "Writers Guild of America East and West coast divisions announced a strike would commence Tuesday after midnightWriters are striking as a result of failed negotiations with studios over pay, residuals in the era of streaming and staffing requirementsThe last time writers downed tools in 2007, the strikes lasted for 100 daysThousands of Hollywood film and TV writers have hit the picket lines this week after the Writers Guild of America called its first strike in 16 years. ",
        "An estimated 11,500 members have downed tools after talks with the Alliance of Motion Picture and Television Producers over pay fell apart.The strike is expected to impact the running order of late night television shows and, depending on the length of strike, could affect planned TV series and movies. At the center of the row is the rise of streaming - with the guild claiming that even as budgets have increased, writers' share of that cash has consistently shrunk. Here Dailymail.com explains why writers are striking - and how the streaming wars sparked unrest in Hollywood...",
        "Studios such as Disney and Paramount have been cashing in on the success of services like Netflix by creating their own sites like Disney+ and Paramount+.As of January this year, Paramount+ had over 55 million users and Disney+ had over 161 million. It allows them to receive money every month from users and tap into a market that is projected to be worth $115 billion by 2026, according to Business of Apps.Yet streaming has dramatically shortened TV seasons, with shows now running about eight to 10 episodes per season, as opposed to the former model of about 22-24 episodes. And the guild claims that streaming services' use of smaller staffs — known in the industry as 'mini rooms' — for these shorter stints has made sustained income harder to come by. ",
        "In conclusion to a March report, it said: 'The companies have leveraged the streaming transition to underpay writers, creating more precarious, lower-paid models for writers’ work.'Subscription-based streaming has also upended the old residual compensation system, which helped writers continue to earn income when shows were aired as re-runs or in overseas markets, they argued.",
        "A March report released by the Guild found that on TV staffs, more writers are now receiving the minimum of pay regardless of experience. The weekly minimum for a staff writer on a television series in the 2019-2020 season was $4,546, according to Variety.They work an average of 29 weeks on a network show for $131,834 annually, or an average of 20 weeks on a streaming show for $90,920. For a writer-producer, this figure increased to $6,967 per week.  ",
        "The guild report also claims that the lack of a regular seasonal calendar in streaming has 'depressed writer pay'.The calendar mentioned by the guild refers to how TV shows used to frequently churn out a new series every year, something which has changed with streaming.As part of their proposals, the writers guild also called for the regulated use of artificial intelligence (AI) on projects. They said that AI must not used to write or rewrite literary material, and that work created by guild members should not be used to train AI.  ",
        "In response, The Alliance of Motion Picture and Television Producers (AMPTP) flat out rejected their proposal and instead offered 'annual meetings to discuss advancements in technology.'The Alliance of Motion Picture and Television Producers (AMPTP), which represents Hollywood's studios, streaming sites and production companies, say their priority is 'the long-term health and stability of the industry'.But following months of negotiations, there is still considerable distance between writers and the AMPTP. ",
        "Talks, which often extend for hours or days past a contract deadline, instead ended hours before the most recent contract expired on Monday night.At that point, writers had already overwhelmingly decided to call for a strike and had started making signs for their picket lines. The AMPTP said it had offered 'generous increases in compensation for writers as well as improvements in streaming residuals' and would improve its offer but couldn’t due to the multitude of demands by the writers. Late night shows heavily dependent on same day, current events based comedy writing were the first to feel the strike's effect.",
        "Shows including Stephen Colbert, Jimmy Fallon, Jimmy Kimmel and Seth Meyers  along with 'Saturday Night Live' are expected to immediately go dark.The status of daytime talk shows, which lean more into host chats and interviews, are less certain. ABC’s “The View” was uninterrupted during the last strike, which began late in 2007 and ended early in 2008. ",
        "Depending on their media consumption methods, many viewers and moviegoers may not notice the effects of a strike until long after it’s over, if at all. The menus of streaming giants Netflix and Amazon Prime Video will look no different next week, but because this would be the first writers’ strike of the streaming era, there is no template for how they will look months down the line.The guild has said: 'The survival of our profession is at stake.' The cost of the WGA's last strike cost Southern California $2.1 billion, according to the Milken Institute. "
    ]
}