{
    "articleURL": "/sport/football/article-12055035/Jurgen-Klopp-claims-knew-Liverpool-fans-boo-national-anthem.html",
    "content": [
        "Liverpool fans booed the national anthem ahead of their game with BrentfordThe anthem was played to mark the Coronation of the King and Queen Consort Jurgen Klopp said everyone 'knew' the fans would boo and that it was 'fine'  Jurgen Klopp says 'everyone knew' the Liverpool fans would boo that national anthem ahead of their game with Brentford and said it was 'fine' because there were no 'chants'. ",
        "The national anthem was played ahead of their Premier League at Anfield on Saturday afternoon to mark the crowning of King Charles III and the Queen Consort earlier in the day. However, the supporters inside the stadium decided to boo the anthem as the two teams lined up around the centre circle. The jeering started immediately after the PA announcer confirmed that the national anthem would be played before kick-off.Klopp congratulated the King in his post-match interview and explained why the Liverpool fans decided to boo. He said it was because 'they weren't always happy in the past with the way Liverpool, the club and the city, were dealt with'. Speaking after the game on Saturday afternoon, which ended 1-0 to Liverpool, Klopp said: 'First and foremost, today was a big day for England and I respect that a lot. ",
        "'Everybody wants to be happy about it and celebrate. Not everything is better than in the past, but thank God we have the freedom of free speech and freedom of opinion.'It was clear something like this would happen, everybody knew it. That is fine, nothing else happened, there were no chants.'The people showed, I don't exactly know what it was, but they weren't always happy in the past with the way Liverpool, the club and the city, were dealt with. That is it.",
        "'Today is for all the other people who loved the day, I am not sure if you say Congratulations to the King but I say it. For the people who really celebrate it, don't think about other stuff.",
        "'People who are not happy about it, say it, and that's it. I think it was absolutely Ok.'Liverpool reluctantly played the national anthem ahead of the televised fixture after the Premier League 'strongly suggested' clubs hosting fixtures this weekend mark the Coronation.However, the Liverpool fans have booed the anthem in recent years. Some even chanted 'you can stick your coronation up your a**e' at last week's match against Fulham. Liverpool supporters did respect a minute of silence for Queen Elizabeth II following her death last September. But the national anthem had been jeered by some of their fans prior to last season's FA Cup final at Wembley."
    ]
}