{
    "articleURL": "/wires/ap/article-12047267/Man-dies-placed-chokehold-subway-rider.html",
    "content": [
        "NEW YORK (AP) - The choking death of a man at the hands of another New York subway rider was setting off powerful reactions Thursday, with some calling it a criminal, racist act even as authorities reserved judgment on the killing.",
        "New York has become one of the nation's safest large cities, but the emotional responses recalled the metropolis of decades ago, when residents felt besieged by crime and fatal vigilantism made national headlines.Manhattan prosecutors promised a \"rigorous\" investigation into whether to bring charges in the death of Jordan Neely, a Black man who was tackled by fellow passengers and put in the chokehold by a white Marine veteran.The medical examiner´s office ruled Wednesday night that Neely, 30, died in a homicide caused by compression of the neck, but it said any determination about criminal culpability would be left to the legal system.Regardless, many New Yorkers saw the choking as the latest in a long history of attacks on Black city residents.\"We´re like animals in white people's backyards. They want to get rid of us,\" said Diango Cici, a 53-year-old Manhattan resident.",
        "Neely, who in the past had earned money imitating Michael Jackson, died Monday after the early-afternoon confrontation aboard a train beneath Manhattan. Neely, who had been homeless at times, according to people who knew him, was shouting at fellow passengers when another rider wrapped his arm around his neck and pinned him on the floor. Two other passengers also helped restrain Neely.Marine recruits are routinely taught about executing and defending against chokeholds, which can render someone unconscious in as few as eight seconds, according to a military manual revised in 2020.",
        "The lethal risks of chokeholds led New York City to ban police from using them. An officer was fired for using a chokehold on Eric Garner, a Black New Yorker whose dying words \"I can't breathe\" became a chant in protests against racial injustice.A U.S. Department of Justice website called chokeholds \"inherently dangerous\" and said that they have \"too often led to tragedy.\"No one has been arrested, but the Manhattan district attorney´s office said late Wednesday it would review autopsy reports, as well as \"assess all available video and photo footage, identify and interview as many witnesses as possible, and obtain additional medical records.\"Police questioned the 24-year-old whom the video showed holding Neely in a headlock for at least 3 minutes - perhaps longer - but released him without charges. His name was not released by police, but his relationship with the Marines was disclosed by a law enforcement official who wasn´t authorized to make the information public and spoke on condition of anonymity because the investigation was not yet complete.It was not clear why passengers moved to restrain Neely. One witness, a freelance journalist who was on the train and recorded Neely becoming unconscious as he was restrained, said that while Neely was acting aggressively and threw his jacket, he hadn't attacked anyone.",
        "Police asked other witnesses to come forward and sought additional photos and videos that might help investigators understand what transpired during the fatal confrontation or what triggered it.In the absence of video showing what happened before the chokehold, many were reserving judgment.Among them was Mayor Eric Adams, who said Thursday that there were \"many layers\" to the incident. He rejected criticism that he has not expressed enough outrage over Neely's death, unlike other officials who have called for a quick arrest.\"All the other electeds, they have a role to play and I have a role to play. The police is doing their investigation and the district attorney is doing his investigation, and I respect the process,\" Adams said.Governor Kathy Hochul called the video-recorded encounter \"wrong\" and \"horrific to view,\" adding that Neely's \"family deserves justice.\" But the governor said she was watching how the matter unfolds.\"No one has the right to take the life of another person. And in this circumstance, I have said all along and have stood firm in our commitment to helping people with mental health challenges,\" Hochul told reporters after a meeting with union workers in Manhattan.She said sometimes people are loud and emotional in public, but it was \"very clear\" that Neely was not going to harm others and the video showed a \"very extreme response.\"",
        "Dozens of people gathered Thursday night in Brooklyn's Barclay Center for a second day of demonstrations. On Wednesday a few dozen protesters gathered at the station where Neely died to call for an arrest.Kyle Ishmael, a 38-year-old Harlem resident, said the video left him \"disgusted.\"\"I couldn´t believe this was happening on my subway in my city that I grew up in,\" he said.Street performers who knew Neely described him as a kind and gifted impressionist who sank into a depression as a result of his mother´s 2007 death. According to news accounts at the time, Christie Neely was strangled. Neely, who was 14 when she died, testified against his mother´s boyfriend at the murder trial.Tari Tudesco, a backup dancer in the Michael Jackson tribute act \"Michael´s Mirror,\" said many in the community had grown worried about Neely´s absence in recent years, and had begun searching for him, unsuccessfully.\"We were in shock to find now that he was living homeless,\" she said. \"We feel terrible.\"___Associated Press researcher Rhonda Shafner in New York and reporters Lolita Baldor in Washington and Maysoon Kahn in Albany, New York, contributed."
    ]
}