{
    "articleURL": "/news/article-12054087/Police-arrest-second-man-boy-girl-15-11-shot-park-horror-daytime-attack.html",
    "content": [
        "Two men arrested after boy, 15, and a girl, 11, were shot in a Wolverhampton park Police have arrested a second man after a boy and girl were shot in a Wolverhampton park in a daytime attack.",
        "A 25-year-old man was arrested on suspicion of attempted murder on May 4, after the two children were shot.Now a second man, 21, from Wolverhampton, has been arrested for attempted murder.Emergency services raced to Wolverhampton at about 3pm on Monday after reports of gunshots.They found a 15-year-old boy with a bullet wound to his leg and an 11-year-old girl with similar injuries in a park nearby.",
        "The children were rushed to hospital in a stable condition. Both are expected to make a full recovery.Police said after the youngsters were shot, two stolen cars were involved in a chase with one of the vehicles being dumped nearby.West Midlands Police have now released CCTV pictures of one of the cars involved.The suspect was arrested after police stopped a car believed to have been used in the shooting.Armed police swooped on the car on Emerson Road in Wolverhampton just after 5pm on Thursday.The double shooting comes after a similar incident in the Whitmore Reans area of the city last month. Police are not linking it to the Bushbury attack.Detectives arrested a 21-year-old man on suspicion of attempted murder following the Whitmore Reans shooting.",
        "A woman in her 20s suffered a leg injury when shots were fired in Bitterne Drive at around 1am on April 23.",
        "A gun shot also damaged a window at an address in nearby Evans Street.The suspect was held by firearms officers who stopped the car he was travelling in on the M6 near Crewe at around 8pm on Thursday.Cash and drugs were also recovered from the vehicle.Detective Inspector Francis Nock, from the major crime team, said: 'We're making good progress as we investigate these shootings, which have rightly shocked the community in Wolverhampton.'Our absolute priority is bringing all of those involved into our custody and we'll continue to work around the clock to make sure that is done.'Three people, including two children, have been injured in these two shootings.'I'd urge people to examine their conscience and do the right thing by telling us what they know about who was involved.'West Midlands Police said: 'A 21-year-old man was arrested from an address in Wolverhampton yesterday evening and is being questioned on suspicion of attempted murder.'A 25-year-old man who was arrested on May 4 in connection with the investigation has now been released on bail, with strict conditions.'The incident is not believed to be linked to the shooting of a woman, who also suffered a leg injury, in the Whitmore Reans area of the city in the early hours of April 23."
    ]
}