{
    "articleURL": "/tvshowbiz/article-12039601/Chanel-Iman-pregnant-Model-shows-baby-bump-green-fringe-bikini-beach-photo-shoot.html",
    "content": [
        "Chanel Iman is pregnant with her third child and first with her NFL star boyfriend Davon Godchaux.",
        "The 32-year-old supermodel - who went Instagram official with Davon last year - showed off her baby bump in a social media post shared by publicist Lori Krebs.The runway regular was joined by Heather Rae El Moussa, Brittany Cartwright, and Bianca Mitsuko in a beachside photo shoot on Tuesday.The photo, shared to the CEO's Instagram Stories, showed Chanel in a green fringe bikini that exposed her burgeoning belly.The mother-of-two - who shares daughters Cali, 4, and Cassie, 3, with ex husband Sterling Shepard - has yet to formally announce the news.",
        "Iman looked typically gorgeous with an added pregnancy glow to her face as she smiled in the singular image.She showed off her perky cleavage in the triangle swimwear top, which had decorative tassels.It coordinated with a matching sarong that Chanel tied at the side, arranging it securely underneath her growing tummy.The model wore her jet black hair straight and in a side part as it flowed down her back.The beauty went barefoot in the sand as did her counterparts, who surrounded her in swimsuits of their own. It comes after the stunner was spotted on a beach in Miami with her beau earlier this year, cradling her stomach.Chanel's most recent Instagram post, shared this past weekend, shows the couple on a trip with their kids - her daughters and Davon's 8-year-old son Davon Jr. from a previous relationship - but makes no mention of a baby on board.",
        "The couple's social media pages are sprinkled with tributes to each other and photos of their blended family life.The superstar's latest Instagram post was captioned, 'Thank you @nickresortrivieramaya for hosting our family. So many great memories were made! Till Next trip.'The Patriots player wrote in the comments, 'my favorites.'And in another post from their Riviera Maya getaway, Chanel called it the 'best trip yet.'On the former Victoria's Secret Angel's birthday this past December, Davon gushed online, 'Happy Birthday To My Queen!! Continue to be you and keep being great at everything that you do!'Chanel replied in the comments, 'Thank you Baby. I am so much greater now that I have you in my life.'In April 2022 the couple made their romance known as Chanel posted a photo of them cozied up at Coachella.She captioned the photo, '❤️ @revolve #revolvefestival,' and Godchaux responded in the comments by saying, 'I love you ❤️.' ",
        "Celebrating his 28th birthday on a yacht in November, Godchaux posted a picture of him serenading Chanel in front of family and friends.'A picture is worth 1000 words,' he wrote.The Victoria's Secret Angel went on to post her own tribute to the defensive tackle: 'Celebrating you Big Daddy [heart emoji] Happy Birthday! I love you.'",
        "'The best birthday ever!' gushed Godchaux in the comments section. 'My love, my everything! Love you forever and always.'Married in 2018, the Atlanta-born beauty split from Sterling in 2021, citing irreconcilable differences.The former couple first met at Victor Cruz's birthday party in 2016 and became engaged the following year.Chanel was previously in a relationship with Lakers star Jordan Clarkson in 2015.Prior to Clarkson, she was reportedly engaged to the rapper A$AP Rocky in 2014."
    ]
}