{
    "articleURL": "/femail/article-12059315/Im-living-best-life-OnlyFans-star-quit-job-social-worker-earns-1-600-week.html",
    "content": [
        "Kayla Evelyn, 32, from Ramsgate, Kent, makes around d £6,500 per monthREAD MORE: Shocking amount OnlyFans star made after putting up a billboardAn OnlyFans star is living her life to the fullest since leaving her previous job. ",
        "Kayla Evelyn, 32, from Ramsgate, Kent, makes a fortune on OnlyFans, having quit her job as a social worker and has big plans for the future.However, her £1,600 earnings a week have come at a price and she told The Sun she no longer has much contact with her family, who do not approve of her new lifestyle. While she has been told many other women in her position get their strength from their families, Kayla does not speak to her parents and only sees her sisters occasionally. She also added that she finds it hard to trust people and that she only has a couple of people who are close to her.  ",
        "But this won't stop Kayla, who is better known by her supporters as @kayla_evelynx, because she loves her lavish lifestyle of treating herself to designer clothes and spa treatments every month.   ",
        "'I'm living my best life, I feel like I'm having an out of body experience', she said, also describing her life as a constant holiday.The adult industry performer, also known as Michaela Ogilvie, opened up about how she often receives a large amount of hate, especially from women. Coming from a modest area, the model explained that she did not have much to her name during her youth and would often get in trouble. ",
        "However, now her future seems brighter, and just a few days ago she made £700 from one night of work.Despite the typical characteristics of the adult entertainment industry, Kayla makes her living by being celibate - something she adds that people enjoy about her. When asked if she has any plans to settle down, the 32-year-old said she is having too much fun to consider that at the moment.Having put herself in care as a teenager, Kayla found herself in and out of bed and breakfasts and halfway homes until she was 16-years-old. But now she makes around £6,500 per month and enjoys every day as it comes.Explaining her future aspirations, she said that one day she hopes to save enough money to rent properties out to people. From this, she would want to buy a home and open up a halfway house for children in care.",
        "She said: 'I've always wanted to make a difference, but felt my life was too small, I thought it wasn't for me in this life, I would wish my life away but I feel now I've created that life for myself.'Although she is no longer employed as a social worker, she still hopes to change the lives of others.Detailing her other goals, Kyla, who is also currently writing her own book, would like to open a bondage photography studio, along with a sex shop.",
        "No dream is too big for the 32-year-old who was adamant that she can do anything she put her mind to.Her advice for anyone considering taking the plunge into the adult entertainment industry is to ignore the negativity brought on by others."
    ]
}