{
    "articleURL": "/wires/reuters/article-12041151/Reds-position-steal-series-San-Diego.html",
    "content": [
        "The Cincinnati Reds finally won a game against the Padres ... and in San Diego, no less.",
        "Now can they win a series against their nemesis. That's the opportunity facing the Reds on Wednesday afternoon in the rubber match of a three-game series.\"It was great to get that win,\" manager David Bell said Tuesday night after his Reds defeated the Padres 2-1 in 10 innings to end several negative streaks.Cincinnati had lost seven straight games against the Padres dating back to the start of the 2022 season. The Reds had lost nine straight in San Diego and were 8-22 at Petco Park since the start of the 2013 season prior to Tuesday.The win that ended those skids was no fluke.\"We got great pitching,\" Bell said. \"We played excellent defense and got some clutch hits. And Alexis Diaz (earning the save) in the 10th. ...\"That's a big win, an exciting win. Wins like that have been what we've been working toward.\"A second straight win Wednesday would send the Reds home with a 4-2 record on a trip to Oakland and San Diego.The series finale will feature a matchup of right-handers, the Reds' Luis Cessa (1-3, 9.55 ERA) and the Padres' Seth Lugo (2-2, 3.58 ERA).Cessa, a 31-year-old Mexico native, has given up 23 runs on 39 hits and nine walks with nine strikeouts in 21 2/3 innings over five starts this season. That's a 2.215 WHIP and a .398 opponents' batting average.",
        "Rival hitters have a .633 slugging percentage against Cessa this season with a 1.078 OPS. The Reds are 1-4 in his starts, with his only win coming in his latest start. On Friday in Oakland, he held the lowly A's to three runs on eight hits in five-plus innings.\"He threw strikes and got ahead of hitters,\" Bell said after the Reds' 11-7 victory in that contest. \"It was one of those games where you felt you needed to keep scoring to win. And we did.\"Cessa has pitched only 2 1/3 scoreless innings in two outings against the Padres in his eight-season career, yielding one hit and a walk. He pitched a scoreless inning against the Padres in 2022.Lugo, who signed with the Padres with the promise at getting a shot at the rotation, has solidly earned his spot. The Padres are 3-2 in his five starts. He has given up 11 runs on 30 hits and six walks with 26 strikeouts in 27 2/3 innings. That's a 1.301 WHIP and a .273 opponents' batting average.He has proved durable -- going six or more innings in three outings and throwing 93 or more pitches in all five -- and capable of pitching his way out of jams.\"He's very competitive with a good mix of pitches,\" San Diego manager Bob Melvin said, \"and he gives us length.\"",
        "Lugo will be making his 15th career appearance (second start) against the Reds on Wednesday. He owns a 1-1 record against Cincinnati with a 1.04 ERA, a 1.154 WHIP and a .234 opponents' batting average.--Field Level Media"
    ]
}