{
    "articleURL": "/wires/reuters/article-12043825/Enbridge-shareholders-reject-resolution-fully-report-indirect-emissions.html",
    "content": [
        "By Rod Nickel",
        "WINNIPEG, Manitoba, May 3 (Reuters) - Shareholders of North American pipeline operator Enbridge Inc rejected on Wednesday a small investor's resolution to ask the company to annually report all the indirect greenhouse gas emissions of the oil and gas it handles.The resolution, from DI Foundation, reflects growing pressure on companies to account for more than just the emissions they generate themselves. By far, most of the emissions associated with oil and gas are produced when their final products are used, not during initial extraction.Enbridge's board had recommended rejection of the proposal, which was non-binding. Shareholders voted 71% against it.Many companies that extract oil and gas or move it by pipeline are already trying to reduce emissions that they create or that are associated with purchased electricity, called Scope 1 and 2 emissions respectively.Scope 3 emissions refer to the air pollution generated by the products' end use, such as in combustion engines.Investors for Paris Compliance, which represented DI Foundation, said Enbridge reports only a small portion of its Scope 3 emissions.Shareholders need better information to assess risks the company is incurring related to the transition away from fossil fuel-based energy, said Duncan Kenyon, the group's director of corporate engagement.Enbridge already reports some Scope 3 emissions when it can confidently measure or estimate them, such as from its own gas utility, said Pete Sheffield, Enbridge's chief sustainability officer.",
        "Other Scope 3 emissions are harder to track because other companies might refine crude into different products such as gasoline or plastics, Sheffield said.\"Over the last couple of years, we've continued to enhance those disclosures,\" he said.Pipeline rival TC Energy Corp also incompletely reports Scope 3 emissions, while some oil producers, like Canada's Canadian Natural Resources Ltd and Cenovus Energy, report the emissions, Kenyon said. (Reporting by Rod Nickel in Winnipeg, Manitoba Editing by Marguerita Choy)"
    ]
}