{
    "articleURL": "/wires/reuters/article-12048817/LIVESTOCK-CME-feeder-cattle-futures-stumble-three-week-low.html",
    "content": [
        "By Tom Polansek",
        "CHICAGO, May 4 (Reuters) - Chicago Mercantile Exchange feeder cattle futures slumped to their lowest price in more than three weeks on Thursday, while live cattle futures also eased.Traders said the markets were overbought and pressured by technical selling and long liquidation, after feeder cattle set contract highs last month and front-month live cattle futures reached an all-time high. Some concerns about U.S. demand for beef also crept into the market, weighing on futures.Tightening supplies of U.S. cattle fueled the price rally last month, after drought and lofty feed costs pushed producers to send livestock to slaughter, instead of keeping them for breeding.\"Our beef supply is dwindling. We have less cattle on feed. At the same time, consumer demand is backing off and that's a result of the economy,\" said Karl Setzer, brokerage research lead at Mid-Co Commodities.August feeder cattle futures closed down 0.375 cent at 223.150 cents per pound after falling earlier to 222.625 cents per pound, their lowest price since April 11.June live cattle futures finished 0.075 cent lower at 161.575 cents per pound. On Wednesday, front-month contract reached its lowest price since March 22.Boxed beef prices edged higher, with choice cuts rising by 43 cents to $309.52 per hundredweight and select cuts increasing by 37 cents to $287.49 per hundredweight, U.S. Department of Agriculture (USDA) data showed.",
        "The USDA said separately that weekly U.S. beef export sales for 2023 were 20,100 tonnes, up 59% from the prior four-week average.\"Exports are decent, but they're not huge,\" said Setzer.For pork, weekly export sales of 49,000 tonnes for 2023 were down 9% from the previous week but up 15% from the prior four-week average.June lean hog futures settled down 0.850 cent at 87.150 cents per pound.The USDA quoted the wholesale pork carcass cutout up 5 cents at $80.12 per cwt. (Reporting by Tom Polansek; Editing by Maju Samuel)"
    ]
}