{
    "articleURL": "/wires/reuters/article-12056435/Martin-Perez-looks-send-Rangers-series-win-vs-Angels.html",
    "content": [
        "Martin Perez will have another tough act to follow for the Texas Rangers on Sunday afternoon.",
        "He's scheduled to start on the mound against the Los Angeles Angels in the rubber match of the teams' three-game series in Anaheim, Calif.Perez (4-1, 2.41 ERA) watched teammate Nathan Eovaldi throw eight shutout innings against the Angels on Saturday night, paving the way for a 10-1 victory.Eovaldi threw a complete-game shutout a week earlier against the New York Yankees, giving him 20 straight scoreless innings overall.Perez hasn't put up as many zeros as Eovaldi has, but he's been stringing together quality starts at a similar pace.Perez has lasted at least five innings and allowed three or fewer runs in all six of his outings, making him the first Texas pitcher to produce six straight quality starts to begin the season since Lance Lynn in 2020.\"As a starter, we come in here and go deep in games,\" Perez said. \"We want to save the bullpen, too. That's a big thing for us.\"Perez followed Eovaldi's complete game last weekend by holding the Yankees to one run and six hits in six innings of a 15-2 victory.Perez is 8-6 with a 3.87 ERA in 23 career appearances against the Angels, including 19 starts.The Angels are scheduled to send left-hander Jose Suarez (1-1, 7.89) to the mound for the series finale.",
        "Suarez, 25, has been exceptional against the Rangers in his short career, owning a 3-0 record with a 3.23 ERA in six career appearances, including five starts.Suarez is coming off his lone win in five starts this season. He blanked the Milwaukee Brewers on two hits over five innings in a 3-0 win last Sunday.The win was Suarez's first in April in his major league career.\"Credit to him. It's hard to take your lumps like that for several starts,\" Angels manager Phil Nevin said. \"He made some adjustments with some things, but I'm just really proud of him. He pitched his butt off (against the Brewers). He was focused. You could just see it in his face.\"Suarez has yet to throw more than five innings or 80 pitches in any of his five starts this season.Nevin has been careful about not extending his young pitchers. He removed Reid Detmers after 94 pitches in the loss to the Rangers on Saturday night and pulled reliever Tucker Davidson after he recorded just two outs on 38 pitches in the eighth inning.Nevin brought in outfielder Brett Phillips, who gave up an RBI single and walked in a run before getting the final out in the seven-run eighth inning.",
        "\"I'm not going to let anybody go that long,\" Nevin said after the game. \"I was not going to put another pitcher in, and I was not going to let Tucker throw that many pitches. I know what it looks like, but that's just what our rules in the game are right now, and I'm not going to hurt anybody.\"--Field Level Media"
    ]
}