{
    "articleURL": "/wires/pa/article-12045985/Arsenal-hit-fourth-ACL-injury-season-Laura-Wienroither-sidelined.html",
    "content": [
        "Arsenal have been hit by yet another long-term injury blow with defender Laura Wienroither confirmed as having ruptured her anterior cruciate ligament against Wolfsburg on Monday.",
        "After coming off the bench midway through the second half of the Women’s Champions League semi-final leg at the Emirates Stadium, Wienroither then had to be substituted due to injury in the 82nd second minute.A statement from Arsenal on Thursday said the Austria international had suffered a ruptured ACL, adding: “Laura will undergo surgery in due course and will be sidelined for an extended period.“Everyone at the club will now be supporting Laura and working hard to support her recovery and return to action.”It is Arsenal’s fourth ACL injury of the season – after Leah Williamson, Beth Mead and Vivianne Miedema – and skipper Kim Little was ruled out for the rest of the campaign in March by a hamstring issue.",
        "Miedema later shared a message of support for her fellow injured team-mates, posting on Instagram: “At least we will all be in the gym together. PS the ACL group is full now. Please no more.”Wienroither herself wrote on Instagram: “I’m going to miss every single second of not being on the pitch with this special team.“I’ll fight like hell to return as soon as I’m ready to get back to following my dream in red and white. Until that time, I’m Arsenal and Austria’s biggest fan.”",
        "At a press conference ahead of Friday’s Women’s Super League clash with Leicester, Arsenal boss Jonas Eidevall said the news was “a tragedy for the player and for us as a team”.Asked why he thought Arsenal had had so many ACL injuries this season, Eidevall said: “That’s what we need to look into, obviously, and I’m afraid there’s not just one single answer.“It’s a multi-faceted injury, and we need to look at the complete picture and to see what factors in this can we control, what can we learn and what can we do better. Of course we need to look at that internally, and hopefully we’ll be better in the future.“Then there are things that we need to have external co-operation with – for example, the playing schedule, or the co-operation between clubs and national teams, or how and when the competitions are played and how the international match calendar is. That requires governing bodies, football associations, clubs and national teams working together.“So there are bits I think clubs can solve themselves internally, but there are also a lot of things that require the whole world of football to co-operate. So we need to do both.”Regarding the internal side of things, he added: “We’ve done it the last three years – this is an ongoing process, where we are constantly reviewing our injuries and benchmarking that. We continue to do that and that reflection, it’s making us better for the future, I’m sure of that.”"
    ]
}