{
    "articleURL": "/news/article-12059779/California-reparations-taskforce-says-estimated-800-billion-cost-cautious-estimate.html",
    "content": [
        "California's reparations taskforce has agreed on a package worth an estimated $800 billion - more than double the state's annual budgetBut that figure is 'very cautious' and would likely rise further as more 'harms and atrocities' are accounted for, a report said The committee has a July 1 deadline to send its recommendations to lawmakers, who will then decide whether they should be written into lawCalifornia's reparations taskforce believes the estimated $800 billion cost of its proposals is a 'very cautious' minimum that could rise even further as more 'harms and atrocities' faced by black people are accounted for.",
        "A report by the nine-strong committee, whose suggested reparations bill would amount to more than double the state's annual budget, said its eyewatering projections are 'intentionally conservative'.The five criteria of 'harms and atrocities' used to calculate the costs, which include housing discrimination and health disparities, are 'not exhaustive [and] the total of the estimated losses to African Americans is not a final estimate of all losses', the taskforce said.'Further data collection and research would be required to augment these initial estimates,' their report added. 'Additionally, since the Task Force and its economic experts' estimates for cost are intentionally conservative, the Legislature may need to provide compensation in sums greater than the amount calculated.'The observation is made in a report on the final recommendations of the taskforce, which also states that reparations for disproportionate drug felony arrests alone amounts to $228 billion.",
        "The reparations committee approved its list of recommendations on Saturday and they are expected to be sent to state lawmakers before a July 1 deadline. Lawmakers in California will then vote on whether to adopt the findings into law.A black resident in California who has lived in the state their whole life until the age of 71 could receive more than $1.2million in compensation, if the recommendations are forged into law.",
        "Reparations have been calculated based on five criteria: health harms, housing discrimination, mass incarceration and over-policing, unjust property takings, and devaluation of African American Businesses. The committee said in its latest set of documents: 'The Task Force anticipates that the Legislature will be able to add additional harms and atrocities to this list...'Since this list of harms and atrocities is not exhaustive, the total of the estimated losses to African Americans is not a final estimate of all losses.'Rather, it is a very cautious initial assessment for what cost, at a minimum, the State of California is responsible. Further data collection and research would be required to augment these initial estimates.'A breakdown of reparations for disproportionate drug felony arrests shows it was calculated by looking at how many non-Hispanic black people were arrested for such offenses each year between 1970 and 2020.Experts then worked out how many were 'excess' arrests by adjusting the figure so it was relative to the population of black people in California during each year. The figure was then multiplied by $20,000 - 'the annual compensation amount for loss of freedom' - to give a grand total of $227,858,891,023.",
        "A further breakdown shows the recommendations amount to $2,352 lost per person per year for the over-policing and mass incarceration of black communities and $3,366 per person per year of residence between 1933 and 1977 for 'discriminatory lending and zoning'.",
        "There is a further $13,619 per person per year of residence in California for 'injustices and discrimination in health' and $77,000 per person for black-owned business losses and devaluations is included in the figure. This means a lifelong black California resident aged at least 71 could receive more than $1.2million in compensation. Most eligible residents would receive less because the amount would be calculated based on age and time lived in California during the relevant periods. Some residents and activists have called for more - including one person at Saturday's meeting who said the true cost should be $200 million per African Americans. Reverend Tony Pierce aired his frustration and pointed to the country's 'broken promise' to offer 40 acres and a mule to newly freed slaves.He said: 'You know that the numbers should be equivocal to what an acre was back then. We were given 40, OK? We were given 40 acres. 'You know what that number is. You keep trying to talk about now, yet you research back to slavery and you say nothing about slavery, nothing.'So, the equivocal number from the 1860s for 40 acres to today is $200 million for each and every African-American.Serious and difficult questions still remain about who will be eligible for reparations payments. The committee agreed last March that eligibility will be lineage-based, meaning that only Californians who can prove they are descended from enslaved people can be awarded the payments.",
        "But the finer details of how proof can be established are yet to be declared.",
        "One member of the task force recently complained that headlines about its work have been dominated by the huge cash sums they have suggested. Cheryl Grills, a member of the task force, said the actual amount that the state pays black residents is the 'least important' aspect of the program, which is ultimately about recognizing how harm was caused.'We want to make sure that this is presented out in a way that does not reinforce the preoccupation with a dollar figure, which is the least important piece of this,' Grills told CalMatters.'It's important, but it's the least important in terms of being able to get to a point in our country's history and in California's history where we recognize that the harm cuts across multiple areas and domains and that the repair needs to align with that.'It's really unfortunate. I'm actually sad to see that our news media is not able to nuance better. It's almost like, \"What's going to be sensational\" as opposed to what's important,' she said.The task force has produced thousands of pages of reports identifying needs for reparations, including mass incarceration, unjust property seizures, devaluation of black businesses and health care inequality.",
        "But during a task force meeting last month, state Sen. Steven Bradford said it would be an 'uphill fight' to get the Legislature to pass any recommendations."
    ]
}