{
    "articleURL": "/sport/mlb/article-12053233/MLB-ROUNDUP-Tampa-Bay-slugger-Randy-Arozarena-plunked-TWICE-homering-win-Yankees.html",
    "content": [
        "Cash said umpires were torn over whether Arozarena was hit intentionallyIn response, Cash told the crew chief that he didn't 'give a s***' what they thinkDailyMail.com provides all the latest international sports news Randy Arozarena's first-inning home run against the New York Yankees led to two bean balls and an ejection for Tampa Bay manager Kevin Cash in the Rays' 5-4 win on Friday in St. Petersburg.",
        "Speaking to reporters after the Ray's MLB-best 27th win of the season, Cash shared his exchange with umpire Lance Barksdale, who seemed unconvinced that Arozarena was being targeted by the Yankees pitchers.'He said that half the crew did not feel that it was intentional,' Cash told reporters. 'And I said I didn't give a s*** what half the crew said.'Arozarena homered to center field off Jhony Brito before the rookie right-hander plunked the outfielder on the elbow guard in the third. Albert Abreu then hit Arozarena around belt high with a fifth-inning pitch.An angry Arozarena walked slowly toward first base and whipped his bat in disgust towards the Rays' dugout.",
        "There was yelling between the benches, but no trouble on the field. The umpires gathered and issued warnings to both teams, which prompted Cash to rush out of the dugout to argue with Barksdale, the crew chief.Wander Franco put the Rays up 5-4 with an RBI double off Jimmy Cordero (1-1) in the seventh. Yandy Díaz was initially called out at the plate, but the call was changed after a replay review.Díaz had a solo homer in a two-run third for the Rays (27-6), who opened a 10-game lead over the last-place Yankees (17-16) in the AL East.",
        "The Rays (27-6) opened a 10-game lead over the last-place Yankees (17-16) in the AL East.",
        "BLUE JAYS 4, PIRATES 0Chris Bassitt pitched seven innings, George Springer homered and Toronto stopped a five-game losing streak.Bassitt (4-2) allowed four hits, struck out five and walked four. Springer hit a two-run shot off Rich Hill (3-3) in the fifth.Pittsburgh finished with four hits in its fifth consecutive loss. Bryan Reynolds extended his hitting streak to 10 with a double in the sixth, Pittsburgh's lone extra-base hit.Hill was charged with four runs and eight hits in 5 1/3 innings.TWINS 2, GUARDIANS 0Max Kepler hit a two-run homer for Minnesota, and Bailey Ober pitched seven innings in a combined three-hitter.Ober (2-0) gave up three hits and a walk while striking out six. Jorge López worked a clean eighth and Jhoan Duran pitched the ninth for his seventh save.Guardians starter Peyton Battenfield (0-3) did not allow a baserunner until Christian Vázquez singled with two outs in the sixth. Kepler followed with a 440-foot drive to right.The Twins have homered in a franchise-record 17 consecutive games. Kepler has 15 home runs at Progressive Field since 2016, the most by a visiting player.The game featured six total hits and was played in 2 hours and 11 minutes.",
        "CUBS 4, MARLINS 1Justin Steele pitched seven effective innings, and the Cubs stopped a three-game slide.Ian Happ hit a two-run homer for Chicago. Matt Mervis made his big league debut and drove in an insurance run in the eighth with his first hit, a sharp single to right.Steele (5-0) allowed one run and six hits while lowering his ERA to an NL-leading 1.45. Mark Leiter Jr. got three outs for his first save.Luis Arraez had three hits for Miami in its fourth consecutive loss. Edward Cabrera (2-3) struck out eight while pitching five innings of three-run ball.",
        "WHITE SOX 5, REDS 4Luis Robert Jr. and Elvis Andrus homered, helping Lance Lynn and the White Sox to the win,Andrus erased a 3-0 deficit with a three-run shot in the fifth. Robert put the White Sox ahead to stay with a two-run drive against Hunter Greene (0-2) in the sixth.Lynn (1-4) was charged with four runs and eight hits in 6 2/3 innings. Reynaldo López got three outs for his fourth save.Jonathan India hit a solo homer for Cincinnati. Greene allowed five runs and seven hits in 5 2/3 innings.RED SOX 5, PHILLIES 3Chris Sale struck out 10 in six innings, and Boston earned its seventh consecutive victory.",
        "The game was delayed for about 10 minutes in the first inning when a spectator fell over a protective railing and into the Red Sox bullpen while reaching for a baseball.Boston rookie Masataka Yoshida extended his hitting streak to 15 games. Kiké Hernández and Enmanuel Valdez each had two hits and drove in a run.The 34-year-old Sale (3-2) was charged with three runs and seven hits. Kenley Jansen worked the ninth for his seventh save.Boston grabbed a 5-3 lead with two runs in the sixth against Zack Wheeler (3-2).The Phillies have dropped five in a row to fall three games under .500.",
        "ORIOLES 9, BRAVES 4Anthony Santander homered from both sides of the plate, including a grand slam, and Cedric Mullins also went deep as Baltimore won for the 14th time in 17 games.Dean Kremer (3-1) allowed one run in six strong innings for the Orioles, who became the first team this season to go deep off Braves ace Max Fried.Fried (2-1) was charged with seven runs, five earned, in six-plus innings. His ERA climbed from 0.45 to 2.08.Hot-hitting Sean Murphy drove in all four Atlanta runs, three of them on an eighth-inning homer.Baltimore improved to 22-10, surpassing the Braves (22-11) for the second-best record in the big leagues.",
        "METS 1, ROCKIES 0Kodai Senga pitched six innings of two-hit ball after a long layoff, and the Mets beat the Rockies to avoid falling under .500 for the second time this year.Brandon Nimmo homered and made a diving catch in center field after committing a costly baserunning blunder Thursday in Detroit.David Robertson caught a break to strand two in the eighth when Ryan McMahon's line-drive single hit pinch-runner Brenton Doyle on the leg between first and second for the final out of the inning.Adam Ottavino worked the ninth for his fourth save.Colorado had its four-game winning streak snapped and was blanked for the second time this season.Pitching for the first time in nine days, Senga (4-1) worked around four walks and struck out four.Colorado's Antonio Senzatela (0-1) allowed one run and three hits over five innings in his season debut.ATHLETICS 12, ROYALS 8Brent Rooker and Ramón Laureano hit back-to-back homers, and the Athletics outslugged the Royals in a matchup between the bottom two teams in baseball.Kyle Muller (1-2) became the first A's starter to earn a win in 33 games this year. The drought was the longest to begin a season in MLB history, according to the Elias Sports Bureau.Rooker and Ryan Noda each had three hits and three RBIs as Oakland improved to 7-26 with only its second victory by more than one run.",
        "Nick Pratto homered for the Royals (8-25), who dropped to 2-15 at home. Brad Keller (2-3) gave up seven runs, six earned and 11 hits in 4 1/3 innings.",
        "PADRES 5, DODGERS 2Fernando Tatis Jr. cracked his third and fourth home runs of the season as the Padres beat the rival Dodgers, 5-2, thanks to six strong innings from former Los Angeles pitcher Yu Darvish.The 36-year-old went 6 2/3 innings, striking out six and yielding only one earned run for the Padres, who improved to 18-15 as the Dodgers fell to 19-14.Tatis, who had missed the beginning of the season as he finished his PED ban, improved his average to .267 after initially struggling upon his return to the Majors.Long-time Dodgers ace Clayton Kershaw lasted only 4 2/3 innings, striking out seven, while yielding five walks and four earned runs.DIAMONDBACKS 3, NATIONALS 1Merrill Kelly struck out 10 in seven strong innings, Corbin Carroll homered in his return to the lineup and the Arizona Diamondbacks beat the Washington Nationals 3-1 on Friday night.Kelly (3-3) gave up a solo homer to Luis García in the first, but also had three strikeouts in the inning. He allowed a run on four hits and walked one in his second straight solid start.Carroll homered off Josiah Gray (2-5) in his first start since crashing into the wall against Colorado last Sunday. Andrew Chafin worked a perfect ninth for his fifth save in six chances to complete the combined four-hitter.Kelly, who allowed a run in six innings against Colorado his last start, gave up García's slicing homer just inside the foul pole in the first inning, then stranded runners at second and third in the second. He settled into a rhythm after that, giving up a pair of singles before finishing with his second career double-digit strikeout game.Gray had been sharp since allowing five runs in his season-opening start, giving up five runs in his next five starts combined.ASTROS 6, MARINERS 4Houston's Kyle Tucker broke a 4-4 tie with a two-run homer in the top of the ninth inning as the Astros topped the Mariners, 6-4, in Seattle on Friday.Yordan Alvarez also homered for Houston, which improved to 17-15 with the win.Seattle's Luis Castillo had a rare rough start, yielding four earned runs over seven innings.Houston's Christian Javier also went seven, striking out eight and yielding three earned runs.",
        "ANGELS 5, RANGERS 4 IN 10 INNINGSLos Angeles shortstop Zach Neto scored on a wild pitch by Texas' Josh Sborz as the Angeles pulled out a 5-4 win over the Rangers in 10 innings on Friday.Shohei Ohtani hit into a fielder's choice to send Neto to third in the 10th inning. Sborz was then brought in, but promptly tossed a wild pitch that allowed Neto to score the winning run.Dane Dunning continued his stellar season for the Rangers, pitching five scoreless frames to drop his ERA to 1.42.The two AL West rivals will square off again on Saturday night in Anaheim.GIANTS 6, BREWERS 4San Francisco's bullpen tossed four scoreless innings and the Giants bats did the rest in Friday's 6-4 comeback win over the visiting Milwaukee Brewers.Wilmer Flores hit a pinch-hit home run for the Giants in the eighth while Joc Pederson and JD Davis each drove in a pair of runs for San Francisco on Friday.Brewers starter Corbin Burnes struggled, allowing five runs, two earned, in six innings of work.The same two teams will square off again in San Francisco on Saturday afternoon.",
        "TIGERS 5, CARDINALS 4Riley Greene hit a two-run double in the seventh inning and Javier Báez added a two-run homer, sending Detroit to the come-from-behind victory.St. Louis fell to 0 for 11 in series openers. It is the first team to begin the season with that many losses in such games since the 1981 Kansas City Royals dropped their first 13 series openers, according to OptaSTATS. The Cardinals have lost seven in a row and 14 of 17 overall.Detroit's Matthew Boyd (2-2) pitched six innings of three-run ball. Alex Lang earned his sixth save after giving up a leadoff double to Paul Goldschmidt. He struck out the final three batters. The Tigers scored three runs in the seventh to take a 5-3 lead. Jordan Hicks (0-3) got the loss."
    ]
}