{
    "articleURL": "/wires/aap/article-12052623/Budget-matters-amid-cost-living-crisis-nation.html",
    "content": [
        "As federal budget day looms, a chasm has emerged between what's happening in people's lives and traditional economic indicators.",
        "The cost of living crisis has even coined its own slang - \"cossy livs\" - as the pain hits the pockets of the youngest consumers.From its emergence in an online post in the United Kingdom in January to its consideration for inclusion in the Macquarie Dictionary, \"cossy livs\" follows the hardships of the \"panny-d\" (pandemic) - for household and government budgets.In fact, a string of crises - the rising cost of living, housing and homelessness, climate change, family violence, mental health and inequality - suggest economic growth and other data markers are not the best measures for human wellbeing.But momentum is growing to tackle the problems that fall between the pages of a budget that traditionally allocates funding to specific federal departments.The world's first dedicated public official empowered to act in the interests of future generations comes from a country that's tiny but is recognised as a global leader in good government.Visiting Australia from Wales, Future Generations Commissioner Sophie Howe is urging decision-makers to meet today's needs without compromising future generations and show how they are preventing problems from getting worse.\"Unfortunately, we are not hard-wired to think to the future,\" she recently told an audience in Melbourne.\"When we think of ourselves in the future, our brains fire up in a way that is more similar to when we're thinking about a stranger.\"",
        "But with a world in \"polycrisis\" - facing wars, inequality, climate change and a levelling off in life expectancy - governments need to move beyond gross domestic product to measure decisions on the basis of planetary and human wellbeing, Howe says.Wales - known as the land of culture and rugby, of singer Tom Jones, footballer Gareth Bale and the birthplace of Julia Gillard - was once a coal capital, Ms Howe noted.\"We were known for being at the forefront of the coal trade, where in our capital the first one million pound cheque for coal was signed,\" she said.\"Now we want to be known as the country at the forefront of the wellbeing revolution.\"And in 2015, Wales passed the Well-being of Future Generations Act, requiring public bodies to think long-term to tackle climate change, poverty and have sustainable growth and jobs.The CEO of the Australian independent think tank, Centre for Policy Development, Andrew Hudson said good government decision-making can meet the long-term needs of people, communities and the environment.Many hoped a standalone wellbeing budget would be ready for release alongside the federal budget on May 9.But the Albanese government has instead committed to a new 'Measuring What Matters Statement' around the middle of this year, after making a start in its first budget last October.",
        "The statement will be Australia's first national framework on wellbeing and will evolve over time, according to Treasurer Jim Chalmers.\"It's about seeing if we can do a better job at considering the factors that are critical to everyone's wellbeing - whether that's the state of our environment, our health or our community,\" he says.Katie Maskiell, UNICEF Australia's Head of Child Rights, Policy and Advocacy, told AAP the indicators being considered in the new statement, especially for children, are a good start.\"Global economic pressures are creating strain for families in many different ways, so it's important that we have regular measurement of how families are coping so that we can address those pain points and ensure children have the best start,\" she said.Most children in Australia have access to the food they need, participate in education and are optimistic about the future.\"But there are also areas which need urgent attention including stagnant poverty, emerging childhood obesity, increasing rates of psychological distress, and unacceptable inequity for Aboriginal and Torres Strait Islander children,\" Maskiell said.In the meantime, the gap between the rich and poor is in danger of widening if there is no change, leading number-crunchers have found.An Actuaries Institute research paper, 'Not A Level Playing Field', reveals many Australians feel income disparities are too large.",
        "Not owning a home is one of the biggest drivers of income poverty in old age and affects the health and education of families.The wealthiest one-fifth of households enjoy six times the disposable income of the bottom 20 per cent, and poorer households are doing it tough across a range of social measures.Comparing the two groups show the bottom 20 per cent are four times more likely to have recently been unable to meet rent or mortgage costs, three times more likely to be a recent victim of crime and twice as likely to suffer psychological distress or die by suicide.There are also significant gaps in home ownership, access to childcare and Year 12 completion rates and a higher reliance on welfare payments in low-income households.\"Given the difficult economic conditions we are faced with Australia should brace itself for the gap to increase even further,\" Actuaries Institute CEO Elayne Grace warned.\"Wealth protects people in bad economic times. But for people on low incomes, they're going to suffer a lot more as the list of things they're no longer able to afford will continue to grow.\"Australia must also tackle worsening gender segregation in critical industries, according to the Committee for Economic Development of Australia.There's a low proportion of women in traditionally male-dominated and well-paid industries such as construction, mining, technology, engineering, and manufacturing and not many men working in health care, social assistance and education.",
        "Meanwhile, the National Children's Commissioner has called for urgent government action amid confronting evidence of the scale of child maltreatment in Australia.\"We have no reporting on budget allocations for child wellbeing. We have no Minister for Children. We have no vision and we have had no urgency for change,\" Commissioner Anne Hollonds said.A nationwide study of 8500 Australians aged 16 found two-thirds of respondents reported having experienced maltreatment in childhood.Almost one-third (32 per cent) experienced physical abuse, sexual abuse (28.5 per cent) or emotional abuse (30.9 per cent).Some 40 per cent had experienced domestic and family violence and 39 per cent had experienced two or more types of child maltreatment.The commissioner warned child maltreatment leads to serious lifelong harm and massive costs to the community, and in a rich country - like Australia - such high rates were a sign of failed public services.Mental health services alone are estimated by the Productivity Commission to cost well over $200 billion each year.Child maltreatment is also a major contributing factor to the youth justice crisis, Hollonds said.Small business owners are also experiencing lower levels of wellbeing than the rest of Australians, and lower rates wellbeing compared to New Zealand and the United StatesSmall businesses make up more than 97 per cent of all businesses in Australia, employ the most workers and contribute over half of Australia's economic output.",
        "But as cost pressures bite, research from technology services firm Xero has found small business owners are among those more vulnerable to financial and mental distress.More than a quarter (26 per cent) say managing issues related to employee mental health is a source of stress most or all of the timeOne-third say their business is experiencing financial stress at least more than half the time, and younger small business owners (30 and under) experience poorer wellbeing than Australian small business owners aged over 50.Meanwhile, doctors say the poor, elderly, vulnerable and those in need of complex care need relief in the budget and beyond.The Royal Australian College of General Practitioners President Nicole Higgins said spiralling inflation and cost of living pressures are forcing some to make the impossible choice between spending on healthcare and other essentials.\"Australia prides itself on being the lucky country where everyone has a fair go,\" Dr Higgins said.\"But without urgent action to stem the bleeding and improve access to care for Australians, inequality, and the gap between rich and poor will get much worse.\"Dr Higgins said all Australians should have access to high-quality care, no matter their postcode or income."
    ]
}