{
    "articleURL": "/sport/mlb/article-12044805/Yankees-general-manager-Brian-Cashman-pleads-fans-not-amid-injuries.html",
    "content": [
        "The Yankees have an astounding 12 players on the injured list as of WednesdayThey are currently last place in the American League East with a 16-15 recordDailyMail.com provides all the latest international sports news New York Yankees general manager Brian Cashman expressed that he still has confidence in the team to have a successful season, despite the teams rash of injuries 'certainly killing' them.",
        "The Yankees are currently last place in the American League East at 16-15 and have an astounding 12 players on the injured list.Aaron Judge (strained right hip), designated hitter Giancarlo Stanton (strained left hamstring), third baseman Josh Donaldson (strained right hamstring) and starting pitchers Carlos Rodón (strained left forearm and sore back), Luis Severino (strained right lat) and Frankie Montas (right shoulder surgery) are among a dozen players on the injured list. 'Injuries happen and ultimately we´re getting a lot of injuries right now, and that´s certainly killing us,' the general manager said Wednesday. 'Don't give up on us. 'We have time to make up ground, and we're going to compete with who we have here,' Cashman said of the Yankees, who entered play 8.5 games back of the first-place Rays. 'We look forward to getting who we need back at a later date.' ",
        "Some of those who the Yankees are looking forward to getting back have been out since spring training dealing with their injuries.Rodon, who signed a huge five-year $162m contract with New York during the offseason, is a prime example.Rodon ended up on the shelf during spring training with a forearm injury and has been unable to rejoin the lineup due to an ongoing back issue. ",
        "'He can't get over the hump with the back, so we'll have other people look at it,' manager Aaron Boone said Tuesday of Rodon. 'He's continuing to throw through all this to get to that place we need to get him to, and that hasn't happened.' 'He's just not moving how he needs to. He's a pretty dynamic, electric guy. That's the hard thing. We have to make sure we're getting as many eyes on it as we can to determine the best course of action.'",
        "Rodon had been healthy over the course of the past two seasons but, had a long list of injuries throughout his career before that.Meanwhile, Judge was placed on the injured list at the beginning of the week after suffering a hip strain and wasn't impressed with move. 'I'm still not happy about it,' Judge said. 'It is what it is. I'll be back here in a couple days.'Montas is another example of a player still recovering from an injury suffered long before this season. He was acquired by New York ahead of last season's trade deadline despite a shoulder issue.'Ultimately, we got all the information that we had access to,' Cashman said of Rodon and Montas. 'In terms of Rodon, he came in, did the full physical... In Montas' case, we got all access to everything including me talking to the player involved. When he was here, he was 100 percent healthy.' ",
        "The Yankees did recently get outfielder Harrison Bader back from injury as he played his first game of the season on Tuesday after missing time with a strained oblique."
    ]
}