{
    "articleURL": "/tvshowbiz/article-12044115/Guy-Fieri-sons-Hunter-26-Ryder-17-serve-500-meals-Special-Olympics-event-CA.html",
    "content": [
        "Guy Fieri put on his philanthropic hat with his two sons, Hunter and Ryder Fieri, at a Special Olympics event at at school in Northern California on Tuesday.",
        "The 55-year-old kitchen extraordinaire - who recently got in shape - served up food at the event at Windsor High School alongside Hunter, 26, and 17-year-old Ryder.Students there worked with the three to prepare lunch for about 575 athletes and volunteers.Teaching pupils to make Mexican rice and beans for the charitable event, Fieri first paid a visit last week.Upon his return to the school this week, the media personality shared photos from the regional Special Olympics on Instagram.",
        "Outtakes from the day of volunteering showed Hunter and Ryder packing meals into boxes, and there were also lot of group pictures featuring the Food Network star.The Guy Fieri Foundation regularly gives attention and shares resources with underserved communities. In 2020 Guy headed to Santa Rosa Memorial Hospital in California to feed more than 1,000 first responders and healthcare workers.Additionally, he extended himself by adding a personal touch with a handwritten thank you note with his initials penned on the lids of carryout boxes.Also in 2020, he teamed up with the National Restaurant Association Educational Foundation to spearhead the Restaurant Employee Relief Fund, People reported. With a notable campaign, the group was able to raise money for one-time $500 grants giften to workers affected by the coronavirus pandemic.",
        "Fieri has instilled great values in his sons, Hunter, 26, and Ryder, 17, as evidenced by their routine volunteer efforts.Last year Guy surprised Ryder with a truck after he drove his grandparents' minivan for a year. ",
        "Speaking to People last fall, the foodie said, 'He got my parents' old, used 259,000-mile Chrysler minivan.'The father-of-two explained, 'I'm not buying Ryder a car, and I refuse to let him buy a car until he spends one year with no tickets, no accidents, driving the minivan.'Rider's good behavior paid off, but only after his dad dared him to a scavenger hunt as a final challenge before revealing the gift.Guy said Ryder and his friends went to extensive measures for one clue.The hunt was arranged at the longtime TV host's Northern California ranch.'The second to last clue sent them all the way up the mountain to the lookout, and they had to find the clue,' he dished.'And then it said, \"Come down where it's deep and cold\" or whatever. And I had opened the pool — now granted, it's 34 degrees up at the ranch in the wind — and in the pool tied to a pipe is the final clue,' Fieri continued.",
        "When using a pool skimmer was to no avail, Ryder and his friends resorted to braving the cold water.",
        "'They all strip down to their boxers and they all jump in and he pulls it out and he gets it.'The water had leaked in the envelope a little bit, so it was a little bit wet and he's trying to read it,' Guy recalled. 'It was [revealing] this truck that he's wanted.'The truck in mention was Guy's initially, and has continued to stay in the family.'Hunter wanted my truck, so Hunter bought my truck and we made Ryder buy Hunter's truck,' the media personality added.Making sure to teach his son the value of hard work, he noted that he made his younger son pay for half.He and his wife Lori paid for the remaining half. He said to the publication, 'I mean, what is the gift?'The gift is, \"Hey, you have to pay half the money we'll pay the other half.\" But he was really excited.'Speaking about a more recent memory he remembered, 'I saw him the other night. I was getting home about the same time he was.'I say, \"You back in?\" He goes, \"Oh, yeah. Truck looks way cooler when you look at it from the front.\"'",
        "Ryder recently took to social media to share a slew of outtakes from his junior prom.",
        "The high schooler donned a spiffy black suit with a red bowtie and corsage, coordinating with his date's dress.Ryder, who entertains more than 11,000 followers on the app, wrote in the caption: 'Out of the ordinary.'His big brother dropped in the comments to support him as he wrote, 'Baller!!' "
    ]
}