{
    "articleURL": "/news/article-12051195/When-General-Election-UK.html",
    "content": [
        "Here is all you need to know about when the next UK General Election could be  After 2023 Local Election results saw the Conservatives lose a large number of seats, eyes will be on the next General Election in the UK. ",
        "Sir Keir Starmer has declared Labour on track for power as local election results showed the Conservatives were stripped of control of at least a dozen councils and shed hundreds of seats.So when is the next general election in the UK? How long is a government term in the UK? Read on below for everything you need to know about the next general election in the UK. ",
        "When is the next General Election in the UK? As the current Prime Minister, Rishi Sunak is allowed to call a General Election at any point, should he wish to do so. Mr Sunak has this power up until the date of this current Parliament's expiry, which falls on Tuesday, 17 December, 2024. The Fixed-Term Parliament Act, which was passed in 2011, created fixed, five-year periods between general elections but that rule was scrapped in 2022.Under that law early elections could be held only if two-thirds of the House of Commons voted in favour, or if there was a vote of no confidence in the Government.So in 2017, Theresa May secured an early election when she passed the two-thirds threshold as MPs voted by 522 to 13 to go to the people. But in 2019, Boris Johnson passed a new one-off act which needed only a straight majority vote among MPs to have an early General Election. After he got the vote he needed, that act was allowed to lapse. ",
        "How long is a government term in the UK? Once a government is elected by people in the UK, it can serve for a maximum of five years before another General Election must be held, per the Fixed Parliament Act. ",
        "A motion of no confidence is a motion can also be moved in the House of Commons to expressing lack of confidence in the government, or the Prime Minister has requested a dissolution from the reigning monarch, triggering a general election.The last time a motion of no-confidence triggered a change of government was in 1979. This saw the Prime Minister at the time, James Callaghan, advise the Queen to dissolve Parliament after losing a vote of no confidence by just one vote (311 votes to 310 votes), which resulted in Margaret Thatcher becoming Prime Minister. When was the last UK General Election and who won?The last general election in the United Kingdom was held on Thursday, 12 December, 2019. It saw Boris Johnson, who was previously the Mayor of London, become Prime Minister.  The result saw the Conservatives win a landslide majority, securing victory by an 80-seat margin. This equated to 43.6% of the popular vote, which marked the highest percentage for any party since Thatcher's win in 1979. ",
        "Since then however, Mr Johnson has been and gone, with two more Conservative Prime Ministers governing the UK. Mr Johnson officially left his post as Prime Minister on 6 September, 2022. ",
        "He was succeeded by Liz Truss, who endured a tumultuous period in office which lasted just 45 days before she also resigned, with Mr Sunak subsequently named as Prime Minister. "
    ]
}