{
    "articleURL": "/news/article-12044811/PacWest-Bank-teeters-verge-collapse-asks-money-stock-drops-50.html",
    "content": [
        "Beverly Hills-based PacWest has seen its shares fall 77 per cent since the start of March, with the downturn worsening this week after First Republic's demiseOn Wednesday shares fell 50 percent in after-hours trading following a report that the bank was looking for a sale or to raise fresh capitalPacWest is similar to Silicon Valley Bank: ties to tech community, huge amounts of uninsured deposits. They also have large commercial real estate loansShares in Beverly Hills-based PacWest bank plummeted by 50 percent in after-hours trading on Wednesday after it emerged the bank had sought help for either a sale or injection of fresh capital - as a closely-watched financier warned of dominoes falling.",
        "PacWest bank is seen as vulnerable because it has much in common with Silicon Valley Bank, which collapsed on March 10.Both PacWest and SVB are California based,  have strong ties to the embattled tech community and large amounts of uninsured deposits - which exceed the $250,000 federally protected limit.PacWest is also extremely exposed to fluctuations in commercial real estate. Analysis by Barrons found that commercial real estate loans amounted to more than 375 percent of PacWest's capital at the end of December - significantly above the 300 percent maximum set in federal guidelines.Furthermore, the most volatile real estate loans, for land and construction, represented almost 140 percent of the bank's capital. ",
        "PacWest's troubles come under the leadership of President Paul Taylor, who was hired last summer and revealed as the new head of the bank when former CEO Matthew Wagner announced he would retire in 2023. Some of the bank's recent deals included $107 million of construction financing, agreed in January this year, for a 224-unit apartment property in the Gowanus neighborhood of Brooklyn.The bank reached a $134.5m agreement in August 2021 to convert an office tower in White Plains, New York into a 13-story, 255-unit multifamily building.And in November 2017, the firm provided a $28 million construction loan for a student housing property in Berkeley, California.",
        "Commercial real-estate is viewed as risky as it can be heavily impacted by downturns in the economy.  On Wednesday, Bloomberg reported that PacWest had instructed investment bank Piper Sandler to help it investigate its next moves, including a sale. The bank was also considering raising fresh capital.While the stock held steady for most of the day, Bloomberg's report sent after-hours shares down 50 percent.Six weeks ago, as the dust was settling on the implosion of SVB, PacWest said it had shored up its access to cash by raising $1.4 billion via a lending facility from Apollo-backed investment firm Atlas SP Partners. ",
        "The bank has been in the spotlight for several weeks - although it is significantly smaller than the three taken over by federal authorities so far: SVB on March 10, Signature Bank on March 12, and First Republic on May 1.PacWest has branches in California as well as Durham, North Carolina and Denver, Colorado. Last month PacWest reported that it had lost more than $5 billion in deposits during the first quarter but said it was reversing the tide and had received more than $1 billion in inflows since March. In the same update, PacWest announced a net loss for the quarter of $1.21 billion.Some concerned consumers have withdrawn their money from banks over fears they could lose their cash if the firm collapses. Federal guarantees at banks only cover the first $250,000 of deposits.  ",
        "PacWest's shares have fallen 77 percent since the start of March. And it is far from the only bank teetering. On Wednesday, Western Alliance Bancorp sought to assure markets, saying it had not experienced any unusual deposit flows and had adequate liquidity.The Phoenix-based regional lender suffered a 23 percent drop in its share price, but said it was 'reaffirming its financial strength as well as its deposit growth guidance in response to recent industry events.'",
        "The sector jitters come after a period of relative calm and could tighten credit availability across America, impacting growth.Jerome Powell, the chair of the Federal Reserve, said on Wednesday reiterated that the country's banking system was resilient while delivering another 25 basis point rate hike. Powell said bank deposits had stabilized. Some financiers disagreed. 'Confidence in a financial institution is built over decades and destroyed in days. As each domino falls, the next weakest bank begins to wobble,' billionaire investor Bill Ackman wrote in a tweet.He called on regulators to put in a broad deposit guarantee.'Until investors are rewarded for betting on a wobbling bank, there will be no bid, and the best sale is the last price,' he wrote.In a report on Monday, obtained by Forbes, the Federal Deposit Insurance Corp (FDIC), which has since the 2008 crash protected the first $250,000 of savers' cash, floated the idea of updating its rules.",
        "The FDIC did not provide a detailed plan, but said it might be worth considering a scheme whereby the $250,000 limit can temporarily be raised, or extended - just for business customers.'The recent failures of Silicon Valley Bank and Signature Bank, and the decision to approve Systemic Risk Exceptions to protect the uninsured depositors at those institutions, raised fundamental questions about the role of deposit insurance in the United States banking system,' said the FDIC chairman, Martin Gruenberg."
    ]
}