{
    "articleURL": "/femail/article-12059837/Blake-Livelys-trainer-shares-secrets-incredible-figure-says-sleep-leads-weight-loss.html",
    "content": [
        "Don Saladino, a New York gym coach, has worked with the star, 35, for 10 yearsHe warned against restrictive diets, saying that 'starving yourself' doesn't helpDon advises focusing on healthy habits like sleeping well and drinking water Blake Lively's longtime personal trainer has revealed the secrets to how she keeps her incredibly-toned figure - and he insisted that getting the right amount of sleep is the key to weight loss, rather than cutting back on carbs or counting your calories.",
        "Don Saladino, a New York-based gym coach who has worked with the actress, 35, for more than 10 years, explained to E! News recently that you don't have to 'starve yourself' to shed pounds.Instead he said getting in shape is all about creating healthy habits like getting enough rest at night, drinking tons of water, and walking as much as possible.According to the health buff - who has also trained a slew of other stars like Blake's husband Ryan Reynolds, Sebastian Stan, Anne Hathaway, Emily Blunt, and Cindy Crawford - he saw one client lose nine pounds in three weeks simply from sleeping 90 extra minutes a night.'It's a fat-burner, and it's free,' he told the outlet, adding that you should be getting roughly seven to nine hours a night of sleep.",
        "The fitness guru warned against restrictive diets, explaining that they often leave people feeling 'ravenous' which can spark binge-eating and other unhealthy tendencies.",
        "'Stop living in a caloric deficit,' Don said. 'Calories are energy, so if you get into a car and you gas up a car, a car is going to drive until it runs out of gas or until you pull over.'The human body is going to look at the amount of calories someone is consuming and say, \"Wait a second, this person is not putting enough energy into my body.\" And you're not going to run all that well.",
        "'And that's why you see people who are eating too little calories, they can't lose weight.'Their blood sugar level is low and their energy level is low, so they are not moving as frequently anymore.'Instead, he said to focus on consuming 'high-quality food' that's high in protein, as well as tons of fruits and vegetables. The trainer said an easy way to sneak some exercise into your life is by walking 'everywhere,' explaining that even those who work a desk job can easily get steps in.'Walk to work in the morning, walk home from work, after all three of your meals, walk for 30 minutes, just do something,' he encouraged.",
        "Warm up - One roundChild's pose - hold for five breaths90:90 hip stretch - hold for 30 secondsHip flexor stretch - hold for 20 seconds Cats and dogs - 10 reps Hip airplanes - five repsFlood slides - 10 repsWorkout - Three rounds, one-minute rest between rounds Push-ups - five to 10 repsBroad jumps - five repsFarmer's carry - 25 stepsDumbbell deadlifts - eight repsFlat dumbbell press - 10 repsGoblet squats - 10 repsBent over dumbbell row - 12 reps ",
        "'You're going to have to show some discipline. It's a pretty easy thing to do and sometimes people are like, \"Oh, walking is easy, that's effective?\" Of course it is. It's very effective.'",
        "Don also recommending cutting out alcohol, which he described as a 'toxic substance.''I have people who get off alcohol and in one month they're like, \"Oh my God, I didn't change anything else and I lost 12 pounds,\"' he shared.He warned against pushing yourself too hard during workouts, explaining that 'consistency' is more important than 'intensity.'",
        "'The goal [of working out] should be leave [the gym] better than you felt before you came in,' he explained, adding that if your muscles are sore you probably went too hard.'You don't need to come in and beat the s*** [out] of yourself. You have to recognize that we don't have to be perfect every day. 'You're going to wake up one day and have a terrible night's sleep and be like, \"You know what? I'm just better off getting my steps in today. I'll bump it to tomorrow.\" Understanding that is really important.'When it comes to Blake's go-to workout, he said she focuses on 'movement' and 'developing a high level of energy.'",
        "'She's a great mom, she's got four kids jumping on her and that's hard on the body,' Don explained.'[Her workout regimen] allows the body to feel strong and resilient... and restores the way she feels.'Last year, he shared some of the things that Blake does when training with him to Women's Health, which included push-ups, broad jumps, the farmer's carry, dumbbell deadlifts, flat dumbbell presses, goblet squats, and bent-over dumbbell rows.Back in 2018, Blake couldn't stop gushing over Don in a post shared to Instagram, in which she revealed he helped her lose the 61 pounds that she gained during pregnancy in just 14 months.",
        "'Turns out you can't lose the 61 pounds you gained during pregnancy by just scrolling through Instagram and wondering why you don't look like all the bikini models,' she captioned a shot that showed her and Don posing in the gym together.'Thanks Don for kickin' my A-double-S into shape. 10 months to gain, 14 months to lose. Feeling very proud.'"
    ]
}