{
    "articleURL": "/tvshowbiz/article-12052359/Emmerdale-viewers-astounded-Chloe-says-Mack-wants-baby-dead.html",
    "content": [
        "Emmerdale viewers were left astonished during Friday's episode as Chloe Harris concluded the secret father of her baby Reuben, Mack Boyd, wanted him dead.",
        "Chloe's (Jessie Elland) newborn baby has been diagnosed with bacterial and is currently fighting for his life in hospital.The new mother was set to flee to Aberdeen with the baby, but was previously left full of fear when he began burning up and was refusing to take liquids.Reuben was rushed to hospital and the news made its way through the village that a distraught Chloe was spending all her time on the ward in the hope her newborn would pull through.However, in shocking scenes during Friday's episode, Chloe accused Mack (Lawrence Robb) of wanting Reuben dead, with some viewers predicting Mack is not even the father.",
        "For months, Mack and Chloe have kept their secret one night stand and resulting child under wraps, with only Nate Robinson (Jurell Carter) and Sarah Sugden (Katie Hill) knowing the truth.However, Mack is coupled-up with Charity Dingle (Emma Atkins), with Chloe giving birth to Reuben during Charity and Mack's wedding.Fans of the soap are predicting the Mack's paternity will be called into question in the future and the baby may not even be his.But viewers were left astounded when Chloe got so frustrated with Mack's emotional absence that she accused Mack of wanting the baby dead, with Mack deciding he promptly wanted to leave.",
        "Taking to Twitter, one person wrote: 'How did she jump to the conclusion that Mack wants the baby dead? #Emmerdale,' to which someone responded: 'Because it *would* make his life easier.'While someone else posted: 'Chloe that wasn't nice saying Mack is glad the baby ain't well #Emmerdale.'Insisting Mack needed to wake up, one person wrote: 'Well said Chloe!!!!!! Mack deserves that harsh reality check. #Emmerdale.'While someone else wrote: 'What's the point turning up at the hospital if two minutes later you suddenly make excuses to leave! Selfish self centered coward as Chloe calls him ..oh yes!!!! #emmerdale.'",
        "'Yes Chloe you tell him straight #Emmerdale,' wrote another viewer.While someone else wrote: '\"Our Son\" Yeah when you pick and choose Mack. Chloe is right you are really selfish.'Things are set to get worse Mack when Charity eventually learns that he is Reuben's father.Things are finally set to come to a head as Mack's wife Charity works out his shocking secret after he struggled to cope with baby Reuben's recent bacterial meningitis diagnosis.In upcoming scenes, Mack's pal Nate worries he's deluding himself as he contemplates balancing his marriage to the landlady with a secret life with his son.Meanwhile, Chloe reels when doctors inform her that Reuben may have a bleed on his brain.",
        "Over at the Woolpack, Dan Spencer attempts to stay positive about Reuben's chances but Mack (Lawrence Robb), who's been drowning his sorrows amid his son's health woes, reaches his breaking point.And wife Charity (Emma Atkins) is left astonished when he then punches Dan before stalking off into the night.Later, a worried Mack sits outside the hospital, unable to bring himself to go in.He then ignores a call from Charity, who's become increasingly concerned about what's truly causing their rift. Inside the hospital, Chloe's desperately worried when the consultant tells her they'll need to do another scan on Reuben, who's condition doesn't appear to be improving. Elsewhere, Nate urges Mack to visit Reuben in hospital after realising the extent of his pal's concern for the tot. However, with Charity already suspicious over his unusual behaviour, Mack is soon risking his relationship as he heads to the hospital.Soon, both parents are utterly relieved when the consultant tells them Reuben is showing no signs of brain damage. And when Chloe asks if he wants to come and see Reuben with her, Mack jumps at the chance to spend time with his son.Unbeknownst to him meanwhile, Charity and Chloe's half-sister Amy Wyatt arrive at the hospital for a surprise visit after learning that Reuben is on the mend. ",
        "But Charity is in for a shock when she spots an unaware but emotional Mack doting over baby Reuben.She's soon hit with the shocking realisation that Mack is in fact Reuben's dad.But just how will she react to the shocking discovery?  Emmerdale airs weekdays at 7:30pm on ITV1 and ITVX. "
    ]
}