{
    "articleURL": "/tvshowbiz/article-12055443/Irina-Shayk-wears-racy-ensemble-hanging-designer-Riccardo-Tisci-F1-racetrack.html",
    "content": [
        "Irina Shayk went full speed ahead in a racy ensemble at an F1 racetrack.",
        "The model, 37, who wowed at a Met Gala after party with Chris Rock, showcased her toned limbs in a revealing black mesh tank dress with a white T-shirt and black bikini bottoms.The runway veteran's long brown hair hung in loose layers beneath a black billed cap.The cover model wore white Nike socks and black kitten heeled pumps.   She accessorized with a thick platinum chain necklace and dark sunglasses.",
        "Irina appeared be be wearing minimal makeup with a natural looking lip.The catwalk queen shared a few photos of herself with Italian fashion designer Riccardo Tisci, 48.Together they took a tour of the facility, including the high tech garage where the F1 cars are serviced.Fellow model Stella Maxwell joined her at the track.The 32-year-old beauty from Brussels wore a diaphanous black bustier as she posed for a photo with Irina and Riccardo. The model posted FI next to her photo carousel on Instagram and appreciative fans shared their delight with the snaps with comments such as 'Queen ❤️' and 'Stunning.'  Irina was spotted speaking with her ex-partner, Bradley Cooper Monday at the Met Gala.The two share daughter, Lea, six. ",
        "At an afterparty, the Russian beauty defied convention and changed into a pair of comfy gray sweats and a white tank top, paired with gold ankle boots.",
        "In an essay for Harper's Bazaar, the Hercules actress credited becoming a mother for adding to her self confidence.'People ask, “Have you always been that confident?” No, I haven’t. It’s just that I’ve learned to love my imperfections. You need to love all of you.''We’re teaching our daughter that the most important thing is to be kind to people.''Every time we send her to school, we’re like, “Just remember kindness and love.” So I think that’s what true beauty is,' she asserted.'It’s not about putting on masks, putting on makeup, brushing your hair, putting on nice clothes. With TikTok and Instagram and social media, my daughter is growing up in a different environment than I grew up in, so sometimes it kind of scares me. But most important is teaching our daughter bigger values than being pretty on the outside.' "
    ]
}