{
    "articleURL": "/news/article-12044665/Family-mother-shot-dead-terrorists-Israel-listens-heart-beat-again.html",
    "content": [
        "Lucy Dee, 48, and two daughters died last month after drive-by shooting in IsraelHer surviving daughters Keren, 19, and Tali, 17, met their mother's donor patientMother-of-two Lital Valenci is one of five to recieve organs from tragic motherThis is the moment the family of a mother shot dead by terrorists hear her heart beat again after meeting the donor patient who recieved the organ.",
        "Lucy Dee, 48, died last month after succumbing to critical injuries sustained in a drive-by shooting in Israel.Her death came just one day after the funeral of her daughters Rina, 15, and Maia, 20, who were killed instantly on April 7 by 20 bullets from a Kalashnikov rifle in the attack launched by suspected Palestinian gunmen.Her surviving daughters Keren, 19, and Tali, 17, met their mother's donor patient in an emotional reunion.Mother-of-two Lital Valenci last month recieved the organ after suffering severe heart failure for five years at the Beilinson Hospital, where the reunion took place.",
        "The operation took place on Apil 11, shortly after she died and four days after she was shot twice.She is one of five to recieve organs from the tragic mother - with her lungs being given to a woman, 58, and her liver and kidneys going to men aged 25, 58 and 39.One daughter sobbed as she heard their mother's heart beating through a stethascope, with Ms Valenci holding and comforting them as they listened.She soon switched, letting her sister hear a link to their late parent.'I was so moved when I learned who I was receiving a heart from, as I had read about Lucy Dee and what an incredible woman she was, with an exemplary family,' Ms Valenci told Jewish News Syndicate.",
        "Mrs Dee's husband Rabbi Leo Dee was formerly the senior rabbi at Radlett United Synagogue in Hertfordshire and assistant rabbi in Hendon, north London. The sisters were born in London and the family moved to Israel in 2014, according to reports.His wife's funeral earlier came after Britain's Prime Minister Rishi Sunak condemned the 'abhorrent' attack. Rabbi Dee spoke at the funeral saying of his slain wife: 'We literally traveled the world together, we made aliyah together. We built a new life for ourselves in the promised land.",
        "'You were airlifted from a murder scene. I can't imagine the pain, physical and mental, if you were conscious in any way for that journey.'Nothing will ever replace you, your soul is part of my soul.'The funeral was attended by thousands of mourners who lined the roads in the rain leading to the service in Kfar Etzion, close to the Efrat settlement where the Dee family lived. One of Lucy's daughters, Karen, said: 'Yesterday, beside the grave of Maia and Rina, I closed my eyes and prayed that you would wake up, so that we wouldn't need to go through this pain twice. 'My heart is already so full of pain, I am paralyzed by all the pain. To lose your mother is like losing your life. I don't want to move on.'",
        "The fatal shootings came as violence spiralled following clashes between Israeli police and Palestinian Muslim worshippers at the al-Aqsa Mosque - a holy site for both Jews and Muslims - in Jerusalem's old town last week amid Jewish Passover celebrations and the Muslim holy month of Ramadan. ",
        "The Dee family lived in the Efrat settlement, near the Palestinian city of Bethlehem, according to the settlement's mayor, Oded Revivi. Rabbi Leo Dee told a press conference at the Efrat Settlement on Monday that he had been informed of an attack and called his family before realising he had received a missed call from his daughter Maia. He said at the press conference, broadcast on the BBC: 'I hadn't noticed it ring, I hadn't picked up the phone, the feeling she called me during the attack and I wasn't able to speak to her will come back and haunt me for a while.'He said that he saw a photograph on Instagram of his car with a bullet hole in it, with the family's suitcases with blood on them, and drove 'like a lunatic' to the scene."
    ]
}