{
    "articleURL": "/tvshowbiz/article-12058623/Maisie-Smith-models-racy-outfits-promote-jewellery-collection.html",
    "content": [
        "Maisie Smith looked sensational while modelling a string of racy outfits to promote her collection with jewellery brand, Abbott Lyon.",
        "The former EastEnders star, 21, wowed in a striped yellow minidress featuring sexy cutouts and an asymmetrical neckline as she posed for the camera.She went on to flash her midriff in a cream crop top and coordinating trousers before changing into a tiny bandeau, layered beneath a swirly blue co-ord.Maisie wrote in her caption: 'GUYS it’s now live!! I’ve been counting down the days to share my Unique jewellery collection with you and you can shop it 2 for 1 now using code MAISIE2FOR1 It’s personalised, it’s colourful, it’s unique to you!'Choose from a rainbow of letters, icons and emoji’s to create jewellery to match your energy ⚡️ Discover the collection at my link in bio!",
        "'Let me know what you create in the comments below… AD.'Last week, Maisie shared a BTS look at the glamorous photoshoot. The actress flaunted her figure in a pink denim co-ord which boasted a cleavage enhancing bustier and high-waisted trousers. Teasing a hint of her toned midriff she posed up a storm with a face full of make-up and her auburn tresses styled in loose waves.Maisie oozed confidence on the set as she accessorised with gold bangles and rings for the commercial. Adding a sparkly slide to her hair she teased a glimpse at her upcoming range with the swanky brand.",
        "The video comes after Maisie and her boyfriend Max shared some romantic snaps from their vacation in Abu Dhabi on Thursday.The lovebirds couldn't take their eyes off each other as they enjoyed a romantic dance at the Louvre. The couple, who competed against each other during the 2020 series of Strictly, decided to put some moves into practice as they twirled by the pool. ",
        "Maisie flashed a hint of her toned legs in a maxi dress with thigh-high split as The Wanted star spun her around.  Maisie captioned the shot: 'Twirls at the Louvre'. Fans took to the comment section to gush over the romantic snaps. Great British Bake Off star John Whaite wrote: 'You guys'. Another fan wrote: 'Max I admire what you had to do in the dark, you're a lovely guy, my advice is get a ring on her finger your obviously in love just go for it, life's too short.' Despite being loved-up, the young actress has been forced to slam critics over their concerns about the age gap between herself and  Max, who is 13 years her senior.Speaking to The Sun on Sunday, Maisie said: 'People don't understand what goes on behind closed doors in a relationship, and I think they also forget that I'm a consenting 21-year-old woman who's actually been working longer than Max!",
        "'I don't notice the age difference and neither do my friends or family. My mum Julia is the one who reads through all the comments. I got a message from her yesterday, saying: 'Just ignore them, you two were made for each other.'"
    ]
}