{
    "articleURL": "/wires/aap/article-12045241/Hardwick-returns-Rebels-look-upset-Brumbies.html",
    "content": [
        "Rugby World Cup hopeful Richard Hardwick will make a timely return for the Melbourne Rebels as they try to topple Australia's leading Super Rugby Pacific team the Brumbies on Sunday.",
        "The Namibian international was one of the Rebels' best in the opening four rounds, leading their try-scoring while also dominating the breakdown.But the backrower has been sidelined since after tearing his calf at training, an injury which threatened his entire season.With the Brumbies fielding their strongest side of the season, including returning Wallabies duo No.8 Pete Samu and outside centre Len Ikitau, for the AAMI Park match the Rebels need all hands on deck.The Rebels sit ninth heading into the round 11 match after downing lowly Moana Pasifika in Auckland last round while the Brumbies are finals-bound in second spot.The ACT side have won five of their last six Super games against Melbourne including their last three straight, however the Rebels have claimed the scalps of the NSW Waratahs and the Queensland Reds this season.As well as No.8 Hardwick, who switched allegiance to his birth country after earning two Australian caps, veteran centre Stacey Ili returns from concussion to slot into the Melbourne starting side.Ili will pair with Reece Hodge at centre, with the Rebels naming an unchanged back three, led by Wallabies utility Andrew Kellaway at fullback.Tom Wright will start at 15 for the Brumbies with both he and Kellaway looking to push their case for Test selection in the vacant jersey, although Kellaway played down the head-to-head battle.",
        "While Kellaway missed the early rounds with a foot injury, Wright has been in red-hot form with his 90 carries the most of any outside back in the competition.\"You've always got one eye on your own goal and one on the team but I don't approach it any differently,\" Kellaway told AAP.\"As two fullbacks we'll probably only meet maybe twice in the game so I don't think there's any real meat to that thought process.\"It's just another battle with a quality footballer so I'm thinking about what I can do, not what he's going to do.\"Rebels: Matt Gibbon, Alex Mafi, Sam Talakai, Angelo Smith, Trevor Hosea, Josh Kemeny, Brad Wilkin (c), Richard Hardwick, Ryan Louwrens, Carter Gordon, Monty Ioane, Stacey Ili, Reece Hodge, Lachie Anderson, Andrew Kellaway. Res: Jordan Uelese, Cabous Eloff, Pone Fa'amausili, Tim Cardall, Vaiolini Ekuasi, James Tuttle, David Feliuai, Joe Pincus."
    ]
}