{
    "articleURL": "/wires/ap/article-12059693/County-official-vows-fight-NYC-mayors-migrant-bus-plan.html",
    "content": [
        "NEW YORK (AP) - The Republican leaders of two suburban counties have declared states of emergency in an effort to block a plan by New York City's Democratic mayor to use their communities to house hundreds of international migrants seeking asylum in the U.S.",
        "\"We are not equipped to humanely assist these individuals,\" said Rockland County Executive Ed Day, who over the weekend declared a state of emergency and has vowed to impose fines to stop the city's plan to put migrants up at hotels in the county for up to four months.In nearby Orange County, County Executive Steven M. Neuhaus ordered all hotels, motels and short term rental facilities not to accept any migrants as he declared a state of emergency Monday.New York City Mayor Eric Adams announced a plan Friday to bus up to 300 single adult male migrants to the two counties north of the city on a voluntary basis.Under the program, the men would be provided with meals, counseling and other services during their city-paid hotel stays. Adams said the program would help the city handle the more than 37,500 asylum seekers in the city´s care.The Democrat announced the plan as cities across the U.S. prepare for an increase in migrants seeking asylum when a pandemic-era policy that permitted the expulsion of many migrants ends. Officials anticipate that the end of the immigration limits under Title 42 of a 1944 public health law will mean more migrants trying to cross the southern border.Adams has for months been criticizing Texas Gov. Greg Abbott, a Republican, for offering free bus rides out of his state to migrants crossing the U.S. southern border. Thousands of those migrants have chosen to go to New York City.",
        "The Adams administration has been using hotels within the city to house some migrants, mainly families with children. Plans to house others at sites including a cruise ship terminal and a beach parking lot in the Bronx have been scrapped.Adams' press secretary, Fabien Levy, said Monday that the city has cared for more than 61,000 migrants \"and we have done so largely without incident.\"Levy said in a statement that the federal government should do more to help the city house migrants, \"but until they do, we need other elected officials around the state and country to do their part and emulate the humane and compassionate approach New York City has taken over the past year.\"Republicans in the suburbs objected to being asked to take in the migrants.Day said the mayor's plan was \"the same as throwing people out to the middle of the ocean who can´t swim and saying `go to shore.´ It can´t work.\"Adams´ news release did not name the hotels where migrants would be sent, but Day and Orangetown Supervisor Teresa Kenny said they had learned that the Armoni Inn and Suites in the hamlet of Orangeburg had been selected.Kenny said housing migrants there for four months would violate the town´s ordinance limiting hotel stays to 30 days.",
        "\"I´m sorry, Mr. Mayor, you don´t trump our laws,\" said Kenny, who joined Day at a news conference in New City, the county seat. \"We have our own town code, so the town is prepared to commence legal action.\"A message seeking comment was left with the Armoni.Day announced a state of emergency Saturday that he said will prohibit other municipalities from bringing people to Rockland County and prohibit hotels and motels from housing immigrants without a license.He said the state of emergency will remain in effect for at least 30 days and will be enforced through fines of $2,000 per migrant per day for the hotels and for any municipality that sends migrants to Rockland.It was unclear what authority Rockland County would have to fine New York City for sending migrants there. A spokesperson for the city´s legal department declined to comment.Orange County's executive, Neuhaus, said he had \"questions about who these immigrants are and remain concerned if they were properly vetted.\" He blamed \"the Federal government´s failed immigration policy and inability to control the border.\""
    ]
}