{
    "articleURL": "/wires/pa/article-12048487/Seasonal-UK-flowers-foliage-bring-gravitas-coronation--florist.html",
    "content": [
        "Seasonal flowers from around the UK will adorn Westminster Abbey for the King’s coronation, with arrangements of home-grown blooms and foliage that will bring “gravitas” to the occasion, the floral designer has said.",
        "Shane Connolly, from west Belfast, said his aim was to make the flowers “incredibly personal” to Charles and the Queen Consort as well as showing that UK-grown flowers can be used at an event of this size.",
        "Mr Connolly, who created the floral arrangements at Charles and Camilla’s wedding in 2005 and the Prince and Princess of Wales’s wedding in 2011, was at the abbey on Thursday morning for the arrival of the flowers and said he will be among six people installing the designs right up until early on Saturday morning.There will be more than 120 varieties of flowers, including lily of the valley and auriculas, which both appeared in Camilla’s wedding bouquet, as well as hellebores which appeared in the King’s buttonhole at his wedding and are a particular favourite of his.Boughs cut from flowering shrubs and trees from the five Royal Horticultural Society gardens will adorn the High Altar, including branches from the pair of Dawyck beech trees planted by the late Queen Elizabeth and Prince Philip at RHS Wisley in 1978.",
        "From the Isle of Skye to the coast of Cornwall, and from the mountains of Snowdonia to Tobermore in Northern Ireland, the flowers have been grown by more than 80 members of Flowers from the Farm on farmland, allotments and cutting gardens across the four nations of the UK.",
        "Flowers from the Farm is a not-for-profit membership association championing more than 960 independent, artisan growers of local, seasonal British-cut flowers. When so many big events people go to are full of flowers that have been flown halfway around the world, this is British, this is grown in the soil of the kingdom  Shane Connolly  Mr Connolly, who has held a Royal Warrant of Appointment to Queen Elizabeth II and the former Prince of Wales, said: “My overall vision is that the flowers are one of the things that can reflect the real characters of the King and Queen in this whole thing, and so they’re simple garden flowers that are British, seasonal, like they might cut themselves from their own gardens.“So I felt that that was really important. Maybe this and the music are the two things that really reflect their personality.“So that was my aim. I also felt that it should come from all four nations, that they should all be represented, including Northern Ireland.”Mr Connolly said he approached Flowers from the Farm and they said they would like to do it “as our gift to the King and Queen”.The floral designer, who champions sustainability in the flower industry, said: “That’s actually what flowers are all about. It isn’t about showing off. It’s about a gift. So these flowers then became a gift to the King and Queen on coronation day.”",
        "He described the work that has gone into the flowers as “very wholesome”, adding: “That was my aim – to make it all incredibly personal to them, and also showing that you can use British-grown seasonal flowers on a scale of this coronation.”While Charles and Camilla have approved all of the flowers, they did not make specific requests.“I think they probably trust me enough now,” Mr Connolly said, adding that they know the flowers are “seasonal and beautiful”.He said the flowers will showcase “the best of what’s happening in Britain” this season.Mr Connolly, who turned 60 this week, said cold weather has resulted in them having crab apples, azaleas and rhododendrons which they may not have had in a hot spring.“So I’m thrilled that it was cold,” he laughed.Asked if he approached the coronation differently to the two royal weddings, Mr Connolly said: “This isn’t a wedding. And I feel that it had to have a bit of gravitas.",
        "“And so the colours are more serious I think. And we very much were inspired by the Cosmati Pavement and the High Altar itself with its wonderful colours.”He said people can expect to see deep reds, sharp reds, earthy colours and fresh green – a colour scheme he described as “almost a kind of stained glass window”.",
        "Speaking about what thoughts he would like people to take away on the day, Mr Connolly said: “That’s a really hard one. I’m doing it for the King and Queen. If guests take away something I would love them to take away ‘Wow. That was all grown in Britain, isn’t that amazing?’“When so many big events people go to are full of flowers that have been flown halfway around the world, this is British, this is grown in the soil of the kingdom.”Mr Connolly said the abbey was so full of people for the Queen’s coronation in 1953 that there was no place for flowers, and instead flowers were on the processional route and in an annexe.“So this is a first actually,” he said.",
        "Royal florist and cookery doyenne Constance Spry worked on flowers for the Queen’s coronation and Mr Connolly said she had flowers from the Commonwealth.“And I thought this should be from the nation, the four nations of the kingdom,” he said.Among the seasonal foliage on the High Altar there will be beech cut from an ancient cluster of trees at RHS Bridgewater, which would have been visited by Queen Victoria.Speaking about the personal elements incorporated into the designs, Mr Connolly said: “It’s all about those personal things. It’s not about showing off. It’s absolutely not about showing off.",
        "“None of this is price. It’s all about the emotion and the sentiment.“So I think it’s very special, personally.”Following the coronation, all the flowers and branches will be donated to Floral Angels, a charity run by volunteers that repurposes flowers from events into bouquets and arrangements to share with care homes, hospices, shelters and other vulnerable members of the community."
    ]
}