{
    "articleURL": "/wires/pa/article-12057087/King-complained-time-keeping-boring-wait-outside-Abbey--lip-reader.html",
    "content": [
        "The King grumbled “we can never be on time” and “there’s always something” following a hiccup at the start of his coronation, a lip reader has claimed.",
        "Charles and Camilla arrived at Westminster Abbey early, while the Prince and Princess of Wales – accompanied by Princess Charlotte and Prince Louis, were late, missing their scheduled arrival time.It meant the King and Queen were forced to wait outside, sat in their Diamond Jubilee State Coach, for some time for William and Kate to get there before Charles and Camilla could make their grand entrance.",
        "A lip reader for Sky News said the King complained that it was a “negative”, allegedly remarking: “This is boring.”“We can never be on time. Yes I’m…This is a negative. There’s always something…This is boring,” Sky News reported that the frustrated-looking monarch said.William and Kate had been unable to overtake to get ahead of the King.In the end, the prince and princess, eight-year-old Charlotte and Louis, five, were forced to join the King’s procession through the Abbey, instead of entering before him and waiting in their seats for Charles and Camilla’s arrival.",
        "The Bishop of Chelmsford, Dr Guli Francis-Dehqani, said on Saturday, speaking outside St Margaret’s Church next to the Abbey, that there were “one or two” hiccups.“There were one or two things that didn’t go strictly to plan,” he said, before adding: “I’m not going to embarrass anyone in particular.”",
        "In the early days of his reign, the King blasted a pen after it appeared to leak while he signed a book at Hillsborough Castle, telling aides “I can’t bear this bloody thing”.",
        "The King could be heard in a video clip asking the date, before standing up in frustration.The Queen, who was given the pen, said “it’s going everywhere”, before the pair wiped their hands.The King was then heard saying: “I can’t bear this bloody thing… every stinking time.”It came after another pen-related incident at his Accession Council.",
        "While signing historic documents, he gestured for an ornate pen holder to be taken away by an aide.Later it was back in place, after privy councillors used its pens to sign documents, but Charles once again took offence to the item, when called upon to give his signature, and pulled a face before it was removed again.William and Kate were due to arrive at 10.45am, while Charles and Camilla’s arrival had been set for 10.53am in the carefully organised schedule, planned months in advance."
    ]
}