{
    "articleURL": "/wires/reuters/article-12043359/LATAM-POLITICS-TODAY-Bolsonaro-home-raided-phone-seized-Brazil-vaccine-records-probe.html",
    "content": [
        "US Homeland Security to visit border ahead of Title 42 lifting",
        "Spanish far right dub Colombia's Petro \"unrepentant terrorist\"May 3 (Reuters) -The latest in Latin American politics on Wednesday:Bolsonaro home raided, phone seized in Brazil vaccine records probeBRASILIA - Brazilian police raided former President Jair Bolsonaro's home and seized his cell phone as part of an investigation into his COVID-19 vaccination records.The investigation may answer questions about how Bolsonaro, a strident coronavirus skeptic who vowed never to get a COVID vaccine, was registered as vaccinated in health records made public in February.Bolsonaro confirmed the raid on his home in Brasilia to journalists and reiterated that he had never taken a COVID vaccine. He denied any role in allegedly forging documents.US Homeland Security secretary to visit border ahead of Title 42 liftingWASHINGTON - U.S. Homeland Security Secretary Alejandro Mayorkas will travel to the Texas border with Mexico this week ahead of the lifting of Title 42, the department said in a statement.The trip comes as the COVID-19 health policy known as Title 42 is set to end on May 11 and the U.S. prepares for a possible subsequent spike in illegal border crossings.Spain's far right leader calls Colombia's President \"unrepentant terrorist\" during state visitThe leader of the Spanish ultra-right-wing Vox party has criticized Colombia's leftist President Gustavo Petro in his first state visit to Spain, calling him \"an unrepentant terrorist\", according to Colombian press Caracol.",
        "None of Vox's representatives, including leader Santiago Abascal, attended Petro's speech at Spain's congress to mark the start of the visit by the South American leader.Abascal compared Petro, a former member of the M-19 guerrilla movement, to Arnaldo Otegi, a Basque politician who was part of the former separatist group ETA. (Compiled by Steven Grattan; Editing by Kirsten Donovan)"
    ]
}