{
    "articleURL": "/sport/nba/article-12060119/Nikola-Jokic-NOT-suspended-shoving-Mat-Ishbia-Phoenix-Suns-owner-tweets.html",
    "content": [
        "Denver's center could be banned for Game 5 after appearing to shove IshbiaBut Ishbia defended Jokic on social media, saying that any ban would be wrong DailyMail.com provides all the latest international sports news Count Phoenix Suns owner Mat Ishbia among those who do not wish to see Denver Nuggets star Nikola Jokic suspended or fined over their on-court altercation in Game 4 of their ongoing playoff series.",
        "Jokic was whistled for a technical foul in the second quarter on Sunday when the big man tried to snatch the ball back from Ishbia, who was sitting courtside, and hit the new Suns owner with an elbow.Ishbia, a 5-foot-10 former Michigan State walk-on, flailed back down into his seat after being nudged by the 6-foot-11 Serbian center. As a result, Jokic was whistled for a technical, and the Suns were granted a free throw.The incident sparked debates after the Suns beat the Nuggets, 129-124, to even the second-round series at 2-2. Specifically, fans argued whether Ishbia flopped or if Jokic's contact was excessive.But on Monday, Ishbia wrote on Twitter that he hopes the NBA opts against banning the two-time MVP: 'Great win for the Suns last night in an amazing series so far! That should be and is the only story. Suspending or fining anyone over last nights (sic) incident would not be right. I have alot (sic) of respect for Jokic and don't want to see anything like that. Excited for game 5! Go Suns!'",
        "Ishbia's tweet did not address flopping allegations, which were circulated social media after the incident.'Great flop by Mat Ishbia to draw the foul,' The Ringer's Kevin O'Connor tweeted.'Perhaps Ishbia should be suspended for his silly game of keep away and fined for the flop,' tweeted USA Today's Jeff Zilligitt, who went on to reference the Suns owner's college basketball career. 'That's not how [Michigan State head coach Tom] Izzo coaches defense.'",
        "Meanwhile, some fans felt it was Jokic who was out of line.'I'm done w this league if they don't suspend Jokic,' tweeted one fan.'Players shouldn't be shoving fans,' another fan tweeted. 'A fan holding the ball isn't enough of a reason to justify what Jokic did.'If this was the regular season, I'd say suspend him. Playoffs though, fine him.'",
        "Neither Jokic nor Nuggets coach Mike Malone felt that he deserved any punishment over the incident.'I think it's crazy that Nikola [Jokic] got a technical foul,' Malone told reporters. 'He's going to get the ball and some fan is holding onto the ball like he wants to be a part of the game.'Jokic was unapologetic after the game.'The fan put the hand on me first,' Jokic said. 'I thought the league was supposed to protect us. Maybe I am wrong. I know who he is, but he is a fan. Isn't he?"
    ]
}