{
    "articleURL": "/sport/football/article-12050415/Manchester-United-decide-NOT-sign-Wout-Weghorst-permanent-deal-Ten-Hag-targets-strikers.html",
    "content": [
        "Weghorst will not be staying at Old Trafford beyond the end of current seasonThe forward joined United on loan from Burnley for £2.5million back in JanuaryHe has since managed just two goals in 26 appearances across all competitions  Manchester United have reportedly decided not to sign Wout Weghorst on a permanent deal this summer, with Erik ten Hag instead drawing up a four-man shortlist for an alternative striker.",
        "The Burnley forward joined United on loan in January but has since managed just two goals in 26 appearances. He arrived after a positive spell during the first half of the campaign on loan at Besiktas, where he scored nine goals in 18 games.Weghorst also impressed for the Netherlands at the Qatar World Cup, but he has failed to make an impact Old Trafford despite playing regularly and endearing himself to supporters with his work rate. The 6ft 6in target man started the first 19 games he was available for in all competitions, only to slip down the pecking order with substitute appearances.",
        "The 30-year-old is yet to find the net in 13 Premier League matches, which has led to criticism that he is not good enough for a club of such size. As a result, Manchester Evening News are reporting that a permanent move to United is not on the cards for him this summer.Weghorst still has two years remaining on his Burnley contract having joined the Clarets for £12.5million from Wolfsburg in January 2022. A new striker is the priority for United this summer with Tottenham's Harry Kane their top target.Napoli hitman Victor Osimhen is another player admired by Ten Hag while Eintracht Frankfurt striker Randal Kolo Muani and Atalanta goalscorer Rasmus Hojlund are also being looked at.",
        "United already have a wealth of attacking options but only Marcus Rashford has delivered consistently this season, while they are lacking an out-and-out centre-forward.Their lack of a focal point through the middle has been glaringly obvious at times.Ten Hag's men have found the net just 49 times in the top flight so far this season. No other side in the top seven has scored less than 60.United were made to pay for their wastefulness in front of goal on Thursday night, when they were beaten in the dying seconds of stoppage time away at Brighton.",
        "After spurning a number of opportunities at the Amex, the visitors were ultimately punished when Luke Shaw's handball inside the box allowed Alexis Mac Allister to sweep home a 99th-minute winner from the penalty spot.It means they still have work to do in their quest to seal Champions League qualification, with bitter rivals Liverpool four points behind them in fifth place.However, United do have the luxury of a game-in-hand still to play, which comes at home to struggling Chelsea on Thursday May 25.Though just three days before the Premier League's conclusion on May 28, they will already hope to have a place in the top four secured by then."
    ]
}