{
    "articleURL": "/wires/ap/article-12049497/Massachusetts-blast-site-1-died-moves-cleanup-phase.html",
    "content": [
        "NEWBURYPORT, Mass. (AP) - Authorities in Massachusetts on Friday identified the worker who died after a powerful explosion tore through a pharmaceutical chemical plant with a history of safety violations.",
        "Fire crews in Newburyport were still cleaning up the site, a day after what they described as seven-alarm hazardous materials event that tore the roof off the building and sprayed debris as far as 800 feet (244 meters) away from the facility. Four workers were sent to a hospital, but were uninjured and released.The person who died was identified as Jack O´Keefe, 62, of Methuen, according to a spokesperson for the Essex County District Attorney´s office. An autopsy is planned.About four dozen large barrels containing chemicals including acetone, methanol and isopropyl alcohol were removed from the building Friday, and a crane was brought in to shore up a metal support beam as crews worked, according to a statement by Newburyport Acting Fire Chief Stephen Bradbury III.\"Today´s goal is to remove hazardous materials and start to remove structural material so that the facility can be turned over to private contractors,\" said Bradbury, who becomes permanent chief on June 1.The cause remained unclear, Deputy Fire Chief Barry Salt told reporters Friday.",
        "\"All we know is that it was a part of a chemical process that they do continually every day, and they are looking into the cause,\" Salt said.The Occupational Safety and Health Administration announced Friday that it had started an inspection into the company. The inspection is aimed at determining if the employer has complied with OSHA workplace safety and health standards. It could take up to six months.",
        "The explosion happened around 1 a.m. Thursday at the Seqens/PCI Synthesis plant, officials said. Video showed most of the roof torn off a building, marking at least the third safety problem at the plant since 2020.Smoke from the fire blew into a largely unpopulated area, according to the state Department of Environmental Protection, and air quality monitoring near the site has so far detected no hazards. Area waterways are also being monitored.\"There is no risk to the environment currently or to the community itself,\" Salt said.The plant lies a little more than 30 miles (50 kilometers) north of Boston and has had a string of problems over the years - prompting U.S. Sens. Edward Markey and Elizabeth Warren of Massachusetts and U.S. Rep. Seth Moulton - in whose district the facility is located - to write a letter to the company late Thursday demanding a full accounting of what happened.\"This explosion is only the latest avoidable disaster at this facility, following years of serious safety violations, multiple fines, and other explosions,\" the lawmakers said in the letter. \"We write seeking the explanation as to why this latest incident occurred and how, after years of fines and regulatory enforcement actions, Seqens could have allowed unsafe conditions to persist.\"",
        "Thursday's explosion makes it \"painfully apparent that your company has failed to create any meaningful or effective safety culture,\" the letter said.An email seeking a response to the lawmakers' letter was sent to a company spokesperson.A chemical fire in the building in June 2021 sent smoke pouring out of roof vents and prompted a hazardous materials team to respond, according to a fire department statement at the time.In 2020, authorities said a chemical reaction caused a series of explosions at the plant. That happened a year after the Occupational Safety and Health Administration found \"serious\" violations in how the company managed highly hazardous chemicals, according to online agency records.The factory has also been cited by OSHA for workplace safety violations and in 2019 paid a penalty of more than $50,000 to settle Environmental Protection Agency charges that it violated hazardous waste laws.___This story corrects spelling of Seqens in paragraph 7.___This story corrects the spelling of Sen. Edward Markey's last name."
    ]
}