{
    "articleURL": "/wires/afp/article-12045867/Japan-PM-heads-Seoul-ties-warm-North-Korea-threat.html",
    "content": [
        "Japanese Prime Minister Fumio Kishida will visit Seoul this weekend as the two countries seek to bury historical animosities and reboot their relationship in the face of a growing threat from North Korea.",
        "The two-day trip starting Sunday will be the first official bilateral visit to Seoul by a Japanese leader for over a decade.Kishida will meet with President Yoon Suk Yeol -- who has made resetting ties with Japan a top priority -- just weeks after the South Korean leader visited Tokyo in March.Yoon has also just returned from a state visit to Washington, where he met President Joe Biden and signed an accord aimed at boosting the nuclear protection afforded to South Korea by the United States.Relations between Seoul and Tokyo -- both key regional US security allies -- have long been strained over Japan's brutal 1910-45 colonial occupation of the Korean peninsula, including the imposition of forced labour and sexual slavery.But Yoon, who took office last year, has sought to bury the historical hatchet, earlier announcing a plan to compensate Korean victims of Japanese forced labour despite the absence of any direct involvement from Tokyo.His endgame is improving regional security to counter perceived threats from North Korea, experts say.\"The Korea-Japan relationship is known as the weakest link in the trilateral cooperation with the United States,\" said Choi Eunmi, a researcher at the Asan Institute for Policy Studies in Seoul.\"So when this part is strengthened, it can eventually advance into proper South Korea-US-Japan cooperation.\"",
        "- 'War plot' -Efforts to boost military cooperation come as North Korea's leader Kim Jong Un, who last year declared his country an \"irreversible\" nuclear power, doubles down on weapons development and testing.Pyongyang has conducted a record-breaking string of launches in 2023, including test-firing the country's first solid-fuel ballistic missile -- a technical breakthrough.The United States and South Korea have in turn been ramping up their defence cooperation, staging a series of major military exercises including two trilateral drills involving Japan this year.But they are eager to do more. At their summit last month, Biden and Yoon issued the Washington Declaration, which bolsters the US nuclear umbrella over South Korea, and they vowed to speed up trilateral cooperation with Japan.North Korea views all such cooperation as \"absolutely identical with a dangerous war plot\", according to a commentary carried by the country's official KCNA news agency.- Beyond the 'turbulence' -The Japanese prime minister said this week that his trip to Seoul would \"give momentum to 'shuttle diplomacy'\" between the neighbours.During their March summit in Tokyo, Kishida and Yoon agreed to end tit-for-tat trade curbs and restart mutual visits, with Kishida also inviting the South Korean president to a G7 meet in Hiroshima this month.",
        "\"The exchange of summits, first in Japan and now in Korea, is meant to signify the turbulence of the recent past is behind South Korea and Japan,\" Benjamin A. Engel, research professor at the Institute of International Affairs at Seoul National University, told AFP.In 2018, often-testy ties between the two countries deteriorated further after South Korea's Supreme Court ordered Japanese firms to compensate the wartime victims of forced labour.But in March this year Seoul announced a plan to pay those affected without Tokyo's direct involvement -- a move that enraged much of the South Korean public.A Gallup Korea poll published in the same month showed nearly 60 percent of respondents were opposed to the government's proposal.As long as general sentiment in South Korea stays sour towards Japan, the current diplomatic bonhomie risks being \"short-lived\", said Engel.\"If the US does have a positive role to play, it should be to lean on Tokyo to show more remorse towards Korea,\" he added.Should Kishida's trip go well -- with Japanese media suggesting he will reaffirm Tokyo's previous apologies over wartime conduct -- it could herald the start of a new level of engagement.\"The success of the visit will be measured by how there will be regular meetings and engagement between the two countries at the leadership level,\" Shihoko Goto, deputy director of the Asia Program at the Wilson Center in Washington, told AFP.",
        "\"The challenge will be whether public opinion in both countries will support such overtures.\""
    ]
}