{
    "articleURL": "/wires/reuters/article-12060789/Union-sues-strike-US-debt-limit-default-looms.html",
    "content": [
        "By Daniel Wiessner",
        "May 8 (Reuters) - A union for U.S. federal government employees filed a lawsuit on Monday claiming a law setting a $31.4 trillion debt ceiling is unconstitutional as political leaders seek to avoid a historic default expected as soon as next month.The National Association of Government Employees (NAGE) says the debt limit law adopted in 1917 violates the U.S. Constitution's separation of powers because it forces the president in the event of a default to cut spending already authorized by Congress.The lawsuit filed in Boston federal court says the Constitution's 14th Amendment requires the president to find funding to meet the country's debt obligations. The union in the complaint said it will seek an order temporarily blocking the debt limit law while the case proceeds.The White House has examined the possibility of using the 14th Amendment to avert a debt-ceiling crisis, but Democratic President Joe Biden on Friday said he was not yet ready to try the untested legal strategy. The relevant clause has been largely unaddressed by the courts, and legal experts disagree about what it requires from Congress and the presidency.The union said in the lawsuit that Congress cannot impose a debt limit \"without at least setting the order and priority of payments once that limit is reached, instead of leaving it to the president to do so.\"",
        "The union is seeking to strike down the law setting a debt limit and to block the Biden administration from limiting borrowing in the event of a default so it can continue funding government agencies.The lawsuit names Biden and Treasury Secretary Janet Yellen as defendants. A spokesman for the Treasury Department declined to comment. The White House did not immediately respond to a request for comment.The U.S. reached its debt limit in January, and Yellen at the time told Congress that she would suspend investments in federal government workers' retirement and health benefit funds to avoid an immediate default. Yellen has warned that the U.S. could run out of cash to meet its obligations as early as June 1.The union, which represents 75,000 government workers, said in Monday's lawsuit that its members have already been harmed by Yellen's extraordinary move. A default would further harm government workers by triggering furloughs and layoffs, the union said.Republicans in Congress have called for any increase in the debt ceiling to be tied to massive spending cuts. But Biden and other Democrats have insisted that raising the debt limit should not be linked to budget talks.Biden and congressional leaders from both parties are due to meet on Tuesday, but an immediate deal to avert a default is not expected. (Reporting by Daniel Wiessner in Albany, New York, Editing by Alexia Garamfalvi and Cynthia Osterman)"
    ]
}