{
    "articleURL": "/sport/football/article-12056401/Ryan-Mason-praised-Tottenham-players-kept-clean-sheet-February.html",
    "content": [
        "Ryan Mason has lauded his Tottenham team for their work keeping a clean sheet They beat Crystal Palace 1-0 to claim their first clean sheet since February 26The manager lauded the sides response after losses to Liverpool and NewcastleRyan Mason paid tribute to the collective after Tottenham claimed a first clean sheet in the Premier League since February.",
        "Harry Kane's first-half header, his 28th goal of the season, earned Spurs a 1-0 win over Crystal Palace on Saturday that kept them in the hunt for a top-six finish.Kane moved ahead of Wayne Rooney into second on the all-time Premier League goal-scorer list with his 209th top-flight strike but it was the other end of the pitch where Tottenham's improvement was noticeable.After conceding six at Newcastle and four at Liverpool during the last two weekends, Mason used his full week on the training pitch to tweak the 3-4-3 system used for the best part of 18 months since Antonio Conte took over.Spurs went with a back four out of possession and it worked to good effect after Palace were limited to minimal chances with the hosts able to register a first league clean sheet since their 2-0 win against Chelsea on February 26. ",
        "\"When you keep a clean sheet, it's a collective. It's everyone and everyone fought for the clean sheet,\" Mason said.\"The players on the pitch but also the ones who didn't because in the training week we've all worked hard together and they're the results you want.\"We understand the importance of the win and the clean sheet as well is a great response from the players because maybe mentally when you concede so many goals in a short space of time, it can have an impact but the players have worked hard.",
        "\"The whole squad has worked hard on the training pitch. We've had a bit of time together to try and influence things and they responded. I thought it was a cagey game but overall we deserved the three points.\"Spurs have spent the whole of this season using a 3-4-3 system but Cristian Stellini, who stepped up from assistant to replace Conte, went with a back four at Newcastle last month.It ended up having disastrous consequences with Tottenham 5-0 down inside 21 minutes and Stellini ultimately losing his job as acting head coach as a result.Mason hinted upon taking charge it would be hard for him to make changes for the Manchester United and Liverpool fixtures, but after a week on the training ground reverted to a back four, which he used in his previous caretaker spell in 2021.He added: \"We added a sixth man into the press and tried to be a bit more aggressive.\"I have to compliment the players because when you've been working in a certain way for so long, to make that change at this stage of the season it's very positive for me.\"",
        "Roy Hodgson, who watched Crystal Palace lose for only a second time since his return, acknowledged the respect Spurs had given the visitors with their formation.",
        "\"I saw us on the ball for large periods of the game and I saw us attempting to get into the right areas,\" he said.\"We didn't have the success we had last week (against West Ham) or the weeks before, but that's a credit to Tottenham deciding to defend as they did against us.\"It's never easy to find that bit of space when there are a lot of players in and around the box.\""
    ]
}