{
    "articleURL": "/news/article-12047165/Married-City-lawyer-accused-sexual-misconduct-says-female-legal-apprentice-18-pursued-him.html",
    "content": [
        "Oliver Bretherton denies sexually motivated misconduct towards three womanA teenage legal apprentice pursued a married City lawyer and told him she wanted to have sex in the office over a desk, a tribunal heard today.",
        "Oliver Bretherton, 41, has been accused of sexual misconduct by three junior female colleagues in their evidence to the Solicitors Disciplinary Tribunal in central London.The 18-year-old accuses Bretherton of 'controlling' her during their 'fantasy sexual relationship', bombarding her with instructions to perform sex acts and send him explicit pictures and videos.But his barrister Chloe Carpenter KC today told the hearing that it was the A-level student who had just left school who was the one 'calling the shots'.In her summing up, she said that the teen, known as Person A, initially pursued Bretherton - then 36 and a director of international law firm Gowling WLG - in October 2017 for a 'fantasy sexual relationship'.",
        "She said: 'Person A told Mr Bretherton about the previous sexual experiences of her friends at university.'She discussed with Mr Bretherton her own previous sexual experiences, including a threesome and sex with a friend's father.'Person A must have volunteered this information to Mr Bretherton because she wanted to.'She said that Bretherton 'felt flattered' by her attentions and became a 'willing participant' in the exchange of fantasies that she often instigated.The 'sexually precocious' apprentice allegedly told him her office fantasy was for him to 'f*** her in front of a window or over a desk'.",
        "Ms Carpenter told how Person A sent Bretherton pictures of herself topless and in her underwear with saucy messages such as 'I want your tongue to play here'.And she allegedly sent him a message saying 'she had performed a sex act on a man in a graveyard and fantasised it was him'.She said that Person A tried to turn their fantasies into a real physical sexual relationship by encouraging him to see her outside the office and begging him to join her for sex in a hotel room.But the tribunal heard that their only actual physical intimacy was a drunken kiss at a work event in December 2017 that Bretherton swiftly regretted as 'crossing a boundary'.He denies putting his hand up her skirt while they were standing at the bar at the same work leaving drinks.",
        "Ms Carpenter said: 'Person A attempted to turn the relationship into a physical sexual relationship but Mr Bretherton refused to do so.'Person A told Mr Bretherton that she enjoyed the relationship throughout.'Bretherton admits encouraging the teenager to spread her legs and show him her knickers in the office.But Ms Carpenter insisted: 'Mr Bretherton is not and was not a risk-taking thrill seeker. All that happened was that person A opened her legs so that Mr Bretherton could see.'",
        "She said that no one else could observe them at the time and that Bretherton denies her claim that he threw ping pong balls down the front of her dress in his glass-walled office.He also denies buying her a sex toy to use at work and says it was her suggestion that she masturbate in the office toilets.He says that he only sent her leaked naked pictures of 2018 Love Island contestant Megan Barton-Hanson because the teenager had met her in a nightclub and wanted to see them.Ms Carpenter said that Person A later told her girlfriend that she had 'loved flirting' with Bretherton during their relationship. She said that Person A had 'no regrets' and the pair stayed friends, with Bretherton continuing to support her at work well after their relationship ended in October 2018.It was not until September 2019 that Person A began to show 'extreme animosity' towards him for unknown reasons, Ms Carpenter said.She then alleged that he had been 'controlling' and used to order her to wear short skirts to work and bombard her with X-rated demands.Giving evidence, she said that 'scary and unnerving' Bretherton told her he wanted to 'f***' her all over the office and over a pool table.",
        "She claimed that he instructed her to sleep with a man she was meeting for a date and send pictures of them having sex.Bretherton would allegedly demand to know where she was and who she was with, time her toilet breaks and order her to fetch the ping pong balls when he missed his target.",
        "But Ms Carpenter claimed that Person A was 'not a credible witness' whose evidence had been tainted by years of therapy that had distorted her memories of the relationship.She insisted: 'Mr Bretherton was not controlling. If anyone was calling the shots she was'.The tribunal heard that in one message Person A wrote: 'I am sure he is going to say I wanted it, which I guess to an extent I did. It is only with hindsight I have realised that was not a genuine feeling'.In another, she said: 'I hate him. I hope his wife leaves him. Once his name is in the Press, he is ruined'.Ms Carpenter said that despite the 'power imbalance' between the pair at work, Bretherton had not acted without professional integrity because they had a 'private consensual relationship mainly conducted outside the office'.She said that an analysis by the firm of 950 emails between the pair had not found any evidence of controlling behaviour by him.",
        "She alleged that the Solicitors Regulation Authority's investigation into Person A's allegations was 'flawed' and that it 'inappropriately' allowed her counsellor to attend her SRA interview.Person B, then a 23-year-old trainee, alleges that Bretherton behaved 'like a jealous boyfriend or ex-boyfriend' as he messaged her obsessively.She says that Bretherton, who had introduced his wife and newborn baby to her, hailed her as 'hot' and said she was 'competing to be my favourite blonde'.Person C, then a 21-year-old apprentice, alleges that Bretherton reduced her to tears on a night out after a work party by dropping ice cubes down the back of her dress and commenting on her cleavage.She claims that she felt 'sexualised', saying: 'My cleavage is mine and not for him to comment on.'Ms Carpenter said that Bretherton has shown 'sincere remorse' and apologised repeatedly for the impact of any of his behaviour on the three women.She said that he had been frank to admit kissing Person A and sending her a video of himself performing a solo sex act.But she said that the impact on him and his family of a string of other unfounded allegations had been 'enormous'.Bretherton, who is now a banking and finance partner with 'virtual' law firm Gunnercooke, denies sexually motivated misconduct towards the three woman and acting without integrity professionally.",
        "The tribunal continues."
    ]
}