{
    "articleURL": "/wires/reuters/article-12048275/U-S-officials-assessing-possible-manipulation-banking-shares--source.html",
    "content": [
        "By Chris Prentice and Trevor Hunnicutt",
        "NEW YORK, May 4 (Reuters) - U.S. federal and state officials are assessing the possibility of \"market manipulation\" behind big moves in banking share prices in recent days, a source familiar with the matter said on Thursday, as the White House vowed to monitor \"short-selling pressures on healthy banks.\"Shares of regional banks resumed their slide this week after the collapse of First Republic Bank, the third U.S. mid-sized lender to fail in two months. Short sellers raked in $378.9 million in paper profits on Thursday alone from betting against certain regional banks, according to analytics firm Ortex.Increased short-selling activity and volatility in shares have drawn increasing scrutiny by federal and state officials and regulators in recent days, given strong fundamentals in the sector and sufficient capital levels, said the source, who was not authorized to speak publicly.\"State and federal regulators and officials are increasingly attentive to the possibility of market manipulation regarding banking equities,\" the source said.White House press secretary Karine Jean-Pierre said the Biden administration was closely watching on the situation.\"The administration is going to closely monitor the market developments, including the short-selling pressures on healthy banks. I would have to refer you to the SEC on any possible actions,\" Jean-Pierre told a White House briefing.",
        "U.S. Securities and Exchange Commission Chair Gary Gensler on Thursday said the agency would go after any form of misconduct that might threaten investors or markets.\"As I´ve said, in times of increased volatility and uncertainty, the SEC is particularly focused on identifying and prosecuting any form of misconduct that might threaten investors, capital formation, or the markets more broadly,\" he said in a written statement.Consumer Bankers Association President and CEO Lindsey Johnson stressed the banking industry remained strong and urged policymakers to call out \"unethical behavior by activist investors\" who were taking advantage of market volatility.\"This volatility is being fueled by emotion and misinformation that does not reflect the strong underlying fundamentals of our banks,\" Johnson said in a statement.\"These institutions remain resilient and well-capitalized, and Americans can rest assured their deposits are safe.\"The S&amp;amp;P 600 bank index dropped over 3% on Thursday. PacWest Bancorp shares tumbled over 50% after it confirmed it was exploring strategic options.Western Alliance Bancorp denied a report from the Financial Times that said it was exploring a potential sale, and said it was exploring legal options. Its shares plummeted more than 38%, with trading in the stock halted multiple times.Share price swings did not reflect the fact that many regional banks outperformed on first quarter earnings and had sound fundamentals, including stable deposits, sufficient capital, and decreased uninsured deposits, the source said.",
        "\"This week we have seen that regional banks remain well- capitalized,\" the source said.Short selling, in which investors sell borrowed securities and aim to buy these back at a lower price to pocket the difference, is not illegal and considered part of a healthy market. But manipulating stock prices, which the SEC has defined as the 'intentional or willful conduct designed to deceive or defraud investors by controlling or artificially affecting\" stock prices, is.The increased short-selling activity has triggered some calls for a temporary ban, but an SEC official told Reuters on Wednesday the agency was \"not currently contemplating\" such a move.The SEC first warned investors in March, during a previous period of high market volatility surrounding the collapse of Silicon Valley Bank and Signature Bank, that it was carefully monitoring market stability and would prosecute any form of misconduct. (Reporting by Chris Prentice in New York and Trevor Hunnicutt in Washington; additional reporting by Andrea Shalal in Washington; Edited by Kieran Murray, Chizu Nomiyama and Deepa Babington)"
    ]
}