{
    "articleURL": "/sport/football/article-12055471/Jamie-Carragher-claims-Mohamed-Salah-star-XI-Liverpool.html",
    "content": [
        "Mohamed Salah scored his 100th Anfield goal in Liverpool's win over BrentfordJamie Carragher believes the Egyptian will go down as one of the club's greatest Micah Richards says Salah was destined for greatness from time at Fiorentina   Jamie Carragher has claimed Mohamed Salah would get into Liverpool's all-time XI after he scored his 100th goal at Anfield against Brentford. ",
        "Jurgen Klopp's side maintained their slim hopes of securing Champions League football next season with a 1-0 win over the Bees thanks to Salah's close-range finish. It was the Egypt international's 30th across all competitions this season and more significantly, he secured a century of home goals for the Reds. Carragher says Liverpool are 'very lucky' to have Salah and he will go down as the one of the club's greatest players once he departs.  Speaking on Sky Sports, the former defender said: 'This club are very lucky to have some great goal scorers in the past. ",
        "'I think when Salah stops playing for the club he will go in there as one of the top. He will go into an all-star XI for Liverpool. I don’t see it ever stopping until he stops. 'He’s not an out and out striker but I wouldn’t call him a winger either. I would call him a wide striker. He’s been an absolute revelation. 'We always talk about Virgil but it’s about Salah too. Those signings have changed the trajectory of the club. You could argue that Salah was the best signing as he was a steal.'Carragher also praised Salah for not dropping his levels in during a difficult campaign for the Reds. ",
        "'He’s been Liverpool’s best outfield player. Salah’s level hasn’t dropped. He’s been the same season after season not matter how well the team are doing. The result tonight give Liverpool a glimmer of hope,' Carragher added. Meanwhile, Micah Richards, who was a team-mate of Salah at Fiorentina during the 2014-15 campaign, says the 30-year-old was destined for greatness.  'He was so focused. When he first came to training I knew he would be a super star. The way he used to press and the way he would look after himself,' Richards said. ",
        "'When he would get in front of goal he would finish it off. He was always going to score the goals. I just couldn’t believe we had a player of such talent there. I couldn’t believe none of the big clubs had taken him. 'Liverpool haven’t played their best this season but his level hasn’t dropped.'Since joining from Roma in 2017, Salah has scored 186 goals for Liverpool in 302 appearances while also providing 74 assists. The win over Brentford has put Klopp's side a point behind fourth-placed Manchester United having played two games more. "
    ]
}