{
    "articleURL": "/tvshowbiz/article-12060359/Vanessa-Hudgens-gushes-fianc-Cole-Tucker-Drew-Barrymore-admits-shes-dating-app.html",
    "content": [
        "Former child stars Drew Barrymore and Vanessa Hudgens discussed their opposite love lives during Monday's episode of The Drew Barrymore Show, which was taped before the WGA strike began last Tuesday.",
        "In her usual show of gratuitous affection, the 48-year-old producer-host dropped to her knees to congratulate the half-Filipina 34-year-old on her February 9 engagement to Colorado Rockies shortstop/outfielder Cole Tucker.'He so gets me,' Vanessa gushed, flashing her reported $250K diamond sparkler.Hudgens said she's been 'trying' to plan her wedding, but 'it's hard. I don't know, finding a venue is tough. I kind of just want to elope. I really, I'm lost.'When Drew asked if the 26-year-old baseball player has 'any opinions' on their nuptials, the Dead Hot: Season of the Witch star replied: 'I mean, he just wants to get married to me. He's like, \"Whatever you want babe!\"'",
        "Vanessa - who ended her eight-year relationship with Elvis star Austin Butler in 2019 - began dating Cole in 2020 after they met via Zoom while virtually attending two-time Grammy nominee Joe Jonas' meditation group.Hudgens then turned the tables on Barrymore, asking if she had been sliding into anyone's DMs or dating at all.'So I haven't been sliding into DMs but I did get back on my dating app,' the seven-time Emmy nominee admitted.'And I went on some dates here and there, which felt like a big effort and fun, you know, to follow through. Not that the time spent was an effort, but just to, you know, engage out there in the world not stay home. [I] don't think anything's clicking.'",
        "'You can't rush it,' the Caliwater co-founder reassured.On a prior episode, Drew showed off the profile picture she uses on the private, membership-based Raya.Other celebs who've used Raya include John Mayer, Olivia Rodrigo, Lil Nas X, Kiernan Shipka, Chelsea Handler, Demi Lovato, Channing Tatum, Joe Jonas, Niall Horan, Amy Schumer, Lizzo, Andy Cohen, Eric Stonestreet, Lena Dunham, Simone Biles, and Chet Hanks.Barrymore has been single for seven years (the first four were on purpose) following the 2016 end of her four-year marriage to art consultant Will Kopelman, with whom she has two daughters - Olive, 10; and Frankie, 9.",
        "The former Hollywood wildchild previously divorced Canadian comedian Tom Green in 2002 after 15 months of marriage, and she divorced British bar owner Jeremy Thomas in 1995 after just two months.Monday marked Vanessa's third time appearing on Drew's syndicated CBS daytime talk show, now in its third season.Hudgens will next appear in Lily Rabe and Hamish Linklater's 1984 North Dakota-set drama Downtown Owl, which premieres at the Tribeca Film Festival at the SVA Theatre in Manhattan on June 8.There are two additional screenings of the film - based on Chuck Klosterman's 2008 novel - on June 9 and June 16 at Village East by Angelika in Manhattan.",
        "Lily Rabe, Ed Harris, Finn Wittrock, Henry Golding, August Blanco Rosenstein, and Jack Dylan Grazer also star in Downtown Owl.The High School Musical alum will also star in Adil El Arbi and Bilall Fallah's action flick Bad Boys 4, James A. Woods and Nicolas Wright's comedy French Girl, Martha Stephens' trucker drama Big Rig, and Zack Snyder's animated prequel Army of the Dead: Lost Vegas."
    ]
}