{
    "articleURL": "/tvshowbiz/article-12050323/Maya-Jama-strips-black-bikini-sub-zero-beauty-treatment.html",
    "content": [
        "She's preparing to host the summer season of Love Island after her successful presenting debut earlier this year.",
        "And Maya Jama stripped down to a black bikini as she made the most of her time off, enjoying a sunbathing session and a new beauty treatment, ahead of the impending Mallorca series in June.The TV personality, 28, shared a makeup free selfie to her Instagram Story on Friday as she basked in the heat by the pool. During her earlier treatment, Maya teased fans and said she was 'freezing her t**s off' while dancing in the Cryotherapy pod. She exposed her toned body to sub-zero temperatures of up to -140°C in order to stimulate multiple wellness benefits.",
        "Maya waved through the misted window with white mittens on her hands and seemed to be wearing a face covering.  She wrote: 'Lol the lovely lady got me stiff dancing while I froze my t**s off'. Maya's beauty treatment comes after it was revealed that Love Island will return to screens in just over four weeks on June 5.She will be back as the host following her huge success on the winter version of the show, which saw Sanam Harrinanan and Kai Fagan be crowned the winners.The summer version will see a new host of singletons travel to Majorca and stay in a luxurious villa for two months.Maya took over from Laura Whitmore to present series nine of the reality show.",
        "A TV source told The Sun: 'ITV have already lined up the islanders who will be heading to the show's villa in Majorca.'The cast will fly out late next month ready for the show to begin in just eight weeks.'",
        "They continued: 'Maya [Jama] is chomping at the bit to get to work on this series too. Having her on board has given Love Island a real boost and it's expected that ratings will soar.' According to the source the series is set to last eight weeks, meaning the finale will be taking place in early August.However, a second source claimed: 'This is speculation as no dates have been confirmed at this point.'Love Island currently airs twice a year on ITV2 and they are also preparing to air a middle-aged version of the show - dubbed The Romance Retreat."
    ]
}