{
    "articleURL": "/news/article-12053935/How-Kings-Coronation-compares-Queens-crowning-1953.html",
    "content": [
        "CORONATION LIVEBLOG: Click here to follow live updates throughout today How are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.uk Stunning pictures show how King Charles's Coronation today harked back 70 years to the glorious crowning of his mother.",
        "Although he arrived in the Diamond Jubilee State Coach, rather than the Gold State Coach that his mother traveled to the Abbey in, His Majesty was crowned in St Edward's Chair, just as the late Queen was.In 1953, Charles was aged just four but still attended part of his mother's Coronation service, where he was seen looking glum after being forced to wear his father's hair lotion.Today he wielded regalia including the Sovereign's Orb, the Sceptres with Dove and Cross and the Sword of State and Sword of Offering, mirroring his mother's actions on June 2, 1953.   Also present in the Abbey 70 years on from their attendance at Her Late Majesty the Queen's crowning were the Duke of Kent, his siblings Princess Alexandra and Prince Michael and cousin the Duke of Gloucester. Princess Anne, who was not present at her mother's Coronation because, aged just three, she was deemed to be too young, was there today with her siblings Prince Edward and Prince Andrew as they watched their brother King Charles be crowned.  ",
        "Queen Elizabeth II's eldest son was crowned King having prayed to be a 'blessing' to people of 'every faith and conviction', and serve his millions of subjects in Britain and around the globe.Charles became the 40th reigning sovereign to be crowned at Westminster Abbey, in a ceremony dating back to William the Conqueror in 1066, when Archbishop of Canterbury Justin Welby placed St Edward's Crown on his head.",
        "The King then looked emotional as Prince William paid homage to him, in a break with tradition, kneeling to give an oath of allegiance to his father. He said: 'I, William, Prince of Wales, pledge my loyalty to you and faith and truth I will bear unto you, as your liege man of life and limb. So help me God.' He then stood, touched the crown and kissed the King on the cheek. Charles was moved as he nodded to his son, and said 'amen' and 'thank you William'.The historic crowning, watched around the globe, was a fulfilment of the King's destiny, but followed the death of his mother, Queen Elizabeth II, last September after a 70-year reign.Minutes later Camilla was crowned. As Andrew Lloyd-Webber's coronation anthem was sung, the Queen was officially enthroned. The enthroning of the Queen was a moment in which Charles and Camilla were 'united in their joint vocation before God'.",
        "The monarch and his wife Queen Camilla had smiled at each other and to the congregation as they walked through the church.Mr Welby placed Queen Mary's Crown on the Queen's head and said: 'May thy servant Camilla, who wears this crown, be filled by thine abundant grace and with all princely virtues; reign in her heart, O King of love, that, being certain of thy protection, she may be crowned with thy gracious favour, through Jesus Christ our Lord. Amen.'",
        "The crown was made for Charles' great-grandmother, Queen Mary, for George V's coronation in 1911.The Bishop of Dover then presented the Queen with the Rod with Dove, and the Sceptre with Cross by Lord Chartres.Queen Camilla acknowledged the rod and sceptre by touching them in turn, rather than holding them as Queen Elizabeth the Queen Mother did in 1937.The Archbishop of Canterbury then said: 'Receive the Royal Sceptre and the Rod of equity and mercy.'May the Spirit guide you in wisdom and grace, that by your service and ministry justice and mercy may be seen in all the earth.'The service then moved on to the Holy Communion, in which gifts of bread and wine were brought before the King for him to acknowledge.The Archbishop of Canterbury delivered a prayer over the bread and wine and then the Eucharistic Prayer.",
        "The Lord's Prayer was then said before Holy Communion was received by the King and Queen.Before his crowning moment the King was anointed with holy oil away from public view. He was dressed in a white linen garment called Colobium Sindonis, a golden coat called the Supertunica and has had the coronation girdle placed around his waist.After being sanctified at his anointing, the King was presented with the coronation regalia. Minutes earlier Charles swore on the Bible and kissed it, having taken the oath: 'I, Charles, do solemnly and sincerely in the presence of God profess, testify, and declare that I am a faithful Protestant, and that I will, according to the true intent of the enactments which secure the Protestant succession to the throne, uphold and maintain the said enactments to the best of my powers according to law.'",
        "At the time of the Queen's Coronation, the Duke of Kent was just 17 but still had a key role as one of the three dukes who paid homage to Her Late Majesty.Along with his cousin Prince Philip and uncle Prince Henry, Duke of Gloucester, he promised to be the Queen's 'liege man of life and limb'.He had become the Duke of Kent at the age of just six when his father, Prince George, was killed in a plane crash in Scotland.In his autobiography, A Royal Life, which was released last year, the Duke told how, having been informed about his prominent role in the Coronation, he became nervous about forgetting his lines.'My chief anxiety was that I would forget my lines. I had been given the impression that I had to remember them so I had learned them by heart,' he recalled.Fortunately, when his big moment finally came, the Bishop of Durham held up a card with the words that the Duke would need.'It was quite daunting,' he said, adding: 'The whole service was pretty long and it was certainly very impressive.'It got to the point where people were eating sandwiches out of their coronets.'Today, the Duke of Kent, now 87, did not have a formal role in the service but was still present to witness history. ",
        "The Duke's sister, Princess Alexandra, was aged 16 when she appeared at the Queen's Coronation. Unlike her older brother, she did not have an active role, in contrast to her status as a bridesmaid at the Queen's wedding in 1947.After the Royal Family returned to Buckingham Palace following proceedings at the Abbey, the princess put on a headscarf and raincoat and slipped away onto The Mall to mingle, unrecognised, among the crowds.Her biographer told how the secret trip marked her desire to be where 'she belonged, among the people'.Today, she looked resplendent in her Coronation robes, although was not wearing the coronet that she wore in 1953.Prince Michael of Kent, who was also in attendance today, previously recalled his presence at the Queen's Coronation. ",
        "He said: 'There was an enormous crowd and they had periscopes, a lot of them, which were strange-looking devices where you looked through a viewer, and it then went up and you could look over the heads of the people in front of you.'So you had a forest of these strange-looking things which were sticking out from the crowd.'He was also amazed by the sight of the Queen's four-ton Gold State Coach with eight grey horses.'I don't think there are very often occasions where eight greys pull a coach. You have to have as many as that because the Coronation coach weighs so much.'",
        "The Prince added: 'It was a wonderful occasion and it's amazing to think we are here all these years later.'Prince Richard, 78, who became the Duke of Gloucester after the death of his father, Prince Henry, in 1974, was aged just eight when he attended the Queen's Coronation.Her Late Majesty's first cousin was in attendance with his older brother Prince William, who was tragically killed in a plane crash in 1972.The pair did not have any formal roles at the ceremony. The official family photograph shows him and his sibling standing next to each other.",
        "Both were wearing a kilt and black jacket. The pair later joined more senior members of their family on the Buckingham Palace balcony.The boys had arrived for the service with their mother, the Duchess of Gloucester.Their father had a formal role as one of the three dukes who paid homage to the Queen.Today, the Duke was seen among other members of his family as he watched the crowning of his cousin.  "
    ]
}