{
    "articleURL": "/sport/football/article-12046997/Leicester-Dean-Smith-believes-Jamie-Vardy-deliver-piece-magic-relegation-scrap.html",
    "content": [
        "Jamie Vardy endured a miserable season under prior boss Brendan Rodgers The 36-year-old though has come alive since Dean Smith arrived at the club Dean Smith believes Vardy can help them in their battle to avoid relegationJamie Vardy is proving the doubters wrong and is ready to deliver yet another piece of magic by keeping Leicester in the Premier League, according to boss Dean Smith.",
        "After a miserable season under former boss Brendan Rodgers, the 36-year-old has come alive under Smith, scoring in each of his last two games and looking back to his old self.Even though Vardy has a year left on a lucrative contract, his Leicester future was in serious doubt had Rodgers stayed in charge. But with the change in the dugout the Foxes are once again looking to their talisman in the final four games of the season.‘People will have seen in the last few games the hunger, desire and work rate he has shown,’ said Smith. ‘As he puts it, his legs are still there, and his brain is still there. He scored against Leeds and Everton and he is in a good place.‘He knows he’ll be judged on goals and he’s not really had the pitch time to earn those goals or chances.",
        "‘But he won a penalty against Wolves, scored against Leeds, and scored and hit the bar against Everton. He’s in a good vein of form and with four games to play we need that.‘It wasn’t a case of rebuilding his confidence but we had to play more to what we feel are his strengths. He is very intelligent at making runs but he needs the balls to go into the areas where is running.",
        "‘If you put the ball into those areas he will make things happen. We have to have the supply line to him and he has to make the runs.’Smith hopes to have full-back Ricardo Pereira and defender Jonny Evans available for Monday’s match at Fulham, with Leicester above the bottom three on goal difference alone. Kelechi Iheanacho has a groin injury but could return for the final two games of the campaign."
    ]
}