{
    "articleURL": "/wires/pa/article-12046453/Erling-Haaland-says-Manchester-City-attacking-run-right-mentality.html",
    "content": [
        "Record-breaking sharpshooter Erling Haaland says treble-chasing Manchester City are attacking the run-in with momentum and the right mindset.",
        "Pep Guardiola’s men kicked off a manic May with a comprehensive 3-0 victory against West Ham at the Etihad Stadium on Wednesday night.Second-half efforts from Nathan Ake and Phil Foden came either side of Haaland’s 51st goal of the season as City secured a ninth straight Premier League win.The result saw Guardiola’s men move back ahead of Arsenal at the summit as they eye a fifth title triumph in six seasons, with talk of a treble continuing in the background.",
        "“It was not easy,” Haaland said after beating West Ham. “It’s not easy when they come and play like that but we scored with Nath and then it kind of opened up more. In the end (it was) a so important three points.“We are in good shape, the mentality’s right. The only thing we can do is focus on the next game and try to win the next game.“Now it’s Leeds, we have to focus on the game, we have to only think of that game and to try to win it.”Saturday’s league match at home to Leeds is followed by the first leg of their mouth-watering Champions League semi-final at Real Madrid on Tuesday.City are looking to reach the European showpiece for the second time in the club’s history, with AC Milan or Inter Milan lying in wait in Istanbul on June 10.",
        "A week earlier comes a fascinating all-Manchester FA Cup final against rivals United, providing Haaland with the chance to end a fine first season in unforgettable fashion.“Potentially nine games left and I’m enjoying it,” he said. “To have games all the time, this is something I love so we will see.”Such occasions are why Haaland join City, whose lofty expectations he has somehow surpassed since joining from Borussia Dortmund last summer.“It’s a bit unreal,” Haaland said. “I am really proud and I’m happy. I just have to thank all my team-mates and the staff for making it possible.”Haaland got a guard of honour from staff and team-mates as he left the pitch after surpassing Andy Cole and Alan Shearer’s previous record.“It was a nice moment,” he told club media. “It was really painful to get hit in the back by everyone but it was a nice moment.”Not only did Haaland make history on Wednesday but there was a significant landmark for Guardiola, with Foden’s deflected volley City’s 1,000th goal in all competitions under him.“I am enjoying it every single game,” Haaland said of life as a striker under the former Barcelona and Bayern Munich boss.“It’s hard, he demands a lot, but I try to do my best to develop and do my best on the pitch. That’s what you have to do – nothing more to do than do your best.",
        "“It’s a pleasure and I love to play under Pep. I’m really happy to have him as a coach.”City are not the only English team going for continental glory as West Ham have a Europa Conference League semi-final date against AZ Alkmaar looming large.Lifting that trophy would be huge for the east London club but Premier League survival has yet to be assured and Manchester United arrive on Sunday evening.West Ham defender Aaron Cresswell told WHTV: “It’s a four-game season now and we’re four points clear of the bottom three.",
        "“So, three or four points or whatever it might take to keep us up, we just want to get it sooner rather than later.“We’ve also got a European semi-final which are going to be two massive games, but obviously every game between now and the end of the season is going to be vital.“Once the lads are back, I’m sure they’ll be back by Sunday and be raring to go, so as I say every game from now is massive.“It’s Man United in the late game on a Sunday night and the crowd will be up for it and we want to get the three points.”"
    ]
}