{
    "articleURL": "/wires/reuters/article-12038339/MPLX-reports-record-Q1-profit-jump-oil-gas-pipeline-flows.html",
    "content": [
        "By Stephanie Kelly",
        "NEW YORK, May 2 (Reuters) -U.S. energy midstream company MPLX LP on Tuesday reported record earnings for the first quarter due to a 6% boost in oil and gas pipeline throughputs and higher pipeline tariff rates.Adjusted earnings before interest, taxes, depreciation, and amortization (EBITDA) attributable to MPLX was a record $1,519 million in the quarter, compared with $1,393 million for the first quarter of 2022. Net income rose to $943 million from $825 million.Total crude oil, refined product and natural gas pipeline throughputs were 5.6 million barrels per day (bpd) in the first quarter, and the average tariff rate was 90 cents per barrel for the quarter, an increase of 1% year on year.The company's overall natural gas gathered volumes averaged 6.4 billion cubic feet per day (bcfd), a 21% increase from the first quarter of 2022, it said. Gathered volumes in the Marcellus in Pennsylvania averaged 1.4 bcfd, or a 4% increase.MPLX declared a first quarter distribution of $0.775 per unit.\"We see the distribution as our best opportunity to drive value for all unitholders while still supplementing that with opportunistic unit repurchases,\" John Quaid, MPLX's chief financial officer, said in a conference call on Tuesday.The company also said during the call its long-term outlook for the Marcellus, Permian and Bakken basins was largely unchanged despite recently lower natural gas prices.",
        "MPLX is working to expand natural gas long-haul and crude gathering pipelines for the Permian and Bakken basins, it said.It is expanding its Whistler pipeline from 2.0 bcfd to 2.5 bcfd, and the associated ADCC pipeline lateral into the Corpus Christi domestic and export markets. The expansion is on schedule for completion in September, the company said.MPLX is continuing work on its sixth 200 million cubic feet per day (mmcfd) processing plant in the Permian basin, Preakness ll, expected online in the first half of 2024.In the Marcellus, MPLX is progressing Harmon Creek ll, a 200 mmcfd processing plant expected online in the first half of 2024. (Reporting by Stephanie Kelly, Editing by Louise Heavens, Kirsten Donovan and Marguerita Choy)"
    ]
}