{
    "articleURL": "/wires/ap/article-12059981/Review-Heavens-profiles-figures-modern-space-race.html",
    "content": [
        "\"When the Heavens Went on Sale: The Misfits and Geniuses Racing to Put Space Within Reach,\" by Ashlee Vance (Ecco)",
        "During the space race of the 1960s that was chronicled by Tom Wolfe in \"The Right Stuff,\" the era was personified by larger-than-life heroes like John Glenn, Gus Grissom and Alan Shepard.In \"When the Heavens Went on Sale: The Misfits and Geniuses Racing to Put Space Within Reach,\" Ashlee Vance writes about a new kind of space race marked by private companies launching rockets and putting a massive number of satellites into orbit. The characters behind this new fight to dominate the skies are just as interesting as the ones Wolfe wrote about decades ago.Vance, the author of a biography of SpaceX founder Elon Musk and a writer at Bloomberg Businessweek, is well-positioned to tell the story of the modern fight for the skies. He follows four companies - Astra, Firefly, Planet Labs and Rocket Lab - as they're vying against each other.Vance's behind-the-scenes access to the companies helps explain the challenges the private space industry faces and propels the book along as he describes failed rocket launches and globe-trotting investors.Musk and SpaceX play a minor role in the book, but Vance makes clear from the outset he's writing about a new frontier that was opened up by the launch of SpaceX's Falcon 1 rocket in 2008. That launch, Vance writes, was an \"inciting incident\" that created the modern space frenzy by investors and private businesses.",
        "Vance's reporting and clear writing help illustrate just how much of a frenzy it has become, with the number of satellites doubling over a two-year period to 5,000 in 2022 and that number expected to grow to possibly 100,000 over the next decade. That growth, Vance notes, has created a new opportunity for businesses who help ensure those satellites don't collide.The book leaves some unanswered questions about the implications of that explosive growth for both space and the businesses trying to cash in on it. But that's mainly because that's a chapter that's still being written by the new space race itself."
    ]
}