{
    "articleURL": "/news/article-12043911/Reserve-Bank-Australia-Governor-Philip-Lowe-hosts-fancy-dinner-Perth-rate-hike.html",
    "content": [
        "RBA boss spoke at fancy dinner in PerthAttended by who's who of WA businessComes hours he hiked up interest ratesRBA tight-lipped when asked about event cost Reserve Bank Australia boss Philip Lowe was heckled as 'out of touch' as he wined and dined with billionaires at a swanky event hours after he inflicted more interest rate pain on struggling mortgage holders.",
        "Shortly after millions of families were hit with higher mortgage payments, the RBA board hosted a fancy dinner for 130 business and political leaders at Perth's State Reception Centre on Tuesday night. Seven board members and five RBA staff were flown to Perth for the A-list soiree, its first event in Western Australia in five years.Premier Mark McGowan, business executive Diane Lee Smith-Gander, former Fortescue Metals boss Elizabeth Gaines and other corporates feasted on grilled barramundi and lemon tart as Dr Lowe defended why the cash rate was lifted from 3.6 per cent to 3.85 per cent.During the dinner, farmer Tony Seabrook lashed out at Dr Lowe and the board, describing them as out of touch with everyday people.The Pastoralists and Graziers' Association of WA president stood up to confront Dr Lowe as he addressed the crowd.",
        "'You need to have on the board some real people that are doing real things and wearing the brunt of decisions that I think you and the board in many cases are very isolated from actually being involved in,' Mr Seabrook called out.Dr Lowe hit back, claiming RBA board members were representative of 26million Australians.'We have nine people on the board, nine dedicated and distinguished Australians trying to make decisions in our collective interest,' he explained.",
        "Mr Seabrook later doubled down on his attack of Dr Lowe and the RBA board in a TV interview.'He's out of touch, the whole board is out of touch,' he told Sky News Australia.'And my question to the governor was why don't you have some really serious practical people on that board … people in manufacturing, people in small industry and exporters and farmers.'Why don't you have some real people there, rather than the board that seems to just be out of touch.'",
        "Dr Lowe defended the board dinner afterwards, insisting it was important to meet with community and business leaders across Australia.'It was great to catch up with community leaders in Perth,' Dr Lowe told The West Australian. 'It was the conversation that was great.'Former Fortescue Metals boss Elizabeth Gaines also defended the event.",
        "$500,000: Up $79 to $2,963 from $2,884$600,000: Up $95 to $3,555 from $3,460$700,000: Up $111 to $4,148 from $4,037$800,000: Up $127 to $4,740 from $4,613$900,000: Up $143 to $5,333 from $5,190$1,000,000: Up $158 to $5,925 from $5,767",
        "'It is appropriate the RBA does meet in (different) parts of Australia,' she said.'I feel for anybody that struggles to put food on the table.'The RBA was tight-lipped about the cost of the dinner when contacted by Daily Mail Australia on Wednesday. ",
        "'We will not provide the specific guest list or costs for this event to protect the privacy of attendees and for other confidentiality reasons, a spokewoman said.'Information about the Reserve Bank’s total expenditure is published in our Annual Report.'She added Tuesday night's event in Perth was part of the RBA's 'broader liaison program'.'The Reserve Bank Board meets in state capitals other than Sydney on a regular basis and a dinner is held with members of the local community, including representatives and leaders from politics, business, the public sector, and educational and community organisations,' the spokeswoman said.'These dinners are an opportunity for the community to hear directly from the Board, and for the board to hear directly from the community about the economic issues affecting them.'It's estimated the latest rate hike will add another $78 a month to average borrowers with a $500,000 loan. Dr Lowe also warned more rate rises could be ahead.The West Australian's Up Late podcast host Ben Harvey slammed the guest list, questioning what multi-millionaires would bring the debate about the cost of living of everyday Australians.'How many of these roosters are experiencing mortgage stress? How many outside a few token not-for-profit executives actually have mortgages?' Harvey said.'Jesus, how many of them would only have one house?' "
    ]
}