{
    "articleURL": "/wires/reuters/article-12050009/SNAPSHOT-Russias-war-Ukraine-latest-New-drone-attack-southern-Russia-refinery.html",
    "content": [
        "May 5 (Reuters) - A drone attack on the Ilsky oil refinery in southern Russia, the second in as many days, has caused a fire, TASS news agency reported on Friday, citing emergency services.",
        "WAGNER* Standing in a field of corpses, Russian mercenary boss Yevgeny Prigozhin published an expletive-ridden video personally blaming top defence chiefs for losses suffered by his Wagner Group fighters in Ukraine.FIGHTING* Ukrainian military command said in its Friday morning report that 18 out 24 drones launched by Russian forces had been shot down. It said the Russian military had launched 10 missile strikes on the cities of Kramatorsk and Zaporizhzhia, and also carried out 75 airstrikes and dozens of rocket attacks.* Nearly 50 Russian attacks were repelled along the main sectors of the front line in eastern and southern Ukraine, the General Staff of the Ukrainian Armed Forces said Thursday evening. The heaviest fighting is still in Bakhmut and in Maryinka, further south in Donetsk region, it said.* Reuters was not able to verify the battlefield accounts.* Record high water levels could overwhelm a major dam in southern Ukraine and damage parts of the Russian-controlled Zaporizhzhia nuclear power station, a Russian official told TASS news agency.DIPLOMACY/POLITICS* Technical personnel from Turkey, Russia, Ukraine, and the United Nations will meet on Friday to discuss a deal that allows the exports of Ukrainian grains on the Black Sea, the Turkish Defence Minister said.* The U.S. Ambassador to the United Nations said on a visit to Brazil that she encouraged the government to include Ukraine in any attempt to negotiate an end to the war. She was referring to President Lula da Silva's comments calling on the West to stop arming Ukraine to allow peace talks to start.",
        "QUOTES* \"I don't believe they got to the Kremlin ... Our Putin is super. Nothing ever threatens him\" - Moscow resident Zifa.* \"We all want to see a different Vladimir here in The Hague, the one who deserves to be sanctioned for his criminal actions here, in the capital of international law\" - ZelenskiyRECENT IN-DEPTH STORIES* INSIGHT-Ukraine's nuclear deal with Canada's Cameco carries big risks, rewards* ANALYSIS-Kremlin incident gives Putin cover to deepen war* COLUMN-Global ammunition race may decide Ukraine war* Liberated villages offer glimpse of precarious Ukrainian health system. (Compiled by Reuters editors)"
    ]
}