{
    "articleURL": "/wires/reuters/article-12040341/Ezequiel-Durans-homer-lifts-Rangers-past-D-backs.html",
    "content": [
        "Ezequiel Duran belted a go-ahead home run in the sixth inning, three relievers combined for 3 2/3 scoreless innings and the Texas Rangers held on for a 6-4 victory over the Arizona Diamondbacks on Tuesday in Arlington, Texas.",
        "Duran finished 3-for-4 and Marcus Semien had two hits for Texas, which has won four games in a row.The Diamondbacks took their second loss in a row despite a homer and two hits apiece from Ketel Marte and Christian Walker.Arizona starter Zac Gallen didn't have his best night as he saw his four-game winning streak and 28-inning scoreless-innings streak end.Those streaks were snapped on a night when the Diamondbacks jumped out to a 2-0 lead in the first inning, highlighted by a solo home run by Marte, and then had extended the gap to 4-1 in the third inning on a solo shot by Walker.Texas managed to stay within striking distance, though. The Rangers scored their first run in the first inning on a double by Semien and an RBI single by Nathaniel Lowe, which ended Gallen's scoreless-innings streak.Then, Texas pulled to within 4-3 in the fifth inning on RBI hits by Semien and Travis Jankowski off Gallen. The right-hander exited after laboring through five innings, allowing three runs on seven hits with no walks and six strikeouts in a no-decision.In the sixth, the Rangers pulled ahead 5-4 on a two-run homer by Duran. Jonah Heim singled with two outs, and Duran hammered a 1-1 fastball from Arizona reliever Scott McGough (0-3) over the left-center-field fence and into the D-backs bullpen.",
        "Texas cushioned its lead to 6-4 with one run in the seventh on a wild pitch by Arizona reliever Kevin Ginkel.The Rangers' bullpen made that lead stand. Brock Burke (2-0), Jonathan Hernandez and Will Smith (fourth save) yielded just one hit and three walks over the final 3 2/3 innings.The D-backs threatened in the ninth, getting runners at first and second with one out, but Smith escaped by getting Emmanuel Rivera to fly out and Walker to pop up.Texas starter Jon Gray allowed four runs on eight hits with one walk and two strikeouts over 5 1/3 innings.The Rangers finished the night with 10 hits, including a single by Robbie Grossman in the fifth inning. Grossman extended his hitting streak to 12 games, tied for the longest active stretch in the big leagues.The D-backs got two-hit games by Marte, Walker, Dominic Fletcher and Geraldo Perdomo.The two-game interleague series concludes Wednesday afternoon.--Field Level Media"
    ]
}