{
    "articleURL": "/femail/health/article-12045083/Melbourne-mum-reveals-son-5-months-saved-craniosynostosis-jigsaw-skull-surgery.html",
    "content": [
        "Brittany Bevans' son Louie had craniosynostosisNeeded operation to smash skull apartA young mum has revealed doctors dismissed her concerns over her son's oddly-shaped head before realising it was a medical emergency.",
        "Brittany Bevans, 29, says her son Louie was born with a rare disorder which could have seen him go blind and develop significant learning delays.Despite knowing something was wrong with her son 'within weeks' of his birth, nothing could have prepared her for the truth, or the treatment.His skull would need to be 'smashed into pieces' so that it could be put back together again the right way. 'It was overwhelming to consider that my baby would have to undergo such a complex and risky procedure,' she said.'The idea of his skull being cut open, broken apart and reconstructed filled me with intense anxiety.'Brittany knew there was an issue the shape of Louie's head, but she was fobbed off by her GP and paediatrician.She then took her son to the craniofacial team at the Royal Children's Hospital in Melbourne, where specialists revealed he had craniosynostosis, a condition which occurs when the bones in the skull fuse together too early. Her baby having to undergo surgery was Brittany's greatest fear'.",
        "'The constant worry took a toll on my mental health and two months after Louie was born, I was eventually diagnosed with postnatal anxiety.'This was undoubtedly the most challenging and difficult period of my life.'She added that she 'became aware' of his condition 'shortly after his birth'.",
        "'Despite our concerns being raised, we were consistently told that it was simply a case of \"Birth Head\".",
        "'Unfortunately, over time, his head shape did not improve and in fact appeared to worsen.'The worry consumed me every day, and I constantly examined the shape of his head.",
        "Craniosynostosis is a skull problem that causes a baby to be born with, or develop, an abnormally shaped head.It is rare, affecting an estimated one in every 1,800 to 3,000 children. Three out of every four cases affect boys.The irregular skull shape in craniosynostosis can cause persistent headaches, learning difficulties, eye problems and other symptoms.Craniosynostosis is the result of the premature fusion of different sections of the skull.This means the skull is unable to grow in affected areas.When one area of the skull is prevented from growing, other areas may 'overgrow' to compensate and limit the pressure developing around the brain.",
        "'As I delved into research on the condition, I realised how serious it could be if left untreated.'Craniosynostosis can lead to brain damage, blindness, and intracranial pressure due to insufficient space in the skull for the brain to develop.'This is why I felt it was crucial to advocate for Louie and other parents and children facing the same issue.",
        "'If hadn't trusted my instincts and followed up with doctors, I shudder to think what might have happened to Louie.'These nagging doubts motivated me to seek answers and I am so grateful that I did.'Louie received more than 60 stitches and two blood transfusions, and had to remain in hospital for five days to recover.Now one, Louie was first diagnosed in December 2021, with the seven-hour operation, known as a cranial vault reconstruction, following in October 2022.It involves surgeons making an incision over the top of the head from ear to ear, then pulling the skin and soft tissues over the forehead to expose the skull – before breaking it and piecing it together like a puzzle.Brittany said: 'Louie is doing great now and has made a full recovery - he's a super happy and energetic toddler!'While he may have hit a few milestones a bit later than usual, his body was focused on healing after a major surgery, so we're not too concerned.'That being said, we want to make sure we stay proactive and address any potential speech-related issues, which is why we'll be visiting a speech therapist.'I'm so glad that the surgery is over and Louie is doing so well now.",
        "'However, I must admit that I'm a bit more cautious whenever Louie isn't feeling his best.",
        "'But I think that's just the natural instinct of a mother, and I don't think it'll ever go away.'In fact, going through this experience together as a family has shown us that we're capable of overcoming anything. It's a real source of strength for us now.'To help other parents, Brittany is now on a mission to raise more awareness of craniosynostosis though TikTok, where she has over 24,000 followers.She added: 'As a parent, I have seen first-hand the lack of education and understanding surrounding this condition within the medical field.'Through my TikTok platform, I have shared my son's experience with craniosynostosis, and I have received overwhelming support from other parents who have faced similar challenges.",
        "'However, I have also noticed a common thread among these parents: they have struggled to get a diagnosis, and their concerns have been dismissed by medical professionals.'I am passionate about advocating for other parents and children facing similar challenges.''As a parent, there's nothing more important than seeing your child grow up to be happy and fulfilled.'Knowing that the surgery has given Louie the chance to live a normal life fills me with immense joy and gratitude.",
        "'It's such a relief to know that he won't have to struggle or suffer unnecessarily.'I can't wait to see all the amazing things that Louie will accomplish as he grows up.'"
    ]
}