{
    "articleURL": "/news/article-12045949/Companies-turned-UK-executives-UNDERPAID.html",
    "content": [
        "Companies are turned off the UK because top executives are underpaid, the head of the London Stock Exchange has warned.",
        "Julia Hoggett said compensation levels was a 'critical element' in making the country an attractive place for firms to base themselves.The comments come amid intense soul-searching in the City following an exodus of listed companies to New York.However, they sparked a backlash with FTSE 100 chiefs earning an average of £3.4million a year. Ms Hoggett herself - one of the most prominent female executives in the Square Mile - is thought to earn seven figures, although her pay is not formally disclosed.",
        "The number of new listings in the UK have dropped by 40 per cent since 2008, according to recent figures.Last month, Cambridge-based microchip design firm Arm dealt a blow to London markets by announcing it was planning to list its shares on the US stock market this year.Other large businesses such as building materials giant CRH also revealed plans to shift its main stock market listing from London to the US, saying it would have more 'commercial, operational and acquisition' opportunities across the pond.Yesterday, the Financial Conduct Authority unveiled a shake-up of stock market listing rules designed to halt the exodus and spur more high-tech start-ups to stay in the UK. But in a post on the LSE's website, Ms Hoggett said: 'One critical element that has not received enough attention is the UK's approach to executive compensation.",
        "'We should be encouraging and supporting UK companies to compete for talent on a global basis, so we remain an attractive place for companies to base themselves, stay and grow.' Ms Hoggett argued that 'attracting and retaining domestic and international talent' was essential.She said that goal was often hampered by shareholder advisory agencies and asset managers 'voting against executive pay policies even when those pay levels are significantly below global benchmarks' - and despite those same bodies often supporting much higher pay awards in the US.'This lack of a level playing field for UK companies is often not discussed, or if it is, the downside risks to our companies, our economy and our competitiveness are not part of the conversation,' she said.'It is essential to have a constructive discussion with all stakeholders about a topic that tends to generate emotion and strong views.'The remarks sparked anger with ordinary Brits struggling to make ends meet amid spiralling prices following Covid and the Ukraine war. Last week Bank of England chief economist Huw Pill suggested that workers ought to stop asking for more pay to help hold down inflation.Luke Hildyard, executive director of the High Pay Centre, said the £3.4million average salary for a FTSE 100 chief last year 'sounds like enough money... but perhaps the London Stock Exchange think that anyone willing to work for this amount is too talentless to be considered for an executive role'.",
        "He added: 'It's not realistic to think that paying millionaire executives even more would generate greater wealth for the nation, as opposed to leaving even less for the wider workforce.' Paul Nowak, general secretary of the Trades Union Congress, said: 'CEO pay is booming - but working people are enduring the longest wage squeeze in 200 years.'It's a tale of two Britains.'And it's not just executive pay that is soaring. Bonuses in the City are at a record high and oil and gas giants are registering eye-watering profits.'It's time to hold down pay at the top - not wages for everyone else.' Appointed to the role in April 2021, Ms Hoggett's mother is Lady Hale, the former president of the Supreme Court.Her boss at the wider London Stock Exchange Group, David Schwimmer, was paid £4.7million in 2022."
    ]
}