{
    "articleURL": "/wires/reuters/article-12039911/Judge-says-no-class-action-against-Peloton-fitness-class-availability.html",
    "content": [
        "By Jonathan Stempel",
        "NEW YORK, May 2 (Reuters) - A U.S. judge on Tuesday refused to let Peloton Interactive Inc customers pursue a class action accusing the bike and treadmill maker of misleading them about the \"ever-growing\" size of its library of on-demand fitness classes.In a 74-page decision, U.S. District Judge Lewis Liman in Manhattan said individual issues predominated over common issues affecting the many thousands of customers in the proposed class, and therefore the customers could not sue as a group.The decision is a victory for New York-based Peloton, because class actions can allow for greater recoveries at lower cost than when plaintiffs sue individually.Lawyers for the customers had no immediate comment.Peloton had been accused of enticing people to buy its products based on its improper commitment to provide an \"ever-growing\" or \"growing\" library of on-demand classes.Customers sued after Peloton decided in March 2019 to purge more than half of its estimated 12,000 classes, following litigation by music publishers that accused the company of streaming songs without proper licensing.According to the customers, Peloton knew this could happen, yet kept charging full price for products containing copyrighted songs by Adele, Beyoncé, Luke Bryan, Drake, Ariana Grande, Madonna, Justin Timberlake, Jay Z and other artists.Liman said the customers could not sue on a theory they were induced to pay premium prices because some might not have seen Peloton's challenged statements. He also said the customers did not measure the damages attributable to those statements.",
        "In opposing class certification, Peloton said its prices remained constant for more than a year after it removed classes, and that not everyone saw its \"ever-growing\" or \"growing\" claims because it did not advertise them widely.Peloton settled the licensing lawsuit by the National Music Publishers' Association and 14 members in February 2020.The case is Passman et al v Peloton Interactive Inc, U.S. District Court, Southern District of New York, No. 19-11711. (Reporting by Jonathan Stempel in New York; Editing by Himani Sarkar)"
    ]
}