{
    "articleURL": "/wires/ap/article-12055635/TJ-Friedls-3-run-homer-lifts-Reds-past-White-Sox-5-3.html",
    "content": [
        "CINCINNATI (AP) - TJ Friedl hit a three-run homer and a run-scoring triple, helping the Cincinnati Reds top the Chicago White Sox 5-3 on Saturday.",
        "Friedl's third homer - a drive to right-center against Mike Clevinger in the fifth inning - lifted Cincinnati to a 4-3 lead. He drove in Jonathan India with a two-out triple in the seventh.India went 3 for 3 and scored three times. He walked ahead of Friedl's homer.\"We really push other's energy,\" Friedl said of his connection to India. \"Seems like when we rally it's a different guy every night. The opportunity presented itself for me tonight.\"Derek Law (2-4) pitched 2 1/3 scoreless innings in relief of Nick Lodolo, and Alexis Díaz got three outs for his sixth save.Hanser Alberto and Seby Zavala homered for Chicago. Clevinger (2-3) was charged with four runs and six hits in six innings.",
        "The White Sox, who came in hitting .180 with runners in scoring position over the past 13 games, went 1 for 8 in those situations on Saturday.\"We have to string together good at-bats,\" White Sox manager Pedro Grifol said. \"Just need to keep grinding. We hit the ball hard.\"Reds third baseman Nick Senzel stranded a pair of runners in the first when he retired Andrew Benintendi with a diving stop. The White Sox left the bases loaded in the third.Alberto tied it at 1 with his second homer in the second. Benintendi doubled home Luis Robert Jr. in the third, and Zavala´s leadoff drive in the fourth made it 3-1 White Sox.",
        "Lodolo allowed three runs and six hits in 3 2/3 innings. He hit three batters, struck out three and walked one.\"Nick Lodolo is tough to hit,\" Reds manager David Bell said. \"The home runs are going to happen. The bullpen really picked us up tonight.\"Friedl's homer was the sixth allowed by Clevinger in the pitcher's last four starts. Clevinger has allowed 15 earned runs over his last four starts.\"I thought Clevinger threw the ball well,\" Grifol said. \"But he got himself into trouble in the fifth.\"The White Sox have won four of six since losing a season-high 10 straight. They dropped to 5-13 on the road.OUCHIt was the fourth time that Lodolo hit three or more batters. Only six pitchers since 1901 have had more such games in their career. This was Lodolo´s 26th career game.TRAINERS ROOMWhite Sox: DH Eloy Jiménez was hospitalized early Saturday with abdominal pain and was diagnosed with acute appendicitis. He underwent an appendectomy and is expected to miss four to six weeks. ... 3B Yoán Moncada (back) played five innings at third base for Triple-A Charlotte and went 1 for 2 with an RBI and a walk. Moncada will play more innings on Sunday then be re-evaluated after Monday's off day.",
        "Reds: OF Jake Fraley was scratched with lower back stiffness. Henry Ramos started in left in his place. ... OF Wil Myers was reinstated from the IL after recovering from COVID-19.UP NEXTReds RHP Graham Ashcraft (2-0, 2.00 ERA) will oppose White Sox RHP Michael Kopech (0-3, 5.97 ERA) in the series finale.___AP MLB: https://apnews.com/hub/MLB and https://twitter.com/AP_Sports"
    ]
}