{
    "articleURL": "/wires/ap/article-12051739/As-Alex-Murdaugh-sits-prison-cell-legal-woes-continue.html",
    "content": [
        "COLUMBIA, S.C. (AP) - Alex Murdaugh may be serving a life sentence for killing his wife and son, but the legal system is far from done with him.",
        "As he sat in his South Carolina prison cell this week, Murdaugh´s lawyers dealt with large financial claims against him.They told an insurer looking to force him to repay $3.4 million it awarded in a wrongful death settlement over Murdaugh's housekeeper that he lied about the circumstances of her death. Murdaugh's first version of events was designed to force the insurer to pay, the lawyers said. The imprisoned Murdaugh now says he doesn't remember the events of five years ago.Meanwhile, Jim Griffin, who helped lead the defense in the murder case, is asking Judge Daniel Hall to release an additional $160,000 from Murdaugh's retirement account to pay for his appeal of his life sentence because the six-week trial exhausted the $600,000 they were initially given.Murdaugh, 54, was convicted in March. Prosecutors said he stole millions of dollars and found himself teetering on financial disaster, which led him to shoot to death his 22-year-old son, Paul, and 52-year-old wife, Maggie, at their Colleton County home.Also pending against Murdaugh is a lawsuit filed by the family of Mallory Beach. They say she was killed when Paul Murdaugh drove a boat into a bridge piling while he was drunk in 2019. Her family sued the Murdaughs and the owner of the convenience store that sold the underage Paul the beer.",
        "According to media reports, Greg Parker's lawyer argued Wednesday that he and his stores should be dismissed from the lawsuit because Paul Murdaugh had a duplicate of his older brother's driver's license and the clerk did quickly glance at it. Parker also showed footage from a Netflix documentary that showed Paul's friends discussing how he liked drinking when driving the boat and that Beach knew the risk when she hung out with them.Almost all of Murdaugh's assets are frozen as courts sift through claims from the clients whom he allegedly stole from and others who have sued. But he was allowed to pay his attorneys though $600,000 out of his 401K retirement account since that money was legitimately earned.The officials appointed to control Murdaugh's money are against giving his lawyers more. But Griffin said the six-week murder trial was more complex and longer than expected.Murdaugh's lawyers are also fighting a lawsuit against him filed by Nautilus Insurance Co., which paid out nearly $4 million to settle claims in the aftermath of the death of his longtime housekeeper, Gloria Satterfield.Satterfield's family said they never received the money. Eric Bland, the family's attorney, said Murdaugh never told them about the settlement and pocketed the money after convincing Satterfield's sons to use a lawyer as their representative who was a family friend. Nautilus is suing in federal court to get the money back.",
        "Murdaugh's lawyers suggested Nautilus take legal action against Satterfield's family members, saying they collected more than $7 million in settlements and other fees. However, Bland said Nautilus has no claim against the family because they didn't receive the insurance money.Its investigators should have looked more thoroughly into Murdaugh's account of Satterfield's death - which changed recently - before paying, Bland said. Murdaugh previously said Satterfield died in a fall but now says he doesn't remember.\"This is nothing but noise,\" Bland said. \"Just gutless people trying to continue to victimize Gloria´s siblings and children.\"Murdaugh is awaiting trial on over 100 other criminal charges, including insurance fraud for trying to arrange his own death and money laundering. He also is charged with tax evasion. From 2011 to 2021, Murdaugh made about $16 million as a lawyer, while stealing about $9 million from his law firm, settlement money for clients and other places, according to indictments."
    ]
}