{
    "articleURL": "/wires/reuters/article-12059421/US-FDA-approves-Eyenovias-pupil-dilating-spray.html",
    "content": [
        "May 8 (Reuters) - The U.S. Food and Drug Administration (FDA) on Monday approved Eyenovia Inc's pupil-dilating spray for use with the company's proprietary drug delivery device during eye examinations.",
        "The spray is indicated for mydriasis, or pupil dilation, for eye examinations carried out before cataract surgery or corrective prescriptions and can only be used in combination with the company's experimental drug delivery device, Optejet.\"We look forward to introducing Mydcombi to key offices beginning this summer while we bring our internal manufacturing capabilities on-line for 2024,\" Michael Rowe, chief executive officer of Eyenovia, said in a statement.The FDA approval provides \"critical validation\" of Optejet, which Eyenovia is using to develop drugs for other indications, said Rowe, adding that the company was also exploring partnership options for the device.Eyenovia is also testing Optejet in late-stage trials with its experimental drug to treat presbyopia, or gradual loss of near vision as part of aging.Brokerage H.C. Wainwright analyst Matthew Caufield estimated Mydcombi to reach peak sales of $61.8 million globally by 2032.In 2021, the FDA had reclassified Mydcombi as a drug-device combination product, given its dependence on Optejet for administration.The U.S. health regulator had declined to approve the spray in its then-form as a standalone drug and requested additional device testing for Optejet. However, the agency had not requested any additional clinical work for Mydcombi.The FDA approval is based on two late-stage studies that showed the spray improved the efficiency of office-based eye exams.",
        "Optejet delivers the drug in microdoses and reduces chances of overdosing and exposure compared to conventional eyedroppers, the company said.(Reporting by Aditya Samal and Mariam Sunny in Bengaluru; Editing by Subhranshu Sahu)"
    ]
}