{
    "articleURL": "/wires/ap/article-12053391/California-reparations-task-force-vote-formal-apology.html",
    "content": [
        "OAKLAND, Calif. (AP) - California's reparations task force voted Saturday to approve recommendations on how the state may compensate and apologize to Black residents for generations of harm caused by discriminatory policies.",
        "The nine-member committee, which first convened nearly two years ago, gave final approval at a meeting in Oakland to a hefty list of proposals that now go to state lawmakers to consider for reparations legislation.U.S. Rep. Barbara Lee, D-Oakland, who is cosponsoring a bill in Congress to study restitution proposals for African Americans, at the meeting called on states and the federal government to pass reparations legislation.\"Reparations are not only morally justifiable, but they have the potential to address longstanding racial disparities and inequalities,\" Lee said.The panel´s first vote approved a detailed account of historical discrimination against Black Californians in areas such as voting, housing, education, disproportionate policing and incarceration and others.Other recommendations on the table ranged from the creation of a new agency to provide services to descendants of enslaved people to calculations on what the state owes them in compensation.",
        "\"An apology and an admission of wrongdoing just by itself is not going to be satisfactory,\" said Chris Lodgson, an organizer with the Coalition for a Just and Equitable California, a reparations advocacy group.An apology crafted by lawmakers must \"include a censure of the gravest barbarities\" carried out on behalf of the state, according to the draft recommendation approved by the task force.Those would include a condemnation of former Gov. Peter Hardeman Burnett, the state´s first elected governor and a white supremacist who encouraged laws to exclude Black people from California.",
        "After California entered the union in 1850 as a \"free\" state, it did not enact any laws to guarantee freedom for all, the draft recommendation notes. On the contrary, the state Supreme Court enforced the federal Fugitive Slave Act, which allowed for the capture and return of runaway enslaved people, until for over a decade until emancipation.\"By participating in these horrors, California further perpetuated the harms African Americans faced, imbuing racial prejudice throughout society through segregation, public and private discrimination, and unequal disbursal of state and federal funding,\" the document says.The task force approved a public apology acknowledging the state´s responsibility for past wrongs and promising the state will not repeat them. It would be issued in the presence of people whose ancestors were enslaved.California has previously apologized for placing Japanese Americans in internment camps during World War II and for violence against and mistreatment of Native Americans.The panel also approved a section of the draft report saying reparations should include \"cash or its equivalent\" for eligible residents.More than 100 residents and advocates gathered at Mills College of Northeastern University in Oakland, a city that is the birthplace of the Black Panther Party. They shared frustrations over the country´s \"broken promise\" to offer up to 40 acres and a mule to newly freed enslaved people.",
        "Many said it is past time for governments to repair the harms that have kept African Americans from living without fear of being wrongfully prosecuted, retaining property and building wealth.Elaine Brown, former Black Panther Party chairwoman, urged people to express their frustrations through demonstrations.Saturday's task force meeting marked a crucial moment in the long fight for local, state and federal governments to atone for discriminatory polices against African Americans. The proposals are far from implementation, however.\"There´s no way in the world that many of these recommendations are going to get through because of the inflationary impact,\" said Roy L. Brooks, a professor and reparations scholar at the University of San Diego School of Law.Some estimates from economists have projected that the state could owe upwards of $800 billion, or more than 2.5 times its annual budget, in reparations to Black people.The figure in the latest draft report released by the task force is far lower. The group has not responded to email and phone requests for comment on the reduction.Secretary of State Shirley Weber, a former Democratic assemblymember, authored legislation in 2020 creating the task force with a focus on the state´s historical culpability for harms against African Americans, and not as a substitute for any additional reparations that may come from the federal government.",
        "The task force voted previously to limit reparations to descendants of enslaved or free Black people who were in the country by the end of the 19th century.The group´s work has garnered nationwide attention, as efforts to research and secure reparations for African Americans elsewhere have had mixed results.The Chicago suburb of Evanston, for example, has offered housing vouchers to Black residents but few have benefited from the program so far.In New York, a bill to acknowledge the inhumanity of slavery in the state and create a commission to study reparations proposals has passed the Assembly but not received a vote in the Senate.And on the federal level, a decades-old proposal to create a commission studying reparations for African Americans has stalled in Congress.Oakland city Councilmember Kevin Jenkins called the California task force's work \"a powerful example\" of what can happen when people work together.\"I am confident that through our collective efforts, we can make a significant drive in advancing reparations in our great state of California and ultimately the country,\" Jenkins said.___Sophie Austin is a corps member for the Associated Press/Report for America Statehouse News Initiative. Report for America is a nonprofit national service program that places journalists in local newsrooms to report on undercovered issues. Follow Austin on Twitter: @sophieadanna"
    ]
}