{
    "articleURL": "/tvshowbiz/article-12061343/Taxi-stars-Christopher-Lloyd-Tony-Danza-Judd-Hirsch-Carol-Kane-reunite-New-York-City.html",
    "content": [
        "Nearly 30 years after the show went off the air, Taxi stars Christopher Lloyd, Tony Danza, Judd Hirsch and Carol Kane reunited n New York City.",
        "Lloyd, 84, took to Instagram to share snaps of his reunion with Danza, 72, Hirsch, 88, and Kane, 70, at an outdoor restaurant patio in the Big Apple on Monday.Lloyd - who reunited with his Back to the Future co-stars Michael. J Fox, Christopher Lloyd, Lea Thompson and Tom Wilson in February - also stopped by Danza's new show at the Carlyle Cafe on the Upper East Side of Manhattan.'What the hell is going on here?' Lloyd captioned the snap, adding the hashtag #taxi to the post.Lloyd opted for a black turtleneck under a black suit coat and blue jeans for the afternoon outing.",
        "Danza opted for a grey long-sleeved shirt and grey pants for the lunch outing in the Big Apple.Hirsch stepped out in a white dress shirt with grey pants and purple-tinted John Lennon-style sunglasses.Finally Kane opted for a black blouse and a pink skirt for the outdoor lunch meeting on Monday afternoon.Lloyd also shared a wider shot of all four actors at the outdoor table and another of Hirsch leaning over the table during their conversation. While Hirsch and Kane aren't on social media, Danza also shared the first snap Lloyd posted, adding in the caption, 'Love this crew of old friends so much! #OldFriends #Taxi.'",
        "Lloyd also showed up a day earlier to support Danza during his ongoing show at the Carlyle Cafe.'My man @tonydanza brought the house down last night at the @cafecarlyle - so happy to see you. We always share a laugh or two!' Lloyd said in the caption.Taxi followed the employees of a New York City taxi cab company in the late 1970s and early 1980s which helped launch all of the actors into stardom.",
        "Hirsch played Alex Reiger, the level-headed cabbie who everyone in the Sunshine Cab Company turns to, who is also the only driver who considers it his career, not just a temporary job like most others.Danza played boxer and Vietnam veteran Tony Banta, who started working at Sunshine Cab after losing his boxing license.Lloyd played Reverend Jim Ignatowski, who was a guest star in the first season and upgraded to a main cast member throughout the rest of the show's five season run.He won two back-to-back Emmy Awards for playing the character in 1982 and 1983, and is considered one of the greatest TV characters of all time.Kane played Simka Dahblitz-Gravas, who dated and ultimately married Latka (Andy Kaufman) on the show. "
    ]
}