{
    "articleURL": "/news/article-12040143/Tucker-Carlson-said-wanted-white-mob-kill-Antifa-kid-text-led-dismissal.html",
    "content": [
        "Tucker Carlson sent a text message to one of his producers in the afternoon of January 7, 2021, describing his response to a video of a fight in DCCarlson said he had seen the video several weeks before, in which at least three white men fought an 'Antifa kid' - Carlson said he wanted the victim to be killedCarlson said he then stopped himself and realized that his gut feeling was deeply wrong: the text, revealed Tuesday, played a role in his firing last week Tucker Carlson sent an incendiary text message the day after the January 6 storming of the Capitol - which the board of Fox News learnt about on the eve of their defamation trial - sparking, in part, his shock firing last week, according to a report.",
        "The pivotal role played by the January 7, 2021, text message was reported Tuesday by The New York Times.In the text to one of his producers, Carlson recalls seeing a mob of three white men attacking an 'Antifa kid' and wanting the victim to be killed. But, Carlson wrote, he realized wanting the 'Antifa kid' to die was wrong.Carlson, whose critics call him a white supremacist, also asserted that white people in general do not act so dishonorably as to launch a three-against-one attack. He did not specify the race of the 'Antifa kid'.'It was three against one, at least,' Carlson wrote. 'Jumping a guy like that is dishonorable obviously. It's not how white men fight.'",
        "The text message was unearthed as part of a defamation case filed by Dominion voting systems against Fox News - which, following the 2020 election, allowed the promotion of the idea that Dominion rigged the election in favor of Joe Biden.Dominion obtained private messages between Fox News hosts and executives, which showed that many of them privately admitted the idea of a stolen election was nonsense.The judge overseeing the Dominion case is being asked by multiple news organizations to remove the redaction of many of the messages which were part of the case. No ruling has yet been made.",
        "Carlson's texts also showed him ridiculing Fox bosses and attacking his colleagues.The texts became known to Fox News's board on the eve of the trial - which began on April 18, and was settled before the jury could start to hear evidence.The content of the messages so alarmed the board that the wheels were set in motion for Carlson's firing, The New York Times reported.'A couple of weeks ago, I was watching video of people fighting on the street in Washington,' Carlson wrote in the text, sent at 4:18pm on January 7, 2021.",
        "'A group of Trump guys surrounded an Antifa kid and started pounding the living s*** out of him. It was three against one, at least. Jumping a guy like that is dishonorable obviously. It's not how white men fight.'Yet suddenly I found myself rooting for the mob against the man, hoping they'd hit him harder, kill him. I really wanted them to hurt the kid. I could taste it.'Then somewhere deep in my brain, an alarm went off: this isn't good for me. I'm becoming something I don't want to be. The Antifa creep is a human being.'Much as I despise what he says and does, much as I'm sure I'd hate him personally if I knew him, I shouldn't gloat over his suffering. I should be bothered by it. I should remember that somewhere somebody probably loves this kid, and would be crushed if he was killed.",
        "'If I don't care about those things, if I reduce people to their politics, how am I better than he is?'Fox's board was deeply concerned that the message could be made public at trial - a fear that pushed them to agree to the $787.5 million settlement.The board told Fox executives on the day the trial began it was bringing in an outside law firm to investigate Carlson's behavior.",
        "The board hired the law firm Wachtell, Lipton, Rosen and Katz to investigate Fox's biggest star.It is the same firm that helped Twitter force Elon Musk to buy Twitter after he tried to back out of the $44billion acquisition. The Fox board's actions are said to have contributed to the decision by Lachlan Murdoch, CEO of Fox Corporation, and Suzanne Scott, CEO of Fox News, to fire him.In addition, there was internal concern about other messages sent by Carlson and worry over a lawsuit accusing him of presiding over a toxic work environment.Carlson's disdain for Republican presidential frontrunner Donald Trump - who he said he 'hates passionately' - were also problematic for the conservative network, and Rupert Murdoch himself was said to be tiring of Carlson's provocations, such as saying the January 6 rioters were 'tourists' and downplaying Vladimir Putin's invasion of Ukraine.",
        "Neither Carlson nor Fox have commented on the text message. "
    ]
}