{
    "articleURL": "/wires/pa/article-12047271/Driver-mowed-pedestrians-guilty-murdering-22-year-old-woman.html",
    "content": [
        "A convicted drug-dealer who deliberately drove into a crowd of pedestrians, killing a 22-year-old woman, has been found guilty of murder and attempting to cause grievous bodily harm.",
        "Stephen McHugh, who has never had a driving licence, had taken cocaine and downed six beers and ten double shots of spirits before driving his Volvo onto a footpath in Oswestry, Shropshire.A two-week trial at Stafford Crown Court was told innocent bystander Rebecca Steer was crushed underneath the vehicle near a takeaway and died of “catastrophic” injuries.",
        "McHugh, originally from Fazakerley in Liverpool but living near Oswestry at the time of the killing last October, admitted manslaughter and assault, claiming he was trying to frighten pedestrians after an earlier altercation nearby.Jurors deliberated for eight hours and 39 minutes over three days before convicting McHugh by majority 11-1 verdicts of murder and trying to wound a male pedestrian who was also knocked down.Jurors at the 28-year-old’s trial were not told that he has previous convictions related to drugs and the seizure of sawn-off shotgun in Merseyside in 2019.At the start of the hearing, prosecutor Kevin Hegarty KC said McHugh, of Artillery Road, Park Hall, near Oswestry, was driving a gold-coloured Volvo in Willow Street at about 2.45am on Sunday October 9 last year.CCTV shown to the court captured McHugh stopping in the road and exchanging words with a group of people near the Grill Out takeaway.",
        "Mr Hegarty told the court: “At that moment Rebecca Steer was crossing Willow Street.",
        "“All of a sudden, as she was crossing, the Volvo shot backwards. It narrowly missed her.”Jurors were told Ms Steer managed to get out of the way of the car and made her way to the pavement on the opposite side of Willow Street.Mr Hegarty added: “At that moment Mr McHugh turned the steering wheel in the direction of the people on the pavement and then he drove on to the pavement towards that group of people.“The driver’s side of the car went on to the kerb, on to the footpath, and he proceeded to drive through the group.“We say he used his car as a weapon – he used the power and the weight of the car to strike the group.”McHugh’s vehicle hit three people, the court heard, including two men who were “knocked aside” by the front wing.Mr Hegarty told the court: “Rebecca Steer was more towards the front of the car and as the car increased its speed – as it went through the group, she was dragged down under the car.”",
        "Before showing the jury CCTV clips from nearby business premises of the Volvo being reversed and then driven forwards into Ms Steer, Mr Hegarty said of McHugh: “He was heard speaking in an aggressive way.",
        "“You may well think the way he reversed the car, which was at speed and without regard to those around him, gives a clear insight into what he was thinking and what he intended to do.“We say that was to strike his target whoever it was. We don’t suggest Rebecca Steer was his target – she was in effect a bystander.”McHugh was arrested on Monday October 10 in Gobowen, Shropshire, and claimed he “didn’t mean to hit anyone”.Shortly before the alleged murder, the court heard, a man who was searching the boot of a car in Oswestry was left with a bloody nose by McHugh, in an incident the prosecution said showed he had previously “got involved in violence”.McHugh told the trial that he was not angry with the group and had reversed to get alongside them to pick up a friend.“I am not an angry person,” he told the jury. “I didn’t really think about it. It was a moment of stupidity.”McHugh will be sentenced by Mr Justice Andrew Baker on Friday.Commenting after McHugh was found guilty, Detective Chief Inspector Mark Bellamy, of West Mercia Police, said: “This was a horrendous attack which tragically robbed an innocent young woman of her life while she was enjoying a night-out with friends.",
        "“I’m pleased that justice has been done today for Rebecca and my thoughts remain with her family.“I pay tribute to the dignified way that they have conducted themselves throughout the trial, displaying venerable strength and resilience in listening to the contemptible and narcissistic behaviour of McHugh, who continually lied throughout the trial in a desperate attempt to escape justice.",
        "“I am grateful that the jury saw through his web of lies and convicted him on the evidence presented to them.”In a statement issued through the West Mercia force, Ms Steer’s family thanked everyone who had worked to secure justice.Their statement said: “Rebecca Adelaide Steer, Becca to us, Becky to everyone else, was a pure joy to have as a daughter/sister and we all feel lucky to have had her in our lives, but we will always feel robbed.“We all get to live a life, but through no fault of her own whatsoever, her life was taken from her by a few seconds of someone else’s stupidity.“Her 13-year-old sister Kimberley summed it up perfectly in her letter to Becca at her funeral, she said: ‘Becca was doing so well in life, and some stupid idiot stole her away from us’.“Becca was and always will be 22 in our hearts, beautiful and amazing.”"
    ]
}