{
    "articleURL": "/wires/ap/article-12044637/Scherzer-hit-hard-chased-early-return-suspension.html",
    "content": [
        "DETROIT (AP) - New York Mets ace Max Scherzer struggled in his return from a suspension Wednesday night, allowing six runs on eight hits in 3 1/3 innings against the Detroit Tigers during the second game of a doubleheader.",
        "\"I was spraying the ball, especially out of the stretch, and that´s what you expect coming off a long layoff,\" Scherzer said. \"The number one thing was getting through this start healthy, and we did that. Now we can move forward.\"Detroit won 8-1 to sweep the twinbill.Scherzer was suspended for 10 games by Major League Baseball on April 20 after getting ejected for having a foreign substance on his pitching hand during his April 19 start against the Los Angeles Dodgers.The three-time Cy Young Award winner was facing the Tigers for the third time since leaving the team after the 2014 season. In the first of those starts, he matched a major league record for a nine-inning game with 20 strikeouts during a May 2016 win in Washington. Then he fanned 14 more over eight innings in his return to Comerica Park.Scherzer walked Zach McKinstry to start the first inning - the first walk the Tigers had drawn from him since he left town. The right-hander allowed two runs in a 22-pitch inning.",
        "In the second, Scherzer retired Matt Vierling on the first pitch, but Eric Haase followed with his second homer of the doubleheader to make it 3-0. Andy Ibanez followed with a base hit, but Scherzer escaped the inning without further damage.",
        "He then received a drama-free check for sticky substances by first base umpire Adam Beck.\"It was just a normal check,\" Scherzer said.After the Tigers went down in order in the third, Akil Baddoo singled to start the fourth and Vierling followed with a long homer to left-center field. Scherzer struck out Haase, but Ibanez and McKinstry singled, bringing Mets manager Buck Showalter out of the dugout and reliever Zach Muckenhirn into the game.\"Obviously, we were hoping for a little better results, but I think his command was just off,\" Showalter said. \"That happens with pitchers. I'm sure he'll be better the next time out.\"Scherzer was given a loud ovation by Tigers fans as he walked off the field, but kept his head down.\"It is hard to enjoy something like that when you pitch badly, but I have always appreciated the support from the fans here,\" he said.Ibanez scored on Riley Greene´s single, adding another run to Scherzer´s pitching line.___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}