{
    "articleURL": "/news/article-12041599/Moment-police-officer-says-nice-meet-Just-Stop-Oil-activists-shouted-down.html",
    "content": [
        "Group has caused chaos in London by slow marching every day since April 24Video has captured the moment a cheery police officer introduced himself to Just Stop Oil protesters, telling them 'nice to meet you' - before being chanted over as he asked the climate activists to move on to the pavement.",
        "Footage emerged of the smiling Met Police officer trying to move demonstrators from the road to the pavement on London's Regent Street, where they were slow marching.The officer is seen politely asking the eco-warriors to move on to the path yesterday afternoon, telling them they were causing 'disruption' resulting in traffic 'backing up'.Footage from today, however, shows the same officer having to shout loudly over the group of climate activists as they continued to chant over him as they walked near Waterloo station. It comes as new conditions introduced on Monday, under Section 12 of the Public Order Act, means police can order activists to get on to the pavement in a bid to prevent chaos for cars and public transport. ",
        "The officer can heard yelling: 'I am imposing a section 12 public order act condition to protest on the pavement in the Borough of Westminster from now until 6pm.'",
        "The inspector's voice is drowned out by the loud activists who were holding yet another day of slow marches across the capital, calling on the Government to halt all new oil and gas consents and licences.The group can be heard repeatedly chanting in chorus: 'We demand that the UK Government immediately halts all new licences and all new consents for fossil fuels.",
        "'This means no new oil, no new gas, no new coal mines.'The protests are just two of a series that have been taking place across the capital since April 24.The slow marches have been frustrating drivers and bus passengers alike trying to get around the capital. This afternoon officers arrested 23 Just Stop Oil activists at Parliament Square for breaching the order.A statement from the force on Twitter read: 'Officers have arrested 23 Just Stop Oil protestors at Parliament Square for breach of Section 12 conditions as they continued to slow march on the road. 'They have been taken into custody at central London police stations. Roads in the area were clear as of 13.05hrs.'In recent days activists have been spotted arguing with officers over the new laws.On Bank Holiday Monday, a video posted by Just Stop Oil on its Twitter page began with a police officer telling a protester: 'A Section 12 condition has been imposed on this march under the Public Order Act by Chief Inspector Scammell.'So the condition that has been put on the march is that you have to march on the pavement.'If you don't, people that are marching on the road will be liable for arrest. That was imposed at 10.27am.'",
        "When one protester asked: 'Is the chief inspector not able to come and give it to everyone?' The officer said: 'No.' Another activist then said: 'I'm sorry, but our trust right now in the Metropolitan Police is very low, I don't know if you've heard, so I'd like the Bronze Commander to issue the Section 12.'",
        "A Section 12 order under the Public Order Act 1986 relates to 'imposing conditions on public processions'. It states:If the senior police officer, having regard to the time or place at which and the circumstances in which any public procession is being held or is intended to be held and to its route or proposed route, reasonably believes that -(a) it may result in serious public disorder, serious damage to property or serious disruption to the life of the community, or(b) the purpose of the persons organising it is the intimidation of others with a view to compelling them not to do an act they have a right to do, or to do an act they have a right not to do, he may give directions imposing on the persons organising or taking part in the procession such conditions as appear to him necessary to prevent such disorder, damage, disruption or intimidation, including conditions as to the route of the procession or prohibiting it from entering any public place specified in the directions.",
        "Another officer then said: 'Whether you've got trust or not, that doesn't really matter.'The protester replied: 'I understand, but the Bronze Commander is over there.'But the officer insisted: 'Bronze doesn't have to come and tell you that in person.'The protester said: 'But how do I know that a Section 12 has been issued?'And the officer said: 'I told you that, I just told you. I gave you the name of the inspector who's authorised it. I can give you a time of it.'When the protester said: 'Which borough is it for, what is the jurisdiction?' the officer replied: 'At the moment it's for this street.'The Public Order Act 1986 states that conditions can be imposed by police 'as to the route of the procession or prohibiting it from entering any public place specified in the directions'. ",
        "Pressed for further details, the officer added: 'The order is you can protest. But you can only protest on the sidewalk. 'If you protest in the middle of the road you are liable for arrest, that's what it is. It's been authorised at 10.27 this morning.'The video then cut to Chief Inspector Scammell turning up at the scene. He said: 'I'm Chief Inspector Scammell, OK. We've assessed your march from cameras and TfL, there's been significant disruption. 'It's reached the point where I've now put a Section 12 of the Criminal Justice and Public Order Act. Your procession must proceed on the footway.'The 1994 law quoted by Chief Inspector Scammell - Section 12 of the Criminal Justice and Public Order Act - relates to 'escort arrangements and officers' for young offenders, so he is thought to have meant to refer to Section 12 of the Public Order Act 1986, which relates to 'imposing conditions on public processions'. The Met Police have been contacted for a comment. "
    ]
}