{
    "articleURL": "/wires/ap/article-12059003/GOP-threatens-Blinken-contempt-charge-Afghanistan-docs.html",
    "content": [
        "WASHINGTON (AP) - The chairman of the House Foreign Affairs Committee has threatened to hold Secretary of State Antony Blinken in contempt of Congress if the State Department does not turn over classified cables related to the chaotic U.S. withdrawal from Afghanistan.",
        "Rep. Michael McCaul, R-Texas, on Friday pledged in a letter - obtained by The Associated Press - to escalate the ongoing battle with the State Department over a so-called dissent cable written by diplomats at the U.S. Embassy in Kabul shortly before the August 2021 withdrawal. The new deadline for the State Department to respond is Thursday.The threat is the latest in an already unprecedented effort by McCaul to force the release of sensitive documents to Congress, setting up what could become a constitutional showdown between House Republicans and the Biden administration on the ability of the legislative branch to conduct oversight.A State Department spokesperson said Monday that it was \"unfortunate\" that despite the House Foreign Affairs Committee having received a classified briefing on the dissent cable and a written summary it \"continues to pursue this unnecessary and unproductive action.\"The department would nevertheless \"continue to respond to appropriate oversight inquiries and provide Congress the information it needs to do its job while protecting the ability of State Department employees to do theirs,\" principal deputy spokesperson Vedant Patel said in a statement.The July 2021 communication in question reportedly warned Blinken about the potential fall of Kabul via a special dissent channel, which allows State Department officials to issue warnings or express contrarian views directly to senior agency officials.",
        "House Republicans have argued over the last two years that access to these documents is key to fulfilling one of their campaign promises: holding the Biden administration accountable for what went wrong as the Taliban swept to power in Afghanistan in August 2021 and the U.S. left scores of Americans and hundreds of Afghans who helped them over the years in grave danger.With the power of the gavel, McCaul has been able to elevate that criticism into aggressive congressional oversight and on a topic that has been met with bipartisan support in the past.The State Department has pushed back, saying that providing the dissent cable to the committee would threaten the integrity of the classified reporting process and the people who wrote them.The dissent channel was created in 1971, in part to address U.S. diplomats´ concerns over the Vietnam War, and the State Department has held communications closely. Nearly all such cables are classified to protect the integrity of the process and the identities of dissenting Foreign Service officers. They are not generally intended for public consumption, but some have been leaked to the press, often by their authors.At least 123 dissent channel cables have been sent since 1971, according to the National Security Archives at George Washington University. The vast majority of those have remained classified, and the State Department has long objected to efforts to force their release.",
        "As a result, over the last month, the department has worked to find alternative methods to comply with a subpoena, providing McCaul's office a briefing on the contents of the cable as well as a summary of the department's official response.But in the letter Friday, McCaul said the information the department has provided is \"insufficient to satisfy the Committee´s March 28 subpoena.\" He added that State has until Thursday to fully comply with the subpoena by providing access to the cable and unredacted material regarding the withdrawal.\"Should you fail to comply, the Committee is prepared to take the necessary steps to enforce its subpoena, including holding you in contempt of Congress and/or initiating a civil enforcement proceeding,\" McCaul wrote.A contempt of Congress charge would require a full committee vote before going to the House floor. With Republicans' slim majority in the chamber, it is possible the vote to hold Blinken in contempt could pass the chamber. The charge does not carry the force of prosecution, but it serves as a referral to the Department of Justice to consider charges.___AP Diplomatic Writer Matthew Lee contributed to this report."
    ]
}