{
    "articleURL": "/wires/reuters/article-12049019/Adam-Fox-Erik-Karlsson-Cale-Makar-finalists-Norris-Trophy.html",
    "content": [
        "Adam Fox of the New York Rangers, Erik Karlsson of the San Jose Sharks and Cale Makar of the Colorado Avalanche were named finalists on Thursday for the 2022-23 Norris Trophy, awarded to the NHL defenseman demonstrating the greatest all-round ability.",
        "Members of the Professional Hockey Writers Association voted for the award at the end of the regular season. The top three vote-getters are finalists, with the winner to be announced June 26.Karlsson, 32, became the sixth different defenseman in NHL history to record 100 points in a season. His 25 goals, 76 assists and 101 points led all blueliners, making him the first to accomplish the feat in a single season since Washington's Mike Green in 2009-10.Karlsson, who won the Norris Trophy with the Ottawa Senators in 2011-12 and 2014-15, also led all players with 21:51 of even-strength ice-time per game.Makar, the reigning Norris Trophy winner, battled through injuries to rank second among defensemen with 1.1 points per game. He totaled 66 points (17 goals, 49 assists) with a plus-16 rating in 60 games.A finalist for the third consecutive year in his fourth season, Makar, 24, was second in voting in 2020-21. He's also won the Calder Trophy as top rookie in 2019-20 and the Conn Smythe Trophy as most valuable player of the Stanley Cup playoffs in 2021-22.Fox, 25, was eighth among NHL defenseman with 72 points (12 goals, 60 assists) and a plus-28 rating in 82 games for his second consecutive 70-point season. The last Rangers defenseman to accomplish that was Brian Leetch (two times, most recently in 1995-96 and 1996-97).",
        "Fox, who won the Norris Trophy in 2020-21, tied for fourth among NHL defensemen in assists and eighth in points. Fox was the only NHL defenseman who registered 70 or more points and had a plus-25 rating or better during the season. He also tied for the most takeaways among defensemen with 88.--Field Level Media"
    ]
}