{
    "articleURL": "/wires/afp/article-12055583/Buffett-faults-US-government-handling-banking-crisis.html",
    "content": [
        "Investment tycoon Warren Buffett said Saturday that messaging from the US government over the regional banking crisis had been \"poor,\" suggesting that is why confidence has not returned among consumers.",
        "Four regional banks have been caught up in crisis since the beginning of March in the United States, three of them subsequently taken over by other institutions with the help of authorities.For two of them -- Silicon Valley Bank (SVB) and Signature Bank -- the Federal Deposit Insurance Corporation (FDIC) took the controversial decision to support their uninsured deposits, citing fears of contagion.By law, the FDIC insures up to $250,000 of customers' deposits in eligible banks, but for SVB and Signature the body insured all deposits, including those above the legal limit.Yet, despite that extraordinary step, consumers are still worried, Buffett said at a shareholder meeting of his Berkshire Hathaway holding company.\"That just shouldn't happen. The messaging has been very poor,\" said the billionaire, who continues to run his group at the age of 92.\"It's been poor by the politicians who sometimes have an interest in having it poor, it's been poor by the agencies. And I'd say it's been poor by the press.\"What happened with SVB demonstrated a government takeover completed with an expanded deposit guarantee, \"and the public is still confused,\" he said.While the emergency takeover of regional bank First Republic by the giant JPMorgan Chase on Monday seemed likely to ease anxiety about the banks, it has been a turbulent week.",
        "Several mid-sized banks were targeted on Wall Street, in particular PacWest, which fell 68 percent before recovering 82 percent in Friday's session alone.On Saturday, Berkshire Hathaway reported a monster $35.5 billion profit for the first quarter alone, largely due to strong financial markets.In the first three months of 2023, the group sold $13.2 billion worth of equities from its investment portfolio, while only buying $2.8 billion, drastically reducing its exposure to stocks.Buffett transformed Berkshire Hathaway from a small textile company bought in the mid-1960s into a gigantic conglomerate now valued at more than $700 billion."
    ]
}