{
    "articleURL": "/wires/afp/article-12043067/Blinken-says-skeptical-Moscow-claims-drone-attack.html",
    "content": [
        "US Secretary of State Antony Blinken said Wednesday he is highly skeptical of any allegations made by Russia, after Moscow claimed Kyiv had launched a drone attack on the Kremlin.",
        "\"I've seen the reports. I cannot validate them, we simply don't know,\" Blinken said at an event in Washington. \"I would take anything coming out of the Kremlin with a very large shaker of salt.\"Russia said Wednesday that two drones had targeted President Vladimir Putin's Kremlin residence overnight, describing it as a Ukrainian \"terrorist attack\" ahead of the important May 9 holiday, when Russians celebrate victory over Nazi Germany in World War II.Kyiv denied the claim, suggesting the attack was \"staged\" by Moscow.\"Ukraine has nothing to do with drone attacks on the Kremlin,\" presidential spokesman Mikhaylo Podolyak said.Blinken, at the event hosted by the Washington Post for World Press Freedom Day, reiterated calls for the release of US journalist Evan Gershkovich, who is being held in Russia on charges of espionage and whom Washington considers a hostage.Blinken said wrongful detentions of foreign citizens by Moscow only serve to further isolate it.\"Increasingly, the message is, don't come here, don't travel,\" Blinken said. \"Whoever you are, you risk being pulled off the street, thrown in jail.\"Blinken also discussed the recent embarrassing leak of top-secret US documents, which revealed Washington's unease about a coming Ukrainian counteroffensive against Russian troops as well as concerns about the nation's air defenses.",
        "Ukrainian President Volodymyr Zelensky complained in a Washington Post interview published Tuesday that his government had not been warned about the leak, calling it \"a bad story.\"Blinken said he told his Ukrainian counterpart Dmytro Kuleba at the time that \"we very much regretted the unauthorized exposure of these documents, that we took very seriously our obligations and responsibility to protect information.\"The top US diplomat also spoke positively about last week's telephone call between Chinese leader Xi Jinping and Zelensky.\"It's vitally important that China and other countries that have been seeking to advance peace hear from the victim, not just the aggressor,\" he said.At one point during Blinken's appearance, activists briefly interrupted the discussion and called for the release of WikiLeaks founder Julian Assange.The Australian activist has been imprisoned for four years in London and is awaiting an appeals hearing against an order to extradite him to the United States.The activists were promptly escorted from the room by security personnel."
    ]
}