{
    "articleURL": "/wires/reuters/article-12048923/U-S-settles-landmark-Alabama-environmental-justice-case.html",
    "content": [
        "By Andrew Hay",
        "May 4 (Reuters) - Alabama authorities discriminated against Black residents of a rural county by denying access to adequate sewage systems and fining them for sanitation problems beyond their control, according to a first-of-its kind environmental justice agreement announced on Thursday by the Biden administration.Under the deal that followed an 18-month federal probe, the Alabama Department of Public Health (ADPH) agreed to provide basic sanitation services, end exposure to raw sewage and suspend criminal penalties against Lowndes County residents who could not afford septic systems, the Justice Department said.\"Today starts a new chapter for Black residents of Lowndes County, Alabama who have endured health dangers, indignities and racial injustice for far too long,\" Assistant Attorney General Kristen Clarke of the Justice Department´s Civil Rights Division said in a statement.The federal probe found Alabama health officials knew Black Lowndes County residents were disproportionately hit by failing septic systems but took no action to stop raw sewage bubbling out of the ground into backyards, leading to health impacts like hookworm intestinal parasites.In a statement, ADPH denied conducting its sewage or infectious diseases programs in a discriminatory manner, but said it looked forward to implementing the settlement to benefit Lowndes County residents.Under Title VI of the U.S. Civil Rights Act of 1964, local governments and other entities that receive federal grants are prohibited from discriminating on the basis of race, color or national origin. The Lowndes County investigation was the first-ever Title VI environmental justice probe into a Justice Department grant recipients.",
        "Rural residents of Lowndes County are not connected to municipal sewage systems. Some have septic tanks while poorer families use stopgap measures like pipes and ditches to move wastewater.The median annual household income in Lowndes County, a predominantly Black area, between 2017 and 2021 was $32,000 compared with the national median household income of $69,021, according to U.S. Census Bureau data. (Reporting By Andrew Hay; editing by Donna Bryson and Leslie Adler)"
    ]
}