{
    "articleURL": "/news/article-12061503/Students-launch-class-action-against-James-Cook-University-Queensland-commerce-major.html",
    "content": [
        "Legal action launched against JCUStudents enrolled in major which promised accreditationLater discovered course wasn't officially recognisedDo you know more? Email tips@dailymail.com A group of students have launched legal action after they discovered the university major they studied for wasn't accredited.",
        "At least 18 students are part of a class action against James Cook University in far north Queensland over a financial advising major.The financial advising major was launched in 2019 but has been accredited for less than a year, with students saying this left them unable to get a job in the heavily-regulated finance industry.One shattered student was offered a job when he finished the course, but then lost it because the major wasn't officially recognised at the time while other classmates missed out on 'significant' employment opportunities.Aspiring financial planner Sam Boon thought he found his dream course when he  came across a promotional video for the course and immediately switched majors.It wasn't until the final months of his degree three years later that he realised he may not graduate with the accreditations promised as a financial advisor.",
        "'I'd just spent three years of study with no real opportunity at the end of it to become a financial advisor,' Mr Boon told A Current Affair.'I was quite distressed, annoyed, disheartened and sort of questioning what I was going to to do and how am I going to get through this.' Mr Boon enrolled in the course after seeing a video ad online promising it to be fully accredited for those 'interested in a career in financial advising, financial planning, investment services or in stock brokering'.",
        "'It was something I was passionate about. I did like finance and I like numbers and I like helping people,' he said.'I jumped at the opportunity and went straight into it.' Blade Stark also switched courses because he thought the new degree was a perfect fit.Even when he found out within weeks of finishing that his major wasn't accredited, he had faith that JCU would rectify and sort the issue before he graduated.'JCU is the be-all and end-all of universities up here, so I trusted JCU was going to provide the degree and give everything that was needed to give me a stepping stone to becoming a financial advisor,' Mr Stark said.",
        "Mr Stark had a job lined up which he then lost because the major wasn't officially recognised.'I ultimately lost my job because of this accreditation issue with JCU,' he said. 'I've got a couple of mates that started studying around the same time as me and now, they're a year-and-a half ahead,' he said. Another former student Lachlan Keevers says he was studying a double major in law and business in 2018 when he was approached by JCU to switch to the new course.'They released a video in every business class encouraging us to drop everything and come and do it,' he told The Guardian.",
        "'Frustrating doesn't begin to describe the experience. There's enough stress that goes with studying. I sat there every day not knowing if my degree would be worth anything.'Mr Boon launched legal action after sending 15 emails demanding answers from the university but received no response, or even an apology.The course was finally accredited in July 2022 but took a further three months for he and his classmates to get their qualifications backdated.He insists the class action isn't about the money. '(It's) for distress, disappointment, the loss of income, the opportunity to increase my salary,' Mr Boon said.'I spent two and a bit years basically not being able to start my professional year, which was needed to be a financial advisor.'",
        "Solicitor Duke Myrteza from Australian Law Partners, who's representing students involved in the class action says he's never seen a situation like it in his 30 years as a lawyer. 'Some have missed out on significant job opportunities,' Mr Myrteza told the program.'Others have suffered enormous mental anguish from them having to flail around trying to find a solution to the problem created by the university.'The course has been accredited since July last year, according to the university.'At that time, students who were enrolled in the course were provided with a seamless transition to the newly accredited program, while graduated students received an accredited degree,' JCU said in a statement to Daily Mail Australia.",
        "'The university offered all affected graduates the opportunity to obtain additional and higher qualifications at JCU's expense. 'JCU arranged for students to participate in a Graduate Diploma in Financial Planning with Deakin University. JCU met the tuition fees for students who took up this option.'Students have been offered further financial and emotional support, which some have accepted.",
        "'JCU was in regular contact with affected students and graduates throughout the accreditation process, providing them with updates on the matter.'Where JCU is in discussions with students, or the matter is before the courts, we cannot comment further about the matter.'The university was forced to slash 130 jobs in 2022 after Australian student enrolments declined by 25 per cent within five years."
    ]
}