{
    "articleURL": "/news/article-12046635/Locals-fury-library-forced-close-seagulls-blamed-causing-1-8-million-damage.html",
    "content": [
        "Repairs would have to made outside of nesting season, as seagulls are protectedAn historic Grade II listed library has been forced to close and may never reopen after rampant seagulls caused major damage to the roof and windows.",
        "Some £1.8million is needed to repair Folkestone Library, which has served the seaside community since 1877, after flocks of seabirds started nesting there.Kent County Council (KCC) chiefs closed the historic public building after it was deemed 'unsafe' for staff and customers.Significant damage to the roof, guttering and windows has been caused by the nesting gulls. While the 'current financial climate' means the council has not ruled out shutting the building permanently. Angry bookworms have taken to fundraising to try and save the valuable local asset, which they say double up as warm banks for elderly and vulnerable people through the cost-of-living crisis.",
        "A campaign states 'issue of maintenance has been known for some time - but not properly addressed'.According to a Frequently Asked Questions (FAQ) document released by KCC, a recent drone survey identified large amounts of earth, from nests, covering and blocking the parapet gutter outlets - resulting in damage and cracked downpipes.",
        "The downpipes, which follow narrow bends around the stone-facade features, are restricted - worsening existing water damage from heavy rainfall.The council says repairs to the listed building are expected to cost in the region of £1.8 million.These include the removal of birds' nests and the installation of wired bird mesh and spikes to deter seagulls, the replacement of broken or dislodged tiles, and the installation of news gulleys, cast iron downpipes and other protective fittings to guard against rain.",
        "The local authority also needs to carry out a detailed survey of the roof, and repair and refurbish the property's windows, including replacing some windows where required.But councillors have been left stumped as to how to fix the problem because seagulls are protected under the Wildlife and Countryside Act 1981, meaning repairs must be made outside of nesting season, which typically occurs between late April and July.The library was first closed in December 2022 following heavy rainfall, which flooded the building.Testing and surveys were carried out to measure the extent of the damage caused by water leaks, with damp and mould found throughout the building. This raised concerns about the safety of systems including electrics, prompting the council to keep the library closed until further notice.",
        "Some of the required repair work is highly specialised and costly due to the building's listed status.This includes fixing the water damaged parquet floor, repointing the Victorian brickwork, treating and removing mould, renewing ornate listed plaster features which have incurred serious damage due to leaks, treat and paint all the walls and woodwork, and replace all carpeted areas due to mould and damp.The council says it does not have the funds to carry out the repairs in the current financial climate so the library will remain closed until further notice.",
        "In the FAQ document, a spokesperson for KCC said: 'We have been making every effort to protect the building and repair damage where possible without having to close the library, as an important and much-loved local resource.'However, its listed status and lack of easy access, particularly to the roof, has made this difficult to do.'Unfortunately, as a result of increasing water damage, the difficult decision was taken to close the building for detailed investigations to be made.'The level of damage found has left us with no choice but to close the building for the safety of staff and customers.'The council spokesperson continued: 'Since then, we have been investigating the extent of works needed to bring the building back into use and exploring ways to fund the necessary repairs.",
        "'The work required is significant and funds are unfortunately not available in the current financial climate. This means that Folkestone Library will remain closed, at least until further notice.'We know that this is very disappointing news for library users and we are sorry that there is not a more immediate solution.'The library was designed by acclaimed architect Brightwen Binyon. Around 30 years later, the red-brick building was granted funds for an extension by Scottish-American philanthropist Andrew Carnegie.",
        "Campaigners from the New Folkestone Society civic group have expressed their disappointment at the closure.Nicolette Jones, children's book critic at the Sunday Times and Honorary Fellow of the Royal Society, said: 'Libraries are our most valuable civic asset and should never be allowed to close.'They facilitate every object councils should be pursuing, including social mobility, literacy, educational standards, community cohesion, economic growth, health and well-being, reduction in the crime rate, inclusivity, social justice, levelling up, equal opportunities.'Philosopher and author Dr Julian Baggini, who was born in the town, added: 'Without Folkestone Library, my childhood reading would have been severely restricted.'I may not have been able to become the first person in my family to go to university, and subsequently become a writer and philosopher.'And even if the library is relocated, it is short-sighted to lose a historic building forever because of short-term monetary pressures.'This is about our heritage and our future. We owe it to all those who built and have run the library and its future users to save it.'The local authority has preserved the library's most important collections - distributing some to other district libraries, with the remainder going into storage.Council bosses are also looking to apply for funding from the government's 'Libraries Improvement Fund' (LIF)."
    ]
}