{
    "articleURL": "/news/article-12057495/Texas-mall-shooter-Mauricio-Garcia-left-callers-cell-phone-bizarre-garbled-voicemail.html",
    "content": [
        "Garcia, 33, lived in a quiet Dallas neighborhood in the northeast of the city with his family before moving to a motel 15 miles away on North Stemmons FreewayHe has been identified as the gunman who killed eight at an Allen shopping mall Now dead, he didn't have any felonies, and had been working as a security guardThe suspected neo-Nazi sympathizer who killed eight and wounded seven at an Allen, Texas, shopping mall left callers to his cell phone a bizarre and garbled voicemail greeting obsessing about money, DailyMail.com can reveal. ",
        "Instead of the usual 'leave your name and number,' mall shooter Mauricio Garcia's personalized message asks his parents for money, and insists to his provider that his cell phone bill is already paid.It also includes a dig at the federal government for not providing him with enough financial aid, as well as a jab at the deceased Dallas resident's friends if they owed him money. In a prompt for female callers, the 33-year-old - who up until recently lived with his parents - insists: 'I have plenty of money.'Multiple sources identified Garcia as the Allen Outlet mall shooter Sunday, revealing that he was living in a motel and working as a security guard. He recently moved out of his parents place, which was raided overnight by feds. He also had no serious criminal record, and neighbors, when asked, said he was quiet but always acted unusual. The FBI questioned his family for hours - and new details continue to emerge about what spurred his heinous massacre.Scroll down for video: ",
        "Callers to his cell phone are met with the following: ‘Hi, this is Mauricio. If you’re the phone company I sent you the money, or if you’re my parents please send money. 'If you are my financial aid institution you didn’t lend me enough money, if you are a friend you owe me money.",
        "'And if you are a female, don’t worry, I have plenty of money.'It is not immediately clear when Garcia recorded the message, or how much of it was said in jest.What is known Garcia lived in a quiet Dallas neighborhood of single family homes in the northeast of the city with his family up until relatively recently, moving to a Budget Inn about 15 miles away, DailyMail.com can reveal. The one-star hotel is a far cry from the single-story, three-bedroom, two bath 1,331 sq foot home where he up until recently resided with his family, located on a tree lined street roughly 28 miles from the scene of Saturday's carnage.The home is worth an estimated $275,000, and no one would answer the door when knocked.However, Sunday afternoon, DailyMail.com spotted a middle-aged woman pacing anxiously in the yard talking on her cell phone. Records show a Carmen Catalan, aged 59, also lives at the address.Neighbors were more receptive in reporters' inquiries, painting a picture of a man in his thirties, who months ago still lived with his parents and often wore a security-guard uniform.",
        "A neighbor, who did not want to be identified, described Garcia as ‘appearing like a normal guy’ – but having possible mental issues.He recalled: ‘We spoke cordially in passing. He appeared to be just a normal guy. He would just leave for work and return, nothing out of the ordinary.",
        "‘His mother doesn’t speak English, but he did, like you or I would. He seemed just like a very good kid. Always polite, friendly, but perhaps a bit mentally slow - just in the way he spoke and responded. It was a distinct impression I got.'Garcia, however, hasn’t lived at the home for several months, neighbors said - instead taking up residence at the Budget Inn on North Stemmons Freeway, just a few blocks from the University of Dallas.That did not stop federal officials from showing up at the doorstep of his family's home in the northeast suburb of Piper Hill just an hour and half before the first shots rang out.'It was about 5pm, when three Dallas police squad cars and the FBI turned up,' the anonymous neighbor said.He added: 'I never heard any banging on doors or kicking down doors or anything of that nature. 'They engaged in dialogue with the family members as they were leaving - but the family didn’t go with them.'Moreover, law enforcement officials offered insight as to Garcia's character - while confiding to CBS that he had been working as a security guard prior to the massacre.A next-door neighbor of the suspect, who asked to be identified as Julie, said she told NBC News that she would regularly see Garcia going to and coming home from work every day like clockwork before he moved to the inn.",
        "'He tried to acknowledge us but seemed a little off,' she recalled. 'He wasn’t somebody you could carry a conversation with.' Garcia also apparently had several social media accounts active before the shooting, that have seeming been scrubbed amid state and federal officials' ongoing investigation.The profiles, the sources said, showed the Dallas citizen's preference for neo-Nazi and white supremacist content, as officials have still yet to release the names of his eight victims, or the condition of at least seven others injured. One of the eight victims, 20-year-old Christian LaCour, was identified Sunday by a post to relative's Facebook.A Farmersville resident who also worked as a security guard, LaCour was mourned by his grandmother Sandra Montgomery who said she was 'so proud of him'.'My beautiful grandson, Christian LaCour, was the security guard killed in the shooting at Allen Texas. He was such a beautiful soul,' she wrote. LaCour's sister’s mother-in-law also wrote: 'Words can not even begin to describe the devastation that our family feels,' she said in the post. '[There] will forever be a void.'At least one of the others killed by Garcia was a child, according to witness accounts, before he was shot dead himself at the crowded outlets sometime after 3pm. During that time, the killer fired more than 100 times, and had more ammunition and weapons in his car - but was thankfully subdued by an Allen Police Department officer who heard Garcia's initial hail of fire outside an H&amp;M store. ",
        "Dashcam footage showed Garcia pulling up to the store in a Dodge Charger, before opening fire with an AR-15-style rifle.The footage - as well as photos of the late shooter after he was subdued - showed him to be dressed in full tactical gear, with an additional handgun and multiple magazines.He was eventually killed by the unnamed police officer - who was on the scene for an unrelated call but rushed over when he heard the gunshots outside the H&amp;M. Garcia was a security guard, but it is unclear if he worked at Allen Premium Outlets - or if had any connection to them at all.On Sunday, sources told WFAA that Garcia had experience in US military, serving in the U.S. Army in 2008  before being removed over mental health concerns. A man who witnessed the outlet mall shooting firsthand, Allen resident Steven Spainhouer, recalled being one of the first people on the scene - rushing to rescue his son from a clothing store where the now-deceased gunman's attack started. ",
        "At least one of those slain, Spainhouer recalled, was a child, whom he desperately tried to save after rushing to the H&amp;M where his own son had been working. Shortly before, around 3:30pm Spainhouer received a frantic call from his son notifying him that there had been shots fired outside the shop.",
        "Driving over with the intent to save his child's life, Spainhouer explained how he got there before any first responders - and was faced with the monumental task of trying to save lives.'I never imagined in 100 years I would be thrust into the position of being the first first responder on the site to take care of people,' he told CBS News, recalling how a handful of people around him recorded videos of the bodies outside his son's H&amp;M, where the unnamed gunman's assault is believed to have began. The shooter was killed by cops elsewhere in the complex shortly thereafter, killed by an Allen cop who was on the scene for an unrelated call and heard the gunshots outside the H&amp;M.As that was going on, and prior to other officers' arrival, Spainhouer - who is trained in CPR - attempted to resuscitate multiple people struck by the gunman's initial hail of gunfire, including three he said were already beyond saving.'The first girl I walked up to was crouched down covering her head in the bushes, so I felt for a pulse, pulled her head to the side and she had no face,' he said of the first victim he came across, a young girl.Still set on saving the mess of victims, Spainhouer recalled how he then found another child, who survived the barrage of bullets by being covered by his protective mother, who he said was among eight to die by the gunman.'When I rolled the mother over, he came out,' Spainhouer said, speaking to CBS reporter JD Miles just a few hundred yards from where the carnage was seen only a few hours before.  'I asked him if he was OK and he said, \"My mom is hurt, my mom is hurt.\"'",
        "Spainhouer described how he attempted to alleviate the boy's mental anguish by taking away from the grisly scene.'Rather than traumatize him any more, I pulled him around the corner sat him down and he was covered from head to toe.'Spainhouer added: 'Like somebody poured blood on him.'Graphic video shared online showed the victims, including children, motionless on the floor of the mall.As residents continue to look for answers, mourning over those lost continues. The shooting transpired just a few weeks shy of the day marking one-year from the massacre in Uvalde, and has further enflamed debate over local and US gun laws.A vigil at an Allen church will take place Sunday evening to honor those who died, as the FBI continues to investigate the sole suspect."
    ]
}