{
    "articleURL": "/news/article-12039863/U-S-Navy-turning-drag-performer-Harpy-Daniels-digital-ambassador.html",
    "content": [
        "Yeoman 2nd Class Joshua Kelley, whose stage name is Harpy Daniels, announced he would be the Navy's first 'digital ambassador'The program was part of the Navy's efforts to 'reach a wide range of potential candidates' as it seeks to recruit more Gen Z sailorsAuthorities say the Navy is still expected to fall 8,000 short of its recruitment goals for the yearThe United States Navy has turned to a drag performer in its efforts to reach younger recruits on digital platforms and social media.",
        "Yeoman 2nd Class Joshua Kelley, whose stage name is Harpy Daniels, announced on TikTok in November that he would be the Navy's first 'digital ambassador,' highlighting his journey from performing on board beginning in 2018 and growing to become an 'advocate' for those who 'were oppressed for years in the service.'Kelley, who identifies as non-binary, was one of just five active sailors to participate as 'digital ambassadors' for the Navy in its 'efforts to reach a wide range of potential candidates,' a spokesperson told Daily Caller.None of the digital ambassadors were paid, the spokesperson said, and no promotional or recruiting materials with the ambassadors exist.The campaign is reminiscent of Bud Light's partnership with trans-star Dylan Mulvaney which led to an immediate backlash, cost billions and caused the brand's sales to plummet. The Navy's digital ambassador program has now ended, running from October 2022 through March 2023, and officials are now working to assess its effectiveness.But authorities say the Navy is still expected to fall 8,000 short of its recruitment goals for the year.",
        "Kelley said he began dressing in drag and performing in shows years before he joined the Navy, drawing on inspiration from the queens on RuPaul's Drag Race — which he started watching at the age of 16.",
        "He then first started performing on ships after a sanctioned MWR (Morale. Welfare and Recreation) lip-syncing contest in 2017, while deployed on the USS Ronald Reagan, and became a regular in the competitions, according to NBC News. The officer insists he never experienced harassment in the Navy, but when he was scheduled to perform at a diversity, equity and inclusion event at Langley Joint Air Force Base in the summer of 2022, it 'caused an uproar to many conservatives and Christian extremists.''I'm an advocate for the LGBTQ+ community, and being able to do drag is not just for me, but a tribute to many service members who were kicked out, harassed, bullied or worse for being openly gay during Don't Ask, Don't Tell,' he told the USS Constitution Museum in an interview, referencing the Clinton-era policy that discouraged military members from disclosing their sexual orientation.'It shows representation, and that is truly needed for a culture and organization that has shunned us for so long.' In announcing that he would be a digital ambassador for the Navy, Kelley wrote that his experiences in the Navy have 'brought me so much strength, courage and ambition to continue being an advocate and [representative] of queer sailors.'",
        "The Navy's decision to promote Kelley was part of its larger efforts to reach Gen Z.",
        "It ran a series of ads on social media platforms like Instagram, as well as on TV and streaming services tailored to the younger generation.The military branch even updated its Diversity, Equity and Inclusion statement, which it promoted prominently online.'Our Navy is committed to enabling a workforce demographic similar to that of the nation it serves,' the statement now reads. 'With nearly 50 percent of recruitable talent coming from diverse talent, the Navy must be deliberate to create a culture where every person, regardless of their background, has the opportunity to succeed.'Writing for the USNI journal in January, Lt. Ian Clark and PO 3rd Class Kyle Atkinson said: 'An effort is, indeed, being made to connect recruiting to the interests and concerns of Gen Z.'But only 2 percent of the youth population both meets the requirements to join the Navy and are open to serving, a spokesperson for the ad agency VMLY&amp;R told USNI News as the Navy seeks to boost its size to 347,000 officers and enlisted sailors in 2024 — up from the 341,736 current sailors.",
        "Last month, though, Vice Chief of Naval Operations Adm. Lisa Franchetti submitted written testimony to the House Armed Services Committee, saying that they are projected to miss its goal for enlisted sailors by 8,000 recruits.",
        "'We entered this fiscal year with a record low Delayed Entry Pool after exhausting all means to meet the recruiting goal in FY2022,' she wrote of a program that allows people to accept contracts with the Navy but remain on hold before shipping off to boot camp.'In FY23, we expect to miss our active duty recruiting goal 8,000 Sailors short of our 37,700 goal,' she continued. 'Additionally, we expect to finish 3,000 Sailors short of our 10,330 recruiting goal for the Navy Reserve.'We are using all available levers in FY23 to increase recruiting, while maintaining our standards.' In March, a National Independent Panel on Military Service and Readiness report suggested poor recruiting was, at least in part, a result of the military's new woke policies.It found that DEO initiatives have risked 'supplanting the US military's culture of warfighting with a new culture of DEI promotion and compliance.' "
    ]
}