{
    "articleURL": "/wires/pa/article-12056263/James-Tarkowski-I-don-t-regret-joining-Everton.html",
    "content": [
        "James Tarkowski has no regrets over his decision to join Everton last summer despite the threat of suffering a second successive relegation.",
        "Tarkowski was Frank Lampard’s first summer signing last June, joining on a free transfer from Burnley where his final campaign ended with the Clarets dropping into the Championship.Things have not gone to plan at Goodison Park – Lampard was sacked in January and Everton remain in deep trouble going into Monday’s trip to high-flying Brighton – while Burnley have bounced straight back to the Premier League, but Tarkowski insisted he would not change his decision.“My focus is completely on Everton and I don’t regret joining this club, for sure,” he said in the Liverpool Echo.Asked what lessons he could bring from his time battling the drop with Burnley, he added: “Not panicking too much and becoming too obsessed with other teams and what their results are and just trying to focus on us.“I have said it for the last few weeks really – if we do our job, we haven’t got to concern ourselves with what other teams are doing. I don’t think we should be looking at other teams hoping they will do us a favour, if it happens that way, fair enough. But we have to focus on ourselves more than anything.”",
        "After Lampard’s exit, Tarkowski found himself reunited with former Burnley boss Sean Dyche, sacked by the Clarets last April but brought in as Lampard’s replacement in January.",
        "The centre-back said: “At Burnley… he had a team with quite a small budget and were expected to go down at the start of every season. He kept them in the league and he has a history of doing that.”Everton will go into their final four fixtures without captain Seamus Coleman, who was injured in last Monday’s 2-2 draw at Leicester.The 34-year-old’s injury is not as bad as first feared but is likely to have ended his campaign prematurely, a major blow to the club at a difficult time.Even as Coleman was being carried off the pitch at the King Power, the full-back was trying to rally his team-mates.“That tells you everything about Seamus,” Tarkowski said. “When I first turned to see it I thought he was shouting at the lad who tackled him, it was only when I heard our fans start to cheer that I realised what he was actually doing.“I haven’t seen that before but it just epitomises what Seamus is like and his love for this club.“Seamus is such a good leader and a good captain, he is a great talker in the dressing room, so he will be a big miss in that aspect. That puts a bit more demand on the other lads to start talking and taking that ownership.”"
    ]
}