{
    "articleURL": "/tvshowbiz/article-12039181/MAFS-Davina-Rankin-confirms-split-husband-Jaxon-Manuel.html",
    "content": [
        "Married At First Sight star Davina Rankin has split from her husband Jaxon Manuel.",
        "She issued a statement on Tuesday confirming the break-up 'speculation' after fans noticed she had quietly unfollowed Jaxon on Instagram.The former couple, who are parents to three-year-old daughter Mila-Mae, had been married for less than a year.'Relationships are hard,' Davina wrote on Instagram alongside a photo of a beach at sunset.'Given the recent speculation, I feel like I need to confirm that Jax and I have separated.'",
        "The statement continued: 'I will at some point discuss this further, but my current focus is learning to navigate my new normal while providing a seamless and loving transition into co-parenting for our daughter.'Split rumours had been swirling for months with influencer Davina all but confirming the end of her marriage by unfollowing Jaxon on Instagram.A search of the wellness author's following list shows no sign of Jaxon's account, which is still active.",
        "The pair tied the knot in a glamorous wedding in April last year.But suspicions were raised when Jaxon abruptly stopped appearing on his wife's Instagram grid in August 2022. Four months later, in December, Davina hinted at heartbreak when she shared a cryptic post about 2022 being her year of self-discovery.'2022 has been the biggest year of spiritual and mental growth for me and for the first time in my life I can finally hear the whispers of my heart,' she wrote.",
        "'I'm in touch with my institution and I've stopped people pleasing and I'm tackling my fear of judgement head on.'This year I grew into something I could have never imagined… MYSELF.'Nevertheless, Davina insisted as recently as January they were still together, telling So Dramatic: 'We are definitely still married. Although I should probably post more photos of him.'Davina rose to fame as one of the original MAFS villains during the breakout 2018 season. She was notorious for cheating on her 'husband' Ryan Gallagher with right-wing YouTuber Dean Wells, but later blamed her actions on a bad edit."
    ]
}