{
    "articleURL": "/tvshowbiz/article-12059401/Their-parents-list-actors-guess-are.html",
    "content": [
        "They certainly have the right pedigree as they come from a big Hollywood acting dynasty.",
        "And now, Hopper Penn and Zoë Bleu Sidel are stepping into the spotlight as they were seen attending the photocall of their new movie Signs of love in Rome on Sunday.Hopper, 29, is the son of Sean Penn and Robin Wright while Zoe, 28, is the daughter of daughter of Rosanna Arquette.The actor, who takes on the role of the main character Frankie in the drama, looked casual in a sweatshirt, jeans and a baseball cap. Meanwhile Zoe, who plays a deaf girl called Jane, stood out in a silver metallic jacket and matching maxi skirt. ",
        "Signs Of Love follows Frankie as he falls in love with Jane, however in his pursuit of her he must escape the influence of his alcohol-addicted sister and life's hardships.Zoe is the daughter of 63-year-old Hollywood icon Rosanna, who has been in Desperately Seeking Susan with Madonna, The Whole Nine Yards with Bruce Willis and Pulp Fiction with John Travolta.Rosanna was also the subject of the song Rosanna by Toto. Zoe's dad is musician John Sidel.Her aunt is Patricia Arquette who won a Best Supporting Actress for Boyhood in 2014. Her top movies are True Romance in 1993 with Christian Slater, and The Act in 2019 with Joey King.She has also been in the TV series Medium. Patricia is currently on the show Severance with Adam Scott.",
        "Her uncle is David Arquette who is in the Scream movies; he used to be wed to Friends star Courteney Cox.And Zoe's grandfather is actor Lewis Arquette. He was known for playing J.D. Pickett on the television series The Waltons, on which he worked from 1978 to 1981.Zoe has acted in Battle For Terra, The Institute, The Bling Ring and Signs Of Love. She is also in this year's Bury This. ",
        "Sean Penn shares shares Hopper and daughter with ex wife Robin, they tied the knot in 1996 and later filed for divorce in 2007.Hopper previously said his favorite films Sean has made are 2008's Milk (which netted him a Best Actor Oscar) and 1985's The Falcon and the Snowman. Sean and Robin separated in April 2009 and their divorce was finalised in July 2010.In September Robin reportedly filed for divorce from her third husband Clément Giraudet after four years together.The House Of Cards actress cited irreconcilable differences as the reason for the split, it has been reported by TMZ .Robin began dating the Yves Saint Laurent executive, 37, in 2017 before getting married in a secret ceremony in France the following year.According to the publication, Robin listed the date of their split as July 31 in the divorce filing.",
        "They are both starring in Signs Of Love, along with Hopper's sister Dylan.The movie synopsis reads: 'Signs of Love takes place in the Port Richmond section of Philadelphia, a tough neighborhood where cultures mix but the law of the streets still rules. Hopper Jack Penn stars as Frankie, a young man from north Philly who dreams of a better life.'Frankie struggles to provide a normal existence for his teen nephew; Frankie just hopes they can escape the traps of petty crime and substance abuse his father has fallen into.'When Frankie meets Jane (Bleu), a deaf girl from a well-off nearby family, he suddenly sees hope for love, and a better life – but only if he can escape the predicament of the streets and the influence of his older sister (Dylan Penn)'"
    ]
}