{
    "articleURL": "/news/article-12043049/Tourism-boost-205million-heading-London-Coronation-fortnight.html",
    "content": [
        "International visitors up 75.1 per cent compared with the same period last year Estimated £20m additional revenue windfall for London from extra touristsLondon will receive a tourism boost worth over £205million during the Coronation fortnight, helped by the arrival of 30,595 more overseas visitors than last year, according to new research.",
        "The historic event has sparked a surge in bookings with international visitor numbers up 75.1 per cent compared with the same period last year, analysis from Key Data, which tracks trends in the short-term rental market, revealed today.Overall arrivals in London, including from across the UK, are 47.4 per cent higher year on year. This compares with just a 9 per cent rise in the number of people taking trips in England as a whole.The research shows that London can expect an extra 30,595 overseas visitors during the Coronation fortnight, totalling 71,378 foreign tourists. That alone has provided the capital with an additional revenue windfall worth an estimated £20m, including spending money and the cost of hotels and short-term rental accommodation.",
        "All international visitors to London will spend an estimated £67,614,561 during the first half of May, while all 192,406 tourists in the capital will shell out an estimated £205,137,727 over the same period, providing a massive lift to the hospitality and tourism industries.Nightly rates are up approximately 16 per cent year on year to £186 while there has been a 29.4 per cent improvement in occupancy. While the supply of hotel rooms will have remained relatively static, the number of short-term rentals available over the Coronation fortnight has climbed 6.5 per cent on last year to 81,818.",
        "Revenue per available room (RevPAR) — a key measure of revenue strength across the hospitality industry — is up a staggering 50.1 per cent annually. Short-term rental operators in the capital are enjoying a 59.9 per cent increase in revenue overall.Sally Henry, VP of Business Development at Key Data, said: 'Short-term rental hosts are really feeling the benefit because they're the cornerstone of London's tourism economy.'Occupancy, average daily rates and RevPAR are all up, but so are the number of properties on offer.'This speaks to how the short-term rental industry has this incredibly important flexibility built in, which the traditional hotel industry just cannot offer.'",
        "New research also shows that the US is the country outside the UK that loves the Royal Family the most.Travellers from the US have booked the highest number of flights to the UK for King Charles' Coronation weekend, followed by tourists from India (second) and Australia (third), according to trend data from Travelport, a global technology company that powers bookings for international travel suppliers.Canada and Italy also appear to share a passion for the British monarchy, ranking fourth and fifth respectively.The research also analysed the countries that registered the biggest surges in searches for flights to the UK within 24 hours of the Coronation date being announced. ",
        "The Republic of Ireland tops this ranking, with searches for UK flights up 580 per cent after May 6 was confirmed as the Coronation date.The second biggest search surge came for domestic travel within the UK (442 per cent), followed by searches from Italy (third, 355 per cent), Spain (fourth, 349 per cent) and the Netherlands (fifth, 313 per cent).The remaining top 10 countries to have booked the most UK-bound flights are Nigeria (sixth), South Korea (seventh), Germany (eighth), Thailand (ninth) and Spain (10th)."
    ]
}