{
    "articleURL": "/wires/pa/article-12054761/Aborted-coronation-flypast-good-operational-practice--says-RAF-officer.html",
    "content": [
        "A Royal Air Force (RAF) officer aboard one of the planes forced to withdraw from the coronation flypast has said the operation was “good operational practice”.",
        "The Voyager aircraft, recently used in British evacuation efforts in Sudan, announced around 1:55pm that conditions were unsuitable for flying over Buckingham Palace and the Mall due to a low cloud base.It had earlier taken off from RAF Brize Norton in Oxfordshire before holding a position over the North Sea, off the coast of Norfolk.",
        "More than 60 aircraft from the Royal Navy, British Army and RAF had been due to take part in the flypast, but only helicopters and the Red Arrows ultimately took part in the display which lasted for around two-and-a-half minutes.Squadron leader Mike Willers told the PA news agency: “We launched, we sat in the holding pattern and we did everything to leave the pattern on time for the flypast.“We formed up with the [A400M] Atlas and we were always just waiting on a weather call with the warm front that was pushing through from the south west.“Unfortunately, the weather wasn’t suitable for us to safely conduct a flypast, and ultimately we need to keep our people and assets safe, and everybody on the ground safe.”",
        "Thirty-five RAF personnel were on board the Voyager and sat at the window seats for optimal views.There was visible disappointment from many officers when the news broke, but their spirits were soon raised when the Atlas aircraft flanked the Voyager close by.",
        "Several more training exercises were carried out between the two planes before they both headed back to Brize Norton.Mr Willers continued: “It’s good operational practice for us anyway, to launch [and] go through the process, to get away on time, get in hold, be plus or minus five seconds on our timing, and for the A400 to join up and practice formation.",
        "“Operationally that’s all good stuff, and we hope for blue skies next month for the King’s birthday flypast.”Sergeant Finn Hill, a mission systems operator, said preparation for the flypast had been going on for “a good few months”, adding: “We’ve still got some good experience flying with the A400, so it’s not a complete waste of our morning.”"
    ]
}