{
    "articleURL": "/wires/aap/article-12047817/American-lessons-Australian-plant-based-meat-market.html",
    "content": [
        "Stalled sales in the United States for the plant-based meat market should serve as a warning to the Australian industry, according to an agribank analyst.",
        "Rabobank's US analyst Nick Fereday said investors had been spooked after the alternative meat market \"hit a wall\" in the US in the past few years.The executive director of food and consumer food trends for Rabobank in the US said the American market had stalled despite double digit growth previously.\"It's basically left a lot of people scratching their heads as to what's gone wrong and has the market peaked,\" he said.\"There were very high aspirations that this market would imitate or mirror the success of alternative dairy products which have 15 to 17 per cent of the overall milk market now.\"Mr Fereday said the US plant-based market had received a boost at the start of the COVID-19 pandemic when consumers were forced to seek out meat alternatives because of supply chain issues.\"Everyone had got very excited about the double digit growth we've seen in that market over the last couple of years at the start of the pandemic,\" Mr Fereday said.\"I think it's a super interesting lesson and if the industry here can honestly look at what's happening in the US and reflect upon what they're doing, it should be pause for thought within the domestic industry here,\" he told AAP during a recent visit to Sydney.",
        "The Rabobank analyst, who studies the buying habits of consumers, said the cost of living crisis continued to play a significant role.\"You're asking people often to pay more for a product which it doesn't taste like the thing you're replicating,\" he said.But the head of the alternative proteins council Jennifer Thompson said while anecdotal evidence showed the Australian market had slowed, there was no recent data to draw from.\"As the cost of living pressures continue to bite, and as plant-based meat remains more expensive than conventional meat, it's no surprise if consumers are cutting down on these products,\" she told AAP.The council head said there are huge opportunities for Australian agriculture with plant-based meat, in part because of the neighbouring Asian market.\"We know that the (global) population is projected to be close to ten billion by 2050,\" she said.\"This means that we're going to need 25 per cent more plant and animal protein by 2050 to feed that growing population.\"Australia's plant-based meat sector generated $185 million in sales in 2019 -20, up 32 per cent from the previous year, according to a 2021 report from independent think tank Food Frontier.The variety of plant-based meal products had also increased by a third, with 313 meat alternatives available in 2022.",
        "Data from the Australian Bureau of Statistics shows consumption grew by a third in the two years to 2020-21, while the Australian plant-based market is expected to be worth three billion dollars by 2030.But Ms Thompson said for Australia to fully realise the alternative protein growth opportunity, the industry needs support \"to capitalise on growing the local market, for new protein foods and ingredients, and export markets\".In December the Albanese government threw its support behind the sector when Industry Ministry Ed Husic opened a high-tech facility in Western Sydney.Harvest B produces plant-based proteins for food brands and manufacturers across Australia.A state of the industry report is due to be released in 2024."
    ]
}