{
    "articleURL": "/wires/ap/article-12039853/Judge-mulls-voting-machine-case-trial.html",
    "content": [
        "ATLANTA (AP) - Critics of Georgia's voting machines say they are unconstitutional and should be scrapped in favor of hand-marked paper ballots. State election officials dismiss their concerns as unfounded and argue that the state's voting system is safe and secure.",
        "The arguments are at the center of a long-running lawsuit challenging the Dominion Voting Systems election equipment that has been used throughout Georgia since 2020. The activists who filed the lawsuit allege that the state's voting machines produce an unverifiable record of votes and have security vulnerabilities, amounting to an unconstitutional burden on the right to vote.U.S. District Judge Amy Totenberg held a hearing Tuesday on motions filed by election officials, including Georgia Secretary of State Brad Raffensperger and members of the State Election Board, asking the judge to rule in their favor based on the facts presented without going to trial. Lawyers for the activists argued there are disagreements on the facts in the case and that the merits of the arguments need to be fully explored at trial.Totenberg had extensive questions for both sides and did not indicate when she would rule.The lawsuit predates a spate of legal challenges to Dominion voting machines filed by allies of then-President Donald Trump in Georgia and elsewhere in the wake of his 2020 election loss. Many of those lawsuits included wild and false conspiracy theories about the machines, while the activists in this case argue their claims are supported by testimony from highly respected experts and concrete evidence that they have amassed.",
        "This lawsuit was initially filed in 2017 by several individual voters and the Coalition for Good Governance, which advocates for election security and integrity. It targeted the paperless touchscreen voting machines that Georgia had been using for 15 years. It was then amended to challenge the election system the state bought in 2019, with claims that the new system has similar vulnerabilities.The Dominion touchscreen voting machines print a paper ballot with a human-readable summary and a QR code, a type of barcode, that is read by a scanner to count the votes.But the activists say voters can´t be sure that the barcode read by the scanner accurately reflects their selections. Many voters also don´t take the time to check the human-readable part, making meaningful audits impossible, they say.They argue the court could fix the problem by ordering the state to use hand-marked paper ballots tallied by scanners instead of the touchscreen machines. It would be a simple fix, they say, because that is already the emergency backup plan provided for in state law.\"All we're saying is don't use that screen,\" said Bruce Brown, an attorney for the Coalition for Good Governance.Lawyers for the election officials argue that the activists lack valid legal grounds to bring the case because they haven't identified any individual harm they have suffered as a result of the officials' actions. Furthermore, they argue, the activists' claims are without merit.",
        "The activists haven't identified a significant burden on the right to vote, and any minor burden that might exist isn't caused by state officials, attorney Carey Miller told the judge. Furthermore, he said, the state's justifications for choosing that voting system far outweigh any burden on voters.\"This case is about a remedy in search of a burden,\" he said. The activists should address their policy disagreements with the state legislature, not the courts, Miller said.Lawyers for the election officials argue that all election systems have vulnerabilities. The lawyers also said the activists have failed to offer proof that the results of any election in the state have been tampered with, manipulated or altered, and they have no evidence that the equipment has been hacked or that malware has been introduced.Experts testifying for the activists have said the system has security vulnerabilities that could be exploited by bad actors and that election officials have done nothing to address them.The fact that a computer forensics team hired by Trump allies accessed voting equipment in rural Coffee County in January 2021 and made copies of data and software \"drives a stake through the heart of the only defense they have on the merits of the case,\" said David Cross, a lawyer for some of the individual voters. The software and data were uploaded to a server and accessed by an unknown number of people, meaning bad actors can use it to plan attacks on Georgia's voting system, Cross said.",
        "Voters can verify their selections using the human-readable part of their ballots, and the state now requires audits on at least one statewide race every two years to ensure that the machine-counted outcome is correct, state lawyers argued. If the activists don't want to use the machines, they can vote absentee using a hand-marked paper ballot, the state lawyers said.That leaves Georgia voters with a choice between voting in person on machines that are vulnerable to hacking and manipulation and do not allow them to verify their votes or voting by mail on hand-marked paper ballots using a cumbersome process made riskier by uncertainties in the reliability of the postal service, lawyers for the activists told the judge."
    ]
}