{
    "articleURL": "/news/article-12038219/Judge-awards-Grenfell-survivors-150-million-global-settlement.html",
    "content": [
        "Lawyers say no amount of money can truly compensate for what happenedSettlement includes about 900 cases, with claims by eight childrenDefendants agree to put £50m towards 'restorative justice project'A judge has approved a £150 million compensation settlement for people affected by the 2017 Grenfell Tower fire which claimed the lives of 72 people.",
        "Lawyers representing Grenfell survivors, bereaved relatives and local residents said there had been a global settlement of about 900 cases.A sum of £150 million compensation has been agreed, the High Court heard on Tuesday. The judge, Senior Master Barbara Fontaine, said she approved 'overall settlement terms'.The Royal Borough of Kensington and Chelsea, the London Fire Commissioner and cladding giant Arconic were among defendants involved, lawyers said.The names of claimants did not emerge at Tuesday's hearing and no detail of individual amounts was outlined. ",
        "However, a judge approving a settlement means that the claimants will get the money.Richard Hermer KC, who represented claimants, outlined detail of the overall settlement to the judge.He said the settlement related only to civil court damages claims and would not affect the work of the public inquiry.'No amount of money will ever truly compensate for what the claimants have had to endure,' he told the judge.'This is a settlement purely of the civil claims for compensation.'He added: 'The settlement does not right the wrong, it does not secure accountability.'",
        "The judge specifically approved financial arrangements for settlements of claims made by eight children.Lawyers said the children were part of the global claim.They said a judge had to examine issues such as investment arrangements for compensation paid to children.",
        "Judges would consider arrangements for claims made by other children at further hearings, they said.Mr Hermer told the judge that, as well as agreeing compensation, defendants had agreed to put a total of about £50 million into a 'restorative justice project'.",
        "He said the Government was contributing about £25 million and Arconic about £6 million, but said that programmes that would feature in the project had yet to be finalised.News of that project had also emerged earlier this year.Arconic said then that it was among defendants who had agreed to the settlement and to the 'restorative justice project'.A spokesman said the project would 'benefit the community affected by the fire'.Lawyers said the Home Office, Ministry of Housing, Communities and Local Government, and firms involved in the construction or refurbishment of the tower block were also among the defendants.Mr Hermer said defendants had also agreed to fund an event called 'testimony week'.He said the event was planned for next year and would feature people involved in the tragedy discussing their experiences.The panel and team working on the phase two report, which examined how the tower block came to be in a condition which allowed the fire to spread, has insisted they will 'spare no effort' to finish it as soon as possible. ",
        "They said the report will be sent to the Prime Minister 'as soon as we can, but that will probably not be possible before the beginning of next year', after which Mr Sunak will decide when it will be published."
    ]
}