{
    "articleURL": "/wires/pa/article-12043889/Banging-goals-fun-Man-City--Erling-Haaland-s-stunning-campaign-far.html",
    "content": [
        "Manchester City striker Erling Haaland broke the record for most goals scored in a Premier League season with his 35th of the campaign against West Ham on Wednesday.",
        "Here, the PA news agency looks at the Norway international’s stunning season in detail.Premier League",
        "Haaland now has 35 goals in the Premier League, surging past the previous record of 34 shared by Andy Cole and Alan Shearer in 42-game campaigns early in the Premier League era.He scored in seven straight league games from August to October – his third to his ninth appearances in the competition – with hat-tricks against Crystal Palace, Nottingham Forest and Manchester United helping him to 13 goals in those games and 18 in a 10-match scoring run in all competitions.A fourth treble against Wolves in January left him one behind Shearer’s record of five in a season while he also has five doubles – against West Ham, Brighton, Leeds, Southampton and Leicester – and has scored in 22 of his 31 appearances.Champions League",
        "Haaland arrived in Manchester with 23 Champions League goals to his name in 19 appearances for RB Salzburg and Borussia Dortmund, and has more than maintained that form.He netted group-stage doubles against Sevilla and FC Copenhagen, either side of a goal against Dortmund, and Pep Guardiola could afford to largely rest his star man for the return fixtures save for a scoreless first-half run-out on his old stomping ground in Germany.",
        "He was quiet in a drawn first leg against RB Leipzig but more than made up for it in the return fixture, equalling the competition record of five goals in a game as City won 7-0 and 8-1 on aggregate.Goals in both legs against Bayern Munich took him to a dozen for the European season, with an outside chance of threatening Cristiano Ronaldo’s record 17 for Real Madrid in 2013-14.Domestic cupsHaaland’s first FA Cup goals came with a hat-trick in the 6-0 quarter-final win over Burnley, having sat out the clash with Chelsea and not scored against Arsenal.He was shut out by Liverpool in the Community Shield – as well as in both league meetings – but scored against them in the Carabao Cup.Dixie land?",
        "There are a maximum of nine games remaining for City this season – five in the league, a Champions League semi-final over two legs and a possible final, and an FA Cup final.With Haaland scoring more than a goal a game to this point, if he keeps up his season-long rate and plays every possible match, he could hit an astonishing 63 goals and match former Everton striker Dixie Dean’s all-time record for an English season in 1927-28.His recent hot streak, even by his standards, raises the prospect of even more.",
        "Haaland has scored 18 goals in his last 11 games, including the Leipzig and Burnley games and league doubles against Southampton and Leicester."
    ]
}