{
    "articleURL": "/wires/ap/article-12050139/Adidas-breakup-rapper-Ye-lost-Yeezy-sales-hit-earnings.html",
    "content": [
        "FRANKFURT, Germany (AP) - It's been nearly seven months since Adidas split with the rapper formerly known as Kanye West, and boxes of his popular Yeezy shoes are still piled up in warehouses.",
        "The fate of 1.2 billion euros ($1.3 billion) worth of unsold Yeezy stock is weighing on the German sportswear company as it tries to engineer a turnaround from the loss of the lucrative sneaker line and the continued fallout over its former ties to Ye.Adidas is \"getting closer and closer to making a decision\" on what to do with the sneakers and the \"options are narrowing,\" new CEO Bjorn Gulden said in a conference call Friday after reporting 400 million euros ($441 million) in lost sales at the start of the year.But with \"so many interested parties\" involved in the discussions, no decision had yet been reached, he said.Adidas is stuck with stacks of its flagship Yeezy brand shoes after ending its relationship with Ye in October over his antisemitic and other offensive comments on social media and in interviews.Gulden, who became CEO in January after the Ye split, declined to say if destroying the shoes had been ruled out but that the company was \"trying to avoid that.\"",
        "He has previously said other options have drawbacks: selling the sneakers would mean paying royalties to Ye, restitching them to remove the brand identification would be dishonest, and giving them away to people in need could lead to resale because of their high market value.",
        "Gulden would not say how many pairs of Yeezy shoes that Adidas is stuck holding \"because then the consumer would know how many we have and that could have an impact on demand.\"Losing the Yeezy brand is \"of course hurting us,\" Gulden said in a statement. The breakup will reduce earnings by 500 million euros this year if Adidas decides not to sell the remaining Yeezy stock, the Herzogenaurach-based company said.Net sales declined 1% in the first quarter, to 5.27 billion euros, and would have risen 9% with the Yeezy line, the company said. It reported a net loss of 24 million euros, a plunge from a profit of 310 million euros in the same period a year ago.Operating profit, which excludes some items like taxes, was down to 60 million euros from 437 million euros a year earlier.Gulden said the results for the Adidas were \"a little better than we had expected\" as the company seeks to restart growth and move beyond the breakup with Ye. He called 2023 \"a year of transition\" on the way to \"a better ´24 and a good ´25.\"The company faces other problems tied to the rapper. Investors sued Adidas a week ago in the U.S., alleging the company knew about Ye's offensive remarks and harmful behavior years before the split and failed to take precautionary measures to limit financial losses.",
        "The lawsuit - representing people who bought Adidas securities between May 3, 2018, and February 21, 2023 - pointed to 2018 comments where Ye suggested slavery was a \"choice\" and reports of Ye making antisemitic statements in front of Adidas staff.The company said last week that it rejected \"these unfounded claims and will take all necessary measures to vigorously defend ourselves against them.\"Ending the Ye partnership also cost Adidas 600 million euros in lost sales in the last three months of 2022, helping drive the company to a net loss of 513 million euros.An operating loss of 700 million euros is possible this year, Adidas said, mostly due to the 500 million-euro hit it would take if it doesn't sell the existing Yeezy shoes."
    ]
}