{
    "articleURL": "/news/article-12060643/Tennessee-high-school-student-pepper-sprays-teacher-confiscated-phone.html",
    "content": [
        "The female student can be seen spraying the male teacher in the face before he falls to his knees in the hallway  She then says 'give me my phone' before trying to take it from his hand after the assault at Antioch High School outside of Nashville Reports indicate the teacher had taken the student's phone because she was 'texting and Googling answers for her school work'Do you know this  student? Contact harriet.alexander@mailonline.comThis is the shocking moment a Tennessee high school student pepper-sprayed her teacher twice after he confiscated her phone from her during class. ",
        "The female student can be seen nonchalantly following her male teacher as he fled the classroom after being assaulted a first time - only to spray him in the face, demanding: 'Give me my phone.' Other students laughed and joked as the teacher yelled out and sank to his knees, before the student tried unsuccessfully to take her phone from his hand. The person behind the camera can be heard yelling 'mace is crazy'. According to the person who posted the video to Reddit, the student at Antioch High School in Nashville had been 'texting and Googling answers for her school work.' The user who posted the video claims the same teacher was also previously punched in the face by a student at the school two months ago.  ",
        "At several points during the attack, other employees attempted to help out as the girl repeatedly told the teacher to give her back her phone. 'She just pepper-sprayed me,' the teacher yelled while speaking to another educator just seconds before she sprayed him again. As she went to grab her device, he pulled his arm back, prompting her to raise the mace and spray him again. Another adult stepped in and told the girl to back up, even as she continued to yell out, 'can I get my phone' and 'I need my phone.' ",
        "A bystander off-camera at one point can be heard saying, 'Over a phone? This s**t is crazy.' The other teacher from a neighboring classroom told the girl she cannot have her phone back as the pepper-sprayed teacher attempted to recover. The video ended with one teacher coughing as others intervened. DailyMail.com reached out to the school district to see if the female student has faced any disciplinary actions or repercussions but did not hear back.  ",
        "According to the Reddit user, the same teacher was punched in the face by a different student just two months ago. In that incident, the teacher had also confiscated a phone from a student. The user claimed that student was cheating on a test. The shocking video sparked an emotional reaction online with hundreds of people across social-media platforms responding to the assault. 'The sad part is all the other kids just laugh likes it's a joke,' responded one Reddit user. 'It should be easier to suspend or expel students with cause. Make sh**** parents take the brunt of their inaction,' another added. 'The kid laughing because the teacher got pepper sprayed is also trash.''At what point in time do teachers get to sue for school districts not providing safe working conditions for their workers?' one chimed in. ",
        "'She should be charged with assault and expelled,' another wrote. It's unclear if the teenager has been arrested or charged in this incident.  "
    ]
}