{
    "articleURL": "/wires/pa/article-12054391/King-Queen-receive-royal-salute-three-cheers-Buckingham-Palace-garden.html",
    "content": [
        "The King and Queen were given a thunderous three cheers as they took the royal salute in the Buckingham Palace garden on their return from the coronation ceremony.",
        "Standing before around 4,000 troops, the royal couple, wearing their crowns and dressed in full regalia, took shelter from a light drizzle under a white canopy on the palace’s west terrace.Prince George, still playing his role as a page of honour, helped to hold the train of his grandfather’s trailing robes.The salute was given by the United Kingdom and Commonwealth Armed Forces who had been on parade and guided the King and Queen back to the palace from Westminster Abbey.The largest military ceremonial procession since the last coronation, it took around half an hour for all troops to get into position on the lawn.",
        "The Massed Bands of His Majesty’s Armed Forces played the national anthem, before Garrison Sergeant Major, Warrant Officer (Class 1) Vern Stokes ordered the troops to remove their headdresses.Once the gathering of thousands had all removed their headwear in unison, Sergeant Major Stokes asked for “three cheers” for the King and Queen.The shouts of hooray rang out loudly around the garden, as some members of the family including Princess Beatrice’s husband Edoardo Mapelli Mozzi and Zara Tindall’s husband Mike looked on from a nearby palace balcony.",
        "The King gave a wave of appreciation to the troops after the cheers.The Massed Pipes and Drums – featuring regiments including The Royal Scots Dragoon Guards, The Queen’s Gurkha Engineers and 1st Battalion, Irish Guards, played a series of music while in the garden, including The Bonnie Lass O’Fyvie and a specially composed piece of music for the coronation entitled King Charles III.",
        "Performing in the garden as part of the Pipes and Drums of 4th Battalion, The Royal Regiment of Scotland was Pipe Major Peter Grant.He is the only piper in the armed forces to have played at the coronation, the funerals of Queen Elizabeth II and her husband Prince Philip, the Platinum Jubilee and Charles’s first state banquet at Buckingham Palace."
    ]
}