{
    "articleURL": "/wires/ap/article-12057377/Schwarber-Walker-lead-Phils-Boston-6-1-stop-skid-6.html",
    "content": [
        "PHILADELPHIA (AP) - Kyle Schwarber homered after being dropped from leadoff to fifth in the batting order, and the Philadelphia Phillies stopped a six-game skid with a 6-1 victory over the Red Sox on Sunday that ended Boston's eight-game winning streak.",
        "J.T. Realmuto singled twice and drove in two runs for the defending NL champions who won for the first time since Bryce Harper´s return to the lineup on Tuesday. Harper, playing in his fifth game after Tommy John surgery on his right elbow, is batting .368 (7 for 19) with one RBI after going 1 for 3 with a single, walk and two runs.\"I thought we played extremely well in all phases,\" Phillies manager Rob Thomson said. \"You go into an off day with a win and break a losing streak. It feels really good.\"Triston Casas homered for the Red Sox.Taijuan Walker (3-2) rebounded from two consecutive shaky outings, allowing one run and three hits in six innings with six strikeouts and no walks.\"I was nibbling too much instead of being aggressive in the zone,\" Walker said. \"The goal today was not to walk anyone.\"",
        "Schwarber, in a 1-for-30 slump, was replaced by Bryson Stott in the leadoff spot, with Thomson saying his aim was \"jumpstarting\" both players.\"It worked out,\" Thomson said.Stott, in a 1-for-14 slide coming in, singled leading off the fourth. Trea Turner singled, Harper walked. Nick Castellanos hit a go-ahead grounder off Tanner Houck (3-2) and Schwarber laced an RBI single to right.",
        "\"He feels comfortable in the five-hole,\" Thomson joked afterward.The manager has been repeatedly asked about moving Schwarber as his struggles have mounted though he pointed to Schwarber's and the Phillies' success last season as a reason to keep the slugger on top. Thomson said the lineup would remain the same as Sunday \"for a little bit.\"Casas homered in the fifth, and Schwarber hit a two-run shot into the second deck in right field off Richard Bleier for a 4-1 lead in the sixth. It was the eighth homer for Schwarber, who led the NL with 46 drives last season.\"He wanted it in and it stayed over the plate,\" Red Sox manager Alex Cora said of the pitch. \"That is what Kyle does.\"Houck gave up three runs and five hits in 5 2/3.\"Overall, a good outing,\" Cora said. \"He limited the damage.\"Matt Strahm didn't allow a run in the final two innings for his first save of the season and fifth of his big-league career. The lefty made six starts this year but has been reverted to a bullpen role with the impending return of left-hander Ranger Suárez.STILL STREAKING, PART IBoston´s Masataka Yoshida extended his hitting streak to 16 straight games with a first-inning single. He also singled in the seventh. Yoshida is batting .438 with five homers and five doubles during the streak.",
        "STILL STREAKING, PART IICasas made it 18 consecutive games reaching base with his fifth-inning homer.TRAINER´S ROOMRed Sox: Placed INF Christian Arroyo (right hamstring strain) on the 10-day IL and recalled INF Bobby Dalbec from Triple-A Worcester. Dalbec struck out swinging pinch-hitting in the eighth inning.Phillies: Suárez (left forearm strain) threw 48 pitches over five innings in a rehab start with Triple-A Lehigh Valley on Sunday. Suárez allowed one run on four hits with three strikeouts and no walks. He is slated to rejoin the Phillies on their upcoming trip to Colorado, which begins on Friday, and return to the rotation for the first time in 2023.UP NEXTRed Sox: Boston starts a two-game series at Atlanta on Tuesday night. Red Sox RHP Nick Pivetta (2-2, 4.99) faces Braves RHP Charlie Morton (3-3, 3.38).Phillies: RHP Aaron Nola (2-2, 4.64) opposes Blue Jays RHP Alex Manoah (1-2, 4.71) for the start of a two-game series on Tuesday night in Philadelphia.___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}