{
    "articleURL": "/wires/pa/article-12060197/Neil-Warnock-signs-Huddersfield-boss-victory-relegated-Reading.html",
    "content": [
        "Neil Warnock celebrated his final game as Huddersfield boss with a 2-0 Sky Bet Championship victory over already relegated Reading.",
        "Prospective new American owner Kevin M Nagle was in attendance at the John Smith’s Stadium as the Terriers claimed a seventh win of 74-year-old Warnock’s 15-match ‘great escape’ reign.Superb second-half strikes from Josh Koroma and substitute Joseph Hungbo ensured Warnock’s latest management swansong ended on a high, boosting the 18th-placed Yorkshire side’s final points tally to 53.But after the emotion of last Thursday’s second-tier status-saving 1-0 win over Sheffield United, Town’s final success of a rollercoaster campaign was less memorable.‘One more year’, pleaded Huddersfield fans. But Warnock insisted he would not be changing his decision, writing in his programme notes: “After today’s game, I’ll go back to looking on at Huddersfield from afar with some special, special memories.”Without that victory against the Premier League-bound Blades, this fixture threatened to be a tense affair, with Reading in with a chance of staying up.",
        "Instead, the Berkshire side already knew their fate, a six-point deduction and a 13-match winless run contributing to their drop into League One.Their team may have been relegated but Royals fans had not lost their sense of humour, with a rendition of ‘Que sera sera, we’re going to Shrewsbury’ – a nod to one of next season’s fixtures – drawing applause from their home counterparts.",
        "That joviality nearly turned into genuine celebration, but Cesare Casadei’s header – following Sean Long’s deflected shot – hit the post, while Junior Hoilett also tried his luck with a curling right-footed effort.Reading’s 20-year-old debutant goalkeeper Coniah Boyce-Clarke registered his first useful save from Josh Ruffels’ header.Boyce-Clarke then reacted well to block a Jordan Rhodes shot at the expense of a corner after slack play by former Huddersfield defender Naby Sarr.The Jamaica Under-20 international safely gathered Koroma’s first attempt of the second half before conceding the opener to the same player in the 49th minute.Boyce-Clarke’s clearance hit Brahima Diarra, who laid the ball back for Koroma to convert his ninth goal of the season.Koroma’s next effort struck Tom Holmes in the face, with the Royals defender able to continue after treatment.A goal-line Sarr clearance prevented Jack Rudoni doubling Town’s advantage, but the visitors hardly carried a threat in retaliation and the hosts made the game safe six minutes from time.On-loan Watford winger Hungbo, having received the ball on the right edge of the Reading box, curled in a superb left-footed shot for his fourth Terriers goal."
    ]
}