{
    "articleURL": "/wires/ap/article-12045839/US-joins-UN-suspending-food-aid-Ethiopias-Tigray.html",
    "content": [
        "ADDIS ABABA, Ethiopia (AP) - The United States Agency for International Development suspended all food assistance to the northern Ethiopian region of Tigray \"until further notice\" while it investigates the theft of humanitarian supplies. The U.N. confirmed earlier reports that it was doing the same.",
        "USAID Administrator Samantha Power said Wednesday that her agency \"uncovered that food aid, intended for the people of Tigray suffering under famine-like conditions, was being diverted and sold on the local market.\"After discovering food was missing, the agency alerted its inspector general, who launched an investigation.\"Following this review, USAID determined, in coordination with the U.S. Embassy in Addis Ababa and our implementing partners, that a temporary pause in food aid was the best course of action,\" Power said in a statement.She added that USAID has raised its concerns with Ethiopia´s federal government and Tigray authorities.Nearly all of Tigray´s 6 million people rely on food aid, after two years of civil war and government-imposed restrictions on humanitarian relief pushed parts of the region to the brink of famine.",
        "The war ended in November with a cease-fire, which also saw aid deliveries resume.Power told the Senate Foreign Relations Committee on April 26 that the food theft appeared to involve \"collusion between parties of both sides of the conflict.\"She did not elaborate on who might be responsible, saying the agency´s investigation was still underway.Power told the Senate committee that the theft reflected a \"systemic failure\" by her agency and that much of aid involved was retrieved.\"We know we owe you ample not only accounting for what has happened but also some institution of additional safeguards,\" she said.",
        "The theft appeared to have taken place between November and February, after the fighting in Tigray eased, Power said. USAID´s disaster response team was unable to gain access to the region at the time, preventing it from providing oversight, she said.Last month, The Associated Press reported that the food taken from a warehouse in the Tigray city of Sheraro was enough to feed 100,000 people.The U.N.'s World Food Program in Ethiopia told its partners on April 20 that it had suspended deliveries to Tigray. Late Wednesday, the U.N. agency confirmed the suspension, which was first reported by the AP.The World Food Program said its relief efforts in Tigray \"will not resume until WFP can ensure that vital aid will reach its intended recipients.\"Getachew Reda, the interim president of Tigray, said he had formed a task force \"to prevent and investigate crimes committed in relation to humanitarian aid and enforce the supremacy of the law.\"He called the diversions of aid \"a double injustice and crime that is being done to children, elderly and disabled (people) who are suffering from starvation and sickness.\"The U.S. is the biggest single humanitarian donor to Ethiopia, providing $1.8 billion in humanitarian assistance to the country in the 2022 fiscal year, according to USAID.",
        "In addition to civil conflict, the country is also struggling with a prolonged drought.___Associated Press writer Ellen Knickmeyer in Washington, D.C., contributed to this report."
    ]
}