{
    "articleURL": "/tvshowbiz/article-12057157/Mae-Muller-arrives-opening-ceremony-67th-annual-Eurovision-Song-Contest-Liverpool.html",
    "content": [
        "Mae Muller seemed in high spirits as she stepped onto the red carpet at the opening ceremony of the 67th annual Eurovision Song Contest in Liverpool on Sunday. ",
        "The singer, who is representing the UK in the competition, looked incredible in a lilac number as she posed up a storm. She danced around showcasing her slim frame in the figure hugging midi dress which boasted a draping piece of material to the floor and a hood. The artist added inches to her frame in a pair of silver heels and flashed a bold dazzling bold manicure. Mae styled her long dark tresses in two neat Dutch braids from a centre parting and opted for a natural palette of makeup. ",
        "The beauty waved to Eurovision fans who lined the street and posed for selfies.Hosted by Olympian Sam Quek and Ukrainian presenter Timur Miroshnychenko, Sunday's party saw the 37 acts take to the carpet for a welcome to the city outside St George's Hall.Among the artists set to perform for a crowd of almost 30,000 is band Frankie Goes to Hollywood, who will reunite after their split in 1987.Other acts with a Liverpool connection on the line-up include girl group Atomic Kitten, funk band The Real Thing, and The Lightning Seeds - singers of the football anthem Three Lions.Natasha Hamilton and Liz McLarnon from Atomic Kitten dressed to impress for the evening as they dazzled in a colourful sequin cardigan and a stylish green suit. ",
        "Meanwhile The Vivienne made sure all eyes were on her on the red carpet as she posed in a figure hugging purple velour jumpsuit. ",
        "Jennifer Ellison turned heads as she went braless in a very racy skintight cut out jumpsuit which boasted velvet sleeves. Former Eurovision winners Conchita Wurst, who represented Austria in 2014, and Ukraine's Jamala, who competed in 2016, are also on the line-up for the gig, presented by AJ Odudu and Joel Dommett.Eurovision preparations are in full swing in Liverpool, which is hosting the contest instead of Ukraine because of the Russian invasion.The Eurovision Village, at the city's Pier Head, opened on Friday with a performance from last year's winners Kalush Orchestra and Scissor Sisters' Jake Shears performed there on Saturday after a screening of the coronation.The first Eurovision semi-final will take place on Tuesday.Favourites for the contest include the UK's Mae Muller, France's La Zarra and Spain's Blanca Paloma.Muller has said her training for Eurovision has been 'like bootcamp' as she reflected on the challenges of being an up-and-coming artist in the music industry. ",
        "The 25-year-old singer will represent the UK at the song contest in Liverpool in the grand final on May 13 with her track I Wrote A Song, which features tongue-in-cheek lyrics about a cheating ex-boyfriend and a propulsive dance beat. ",
        "In an interview with The Sunday Times, Muller admitted she is keen to do well in the competition but that it has been 'non-stop for two months', describing it as 'like boot camp'. The London-born singer was confirmed as the UK's Eurovision act in early March and has since been at a number of Eurovision events ahead of the big day including meeting the King and Queen. Muller joined the royal couple when they unveiled the contest's spectacular stage in Liverpool, with Charles telling her: 'We will be watching you with great interest - egging you on.' She also has pressure following in the footsteps of Sam Ryder who came in second place last year with his uplifting pop song Space Man, giving the UK its best result for more than 20 years. "
    ]
}