{
    "articleURL": "/debate/article-12043931/Stop-nurses-strikes-against-stand-writes-CARMELAH-JACOBS.html",
    "content": [
        "Nursing is the ultimate vocational career. None of us came into this difficult and demanding job to fight political battles. We do it because we want to help our patients: we care passionately about looking after them.",
        "Yet industrial action by NHS staff, including nurses, is putting lives at risk. It is doing untold damage to vulnerable people and creating huge anxiety for families.It is destroying the goodwill built up by generations of NHS workers. And it is making already exhausting jobs even more difficult.StressDuring a 28-hour strike on Sunday evening, some nurses walked out of A&amp;E, cancer and intensive care wards.How they could bring themselves to do such a thing, I will never know. I cannot believe that this is what more than a tiny minority of my colleagues ever wished for.",
        "As the deputy in charge of a busy outpatients' department at a hospital in the North-West of England, I see first-hand every day just how much stress the strikes are causing.Our department is undermanned, suffering from waves of staff sickness that mean nurses are constantly being redeployed to provide essential cover.",
        "I'm working extra hours on a weekly basis to make sure services do not falter.Sometimes this means I'm unable to pick up my children from school. Every night I go to bed with my brain churning, and often wake in the early hours with a start, suddenly remembering another job to do the next day.There is a solid pay deal on the table to end these needless strikes - and restore some semblance of normality to departments like mine across the country.",
        "And yet a handful of union leaders are refusing to see sense. For patients and NHS staff alike, this is both cruel and unnecessary.This week, representatives from 14 unions representing more than a million NHS workers agreed a new deal: a 5 per cent rise, plus a one-off bonus of up to £3,789.The offer had first been proposed in March - so this partial resolution to the pay dispute could have come much sooner.The offer is more than most public sector workers can expect, and it would make a very welcome difference to nurses and their families when the cost of living is rising.The extra money could start hitting their bank accounts as early as June.Yet despite this, a few unions are continuing to pressure their members, many of whom have consistently voted against industrial action.Only one of these, Unite, has a strike mandate - and only in relatively limited form.But the Royal College of Nursing (RCN) has not only rejected the Government's offer, it has warned that it will continue to pursue strike action.HardshipI'm a member of the RCN - but I voted against the strikes. Today I want to beg my union organisers: please stop doing this. It goes against everything we nurses represent.",
        "Visit my hospital and you will see for yourselves the turmoil these strikes are causing. Our hospital has a wide catchment area. Getting here from 30 or 40 miles away is difficult, tiring and costly. It's not unusual to see patients who have no option but to take an expensive taxi.Do the RCN organisers understand how serious this is for the poorest people - those most in need?",
        "They can't just dip into their savings accounts to pay for long-distance journeys.Some will face weeks of hardship, perhaps living with the lights and the heating off, or eating from food banks, simply in order to attend an appointment.When they do get here, many are in pain. To be told that their appointment has been postponed at the last minute thanks to strikes - and that their complaint will not be resolved any time soon - is deeply upsetting for them and all of us involved in their care.Most patients bear the news stoically. Some become angry and frustrated - and I understand why.They know it's not the fault of individual nurses, but too often we are the ones delivering bad news, saying: 'We're really sorry but there's nobody available to see you today.'This causes terrible stress. A lot of our patients are elderly, of course, and some will have dementia, which makes it even harder for them to understand why the system seems to have stopped caring for them.",
        "Often, they have paid taxes and national insurance for decades, but have barely used the NHS in the confident belief that this safety net would be there for them when they needed it.Now that time has come - and the net has gaping holes in it. It's nothing short of shameful.Across the NHS, delays and waiting lists are already running at record highs in the aftermath of the pandemic. We've barely begun to make up the shortfalls. Strikes are making it so much worse.",
        "Of course, most hospitals are doing everything they can to reschedule appointments, but the awful truth is that some people are likely to be in pain for longer because of the industrial action.Others will have to wait longer for diagnoses and treatment. And across the country, with more than half a million appointments and operations cancelled, it's possible that some people will die as a direct result of these strikes.",
        "Most nurses know this and are deeply concerned by it.Yet the strikes risk painting nurses as unsympathetic, heartless and greedy, which is manifestly unfair.Quite simply, most nurses want to do their jobs - it is the unions that are making it harder for them.The RCN must think again. If its activists insist on negotiating for better conditions for nurses, let them continue to do so while nurses are back at work tending to patients. This crisis has to come to an end.",
        "SufferedTwenty years ago, I followed my mother into the nursing profession, and I've striven all my working life to live up to her standards. I know that many of my colleagues have similar stories.For me, it's especially personal, because my inspirational mother died last year, surrounded by the best nursing care possible. I'll always be grateful for the tender support I was shown.The thought that other people might have to go through what my family suffered, but will be denied that care because of the strikes, is unbearable.I'm not alone. Dr Peter Carter, the former leader of the RCN, says he has been bombarded with messages from nurses who are furious at the strikes.The outpouring of love and support for NHS staff during the pandemic makes it clear that Britain backs its nurses to the hilt.Strikes are a terrible response to that support. There must be a better way."
    ]
}