{
    "articleURL": "/femail/article-12051175/An-expert-reveals-worst-items-flush-toilet.html",
    "content": [
        "An expert warns to avoid flushing items that are not dissolvable in waterREAD MORE: Are YOU hanging your toilet paper the CORRECT way? Even if you don't make a habit of it, you might think there's no harm in flushing the occasional baby wipe or even leftover food down the toilet.",
        "But these actions could be causing irreparable damage to your plumbing. Now, an expert has named the worst items to flush down the bowl, as well as the reasons why. Speaking to the Express, expert plumber Sean Richardson said that even objects labelled as 'flushable' can cause serious blockages to your toilet pipes. This can can lead to repairs costing hundreds of pounds, so it pays to know the worst offenders. ",
        "Baby wipes Richardson said: 'Although many baby wipes are labelled as flushable, they do not break down like toilet paper. They could also clog your pipes, leaving you with an overflowing system.'Although it may be tempting, he added that flushing baby wipes could land you a bill within the region of £50 to £200 if you end up with a blockage. So it's probably best adding a few extra seconds to make it to the bin.Female hygiene products Feminine hygiene products are next on the list, with pads, tampons and other personal care items being known to clump together to form a solid mass.The build up then acts as a barrier preventing water, toilet paper and other  substances from flowing downstream. He explained that a variety of feminine hygiene products have been designed to expand when they come into contact with moisture, therefore they do not break down in water.",
        "When flushed, these items can get caught in your toilet pipe along with other objects, creating an even bigger mass, thus leading to a blockage.Dental floss This dental tool may appear innocent on the surface, but it's another one to watch if you intend to keep your toilet pristine.Just flushing this item down the toilet once can lead to severe blockage, warns the expert.Like other items mentioned on the list, dental floss doesn't break down in water so once it hits the toilet bowl, it's staying there for good.Dental string can even wrap itself around other litter in your toilet pipe, like hair, wipes and toilet paper, which also creates a large lump of waste.HairHair is as big a monster as dental floss, or possibly much worse, when it comes to clogging up our toilets.Both objects work in a similar way by wrapping around other bits of debris and creating massive congestion.Hair can get caught in the trapway, which is the curved part of the toilet that connects to the drainpipe, creating a blockage so that water can't pass through.  Flushed hair can also accumulate in your sewer system and cause your toilet to overflow.Paper towels and tissues Next up on the list are two pesky little items belonging to the toilet paper family, but Richardson advises that we avoid flushing them.",
        "He explains that they don't break down like tissue does as they are thicker and won't break down in size.In addition, paper towels absorb more water than tissues, leading them to expand in size, thereofe making them difficult to pass through the pipes. Plasters The general theme is to avoid flushing anything down your toilet that is not designed to dissolve in water.Plasters too can become tangled with other waste as they contain adhesives or other substances that contribute to the build up of fats, oil and grease in the sewer system."
    ]
}