{
    "articleURL": "/wires/ap/article-12059979/Judge-Wisconsin-fake-electors-complaint-reheard.html",
    "content": [
        "MADISON, Wis. (AP) - A Wisconsin judge said Monday he will order that the state elections commission reconsider a complaint filed against fake Republican electors who attempted in 2020 to cast the state's electoral ballots for former President Donald Trump.",
        "But this time, Dane County Circuit Judge Frank Remington said, the commission must consider the complaint without the participation of one of its six commissioners who was also one of the fake electors.The Wisconsin Elections Commission, Republican commissioner Robert Spindell and those who brought the lawsuit ultimately all agreed that the complaint should be heard again without Spindell's participation.Given that agreement, Remington said during oral arguments on Monday that he would write a written order as soon as next week to vacate the commission's unanimous rejection in March 2022 of the complaint against the fake electors and to require it to consider it again without Spindell.\"Surprise, surprise, I'm coming to the same conclusion, as all the parties have, that the appropriate remedy is to vacate the decision of the WEC and remand it back for further proceedings, which don´t include Commissioner Spindell,\" Remington said.Spindell is one of three Republican members of the commission that also has three Democratic members. It oversees elections in Wisconsin.",
        "Madison-based liberal law firm Law Forward filed a complaint with the Wisconsin Elections Commission in 2021 alleging that Republicans illegally posed as Wisconsin electors in an attempt to convince the U.S. Congress to declare that Trump won the state in 2020, even though he in fact lost to President Joe Biden by about 21,000 votes.",
        "The complaint asked the elections commission to investigate the fake electors' actions and declare that they broke the law.The commission voted unanimously last year in a closed meeting to reject the complaint, saying that Republicans who attempted to cast the state´s 10 electoral college votes for Trump did not break any election laws. Spindell did not recuse himself from considering the complaint, even though he voted as one of the fake GOP electors.The Wisconsin Department of Justice concluded that Republicans were legitimately trying to preserve Trump´s legal standing as courts were deciding if he or Biden won the election. That is the same argument that Trump allies and the fake electors from Wisconsin have made, including in testimony to the Jan. 6 committee.Law Forward and Madison law firm Stafford Rosenbaum sued the commission and Spindell on behalf of Paul Sickel, executive director of the Service Employees International Union´s Wisconsin State Council. Sickel also brought the original complaint to the elections commission.Jeff Mandell, co-founder of Law Forward, said it was important to get a ruling making clear that no member of the elections commission considers complaints that directly involve them.\"We want to make sure this doesn´t happen again,\" Mandell said after Monday's hearing. \"There´s not a vendetta or anything like that here.\"",
        "The case heard Monday is one of two pending lawsuits Law Forward has brought related to the fake electors. A judge earlier this year rejected another lawsuit against Spindell seeking records related to consideration of the complaint.The other pending case, in federal court, alleges a conspiracy to overturn the election and seeks $2.4 million in damages from the 10 fake electors and Trump attorneys Kenneth Chesebro and Jim Troupis."
    ]
}