{
    "articleURL": "/sport/football/article-12051781/Lionel-Messi-breaks-silence-suspended-PSG-unauthorised-trip-Saudi-Arabia.html",
    "content": [
        "Messi was suspended for two weeks by the club on Monday following the tripHe posed for photos with his family after the team were called in for training The Saudi Arabian government are preparing a mega-money deal to sign himLionel Messi has apologised to Paris Saint-Germain for missing Monday’s training session because he had travelled to Saudi Arabia to promote the country’s tourism industry. ",
        "Messi, who has been given a two-week suspension, posted a message on social media saying he was on his way to Riyadh when players were told their day off had been cancelled. 'I thought we were going to have a day off after the game as always,' Messi began in the 39-second clip shared onto his Instagram story.'I had this trip organised and I couldn't cancel it. I had already cancelled it before. I apologise to my team-mates and I'm waiting for what the club wants to do with me.'The seven-time Ballon d'Or winner spoke in Spanish throughout the clip and was dressed in a shirt and blazer.",
        "He came across remorseful, but currently remains suspended with over a week still to go until he will return to action.Messi recently posed with his wife, Antonella, and children for photos in Saudi Arabai, where he had pre-arranged a visit for one of his commercial commitments as an ambassador for tourism.The 35-year-old signed a £25m-a-year deal with Saudi Arabia last year to become a tourism ambassador.  There were suggestions following the incident that Messi and his father, who is also his agent, have made it clear to PSG that he will leave the club at the end of the season.",
        "Fans gathered outside the club headquarters on Wednesday to chant for the PSG board to resign, while they also called for Messi to leave the club, with the Argentinian also receiving jeers from supporters at recent matches.PSG have been trying to extend his contract over the last few months, but that is now up in the air after Monday's developments.",
        "The Saudi Arabian government is preparing a mega bid to lure the forward to the Saudi Pro League this summer.Messi has been offered £320million a year, almost double the £175million salary Cristiano Ronaldo is paid yearly at Al-Nassr, with the World Cup winner linked with Al-Hilal. It is unclear what his next destination will be, but he won't be short of suitors as he decides his next move - and Al-Hilal are ready to make him the highest paid athlete in history.He's also been linked with a return to Barcelona as well as a move to David Beckham's Inter Miami in America. "
    ]
}