{
    "articleURL": "/news/article-12045021/Eric-Adams-starts-war-words-AOC-Jordan-Neely-death.html",
    "content": [
        "Mayor Eric Adams appeared on CNN Wednesday to slam AOC for calling the death of homeless man Jordan Neely a 'murder'The mayor called the language 'irresponsible' and stressed that the investigation is still on going Meanwhile, family members have said that Neely, a renowned Michael Jackson impersonator, never recovered from his mother's brutal murder in 2007 New York City Mayor Eric Adams has slammed AOC for labeling the former Marine who put homeless man Jordan Neely in a chokehold on the subway a 'murderer' and urged her to wait until the facts of the investigation into his death emerge. ",
        "Neely, 30, was a homeless Michael Jackson impersonator with autism and schizophrenia who has been arrested 42 times in the past, including for punching a 67-year-old woman in the face. At 2.30pm on Monday, he was riding on the F train heading towards Broadway Lafayette station when he started screaming and throwing garbage at fellow passengers, according to witnesses. Juan Alberto Vasquez, who was on the train and filmed the chokehold, said Neely yelled: 'I don’t have food, I don’t have a drink, I’m fed up. I don’t mind going to jail and getting life in prison. I’m ready to die.' A fight broke out and the former Marine, who has not yet been named, put him in a chokehold. Two other men helped the Marine restrain Neely until police were called to the scene. He later died in the hospital. The Medical Examiner's Office has ruled his death a homicide by way of pressure to the neck. Now, protesters have erupted over New York City, spurred on by AOC and other Democrats like city Comptroller Brad Lander, calling the Marine a 'murderer'. ",
        "Mayor Adams, a former cop, urged caution on Wednesday night. 'I don’t think that’s very responsible at a time when we’re still investigating the situation. Let’s let the DA conduct his investigation with the law enforcement officials, to really interfere with that is not the right thing to do. ",
        "'To interfere with that is not the right thing to do. I'm going be responsible and allow them to do their job to determine exactly what happened.' Witnesses say Neely was yelling at fellow passengers and throwing garbage at them at 2.30pm on Monday while traveling on an F train heading towards Broadway Lafayette station. A fight between him and other passengers ensued, which led to the Marine putting him in a chokehold to restrain him. A video that begins once their train is already in the station shows the men restraining him for 2 minutes and 20 seconds. ",
        "Neely is writhing on the ground, but does not make any audible pleas for help. In addition to the Marine, two other men are standing over him, and two women are watching nearby. None of those standing around him raised concern about his breathing or his neck.At the end of the video, one of the men asks: 'Did somebody call the cops?' Neely was taken to Lenox Hill hospital where he was pronounced dead. His family say he was troubled after the murder of his mother.  Neely's father told the New York Daily News in an interview that his son became a 'complete mess' after his mother was strangled to death by his stepfather in 2007. ",
        "Earlier, Adams said that Neely's death was 'tragic' adding 'there’s a lot we don’t know about what happened here.''However, we do know that there were serious mental health issues in play here, which is why our administration has made record investments in providing care to those who need it and getting people off the streets and the subways, and out of dangerous situations,' the mayor went on.  The homeless man's father Andre Zachery' said in a tribute today: 'Jordan was a good man. 'He was a good person. He grew up good. He always had a (temper), but he never used to hurt anyone... He wasn’t bad. He was beautiful.' Zachery said that his son began mimicking Michael Jackson at the age of four or five. 'He looked just like him. He used to perform on the block. One day, people were loving him. Michael!,' the grieving father said. Zachery went on to say that he had not seen his son for four years, adding that his son was autistic, rarely taking his medication, making it difficult for him to find work and was a high school drop out. According to the Daily News report, Neely was arrested 42 times over the last 10 years and was last arrested in November 2021 for hitting a 67-year-old woman in the face. ",
        "The last contact he had with Neely was a letter that his son sent him from prison. It read in part, 'Dad, I disobeyed you. And I'm sorry.' After Neely's mother was killed by his stepfather, Shawn Southerland, Zachery said his son 'didn't care anymore.''Once his mother died ... They were very close. He loved her so much that he just lost it. ",
        "'After we buried her, he just wasn’t the same anymore,' he added. Neely's aunt Carolyn echoed his father's statements in an interview with the New York Post. 'My sister Christie was murdered in ‘07 and after that, he has never been the same.'It had a big impact on him. He developed depression and it grew and became more serious. He was schizophrenic, PTSD. Doctors knew his condition and he needed to be treated for that,' Carolyn Neely said. 'The whole system just failed him. He fell through the cracks of the system,' she added. A family friend told the newspaper that Neely 'suffered so much because of what happened to his mother. She was his sole support. His father sure wasn't.' That friend said that Neely attempted to live with his father on multiple occasions but the pair did not get along. In 2012, Neely was called to testify in the murder trial against the man who murdered his mother in Bayonne, New Jersey, reported NJ.com at the time.",
        "According to the testimony, Neely attempted to say goodbye to his mother one morning before going off to school. He said that Southerland blocked him from going into the bedroom, padlocking it. The following day, Neely said Southerland moved out of the home and he never saw him again. He was 14 at the time. The suspect was on the run for two years between 2007 and 2009 until he was finally arrested hiding out in a suburb in Philadelphia. Christie Neely's body was found on the shoulder of a Bronx highway in a suitcase.  Her cause of death was strangulation. 'The relationship had been crazy...a fight every day... Like I say, it was every day,' Neely testified. During the trial, Southerland, who attended law school for a time, represented himself and even cross-examined the teenage Neely. In his questioning, Neely insinuated that the boy's mother had been unfaithful. ",
        "Southerland was found guilty and sentenced to 30 years in prison. His most recent appeal failed in January 2022, according to NJ.com.  A Daily News article from the time of her death referred to Christie Neely as an 'ageless beauty' who grew up in Manhattan's Washington Heights section and had since moved to New Jersey. The piece described Shawn Southerland as a jealous partner who had been working as a golf caddie in Bayonne. At the time of her death, Christie had been working as a telemarketer. ",
        "Her mother, Clara Neely, told the Daily News that her grandson had told her before Christie's body was found: 'I know he killed my mother. I can't take it.' While her father, Clarence said: 'She was beautiful. She didn't age.' Southerland was ",
        "Two years after his mother's death, Neely's Michael Jackson act was covered by the Daily News. 'He means everything to me. When he died it was one of the saddest days since 9/11. I just want to see him do it one more time.'Video of the altercation that killed Neely posted online showed the 24-year-old Marine lying beneath the homeless man, holding him in a headlock position for several minutes as Neely tried and failed to break free.A second passenger pinned Neely's arms while a third held down his shoulder. It was unclear why the group had moved to restrain him. Neely lost consciousness and was pronounced dead at a Manhattan hospital shortly afterwards.The subduer was taken into custody and released without charges. His name has not been released publicly. A spokesperson for the Manhattan district attorney said an investigation was ongoing. On Wednesday, protesters began assembling at New York City's Broadway-Lafayette subway station, where Neely was taken to the hospital from, to protest his death. Chants of 'black lives matter,' 'justice for Jordan Neely,' 'F*** Eric Adams' and 'the homeless matter' could be heard.NYPD officers could be seen entering the subway platform carrying bundles of zip-ties. At the time of writing, as many as four arrests have been made at the protests.Contacted by the New York Daily News on Wednesday, the Marine refused to answer questions.'I'm not answering any questions. I appreciate it, but I'm not answering any questions,' he said.Also on Wednesday, New York Governor Kathy Hochul addressed the video saying it was 'deeply disturbing' but declined to say if the state would be investigating it as a criminal matter.Neely's death comes amid a period of heightened public attention to both homelessness and mental illness on New York City's streets and subways.Following several high-profile incidents, including a shooting on a subway that left 10 people wounded last year, Mayor Adams promised to deploy additional police officers and mental health workers throughout the transit system.Video of Monday's encounter evoked strong reactions from New Yorkers and officials, with some describing the act as a lethal overreaction to a person in the throes of mental illness and others defending the Marine's actions.The freelance journalist who recorded the incident, Juan Alberto Vazquez, told the New York Post that Neely was screaming 'in an aggressive manner' and complaining of hunger and thirst.Neely did not physically attack anyone, Vazquez said, adding that the 24-year-old approached the man after he threw his jacket to the ground.The video opens with Neely already on the subway car's floor, with the man's left arm around Neely's neck, locked into his other arm positioned against the man's head.Dave Giffen, the executive director at Coalition for the Homeless, blamed city and state officials for an inadequate response to the mental health crisis and questioned why the Marine was not facing criminal charges.'The fact that someone who took the life of a distressed, mentally-ill human being on a subway could be set free without facing any consequences is shocking,' he said. 'This is an absolute travesty that must be investigated immediately.'Those calls were echoed by several Democratic elected officials, who described the incident as a low point for the city."
    ]
}