{
    "articleURL": "/news/article-12044557/E-scooter-riders-attempt-evade-police-doing-100km-h-Majura-Parkway-Canberra-caught-video.html",
    "content": [
        "E-scooter rider attempted to outrun police motorbikes He tested positive to methamphetamine in a roadside drug testHeart-pounding footage shows the moment an Australian man going 100km/h on an e-scooter leads police on a chase from the highway to a bike path where he narrowly avoids cyclists. ",
        "James Cole, 38, was spotted by police going at high speed along Majura Parkway in Canberra's east on December 23 last year. When two officers on motorbikes try to pull him over, bodycam footage shows Cole refusing to stop and hitting the throttle in an attempt to evade them. The clip, played recently to the ACT Magistrates Court. shows Cole turning off the road and onto a bike path where cyclists dismount to avoid a collision as they hear the engines approaching.When the officers do manage to apprehend Cole after he tumbles off the e-scooter following a nearly five-minute-long chase, he pleads with them that he is late for work.",
        "'My job's on the line man,' Cole can be heard saying in the clip.'Please it's Christmas and that... I don't want to do this,' he said.He was found to have methamphetamine in his system following a roadside drug test.Cole pleaded guilty in court to seven charges this week, reports the ABC.His defence lawyer said he was on the e-scooter because he had lost his licence for drug driving and he fled police because he didn't want to be late to his job as a mechanic.'My client's need for speed, for lack of a better word, was a genuine attempt to get to work,' his lawyer said.",
        "The prosecutor argued he showed he was 'determined' to evade the officers and had put six riders on the cycleway in danger, not to mention himself.Special Magistrate Sean Richter said Cole was 'way beyond the age' he expected to see people appearing in court 'driving scooters and doing stupid things'.Cole was given a four-month jail term, with one month to be served behind bars and the remaining three on release under a good behaviour order. "
    ]
}