{
    "articleURL": "/wires/afp/article-12056723/Toll-DR-Congo-floods-rises-nearly-400-official.html",
    "content": [
        "The death toll from floods and landslides triggered by heavy rain in the east of the Democratic Republic of Congo has risen to nearly 400, an official said on Sunday.",
        "At least 394 bodies have been recovered after last week's floods, said Thomas Bakenga, administrator of Kalehe territory where the affected villages are located.He had announced a toll of at least 203 people on Saturday.Heavy rainfall in the Kalehe region of South Kivu province on Thursday caused rivers to overflow, triggering landslides that engulfed the villages of Bushushu and Nyamukubi.The hillside also gave way at Nyamukubi, where the weekly market was held on Thursday, Bakenga has previously said.\"It's like the end of the world. I'm looking for my parents and my children,\" Gentille Ndagijimana said, tears in her eyes.The 27-year-old and her family had sought refuge in Nyamukubi after fleeing fighting in neighbouring North Kivu province between army forces and rebels in January.Now, she has lost her two children, two sisters and parents, while her husband is injured and in hospital.\"I no longer have a family and I don't have a field. Now, I have to look for somewhere to sleep,\" she added.Mud and stones fill one neighbourhood, where homes, a market, two schools, a health centre, community hall and warehouse once stood -- now all gone.Bakenga told AFP on Sunday by telephone that there were now \"more than 390 bodies recovered\".",
        "He said that 142 bodies were discovered at Bushushu, 132 at Nyamukubi and 120 had been found floating on Lake Kivu near Idjwi, an island in the middle of the large volcanic lake.\"Since Thursday we've been finding bodies every minute and we are burying them,\" Bakenga said.- National mourning -The provincial government has sent a boat filled with beans, flour and other food, tarpaulins and medicine, he said.In all, several villages were submerged, many houses washed away, and fields devastated, when rivers in the region burst their banks due to the heavy rains.\"Out of 11 people in the family, only two remain,\" Roger Bahavu, a father of seven, told AFP.He went out to see friends after work and returned home later to find it and his family gone.Isaac Habamungu, a Red Cross worker in the area, said there was no funding for the recovery effort.Teams were digging \"with hands and some shovels\" to search for bodies, he said.A day of national mourning will be observed on Monday, with flags lowered at half-mast \"in memory of the lost compatriots\", the government announced.It also said it would deploy a government mission to support provincial authorities in dealing with the \"disaster\".Doctors Without Borders (MSF) also said it had sent an emergency team to the scene on Saturday.",
        "Eastern DR Congo's disaster came two days after floods killed at least 131 people and destroyed thousands of homes in neighbouring Rwanda, which lies on the other side of Lake Kivu.On Saturday, UN Secretary-General Antonio Guterres offered his condolences to the victims of the \"catastrophic floods\" in Rwanda and DR Congo.\"This is yet another illustration of accelerating climate change and its disastrous impact on countries that have done nothing to contribute to global warming,\" he said during a visit to Burundi.Experts say extreme weather events are happening with increased frequency and intensity due to climate change.Last month, a landslide provoked by torrential downpours killed around 20 people in North Kivu, a province that neighbours South Kivu.DR Congo, a vast nation the size of continental western Europe, is one of the poorest countries in the world, riddled by corruption and conflict in its east."
    ]
}