{
    "articleURL": "/femail/article-12056333/Princess-Beatrice-Eugenie-greet-royal-fans-Big-Lunch-Buckinghamshire.html",
    "content": [
        "Princesses Beatrice and Eugenie joined a Big Lunch in Buckinghamshire todayRead more: Princess Beatrice wears ornate £37,000 earrings for CoronationPrincesses Beatrice and Eugenie looked in high spirits today as they greeted royal fans at the Big Lunch in Buckinghamshire and posed with two adoring royal fans - and were asked to pass on a message to the Duchess of Sussex.",
        "Eugenie, 33, showed off her baby bump in a £2,410 Gabriela Hearst figure hugging dress as she joined in with a lunch on the village green in Chalfont St Giles. Meanwhile her older sister Beatrice, 34, donned a chic navy waistcoat which she paired with a £485 Cara Cara white skirt which featured a blue floral pattern. One royal fan who met the siblings took to Twitter to reveal she had asked them to say hello to Meghan Markle during their meeting. She wrote: 'Just met princesses Beatrice &amp; Eugenie at the Chalfont St Giles street party…asked them to tell Meghan I love her.'",
        "The sisters were also praised by Matt Eyre, who told FEMAIL they 'were amazing' with his children Bobbi-May, 11, and Bertie, nine, who have special needs.Beatrice's strawberry blonde locks fell loose in curls while her subtle makeup enhanced her features. Her chic Georgica midi skirt featured buttons down the front and a flouncy ruffle tier at the bottom.While Eugenie's ensemble was an elegant A-line shape with contrasting black piping and flamboyant puff sleeves.  The pair met representatives from All Together Community, a group which distributed food parcels to vulnerable people during the pandemic and continues to offer the same service, along with running a community fridge.They carried on the party atmosphere as they watched live music ahead of tonight's Coronation concert and admired a Coronation-themed table dressing competition.",
        "Their visit comes after the sisters made a glamorous appearance at the Coronation of King Charles III and Queen Camilla at Westminster Abbey yesterday. Earlier today Eugenie took to Instagram to reveal just how important yesterday was for her. ",
        "She wrote: 'Yesterday meant so much to me, as I'm sure it did to so many watching. What a magical celebration for The King, The Queen, our country, and the Commonwealth.'The day was such a reflection of dedication and service to our country.'Princess Beatrice lit up the room in a dark pink gown from Beulah, worth £695, which was belted at the waist to accentuate the royal's figure.She accessorised her look with ornate £37,000 earrings by Garrard which perfectly complemented her look.She wore her auburn tresses down in elegant waves and finished off her outfit with a chunky bronze headband and beige-hued clutch.",
        "Princess Eugenie looked glowing as she arrived in an all-navy ensemble for the historic ceremony.The mother-of-one, who is expecting her second baby in the next few months, looked elegant in a custom-made FENDI by Kim Jones navy silk and satin mid-length dress.The look was topped off with a cashmere FENDI coat and she wore heels from the designer, as well as FENDI Swarovski embroidered navy silk and satin gloves. ",
        "Her accessories were no less opulent than her sister's as the youngest daughter of Prince Andrew and Sarah Ferguson sported the Albemarle White Gold and Diamond Collar Necklace, which costs £130,000, and White Gold and Diamond Drop Earrings, worth £26,000, from Garrard.The duo walked in with their husbands, Edoardo Mapelli Mozzi and Jack Brooksbank, their father Prince Andrew, and their cousin Prince Harry.The Duke of York's children had spent the night before the Coronation celebrating with other members of the Royal Family at a private members' club.",
        "Princess Eugenie stunned in an Asceno Velvet Athens Robe, costing £575, as she arrived at Oswald's in Mayfair.Coordinating with his wife, Jack opted for a smart suit, white crisp shirt and a red patterned tie.Her older sister Beatrice opted for Louis Vuitton's £2,900 chain print asymmetrical long-sleeved frock which she teamed with black heels and a matching blazer.Her husband, with whom she shares one-year-old daughter Sienna, looked equally sophisticated in a navy suit and a light blue tie. They were joined at the royal gathering by other family members including the Duke and Duchess of Edinburgh and their children, Lady Louise and James, Earl of Wessex. Zara and Mike Tindall also joined the festivities and were later spotted partying at private members venue The Arts Club until 2am.",
        "After the grandeur of the Coronation ceremony, the Coronation Big Lunches are taking place in what a palace spokesperson has described as 'a nationwide act of celebration and friendship'.",
        "King Charles and Camilla, Queen Consort have officially chosen a coronation quiche, which features spinach, broad beans and tarragon as the designated dish for the Big Lunch.The new Coronation dish was developed in close conjunction with the King and Queen Consort by the Royal Chef Mark Flanagan, at Buckingham Palace.Quiche was chosen because it is considered a good 'sharing' dish to take to a street party and can be served hot or cold.It also suits a wide variety of dietary requirements and preferences and is considered to be 'not too complicated to make or require costly or hard-to-source ingredients'.Members of the public and organisers from a number of charities have expressed their enthusiasm ahead of the event.Lucinda Spelman-Ives, from Wilstock, who raised over £1 million to fund a community hub, said she hoped the Big Lunch would 'unify and bring everyone together being part of history, making amazing memories, laughing and meeting lots of people who have never met before'.'Everyone is bursting with pride after yesterday's ceremony,' she told the PA news agency ahead of today. ",
        "'This will be a very special memory for us all. Long live the Big Lunches and long live the King.'"
    ]
}