{
    "articleURL": "/wires/afp/article-12044861/No-alternative-Afghan-farmers-lament-Taliban-poppy-ban.html",
    "content": [
        "In a secluded compound in south Afghanistan, Bibi Hazrato cries in dismay as a group of men hack down her poppy crop, enforcing a Taliban government order to wean the nation off the narcotic plant.",
        "\"If you were working for God, you would not have crushed this little field,\" the frail sexagenarian hectors the turbaned men flaying her plants.\"God says crush this,\" one of them bluntly answers.The lucrative trade of poppy tar -- the psychoactive substance in heroin -- has been one of the few constants over decades of war and chaos in Afghanistan.But, last April, Taliban Supreme Leader Hibatullah Akhundzada declared poppy cultivation \"strictly prohibited\".On a trip to the opium-producing areas of Afghanistan, AFP saw fields of wheat where poppy flowers once bloomed, as the first harvest season under the ban got underway.In Hazrato's spartan home with tarpaulin sheet windows in Sher Surkh village of Kandahar province, Afghanistan's dilemma plays out in brief as an illicit-yet-vital source of revenue is extinguished in the midst of a humanitarian crisis.\"God also says to help the poor like me,\" she says, her head covered in a trailing black shawl.\"No one has ever helped me.\"- 'Strictly implemented' -",
        "The Taliban were largely successful in eradicating poppy agriculture at the tail-end of their first rule from 1996 to 2001, analysts say.But their veto faded when they were ousted by the US-led invasion in 2001 -- and started funding their fightback with a tax on the crop.",
        "Opium production provided about half of the Taliban insurgents' revenues in 2016, according to the United Nations Office on Drugs and Crime (UNODC).By 2020, the last full year of rule by the Western-backed government, 85 percent of the world's opium was flowing out of Afghanistan, the UN body said.The following year it estimated the opiate economy accounted for between nine and 14 percent of Afghanistan's GDP.",
        "Production has always been focused in the arid southern provinces of Kandahar and Helmand that seeded the Taliban movement three decades ago.Last year's ban was announced as the harvest was underway, so a grace period was agreed.Immediately enforcing the ban would have risked \"widespread dissent\", analyst David Mansfield said in an October report.Razing fields as labourers prepared to slash poppy bulbs and collect the precious sap would \"destroy the crop at the very moment when farmers were about to realise the returns on their labour\", he wrote.But this year, \"there is an indication that the poppy ban has been strictly implemented,\" senior UNODC official Anubha Sood told AFP.Nonetheless, she said \"small fields\" remained in \"private houses and gardens, vineyards, non-visible and remote areas\".News of the ban sent local per-kilogram prices nearly doubling to about $200 last year.",
        "- 'One-man rule' -",
        "In his village outside Helmand's provincial capital Lashkar Gah, Ghulam Rasool had hoped to skirt the ban and continue farming poppies as he has for most of his 60 years.Last year, he grew five hectares, earning 1.5 million Afghani ($17,000) -- a small fortune in Afghanistan.This year, he downsized to a small patch in his private compound, giving over his publicly visible fields to wheat and cotton.But just days before he was ready to harvest, three men came to enforce the supreme leader's ban.\"It's a one-man rule and no other people have any say. Whatever they instruct, you have to obey, you don't have any other choice,\" he told AFP on a visit to his home escorted by Taliban government security forces.\"They should give us help and alternatives,\" he said with incredulity. \"They haven't given us anything so far.\"- Supreme authority -",
        "Deputy counter-narcotics minister Abdul Haq Akhund Hamkar told AFP nearly three thousand hectares of poppy had been destroyed since the start of the season.That figure is a fraction of the 233,000 hectares the UNODC estimated were harvested in 2022.But Helmand counter-narcotics chief Haji Qazi said the ban \"has been implemented to a great extent [without force]\", because far less poppy was sown this season.",
        "\"When the decree of the supreme leader was announced, most of the people accepted it,\" he said.While opium farming was illegal under the ousted government, the authorities never had a secure grip on power in rural Afghanistan.In exile and in government, the Taliban have always had a reputation for fiercely enforcing law and order -- extending to public corporal punishments and even executions during their first rule.When 37-year-old Mir Ahmad heard of the ban over the radio at his village in Nad-e-Ali district of Helmand province, his first thought was he would \"lose a lot of money\".Nonetheless, he converted his nine hectares of poppies into wheat for the first time in 20 years.\"This year, we are financially in bad shape,\" Ahmad said. \"Last year, we had so much money we couldn't even spend it all.\""
    ]
}