{
    "articleURL": "/femail/article-12059039/Im-thrifty-shopper-spend-little-20-weekly-groceries.html",
    "content": [
        "Lauren Roddick, from Glasgow, says she spends only £40 on her weekly shopREAD MORE: I've saved £3,000 by shopping for yellow sticker itemsA savvy shopper who claims she has saved £1,500 on her food bills by scouring the yellow-sticker shelves in supermarkets has shared her top tips so others can get their shopping for less.",
        "Lauren Roddick, 35, from Glasgow, Scotland, claims her keen eye for the bright stickers along with her other savvy saving hacks means she now spends less than the average household for her food shop.The bargain buyer said she recalls becoming inspired to start saving on her weekly shop back in 2009 while studying nursing at university and constantly getting stuck in her overdraft. With the help of her husband Malcolm, who suggested some of his own saving tips, Lauren now shares her tips and tricks on social media.The couple's techniques have certainly proved they can stand the course of time, with the thrifty nurse spending just £40 a week on groceries.",
        "'With the cost of living crisis the food prices have went up quite a bit, so now more than before I try to find better deals,' Lauren explained.The claims she spends on average £40 on her weekly shop, which includes five days' worth of breakfast, lunch, dinner, drinks and snacks for two people.On top of their weekly essentials, Lauren added that there is always room for treats for their 14-year-old husky Toka and nice lunches for the weekend.She added: 'There will be weeks that the food shop only costs £20 or so as I've got everything needed in the freezer.",
        "'I saw that the average couple in the UK spends £70 on a food shop, so since mine is roughly £40, that's a saving of £1,500 per year - which is lovely to put towards the holiday fund!'Lauren often scours the supermarket shelves for offers and will buy in bulk to take advantage of limited-time offers.The Glaswegian often sets herself challenges to maintain her saving momentum, aiming to spend less and less on each weekly shop.Here, FEMAIL rounds up Lauren's top tips so you too can save on your food bills: ",
        "YELLOW STICKER ITEMSSince Lauren does the majority of her household's food shopping, she sets herself the task of only spending around £30.She has found a range of different ways to save whilst shopping but says looking for yellow stickers, which signal food that is near to its sell-by date, is key.  'The majority of our dinners and my midweek lunches are reduced price on the food shop,' she said.'I always have yellow sticker meat in the freezer, and if I'm lucky I'll get nice fresh veggies reduced as well.'",
        "THE BEST SUPERMARKETS FOR REDUCTIONSLauren also has her favourite supermarkets for buying reduced items or products on offer.She said: 'My favourite supermarkets for reduced food items would be Marks and Spencer's, and Morrisons.",
        "'The best deals are usually one to two hours prior to closing, and if you go to a store in a quieter area, the deals are usually better.The saver said all you need to do is ask the customer service desk what time they typically do their best offers, and that will give you a guide on when is best to head to the shops. She added: 'Aldi halfway through the day will reduce food items down by 30 per cent then later before closing they'll be 75 per cent off.'",
        "TAKE A SHOPPING LISTThe nurse wears by taking a shopping list with her to the supermarket and tries to make meal plans ahead of time.She claims this helps her to buy only what she needs and avoid impulse buying. Lauren said: 'I'll start by checking my freezer, as this is where I store meat and previously batch-cooked meals.'Then I'll work around that and write my list, while meal planning.'",
        "MAKE MEALS OUT OF LEFTOVERSLauren also makes meals from others with similar ingredients, to promote no food waste.'For example, I like to make my 'four ways mince,' she said.'This can be used as a bolognese sauce, keema mince, chilli con carne, beef gravy.'As all of these use beef mince, onions, garlic, carrots and a few other veggies that I can find.",
        "'I can't remember the last time I threw out out-of-date vegetables!'",
        "FREE MAGAZINESThe 35-year-old swears by picking up the free magazines on her outings to shops and trying out their recipes.She added: 'They always have lots of recipe ideas and revealed any offers that were available.'I started trying a few new recipes every week and started batch cooking to get organised.'I was also working 12-hour shifts at the hospital at that time so on these days it was just so handy to take a batch cooked meal out the freezer to defrost for work.' "
    ]
}