{
    "articleURL": "/sport/football/article-12051669/Nottingham-Forest-boss-Cooper-says-hard-say-work-Henderson-again.html",
    "content": [
        "Henderson has spent the season on loan at Nottingham Forest from Man United He picked up an injury in January and underwent an operation earlier this week The 26-year-old goalkeeper is likely to want to leave Old Trafford in the summer Dean Henderson will remain with Nottingham Forest until the end of the season even though the on-loan Manchester United goalkeeper is to miss the rest of the campaign with injury.",
        "Henderson has undergone surgery on a torn thigh muscle this week and it is unclear when he will be able to return. Yet even though he may never play for Forest again, Henderson is still spending time with his current team-mates at the training ground and on matchdays.‘We have all enjoyed working with him,’ said Forest boss Steve Cooper. ‘We like his personality, he is a good professional and has a fantastic mentality. In terms of whether we will work with him again, it’s hard to say.‘We are grateful for what he has given and what he will still give us. He will still be around and quite visible.",
        "‘Our medical team is working with United’s over what they want our contribution to be towards his recovery. In terms of support, he will be with us until the end, which is what he would want.’'We have a good working relationship with United and communication. It is still fresh after the surgery for what his recovery plan will be. We wish him well.'Henderson’s last appearance for Forest was the 2-0 win over Leicester on January 14. His injury prompted Forest to sign Keylor Navas on loan from Paris St Germain, and the Costa Rican has played ever since.",
        "Navas’ form has fluctuated during his time at the City Ground and he will have a vital role to play in the final four games of the season. Forest are in the bottom three but can climb out if they beat Southampton at home on Monday and other results work in their favour."
    ]
}