{
    "articleURL": "/wires/reuters/article-12039869/Reuters-US-Domestic-News-Summary.html",
    "content": [
        "Following is a summary of current US domestic news briefs.",
        "E. Jean Carroll called minutes after Trump allegedly raped her, friend testifiesA friend of E. Jean Carroll on Tuesday backed up the writer´s account of being raped by Donald Trump, testifying during a civil trial that she received a phone call about the alleged attack minutes after it occurred. Author Lisa Birnbach told a jury in Manhattan federal court that she \"vividly\" remembered Carroll calling her one evening in the spring of 1996 and saying Trump had just attacked her in a dressing room in the lingerie section of the Bergdorf Goodman department store in New York City.Senate panel explores ethics standards for US Supreme Court as questions swirlA Democratic-led Senate panel on Tuesday explored the possibility of pursuing legislation to impose ethics standards on the U.S. Supreme Court amid revelations about luxury trips and real estate transactions by conservative justices, but the panel's Republican members voiced stern opposition. \"The highest court in the land should not have the lowest ethical standards,\" said Senate Judiciary Committee Chairman Dick Durbin, who asserted at a hearing that the court's failure to fix the problem on its own means Congress must do it instead. \"That reality is driving a crisis in public confidence in the Supreme Court. The status quo must change.\"",
        "Montana transgender legislator loses court bid to return to floorCensured Montana transgender Representative Zooey Zephyr on Tuesday lost a last-minute legal attempt to rejoin debate on the House floor, as a Montana judge rejected her attempt to overturn the legislature's punishment that silenced her. Republicans controlling Montana's House of Representatives on April 26 barred Zephyr, a Democrat, from the House floor, anteroom or gallery for the remainder of the legislative session, which could end as soon as Tuesday night.US to temporarily send 1,500 troops to Mexico borderPresident Joe Biden's administration will temporarily send 1,500 additional troops to help secure the U.S.-Mexico border, the Pentagon said on Tuesday, in preparation for a possible rise in illegal immigration when COVID-19 border restrictions lift later this month. The 90-day deployment of active-duty troops will supplement the work of the U.S. Border Patrol but not carry out law enforcement duties, Pentagon spokesperson Brigadier General Pat Ryder said in a statement. They will conduct ground-based monitoring, data entry and warehouse support to free up border agents and \"fill critical capability gaps,\" Ryder said.Florida prosecutor suspended by DeSantis over abortion seeks reinstatement by US courtA lawyer for a Florida prosecutor on Tuesday urged a federal appeals court to reinstate his client after the state's Republican governor, Ron DeSantis, indefinitely suspended him over his pledge not to prosecute people seeking or providing abortions. \"This governor punishes dissenting voices,\" David A. O'Neil, a lawyer for suspended prosecutor Andrew Warren, told a three-judge panel of the 11th U.S. Circuit Court of Appeals. \"It's what he does.\"",
        "'No writers. No TV': Hollywood scribes strike over payHollywood film and television writers went on strike on Tuesday, shutting down late-night TV shows, and took their demands for higher pay to the doors of major studios in a labor dispute that hinges on how the streaming boom is changing show business. Hundreds of members of the Writers Guild of America (WGA) picketed in New York and Los Angeles in the first work stoppage to hit Hollywood in 15 years.US Senate Republicans, Democrats squabble over debt ceiling as deadline nearsTop U.S. Senate Republicans on Tuesday called on President Joe Biden to accept their party's debt-ceiling package or make a counter-offer, while a top Democrat said the Senate might try to advance a \"clean\" debt-ceiling hike next week. With barely a month to go before a possible catastrophic U.S. default, leaders of both parties hardened their standoff over the $31.4 trillion debt ceiling. Republicans in the Senate said Democrats needed to take seriously Speaker Kevin McCarthy's legislation that passed the House of Representatives along party lines last week.Ex-Minneapolis officer found guilty of aiding in George Floyd killingFormer Minneapolis police officer Tou Thao was found guilty of aiding and abetting in the 2020 killing of George Floyd, a Black man who died after his neck was pinned to the ground by another officer's knee during a botched arrest. The verdict against Thao, who held back a small crowd of bystanders while three other officers subdued Floyd, concludes the final criminal case related to the killing, which ignited a wave of protests over racism and police brutality across the U.S. and around the world.",
        "Exclusive-Biden, Harris planning 1st 2024 fundraisers as soon as next weekU.S. President Joe Biden and Vice President Kamala Harris are gearing up for their first fundraising events as soon as next week to help kick off their 2024 reelection campaign, according to people briefed on the plans. Some of the events being planned for Biden include a reception and dinner that could take place in New York City on May 10, the people said.No charges for Memphis officer who will testify in Nichols death trialOne of the former Memphis police officers involved in the attempted arrest of Tyre Nichols will not face criminal charges and is expected to testify against five others accused of brutalizing the Black motorist to death, a prosecutor said on Tuesday. Shelby County District Attorney Steve Mulroy said his office declined to charge the 26-year-old officer, Preston Hemphill, because he was not at the scene where five other officers battered Nichols, a 29-year-old Black father."
    ]
}