{
    "articleURL": "/wires/reuters/article-12061235/Abortion-providers-sue-preserve-expand-access-abortion-pill.html",
    "content": [
        "By Brendan Pierson",
        "May 8 (Reuters) - A group of abortion providers on Monday filed a lawsuit aiming to preserve access to the abortion pill mifepristone as anti-abortion opponents aim to ban it in a separate case.The lawsuit, filed in federal court in Charlottesville, Virginia, is similar to one filed in Spokane, Washington by the Democratic attorneys general of 17 states and the District of Columbia in February.Both lawsuits name the U.S. Food and Drug Administration as a defendant and ask for court orders lifting current federal restrictions on mifepristone, which include a requirement that pharmacies be specially licensed to dispense it.GenBioPro Inc, which sells a generic version of mifepristone, is also suing to block the FDA from restricting the drug.Mifepristone is the first of a two-drug regimen used to terminate a pregnancy within the first 10 weeks. It is used in more than half of U.S. abortions.All three lawsuits come in response to a lawsuit last year by anti-abortion groups in Amarillo, Texas federal court challenging the FDA's approval of the drug in 2000. U.S. District Judge Matthew Kacsmaryk on April 10 suspended approval of the drug.The same day, the attorneys general won an injunction from U.S. District Judge Thomas Rice in Spokane barring the FDA from enforcing any additional restrictions on mifepristone in their states.",
        "Kacsmaryk's order was put on hold by the U.S. Supreme Court while the Biden administration appeals. The appeal is set to be heard by a panel of three conservative, anti-abortion judges of the 5th U.S. Circuit Court of Appeals next week.The providers in Monday's lawsuit - Whole Woman's Health, Blue Mountain Clinic, All Families Healthcare and Trust Women - provide abortions in Virginia, Montana and Kansas, which are not covered by the injunction.\"They and their patients require clarity around their continued provision of mifepristone,\" the lawsuit said. They said the dueling district court orders had created \"day-to-day, week-to-week uncertainty\" about using the drug.The FDA declined to comment. Lawyers for the anti-abortion plaintiffs in the Texas lawsuit did not immediately respond to requests for comment. (Reporting By Brendan Pierson in New York, Editing by Alexia Garamfalvi and Bill Berkrot)"
    ]
}