{
    "articleURL": "/debate/article-12055097/ROBERT-HARDMAN-poignant-moment-William-gave-father-light-kiss-cheek.html",
    "content": [
        "We may not be able to explain magic, but we know it when we see it. It is the reason that nothing – not the naysayers, not the shrill demands of social media, not even the rain – could null the raw power of a King being crowned before God, his people and the world.",
        "Invested with treasures unrivalled, serenaded by music quite sublime, Charles III and his Queen yesterday joined a thousand-year-old pantheon of monarchs in a ritual with its roots in the Old Testament.There were plenty of modernising touches, not least sports stars and writers processing in the place of dukes and field marshals. Old norms of precedence and protocol had been set aside, thus relegating two Royal dukes – Sussex and York – to the also-ran territory of Row Three, while many of the Royal cousins who did make the grade were forced to leave their spouses at home. Some of the grandest and oldest families in Britain were not even invited at all.In their place were 400 holders of the British Empire Medal. It might be in the foothills of the honours system but, yesterday, the BEM trumped an earldom.",
        "A dozen entirely new pieces of music had been commissioned for an occasion which, at one level, could be described as the Proms meets Trooping the Colour meets a Royal Wedding meets the United Nations. Britain had never previously gathered 100 heads of state (plus prime ministers and other emissaries from 200 nations in total).No comparable military parade had been seen since the last Coronation in 1953.Yet, at its heart, was the sight of one man in a battered chair, dressed first in a collarless shirt, then gold robes and, finally, adorned with the crown of crowns, communing with the Almighty – and with all of us.",
        "For those below the age of 80, here was uncharted territory. But you don't need to know your armill from your orb to have been mesmerised by this affirmation of the person and the values which underpin our unwritten constitution.The first spoken line of the entire proceedings came not from a King or bishop but a 14-year-old chorister.Samuel Strachan said: 'Your Majesty, as children of the kingdom of God we welcome you in the name of the King of kings.' To which, Charles III replied: 'I come not to be served but to serve.'That summed up the whole show. The Archbishop of Canterbury reiterated the point in his short sermon: 'We are here to crown a King and we crown a King to serve.'Westminster Abbey had been filling up more than three hours before the service. With a quarter of the capacity of the previous Coronation and a huge international presence – the King had torn up the old convention precluding fellow heads of state from attending (and thus outranking the coronee) – numbers were tight.",
        "The Royal 'box', in the South Transept, was probably the smallest it has ever been for a Coronation. The King's siblings were all permitted to bring their children, as were his first cousins, the Earl of Snowdon and Lady Sarah Chatto.",
        "The same applied to the first cousins of the late Queen, the Dukes of Gloucester and Kent, Prince Michael of Kent and Princess Alexandra.However, none of their children could bring spouses. So, for example, Lady Helen Taylor, daughter of the Duke of Kent, or the Earl of Ulster, son and heir of the Duke of Gloucester, came solo. The entire Mountbatten clan had a single representative, Countess Mountbatten.But there was room for two members of the Queen Mother's extended family, Sir Simon and Lady (Caroline) Bowes Lyon, plus six members of Prince Philip's family (the heads of the Hohenlohe-Langenburg, Baden and Hesse dynasties, plus wives).Here, too, was a full set of Middletons. The Princess of Wales's parents, Michael and Carole, sat with her sister, Pippa, and brother, James, in Row Seven of the Royal zone. To their left, sat the world leaders. Across the way, the North Transept was for friends. It included a cultural corner featuring Dame Judi Dench, Dame Joanna Lumley, Stephen Fry and writers Sir Tom Stoppard, William Shawcross and Simon and Santa Sebag-Montefiore.Past and present prime ministers were all allowed to bring spouses but it was a solo ticket for the current Cabinet.In pride of place, naturally enough, were the Prince and Princess of Wales (he in the robes of the Order of the Garter, she in the lighter blue of the Royal Victorian Order) plus Princess Charlotte, in ivory, and Prince Louis in a dark blue soldier suit.",
        "Prince George was helping carry his grandfather's train.The procession ahead of the King underlined just how different this Coronation was from its predecessors. Women, minorities and other faiths featured prominently, the nobility barely at all. Following the junior heralds (pursuivants) in their tabards, came the orders of chivalry and gallantry.For the Order of Canada, we saw the historian Professor Margaret MacMillan just ahead of the Order of New Zealand represented by the Richie McCaw, the double World Cup-winning All Black. Behind him British ex-Olympian Lord Coe representing the Companions of Honour, and fellow Olympian Lady Mary Peters representing the Order of the Garter.",
        "No King in our history has come to the Throne at such an age – 74. Perhaps this accounted for the serenity – even a smile – on the face of the King as he processed through the Abbey. Queen Camilla (the words 'Queen Consort' appeared not once in the order of service) bore a more nervous smile, though smile it was.All the rehearsals of recent weeks had paid off. There were a few double-takes and sideways glances but nothing constituting a blunder.You could hear the nerves when Elizabeth II and her father, George VI, recited their oaths. Not with this monarch. Given the dramas with leaky pens in the early days of the reign, the only nervous moment came as the King came to sign the parchment. On this occasion, the ink flowed properly.",
        "Thence to the high drama, the anointing. With the Coronation of Elizabeth II, we saw none of that. This time, there was at least a glimpse of the King derobing to his shirtsleeves for the most sacred moment of the lot.Even the other members of the Royal Family could not see what was going on as Guardsmen processed forward with a special three-sided anointing screen.The only witness with a decent view was Penny Mordaunt, Lord President of the Council and bearer of the Sword of State. She found herself standing on the open side of the screen as the Archbishop of Canterbury, Justin Welby, dabbed holy oil (from Jerusalem's Mount of Olives, next to the grave of Prince Philip's mother) on the King's head, hands and chest. Ex-Royal Navy, Miss Mordaunt has seen it all and blinked not.",
        "The rest of the world happily had to make do with Handel's peerless Zadok The Priest rising higher and higher around the Abbey. Throat-gulping stuff.Hurdle number one completed, the King moved to the Coronation Chair to be invested with the regalia. In order to save time, he was spared putting it all on, simply touching the ring, the spurs etc.And so, to the point. The Archbishop gave St Edward's Crown one final check – if the square green jewel is not at the front, it's the wrong way round – and then placed it firmly on the Royal bonce. It did not seem to land first time and there was a spot of fumbling before it settled to the King's satisfaction.",
        "'God Save the King,' proclaimed the Archbishop, kickstarting a 21-gun salute across the land. If the congregation did not respond with the din of last time, it was just that they were a quarter of the size.The most poignant part of the service, surely, was when the Prince of Wales stepped forward to pay homage as 'liege man of life and limb'. Whereupon, he gave his father a light kiss on the left cheek, just as Prince Philip had done to the Queen 70 years ago.Now, as then, the monarch's face lit up at this personal intrusion into the rubric.The crowning of the Queen was a simpler affair, preceded by a minimum of anointing. After tweaking a few rogue hairs, she allowed herself a broader smile. Mr Welby, it must be said, is not a born hatter.This was the cue for Andrew Lloyd Webber's anthem, Make A Joyful Noise. Written to the words of Psalm 98, it did what it enjoined.",
        "Palpably relieved, the couple retired backstage to the Chapel of St Edward to remove their crowns for Holy Communion, a central piece for the Supreme Governor of the CofE. This was never televised in 1953, when viewers merely had a shot of the altar cloth.Finally, they retired once more to restore crowns and robes, in this case, the grandest of them all – the Robes of Estate.The Queen looked almost elated. The King, by now in the Imperial State Crown (which he will wear again when he next opens Parliament), bore the contented, slightly wistful, deeply proud look of the father of the bride at the tail end of the wedding service.A monarch with a greater love of music than perhaps any since George III, a romantic with a profound respect for tradition, a deep thinker with a strongly spiritual side, he will have struggled to contain his emotions at many points during this service. Yet contain them he did.Strange and baffling at times, especially to younger viewers, the overarching theme of yesterday was one of epic and very grand humility. Charles III may have left in a gold coach, holding an orb and sceptre, accompanied by an entire army and with a crown on his head. The real masters were the ones on the outside, cheering him all the way home."
    ]
}