{
    "articleURL": "/tvshowbiz/article-12044403/Missy-Elliott-female-rapper-admitted-Rock-Roll-Hall-Fame.html",
    "content": [
        "Missy Elliott on Wednesday was named an inductee to the Rock &amp; Roll Hall of Fame, becoming the first female rapper to achieve the feat.",
        "Elliott, 51, took to Twitter to express her excitement and gratitude at the honor, which marks the latest milestone in her storied career.'I want to say this is HUGE not for just me but all my Sisters in HIPHOP this door is now OPEN to showcase the hard work &amp; what many of us contribute to MUSIC,' she said. 'I have cried all morning because I am GRATEFUL thank you @rockhall &amp; all on the committee &amp; Supafriends.' She added that she couldn't 'stop crying,' noting, 'I am from Portsmouth Virginia aka P-Town.. #757 to 804 I send my love ... You day dream of these moments but today it’s Real ... VA 2 up 2 down the 7 Cities all my folk I am GRATEFUL.'The musical artist said she's flattered in receiving by the vaulted honor in the music industry.",
        "'It’s times I have gotten on line &amp; seen your irrelevant your a flop your washed up &amp; it would crush me at times,' she tweeted. 'BUT God you made me STRONG I kept going &amp; you allowed my decades of WORK to SPEAK 4 itself.'The Work It performer said she was 'HUMBLED' by the honor, adding, 'Thank you all my Supporters ... I LOVE YOU.The Lose Control singer added, 'If I miss some of yalls tweets please forgive me it’s a lot to see but I do want to say Thank You to my Fans (Supafriends) my Peers/Radio/Dj’s/Bloggers &amp; again @rockhall I am Thankful #RockHall2023 #VA #757.'",
        "The music veteran, who also has been a producer, and writer for artists such as the late Aaliyah and Diddy, was lauded by peers such as Ciara and Janet Jackson upon announcement of the honors.'I’m SO proud of you sis!!!!' Jackson said, while Ciara said, 'Congratulations to my sis @MissyElliott on being inducted into the @rockhall!! You deserve it all! Will never stop thanking you for the inspiration you give us all! I love you so much!'Other artists who were named inductees included Kate Bush, Sheryl Crow, George Michael, Rage Against the Machine and the Spinners, while Chaka Khan is slated to receive the Musical Excellence Award.",
        "Elliott enters the establishment in her first year eligible, which is 25 years after the release of the artist's first commercial recording.Rock &amp; Roll Hall of Fame chairman John Sykes told Variety of Elliott's induction: 'Missy Elliott got in first ballot, just like Eminem got in first ballot last year and Jay-Z the year before.'So if there’s a throughline we’re seeing, it shows the power of hip-hop music culture now, as if we didn’t know it already, as far as how quickly these artists are being recognized on the first ballot.'"
    ]
}