{
    "articleURL": "/wires/ap/article-12051019/Spains-April-heat-nearly-impossible-without-climate-change.html",
    "content": [
        "MADRID (AP) - Record-breaking April temperatures in Spain, Portugal and northern Africa were made 100 times more likely by human-caused climate change, a new flash study found, and would have been almost impossible in the past.",
        "A group of international scientists did a rapid computer and statistical analysis of a late-April heat wave that stretched across the Iberian peninsula into Algeria and Morocco. The four countries experienced temperatures as high as 36.9 degrees Celsius (98.4 degrees Fahrenheit) to 41 degrees Celsius (105.8 degrees Fahrenheit) degrees.Study lead author Sjoukje Philip of the Royal Netherlands Meteorological Institute said in a briefing that a weather event this extreme \"would have been almost impossible in the past, colder climate,\" adding: \"We will see more intense and more frequent heat waves in the future as global warming continues.\"Because the analysis released Friday was one of the quickest ever - the heat still hasn´t subsided much - the study by World Weather Attribution is not peer reviewed, which is the gold standard for science. But the team of WWA scientists do these quick studies using scientifically accepted techniques and often get them published later in peer-reviewed journals.The regions in the study are all suffering from a multi-year drought, which can exacerbate high temperatures, the scientists said.Currently, 27% of Spanish territory is in either the drought \"emergency\" or \"alert\" category and water reserves are at 50% of capacity nationally. The average dam storage in Morocco is at similarly low levels, and in Tunisia many homes have water cuts during the day.",
        "Farmers across the Western Mediterranean have warned that poor harvests are likely, in some regions for the sixth year running.The study also said the extreme heat in Europe is rising faster than computer models had projected. The same thing happened in the Pacific heat dome, so scientists who create computer models need to go back and rethink their overly conservative projections, said University of Washington's Kris Ebi, who wasn't part of the study, but praised it.The scientists compared real life April temperatures to a simulated world without climate change. They found that a heat wave like the one the Western Mediterranean suffered in April would have been more than two degrees Celsius (3.6 degrees Fahrenheit) less severe in a world without coal, oil and gas pollution trapping heat.The study will also help inform governments preparing for the earlier onset of extreme hot weather, with the aim of preventing deaths and unrolling heat awareness campaigns. Last year, at least 15,000 people died in Europe because of extreme hot weather, according to the World Health Organization, with Spain one the countries worst affected.\"When we can send out warnings with calibrated messaging, that allows people to accurately perceive their personal risk, that can lead to personal behavioral changes,\" said Roop Singh of the Red Cross Red Crescent Climate Centre, another of the study's authors.",
        "Changes include access to air conditioning in schools, monitoring heat-related hospital admissions and advising citizens to avoid outdoor sports at certain hours of the day, she said.The results of the study make sense and are important, according to three outside climate scientists.\"The world is approaching the moment when nearly all heat waves will have a climate change fingerprint,\" Ebi told The Associated Press in an email. \"In the meantime, these kinds of analyses are valuable for moving policymakers and justifying investments.\"Studies like these are important, but \"'it´s also now like asking if the dog with berries on its face got into the pie cooling on the counter,\" said North Carolina State Climatologist Kathie Dello, who wasn't part of the study.While some scientists question the value of looking for climate change's fingerprint in studies like this, saying global warming is changing everything, Stanford University climate scientist Rob Jackson, who was not part of the study, said this type of analysis has value.\"Attribution is the only tool we have to understand whether extreme weather is inflamed by climate change,\" Jackson said in an email. \"Rare weather events are becoming more and more `normal.' Climate change has loaded the weather dice.\"___ Borenstein reported from Kensington, Maryland___ Follow AP´s climate and environment coverage at https://apnews.com/hub/climate-and-environment ___ Follow Seth Borenstein on Twitter at @borenbears and Jennifer O'Mahony at @jaomahony",
        "___ Associated Press climate and environmental coverage receives support from several private foundations. See more about AP´s climate initiative here. The AP is solely responsible for all content."
    ]
}