{
    "articleURL": "/tvshowbiz/article-12055445/Ed-Sheeran-candidly-opens-decade-long-friendship-Taylor-Swift.html",
    "content": [
        "Ed Sheeran has candidly opened up about his decade-long friendship with Taylor Swift in a new interview.",
        "The British musician, 32, told Zane Lowe on his Apple Music podcast that he often confides in his longtime pal, 33, about everything from his career to personal issues. He said: 'I have long, long, long conversations with Taylor about stuff just because I feel like she's one of the only people that actually truly understands where I'm at,'Before explaining just how similar they are: 'Because she's solo artist, she's stadiums.'Ed went on to tell the host that he and the Bad Blood songstress had in fact just spent 90 minutes catching up ahead of the interview. ",
        "He said: 'We were just — everything that was on our minds we talked about, I mean that in itself is kind of therapy as well because you're actually talking to someone that genuinely gets it.' 'That has all the things that you feel and have insecurities about and how other people treat you or how your family treats you, how your friends treat you, she's just basically in the same sphere,' he continued.The duo have been friends for 10 years and Ed has appeared with the star on stage and also featured on her album Red (Taylor's Version).The interview comes after Ed was cleared of allegations his 2014 hit 'Thinking Out Loud' ripped off Marvin Gaye's 'Let's Get it On' at Manhattan federal court on Thursday.",
        "He had previously threatened to quit the music industry if he was found guilty of ripping off Gaye's classic love ballad. Ed, who strongly denied the accusation his hit stole fundamental musical elements from Marvin's song, had faced a £79million lawsuit brought by the heirs of the song's co-writer, Ed Townsend.But he heard a verdict that he was in the clear on Thursday after a jury comprised of three men and four women deliberated for less than three hours before reaching their decision.Speaking outside the court, Ed – who is worth £158m – said: 'I'm just a guy with a guitar who loves writing music for people to enjoy. I am not and will not allow myself to be a piggy bank.'",
        "Ed's lawyer had said the case 'should never have been brought', and the singer staked his career on the outcome, saying during the case he would be 'done' with music if found guilty.The copyright lawsuit was first brought in 2018 by the estate of the late Ed Townsend, who co-wrote the 1973 R and B classic with Gaye.It said Ed and his co-writer Amy Wadge 'copied and exploited, without authorization or credit,' the composition of Let's Get It On by copying various elements, including its 'melody, rhythms, harmonies, drums, bass line, backing chorus, tempo, syncopation and looping'.",
        "On Friday, Ed said he is felt 'lighter' now his new soul-baring album Subtract is 'in the world' and people are connecting with it 'on such a deep and meaningful level'.The album is the final one in his mathematical symbol series and was written against a backdrop of challenging events in his life last year, including his wife Cherry Seaborn being diagnosed with a tumour while pregnant, the death of his close friend Jamal Edwards and a copyright battle over his 2017 hit Shape Of You.The global star has said he used the album to channel the intense emotions which emerged from this difficult time, describing the songwriting process as his 'therapy'."
    ]
}