{
    "articleURL": "/wires/pa/article-12038525/Minister-wants-social-care-workers-rewarded-despite-funding-pledge-cut.html",
    "content": [
        "The social care minister has said she wants to see workers in the sector rewarded as she was questioned about the decision to halve previously promised workforce funding.",
        "Helen Whately said she feels “very strongly” that reform and investment within training and career progression in social care must go alongside funding for workers’ pay.She was questioned by MPs on Tuesday about the announcement last month that £250 million would be invested to support the social care workforce, despite a previous pledge to invest twice that sum. I think people should be rewarded for what they do and I want there to be an opportunity for there to be career progression within social care  Social care minister Helen Whately  She told the Health and Social Care Committee: “What we did in the run-up to setting that (April announcement) out was look at the overall pot of money allocated to reform and say, ‘well, what’s the best possible use of this funding, in the light of, as I said a moment ago, the extra pressures on social care, the impact of inflation, the level of demand that we are seeing.“And I think what we need to do is, we need to do reform hand in hand with making sure there’s enough funding going into the frontline provision of care.“Enough funding going to local authorities which in turn can be used to increase fees and in turn, we know for providers, fees mean that they can pay staff as they need to.",
        "“And, to me, reform needs to go hand in hand with funding the frontline.”Pressed on the issue, she said there was a “limited pot of taxpayers’ money” to be looked at.The Government has said no funding for the adult social care sector has been removed or re-allocated to the NHS, and that up to £600 million mentioned in the white paper has “not yet been allocated” but will be targeted on measures “that will have the most impact” over the next two years. They are the lowest paid workers in this country. Are you happy with that?  Labour MP Paul Blomfield  Various organisations within the sector as well as charities and bodies representing people who need social care have repeatedly called for better investment to help improve wages and retain skilled staff.Labour MP Paul Blomfield asked Ms Whately: “They are the lowest paid workers in this country. Are you happy with that?”Ms Whately told the committee that while the national living wage had risen by almost 10% to £10.42 an hour she does not “want people always to think of social care as being sort of a national living wage job”.She added: “I think people should be rewarded for what they do and I want there to be an opportunity for there to be career progression within social care, for instance, and when people gain more skills I think that should be recognised.”",
        "She said that “fundamentally” pay for social care workers is determined by their employers, but added that the Government had delivered the biggest funding increase in history for adult social care in England, with up to £7.5 billion over two years which is intended to enable local authorities to invest in social care."
    ]
}