{
    "articleURL": "/wires/pa/article-12045625/Palestinians-wanted-murder-British-Israeli-family-killed-raid.html",
    "content": [
        "Israeli troops have killed three Palestinians wanted in connection with a deadly attack against a British-Israeli family in the West Bank.",
        "In a rare daytime incursion, forces entered the flashpoint city of Nablus and raided an apartment where the men were located, according to a military spokesman. Troops and the suspects exchanged fire and the three men were killed.The military accuses them of being behind an attack last month on a car near a Jewish West Bank settlement that killed British-Israeli Lucy Dee, 48, and her daughters, Rina, 15, and Maia, 20,In a statement after the raid, Hamas said all three men, identified as Hassan Qatnani, Moaz al-Masri and Ibrahim Jabr, were members and claimed responsibility for the April attack.Israeli shells ripped through the roof of the gunmen’s safe house in the heart of Nablus’ Old City, leaving nothing but twisted metal, cement blocks and torn mattresses stained with blood scattered over the rubble. A couple of hours after the army withdrew, young men collected scores of ejected bullet shell casings from the narrow alleys.The violence in Nablus comes at a particularly sensitive time in the region, days after a prominent Palestinian prisoner who was staging a lengthy hunger strike over his detention died in Israeli custody.His death set off a volley of rockets from militants in Gaza and air strikes in the coastal enclave that killed one man.",
        "Last month, hundreds of people attended the Dee family funerals and husband and father Leo, who has three surviving children, has been a recurring figure in Israeli media. Mr Dee, who is a rabbi, said he bears no hatred towards the killers and has called for national unity amid a deep societal rift.“We’re grateful to God that this (raid) was done in a way that protected the lives of the soldiers and caused minimal if no civilian casualties, as far as we know,” Mr Dee told The Associated Press from his home in the Jewish West Bank settlement of Efrat.“And of course, that’s very important to us that innocent Palestinians were not injured in this operation,”Israeli officials said the raid showed attackers would be hunted down eventually.“Our message to those who harmed us, and to those who are trying to harm us, it’ll take a day, a week or a month — be certain that we will make you pay,” Israeli prime minister Benjamin Netanyahu said.Israel has been staging near-nightly arrest raids into West Bank villages, towns and cities for more than a year in an operation prompted by a wave of Palestinian attacks against Israelis last year.Israel says the raids are meant to dismantle militant networks and thwart future attacks. The Palestinians see the attacks as further entrenchment of Israel’s 56-year open-ended occupation of lands they seek for a future independent state.",
        "The raids have been met by a surge in Palestinian attacks.Some 250 Palestinians have been killed by Israeli fire since the raids were launched. Israel says most have been militants but stone-throwing youths and people not involved in the confrontations have also been killed.During that same time, nearly 50 people have been killed in Palestinian attacks against Israelis."
    ]
}