{
    "articleURL": "/wires/ap/article-12043651/New-North-Carolina-abortion-limits-legislative-fast-track.html",
    "content": [
        "RALEIGH, N.C. (AP) - The North Carolina House on Wednesday approved a Republican package of abortion restrictions that would tighten the state's ban on the procedure from after 20 weeks to after 12 weeks, while creating new exceptions but also more requirements for pregnant women and physicians.",
        "The fast-tracked legislation, which emerged the previous day after months of private negotiations among House and Senate GOP members, was scheduled to receive a final vote in the Senate on Thursday morning and could reach the desk of Democratic Gov. Roy Cooper later that day.Cooper, a strong abortion-rights supporter, vowed to fight the measure.\"I will veto this extreme ban and need everyone´s help to hold it,\" Cooper said in a tweet.But Republicans now hold veto-proof majorities in both General Assembly chambers after a House Democrat switched to the Republican Party last month. That advantage was reflected in the House's party-line 71-46 vote for the measure Wednesday night after an hour of debate.One Republican was absent for the vote. House Speaker Tim Moore said afterward that in his chamber \"we absolutely do have the votes for an override.\"",
        "Earlier in the day, more than 200 people, including Democratic Attorney General Josh Stein and members of Congress, rallied in opposition to the bill near the Legislative Building. Demonstrators later marched inside, and chanted \"Abortion Rights Now!\" from the House gallery during a break.State law currently bans almost all abortions after 20 weeks of pregnancy. The bill being considered would reduce that to 12 weeks, or roughly at the first trimester. It also places limits on new exceptions, capping abortions at 20 weeks in cases of rape or incest and 24 weeks for \"life-limiting\" fetal anomalies, including certain physical or genetic disorders that can be diagnosed prenatally. An existing exception for when the life of the pregnant woman is in danger would remain.",
        "The changes stem from the desire of state Republicans to alter abortion rules after last year´s U.S. Supreme Court decision overturning Roe v. Wade. But they aren´t as restrictive as those in other GOP-controlled Southern states like Tennessee and West Virginia.Some conservatives had wanted a ban on abortions once an ultrasound first detects fetal cardiac activity, typically about six weeks after fertilization. But that´s not where Republican lawmakers ended up.\"We talked about everything - what went too far, what didn´t go far enough - and where we could finally come to a consensus was 12 weeks,\" said GOP Rep. Sarah Stevens of Surry County, one of the negotiators of the package.Republicans were cautious about going too far in a closely divided state ahead of the 2024 elections after losing some key races in suburban areas last year where abortion was a big issue, Catawba College political science professor Michael Bitzer said.\"Certainly the tea leaves that came out of 2022´s election showed that if they went too restrictive, there would be a political and electoral backlash,\" Bitzer said.Courtney Geels, grassroots director for the socially conservative group North Carolina Values Coalition, said the bill is \"a significant compromise in the pro-life community, but it is an excellent step in the right direction.\"",
        "Republicans also proposed spending in the bill at least $160 million for programs to improve child care access and maternal health care, encourage families to take in foster children and provide contraceptives to low-income or uninsured patients. The measure also includes money to cover eight weeks of paid leave for state employees and teachers after giving birth, with four weeks for another new parent.\"These are very significant, meaningful and much needed investments in children, families and women,\" said GOP Rep. Erin Paré of Wake County, who also helped shepherd the measure on the House floor.The 46-page measure contains additional abortion prohibitions that Cooper vetoed successfully in past years when Democrats held more legislative seats. Some would bar women from getting abortions on the basis of race or a prenatal diagnosis of Down syndrome. Another would require doctors and nurses to protect and care for children born alive during a failed late-term abortion.The legislative package was offered through a parliamentary procedure that doesn´t allow lawmakers to offer amendments. That angered Democrats who called the process to consider such a controversial and complex measure anti-democratic. Democrats demanded just before Wednesday's vote that they be able to lodge formal protests, citing a provision in the state constitution addressing an act that a lawmaker \"may think injurious to the public.\"",
        "\"The effort to cover up the stripping of a woman´s dignity and her right to bodily autonomy cannot be sugarcoated with this partial funding measure,\" said Rep. Laura Budd, a Mecklenburg County Democrat.The bill also creates new licensing requirements for surgical abortion clinics that must be at least as restrictive as the rules that ambulatory surgical centers must follow. Planned Parenthood South Atlantic says none of its clinics in the state currently meet those standards.\"Extreme anti-abortion politicians have created a monster by pushing new restrictions that aim to shut down abortion clinics,\" Planned Parenthood spokesperson Jillian Riley told lawmakers.North Carolina law currently requires a 72-hour waiting period for an abortion but allows for the clock to start ticking with a phone call between a pregnant woman and a physician or qualified professional. The bill would eliminate that remote contact option and require a woman visit a clinic or hospital in person, as well as a follow-up visit for a medically induced abortion.The extra visits result in an unnecessary burden, critics say, especially for women who find it hard to take off work.\"This bill is about making it as difficult as possible to obtain an abortion, even in the first trimester,\" Dr. Amy Bryant, an OB-GYN, said at Wednesday´s rally.",
        "At least 88% of abortions in North Carolina in 2020 occurred at or before 12 weeks of gestation, according to state Department of Health and Human Services data."
    ]
}