{
    "articleURL": "/wires/reuters/article-12048513/CANADA-STOCKS-Toronto-market-hits-four-week-low-amid-U-S-bank-stock-jitters.html",
    "content": [
        "TSX ends down 0.6% at 20,238.19",
        "Financials fall 1.3%Energy ends nearly 1% lowerShopify jumps 23.2%(Adds investor quotes and details on activity)By Fergal SmithMay 4 (Reuters) - Canada's main stock index fell on Thursday to its lowest closing level in four weeks as pressure on U.S. bank stocks spilled over to the financials sector, offsetting a jump in the shares of e-commerce company Shopify Inc.The Toronto Stock Exchange's S&amp;amp;P/TSX composite index ended down 116.49 points, or 0.6%, at 20,238.19, its lowest closing level since April 6.Wall Street also ended lower after PacWest's move to explore strategic options deepened fears about the health of U.S. lenders and hit shares of regional banks as well as other major financial players.\"What we are seeing is expectations that credit conditions are going to continue to tighten in Canada's high interest rate regime,\" said Philip Petursson, chief investment strategist at IG Wealth Management.\"Banks are becoming more risk-off and that's likely to impact future profitability.\"The Toronto market's heavily-weighted financials sector fell 1.3% despite a gain of 0.3% for Toronto-Dominion Bank Group after the lender called off its $13.4 billion acquisition of U.S.-based First Horizon Corp.Energy also lost ground, falling nearly 1%, as oil settled 0.1% lower at $68.56 a barrel following another volatile session.",
        "Technology was the lone sector to rise, gaining 3.4%.It was helped by a 23.2% jump in the shares of Shopify Inc after the company announced plans to lay off 20% of its workforce and sell its logistics arm, while also posting a surprise first-quarter profit.Among other major movers was Bausch Health Companies Inc . Its shares tumbled 20.3% after the company reported quarterly results. (Reporting by Fergal Smith in Toronto; additional reporting by Shristi Achar A in Bengaluru; Editing by Shilpi Majumdar, Alistair Bell and Deepa Babington)"
    ]
}