{
    "articleURL": "/news/article-12039369/Human-remains-crocodile-near-Cairns-Queensland-search-Kevin-Darmody.html",
    "content": [
        "Police found human remains inside crocodileKevin Darmody, 65, went missing on SaturdayHe was last seen fishing at Lakefield National ParkQueensland officers out down two reptiles The remains of a man who disappeared while fishing in remote Far North Queensland have been found inside a crocodile.",
        "Kevin Darmody, 65, was fishing along the banks of the Kennedy River at Rinyirru (Lakefield) National Park, in remote Far North Queensland, at 3.30pm on Saturday.Nearby campers recalled hearing screams and frantic splashing with fears raised Mr Darmody was taken by a crocodile.Authorities believe Mr Darmody went to the water's edge to retrieve a fishing lure when he was snatched by a crocodile. Crews including the police dive squad called off their search for the 65-year-old on Tuesday after wildlife officers euthanised two crocodiles, measuring 4.1 metres and 2.8 metres, believed to be involved in the attack.",
        "Wildlife rangers from the Department of Environment and Science (DES) shot two two crocodiles on Monday night about 1.5 kilometres upstream from where Kevin Darmody was last seen.Human remains were found in one of the reptiles following a necropsy - a post-mortem examination of an animal - but both crocodiles are believed to be involved in the attack.DES operations manager Michael Joyce told ABC News rangers killed the crocodiles 'together... within 10 seconds of one another'. 'This is the second time this has occurred, the last one was during the Hinchinbrook fatality, and it is certainly something we're learning,' Mr Joyce said.'It's obviously something that does occur in crocodile populations.' Police will now prepare a report for the corner, while a formal identification process is underway. ",
        "The suspected attack has prompted calls for changes to how Queensland manages the reptiles.Queensland's Australian Party leader Robbie Katter believes the animals are spreading to waterways previously believed to be crocodile-free.Mr Katter claimed there is no other alternative but to cull crocodiles because the territorial predators are moving up the river system and overtaking the waterways.'My immediate response and it sounds a bit blunt, but how about we dump them in your river and see how you go co-existing with them,' Mr Katter said on Monday.'I take my family to the Gregory River and that's where we swim because there are no crocs but they now coming up the Gregory.'At Lake Placid, where I used to swim as a kid, you can't swim there anymore either.'",
        "By the 1970s, estuarine (saltwater) crocodiles were hunted to near extinction and as a result were classed as a vulnerable species under the 1992 Nature Conservation Act.The Queensland Government has a statewide crocodile management program which ensures public safety while enabling the ongoing survival of wild crocodiles. Problem crocodiles are removed from the wild under Queensland's management plan. Rinyirru (Lakefield) National Park, where a crocodile is believed to have snatched Mr Darmody, is one of only six key areas for saltwater crocodile conservation in Queensland. ",
        "Mr Darmody, a publican in the rural town of Laura - about 75km from where he disappeared - was a keen angler who frequently documented his fishing trips on social media.Friends said Mr Darmody, who was also affectionately known as 'Stumpy', had a deep knowledge of fishing in dangerous waters and was aware of the risks. 'He wasn't a tourist or a visitor to Cape York, he is or was a local, he knew the dangers, just bloody bad luck - in a split second you can be taken by a croc,' one person wrote on Facebook. The keen angler frequently documented his fishing trips on social media, with his most recent post, dated from 2015, showing a series of pictures of a crocodile mauling.Tributes flowed for Mr Darmody, who ran the Peninsula Hotel in Laura, with some describing him as a 'bloody top bloke' and a 'legend'. ",
        "Bart Harrison, from Cooktown, said his friend was nearby when Mr Darmody disappeared.'A lad came up on the road shouting 'he's gone, he's gone' and my mate ran down the bank and said the water was all stirred up and dirty, you could see something bad happened,' Mr Harrison told The Cairns Post.'He was standing right there fishing a few minutes earlier, then he was gone, his thongs were left on the bank,' Mr Harrison added. ",
        "'He had lived up here since I was a kid, been at the pub a long time, went fishing a lot. He knew the river pretty well, it really is sad.'"
    ]
}