{
    "articleURL": "/sport/football/article-12057663/Steve-Cooper-praises-Nottingham-Forests-collective-spirit-ahead-Southampton-clash.html",
    "content": [
        "Nottingham Forest remain in touching distance of survival despite upheaval Forest brought in 30 new players and have seen several changes off the pitch Steve Cooper's side face a vital clash against fellow strugglers Southampton As one of the most chaotic seasons for a single club in Premier League history draws to a close, Nottingham Forest still somehow have a shot at survival.",
        "Since promotion last summer, Forest have spent about £160million on 30 new players. They have not yet replaced Dane Murphy, dismissed as chief executive in January, and are on to their third recruitment chief in seven months. Other managers have been sounded out on at least two occasions this season, yet Steve Cooper has clung on. Now Cooper’s men can move within touching distance of another year in the top flight with a win against Southampton at home on Monday night.Cooper deserves credit for creating a collective spirit among a group of players who barely knew each other last August. Out of contract and out of favour, Jesse Lingard might have been going through the motions by now. Yet during the closing stages of Forest’s win over Brighton last month, Lingard was urging them on from the technical area as though he were on the coaching staff.",
        "‘I always judge the culture of a club on the behaviour of players who don’t play as much as they would like,’ said Cooper. ‘How hard those guys are working and supportive they have been has been really important to me. We don’t let outside noise in.’ NOTTINGHAM FOREST (probable, 5-1-3-1): Navas; Aurier, Worrall, Felipe, Niakhate, Lodi; Mangala; Johnson, Danilo, Gibbs-White; Awoniyi.SOUTHAMPTON (probable, 4-2-3-1): McCarthy; Maitland-Niles, Bednarek, Bella-Kotchap, Walker-Peters; Ward-Prowse, Lavia; Walcott, Alcaraz, Elyounoussi; Adams."
    ]
}