{
    "articleURL": "/money/investing/article-12042633/Will-investments-royal-boost-Coronation-weekend.html",
    "content": [
        "Household names like M&amp;S, Tesco and Wetherspoons could get a boostHotels and transport will also benefit from revellers flocking to the capitalThousands of people will gather in London this weekend for the Coronation of King Charles, the first in 70 years. ",
        "This influx of people will be good news for businesses - many of which are pinning their hopes on a boost in sales over the long weekend after a tough few months amid the cost of living crisis. But some sectors will be more likely than others to benefit from increased demand during the busy three-day celebratory weekend.",
        "Food and drinks sales in restaurants, bars and supermarkets are likely to benefit from increased demand and hotels and accommodation will also see a boom in bookings as people travel to London to see the spectacle. A short-term uplift doesn't make for a good stock pick - but existing investors in these types of firms could see their portfolios get a welcome boost as a result of the long weekend. We asked investing experts which firms are set to profit from a royal uptick in sales. SupermarketsExperts think UK supermarkets are likely to enjoy a boost over the Coronation weekend – a continuation of trends seen during last year's Jubilee celebrations.With the celebratory mood of the Coronation, many people will be planning to have family and friends over in the garden or hold a street party with their neighbours.'This is likely to be a rising tide that lifts all ships' says Sophie Lund-Yates, lead equity researcher at Hargreaves Lansdown. ",
        "&gt; Long live the King... but will Coronation keepsakes have value that lasts? But she thinks the UK's biggest supermarket, Tesco, is well placed in the grocery sector thanks to its leading market share and strong online footprint – not to mention the success of its Aldi price match campaigns.AJ Bell stock market analyst Dan Coatsworth picks household name Marks &amp; Spencer as another supermarket to watch. 'From fancy sausage rolls to bottles of prosecco, M&amp;S has it all and its reputation for higher-quality products could see it become a popular choice for those hoping to toast King Charles over the long weekend,' he says.Interactive Investor's head of investment Victoria Scholar agrees that M&amp;S's offering of Coronation bunting, tea towels, a cake stand, King Charles III mugs and ale could help boost sales this quarter, attracting those who are hosting parties at home or looking for a memorable keepsake.",
        "Pubs and beveragesRefreshing gin and tonics will likely be a staple of Coronation garden parties. Dan Coatsworth thinks tonic company Fevertree will benefit from this. 'If you are going to enjoy a gin, why ruin it with cheap tonic? he says. 'That's the key premise behind Fevertree's business strategy.'It has been successful in positioning itself as the posh tonic to accompany a quality gin.'",
        "Coatsworth also thinks Fuller, Smith &amp; Turner could get a double hit of good news from the Coronation. 'Many of its pubs are located in and around London, making it a natural place for thirsty revellers to visit if they descend on the capital for King Charles' big event, he says.Hospitality tends to do well during bank holidays, especially when there's an air of national excitement and frivolity, according to Lund-Yates.She thinks this could provide a shot in the arm to pub and restaurant sales. This would be a welcome trend for Mitchells &amp; Butlers, which owns well-known brands including Miller &amp; Carter steakhouses and a large pub and bar portfolio.As people venture out to enjoy a bank holiday tipple, bars and restaurants with trusted brands could do well.Victoria Scholar picks out JD Wetherspoon, home of cheap pints, which is marking the occasion by serving a specially-brewed real ale. Its televisions will also screen the Coronation events.'No doubt pub culture will be at its peak over the weekend of royal celebrations, helping boost sales at the pub chain,' she adds.TransportTransport is expected to be under strain during the celebrations, and increased drinking is likely to end in increased need for taxis - which will be good news for Uber. ",
        "'Recent results from the group show bookings are strong and that's likely to continue over the bank holiday' says Sophie Lund-Yates.'Financially speaking, Uber could do with the lift, as its profit position leaves a lot to be desired. 'There's always the chance that the cost of living crisis keeps a lid on demand for private car trips, but overall the events of the Coronation should culminate in a spike in demand' she continues. ",
        "Hotels and accommodationQueen Elizabeth II's Platinum Jubilee brought an additional 2.6million visitors to London last year according to VisitBritain's chief executive Patricia Yates.It is likely that the coronation could have a similar impact with a particularly strong cohort of royal fans from the United States.Airbnb is another company likely to benefit from increased bookings in London over the Coronation, Victoria Scholar remarks.She points out that the holiday home rental site has been enticing homeowners with a £100 coupon to those who host their first guest next weekend.'The company said that hosts earned over £500 over the Queen's Jubilee last year. There's likely to be a tailwind from an increase in listed properties as well as travellers from across the UK as well as overseas descending on the capital' she continues.Hotel bookings have seen a boom as UK and international revellers flock to London to take part in the celebrations.",
        "With hotels increasing prices around the busy weekend, Victoria scholar thinks Hilton Hotels and Resorts, the biggest hotel group in London could enjoy a boost from increased room bookings as well as spending on food and drinks.Obviously a short-term uptick does not make for a good stock pick. Sophie Lund-Yates points out that the true extent of any sales uplift from the Coronation will be important to monitor, and it will be crucial to understand if the increase stems from increased sales volumes, or hiked-up prices.'Customers are more price sensitive at the moment and there will be a limit to how much cost inflation can be passed onto punters without volumes dropping' she says. ",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}