{
    "articleURL": "/sport/football/article-12053567/Jaap-Stam-says-transfer-target-Jurrien-Timber-lacks-aggression-needed-Premier-League.html",
    "content": [
        "Timber was previously linked with a move upon the appointment of Erik ten HagBut the Dutch defender, 21, made the decision to stay at his boyhood club AjaxStam worries that Timber will struggle against Harry Kane and Erling HaalandJaap Stam has warned Manchester United and Liverpool that transfer target Jurrien Timber 'lacks the aggression' needed in the Premier League.",
        "The Dutch defender was previously linked with a move to the Red Devils upon the appointment of his former manager Erik ten Hag at Old Trafford.But after a string of discussions during last summer's transfer window, talks between the two parties fell through and Timber made the decision to stay at his boyhood club.Liverpool are also said to be keen on the 21-year-old, but former centre-back Stam worries Timber will struggle against Harry Kane and Erling Haaland.'The big advantage of United for Timber is that he already knows Ten Hag and vice versa,' Stam told Dutch publication Algemeen Dagblad. ",
        "'The intentions of the trainer are molded to Timber, but make no mistake: this is the Premier League. 'There you can't always be dominant, you have to duel much more against strikers like Harry Kane and Erling Haaland.'Everyone with Lisandro Martínez was also curious about that. It turns out that he did it. 'With Timber, I just miss a certain amount of aggression – sometimes even being a little mean – in his game.'That is also, for example, in giving the first blow before the real duels come. Martinez does. You can learn that too, but it has to be in you.'However, Stam believes that his former club is the better option out of United and the Reds.",
        "He said: 'You also have to look at combinations and chance of playing time.'United can still use a defender, also because Raphael Varane is prone to injury and Harry Maguire is still disappointing.'In England I therefore see United as the most logical option. And what I would like to see more often is Timber as a right back. 'There are at United, where Dalot without the ball and Wan-Bissaka on the ball don't quite convince me yet.'",
        "Speaking to Dutch newspaper De Telegraaf, Timber said: 'A transfer is getting closer and closer, so to speak.'There is a lot of concrete interest and I have made agreements with Ajax.'Last year Ajax asked me to stay for at least one more season and to extend my contract. As a club boy, I did that with love and after the season we will review the situation.'"
    ]
}