{
    "articleURL": "/news/article-12044535/Suspect-Atlanta-mass-shooting-Deion-Patterson-caught.html",
    "content": [
        "Deion Patterson, 24, was arrested on Wednesday evening at a condominium building in Cobb County, Georgia, after a seven hour manhunt Patterson is accused of opening fire inside an Atlanta hospital, killing one woman and injuring four othersHe went to the hospital with his mother to seek anxiety medication, she said, adding that the former Coast Guard employee had been let down by the VA Police in Georgia have arrested a man accused of opening fire inside an Atlanta hospital, killing one woman and injuring four.",
        "Authorities in Cobb County, Georgia, announced shortly before 8pm that Deion Patterson, 24, had been caught following a seven-hour manhunt.An undercover officer spotted Patterson and called for backup, Atlanta police said.A handgun was recovered. Police would not say whether it was legally owned. 'It does not work without a cooperative community,' said Stuart VanHoozer, chief of Cobb County police. 'Hats off to everyone who was involved in this and all of the technological foundation that was laid.'Andre Dickens, the mayor of Atlanta, said: 'This was a horrifying act of gun violence. But equally horrifying is knowing that this is not unique in the country.'He praised the police and medical professionals. Footage aired by local news station 11 Alive showed Patterson shortly after he was arrested at a condominium building, being escorted in handcuffs to an Atlanta police vehicle. He was taken from Cobb County to Atlanta for questioning, the station reported. ",
        "Patterson, who left the Coast Guard in January after five years, was identified by his mother as the suspect, shortly after the shooting. She said they went together to the hospital to get him anxiety medicine, and he opened fire.He then hijacked a car and disappeared, sparking an intense search. 'We have a national epidemic of gun violence,' said Dickens. 'We have a mental health crisis.",
        "'But it doesn't have to be this way.'We need immediate action that meets the scale of this crisis.'He called for universal background checks and closing loopholes.'We hear a lot about Second Amendment rights. But we need more action for our citizens to be able to go about their lives - to go to the doctors' office, the supermarket, school, the gas station, without the thought of being gunned down.'So you will be hearing more from me on this.' Dickens called for a crackdown on illegal guns and drug sales, as well as focus on supporting young people and improving access to job opportunities and mental health care. Patterson's hijacked vehicle was spotted near Truist Park and The Battery in Cobb County, CNN reported on Wednesday evening. Cobb County police officers announced his arrest shortly after.Hospital officials confirmed that three of the injured people underwent surgery - one was shot in the arm, one in the face, and a third in the abdomen.The fourth patient is still in the trauma unit.A 39-year-old woman was killed in the shooting in the hospital waiting room on the 11th floor, with four other women - aged 71, 56, 39 and 26 - all injured. Patterson's mother said he became 'enraged' in the lobby.",
        "Minyone Patterson, told The Daily Beast: 'The damn VA gave him some messed up medication. And all he wanted was an Ativan (pill for anxiety).'She declined to comment when contacted by DailyMail.com, but authorities confirmed that she was cooperating with them.  ",
        "The Coast Guard has confirmed that Patterson was enlisted with them in 2018, before being discharged from active duty in January 2023. In a statement they said: 'Our deepest sympathies are with the victims and their families. The Coast Guard Investigative Service is working closely with the Atlanta Police Department and local authorities in the investigation. 'Mr. Patterson entered the Coast Guard in July 2018 and last served as an Electrician's Mate Second Class.'Police were called to Northside Medical Hospital Midtown, on West Peachtree Street, after reports of an active shooter inside a building at 12.08pm. Patterson is believed to have carjacked a vehicle and fled the scene shortly before law enforcement arrived.  Four victims were transported to Grady Memorial Hospital for treatment while another was pronounced dead on the scene. One of the patients was admitted with a gunshot wound to the abdomen and another with a wound to the arm, according to a hospital representative.A third critical patient was shot in the face and required an interventional radiology procedure, which is used to stop bleeding by using catheters inserted directly into blood vessels.",
        "The three were described by the hospital's Chief Medical Officer Dr. Robert Jansen as having 'particularly serious' injuries.",
        "Officials in Cobb County were asked to search for Patterson in the Vinings, Cumberland and Truist Park areas.On Wednesday afternoon, the police cordoned off parts of the Atlanta Braves' stadium, Truist Park, as officers swarmed the area and helicopters buzzed overhead. Patterson was known to the police, but not for violent crimes. He had an arrest for marijuana possession and a parole violation, 11 Alive reported. Court documents seen by DailyMail.com show that Patterson was fined $266.50 for an excessive noise complaint in 2020.He was also given a traffic fine of $200 for being stopped in a prohibited area in May 2020. Patterson was also reportedly arrested for drunk driving in 2017, but ultimately the charges were dropped. ",
        "Dr Robert Janson, who is treating the patients at Grady Memorial Hospital said: 'We have three people in critical condition, one is in the emergency room and two are being operated on.' Raphael Warnock, a senator for Georgia and pastor of the Ebenezer Baptist Church, spoke on at the Capitol on Wednesday and condemned the easy access to guns. 'If we refuse to act while our children are dying and in a moment when no one is safe, then shame on us. Shame on us if we allow this to happen and we do absolutely nothing,' Warnock said.",
        "'My own two children were on lockdown this afternoon. They are there, I'm here, hoping and praying that they are safe – but the truth is none of us is safe.'Warnock said that 'thoughts and prayers are not enough,' calling for immediate action on gun legislation, and criticized the gun lobby.'Those who want to convince us that common-sense gun reform is somehow a call to take everybody's guns, this is not the cost of freedom … it is the cost of greed,' Warnock added.Hundreds of heavily-armed SWAT officers were on the scene, with witnesses seeing several people being taken out of the building on stretchers. In a statement Northside Hospital said: 'We are cooperating with law enforcement following the shooting at our midtown Atlanta location earlier this afternoon. 'We urge people in the area to shelter in place and follow instructions from law enforcement on the scene. 'This tragedy is affecting all of us, and we ask for patience and prayers at this time.Multiple agencies, including Atlanta police, Atlanta fire, MARTA police, Georgia Tech police, and the Georgia State Patrol responded to the situation. ",
        "Including the shooting at the Atlanta medical facility, there have been at least 190 mass shootings in the United States this year. ",
        "It is the second mass shooting in the area in less than a year, with two people killed in August of 2022 when a woman opened fire in a condo building on West Peachtree. That shooting appeared to be motivated by a dispute with the condo's board."
    ]
}