{
    "articleURL": "/wires/ap/article-12040423/Florida-execute-prisoner-1986-fatal-stabbing-woman.html",
    "content": [
        "STARKE, Fla. (AP) - A Florida man was executed Wednesday for breaking into a woman's home and stabbing her to death in 1986, a crime committed months after he was released from prison for a rape.",
        "Darryl B. Barwick, 56, was pronounced dead at 6:14 p.m. Wednesday following a lethal injection at Florida State Prison, the office of Republican Gov. Ron DeSantis said. The U.S. Supreme Court denied the inmate's final appeal for a stay of execution earlier in the day.After being brought into the death camber, Barwick said, \"I can´t explain why I did what I did. It´s time to apologize to the family ... I´m sorry.\" He added that he state needs to show more compassion and kindness for people, criticizing Florida's sentencing of teenagers to life in prison.Barwick began receiving the sedative at 6:02 p.m. and closed his eyes several minutes later. The warden checked Barwick's eyes, shook his shoulders and yelled his name to make sure he was unconscious before the execution continued.Barwick didn´t meet in person with family members in his final hours, but had spoken with them by phone in recent days, prison officials said ahead of the 6 p.m. execution time. Officials said no relatives of the victim had arranged to witness the execution.Barwick had confessed to killing 24-year-old Rebecca Wendt in her Panama City apartment on March 31, 1986, after watching her sunbathing outside and following her back to her room. He said he intended to rob Wendt but then killed her as she resisted, stabbing her 37 times as she tried to fight him off.",
        "Wendt´s bathing suit appeared as though someone had tried unsuccessfully to remove it, officials said. There was no evidence of sexual assault, but medical examiners reported finding semen on a blanket where her body was found.Authorities said they linked Barwick to the crime through his confession, the semen stain, a witness who saw him heading toward and leaving Wendt´s apartment, and footprints left inside and outside the apartment.He was convicted of first-degree murder, armed burglary, attempted sexual battery and armed robbery in November 1986, and sentenced to death two months later on the jury´s 9-3 recommendation. The Florida Supreme Court threw out that conviction in 1989 because of prosecutorial misconduct. Barwick was again convicted at his 1992 retrial, and that jury unanimously recommended death.Barwick killed Wendt less than three months after he was released from prison for raping a 21-year-old woman at knifepoint, according to court records. In his confession for Wendt´s killing, Barwick said he stabbed her because he did not want to go back to prison.DeSantis signed Barwick´s death warrant last month. It was the third execution conducted in Florida this year after a hiatus dating back to 2019. It also was the state´s 102nd execution since the reinstatement of the death penalty in 1976."
    ]
}