{
    "articleURL": "/wires/pa/article-12060129/QPR-finish-frustrating-season-home-defeat-Bristol-City.html",
    "content": [
        "QPR suffered their 12th home defeat of a miserable season as Bristol City ended the Sky Bet Championship campaign by winning 2-0 at Loftus Road.",
        "Mark Sykes and Sam Bell scored for the Robins, who ended the season 14th in the table.Rangers, who were top in October but only secured safety from relegation by winning at Stoke in their previous match, finished 20th and there is clearly lots of work for boss Gareth Ainsworth to do over the summer.Defensive lapses have been a regular feature of their dismal season and another led to them going behind on 28 minutes.Rob Dickie headed Alex Scott’s left-wing delivery as far as former Bristol City winger Albert Adomah, who, deep inside his own penalty area, attempted to clear with an overhead kick.Adomah made a hash of it, enabling Cameron Pring to cross for Sykes to finish from close range.",
        "The home defence was sliced open again six minutes before half-time, this time when Sykes played in Tommy Conway, who took on Dickie before dragging a shot wide of the target.Another ex-City player, Chris Martin, who joined QPR in February having been released by the Robins, went close to equalising early in the second half when he headed over from Adomah’s cross.Rangers threatened again when Jimmy Dunne’s glancing header from Kenneth Paal’s right-wing corner drifted wide of the far post.But there was no way back for the hosts after Bell doubled City’s lead on 55 minutes.",
        "Joe Williams chipped the ball in behind the Rangers defence, who appealed in vain for offside as Bell slotted past goalkeeper Seny Dieng.Adomah shot wide, QPR striker Lyndon Dykes saw a shot deflected over and Ilias Chair went close with a curling effort from near the edge of the penalty area as Ainsworth’s side tried to find a way back into the match.They also had appeals for a penalty waved away when Dickie went down under a challenge from Pring while attempting to get to Chair’s cross.Ainsworth made changes, sending on forwards Chris Willock and Jamal Lowe in an attempt to find the elusive goal, but City remained fairly comfortable.Lowe’s late cross evading Dykes summed up a frustrating afternoon for the west London club – and a season their fans will certainly want to forget."
    ]
}