{
    "articleURL": "/wires/reuters/article-12044459/PacWest-weighs-options-sending-bank-shares-tailspin.html",
    "content": [
        "By Anirban Sen and Noel Randewich",
        "May 3 (Reuters) - PacWest Bancorp said late on Wednesday it was in talks with potential partners and investors about strategic options after shares of the Los Angeles-based lender and several other U.S. regional banks tumbled amid fears of a worsening banking crisis. In a statement, PacWest said it had not experienced any unusual deposit outflows since the sale of First Republic Bank to JPMorgan Chase &amp;amp; Co was announced on Monday.The planned sale of its $2.7 billion lender finance loan portfolio remained on track and once completed would increase its common equity tier one ratio from 9.21% to at least 10%, the bank added.\"In accordance with normal practices the company and its board of directors continuously review strategic options,\" PacWest said.\"Recently, the company has been approached by several potential partners and investors - discussions are ongoing. The company will continue to evaluate all options to maximize shareholder value,\" it added.Reuters reported earlier on Wednesday that PacWest was exploring strategic options including a potential sale or capital raising, after a liquidity boost announced in March failed to inspire confidence in its ailing share price, citing a person familiar with the matter.PacWest shares fell 52% on Wednesday and Western Alliance was down 23%, underscoring how investors remain unconvinced about the health of regional banks despite regulators' efforts to call an end to the banking crisis that started with the collapse of Silicon Valley Bank and Signature Bank in March.",
        "Western Alliance Bancorp also sought to assure markets, saying late on Wednesday it had not experienced any unusual deposit outflows and had adequate liquidity.The Phoenix-based regional lender said it was \"reaffirming its financial strength as well as its deposit growth guidance in response to recent industry events.\"The sector jitters come after a period of relative calm, and could tighten credit availability across America and hurt growth.\"Confidence in a financial institution is built over decades and destroyed in days. As each domino falls, the next weakest bank begins to wobble,\" billionaire investor Bill Ackman wrote in a tweet.He called on regulators to put in a broad deposit guarantee.\"Until investors are rewarded for betting on a wobbling bank, there will be no bid, and the best sale is the last price,\" he wrote.PacWest stock has lost almost 90% of its value since the regional banking crisis started on March 8. Other regional lenders, whose shares have been under pressure this week, also fell, giving up gains from earlier in the day.Zion Bancorp, First Horizon and Comerica each slumped more than 7% and the SPDR S&amp;amp;P Regional Banking ETF dropped 5%.Zion and First Horizon were not available for comment after business hours on Wednesday.Comerica said although its deposits had declined in the first quarter, they remained above pre-pandemic levels and were now less concentrated with price-sensitive customers.",
        "\"We do not feel that these recent events impacting particular banks, as well as the fear currently driving stock price fluctuations, accurately reflect the overall health of the banking industry,\" the Dallas-based lender said in a statement late on Wednesday.BANKING CRISISThe crisis in U.S. regional banks began in March, when a rapid social media-driven run on Silicon Valley Bank led to its abrupt closure and sent depositors across regional banks fleeing to the safety of the largest institutions.The problems forced regulators to step in with emergency measures. The markets appeared to calm by late last month.Although First Republic, a California-based lender to the wealthy, became the third bank failure since March, regulators hoped its sale to JPMorgan in a weekend auction conducted by the Federal Deposit Insurance Corp (FDIC) would draw a line under the crisis.Instead, the deal renewed fears in the market. Some investors warned that the crisis was not over, and hedge funds bet other dominos may still fall.Major banks and private equity firms have balked at offering capital infusions to regional lenders without a government backstop because of concerns about booking losses on their low-yielding assets such as loans and investment portfolios.The cost of insuring against further losses in regional U.S. bank stocks stood on Wednesday near a one-month high in options markets.",
        "Earlier on Wednesday, U.S. Federal Reserve Chair Jerome Powell reiterated that the country's banking system was resilient while delivering another 25 basis point rate hike. Powell said bank deposits had stabilized.STRATEGIC OPTIONSPacWest has branches in California as well as Durham, North Carolina and Denver, Colorado. In its first-quarter earnings last week, its deposits had stabilized after some customers pulled their money.The bank, one of the top 100 U.S. banks, is hoping to avoid the fate of others that were taken over by U.S. regulators by proactively finding a solution to bolster its finances, the person familiar with its strategic options told Reuters, asking not to be identified because the matter is confidential.The effort comes after the bank raised $1.4 billion from investment firm Atlas SP Partners in late March.(Additional reporting by Tatiana Bautzer, Nupur Anand, Matt Tracy, Medha Singh, Niket Nishant and Chibuike Oguh; Writing by Paritosh Bansal and Scott Murdoch; Editing by Anna Driver and Jamie Freed)"
    ]
}