{
    "articleURL": "/news/article-12058947/Met-Office-issues-yellow-weather-warning-thunderstorms-lighting-strikes-flooding.html",
    "content": [
        "A yellow weather warning of thunderstorms is in place until 9pm this eveningThe Met has issued flood alerts with heavy showers and temperatures of 19CBrits have been warned of heavy showers, thunderstorms and flooding this week as turbulent weather continues to put a damper on King Charles's Coronation celebrations. ",
        "The Met Office issued a yellow weather warning for thunder, lightning strikes and hail which will stay in place until 9pm this evening. Damage to buildings and structures from the strikes is likely, according to the Met, while flooding in homes and businesses is also anticipated.  The Met added there is a 'good chance' that driving conditions will be affected by spray, standing water and hail, 'leading to longer journey times by car and bus'. The yellow warning is in place for Northern Ireland and south western Scotland, while scattered showers are set to sweep across the UK this week. One photograph shows an aircraft taking off at Leeds Bradford airport in Yorkshire this morning as much of the UK endures a wet bank holiday Monday. ",
        "The Met Office told MailOnline today is 'not the best of bank holidays' - with areas such as Leeds experiencing 'heavy' rain while some brighter spells are possible this afternoon.  Rain will continue to plague the city through the evening but will become drier with some clear spells overnight, with 'outbreaks of showery rain likely persisting,' according to the Met.  Early sunshine was initially seen in the east this morning while other parts of the UK remained cloudy with outbreaks of rain pushing east.Things are looking up towards the weekend as Friday and Saturday will see fewer showers and pleasant temperatures of 20 to 21C. ",
        "'In any sunshine this week it will actually feel quite warm,' said the Met. They added that forecast for the rest of May looks 'fairly changeable', with 'further spells and unsettled weather' anticipated. It comes after heavy showers dampened King Charles's Coronation weekend, with royal fans camping out and waiting in queues to witness the event being drenched by downpours. "
    ]
}