{
    "articleURL": "/wires/aap/article-12040411/NSW-climate-activist-Violet-CoCo-arrested-Perth.html",
    "content": [
        "High-profile NSW environmental activist Violet CoCo will spend the night behind bars after she spray-painted a gas company's logo on a Perth police station during a protest.",
        "Deanna \"Violet\" Maree CoCo on Wednesday used a stencil to paint four yellow Woodside Energy logos on the front windows of the Perth Police Centre, according to activist group Disrupt Burrup Hub.The group says she was arrested at the scene and later charged over the incident. It not known what offences Ms CoCo has been charged with.WA Police denied Ms CoCo bail and held her in custody ahead of a court appearance on Thursday, a spokesman said.Earlier, Disrupt Burrup Hub said Ms CoCo's actions at the police station were an act of solidarity with local campaigners targeted by police amid an escalating crackdown on protesters.After the incident, Ms CoCo said police \"repression\" of peaceful protest was rapidly escalating in WA in the same way she has repeatedly experienced in NSW.\"I am a survivor of the authoritarian crackdown on environmental protest on the east coast and I have come over to WA to sound the alarm and stand in solidarity with campaigners facing the same police state repression here,\" she said in a statement.The NSW District Court in March wiped Ms Coco's 15-month prison sentence for parking a truck on the Harbour Bridge and blocking a lane during morning peak traffic in April 2022, which was part of an environmental protest against climate inaction.",
        "Ms Coco was issued with a 12-month conditional release order after the court heard she had initially been imprisoned on false information from NSW Police.She was among the first people charged after the NSW parliament hiked penalties and expanded the reach of laws targeting those who block traffic on major routes.Disrupt Burrup Hub says environmental campaigners have been subject to increasing police overreach in recent months in response to a campaign targeting Woodside's Burrup Hub project.This has allegedly included house raids, data seizure and excessive charges after activists sprayed the Woodside logo on a famous Fredrick McCubbin painting at the WA Art Gallery and WA's parliament building.The group has called for industrial development on the Burrup Peninsula, about 30km west of Karratha in the Pilbara region, to be stopped, including Woodside Energy's expansion of the Pluto gas plant.Ms Coco claimed the WA government was using the police force to protect fossil fuel polluters, including Woodside Energy.\"Woodside love to slap their logo on the prized cultural institutions in this state at the same time they spray their toxic emissions all over sacred First Nations rock art and our children's future,\" she said.\"But the biggest sponsorship deal in this state is between Woodside and the WA government, who use the WA police as Woodside's personal protection service.\"",
        "The Burrup Peninsula, known as Murujuga to traditional owners, contains the largest and oldest collection of petroglyphs in the world.Disrupt Burrup Hub has released video of Ms Coco's arrest. WA police have been contacted for further details."
    ]
}