{
    "articleURL": "/wires/ap/article-12039521/Grizzlies-no-plans-bring-Brooks.html",
    "content": [
        "The Memphis Grizzlies have no plans to bring Dillon Brooks back to the team when he hits free agency this summer, a person with knowledge of the situation said Tuesday.",
        "Brooks was offered an extension last year but turned it down. The Grizzlies have since decided that he won´t be in their future plans, said the person who spoke to The Associated Press on condition of anonymity because neither the team nor Brooks released details publicly.The Athletic first reported the Grizzlies´ decision, and it was subsequently confirmed by ESPN.Brooks just completed a three-year contract that paid him $35 million. He led the NBA with 18 technical fouls this season, earning a pair of one-game suspensions for surpassing the league threshold for technicals.He also was fined $35,000 for shoving a camera person on the sideline while chasing a loose ball in Miami in March, which he apologized for later. He was suspended a game in February for hitting Donovan Mitchell in the groin in February, costing him $78,621 in pay, according to Spotrac.com.The NBA fined Brooks on Sunday $25,000 for not talking to the media after some of Memphis´ losses in its first-round playoff series against the Los Angeles Lakers. The NBA says Brooks violated league rules for \"media interview access.\"",
        "That included Brooks bolting the Memphis locker room after the Game 6 series-clinching loss before reporters were allowed inside. That 40-point loss was the biggest in franchise history for Memphis, which came in as the West's No. 2 seed for a second straight season.",
        "Grizzlies general manger Zach Kleiman was asked about Brooks' future with Memphis on Sunday. Memphis acquired the 6-foot-6 Brooks, who was the 45th pick overall out of Oregon, in a draft-night trade from Houston in 2017. Brooks had started 318 of 345 regular-season games in his career.\"I'll hit on DB another day, but nothing I could comment on for now with him going into free agency,\" Kleiman said then. ___AP Basketball Writer Tim Reynolds in Miami contributed to this story.___AP NBA: https://apnews.com/hub/nba and https://twitter.com/AP_Sports"
    ]
}