{
    "articleURL": "/sport/formulaone/article-12041719/Johnny-Herbert-slams-DANGEROUS-interview-published-Michael-Schumacher-using-AI.html",
    "content": [
        "Former F1 star Johnny Herbert was once a team-mate of Michael Schumacher He revealed the pair didn't enjoy a great relationship during their F1 careersHerbert also slammed an AI generated interview with Schumacher as 'appalling' Former F1 driver and pundit Johnny Herbert has revealed he didn't enjoy a great relationship with Michael Schumacher during his career.",
        "The legendary German, who won seven world championships during his illustrious time in the sport, regularly competed with British star Herbert and the pair were even team-mates during the 1994 and 1995 seasons for now-defunct F1 team Benetton.However, Herbert - who served as the constructor's No. 2 driver - explained how it was a role that wasn't easy and he didn't get on especially well with Schumacher.'We didn’t always see eye-to-eye,' he told Ice 36. 'He was ruthless. But that is why he achieved what he achieved. He had a way that he wanted to go about his racing. 'He was fortunate that he got the right people around him with Flavio Briatore, Ross Brawn to Rory Byrne, and he took those people to Ferrari.",
        "'I remember Ross saying Michael was the best driver he had ever worked with. Because of that they would do anything for him. And I mean anything.'Because of that, Michael gets that motivation, they get the motivation back because he gives it back, and together they deliver. Then it becomes a cycle of success.'Herbert also admitted that despite the pair not always getting on, it was hard not to respect Schumacher's achievements in the sport.Herbert continued: 'I still remember what for me was his standout performance in the Ferrari, in the wet in Barcelona in 1996.",
        "'It was his first victory for Ferrari. It was a stunning drive in torrential rain and why he was thereafter called the \"Regenmeister\", the Rainmaster. It was an unbelievable drive.'Yes, there was a darker side to him too, but at the end of the day you can’t deny anything he did.'Herbert also slammed an interview that had been published last month with Schumacher, using artificial intelligence (AI) as 'appalling'. ",
        "Schumacher's family are planning legal action against a German magazine that promoted an 'exclusive interview' with the F1 legend last month - before revealing it had generated his quotes using AI.Die Aktuelle came under fire for running a front page featuring a photograph of Schumacher, claiming it was 'the first interview' he had given since a skiing accident in December 2013 left him in a medically induced coma. He hasn't appeared publicly since.The F1 legend is cared for by a team of medical staff and his wife Corinna at their Lake Geneva home.Little has been made public about his condition ever since and so news that the stricken driver had conducted an exclusive interview quickly turned heads.'That German magazine interview was appalling,' Herbert said. 'This is the modern, mad world of AI and how dangerous it can be. That was a prime example of using it in completely the wrong way.",
        "'I can understand the fascination with Michael because it is a story that has not had an ending yet. 'There is an endless fascination about Michael. I don’t have any contact with the family. It is all kept very tight.'The front page of the magazine had showed off the interview with Schumacher, offering a sub-heading that read 'it sounds deceptively real', which immediately led to questions over the interview. The article opens: 'Talk to him once. Ask him how he's really doing. And finally got answers almost ten years after his tragic skiing accident.'No meagre, nebulous half-sentences from friends. But answers from him! By Michael Schumacher, 54! ",
        "My life has changed completely since [the accident]. That was a horrible time for my wife, my children and the whole family. I was so badly injured that I lay for months in a kind of artificial coma because otherwise, my body couldn't have dealt with it all. Much better than years ago. With the help of my team, I can even stand on my own again and even walk a few steps slowly.My family and children have been a blessing to me and without them, I would not have been in business.Of course, they are very sad about how everything went, but unfortunately, that's life and I just have to endure the fact that things sometimes go badly.They support me and stand fast at my side.",
        "'Here it is - the incredible interview! With redeeming answers to the most burning questions the whole world has been asking for so long.'The article, which did not feature a byline, ended with an admission that the quotes are in fact fake and the magazine had not spoken to Schumacher or anyone in his family. 'Did Michael Schumacher really say everything himself? The interview was online. On a page that has to do with artificial intelligence, or AI for short,' the widely derided piece concludes.F1 fans condemned the magazine for its 'lack of decency' and the 'shame' in purporting to have spoken to Schumacher. "
    ]
}