{
    "articleURL": "/sport/football/article-12051391/Trent-Alexander-Arnold-reveals-dream-4-team-including-Messi-Ronaldo-Zidane.html",
    "content": [
        "Alexander-Arnold has picked his dream 4-a-side team and it's forward thinkingThe defender has backed himself to hold it down at the back by himselfLiverpool defender Trent Alexander-Arnold has revealed his dream 4-a-side team, including some legends of the game, as he will be tasked with the defensive responsibility.",
        "The defender has been on form for Liverpool in recent weeks since Jurgen Klopp switched his role in the side, seeing the wing-back act as a midfielder in possession for the Reds.However, Trent still backs himself to do the majority of the defensive work in his dream 4-a-side team as he picks an incredibly attacking lineup.In the latest episode of We Go Again, Alexander-Arnold explained his team to Red Bull: 'Me, Messi, Ronaldo and Zidane. 'Yeah, I think I would be more defensive, just like passing and that. I think Messi and Zidane, they would be the creators, like the maestros. Ronaldo would be a lethal finisher.'",
        "It's no surprise to see the England 24-year-old include Messi and Ronaldo in his team, as undoubtedly the two greatest players of the current generation.Opting for Zidane over somebody like Liverpool legend Steven Gerrard may have come as a surprise to the Reds fans, but nobody can argue with the inclusion of a footballing great.Interestingly, Trent has trusted himself in a one-man defence after criticism over his defensive work in recent months.Liverpool as a collective have struggled to keep the goals out, as is shown as they currently sit 6th in the Premier League table after being used to competing for the title against Manchester City in recent years.",
        "The Liverpool defener has offered his verdict on this season's title race, and things that the conclusion will be 'obvious'.'The league’s obvious now and I’ve said it for a while,' he continued. 'If City are even anywhere close, if they smell blood at Christmas, New Year - it’s game over really, there's no stopping them once they start winning and now at this point, I'd be surprised if they drew a game. 'I think it's just got to be mindset, I think it's just the messaging because they don't even go behind in games at this point. There's no messing around, there's no scares, there’s no ups and downs. 'Arsenal was exciting because they were dropping points, but in an exciting way. Whereas City, I don’t even know how to describe it, it’s like juggernauts.'To watch the full Trent Alexander-Arnold ‘We Go Again’ interview head to redbull.co.uk "
    ]
}