{
    "articleURL": "/tvshowbiz/article-12050519/Coleen-Rooney-cuts-casual-figure-workout-gear.html",
    "content": [
        "Coleen Rooney cut a casual figure while out and about in Cheshire on Friday. ",
        "The mother-of-four, who is married to former England footballer Wayne, donned a black sweatshirt and leggings for her outing.Coleen, 37, added a pair of trainers to her comfortable look and opted to go makeup-free, letting her natural beauty shine through.The beauty wore her brunette locks in a sleek high ponytail as she strolled around.Coleen grinned down at her phone and kept her accessories to a minimum, opting for a simple pair of silver hoops. ",
        "She made the low-key appearance in Cheshire after going to see Sheridan Smith in Shirley Valentine with her mother on Wednesday.Coleen and her lookalike mother Colette beamed as they took the trip to the theatre. She looked gorgeous for the day, where she opted for a pair of luxury Chanel sunglasses and a black and beige jersey jacket.The stunner styled her brunette tresses tied back into a ponytail and accessorised with dainty hoop earrings.Colette looked equally elegant for the day out, rocking a white T-shirt layered with a black blazer. Covering up from the sun, she also threw on a pair of stylish sunglasses and left her locks in a chic bob.Sharing the sweet snap to her Instagram, Coleen wrote: 'Twice in a week, back with my mum. Amazing show @shirleyonstage @sheridansmithster #ShirleyValentine'.",
        "Their outing comes after Coleen marked her late sister Rosie's birthday with a sweet video, ten years after she passed away aged 14.The WAG celebrated what would have been her sister's 24th birthday and wrote: 'Love you.'Rosie passed away in 2013 following her lifelong battle with Rett syndrome, a rare brain disorder that causes severe disabilities. In the clip posted to Instagram, Coleen could be seen playing with Rosie as she giggled before planting a kiss on her face. "
    ]
}