{
    "articleURL": "/news/article-12051679/Shocking-moment-woman-lashes-Kings-Guard-pushing-way.html",
    "content": [
        "Blonde woman was standing in guard's path despite a previous warning to move READ MORE: King's Guard horse headbutts a tourist as she stands too closeFootage shows the shocking moment a woman lashed out at a King's Guard for 'pushing' her out of the way as he carried out his duties. ",
        "The incident, which went viral on TikTok, shows the blonde woman standing in the guard's way at the Horse Guards Parade.The woman, who was holding a blue can of Pringles, was seen standing very close to one of the mounted guards, while other bystanders gave the guards more room by standing further away.Despite the King's guard on foot asking the woman to step back when he first passed her to salute his fellow guards, she stepped even closer to the agitated horse of the mounted guard.When the guard that had previously warned her walked back towards the gates, the woman moved right into his path.",
        "He shouted 'make way' and used his arm to move the woman out of his path, which left her furious.She shoved her can of Pringles into the guard and turned around to the crowd asking if they saw what happened, only for another bystander to reply: 'He asked you to move and you didn't do it'.Still trying to look for sympathy among the gathered crowd, she pulled up her sleeve and claimed she 'got a broken arm'.A police officer then appeared, who politely asked her to leave, but the woman continued ranting at the mounted guard and at the policeman.",
        "After arguing for several minutes, the woman finally left the scene. The guards are known to carry on their duties - to protect the official entrance to St. James's Palace and Buckingham Palace - no matter who stands in their way.Many TikTok users who commented on the viral video pointed this out, with one saying: 'The King's Guards have a job to do and some people need to respect them all.'Another weighed in: 'I still can't believe she wasn't arrested.' Many remarked that the woman's behaviour showed no respect to the King's Guard and that everyone knows to move when the guards say so.",
        "This isn't the first time tourists have ignored warnings at the Horse Guards Parade. Last week, a King's Guard horse took its job to protect Buckingham Palace very seriously when a tourist stood too close for comfort.Video shows the shocking moment the horse clamped down on a woman's ponytail as she posed for a photo at the Horse Guards Parade.The animal, ridden by a soldier from the Blues and Royals, was mounted next to a sign warning visitors: 'Beware! Horses may kick or bite.'The clip shows the horse swinging its head towards the woman as she stands with her back to the animal. The animal then bites down on her hair, flailing her around, until she manages to break free and scurry off. ",
        "The incident came just weeks after a furious member of the King's Guard shouted at a tourist who twice tried to grab his horse's reins.",
        "The King's Guard is the name given to the group of soldiers responsible for guarding Buckingham Palace and St James's Palace.Traditionally, guards stand still while on sentry duty, which lasts for two hours, before they then have a four-hour break.Every 10 minutes, they come to attention, slopes arms and do a march of 15 paces across the area of the post.They must work regardless of the weather, and must follow strict rules such as not grinning or laughing, which can result in a £200 fine. Guards are not generally allowed to talk to the general public, but in certain circumstances, such as when people obstruct them, they can shout a warning to get them to move."
    ]
}