{
    "articleURL": "/wires/reuters/article-12060861/US-government-Texas-surge-personnel-Mexico-border-Title-42-end-looms.html",
    "content": [
        "By Ted Hesson and Mike Blake",
        "SAN DIEGO, May 8 (Reuters) - The Biden administration and Texas state government are sending reinforcements to the U.S.-Mexico border to prepare for a possible increase in illegal immigration when COVID-19 restrictions known as Title 42 are set to end on Thursday.Hundreds of specialized investigative agents and air marshals from the U.S. Department of Homeland Security (DHS) are being pulled from day-to-day duties to help with border management, sources said, leading to pushback from some employees who argue they are being reassigned to menial tasks.At the same time, Texas deployed a specially trained National Guard unit on Monday to target \"hot spots\" where migrants try to enter the United States illegally, Governor Greg Abbott said.The moves are part of broader efforts by President Joe Biden, along with state and local officials, to prepare for the end of the Title 42 order on Thursday. The order, in place since 2020, allows U.S. authorities to quickly expel migrants to Mexico without the chance to seek U.S. asylum.The policy shift is expected to lead to a rise in border arrivals as a result of pent-up demand and the perception among migrants that they will be allowed into the country.Near San Diego, California, on Monday, hundreds of migrants were waiting between two U.S. border fences as U.S. Customs and Border Protection appeared to struggle to process them, a Reuters witness said. Dozens reached through the fence asking for food at one point as volunteers brought peanut butter sandwiches, oranges and water.",
        "\"We don't know who is encouraging them. That is the million-dollar question. We think it might be the traffickers,\" said Enrique Lucero, director of migrant affairs for the city of Tijuana in Mexico.Adriana Jasso, a human rights advocate for the American Friends Service Committee, said people who expected to be processed for asylum claims have instead been stuck at the border for days, exposed to the overnight cold.\"We have situations of moms with babies,\" Jasso said. \"There is uncertainty. There is anxiety.\"TEXAS TACTICSAbbott - a Republican who has criticized the Democratic president's approach to border security - said members of the new National Guard unit, the Texas Tactical Border Force, were being loaded onto Black Hawk helicopters for deployment and will have access to aircraft, boats, night vision equipment and riot gear.In recent days, the National Guard suppressed migrant crossings at Brownsville, Abbott said at a news conference, the same city where a driver plowed into a group of migrants on Sunday.Separately, Biden is sending 1,500 additional troops to help secure the border.In addition, 250 to 300 agents with the investigative arm of U.S. Immigration and Customs Enforcement (ICE) will be detailed to aid border operations, two U.S. officials who requested anonymity to discuss internal operations said.",
        "A separate official not authorized to speak publicly said the deployment \"negatively impacts our ability to disrupt transnational criminal activity,\" since many of the agents work on complex cases dealing with illicit drugs, trafficking and other issues.About 180 U.S. air marshals will be pulled from their jobs securing air travel to help at the border, said Sonya LaBosco, executive director of the Air Marshal National Council, which opposes the deployment.Both ICE investigators and air marshals have been tapped in recent years for border management efforts, leading to some resistance. DHS and ICE did not respond to requests for comment. (Reporting by Ted Hesson and Doina Chiacu in Washington, Mike Blake in San Diego and Lizbeth Diaz in Mexico City; Editing by Mica Rosenberg, Jonathan Oatis and Rosalba O'Brien)"
    ]
}