{
    "articleURL": "/femail/relationships/article-12045149/SAMANTHA-X-sex-secrets-escorts-use-make-work-relationship.html",
    "content": [
        "Samantha X says confidence is the key to a man's desireWomen should also know what they like in bed and work on their dirty talk Sex is sex is sex. Despite the emotional angst that comes with it, the act of sex is basic, simple, and more than often, over in minutes. (I was going to say seconds but don't want to cause offence).",
        "The funny thing is, despite my decade in the adult industry, I very rarely talk about sex. Believe it or not, I am quite conservative.And despite my experience as an escort and getting to know men better than they know themselves, the job was always more about connection and emotional intimacy rather than the physical side of things.Sex isn't the number one reason why men book escorts. It's not the main reason they spend thousands and thousands of dollars and I've talked at length about why they cheat – that they are searching for something deeper than a quick bonk in bed. Because let's be honest, sex isn't hard to get these days, regardless of gender.",
        "Pizza? Order in. Booze? Order in. Sex? Which online dating app will it be tonight?As well as I know how men think and why they behave the way they do, I also know what they like in bed. I also know they find it hard to vocalise their secret desires, so I'm going to do it for them.Here are the top three bedroom tricks that turn men on. Sex is a two-way street, and women's needs are just as important, but I'll get to those in another column.1. ConfidenceI've said it before, but it really is the number one thing that turns them on. ",
        "You don't need to have a size 8 body, you don't need big fake boobs or a labiaplasty to be sexy – you are sexy as YOU ARE. Keep the lights on, open the curtains, don't hide in the dark hoping he doesn't see your stretch marks. He won't notice them as much as you do. Don't be apologetic about your body, don't point out the things you hate about the way you look. Own who you are, without apology. Nothing turns a man on more than a woman who owns it. And I can assure you, they're more concerned about how they look naked just as much as you are. We live in a fake world, where our lives and looks are filtered. It's not real, and it's intimidating for us all. The most successful escorts I know are girls next door, real women, real bodies. Be authentic, be confident and be unapologetically you. The old adage 'fake it till you make it' is spot on when it comes to taking your clothes off.",
        "2. Dirty talkThere is an art to dirty talk and the biggest tip I can give you is the more subtle it is, the sexier. If you yell: 'Give it to me now big boy', chances are he will, and it will all be over before your head hits the pillow. Or the pressure will all be too much and he loses his erection. ",
        "What I've learnt is that slow and steady wins the race, imagine sexy scenarios, paint a picture in his head, build tension slowly. I'm not telling you to pretend he's the handyman coming to fix your washing machine – we know sex isn't a German porno – but imaginative roleplays work wonders.3. Know your bodyThis one is super important. You must know what turns you on. Because if you don't, how the hell will he? Sex can be associated with shame. Many of us feel ashamed about liking it a certain way, or feel too embarrassed to vocalise what we want in bed. Don't be. The more you understand your body and what turns YOU on, the more turned on he will be. You are making his job a lot easier, and when you are in the throes of pleasure, he will be. Nothing turns a man more on than seeing his partner excited and enjoying it. It's a huge ego boost for them, plus they want to see the person they love happy. If you don't know your body, or know what you like in bed, experiment. Invest in sex toys, explore your body. The sexual wellness industry is booming. Sex is supposed to be fun. It's supposed to bond two people. ",
        "You aren't having sex to keep them happy (or at least you shouldn't be), you should be enjoying the act of pleasure just as much for you as them.Men aren't that complex, their needs are simple. But as for women? Our needs are far more sophisticated. Intrigued? Find out next time. "
    ]
}