{
    "articleURL": "/wires/aap/article-12061129/NSW-coalition-bench-resolved-eleventh-hour.html",
    "content": [
        "With notable absences and a host of fresh faces, the NSW opposition front bench has been revealed just hours before the new parliament met for the first time.",
        "It came after a dramatic Monday in which the Nationals ousted leader Paul Toole, replacing him with Bathurst MP Dugald Saunders.Mr Toole was dumped in the midst of a party furore over colleague Ben Franklin's push to become upper house president - a move that will rob the coalition of a vote in the Legislative Council and give Labor more control of that chamber.The Liberals also finalised their leadership team, changing party rules to elect upper house MP and rising star Natalie Ward as deputy to Opposition Leader Mark Speakman.The upheaval left Mr Speakman applying the finishing touches to his shadow ministry six weeks after the election and the night before Tuesday's first sitting day of the 58th NSW Parliament.\"There have been a few bumps along the way but here we are,\" he told reporters on Tuesday morning.\"It's a strong mix of talent, experience and fresh faces and we are collectively determined to take the fight to Labor in the interests of the people of NSW.\"The coalition would focus on cost of living challenges, tighter family budgets, housing affordability, reliable energy, local infrastructure needs and integrity in government, he said.Notably, the new 26-member coalition team includes seven MPs with no ministerial experience and improves substantially on the Perrottet ministry's gender split, with 11 women.",
        "The 23-member state cabinet headed by Premier Chris Minns also has 11 women.\"There's obviously more to go in achieving women participation but this is a big leap on where we were before,\" Mr Speakman said.Emphasising a vision for the future, Eleni Petinos returns from exile to take on sport and finance, while the environment portfolio goes to Kellie Sloane, one of more than a dozen MPs sworn in for the first time on Tuesday.Matt Kean will be the opposition health spokesman while Ms Ward has responsibility for transport, roads and infrastructure.Former premier Dominic Perrottet declined a place on the front bench and Father of the House and former minister Anthony Roberts also knocked back an invitation to \"make way for fresh talent\", Mr Speakman said.Their decision prompted speculation they were considering resigning from parliament but the opposition leader said he hoped all MPs would serve out their full terms.Liberal Damien Tudehope is shadow treasurer, Alister Henskens is shadow attorney-general and James Griffin is responsible for energy and climate change.Despite his dumping as party leader, Mr Toole holds responsibility for police but loses the regional NSW portfolio to Mr Saunders, who will also speak on agriculture issues.Deputy Nationals leader Bronnie Taylor will be the chief coalition advocate for trade, seniors and regional health while former education minister Sarah Mitchell sticks with that portfolio.",
        "As is the case for two dozen shadow portfolios, Ms Mitchell and Ms Taylor's ministerial counterparts are in the opposite house, preventing them from going toe-to-toe in question time.Mr Franklin's expected election as president was reinforced by his exclusion from the shadow ministry.Whether he remains in the Nationals at all would be considered down the line, Ms Taylor said, revealing she'd pleaded with him to \"please don't do this\".\"It's been a very disappointing process and that's the honest truth about it,\" she said.\"Ben has made his own decision and he will be responsible for it.\""
    ]
}