{
    "articleURL": "/wires/reuters/article-12045075/Nationals-hunt-3-game-win-streak-finale-vs-Cubs.html",
    "content": [
        "More than a month into the season, the Washington Nationals might be finding a groove for the first time.",
        "The Nationals will aim for their first three-game winning streak of 2023 when they face the visiting Chicago Cubs on Thursday afternoon in the finale of their four-game series.The Cubs, who won the series opener on Monday, scored only one run per game in losing the next two. They have lost five of their last six games and 9 of 13 to fall back to .500 (15-15) for the first time since April 9.Through his first 21 games, Nationals shortstop CJ Abrams had just eight RBIs. He has driven in seven more in his last eight games to take the team lead.\"He's getting some big hits for us, but more so than that, he's playing really good defense,\" Washington manager Davey Martinez said.Martinez said one of the Nationals' best games came Wednesday night because of the way his fielders performed behind the pitchers.The Nationals will go with left-hander Patrick Corbin (1-4, 5.74 ERA) on Thursday. In his five starts in April, Corbin worked at least five innings every time out, but Washington has lost four of the six games he has started this season.Corbin is 5-2 with a 4.19 ERA in 10 all-time appearances -- including nine starts -- against the Cubs.Chicago didn't have a starting pitcher listed on Wednesday night, but multiple reports said it would be right-hander Jameson Taillon (0-2, 4.50 ERA).",
        "Taillon will be coming off the injured list after dealing with a groin injury and make his first start since April 15. In that game, he threw five shutout innings against the Dodgers in Los Angeles.Taillon is 0-1 with a 3.86 ERA in five career starts against Washington.The Nationals activated utility player Ildemaro Vargas (shoulder) from the injured list on Wednesday, a development that should add more flexibility for Martinez. Vargas, who is 1-for-12 to start the season and has not played since April 9, did not see action Wednesday night.Jeter Downs was sent back to Triple-A Rochester after playing in only one game during a three-week stretch.\"(Vargas) understands the situation,\" Martinez said. \"He has got to stay ready. He's done it before. He'll stay positive. For someone like Jeter who is 24 years old, it's a different story. If one of our middle infielders go down, we view him as the next guy to come up and play at that position. But he's got to go play (in the minors).\"The Cubs officially placed catcher Yan Gomes on the seven-day concussion injury list (retroactive to Tuesday) after he was hit on the head by a backswing from Washington's Jeimer Candelario.Miguel Amaya has arrived from Double-A Tennessee, so he could make his major league debut. With a day game following a night game, there's a good chance that Amaya could be in Thursday's lineup after Tucker Barnhart was Wednesday night's catcher.",
        "\"It has been a roller-coaster, ups and downs,\" Amaya said. \"A lot of work, mentally.\"Regardless, the Cubs figure to count on shortstop Dansby Swanson, who has appeared in 29 of Chicago's 30 games this season. He had gone 7-for-15 in three games prior to going 0-f0r-4 on Wednesday night.\"I love winning and competing, and when you've got a great group of guys like we do, you do it for each other,\" Swanson said. \"You never want to disappoint anyone, never let anyone down. That's one of my biggest fears - letting people around me down.\"--Field Level Media"
    ]
}