{
    "articleURL": "/wires/pa/article-12039509/Shrewsbury-boss-Steve-Cotterill-heaps-praise-loanee-Rob-Street.html",
    "content": [
        "Steve Cotterill paid tribute to matchwinner Rob Street as Shrewsbury ended their home campaign with a 2-1 victory over Bristol Rovers.",
        "The Crystal Palace loanee doubled Town’s advantage after captain and ex-Rovers star Luke Leahy headed the opening goal after three minutes on his 100th appearance for the club.Middlesbrough loanee Josh Coburn ended his near four-month goal drought with a 70th-minute reply for the visitors.But Rovers’ hopes of avoiding a sixth game without victory ended with a miss by substitute Luca Hoole and a fine save from Marko Marosi to deny Coburn a second.“It was brilliant for Rob,” said Cotterill after Shrewsbury’s first win in nine and Street’s fourth goal of the season after 53 minutes. “He hasn’t trained this week from the game last weekend.“And he went to his granddad’s funeral this morning (Tuesday) then drove up from London.",
        "“He deserves a large amount of credit for playing. I couldn’t be happier for him.“He works a lot on it (finishing) but a lot of it is confidence. It is all well and good him coming from Crystal Palace but he hadn’t played at League One level.”On the three points to lift Shrewsbury into the top half of the table, Cotterill added: “It is nice to hear ‘excellent win’ because it has been a long time coming.“Look at them making five substitutes. Their calibre of subs would be in our starting line-up.",
        "“It must be a delight for Joey to have a squad that size.“They have a budget that is probably twice ours. But we have taken four points out of six off Bristol Rovers and that’s a good return.”Rovers boss Joey Barton said: “We lost the game so I don’t want to be too negative towards Shrewsbury.“We have got to defend our box better. In the first five minutes we were a goal down and that gave them something to hang onto.“Stats are only a pointer towards a performance, the main one being we lost 2-1.“But when we got our more technical players on the pitch, we took control,” added Barton who introduced five replacements in one go after Shrewsbury went 2-0 up.“We were in the ascendancy towards the back end of the game.“Part of the strategy was to open up late in the game. But we didn’t envisage being two goals down to a team like Shrewsbury.“There were loads of good things but it encapsulates the season in a nutshell.”"
    ]
}