{
    "articleURL": "/tvshowbiz/article-12042521/Kate-Bush-George-Michael-inducted-Rock-Roll-Hall-Fame.html",
    "content": [
        "Kate Bush and George Michael are set to be inducted into the Rock and Roll Hall of Fame later this year, it has been announced.",
        "The legendary artists will join the class of 2023 being inducted in a ceremony in New York on November 3.The Cleveland-based institution announced Wednesday the artists and groups entering the hall as the class of 2023, including names such as Missy Elliott and Sheryl Crow.Artists are eligible to enter the Hall of Fame 25 years after releasing their first single, and fellow inductee Missy Elliott has made the cut on her first year of eligibility. George's inclusion came following a fan vote, which was counted alongside official ballots. The late Wham! star beat out fellow legends Cyndi Lauper and Warren Zevon.",
        "His induction also comes on the 40th Anniversary of Wham's album debut album, Fantastic, which is also being marked with an upcoming Netflix documentary and Greatest Hits collection.George, who died in 2016, was cited for 'paving the way for a generation of proud LGBTQIA+ artists, from Sam Smith to Lil Nas X to Troye Sivan'.Kate had been nominated three times before, in 2018, 2021 and 2022, and was finally admitted despite the fact she hasn't released any new music since 2011.Last year, Kate saw a huge resurgence in popularity when her song Running Up That Hill returned to number one after featuring in the fourth series of Stranger Things.",
        "If Kate were to travel to New York for the ceremony, it would be her first public appearance since 2014. The hall hailed her for 'using lush soundscapes, radical experimentation, literary themes, sampling, and theatricality to captivate audiences and inspire countless musicians.' Kate's inclusion was defended by Courtney Love, who hit back at one voter anonymously told Vulture he wasn't aware of her music.She tweeted: 'Bro! The rest of us have been LIVING KATE BUSH since 1977! Too much power in the hands of IDIOTS.'",
        "Speaking ahead of the unveiling, Joel Peresman, president and CEO of the Rock &amp; Roll Hall of Fame Foundation, said: 'When you can go from Link Wray, who was one of the early influencers, to Missy Elliott and Kate Bush and The Spinners and Rage Against the Machine and Willie Nelson, you have a very diverse body of work. 'What we are always trying to show is that rock 'n' roll is a big tent and a lot of people belong.'Missy Elliot has become the first female hip-hop artist in the rock hall, which called her 'a true pathbreaker in a male-dominated genre.'Other names set to be inducted are The Spinners, Rage Against the Machine, DJ Kool Herc, Link Wray, Al Kooper and Elton John's longtime co-songwriter Bernie Taupin. ",
        "Nominees Iron Maiden, Cyndi Lauper, A Tribe Called Quest, The White Stripes, Warren Zevon, Joy Division/New Order and Soundgarden didn't earn a spot in the hall this time. Sheryl was recognised for key songs in the 1990s musical canon like All I Wanna Do and Every Day Is a Winding Road, while Rage Against the Machine 'forged brazen protest music for the modern world.'",
        "Kate BushSheryl CrowMissy ElliottGeorge MichaelWillie NelsonRage Against the MachineThe SpinnersMusical Influence AwardDJ Kool HercLink WrayMusical Excellence AwardChaka KhanAl KooperBernie TaupinAhmet Ertegun AwardDon Cornelius"
    ]
}