{
    "articleURL": "/news/article-12056623/Teen-driver-19-texted-mother-saying-tired-killed-horror-crash.html",
    "content": [
        "Robert Adams, 19, was driving along the A55 in North Wales before crashingHis family said he had a 'heart of gold' and he 'always wanted to help others'A teenage driver sent his mother a message saying 'I'm tired' just a few minutes before he died in a collision.",
        "Robert Adams, 19, a tyre fitter with Kwik Fit at Colwyn Bay, was driving along the A55 in North Wales when his Vauxhall Astra rammed into the back of a lorry travelling in the same direction.His car became wedged under the trailer, which contained 13 tons of cheese, and Adams was declared dead at the scene after suffering major head injuries.Footage recovered from the teenager's dashcam showed the moments leading up to the collision. It was later viewed at an inquest in Ruthin which members of his family were present.His family said he had a heart of gold and he always wanted to help others. They also revealed he was delighted to have received a recent promotion at his job.",
        "In a statement read at the hearing his mother, Lorraine Lansbury, said her son had spent the previous afternoon with the family at a fair before going to Deiniolen, near Caernarfon, to see his girlfriend Shannon Williams.At 1.25am he called her to say he was on his way home and told her: 'I'm tired'. He also showed her a picture of himself on cruise control keeping to the temporary 40mph zone at Talybont.Nine minutes later the crash occurred on the eastbound carriageway of the A55 near Dwygyfylchi.",
        "The driver of the Volvo lorry, James Boyce, told police he had been slowing down approaching the 30mph zone when the collision happened and his tachometer confirmed that he was travelling at 29.2mph.'I thought I had a tyre blowout,' he said.Van driver Gerald Hobson said he was driving at about 50-60mph when Adams's Astra passed him where the national limit of 70mph applied.A little further on he then saw the car weaving between the two eastbound lanes before being corrected and it once hit the nearside kerb.In a statement Shannon Williams said her boyfriend told her he was tired and she saw him yawning before he set off to Trem y Ffair, Kinmel Bay.",
        "No mechanical defects were found on either vehicle.John Gittins, senior coroner for North Wales East and Central, recorded a conclusion of death in a road traffic collision.'I don't believe for one second that he did it deliberately. It was just a result of his being tired,' he said."
    ]
}