{
    "articleURL": "/wires/reuters/article-12041755/33-Democrats-urge-ban-investor-state-dispute-provisions-U-S-trade-deals.html",
    "content": [
        "By David Lawder",
        "WASHINGTON, May 3 (Reuters) - Democratic U.S. lawmakers on Wednesday urged the U.S. Trade Representative and State Department to eliminate investor-state dispute settlement provisions from current and future trade deals and to intervene on behalf of Honduras against a U.S. company's nearly $11 billion claim against the country.In a letter to Secretary of State Antony Blinken and Trade Representative Katherine Tai seen by Reuters, 33 lawmakers said that investor-state dispute settlement (ISDS) systems in trade deals constitute a \"problematic corporate handout\" that violates countries' sovereignty and democracy rights.The letter, led by Democratic Senator Elizabeth Warren of Massachusetts and Democratic Representative Lloyd Doggett of Texas, cited the \"jaw-dropping sum\" sought by U.S. investment company Honduras Prospera Inc last December as its central argument.The company runs a special economic zone largely on the resort island of Roatan, with administrative and fiscal autonomy, but Honduras' Congress last year repealed the law that allowed such zones under leftist president Xiomara Castro.Prospera claims that the repeal violates the terms of the Dominican Republic-Central American Free Trade Agreement (CAFTA-DR) with the United States and is claiming compensation of \"at least several billion U.S. dollars and as high as $10.775 billion\" for impairment of its investment.The Democrats signing the letter said the case could require impoverished Honduras to pay billions of taxpayer dollars to a company that has \"weaponized\" the dispute settlement provisions.",
        "\"We request that you intervene - through a statement of support, amicus brief, and any other means at your disposal - in support of Honduras' defense in the Prospera ISDS case and to ensure such egregious cases can no longer disrupt democratic policy making by working to eliminate ISDS liability in pre-existing agreements in our hemisphere,\" the lawmakers wrote to Tai and Blinken.The dispute settlement provisions had been a way to protect U.S. firms from abrupt changes in trading partners' government policies by providing recourse through arbitration.In the North American Free Trade deal, the legal protections came to be viewed as a de-facto subsidy for U.S. firms investing in Mexico, and much of the ISDS system was eliminated in NAFTA's successor, U.S.-Mexico-Canada Agreement, launched in 2020.The letter cited Georgetown University research tallying $27.8 billion in ISDS settlement orders against Latin American governments, with Argentina, Venezuela, Peru, Mexico and Ecuador the worst hit.\"The broken ISDS system has time and time again worked in favor of big business interests while infringing on the rights and sovereignty of our trading partners and their people,\" the lawmakers wrote. (Reporting by David Lawder. Editing by Gerry Doyle)"
    ]
}