{
    "articleURL": "/wires/reuters/article-12040659/Jewellery-maker-Pandora-raises-guidance-Q1-revenue-beat.html",
    "content": [
        "COPENHAGEN, May 3 (Reuters) - Danish jewellery maker Pandora will slow down a planned country-wide relaunch of its brand in China as customer demand has yet to recover to pre-pandemic levels, the company's CEO said on Wednesday.",
        "Pandora sees China as a potential driver of future growth, but the world's largest jewellery market is recovering slowly from strict COVID-19 curbs, which were dropped at the end of last year.\"The middle-income earner in China is much more careful as they are coming back to the market versus what we saw in Europa and in the U.S.,\" Chief Executive Alexander Lacik told Reuters on Wednesday.\"If I look at the traffic volume vs pre-pandemic levels, we still have a long way to go,\" he said after Pandora raised the lower end of its full-year growth outlook when it reported first-quarter results slightly above analysts' forecasts.While China only accounts for 3% of Pandora's revenue, the company hopes to grow its business through a brand relaunch in the third quarter of this year.It had originally planned to do a country-wide marketing campaign, but during the pandemic that was scaled down to a simultaneous launch in major cities. Now Pandora aims to go for one city at a time.\"Given that the traffic volume still is way below where it needs to be for us, we're probably going to do a sequential launch,\" Lacik said.Shares in Pandora traded down 2.5% at 0821 GMT.The group now expects to generate organic sales growth between -2% and 3% this year, better than its earlier estimate of between -3% and 3%. Analysts expect 2% sales growth this year, according to a poll provided by the company.",
        "\"There are no signs of any noticeable slowdown in sales despite increased macroeconomic headwinds,\" Jyske Bank analyst Janne Vincent Kjaer said in a note, calling the quarterly results a \"solid start to the year.\"($1 = 6.7616 Danish crowns) (Reporting by Nikolaj Skydsgaard, editing by Terje Solsvik and Emelia Sithole-Matarise)"
    ]
}