{
    "articleURL": "/sport/football/article-12059541/Liverpool-fan-group-blame-club-Premier-League-sparking-Hillsborough-bile-playing-anthem.html",
    "content": [
        "Liverpool fans booed the national anthem before kick off at Anfield on Saturday Fan Group Spirit of Shankly has questioned the club's decision to play the songThey felt the decision could  spark 'hateful bile about' the Hillsborough tragedyA Liverpool fan group has blamed the Premier League for leaving Liverpool in a 'near impossible' position after giving vague instructions on the playing of the national anthem at Anfield on Saturday.",
        "God Save the King was played ahead of Liverpool's clash with Brentford on coronation day, but was met with jeers and chants that drowned out the song. Many Liverpool fans held banners expressing their dissatisfaction with the day, as some referenced 'King Kenny' Dalglish as their monarch.The anthem was played after the Premier League 'strongly suggested' all clubs played the anthem for games taking place over the coronation weekend, advice that has now drawn criticism from Spirit of Shankly.A statement from the Supporters Group said of the decision to play the anthem: 'There will have been some who didn't voice condemnation, but the majority did. And the Anfield crowd's reaction will have surprised nobody. So why did the hierarchy of Liverpool FC decide to play it?'",
        "'The club were left in a near-impossible situation. There was no mandate from the Premier League, just a 'strong 'suggestion' to play the anthem, and they must bear responsibility too. 'They are part of a working group to tackle tragedy chanting and have now potentially destroyed the good work done to this point by capitulating to pressure from the Department for Culture, Media and Sport with their 'suggestion'.'Hateful chants have been heard at a number of Premier League games this season, with the FA and Manchester City condemning chants about the Hillsborough disaster heard during the Cityzens clash with Liverpool last month.",
        "The statement continued: 'LFC were damned if they did, damned if they didn't, but they, with the PL, knew what would happen and they also knew the consequences - the predictable, hateful bile regarding Hillsborough would be re-ignited all over social media.'It was hoped that the amazing collective efforts with Nottingham Forest and Leeds supporters over the past few weeks would be the start of a change in attitude from those quick to chant about Hillsborough and other tragedies.'Forest fans were given a standing ovation at Anfield after unfurling a banner in the away end calling for an end to tragedy chanting.Spirit of Shankly felt the backlash from playing the national anthem was always likely to be felt by those linked to the Hillsborough disaster, as they concluded: 'Unfortunately, the club's insistence on playing [the national anthem] will, it seems, lead undoubtedly to an increase in hate chanting in the future.'Yet again survivors and the families and friends of the 97 people unlawfully killed at Hillsborough are subjected to a despicable backlash.",
        "'There is no logical step to the reprehensible trolling, but everyone connected to LFC knew it would happen. LFC could have and should have made the alternate decision and not played it.' As Sportsmail's Dominic King has explained, Liverpool's history of booing the national anthem stems from long-held anti-establishment sentiment within the city and a feeling of disconnect with the British government, rather than a distaste for individual royals.It was still met with distaste by some onlookers, as Piers Morgan labelled fans 'pathetic' for drowning out the anthem.",
        "Liverpool went on to beat Brentford 1-0 in the game, with Mohamed Salah providing the only goal. "
    ]
}