{
    "articleURL": "/wires/pa/article-12051673/Fit-Motherwell-striker-Mikael-Mandron-not-focusing-future.html",
    "content": [
        "Motherwell striker Mikael Mandron will live in the moment in the season finale and not concern himself with the future as he bids to make up for lost time.",
        "Mandron joined Well from Gillingham in January on a contract until the end of the season and hit a Scottish Cup double at Arbroath on his first start.But he suffered a thigh injury in training the following week which ruled him out of action.The former Sunderland, Wigan and Crewe forward has now made six appearances and is in line to feature against Kilmarnock on Saturday.The 28-year-old said: “It was really disappointing for me to get injured, I am not someone who usually gets injured. Especially after getting a good start.“I was really keen to come here and hit the ground running so getting injured, it took me about six weeks because I really wanted to make sure it was right.",
        "“I tried to stay positive while I was doing my rehab and the staff and players helped. I am really happy to be back.“Obviously I am 100 per cent focused on the five games here and trying to do the best I can for me and the team and whatever happens in the summer, happens. We will see.”Mandron is enjoying being a foil for Kevin van Veen, who has netted nine goals in his past six matches.“It’s very easy to play with him,” he said.",
        "“Kevin van Veen is one of those strikers who has everything to his game: he is strong, very good technically and smart.“We always try to link up on the pitch and always communicate to try and work together. I really enjoy playing with him.“He has had an amazing season, great credit to him. He has scored pretty much every game and is having a massive impact on the team and hopefully he can keep going for the next five games.“His target is to get 30 goals and it would be great for him personally but it would also be great for the team.”Motherwell have the chance to all but seal their top-flight status when they host Killie.“They are in a position where they are fighting for their lives and we are trying to get as many points as we can from the next five games,” Mandron said.“It’s very exciting. We all love playing at home, we have great support here from the fans and everyone is very excited for the game. I am anyway.”"
    ]
}