{
    "articleURL": "/news/article-12051447/Furious-family-boy-7-mauled-dog-Dorset-lash-animals-owners.html",
    "content": [
        "Dorset Police have launched an investigation and are appealing for witnesses The furious family of a boy who was mauled by a dog in a pub beer garden have blasted the animal's owners for not handing themselves in.",
        "The seven-year-old child was bitten on the head by the large canine on Tuesday as he played in the garden of the Crows Nest Inn in Swanage, Dorset where his mother works.An air ambulance landed in a nearby field and the boy was airlifted to hospital with serious injuries to his scalp, which required surgery. The owners of the dog, possibly a German Wirehaired Pointer, left the pub before the emergency services arrived and without leaving their details.The boy's outraged aunt has since taken to Facebook to vent her fury, raging: 'I can't believe they still haven't been found or why they have not come forward. What kind of people are they?'",
        "It has since emerged that the couple, a man and a woman aged in their late 40s or early 50s, were visitors to the seaside resort.They had been staying in their own campervan at a local holiday park which they have since left. The police have been given their details by staff at the park.A family friend said today he was 'on the mend' after an operation under general anaesthetic at Poole Hospital.In her post on social media, the seven-year-old's aunt said police were continuing their hunt for the couple, adding: 'This is extremely serious and is important that they find this dog.",
        "'This dog was not on a lead. My nephew did not do anything to provoke the attack.'He had surgery on his head and thank God is recovering.'They need to be caught before it happens again as maybe that person/child might not be so lucky next time.'Dorset Police have issued a photo of the man and woman restraining their dog moments after the attack.",
        "The man has short cropped grey hair and was wearing black-rimmed glasses at the time.The woman has shoulder-length brown hair and was wearing a dark blue or black jacket and blue and white shorts at the time.The dog is believed to be either a German Wirehaired Pointer or an Italian Spinone breed. It has brown and white shaggy fur.A spokesman for Dorset Police said there was 'no further update at this time and our enquiries remain ongoing.'PC Alistair James, of Purbeck police, added: 'This was understandably a distressing incident for the young boy involved and his family and we hope he makes a full recovery from his injury.'We are conducting enquiries into this matter and have obtained an image of a man and woman with the dog that was believed to be involved.'We are keen to speak to these people so we can take their account of what happened.",
        "'I would urge anyone with information relating to their identity to please come forward. I would also ask the man and woman pictured to please do the right thing and come forward.'I would also like to hear from any witnesses to the incident who have not already spoken to police.'The attack took place at about 5.10pm on May 2."
    ]
}