{
    "articleURL": "/wires/ap/article-12048523/Embattled-St-Louis-prosecutor-resigns-amid-calls-ouster.html",
    "content": [
        "ST. LOUIS (AP) - Embattled St. Louis Circuit Attorney Kim Gardner, the city's first Black prosecutor and a Democrat, announced Thursday that she will resign, following allegations of negligence and calls for her ouster by Republican leaders.",
        "In a letter to Republican Gov. Mike Parson released by Gardner's office, she said she will step aside effective June 1. Parson in a statement said he will immediately begin looking for a replacement and that he is \"committed to finding a candidate who represents the community, values public safety, and can help restore faith in the City´s criminal justice system.\"Republican Attorney General Andrew Bailey took legal steps to remove Gardner from office in February. Bailey said too many cases, including homicides, have gone unpunished under Gardner´s watch, that victims and their families are left uninformed, and that the prosecutor´s office is too slow to take on cases brought by police.Gardner said Bailey´s efforts to remove her were politically and racially motivated. A hearing on whether Gardner should be removed had been scheduled for September.Gardner's resignation letter also cited legislative efforts on a bill that would allow Parson to appoint a special prosecutor to handle violent crimes, effectively removing the bulk of her responsibilities.\"It is hard to think of a more direct or brutal assault on our democracy ...\" she wrote.",
        "\"Since day one of my tenure as Circuit Attorney, I have experienced attacks on my reforms, on my judgment, on my integrity, on my prosecutorial discretion, on my responsibility to direct the limited resources of this office and more,\" Gardner said in her letter.",
        "\"Some of these attacks seem designed to stop the office from functioning, at the expense of public safety,\" Gardner said.Democratic Senate Minority Leader John Rizzo said Gardner called him a few days ago to assess the probability of lawmakers passing the bill by their May 12 deadline.She began talks with Republican Senate President Pro Tem Caleb Rowden about the possibility of resigning when she realized that if she didn't, the bill likely would become law and hamstring her and future prosecutors, Rizzo said.Republicans \"were completely dialed in on attacking Kim Gardner for her methods,\" Rizzo said. He said laws dealing with the St. Louis prosecutor´s office are no longer needed, and he thinks Senate Republicans agree.Republican House leaders on Thursday released a statement pressuring the GOP-led Senate to act on the bill anyway, arguing that even with Gardner gone \"the criminal justice system in St. Louis remains in critical need of reform and support.\"Rizzo said Gardner had planned to announce her resignation Wednesday but delayed after an assistant prosecutor in her office died in a fiery crash around 5 p.m.Bailey said he wants Gardner to leave immediately.\"There is absolutely no reason for the Circuit Attorney to remain in office until June 1st,\" Bailey said in a statement. \"We remain undeterred with our legal quest to forcibly remove her from office. Every day she remains puts the city of St. Louis in more danger. How many victims will there be between now and June 1st? How many defendants will have their constitutional rights violated? How many cases will continue to go unprosecuted?\"",
        "Other Republican leaders applauded her resignation.\"She has presided over miscarriages of justice for years, hurting countless victims who put their trust in her and letting dangerous criminals escape the accountability they deserve,\" U.S. Rep. Ann Wagner tweeted. \"St. Louis will be better off without her.\"\"We have achieved an important victory in restoring law and order in the City of St. Louis with this resignation,\" House Speaker Dean Plocher, House Speaker Pro Tem Mike Henderson, and House Majority Floor Leader Jon Patterson said in a joint statement. \"Addressing the violent crime crisis that has destabilized the St. Louis region has been one of our highest priorities this session, which has included holding the Circuit Attorney accountable for the willful neglect of her constitutional duties.\"A statement from St. Louis Circuit Court said judges remain concerned about the high volume of pending cases for the understaffed Circuit Attorney´s Office.\"We hope St. Louis´ next Circuit Attorney is successful in restoring stability to the Office and rebuilding its ranks with experienced prosecutors,\" the statement read.The Rev. Darryl Gray, a leading activist in St. Louis, lauded Gardner for progressive actions such as instituting an integrity unit to investigate allegations of police misconduct, and for a diversion program for some non-violent offenders.But Gray said Gardner \"has been battered from Day 1. How much more should we expect our champions to take? And she was taking a lot.\"",
        "Criticism of Gardner escalated earlier this year after 17-year-old Janae Edmondson, a volleyball standout from Tennessee, was struck by a speeding car after a tournament game in downtown St. Louis. She lost both legs.The driver, 21-year-old Daniel Riley, was out on bond on a robbery charge despite nearly 100 bond violations that included letting his GPS monitor die and breaking the terms of his house arrest, according to court records. Critics questioned why Riley was free despite so many bond violations.Mayor Tishaura Jones, a Democrat who also is Black, was among those who criticized Gardner after Edmonson was injured. In a statement Thursday, Jones said Gardner \"made history by becoming the first Black woman\" elected circuit attorney, and noted she \"faced more obstacles than her predecessors because of it.\"Jones urged Parson \"to appoint a successor who reflects the values of communities across St. Louis.\"Gardner has often been at odds with Republicans. In 2018, she charged then-Gov. Eric Greitens with felony invasion of privacy, accusing him of taking a compromising photo of a woman during an extramarital affair. The charge was eventually dropped. But Greitens, a Republican who was also under investigation by Missouri lawmakers, resigned in June 2018.The case drew scrutiny that led to the conviction of Gardner´s investigator. Gardner received a written reprimand for failing to produce documents and mistakenly maintaining that all documents had been provided to Greitens´ lawyers.",
        "___Ballentine reported from Jefferson City, Missouri."
    ]
}