{
    "articleURL": "/news/article-12041319/Former-Government-race-advisor-accuses-Sadiq-Khan-virtue-signalling-500-000-statue-review.html",
    "content": [
        "Commission for Diversity in the Public Realm looking at street names, statues Samuel Kasumu questioned its importance at time of problems in London A former government adviser on race relations today slammed London mayor Sadiq Khan for spending taxpayers cash on a divisive review of the capital's historic statues.",
        "Samuel Kasumu, who wants to be the Tory candidate to run against Mr Khan in the mayoral election next year, said the move was 'virtue signalling' and distracted from more important work.Mr Khan set up the Commission for Diversity in the Public Realm in 2020 to make sure 'the capital's landmarks suitably reflect London's achievements and diversity' in the wake of the Black Lives Matter Movement.It has a remit to look at murals, street art, street names, statues and other memorials and in February announced it was spending £500,000 on 28 projects across the city.But Mr Kasumu, who worked on the campaign to get a monument to the Windrush generation installed at Waterloo station, said: 'In principle I have no issue with new monuments to commemorate the contributions of past and present figures, particularly those from communities that reflect London's diversity. It is to be encouraged.'(But) it is a distraction from more important issues including the cost-of-living crisis and improving trust and confidence in our police. This subject is not a priority for me and shouldn't be for the mayor either.'",
        "Mr Kasumu was a special adviser to the Prime Minister on civil society until April 2021. The stepped down when a Government-backed review said Britain is no longer a country where the 'system is deliberately rigged against ethnic minorities'. ",
        "He later said some Conservatives believe the path to victory at the next election includes exploiting division and warned a 'culture war' will lead to murder on Britain's streets.He is currently a councillor on Welwyn Hatfield Borough Council in Hertfordshire. He is originally from Barnet and studied business and management accounting at Brunel University - where he was student president. He graduated with a 2:1 and later received a postgraduate degree in Ethnicity, Migration, &amp; Policy from Birkbeck, University of London. He has picked up the backing of a string of serving and former ministers including Energy Secretary Grant Shapps, Northern Ireland Office minister Steve Baker and former home secretary Priti Patel.As part of his campaign to be chosen as the Tory candidate for London mayor he has said he would allow outer boroughs to hold referenda on Sadiq Khan's ULEZ tax on vehicles.He has also stood up to the government over its Rwanda migrant deportation scheme. Asked by Talk TV last month whether he backed the Rwanda scheme signed by Mrs Patel, he said: 'If I was Home Secretary I'd be very uncomfortable with it.''I am the son of an immigrant as you mentioned earlier. London is the city where 37 per cent of the population were not born in this country. ",
        "So if I want to be Mayor of London, I have to be one that is completely comfortable with the idea of immigration.'"
    ]
}