{
    "articleURL": "/tvshowbiz/article-12049515/Morgan-Wallen-announces-return-stage-health-update-apology-canceling-show.html",
    "content": [
        "Country music star Morgan Wallen shared an update on his health on social media, where he promised to return to the stage , 11 days after cancelling several shows due to doctor-ordered vocal rest.",
        "One of those shows, in Oxford, Mississippi, was called off just minutes before he was set to perform, with several thousand fans fans already in the venue eagerly awaiting the show.It turns out he lost his voice and the only proper remedy was to rest his vocal cords, which means no singing until the doctor deems he's physically ready.With all that in mind, the Sneedville, Tennessee native felt the need to message his 5.5 million Instagram fans and followers and reveal he would be returning to the stage Thursday night.'What's up, everybody? I just wanted to let you know I am in Jacksonville, we are going to play a show tonight — and all weekend,' the Last Night star shared from the venue in Florida, adding, 'I wouldn't say I'm 100% but I'm doing a lot better.'",
        "'And to everyone in Oxnard, I just wanted to reiterate how sorry I am for the way that went down, he said of the last-minute cancelation, 'I thought I was going to be good to go and I just wasn't.'The singer-songwriter went on to reveal that he and his team are currently working on getting a new date for the missed show.'We're working on a rescheduled date — we are close to having a rescheduled date, I just don't have the exact one yet. So as soon as I do, I'll let you know.\" ",
        "'I appreciate you all and I can't wait to get back out on stage tonight, he added, while wrapping up the clip.'Love you all and thank you for all the love and support, always, and God bless you and see you soon.'Later in the evening on Thursday, the VyStar Veterans Memorial Arena shared video of Wallen performing his hot song You Proof, according to People.The Up Down star canceled his April 23 show at the University of Mississippi's Vaught Hemingway Stadium in Oxford, Mississippi not long before he was scheduled to hit the stage and perform.A video board at the venue explained to the disappointed crowd that 'Morgan has lost his voice and is unable to perform tonight.'After reminding people to exit the stadium safely, the message explained to fans that they could get a refund at the point of purchase.",
        "The next night, Wallen announced that the three remaining shows that week in Michigan, Illinois and Nebraska would be postponed due to his lost voice and recovery.'Y'all know how important my fans are to me, so I feel horrible about this news,' he wrote on his Instagram Story. 'There's nothing more I want to do than be on stage playing for you guys. But as of today, I'm on doctor-ordered vocal rest and we have to reschedule this week's shows.'",
        "Wallen explained, 'I appreciate and understand everything you do to get to my shows, so it would be unfair of me to put on a show that I know will not be 100%. I'm doing everything I can to speed up the process of getting to that 100% mark.'The three most recent postponed shows have already been rescheduled to June 27, September 8 and September 9, respectively, And that the original tickets will be honored for the new dates.",
        "After the canceled show in Mississippi, a security guard at the stadium was reportedly heard saying Wallen was too drunk to perform. But that claim has since been shut down by the security company.One disappointed Morgan Wallen fan, Brandi Burcham, went as far as to file a lawsuit against the country singer on Monday on grounds that he had breached his contract and was negligence, according to TMZ. While fans can get a refund for the ticket to the show in Oxford, Mississippi, they can also keep it and use it for the rescheduled date that is still pending.But Burcham maintains the refund does not  pay for the 'out of pocket' expenses such as traveling to the venue, food and staying at a hotel.The plaintiff is aiming to get the lawsuit certified as a class action, per the outlet, so that other fans can also join."
    ]
}