{
    "articleURL": "/wires/ap/article-12059163/Facebook-3-billion-users-Many-old.html",
    "content": [
        "Facebook says it is not dead. Facebook also wants you to know that it is not just for \"old people,\" as young people have been saying for years.",
        "Now, with the biggest thorn in its side - TikTok - facing heightened government scrutiny amid growing tensions between the U.S. and China, Facebook could, perhaps, position itself as a viable, domestic-bred alternative.There's just one problem: young adults like Devin Walsh have moved on.\"I don´t even remember the last time I logged in. It must have been years ago,\" said Walsh, 24, who lives in Manhattan and works in public relations.Instead, she checks Instagram, which is also owned by Facebook parent company Meta, about five or six times a day. Then there's TikTok, of course, where she spends about an hour each day scrolling, letting the algorithm find things \"I didn't even know I was interested in.\"Walsh can't imagine a world in which Facebook, which she joined when she was in 6th grade, becomes a regular part of her life again.",
        "\"It's the branding, right? When I think of Facebook, I think ugh, like cheugy, older people, like parents posting pictures of their kids, random status updates and also people fighting about political issues,\" Walsh said, using the Gen Z term for things that are definitely not cool.The once-cool social media platform born before the iPhone is approaching two decades in existence. For those who came of age around the time Mark Zuckerberg launched thefacebook.com from his Harvard dorm room in 2004, it's been inextricably baked into daily life - even if it's somewhat faded into the background over the years.",
        "Facebook faces a particularly odd challenge. Today, 3 billion people check it each month. That´s more than a third of the world´s population. And 2 billion log in every day. Yet it still finds itself in a battle for relevancy, and its future, after two decades of existence.For younger generations - those who signed up in middle school, or those who are now in middle school, it's decidedly not the place to be. Without this trend-setting demographic, Facebook, still the main source of revenue for parent company Meta, risks fading into the background - utilitarian but boring, like email.It wasn't always like this. For nearly a decade, Facebook was the place to be, the cultural touchstone, the thing constantly referenced in daily conversations and late-night TV, its founding even the subject of a Hollywood movie. Rival MySpace, which launched only a year earlier, quickly became outdated as the cool kids flocked to Facebook. It didn't help MySpace's fate that it was sold to stodgy old News Corp. in 2005.\"It was this weird combination...no one knew how technology worked, but in order to have a MySpace, we all needed to become mini coders. It was so stressful.\" said Moira Gaynor, 28. \"Maybe that´s even why Facebook took off. Because compared to MySpace it was this beautiful, integrated, wonderful engagement area that we didn´t have before and we really craved after struggling with MySpace for so long.\"",
        "Positioning himself a visionary, Zuckerberg refused to sell Facebook and pushed his company through the mobile revolution. While some rivals emerged - remember Orkut? - they generally petered out as Facebook soared, seemingly unstoppable despite scandals over user privacy and a failure to address hate speech and misinformation adequately. It reached a billion daily users in 2015.Debra Aho Williamson, an analyst with Insider Intelligence who's followed Facebook since its early days, notes that the site's younger users have been dwindling but doesn't see Facebook going anywhere, at least not any time soon.\"The fact that we are talking about Facebook being 20 years old, I think that is a testament of what Mark developed when he was in college. It's pretty incredible,\" she said. \"It is still a very powerful platform around the world.\"AOL was once powerful too, but its user base has aged and now an aol.com email address is little more than a punchline in a joke about technologically illiterate people of a certain age.Tom Alison, who serves as the head of Facebook (Zuckerberg's title is now Meta CEO), sounded optimistic when he outlined the platform's plans to lure in young adults in an interview with The Associated Press.\"We used to have a team at Facebook that was focused on younger cohorts, or maybe there was a project or two that was dedicated to coming up with new ideas,\" Alison said. \"And about two years ago we said no - our entire product line needs to change and evolve and adapt to the needs of the young adults.\"",
        "He calls it the era of \"social discovery.\"\"It´s very much motivated by what we see the next generation wanting from social media. The simple way that I like to describe it is we want Facebook to be the place where you can connect with the people you know, the people you want to know and the people that you should know,\" Alison said.Artificial intelligence is central to this plan. Just as TikTok uses its AI and algorithm to show people videos they didn't know they wanted to see Facebook is hoping to harness its powerful technology to win back the hearts and eyeballs of young adults. Reels, the TikTok-like videos Facebook and Instagram users are bombarded with when they log into both apps, are also key. And, of course, private messaging.\"What we are seeing is more people wanting to share reels, discuss reels, and we´re starting to integrate messaging features back into the app to again allow Facebook to be a place where not only do you discover great things that are relevant to you, but you share and you discuss those with people,\" Alison said.Facebook has consistently declined to disclose user demographics, which would shed some light on how it is faring among young adults. But outside researchers say their numbers are declining. The same is true for teenagers - although Facebook seems to have stepped back from actively recruiting teens amid concerns about social media´s effects on their mental health.",
        "\"Young people often shape the future of communication. I mean, that´s basically how Facebook took off - young people gravitated toward it. And we we see that happening with pretty much every social platform that has come on the scene since Facebook,\" said Williamson. This year, Insider estimates that about half of TikTok´s users are between the ages of 12 and 24.Williamson doesn't see this trend reversing, but notes that Insider's estimates only go as far as 2026. There's a decline, but it's slow. That year, the research firm expects about 28% of U.S. Facebook's users to be between 18 and 34 years old, compared with nearly 46% for TikTok and 42% for Instagram. The numbers are more stark for teens aged 12-17.\"I think the best thing they could do is get away from being a social platform. Like they´ve lost that. But hey, if they want to become the new Yellow Pages, why not?\" said Gaynor, who lives in San Diego, California and works in government. \"I really like Marketplace. I recently just moved, so that was where I got most of my furniture.\""
    ]
}