{
    "articleURL": "/news/article-12043365/Is-end-internet-porn-Pornhub-pulls-Utah-100B-war-online-erotica.html",
    "content": [
        "Frisky residents of the Beehive State must have felt a bit deflated on Tuesday after trying to access Pornhub, one of the world's most prolific online pornography platforms.",
        "Instead of finding the usual raunchy options on the X-rated site, Utahns were greeted by adult entertainer Cherie DeVille -- fully clothed.'We've made the difficult decision to completely disable access to our website in your region,' DeVille informed visitors.Pornhub, she explained, had determined that the state's new age verification law, which requires that porn sites affirm their users are at least 18 years old, is seriously flawed.So, in lieu of complying, Pornhub has slammed the doors of their digital peep show altogether, prompting the question: Does this signal the beginning of the end for online porn?DailyMail.com examined the growing fight over the future of internet erotica and found that while there's a general consensus something must be done to block children from seeing potentially harmful content — the solutions are troublingly elusive.PORNHUB'S RABBI CO-OWNER DEFENDS UTAH PULL-OUTUtah's new law, SB 287, compels websites with pornographic material to require users submit identification cards, so that the site owners can verify their age. If the online platform refuses to comply, they can be held liable if minors access their content.",
        "After all, it's illegal for adults to show porn to children.It's the second such measure to take effect in 2023, as lawmakers increasingly look for ways to stop minors accessing explicit content.",
        "So far, four states – run by Republicans and Democrats – have enacted similar legislation. And over the last year, two dozen other states have proposed related restrictions.Supporters of SB 287 in Utah say it is a common-sense measure to protect children from porn, which was declared a 'public health hazard' in the state in 2016.'Businesses that sell tobacco, vaping products and alcohol online already age verify,' the bill's Republican sponsor, state senator Todd Weiler told DailyMail.com. 'I don't think that is too much to ask.'But apparently, Big Porn disagrees and they're now hitting back.On Wednesday, a trade association for the adult entertainment industry filed a lawsuit against the state of Utah, claiming SB 287 infringes on 1st Amendment rights to free speech and the 14th Amendment rights to privacy.The complaint by the Free Speech Coalition also argues that the law isn't readily enforceable because the age-verification system can be easily circumvented.Pornhub co-owner, Solomon Friedman, a criminal defense lawyer, private equity partner and ordained rabbi, told DailyMail.com on Thursday that while the company is an 'enthusiastic supporter of age verification,' it will not operate in jurisdictions with laws requiring sites to collect user data.'With a solution that is so obviously infringing on individual privacy and is not effective at keeping children away from adult material, we felt that we had no choice but to suspend our services in Utah,' he explained.",
        "Child safety advocate, Benjamin Bull, fiercely disagrees with Pornhub's assessment.",
        "'The United States Supreme Court has stated on numerous occasions that protecting our children from the harms and effects of pornography is a 'compelling governmental interest,' said Bull, general counsel of the National Center on Sexual Exploitation. 'The laws pass constitutional muster.'And according to experts who spoke to DailyMail.com, Pornhub's exit from Utah is more simply an act of retaliation.'It's their way of projecting their dislike for this legislation,' cyber security specialist Ritesh Kotak told DailyMail.com. He says these companies don't want to absorb the costs necessary to comply with the new rules.'Adding a layer of verification -- that's going to cost them money,' Kotak explained.However, given the incredible size and revenues of the adult entertainment industry, it's difficult to justify their resistance on these profitability grounds.ONE BILLION-DOLLAR PORNHUB IS A PART OF A GLOBAL SMUT BEHEMOTHPornhub's parent company MindGeek owns many of the web's most popular porn sites such as RedTube, Digital Playground, and YouPorn. (All pornography sites owned by MindGeek were shut down in Utah on Tuesday.)Based in Luxembourg, the smut behemoth operates across Canada, the United Kingdom, the United States and at least seven other countries.It has been described as 'the largest adult entertainment operator globally' and one of the largest consumers of internet bandwidth in the world.",
        "For its part, Pornhub is America's most visited explicit website.Nearly one in five adults in the U.S. watch online porn every day or almost every day, according to a 2020 survey by the Pew Research Center.In the U.S., Pornhub has more users than any other country, with an estimated 25.4 million unique monthly visitors – meaning people who are new arrivals to the site. And on any given day, Pornhub 'entertains' 130 million – the vast majority of them are repeat customers.",
        "The number of videos uploaded to the site fluctuates. But, per some estimates, it currently hosts more than 13 million videos, with thousands of new pieces of content added daily, many of which are user-generated.That's all translates into very big business.Pornhub, like other websites such as YouTube, makes most of its revenue through advertisements.They also offer premium subscriptions for additional features like virtual reality experiences, branded merchandise and – perhaps concerningly - mechanisms that allow users to disguise their locations enabling them to potentially skirt verification laws.Amateur content creators on Pornhub make their money per click with average rates around $0.69 per 1,000 views. Professional production companies can command much more, as they share in the site's ad revenue.The website does not disclose its financial information, but, according to a 2022 industry research report, the site has a yearly revenue of about $1.1 billion in the U.S. market.",
        "In comparison, XHAMSTER, one of Pornhub's main competitors has a yearly revenue of $60 million.Globally, the online porn business estimated to be worth $97 billion, with between $10 and $12 billion of that in the U.S. alone.Back in Utah, Rep. Weiler, the sponsor of SB 287, claims it was never his intention to knock Pornhub off the web in his state.'I did not expect adult porn sites to be blocked in Utah, mostly because Louisiana had already passed a similar law,' he said.Indeed, in January, a similar age-verification law came into force in the southern state, but Pornhub complied and remained active.PORNHUB TANKS AFTER LOUISANA SMUT LAWPornhub was one of few adult content platforms that complied with Louisiana's digital ID requirement, which passed into law earlier this year.Subsequently, the website reported a massive drop 80 percent drop in traffic.The company does not believe that their users simply quit porn and took up crochet to keep themselves busy. They believe the visitors went elsewhere, where age verification isn't required, for their preferred type of entertainment.Other pornography websites, such as xVideos and xHamster, reportedly did not initially comply with the new law in Louisiana. But xHamster tells DailyMail.com that they are 'compliant' and that the website experienced a 'tremendous drop in audience' following implementation of age verification measures.",
        "'The law is a failure. Almost no one complies with it,' said Michael Stabile, a Free Speech Coalition spokesman, of the Louisiana law.'Legislators are so frustrated they're pushing through a follow-up law that would allow the government to directly sue non-compliant sites,' he claimed.",
        "It's also important to note that unlike Utah, Louisiana has a state-sponsored digital wallet that collects user information and verifies identities, which means that pornography sites wouldn't have to handle this sensitive data themselves.Pornhub boss Solomon Friedman said that Louisiana's digital wallet made compliance in the state far more attractive.Despite all this, Friedman insists that the platform's subsequent decision to fully exit Utah had nothing to do with lessons learned from Louisiana - and that they are not simply trying to trigger a public backlash to these new laws.Overall, he echoed the concern repeated across the porn industry and among cyber security experts that these age-verification measures are unlikely to keep innocent eyes from peering over digital fences, because there are ways around them.Instead, Friedman argues it would be best if verification is carried out at the device level. Pornhub believes that the most effective way to prevent children from accessing their content is to compel Android, Apple or Windows to verify identities -- with face or ID scanning – and not them.'What needs to happen is that the device and operating system manufacturers adopt this solution so that the Internet can be gated off in adult and under-age sections,' Friedman said.CAN AMERICA WAIT FOR 'PERFECT SOLUTION' TO EXPLICIT ONLINE CONTENT?Consumer safety expert Adam Levin told DailyMail.com that while website age-verification laws might sound good to parents, they can be easily bypassed with a VPN, a 'virtual private network,' which allows users to mask their physical location.",
        "'As parents, we all want to protect our children from exposure to inappropriate content, but this law can be defeated by virtually anybody,' he said. 'If you're running for office, it's a great thing to campaign on, but the issue is, it's extremely tough to enforce.'In fact, according to data collected by Google Trends, search interest in VPNs reportedly exploded in Utah since SB 287 went into effect.There are other problems, too.Security experts also warn that putting personal online makes users more vulnerable to cybercrime.'Now that adult sites have a legal basis for asking a person who's visiting a site to upload their identity information, the likelihood of blackmail, data breaches, and other problems is significantly greater,' explained digital civil liberties advocate Jason Kelley.Regardless, family law attorney Sarah Khaki, who knows first-hand the harms of childhood exposure to porn, argues that while website age-verification laws may not be perfect, they're a necessary first start.'Up till now, these websites have been spoiled by legislation that has pretty much let them behave how they like,' said Khaki. 'Is it going to solve the problem completely? No. But waiting for the perfect solution is not a viable option when children are at risk.'Certainly, it appears that the world is finally waking up to the importance of safeguarding children online.And that the fight now playing out online and in Utah's courts is only the start of tide change for an industry that has for too long been left unchecked."
    ]
}