{
    "articleURL": "/wires/pa/article-12053199/Ukrainian-PM-thanks-King-unwavering-support-Ukraine.html",
    "content": [
        "The Ukrainian prime minister has thanked the King for his solidarity after the pair met during a reception on the eve of the coronation on Friday.",
        "Charles offered Ukraine his “unwavering support” when he met with the country’s First Lady Olena Zelenska and prime minister Denys Shmyhal.Mr Shmyhal said on Twitter: “It is a special honour to attend the reception of His Majesty King Charles III ahead of coronation.“We received assurances from His Majesty that (Ukrainian) people will have unwavering support until the final victory. Grateful for the solidarity.”Charles hosted heads of state from around the world at a Buckingham Palace reception on the eve of the coronation.The Prince and Princess of Wales, the Duke and Duchess of Edinburgh, the Princess Royal and Vice Admiral Sir Tim Laurence also greeted their overseas guests at the event.There were 42 people at the event, including Prime Minister Rishi Sunak, Australian prime minister Anthony Albanese and prime minister of New Zealand Chris Hipkins.Back in March, Charles visited Berlin where he met with Ukrainians who had been forced to flee the country.",
        "He told them “I’m praying for you” after condemning the “unimaginable suffering” caused by Russian president Vladimir Putin’s invasion of their homeland.He praised Germany’s “courageous, important and appreciated” decision to send “significant” military support to Ukraine in a historic address at the German federal parliament, the Bundestag.Charles made history back in March by delivering the first speech by a British monarch during a session of the Bundestag.",
        "He told the packed chamber: “The unprovoked invasion of Ukraine has inflicted the most unimaginable suffering on so many innocent people.“Countless lives have been destroyed; freedom and human dignity have been trampled in the most brutal way. The security of Europe has been threatened, together with our democratic values.”"
    ]
}