{
    "articleURL": "/femail/article-12052125/Rumer-Willis-models-cashmere-collection-launched-week.html",
    "content": [
        "Just in time for Mother's Day, actress and model Rumer Willis collaborated with sustainable knitwear brand NakedCashmere on a special collection fit for a modern mama The Veronica Beard x Dr. Scholl's retro-inspired, consciously crafted capsule launched on Wednesday, May 3, and it includes a high-heel iteration of the iconic clogAligned with Mental Health Awareness Month this month, Betsey Johnson has started a year-long partnership with Miley Cyrus's Happy Hippie Foundation, aimed at supporting LGBTQ+ youthWhen it comes to style, we are all inspired by what we see; whether it be a well-dressed celebrity, a blow-your-mind catwalk presentation or even a fashionable passerby.",
        "As fashion editors, we're moved by all of the above, and then some. We're exposed to under-the-radar labels; we get a first-hand look at collections months before they hit stores; we attend VIP events; we're tapped into brands with chic-yet-cheap offerings and we shop — a lot.To share our knowledge, FEMAIL brings you Style Swoon, a weekly series of the latest, greatest and on the verge. We hope this Friday series will serve as a buying guide and point of inspiration for all.This week's edition focuses on new launches.",
        "Just in time for Mother's Day, actress and model Rumer Willis collaborated with sustainable knitwear brand NakedCashmere on a special collection fit for mom.The 34-year-old modeled the luxurious separates in the collab's newly dropped campaign while pregnant with her first child, daughter Louetta Isley Thomas Willis.Looking effortlessly chic with her long hair styled in beach waves, Rumer could be seen cradling her exposed bump in everything from a V-neck sweater to a cropped cardigan and off-the-shoulder jumper.The collection features the label's signature cashmere styles, reimagined for the modern mom. It includes a wide range of soft and stylish pieces in a neutral color palette, to suit every budget.",
        "Betsey X Miley Aligned with Mental Health Awareness Month this month, Betsey Johnson has started a year-long partnership with Miley Cyrus's Happy Hippie Foundation, aimed at supporting LGBTQ+ youth. ",
        "Betsey Johnson will be donating $1 to Happy Hippie for every purchase from their best-selling floral rhinestone collection.'Miley and I share so much history and I admire her greatly,' said the iconic American designer. ",
        "'Faith, hope, and charity are everything—what you give is what you get. So let's give back.'The Happy Hippie Foundation provides LGBTQ+ youth, homeless youth, and other vulnerable populations with consistent support services, education, and employment opportunities.'I’m so excited that Happy Hippie is partnering with Betsey Johnson, starting this May with Mental Health Awareness Month,' said Miley.'Betsey Johnson shares our belief in rallying youth to fight injustice, and this collaboration couldn’t come at a better time when the needs have increased. Thanks to Betsey Johnson for sharing our mission of inclusion and self-expression, no matter who you are.'",
        "Veronica Beard x Dr. Scholl's Searching for an epic summer sandal? Look no further!Womenswear brand Veronica Beard and American heritage footwear brand Dr. Scholl's have collaborated on the perfect collection for the season.The Veronica Beard x Dr. Scholl's retro-inspired, consciously crafted capsule launched on Wednesday, May 3.The seven-piece collection brings the Veronicas’ playful aesthetic to Dr. Scholl’s iconic clog, and it even includes a high-heel iteration!The capsule collection consists of three styles offered in core Veronica Beard earth tones and signature ready-to-wear prints featuring the Veronica Beard clog metal rivets: The Original, The Hula and the Lolli. ",
        "The handmade artisanal, wood clog sole is made from natural beechwood, the printed canvas is certified organic, and the suede leather is responsibly sourced through Leather Working Group-rated tanneries. Veronica Beard x Dr. Scholl’s Shoes retail for $250-$395 and are available VeronicaBeard.com, DrSchollsShoes.com, and Neimanmarcus.com.",
        "XO,Kitty Sanrio, Forever 21 and Netflix have come together to launch a limited-edition Hello Kitty® fashion collection inspired by the highly anticipated new television series XO, Kitty dropped on Thursday, ay 4, ahead of the upcoming Netflix series set to premiere on May 18. The collection features varsity jackets, cardigans, button-downs, miniskirts, tees, sweatshirts and ties, all adorned with Hello Kitty graphics.The color palette pays tribute to K.I.S.S. boarding school colors with blues, pink, gray and white. Sizes range from XS to L, at a price range of $12.99 to $64.99."
    ]
}