{
    "articleURL": "/wires/afp/article-12048663/Carrie-Fishers-Walk-Fame-star-provokes-family-wars--wars.html",
    "content": [
        "Late \"Star Wars\" actor Carrie Fisher was honored with a star on Hollywood's Walk of Fame Thursday, in a ceremony overshadowed by a bitter feud among her family.",
        "Fisher, who played Princess Leia in the highest-grossing sci-fi film franchise of all time, died of a heart attack in 2016. She is survived by her daughter, actor Billie Lourd.Lourd -- in a dress adorned with her mother's most famous character -- oversaw Fisher's posthumous honors, which took place on May the Fourth, an unofficial \"Star Wars\" holiday.But conspicuous by their absence at the Los Angeles event were Fisher's brother Todd, and half-sisters Joely and Tricia Leigh, who this week slammed Lourd for failing to invite them.Todd Fisher told TMZ that \"being omitted from this special day is truly hurtful,\" while the sisters wrote on Instagram that their omission was \"deeply shocking.\"Lourd hit back by accusing the siblings of cashing in on her mother's death \"by doing multiple interviews and selling individual books for a lot of money.\"\"The truth of my mom's very complicated relationship with her family is only known by me and those who were actually close to her,\" she wrote, in the Hollywood Reporter.\"We have no relationship,\" said Lourd, confirming she had not invited the trio.A campaign to obtain a star for Fisher had been running for years, with fans complaining that her male co-stars Mark Hamill and Harrison Ford have long had their own honors.",
        "Hamill paid tribute to \"my beloved space twin\" at Thursday's ceremony, where \"Star Wars\" characters R2-D2, C3PO and a Stormtrooper were in attendance.\"She was our princess, dammit,\" he said.May the Fourth -- the date chosen for Fisher's ceremony -- is celebrated each year by \"Star Wars\" fans, in a twist on the films' oft-repeated mantra \"May the force be with you.\"Fisher, whose first screen role came as a teenager in Hal Ashby's 1975 satire \"Shampoo,\" played Leia in six movies, beginning with \"Star Wars\" (1977).She appeared posthumously in 2019's \"Star Wars: The Rise of Skywalker.\"Fisher joins over 2,000 of the biggest names of film, television and music who have stars embedded in the sidewalks of Hollywood Boulevard and its surrounding streets.These include her parents -- singer Eddie Fisher and actor Debbie Reynolds -- as well as Connie Stevens, the mother of Joely and Tricia Leigh."
    ]
}