{
    "articleURL": "/femail/food/article-12039673/Cadbury-Favourites-replace-Dream-Flake-Twirl-Caramilk-shrinkflation-box-520g.html",
    "content": [
        "Dream and the Flake bars have been removed Size of the box has also shrunk from 570g to just 520g Chocolate lovers are devastated after Cadbury ditched two of the most popular flavours in the Favourites selection while also shrinking the size of the box.  ",
        "Both the Dream and the Flake bars are gone, and will be replaced with a Caramilk and bite-sized Twirl.The size of the box has also shrunk from 570g to just 520g - with many online describing it as the 'latest example of shrinkflation'.After the new look box was spotted by an eagle-eyed shopper, many complained about the new options, while others said they were 'way better'.",
        "'Shrinkflation has reached Favourites. Dream and Flake now replaced with Caramilk and Twirl,' one Australian shared on Reddit.'Twirl is just a more structurally-sound version of Flake. Definitely an improvement in my opinion,' one person wrote.'But those mini Flakes are the perfect size to crush over a bowl of ice cream,' replied another.  'Flake has a better texture. Twirl just doesn't hit the same way. But I'm more disappointed in losing Dream,' commented a third.A fourth lamented 'replacing Dream for Caramilk'.",
        "'Is this what we wanted, truly? If they're actually basing this on what are statistically the most popular chocolates, very well, but! Show me the data, Cadbury!' said another.One person who claimed to work in the chocolate industry said that 'dream is by far the lowest quality white chocolate'.'Twirl replacing Flake is fine but no Dream?? That's like my favourite… (Caramilk is no Dream replacement),' added another.",
        "'First they took the Bounty away and I said nothing. Then they took the Dream and Flake away and I still said nothing. But if the b*****ds touch the Turkish Delight I will be writing a strongly worded email to Carbury!'Cadbury's parent company, Mondelez International, said it regularly reviews  chocolates in order to 'ensure the box is reflective of Australia's favourite flavours'.'Caramilk and Twirl are among our most popular products and rightfully deserve their place in the Cadbury Favourites line-up,' Alex Blair, Mondelez's corporate and government affairs manager told 7Life.'Dream and Flake fans shouldn't fear - both remain widely available in bar and share-bag formats.'"
    ]
}