{
    "articleURL": "/health/article-12061437/Number-pharmacies-England-drops-160-two-years-close-without-government-funding.html",
    "content": [
        "160 fewer chemists in England in two years - government urged to give fundingPharmacy association boss says there is a £1.1bn shortfall in funding every yearREAD MORE: The plan let pharmacies hand out prescriptions will free up GPsThe number of pharmacies in England has dropped by 160 over the past two years with warnings more are expected to close unless the Government provides 'urgent' funding to the 'struggling' sector.",
        "There are now just 11,026 community chemists – the lowest number since 2015 – according to BBC analysis of data from the NHS Business Services Authority.Staff shortages, rising operational costs and reduced financial support have been blamed for the drop, which comes amid rising patient demand.The warnings preceded today's announcement of a major expansion of high street pharmacy services, alongside a £645million Government investment.Leyla Hannbeck, chief executive of the Association of Independent Multiple Pharmacies, said workforce challenges have led to many pharmacies shutting their doors 'for good' since 2015, when the sector saw a 'big' cut in funding.",
        "She told BBC Radio 4's Today programme yesterday: 'We are expecting that this year many more will do the same unless the Government comes out and injects pharmacy with some liquidity and funding to keep the sector going.'Ms Hannbeck said there is a £1.1billion shortfall in funding every year which has resulted in many pharmacies operating at a loss and struggling to pay medicine wholesalers' bills.",
        "'This has led to many pharmacies severely struggling with cashflow problems,' she added. 'For pharmacists to keep their head above the water something needs to be done urgently.'Thorrun Govind, chair of the Royal Pharmaceutical Society in England, cited increased staffing, energy and drug costs as some of the issues the sector is facing.",
        "She told BBC One's Breakfast show that pharmacies in England could and would like to do 'so much more'.'When I'm working in the pharmacy there's often occasions where I know what treatment is required but I can't provide it because I'm hindered by the system that I'm working in,' Ms Govind told the BBC.She added that increased funding for pharmacies would also improve staff retention – with workers currently at risk of 'burnout' – and tackle health inequalities.'Pharmacists are really accessible – about a 20-minute walk for most people – and the staff there tend to be from the communities from where they are working so actually health inequalities are also being tackled when we have pharmacies open,' she said.She added pharmacies could provide regular support for patients with long-term conditions and help people with common ailments – such as coughs, colds, flus and sore throats – to ease the burden on GPs."
    ]
}