{
    "articleURL": "/sport/football/article-12041375/Robbie-Keane-set-join-Sam-Allardyces-backroom-staff-Leeds-Karl-Robinson.html",
    "content": [
        "Allardyce has made a shock return to management at Leeds after two years out The 68-year-old has added both Keane and Robinson to his backroom teamLIVE: Allardyce set to take his first training session TODAY after appointment Former Leeds striker Robbie Keane has agreed to join Sam Allardyce's backroom staff at Elland Road, according to reports.",
        "Allardyce has made a sensational return to management after two years out of the game, with official confirmation that he is replacing sacked Whites boss Javi Gracia finally coming on Wednesday.As well as unveiling the 68-year-old as Gracia's replacement, Leeds also confirmed that ex-Oxford, Charlton and MK Dons manager Karl Robinson has joined as his assistant.And The Times are reporting that Keane, who scored 19 goals in 56 appearances for Leeds, will follow both Allardyce and Robinson to his former club after agreeing to join their coaching team.It is believed the former Republic of Ireland striker has put pen to paper on a deal which confirms his return to Elland Road in a coaching capacity over 20 years since he departed as a player to sign for Tottenham. ",
        "Since hanging up his boots in 2018 after a brief stint as player-manager for Indian club ATK, Keane has enjoyed assistant roles with both Ireland and Middlesbrough.In his playing days, he scored 126 goals in the Premier League for the likes of Liverpool, Tottenham and West Ham as well as Leeds.Robinson, meanwhile, has been out of work since being sacked by Oxford in February, marking the end of a five-year spell at the club.The 42-year-old, who mainly plied his trade as a non-league footballer before venturing into coaching, started his own managerial career with MK Dons, where he enjoyed six successful years before being dismissed in October 2016.",
        "He then spent a brief 16 months in charge of Charlton before leaving the club by mutual consent.The announcement from Leeds unveiling Allardyce as their new manager came nearly 45 minutes after he was interviewed by talkSPORT from his new office at the training ground, confirming he was set to take over. It follows a dramatic 24 hours at Elland Road after director of football Victor Orta was also sacked along with Gracia on Tuesday.The Yorkshire club have acted amid a dismal run of four defeats in five matches which has left them hovering above the Premier League relegation zone only on goal difference heading into the final four games of the season.",
        "In Allardyce, they have opted for a survival specialist who has previously steered the likes of Sunderland and Crystal Palace to safety.He will lead training on Wednesday before a trip to Premier League leaders Manchester City on Saturday.'I know it's in a lot of trouble, but I've seen a lot of trouble before,' Allardyce said.'I could've done with more time, but we've got four games and hopefully I can keep this fabulous club in the Premier League.'I was shocked. I never thought at this stage of the season… I thought there would be no jobs.",
        "'The phone popped up with a name I knew fairly well, I knew what it was, and it took me two seconds to say yes.'"
    ]
}