{
    "articleURL": "/wires/ap/article-12052131/Matt-Harvey-Mets-Dark-Knight-retires-34.html",
    "content": [
        "NEW YORK (AP) - Matt Harvey announced Friday he's retiring from baseball after a nine-year pitching career highlighted by his time as the Mets' \"Dark Knight.\"",
        "Harvey, whose star faded amid injuries and a late-career suspension for drug distribution, thanked fans for making \"a dream come true\" in his Instagram post announcing his retirement.Nicknamed the \"Dark Knight of Gotham,\" Harvey was selected seventh overall by the Mets in the 2010 amateur draft and made a heralded major league debut in 2012. He started the 2013 All-Star Game at Citi Field, but a little more than a month later tore the ulnar collateral ligament in his pitching elbow and needed Tommy John surgery.He returned in 2015 and went 13-8, helping the Mets reach the World Series, where they lost to the Kansas City Royals.\"I pitched to win,\" Harvey wrote in his post. \"To fire up my team and more importantly, to fire up the fans in a city that I've always loved.\"He was traded to the Cincinnati Reds in May 2018, pitched for the Los Angeles Angels in 2019, the Royals in 2020 and the Baltimore Orioles in 2021. Health woes, including thoracic outlet syndrome, contributed to Harvey failing to recapture his early career magic.",
        "Harvey, 34, acknowledged in his post that \"with all the amazing memories came a lot of injuries and tough times.\"Last year, Harvey testified at the trial of a former Los Angeles Angels employee who was later convicted of providing pitcher Tyler Skaggs the drugs that led to his overdose death in July 2019.",
        "Harvey was one of four players who admitted to receiving oxycodone pills from the ex-employee, Eric Kay, who was sentenced to 22 years in prison in October 2022.Harvey, who said at trial he believed his testimony would threaten his career, also told the court he and teammates had given and provided drugs to each other.Major League Baseball suspended Harvey for 60 games in 2022 for distributing a prohibited drug of abuse, and he never made it back to the majors.He has a 50-66 career record with a 4.42 ERA in nine major league seasons. He pitched for Team Italy at this year's World Baseball Classic, where he allowed a run and four hits in seven innings over two starts.\"There is nothing I love more than getting out of a tough situation in the 7th or 8th inning,\" Harvey wrote, \"to finally let the emotions out, knowing I did absolutely everything I could to help my team win, and to give a powerful fist bump and a scream!\"___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}