{
    "articleURL": "/wires/pa/article-12047765/RMT-members-vote-renew-industrial-action-mandate-six-months.html",
    "content": [
        "Members of the biggest rail workers’ union have voted to renew their mandate to continue taking industrial action for the next six months in the long-running dispute over pay and conditions.",
        "The Rail, Maritime and Transport union (RMT) said there was an overwhelming vote in favour.",
        "Unions involved in disputes have to re-ballot their members every six months to legally continue with strikes and other forms of action.The RMT has announced a strike against train companies on May 13, the day of the Eurovision Song Contest final in Liverpool. It is clear from these results that members are not prepared to accept a pay offer based on mass job cuts and major attacks on their terms and conditions  Mick Lynch, RMT general secretary  RMT general secretary Mick Lynch said the overwhelming backing for further strike action across 14 train operating companies was a “de-facto referendum” on the dispute.“It is clear from these results that members are not prepared to accept a pay offer based on mass job cuts and major attacks on their terms and conditions.",
        "“This sends a clear message to the employers that the huge anger amongst rail workers is very real and they need to recognise that fact, face reality and make improved proposals.“They need to get around the table with RMT and negotiate in good faith for a better deal for rail workers.”The union re-balloted members working for 14 train operating companies, saying they all passed the 50% participation threshold needed under law.",
        "On an average turnout in each company of nearly 70%, over 90% of votes cast backed continuing with strike action, the RMT said. The RMT membership would be forgiven for wondering why they are only ever offered a vote to extend this dispute and a never vote to end it  RDG spokesperson  A spokesperson for the Rail Delivery Group (RDG), said: “While the outcome of the ballot is disappointing, sadly it is also unsurprising during an on-going dispute such as this.“The vote that really matters is for the deal on the table developed in conjunction with RMT negotiators but then subsequently rejected out of hand in unflattering terms by their executive committee, without giving their membership a single chance to have their say.“The RMT membership would be forgiven for wondering why they are only ever offered a vote to extend this dispute and a never vote to end it.“We can only assume that the executive committee is fixed on continuing this dispute for its own reasons, despite the damage it is causing to an industry still being subsidised up to £175 million a month extra post covid, to our passengers’ lives and to Britain’s reputation for hosting high-profile events like Eurovision.“Instead of continuing to hold the country to ransom, we call on the RMT executive to quickly think again and put the deal – which offers job security guarantees and a pay rise of up to 13% – out to a democratic vote so that members can finally have their say.”",
        "Responding to the vote, Transport Secretary Mark Harper said: “I’m disappointed by the RMT’s decision to continue taking industrial action. Train companies put forward a fair and reasonable pay offer which the RMT’s executive have refused to consult their members on, despite members working for Network Rail voting overwhelmingly to accept it earlier this year.“The Rail Delivery Group’s best and final offer guarantees employees a fair and reasonable pay rise, while delivering the reforms needed to address the long-term challenges facing the industry.”"
    ]
}