{
    "articleURL": "/wires/reuters/article-12053563/Facing-Royals-As-eye-two-game-win-streak.html",
    "content": [
        "The Oakland Athletics finally got a win from a starting pitcher Friday.",
        "Kyle Muller held the Kansas City Royals at bay for 5 1/3 innings while the A's offense flourished during the 12-8 victory. It was the lefty's first win in an Oakland uniform since coming over in an offseason trade from Atlanta.\"It's been a long time coming,\" Muller said. \"We've had some opportunities but fell a little short. It's kind of bittersweet. I don't think the performance was deserving of the first win, but I'm excited we got the first one out of the way.\"A's starters were 0-12, going winless over the first 32 games, a major-league record streak to start a season.\"We've had several opportunities and haven't been able to close it down,\" manager Mark Kotsay said. \"So, tonight was big, getting that out of the way and hopefully not being a distraction anymore.\"Friday's win was just their second by more than one run; five of their previous six victories were one-run affairs. It could have been another one-run win had Oakland not added late insurance.\"We've lost some games that we couldn't tack on runs,\" Kotsay said. \"Tonight in that eighth inning we were able to tack on those extra runs that really helped us. Wins have been tough to come by and it's nice to be able to finish a game off like that.\"",
        "Rookie center fielder Esteury Ruiz contributed by stealing third -- for the second time in the game -- then scoring his third run of the game. Ruiz leads the American League with 15 stolen bases.Brent Rooker connected for his 10th homer, fifth best in the majors, and finished with three RBIs as the Athletics built an early lead.\"It's nice to see the positive results that both Ruiz and Rooker have had,\" Kotsay said. \"We've got more talent on this roster that also has a lot of positives going for them.\"The A's look to collect their first consecutive wins Saturday, sending lefty Ken Waldichuk (0-2, 7.26 ERA) opposite Royals righty Brady Singer (2-3, 8.49).It will be Waldichuk's first appearance against Kansas City, while Singer will make his fourth career start against Oakland.Singer is 0-2 with a 4.58 ERA against the Athletics after losing both starts against Oakland last June.Singer is coming off his worst start of the year after he was chased in the third inning Sunday at Minnesota, allowing eight runs.Despite a resurgent offense, the Royals are 4-16 the past three weeks. Kansas City has scored 44 runs in the past seven games but has just two wins to show for it.The club has lost consecutive games in which they rallied from seven-run deficits, only to lose as the bullpen has surrendered eight runs over the eighth and ninth innings.",
        "\"It certainly doesn't feel good at all,\" said manager Matt Quatraro. \"But the mood didn't change in the dugout. They thought we were coming back again. It's not like it crushed everybody.\"Royals relievers have allowed 15 runs while walking 16 during the last three losses.\"We don't expect to do that, so that's what's frustrating,\" Quatraro said. \"We know our guys can perform better than that. That's where the frustration comes. We're not seeing the best version of ourselves right now.\"--Field Level Media"
    ]
}