{
    "articleURL": "/wires/ap/article-12039299/Cities-say-shelters-budgets-hit-immigration-uptick.html",
    "content": [
        "CHICAGO (AP) - U.S. cities already struggling to shelter thousands of migrants are calling for federal help and an end to Republican political gamesmanship over immigration, concerned that an expected increase in the number of people entering the country when pandemic-era asylum restrictions end on the U.S.-Mexico border May 11 will further strain their budgets and resources.",
        "Chicago has long pledged to welcome migrants. But a tenfold increase in recent days has taxed resources. Migrants awaiting beds in city-run shelters are sleeping on floors in police stations and in airports surrounded by suitcases. They're depending on donors for food, medicine and clothing.When border crossings increased last summer, Republican governors of border states bussed migrants to cities led by Democrats including Chicago, New York City and Denver, arguing that their own cities were overwhelmed. Texas´ Republican governor this week vowed to resume a program bussing new arrivals to Chicago and other cities.More than 8,000 migrants have come into Chicago since August, according to city officials. Some came on busses mobilized by border states; others bought their own flights or got one subsidized by aid groups. The number of new arrivals slowed this winter to about 10 people per day. But toward the end of April, it grew to between 75 to 150 people per day.\"Our system is over capacity,\" Brandie Knazze, commissioner of the Chicago Department of Family and Support Services told city officials Friday. \"Make no mistake, we are in a surge and things have yet to peak.\"Major U.S. cities already were bracing for thousands of new arrivals when a rule that denies asylum on grounds of preventing the spread of COVID-19 expires May 11. But the uptick has begun sooner than Chicago officials expected, and they fear that bussing from Texas could further overwhelm them.",
        "\"We simply have no more shelters, spaces, or resources to accommodate an increase of individuals at this level,\" Democratic mayor Lori Lightfoot wrote in a letter to Texas' Republican governor Greg Abbott on Sunday.He replied in a letter of his own, promising to send more busses of migrants. He repeated calls for her to pressure President Joe Biden to prevent migrants from crossing the border, and noted that the influx already has strained Texas.\"As the mayor of a self-declared sanctuary city, it is ironic to hear you complain about Chicago´s struggle to deal with a few thousand illegal immigrants, which is a fraction of the record-high numbers we deal with in Texas on a regular basis,\" Abbott wrote.While migrants tend to stay briefly in U.S. border cities on their way to other destinations, demands for temporary shelter, food and transportation have grown. El Paso, Laredo and Brownsville declared states of emergency ahead of the end of pandemic-related asylum restrictions next week.Migrants taking shelter in Chicago police stations this week said they want to find work and provide for themselves, but need temporary shelter and assistance navigating a new country. But they have been caught up in the city's struggle to provide shelter to so many.One of those families has been living on the floor of a police station on the city´s northwest side for eight days, sleeping on thin blankets provided by a local church and washing themselves in the station´s bathroom sink as they wait for available shelter space.",
        "\"Every day they tell us the same thing, there´s no shelter, that we need to wait,\" said Ibo Brandelli, on Monday, who left Venezuela with his wife and their two daughters in January.After surrendering to border authorities and gaining entry to the U.S. in late April, they connected with a community organization providing plane tickets and chose Chicago on the advice of acquaintances.New York City Mayor Eric Adams called on the federal government last month to give the city more financial aid and asked the U.S. government to speed up work authorizations to people seeking asylum. The city has spent $817 million so far housing, caring for and providing services to migrants, at an average cost of $380 per household per day, according to the city's budget director.More than 50,000 international migrants have arrived since the spring of 2022, taxing an already stretched shelter system. Under local law and court rulings, the city is obligated to offer emergency shelter to anyone who needs it. The city has tried creative solutions, like leasing out entire Manhattan hotels and setting up temporary shelters during the winter at a cruise ship terminal.In Denver this month, officials announced that only immigrants with a formal application to stay in the U.S. will be allowed in emergency shelters. Most of those who have come to Denver since last summer would qualify, but immigrant advocacy groups say the policy will lead to more people living on the streets. Denver has spent nearly $13 million sheltering and supporting more than 6,000 migrants.",
        "Victoria Aguilar, a spokeswoman for Denver Human Services, which now runs four emergency shelters for migrants attributed the change to a \"lack of funding, lack of policy, lack of guidance from our federal government to be able to respond to this crisis appropriately.\"Chicago runs eight shelters dedicated to new migrants. City officials said they have struggled to find new spaces capable of housing more than 250 people and say they need federal and state help.In the meantime, migrant families are finding shelter where they can.Another Venezuelan family slept on the floor of a northwest side police station for nearly two weeks.\"What we want is stability for our children, stability for ourselves, for my children to be able to go to school,\" said Yessika Chirino, who left Venezuela with her daughters, 15 and 5, seven months ago.Chirino said she crossed the Mexico-U.S. border into Texas on April 11. A Texas organization helped her fly to Chicago.She calls Chicago's non-emergency line every day asking about shelter openings.\"We don´t know what to believe anymore,\" she said. ___Associated Press writers Claire Savage in Chicago, David Caruso in New York and Thomas Peipert in Denver contributed to this report."
    ]
}