{
    "articleURL": "/wires/reuters/article-12058115/Russia-launches-mass-strikes-Ukraine-ahead-May-9-Victory-Day-holiday.html",
    "content": [
        "Ukraine says it shot down all drones",
        "Russia tries to seize Bakhmut in east by May 9 Victory DayUkraine marks 1945 defeat of Nazis on May 8 in break with MoscowBy Gleb Garanich and Valentyn OgirenkoKYIV, May 8 (Reuters) - Russia launched its biggest swarm of drones for months against Ukraine on Monday, the eve of Russia's May 9 holiday celebrating the defeat of Nazi Germany in 1945, striking the capital Kyiv and the Black Sea city of Odesa and shelling other cities.Kyiv's mayor said Russia had fired 60 Iranian-made kamikaze drones at Ukrainian targets, including 36 at his city, all of which were shot down. Debris hit apartments and other buildings, injuring at least five people.A food warehouse was set ablaze by a missile in Odesa, where officials reported three people were injured.It was the biggest drone swarm yet in a renewed Russian air campaign unleashed 10 days ago after a lull since early March.Ukrainian leader Zelenskiy marked Victory Day on May 8 rather than May 9, changing the date of the holiday to match the practice of Western allies.\"May our victory over the current evil of Rashism be the best way to honour the memory of those who fought against and defeated Nazism,\" Zelenskiy said in his Monday night video address, using a commonly used term in Ukraine to denote \"Russian fascism.\"",
        "Russia invaded Ukraine in February 2022 saying it wanted to \"de-Nazify\" its neighbour to protect Russia. Ukraine and its Western allies say Moscow's war is an imperial-style land grab.BAKHMUT PRIZE?Ukraine said Moscow was making a final push to try to capture the ruined eastern city of Bakhmut to deliver President Vladimir Putin what would be his only prize for a costly Russian winter offensive, in time for the May 9 holiday.Bakhmut has been under Russian attack for more than nine months, with Russia's Wagner Group mercenaries leading repeated attempts to advance on what was once a city of 70,000.The group's leader, Yevgeny Prigozhin, said in a social media message on Monday that his troops were beginning to receive ammunition needed to press their advance. Troops had advanced a maximum of 130 metres (400 feet) amid fierce fighting, Prigozhin said.In its daily statement on military action in the previous 24 hours, the General Staff of the Ukrainian Armed Forces said there had been heavy fighting in Bakhmut and surrounding areas.More than 20 towns and villages came under shelling in central Zaporizhzhia region, the statement said. The southern city of Kherson and at least seven other centres in that region were also shelled - on the west bank of the Dnipro River abandoned by Russian forces in November.",
        "Reuters was unable to verify the battlefield accounts.VICTORY DAY PARADE TO RALLY RUSSIANSMoscow is preparing for Tuesday's Victory Day parade, the most important day in the calendar for Russia under Putin, who wants to rally Russians behind the war in Ukraine.The German army's surrender in 1945 took effect late at night on May 8 in Berlin, when it was already May 9 in Moscow, the date that became the Soviet holiday.Russia foreign ministry spokeswoman Maria Zakharova said that by changing the date, Zelenskiy had betrayed the memory of Ukrainians who fought the Nazis.\"What is worse than an enemy? A traitor. That is Zelenskiy, the embodiment of Judas in the 21st century,\" she said.Ukraine, as part of the then-Soviet Union, suffered higher per-capita casualties than Russia in World War Two and was home to a big Jewish population that was wiped out in the Holocaust.On the day of Russia's parade, Zelenskiy will underscore Ukraine's ambition to join the West by receiving European Commission President Ursula von der Leyen, whose visit to the war zone the EU took the unusual step of announcing in advance.Brussels marks May 9 as \"Europe Day,\" honouring a French declaration in 1950 that led to the founding of the body that became the EU.",
        "Russia has cancelled or curtailed some of the huge military parades that normally accompany Victory Day. Western countries say this is partly due to security concerns, as well as reluctance to publicise Russia's heavy casualties in Ukraine and because Moscow has lost so much military hardware in its largely fruitless, grinding winter offensive.Ukraine, which last year drove Russian forces back from the capital and recovered territory, has maintained a defensive posture for the past six months, but says a counteroffensive will begin soon.The Russian-appointed governor of Zaporizhzhia region, Yevgeny Balitsky, said around 3,000 civilians had been evacuated from areas near the front line that had come under shelling in Zaporizhzhia, one of the areas where Ukraine could launch its counteroffensive.(Reporting by Valentyn Ogirenko, Gleb Garanich, Lidia Kelly, Elaine Monaghan and Ron Popeski Writing by Peter Graff, Kevin Liffey and Grant McCool Editing by Andrew Heavens, Angus MacSwan and Matthew Lewis)"
    ]
}