{
    "articleURL": "/news/article-12051249/Nigerian-senator-wife-jailed-kidney-transplant-plot.html",
    "content": [
        "Ike Ekweremadu was jailed for nearly ten years for trafficking victim for organThe Met has issued a warning after the force noticed a rise in this type of crime A wealthy Nigerian politician, his academic wife and a 'middleman' doctor have been jailed for trafficking a penniless market trader to the UK to harvest his kidney in an NHS hospital.",
        "In the first case of its kind in the UK, Nigerian politician Ike Ekweremadu, his wife Beatrice and medical middleman Obinna Obeta were each jailed for their attempt to procure a poor street trader from Lagos for a transplant for the couple's daughter Sonia, 25.In a televised sentencing today, Mr Justice Johnson recognised Ike Ekweremadu's 'substantial fall from grace' as he jailed him for nine years and eight months.Beatrice Ekweremadu, who was caught with her husband by police at Heathrow with £25,000 of cash, was jailed for four years and six months and Obeta for 10 years.Police have now issued a warning to the public, highlighting the soaring numbers of modern slavery cases in recent years with a small number involving organ harvesting.",
        "The 21-year-old street trader was brought to the UK last year to provide the organ to Sonia in an £80,000 private transplant at the Royal Free Hospital in Camden, north London.He claimed he was told to pretend to be Sonia's cousin to get the transplant approved.But a consultant working in the NHS hospital refused to remove the vital organ having become suspicious because the young man appeared initially unaware he was the donor of the kidney and was clearly not 41 as his passport claimed. The Nigerian national would later tell police he had no idea his kidney was to be removed until he was taken to the Royal Free to meet the surgeon.",
        "The victim, who cannot be named, later ran away, sleeping rough for three days, before walking into Staines Police Station on May 5, 2022. He burst into tears as he told officers that he had been trafficked into the UK from Nigeria and that someone was trying to take one of his organs.The senior judge said: 'People-trafficking across international borders for the harvesting of human organs is a form of slavery.'It treats human beings and their body parts as commodities to be bought and sold.'It is a trade that preys on poverty, misery and desperation.'He told the defendants: 'You each played a part in that despicable trade.'On the question of harm to the victim if the intended transplant went ahead, he said: 'He would have faced spending the rest of his life with only one kidney and without the requisite funding for the required aftercare.'He added the risks had not been properly explained and there had been no consent 'in any meaningful sense'.During the hearing, the victim said he only found out what was planned when he was taken to the north London hospital for an initial consultation.In a statement read to court: 'I would never (have) agreed to any of this. My body is not for sale.'",
        "He spoke of his fears for his own safety and that of his family in Nigeria who had been visited and told to 'drop' the case.He said: 'I cannot think about going home to Nigeria. These people are extremely powerful and I worry for my family.'Even though I live here in the UK at the moment I know I need to be careful too.'I have no-one here, no family, no friends. I am having to start my life again.'I'm worried about my family in Nigeria but I have been told my dad had been visited and was told to drop the case in the UK.'He told police he did not want to claim compensation from the 'bad people' as it would be 'cursed and bad luck'.He said: 'My plan now is to work and to get an education and to play football.'",
        "It is the first time anyone has been convicted under the Modern Slavery Act of an organ-harvesting conspiracy.Scotland Yard declined to say whether more charges would be brought but said the investigation was ongoing. Detective Superintendent Andy Furphy, the Met's modern slavery and child exploitation lead, has now issued a warning against this type of crime, saying criminal exploitation of adults has soared by 30 per cent in the last 12 months.",
        "'The trajectory of modern slavery crimes shows very little signs of slowing down.'They are making millions and millions and millions a year, every year, most of which is transported to other parts of Europe and further afield.'It's in our communities, it's in the services that we use.'It's in the industry that builds road networks, buildings, or houses. It's in the beauty industry. It's in the sex industry.'Don't think a tiny bit of information or intelligence is insignificant, you never know that might just break the back of an organized crime group that are exploiting people.'We use all methods available to us to protect the vulnerable and reduce the harm in London's communities.'At all times we put the victim first. They're often very scared, abused, malnourished, wary of authorities due to the extreme nature of their ordeal.'The victim in this particular case was vulnerable, given his economic circumstances, aggravated further by significant wealth and political influence of those who have now been convicted.'It sounds like something from fiction, from a book or a movie.'Well, let me tell you: the abuse of power and wealth by these people over a vulnerable young man, it's astonishing.'Bringing the first successful prosecution was his 'proudest' moment.",
        "Paying tribute to the young victim, he said: 'His bravery has given strength to others. And now this is not the only case of organ harvesting under investigation.'",
        "Detective Sergeant Andy Owen described how the victim had turned up at the police station with only a mobile phone with no sim card, a toothbrush and scant clothes.Over eight hours of interviews, he gave an account of how he was picked up in Lagos while selling phone accessorises from a wheelbarrow and brought to the UK.He fled in fear for his life after over-hearing a plan to take him back to Nigeria for the procedure after the transplant plan in London failed.Further inquiries led to Ike Ekweremadu, Nigeria's deputy Senate president, as 'sponsor' for the young man's travel.Fearing that the Ekweremadus may never return to the UK, investigators prepared to wait years until they learned the couple were on a flight to Heathrow on June 21 last year.The team was scrambled and the Ekweremadus were detained as they stepped off the plane with 30,000 US dollars and Naira, Mr Owen said.They went on to arrest Sonia Ekweremadu, who was educated in the UK, and identified Obeta's address on the Old Kent Road in south London from the victim's phone.",
        "A search of Obeta's home uncovered the victim's birth certificate and a fake High Court affidavit stating the victim and Sonia were biological cousins.Detective Inspector Esther Richardson said it was a challenge preparing for trial with no case law to work with.She said: 'This crime type sees rich and powerful people looking to exploit for vulnerable people for their organs.'And we suspect that this happens across the world. Our victim was a commodity. And this was a transactional process, just like any drugs or firearms deal.'This type of crime is facilitated by organised criminal networks.'The tragedy of this is that it appeared that the welfare and well-being of the victim was of little or no consequence to Sonia getting a kidney.'There was no evidence of any care plan for the victim.'",
        "She added: 'The victim himself showed tremendous courage to come forward and to give evidence against powerful people. He's an innocent, young and naive man.'Having never been on a flight, he was petrified that the plane would fall from the sky.'When he fled Obinna Obeta's flat in London, he slept on the streets, fearing that snakes might bite him.'Our victim is very fearful for his safety, and that of his family back in Nigeria.'He has no-one in the UK, no family, no friends, and he's having to start to rebuild his life from scratch.'He is one of hundreds of modern slavery victims to be helped by a 'navigator' through the Justice and Care Programme.With navigator support, 90 per cent of victims choose to and remain engaged with police investigations compared to just 44 per cent without.Programme co-ordinator Julie Currie explained: 'They will have been told by their exploiters that they will not be believed, that they should fear the police and authorities or that their families will be harmed if they speak to police.'All of these things are barriers to a victim speaking out.'And it is the job of the navigator with the police to help break down those barriers and build up the confidence that any victim is going to need to go through the judicial process.'"
    ]
}