{
    "articleURL": "/wires/reuters/article-12046917/Disheartened-Go-First-pilots-rush-Air-Indias-jobs-drive.html",
    "content": [
        "By Tanvi Mehta",
        "NEW DELHI, May 4 (Reuters) - Dozens of pilots, many from crisis-hit Go First, flocked to a Tata group hotel near Delhi on Thursday for walk-in interviews with the conglomerate's Air India airline.Go First's announcement on Tuesday that it had filed for bankruptcy as demand for post-pandemic air travel in the world's most populous country boomed came as a shock to many employees.\"It is very disheartening, the airline was functioning as if everything was normal,\" said a pilot who joined Go First two years ago and was waiting in a long line at Tata's Taj Hotel. \"We have to jump ship in order to keep our flying licences current.\"Reuters spoke with more than a dozen pilots and cabin crew at the Air India programme, which was first announced on Wednesday, and another run by sister company Vistara, all of whom declined to be named as they were still employed by Go First, the country's third-largest airline.While Air India, Vistara and the country's biggest airline IndiGo have conducted similar hiring drives in the past, the people Reuters spoke to said turnout was larger than normal. They attributed the numbers to the plight of Go First, formerly known as Go Airlines (India) Ltd, which has around 7,000 employees.Air India said on Twitter the hiring drive in Delhi and Mumbai would be extended by a day to Friday.",
        "The airline, bought back from the government last year by salt-to-software Tata group, plans to hire more than 4,200 cabin crew and 900 pilots this year as part of a major revamp which also includes orders for a record 470 jets.Air India did not respond to a Reuters request for comment on the hiring drive, while Go First and Vistara - a Tata group joint venture with Singapore Airlines - declined to comment.Go First's CEO said earlier this week the airline is committed to its employees and is working tirelessly to get its operations back on track.A planned merger of Air India with Vistara and the launch of Akasa Air have increased competition for staff and planes as the industry recovers.Vistara held walk-in interviews for cabin crew in Delhi and Mumbai on Thursday, and sought online applications from pilots.\"Vistara has been a dream airline to work with, ever since I took one of its flights a few years ago,\" said a 27-year-old member of Go First's cabin crew.\"Plus, with the Tatas, our future would be secure.\"(Reporting by Tanvi Mehta; Editing by Kirsten Donovan)"
    ]
}