{
    "articleURL": "/wires/pa/article-12041133/Hollywood-braces-long-battle-amid-writers-strike.html",
    "content": [
        "Hollywood writers striking over pay and job security are picketing major studios and streamers at the outset of industrial action that forced late-night shows into hiatus, put other productions on pause and slowed down the entire industry.",
        "The first Hollywood strike in 15 years commenced on Tuesday as the 11,500 members of the Writers Guild of America (WGA) stopped working when their contract expired.The union is seeking higher minimum pay, more writers per show and less exclusivity on single projects, among other demands – all conditions it says have been diminished during the content boom of the streaming era.Kelly Galuska, 39, a writer for The Bear on FX and Big Mouth on Netflix, said from the picket lines at Fox Studios in Los Angeles: “Everything’s changed, but the money has changed in the wrong direction.“It’s a turning point in the industry right now. And if we don’t get back to even, we never will.”The last Hollywood strike, from the same union in 2007 and 2008, took three months to resolve.With no talks or even plans to talk pending between the WGA and the Alliance of Motion Picture and Television Producers (AMTPT), which represents studios and productions companies, there is no telling how long writers will have to go without pay, or how many major productions will be delayed, shortened or scrapped.Josh Gad, a writer for shows including Central Park and the voice of Olaf from the Frozen movies, said from the Fox picket line: “We’ll stay out as long as it takes.”",
        "The AMPTP said in a statement that it presented an offer with “generous increases in compensation for writers as well as improvements in streaming residuals” and was prepared to improve its offer “but was unwilling to do so because of the magnitude of other proposals still on the table that the guild continues to insist upon”.The writers were well aware that a stoppage was likely. Yet the breakdown of contractual talks hours before a deadline that negotiations in previous years have sailed past left some people surprised, some worried, and some determined.Jonterri Gadson, a writer whose credits include A Black Lady Sketch Show, said: “When I saw the refusals to counter and the refusing to even negotiate by the AMPTP, I was like on fire to get out here and stand up for what we deserve.”On a picket line at Amazon Studios, she held up a sign that read: “I hate it here.”All of the top late-night American shows, which are staffed by writers that pen monologues and jokes for their hosts, immediately went off-air. NBC’s The Tonight Show, Comedy Central’s Daily Show, ABC’s Jimmy Kimmel Live, CBS’ The Late Show and NBC’s Late Night all made plans to show repeats during the week.NBC’s Saturday Night Live, which had been scheduled to air a new episode on Saturday, will also go off the air, with a repeat being shown instead. Two remaining episodes in the season are in jeopardy.",
        "The strike’s impact on scripted series and films will likely take longer to notice – though some shows, including Showtime’s Yellowjackets, have already paused production on forthcoming seasons.If a strike persists through the summer, autumn TV schedules could be upended. In the meantime, those with finished scripts are permitted to continue shooting.Union members also picketed in New York, where less known writers were joined by more prominent peers like playwright and screenwriter Tony Kushner (The Fabelmans) and Dopesick creator Danny Strong.Some actors including Rob Lowe joined the picket lines in support in Los Angeles. Many striking writers, like Gad, are hybrids who combine writing with other roles.Gad said of his fellow writers: “We are nothing without their words. We have nothing without them.“And so it’s imperative that we resolve this in a way that benefits the brilliance that comes out of each of these people.”The acting side of Gad’s career could be involved in a similar dispute soon, with many of the same issues at the centre of negotiations for both the actors’ union SAG-AFTRA and the Directors Guild of America. Contracts for both expire in June.Streaming has exploded the number of series and films that are annually made, meaning more jobs for writers. But writers have cited shifting and insecure conditions that the WGA called “a gig economy inside a union workforce”.",
        "The union is seeking more compensation for writers up-front, because many of the payments writers have historically profited from on the back end – like syndication and international licensing – have been largely phased out by the onset of streaming.The AMPTP said sticking points to a deal revolved around so-called mini-rooms – the guild is seeking a minimum number of scribes per writers’ room – and the duration of employment contracts.Writers are also seeking more regulation around the use of artificial intelligence, which the WGA’s writers say could give producers a shortcut to finishing their work."
    ]
}