{
    "articleURL": "/news/article-12043557/Video-resurfaces-VP-saying-inappropriate-Trump-send-troops-border.html",
    "content": [
        "Harris made the comments in 2018 as she criticized Donald Trump for using the military to fight illegal immigrationShe blasted the move then as 'inappropriate' and claimed it was nothing more than a PR stuntSenator Lindsay Graham warned against ending the emergency law and said that 'America is under siege' amid a surge in crossingsKamala Harris will face fresh accusations that she is soft on illegal migration after a video re-emerged of her bashing Donald Trump's move to send troops to the border. ",
        "The now vice-president made the remarks in 2018 in an interview with NBC News when she represented California in the U.S. Senate. 'It is inappropriate to require the limited resources of the United States military to be used in such a way,' Harris said.'All because there needed to be some demonstrations for the TV cameras based on a political agenda,' she added.",
        "But now her own boss has vowed to do just that; Joe Biden says he will send 1,500 soldiers down to the US's seemingly porous frontier with Mexico.  The president is making the move because a Trump-era Covid diktat making it easier to boot out illegals will expire on May 11.Harris has also been criticized for only visiting the border once in just over two years despite supposedly being Biden's main official for cracking down on illegal immigration.The vice-president's remarks, which resurfaced online earlier on Wednesday, prompted Republicans to suggest she was a hypocrite. Senator Ted Cruz, a Republican representing Texas, blasted the current administration's 'abysmal failure' in cracking down on bogus asylum-seekers.'Joe Biden and Kamala Harris have presided over the worst disaster at our southern border in our nation’s history,' he said.In a thinly-veiled reference to Biden's decision to scrap his predecessor's $16 billion border wall, Cruz said it is 'the consequence of deliberate political decisions that have created this chaos.'",
        "More than 2.3 million migrants tried to illegally sneak into the United States across the Mexican border last year, according to U.S. Customs and Border Protection.That is up from 1.7 million people in 2021 and just over 450,000 the previous year when much of the world was locked down during the coronavirus pandemic.Emergency powers to remove migrants, known as Title 42, come from a 79-year-old federal law that Trump used from the start of the coronavirus pandemic.It allows U.S. officials to expel migrants from the country without even hearing their asylum claims on public health grounds.Yet with the president's promise to end the coronavirus emergency legisation, those powers are set to lapse.Some border towns, including El Paso in Texas, have already declared a state of emergency.It is why conservative lawmakers have urged the commander-in-chief to consider granting any extension to their use.'America is under siege here,' said Senator Lindsay Graham of Arizona. 'May 11 is a nightmare day for the American people, particularly people in New Mexico and Texas.' 'In the next 90 days, you're going to (see) from 900,000 to 1.1 million\" migrants crossing the border,' he told reporters on Wednesday.",
        "The Biden administration announced on Tuesday it was mobilizing 1,500 more troops to help monitor and manage the expected flow of migrants.",
        "It already has some 2,500 already in place in anticipation of a surge of crossings after May 11.Homeland Security Secretary Alejandro Mayorkas also plans to visit the Texas border area on Thursday and Friday to review preparations for lifting title 42.The administration says it will use different legal tools to try and stem the amount of people trying to cross.Those powers, known as Title 8, will mean undocumented migrants detained inside the United States will be punished in such a way that will render them ineligible to come to the country legally."
    ]
}