{
    "articleURL": "/sport/football/article-12055475/Steve-McManaman-claims-Jude-Bellingham-treated-like-King-Madrid.html",
    "content": [
        "Jude Bellingham will be treated like the King of Madrid if he signs for themSteve McManaman, 51, played for both clubs and knows what it feels likeReal Madrid face Manchester City in the Champions League on TuesdayJude Bellingham will be treated like the King of Madrid IF he signs for the Spanish side ahead of their Champions League rivals.",
        "Former England international Steve McManaman played for both clubs and knows how that feels having switched to La Liga from Liverpool in his prime.And although he rates City favourites to emerge as finalists after his two former sides start their semi-final tie this week, he feels the Spanish side will always have an attraction ahead of the English elite.'Nothing is going to happen until the summer – if at all – but if Jude does happen to sign for Madrid he will be treated like a king,' McManaman explained.'I think there's something starry-eyed about Madrid. They are trying to accumulate younger players as they have been over the last few years. They've certainly got the finances.",
        "'They thought they were going to get Kylian Mbappe and they bid for Mbappe last summer. I think with the added stardust of playing for playing for Real Madrid with the history they have in the city that they are. And everything that goes along with this.'It will be this new phase of Madrid with the youngsters then taking over. And they'll be on the look out for more players.'Premier League leaders City go to the Bernabeu and Carlo Ancelotti's reigning champions, aiming to avenge last year's exit there and take another step towards an amazing treble-winning season.",
        "The only problem for City, McManaman believes is that Madrid players and supporters always feel like favourites having won the competition a record 14 times'It's in their DNA,' he smiles. 'This is the competition they pinpoint at the beginning of the season. They count the Champions League as more important than the league.'The fact that Atletico Madrid have taken over them in La Liga doesn't really mean that much to them. As long as they win in Europe.'Everybody's looking at this semi-final because of the draw. Whoever wins out of these two will be strong favourites for the final won't they?'You'd have City as favourites for many reasons, but last year I thought it would be a bridge too far for Madrid when they played City, but they somehow got the job done.'The final fascinating storyline to the tie is Pep Guardiola, a legend of Madrid's rivals Barcelona, returning to the Bernabeu trying to win the only trophy that has eluded him since he moved to England.McManaman, however, insists the Catalan coach does not need the silverware to prove his greatness to anyone in Spain or the rest of the world.",
        "He added: 'I think it's more in our country, isn't it? In our country we view it as 'Oh my God, he needs to win!' Oh, he hasn't done it since Messi, blah, blah, blah. I don't personally see it like that. I think he's a wonderful manager.",
        "'I think I think he made Bayern Munich better even though he never won the treble like the previous managers. I still think they were a better team to watch and I still think they played better football. And I believe that now what he has done at Manchester City is exactly the same.'McManaman does recognise how a victory would at least end the debate about Guardiola's abilities and concluded: 'It's like Frankie Dettori winning the Derby. 'I've done that now'. Tony McCoy winning the Grand National. 'I've done that now'. So it just stops people mentioning it again. That's all it is. But for me, I think it's nonsense, to be very honest.'BT Sport is the exclusive home of the UEFA Champions League. Watch Real Madrid v Man City on Tuesday 9th May from 7pm, live on BT Sport 1. For more info, visit bt.com/sport"
    ]
}