{
    "articleURL": "/tvshowbiz/article-12049119/Alec-Baldwin-admits-FORGOT-include-Ireland-post-praising-seven-reasons-carry-on.html",
    "content": [
        "The father of eight shared a slideshow of the seven children he shares with his second wife Hilaria Baldwin on Thursday He said they were his 'seven reasons to carry on during some tough times', a reference the recent legal battle he endured following the fatal Rust shootingBut he was called out by fans for excluding Ireland, his eldest child with ex-wife Kim Basinger, and he swiftly posted a follow up black-and-white image of herFather of eight Alec Baldwin admitted he 'forgot' to include his eldest daughter Ireland while praising his 'seven reasons to carry on' in a post about his children. ",
        "Baldwin, 65, shared a slideshow of the seven children he shares with his second wife Hilaria Baldwin, where he appeared to reference the recent legal battle he endured following the fatal Rust shooting.  'Seven reasons to carry on during some tough times. I'm not gonna lie, without my family, I don't know what my life would be,' he captioned the post.But fans quickly called him out after they noticed one very important person was missing from his post - the daughter he share with ex-wife Kim Basinger, Ireland Baldwin, 27.Shortly there after, Baldwin made a post dedicated to his firstborn - and awkwardly admitted he 'forgot' to include her in the original post.",
        "'We forgot Billy Preston! This one, the first one, is about to make me a grandfather. Oy,' he captioned the post.The original post contained seven individual photos of the children he shares with Hilaria - daughters Carmen, nine, Lucia, two, Ilaria, nearly eight months, and sons Leonardo, six, Rafael, seven, Romeo, four, Eduardo, two. But fans were quick to notice Ireland's absence, and took to the Instagram comments to hold Alec to account.'Don't you have 8 children?' one commenter wrote.'What about Ireland?' another wrote.'Guess Ireland doesn't count??' one fan posted.'Lol forget Ireland, I guess,' another commented.",
        "'Ireland???? The (goat) emoji),' one Instagram user wrote.",
        "Even after Baldwin dedicated an entire post to Ireland, the shaming continued in the comments section of the new photo. 'This post is super cringe worthy. \"Forgot?\"... do better,' one Instagram user posted.'Messed up that you forgot her in the first place. You never include her. Someone probably called it to your attention or would you have even mentioned her and your new Grandchild. Wow,' another wrote.'How do you forget one of your kids tho really. This is the exact reason I cut my dad off. He forgot me and my 3 kids. Cut gik,' another wrote.'He has so many babies now he \"forgot\" he had an adult daughter. So cringe,' another posted.Several fans also wondered why Baldwin had referred to Ireland as 'Billy Preston' in the new post. ",
        "While it's possible it is a nickname she goes by, commenters pointed out the musician Billy Preston is also known as the 'fifth Beatle.' Ireland and Alec have famously had a rocky relationship.When Ireland was just 11, her father left her a scathing voicemail that was leaked to the press.The clip saw the actor call his daughter a 'rude, thoughtless little pig' for not answering the phone when he rang. ",
        "The two have repaired their relationship since then.",
        "In 2019, Ireland made light of the voicemail at his Comedy Central Roast.'I'm here to roast this big old ham I call my father,' she smirked.'Speaking of pigs, some of you may remember me as that \"thoughtless little pig\" you read about. That was a decade ago, and my dad and I are in a much better place now. He would never say something like that,' she went on. 'Because I'm 6-foot-2 and I would kick his a**.'Ireland is now pregnant with her first child. She is expecting a daughter with her boyfriend RAC, and plans on naming her Holland. The post comes after all charges against Baldwin were dropped in the accidental shooting death of cinematographer Halyna Hutchins, 42, on the New Mexico set of Rust. "
    ]
}