{
    "articleURL": "/wires/reuters/article-12057627/Alcaraz-set-reclaim-number-one-spot-Rome-Madrid-triumph.html",
    "content": [
        "By Fernando Kallas",
        "MADRID, May 7 (Reuters) - Carlos Alcaraz is raring to get to Italy next week to compete in the Rome Masters for the first time in his career and reclaim the world number one spot from Novak Djokovic.After retaining his title in Madrid on Sunday by beating lucky loser Jan-Lennard Struff 6-4 3-6 6-3, Alcaraz only has to show up and play in Rome to leapfrog Djokovic.Rankings are based on points claimed at each tournament, which expire every year. To maintain the points won at an event a player must at least match the tally from the previous year.Alcaraz skipped the Rome Masters last year due to an ankle injury so has no points to defend while Djokovic won in Rome last year and thus cannot improve his overall points total.With only five points set to divide the two players in the next set of rankings Alcaraz will move above the Serbian into top spot even if he loses at the first hurdle in Rome.After an injury-plagued start to the season, Alcaraz said he is 100% and thinking big, motivated to keep improving his game as he builds up for the French Open, which starts on May 28.\"I am an ambitious guy and I'm going full for the win in Rome,\" Alcaraz told a news conference on Sunday.",
        "\"What I am achieving is something big. I just have won my 10th title, my fourth Masters 1000, back-to-back titles here in Madrid and very close to reclaiming the number one world spot.\"It's a special moment and I'm very proud of what I am accomplishing. The work I'm putting in.\"The Spaniard, who turned 20 on Friday, has enjoyed a spectacular start to his career by winning the U.S. Open last September to become the youngest man to top the rankings.On Sunday, he had to play his best to beat a relentless Struff and clinch his fourth title of the season, adding to triumphs in Buenos Aires, Indian Wells and Barcelona.\"I know I have an ability to play good in the important moments,\" Alcaraz said. \"I am a player who grows under pressure, in the big stage, and I like to do different things in those moments. To adapt to what my opponents bring to me.\"I am a finals' player: I played 13 finals and won 10.\"He has joined Rafael Nadal as the only back-to-back Madrid champion and is the youngest to retain an ATP Masters 1000 title since his fellow Spaniard at Monte-Carlo and Rome in 2005-06. (Reporting by Fernando Kallas; Editing by Ken Ferris)"
    ]
}