{
    "articleURL": "/tvshowbiz/article-12055437/Queen-Charlotte-Bridgerton-Story-heartbreaking-bit-sexy-suspend-disbelief.html",
    "content": [
        " Queen Charlotte is an origins story, as we'd say if this were the Marvel franchise I cried at the end, I'm not ashamed to say. Except I am. A bitQueen Charlotte: A Bridgerton Story ",
        "Rating:Tom JonesRating:A new series of Bridgerton, so it's back to the 'ton', which I had thought was an antiquated way of saying 'town' but actually, I've just discovered, it comes from 'le bon ton', referring to 'good manners' and, therefore, Regency high society. This shows how much I know, and if you don't trust me from here on in, that may be wise, and I wouldn't blame you. At all.Queen Charlotte is an origins story, as we'd say if this were the Marvel franchise, but what you most need to know at this point is: while the first series of Bridgerton was great and very sexy, and the second was Mills &amp; Boon-ish and not very sexy, this is a bit sexy but, more than that, if you stick with it – there's a big change midway through the six episodes – it has real emotional heft.",
        "I cried at the end, I'm not ashamed to say. Except I am. A bit.This takes us from 1813 back to 1761 when Princess Charlotte of Mecklenburg-Strelitz (Germany) was married off to King George III, sight unseen, at only 17. Lady Whistledown, the writer of the society gossip pamphlet (voiced by Julie Andrews), introduces the first episode with: 'Dear Gentle Reader, this is the story of Queen Charlotte from Bridgerton. It is not a history lesson. It is fiction inspired by fact. All liberties taken by the author are intentional. Enjoy.'",
        "Hang on, Lady Whistledown's identity was uncovered in series two as Penelope Featherington, who was 18 in 1813, but now we're 52 years earlier, so this is the voice of someone yet to be born?One thing you can certainly trust me on is: to enjoy Bridgerton you do have to suspend disbelief. Quite substantially.Charlotte – played magnificently by India Amarteifio as punchy but also vulnerable – arrives in Britain with only six hours to go until her wedding, which did actually happen. But here, her first meet-cute with George (Corey Mylchreest) occurs moments before when, filled with fear at marrying a man she doesn't know, she tries to escape by climbing over a palace garden wall. George comes upon her, and when she realises George is charming and also looks part-Tom Cruise, part-Disney prince, is talked around, as well you might be. (There is no topless scything but George is into farming so, luckily for us, there will be topless ploughing.)The pair marry, but on what should be their wedding night he drops her at Buckingham House and says cheerio, heads to his own place at Kew, and that's the last she sees of him, for days, weeks. It's puzzling for us, and puzzling for her, but what we remember and she doesn't yet know is that this is the King George who was mad and was the subject of Alan Bennett's The Madness Of George III, which had to be retitled as plain The Madness Of King George in America as otherwise they thought they'd missed parts one and two. That is a fact, thrown in for free.",
        "Whereas race wasn't an issue in the first two series, it is here. Charlotte has 'moor blood', and as one courtier notes with dismay: 'No one said she'd be this brown.' Consequently, the King's mother (Michelle Fairley) launches 'The Great Experiment' to counteract racial snobbery by offering land and titles to people of colour – hence Lady Danbury, played by Arsema Thomas as a young woman and Adjoa Andoh as the older Lady Danbury we know.The older Lady Danbury is still enunciating to the back of the stalls: 'MARRIAGE is a. DUTY. NOT a. PLEASURE.' The younger Lady Danbury doesn't do that so it must be something she picked up over the years. This is, I should have said, told in two timelines, so we also have the older Queen Charlotte (Golda Rosheuvel) in her sky-high wigs and, as she has 15 children, we know the sex must happen. But when? And why hasn't it yet?As there is real chemistry between the two leads, there is a longing for it to happen, so it's mostly a bit sexy in that way. But, she quickly adds, there are raunchy parts, too.At the midway point it unexpectedly switches from her story to his, and this is when it becomes sad and moving and heart-breaking, truly, as well as a love story.",
        "Meanwhile, it's all wonderfully opulent and sumptuous and the floristry bill alone, God knows what that amounted to. However, it's not the full five stars because there are unnecessary subplots – one involving Violet Bridgerton – and it does drag until the switcheroo in points of view. I hope you can find it in your heart to trust me on all this. Particularly as I, too, live to serve.On to Tom Jones, an adaptation of the Henry Fielding book, that is actually books, plural, as it runs to – wait for it – 18 volumes. This is written by Gwyneth Hughes, who adapted the Vanity Fair (2018) that I adored, but this isn't quite up there. Yet. I've only watched the first episode (of four), so we might want to give it more of a chance.This is a light, frothy take on the misadventures of our hero (Solly McLeod), a foundling brought up by a wealthy squire (James Fleet). Once grown, he falls in love with his neighbour, Sophia Western (Sophie Wilde), but they're kept apart for the reasons that would otherwise go on for thousands of pages yet is told, thankfully, at quite the lick here.It's enjoyably watchable, stars several of our finest character actors (Alun Armstrong, Felicity Montagu, Shirley Henderson, Pearl Mackie), but is surface-skimming and the chemistry isn't there. Yet.",
        "I'll report back later, I promise, and you can trust me on that. Or can you?KISS FOR THE BRIDE: India Amarteifio as Charlotte and Corey Mylchreest, left, as George in the Bridgerton drama. Below: Sophie Wilde in Tom Jones"
    ]
}