{
    "articleURL": "/sport/football/article-12046747/Fulham-captain-claims-Stuart-Attwell-admitted-Liverpool-shouldnt-awarded-penalty.html",
    "content": [
        "Fulham's Issa Diop was adjudged to have fouled Darwin Nunez against Liverpool Mohamed Salah scored the penalty which proved to be the decisive in a 1-0 win Tom Cairney has claimed that referee Stuart Attwell admitted to making an errorFulham captain Tom Cairney has claimed that referee Stuart Attwell admitted he made a mistake over Liverpool's match-winning penalty.",
        "Liverpool clinched a narrow 1-0 victory over the Cottagers thanks to Mohamed Salah's 39th minute penalty.The spot-kick had been awarded after Issa Diop was adjudged to have fouled Darwin Nunez as the striker sprinted to steal the ball from the Fulham defender. Attwell pointed to the spot and VAR did not overturn the penalty, leaving Cairney and his Fulham team mates feeling aggrieved.  Cairney has now claimed that Attwell told one of his team mates that the wrong decision had been made. ",
        "Speaking to Sky Sports after the game, he said: 'The ref made a decision, I thought he had seen contact. I asked him 'please just make sure they (VAR) check it'. 'He said they had checked it but then he said in the second-half to one of our players that it wasn't a penalty.'So it's frustrating because it goes to other people to make the correct decision.'Issa Diop hasn't touched him, Nunez has taken another step and then gone over, and then you lose to something like that at Anfield which is frustrating when we're trying to climb as high as we can.' It comes just days after Tottenham interim boss Ryan Mason criticised Paul Tierney for failing to send off Diogo Jota for a high boot on Oliver Skipp.",
        "Jota went on to score the game's winning goal in a thrilling 4-3 victory for the Reds.In what has been a frustrating season for the Reds, their victory over Fulham was their fifth win in a row - their best run of the campaign.Liverpool have narrowed the gap to the top-four to four points, though fourth placed Manchester United have two games in hand.  For Fulham it was their third consecutive defeat, though they comfortably sit inside the top-half of the Premier League table in 10th - five points ahead of Crystal Palace.  "
    ]
}