{
    "articleURL": "/wires/reuters/article-12060627/Woman-sued-Subway-tuna-seeks-quit-case-Subway-demands-sanctions.html",
    "content": [
        "By Jonathan Stempel",
        "May 8 (Reuters) - The California woman suing Subway, claiming its tuna products contain ingredients other than tuna, wants to end her lawsuit because she is pregnant, prompting Subway to demand her lawyers be sanctioned for bringing a frivolous case.Nilima Amin said her \"severe\" morning sickness and \"debilitating\" conditions as she prepares for a third child have left her \"unable to proceed with the obligations as plaintiff,\" and require her to focus on her health and family.Amin wants to dismiss the case in San Francisco federal court without prejudice, which would let her sue again when she feels better.In a May 4 filing, Subway said Amin's excuse flunked the \"straight-face\" test, and her lawyers likely realized it would not \"simply pay the windfall settlement that they hoped to get by constructing a high-profile shakedown.\"Subway also said the \"media frenzy\" from the lawsuit caused severe harm, and faulted Amin's \"ever-changing\" theories to debunk its claim that its tuna sandwiches, salads and wraps contained \"100% tuna.\"The chain wants Amin's proposed class action dismissed, and her seven lawyers to pay at least $618,000 of its legal bills.Jeffrey Lamb, one of the plaintiff's lawyers, declined to comment, and said court protocol requires that Amin's filings \"solely articulate our position.\"",
        "Amin claimed to have ordered Subway tuna products more than 100 times before suing in January 2021.She accused Subway of using other fish species, chicken, pork and cattle in its tuna products, or no tuna at all.Last July, U.S. District Judge Jon Tigar in San Francisco let Amin's case continue but rejected her claim that \"reasonable consumers\" would expect only tuna and nothing else, calling it a \"fact of life\" that ingredients such as mayonnaise were okay.Subway has nearly 37,000 restaurants in more than 100 countries.The case is Amin v Subway Restaurants Inc et al, U.S. District Court, Northern District of California, No. 21-00498."
    ]
}