{
    "articleURL": "/sport/football/article-12042173/Sam-Allardyce-takes-training-session-new-Leeds-manager.html",
    "content": [
        "Sam Allardyce's appointment as Leeds manager was confirmed on WednesdayThe Yorkshire club confirmed Allardyce would replace the outgoing Javi GraciaFollow Mail Sport's LIVE blog for all the latest after Sam Allardyce is appointedSam Allardyce has been seen putting his new players through their paces after being officially unveiled as Leeds United boss.",
        "Allardyce replaced Javi Gracia on Wednesday morning with the 68-year-old taking charge for the final four matches of the season.The former England boss wasted no time in getting to work with the players at Leeds' Thorp Arch training ground.Allardyce will have four games to preserve the Yorkshire club's status in the Premier League.He will seek to lift a Leeds side currently on a five match winless run, with the Whites having lost four of those fixtures.",
        "Leeds are languishing in 17th and only goal difference keeping them out of the relegation zone.Allardyce admitted he had been surprised to receive the call to take charge at Leeds. 'I was shocked,' he told talkSPORT prior to his appointment being confirmed. 'I never thought at this stage of the season… I thought there would be no jobs.'The phone popped up with a name I knew fairly well, I knew what it was, and it took me two seconds to say yes.'When announcing Allardyce as Gracia's replacement, Leeds pointed to his expertise in helping teams to avoid relegation. 'Allardyce has managed over 500 Premier League games in a managerial career stretching 29 years and he brings a wealth of knowledge in fighting for survival, having guided a number of his previous clubs to safety,' a Leeds statement read.",
        "'Over the past decade he has successfully helped Sunderland, Crystal Palace and Everton avoid relegation from the Premier League during short-term stints.' Allardyce will be paid £500,000 to take charge for the final four matches of the season and will net a bonus of more than £2.5million if he succeeds in preserving their top flight status.",
        "The new Leeds boss has just three days to prepare his side for a daunting trip to the Etihad to face title chasing Manchester City.A tough run-in includes hosting a Newcastle United team appearing bound for the Champions League, before matches against West Ham and Tottenham.Allardyce will be assisted by former MK Dons and Oxford manager Karl Robinson, while ex-Leeds striker Robbie Keane is expected to join the coaching staff.Allardyce will face having to lift a demoralised and divided group of players, as Mail Sport has learned that there are divisions in the dressing room at Elland Road.There are tensions between Leeds’ younger and more experienced players, with a number of the youngsters believing the team are suffering from a lack of leadership shown by the club’s senior professionals.Allardyce's appointment came amid a whirlwind 24 hours at Leeds, with director of football Victor Orta having left the club alongside Gracia."
    ]
}