{
    "articleURL": "/news/article-12059721/Experts-warn-disturbing-trend-youngsters-filming-attacks-children-sport.html",
    "content": [
        "The brother of one victim said: 'A child is going to lose their life from this craze'Experts are warning about a dangerous trend where footage of children being attacked is put on social media and 'seen as sport' - amid fears 'there will be a tragedy if something is not done'. ",
        "Christine Pratt, founder of the National Bullying Helpline described the worrying incidents as an 'escalating trend' - but did not know the reason why it was happening. 'It is seen as sport and amusement by the children involved,' she said. The brother of one victim claimed: 'A child is going to lose their life from this craze. It's happening all over the country.'Disturbing footage of a 12-year-old girl being lured to a park in Merseyside and viciously attacked was shared in another incident. She was allegedly dragged to the ground, punched in the face and kicked. ",
        "The incident was filmed and footage, seen by the Liverpool Echo, shows around a dozen other children gathered watching and cheering the attacker with one saying 'smash her head in' and 'chat s*** get banged'.The victim's mother said older boys were kicking her daughter in the head during the sickening incident in Old Rough Park, Kirkby, on April 22. She revealed they have since moved away from the area.  A week after the attack, Merseyside Police said a 12-year-old girl was arrested on suspicion of Section 47 assault causing actual bodily harm. She was released under investigation while police looked to identify everyone involved.Community policing superintendent Karl Baldwin described the video of this assault as 'completely reprehensible' and said to share it online was 'humiliating'. ",
        "Christine Pratt, founder of the National Bullying Helpline, told the Echo: 'What's happening is really disturbing. Parents report it to us when they hear about what has happened but a lot of the time they don't hear. The behaviour of videoing the assault and putting it on social media is ongoing intimidation and cyber bullying.'It is seen as sport and amusement by the children involved. There will be a tragedy if something isn't done. I honestly don't think something will be done until it happens to a politician's child. 'But we also don't know that there hasn't already been a tragedy - child suicide is on the rise at the moment and we know how traumatising these incidents are for those involved.'",
        "Ms Pratt said there are some children who will participate or goad the attackers, but others who feel traumatised by seeing it happen.  The expert said schools need to collaborate with police and charities so children feel comfortable enough to report incidents. According to reports, another attack - also in Old Rough Park - involved a 13-year-old girl being punched and stamped on by a gang of teenagers after six months of bullying. Her parents said she suffered severe cuts and bruising during the attack.The girl's mother claimed the incident was filmed by older children and one even encouraged the attacker to punch her in the face rather than the back of her head.  ",
        "They are also moving away from the area. In yet another example of the distressing trend, a 13-year-old girl was allegedly dragged to the ground and kicked in the head by youngsters before Easter - then video was shared by children in Rochdale. Billy the half-brother, and legal guardian of the victim told Sky News: 'I believe this was created solely for the content of the internet.'He added: 'A child is going to lose their life from this craze. It's happening all over the country.'Community Policing Superintendent Karl Baldwin told MailOnline: 'The social media video showing the assault of a 12-year-old girl in Old Rough Park on 22nd April was completely reprehensible. 'To attack someone in this manner is appalling, but to also record it on a mobile phone and then share it online is even worse and something we take extremely seriously at Merseyside Police.'To be the victim of an assault can be traumatic, but to then see it being shared online must be incredibly humiliating. We will continue to support any victim who finds themselves in this situation and do all we can to bring those responsible to justice.'Nobody wants to live in a community where this behaviour is commonplace, accepted or normalised. It is not. I would urge parents to make sure they know where their children are when they are out and about in the local community. The actions of children, or anyone, who commits anti-social behaviour or more serious offences cannot be tolerated and we would ask parents to play their part in ensuring their children don't end up on the wrong side of the law. ",
        "'Furthermore, if parents are aware that their child has committed an offence, they should do the right thing and contact us.'If you are a victim of any form of abuse, whether it's physical or verbal, or you are worried for the safety or wellbeing of a child, please get in touch with us right away.'Greater Manchester Police said: 'We would encourage anyone who is subject to offences on social media that encourages violence against another human being, to have the confidence to report them immediately to GMP via 101 or 999 in an emergency.'Greater Manchester Police is committed to investigating each and every complaint received of this nature and bringing the perpetrators to justice, because those who are inciting violence through the use of social media, are committing crimes.'"
    ]
}