{
    "articleURL": "/sport/football/article-12048023/Brighton-1-0-Manchester-United-Alexis-Mac-Allister-smashes-home-dramatic-99th-minute-penalty.html",
    "content": [
        "Mac Allister's penalty led Brighton to a 1-0 win over United after Shaw's handball The Red Devils were left to rue wasteful finishing at the Amex StadiumBrighton's push for a European spot takes a major boost following the huge win Every so often a game gets the crescendo it deserves. Every so often an encounter of brilliant, ceaseless madness and mistakes and chances delivers the sort of ending an entire evening has built towards.",
        "In the context of this nonsensical and marvellous reunion of Brighton and Manchester United, that meant a desperately late penalty. And it had to be one of those, really.It was penalties that did for Brighton at Wembley in their FA Cup semi-final less than a fortnight ago and so naturally it was a penalty that did for United here in the sequel. A penalty by Alexis Mac Allister in the ninth minute of stoppage time, if we are to be precise in the recording of these things.And yet we cannot get into that straight away, because we need a few words on what preceded it, because for 98 minutes this was a night to celebrate the rare glory of a 0-0 draw.There had been no goals, and no great movement towards where these sides want to be, but it had been a treat nonetheless. ",
        "Scoreless can be fine when scoreless is so entertaining, spread across no fewer than 38 shots, countless tantrums from both benches and overseen by a referee in Andre Marriner who had given Brighton precious little through the evening.And then, five minutes into stoppage time, that all turned. A referral went to the VAR because, after the umpteenth wave of Brighton attacks, Luke Shaw appeared to handle at a corner. Shame for him – he had put in another very good shift. ",
        "And a shame for United because they had ridden so much pressure, and had squandered so many opportunities of their own, but when Marriner went to the monitor the writing was eventually on the screen and then the wall - a penalty.The crowd called for Solly March, because it was his missed kick that proved decisive in the FA Cup. But that would be too neat and probably too much pressure.",
        "Brighton (4-2-3-1): Steele 7.5; Caicedo 5.5, Webster 7, Dunk 7, Estupinan 7; Gilmour 6.5 (Colwill 75, 6), Mac Allister 8; Enciso 7.5, Buonanotte 6.5 (March 63, 6.5), Mitoma 7; Welbeck 6 (Undev 75, 6).Subs not used: Sanchez, Van Hecke, Offiah, Moran, Ayari, Peupion.Booked: Webster, Dunk, Caicedo, ColwillManager: Roberto De Zerbi 7.5Manchester United (4-2-3-1): De Gea 7; Wan-Bissaka 7, Lindelof 5, Shaw 7, Dalot 6.5; Casemiro 7, Fred 6.5 (Sabitzer 76); Antony 6 (Sancho 76), Fernandes 7, Rashford 6.5; Martial 5.5 (Weghorst 84).Subs not used: Butland, Maguire, Malacia, Williams, Eriksen, Pellistri.Booked: Casemiro, Dalot, Antony, ShawManager: Erik Ten Hag 6Ref: Andre Marriner 5",
        "So no, instead it was the Argentine, Mac Allister. David De Gea went to his left and the kick thundered in the opposite direction to the top corner. It won’t exorcise the agonies of a Wembley defeat, but it will help.",
        "It will help Brighton on their mission to end a superb season with European qualification. It will also help Erik Ten Hag sharpen his conviction that he needs a new striker, and most likely Harry Kane after a night in which his side had so many openings and no goals.But a United win would have been harsh on Brighton. They were excellent when they weren’t fallible. They controlled the game, had the best of it, and were a delight to watch in their strengths and their weaknesses.When it was done, Roberto De Zerbi went berserk - he waved like a madman. He has been unwell in recent days and nearly missed this one. As it happens, he rocked up on the mildest of Sussex evenings with a scarf around his neck, and left looking like he had done himself more harm than good. At least he had a good time doing so, in what was likely the most dramatic day of an exceptional tenure since he replaced Graham Potter.Currently it has been good for a place in the top six. If they utilise two games in hand on Liverpool, that could be fifth – it is deep into manager of the year territory.As for Ten Hag, he can broadly reflect on one cup won, a place in another final and a team that is heaven and earth away from the shambles that lost here 4-0 a year ago. ",
        "But those are consolations for another time, because this loss will sting, just as it will hurt that they are still looking over their shoulder at Liverpool, when a win would have given them third ahead of Newcastle for the moment.",
        "He knew this game had opportunities for him and his side, to which he had made four changes, as had De Zerbi with Brighton.The upshot of all that tweaking? An opening half that was gloriously messy, featuring a number of excellent, untaken chances and a recurring battle between Kaoru Mitoma and Wan-Bissaka.The first of many big moments went to United inside 75 seconds, when Antony blew a one on one with Jason Steele.It set a tone, because a moment later Victor Lindelof botched a pass across his own area to Aaron Wan-Bissaka, allowing Mitoma to intercept for a clear run at goal. Ignoring the option to square to Julio Enciso, the Japanese winger blasted straight into the face of David De Gea. An opportunity wasted and several minutes of treatment followed for the keeper.In the subsequent blur of errors and anxieties, Mitoma and Wan-Bissaka entered a battle royale, pitting one of the division’s most exciting revelations against one of its most adept handlers of a duel. ",
        "Mitoma shaded it but it was great to watch, as were the succession of chances missed by Mac Allister, Enciso and Buonanotte on one side and Marcus Rashford and Antony on the other.Brighton were the more frustrated to be level at the break. And United? Too regularly their approach seemed limited to targeting Rashford up the left and hoping for some individual magic against Moises Caicedo, a midfielder repurposed as a right-back.The second half matched the first for drama, which almost boiled over when Lewis Dunk and Antony almost came to blows. Marriner handed out yellow cards to each but was in danger of losing control, having already lost the crowd for overlooking two penalty appeals by Mitouma.That changed when he finally gave one against Shaw. So did the game. Great stuff."
    ]
}