{
    "articleURL": "/tvshowbiz/article-12059717/Julie-Chrisley-broken-bars-regrets-did-fame-money.html",
    "content": [
        "Julie, 50, is serving a seven-year jail sentence in Lexington, Kentucky, while her husband Todd, 54, is serving 12 years in Pensacola, Florida The disgraced Chrisley Knows Best matriarch was charged with bank fraud, tax evasion, wire fraud, obstruction of justice and conspiring to defraud IRS  READ MORE: Todd and Julie SLAM 'scorned gay lover' as a 'liar' in explosive appeal docs - and claim investigator had a DARTBOARD with Todd's face on it Julie Chrisley has been 'broken down' by her brief time behind bars - and now bitterly 'regrets' the extreme lengths she went to for fame and money, blaming herself for allowing her husband Todd to 'push her into' a tax fraud scheme that ultimately saw them both sentenced to lengthy stints in prison. ",
        "According to a source close to the 50-year-old, mother-of-three Julie is 'not doing well at all' in prison, with the insider adding that the former reality TV star has been consumed by remorse over the role she played in the $30 million crime, for which she is now serving seven years at FCM Lexington. 'She has broken down. She is not doing well at all,' the source shared. 'She cannot fathom how she will spend years being locked up and feels that she let her family down.' The insider added that Julie - who is on month four of her lengthy sentence - is now telling friends that she is furious with herself for allowing her husband Todd, 54, who was sentenced to 12 years in prison, to convince her that they would 'never go to jail' for the scheme. 'Todd assured her that they would not go to jail and now Julie regrets what she did in the name of fame,' they continued, adding that the ex-reality matriarch is losing all hope that the pair will manage to pull off a successful appeal. ",
        "'She is losing faith that they will get this overturned and she is so sad. It is heart breaking,' the source shared.A spokesperson for the Chrisleys did not respond to a request for comment.  ",
        "Last week, Julie's daughter Savannah shared some insight into her mother's prison struggles on her podcast, explaining that the matriarch was 'scared' but that she was keeping herself busy by 'taking classes'.  Todd and Julie are also the parents of son Chase, 26, and Grayson, 16, while Todd also shares daughter Lindsie, 33, and son Kyle, 31, with his ex-wife Teresa Terry. In 2016, Todd and Julie gained custody of their son Kyle's daughter Chloe, 10, with his ex Angela Johnson. The custody was handed to Savannah when her parents entered prison - something that has left the 25-year-old struggling to cope, the insider added.'Savannah is just not coping well with trying to be a mom to Chloe and her brother Grayson,' they shared. Savannah - who was kicked off a Southwest flight for 'unruly' behavior recently - talked about Julie's situation in great depth on her latest Unlocked podcast. ",
        "She said that Julie sent her home from one prison visit with '30 to 40 days worth of letters,' adding that was 'like her daily diary'.  'It was a lot to read, it was tough to see the accounts of her day and just things that she's scared of or nervous about or just all the thoughts that go through her mind,' Savannah explained. ",
        "Savannah has visited both Todd and Julie since their January surrender and said that her mom is has been 'taking classes' to pass the time. 'She’s just staying busy. You know, like, she’s trying to do anything and everything, take classes - everything known to man that she can do, she does.'Savannah also added that she thinks her mom was trying to 'shield' her kids 'from a lot of things' regarding their legal issues so as to protect them. She told her listeners: 'It's hard, it is extremely...' when discussing her newfound role as a caregiver to her underage brother and niece. 'I'm helping to raise my 10-year-old sister and 16-year-old brother, and I'm trying to date,' Savannah joked.'And I'm like, \"What do you do with them?\"' she admitted. 'The 16-year-old, he drives and all that, but the 10-year-old I'm like, \"You gotta maybe come have dinner with me.\"' On a January 5 episode of Julie and Todd's former podcast, Chrisley Confessions, Julie seemed hopeful when discussing her impending prison stay.'I think it puts things into perspective for me because we all think our hard is the hardest thing,' she said.",
        "'It has been such a source of strength for me because I have not typically been a crier and this whole experience has truly taken me to my knees.",
        "'There is that possibility of my husband I being separated. But there's a difference between my husband and I being separated for a period of time and having to say goodbye forever.'Todd and Julie were found guilty on federal charges of bank fraud and tax evasion and submitting false documents to banks to take out loans, reportedly worth more than $30 million, to finance their opulent lifestyle.They were indicted in 2019. After a lengthy trial, they were convicted on ten counts of fraud in June 2022. They were convicted in June 2022 by a 10 person jury. They received their sentences in November 2022 - and quickly watched their reality TV empire crumble as a result. Their television show, Chrisley Knows Best, as well as the spinoff, Growing Up Chrisley, was yanked off the air by USA network. For many years, the show served as a platform to boast about their exuberant lifestyle. While going through the proceedings, Todd said, 'In a year we probably spend $300,000 a year, probably more, on clothing. I approve every piece of clothing that our children wear.'Todd was ordered to serve 12 years in prison, and Julie to serve seven, with both also sentenced to 16 months of probation upon their release."
    ]
}