{
    "articleURL": "/tvshowbiz/sam-thompson/article-12042727/EXC-broke-tears-diagnosed-ADHD-says-Sam-Thompson.html",
    "content": [
        "Sam Thompson has revealed he wants to be a 'better version of himself' for girlfriend Zara McDermott after she pushed him to get help for his ADHD.",
        "The former Made In Chelsea star, 30, admitted he broke down in tears when he was diagnosed with attention deficit hyperactivity disorder (ADHD).In an exclusive interview with MailOnline, Sam detailed the emotional moment - which was filmed for his new documentary Sam Thompson: Is This ADHD?He explained: 'I didn't think I would be bothered, and after six hours of therapy she told me I had ADHD.'The expert then told Sam he was a 'very special person' and in that moment, he explained: 'I just wept, I got really emotional. So yeah it was definitely a relief.'",
        "Sam then revealed it was his desire to become a dad that finally pushed him to get help for his ADHD. The Staying Relevant podcaster admitted he 'does really want kids' one day but felt like he couldn't 'even look after himself' and needed to find a way to deal with it. Sam explained: 'I think just knowing I have it has made me a better person, more self-aware. 'I want to be a dad, I'm not saying now but at some point I want to know I can look after someone. I want to be the person they look up to and feel safe with and I can provide for'.On the reality stars new documentary, his girlfriend Zara revealed she does get frustrated doing things for her beau at times, such as admin jobs.",
        "He admitted that it was 'really tough' listening to how Zara felt as he 'wasn't aware of how much it may have affected' her before.Sam gushed: 'Zara is the best girlfriend in the world really. She is so supportive, I'm very lucky to have her. There's things we talk about in the documentary that are slightly hard hitting and sometimes I thought oh I didn't know my ADHD affected you in that way.'Their relationship has been going from strength to strength since they got back together in 2020 following a brief split. Sam added: 'I will say this, we have always has a pretty good relationship but you can always be better. I want to be the best version of myself for her because I've never really had that. We talk more and the more you communicate the better things get.'",
        "Throughout much of his life, Sam thought something was different about him and people would often point it out.Sam said: 'Everyone used to tell me when I was younger and then everyone I worked with but I didn't care, I was so young. 'As I got older it became more apparent when life got more series, things started unravelling and I needed a read on myself.'Sam has made a successful career from being a loveable and funny person on TV and social media. He now presents a show on Hits UK radio and hosts the official Love Island podcast, The Morning After.",
        "When asked if ADHD has negatively impacted his career, Sam responded: 'Thankfully not because I love what I do. 'ADHD is a blessing and a curse, but it is the hyper focus eliminate of it, when I get hyper focused on something I enjoy, I love it, I love this industry.'I'm very lucky that it has only affected me in a good way. Hosting is about charisma and making people feel comfortable and the more professional bit comes second and so it has helped my career.'On his new TV series, after Sam gets diagnosed with ADHD he decided to try some medication to help him focus and so took a low dose of a drug called Elvanse. However, despite it making the TV personality 'feel slower and not in a bad way' he did struggle with some side-effects such as not being able to sleep and lose of appetite.Sam decided not to take the drug again but after his diagnosis he is a lot 'more self-aware' and takes a breather when he is 'having a moment which really helps'.",
        "The reality star also uses other coping mechanisms such as therapists, behavioural experts and 'about 1,000 fidget spinners'.He explained: 'Knowing is the main thing for me rather than the medication. Knowing I have something that alters my mental state. ",
        "'If I'm ever feeling overwhelmed now, I know now it won't last. It is a lot of the power, it doesn't change things but it makes me a tiny bit more calm.'He was able to go private with his assessment for ADHD, something that not everyone can afford to do as it can cost thousands of pounds, and he acknowledges this, insisting it 'absolutely needs to change.' Sam Thompson: Is This ADHD? is on Monday 8 May at 9pm on E4 and All 4",
        "Attention Deficit Hyperactivity Disorder (ADHD) is a behavioural condition defined by inattentiveness, hyperactivity and impulsiveness.It affects around five per cent of children in the US. Some 3.6 per cent of boys and 0.85 per cent of girls suffer in the UK. Symptoms typically appear at an early age and become more noticeable as a child grows. These can also include:Constant fidgeting Poor concentrationExcessive movement or talkingActing without thinkingInability to deal with stress Little or no sense of danger Careless mistakesMood swingsForgetfulness Difficulty organising tasks Continually starting new tasks before finishing old onesInability to listen or carry out instructions Most cases are diagnosed between six and 12 years old. Adults can also suffer, but there is less research into this.ADHD's exact cause is unclear but is thought to involve genetic mutations that affect a person's brain function and structure.Premature babies and those with epilepsy or brain damage are more at risk. ADHD is also linked to anxiety, depression, insomnia, Tourette's and epilepsy.  There is no cure. A combination of medication and therapy is usually recommended to relieve symptoms and make day-to-day life easier. Source: NHS Choices "
    ]
}