{
    "articleURL": "/news/article-12049837/6-3-magnitude-earthquake-hits-central-Japan.html",
    "content": [
        "The quake struck at 2:42 pm (0542 GMT) at a depth of 6 miles, officials reportedIt hit northern tip of Ishikawa Prefecture's Noto Peninsula, 180 miles from TokyoA magnitude 6.3 earthquake has struck Japan's central Ishikawa region, leaving at least one person dead and 21 injured.",
        "The quake hit at 2:42 pm (0542 GMT) at a depth of 6 miles, according to the Japan Meteorological Agency. Some houses collapsed, and rescuers are still searching for another person trapped under the rubble.No tsunami warning was issued, the country's weather agency said. The quake registered an upper six on the Japanese Shindo scale of up to seven near Suzu city, Ishikawa, prompting warnings it could cause major landslides.Suzu is found on the northern tip of Ishikawa Prefecture's Noto Peninsula on the Sea of Japan coast, which sits around 180 miles from Tokyo. ",
        "Government spokesman Hirokazu Matsuno told reporters in the capital Tokyo that one person was reported dead and there were 'multiple reports of collapsed buildings'.The victim fell from a ladder, a crisis management official in Suzu told AFP news agency, adding that 21 other people had been injured.The local fire and disaster management agency said at least three structures had been destroyed with two people trapped inside.One had been pulled from the debris and sent to hospital and rescuers were searching for the other.NHK footage showed traditional wooden houses destroyed or tilting with broken windows and damaged roofs. In aerial shots, a mountain slope can be seen collapsed.Matsuno said the government had set up a disaster countermeasures office in a crisis management centre headed by the prime minister in response to the earthquake, adding that residents should watch out for further quakes.",
        "Friday is a public holiday in Japan, part of a run of days off known as 'Golden Week', a time when many people travel for leisure or to visit family. Shinkansen bullet trains were suspended between Nagano and Kanazawa, a popular tourist site, according to Japan Railway. Tokyo Electric Power Company Holdings allayed fears of damage to the Kashiwazaki-Kariwa Nuclear Power Plant in Niigata Prefecture, saying it was unscathed.The US Geological Survey put the magnitude of the quake at 6.2.'There was a big, long tremor that lasted about two minutes. I felt scared because the shaking went on and on,' a local government official in the city of Suzu, who declined to give her name, told public broadcaster NHK. Earthquakes are common in Japan.The island nation sits on the Pacific 'Ring of Fire', an arc of intense seismic activity that stretches through Southeast Asia and across the Pacific basin. As a result, Japan has strict construction regulations intended to ensure buildings can withstand strong quakes and routinely holds emergency drills to prepare for a major jolt.A 6.9 magnitude quake struck a fishing village on the Noto peninsula in the same region in 2007, injuring hundreds and damaging more than 200 buildings. The Noto peninsula is a rural area on the Sea of Japan coast known for its natural scenery and seafood. ",
        "The peninsula's population is around 340,000, according to 2015 census data. More than a decade later, Japan is haunted by the memory of a massive 2011 9.0-magnitude megathrust quake struck in the Pacific Ocean off Japan's eastern coast - the fourth most powerful earthquake since record began.The Tohoku earthquake - also known as the Great East Japan Earthquake - caused a tsunami with waves as high as 130feet that travelled at 435 miles per hour, and reached as far as six miles in-land, killing almost 20,000 people.",
        "It also caused the Fukushima Daiichi nuclear disaster which saw three of the nuclear reactors suffer meltdowns and discharge radioactive water in Fukushima. It was Japan's worst post-war disaster and the world's most serious nuclear accident since Chernobyl.In March last year, a 7.4-magnitude quake off the coast of Fukushima shook large areas of eastern Japan, killing several people.The capital Tokyo was devastated by a huge earthquake in 1923."
    ]
}