{
    "articleURL": "/tvshowbiz/article-12038103/Gemma-Collins-sparks-rumours-SPLIT-beau-Rami-Hawash.html",
    "content": [
        "Gemma Collins sparked further rumours she has split from her beau Rami Hawash on Monday.",
        "The former TOWIE star, 42, and her long term partner, 48, have both unfollowed each other on social media.Gemma previously unfollowed Rami and now Rami has done the same as well removing all traces of her from his Instagram page.The pair were last seen together in March and have not posted about each other since then. Gemma recently enjoyed a family trip to Clacton-on-Sea where she stayed in a caravan park - and Rami was nowhere to be seen. ",
        "Representatives for Gemma have been contacted by MailOnline for comment.It comes after in mid March Gemma rubbished claims of a split after rumours began to circulate the month before.Speculation began after the TV star unfollowed him on Instagram, after completing a 'clear out' and reducing her following to only four accounts.Gemma now only follows 143 accounts.Gemma has known Rami for over ten years, having previously dated the businessman in 2011. But the pair then reunited during lockdown, seven years after breaking off their original engagement.Earlier in March, she reassured fans 'everything is good' in her relationship with the businessman as she shared a snap while they enjoyed a romantic dinner.As they tucked into a chicken salad starter, she wrote: 'Dinner with my love' before going on to talk about why she is keeping her relationship private.  ",
        "She wrote: 'Rami is a businessman and doesn't always to be on camera.'",
        "It comes after this bank holiday weekend Gemma swapped her lavish five star hotels for a caravan park as she enjoyed a family break in Clacton-on-Sea.The star, who often splashes out on luxury accommodation, gave fans a glimpse of her UK break on Instagram on Monday. The TV personality spent some quality time with her brother Russell and nephews Hayden and Kane during the trip. Gemma posed for a snap in front of the caravan before showing followers a glimpse inside the trailer. The reality star kept glamorous for the getaway in a crisp white shirt which she teamed with turquoise trousers and a blue Chanel bag.She flashed her stunning smile for a selfie with Hayden before the pair hit the arcade and posed with a giant minion toy they won.The TV star could be heard saying: 'I don't know how we're going to get this home'. Gemma also said she felt like she 'was in Vegas' as she played on the coin pusher machine. She wrote: 'I’m having the best time. Sensational fun I felt like I was in Vegas baby. PS …. Me and H love minions. The GC also uploaded a hilarious video to her Instagram Grid as she and Hayden played on Segways. ",
        "Gemma wore a blue helmet as she raised her arms in the air while Hayden rocked knee pads, a helmet and a yellow high viz waist coat. She gushed in the caption that she has 'really enjoyed' going back to basics at the caravan park and loves 'not feeling pressure to be glam'. Gemma penned: 'This was so much FUN. I really enjoyed caravan life back to basics fresh air bingo fish and chips and just normality.",
        "'Sometimes it’s just so nice to go back to good old basics of childhood and no pressure to be glam or being in the expensive places and the best aunty award goes too me 42 on a Segway!!!!'It comes after Gemma returned from a luxury trip in Italy last month and put on a very saucy display on Instagram.She was turning up the heat as she lay back on a boat with her bottom taking centre stage in the shot and her legs looking elongated.She revealed she was on holiday in a caption attached to the sexy snap, which came just one day after she shared a snap in the same position but this time in an elegant silk kaftan and dramatic sunglasses."
    ]
}