{
    "articleURL": "/wires/reuters/article-12038699/Recession-talk-tapers-latest-quarterly-conference-calls.html",
    "content": [
        "By Noel Randewich",
        "May 2 (Reuters) - While Wall Street frets that the Federal Reserve's aggressive interest rate hikes will tip the U.S. economy into a recession, discussions on recent quarterly conference calls hint that corporations and analysts have become a bit less concerned.Terms related to an economic downturn have been uttered less on quarterly earnings calls in the past few weeks than in the previous few reporting seasons, according to a Reuters analysis of S&amp;amp;P 500 conference call transcripts.Reports for the first quarter broadly point to shrinking profits for the U.S.' largest companies but less than analysts feared.\"There was a lot of pessimism going into the quarter, mostly because of the substantial increase in interest rates, but also because of the softening economic numbers that have come out,\" said Peter Tuz, president of Chase Investment Counsel in Charlottesville, Virginia.\"Companies have been able to handle a downturn in demand pretty well because of higher prices and costs not rising as much as they were able to push prices,\" Tuz said.With first-quarter reports over half way through, analysts on average see aggregate earnings per share for S&amp;amp;P 500 companies declining 1.4% year over year, according to Refinitiv I/B/E/S. Before companies began to report at the start of April, Wall Street had been bracing for a 5.1% drop.",
        "Discussion about economic downturns appears to have been relatively limited on recent quarterly analyst conference calls.The terms \"recession,\" \"downturn\" and \"slowdown\" were used on the calls in a variety of ways, not all of which point to bad news. For example, On Semiconductor in its quarterly call on Monday said demand for its chips for electric cars and energy infrastructure remained healthy despite \"a broad-based macroeconomic slowdown.\"Aggressive interest rate hikes from the Federal Reserve to contain decades-high inflation have fueled speculation that a recession is likely, while the recent collapse of First Republic Bank and the March failure of two other regional banks have added to concerns.The Fed is widely expected to raise interest rates by 25 basis points at the end of its two-day meeting on Wednesday, in the latest escalation of the central bank's fastest rate hike campaign since the 1980s.In another recent report, Norwegian Cruise Line Holdings Ltd sailed past estimates on Monday, with CEO Harry Sommer telling analysts he sees a \"healthy demand environment.\"\"Even with the banking-sector-driven financial-market volatility in March, we did not experience any unusual booking or cancellation activity across any of our brands,\" Sommer said.Terms related to \"recession\" have been mentioned on 41% of conference calls held in recent weeks by companies in the S&amp;amp;P 500. That rate is marginally lower than the fourth quarter but down significantly from a peak of 59% of calls held during last year's full second-quarter reporting season.",
        "With reporting season over half way through, the three recession-related terms have come up a total of 253 times on calls, or about 0.9 times per call. That compares to 535 mentions on analyst calls for the entirety of the previous quarterly reporting season, equivalent to 1.1 mentions per call.(Reporting by Noel Randewich; Editing by Alden Bentley and Mark Porter)"
    ]
}