{
    "articleURL": "/wires/reuters/article-12042009/Indonesia-cuts-tax-breaks-discourage-low-quality-nickel-investment-minister.html",
    "content": [
        "By Fransiska Nangoy and Stefanno Sulaiman",
        "JAKARTA, May 3 (Reuters) - Indonesia has cut tax incentives to limit investment in lower quality nickel products as it aims to extract as much value as possible from its rich nickel reserves and push for further downstream investment, a cabinet minister said on Wednesday.The government is aiming for around $95 billion investment this year and will continue to focus on natural resources processing industries but wants to save its nickel reserves, the world's largest, for higher valued products such as materials that go into electric vehicle batteries.Since banning nickel ore exports in 2020, Indonesia has seen a surge in investment into smelters but most output is ferronickel or nickel pig iron (NPI), used in stainless steel, that typically only contains 30% to 40% of nickel.Investment Minister Bahlil Lahadalia said the government will no longer provide tax holidays for investment into NPI.\"Downstreaming must at least reach 60% to 70% nickel content in Indonesia and not only for intermediate products,\" Bahlil said in an interview with Reuters.\"NPI investment can reach break even in four to five years, why would we give 10-year tax holidays? That is not fair,\" he added.He declined to comment on discussions Indonesia is having with companies like U.S. car maker Tesla and China's BYD Group to encourage investment.",
        "Meanwhile, the global nickel market is facing a massive oversupply this year due to surging Indonesian output. The International Nickel Study Group (INSG) is forecasting a surplus of 239,000 tonnes, the largest in at least a decade.Companies such as the Trimegah Bangun Persada (TBP) and Merdeka Battery Materials are adding capacity.Subsidiaries of TBP currently have a combined capacity of 305,000 tonnes per year ferronickel smelters and plan to add 12 more production lines. Merdeka currently has capacity of 38,000 tonnes of NPI and a third smelter with 50,000 tonnes capacity is expected to start operations in the second half of the year.Bahlil said the government will require future smelters to be powered by renewable energy sources, but details are still being ironed out.($1 = 14,680.0000 rupiah) (Reporting by Fransiska Nangoy and Stefanno Sulaiman;Editing by Elaine Hardcastle)"
    ]
}