{
    "articleURL": "/news/article-12059611/New-AI-cameras-designed-catch-motorway-litter-louts-fine-100.html",
    "content": [
        "New CCTV systems can pick out offences and send them straight to policeBut campaigners have described strategy as another 'meaningless partnership' AI cameras designed to catch and fine drivers up to £100 for littering on motorways are set to be introduced on roads in part of the South East.",
        "The new CCTV systems will be able to pick out offences and send them straight to police control rooms, allowing officers to avoid having to comb through hours of footage to prosecute a motorist.Images transmitted from the camera to the control room can be reviewed immediately and a £100 fine sent to the person whom the car's number plate is registered to.National Highways has joined East Hampshire District Council-owned EHCS Commercial Services, which operates the cameras, and will issue the fines as the highways body does not have enforcement power, The Telegraph reports.It comes after campaigners began threatening to take National Highways to court if it did not fulfil its duty to clean up the litter-strewn motorway network.",
        "In February, Clean Up Britain instructed a leading law firm to write to the quango warning it is 'in flagrant and systemic breach of its duties' for failing to clear the roads.The call to take legal action has had backing from MPs of all parties and the supermarket chain Iceland. ",
        "Roads minister Richard Holden last month said less than 40 per cent of National Highways roads are graded below B for litter - meaning there are significant levels of rubbish. National Highways and East Hampshire Council have not revealed the company behind the new cameras and have not disclosed where the new technology will be located within the area.",
        "However, a large stretch of the A3 dual carriageway runs through the district, as well as part of the A31.Elsewhere, privacy campaigners have also raised questions over Big Brother-style 'AI' speed cameras which use a 4D scanning system to watch drivers inside their cars.A new 'Redspeed Sentio' unit made by Kidderminster-based Redspeed International can also catch motorists using their mobile phone or not wearing a seatbelt.The ten-inch camera can detect whether too many people are inside a vehicle, as well as spotting those who are speeding or going through a red light.Meanwhile, solar-powered compacting bins will also be placed in laybys in Hampshire, which contain a compactor inside that crushes rubbish to an eighth of its size and prevents them from overflowing. When they are ready for emptying, they send text and email alerts to councils – reducing the number of collections they have to do and saving money in the long term.",
        "Geofences are also due to be introduced in 30 laybys, sending targeted adverts to phones warning drivers against littering.National Highways head of customer journeys Freda Rashdi said: 'Littering is a social problem across the country and we’re working hard to tackle it on our roads. 'We regularly carry out litter-picking activities across our roads and are actively exploring other initiatives to address this problem.",
        "'But if people don’t drop litter in the first place it wouldn’t need to be picked up - so we urge road users to take their litter home instead of throwing it out of their windows.'John Read, the founder of the Clean Up Britain group pushing for cleaner motorways, questioned the new strategy.He described it as another 'meaningless partnership' and, while they sounds promising, they 'always delivered no results'. "
    ]
}