{
    "articleURL": "/news/article-12054169/Royal-Navy-officer-faints-waiting-return-procession-Buckingham-Palace.html",
    "content": [
        "A Royal Navy officer fainted while waiting to take part in procession to the PalaceFollow our live blog for all the latest updates on King Charles III's Coronation Soldiers including a Royal Navy officer and a flag bearer fainted while waiting to take part in the return procession back to Buckingham Palace for King Charles's Coronation. ",
        "During the service, the return procession began to form up, with the front at the top of The Mall near Admiralty Arch.A small number of the troops waiting to take part required assistance after appearing to faint.The Royal Navy officer was quickly put on to a stretcher and given medical assistance by other soldiers. More than 4,000 ceremonial troops are taking part in the procession, escorting the King and Queen back to Buckingham Palace in the Gold State Coach.",
        "A flag bearer also fainted and was helped by a seaman from HMS Collingwood.Meanwhile, just after the King and Queen's carriage rounded the corner from Whitehall into The Mall one of the horses in the procession appeared to be spooked, rearing backwards into the barriers separating the public from the route. A female police officer appeared to be given assistance from her colleagues, limping away from the area.Earlier, Charles and Camilla's Diamond Jubilee Coach arrived at the Abbey, following a procession from Buckingham Palace, in the midst of a Sovereign's Escort provided by the Household Cavalry's Blues and Royals and Life Guards with their shining breastplates and plumed helmets and led by the Household Cavalry Mounted Regiment band.The monarch and his wife's entrance through the west door was heralded by a fanfare from four State Trumpeters of the Household Cavalry and the abbey congregation stood as one.",
        "A large ceremonial procession was lined up before the King and Queen with representatives of all elements of the nation's ceremonial and spiritual life.",
        "There were recipients of Orders of Chivalry and Gallantry, Heralds from the College of Arms in their colourful tunics, senior clergy associated with the monarchy and the glittering coronation regalia carried by leading figures.St Edward's Crown was carried by General Sir Gordon Messenger, Lord High Steward of England.With their lavish and unwieldy robes, the King and Queen walked single file along the nave of the Abbey with Camilla ahead of Charles as the hymn I Was Glad As They Said Unto Me was sung.",
        "There had been cheers and clapping from those gathered near Whitehall when, just after midday, Charles was proclaimed King. The crowd was listening to audio of the Coronation ceremony being broadcast in Trafalgar Square.Those waiting in the rain during the two-hour service joined in with a rousing rendition of God Save the King as the ceremony came to a close.After the Coronation the King and Queen left Westminster Abbey in the Gold State Coach at 1.07pm for a procession back to Buckingham Palace.",
        "The newly crowned King and Queen smiled at the thousands braving the rain to line the streets, as the royal couple were carried in the Gold State Coach back to Buckingham Palace.",
        "The Princess Royal followed behind on horseback in her role as Gold Stick and Colonel The Blues and Royals (Royal Horse Guards and 1S Dragoons).Next came the carriage with the Prince and Princess of Wales inside, along with their children Prince George, Princess Charlotte and Prince Louis.Five-year-old Louis waved eagerly from the window. Prince George, Princess Charlotte and Prince Louis were seen turning around in their carriage seats to get a better view of the procession and crowds along the route.The Waleses' carriage was followed by Edward, the Duke of Edinburgh, and his family."
    ]
}