{
    "articleURL": "/tvshowbiz/article-12044381/The-tragic-curse-reality-Bride-Prejudice-three-stars-die.html",
    "content": [
        "Channel Seven's popular reality series Bride and Prejudice has been struck by a series of tragedies since going off the air in 2019.",
        "Suicide and a drug overdose have taken the lives of three participants from the show, which pulled in almost one million viewers an episode at its peak.Bride and Prejudice followed star-crossed couples as they attempted to get married while battling disapproving family members.There was talk of a fourth tragedy when reports surfaced that season three star Dannii Erskine was killed in a fatal car accident at the age of 28.However, it later emerged she wasn't actually dead, and her 'death announcement' was the result of her Instagram account being hacked.",
        "The first cast member from the show to tragically die was Micah Downey, who lost his battle to drugs in late 2019 at just 26.The young man's drug counsellor, Jodi Barber, revealed the cause of death was from a 'mixture of illegal and prescription drugs'.Micah is thought to have been prescribed 'two different benzodiazepines' to treat a heroin addiction, which Ms Barber did not believe was the right course of action.'There has to be a better way to cope with anxiety and depression for those addicted to heroin,' she said. 'Micah will never be forgotten and deeply missed. Prayers for his family.'Micah's ex-fiancée, Milly Johnson, who also starred on Bride and Prejudice, was pregnant with his child at the time of his death.",
        "Milly and Micah already shared a two-year-old son named Julian at the time of his death.The couple had cut ties after filming Bride and Prejudice and Micah had moved back to California, where his family lived.'The team at Bride and Prejudice is devastated by the news of the loss of Micah Downey,' a Channel Seven rep said at the time.'Our thoughts and deepest sympathies are with his family and friends at this incredibly difficult time.'",
        "Tragedy struck again in 2021 when James Ciseau, who appeared on season three in 2019, died after a horror car accident in Queensland.The tradie, who appeared on the reality show alongside his wife Tori, lost his life in a tragic head-on crash at Beerwah.James, who was 36 at the time, was involved in an accident at the intersection of Roys Road and Dianella Road. ",
        "A Queensland Police Service spokeswoman said the cause of the 'head-on' crash which shut down the intersection for several hours was under investigation. 'James was loved by anyone he met, he'd walk into a room and would make it brighter, like a ray of sunshine,' his sister Lauren Ciseau told The Courier Mail.  'He had so much energy and constantly wanted to be around people. His favourite word to describe himself was jovial.' ",
        "James left behind two daughters, Olivia-Rose, six, and Bella-Pearl, three.'He was the most amazing father to those girls, they would look up to him so much,' his youngest sister Jacinta said.It's understood that James had been working as a pool builder and lived with his mother Deborah and stepfather Barry at the time of his death.In a further heartbreaking turn of events, James' widow Tori reportedly took her own life in January of this year. According to So Dramatic, the news was confirmed by members of the Ciseau family. The couple is survived by their daughters.Tori shared a touching post about motherhood before her death, writing: 'So proud of my babies and how far they have come. 'There are definitely hard days being a solo mum but all I have to do is look at things like this and remember that no matter what, us three girls have so much to be grateful for. The love and laughter we share together is unbreakable.'",
        "In an earlier post, Tori admitted she was struggling in the aftermath of James' death and the notoriety that came from being in the public eye.'For anyone out there that does want some advice - watch out,' she wrote. 'Social media is the devil.",
        "'You’re made to feel like you have to give things of your life when you don’t. I don’t need to give you anything about myself or my kids because I’m done, okay?'I do thank you for following me, that's great, but other than that, this is literally just the end and I can’t deal with it anymore.'She then said she wanted to be 'left alone' and had no interest in sharing her personal life with her fans and followers.",
        "'As I said, I want to live a quiet life and make sure my girls are raised really well and they’re happy and they’re happy. That’s all I can wish for them. 'I just want to be able to go to the shops and not be recognised anymore. Just let them have a normal life. I just want them to have a normal life and I don’t think that’s really hard to ask.'Bride and Prejudice premiered in 2017 on Channel Seven and pulled in almost one million viewers on its first episode.It continued for two more seasons until 2019, when it was quietly cancelled following Micah's shock death.The series also aired in the UK, where it gained a loyal following.Since the series of tragic deaths, Seven has removed Bride and Prejudice from its streaming platforms leaving it unavailable to watch.  "
    ]
}