{
    "articleURL": "/femail/article-12056113/What-Harry-said-Abbey-Lip-reader-reveals-Duke-shared-heartfelt-moment-Princess-Eugenie.html",
    "content": [
        "Prince Harry spoke to Princess Eugenie's husband Jack Brooksbank at the AbbeyThe Duke of Sussex was back on the plane to California after the CoronationPrince Harry shared a 'happy exchange' with his cousin Princess Eugenie and her husband Jack Brooksbank in Westminster Abbey yesterday, a lip reader has revealed.",
        "Jacqui Press, who was watching the Coronation proceedings, told FEMAIL the Duke of Sussex, 38, was astonished by his glowing cousin, who is due to give birth to her second child this summer. Jacqui said the conversation between the cousins, who share a close relationship,  appeared light-hearted as they waited for the historic occasion to begin and Harry caught up with his beloved relatives in a 28-hour stopover before heading back to California to celebrate Prince Archie's fourth birthday. As he walked into the Abbey, Harry said to Jack and Eugenie: ‘Wow, amazing look at the bump!', using his hands to indicate to a heavily-pregnant Eugenie’s tummy.'I know‘, her husband Jack replied, smiling as he walked towards his seat.",
        "Mother-of-one Eugenie, 33, who was dressed in a deep blue smock dress - topped with a matching overcoat and headpiece, is expecting her second child in the next few months. Like the other non-working royals, Harry dressed in a morning suit with medals and the KCVO - Knight Commander of the Royal Victorian Order - given to him by Queen Elizabeth around his neck.Jacqui noted on his way in, the 38-year-old, who was alone at the service without Meghan or their two children Archie and Lilibet, addressed the well-wishers and congregation, saying: 'Morning, morning, how are you doing?'",
        "One person in the crowd told him, 'You look smart', Press said - referring to the moment the suited prince walked into the Abbey for his father's Coronation.Upon arriving at the Abbey, the Duke of Sussex also chatted with Edoardo Mapelli Mozzi, Princess Beatrice's husband.The prince was seated between the always friendly Jack Brooksbank and elderly Princess Alexandra, a first cousin of Queen Elizabeth, who has not worked as a royal for ten years.In front of him was Princess Anne, her husband Vice Admiral Sir Timothy Laurence and the Duke of Kent.Before the ceremony, the royal remarked to Mr Brooksbank that he was on a flight that day at ‘about quarter to four’.",
        "‘So soon?’ was the reply, another indication that lines of communication with even friendly family members are few and far between. Mr Brooksbank also said: 'Oh really, when?' to which the Duke responded: 'I think tomorrow...'Other than pulling the odd comedic grimace, Harry otherwise kept to himself.He did, however, clearly pay homage to his father during the service speaking the words: ‘God save King Charles, Long Live King Charles. May the King live forever.'Harry is now back in California after spending just 28 hours and 42 minutes in the United Kingdom to witness his father, King Charles' coronation on Saturday.",
        "Following the ceremony, he slipped out of Westminster Abbey - accompanied by a Metropolitan police escort and four outriders - with only the briefest of goodbyes and headed straight for Heathrow Airport.The Duke of Sussex was pictured smiling broadly as he arrived at the airport’s Windsor suite before his British Airways flight still in a morning suit and sporting his medals.He was back on the plane to California before his father and stepmother, the newly crowned queen, had even finished having their official portraits taken.Harry's British Airways flight from Heathrow direct to Los Angeles landed just before 6.30pm local time.The idea was that he would be back in time for his four-year-old son Archie's fourth birthday party, which was 'low-key', according to sources close to the Sussexes."
    ]
}