{
    "articleURL": "/news/article-12042177/Queen-Camilla-supported-just-35-cent-Australians-just-days-Kings-coronation.html",
    "content": [
        "Princess Camilla received 35 per cent approval in AustraliaRoyals, Harry and Meghan both poll higher than Camilla With just days to go before The Coronation of King Charles, new polls have revealed that only a third of Australians approve of Queen Camilla.",
        "Polling from YouGov has revealed that Australian approval for Camilla is sitting at about 35 per cent while the King has an approval rating of just over half.Even Harry and Meghan, whose approval ratings are lower than 10 per cent in the UK, poll higher than Camilla Down Under. The royals who remain the most popular Down Under are Prince William and Princess Catherine, with Princess Anne not far behind.",
        "The poll also revealed about 57 per cent of Australians are at least slightly interested in Saturday night's Coronation.The majority of those interested in the Coronation and the fanfare are millennial women aged 27 to 42 and women aged over 77.'This research actually refutes the perception of some that Australians aren't interested,' YouGov's polling boss Campbell White told The Australian.'Actually – while it's not setting the place on fire – a majority of us do have at least some interest, and it's not limited to older Australians.'While having boosted his popularity by nine per cent since 2021, King Charles has not seen a significant boost in approval from Australians.The King reportedly asked 'But will I be welcome?' when discussing the possibility of making a trip Down Under with Australian diplomats.",
        "Prime Minister Anthony Albanese met with King Charles on Wednesday to invite him and the Royal Family to the nation. ",
        "King Charles, who replaced his mother Queen Elizabeth as Australia's head of state when she died last September aged 96, has long and deep connections to Australia.As a teenager he spent two terms at the Timbertop school in Victoria and while Prince of Wales visited Australia on 16 occasions, with the last trip being in 2018.While being a 'die hard republican', Mr Albanese has said he will swear the oath of allegiance to the King during his coronation on Saturday night."
    ]
}