{
    "articleURL": "/wires/reuters/article-12046535/Nightmare-Sudan-African-expats-struggle-way-out.html",
    "content": [
        "African, other foreigners struggle to leave Khartoum",
        "Thousands flee in buses, trucks but face obstacles at bordersSome sleep in the open before crossing into EgyptEgypt says it's trying to speed up entry proceduresBy MacDonald DzirutweLAGOS, May 4 (Reuters) - Nigerian law student Umar Yusuf Yaru was relaxing in his apartment when he first heard gunfire last month in his Khartoum neighbourhood.For the next nine days, Yaru hunkered down alone as the Sudanese armed forces clashed with the paramilitary Rapid Support Forces (RSF), hoping the fighting would end.With his internet down and food running low, he switched on his mobile phone data on April 24 and spotted a lifeline on Telegram: Nigeria would be evacuating its nationals at dawn the following day from his International University of Africa campus in the war-torn capital.He quickly packed two bags and headed to the nearest bus stop. But no transport arrived.\"Suddenly the RSF appeared from nowhere with their guns. They pointed a gun at me, maybe to scare me, and asked where I was going at this time of the night with bags,\" said Yaru.It was the start of a long and terrifying journey to safety.While wealthy countries like the United States and Britain sent planes to evacuate their nationals from an airfield near Khartoum, many Africans and other foreigners from less resourced countries struggled to find a way out.",
        "Thousands piled into buses and trucks for the 800 km (500 miles) journey by road from Khartoum to Port Sudan on the Red Sea to board ships. Others headed 1,000 km (620 miles) north to Egypt's frontier, only to get stuck in days-long queues to be allowed to cross.But as numbers surged and fuel became scarce, prices for transport spiked to hundreds of dollars, out of reach for many, including students like Yaru.GUNSHOTS EVERYWHEREWhen confronted by the fighters, Yaru, 24, was too frightened to respond.\"I thought it was going to be my end,\" he told Reuters.But the fighters just laughed and left him at the bus stop.Yaru begged a ride from a man on a motorcycle who dropped him off at the university, where he said more than 1,000 Nigerian, Burkinabe, Chadian and other foreign students had gathered.But no buses appeared the next day. Without food, water, money or electricity, many grew frustrated.\"Even as we sit here, almost everywhere you can hear gunshots. We are not safe,\" Yaru told Reuters via Zoom last week, as crying was heard in the background.Nigeria's government said it tried to hire 250 buses to evacuate some 5,500 of its citizens, most of them students. But it could only locate 40 - at a cost of $1.2 million.",
        "The first 10 buses showed up at the university on April 26, but there was no room for Yaru. He had to wait four more days for transport to Port Sudan, an overnight trip. One bus caught fire on the way, but no one was hurt, he said.Another Nigerian student, Kabir Adam, 24, managed to get a spot in a convoy leaving from Elrazi University in Khartoum to Arqeen, one of two main crossings along the Egypt-Sudan border. But he said Egyptian authorities turned them back, saying the buses were not cleared to cross.They slept on the bus that night, then headed to the city of Wadi Halfa.When they arrived, their driver said he did not have permission to take them to the border crossing and left them by the roadside. Adam said he and others, including several pregnant women, slept in the open for four nights before they were allowed into Egypt on Tuesday.Nigeria's National Emergency Management Agency said Egypt was only allowing its nationals to enter if they had places on a flight out. A Nigerian air force plane and a charter flight evacuated the first 354 Nigerians from the Egyptian city of Aswan on Wednesday.Egypt's Foreign Ministry did not immediately respond to a request for comment. It has said authorities were providing relief and emergency services at the crossings and trying to speed up entry procedures by reinforcing border staff.",
        "'IT WAS TERRIBLE'Even people with more means battled to get out. Pride Mubaiwa, a 34-year-old Zimbabwean business consultant, said he huddled in his living room with his wife and two-year-old son as bullets hit their building.Without internet or electricity to power their phones, they struggled to communicate with their embassy or family. The little food and water they had was saved for their son, he said.After a week, word reached them that there would be transport leaving from their embassy for Port Sudan.Mubaiwa's car refused to start, and there were no taxis, so they walked the four kilometres (2.5 miles) to the embassy, he said. RSF fighters stopped the family along the way but let them pass when he said he was looking for food for his son.From Port Sudan, they travelled via cargo ship to Saudi Arabia.\"It was terrible ... We were sleeping on the floor. It was very cold. I even had to tie my t-shirts to my feet for warmth,\" he said after landing on Sunday at Harare's airport, where relatives wept and rejoiced. (Additional reporting by Maggie Michael in Arqeen, Egypt, and Nyasha Chingono in Harare; Editing by Alexandra Zavis, William Maclean)"
    ]
}