{
    "articleURL": "/wires/aap/article-12054203/Petroleum-tax-changes-Aussies-fairer-return.html",
    "content": [
        "The offshore LNG sector will be forced to pay more tax, and sooner, under changes the federal government says will give Australians a fairer return from the country's natural resources.",
        "Treasurer Jim Chalmers on Saturday evening announced amendments to the contentious petroleum resource rent tax, which the government said was expected to increase tax receipts by $2.4 billion over the forward estimates.The overhaul would make a \"meaningful contribution\" to Tuesday' night's budget, helping to get the nation's finances back on track, fund services and provide cost-of-living relief, Dr Chalmers said.\"These sensible changes see the offshore LNG industry pay more tax, sooner,\" he said in a statement.\"They also deliver a fairer return to the Australian people from the resources they own, provide certainty to industry and ensure Australia remains a reliable trade and investment partner.\"Oil and gas companies have continued to benefit from the petroleum resource rent tax by an estimated $165 million per year, according to the Australia Institute.The changes will place a cap on deductions from July 1, ensuring a fairer return from offshore LNG projects, the federal government said in a statement.The proportion of petroleum resource rent tax-assessable income that can be offset by deductions will be limited to 90 per cent.The cap will also bring forward tax revenue from LNG projects, most of which are not expected to pay significant amounts of petroleum resource rent tax until the 2030s under current rules.",
        "The changes will give industry and investors policy certainty to keep domestic gas supplies at sufficient levels, and will ensure Australia remains a \"reliable international energy supplier and investment partner\", the federal government said.The reforms also address integrity issues, and will adopt eight of 11 recommendations from the Treasury Gas Transfer Pricing Review.The review was initiated by the former coalition government and, after stalling during the pandemic, restarted by Labor last year.The government will also take on eight recommendations in the earlier Callaghan Review, which the previous government accepted but did not implement.It intends to consult on the deductions cap's final design and implementation later this year.Consultation on anti-avoidance rules and other changes arising from the Callaghan Review is slated to go ahead early next year.Dr Chalmers has in the past flagged reforms to the petroleum resource rent tax in the lead-up to Tuesday's budget, telling reporters last month he was concerned the system was not up to scratch.Oil and gas giants have previously warned the government against reaching for a band-aid solution to its budget woes by lifting or altering the petroleum resource rent tax.Australian Petroleum Production and Exploration Association chief executive Samantha McCulloch last month said compounding regulatory interventions, including the possibility of lifting or altering the petroleum resource rent tax, risked future investment, energy security and future revenue."
    ]
}