{
    "articleURL": "/wires/aap/article-12060425/Renters-public-assets-Minns-parliament-agenda.html",
    "content": [
        "Renegade Nationals MP Ben Franklin has been elected president of the NSW upper house, defying his party and handing Chris Minns his first parliamentary win as premier.",
        "The election of Mr Franklin, whose touted nomination led to the downfall of Nationals leader Paul Toole, gives Labor an easier path to passing legislation, with the government and the coalition deadlocked 15 votes apiece in the 42-seat chamber.Mr Franklin was elected unopposed after the coalition strung out proceedings by nominating every Labor upper house MP, including Treasurer Daniel Mookhey.\"It is a deeply significant role and I know there has been commentary about it,\" Mr Franklin said after taking the chair on Tuesday.\"But there is nothing more important than having an independent and impartial umpire of a chamber to ensure its dignity is upheld and the debate can ensue that is fair to all sides.\"As president, Mr Franklin, who is godfather to one of the premier's sons and has friends across the parliament, can only vote to break deadlocks in the 42-seat chamber.Minutes after his appointment, the independent MP for Lake Macquarie Greg Piper was elected unopposed as lower house speaker.He was led to the chair by fellow independents Joe McGirr and Alex Greenwich.The two elections allows the Minns' government to set about providing relief for stretched NSW renters and protect public assets in its first parliamentary moves since being swept to power in March.",
        "The premier says he will fight for every vote to pursue his agenda despite entering parliament without a majority in either house.\"I've always acknowledged that we would have to deal with the parliament that the people of NSW have returned,\" he told reporters on Monday.\"A lot of the reforms we want to pursue ... require getting through both houses of parliament and we're going to fight for those votes.\"The party will introduce a bill to reform the state's rental sector including the establishment of a rental commissioner, a statewide portable bond scheme and banning secret rental bidding.Rent in all capital cities is up 11.7 per cent but in Sydney it has spiked by 13.1 per cent in the past 12 months according to CoreLogic data released last week.The average price paid by a Sydney renter for their home is $711 a week."
    ]
}