{
    "articleURL": "/news/article-12059501/Nepal-avalanche-Three-Himalayan-Viagra-pickers-feared-dead.html",
    "content": [
        "Three people are missing and another 12 are injured following Nepal avalancheHimalayan pickers were searching for the parasitic fungus Cordyceps sinensisThe fungus, which grows on caterpillars, is said to boost sexual performance Three 'Himalayan Viagra' pickers are feared dead and another 12 were injured after being hit by an avalanche in Nepal.",
        "Every year, thousands of villagers in Nepal and Tibet harvest the parasitic fungus Cordyceps sinensis, known locally as yarchagumba, which is said to boost sexual performance.The fungus, which grows on the body of a caterpillar, can fetch huge sums in neighbouring China, where it is used in herbal medicines, and is only found at certain elevations for a few weeks each year. The group of 15 pickers were in search of yarchagumba in the highlands of the Mugu district when they were hit by an avalanche on Saturday. Rescuers were hiking to the remote site after a helicopter was unable to land because of snowy weather, district official Mohan Bahadur Thapa told AFP on Monday. ",
        "Cordyceps sinensis, known to locals as yarchagumba, is a fungus that lives on certain caterpillars.It can help fight cancer cells and shrink tumour size - particularly lung or skin cancers.People most commonly use it for athletic performance, kidney and liver problems and sexual problems. ",
        "Yarchagumba, which means 'summer plant, winter insect' in Tibetan, is only found at altitudes above 11,500 feet (3,500 metres) and forms when the parasitic fungus lodges itself in a caterpillar, slowly killing it. No definitive research has been published on the beneficial qualities of the fungus, but Chinese herbalists believe that, like Viagra, it can aid sexual performance. ",
        "Boiled in water to make tea, or added to soups and stews, it is believed to treat a variety of ailments from fatigue to cancer. Over-harvesting slashed populations by at least 30 per cent over 15 years by 2020, according to the International Union for the Conservation of Nature, which listed it as 'vulnerable' to extinction in its directory of threatened animal and plant species. Officials are still searching for two more missing yarchagumba collectors in the western Darchula district, after recovering three bodies from the avalanche-hit area last week. ",
        "Spring is the beginning of Nepal's climbing season when nearly a thousand mountaineers will try to summit Everest. Last week, a US climber who was on an acclimatisation rotation at around 6,400 meters died on Mount Everest.A guide said the man, who has not been named, had been taken unwell and died at Camp 2, around 2,400-meters below the 8,849-meter summit. It came after three Nepali guides died on Everest last month after a chunk of falling glacial ice swept them into a deep crevasse on the avalanche-prone mountain. "
    ]
}