{
    "articleURL": "/wires/reuters/article-12041771/Apple-results-mark-weak-finish-Big-Tech-earnings.html",
    "content": [
        "By Yuvraj Malik and Aditya Soni",
        "May 3 (Reuters) - Apple Inc will likely report a more than 4% drop in revenue, its second straight quarterly decline, weighed down by consumers shunning non-essential purchases such as iPhones and Mac computers and slowing growth at its services business.The results on Thursday from the world's most valuable company will follow better-than-expected earnings from U.S. technology peers, which had raised hopes that the worst may be over for a sector that has laid off tens of thousands this year.Apple, an industry outlier with no mass layoffs so far, is set to post its first ever revenue declines across product lines, even as iPhone demand and production recovered in China after pandemic-driven disruptions last year.\"Apple is seeing moderate headwinds in its hardware businesses as iPhones face modest contraction in premium device demand and the iPad and Mac businesses could be weighed down by consumer and enterprise trends,\" analysts at Cowen and Co said.Hardware sales are set to decline over 7% to $71.93 billion in the second quarter, according to 23 analysts polled by Visible Alpha.Mac sales, which account for nearly a tenth of Apple's revenue, likely fell by a quarter, while revenue from flagship iPhone is estimated to have declined by over 3%.Global PC shipments slumped by nearly a third between January and March, according to data from research firm IDC, led by an over 40% drop in those sold by Apple. The global smartphone market, meanwhile, shrank 13% for a fifth straight quarter of decline.",
        "CHINA CHEERApple investors, however, would be encouraged by a recovery in China, the company's third-largest market.\"The reopening of China, both from the supply chain and the consumer demand standpoint, works in Apple's favor,\" said Tom Forte of D.A. Davidson, who expects iPhone sales there to rise.A near 1% pullback in the dollar during the quarter is also a bright spot in what is typically a weak period following the holiday shopping season, analysts said.Revenue in its services business, a key growth engine for Apple and home to its App Store and video streaming service, likely rose about 6%, according to Visible Alpha. That would mark its second lowest growth rate since at least the first quarter of fiscal 2017.\"For Apple, it is much more about a user growth story than a unit growth story,\" said KeyBanc Capital Markets analyst Brandon Nispel, who believes efforts to grow market share in developing economies such as India and Brazil will be crucial.He expects Apple to have added 30 million users to its active installed user base - the number of active Apple devices in the world. That figure stood at 2 billion as of end December.The company is ramping up its manufacturing and store presence in India as it looks to diversify its supply chain and gain consumers. The market could contribute $20 billion to annual revenue by 2025, brokerage Wedbush estimates.",
        "(Reporting by Yuvraj Malik and Aditya Soni in Bengaluru; Editing by Sriraj Kalluvila)"
    ]
}