{
    "articleURL": "/wires/reuters/article-12040579/Delhis-Ishant-rolls-years-Gujarat-upset.html",
    "content": [
        "NEW DELHI, May 3 (Reuters) - Delhi Capitals' veteran Ishant Sharma showed he still has some tricks up his sleeve with a masterly display of seam bowling in their shock win against Indian Premier League (IPL) champions Gujarat Titans on Tuesday.",
        "Bottom-placed Delhi looked to be hurtling towards a seventh defeat of the season after posting 130-8 against table-toppers Gujarat at Ahmedabad's Narendra Modi Stadium.And even that modest total looked unlikely at one stage after Mohammed Shami (4-11) reduced Delhi to 23-5 in five overs.In reply, Gujarat captain Hardik Pandya made an unbeaten 59 off 53 balls but Delhi's lion-hearted bowlers restricted the champions to 125-6 to secure a shock five-run victory.Ishant, who played the last of his 105 tests in late 2021, struck in the powerplay by dismissing an in-form Vijay Shankar with a cleverly-disguised knuckle ball.\"Okay, Ishant just bowled the best knuckle ball wicket I've ever seen,\" tweeted former South Africa fast bowler Dale Steyn.Ishant was equally impressive in the death overs.With Gujarat needing 33 from 12 balls, Rahul Tewatia smashed Anrich Nortje for three consecutive sixes to reduce the target to 12 from six deliveries.But Ishant bowled a nerveless final over, dismissing Tewatia and conceding only six runs to secure Delhi's third win in nine matches.\"With Ishant forever getting younger and coming out and delivering, it's amazing to see him,\" Delhi captain David Warner said at the presentation ceremony.\"Ishant was so clear with what he wanted to execute and he was able to do that.\"",
        "His clever use of wide yorkers made it difficult to hit boundaries in the final over.\"I was practising bowling wide yorkers in the nets with the new ball. I think the hard work paid off today,\" said the bowler, who returned 2-23 in his fourth match this season.Delhi, who remain at the bottom of the points table, host Royal Challengers Bangalore in their next match on Saturday. (Reporting by Amlan Chakraborty in New Delhi; editing by Peter Rutherford)"
    ]
}