{
    "articleURL": "/wires/aap/article-12060281/Superb-Matthews-takes-Giro-stage-Groves-podium.html",
    "content": [
        "Michael Matthews and his Australian Jayco AlUla team have executed the 'perfect' ride to claim the third stage of the Giro d\"Italia.",
        "The Canberran ended a long drought by timing his sprint finish immaculately to hold off Denmark's Mads Pedersen (Trek-Segafredo).Queenslander Kaden Groves (Alpecin-Deceuninck) came third in a gutsy response to being blamed by race leader Remco Evenepoel (Soudal-Quick Step) for the crash that marred stage two.Evenepoel slightly extended his lead through winning one of the intermediate sprints. He is now 32 seconds ahead of Joao Almeida (UAE Team Emirates), who moved into second despite a crash. Primoz Roglic (Jumbo-Visma) is third, 44 seconds adrift.Monday's victory was Matthews' 40th as a professional and his third in Italy's grand tour following successes in 2014 and 2015, but his first since a stage win in the Tour de France last July.The 213km stage, from Vasto to the medieval hilltop town of Melfi, was initially flat but then rose steadily before a sharp two-peak climb followed by an undulating finish. Add heavy rain and it was a demanding ride.That suited Matthews, who may not be the quickest sprinter but has better climbing legs than most of them. His team set out to ensure when the sprint arrived his strength would count.\"It was such a team win,\" said Australian cycling great Robbie McEwan on Eurosport. \"He rounded it off but the team all day long set the pace at the front of the peleton, they had the pressure on the climb, they dropped Pedersen - and though he got back they did enough damage to his legs.\"",
        "Matthews, who has suffered COVID-19 and a crash at the Tour of Flanders this year, said: \"After all I've been through these months, this is like a liberation. It is a success for the whole team. We were perfect\".\"It has been such a rollercoaster this year, to be on stage three with a win [already] is more than I could ever dream of.\"I came here to have fun, to enjoy riding my bike, being with my team. That was for the boys. They were fully committed for me.\"Compatriot and team-mate Callum Scotson said: \"We came in with a plan, everyone was committed, great to see it pay off.\"When it is hard [Matthews] can really pull something out.\"Groves could have finished second but was boxed in by his own teammates Stefano Oldani after Matthews made his move 200m out. Nevertheless it was a brave performance given the controversy swirling around him overnight.Groves had been accused by Evenepoel, Ballerini's teammate, of causing the crash adding, \"It wasn't a nice manoeuvre.\"\"Remco is correct,\" said Groves prior to Monday's stage. \"I did indeed push Ballerini with my elbow. I felt like he was closing me into the barrier on the left. It was a defensive move - I pushed back, he then proceeded to touch of the wheel of Josef Cerny losing balance and with the chain reaction of events there was a crash from behind.\"",
        "Asked how he was dealing with being called out by the world champion Groves added:\"It is a shame but this happens in sport. Everyone will believe what they want to believe at the end of the day. The footage is also unclear, blurry pictures from above. I just hope everyone is OK.\"No action was taken by the stewards who deemed it a racing incident.Tuesday's stage four could also suit Matthews. The 175km ride from Venosa to Lago Laceno features two steady ascents before culminating in a steep climb and flat finish."
    ]
}