{
    "articleURL": "/debate/article-12043009/HENRY-DEEDES-final-PMQs-local-elections-dogfight.html",
    "content": [
        "Whenever local elections occur, there are several things you can pretty much guarantee.",
        "Firstly, voter turnout will be appalling. Polling stations across the country will be about as busy as the away end at Scarborough FC.Secondly, the government of the day can be sure of a disastrous evening.Thirdly, after every vote has been counted and the results are all in, no one – bar a smattering of excitable broadcasters and pointy-headed political anoraks – will pay that much attention.Oh, and on top of all that, there is one thing on which you are always safe to stake the family dog. In betting terms, it’s the NAP, your banker, the nailed-on dead cert: PMQs the night before the vote will be a complete and utter non-event.Sure enough, today’s was no different. A classic of the genre, so soul-sappingly dull did it turn out to be.",
        "As ever, MPs lined up to ask the usual planted questions, designed to pour either treacle on their local council, or a giant pitcher of manure – depending on which party was in charge at the town hall.Sample query: ‘Would the Prime Minister agree that the council of Foffington-under-Lyme is the ghastliest/most glorious in recent living memory and voters are advised to kick them into kingdom come/return them forthwith at the voting booths tomorrow?’",
        "Weirdly, some MPs find it all hilarious.",
        "Prior to this, Rishi Sunak and Sir Keir Starmer had behaved with about as much enthusiasm as two washed-up boxers longing for the final bell. Their entire alloted time was spent nervously circling around each other. How one yearned for someone to yell out: ‘For gawd’s sake, just wallop ‘im!’ like those pneumatic lovelies you see ringside in Vegas.Instead, the atmosphere around the Commons was more like that of a beery skittle alley. Didn’t help that quite a few MPs were missing, no doubt helping out with some last-minute campaigning in the constituency. Or more likely out in the garden enjoying a pitcher of Pimm’s. I wouldn’t have blamed them.Once again, Starmer focused on the economy. He made jibes about the PM’s wealth and his missus’s tax status. Yes, yes, we heard it all last week. New balls please, Sir Keir.Worryingly for Labour, though, he doesn’t seem to have much in his locker at the moment. There was a lame gag about the now infamous ‘I’m afraid there is no money’ note Labour’s former Chief Secretary to the Treasury Liam Byrne left on his desk when Gordon Brown’s administration was swept from power in 2010, which left most MPs scratching their heads.For his final question he tried to block Sunak from ending on a flourish by issuing a tribute to the late Queen, presumably also to show what a great patriot he was. ‘Cross the floor!’ came the Tory heckle.",
        "These may be desperate times for the SNP but even they managed to enjoy themselves at Starmer’s expense. Stephen Flynn (SNP, Aberdeen South) poked fun at Sir Keir’s recent U-turn over university tuition fees, which he gloatingly described as his ‘Nick Clegg moment’.For the first time in recent memory, a Scot Nat had the Tories cheering. ‘More!’ they yelled. Starmer suddenly looked like a young lad who’d been forced to sit through the blubbery bit in that 1950s tear-jerker Old Yeller.It was then that all the local nonsense began. Jason McCartney (Con, Colne Valley) said something rude about the bin collections run by the Labour-run council in Kirklees. Chris Loder (Con, W Dorset) bragged about crime in his neck of the woods being on the wane. Zzzzz. ‘Get on wir’ it!’ screamed Kevin Brennan (Lab, Cardiff W).At one point Karl McCartney (Con, Lincoln) launched into a lengthy tirade about the cancellation of a Christmas market in his constituency. It’s a Labour council there, naturellement.As he ranted on, one of the government whips, Rebecca Harris, who was perched alongside the Speaker’s chair, abruptly stood up, knocking a full-to-the-brim glass of water into Sir Lindsay Hoyle’s lap in the process. Far better for us all had the contents ended up on Mr McCartney’s head."
    ]
}