{
    "articleURL": "/wires/reuters/article-12043969/Albemarle-cuts-annual-profit-forecast-softening-lithium-prices.html",
    "content": [
        "By Ernest Scheyder",
        "May 3 (Reuters) - Lithium producer Albemarle Corp cut its annual profit forecast on Wednesday despite posting a better-than-expected quarterly earnings, citing softening prices for the metal used to make electric vehicle batteries.Shares of the Charlotte, North Carolina-based company fell 4.5% to $165.19 in after-hours trading.Concern has grown across the lithium industry this year that weakening spot prices in China could spread elsewhere.While some producers, most notably Livent Corp, have been able to weather the weak prices due in part to their reliance on long-term contracts, Albemarle said it was being affected and had to trim its expectations for the rest of the year.\"We see strong sales volume growth for the rest of the year but have modified our guidance to reflect softening lithium market pricing,\" Albemarle CEO Kent Masters said in a statement.The company plans to hold a conference call with investors to discuss the forecast on Thursday morning.Albemarle posted first-quarter net income of $1.24 billion, or $10.51 per share, compared to $253.4 million, or $2.15 per share, in the year-ago period.Excluding one-time items, Albemarle earned $10.32. By that measure, analysts expected earnings of $7.03 per share, according to IBES data from Refinitiv.For the year, Albemarle cut its sales forecast to a range of $9.8 billion to $11.5 billion, from a prior forecast of $11.3 billion to $12.9 billion.",
        "The adjusted earnings forecast was trimmed to a range of $3.3 billion to $4 billion, from a prior $4.2 billion to $5.1 billion.Australian lithium developer Liontown Resources Ltd rejected Albemarle's $3.7 billion takeover bid in March, and the U.S. company has yet to announce a revised offer.Meanwhile, Chile's government said last month it would gradually nationalize its vast lithium industry and move to renegotiate contracts for Albemarle's access to the country's Atacama salt flats when they expire in 2043.Australian officials said earlier on Wednesday that Albemarle had agreed to spend $1 billion to expand lithium processing facilities in Western Australia. (Reporting by Ernest Scheyder; Editing by Chris Reese and Jamie Freed)"
    ]
}