{
    "articleURL": "/femail/article-12038961/Nectar-Sleep-flash-sale-40-memory-foam-mattress-loved-thousands-shoppers.html",
    "content": [
        "SHOPPING – Contains affiliated content. Products featured in this Mail Best article are selected by our shopping writers. If you make a purchase using links on this page, DailyMail.com will earn an affiliate commission. Click here for more information.",
        "If you're making a big purchase like a mattress, it pays to wait and shop when a sale's on.But the wait is now over as Nectar Sleep has a huge sitewide flash sale with 40 per cent off their luxury memory foam mattresses. Shop before the end of the day on May 8 to save almost half on what shoppers say is 'America's most comfortable mattress'.  Nectar Sleep Memory Foam Mattress, Queen  This premium memory foam mattress cradles your body and keeps you cool. Two inches of gel-infused memory foam aligns your spine and relieves pressure from joints. Another three-inches of memory foam protects against bounce and motion transfer.And if you're not sure, it comes with a 365-night sleep trial during which time you can return it for a full refund if it doesn't improve your sleep $629 (was $1049)  ShopMade from premium memory foam, Nectar Sleep mattresses have been scientifically engineered to support your body and take the pressure of joints and muscles so you can fully rest and enjoy a relaxing night’s sleep. In the flash sale, prices for a full mattress will cost $359.40 and a king a very reasonable $809. This is less than half the price of a mattresses from Casper or Purple that has a similar standard of design.Shoppers say laying on a Nectar Sleep mattress is like 'floating on a cloud' thanks to its unique five layers of sleep-inducing materials. ",
        "Hot sleepers, or anyone who shares a bed with someone that is sensitive to temperatures, will appreciate that the top layer is a breathable cooling cover.But the second layer is where the magic happens as it consists of a massive two inches of pressure relieving gel-infused memory foam to contour to all of your curves. Gel also sleeps cooler than traditional memory foam.Put up with a partner that tosses and turns in the night? You won't feel it on the Nectar Sleep mattress as it contains three inches of transition layer to minimize motion transfer.",
        "More than 5.5 million American sleepers have switched to Nectar Sleep and nine out of 10 said their Nectar mattress helped reduce overall aches, stiffness, soreness, and/or discomfort. Another nine out of 10 back pain sufferers said their Nectar mattress helped some or a lot.‘I can’t believe I waited so long to replace my old mattress,’ wrote one reviewer who rated the Nectar mattress a full five stars. ‘I was waking up with back pain for months. I had a Tempur-Pedic and wasn’t sure if I wanted to give it up. But from day one of having the Nectar bed, I didn’t wake up with back pain. I love this bed and it was the best decision I’ve made in a long time.’ ",
        "Another added: 'Ever since the purchase of my Nectar, I'm sleeping better and not waking up in pain. It supports you in all the right places. I couldn't be happier.' ",
        "There's zero risk in buying it now as it comes with a 365-night sleep trial so you can try the mattress and return it for a refund within one year if you find its not for you. Just make sure to shop on the Nectar Sleep website before midnight on May 8 because the 40 per cent off promo will come to an end very soon."
    ]
}