{
    "articleURL": "/sciencetech/article-12042803/How-save-fortune-iPhone-checking-one-simple-setting.html",
    "content": [
        "Some popular apps are free to download but upgrades can cost £200 a year Unless you're super organised you may be paying for services you no longer useLuckily, Apple make it easy to check your subscriptions - here's how to do it...Have you ever used your iPhone to make in-app purchases or signed up for premium platforms? Were you one of the many Apple users who downloaded the free Magic Tiles 3: Piano Game app to your phone?",
        "It's easy to sign up for these services - and they're great if you end up using them on a regular basis - but unless you're super organised you could be paying hundreds of pounds a year for services you may no longer use.For example, while the Magic Tiles app is free to download, upgrading to the VIP version costs £3.99 per week, or £207 per year.",
        "Luckily, Apple makes it really easy to check what subscriptions you have and cancel anything you no longer want.Here's how to check your subscriptions and how much you are paying each month.• Unlock your iPhone and tap Settings• Select your profile (you'll find it right at the very top of the Settings list)• From here you'll see another menu list including the Subscriptions option.• Once loaded you'll now be presented with a full list of services and in-app purchases you subscribe to.• If you spot one you don't use anymore, simply tap it and hit the cancel option.It's worth noting that you'll continue to get access until the new billing date but once cancelled it should save you money off the following month's bill.Along with cancelling some subscriptions, there is another way to save some cash.",
        "If you use lots of different Apple services such as Apple Music, Fitness+ and Apple TV+ it's worth considering switching to an Apple One account. These plans bundle in a number of platforms for a cheaper price.",
        "For example, signing up for the Apple One Individual plan costs £16.95 and saves £7 off the usual price.This plan includes iCloud storage, Apple TV+, Apple Music and Apple Arcade access. There's also this same plan available with family member access for £22.95 - saving £9 per month.Finally, those wanting the best of everything can sign up for Apple's Premier plan which adds Apple Fitness+ and Apple News+.This costs £32.95 - that's a saving of £23 when compared to signing up for each service individually.If you've not checked your subscriptions for a while it's worth taking a look. The whole process can be performed in a matter of minutes and it's surprising what you may have signed up for."
    ]
}