{
    "articleURL": "/wires/pa/article-12046777/Celtic-midfielder-Matt-O-Riley-hoping-seal-title-Hearts.html",
    "content": [
        "Matt O’Riley returns to the scene of his fast-track Celtic debut on Sunday hoping to clinch a second successive cinch Premiership title.",
        "The 22-year-old midfielder signed from MK Dons in January 2022 and went straight into Ange Postecoglou’s side for the trip to Hearts where he set up Giorgos Giakoumakis for the visitors’ second goal in the 2-1 win.With five post-split fixtures remaining, the reigning champions are 13 points clear of Rangers at the top of the table and will retain the title with a win over the Jambos while taking a giant step towards the domestic treble.Speaking at Toryglen Regional Football Centre where he was publicising a new walking football initiative supporting those affected by Parkinson’s, O’Riley said: “My first game was at Tynecastle. It was a good night.“It was a few days after I signed so I was thrown straight in which is probably the best way and it is quite a hostile atmosphere as well so it is probably the kind of game that you want to be involved in.“Two games later I was playing against Rangers as well so it was quite an introduction.",
        "“Nothing is officially done so we will train as we always do.“We would rather win than draw or lose, naturally. So that will be the aim but saying that, it is definitely a hard place to go.“It won’t be easy. Our frame of mind has to be right before the game and hopefully we can get the job done.",
        "“It (possible treble) is obviously exciting. One more trophy than last year so that would be great.“We haven’t done anything yet. We have one trophy, we are in a very good position to do something special but there is still a lot of work to be done.”With the ViaPlay Cup already won and the Scottish Cup final against Championship side Inverness at Hampden Park on June 3, the Hoops are eyeing a clean sweep of trophies.Celtic are away to Hearts then Rangers in their first two post-split fixtures and have been only allocated 1,264 tickets for Tynecastle and none at all for Ibrox.O’Riley said: “Personally I would rather win the league in front of our fans but if we can win it there (Tynecastle) it would be great.“They (fans) will all be watching on television. I am sure there will be fans outside Tynecastle hoping we get the job done on that day and I am sure that later on in the season when we play home games we will be able to, hopefully, celebrate with them if we get the job done.”Celtic FC Foundation is teaming up with Parkinson’s UK and Glasgow Life to help deliver free weekly walking football in Glasgow.The project will be free for people with Parkinson’s and will hopefully appeal to a greater number of people living with the disease, particularly those not currently engaged in physical activity.",
        "Celtic FC Foundation coaches will assist Glasgow Life, the charity that delivers culture and sport in Glasgow, and will also undertake Parkinson’s awareness training.O’Riley said: “It is a very important initiative. We have a really good Foundation.“This is my first time doing anything with Parkinson’s but the idea of giving back is a really good thing.”"
    ]
}