{
    "articleURL": "/tvshowbiz/article-12058155/MasterChef-Australia-premiere-ratings-hit-761-000-watch-Jock-Zonfrillos-final-season-death.html",
    "content": [
        "MasterChef Australia's season premiere on Sunday night was a ratings success after it returned to screens following the shock death of judge Jock Zonfrillo.",
        "The show's debut in the prime-time 7:30pm slot came after a touching one-hour tribute to Zonfrillo on Channel Ten's The Sunday Project.MasterChef attracted 761,000 viewers across the country and easily outrated its  competition, Seven's Farmer Wants A Wife and Nine's Lego Masters.It did particularly well in the coveted 25 - 54 year old demographic, with 345,000 viewers tuning in to see how the show addressed Jock's passing.Farmer Wants A Wife trailed it with 609,000 viewers and Lego Masters came in third, with 567,000 people watching its penultimate episode.",
        "Ten's heartwarming tribute to Zonfrillo on The Sunday Project was also a ratings success, with 610,000 people watching it - well up from the 246,000 viewers who tuned in the previous week.It comes after MasterChef viewers were quick to express their heartache on social media, admitting the new season 'hits differently' in the wake of the tragic loss of Jock.Tears flowed as viewers watched Jock grace their screens for the last time, with many sharing their emotional reactions on Twitter.",
        "'Every time Jock speaks,' wrote one distraught fan, accompanied by a crying emoji. 'Jock said, \"What a time to be alive\". Life is so precious and nobody knows what's ahead. This comment from him is heartbreaking,' another person tweeted.",
        "The pain was palpable, with many fans struggling to hold back their emotions.",
        "'I can't get past this. Nup. I think it's going to take me some time. My heart breaks,' wrote another viewer.Others couldn't help but feel the weight of the loss, as they watched an emotional conversation between Jock and contestant Brent about overcoming personal struggles. 'That convo between Jock and Brent just hits hard now,' a fan remarked.MasterChef Australia continues Monday at 7.30pm on Channel Ten "
    ]
}