{
    "articleURL": "/wires/ap/article-12047411/Stanley-Cup-winning-Czech-forward-Petr-Klima-dies-58.html",
    "content": [
        "PRAGUE (AP) - Czech forward Petr Klima, a Stanley Cup winner with the Edmonton Oilers in 1990, has died. He was 58.",
        "The news was announced by HC Litvinov, the Czech club where he started his career in the 1981-82 season, and by Kadan, where he previously worked as the general manager. The cause of death was not given.Litvinov said the news caused \"great pain in the heart.\"Klima emigrated from communist Czechoslovakia in 1985, four years before the collapse of the Iron Curtain.In 786 games across 13 seasons in the NHL, the right winger scored 313 regular season goals and added 260 assists. He netted another 28 times with 24 assists in 95 playoff games.He played for the Detroit Red Wings, Oilers, Tampa Bay Lightning, Los Angeles Kings and Pittsburgh Penguins.",
        "\"The NHL mourns the passing of Czech legend Petr Klima,\" the league said in a statement. \"Klima helped the Oilers win the 1990 Stanley Cup while scoring a memorable triple-overtime winner in Game 1 of the Final. Our sympathies are with his family, friends and many fans.\"It was the last time the Oilers won the trophy.\"We are deeply saddened to hear of the passing of Oilers alum Petr Klima &amp; extend our condolences to his family &amp; all loved ones,\" the Oilers wrote on Twitter.They said his triple-overtime winner from the right circle in the opening game of the 1990 Final against the Boston Bruins was one of the most iconic in Oilers history.",
        "Exactly 32 years ago on May 4, 1991, Klima scored a natural hat trick for the Oilers in 5:13 to contribute to a 7-2 victory over the Minnesota North Stars.The Red Wings, with whom Klima spent his first five NHL seasons before returning to Detroit for his final 1998-99 season, said they were \"deeply saddened\" and offered \"heartfelt condolences\" to Klima's family.Klima played 28 games for his country, scoring 10 times. He was on the Czechoslovak team at the 1984 Canada Cup.Klima´s two sons, Kevin and Kelly, play in the top Czech league.___AP hockey writer Stephen Whyno in Washington contributed.___More AP NHL: https://apnews.com/hub/nhl and https://twitter.com/AP_Sports"
    ]
}