{
    "articleURL": "/property/article-12041481/House-sale-West-Sussex-seaside-village-belonged-Desert-Island-Discs-composer.html",
    "content": [
        "Five-bedroom home for sale is in the West Sussex seaside village of AldwickHouse has a blue plaque showing that composer Eric Coates lived thereThe late Mr Coates is perhaps best known for the Desert Island Discs theme tuneA property on the south coast once owned by the composer of the Desert Island Discs theme tune is up for grabs.",
        "The five-bedroom semi-detached house is in the seaside West Sussex village of Aldwick.It has a blue plaque on an external entrance wall showing that the composer Eric Coates lived there. He is perhaps best known for The Sleepy Lagoon, the theme tune well known to listeners of Desert Island Discs.",
        "The property is being sold by Jackson-Stops estate agents and has a guide price of £775,000.The agent suggests that the 'Coates influence' can been seen in the house, with a pair of French doors between the sitting room and the dining room showing an acid-etched musical score.",
        "The house has been upgraded over the years, and now includes arts and crafts style oak joinery.The living room has an Inglenook fireplace with a wood-burning stove, while the kitchen has shaker style cabinets.",
        "There are four bedrooms on the first floor and a fifth bedroom with a sitting area on the converted top floor with full height windows looking across the road, between the houses to the sea.The property has a long driveway, allowing for plenty of off road parking for several cars.The full enclosed south-facing walled garden has a lawn and a timber pergola. And there is a small courtyard area near the garages.",
        "The freehold house is on a private no-through road, where there is a service charge of £220 a year.",
        "Aldwick Avenue is just along from Aldwick Beach, and those who live there have private access to the beach. Meanwhile, a short walk from the house is Bognor Regis town centre.The average sold price for a property in Bognor Regis in the last 12 months is £374,912.It is about £20,000 higher than the average for Britain, at £352,174, according to property website Zoopla.Daniel Copley, of Zoopla, said: 'This beautiful seaside home has a wonderful location - just 250m from the beach and a stone's throw from the historical town of Chichester and the South Downs National Park.'",
        "Desert Island Discs is a radio programme broadcast on BBC Radio 4.It was first broadcast on the BBC Forces Programme on 29 January 1942.Each week a guest, called a 'castaway' during the programme, is asked to choose eight recordings - usually, but not always, music -, a book and a luxury item that they would take if they were to be cast away on a desert island, while discussing their life and the reasons for their choices. It was devised and originally presented by Roy Plomley. Since 2018 the programme has been presented by Lauren Laverne."
    ]
}