{
    "articleURL": "/wires/reuters/article-12060377/Byron-Allen-sues-McDonalds-allegedly-lying-commitment-Black-media.html",
    "content": [
        "By Jonathan Stempel",
        "May 8 (Reuters) - The media entrepreneur Byron Allen has filed a second lawsuit against McDonald's Corp over the fast-food chain's alleged refusal to advertise with Black-owned media.In a complaint filed last week in Los Angeles, Allen's Entertainment Studios Networks Inc and Weather Group LLC said McDonald's \"lied\" when it pledged in May 2021 to boost national ad spending with Black-owned media to 5% from 2% by 2024.Allen said he would know if McDonald's were honoring that pledge because his Allen Media Group represents more than 90% of Black-owned media. He said he relied on McDonald's pledge when seeking new business from the company, only to be rebuffed.The lawsuit seeks $100 million plus punitive damages for McDonald's alleged violation of a California anti-fraud law against making false promises.Allen's case is in addition to his $10 billion federal lawsuit saying McDonald's ad practices amount to \"racial stereotyping\" that violated federal and California civil rights laws.In a statement, McDonald's said it was proud of its record of investing in diverse communities and partners.\"Byron Allen files baseless lawsuits as part of a public smear campaign against our company to try to line his pockets,\" it said. \"We will not be coerced by these 'in terrorem' tactics and will defend ourselves vigorously.\"",
        "Allen said in his own statement: \"During the Black Lives Matter movement, hundreds of corporations made pledges to Black America.... McDonald's is one of those corporations that has lied and made false promises.\"In an April 21 court filing, McDonald's lawyers said mediation to settle Allen's $10 billion lawsuit has been unsuccessful, and accused Allen of trying to \"harass and harangue McDonald's into an unmerited resolution.\"McDonald's cited an open letter Allen placed in the Chicago Tribune on April 19, one day before scheduled talks, attacking its alleged \"horrible systemic racism against Black people.\"The letter also called for the replacement of Chief Executive Chris Kempczinski and McDonald's board of directors. A spokesman for Allen did not immediately respond to a request for comment on Monday.The case are: Weather Group LLC et al v. McDonald's USA LLC, California Superior Court, Los Angeles County, No. 23STCV10045; and Entertainment Studios Networks Inc et al v McDonald's Corp, U.S. District Court, Central District of California, No. 21-04972. (Reporting by Jonathan Stempel in New York; Editing by Aurora Ellis)"
    ]
}