{
    "articleURL": "/tvshowbiz/article-12061463/Real-Housewives-Salt-Lake-City-explosive-castmates-Whitney-Rose-Lisa-Barlow-feud.html",
    "content": [
        "Producers of The Real Housewives of Salt Lake City are bracing for tensions between Whitney Rose and Lisa Barlow to boil over during the cast's trip to Bermuda.",
        "'Producers have been preparing for an explosive situation in Bermuda,' an insider told Page Six.The person revealed that producers got together at The Loren at Pink Beach resort last week to discuss potential narratives between Rose, 36, and Barlow, 48, before the cast arrived at the archipelago on Saturday.'Tensions have flared in Whitney and Lisa's relationship while filming Season 4,' the source told the publication. It was added that 'the women recently got into it with each other, and their conflict is expected to bleed into the Bermuda trip.'",
        "The source noted that the pair's 'discord is layered,' but Barlow thinks Rose 'hasn't been completely honest with her this season.'The contact didn't expound on what upset Barlow, but a second source added that her changing relationship with Meredith Marks — with whom Barlow had a major falling out in the past — might be related.'Lisa and Meredith are in a better place,' dished. 'Their friendship will never be what it was, but they've settled into a cordial relationship.'The new dynamic between Lisa and Meredith could be creating space for Lisa to reevaluate her relationship with Whitney.'Making matters worse, Barlow has also been tending to her on-off friendship with Heather Gay, who was formerly best friends with Rose before Season 3.",
        "'Lisa is also getting along more with Heather, which might be to blame for some of the tension with Whitney,' it was speculated.The cast previously vacationed in Palm Springs while filming the next season, but Bermuda is the group's first trip outside the US. They could only go on domestic vacations while Jen Shah, who is now serving time behind bars, was still on the show.It was previously told to Page Six that the cast 'was undergoing a shakeup' after a 'dark' season three. ",
        "During that installment Shah, 49, began a 5-year prison sentence for fraud while Gay, 48, sustained a black eye shrouded in mystery.'They’re trying to bring in new women to lighten it up,' a source told the pub in January.Also in January, Marks, 51, said she agreed the series needed 'people to help bridge the gap' of the 'divided' costars.The season four premiere date for the show has not been revealed yet."
    ]
}