{
    "articleURL": "/wires/reuters/article-12048193/Blinken-says-Armenia-Azerbaijan-make-tangible-progress-peace-talks.html",
    "content": [
        "WASHINGTON, May 4 (Reuters) - Azerbaijan and Armenia have made \"tangible progress\" towards a peace agreement in negotiations this week in Washington, U.S. Secretary of State Antony Blinken said on Thursday.",
        "Armenia and Azerbaijan have fought two wars over 30 years focusing on the territory of Nagorno-Karabakh, recognised as part of Azerbaijan but populated mainly by Armenians.In a six-week conflict in 2020, ended by a Russian-brokered truce, Azerbaijan recovered swathes of territory lost in the first war dating from the collapse of Soviet rule.Washington this week hosted the two countries' foreign ministers, with much of the focus on the latest flare-up: Azerbaijan's installation of a checkpoint at the start of the Lachin Corridor, the only route linking Armenia to Karabakh.\"The two sides have discussed some very tough issues over the last few days, and they've made tangible progress on a durable peace agreement,\" Blinken said at a closing session.He added he believed there was an agreement within sight.The two countries' foreign ministries both noted progress at the talks, but pointed to different positions on key issues.In comments made on Thursday in Prague, reported by Russian news agencies, Armenian Prime Minister Nikol Pashinyan listed several reasons why he said Azerbaijan was to blame for the failure to clinch a durable peace accord.Azerbaijan's Foreign Ministry accused Pashinyan of making \"absurd claims\" and added: \"Armenia must stop interfering in the internal affairs of Azerbaijan and cease its aggressive policy pursued against Azerbaijan for many years.\"",
        "Azerbaijan said it had established the checkpoint in response to what it said were Armenian weapons being sent to Nagorno-Karabakh. Yerevan denies that charge.Several rounds of talks between Pashinyan and Azerbaijan President Ilham Aliyev have produced no breakthrough on issues such as the demarcation of borders and return of prisoners.The Kremlin on Tuesday said any efforts to resolve the conflict between Armenia and Azerbaijan were welcome, but that the basis of any long-term solution should be the 2020 Russian-brokered peace agreement. (Reporting by Humeyra Pamuk, Daphne Psaledakis and Ron Popeski; Editing by Chris Reese, David Ljunggren, Marguerita Choy and Cynthia Osterman)"
    ]
}