{
    "articleURL": "/wires/aap/article-12040205/Sustainability-not-woke-capitalism-minister-says.html",
    "content": [
        "The future value of companies is at stake as regulators, companies and governments grapple with sustainability and consumer protection.",
        "Federal Minister for Financial Services Stephen Jones warned a business audience that sustainable business must start in the boardrooms and in investment decisions, not marketing departments.\"It has to be real,\" he told the Australian Council of Superannuation Investors conference in Sydney on Wednesday.Regulators worldwide are taking aim at greenwashing, which involves making false or exaggerated environmental claims, as companies and superannuation funds try to catch the wave of capital available to combat climate change.Mr Jones said any doubts about the pace of change were put to bed when the United States passed the Inflation Reduction Act last year to lower energy costs and spur clean energy investment.\"It's a game-changer in the energy transition project internationally and Australia will be disadvantaged if we're not on board,\" he told the conference.He said a big agenda was already being rolled out and Treasurer Jim Chalmers would have more to say on budget night on Tuesday.\"I don't think anyone can be left in any doubt about ambition and about momentum,\" Mr Jones said.However, greenwashing corrodes the credibility of sustainable financial markets, so action has been taken to prevent it, he said.The federal government recently announced an extra $4.3 million for the Australian Securities and Investments Commission (ASIC) to keep pace with overseas regulators as a tide of green capital is invested to make industry and business clean.",
        "The funding will allow ASIC to increase surveillance of suspected greenwashing by listed companies, superannuation funds and investment managers, and carry out complex enforcement actions.The minister was also quizzed about so-called \"green hushing\", which is when companies avoid making promises about environmental and climate initiatives for fear of being called out for missing the mark - by consumers, investors and regulators.Cracking down on false claims - or misleading by omission - needs a carefully honed list of definitions, called a taxonomy.Mr Jones said regulators will go after \"egregious\" cases as well as putting the work into a taxonomy that give investors more certainty and make it easier to catch more wrongdoers.The taxonomy is being developed as a critical element of the sustainable finance agenda, as well as companies needing to be up-front about climate risks.\"There's broad support for mandatory climate disclosure requirements,\" he said.\"Our initial view is that mandatory reporting requirements should be phased in over time.\"The most contested issue is whether existing settings in forward-looking financial statements are fit-for-purpose for climate reporting.He said a decision will be made later this year.\"Those who want to equate sustainable finance and ESG (environmental, social, and governance) responsibilities with some form of woke capitalism need to have a good hard look at themselves,\" Mr Jones said.",
        "\"Because what we are talking about is the future value of companies.\""
    ]
}