{
    "articleURL": "/tvshowbiz/article-12058769/Lewis-Capaldi-puts-cosy-display-girlfriend-Ellie-MacDowell-outing-West-Hollywood.html",
    "content": [
        "Lewis Capaldi put on a cosy display with his girlfriend Ellie MacDowell as they headed to brunch in West Hollywood on Thursday.",
        "The singer, 26, cut a casual figure in a black sweatshirt and matching trousers while sporting a pair of trainers featuring red laces.Actress Ellie, 23, wore a similar ensemble while toting her essentials around in a burgundy leather handbag.She framed her face with round sunglasses and accessorised with a collection of chain necklaces. The happy couple soon arrived at the family-owned Dialog Cafe, where they took an outside table after ordering their food.",
        "After checking their phones, they started eating when Lewis waved at some friends who were coming to join them.The Forget Me hitmaker tucked into a breakfast sandwich as the friends caught up, spending over an hour enjoying al fresco dining.Lewis recently opened up about his new relationship and his experience with panic attacks as he spoke to Scott Mills on BBC Radio 2.The songster recently released his Netflix documentary How I'm Feeling Now, where he travelled back to his family home in Scotland following the success of his first album, Divinely Uninspired to a Hellish Extent, and began to write his second. It also explored the singer's journey with Tourette's syndrome, after doctors picked up on his uncontrollable shoulder twitch. And speaking to DJ Scott Mills on Friday, Lewis further discussed his mental health and his new relationship - as well as his new single Wish You The Best. ",
        "Lewis said: 'I have a girlfriend and that’s going really well, I am happy happy, she’s a lovely lady I feel good about everything.' The BRIT winner was first spotted with his new girlfriend back in November, as the pair were pictured on a night out and then a romantic dinner in the early hours of the morning. ",
        "They were then reportedly seen at the BRITs afterparty in February, where they struggled to keep their hands off each other. And it seems they have lots in common as well because Ellie works in the arts, too and she's a fellow Scot!  She's a triple threat - trained in acting, dancing and singing. This year Ellie will also have a starring role in new biopic Archie focusing on the actor Cary Grant.The four-part drama series will cover his humble beginnings in the UK to his phenomenal rise to success in America. Ellie will be playing the part of his daughter, Jennifer Grant in the series, which will air on ITV's new streaming service, ITVX. It appears that Lewis' new song Wish You The Best - which was released at midnight on Thursday - is not a comment on his current happy love life.Discussing his new song, Lewis said: 'It’s about someone moving on and that feeling where you know it’s the best thing for that person but you want to say to them and all you say is \"good luck I’m really happy for you.\"'",
        "He continued, poking fun at his own tendency to write songs about sad situations: 'But actually you are dying inside and want to tell them all the things you miss about them and why they should stay with you, so just a really happy song for the summer.'Scott and Lewis went on to discuss the impact of anxiety on their lives, as Scott admitted it meant he 'struggled to finish his GCSEs' as a teenager, while Lewis suffered with them just last weekend. Lewis said: 'I will never feel normal again. I’ll never get rid of these, I had multiple panic attacks on Saturday evening. 'I went out for a few beers on the Friday, I always feel anxious after drinking but I’d really hammered it after a long time of not boozing and my mum had to come down to calm me down, lie in bed with me and I was having panic attack after panic attack and the whole week after I felt off.' But the hitmaker added that he's been having a better week as he deals with the ups and downs of his mental health. He added: 'I’m having a good day today I haven’t twitched that much, I still do that I still tick quite a lot but it’s one of these things. ",
        "'What’s mad is that there is no real treatment for Tourette’s so I’m in a position where I can cancel a whole day of work if I’m too stressed or my anxiety it too bad. 'For other people it must be so much worse, they don’t have the luxury I have.'In the documentary, Lewis' parents Mark and Carol showed where their son had inherited his iconic sense of humour from. ",
        "The Somebody You Loved crooner revealed that they tried to get involved in his songwriting process and had become like 'Simon Cowell'. He said: 'My mom and dad have all of a sudden become these muso’s, my mum is a nurse and my dad is a fishmonger and now all of a sudden they’re like Simon Cowell. 'It’s mental - I don’t tell my dad what halibut to sell!'But despite his sudden rise to fame, the singer is as close with his parents as ever, revealing that his mum still does his laundry. He added: 'Nowadays my mum does my laundry because I’ve shrunk a lot of my clothes!'  Earlier on Thursday the singer posted a snippet of his new song Wish You The Best to Twitter, alongside its heart-wrenching lyrics. He sang: 'Oh my love, I wanna say I miss the green in your eyes. And when I said we could be friends guess I lied. ",
        "'I wanna say I wish that you never left. Oh but instead I only wish you the best.'Writing on Twitter he announced the release of the song, saying: 'wish you the best’ yours tonight at 11:59pm x'Lewis previously dated Love Island winner Paige Turley on and off from 2014 to 2016 after they met at college in Motherwell.She is said to have inspired his smash hit album Divinely Uninspired To A Hellish Extent and his hit song, Someone You Loved.Speaking previously about the inspiration for the record, Lewis said: 'I met a lady. She was very nice. I loved her. I loved the look of her and I loved how she spoke.The singer shot to fame in 2019 after his hit single Somebody You Loved topped the UK Singles Chart for six weeks - and which recently became the UK's most streamed song of all time. He then was reported to have dated student Catherine Halliday for seven months before splitting in September 2020.Lewis revealed he was on dating app Hinge after being thrown off Tinder and Bumble because people thought he was pretending to be Lewis Capaldi.He has now achieved four number ones and his debut album, Divinely Uninspired To A Hellish Extent, sold over 10 million copies worldwide ",
        "His second album Broken By Desire To Be Heavenly Sent will be released in May, before he performs at Glastonbury Festival in the summer. "
    ]
}