{
    "articleURL": "/wires/aap/article-12057487/Cowboys-players-credit-Paytens-tough-love-key-win.html",
    "content": [
        "North Queensland players have credited a character challenge and old fashioned kick up the backside from coach Todd Payten, combined with a flogging at training, for their stunning reversal of form.",
        "The character-laden 20-6 Magic Round win over Sydney Roosters on Sunday, a week after a 44-6 thrashing by Cronulla, could prove to be the turning point in the season of last year's preliminary finalists. The Cowboys are now on eight points and four points outside the top eight.Lock Reuben Cotter, who was one of his team's best, was quick to identify the reason for the turnaround.\"Probably a kick up the arse to start the week,\" Cotter said after the win.\"It was a tough week. We got touched up Monday and Tuesday at training and we definitely needed it.\"(Payten) spoke about how the next month would reveal our true character. Tonight showed the boys really do care for the jersey and care for each other ... and we've got to keep building on it.\"The Cowboys forwards tore into the Roosters and there were multiple try savers made on their tryline in a performance that thrilled captain Chad Townsend.\"The coach did a great job. He challenged our character,\" Townsend said.\"As a player when you get challenged and your character gets challenged...it is not a good feeling.\"You want to respond to that and our response was excellent right across the board. We controlled the whole game. Our line speed, discipline and energy was great.",
        "\"That was a performance that reminds me of the standard we have set as a team, and what the Cowboys really play like.\"One win doesn't make a winter in the NRL and Townsend said it was \"hugely important\" to back it up against St George Illawarra on Saturday night.\"The challenge for us now moving forward is to be at the standard more consistently. We are keeping a lid on it,\" Townsend said.Payten said he was expecting several players to be back from injury in the coming weeks. Co-captain Jason Taumalolo is one of them.\"We just need to continue to play our style of footy. The cavalry is on its way,\" Payten said.\"Last week we got punched in the face a couple of times and we didn't do anything about it. As a coach I can cop losing if we are in the contest, going after it and fighting hard. It was a different team today.\""
    ]
}