{
    "articleURL": "/news/article-12050841/Josef-Fritzl-locked-daughter-cellar-fathered-7-kids-wants-reconcile-ex.html",
    "content": [
        "Josef Fritzl publishes memoir, Die Abgründe des Josef F (The Abysses Of Josef F)The notorious incest kidnapper was sentenced to life imprisonment in 2009 Josef Fritzl wants a reconciliation with his former wife - and bizarrely claims they are still married despite divorcing 11 years ago in an extraordinary new memoir to try and win his release from prison.",
        "The Austrian sex monster, who locked his daughter Elisabeth in a cellar for 24 years and fathered seven children with her, makes light of his horrific crimes and describes his trial as a 'huge fuss' in the new book.Notorious incest kidnapper Fritzel was sentenced to life imprisonment in 2009 for incest, rape, coercion, false imprisonment, enslavement and for the negligent homicide of one of his infant sons born as a result of sex with his own daughter.In his macabre memoir, Die Abgründe des Josef F (The Abysses Of Josef F) Fritzl expresses little remorse and is also slammed for being 'self-pitying.'Despite his heinous crimes, Fritzl maintains that he still harbours dreams one day of living again with his wife Rosemarie, who he describes as 'the love of my life' and is even prepared for them to stay in separate bedrooms.",
        "He also admits, 'I have so much to explain to her.'Rosemarie, 82 and Fritzl, 87 married in 1956 and had three children. According to Austrian media, he divorced her in 2012 after she refused to visit him in prison, but this was not confirmed by authorities in the country.In his book, Fritzl suggests that they are still married.He writes: 'I always got along well with her. But we had very different spheres of life. I had my job, my travels, and of course my secret love affairs. I was always looking for adventure in some way. I guess I didn't appreciate her enough.",
        "'I have so much to explain to her. They say that you should not only be at peace with yourself, but also with others before leaving this world.'Astonishingly, Fritzl reveals that if he were ever to be released, he would like to live with Rosemarie.He writes: 'Besides, I am still married to my wife. If I were released, I would like to be with her again. Live with her in a house, even with separate bedrooms.'Of course, only if she still wants that, if she still believes in me. In any case, I am always here for her. I would be really pleased if you got in touch with her. As you can see, I am a loyal dog.'In another extraordinary rant, Fritzl professes the virtues of family life, insisting: 'The parental home was the most important thing. Now days everything is completely different. ",
        "'The state interferes everywhere. This leads to nothing good. I can see it here, where I am now: Many of those who end up in prison come from broken homes, grew up in shelters.'MailOnline can also reveal that Fritzl has applied for a transfer from the Stein high-security facility, Austria's Broadmoor, where he is held to a regular prison so that he can apply for parole.",
        "His lawyer Astrid Wagner said: 'I have appointed a new psychiatric expert to evaluate my client, and I feel confident that he is going to be able to help ensure that my client gets transferred. And, when transferred, this means that he would later be eligible for parole, so this is very important.'In the book, Fritzl urges his wife to visit him in prison so that they can clear the air.He writes: 'Even though everything happened so long ago, my wife is still inside me. More than before. I guess you get more sensitive with age. I think a lot about how she feels about everything now. It would be nice if she came to visit me.'I think it's time to talk about what happened. To make a clean sweep, so to say. We have been married for sixty-nine years now, you can't just erase that!'Elisabeth disappeared in 1984 at the age of 18 after Fritzl rendered her unconscious with a rag soaked in ether and threw her into his makeshift, underground prison. She would not reappear until April 26, 2008, when she was discovered in the clandestine cellar beneath the family home in Amstetten, Austria.After the horrific ordeal came to light, there was widespread speculation about Rosemarie's involvement.",
        "She was never charged, and police quickly cleared her after an interview in 2011. It emerged that she was never allowed into the basement where Elisabeth was imprisoned and had no knowledge of her husband's crimes.Rosemarie is now believed to be living in Linz, around 30 miles from Amstetten.Fritzl wrote his book with the help of Ms Wagner, 59 who began visiting him at the Stein high-security facility. The resulting book, written by her, is an account of her impressions, interspersed with Fritzl's own writings.",
        "Fritzl fumes in his book that the media 'smeared' him with 'dirt' and referring to his trial, he writes: 'What a huge fuss! The car of the judicial guard I was in had to drive around the court- house a few times, because the whole place was blocked by the reporters' vehicles.'He also claims that even after his conviction he continued to receive fan mail from female admirers.He reveals: 'By far not everything happened as it was portrayed by the media. They made millions with my story yet smeared me with dirt. But although I was labelled the 'cellar monster', there were people who did not let themselves be deterred. I received hundreds of letters from all over the world, in which I was encouraged and offered support.'",
        "Fritzl brags that he regularly received letters from one female admirer who wrote 'I kiss you every day,' but that he ended the 'relationship' because he still wanted to be with his wife.Reflecting on his crimes, Fritzl said in his memoir: 'At first it was just a mind game I played. But I got used to it. The idea, which had previously seemed so absurd, so monstrous to me, took shape.'One day I knew what I had to do. All that remained was to wait for the right opportunity. On that rainy Saturday morning the time had come. The thought had become action.'Fritzl intricately set up his underground prison, which featured a heavy metal door hidden behind a shelf in his workroom.",
        "Describing how 24 years of horrific crimes began, Fritzl said: 'The next morning, I filed a missing person report with the local gendarmerie.'The officer carefully logged everything and declared: 'She's over 18 and can do whatever she wants.'''Fritzl made Elisabeth write letters to her mother explaining that she needed time away from home, then posted them in faraway towns. He told neighbours she had run away to join a cult.'It wasn't easy, because the thoughts of what I had done were constantly circling within me,' he said.",
        "'I was constantly energised. There was no one I could confide in. I had to look ahead and continue on the path I had chosen.'Fritzl visited his captive at least three times a week, bringing food and sometimes flowers, he says, for Elisabeth. Yet he took long vacations to places like Thailand, leaving his victim to deal with power cuts, rats, overflowing sewage and rotting food in their underground prison.He writes: 'When I was away, I pushed away all my problems. Also, my secret. Everything was far, far away. Otherwise, I would have gone crazy! Only sometimes when I was alone, gloomy thoughts haunted me. I immediately repressed them by distracting myself and thinking of something else...'Large parts of his book focus on his sexual exploits while working as a travelling salesman for a Danish concrete manufacturer. He claims to have fathered five children in India and had a son with a Ghanaian woman while in the country for work.Fritzl, who changed his name to Mayrhoff six years ago, is now reportedly suffering from dementia. But Ms Wagner has claimed she saw no sign of illness and that he talks a lot about reuniting with his family.She said: 'I can say that my client is really getting older – you can really notice it. He now repeatedly talks about dreaming of meeting up with his family again, and he wants them to come and visit him.'"
    ]
}