{
    "articleURL": "/tvshowbiz/article-12047381/Kris-Jenner-67-looks-thinner-usual-tank-Kim-Khloe-accused-using-Ozempic.html",
    "content": [
        "Kris Jenner posted several new images to her Instagram page on Wednesday.",
        "The Hidden Hills, California resident was in a cream-colored tank top with matching fitted slacks that gave her a good view of her body.The 67-year-old momager looked thinner than usual as she showed off her slender and toned arms in the summer top.The Kardashians TV producer also had a small waistline as she wore the fitted slacks that didn't hide much. Daughter Kylie Jenner said in the caption that her mom looked 'so pretty'.",
        "Kris has appeared thinner in recent months which she has attributed to increased exercise and a protein heavy diet.Jenner added a long necklace with a teardrop pendant as well as a diamond encrusted watch.Her jet-black hair as worn short and puffed up.The Keeping Up With The Kardashians co-creator has been in New York for work this week along with her longtime boyfriend Corey Gamble.'New York state of mind @coreygamble makeup by @etienneortega, hair by @leajourno,' she wrote in her caption.This posting comes three months after her daughters Kim and Khloe Kardashian were accused of using the diabetes drug Ozempic to slim down.Several fans and critics called out the famous sisters for supposedly using weight-loss substances, despite their denials and a lack of concrete evidence that they had used Semaglutide, which is also known by the brand names Ozempic, Wegovy and Rybelsus.",
        "Some fans even went as far as to accuse the reality stars of shooting an ad for Ozempic due to their significant weight loss.'An Ozempic ad is what I see here,' wrote one accusatory account in the comments to their Instagram posts.Another person joked, 'Save some insulin for the people who actually need it,' though the drugs that many fans speculated that they had been using are distinct from the insulin that many diabetic people require.Others complained more generally about the sisters' weight loss, insisting that they were 'too slim.'  One particularly cruel comment appeared to be directed at Khloé: 'Her hands look too thin eat something you look hungry.'Another user joked that Khloé was 'barely flexing,' while Kim was 'holding it in.' Another user bemoaned the 'money spent on those bodies.' Other users complained more generally about Kim and Khloé's recent weight loss, though Khloé's physical transformation has been more gradual, and she has regularly highlighted her intense workouts for years.'What are yall trying to see who can show all their ribs the fastest???wtf,' commented one person.Ozempic is manufactured by Danish pharmaceutical giant Novo Nordisk and costs around $900 per dose.",
        "The injectable version can be used on the stomach, thigh or arm, and it quickly works to suppress a person's appetite, which can be useful in allowing them to shed weight.",
        "It is currently only approved by the FDA as a type 2 diabetes treatment, but many medical providers have begun prescribing it off label as a weight-loss drug recently, and it has skyrocketed in popularity among wealthy customers looking to slim down.However, the rush of rich people looking to buy the drug has created shortages that harm diabetic people who most need it for their health.",
        "Over the summer I was lucky enough to be invited to a 60th birthday at which the after-dinner entertainment was a private performance by one of the UK's leading male pop stars. More eye-popping than the actual show, though, was how incredible said star looked. He was a mere shadow of his former self, prancing around the stage in a silver catsuit. His secret? Semaglutide, or Ozempic as it is branded, a new diet drug that everybody – but everybody, darling, including one of the world's most famous supermodels – is apparently taking. Originally developed to treat type 2 diabetes, it is used off-label (for a purpose other than that for which it was licensed) in both the US and the UK to treat obesity. In research conducted by its billionaire manufacturer, the Danish-based pharmaceutical company Novo Nordisk, patients lost an average of 17 per cent of their overall body weight over 68 weeks. This compares with five to nine per cent for 'oldschool' anti-obesity drugs such as Metformin. Only available in the UK on the NHS if you have type 2 diabetes, Ozempic can be obtained through a private doctor, and if you are willing to take it without medical supervision – not recommended by doctors (see panel) – you can get it online through various weight-loss programmes. It is sometimes taken in tablet form but more commonly as an injection. ",
        "Predictably, Hollywood has been aware of Ozempic for a lot longer than us – Variety magazine recently quipped that the drug deserved its own thank-you speech at the Emmys, as so many stars on the podium had obviously been taking it. Elon Musk raved about its more powerful sister drug, Wegovy, on Twitter; Kim Kardashian, it is hotly rumoured, used semaglutide to lose 16lb in order to fit into Marilyn Monroe's dress for the Met Ball. On TikTok the hashtag #ozempic has had more than 285 million views. Thanks to the hype, there has been a surge in demand, causing shortages on both sides of the Atlantic, with a backlash against influencers and celebrities hogging supplies ahead of desperate diabetes sufferers. Predictably, Big Pharma has come up with an alternative – tirzepatide (brand name Mounjaro), manufactured by Eli Lilly – but it has yet to be approved by the US Food &amp; Drug Administration for weight loss. Novo Nordisk has issued a statement to say its supplies will be replenished by the end of the year, but it hasn't quelled anxiety. At least two middle-aged male friends of mine who started using it in September are getting themselves in a twist about being caught short before the holidays. As one private London GP remarked to me: 'It's like the H RT panic last spring.' So what exactly is this drug? Semaglutide belongs to a class called GLP-1 agonists, which not only regulate blood sugar but, as was discovered about a decade ago, also mimic the gut hormones that regulate our appetites – the ones that tell the brain when we are hungry or full. There are, of course, side effects: acid reflux, nausea, exacerbation of IBS symptoms and fatigue (but much less so than in earlier GLP-1 agonists such as Saxenda), as well as pancreatitis, gallstones and, in very high doses, it has caused thyroid tumours in rats. Meanwhile, when you stop using it the effect wears off immediately and in some cases it won't work at all. 'I would describe semaglutide as an example of very smart science,' says leading consultant endocrinologist Dr Efthimia Karra from her private practice off London's Harley Street. 'But it is not a panacea for everyone. Around a fifth of users do not respond to it. This is because the human body favours weight gain, thus when you lose weight the body will do anything to revert to its highest BMI. The heavier you are the harder it is to lose weight. If a patient has made no progress in three months, I will take them off it.' Banker's wife Laura, a native New Yorker in her mid-50s who had hovered between decades, started using it in January. 'The Paleo diet, 5:2, CBT, NLP, bootcamp, diet delivery services – I've tried them all,' she says from the family home in Hampshire, 'and I've always yo-yoed right back. After my last annual checkup I seriously contemplated giving up. Then my doctor suggested semaglutide.' After only a month she noticed her clothes had become looser. From then on, the weight started dropping off. 'The strange thing was, I wasn't eating anything different. I just couldn't physically have seconds any more, and the idea of pudding after a full meal had lost its allure.' Three months on, she is two stone lighter ‒ though occasionally she suffers heartburn if she eats too late at night or drinks alcohol ‒ and when we spoke in autumn, she was looking forward to losing another stone by Christmas. 'There is a niggling voice that tells me it is both risky and lazy to take a drug to lose weight, and I worry that it will all pile on again if I stop taking it. But if it does, I will seriously consider taking it indefinitely.' Private London GP Dr Martin Galy has been prescribing semaglutide for about a year to clients who cannot lose the weight they gained in menopause. He has seen it have a transformational effect, too, on much younger women who suffer polycystic ovary syndrome. 'PCOS sufferers are difficult to treat, and you can imagine how body image plays a very important part when it comes to self-esteem.' But according to Tom Sanders, professor of nutrition and dietetics at King's College London, it is not a magic bullet. Commenting on a study on semaglutide published in The New England Journal of Medicine in 2021, he says, 'The challenge post-weight loss is to prevent a regain in weight,' he wrote. It may prove to be useful in the short term, but 'public health measures that encourage behavioural changes such as regular physical activity and moderating dietary energy intake are still needed'. That said, given our rising national obesity statistics and the escalation in accompanying health issues such as heart failure, cancer and obstructive sleep apnoea clogging up hospital beds, we're going to need something. Semaglutide may be the rich person's drug today, but might it be approved for more widespread use? Only time will tell."
    ]
}