{
    "articleURL": "/wires/reuters/article-12052923/NYCFC-entering-busy-period-meet-Charlotte-FC.html",
    "content": [
        "Nothing looks easy for either New York City FC, who have had a challenging stretch, or Charlotte FC, who are dealing with distractions.",
        "Perhaps there's a prize for one of these teams when they meet Saturday night in Charlotte.New York City (4-3-3, 15 points) will be in the second stop of a five-game road stretch. The first match was a 1-0 loss at Toronto FC.NYCFC haven't won a road game this season.\"The games come thick and fast,\" NYCFC defender Kevin O'Toole said. \"It's just about moving on and being ready for the next match.\"NYCFC have back-to-back weeks with midweek matches coming up, meaning minutes will be monitored and might result in more substitutions.\"We've got a busy period now, so rotation will be important,\" coach Nick Cushing said.It will help NYCFC if forward Gabriel Pereira is available after missing last week's game with an undisclosed injury. He has been going strong at recent practices, Cushing said.Charlotte FC (2-5-3, 9 points) have a much different problem right now. Forwards Andre Shinyashiki and Nuno Santos have been connected to a police report related to an alleged sexual assault in February. Neither player was charged with a crime and Shinyashiki claimed he was cleared by MLS to play.\"I want to focus on football,\" Charlotte coach Christian Lattanzio said. \"I have to make sure we focus on football, we focus on our profession. They know what expectations I have of them.\"",
        "Shinyashiki hasn't been with the team for a couple of weeks. He won't play again this weekend.The off-field issues are frustrating for the team.\"It's part of the job. I have to keep going,\" Lattanzio said. \"I really get tired of all these distractions off the field.\"Charlotte had started to demonstrate some finishing touches on the offensive end, but those went away in last week's 3-0 road loss to D.C. United.In that defeat, Charlotte barely generated scoring chances. That left Charlotte with one victory in five April outings (1-2-2) in MLS play.This begins a stretch of three of four MLS home games for Charlotte, which also will have a home date for a U.S. Open Cup match mixed in next week.Lattanzio has a strong connection with NYCFC as a former assistant coach. He was with the team from 2016-18.\"I had a great relationship with the people at the time. Some of them are still there,\" Lattanzio said.--Field Level Media"
    ]
}