{
    "articleURL": "/wires/afp/article-12040435/Myanmar-junta-pardons-2-153-prisoners-jailed-dissent-against-military.html",
    "content": [
        "Myanmar's junta pardoned more than 2,000 political prisoners to mark a Buddhist holiday on Wednesday, triggering tearful reunions outside jails but also demands that the many others behind bars be released.",
        "The military has arrested thousands of protesters and activists since its February 2021 putsch that ended Myanmar's brief democratic experiment and plunged the country into turmoil.Protesters and journalists were among the 2,153 people freed, AFP reporters said, a tiny fraction of those targeted in the military's brutal and sweeping crackdown on dissent.\"There are many prisoners... left in the prison,\" said Phoe Thar, a student who was jailed in December 2021 for taking part in a flash mob demonstration.\"I want to ask people to stay strong for those prisoners,\" he told AFP outside Yangon's Insein prison.About 100 people had gathered outside the sprawling, colonial-era complex following the announcement early Wednesday, AFP reporters said.",
        "As a yellow bus pulled out of the gates, some in the crowd held pieces of paper up to the windows, signs bearing the names of their relatives.One man reunited with his weeping family outside the prison took his baby into his arms.Ma Ye Ye was waiting to see if her son, who was jailed in 2021, would be freed.\"He was arrested for nothing,\" she said, requesting a pseudonym for fear of retaliation. \"He just walked through a security gate and soldiers arrested him.\"- Waiting for relatives -\"I was thinking this morning that it would be really good if my son was to be released on this Buddha day,\" said Ma Khin, another woman waiting in the crowd, who also requested a pseudonym.",
        "\"Then I received phone calls from my relatives that there would be an amnesty... I don't know if he will be on the list, but it's my duty to come and wait for him.\"",
        "Those pardoned had been jailed under Section 505 (a) of the penal code, which outlaws any action deemed to undermine the military. The law carries a maximum jail term of three years.On Wednesday, the military said it ordered the pardons \"for the peaceful mind of the people and on humanitarian grounds\".Those who re-offend will have to serve the remainder of their sentence with an additional penalty, it added.Myanmar typically grants amnesty to thousands of prisoners to mark national holidays or Buddhist festivals.Local media reported that prisoners were also released from jails in Pyay, northwest of Yangon, and in Myeik in the far south.The junta later announced that 38 prisoners who had been sentenced to death would have their sentences commuted to life imprisonment.It did not give details on those prisoners.- 'No concession' -\"Any release of prisoners is of course welcome for the individuals and their families, but this does not represent any sort of concession by the regime,\" said Richard Horsey of the International Crisis Group.",
        "\"It is a ritual to release prisoners on Buddhist holidays, but thousands of political prisoners remain incarcerated for opposing the regime, and arrests continue.\"",
        "More than 21,000 people have been arrested since the military ousted a civilian government led by Aung San Suu Kyi in 2021, according to a local monitoring group.More than 17,800 were still behind bars, according to the group's latest figures, published Tuesday. Suu Kyi is one of those in detention since the coup.At least 170 journalists have been arrested during that time, according to the United Nations.Myanmar ranked 173 out of 180 in the latest World Press Freedom Index by Reporters Without Borders.In December, the junta wrapped up a series of closed-court trials of 77-year-old Nobel laureate Suu Kyi, jailing her for a total of 33 years in a process rights groups condemned as a sham.Outside Insein prison on Wednesday, Khin Sandar Win knew her husband would not be among those released.A former regional minister, he had been jailed by a closed-door junta court for 15 years for corruption.But she was hoping to see a journalist acquaintance of hers benefit from the amnesty.\"Today is his mother's funeral day,\" she said.\"His mother will be cremated this afternoon. I really want him to be released and to see his mother's face for the last time.\""
    ]
}