{
    "articleURL": "/wires/reuters/article-12049373/Blue-Jays-Pirates-trying-recapture-early-season-form.html",
    "content": [
        "Two teams trying to keep strong starts from fading too fast meet Friday when the Toronto Blue Jays open a series against the host Pittsburgh Pirates.",
        "The Blue Jays lost 11-5 Thursday, finishing a four-game sweep at Boston and stretching their skid to a season-worst five straight. Pittsburgh fell at Tampa Bay 3-2 to get swept in three games and reach a season-worst four losses in a row.In the tight American League East where every team is above .500, Toronto saw the Red Sox leapfrog into third place. In the three games, the Blue Jays got outscored 32-19 and outhit 58-32 and made six errors.The bullpen seemed beleaguered, and Toronto manager John Schneider pointed to the help his team needed from the relievers as a problem in the series.\"It's tough to line things up properly,\" Schneider said of his bullpen. \"A week ago, we were talking about how good our starters were and how deep they were going into games. It will ebb and flow.\"One of those relievers, Zach Pop, left Thursday's game because of right hamstring discomfort.\"It didn't look great,\" Schneider said.Pittsburgh, one of four teams with at least 20 wins, has been one of the surprises of the season in what is supposed to be a rebuilding year.Dropping three in a row to the Rays, the top team in baseball, is not going to drop their spirits, the Pirates insist.",
        "\"I don't think there's any panic going on. It's just kind of how baseball goes, the ebbs and flows of it,\" Pittsburgh outfielder Bryan Reynolds said.\"We just have to get back to our kind of baseball -- work the counts, get on base, steal, timely hitting, that kind of stuff.\"The Pirates were outscored in the three-game sweep 15-4.\"I don't think much changes, but it's just a little bit of a wakeup call,\" Pittsburgh outfielder Connor Joe said. \"We know we're a good team, and we are still a good team. But there's work to be done.\"While it won't directly affect the Toronto series, the Pirates took potentially a blow Thursday when starter Vince Velasquez left after three innings because of right elbow discomfort.\"I kind of lost velocity throughout the third. I knew I had to say something,\" Velasquez said. \"I could have kept going, but it was uncomfortable at the end.\"In the series opener, Toronto right-hander Chris Bassitt (3-2, 5.18 ERA) is scheduled to oppose Pittsburgh left-hander Rich Hill (3-2, 4.18 ERA).Bassitt did not get a decision his last time out, Sunday against Seattle. He gave up four runs and two hits in five innings.In three career starts against Pittsburgh, Bassitt is 2-0 with a 2.00 ERA with 24 strikeouts and five walks. While with the Mets last season, he faced the Pirates twice, allowing one run in 13 innings, with eight hits, 18 strikeouts and three walks.",
        "Hill has won three straight starts, most recently giving up three runs, two of them earned, and eight hits in 6 1/3 innings with five strikeouts and no walks Saturday at Washington.Against the Blue Jays, Hill is 1-2 with a 4.96 ERA in 13 career games, six of them starts.--Field Level Media"
    ]
}