{
    "articleURL": "/sport/othersports/article-12041937/British-Cycling-BAN-transgender-athletes-female-races-male-born-cyclists-victory.html",
    "content": [
        "Killips secured an overall victory in the recent Tour of the Gila in New MexicoThe UCI allows male-born riders to compete if they have reduced testosteroneBut those rules have come in for criticism after Killips prevailed in a female race British Cycling could be the next governing body to ban transgender women from competing in female events when they publish their new policy later this month.",
        "The sport's world governing body, the UCI, currently allows male-born riders to race in the women's category if they have reduced their testosterone levels over a two-year period.Those rules have come in for criticism this week after American trans woman Austin Killips won the Tour of the Gila in the USA at the weekend.British Cycling's own participation policy has been suspended since last April following the row over Welsh trans rider Emily Bridges, who was due to race against Laura Kenny before she was blocked.However, they are due to update their rules in the coming weeks following a review - and could take the lead of other sports in stopping trans women being able to ride in the women's category, while making the men's category 'open'.",
        "British Cycling declined to comment.Killips finished 89 seconds clear of Italian Marcela Prieto in the general classification at the Tour of the Gila and also claimed the Queen of the Mountains jersey.The 27-year-old American was able to compete in the female field under the UCI’s current policy, which allows trans women to participate as long as their testosterone levels have been below 2.5 nanomoles per litre for at least 24 months.Cycling’s participation policy remains more relaxed than that of athletics and swimming, where all trans women are banned from competing in the female category at an elite level.",
        "Commenting on the Killips case, former British Olympic swimmer Sharron Davies told Mail Sport: ‘This is beyond disappointing. Those in charge should hang their heads in shame. The UCI is not fit for purpose.’Ex-Canadian world champion cyclist Alison Sydor tweeted: ‘The current UCI rules that allow males to compete in female cycling events are not fair to female athletes.‘Time for UCI to admit this current rule situation is unsustainable and leaving a black mark on cycling as a fair sport for females.’"
    ]
}