{
    "articleURL": "/wires/reuters/article-12055639/TJ-Friedl-drives-4-Reds-rally-beat-White-Sox.html",
    "content": [
        "TJ Friedl homered, tripled and drove in four runs to lead the Cincinnati Reds to a 5-3 victory over the visiting Chicago White Sox on Saturday night.",
        "Jonathan India reached base four times on three hits and a walk and had three runs for the Reds. The bullpen gave up just two hits in 5 1/3 scoreless innings as Cincinnati won for just the second time in the last six games.Hanser Alberto and Seby Zavala hit solo homers for Chicago, which lost for the second time in its past six games.The White Sox played without Eloy Jimenez, who was hospitalized Saturday morning due to abdominal pain.Derek Law (2-4) entered in the fourth inning and pitched 2 1/3 innings of hitless relief for the Reds. Ian Gibaut followed by allowing one hit over two scoreless innings, and Alexis Diaz worked the ninth for his sixth save.Diaz allowed a one-out single to Tim Anderson, and then induced Andrew Vaughn to bounce into a game-ending double play.Chicago's Mike Clevinger (2-3) gave up four runs and six hits over six innings. He struck out seven and walked one while falling to 0-3 over his last five starts.Cincinnati left-hander Nick Lodolo allowed three runs and six hits -- including two homers -- over 3 2/3 innings. Lodolo, who struck out three and walked one, has served up 10 homers in just 34 1/3 innings.Cincinnati trailed 3-1 before Friedl's go-ahead blast in the fifth.",
        "Curt Casali singled with one out and India walked to bring up Friedl, who capped a seven-pitch at-bat against Clevinger by drilling a fastball over the fence in right center. Friedl's third blast of the season gave the Reds a 4-3 edge.Cincinnati added insurance in the seventh when India singled with two outs against Gregory Santos. Friedl followed with a triple to right to make it a two-run margin.The Reds struck in the first inning when India led off with a single, stole second and scored on Spencer Steer's single to left.The White Sox tied the game in the second when Alberto smacked a 1-2 curveball from Lodolo over the fence in left. The homer was the second of the season for Alberto.Chicago moved ahead with two outs in third as Luis Robert Jr. was hit by a pitch, moved to second on Yasmani Grandal's single and scored on Andrew Benintendi's double to right.The White Sox increased the lead to 3-1 when Zavala led off the fourth by hitting a 1-2 fastball from Lodolo over the left field fence for his second homer of the season.--Field Level Media"
    ]
}