{
    "articleURL": "/wires/ap/article-12060065/Driver-deadly-Texas-crash-charged-manslaughter.html",
    "content": [
        "BROWNSVILLE, Texas (AP) - An SUV driver who killed eight people when he slammed into a group waiting at a bus stop in Brownsville, Texas, was charged with manslaughter, police said Monday as investigators tried to determine if the crash was intentional.",
        "Authorities believe driver George Alvarez, 34, of Brownsville, lost control after running a red light Sunday morning, and plowed into a crowd outside a migrant center in the city, which has long been an epicenter for migration across the U.S.-Mexico border.Police Chief Felix Sauceda said Alvarez was charged with eight counts of manslaughter and 10 counts of aggravated assault with a deadly weapon. Officials are awaiting toxicology reports to determine whether Alvarez was intoxicated, Sauceda said, adding that there was no motive that he could discuss. Asked about reports from witnesses that Alvarez was cursing at them, Sauceda said there was nothing to confirm that yet.The SUV ran a red light, lost control, flipped on its side and hit 18 people, Sauceda told reporters Monday morning. Six people died on the scene and 12 people were critically injured, he said. Officials have said the death toll rose later.Alvarez tried to flee, but was held down by several people on the scene, the police chief said. His bail was set at $3.6 million.Victims struck by the vehicle were waiting for the bus to return to downtown Brownsville after spending the night at the Bishop Enrique San Pedro Ozanam Center, said Sister Norma Pimentel, executive director of Catholic Charities of the Rio Grande Valley. The center is the only overnight shelter in the city and manages the release of thousands of migrants from federal custody.",
        "The victims were all male and several of them were from Venezuela, Sauceda said. The department is working with representatives of Venezuela and other countries. Law enforcement and shelter officials have not made public the identities of the victims killed.Surveillance video from the Ozanam Center showed some of the victims sitting on the curb when they were hit at the bus stop.\"This SUV, a Range Rover, just ran the light that was about 100 feet (30 meters) away and just went through the people who were sitting there in the bus stop,\" said shelter director Victor Maldonado, who reviewed the surveillance video.Some people walking on the sidewalk about 30 feet (9 meters) from the main group were also hit, Maldonado said.On Monday morning, Jackson Duarte, 30, a Venezuelan migrant, was sporting a haircut from a friend he made at the Ozanam shelter, where they were both staying. It was the last haircut he´d receive from him.Duarte said three people he met at the shelter were among the victims; two of them died while a third is in the hospital with a missing limb. He said one of his friends who was killed was a barber, and the other was a young man who had recently celebrated a birthday.",
        "Shortly before the crash, Duarte had decided to share an Uber with a friend rather than wait for the bus downtown. It was during that ride that Duarte began receiving messages about the fatal accident through Whatsapp.\"When I got there, the survivors had already been taken. I counted about seven people who had died,\" Duarte recalled.Duarte said his friend, whom he described as a studious and ambitious young man, was going downtown to reunite with his mother after crossing the border. Only Duarte made it to the bus station.\"Unfortunately, I had to share that with his mom,\" Duarte said. \"She was desperate, because her son had just turned 18 years old and they had gone through so much trying to get here just so that he´d lose his life here.\"Duarte´s other friend, the barber, was also heading downtown to look for a cellphone after raising money by offering haircuts, he had told Duarte.Duarte said his friend told him \"We'll see each other in a bit,\" and that it was one of the last things his friend said to him.\"It hit me really hard. I still feel bad. I don´t believe it. I don´t feel well. I couldn´t sleep all night,\" Duarte said, breaking down as he thought about his friends who lost their lives.",
        "Jesus Ferrer, 32, was standing in line with a group of migrants, including some friends when they noticed one of the vehicles driving in their direction.\"We were in line at the bus stop when we spotted a grey SUV that was coming at full speed. It came toward us and veered toward us,\" he said.The driver tried to run away after the vehicle came to a stop, but Ferrer said he was pat of the group that restrained him.\"'Go back to your country,'\" Ferrer recalled the driver telling the group after they confronted him. \"He was furious.\"Cameron County Judge Eddie Trevino, the highest-elected official in the county that includes Brownsville, said the community is mourning.\"The indications are this was just a terrible, tragic accident,\" Trevino said. \"And regardless, whether it was intentional or accidental, it doesn´t matter. Those now eight individuals that lost their lives and the other 10 that are hospitalized, we´re praying for them and for their families.\"The Ozanam center remains at capacity, but there are plans to expand the number of sleeping spaces from 250 to 380 a night. During the day, migrants are free to seek employment to pay bus fare or plane tickets that cost hundreds of dollars.\"They stand here at seven in the morning,\" Victor Maldonado, executive director of the Ozanam shelter, said Monday. \"They get picked up to go do odd jobs, paint, cut yards - they get their money and they move on.\"",
        "Brownsville has seen a marked increase of Venezuelan migrants over the last two weeks for reasons that aren't yet clear, authorities said. The recent increase in the number of migrants prompted Brownsville commissioners to indefinitely extend a declaration of emergency during a special meeting last week.Roughly 30,000 migrants, mostly from Venezuela, have entered the U.S. in the region since mid-April. That´s compared with 1,700 migrants Border Patrol agents encountered in the first two weeks of April."
    ]
}