{
    "articleURL": "/wires/aap/article-12049769/Kane-Richardson-left-Queenslands-state-list.html",
    "content": [
        "Kane Richardson is free to ply his trade as a Twenty20 gun for hire after the Australian white-ball quick was left off Queensland's state contract list.",
        "Part of Australia's team in their final Twenty20 international against Afghanistan last summer, Richardson was the notable omission from the Bulls' contract list for next summer.The 32-year-old moved from South Australia to Queensland at the start of last season, but was limited to two 50-over matches and did not feature in the Sheffield Shield.The seamer can still be picked for the Bulls but his lack of a contract means there is nothing stopping him pursuing T20 options overseas during the early and later parts of the summer.One-time Australia one-day player Sam Heazlett has also been left off the Bulls' list, along with batter Sam Truloff and bowler Matthew Willans.\"The four players going off the list certainly remain in our selection plans,'' Queensland high performance boss Bennett King said.\"Each of them has had the chance for in-depth discussions with our coaching staff and selectors about where things sit leading into the coming season and what we will be looking for from them in premier cricket.\"Richardson remains contracted to the Melbourne Renegades for next summer.The news all but kills off any limited hope Richardson had of returning to Australia's one-day side, for whom he has not added to his 25 matches since 2020.He has been a constant in the T20 team since then, but Australia do not play another match in the format until August in South Africa, and it remains to be seen if he will be part of the national squad's plans ahead of the 2024 World Cup.",
        "Richardson has previously played in the Indian Premier League and England's The Hundred competition, but his spare time through the summer will free him up for more franchise cricket.Elsewhere, South Australia have named a largely unchanged contract list with Victorian Jake Fraser-McGurk joining the Redbacks after Jake Weatherald moved to Tasmania."
    ]
}