{
    "articleURL": "/sport/cricket/article-12054151/Aussie-star-dismisses-Stuart-Broads-claims-2021-Ashes-void-Covid-19-restrictions.html",
    "content": [
        "Stuart Broad said the 2021 Ashes series is 'void' in his mindMarcus Harris dismissed claims conditions were favourable to AustraliaAustralia thrashed England 4-0 at home to retain the Ashes Australian opener Marcus Harris has dismissed Stuart Broad's claims the 2021 Ashes series was 'void', insisting England's mind-games did not worry the tourists.",
        "Australia's quest to win the Ashes in England for the first time in 21 years begins at Edgbaston on June 16, but Broad has already fired the starting gun on the war of words between the teams. Speaking to Mail Sport last month, the veteran seamer said he did not consider the 2021 Ashes series in Australia - in which the home side triumphed 4-0 - a 'real series' because of the circumstances dictated by the Covid-19 pandemic.'In my mind I don't class that as a real Ashes,' he said. 'The definition of Ashes cricket is elite sport with lots of passion and players at the top of their game. ",
        "'Nothing about that series was high level performance because of the Covid restrictions. The training facilities, the travel, not being able to socialise. I've written it off as a void series.' But Harris, who averaged 29.83 in seven innings during the series, batted away the claims and noted conditions were as demanding for Australia as they were for England.While the tourists faced restrictions, Pat Cummins missed the second Test in Adelaide after being deemed a close contact and Travis Head had to sit out the New Year's Day Test after contracting Covid.'I understand it was tough for us and we were at home, so I couldn’t imagine what it was like being overseas,' he told CODE Sports.",
        "'I think the less said on our behalf the better throughout this series. Covid was challenging for everyone. 'I remember at the time with all the Covid rules and the bubbles, we were starting days’ play late because people had been a close contact or whatever.'I can understand how those guys didn’t really enjoy how strict our rules were. It was a challenge but it was the same for everyone at that stage.'While Broad's comments went down like a lead balloon in Australia, Harris said the remarks were a throwback to the days when both sides were not afraid of lobbying verbal grenades at each other.",
        "That approach has long gone out of fashion, with players happy to keep to themselves ahead of the Ashes.'He’s quite happy to have his opinions and say what he thinks; but that’s good, I think we need more of that in cricket,' he said.'I think so many blokes are like robots now, too afraid to say anything, at least he’s willing to stir a bit of shit up or say something that people might disagree with.'Few players relish the Ashes cauldron as Broad, who has taken 131 wickets in the contest - the most for an Englishman and the fourth-highest total behind Shane Warne, Glenn McGrath and Hugh Trumble."
    ]
}