{
    "articleURL": "/wires/aap/article-12049405/Government-employee-stabbed-customer-service-centre.html",
    "content": [
        "A 37-year-old man has been charged after allegedly stabbing a public servant in an unprovoked attack at a customer service centre in Sydney's CBD.",
        "The victim, a 54-year-old man, suffered lower back, chest and shoulder wounds during the attack at Haymarket about 9.20am on Friday.He remained in intensive care surrounded by family late on Friday.His alleged attacker, who was \"well known\" to police, entered a Service NSW centre, had a short conversation with the man and then produced a knife without provocation, police said.He has since been charged with wounding a person with the intent to cause grievous bodily harm.Customer Service Department secretary Emma Hogan said the man had surgery in hospital and was in a stable condition with his family in intensive care.\"Our staff deserve to go home safely,\" she said on Friday.\"We are a tight team ... we are all devastated by this morning's event.\"The stabbed man's colleagues detained the 37-year-old alleged attacker before he was taken from the scene by police.Ms Hogan said an ambulance crew arrived within minutes.Detective Superintendent Martin Fileman said the man had a medical assessment before he was charged.Forensic police were seen closely examining the building, which will be closed for the weekend.\"The welfare of our staff is our highest priority. Every possible support will be made available for this staff member and his family,\" the department said.",
        "\"All other staff at the centre are being offered counselling and support.\"Premier Chris Minns described the attack as horrifying.\"The thoughts of our government and our state are with this worker and their family at what is no doubt a very difficult time,\" he tweeted.Opposition Leader Mark Speakman said he was shocked by the stabbing attack on a frontline worker.\"Nobody deserves to be harmed while doing their job serving the public,\" he tweeted on Friday afternoon.\"Thank you to the first responders who provided assistance. Wishing for a quick recovery.\"The man charged over the attack has been refused bail and is due to appear at Parramatta Local Court on Saturday."
    ]
}