{
    "articleURL": "/wires/ap/article-12056859/Vida-Blue-led-Oakland-3-World-Series-titles-dies-73.html",
    "content": [
        "Vida Blue, a hard-throwing left-hander who became one of baseball´s biggest draws in the early 1970s and helped lead the brash A´s to three straight World Series titles before his career was derailed by drug problems, died Saturday, according to the team. He was 73.",
        "Blue died at a hospital in San Francisco's East Bay area of medical complications stemming from cancer, the Oakland Athletics said. Blue had used a walking stick to assist his movement at a 50th anniversary of the 1973 A's championship team on April 16.\"He was engaging. He was personable. He was caring,\" ex-teammate Reggie Jackson said during an interview with The Associated Press on Sunday. \"He was uncomfortable with the crowd.\"Blue was voted the 1971 American League Cy Young Award and Most Valuable Player after going 24-8 with a 1.82 ERA and 301 strikeouts with 24 complete games, eight of them shutouts. He was 22 at when he won MVP, the youngest to win the award. He remains among just 11 pitchers to win MVP and Cy Young in the same year.Blue finished 209-161 with a 3.27 ERA, 2,175 strikeouts, 143 complete games and 37 shutouts over 17 seasons with Oakland (1969-77), San Francisco (1978-81, 85-86) and Kansas City (1982-83). He appeared on the Hall of Fame ballot four times, receiving his most support at 8.7% in 1993, far short of the 75% needed.\"That Hall of Fame thing, that´s something that I can honestly, openly say I wish I was a Hall of Famer,\" Blue told The Washington Post in 2021. \"And I know for a fact this drug thing impeded my road to the Hall of Fame - so far.\"",
        "A six-time All-Star and three-time 20-game winner, Blue helped pitch the Swingin´ A´s, as Charley Finley´s colorful, mustachioed team was known, to consecutive World Series titles from 1972-74. Since then, only the 1998-2000 New York Yankees have accomplished the feat.He became the first pitcher to start the All-Star Game for both leagues, opening for the AL in 1971 and `75 and the NL in ´78.\"I remember watching a 19-year-old phenom dominate baseball, and at the same time alter my life,\" Dave Stewart, a four-time 20-game winner for the A´s a generation later, wrote on Twitter. \"There are no words for what you have meant to me and so many others.\"Jackson was shocked by how much weight Blue had lost when he saw him at the 50th reunion.\"I did not recognize him,\" Jackson said. \"I was shattered. I was shaken. That will stick with me the rest of my life.\"Selected by the then Kansas City Athletics on the second round of the 1967 amateur draft, Blue made his big league debut with Oakland on July 20, 1969, about a week shy of his 20th birthday. He made four starts and 12 relief appearances, then spent most of 1970 at Triple-A Iowa.Called up when rosters expanded, he pitched a one-hit shutout at Kansas City in his second start. In his fourth start, Blue pitched a no-hitter against Minnesota on Sept. 21, at 21 years, 55 days that made him the youngest pitcher to throw a no-hitter since the live ball era started in 1920.",
        "\"There are few players with a more decorated career than Vida Blue,\" the A´s said in a statement. \"Vida will always be a franchise legend and a friend.\"He held out after his MVP season and signed a $50,000 one-year deal. Blue didn´t make his first start of 1972 until May 24 and went 6-10, mostly out of the bullpen. From 1973-76, he went 77-48 but his career World Series record was 0-3.In 1975, he pitched the first five innings of a no-hitter against the California Angels, but was pulled early by manager Alvin Dark to rest him for the playoffs in a game finished by Glenn Abbott, Paul Lindblad, and Rollie Fingers.Blue was among the players who assumed leadership roles on the A's and clashed with Finley.\"We were very young kids,\" Jackson said Sunday. \"Vida was from Louisiana and Black, and me being Black, being Black in a white league and a white world, was very impactful as to how you handled yourself, how you acted, because you were always colored first.\"Finley attempted in June 1976 to trade Blue to the New York Yankees for $1.5 million and Joe Rudi and Rollie Fingers to the Boston Red Sox for $1 million each. Kuhn vetoed the deals under the commissioner´s authority to act in the \"best interest of baseball.\" In December 1977, Kuhn stopped Finley from trading Blue to Cincinnati for $1.75 million and minor league first baseman Dave Revering.",
        "Blue was traded to the Giants the following March in a deal that brought Oakland seven players, including outfielder Gary Thomasson and catcher Gary Alexander.Blue was dealt to the Royals in March 1982 and released in August 1983. He was ordered that December to serve three months in federal prison and fined $5,000 for misdemeanor possession of approximately a tenth of an ounce of cocaine. Blue was sentenced to one year in prison but U.S. Magistrate Judge J. Milton Sullivant suspended the majority of the term.Blue didn´t play in 1984 and was suspended that July 26 by Major League Baseball through the remainder of the season for illegal drug use.He returned to baseball with the Giants for two seasons starting in 1985. Blue was among the players ordered by baseball Commissioner Peter Ueberroth in 1985 to be subject to random drug testing for the rest of their careers.After his 2005 arrest in Arizona on suspicion of DUI for the third time in less than six years, Blue was sentenced to six months in jail after failing to complete his probation. But he was told he could avoid incarceration by spending time in a residential alcohol treatment program.___AP Baseball Writer Janie McCauley contributed to this report.",
        "___AP MLB: https://apnews.com/hub/MLB and https://twitter.com/AP_Sports"
    ]
}