{
    "articleURL": "/wires/afp/article-12055609/Biden-Republicans-meet-Tuesday-thwart-default-disaster.html",
    "content": [
        "Washington's power brokers love playing chicken. But the rest of the world will watch in dread Tuesday when President Joe Biden and Republican leaders meet to negotiate the US debt ceiling -- praying that one side finally blinks.",
        "The White House summit between Biden, House Speaker Kevin McCarthy and Senate Republican leader Mitch McConnell sets in motion the deciding round of a power struggle whose outcome will impact the global economy and could upset the 2024 US presidential election.The immediate issue is raising the debt ceiling, an arcane budgeting procedure that most years passes with little controversy. Basically, the US government always spends more than has been budgeted but, unlike in most countries, then requires congressional approval to borrow extra.This year, McCarthy and his radicalized right-wing party have decided to say no, unless Democrats first agree to sweeping budget cuts, giving in to the Republican message that Biden has been profligate and irresponsible.Biden, who will be joined in the White House talks by the Democratic minority leader in the House of Representatives, Hakeem Jeffries, and the Democratic majority leader in the Senate, Chuck Schumer, accuses Republicans of \"hostage\" taking.He insists that the debt ceiling first be raised -- as in other years -- and only then can he and the Republicans discuss cutting the budget to reduce that decades-old accumulated debt, currently the world's biggest at $31 trillion.A dispute over sequencing might sound academic.However, with both sides dug in and the deadline approaching, the debate has turned into a life-or-death test of political strength.",
        "Fail to authorize more borrowing and the government will run out of money and default.Cue worldwide panic.Soaring interest rates, stock sell-offs, Treasury bond downgrades, and near certain US recession will be on the menu -- and that's before factoring in long-term harm to the US geopolitical brand.\"Even getting close to a breach of the US debt ceiling could cause significant disruptions,\" warned a White House analysis. \"An actual breach of the US debt ceiling would likely cause severe damage.\"When is doomsday? No one knows for sure.But US coffers could run dry as early as June 1, according to the Treasury.That's just over three weeks from the Tuesday sit-down.- Huge divide -",
        "As the clock ticks away, the divide appears unbridgeable.The White House is clinging to an \"irrational, reckless\" strategy and Democrats are \"terrified\" about allowing \"clueless\" Biden to negotiate, tweeted the Freedom Caucus -- the group of hard-right Republicans effectively controlling the razor-thin Republican majority in the House.Biden is not budging.A strong economic recovery from the Covid era is one of Biden's main cards in his bid for a second term next year. So the 80-year-old has all the more reason to steer the country clear of crisis.Yet he's also adamant about not caving into the Republican attempt to link budget negotiations to the debt ceiling, saying this will transform a basic, fundamental obligation into a political football.",
        "\"They're trying to hold the debt hostage to (get) us to agree to some draconian cuts,\" he told advisors Friday.Biden repeated one of his favorite stats, noting that Republicans had voted, without imposing any conditions, to extend the debt ceiling three times during the presidency of Republican Donald Trump.\"No one's ever not voted to increase the debt limit.\" he said. \"I'm going to reiterate to congressional leaders that they should do what every other Congress has done -- that is, pass the debt limit, avoid the default.\"Analysts say there are several potential exit ramps from imminent default.The two sides could simply punt, extending the debt ceiling for a few weeks, while talks continue.They could come to a messy compromise that resolves the issue by promising yet-to-be-determined budget cuts, but condemning the nation to repeat the whole drama in an election year.Failing all else, the White House has not ruled out invoking a constitutional power to bypass Congress altogether and unilaterally authorize more borrowing -- except this would likely be challenged in court.\"I've not gotten there yet,\" Biden said late Friday in an MSNBC interview on use of the 14th Amendment.Short of an unexpected political truce, however, there are no easy options.And while much of the world looks on nervously, some countries are watching in glee, the Biden administration warns.",
        "\"They love to see chaos in the American system,\" White House budget director Shalanda Young said, referring to China and Russia. \"They love to see that we can't do our basic jobs.\""
    ]
}