{
    "articleURL": "/wires/reuters/article-12057809/Denny-Hamlin-nips-Kyle-Larson-late-Cup-Series-win-Kansas.html",
    "content": [
        "Denny Hamlin stormed around Kansas Speedway in his Joe Gibbs Racing Toyota, clipped leader Kyle Larson on the last lap and won Sunday's AdventHealth 400 NASCAR Cup Series race in Kansas City, Kan.",
        "On the hottest race day of the season -- 89 degrees -- Larson tried to close out his third win of the year, but he couldn't hold off Hamlin's charge in the No. 11 Camry over the last five laps.After running third over much of the final 50 laps, Hamlin caught Larson off Turn 2 after taking the white flag and tapped the No. 5 Chevrolet on the backstretch.That turned Larson's Camaro into the wall. Hamlin then roared away to his first win since Charlotte's 600-miler last Memorial Day weekend and the fourth time of his career at Kansas.The victory was the 49th of the 42-year-old Hamlin's career.Polesitter William Byron finished third followed by Bubba Wallace and Ross Chastain in a race that featured the most lead changes in a 400-miler in NASCAR history.After winning the 10th pole of his 192 career starts and second this season, Hendrick Motorsports' Byron paced the field for the first time from the top starting position at the 1.5-mile track, with teammate Larson beside him in the 36-car group.However, Byron's No. 24 Chevrolet got loose off Turn 2, and though he was able to collect it he quickly lost the lead. Tyler Reddick created the first caution on Lap 5 when he clipped Larson's No. 5 Chevy while exiting Turn 4.",
        "Riding momentum following Monday's victory at his home track at Dover, Del., Martin Truex Jr. led 35 circuits in the first stage. But teammate Hamlin passed him in the closing laps to earn the segment's bonus points.Stage 2 was hectic at the end with Christopher Bell and Kyle Busch slamming the inside wall in separate incidents. Joey Logano stayed out on old tires and found his way up front, beating Michael McDowell for the bonus points.--Field Level Media"
    ]
}