{
    "articleURL": "/wires/aap/article-12056375/North-Melbournes-Tarryn-Thomas-closer-AFL-return.html",
    "content": [
        "North Melbourne coach Alastair Clarkson is hopeful Tarryn Thomas will make an AFL comeback \"pretty soon\" following the utility's return to action at state-league level.",
        "Thomas was sent to the Kangaroos' VFL program last month while working part-time for a cleaning business and taking part in a respectful behaviour program.The 23-year-old's career has been hanging in the balance since he was stood down by the club for a second time in March amid concerns over his behaviour towards women.Thomas took a step towards an AFL return on Sunday, gathering 18 disposals in the Kangaroos' VFL win over Sandringham.\"He performed well in his first game back ... so he's just building his match fitness,\" Clarkson said.\"He's got another week in the VFL program, I'm led to believe, and then he'll be back in the AFL program.\"Once he's back in the AFL program we'll just see what his fitness level and match conditioning is like.\"If he continues to do what we require him to do then hopefully he'll be available for selection pretty soon.\"North Melbourne chief executive Jennifer Watt and football boss Todd Viney have been tracking Thomas' progress away from football and will make the call on when the player is allowed to return to the Kangaroos' AFL group.\"I've seen very little of Tarryn since he's been out of the AFL program and that will hopefully ramp up a little bit next week,\" Clarkson said.",
        "\"Once he gets back into it, I'll just more or less focus on his footy and what he needs to do there.\"The footy side of it, for mine, is what his fitness base is like and how many games does he need to play to get cherry ripe to be able to play senior AFL footy.\"We'll make that determination and the rest of the stuff Jen and Todd will look after off to the side.\"Thomas was charged in January with threatening to distribute an intimate image and faced court in March. The case will return to the Broadmeadows Magistrates Court on July 18.In February, Thomas faced two counts of violating a court order but those charges were subsequently dropped.In March, North were made aware of further allegations of inappropriate behaviour, which they reported to the AFL's integrity unit.Last month, North fined Thomas $5000 and made him donate a further $5000 to a road safety charity for a video he posted to social media that showed him behind the wheel of his drifting Mercedes with his feet on the dashboard.He is also due to face court later this year on an unrelated charge of driving with a suspended licence."
    ]
}