{
    "articleURL": "/news/article-12051697/An-evening-Palace-Charles-big-day.html",
    "content": [
        "Follow MailOnline's new Royals channel for all the latest news and updates on the Royal Family The Princess of Wales shone on Friday evening as she joined the King, foreign royals and global leaders for a glamourous reception at Buckingham Palace ahead of Charles' historic Coronation ceremony at Westminster Abbey on Saturday - but royal fans were left wondering where Queen Camilla was after she missed the event, as well as an earlier walkabout on the Mall. ",
        "Kate appeared relaxed and at ease as she shared jokes with guests, seeming to particularly hit it off with Crown Princess Mary and Crown Prince Frederik of Denmark before greeting the US First Lady Jill Biden.King Charles was seen deep in conversation with the First Lady of Ukraine, President Zelensky's wife Olena Zelenska. She will represent Ukraine at the Coronation while her husband remains at home, leading efforts against Putin's illegal invasion. She is joined by Prime Minister of Ukraine, Denys Shmyhal.Kate's husband Prince William and Prince Edward were also on hand to greet guests as final preparations get underway for tomorrow's ceremony - but Buckingham Palace insisted to MailOnline that the King had always been scheduled to host the event himself when asked about Camilla's absence.Some 100 heads of state will be in London for the event, with international representatives from 203 countries due to attend. Other European royals are enjoying the King's reception at Buckingham Palace, including Prince Albert II and Princess Charlene of Monaco, Queen Letizia of Spain, Mary, Crown Princess of Denmark and Crown Prince Frederik of Denmark and Crown Prince Haakon and Crown Princess Mette-Marit of Norway.Jill Biden, who was pictured alongside Kate and Mrs Zelenska of Ukraine, is representing her husband, US President Joe Biden, along with her granddaughter Finnegan Biden.",
        "King Charles was pictured smiling and laughing with foreign dignitaries and the royal families of Europe as guests embarked on a night of celebration ahead of the Coronation Ceremony on Saturday.The Prince and Princess of Wales were also in attendance, having earlier completed a walkabout at The Mall for royal superfans with His Majesty.Kate stole the show at the reception as she beamed and dazzled guests in an elegant blue number. But fans of the royals were left wondering where the Queen Consort was on the eve of the Coronation after she was noticeably absent from both the reception and her husband's meet and greet with those camped out outside the Palace.One royal watcher wrote on social media: 'Where is HM Queen Camilla tonight?'A second replied: 'Where has she been all day? That is a bit worrisome.'Another fan speculated the Queen was 'sitting oddly' on her way to Coronation rehearsals on Friday, adding: 'Hope she is ok, whatever happened. Poor thing. What timing.'But when asked about the Queen's whereabouts by MailOnline, a spokesperson for Her Majesty's press office said organisers had 'always planned' for the King to host the reception. ",
        "Queen Camilla was seen departing Buckingham Palace with King Charles III this morning for final Coronation rehearsals at Westminster Abbey ahead of tomorrow's ceremony.But concerned fans took to social media to point out they had not seen her since, despite the King being photographed at engagements throughout the day.She did not appear to accompany him to meet Commonwealth leaders, and was also absent from a walkabout on The Mall and tonight's Coronation reception. One royal watcher wrote on social media: 'Where is HM Queen Camilla tonight?'A second replied: 'Where has she been all day? That is a bit worrisome.'Another fan speculated the Queen was 'sitting oddly' on her way to Coronation rehearsals on Friday, adding: 'Hope she is ok, whatever happened. Poor thing. What timing.'But when asked about the Queen's whereabouts by MailOnline, a spokesperson for Her Majesty's press office said organisers had 'always planned' for the King alone to host the reception.",
        "Cleaning staff at Buckingham Palace were pictured vacuuming the notorious steps to the entrance ahead of tonight's high-profile arrivals. Earlier, Charles met leaders from the Commonwealth of Nations, the voluntary associations of 56 countries which he also heads, and held a lunch for prime ministers and royal representatives from the 14 other realms where he is head of state, including Australia and Canada. Also arriving at Buckingham Palace this evening are government figures including the Foreign Secretary James Cleverly and Prime Minister Rishi Sunak. Queen Letizia of Spain, France's President Emmanuel Macron, the Presidents of Germany and Italy, Frank-Walter Steinmeier and Sergio Mattarella, and Pakistan's Prime Minister Shehbaz Sharif will also be among those in Westminster Abbey on Saturday. Chinese Vice-President Han Zheng, who presided over a civil liberties crackdown in Hong Kong, is also on the King's guest list, a move described as 'outrageous' by Conservative MPs. The Foreign Secretary said he broached areas of 'deep disagreement' during a meeting with the Chinese vice-president in London.James Cleverly said he 'made plain' the UK's position on Hong Kong, Xinjiang and Taiwan during talks on Friday with Han Zheng ahead of the coronation.The Chinese politician, who has been blamed for overseeing a crackdown on freedom in Hong Kong, was recently appointed as President Xi Jinping's deputy and is set to represent China at the royal event on Saturday.",
        "Conservative MPs have criticised the UK Government's decision to invite Mr Han due to his previous role in Hong Kong.It also comes at a time of increasingly fractious relations between London and Beijing, with a vocal section of Tory backbenchers calling for the UK to become more hawkish towards China due to security concerns.Ministers updated the UK's integrated review on foreign and defence policy in March, describing China under Communist Party rule as representing an 'epoch-defining and systemic challenge' to almost every aspect of Government policy and the everyday lives of British people.Mr Cleverly, writing on Twitter on Friday, said: 'Engagement with China means discussing areas of deep disagreement and vital co-operation.'Today with VP Han Zheng, I made plain the UK's views on Hong Kong, Xinjiang and Taiwan. We also discussed working together on climate change, economic ties and people-to-people links.'Mr Sunak has already met with many world leaders today as he discussed climate change, trade and sporting rivalry in a series of meetings ahead of the King's coronation.The calendar of pre-coronation diplomacy, which came amid a difficult set of local election results for Mr Sunak, saw the Australian and New Zealand prime ministers, the Emir of Qatar and Brazilian President Luiz Inacio Lula da Silva arrive in Downing Street for separate meetings with the PM.",
        "Climate change and trade talks dominated discussions, while the war in Ukraine also featured as Mr Sunak held the series of short engagements over the course of Friday.Australia's Anthony Albanese said that the relationship between the two countries had 'never been stronger', while New Zealand's Chris Hipkins praised ties as 'the best it has been in a long time'.Mr Albanese, who spoke to reporters after the head-to-head, stressed the value of the recently agreed UK-Australian free trade deal and looked ahead to it coming into force at the end of the month.He praised the 'opportunities that presents for Australian businesses to have growth here in the UK and also, consequently, UK businesses to have growth in Australia'.Mr Albanese said the two leaders also discussed how 'people-to-people relations' could be 'expanded', referencing working holiday visas.He said the two men also discussed 'co-operation on climate change'.He added: 'Both governments believe there are enormous economic opportunities to be seized from action on climate change and, of course, our co-operation in the Indo-Pacific.'He praised, too, the 'bipartisan' nature of climate action in the UK, adding: 'It should be in Australia as well.'Mr Albanese also added he was glad the free trade deal has been completed in time for the King's coronation, which he called a 'historic event of enormous significance'.",
        "The pair also exchanged jokes about the sporting rivalry. This summer's Women's World Cup, hosted by Australia and New Zealand, as well as the upcoming Ashes series, both got mentions as Mr Albanese said that star striker Sam Kerr would help Australia 'bring it home'.Mr Sunak replied: 'I'm sure the Lionesses may have something to say about that.'",
        "Later, Mr Sunak and Mr Hipkins met over a plate of sausage rolls and tomato ketchup as the UK Prime Minister said that the 'friendship and partnership between our countries is as strong as ever'.The New Zealand leader, who stopped to chat to reporters after he left the meeting, said: 'We discussed a range of areas in which New Zealand and the UK have mutual interests, that was a very positive conversation.'He said the pair discussed the implementation of the free trade agreement between the countries, calling it a 'significant milestone and a significant future opportunity for us to grow trade between both of our countries'.The meeting between Sheikh Tamim bin Hamad Al Thani and Mr Sunak saw the Prime Minister stress the 'close partnership' on issues such as the war in Ukraine and regional security, while the Qatari leader spoke of the importance of last year's World Cup, saying the country was 'very proud' of the success of the footballing competition.In a statement, following the meeting with the emir, a Downing Street spokesman said: 'The leaders discussed the exciting opportunities to deepen co-operation between our two countries, including through greater investment in strategic industries such the partnership between Qatar and Rolls-Royce to invest in ground-breaking green engineering projects.'They highlighted the unique joint RAF squadrons operating in Qatar and committed to further develop our defence co-operation.",
        "'Turning to international affairs, the leaders shared their deep concern at the unfolding conflict in Sudan. They stressed the importance of diplomatic efforts to facilitate talks between the parties, to end the violence and transition to a civilian-led democratic government.'The Prime Minister also welcomed Qatar's principled support for Ukraine in the face of Russia's invasion and they agreed our governments would continue to work together to support Ukraine's defence and recovery.'Amnesty International UK criticised Mr Sunak for his meeting with Sheikh Tamim.Allan Hogarth, the group's head of policy and government affairs, said that the Prime Minister should have used the meeting 'as an opportunity to press him over the unfinished business of compensating thousands of migrant workers who were systematically exploited in Qatar in the run-up to the World Cup'.He added: 'The PM should be using what he calls the UK's great partnership with Doha to insist that Qatar abolishes its disgraceful anti-LGBTQ+ laws, as well as lifting unacceptable restrictions on free speech and on women's rights.'The final meeting of Friday saw Mr Lula da Silva arrive in Downing Street, where he was greeted by crowds of supporters and protesters at the gates.Mr Sunak joked to the left-wing leader that he hoped their conversation would be 'less fierce than the competition between England and Brazil on the football field recently', as he announced UK investment in the Brazilian Amazon Fund to prevent deforestation.The Brazilian president, who spoke through a translator, told the Prime Minister that his presence in the UK was not just for the coronation but to 're-establish normal relations'.Apparently referring to his controversial predecessor Jair Bolsonaro, he said that this meeting was part of Brazil's 'comeback'.'This is Brazil's comeback in its relations with the world,' he said.He said the country 'isolated itself' in recent years, but said that Brazil wanted to come back and have discussions on trade.Focusing too on climate change, he stressed the need for rich countries to support poorer nations' efforts to prevent deforestation.The King earlier went on a surprise walkabout in The Mall meeting royal fans with the Prince and Princess of Wales, shaking dozens of outstretched hands and laughed when one man asked if he was 'nervous for tomorrow', while another royal fan with a strong accent said: 'Love you, I'm from Italy,' and a third told the King, 'Good luck for tomorrow'.Royal superfans who have been sleeping along the route all week were left blown away by the visit, which came just hours after a downpour soaked thousands of people camped out at The Mall, with one person telling Sky News: 'This is the happiest moment in my life.'Royal fan Joan, 70, told MailOnline that she was left in tears. She said: 'Charles stepped out of the car and walked towards us and he said 'has anybody over-nighted'? And he was shaking a few hands and I said 'yes, I did' and he looked and he could see that my hair is really sticking up, and yes I am sleeping on the pavement.'He leaned forward purposefully and shook my hand, and it was just so beautiful - I am proud of being here today. Very emotional - I burst into tears afterwards. I have been here for William's wedding, Harry's wedding, the Jubilee and now I've come for the Coronation. 'I wish himself and Camilla the very best. I think they're both good people. I've been here since Wednesday afternoon, sleeping here. Before I just slept on the pavement but the security people suggested I'd get a tent because it's going to rain.'Charles took a break from a busy schedule of meetings and official engagements, including a final coronation rehearsal at Westminster Abbey, to go on the walkabout which lasted more than 20 minutes with his son and daughter-in-law. Charles automatically became king when his mother Queen Elizabeth died aged 96 in September. The leaders of Australia and New Zealand will pledge their allegiance to Charles at the coronation even though both are life-long republicans who do not shy away from making their positions clear.Preparations for the coronation are nearing their completion with The Mall decorated with huge union flags and others from the Commonwealth and crash barriers and other crowd control measures in place.During the ceremony itself, the St Edward's Crown, which weighs about  4lb 12oz and dates back to 1661 and the reign of his namesake King Charles II, will be placed on Charles' head during the ceremony. Among the other historic items involved will be the golden Sovereign's Sceptre with Cross which holds the 530 carat Cullinan 1 diamond, also known as the Star of Africa and the world's largest colourless cut diamond.After the ceremony there will be a mile-long procession involving some 4,000 military personnel, with the newly-crowned King Charles III and Queen Camilla returning to Buckingham Palace in the four-tonne Gold State Coach, pulled by eight horses.Thousands are expected to line the route and millions more will watch on giant screens erected at 30 locations around Britain or at home, with the event set to be broadcast live around the world."
    ]
}