{
    "articleURL": "/femail/article-12043187/Jennifer-Lopezs-mom-says-knew-daughter-reunite-Ben-Affleck.html",
    "content": [
        "J. Lo's mother Guadalupe Rodríguez revealed she's always been #TeamBenniferThe proud mom opened up about her daughter's relationship on the Today showJennifer, 53, and Ben, 50, broke off their first engagement in 2004 but rekindled their romance after almost 20 years in 2021Jennifer Lopez's mother Guadalupe Rodríguez has always been #TeamBennifer it seems.",
        "The 53-year-old Jenny From The Block singer was on Today to talk about her upcoming Netflix movie, The Mother, but she also found some time to gush about her husband Ben Affleck.Guadalupe also made a brief appearance during the interview, sharing that she had always hoped Jennifer and her now-husband, 50-year-old Ben, would get back together after the high-profile couple split in 2004.'I knew that you would always get back together because I prayed for 20 years,' the doting mother told her daughter while chatting with hosts Hoda Kotb and Savannah Guthrie.",
        "The revelation triggered a playful eyeroll and shake of the head from Jennifer as she told Hoda to 'keep going' with the interview.But Guadalupe's prayers were answered almost 20 years later when the couple rekindled their romance in 2021 before tying the knot in 2022.During the Today interview, Jennifer also gushed about Ben as a 'father figure' to her 15-year-old twins, Max and Emme.'He's a wonderful, wonderful father and father figure to them. He has his own three beautiful children and then there's us and he's fantastic,' Jennifer said.'He really steps up to the challenge of what that is and what that means and they love him. They love him. They appreciate him and so do I.'",
        "Earlier in the interview, the Get Right singer spoke about how love had changed for her a second time round after her life experiences and realizing what was important to her.'I love what I do. I have always said that, but since I had kids, that changed for me. Now, having a family in this way and being married, you start rejiggering everything. What is really important? How much do I want to work?' she said.The couple met on the set of Gigli in 2001 and started dating shortly after.",
        "Sadly they broke off their engagement in 2004, but they rekindled their romance almost 20 years later in 2021.JLo and Ben then finally tied the knot in the summer of 2022.Last month the 50-year-old actor and director revealed his wife ate whatever she wanted before gushing: 'She's the most gorgeous woman in the world, she looks spectacular.'Ben made the comments while appearing on The Drew Barrymore Show.",
        "'Let me tell you something that's gonna upset you. Jennifer just eats whatever she wants. Whatever she wants. She eats cookies, ice cream, everything,' he said.Drew asked if all that exercise keeps Jennifer in shape.'She works out. I work out too but I don't magically appear to be 20 years old, you know what I mean, with perfect skin and the whole thing,' he joked.",
        "'There's no taking away of the work ethic, the work ethic is real, the discipline is real, but also the superhuman thing is real.'"
    ]
}