{
    "articleURL": "/wires/reuters/article-12055083/UFC-288-Henry-Cejudo-favored-return-vs-Aljamain-Sterling.html",
    "content": [
        "A highly anticipated clash between the current bantamweight champion and the returning former titleholder headlines Saturday night's UFC 288 in Newark, N.J.",
        "Aljamain Sterling of Long Island, N.Y., will be the home team of sorts when he defends his title at the Prudential Center in Newark, N.J. He will meet Henry Cejudo (16-2) of Phoenix in the evening's main event.Cejudo has held steady as the -120 favorite at BetMGM, where he has drawn 55 percent of the total bets and 73 percent of the money wagered on the fight.Cejudo is one of the most accomplished combat-sports competitors of his generation. He won an Olympic gold medal in freestyle wrestling at age 21 in 2008. He proved a fast study in MMA, where he became nearly as adept at striking as he is wrestling. He won both the bantamweight and flyweight titles, becoming one of just four UFC fighters to simultaneously hold belts in two divisions. But he abruptly retired at his peak in 2020, vacating both crowns.Sterling (22-3), meanwhile, won the 135-pound title via disqualification due to an illegal strike in a bout he was handily losing to Petr Yan in 2021. He solidified his claim to the crown by winning a rematch via split decision a year later.The obvious big question heading into this one is whether Cejudo, at 36, can come out of retirement and immediately return to world-class form. It won't come easy against the 33-year-old Sterling, who enters the match on an eight-fight winning streak.",
        "For his part, Sterling, who can further cement his place by defeating the guy who never lost the title in the Octagon, doesn't seem to be sweating the magnitude of the bout too much.\"At the end of day, it's another moment in time,\" Sterling told ESPN. \"And I just want to make sure I seize the opportunity and enjoy it as much as I can.\"The evening's semifinal bout is an intriguing matchup of highly touted welterweight contenders. Chicago's Belal Muhammad (22-3), winner of eight straight fights, takes on Brazilian veteran Gilbert Burns (22-5), a former title challenger who has won three of his past four.Burns opened as the -135 favorite and has remained there with the public backing him with 56 percent of the total bets and 53 percent of the money.There are three other fights on Saturday's main card:--Kron Gracie (+160) vs. Charles Jourdain (-200): Jourdain brings a 13-6-1 record in the Octagon against Gracie, who has less than a third of the experience at 5-1-0.Jourdain is just 4-5-1 in the UFC following consecutive losses, and is coming off an eight-month break. \"If I want to stay in the UFC, I need to level up,\" Jourdain said this week. \"If not, the door will be shown to me. So, I need to prove I'm a better fighter.\"",
        "Gracie, a jiu-jitsu specialist, returns to the Octagon for the first time since a 2019 loss to Cub Swanson. He has drawn 89 percent of the total bets, while Jourdain has been backed by 82 percent of the money.--Yan Xiaonan (+150) vs. Jessica Andrade (-200): Andrade (24-10-0) is coming off a loss in her most recent fight and faces a stiff test against Xiaonan, who enters with a 16-3-0 record.Xiaonan, who has been backed by 73 percent of the bets at BetMGM, believes a win over the former strawweight champion will earn her a shot at current champ Zhang Weili. Andrade has been supported by 82 percent of the money wagered.--Diego Lopes (+600) vs. Movsar Evloev (-900): Evloev enters with a 16-0 record and a massive edge in experience against Lopes, who stepped in for Bruce Mitchell on five days' notice. Lopes lost his UFC debut but said this is \"a great opportunity for my career.\"That hasn't dissuaded the public from backing Evloev with 82 percent of the money, although Lopes has drawn 80 percent of the bets thanks to his longshot odds.--Field Level Media"
    ]
}