{
    "articleURL": "/sport/football/article-12059827/Wrexham-owner-Rob-McElhenney-makes-plea-Gareth-Bale-begging-call-me.html",
    "content": [
        "The former Real Madrid and Tottenham star hung up his cleats at 33 in January McElhenney previously invited Bale to play golf so they could talk face-to-faceDailyMail.com provides all the latest international sports news Rob McElhenney has made a fresh bid to try to convince Gareth Bale to come out of retirement, with Wrexham's co-owner urging the Welshman to call him and to 'do the right thing' and play back in his homeland. ",
        "The former Real Madrid and Tottenham star hung up his cleats in January after lifting the MLS Cup with L.A.F.C. in his first and only season with the club. The 33-year-old stunned fans when he revealed his unexpected decision at the time. But, now that Wrexham's been promoted back to the Football League, McElhenney and fellow actor and good pal Ryan Reynolds - the club's owners - have pleaded for Bale to come and play in front of fans in North Wales, even inviting the ex-winger to a round of golf in April. Despite the failed previous attempts, McElhenney is refusing to give up on his vision of seeing Bale in a Red Dragons kit next season. 'Gareth, okay listen, it's just me and you talking for a second,' said the ''It's Always Sunny in Philadelphia'' star on The Aarthi and Sriram Show. 'I know that Southern California is beautiful and I know, I'm from Philadelphia and I've lived here for many, many years...but you're a young man and you have the rest of your life to live wherever you want!",
        "'If you could just come back for one last year of glory, one last year. I believe your nation, the nation of Wales... do the right thing. 'Call me.' Bale is well informed on Wrexham's very public interest in adding him to their squad, currently celebrating their promotion in Las Vegas, but doesn't seem captivated by the prospect of playing at Racecourse Ground. ",
        "'I think I was looking more for a free round of golf off Rob,' said the Welsh legend at the UK Sport Industry Awards in April. 'I'm sure we'll have a chat and a joke but I'm quite happy where I am. 'I'm spending a lot of time with my kids, my wife, time that I've lost so much over the years being committed to football. I'm just enjoying family life and playing some golf.'",
        "Wrexham persuaded former Manchester United and England goalkeeper Foster to come out of retirement, resuming his career in March and helping the North Wales club to promotion.He memorably saved a last-minute penalty in the crucial victory against title rivals Notts County.Wrexham sealed their promotion to the English Football League after a 15-year absence with a 3-1 win over Boreham Wood on April 22.Reynolds said: 'I think it's slowly dawning on me, I'm still catching up to myself, I can't believe that I'm in a place in my life where any sports team, let alone one I happen to somehow be a co-chairman of, has affected me this deeply.'I feel like there was a DNA change when we lived through that Boreham Wood moment, and that match. I don't know that I'll ever be quite the same again. I live in a sort of constant, slightly perpetual state of elation and I don't want to come back down from this cloud.'"
    ]
}