{
    "articleURL": "/wires/ap/article-12039165/Hurricanes-Devils-meet-2nd-round-NHL-playoffs.html",
    "content": [
        "RALEIGH, N.C. (AP) - The Carolina Hurricanes pushed through a first-round series in the Stanley Cup playoffs with enough time to let their injury-hit lineup recharge before facing their next opponent.",
        "The mental break was just as important, too, before taking on a New Jersey Devils team less than 48 hours removed from a Game 7 win to advance.\"We´ve had time to kind of slow down and take a breath,\" coach Rod Brind'Amour said Tuesday. \"Sometimes that gets you on your heels a little bit, but I think overall, mentally, it was needed.\"The Hurricanes closed out the New York Islanders in a six-game series on Friday night. They host Game 1 of the second-round series on Wednesday night, with the Devils having played twice to eliminate the New York Rangers since the Hurricanes last took the ice, including Monday night's 4-0 win.\"I can tell you from my experience that I would rather just keep this thing going, keep the schedule, keep it every other day than having four or five days and you´re trying to simulate games and maybe what your opponent may look like,\" Devils coach Lindy Ruff said. \"We´ve got our game at a high pace.\"The matchup pairs the top teams in the Metropolitan Division; the Hurricanes won the final game of the regular season to edge the Devils in the standings.",
        "With Boston gone in a first-round stunner after a record-setting regular season, either the Hurricanes (113 points) or the Devils (112) will have home-ice advantage throughout the rest of the playoffs after Round 2.",
        "IN NETThe Devils got plenty from 22-year-old netminder Akira Schmid in the Rangers series despite the fact he had played just 24 regular-season games over two seasons.The Hurricanes have used a rotation with Frederik Andersen and Antti Raanta. Raanta got the start for the first five games of the Islanders series, then Andersen allowed one goal in the Game 6 win after returning from a brief illness.Andersen missed last year´s playoffs due to injury in his first season with Carolina.\"For me, I think it´s just that focus of not trying to do too much and trusting the guys,\" Andersen said. \"I think we have the team that when everyone does that, it´s enough.\"HELLO AGAINNew Jersey defenseman Dougie Hamilton will be facing his former team. Hamilton played on three playoff teams for Carolina before signing with New Jersey in 2021.Devils winger Erik Haula was acquired by Carolina in a 2019 trade, but the Hurricanes traded him eight months later. This will mark the third straight year he has faced the Hurricanes in the playoffs - all with different teams - and he's become a popular target for fan angst in Raleigh.\"I've lost to them two years in a row in the playoffs,\" Haula said, \"I know what they're all about.\"",
        "HELP FROM EVERYWHEREThe Devils won their first playoff series since 2012 by getting contributions from unexpected sources.Haula, who centered the third line most of the season, moved up to left wing on the second line centered by Jack Hughes and led the team with four goals.Ondrej Palat - who twice won the Stanley Cup with Tampa Bay and signed a five-year deal with New Jersey - put an injury-marred season behind him by adding two goals and three assists. That included setting up the Game 7 winner by Michael McLeod, who had not scored since January.More impressively, the Devils won despite getting no points from star forward Timo Meier, who was acquired from San Jose at the trading deadline.FOURTH-LINE PRODUCTIONThe Hurricanes got some quality fourth-line play against the Islanders, including the series-clinching sequence.It started with Derek Stepan reaching forward as he skated down a clearing attempt at the blue line to keep the puck in the zone. He sent it ahead to Paul Stastny, who beat Ilya Sorokin from a sharp angle on the right. It was Stastny's second straight game with a goal.\"I look at our line and how I felt like our last (two) games as a line have been really good,\" Stepan said, adding: \"Your job is sometimes difficult as a a fourth line but you have to just understand it might it just be that little moment like Game 6.\"",
        "DISCIPLINENew Jersey committed 28 penalties and allowed five power-play goals against the Rangers. However, New York managed just one power-play goal in the final five games. The Devils killed off all 18 power plays in their four wins.\"It´s probably too much, but sometimes I think there were some pretty soft calls I would say,\" Devils defenseman Jonas Siegenthaler said. \"I don´t know why, but we´ve got to stay disciplined and focus on our game. We can´t get mad or frustrated at the refs.\"___AP Sports Writer Tom Canavan in Newark, New Jersey, contributed to this report.___Follow Aaron Beard on Twitter at http://www.twitter.com/aaronbeardap___AP NHL Playoffs: https://apnews.com/hub/stanley-cup and https://twitter.com/AP_Sports"
    ]
}