{
    "articleURL": "/wires/afp/article-12039497/Amnesty-accuses-Burkina-army-village-massacre.html",
    "content": [
        "Amnesty International on Tuesday said Burkina Faso's army was responsible for a village massacre last month, putting the death toll at 147, more than double the official figure.",
        "Armed men in military uniform slaughtered residents of Karma village in the jihadist-hit Sahel nation's volatile north on April 20.A local prosecutor said around 60 people were killed, while a Burkinabe human rights group reported 136 deaths, adding that the attackers also killed a further 11 people nearby on the same day.Amnesty said Burkinabe soldiers entered Karma in the morning, gathered the villagers, collected their identity documents and shot them \"at point-blank range\", killing \"at least 147 people\", including 45 children.Amnesty said accounts from the survivors it interviewed pointed to the third battalion of the army's Rapid Intervention Brigade.\"These people were dressed in black uniforms, others in greenish combat fatigues. Some had helmets, others wore balaclavas, and they were on several pick-up trucks and motorcycles,\" one survivor said.Another accused the Burkinabe army of the massacre, saying he saved his life by covering himself with the blood of corpses.Residents of the nearby town of Ouahigouya also said they saw the battalion pass through towards Karma and return on April 23 before heading to the capital Ouagadougou, Amnesty said.Burkina's military government on Thursday broke its silence on the Karma killings, issuing a statement condemning \"barbaric acts\". An investigation has been opened by a local prosecutor.\"This investigation must be carried out impartially and independently so that the perpetrators of war crimes and other serious violations\" face justice, said Samira Daoud, Amnesty's regional director for West and Central Africa.",
        "Burkina Faso's armed forces face an Islamist insurgency by groups affiliated with Al-Qaeda and the Islamic State group who swept in from neighbouring Mali in 2015.More than 10,000 civilians and members of the security forces have died, according to an NGO estimate, while at least two million people have fled their homes. At least a third of the country lies outside government control."
    ]
}