{
    "articleURL": "/wires/reuters/article-12055733/Braves-clip-Orioles-Kevin-Pillar-s-pinch-hit-HR.html",
    "content": [
        "Kevin Pillar delivered a two-run, pinch-hit home run in the eighth inning to lift the Atlanta Braves to a 5-4 win over the visiting Baltimore Orioles on Saturday to square the series.",
        "It was Pillar's 100th career home run.Austin Riley led off the inning with a double. When Baltimore inserted left-handed reliever Danny Coulombe, the Braves countered by pinch-hitting Pillar for lefty-hitting Eddie Rosario. Pillar launched the second pitch 405 feet into the left-field stands for his third homer of the season. It was the second pinch-hit homer of his career.Raisel Iglesias made his first appearance after missing 33 games with a sore right shoulder. He worked a one-two-three inning, striking out two, to earn his first save.The winning pitcher was A.J. Minter (2-3), who pitched a perfect eighth inning and fanned two. Coulombe (1-1) took the loss.Neither starting pitcher received a decision.Atlanta's Spencer Strider pitched five innings and allowed two runs on four hits and 10 strikeouts. It was the second double-digit strikeout game of the season and the eighth of his career through 27 starts.Baltimore's Kyle Bradish gave up three runs on five hits, two walks and four strikeouts in five innings.The Braves opened the scoring in the third inning on a solo homer by Marcell Ozuna, his sixth of the season and fourth in his last 13 at-bats.Baltimore's Adam Frazier came up with a two-out, two-RBI opposite-field single in the fourth inning to put the Orioles ahead.",
        "Atlanta tied the game in the fourth on Rosario's RBI single and took a 3-2 lead in the fifth on a run-scoring single from Ronald Acuna Jr., who has reached base in a league-leading 25 straight games.The Orioles took the lead in the sixth on an RBI double by Anthony Santander, who scored on Frazier's infield grounder.It was the 100th sellout in the history of Truist Park, which opened in 2017.--Field Level Media"
    ]
}