{
    "articleURL": "/news/article-12055177/Multiple-victims-reported-shot-active-shooter-Allen-Premium-Outlets.html",
    "content": [
        "The shooting happened in Allen, a small suburb Dallas, at an outdoor outlet mallAt least one of those slain, Steven Spainhouer recalled, was a child, whom he desperately tried to rescue after rushing to the H&amp;M where his son was workingShoppers were seen fleeing stores in footage seen circulating on social media, with the gunman now dead thanks to a local officer who was also at the mallA man who witnessed the outlet mall shooting firsthand Saturday recalled being one of the first people on the scene - rushing to rescue his son from a clothing store where the now-deceased gunman's attack started. ",
        "The shooting happened at the Allen Premium Outlets in Allen, a small suburb north of Dallas, and saw at least eight people killed. At least one of those slain, Steven Spainhouer recalled, was a child, whom he desperately tried to save after rushing to the H&amp;M - where his own son had been working. Shortly before, around 3:30pm Spainhouer received a frantic call from his son notifying him that there had been shots fired outside the shop, with his relative still trapped inside.Footage shows the moment those first shots rang out, in which the unidentified gunman is seen pulling up the store, which moments later would be littered with multiple bloodied bodies - seen in images currently circulating.Driving over with the intent to save his child's life, Spainhouer explained how he got there before any first responders - and was faced with the monumental task of trying to save lives.Scroll down for video: ",
        "'I never imagined in 100 years I would be thrust into the position of being the first first responder on the site to take care of people,' he told CBS News, recalling how a handful of people around him recorded videos of the bodies outside his son's H&amp;M, where the unnamed gunman's assault is believed to have began. ",
        "Still unidentified, the shooter was killed by cops elsewhere in the complex shortly thereafter, killed by an Allen cop who was on the scene for an unrelated call and heard the gunshots outside the H&amp;M.As that was going on, and prior to other officers' arrival, Spainhouer - who is trained in CPR - attempted to resuscitate multiple people struck by the gunman's initial hail of gunfire, including three he said were already beyond saving.'The first girl I walked up to was crouched down covering her head in the bushes, so I felt for a pulse, pulled her head to the side and she had no face,' he said of the first victim he came across, a young girl.Still set on saving the mess of victims, Spainhouer recalled how he then found another child, who survived the barrage of bullets by being covered by his protective mother, who he said was among eight to die by the gunman.'When I rolled the mother over, he came out,' Spainhouer said, speaking to CBS reporter JD Miles just a few hundred yards from where the carnage was seen only a few hours before.  'I asked him if he was OK and he said, \"My mom is hurt, my mom is hurt.\"'Spainhouer described how he attempted to alleviate the boy's mental anguish by taking away from the grisly scene.",
        "'Rather than traumatize him any more, I pulled him around the corner sat him down and he was covered from head to toe.'Spainhouer added: 'Like somebody poured blood on him.'In the chaos that ensued, the dutiful dad tried to rescue another victim, but was also unsuccessful. Meanwhile, as important minutes continued to pass, Spainhouer - unaware that the unnamed Allen officer was already on the scene - waited for others to arrive and help him with his efforts.   'I was on the phone with 911 and I was telling them we have a mass casualty incident,' the father said, appearing visibly emotional during the TV interview.Spainhouer further added that as he and others waited for medical help, local police were forced to transport several of the victims to nearby medical practitioners - as their condition was too severe to wait for an ambulance. 'No one can see what we saw today and not be affected by it,' he said, saying the events of the day would stay with him. 'It's not a situation I would wish upon anybody, it's just unfathomable to see carnage.'Spainhouer's son also told the station that two customers inside the H&amp;M store were among the at least seven injured. His dad, while holding back tears, remarked, 'It's tough when you see a family that's out shopping, having fun, get wiped off the face of the Earth because somebody with a gun has some other type of issue.'",
        "Beginning at roughly 3:30pm and forcing a mass evacuation, the shooting has rocked the small city of Allen - and has left residents desperate for answers. Dashcam footage showed the moment the gunman, dressed in full SWAT garb, pull up to the outdoor outlet before opening fire on unsuspecting civilians, using an AR-15 to mow down a crowd that included children.Cops, meanwhile, for the most part kept quiet as to the exact extent of the tragedy - releasing sparse statements confirming several were killed, before specifying how many and whether a shooter was still at large.However, disturbing footage captured at the scene - as well as multiple witness accounts - laid bare some of what had transpired, showing at least four bloodied bodies lying outside the H&amp;M where the gunman was seen beginning his assault.",
        "'One of our officers was on an unrelated call at the outlet mall,” said Brian E. Harvey, the chief of police in the suburb roughly 20 miles from Downtown Dallas. 'He heard gunshots, went to the gunshots, engaged the suspect, and neutralized the suspect.” Another distressing clip, filmed a few stores away, showed the deceased gunman shortly after he was gunned down himself by the unnamed Allen officer - who heroically ran toward the sound of then ongoing gunfire, according to his superiors.",
        "At first, reports from local police sources initially indicated that there may have been two gunmen - the one killed and another at-large - though cops during the late night presser revealed they are confident he acted alone.'We believe at this point that the shooter acted alone,' Harvey said late Saturday. Harvey, however, did not provide a name for the deceased gunman - whose motive for carrying out the killings remains unknown.Other footage and snaps taken at the scene, meanwhile, help piece together what exactly transpired at the mall, with several showing at least four people, including children, slumped dead after the gunman's rampage.In a statement four and half hours after cops were first called to the mall, the Allen Police Department revealed that one of its officers subdued the shooter while responding for an unrelated call, when they heard gunshots just after 3:30 pm.That officer, a rep for the department said, 'engaged the suspect and neutralized the threat.'Police Chief Brian Harvey did not identify the officer who took down the shooter Saturday, but confirmed there were several fatalities. He would not specify how many - though cops are expected to offer more details later this evening.Prior to the 8pm update, police said they still considered the scene 'active,' with local law enforcement sources telling CNN that one of the suspects was still at large.",
        "Cops, however, were quick dismiss that theory in their 8pm presser, indicating the shooter acted alone and was no longer a threat. Hours before, police and ATF agents were seen sweeping stores for several hours during the site's mass evacuation, more than two hours after police first descended on the complex after receiving reports of gunfire. In terms of the number of victims, cops also kept mum - though a spokesperson for Medical City Healthcare a few miles away said eight victims are being treated at their facilities.Some of the victims, as much of the disturbing video being seen online had suggested, were children, with the rep telling Fox 4 they ranged in age from 5 to 61.Aerial video shows citizens being escorted off the premises, many with their hands on the heads looking visibly distraught - while more shocking clips laid bare the incident's fatalities, including the dead gunman.Footage captured by a Fox helicopter showed at least four dead bodies outside the H&amp;M store seen in newly surfaced video of the first gunman, which showed him opening fire on several unsuspecting victims after pulling up to the shop in a grey Dodge Charger.Distressing video footage of the same site hours later showed bloodied corpses surrounded by items including backpacks suggesting some of those slain were children.In another disturbing snippet, the deceased gunman is seen laying dead outside another Allen store on a few dozen feet from the H&amp;M. He is seen dressed in tactile gear with a semi-automatic rile at his side.Other accounts posted to social media from 5pm to 8pm offered a glimpse of the events that led to the shooter's death  - and the mass evacuation of the entire shopping center rocked by the sudden storm of gunfire.One such account, posted a little over the first of dozens of shots reportedly rang out, provided an idea of the horror shoppers faced, and came from mom whose car was pierced by two bullets as she fled the scene with her young daughter.'Do not go to the Allen outlet!!!' Van Alstyne resident Kimberly Blakey wrote in a post to Facebook at 5:13pm. Attached to the post were multiple photos showing the damage to the door of her car by the two bullets.  'Peyton and I were just there and someone starting shooting,' she recalled after escaping the scene with her eighth grade daughter.'People were running and we were just trying to leave.''The shooting,' she added, 'was nonstop.''My car got hit by two bullets. We are so grateful to be OK.'Other photos posted by eye witnesses showed the still unidentified shooter shortly after he  Few other details regarding the shooting, and it is still unclear if there have been any fatalities. Multiple shots, however, were fired, according to both cops and those who survived the tragedy.Earlier in the day, a rep for Collin County Sheriff's Office - which is aiding in local cops' probe - confirmed Saturday there were 'some' victims, though their status, as of 10pm ET, still remains unknown. ",
        "As officers said were 'investigating' the shooting, video from a Fox 4 helicopter showed at least four bodies covered in blood in white sheets.In his evening update, Chief Harvey said a police officer, who was on an unrelated assignment at the time, gunned down the shooter after hearing the first hail of gunfire, which is heard and seen in the dashcam footage.Aside from those slain in that clip, officials could only account for a further seven victims who were transported to hospitals. However, as officials said, several more victims may have been taken in private vehicles.Elaine Penicaro, another local mother, also described hearing a nonstop hail of gunfire while shopping with her own daughter.'We were outside the Converse store and we just heard all this popping,' Penicaro told Fox 4 after also fleeing the scene, ducking for cover when they heard the shots reportedly around 3:45pm.'We kind of all just stopped, and then a second later, just \"Pop, pop, pop, pop, pop,\" and there were sparks flying like it was right in front of us.'Brayson Jones, a 17-year-old who was working the PM shift at the outlets' Champs Sports store, told the New York Times that he heard “probably 20-plus shots” and saw people running out of stores.'As soon as I heard the shots and people yelling, I didn’t wait to see what was going on, I backed out and got out of there,' the teen recalled of the hectic scene.He added that in the frenzy he rescued a random stranger, who he said ran toward his car when the shots were fired and motioned to let him inside.Other aerial shooting shows the mass evacuation that transpired as cops reportedly swept each store to assess their safety, with hundreds of shoppers filed away from the H&amp;M location where the bodies were seen.The same store was seen in the background of the footage that showed people running through a parking lot in front of the shopping center - all while the loud popping sound of gunfire emanates in the background. ",
        "A woman named Colleen, who did not wish to provide her surname, told CBS Texas she was with her son at the mall at the time of the shooting.They described the shooter as wearing all black in and wearing 'like a SWAT uniform without the letters SWAT on it'. She said the shooter was a 'big guy' and was carrying a rifle before he opened fire and people began to run screaming in different directions.  Colleen and her 22-year-old son said they saw the killer dead on the ground when they were evacuated by the police with other bodies on the floor too.Her son initially thought the gunshots were construction noises before he saw the killer in front of the store.  He said: 'Out of nowhere I heard about like 10 pops go off and I look at the customer next to me and I was like \"was that gunshots?\".'And he said it was probably just construction and more shots go off, heard like 10-15 more shots go off and so I ran to the front of the store and we're like no that's shooting.'We saw the guy dressed in all black wearing a vest, has an assault rifle and he's just shooting at people.'A witness told CNN he saw the gunman exiting his vehicle before ‘shooting his gun everywhere for the most part’ on the sidewalk outside.He said: ‘The door opened and I was letting the customers come inside the store.‘He was pretty much walking down the sidewalk and blazing for the most part and shooting his gun outside the store.‘He was walking down the sidewalk towards Fat Burger and he was just shooting his gun everywhere for the most part.’Another man, who was shopping with his wife and six-year-old son, said his family ran into a changing room and stacked cardboard boxes against the door to protect themselves.He said: 'We hid ourselves in the try-on room and there were spare boxes so we tried to lock it with the boxes and a couple of other ladies were there.'We hid for around two minutes and heard the noise. We didn't realize [what was happening] because the noise was coming from outside.'To be frank, for 10 minutes I was completely scared, I couldn't imagine what could be because we just parked the car and it was hardly five minutes.",
        "'When the police started the evacuation we saw the dead body and I didn't want my son to see but he also saw.'Another witness named Jamil said: 'We were inside the store and all of a sudden we heard a gunshots and everybody was panicking but the store we were in they were very helpful. They took everybody in the back and then police came, a SWAT team came, they brought us outside and they escorted us out.'When we were walking outside across from Michael Kors we saw the dead body, the guy had all the gear, he looks like a police officer but when you look at this shoes he was wearing converse.'So that makes you think he was just trying to trick people and he was shot right in his forehead.'One man rushed to the scene after his daughter who was at the mall texted him saying 'daddy I love you, there's a shooting'.He said: 'My daughter just texted her mom and me and said \"daddy I love you, there's a shooting and I am surrounded by the police just pray for me\".'We rushed here and we saw the police outside her door and they told us to let go and that they were still looking for the person.'This is America, people are dying in the hospitals, waiting rooms and on college campuses. There's no more safe places.'Other witnesses said they were taken into the back of stores by employees before exiting from that side once police said it was safe to leave.The shooting has left the city of Allen looking for answers, and comes at least 199 mass shootings this year in the US.It also comes just short of the year anniversary of the mass shooting across the state in Uvalde, which saw nineteen children and two adults fatally shot by an 18-year-old gunman with an assault weapon.This incident, at the time, sparked national outcry due to local cops' hapless handling of the attack - a response that comes in stark to the Allen officer's still of the Saturday event, which was praised by brass at the Allen outlet Saturday.'We are horrified by today's senseless tragedy and outraged by the violence that continues to plague our country,' Allen Premium Outlets said in a statement Saturday night,'Our thoughts and prayers are with the victims, their families and others affected by this heinous act. We are thankful for the police officer’s heroic actions and for the support of all the first responders.'The shooting, while still shrouded, also prompted a response from Texas Governor Greg Abbott, who touted how his office has sent state officials from multiple agencies to aid Allen police with their investigation, including the Texas Department of Public Safety (DPS) and Texas Rangers.'Our hearts are with the people of Allen, Texas tonight during this unspeakable tragedy,' said Abbott in his written statement.'I have been in contact with Mayor Fulk and DPS Director McCraw as well as other state and local leaders and offered the full support of the State of Texas to local officials to ensure all needed assistance and resources are swiftly deployed.'The Governor's response, however, was soon met with criticism by some on social media, due to his and others' insistence that the US shooting epidemic does not stem from lax state and federal laws involving gun control. Mayor Kevin Fulk, a lifelong resident of Allen, added: 'Today is a tragic day for the city of Allen ... We know the days ahead will be difficult and somber.'Texas Senator Cruz also issued a statement that said he and his wife Heidi ' are praying for the families of the victims of the horrific mall shooting in Allen, Texas. 'We pray also for the broader Collin County community that’s in shock from this tragedy,' the Republican, an outspoken opponent of harsher gun laws, said."
    ]
}