{
    "articleURL": "/wires/ap/article-12043293/Pompeii-chariot-stars-Rome-exhibit-probing-ancient-roots.html",
    "content": [
        "ROME (AP) - A meticulously reconstructed Pompeii bridal chariot that eluded the ancient city´s modern-day looters is a star of an ambitious new exhibition in Rome, which invites viewers to reflect on today's connections with classical Roman and Greek civilizations.",
        "Shown for the first time to the public since it was discovered in 2021 under four meters (13 feet) of volcanic ash, the four-wheeled chariot features silver and bronze decorations, including of erotic scenes.The chariot was found under the ruins of a villa just outside Pompeii, an excavation prompted by the discovery that artifact thieves were tunneling through the area in hopes of finding saleable ancient loot.Wooden parts of the chariot, like the sideboards, didn't survive the A.D. 79 eruption of Mount Vesuvius that ended Pompeii's run as a thriving, enterprising Roman city. But to reconstruct what didn't survive of the chariot, experts used same the pioneering technique that have been employed for decades now to make casts of human victims of the eruption, by filling in the space left in the ash by the vanished organic matter.In a sobering reminder how life can vanish in an instant, as reflected in the show's title \"The instant and eternity, between us and the ancients,\" the casts of two male victims - one of the pair is believed to have been the enslaved person of the other man - were transported to Rome from Pompeii's archaeological park to greet visitors at the exhibition's entrance.But the chariot is just one of many stellar pieces in the exhibition, which opens on Thursday for a three-month run in the towering, cavernous halls of the Baths of Diocletian, a structure in central Rome that dates to about A.D. 300 and now is home to the National Roman Museum just across from Rome's bustling main train station.",
        "To better understand what the chariot looked like in its heyday, including the color of its original wooden sides, restorers drew from ancient texts describing such ceremonial vehicles.But the special role of ceremonial chariots long-predated Pompeii, noted the museum's director, Stephane Verger, pointing to another impressive display in the exhibition. On display are three painted walls from a third century B.C. tomb in Paestum, a city in present-day southern Italy founded by the Greeks. On one wall, the painting depicts a woman, being fanned by a servant while she rides a ceremonial funeral chariot, while on the opposite wall is a depiction of her just-deceased husband.Many of the 65 ancient sculptures and artifacts on display have left Greece for the first time.Italian museums Director General Massimo Osanna said the exhibit challenges what he described as a popular \"cancel-culture\" premise that dismisses the value of studying ancient classical civilizations.\"It's fundamental to reflect on our common roots,'' said Osanna, in counter-tendency to what he lamented was a push to \"ignore the classics\" because of the \"uncomfortable\" legacy of ancient civilizations, especially the practices of slavery and colonization.He cited the ancient Roman entertainment in the Colosseum of deadly gladiatorial bouts. While that violent practice is relegated to history, \"that doesn't mean we don't have violence\" today. \"We channeled it elsewhere,'' Osanna said.",
        "\"To reflect, to know\" our past, \"doesn't necessarily mean imitating it,'' Osanna said.Among the \"cords\" that tied the ancients to humans today is the theme of grief, said one of the exhibition's curators, Maria Luisa Catoni, who cited some of the treasures on display. On display is an evocative representative of mourning - a depiction, on a sarcophagus, from the 13th century B.C., of a procession of four weeping women, starkly outlined in a terracotta hue, from Thebes, a city that was a power center of ancient Greece. She noted that many master painters of the Renaissance, about three millenniums later, would explore the same theme of weeping women to convey unspeakable grief.After the exhibition closes on July 30, the chariot will go on display in Pompeii, one of Italy's most popular tourist locales."
    ]
}