{
    "articleURL": "/news/article-12051173/Shocked-mother-spots-venomous-snake-daughters-shoe-seen-it.html",
    "content": [
        "Kym Beechey, from Jilliby, was on her front porch when she got a surpriseThis is the shocking moment an Aussie mum discovers a venomous snake hiding in her daughter's shoe.",
        "Kym Beechey, from Jilliby, New South Wales, was retrieving a lunchbox that had been left outside when she got a surprise.There, with its head sticking out of one of her daughter's shoes, was a red bellied black snake – a species infamous for its agonising bite.She said: 'I headed to the front porch to collect an abandoned lunch box that was in danger of becoming the subject of a science experiment.'I leaned down to pick up the lonely lunchbox and nearly headbutted my snakey friend, so although in a shoe it was my face that was in greatest danger.",
        "'He was snuggled, coiled in the shoe.'The shoe it was in is actually my daughter's mountain bike riding shoe and she was very pleased I found it and not her!'Kym, 56, recognised the danger straight away.She said: 'I was pretty certain it was a red belly black snake as we have had them here before.'In fact, when I was in labour with my first child there was one in the house – and when I brought my child home from hospital, there was one in our bedroom.'We know they can be about, so we do take care, however it is always a surprise to find them so close to you. In this case, so close to my face.'",
        "The bite of the red-bellied black snake is characterised by severe pain – causing swelling, prolonged bleeding, and localised necrosis or skin death, sometimes leading to amputation.The venom of the red-bellied black snake contains neurotoxins, myotoxins, and coagulants, and has haemolytic properties.Its symptoms include nausea, vomiting, headache, abdominal pain, diarrhoea, or excessive sweating.But it has not caused any recorded deaths down under and Ms Beechey knew it was unlikely to attack.",
        "She said: 'As you may have read, the species is capable of causing a dangerous venomous bite. I am aware of that but also know they are rarely aggressive.'When I find them I like to just watch and wait for them to move on – and this one did move on.'I was more concerned my silly dog would get bitten rather than me.'As for why the shoes were outside in the first place, Kym said: 'Eight adults live in our house on a semi-rural property.'Four are elite athletes and have many pairs of training shoes, work boots and outdoor shoes.'As we have had rain recently, all stay outside.'"
    ]
}