{
    "articleURL": "/wires/reuters/article-12046199/HF-Sinclair-beats-Q1-profit-estimates-submits-buyout-bid-Holly.html",
    "content": [
        "By Sourasis Bose",
        "May 4 (Reuters) - U.S. refiner HF Sinclair Corp beat estimates for first-quarter profit on Thursday and said it had offered to buy all outstanding shares that it does not already own in Holly Energy Partners LP.Shares of HF Sinclair fell 7% to $38.98, with Wall Street analysts suggesting that the quarterly beat could be outweighed by the non-binding buyout proposal.The deal could be taken negatively if the company management discusses the need to de-leverage at a time when the market is unsure of refining outlook, TD Cowen analyst Jason Gabelman wrote in a note to investors.Global energy markets have been volatile as risks of a potential recession have raised worries about fuel demand outlook, and concerns have grown about the health of the U.S. banking sector.HF Sinclair, however, said the deal would simplify its corporate structure and reduce cost.According to Refinitiv data, HF Sinclair already owns 47.16% of Holly Energy, which had a market value of $2.01 billion as of Wednesday's close.HIGHER MARGINS DRIVE Q1 BEATHF Sinclair, formerly known as HollyFrontier, said its gross margin jumped 87% to $23.70 per produced barrel in the first quarter, helping offset a decline in refinery throughput.Refinery throughput, or the amount of crude processed, slipped about 1.2% to 558,130 barrels per day due to maintenance activities after last year's high utilization rates to meet a rise in demand. Refinery utilization stood at 73.5%, compared with 88.6% a year earlier.",
        "On an adjusted basis, the Dallas-based energy firm posted a quarterly profit of $2 per share, compared with analysts' average estimate of $1.52 per share, according to Refinitiv data.\"1Q EPS comfortably above Street, largely driven by high refining margins as well as strong performance across segments,\" said RBC Capital Markets Analyst TJ Schultz.(Reporting by Sourasis Bose in Bengaluru; Editing by Subhranshu Sahu)"
    ]
}