{
    "articleURL": "/sport/football/article-12057063/THE-NOTEBOOK-Eddie-Howes-Alexander-Isak-Callum-Wilson-experiment-fails-spark.html",
    "content": [
        "Arsenal beat Newcastle 2-0 to cut the gap to leaders Man City to a single pointCaptain Martin Odegaard scored the crucial opening goal for Mikel Arteta's sideFabian Schar's own goal in the second half saw Arsenal complete the victoryArsenal reduced the gap to Premier League leaders Manchester City to a single point after securing a hard fought 2-0 win over Newcastle at St James' Park.",
        "Captain Martin Odegaard scored his 15th goal of the season in the 14th minute to ease any nerves, after the Gunners had seen their pursuit of Champions League football suffer a crucial blow at the same stadium last year.Fabian Schar's own goal in the second half made the points safe by Mikel Arteta's side, who maintain the pressure on Man City, despite the reigning champions having a game in hand.Newcastle's hopes of qualifying for the Champions League remain in their own hands, but Eddie Howe's side will be wary of Liverpool's strong finish to the season.Mail Sport's Daniel Matthews looks at some of the things you may have missed.",
        "Isak and Wilson fail to shine together from the start Before this, Alexander Isak had amassed seven goals and one assist in nine Premier League appearances. Callum Wilson, meanwhile, had scored eight goals in seven games – a run that included only two starts.Here, Eddie Howe unleashed them together for the first time - Wilson led the line, Isak played from the left wing. Both had chances.But Wilson endured one of his quieter afternoons, while Isak threatened only in flashes before being moved to No 10. And then No 9 for the final 12 minutes after Wilson came off and the experiment was shelved.",
        "Saudi plane protest only briefly distracts the Newcastle supportersEven amid this deafening atmosphere, a dull droning sound could be heard early on at St James' Park as a plane flew round and round carrying the message: 'Free All Saudi Prisoners'. Its first trip was met with some boos from but soon many supporters were too engrossed by Newcastle's lightning start to notice or care. Which is a rather neat summation of the value and controversy of projects such as these.",
        "Home crowd reminds Arsenal about their timewasting complaintsIn the reverse fixture, Newcastle came under fire for a lack of ambition. This time, it took just three minutes for Arsenal to be booed for timewasting.Mikel Arteta keeps his distance from the Newcastle bench this time It was after these two met in north London in January, after Mikel Arteta had a touchline tiff with Howe, that the spotlight shone brightest on the Arsenal manager and his touchline antics. Richard Keys was turning evermore puce and even sensible people were beginning to wonder whether Arteta's histrionics were actually harming his side. It has been noticeable since that Arteta seems much less combustible. Here, though, he was a ball of frustration and nerves.The fourth official, Oleksandr Zinchenko, Bukayo Saka, Ben White… barely anyone escaped an earful. The Newcastle bench weren't shy to voice their opinions, either. Thankfully, this time the two sides kept a peaceful distance apart."
    ]
}