{
    "articleURL": "/wires/ap/article-12059923/Athletics-offers-funding-help-Ukraine-train-worlds.html",
    "content": [
        "MONACO (AP) - Dozens of Ukrainian track and field athletes and officials preparing for their world championships in August can get funding for training camps, World Athletics said on Monday.",
        "World Athletics will invest $190,000 and prioritise replacing equipment for pole vaulters - the event of Ukrainian great Sergey Bubka - which has been destroyed in Russian missile attacks.A college in Bakhmut named for Bubka, the senior vice president of World Athletics, was part of a sports complex including a track stadium and indoor arena that has been destroyed during fierce fighting there in recent months, the national track federation said.\"It was the only center where athletes could conduct training camps at any time of the year. Now there is nothing left in Bakhmut,\" Ukrainian officials wrote in a letter, World Athletics said.World Athletics president Sebastian Coe pledged ahead of the Aug. 19-27 worlds in Budapest to do \"whatever we can to help athletics survive and recover in Ukraine.\"\"The deliberate destruction of Ukrainian athletics facilities and equipment is also a serious attack on the accessibility of our sport,\" Coe said in a statement.",
        "World Athletics has excluded athletes and officials from Russia and its military ally Belarus during the war and both countries are expected to miss the upcoming worlds. They also were excluded from the 2022 worlds in Eugene, Oregon.Track's stance has been the strongest among Olympic sports while the International Olympic Committee pushes governing bodies to find ways to reintegrate Russians and Belarusians as neutrals ahead of the 2024 Paris Summer Games.",
        "Ukraine had a team of 22 athletes at the last worlds five months after the war started. Medals were won in high jump - silver for Yaroslava Mahuchikh in the women´s event and bronze for Andriy Protsenko in the men´s.\"We want to make sure Ukrainian athletes have the same opportunity to compete and succeed this year,\" Coe said.Up to 100 people in the Ukrainian athletics community could need financial support this year, World Athletics said, including travel and accommodation for elite athletes at training camps in the next three months.___AP sports: https://apnews.com/hub/sports and https://twitter.com/AP_Sports"
    ]
}