{
    "articleURL": "/wires/pa/article-12060549/Royals-PM-faith-leaders-join-Big-Help-Out-coronation-volunteering-events.html",
    "content": [
        "Members of the royal family, politicians and faith leaders have participated in the post-coronation The Big Help Out volunteering drive.",
        "About six million people took part in events across the UK on Monday, according to an initial poll.Organisers hope it it will become an annual event as part of the King’s coronation legacy.The scheme was organised by The Together Coalition and partners such as The Scouts, the Royal Voluntary Service and faith groups from across the United Kingdom.",
        "Some 55,123 events were due to take place, created by 33,228 grassroots and community organisations.Faith communities and activists played a key role as events involving Christian, Muslim, Jewish, Hindu, Sikh and other groups took place across the country.According to Walnut/ICM polling as of 7.30pm on Monday, “9% – or 5.86 million of the Great British population said they had taken part in the Big Help Out this weekend,” organisers claimed.Brendan Cox, co-founder of the Together Coalition, said “not only have six million people taken part but nearly eight million people say they are more likely to volunteer in the future”, hailing it as “a huge legacy from the coronation”.These unweighted, interim results were based on responses from 1,503 adults received between Friday and Monday.",
        "The Prince and Princess of Wales and their three children – Prince George, Princess Charlotte and Prince Louis – plus the Duke and Duchess of Edinburgh and the Princess Royal were among those who mucked in on the day.",
        "Other notable participants included Prime Minister Rishi Sunak, Scotland’s First Minister Humza Yousaf and the Archbishop of Canterbury.",
        "In a “family day out volunteering”, George, nine, Charlotte, eight, and Louis, five, helped renovate a Scout hut in Slough, Berkshire, under the watchful eye of their parents William and Kate.Louis joined his siblings and parents by shovelling dirt, pushing wheelbarrows and operating a digger.Edward and Sophie helped at a puppy class for trainee Guide Dogs in Reading, while Anne and Vice Admiral Sir Timothy Laurence attended a County Civic Service recognising local volunteers in Gloucester Cathedral.Elsewhere, diners at lunch club at the Mill End Community Centre in Rickmansworth, Hertfordshire, were served lamb casserole and wine by “special guests” Mr Sunak and his wife, Akshata Murty.Mr Sunak and Ms Murty chopped parsnips and strawberries in the kitchen in black aprons before joining the room in a toast which ended in the group saying “long live the King” and giving three cheers.Ahead of the day, Mr Sunak said: “I hope that as part of the legacy of this historic moment of national unity, people will be inspired for years to volunteer, to help out and to make a difference to others around them.”In a post on Twitter, Labour leader Sir Keir Starmer said he had participated by “supporting those who would otherwise be alone today”.",
        "Justin Welby donned a denim Bon Jovi apron as he served lunch at homeless charity Catching Lives in Canterbury, while the Archbishop of York helped out at a Trussell Trust food bank at St Joseph’s Church in York.",
        "And SNP leader Mr Yousaf visited Whitfield Community Larder in Dundee, bringing with him a donation of nappies at the request of staff.Matt Hyde, chief executive of the Scouts, said: “The public response to the Big Help Out has shown the huge scale of the public’s desire to help out in their local neighbourhoods.“We don’t want this to stop just because the coronation is over. This has to be just the beginning.”Catherine Johnstone, chief executive of the Royal Voluntary Service, added: “The response has been amazing and confirms that we need to continue to make it easier for members of the public to get involved.“Volunteers run our food banks, our youth clubs, our football clubs, they are the glue that binds our communities together.”"
    ]
}