{
    "articleURL": "/wires/pa/article-12047901/Fox-News-fights-legal-bid-rival-media-reveal-details-defamation-payoff.html",
    "content": [
        "Fox News is opposing a renewed effort by three news organisations to unseal documents related to its recently settled defamation lawsuit, saying it would do nothing but “gratify private spite or promote public scandal”.",
        "The Associated Press, The New York Times and National Public Radio asked a Delaware judge earlier this week to reveal mostly private text messages and conversations between Fox employees shortly after the 2020 presidential election that were uncovered during the Dominion Voting Systems lawsuit.Fox lawyer Katharine L Mowery, in a letter sent late on Wednesday to Delaware Superior Court Judge Eric Davis, said much of the material its competitors sought was not relevant to the issues of the lawsuit.She said the media has no right to access such records. They have not been shy about sharing the communications with the most potential to grab headlines  Katharine L Mowery, Fox News  Many of the already-uncovered conversations have proven newsworthy, showing that Fox hosts and executives did not believe the false allegations about Dominion’s voting equipment but still continued to air them.Another batch of messages revealed former Fox host Tucker Carlson’s scorn for former president Donald Trump, including one text where he declared: “I hate him passionately.”",
        "“They have not been shy about sharing the communications with the most potential to grab headlines,” Ms Mowery wrote of the media challenging the sealed documents.One of the reasons Fox agreed to settle the case was to “buy peace and bring an end to the media spectacle,” she wrote.",
        "The news organisations said the documents, most of which Fox said it redacted because it contained proprietary information about the company, were still relevant.Fox agreed last month to pay 787 million US dollars (£625 million) to end the case.Dominion had accused the network of repeatedly airing bogus claims that its voting equipment rigged the 2020 election against Trump, despite knowing those claims were false."
    ]
}