{
    "articleURL": "/wires/aap/article-12043943/Stage-set-rising-Adelaide-star-Irankunda-shine.html",
    "content": [
        "\"Life here, it's really easy compared to Africa,\" says Nestory Irankunda, as he begins to recount the journey of the baby born in a refugee camp who has become the hottest prospect in Australian football.",
        "\"I was not spoiled as a kid... I've always been hard on myself.\"Not everything is going to be given to you straight away, you've got to be patient.\"Unlike most 17-year-olds, though, Irankunda isn't having to bide his time.Rather, it's all coming to him in a rapid blur.Since the start of February, the Adelaide United winger has been called up by the Socceroos as a train-on player and scored five goals in 12 A-League Men games, often celebrating them with backflips that wouldn't look out of place in a Nadia Comaneci routine.Last week he was linked with a move to Bayern Munich and his haul of goals - usually in the dying stages of games - is all the more impressive when you consider he has yet to start a senior fixture.It feels that in a short space of time - his ALM career is only 32 games old - he has become Carl Veart's most lethal weapon, able to beat defenders with both power and panache.\"I feel kind of happy, shocked, I guess,\" Irankunda tells AAP of his rise.\"I didn't really think I'd be looked at the way I was. I think there were better players in the youth squad but our club is all about belief.\"",
        "It seems that the world is at the mercy of a boy with golden feet that are walking a path towards the top.It's a journey which begins in the African nation of Burundi, where a civil war between Hutu and Tutsi ethnic groups ripped through the country.It forced Irankunda's father Gideon and mother Dafroza to leave for a refugee camp in neighbouring Tanzania, where Nestory was born, before moving to Australia.\"When the civil war broke out, they had no choice, they didn't want to lose their lives,\" Irankunda explains.\"My older sister was sick and when they were trying to flee they were about to leave her behind.\"But Dad couldn't, he loves his family and he'd do anything for his kids.\"That's when things were going crazy, he picked up my sister (and fled).\"Dad gets emotional talking about it and I try to understand what they went through but they've only shared small bits.\"Gideon provided for his family of seven children by working as a rideshare driver.Nestory is the fourth-born child and it's easy to forget that he is still just that, a child.Before Friday's A-League Men elimination final against Wellington the teenager, who only recently got his Ps, has to attend school.",
        "His youthful exuberance and inexperience has, at times, been his downfall and it's why he's keen to underline that he isn't \"spoiled\".Earlier this season he was dropped for missing team meetings and his difficulty controlling his emotions at times has been picked up on by Veart and rival ALM managers.He lashed out at Calem Nieuwenhof in a fiery win over Western Sydney in March, sparking an all-in brawl and earning a public dressing down from Veart.\"That's something I have to work on and it's something I'm really struggling with,\" Irankunda says.\"I'm in my second year playing in the A-League and that's going to take time. I'm in the right space, but there's a lot of pressure.\"It's frustrating, especially when you get on the field and then something happens and someone says something to frustrate you.\"If he can match his undoubted talent with a mature head, then there's no questioning where Irankunda can go.The links to Bayern - a move he can't make until he turns 18 in February - appear legitimate and you sense that after getting a taste of Socceroos camp he will be back for more.\"We'll see where things go but for now I'm all for Australia,\" he says.\"I like playing in the A-League, and I'm trying to develop my skills and everything so until I'm ready, I'm always going to be here.\""
    ]
}