{
    "articleURL": "/wires/pa/article-12053689/Eddie-Howe-not-losing-sleep-Liverpool-s-bid-deny-Newcastle-four-spot.html",
    "content": [
        "Eddie Howe insists he is not losing any sleep over Liverpool’s bid to deny Newcastle a place in the Premier League top four.",
        "Jurgen Klopp’s men, who are responsible for two of the third-placed Magpies’ four league defeats to date this season, have belatedly put together a consistent run of form, winning each of their last five matches to close to within six points.That gap could have been reduced to just three points – albeit with the Reds having played two games more – by the time Howe’s side runs out to face Arsenal on Sunday with the chasing pack mounting a late sprint.",
        "Asked about the prospect, the 45-year-old said: “Do I lose any sleep? No, I don’t lose any sleep over it, but I’m aware that Liverpool are a top team. Does it surprise me they’re able to go on a run of wins? No.“There are other teams there as well, but we’re not focusing on that. We haven’t done that all season. We haven’t focused on where we are, who’s around us, form of teams. We’ve just focused on ourselves and that’s all we can do.“We have a tough run of fixtures, but I think at the same time, a great run of fixtures because every game is important. They’re great occasions and we’ll look to carry on our good form.”Brighton’s stoppage-time win over Manchester United on Thursday evening left Newcastle two points clear of the men from Old Trafford in the race for the top four with five games each remaining.",
        "They remain 10 better off than the Seagulls – who have a game in hand – in sixth, but victory over the Gunners would not only all-but end the visitors’ title hopes, but nudge the Magpies closer to Champions League qualification.",
        "However Howe, whose team have won eight of their last nine games, is preparing for the battle to go to the wire.He said: “Nothing’s done and I didn’t expect it to be done. Were competing against elite teams who will fight to the end and we have to do the same.“Our five games we need to give our best preparation and focus to because the fight that we’re in could go right down to the end of the season.”Howe and opposite number Mikel Arteta were involved in an angry touchline exchange during the reverse fixture in January, which ended 0-0, but the former Bournemouth boss has only respect for the Spaniard.He said: “I’ve got a lot of resect for Mikel, he’s done an incredible job. You have to admire everything that he’s done, whether that’s recruitment, coaching, everything, so there’s a lot of respect from me to him.“Within a game, you’ll always have moments where you come up against opponents and there’s a bit of confrontation. I think that’s natural, that’s part of the job, but there are certainly no issues from my side.”"
    ]
}