{
    "articleURL": "/wires/reuters/article-12040469/HK-stocks-reverse-4-day-winning-streak-US-growth-banking-sector-concerns.html",
    "content": [
        "By Georgina Lee",
        "Hong Kong, May 3 (Reuters) - Hong Kong stocks fell on Wednesday, snapping a four-day winning streak, as investors remained concerned that a softening U.S. economy and troubles in the country's regional lenders could slow Asia's growth.** The Hang Seng Index dropped 1.75%, while the Hang Seng China Enterprises Index fell 1.91%.** Asian stocks fell for a second session in a row, as global investors contended with signs of a softening U.S. economy ahead of a widely expected U.S. interest rate hike later in the day.** The International Monetary Fund (IMF) raised Asia's economic forecast on Tuesday as China's recovery underpinned growth, but warned of risks from global market volatility driven by Western banking sector woes.** Overnight, stocks of U.S. regional banks extended losses from Monday after the seizure and auction of First Republic Bank . Banking stocks in Hong Kong also fell.** U.S. job openings fell for a third straight month in March and layoffs increased to the highest level in more than two years, suggesting some softening in the labour market** Fed officials are closely watching this data, as markets await the outcome of the Federal Reserve's May policy meeting.** The central bank is expected to raise its benchmark overnight interest rate by another 25 basis points to the 5.00%-5.25% range before potentially pausing their tightening cycle.",
        "** With China's A share market remaining closed investors have switched their focus on the U.S. market, analysts said.** \"Still, I'd expect the Hang Seng to see downside support at 19,500 this week as sentiment should improve as more economic data may show an improvement in consumption over this week's Labour Day long holiday,\" said Alvin Cheung, associate director at Prudential Brokerage.** HSBC's Hong Kong shares slid 0.6%, retracing the previous session's gain after the bank gave a positive guidance and launched an up to $2 billion buyback plan.** Hang Seng Bank fell 2.16, while Standard Chartered fell 2.35 %.(Reporting by Hong Kong Newsroom; Editing by Sonia Cheema)"
    ]
}