{
    "articleURL": "/wires/reuters/article-12051591/U-S-pipeline-regulator-takes-aim-methane-leaks.html",
    "content": [
        "By Valerie Volcovici",
        "WASHINGTON, May 5 (Reuters) - The U.S. pipeline regulator on Friday announced new rules aimed at reducing leaks of methane, a potent greenhouse gas, from the domestic pipeline system that could eliminate 1 million tonnes of methane emissions by 2030, the equivalent of emissions from 5.6 million cars.The Transportation Department's Pipeline and Hazardous Materials Safety Administration (PHMSA) issued a proposed notice of rulemaking, laying out measures to clamp down on methane leaks from the country's vast network gas infrastructure, which includes 2.7 million miles of gas transmission, distribution, and gathering pipelines; over underground natural gas storage tanks and 165 liquefied natural gas facilities.The measures would play a role in broader U.S efforts to clamp down on methane emissions, complementing new proposed rules by the Environmental Protection Agency to strengthen methane leak detection and elimination in the oil and gas sector.\"Quick detection of methane leaks is an important way to keep communities safe and help curb climate change,\" said U.S. Transportation Secretary Pete Buttigieg.The agency said that the proposal could cut pollution and waste, and create an estimated up to $2.3 billion annually in benefits and reduce emissions from covered pipelines by up to 55%.The proposal requires pipeline operators to establish advanced leak detection programs to detect and repair all gas leaks by strengthening leakage survey and patrolling requirements using technology such as aerial or vehicle surveys, optical gas imaging cameras, and continuous monitoring systems.",
        "It will also establish timeframes for repairs of detected leaks.The proposed measures were developed as a result of the bipartisan PIPES Act of 2020, which created dozens of new regulatory mandates for the PHMSA to target methane.The transmission, storage and distribution of oil and gas accounts for roughly one-third of the sector's emissions, according to 2019 EPA data.Methane has a much higher heat-trapping potential than carbon dioxide and its concentrations in the atmosphere have been rising rapidly in recent years. (Reporting by Valerie Volcovici, Editing by Louise Heavens)"
    ]
}