{
    "articleURL": "/wires/reuters/article-12056209/UK-anti-monarchists-released-custody-King-Charles-coronation.html",
    "content": [
        "LONDON, May 7 (Reuters) - The leader of anti-monarchy group Republic and other members were released from custody after hours of detention during Saturday's coronation of King Charles that raised questions over whether the police response had been proportionate.",
        "Police arrested the leader of Republic, Graham Smith, and 51 others in central London while thousands of royal fans were gathering in the streets for King Charles's coronation on Saturday, saying their duty to prevent disruption outweighed the right to protest.Republic said that detained members began to be released late on Saturday evening, after nearly 16 hours in custody.\"I'm now out of the police station... Make no mistake. There is no longer a right to peaceful protest in the UK,\" Smith said on Twitter.\"I have been told many times the monarch is there to defend our freedoms. Now our freedoms are under attack in his name.\"The police said on Saturday that they understood public concern following the arrests, but said they acted after receiving information that protesters were determined to disrupt the coronation procession.London police chief Mark Rowley warned on Friday that police would take action if protesters tried to \"obstruct the enjoyment and celebration\" of people, saying there would be a \"very low tolerance\" for disruption.Wes Streeting, a senior lawmaker of the opposition Labour Party, said police would have to be accountable as to whether the response was proportionate, adding that some protests had been allowed to go ahead.Tens of thousands of people turned out on Saturday to catch a glimpse of the newly crowned King Charles and Queen Camilla, who after the service at Westminster Abbey rode in a state coach back to Buckingham Palace.",
        "Not everyone who came to watch was there to cheer Charles, with hundreds of republicans booing and waving banners reading \"Not My King\".Culture Minister Lucy Frazer said she had huge confidence in the police and said that, along with the right to protest, people also had a right not to have their enjoyment disrupted.\"I think overall (the police) managed to get that balance right,\" Frazer told Sky News.\"It is really important that they take into account the context of the event, because this was an event that would have raised questions about national security.\"(Reporting by Alistair Smout Editing by Frances Kerry)"
    ]
}