{
    "articleURL": "/money/pensions/article-12054473/Time-taken-transfer-pension-rises-14-days.html",
    "content": [
        "The length of time it takes savers to transfer a pension to another provider has risen by almost a third in the past couple of years – with firms dragging their heels when asked by customers to hand over their money for someone else to manage.",
        "The average time it takes to transfer a pension has risen to 14 calendar days compared to just over ten days in 2020. In some cases, such as with provider XPS Administration, the average transfer time is almost two months, at 57 days. Others, including The People's Pension, LV and Mercer, take on average 40, 36 and 33 days respectively.These transfers are taking more than a month despite modern technology, meaning funds could be delivered in a matter of seconds – though regulations mean transfers must be checked to ensure they are not fraudulent. Those offering the fastest transfer times include Forester Life, NFU Mutual and MetLife, each taking six days to sort out.",
        "The figures – which were compiled by the technology company Origo for its Pension Transfer Index – look at the years starting January 2020 and ending December 2022. The times are getting worse despite slow transfer times being recognised by the City regulator, the Financial Conduct Authority, as a major problem eight years ago. Part of the challenge is that companies are not being ordered to shorten transfer times by the FCA so have little incentive to improve and do not suffer any penalty. Pension provider PensionBee offers a transfer time deadline of ten working days and sees this as a problem which needs tackling.",
        "'We need to move away from self-regulation and ensure tougher timeframes are enforced,' says Becky O'Connor, a director at PensionBee. 'We're calling for a ten-day pension switch guarantee.'",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}