{
    "articleURL": "/wires/afp/article-12039467/Apple-Google-aim-expose-Bluetooth-tracker-abuse.html",
    "content": [
        "Apple and Google on Tuesday proposed a tech standard to make sure people get tipped off when their movements are being tracked with Bluetooth devices like AirTags or Tile.",
        "The tech titans behind rival mobile operating systems that, together, power most of the world's smartphones said the \"first-of-its-kind\" specification has backing of Samsung, Tile and others.Small location devices intended as a way for people to find backpacks, laptops, keys, handbags or other items have been used by stalkers to secretly track people such as ex-romantic partners.\"Bluetooth trackers have created tremendous user benefits, but they also bring the potential of unwanted tracking, which requires industry-wide action to solve,\" Google vice president of Android engineering Dave Burke said in a joint release.A proposal Apple and Google submitted to a leading internet standards development organization would make Bluetooth tracking devices compatible with detection and alert systems in iOS and Android mobile software.If adopted as a standard, Bluetooth tracking device makers would have the option of building the capabilities into their products.\"This new industry specification builds upon the AirTag protections, and through collaboration with Google results in a critical step forward to help combat unwanted tracking across iOS and Android,\" Apple vice president of sensing and connectivity Ron Huang said in the release.Conceived as an aid for the absent-minded, AirTag sensors have been diverted towards more sinister ends, with manufacturer Apple facing anger -- and lawsuits -- over their use as a stalking tool.",
        "The silver and white gadget the size of a large coin is \"an easy way to keep track of your stuff,\" the Apple website boasts. Customers can attach it to their keys, a wallet or a backpack.When linked to a smartphone app, a $29 AirTag helps users detect their belongings' real-time location in case they get lost -- but the transmitter can also trail the humans carrying those items.Unwanted surveillance is a common tactic of abuse, according to Erica Olsen, senior director of the Safety Net Project at the National Network to End Domestic Violence.\"It's imperative for advocates and technology companies to work together on solutions to minimize the opportunities for misuse,\" Olsen said of Bluetooth trackers.Center for Democracy and Technology chief executive Alexandra Reeve Givens commended Apple and Google for collaborating on a way to improve detection of unwanted tracking devices.\"We look forward to the specification moving through the standardization process,\" Reeve Givens said."
    ]
}