{
    "articleURL": "/wires/ap/article-12046233/UK-holds-local-elections-amid-storm-new-voter-ID-rules.html",
    "content": [
        "LONDON (AP) - Millions of people in England voted Thursday in local elections that are the first test of electoral opinion since Prime Minister Rishi Sunak took over a fractious and exhausted Conservative Party six months ago.",
        "The Conservatives say they expect to lose ground in elections for more than 8,000 seats on 230 local councils across England as voters punish them for the turmoil that engulfed the party under former Prime Minister Boris Johnson. He resigned amid multiple scandals and was replaced by Liz Truss, whose rash tax-cutting plans spooked financial markets, hammered the value of the pound and roiled the wider British economy.The party chose Sunak, a smooth former banker, to try to restore stability to the economy and the government.Sunak said Wednesday that his party was expecting the election to be \"hard for us,\" but vowed the Conservatives were leaving behind the \"box set drama\" of the Johnson and Truss eras.\"I´ve only been prime minister for six months but I do believe we´re making good progress,\" he told a think-tank event. \"Just think about where we were then and where we are now.\"The left-of-center main opposition Labour Party hopes the results will confirm its front-runner status for the next national election, due by the end of 2024.University of Strathclyde polling expert John Curtice said if Labour secured more than a 10% lead in the projected national vote share based on the local results, it would signal a likely general election victory for the party.",
        "The election is the first to be held since the government changed the law to require voters show photo identification at all U.K. polling stations.The government says ID is required to vote in many democracies, and the move will help prevent voter fraud. Critics say there is little evidence electoral fraud is a problem in Britain.Acceptable forms of ID include passports, driver´s licenses and senior citizens´ travelcards - but not transit passes for young people.The government says getting an older person´s travelcard requires proof of age, unlike other transit passes. But the discrepancy has brought allegations the change will disproportionately prevent young people - the group least likely to support the Conservatives - from voting. Poor people are also less likely to have photo ID than the more affluent.University of Exeter political scientist Rebecca Baker said \"there will very likely be voters who turn up on the day unable to use the polling booth.\"\"We may also see much longer queues to vote, in light of the extra elements needed and poor tempers, placing additional strain on the already overloaded polling staff.\"The Electoral Reform Society, which opposes the new rules, said it had received \"countless examples\" of people being turned away from polling stations because they lacked proof of identity. But the Association of Electoral Administrators said that no major problems had been reported by early afternoon.",
        "Polls opened at 7 a.m. (0600GMT) and close at 10 p.m. (2100GMT). Most results are due Friday.There are no elections in Scotland or Wales, while Northern Ireland will vote May 18. London, the U.K.´s largest city, will not elect its mayor and council until next year."
    ]
}