{
    "articleURL": "/tvshowbiz/article-12048561/NRL-WAG-joins-Real-Housewives-Sydney-Binge-gives-green-light-season-two.html",
    "content": [
        "Another Housewife is set to join cast in The Real Housewives of Sydney, after Binge officially confirmed a season two is in the works. ",
        "The streaming platform has commissioned season two of RHOS six years after the reality show was cancelled and production is set to begin in the coming weeks.NRL WAG Terry Biviano is the latest to be cast in the reality series, with the Daily Telegraph claiming there is a lot of 'chatter' on set that the shoe designer is participating in the latest installment.Biviano, 48, is married to former NRL Roosters star Anthony Minichiello, 42, and share daughter Azura who they welcomed in 2013.While Binge has remained tight-lipped on casting, former television news anchor Sally Obermeder has also been confirmed as one of the new Housewives.",
        "'We are thrilled to be bringing The Real Housewives of Sydney series to Binge viewers,' Binge's executive director Alison Hubert-Burns told The Daily Telegraph in a statement last week.'The Real Housewives franchise is wildly popular across the globe, and we felt a cosmopolitan city like Sydney needed again to have a brand-new local version.'We have a great team of creative forces driving the fresh series and with our production partner Matchbox Pictures, part of Universal International Studios, who first introduced fans to The Real Housewives franchise, we can't wait to introduce Australians to the new group of Sydney housewives, in this reimagined series.'",
        "Rumours circulated at the end of last year that RHOS was getting a reboot with only two of the original cast members signing on.",
        "As reported in October, producers could only convince property developer Krissy March and beauty queen Nicole Gazal to return, leaving several empty spaces.PR queen Roxy Jacenko was a strong contender to take part in the series, but shut down the speculation in an interview with Daily Mail Australia.Jacenko, who is an ambassador for the Nine-owned streaming service Stan, said she wouldn't dare join a 'rival network'.'I don't even know who started that [rumour]. But no. Apparently I am, but not that I've heard,' she added.",
        "In October, a source told Daily Mail Australia producers were keen to find a 'more likeable cast' than the polarising personalities from the first season.'They’re really looking for housewives who have genuine connections or pre-existing beef with one another,' they added.The Real Housewives of Sydney first aired on Foxtel in 2017, but it never made it to air in the U.S. after network executives at Bravo deemed it too extreme.'A lot of the women in this show were nasty for nasty’s sake and had no redeeming features,' Foxtel's head of television Brian Walsh admitted at the time.The series was cancelled by Foxtel - who own Binge - after one season in early 2019."
    ]
}