{
    "articleURL": "/wires/ap/article-12048117/Justin-Verlander-makes-Mets-debut-gives-2-HRs-Tigers.html",
    "content": [
        "DETROIT (AP) - Justin Verlander was roughed up early before settling in and having some success in his New York Mets debut against the Detroit Tigers.",
        "The three-time Cy Young award winner gave up back-to-back homers in the first inning, then threw four scoreless innings facing the franchise that drafted him. He gave up two runs on five hits and a walk while striking out five, including two in his final inning.\"Obviously, not the first inning I would have wanted,\" Verlander said after Detroit completed a three-game sweep with a 2-0 win Thursday. \"But happy I was able to kind of start to find my groove a little bit.\"Verlander's first game with his third team was delayed because of a muscle strain in his upper back that landed him on the injured list to start the season.The 40-year-old right-hander was drafted by Detroit No. 2 overall in 2004. The rebuilding franchise traded him to Houston late in the 2017 season.After having Tommy John surgery in 2020 and missing nearly two seasons, Verlander bounced back last year to win his third Cy Young award and second World Series title.",
        "In a bold bid to earn a spot in the postseason for the second straight year, the Mets signed him to an $86.67 million, two-year contract and added former Tigers teammate and fellow three-time Cy Young award winner Max Scherzer to a $130 million, three-year contract.",
        "Verlander was 18-4 last season and ranks No. 1 among active pitchers with 244 career wins.Tigers fans at Comerica Park, where they roared for Verlander during the 2006 and 2012 World Series, rose to their feet and cheered when he walked to the mound to make his first pitch of the season. Verlander grabbed the bill of his cap twice to acknowledge the crowd.\"It was amazing,\" he said. \"Nice to hear and I very much appreciate it.\"A few minutes later, fans returned to their feet when Riley Greene and Javier Baez hit home runs in consecutive at-bats with one out in the first inning.\"Those guys hit a couple decent pitches,\" Verlander said. \"That´s baseball.\"Verlander gave up just two more hits over the next three innings, including a single that would've been a flyout if left fielder Mark Canha didn't appear to lose the ball in the sky on a mostly cloudy day.After throwing 65 pitches, Verlander walked back to the mound and light-hitting Andy Ibáñez doubled on the next pitch to start the bottom half of the inning.Showing he wasn't done for the day, Verlander threw a 95-mph fastball past Jake Rogers and snuck an 87-mph slider by Zach McKinstry in the next two at-bats for his fourth and fifth strikeouts.",
        "\"You saw his stuff, so to speak, and velocity and crispness kind of get better as the game went on,\" Mets manager Buck Showalter said. \"I could tell he was getting after it the last inning.\"I think that bodes well. The good thing is, he felt good physically. That was a highlight of the day.\"Verlander walked into the dugout after his 79-pitch outing and in the bottom of the second, right-hander Jeff Brigham jogged in from the bullpen to replace him on the mound.\"It was probably the right move, being a little cautious,\" Verlander said. \"I only had one rehab start.\"___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}