{
    "articleURL": "/wires/reuters/article-12049233/Canadas-Trudeau-vows-run-election-Liberal-party-convention.html",
    "content": [
        "By Steve Scherer",
        "OTTAWA, May 4 (Reuters) - Canadian Prime Minister Justin Trudeau on Thursday promised to run in the next election at what is likely the last Liberal party convention before a vote and attacked his Conservative rival's characterization of the country as broken.Speaking in front of some 3,500 party members at the first in-person gathering in five years, Trudeau delivered what sounded like a campaign speech even though one is not due for another two years.\"When the election comes, when Canadians need to make a consequential choice in this consequential moment, it will be the honour of my life to lead us through it, and continue building a better future,\" Trudeau said.Trudeau has won three elections and has been head of the government for 7-1/2 years, but his main rival, Conservative leader Pierre Poilievre, has often led in opinion polls since he became leader of his party last year amid high inflation and a housing shortage.\"After eight years of Trudeau, everything feels broken,\" Poilievre has said repeatedly on social media and in parliament.The message resonates, said Garry Keller, a former senior Conservative Party staffer who is now vice president at public affairs consultancy Strategy Corp.\"It's an effective message for governments that get long in the teeth,\" he said. \"They start wearing things that may not even be their own fault.\"",
        "Some 57% of Canadians disapprove of Trudeau, compared with an approval rating of 37%, his lowest approval rating since September 2021, according to a March survey by the Angus Reid Institute.\"We want to build things up, while Pierre Poilievre and his 'brokenist' Conservative Party want to tear things down,\" Trudeau said.An agreement the Liberals struck to gain the support of the left-leaning New Democrats in parliament means Trudeau's minority government could last until the fall of 2025, unless the prime minister calls an election earlier.Recently there has been a seemingly constant drip of damaging news - like the federal workers' strike and allegations that the government took too lightly evidence of Chinese election meddling - that make Trudeau look vulnerable.In the first quarter, Conservatives clobbered the Liberals in fundraising, pulling in C$8.3 million ($6.1 million) versus C$3.6 million.While many polls show the Conservatives now leading the Liberals nationally, Poilievre so far has failed to make inroads in large cities key to winning control of parliament, and he is attracting fewer young people, especially women, polls show.Conservatives would win 35% of the vote compared with 29% for the Liberals, according to the Angus Reid poll. But in Montreal, the Liberals lead 38% to 15%, and in the suburbs of Toronto the Liberals are ahead 40% to 34%, Angus Reid said.",
        "\"There's a lot of voter fatigue, even among Liberal voters,\" said Darrell Bricker, chief executive of pollster Ipsos Public Affairs. \"But it doesn't seem like Poilievre is really threatening (Trudeau) yet.\" ($1 = 1.3624 Canadian dollars) (Reporting by Steve Scherer; Editing by Josie Kao, Jonathan Oatis and Michael Perry)"
    ]
}