{
    "articleURL": "/wires/aap/article-12054201/Fyfe-returns-Jackson-inspired-Dockers-thump-Hawks.html",
    "content": [
        "Nat Fyfe made his highly-anticipated return but it was Luke Jackson who was the star of the show as Fremantle posted a 69-point AFL win over Hawthorn at Optus Stadium.",
        "Fyfe, who had been sidelined since round one with a plantar fasciitis injury, was subbed into Saturday night's game with less than seven minutes remaining in the third quarter.Fremantle had already built a 55-point lead by that stage, and the home side cruised to the 18.9 (117) to 7.6 (48) victory in front of 37,160 fans.Fyfe finished with 10 disposals, two clearances and a goal playing a mix of midfield and forward-line duties, but more importantly he made it through the match unscathed.\"It was nice to be back out there,\" Fyfe told Fox Sports.\"It's a bit easier when the team's (nine) goals up when you step onto the field.\"Jackson played his best game since joining the Dockers, tallying 24 disposals, six marks, seven tackles, four clearances and two goals.His two majors from contested marks in the third quarter helped break the game wide open, and his work around the ground was also a highlight.Saturday's win improved Fremantle's record to 3-5, but their finals credentials will be severely tested over the next three weeks when they take on Sydney (SCG), Geelong (Optus Stadium) and Melbourne (MCG).Andrew Brayshaw was prolific on the way to 33 disposals and two goals, while Michael Frederick and Jye Amiss booted three goals apiece.",
        "Hawthorn trio Will Day, Conor Nash and James Worpel combined for 21 clearances.But it was an otherwise disappointing effort from the Hawks, who are now 1-7 and last on the ladder.\"I'm getting a little bit sick of saying it, but at half-time we'd had 29 inside 50s for eight scores and they'd had 19 inside 50s with 14 scores,\" Hawks coach Sam Mitchell said.\"So our efficiency going forward, our being able to consolidate the territory from clearance wins, continues to be a challenge for us.\"Fremantle lost the centre clearance count 12-3 in the first half, but their efficiency in attack ensured they went into the main break with a 31-point lead.Dockers goalsneak Michael Frederick needed medical treatment after being crunched by Sam Frost early, but he was able to return and he kicked a clever checkside goal that gave Fremantle a 13-point lead at quarter time.It marked the first time since round 21 last year that Fremantle had won an opening term, ending a barren run of 11 straight matches.Frost continued to be a battering ram in the second quarter, cleaning up Lachie Schultz while pulling off a remarkable defensive spoil in the goalsquare.But the Hawthorn defender produced a moment of madness later in the term, giving up a 50m penalty when he needlessly pushed Amiss after the Dockers forward had taken a mark.",
        "The resultant goal stretched the margin to 25 points, and Fremantle led by as much as 37 before a late goal to Chad Wingard gave Hawthorn something to cling to at halftime.Fremantle broke the game open in the third term, with Jackson booting two goals from contested marks as the lead ballooned out.Fyfe was given a rousing reception when he was subbed into the contest at the expense of Josh Treacy.The two-time Brownlow medallist went straight to the forward line, and he sent the crowd wild when he snapped a clever goal in the final quarter."
    ]
}