{
    "articleURL": "/tvshowbiz/article-12048989/When-icons-stage-screen-clashed-Shakespeare-Liz-Taylor-looked-on.html",
    "content": [
        " The Motive And The Cue (Lyttelton, National Theatre, London)",
        "Rating: Verdict: A theatrical coronation  What actors in their right minds would let themselves be measured against three of the greatest names of stage and screen in the last century: Sir John Gielgud, Richard Burton and Elizabeth Taylor?Many might consider it a suicide mission. But Mark Gatiss (of BBC’s Sherlock), Johnny Flynn (Ian Fleming in Operation Mincemeat and David Bowie in Stardust), and Tuppence Middleton (Lucy Smith in the Downton film) have all accepted the challenge.The Motive And The Cue, directed by another Sir, Sam Mendes, and dramatised by Jack Thorne (from a rehearsal memoir by actor William Redfield), is an intriguing, behind-the-scenes account of Gielgud’s 1964 Broadway production of Hamlet — featuring Burton in the title role.Having recently married (for the first time) after appearing together in the 1963 film epic Cleopatra, Burton and Taylor were Hollywood supernovas on honeymoon.Here, though, the main focus is on the turbulent rehearsals for Shakespeare’s greatest tragedy.",
        "To Gielgud the director (famed as a melodious Shakespearean), Burton seemed like a town crier, ploughing a Panzer tank through some of the Bard’s finest verse.To Burton, the Prince of Denmark (by way of Glamorgan), Gielgud was a meddling old has-been.The real fascination, however, is the acting. Gatiss is a quavering Gielgud, fearful of being abandoned by his profession. Wearing an ill-fitting corduroy suit and knitted tie under a flasher’s mac, his bald prima donna walks as if about to fall over backwards on his way to the scaffold.",
        "It’s a touching turn, knotted with tension that is eventually released on the shoulder of a rough-trade, New York rent boy.Flynn’s Burton is a firestorm from the other end of the spectrum — and it’s a role that sees him toying with perhaps the greatest voice of all time. He could dip a semitone lower, but with an impressive Port Talbot lilt he thwacks every first word like a bass drum, and crashes through his lines like a jazz percussionist.His Burton is less addled than the original — though a big central scene reminds us he was capable of being a nasty, drunken boor.A better play might have dug deeper, into his dark heart and troubled childhood.Seemingly never off stage (he even grandstands in his wife’s boudoir), Flynn moves like a leopard; a micro pause on every predatory step.As Gielgud repeatedly reminds his leading man, his bombast can get monotonous. Yet this is more the fault of Thorne’s script, which fails to get behind Burton’s famously fathomless stare.As Taylor, Middleton is a slimline poppet with claws. She’s an oddly low-status Liz, happy to slipstream in Burton’s tremendous wake, and giving little sense of the four wrecked marriages trailing behind her.The action plays out on Es Devlin’s set, which alternates between a vast, drafty rehearsal room and stylish 1960s hotel interiors emulating photoshoots in glossy magazines.",
        "In the end, Gatiss sees to it that Gielgud is dutifully venerated as a garrulous old sweetheart with a twinkling wit.And a large, deferential cast (including Janie Dee, as the actor playing Hamlet’s mother, Gertrude) are happy to orbit the two leads, flattering their stellar status.After two hours and 40 minutes, the show climaxes in a blast of Handel’s Zadok The Priest, heralding a slick posthumous coronation of theatrical royalty.Seventies classic is still classy   Veronica LeeAbigail’s Party (touring until July 15)Rating:Verdict: Party on downWhen Mike Leigh’s stage play was shown on the BBC in 1977, it became an instant classic: a stomach- achingly, funny study of suburban modern manners.Upwardly mobile but unhappy couple Beverly and Laurence (Rebecca Birch and Tom Richardson) invite new neighbours Tony and Angela, and Susan — the divorced mother of titular teenager Abigail, whose party she is avoiding but fretting over — round for ‘drinks and nibbles’.",
        "While some references place it firmly in the 1970s, it still has much to say about the British obsession not just with class but where we place ourselves (and others) in the pecking order. Pretentious Laurence spends the evening in a game of one-upmanship with Tony (George Readshaw), a monosyllabic oaf who bullies Angela (Alice De-Warrenne).",
        "The excruciating — and very funny — dance scene with Beverly and Tony gyrating under the noses of their partners is the highlight, and director Michael Cabot deftly handles the gear change from comedy to tragedy when Laurence has a heart attack.For tour details see britishtheatre.com.Rollicking last hurrah for RSC boss, but the big party runs out of steam Patrick MarmionCymbeline (Royal Shakespeare Theatre, Stratford-upon-Avon)Rating:Verdict: Mid-table clashGregory Doran has been as good and faithful a servant as the Royal Shakespeare Company can have wished for. Having now directed 50 plays over 30 years, his eventual recognition as artistic director in 2012 has been blighted by Covid and the death in 2021 of his husband, the great Shakespearean Antony Sher.For his last hurrah he has chosen one of Shakespeare’s oddest late plays: a free-wheeling folk tale set in Ancient Britain, ruled by a Roman vassal king, Cymbeline.",
        "His second wife controls him with potions, and plots against his daughter Imogen and her hapless husband Posthumus so she can install her dimwit son Cloten as heir.The story heaves and lurches like an overladen cargo ship in rough seas.But, ever undaunted, Doran has assembled a crew of long-time collaborators to steer the creaking boat into a safe harbour over an unsteady three hours and 25 minutes.",
        "The always mischievous Alexandra Gilbreath revels in her role as the wicked queen, while Peter De Jersey’s gibbering Cymbeline (below) staggers about, dependent on her medications.Amber James’s Imogen is a vigorous modern young woman, murderously pursued by Conor Glean as her blustering stepbrother. Happily, Imogen finds safety with long-lost real brothers in a cave, who have been fostered by Christian Patterson as a Snowdonian-sized surrogate dad, exiled from court. A Roman platoon then lands demanding deaths and taxes.Yet, for all the rollicking, febrile energies, the production feels (in football terms) like an end-of-season, mid-table clash with neither titles to play for, nor relegation to avoid.This is confirmed by Stephen Brimson Lewis’s strangely glum and unbudging set, featuring a huge yellow disc (both sun and moon) under a solemn blue arch.There is a changing of the guard at the RSC this year with the advent of Daniel Evans and Tamara Harvey as new skippers.But I look forward to Doran’s next show elsewhere, and salute his legacy of loves’ labours in Strat- ford."
    ]
}