{
    "articleURL": "/sport/football/article-12056925/Celtic-fans-display-x-rated-banner-protesting-against-coronation-King-Charles-III.html",
    "content": [
        "Supporters produced banner decrying the coronation of King Charles IIICeltic have a long and storied history of protests against the British royal familyAnge Postecoglou's side were confirmed as champions with 2-0 victory  Celtic supporters produced an x-rated banner protesting the coronation of King Charles III as they were confirmed as Scottish Premiership champions.",
        "Ange Postecoglou's side made it back-to-back league titles with a comfortable 2-0 victory at Hearts, with the club's supporters making their opposition to the British royal family be known.Producing two banners referencing King Charles III's coronation, one read 'f*** the King, crown the champions'.While another, hung from the front of the away end at Hearts, showed a stop sign covering the King's insignia.Unlike in the Premier League, the Scottish footballing authorities left the decision to play the national anthem up to the individual clubs, seemingly in the knowledge that any attempt to enforce an acknowledgement of Saturday's coronation could be met by a furious backlash.",
        "Greeting the coronation with the opprobrium that had been expected, Celtic supporters could be audibly - and visibly - making their opposition be known.It follows incidents involving both clubs following the death of Queen Elizabeth II last September, with Hearts apologising for 'senseless behaviour' on behalf of a section of their support.'The club apologises, on their behalf, to those offended by their senseless behaviour during a time of national mourning,' they said in a statement, 'and we hope that lessons will be learned ahead of future tributes at Tynecastle Park.'Celtic supporters, meanwhile, made their feelings be known at St Mirren following the late Queen's death, chanting 'If you hate the Royal Family clap your hands'.",
        "The chants were accompanied by a banner reading, 'F*** the crown'.Controversy reigned in the Premier League on Saturday evening when Liverpool supporters greeted the national anthem being played at Anfield with loud boos.The club had confirmed pre-match they would play God Save the King, though fans had made clear their displeasure at the decision. Postecoglou had urged supporters prior to that game and a Champions League tie against Shakhtar Donetsk to conduct themselves in a 'respectful manner'.",
        "'I have the same message to our fans that we always have. As I said before the game [against Shakhtar], we will abide by the protocols. We wore black armbands on Wednesday night,' he said.He added: 'I think there's a minute's applause [on Sunday], we will abide by whatever obligations and responsibilities we have as a football club. We will do that in a respectful manner. We want our supporters to do the same.'Rangers played God Save the King before their clash with Aberdeen at Ibrox. Postecoglou's side did not allow the controversial actions of some of their supporters to dampen their spirits, with the players celebrating wildly on the Tynecastle pitch following their victory.Goals from Kyogo Furuhashi and Oh Hyeon-gyu confirmed what has appeared inevitable for some time.",
        "Declaring himself 'super proud' post-match, Postecoglou spoke of a long year and relief of having finally got over the line.",
        "'It feels like it has been a long year and this group of players and the staff have been outstanding,' he said. 'They have been maintaining an almost impossible standard week in and week out and it is a credit to every one of them. I am super proud. 'We won it last year and there is always a danger that guys might get ahead of themselves and get complacent but from the first moment we got back at pre-season, they had a real target to be better and they have done that every day. 'It has just been relentless and I have had the easy bit of watching these guys maintain a ridiculous standard of football and their fantastic commitment to this football club.'"
    ]
}