{
    "articleURL": "/sport/football/article-12043887/Liverpool-1-0-Fulham-Reds-slim-four-hopes-alive.html",
    "content": [
        "Salah netted again after Darwin Nunez was tripped by Issa Dip in the boxThe Reds are four points off Man United in fourth but have played a game moreFulham have now lost three games in a row but remain 10th in the table Mohamed Salah did that little hop as he began his run-up and, before you knew it, he was away celebrating. Another goal for the Egyptian, another win for his resurgent Liverpool team.",
        "As Salah took the acclaim for his 29th goal of the campaign – there are people who will tell you his influence has waned, you know – Marco Silva looked ready to combust. The penalty Liverpool’s main man had dispatched was, to use a word from Fulham’s exasperated manager – embarrassing.Controversy seems to be following referees around at Anfield and this time Stuart Attwell and VAR Tony Harrington were in the line of fire after Issa Diop and Darwin Nunez collided. If Silva was a cartoon character, steam would have been fizzing out of ears, so incensed was he by the injustice.‘In football to give a penalty like that, after the VAR didn’t take that penalty (away) it is difficult to understand,’ Silva hissed. ‘I will say nothing more because it will be difficult for me and I don’t want to create more problems for me.’He might not have wanted to say more but you knew that was never going to be the case. Aggrieved that his team had played so well and had nothing to show for their efforts, Silva couldn’t resist having a go, like the batsman who sees a ball going outside off-stump.",
        "Liverpool: Alisson, Alexander-Arnold, Konate, Van Dijk, Tsmikas (Robertson 66), Henderson, Fabinho, Jones (Milner 84), Salah (Elliott 84), Nunez (Jota 83), Diaz (Gakpo 66).Subs not used: Kelleher, Gomez, Carvalho, Matip.Goals: Salah 39 (pen). Manager: Jurgen Klopp.Fulham: Leno, Soares, Adarabioyo, Diop, Robinson, Lukic (Reed 71), Palhinha, Wilson (Kebano 71), Cairney (De Cordova-Reid 71), Willian (James 80), Vinicius (Solomon 79).Subs not used: Rodak, Tete, Duffy, Harris.Manager: Marco Silva.Referee: Stuart Attwell. ",
        "‘It is difficult to understand that penalty,’ he said, his words coming out rat-a-tat-tat. ‘When Darwin touch the ball he start to dive himself but after he touched his left leg with Issa. For us, it is clear not penalty and the VAR should took that penalty or not allow that decision to go from the referee.’None of this mattered to Salah, of course. He became the first Liverpool player to score in eight consecutive home games and his next goal will put him level with Steven Gerrard on 186, making him joint fifth in the all-time list. Without him, Liverpool wouldn’t be anywhere near the top four.‘We had a conversation,’ Jurgen Klopp said, as he explained how Salah stayed on penalty duties after missing back-to-back kicks against Bournemouth and Arsenal. ‘It was a conversation between two grown men. He wanted to take it. He loves that pressure.’May 3 is a date that has become synonymous with Liverpool booking their place in a Champions League final – last year they were in Villarreal, in 2018 and 2005 – the one that set the ball rolling – was the titanic battle here with Chelsea.Safe to say, however, this occasion was as far removed from those grand stages as could be imagined. Liverpool’s results have picked up of late but don’t kid yourself and think this is an enjoyable surge to the finish line for anyone connected with the club.",
        "The campaign has been a grind from the moment Liverpool almost conceded a goal to the suspended Aleksandar Mitrovic in the opening attack on the opening day; they have been on the back foot ever since and the opportunity to start afresh will be grasped.There seemed something fitting, then, that the first significant piece of action here was from a Liverpool mistake, one which allowed Anfield old boy Harry Wilson to spring the offside trap and roll a ball towards goal that demanded Virgil van Dijk take urgent action.Slowly, Liverpool began to settle down. Key to it all was Trent Alexander-Arnold, who is flourishing in this role that sees him step into midfield and pick passes like a quarterback; the more he gets attuned it, the better Klopp’s team will become.Silva’s team are well drilled and had been equal to the challenge, certainly in terms of defending, so that’s why it would have come as a source of huge frustration to concede as they did after Issa Diop got into a pickle and missed his kick and ended up taking out Darwin Nunez.",
        "Was the penalty soft? Absolutely. It was hard to tell on TV replays just how much contact Diop, who was only playing due to an injury to Tim Ream, made with the Uruguayan but it was sufficient for Stuart Attwell to point to the spot. Salah crashed it down the middle like a golfer on the first tee.",
        "And that was the end of the scoring. Liverpool huffed and puffed in the second period and while they enjoyed territorial dominance, the best opening came to Vinicius, following good work by Willian, but Alisson spread his huge frame and made the save.‘We needed Ali obviously,’ said Klopp, saluting his club’s player of the year. ‘The last one with Vinicius was a sensational save and he was really happy about the clean sheet. More than anybody. Five wins in a row is super difficult. If it was easy, everybody would do it.‘We would have done it earlier. It feels like ages, ages, ages ago we did it. It probably is! If we’re not in a good shape and the level of the goalie drops as well, then we would have been completely lost."
    ]
}