{
    "articleURL": "/tvshowbiz/article-12042823/Antigoni-Buxton-passionately-kisses-new-boyfriend-packing-PDA-sun-soaked-Greece.html",
    "content": [
        "She may have had a hard time finding love in the villa, but it appears Love Island's Antigoni Buxton is having no troubles now.",
        "The singer, 27, was spotted passionately kissing and cuddling up with her new boyfriend Alex Coronado on Wednesday, whilst enjoying a sun-soaked getaway in Athens, Greece. The pair appeared very loved-up as they cosied up to one another and lounged together on the beach.Alex - donning a pair of white shorts, a white cap and proudly showing off his diverse tattoo collection - took the time to snap a cheeky picture of Antigoni from behind.Antigoni looked sensational for the beach day, showcasing her enviable figure in a skimpy white triangle bikini.",
        "She added a colourful chain around her stomach and showed off her impressively toned abs. The beauty accessorised with chic feather earrings and threw on a pair of sunglasses to protect her eyes from the sun.Antigoni styled her blonde tresses in natural loose curls, cascading past her shoulders.Alex is from Costa Rica and currently lives in the US, according to his Instagram page.He boasts over 68,000 followers and regularly shares snaps from his travels. Antigoni rose to fame on Love Island series eight, where she entered as a bombshell on day 17.Though she went on dates with Davide Sanclimenti, Dami Hope and Jay Younger, she ultimately left single.Antigoni does have a string of high-profile exes, including former Love Islander Jack Fowler.",
        "It has been reported that Jack and Antigoni hooked up for a few months but things fizzled out before they got serious.Prior to her brief romance with the reality star turned musician, Antigoni was in a nine-year relationship with her childhood sweetheart before going their separate ways so she could focus on her budding music career.'I've only ever been in love once - I don't think I've been in love since,' she said.'I think I fall in lust and infatuation quickly,' the star also confessed when discussing her past romances before going on the show.She has also been linked to Jack Tyrimos, who featured on Bear Grylls' Treasure Island.Fellow UK Cypriot Jack starred on the 2019 series of the real-life show, which saw a group of individuals left alone to fend for themselves on a deserted island.Since leaving the Love Island villa last summer after a brief stint, Antigoni has been focusing on her music career and even had hopes to represent Greece in the Eurovision Song Contest - though this has ultimately not come to be.The reality favourite, who has Greek/Cypriot heritage, submitted three songs to the country's biggest TV channel, who broadcast the spectacle, after travelling to Athens to showcase her materialAntigoni told MailOnline at the time: 'I'm submitting three songs but one in particular is my favourite.",
        "'It's an up-tempo, powerful, fiery and romantic track with both Greek and English lyrics.'Combining modern sounds and Hip-hop production with Greek traditional sounds and melodies is my style.'It comes after the star enjoyed a night out with fellow Love Islander Danica Taylor as they stepped out at Azura in Camden, London, last month.The singer showed off her incredible figure as she strutted her stuff in a statement ensemble for a fun-filled night out with dancer Danica, 21.Antigoni flaunted her toned midriff in a black cut-out dress with a daring side split and gave herself a few extra inches in a pair of patent knee-high boots.She kept her essentials in a small black handbag and completed her edgy look with  a faux-leather jacket slung across her shoulders.The reality TV star styled her golden locks loosely in natural curls and bolstered her natural beauty with her signature slick of eyeliner.She was joined by her former Love Island co-star Danica, who showed off her enviable figure in a tiny olive skirt and a black crop top. ",
        "Danica added some height to her frame with a pair of black knee-high boots and slung a black handbag over one shoulder.She kept warm amid the cool evening temperatures with a cropped black faux-leather jacket to finish off her chic look.",
        "The reality TV star styled her brunette tresses loosely in glamorous waves and accentuated her striking features with a bronzed make-up palette.The pals both appeared on the summer 2022 series of Love Island and have become fast friends since leaving the villa and are often seen on nights out together."
    ]
}