{
    "articleURL": "/health/article-12059963/Scientists-studying-weight-loss-drugs-Ozempic-Wegovy-treat-DEMENTIA.html",
    "content": [
        "Trials are being launched investigating whether Wegovy can treat Alzheimer'sNovo, the drug's manufacturer, began a three year, 1,800 patient trial in 2021READ MORE: Everything you need to know about Ozempic and Wegovy Scientists believe groundbreaking weight loss drugs could also serve as a treatment for dementia.",
        "Wegovy, Ozempic and Mounjaro are being trialed as medication for neurological conditions by scientists in the US and Europe.It is believed that the GLP-1 receptor drugs could enhance the ability of existing Alzheimer's medication to clear amyloid beta plaques from the brain. Doctors believe these plaques are responsible for cognitive decline.Obesity is a major risk factor for Alzheimer's — which kills 100,000 Americans each year. Experts fear rates will double across the world as people live longer and a larger share of the population is obese.In 2021, Novo Nordisk, manufacturer of Ozempic and Wegovy, launched a massive 1,840-participant, three-year trial to test its drug as an Alzheimer's treatment. The University of Oxford has launched an investigation too.",
        "Novo's trial, dubbed 'EVOKE' is the first of many that have or will launch to test how glucagon-like peptide-1 (GLP-1) drugs work against neurological diseases.Other research, such as a trial led by Oxford University neuropsychiatrist Dr Ivan Koychev, is testing GLP-1 drugs against Alzheimer's and Parkinson's. The foundation of this research was published in 2018, when Johns Hopkins researchers found chemicals that activated the body's GLP-1 receptors showed promise in fighting dementia in mice.'These [drugs] protected neurons from degeneration,' Dr Ted Dawson, a Johns Hopkins University neurologist whose lab led the research, told DailyMail.com.",
        "'A compound that we developed stopped the activation of neurotoxins that kill the brain's neurons.'In the research, published in the journal Nature, a GLP-1 agonist developed by the Hopkins team blocked the harmful effects of amyloid beta, tau and alpha-synuclein proteins.All of these proteins are naturally produced in the brain to serve a role in regulating bodily functions.However, in some cases, they can either become damaged or too active, destroying some of the brain's neurons and causing the cognitive decline that's become a hallmark of dementia and Alzheimer's.Dr Dawson said that his lab completed phase II trials for the agonist as an Parkinson's treatment, and it was unsuccessful.However, they found that it was effective at staving off brain damage in younger people who were not yet affected by the disease. ",
        "One in 60 Americans are already on the drugs, with figures expected to rise over time",
        "Drugs such as semaglutide — the active ingredient in Wegovy and Ozempic — work by activating hormones in the body that stimulate the production of insulin.For a type 2 diabetic, the extra creation of insulin can help regulate blood sugar. This was the goal behind Ozempic, developed by Novo and approved by the Food and Drug Administration (FDA) to treat the disease in 2017.",
        "As a side-effect of the drug, the body would also feel full for longer and no longer feel cravings for food. This lead to users experiencing intense weight loss.After clinical trials showed the drug, alongside a diet and exercise regimen, could help a person lose 15 percent of their weight over 68 weeks, Wegovy received approval in 2021 specifically for weight loss.The pair of drugs has been a golden goose for the Danish Novo, now the Scandinavian nation's most valuable company. Recent data finds that one-in-60 Americans are now on either drug. Market insiders project Novo to rake in $100billion in revenue in the next decade.Dr Percy Griffin, director of scientific engagement at the Alzheimer's Association, told DailyMail.com: 'Given the mechanisms of action of these kinds of drugs and the biological changes associated with Alzheimer’s, it makes sense to examine if these drugs can slow down the progression of the disease.'Alzheimer’s is a complex disease associated with changes in several aspects of brain biology. It is unlikely that one drug would fully stop the progression of the disease. This emphasizes the need for an arsenal of medications which target all aspects of the biological changes to defeat this devastating disease.Dr Suzanne Craft, a geriatric medicine professor at Wake Forest University in Winston-Salem, North Carolina, told DailyMail.com that controlling weight and insulin levels can also help stave off neurological diseases.",
        "Metabolic abnormalities — issues such as high blood sugar, high blood pressure and excess fat around the waste — increase a person's risk of cognitive decline.Dr Craft explains that these issues that GLP-1 drugs work to fight against are directly tied to cognitive issues.'There is a fairly long-standing [research] linking metabolic abnormalities as a risk factor for Alzheimer's,' she said.'We're thinking that curing metabolic defects could help fight the disease.'She said that the drugs would work best when used alongside existing Alzheimer's specific medication, such as lecanemab, approved by the FDA earlier this year. 'That is one of the most promising ways they can be used. There is a lot of evidence linking metabolism [issues] and [toxic proteins].''One of the side effects most worrying about [existing Alzheimer's treatments] is the inflammation they cause on the brain.'Insulin has anti-inflammatory properties.'Lecanemab was a breakthrough drug, showing in trials that it could reduce cognitive decline related to Alzheimer's by 27 percent over 18 months.The drug works by fighting off plaques on the brain caused by amyloid beta.This is done by infusing the brain with antibodies that identify and destroy the protein as it forms.However, as part of this process, the brain will sometimes experience intense swelling. This swelling was linked to the deaths of patients who died during the drug's clinical trials.",
        "Dr Charles Bernick, a neurologist at the Lou Ruvo Center for Brain Health in Las Vegas, Nevada, told DailyMail.com: 'There is evidence that [semglutide] can reduce inflammation in the brain and promote the growth of nerve cells'.These drugs could also help repair the damage caused by the formation of plaque on the brain.Amyloid beta binds to insulin receptors in the brain. This damages the organ's communication network, spurring cognitive decline.Pairing drugs that destroy the proteins with medication that increases insulin secretion will allow the hormone to bind to these receptors.Dr Craft said this would help repair synapses in the brain, which are the points of neurons that connect to send nerve signals.The drugs' ability to help a person manage diabetes and overcome obesity also has a more simple link to preventing Alzheimer's and other neurological diseases.Obesity and type 2 diabetes are known as significant risk factors for cognitive decline. The earlier in life a person gets their overall health in check the better their brain will be in the long term, Dr Dawson said. 'It is very clear if you look at the data that people with type 2 diabetes are more likely to develop Alzheimer's,' he said.'The idea is that [these drugs] would likely lower the instances of Alzheimer's.' ",
        "Dr Griffin added: 'Alzheimer’s is a complex disease associated with changes in several aspects of brain biology. It is unlikely that one drug would fully stop the progression of the disease. 'This emphasizes the need for an arsenal of medications which target all aspects of the biological changes to defeat this devastating disease.'Dr Bernick said: 'The more medicine we have to fight a disease like Alzheimer's... the better.' "
    ]
}