{
    "articleURL": "/wires/pa/article-12056877/Ros-Canter-closes-Badminton-title.html",
    "content": [
        "Former world eventing champion Ros Canter is within touching distance of a first Badminton Horse Trials title after she conquered punishing cross-country conditions to take pole position.",
        "Lincolnshire-based Canter flourished with Lordships Graffalo – Badminton runners-up behind Laura Collett last year – on a day when many combinations floundered.Double Olympic medallist Tom McEwen described the stamina-sapping going as “horrific”, and none of the starters threatened to jump clear inside the optimum time.",
        "Canter collected 11.6 time penalties for an overnight score of 33.7, putting her nine penalties clear of Irish challenger Austin O’Connor and Colorado Blue, with McEwen’s Olympic team gold medal-winning colleague Oliver Townend third aboard Ballaghmor Class on 45.9.Canter, who won the world crown in North Carolina five years ago, can afford to have two fences down in Monday’s showjumping finale and still land the £105,000 top prize.Thirty combinations completed the cross-country test, with almost half the field either being eliminated or deciding to retire.“It felt hard work in terms of galloping,” 37-year-old Canter said. A horse like him should be celebrated – I have not sat on anything like him before  Ros Canter  “He had to dig deep, but he is so honest and is a fantastic jumper. He is economical with his jumping, and you can’t get much better.“A horse like him should be celebrated – I have not sat on anything like him before. Tomorrow is another day, but whatever happens, he is a star.”",
        "O’Connor rocketed 32 places up the leaderboard after dressage, adding just 10.8 penalties to his score in pursuit of a crown that has not been won by an Irish rider since Major Eddie Boylan in 1965.Cork-born O’Connor, who is based in Oxfordshire, said: “The horse was amazing. He is the real deal.“It was the hardest he has had to try in a five-star event, but he is full of class. I’ve got a great team at home and they have kept him very fit.“He is one of the best horses in the world, and I am a lot older than I look! I have ridden a lot of cross-country courses in the wet before.”McEwen, meanwhile, lies fifth on Toledo De Kerser, just behind world number one Tim Price, with Gemma Stevens in sixth and Canter holding seventh spot aboard her second ride Pencos Crown Jewel."
    ]
}