{
    "articleURL": "/wires/reuters/article-12049963/UK-food-bank-users-swap-face-scans-free-food.html",
    "content": [
        "Food bank users buy essentials with face scan",
        "Charities say facial recognition tech reduces fraud, costsPrivacy experts says tech puts vulnerable people at riskBy Lin TaylorLONDON, May 5 (Thomson Reuters Foundation) - Facial recognition technology is helping feed hundreds of struggling Britons, letting them swap a face scan for food of their choice instead of making do with donations and castoffs.With ever more families reliant on food banks to survive runaway inflation in one of the world's richest countries, the option of eating by app is a welcome new choice for many.\"Any food that I like, I can buy. I'm happy they can help us because everything is expensive now,\" said Kazeiban, a 64-year-old woman from Cyprus and convert to the facial payment system.She is one of nearly 200 people a month who uses the face recognition app since her inner-city London charity, Hackney Foodbank, began trialling the system a year ago. The partnership has now been formalised with takeup due to jump this year.Customers can still pick food from the charity's donations - green crates brimming with tinned vegetables, pasta and biscuits - but many prefer to shop by phone, bypassing the stigma that food banks can carry to select groceries of their own choosing.FaceDonate is a social enterprise that lets people buy groceries at a handful of participating shops by scanning their face on an app installed on their mobile phone.",
        "Founded in 2020, FaceDonate is a web platform that lets charities collect and distribute funds to people in need, while also allowing individuals and businesses to fundraise and track how their donations are spent.The food bank says it gives users the freedom to buy what they need, eases pressure on overwhelmed food banks, and lets the charity monitor how money is spent.With more than 1.4 billion people worldwide set to adopt facial-recognition payment technology by 2025, according to Juniper Research, it is a fast-growing industry - but one fraught with privacy risks, digital rights experts say.They say the use of biometric data to unlock help can expose vulnerable groups to data leaks, commercial data exploitation, identity theft and further marginalisation.\"DIGNITY AND AGENCY\"Hackney Foodbank chief executive Pat Fitzsimons said the technology means charities can ensure money is only spent by eligible recipients, reducing fraud and abuse of cash transfers.Users are given digital payment vouchers based on their household size and are barred from spending it on big-ticket items, tobacco or alcohol. Nor can they transfer the funds to anyone else, she said.FaceDonate said it had channeled more than 65,000 pounds ($81,484) to disadvantaged northeast Londoners via face scans since partnering with Hackney Foodbank a year ago.",
        "With Britain's inflation now the highest in western Europe - the annual rate was 10.1% in March - food banks are grappling with record demand amid soaring food prices and energy bills.The Trussell Trust, which supports a network of 1,300 food bank centres including Hackney Foodbank, said it had experienced a dramatic rise in need, distributing a record 3 million emergency food parcels in the past year.\"People don't really want to go to a food bank. There's a sense of shame around it,\" Fitzsimons said.\"But with FaceDonate, they can buy exactly what they want. It gives people dignity and agency. We want them to take control of their lives and not to be passive recipients of our service.\"People can buy fresh, culturally relevant produce seldom found in food parcels, added Fitzsimons, and the programme relieves pressure on stretched food banks since they need fewer volunteers and spend less time and money on logistics.PRIVACY RISKSBut digital rights group Access Now said charities using biometric systems should assess their long-term impact.It says the reliance on biometrics, including iris and fingerprint scans, could put people at risk - be it from data leaks, identity theft, sale of data or the unfair targeting or exposure of marginalised people.",
        "\"Facial recognition is an invasive form of identification and vulnerable people who are in need should not be exchanging their most sensitive information for basic needs,\" said Access Now's Marwa Fatafta.\"You can change your password if it's leaked, but you can't really change your facial features, your biometric fingerprints, your iris geometries and all of that. And that puts people in a very precarious position.\"The technology is no stranger to privacy concerns.In United Nations camps in Jordan, Syrian refugees use iris scans to unlock payments from a digital aid account through blockchain technology, but critics say such systems can sometimes expose these groups to surveillance and commercial exploitation of their data.Global tech giant Amazon has been one of many facial recognition vendors, alongside Microsoft Corp, France's Idemia and Japan's NEC Corp, to call for regulation and said it turned down sales over human rights concerns.Amazon, IBM and Microsoft in 2020 stopped selling their facial recognition software to US police due to fears it could lead to unjust arrests, particularly in Black communities.After a major data leak in 2019, Chinese facial-recognition technology firm SenseNets Technology Ltd exposed sensitive information of millions of Uyghurs, a Muslim minority group subjected to forced labour and torture, the United Nations says.",
        "Christy Lowe, a senior research officer at UK-based think-tank ODI said biometric systems, however well intentioned, can sometimes cause unforeseen problems down the line.When the Taliban took over Afghanistan in 2021, there were fears that sensitive data gathered by aid agencies and the government would fall into their hands and be used to hunt down activists and dissidents.She also questioned whether people reliant on aid and food donations are in a position to give informed consent.\"Do people actually have the ability to say 'no' and is consent really informed?\" asked Lowe.\"Are people trading off a little bit of their desperation or their real need for support by agreeing to terms of data use that they're actually not comfortable with?\"Alberto De Biasio, co-founder of FaceDonate, said no user data - be it addresses, photos or names - is stored on their servers and accounts are deleted if users opt out.FACE PAYMENTSBack at the food bank, customers chatted over coffee as volunteers rummaged through crates for nappies, bread and soap.\"Number nine,\" a staff member yelled as a woman handed over her ticket. She scanned her face, generated a QR code, and in an instant received fresh funds in her FaceDonate account.De Biasio said the tech was easy to use - for shopkeepers and clients alike - given that paying by phone was now so common.",
        "\"It's very convenient, it's like a contactless payment but with a QR code. It's also great for the people who receive it so they can really buy what they need,\" said Kaya Akarsu of Hoxton Brothers Food, one of the London shops working with FaceDonate.For single mother Kadriye, 64, the app lets her buy Turkish groceries for her disabled daughter who can be fussy about food.\"I can buy my country's food. For example, cheese, Turkish food. For me, it's better than taking a tin. Because in my culture, we don't use much (tinned foods),\" she said.\"I don't mind that they scan my face. If I'm coming here everybody see me. If I go the shop everybody see me. Why should I hide my face?\" (Reporting by Lin Taylor @linnytayls, Editing by Lyndsay Griffiths. Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters. Visit https://www.context.news/)"
    ]
}