{
    "articleURL": "/wires/reuters/article-12041495/Block-investors-seek-clarity-Cash-App-Hindenburg-report.html",
    "content": [
        "By Manya Saini",
        "May 3 (Reuters) - Jack Dorsey-led Block Inc's first-quarter results will likely see investors zoom in on the payments firm's Cash App business following U.S. short-seller Hindenburg Research's allegations including inflated user count.Morgan Stanley analysts in April said that some bearish investors remain uncertain about the amount of gross profit that is generated by \"potential illicit activity\" on the Cash App platform.\"Eventually, bears suspect a meaningful amount of gross profit might come under pressure if regulators crack down on Cash App, and also think this makes it hard to accept that Cash App can be a legitimate, trusted bank in the long-term,\" they added.Block has touted Cash App as an alternative to traditional banking services.Meanwhile, the company's revenue growth has tempered over the past few quarters as inflationary pressures forced consumers to defer big-ticket purchases.In its previous earnings report, the payments firm had also said it was \"meaningfully slowing\" the pace of hiring this year to control costs.THE CONTEXTHindenburg, whose report earlier this year triggered a more than $100 billion rout in the shares of India's Adani Group companies, had accused Block of overstating its user numbers by allowing fake or duplicate accounts to exist on its Cash App platform.The payments fintech has denied these claims and has said it would explore legal action against the short seller.",
        "Wall Street analysts expect executives to address how the company reports user count on Cash App and allay worries sparked by the short-seller's report that it has weak know-your-customer (KYC) compliance, a key area of concern for regulators.Cash App reported 51 million monthly active customers as of Dec. 31, of which 44 million were verified.\"Management will likely increase spending on compliance,\" Wedbush analyst Moshe Katri said.Shares in Block have fallen roughly 8% so far this year, to its close on Tuesday. They are down 80% from their August 2021 peak. The payments firm saw nearly $60 billion wiped out from its market value last year.Block is set to report results on Thursday after markets close.THE FUNDAMENTALS* Revenue: Expected to rise nearly 16% to $4.59 billion in Q1, compared with $3.96 billion a year earlier - Refinitiv IBES data* Block is expected to report an adjusted profit of 34 cents in the quarter, up from 18 cents last year WALL STREET SENTIMENT* 32 of 45 brokerages rate the stock \"buy\" or higher, 11 \"hold\" and 2 \"sell\", according to Refinitiv IBES data* Median PT is $93, implying a roughly 61% upside to the stock's close on Tuesday(Reporting by Manya Saini in Bengaluru; Editing by Sriraj Kalluvila)"
    ]
}