{
    "articleURL": "/sport/college-basketball/article-12061205/West-Virginia-coach-Bob-Huggins-uses-homophobic-slurs-referencing-Xavier-basketball-fans.html",
    "content": [
        "Huggins was a former head coach at Xavier's rivals the University of Cincinnati He released a statement apologizing for his words saying he was 'ashamed'DailyMail.com provides all the latest international sports news West Virginia University men's basketball coach Bob Huggins used a homophobic slur multiple times on a Cincinnati radio show Monday afternoon referencing fans of Xavier University.",
        "Before becoming the second-winningest coach in West Virginia basketball history, Huggins was the head coach at the University of Cincinnati from 1989-2005. The 69-year-old was inducted into the Hall of Fame last September.Cincinnati and Xavier are both rivals in the same city and take part in the 'Crosstown Shootout' every year.Speaking on Bill Cunningham's radio show on WLW, Huggins referenced a time that Xavier fans '[threw] rubber penises on the floor and then [said] they didn't do it, by God they can get away with anything'.After the radio host joked that it must have been 'transgender night', Huggins then said, 'It was a Crosstown Shootout, yeah, no, what it was, was all those f**s, those Catholic f**s I think' before quipping that they threw those objects because 'they were envious they didn't have one.'",
        "The radio hosts laughed at Huggins' statement, adding, 'isn't he the best?' Huggins later released an apology through the WVU men's basketball twitter account, saying, 'Earlier today on a Cincinnati radio program, I was asked about the rivalry between my former employer, the University of Cincinnati, and its crosstown rival, Xavier University.'During the conversation, I used a completely insensitive and abhorrent phrase that there is simply no excuse for - and I won't try to make one here.",
        "'I deeply apologize to the individuals I have offended, as well as to the Xavier University community, the University of Cincinnati, and West Virginia University.'As I have shared with my players over 40 years of coaching, there are consequences for our words and actions, and I will fully accept any coming my way.'I am ashamed and embarrassed and heartbroken for those I have hurt. I must do better, and I will.'Huggins has the most wins in Cincinnati men's basketball history with 399 over a 16 year tenure. He then went on to coach one season at Kansas State before taking the job with his alma mater West Virginia in 2008."
    ]
}