{
    "articleURL": "/wires/pa/article-12046693/Stephen-Tompkinson-s-neighbour-tells-court-saw-slap-punch-drunk-man.html",
    "content": [
        "The neighbour of actor Stephen Tompkinson has told a court she saw him slap and punch a drunk man in the head after asking him to move away from his home in the early hours of the morning.",
        "The 57-year-old DCI Banks star is on trial at Newcastle Crown Court accused of inflicting grievous bodily harm on Karl Poole on May 30 2021.Jurors have heard Mr Poole and his friend Andrew Hall had been drinking since around midnight and had gone to the beach to watch the sunrise before walking back past Tompkinson’s home in Whitley Bay, North Tyneside.Tompkinson went outside to confront the two men for making noise outside his home and called the police asking for them to be moved on, the court has heard.On Thursday, Tompkinson’s neighbour, Caroline Davidson, said she was woken by “hysterical laughter” and looked out of her bedroom window to see two men lying on the floor.",
        "She told the court the men appeared “very drunk”, were “wobbling” from side-to-side and one of them (Mr Poole) was just wearing boxer shorts.Mrs Davidson said she went back to bed but got up again when she heard a voice with a “different tone”.The court heard she knew Tompkinson as the resident of the house across the road but had not spoken to him since he moved in two or three years previously.Mrs Davidson said Tompkinson “was using hand movements to ask them to move away” and at one point “pulled his fist back” but put it down “more or less straight away” before walking back towards his house while apparently making a phone call.",
        "She told the court the two men then got up with some difficulty, put their arms around each other and “started to try and walk off” when her neighbour came out again.“The two males started to turn. You could see maybe something was being said.“The next thing I knew the neighbour had stepped forward and he had slapped one of the gentlemen, the one without the top on, with his right hand and then punched him on the head with his left hand.”Asked by prosecutor Michael Bunch if there was anything that “precipitated that action”, Mrs Davidson said: “No.”",
        "She said she was “100% sure” that the neighbour had moved towards the two men.Mrs Davidson told the court Mr Poole “stumbled backwards and fell”.“He just went straight back and his head hit the ground. He just, he didn’t move.“He didn’t even put his hands out to stop himself, he just hit the ground.”Mrs Davidson said Tompkinson came out of his house when the police arrived and spoke to two officers.She said he then placed a bottle of Jagermeister at the feet of the man lying on the floor.Jurors have previously heard Tompkinson told police he had taken a bottle from the two men.",
        "Asked if the two men made any aggressive actions towards her neighbour at any point, Mrs Davidson said: “No.”Cross-examining Mrs Davidson, Nicholas Lumley KC, defending Tompkinson, said: “I’m going to suggest what you saw was a reaching out, a push to the face, not a slap to the face.”Mrs Davidson replied: “Absolutely not.”Mr Lumley also said Tompkinson had his phone in his hand throughout the incident after calling the police and “there is no way he could punch with his left hand and slap with his right”.Also giving evidence on Thursday, Mr Hall said he heard a “cracking” when Mr Poole’s head hit the floor.He told the court he “heard the hit of flesh” and saw his friend fall to the ground, but in cross-examination by Mr Lumley said he only heard Mr Poole’s head hit the floor and did not hear the sound of the impact that caused him to fall.Asked what Tompkinson did after Mr Poole was on the ground, Mr Hall said: “I think he had his phone out but it was clear he wasn’t ringing for help.“Later on, I don’t know the timescale, he showed a bit of humanity and a bit of remorse in my view, it must have sunk in what happened, but it didn’t initially.",
        "“I believe he was on his haunches with his hands on his head.”Jurors have heard Tompkinson told police he pushed Mr Poole away in self-defence after the two had come towards him.In a transcript from Tompkinson’s police interview read in court, the defendant said: “No, I really can’t afford to in my job” when asked whether he had hit either of the two men.He told officers he could not have thrown a punch with his left hand because he was holding his phone, and that he had put his hand out to stop them.“They were coming towards me aggressively and my front door was open,” he said.Tompkinson denies the charge and the trial continues."
    ]
}