{
    "articleURL": "/news/article-12041825/Cyclist-pedals-road-fails-use-Britains-biggest-bike-lane.html",
    "content": [
        "A cyclist has been pictured riding his bike the wrong way down a Dorset road while ignoring a controversial new cycle path that caused drivers months of misery. ",
        "The bike rider was spotted ignoring the double lane cycle path as he rode down Wimborne Road East in Ferndown, Dorset while engrossed in his phone.The pictures shows the cyclist slipping past a line of held up cars, seemingly oblivious to the 11-foot wide cycle lane to his right.  The two-way cycle path, dubbed 'Britain's biggest bike lane,' was completed last year as part of Dorset's £120 million plan to reduce congestion and boost sustainability. Construction of the cycle lane caused huge delays for drivers while it was being built between May 2021 and June 2022. ",
        "Now, drivers have said there's not enough room for cars, after the busy B road it runs alongside was narrowed to make space. Locals have complained the mega cycle path also fails to leave enough space for emergency services to slip past traffic.In January, a Fiat 500 got stuck on the cycle lane's six inch curb after making way for an ambulance racing to the scene of an emergency. ",
        "The double-lane path is one of four cycling routes being built in Dorset, with £100m funding from the government's £4.5 billion Transforming Cities Fund. However, drivers hit out the initiative, calling it 'a pointless waste of money.'The instead claimed that cyclists prefer to ride their bikes down the road.  ",
        "Motorists also urged Dorset Council to spend the money to fix potholes instead, as they said extensions would cause even more 'misery' for drivers. Debbie Small said: 'Millions of pounds on cycle paths for what? They still ride on the road.'Millions of pounds putting in pointless traffic lights for what? To block the present traffic flow. This is all becoming a joke.'She called on Dorset Council to 'sort out the dangerous roads with pot holes which are becoming bigger and bigger every time it rains and repair the surfaces which are now worse than the roads the Romans built.'Bournemouth resident Kjeld Smedley hit out at 'Dorset Council, as she said the authority and its 'transforming travel initiative are not fit for purpose.''This ridiculous road improvement scheme with narrowed roads in favour of pointless wide cycle lanes is clearly the brainchild of someone or some people desperately trying to justify their jobs.'You are about to cause another extended period of travel misery for everyone in the Ferndown area for a cycle path that hardly gets used while reducing the width of the road.'Everyone trying to get to their place of business, getting to work and getting kids to school are about to suffer weeks of works being carried out because of some misguided green initiative.' ",
        "Drivers also claimed Dorset Council has been taken over by 'cycling zealots' as they called for a referendum on its cycle route plans.Jenny Mills said: '[The] roads were inadequate before all the cycling zealots got on the council. When will they realise you cannot make people cycle? Dorset is a route to the West Country and the road system is frankly c***.'Another Dorset resident called for a referendum on the matter, so local people could have their say on the 'nonsense' project.Nick Jackson said: 'The population should have been given a referendum on implementing this nonsense, rather than forcing it upon us.'Dorset Council say the cycle lanes will encourage local people, including school children, to adopt healthier lifestyles and help the environment.The local authority has asked residents and businesses in the area to allow extra time for journeys.In a planning document, the council claims a slight majority of 56% of people surveyed agreed with its plans, while a minority of 41% disagreed. ",
        "Conservative councillor Ray Bryan, Dorset Council's portfolio holder for highways, travel and environment, said the local authority's transport plans are aimed at making safe routes for school children. 'A big motivation of our Transforming Cities Fund programme work is to provide safe routes for cycling and walking, particularly for school children, to encourage everyone to get into the habit of using active travel where possible, benefiting their health and the environment' Mr Bryan said.",
        "'We're really pleased with the progress we're making on this major green travel route along Wimborne Road.'With access to the three Ferndown schools off this section of Wimborne Road East, these cycle, walking and bus lane improvements are a particularly important part of our local active travel infrastructure.'The councilor also disputed claims that cyclists were not using the new lanes, adding: 'The vast majority of cyclists use our new cycle lanes where they are available.'We are committed to investing in sustainable, inclusive, active travel infrastructure so that everyone, from young children to the elderly, feels safe and confident cycling, walking and wheeling locally.'We are currently in the construction phase of these sustainable travel improvements.'Once the full network of cycle lanes are built we will be producing an evaluation report to analyse the success of the programme against a number of metrics, including cycle numbers, the level of traffic congestion, carbon and public health benefits.'More sustainable forms of transport aim to transform local travel, reduce road congestion and greenhouse emissions, improve air quality and bring economic and health benefits.'"
    ]
}