{
    "articleURL": "/wires/ap/article-12060569/Column-F1-drivers-unhappy-Miamis-pomp-circumstance.html",
    "content": [
        "MIAMI GARDENS, Fla. (AP) - The stars of Formula One stood under the hot Florida sun mingling with LL Cool J, the chosen A-list celebrity tasked with hosting an elaborate pre-race ceremony ahead of the Miami Grand Prix.",
        "The festivities in the 30 minutes leading up to the start of the race featured a new single by Will.I.AM called \"The Formula\" created specifically for F1. The performer led an orchestral performance - yes, there was a symphony assembled on the starting grid - that played his new tune as LL Cool J hyped each of the 20 drivers as he introduced them to the crowd.It was all so very American. And it irked many of the F1 stars.George Russell, the director of the Grand Prix Drivers Association, was the first to take the issue public following Sunday's race. The Mercedes driver said drivers met two days before the race and expressed their displeasure with the pomp and circumstance, which far exceeded the normal ride around a circuit while waving to the fans as the traditional pre-race activity.Russell said it was hot as they waited for LL Cool J to call their name. And the drivers were were only moments away from a 57-lap race in which they'd prefer to use their time mentally preparing for twists and turns.\"I guess it´s the `American way´ of doing things during sport,\" the British driver said. \"I am here to race. I´m not here for the show, I´m here to win. I don´t think there is any other sport in the world that 30 minutes before you go out to do your business, you are out there in the sun, all the cameras on you and making a bit of a show of it. I can appreciate that in the entertainment world.\"",
        "\"We are open to changes, but I guess we wouldn´t want to see it every weekend.\"As the list of grumbling drivers grew following Max Verstappen's third win of the season, F1 on Monday said the drivers had indeed expressed concern about the timing of the pre-race activities but agreed to give it a try. A spokesman said F1 would continue discussions with the drivers over special pre-race shows, which is anticipated at no more than seven events this season and all tailored to the specific race.F1 promised further discussions with the drivers' association, and stressed the only real complaint was \"the extra time\" it took.Seven-time champion Lewis Hamilton of Mercedes was one of the few drivers who enjoyed the activities. He actually started to laugh before addressing the issue.\"I think it's cool that the sport is continuously growing and evolving and not just doing the same stuff they've done in the past,\" Hamilton said. \"They are trying new things. They are trying to improve the show, always, and I am in full support of it. I mean, geez, I grew up listening to LL Cool J and LL Cool J was there. That was cool.\"Haas driver Nico Hulkenberg, back in F1 after sitting out three seasons, said he enjoyed the introductions: \"I had some goosebumps actually. I quite liked that part.\"",
        "The reality is that this is how big events are in the United States, where the Super Bowl is nearly as much spectacle as it is the NFL's pinnacle game. The Indianapolis 500 is actually called \"The Greatest Spectacle in Racing\" and includes an elaborate pre-race show that includes the Purdue marching band, the singing of \"(Back Home Again in) Indiana,\" and introductions that differ from every other race.An IndyCar race at Iowa Speedway last year featured top musical acts before and after each of the two races; multiple drivers were in the crowd at the Gwen Stefani show even though they had to race within the hour.The Daytona 500 is NASCAR's biggest spectacle, but all NASCAR races include elaborate pre-race shows with concerts, celebrities giving the command to start the engines and usually a military flyover.With two more stops in the U.S. this year (Austin, Texas, and Las Vegas), the F1 drivers should probably expect the extravagant. The promoter at Circuit of the Americas in Texas has upped the game in the last three years with celebrities and Shaquille O'Neal delivering the winning trophy in a customized Cadillac Eldorado Convertible dubbed \"The Badillac.\"The Las Vegas race, expected to be the most expensive for spectators on the 23-race schedule, is certain to be filled with the showgirls and superstars of Sin City. F1 will likely spare no expense to make it the biggest event seen in decades.",
        "It's what the fans are paying to see, whether the drivers like it or not. After all, social media was ablaze Sunday with spectators shell-shocked by the $250 watermelon and tomato salad or the quality of a $42 wagyu beef sandwich sold at a concession stand.\"I thought this was a different currency at first,\" one fan wrote on a social media post that showed a menu of offerings at Sunday's race.The Miami Dolphins own the Miami Grand Prix and team CEO Tom Garfinkel, managing partner of the event, has acknowledged they may try to make it a night race moving forward to avoid the heat. His group overcame the complaints that followed last year's inaugural race - long water lines, not enough shade, a campus too big to navigate and sub-par track surface - to stage a much smoother show last weekend in Year 2.With all the upgrades came the elaborate pre-race show. Garfinkel said he isn't concerned that three races in the United States will dilute F1's growing North American market, and said each of the three events should focus on their own identity.\"I think they all have different virtues and reasons to go,\" Garfinkel said. \"I think the thing that is the same is it's the same cars and drivers, the same competition. Everything around it can be different. Montreal is very different from Singapore.\"",
        "For the record, Sunday was a sold-out crowd of 90,766 and F1 said Miami drew 270,000 spectators over the three-day weekend. It was organizers' desire to be better than last year's debut Miami race that led to the elaborate pre-race show.\"This year, it´s like, `OK, we want to try to be perfect. We´re not just trying to pull it off,´\" Garfinkel said. \"We can just go make an investment and do it. I say, `We need to spend more money than we originally anticipated. We want to make this best-in-class.´ And (Dolphins owner Stephen Ross) said, `Just go do it.´\"___AP auto racing: https://apnews.com/hub/auto-racing and https://twitter.com/AP_Sports"
    ]
}