{
    "articleURL": "/sciencetech/article-12059751/Lord-Wings-New-butterflies-named-Lord-Rings-villain-Sauron.html",
    "content": [
        "Lord Of The Rings' Sauron has lent his name to a new group of butterfliesThe black rings on the orange wings are reminiscent of the all-seeing eyeHe's one of the most famous villains in literature, and now Lord Of The Rings' Sauron has lent his name to a new group of butterflies. ",
        "The black rings on the vivid orange wings of the flying insects are reminiscent of the all-seeing eye described in JRR Tolkien's books, and depicted in the movie series.Scientists, including Dr Blanca Huertas, senior curator of butterflies at the Natural History Museum, have given the new genus the name Saurona.While there are currently only two members of this new group – Saurona triangula and Saurona aurigera – many more as-yet-undescribed species are thought to exist.Saurona is one of several new butterfly groups described by an international team of researchers in a new paper, and one of two named by Dr Huertas.",
        "Dr Huertas and a fellow researcher named the second genus Argenteria, which translates into English as silver mine, on account of the silver scales on the wings.Dr Huertas said: 'Naming a genus is not something that happens very often, and it's even more rare to be able to name two at once.'It was a great privilege to do so, and now means that we can start describing new species that we have uncovered as a result of this research.'She added: 'Giving these butterflies an unusual name helps to draw attention to this underappreciated group.'It shows that, even among a group of very similar-looking species, you can find beauty among the dullness.'",
        "Experts suggest this interest can in turn yield research with important findings, including whether species are endemic to an area, or vulnerable to extinction.The wider research was a culmination of a decade's worth of work to study the butterfly subtribe Euptychiina, carried out by a team of 30 scientists collaborating across the globe, including researchers from Natural History Museum London, Harvard University, Florida Museum of Natural History, and Zoological Research Museum Alexander Koenig.",
        "More than 400 different species were analysed, with the Natural History Museum's butterfly collections of more than 5.5 million specimens contributing significantly.Researchers were able to use advances in DNA sequencing to identify similar-looking species not only by their appearance but also by their genetics.While Saurona triangula and Saurona aurigera are the first butterflies named after Sauron, a dung beetle, a frog and even a dinosaur have been named after the villain, also in reference to the eye.The findings are published in the journal Systematic Entomology.",
        "A 'cursed' Roman ring that was dug up by a farmer is believed to have been the inspiration behind JRR Tolkien's The Hobbit.The piece of gold jewellery, known as the Ring of Silvianus, was discovered close to the Roman town of Silchester, Hampshire, in 1785.The celebrated author was called in to investigate the incredible story of the ring's past just two years before his famous novel was published. ",
        "It is thought it was unearthed by a farmer ploughing his field close to the Roman town in the 18th century.Historians believe the large 12g gold ring once belonged to a Roman called Silvianus but he put a curse on it after it was stolen.It is so large that it will only fit on the finger of a gloved hand. It has a Latin inscription which says 'Senicianus live well in God'.JRR Tolkien, who was an Oxford University professor with expertise in Anglo-Saxon history, is thought to have drawn inspiration from the tale when he started work on The Hobbit.",
        "The book, which has a ring at the centre of the plot, was published in 1937 and was well-received by critics. The novel, which was turned into a film in 2012, was the precursor for the Lord of the Ring trilogy.After the ring was discovered in a field it is thought to have been sold to the Chute family who owned The Vyne, a 16th-century country house outside Sherborne St John near Basingstoke in Hampshire. It then passed into the hands of The National Trust when it was bequeathed the property by its final owner.It was several decades after the farmer found it before the curse was discovered on a tablet in Lydney, Gloucestershire, more than 100 miles away.",
        "The victim, Silvianus, knew the thief responsible and called on the god Nodens to strike him down.The great archaeologist Sir Mortimer Wheeler, the director of later excavations at Lydney, realised the connection between the ring and the curse tablet, and in 1929 asked JRR Tolkien to work on the etymology of the name Nodens.The tablet said: ‘To the god Nodens: Silvianus has lost his ring and promises half its value to Nodens.'Among those named Senecianus, let none enjoy health until he brings it back to the temple of Nodens.’ Senicianus apparently only got as far as the field in Silchester when he abandoned the ring."
    ]
}