{
    "articleURL": "/news/article-12043963/Melbournes-Richmond-injecting-room-Single-photo-addict-clutching-two-syringes-sparks-uproar.html",
    "content": [
        "Melbourne's drug injection room is open next to a schoolThe site could become a permanent facility on ThursdayParents say their kids are exposed to drug usage every day A confronting video has emerged showing a nurse helping a drug addict find a vein in a medically supervised injection centre in Melbourne, as a local campaigner claims nearby streets have turned into a 'ghetto'.  ",
        "The video comes as a new disturbing picture being shared by locals of a drug addict sprawled in a gutter clutching a syringe exposes the reality being faced by residents living near the controversial injection room. The Richmond community, in Melbourne's CBD, has long protested the location of medically supervised injection room (MSIR) next to Richmond West Primary School, which is being trialled for five years.However, tensions with the Victorian Government have come to a head with a proposal to turn the centre into a permanent facility set to be debated in parliament on Thursday.Residents claim drug-users are attracted to the area and - while the authorities argue the centre is preventing overdose deaths - some addicts loiter near the facility due to a legal loophole that prevents drug-related arrests within 300m of the room.The shocking picture of the man in the gutter in North Richmond, having suffered an apparent overdose, emerged on Thursday prompting locals to say: 'Our community deserves better'.It comes as further images shared by local residents showed 'meth and heroin zombies' huddled in parks, syringes left discarded in the middle of footpaths and children as young as six walking past addicts. ",
        "The injection room, which opened in 2018, is designed to help prevent overdosing deaths by letting users inject drugs in a safe place where they can seek immediate medical help. ",
        "Local of 23 years, Sharon Neven, 58, told Daily Mail Australia the room has devastated the local community - and argues that the centre should be set up in a more urban area, as a similar facility is in Sydney's Kings Cross, rather than close to residents. 'There are people who are publicly injecting in our kids' parks. There are people injecting in front of our faces,' she said.'Kids still have to walk to and from school so they have to walk past this behaviour - people naked, people running around with their tops off.'We have our cars broken into, our homes broken into. The police do nothing. The drug dealers are winning.'The fact (the room) is outside our maternal health clinic, our health clinic and next to a primary school, I have issues with that.'Ms Neven told ABC 7.30's Elias Clure the area - which has long been known as a haven for drug users, even before the centre was set up - has been transformed.'This was a really popular street for people all over Melbourne to come and eat Vietnamese food but now it has just turned into a slum,' she said.'We had a lovely wine bar there and it's just turned into a ghetto.'",
        "Mr Clure questioned: 'You don't think it's a bit strong, that language?'Ms Neven shot back: 'No, I don't because you have got drug dealers sitting right outside Aldi all day, every day.'During a rare look inside the injecting room, the ABC program showed viewers how patients go about using the facility.Footage shows users are first asked what sort of drug they will be using - any drug is fine, so long as it can be injected - and are escorted to a booth.Staff then use a bright green light to help them to find a 'safe' undamaged vein to inject in - which can often be a struggle for long-term addicts.Patients are can either choose to stay at the facility's aftercare section or leave once they've been injected. In an open letter to Victorian Members of Parliament, residents said 'when it comes to the supervised injecting room, you have sadly let our community down at every opportunity'.'We had no warning about the MSIR trial being cut short, and barely a few days' notice that the final decision to make it permanent would be this week,' the letter, seen by the Herald Sun, reads.'Only a small handful of you, who will soon vote on what our children's future looks like, have made any effort to speak to us.",
        "'This government has made it clear that it treats drug addicts with more respect than residents.'",
        "The letter also highlights how the injection site has strained emergency services with ambulance call-outs in the area up 101 per cent since it opened.'You can't say our children are not at risk when you need to install security fences, CCTV and constant security guards at the gates just so they can attend school every day,' it reads.'How can you ignore our school council's pleas after the safety audit identified a likely and foreseeable risk of catastrophic harm?",
        "'We've had more dead bodies in the streets since the room opened than ever before.'This trial has not been a success by any measure that balances the community impact.'Victorian Premier Daniel Andrews revealed the findings of an independent review in early March and voiced his support for a permanent injection facility. 'Whilst there are still challenges — and the report speaks to safety as well as amenity and making further improvements, further wrap-around services — it is very clear that this facility has changed lives and saved lives,' he said.'Stories of people dying in laneways and gutters, stories of, literally, dead bodies throughout that local community (before the room opened) meant that we needed to do something different, something challenging.'",
        "He claimed the room is Melbourne's solution to a growing drug problem with users able to access mental health support, drug treatment and blood testing at the site. In their letter, residents pleaded for MPs to consider the damage the room is doing to their community in its current location.'All our community has ever wanted is to work with the government to find a solution that properly balances the safety and wellbeing of residents and those who use supervised injecting facilities,' the letter reads.'If this is about harm minimisation, our community is asking that you vote in a way that considers the very real and current harms faced by us and our children every day that this room continues to operate where it is.'",
        "A North Richmond Community Health spokesperson told Daily Mail Australia: 'The Medically Supervised Injecting Room (MSIR) saves lives and connects people to critical health and social support services.'For more than 5 years, trained and experienced staff from the medically supervised injecting room have safely managed more than 6,000 overdoses onsite and saved at least 63 lives.'The service has also removed barriers to critical health and social supports for people who need them. 'Dedicated staff have provided more than 112,000 health and social services onsite including Hepatitis C testing and treatment, homelessness support, mental health support, dental, GP and addiction treatment.'",
        "'Critically, more than 700 people have now started specialist treatment through the MSIR to help manage their addiction.'In response to claims syringes have been left discarded around the neighbourhood, the spokesperson said: 'We conduct a Needle and Syringe Program at the MSIR, which has been a highly successful harm reduction intervention.'There are facilities to safely dispose of injecting equipment on site. We work closely with Victoria Police and the City of Yarra to monitor behaviour beyond the MSIR grounds and limit the number of needles being disposed in the surrounding streets.'NRCH staff undertake outreach several times throughout the day, including in the morning, to collect inappropriately discarded equipment. 'We working with the City of Yarra to increase the number of sweeps they do for discarded equipment in recent years.'Daily Mail Australia has contacted the Victoria Department of Education for comment. ",
        "North Richmond Community Health described the MSIR as: 'A hygienic place where people can inject drugs in a supervised health setting. 'This means if someone overdoses in the room, a staff member can respond immediately. 'It's also a place to access other health services like mental health support, drug treatment, wound care and blood testing.'The North Richmond MSIR is located next to the community's health centre and Richmond West Primary School. It has safely managed more than 6,700 overdose incidents and screened over 1,400 patients for Hepatitis C. "
    ]
}