{
    "articleURL": "/tvshowbiz/article-12056117/Moana-Hope-reveals-main-priority-following-shock-split-model-wife-Isabella-Carlstrom.html",
    "content": [
        "Moana Hope has revealed her main priority following her shock split from model wife Isabella Carlstrom ",
        "The AFLW star, 35, told the The Herald Sun on Sunday that the most important thing in her life right now is ensuring their children are taken care of. 'My priority is my children,' Hope told publication. 'Any free time I have outside of work is dedicated to them, and they are the most important part of my life right now,' she continued.The couple share two children, daughter Svea, born to Carlstrom, and son Ahi, who Hope carried. ",
        "Ahi, at ten months, is already keeping his mother busy and developing a close bond with his sister Svea.Hope is slated to participate as an ambassador for Cocobella in the upcoming Mother's Day Classic, a charity fun run held at Alexandra Gardens in Melbourne to raise funds for breast cancer research.It comes after Moana appeared to confirm rumours she'd split from Isabella by changing her Instagram bio to an emoji of a single woman and two children.Moana's Instagram bio previously included a mention of her wife.She last shared family photos with Isabella and their daughter Svea on April 17 as part of a Mother's Day campaign for Pandora.The sports star and the model tied the knot back in August 2019.",
        "Isabella gave birth to their daughter Svea in November 2020 and Moana carried their son Ahi, whom they welcomed in June last year.",
        "Moana and Isabella went through IVF to conceive their two children using the same donor.In a raw conversation with Dr Golly and the Experts several weeks ago, Moana said her postpartum depression was so severe she almost abandoned her family.'I just had moments where I felt like I'm not good enough to be [the children's] mum. I need to leave. It was about three occasions all up,' she revealed.",
        "'I almost got in a car and drove away because I just felt like I wasn't going to be a good enough mom for [Ahi]. It was fear.'The retired athlete went on to say her postpartum depression went hand-in-hand with her 'anxiety' and 'childhood trauma'.In an emotional moment, she confessed she was 'physically abused' throughout 'a large portion of my childhood'.'My anxiety got so bad that I thought I was going to wake up and inherit [the abuser's] anger. So I always thought, 'I don't want to be around my kids if I turn into [that],'' she confessed.Isabella then revealed she knew Moana's childhood trauma would be 'triggered' by the 'trauma' of giving birth and asked her to see a 'psychiatrist' about it.The podcast was released on Wednesday, but Daily Mail Australia understands it was recorded just weeks before their rumoured break-up.",
        "Hope has previously discussed her tough upbringing with '19 kids in the one house'. Speaking to 9Honey Parenting, Moana also opened up opened up about caring for her sister Lavinia, who suffers from a rare neurological condition called Moebius Syndrome.Moana became her sole carer when she was 26 years old. "
    ]
}