{
    "articleURL": "/news/article-12046593/Pregnant-mother-five-35-fell-20-foot-drain-feared-lose-baby.html",
    "content": [
        "Andrea Harris fell into the unsecured manhole in Scotland after knocking its lidShe had to be rescued by her partner and was five months pregnant at the timeA mother-of-five has told how she feared she had lost her unborn baby after plunging down a 20ft drain.  ",
        "Andrea Harris, who was five months pregnant, was walking with her three-year-old twin girls when she kicked the lid of an unsecured manhole in Boydstone Road in Lochwinnoch and fell down the shaft last July.The 35-year-old was rushed to Crosshouse Hospital in Kilmarnock, after her partner Stuart managed to pull her out of the drain.Terrifyingly, Andrea feared she would lose her unborn baby after she suffered bruised ribs and painful hematomas on her stomach during her plunge. Andrea, who gave birth to healthy baby Rayne in November last year, is now embroiled in an ongoing fight to find out who is responsible for maintaining the faulty drain and actioning a repair.",
        "She said: 'No one wants to take accountability. I've been going backwards and forwards with Renfrewshire Council and other organisations for almost a year now. I've never had an apology.''I am incredibly lucky that my baby and I weren't hurt even more. But this should never have happened in the first place.'I'm being passed from different organisations with no one able to tell me who is responsible for the manhole. That's what makes me really angry.'Andrea had just put her twin girls, Khloe and Keeva, into partner Stuart's car when the freak accident occurred on July 22 last year. ",
        "She said: 'I was chatting away to the girls and the next thing I knew I was just hanging there. I'd obviously hit the drain with the back of my foot and the lid has spun round.'My arms were hanging over it but my body went down the hole. If it wasn't for the lid, I'd have gone the whole way down. It's about 20ft deep with water at the bottom.'I was screaming and my partner was looking about trying to find me. The kids were hysterical.'My baby bump hit off the ladder rungs inside the hole. Thankfully my partner managed to drag me out and drove me straight to the maternity unit at the hospital to get the baby checked over.",
        "'When we got there, they said I also needed to go to A&amp;E to get myself looked at too because I was in so much pain. Thankfully Rayne looked okay but I was to go straight back if I started bleeding or if I started having any shooting pains.'I had bruised ribs and hematomas on my stomach. I was in absolute agony. For days, I could hardly walk.'Andrea, from Kilwinning, told how the incident has had a lasting impact on the family.She said: 'When we go out now and there's a drain, my twins that were with me that day will walk round it. They're petrified because they obviously watched me going down.",
        "'Even if I had seen that specific manhole, there's no way I'd have walked on top of it. The concrete around the manhole was all crumbling away so it clearly hadn't been looked after for a while.'I'm just glad that it was me who walked on the grass and not the twins because that doesn't even bare thinking about.'Scottish Water and Transport Scotland have said the drain does not belong to them.A Renfrewshire Council spokesperson said: 'We're sorry to hear of this incident. As soon as it was reported to us we secured the area and reported the defect to the relevant authorities who have carried out a repair and installed a new cover.'"
    ]
}