{
    "articleURL": "/wires/reuters/article-12060261/China-Pakistan-urge-Afghan-aid-delinked-political-considerations.html",
    "content": [
        "By Ariba Shahid",
        "KARACHI, Pakistan, May 8 (Reuters) - China and Pakistan on Monday urged donors to bridge gaps in humanitarian funding for Afghanistan, saying aid should be delinked from \"political considerations\".Aid to Afghanistan will drop sharply this year as donor countries seek to challenge curbs on female aid workers imposed by the Taliban administration and try to cope with an increase in crises around the world, international officials say.The United Nations said last week it would continue to keep its staff at home after the administration in Kabul began enforcing a ban on Afghan women working for the world body.\"The Ministers underlined that humanitarian support to the people of Afghanistan must remain delinked from any political considerations,\" the foreign ministers of China, Pakistan and the Taliban administration said in a joint statement.They called for the lifting of unilateral sanctions against Afghanistan to create opportunities \"for economic development and prosperity in the country,\" the ministers said after a trilateral meeting in Islamabad.The statement noted the Afghan Interim Government´s repeated assurances to respect women´s rights and urged donors to support Afghanistan's reconstruction so as to protect the rights and interests of all Afghans \"including women and children\".According to U.N. data, the United States was the largest donor to the U.N. appeal last year, giving nearly $1.2 billion. So far the United States has given the most money to the 2023 U.N. appeal: $75 million; despite that funding is drying up with a $4.6 billion U.N. appeal less than 7% funded.",
        "The United Nations Development Programme has said the Afghan economy is at risk if aid continues to dry up.Since toppling the Western-backed government in 2021, the Taliban administration has also tightened controls on women's access to public life, including barring women from university and closing girls' high schools.The Taliban says it respects women's rights in accordance with its strict interpretation of Islamic law. Taliban officials said decisions on female aid workers are an \"internal issue.\" (Reporting by Ariba Shahid in Karachi, Editing by William Maclean)"
    ]
}