{
    "articleURL": "/tvshowbiz/article-12051911/Brendan-Fraser-picky-role-winning-Oscar-Whale.html",
    "content": [
        "Brendan Fraser is in the catbird seat when it comes to choosing his next project.",
        "The actor, 54, who has continued to promote his Oscar winning performance in The Whale around the world, spoke about what's next for him at the Greenwich International Film Festival Wednesday. 'At the moment, I don't have anything — I'm really being picky right now.' People reported. Brendan was there to honored for his work and his philanthropy as part of the  festival's first ever Inspiration Talk and award.ESPN's Hannah Storm, 60, interviewed the Critics Choice Award winner during the event in which he opened up about many aspects of his life and career, including how he prepared from his role in The Whale.Brendan said as he prepared for the role of Charlie, he contacted the non-profit Obesity Action Coalition, according to Greenwich Time. ",
        "'Their mandate is to treat the story with dignity and respect. And that meant everything from the design of Charlie's body to the way that characters speak, everything' he explained to the audience.The foundation arranged for him to meet with 10 people over zoom and the journeyman actor said he discovered one thing that each of them had in common.  They had all been on the receiving end of degrading comments from an adult.'It just exemplifies what sets the pattern of shattering a young person's confidence and then coupling them with all sorts of reasons, they can find themselves, like Charlie, eating to medicate,' he contended.",
        "'By repressing the pain down inside and internalizing trauma with food, it reflects how much they feel externally. And Charlie is the personification of that. So, I felt a sense of obligation to the role as their voice and as their champion.'Brendan is also a champion for his son Griffin, 20, who was diagnosed with autism at an early age.   Proceeds from Wednesday's ceremony benefited the Connecticut-based charity Abilis, which supports and advocates for people with developmental disabilities. The Canadian-born star shares Griffin along with sons Holden, 18, and Leland, 17, with his ex-wife Afton Smith, 55. 'The reason why I do what I do is...because of them,' he claimed.",
        "'I am like a deep-sea diver at the bottom of the ocean with a tube of air coming up to the surface where my family and loved ones are. They make sure that pumps keep going so I can go on this expedition. It’s a very charmed and lucky career that I've had.'The actor, who landed his first small role in 1991's Dogfight, is starring next in Martin Scorsese's Flowers of the Flower Moon, which is set to debut at the Cannes Film Festival later this month. Brendan said he has a small role in the thriller based on the 2017 non-fiction book of the same name.",
        "The story focuses on the murders of oil-rich members of the Osage tribe who are murdered under mysterious circumstances in the 1920s in the early days of the FBI. 'It's like my fantasies fulfilled at what it's like to be in a Renaissance master's studio,' according to People. ",
        "'Think about that.' Somebody who has all the knowledge, hands down and surrounded by people who are so talented and enthusiastic for his vision.Referring to the legendary director's love of theater he said, 'the work that we did was kind of being in an opera or a play because it was happening in real time.'Leonardo DiCaprio, Robert DeNiro and Jesse Plemons are some of the headliners in the crime drama.'I can't oversell my participation in this film because it's epic,' the modest star said. 'There's so many actors in this movie when you see it. I'll arrive for a scene or two at the end.''Killers of the Flower Moon is set for release in select theaters October 6 and will go wide October 20. It will then make its way to Apple TV+."
    ]
}