{
    "articleURL": "/wires/pa/article-12042089/Sue-Gray-s-refusal-operate-Government-probe-disappointing--No-10.html",
    "content": [
        "Rishi Sunak thinks it is “obviously disappointing” that partygate investigator Sue Gray chose not to engage with a Government process looking into her move to a senior Labour role, Downing Street has said.",
        "But Labour has defended the former senior official for not co-operating with the “political gimmick” review and prioritising the “standard” process carried out by Whitehall’s anti-corruption watchdog.It came after the Cabinet Office on Tuesday released an update on Ms Gray’s departure from her high-ranking Whitehall position, which, contrary to briefing to the press, did not say that she had broken rules by speaking to the opposition while still working for the Government.Instead, Cabinet Office minister Oliver Dowden said the Government would “consider next steps” after she “chose not to” engage. It is obviously disappointing that Sue Gray was offered to co-operate and has chosen not to do so  PM's press secretary  He said the Government had submitted a “confidential assessment” to the Advisory Committee on Business Appointments (Acoba).The independent watchdog will recommend a cooling-off period between three months and two years to avoid any conflict of interest once it concludes its own separate review.News in March that Ms Gray was leaving her senior Civil Service role with plans to become Sir Keir Starmer’s chief of staff sparked anger among Tory MPs.Sky News reported that the Labour leader first contacted her about the position in October, at least four months before her appointment was announced.",
        "Sir Keir has repeatedly refused to disclose the timeline of their communications. Asked about Sky’s claim, Labour said: “All the information has gone to Acoba and not going to comment during an active process.”The Times reported that Ms Gray had questioned the standing of the Cabinet Office probe into her departure and the rules by which it was to be conducted.The Prime Minister’s press secretary said she did not “recognise” reports that the former mandarin declined to engage with the internal inquiry because it was on shaky legal ground, and that this may have contributed to Cabinet Secretary Simon Case blocking plans to release a fuller assessment on her job move.",
        "She told reporters in Westminster on Wednesday: “The Prime Minister is not obviously involved in this process. But it is obviously disappointing that Sue Gray was offered to co-operate and has chosen not to do so.“I think what is more disappointing is that Keir Starmer is in a position where he could clear up very quickly when contact was made by his office or by him to Sue Gray to uphold the integrity of the Civil Service and ensure that it is transparent and open.”Sir Keir’s spokesman stressed that Labour is “fully supporting” the anti-corruption watchdog’s deliberations on Ms Gray’s job move.",
        "Earlier, shadow chancellor Rachel Reeves described the internal inquiry as a “political gimmick” launched by the Government to pursue a “vendetta” against the ex-civil servant who had looked into allegations of parties in Downing Street during pandemic lockdowns.The Labour frontbencher told Times Radio: “The issue here is that there are two inquiries going on. There’s the usual one – the Acoba process, which Sue Gray is co-operating with fully – and then there’s the political gimmick one set up by Government ministers to pursue this vendetta they’ve got against Sue Gray.”",
        "Asked about the revenge claim, Mr Sunak’s press secretary said: “No, I don’t think that is the case at all.”Sir Keir has insisted he was “confident” Ms Gray had not broken any rules.The Labour leader said he “had no discussions with her while she was investigating Boris Johnson whatsoever, I don’t think anyone is suggesting that’s the case”.The Prime Minister’s official spokesman declined to comment on reports that Cabinet Secretary Mr Case, who initially backed the release of findings critical of Ms Gray’s departure, blocked the plans amid concerns over publishing a politically charged report into a former official just days before the local elections when the Government is meant to observe “purdah” rules on political impartiality.",
        "“I’m not going to get into speculation along those lines,” the PM’s spokesman told reporters."
    ]
}