{
    "articleURL": "/wires/pa/article-12057671/Kermit-steals-King-s-Coronation-Concert.html",
    "content": [
        "Kermit the Frog and his co-star Miss Piggy sparked huge laughter from the King during his appearance at the Windsor coronation festival.",
        "The King appeared to chuckle after Miss Piggy described host Hugh Bonneville as a “real Lord” – mistaking the actor for the character he plays in Downton Abbey, the Earl of Grantham.",
        "And the King laughed even harder after she referred to him as “King Charlesy Warlesy” and said he was “expecting” Kermit the Frog in the royal box.Even Princess Charlotte and Prince George smiled as they watched on intently, while the Prince of Wales laughed along with his father.Just before Hugh Bonneville introduced the final act of the star-studded concert, Take That, the BBC cut to the royal box, where Kermit waved a Union flag in front of a grinning Duke of Edinburgh.The King looked to his left as he clapped before Bonneville signed off: “And, of course, thank you your majesties, for allowing us to perform for you here. We sincerely hope you and the frog have enjoyed yourselves.”",
        "The camera then showed a wide view of the royal box, with Charles and Camilla smiling while Kermit nodded.As Take That performed their first show in four years, several members of the royal family got to their feet, including the King and Queen, while George and Charlotte enthusiastically waved their Union flags.",
        "The Muppets characters were among dozens of iconic figures who appeared throughout the concert, including Tom Cruise, who said in a video message from his Top Gun plane: “Pilot to pilot. Your Majesty, you can be my wingman any time,” before saluting and banking off.",
        "The Coronation Concert, beamed onto large screens across the country, saw the Prince of Wales make a speech honouring his father the King before performances by Katy Perry, Lionel Richie, Nicole Scherzinger and Andrea Bocelli.",
        "Stars including Hugh Jackman, Pierce Brosnan, Dame Joan Collins, Bear Grylls, Alan Titchmarsh, and Sir Tom Jones also gave pre-recorded video messages in honour of the King throughout the concert.Paloma Faith performed Lullaby at the Windsor concert as 10 towns and cities across the country were lit up in honour of the King’s coronation.The singer, known for her eccentric clothing, wore a puffy pink dress, a black headband and long shiny gloves.",
        "The light displays across the UK included the Welsh dragon, spanning 140m, beamed into the sky above Cardiff, while an image of a watering can hovered above the Eden Project’s famous Biomes in Cornwall.During the segment, James Nesbitt performed a spoken word piece written specially for the occasion by Daljit Nagra, chair of the Royal Society of Literature, called Lighting Up The Nation.",
        "The evening also saw a collaboration between five Royal patronages – The Royal Ballet, The Royal Opera, the Royal Shakespeare Company, The Royal College of Music and The Royal College of Art.In the world-first performance, which was applauded by The Prince of Wales, Doctor Who star Ncuti Gatwa performed Somewhere from West Side Story with Mei Mac.",
        "Other collaborations included Andrea Bocelli and Sir Bryn Terfel, who sang You’ll Never Walk Alone, and Lang Lang and Scherzinger, who performed Reflection from Mulan."
    ]
}