{
    "articleURL": "/wires/ap/article-12052737/New-pipeline-agency-rule-aimed-cutting-methane-leaks.html",
    "content": [
        "WASHINGTON (AP) - The federal agency that regulates pipelines announced new rules Friday aimed at reducing leaks of methane, a potent greenhouse gas, from a network of nearly 3 million miles of natural gas pipelines that crisscross the country.",
        "The proposal by the Transportation Department´s Pipeline and Hazardous Materials Safety Administration would significantly improve the detection and repair of leaks from gas pipelines, keep more product in the pipes and prevent dangerous accidents, officials said.If finalized, the rules would eliminate up to 1 million metric tons of methane emissions by 2030, equivalent to emissions from 5.6 million gasoline-powered cars, the agency said. Overall, the rule would reduce emissions from covered pipelines by up to 55%.\"Quick detection of methane leaks is an important way to keep communities safe and help curb climate change,\" said Transportation Secretary Pete Buttigieg. \"We are proposing a long-overdue modernization of the way we identify and fix methane leaks, thereby reducing emissions and strengthening protections for the American people.\"The proposal is aimed at cutting methane emissions from more than 2.7 million miles of gas transmission, distribution and gathering pipelines nationwide; 400 underground natural gas storage facilities; and 165 liquefied natural gas facilities, the agency said.The rule would update decades-old federal leak detection and repair standards that rely solely on human senses in favor of new requirements that use commercially available, advanced technologies to find and fix methane leaks and other flammable, toxic and corrosive gases, officials said.",
        "The rules will improve health and safety in poor and minority communities where gas pipelines and related infrastructure are disproportionately located, the agency said.",
        "The proposal is part of a broader effort by the Biden administration to restrict methane emissions and follows proposed rules by the Environmental Protection Agency and Interior Department to strengthen methane leak detection and limit emissions from oil and gas production.\"Natural gas pipelines are ubiquitous in our neighborhoods, cities, parks and rural communities, and pipeline leaks are both safety risks and a source of methane pollution that accelerates climate change,\" said Erin Murphy, a senior attorney for the Environmental Defense Fund, which has pushed for stricter methane standards.PHMSA's proposal is \"a welcome step\" that will help \"unlock\" use of advanced technologies to find and fix more pipeline leaks, Murphy said.\"Strong federal standards to reduce pipeline leaks are critical for delivering on the Biden administration´s commitment to curb climate-warming methane pollution while increasing public health and safety,\" she said.Methane, the primary component of natural gas, is a potent greenhouse gas that is far more powerful than carbon dioxide in the near-term. Leakage from natural gas pipelines is a major source of methane emissions that contribute to global warming.The Associated Press reported last year that researchers identified more than 500 methane \"super emitters,\" including pipelines, wells, tanks and compressor stations, during a 2021 aerial survey of the oil-rich Permian Basin in New Mexico and Texas. The sites leak massive amounts of methane into the atmosphere, according to Carbon Mapper, a partnership of university researchers and NASA´s Jet Propulsion Laboratory.",
        "The EPA is now conducting helicopter flyovers in the region using special infrared cameras that can detect emissions of hydrocarbon vapors invisible to the naked eye.The new pipeline rule was developed as a result of the bipartisan PIPES Act of 2020, which created a series of regulatory mandates targeting pipeline safety, including methane leaks. Transmission, storage and distribution of oil and gas accounts for about one-third of oil-and-gas emissions, according to EPA data."
    ]
}