{
    "articleURL": "/news/article-12044529/How-podgy-teenager-inspired-TVs-Gladiators-shed-pounds-super-fit-telly-titan.html",
    "content": [
        "Steel, real name Zack George, will appear in the BBC One reboot of GladiatorsHe is unrecognisable from his school days when he regularly scoffed fast food As a podgy teenager Zack George would watch Gladiators on TV and marvel at the strength and athleticism of the show's resident 'superhumans'.",
        "Growing up he would spend his days gorging on fast food from KFC and McDonald's, and spend his evenings by gaming on his PlayStation for hours on end.The self-described 'lazy' teen struggled with his weight, but watching the Gladiators on TV gave him the motivation to change his life and shed the pounds, eventually becoming one of the UK's fittest men.But even Zack would have found it difficult to envisage that decades later he would become one of the super-fit telly titans he spent his evenings watching in awe as a child.The Leicestershire-born star was unveiled last night as one of the stars of the BBC One reboot of Gladiators, taking the impressive name 'Steel' when he appears on our screens.",
        "It's a far cry from his 'unhealthy' childhood where Zack admits he 'practically inhaled chocolate' and ate McDonald's and KFC 'five times a week'.This, he says, led to a 'vicious cycle' of cravings which in turn caused issues when doing sport -  he would quickly run out of breath and opponents would call him 'fat'. He told The Sun: 'I brushed it off, but it's never nice to be called nasty names.'If my family tried to get me out for a walk at the weekend I kicked up a massive fuss. I was really lazy.",
        "'Being overweight makes you feel rubbish. You can't walk or run far so you don't want to exercise and you often end up finding comfort in fast food.'But, partly inspired by the Gladiators on his television, he decided to ditch his PlayStation for the gym and has literally gone from strength to strength.In 2020 he became a champion in UK CrossFit, and ranked 26 out of 126,461 on the global CrossFit leader board - which involves tests in powerlifting, gymnastics and high-intensity interval training (HIIT).Zack said: 'I was inspired by the Gladiators as a child, but never imagined I'd be physically fit enough to be considered a \"superhuman\"!'I hope a new generation of fans will look up to me as their new strong, unbreakable hero, Steel.'",
        "The rebooted series will start filming in Sheffield next month, and Zack will be joined in the 'superhuman' camp by  Professional Exeter Chiefs Rugby Player, Jodie Ounsley, who has joined the line-up as her alter-ego 'Fury'.",
        "Jodie certainly has the credentials to follow in the footsteps of the mighty Gladiators as she's a former England Women’s Rugby Seven’s player, a Brazilian Jiu Jitsu British Champion and five times World Coal Carrying champion. While Jodie, who is profoundly deaf and wears a cochlear implant, won the title of Deaf Sports Personality of The Year in 2020.",
        "Meanwhile, the sportswoman has Gladiators in her blood as her father was a contender on the show back in 2008, and she has been training to outdo him ever since.Jodie is a longtime Gladiators fan, even dressing up as a Gladiator and practicing the games in her living room.Sharing her excitement at joining the show, Fury said: 'Watching Gladiators growing up I was always in awe of their strength and power and now I am one!'I hope contenders are ready to feel the Fury!'The rebooted series will be hosted by TV personality Bradley Walsh and his son Barney, who are taking over the series after it was originally presented by Ulrika Jonsson and John Fashanu on ITV from 1992-2000.The new series will feature some of the classic challenges including Duel, Hang Tough and The Eliminator as well as some surprise new tasks."
    ]
}