{
    "articleURL": "/tvshowbiz/article-12046953/Pregnant-WAG-Diletta-Leotta-displays-growing-bump-white-swimsuit-Ibiza.html",
    "content": [
        "Diletta Leotta showcased her growing baby bump in a figure hugging white swimsuit as she gave fans a glimpse into lavish Ibiza getaway on Instagram on Thursday.",
        "The Italian TV presenter, 31, looked glowing as she prepares to welcome her first child with Newcastle Goalkeeper Loris Karius.Earlier, she wore a nude coloured lycra unitard with a coordinated cardigan and wore chunky black sunglasses. The WAG later stripped off into a busty white swimsuit as she enjoyed paella at a beach restaurant overlooking the ocean. She left her long blonde tresses loose as they cascaded past her shoulders from a centre parting while shielding from the sun behind a pair of black sunglasses. ",
        "In another picture, the beauty dressed to impress in a purple one sleeved mini dress which clung to her growing baby bump. Diletta was all smiles as she toted her belongings around in a pink crossbody bag and accessorised with a pair of stylish gold hoop earrings. The mum-to-be looked glowing as she posed for a selfie with footballer beau Loris who rocked a white Prada top and sunglasses. Diletta and Loris announced her pregnancy on social media at the end of March with a sweet video.The couple were seen lying on a sofa together hugging before she looked teary eyed and he grabbed her face.They penned: 'We need to tell you something... but did y’all know that yet? We are bursting with joy! Us and my belly ❤️Soon we’ll be three!'",
        "Loris is currently on the books at Newcastle after a turbulent few years in his career, following his nightmare performance in the 2018 Champions League final.He had not played a competitive match for two years ahead of the clash against Manchester United in the Carabao Cup final.",
        "His opportunity to play arose after Nick Pope was dramatically sent off in their defeat by Liverpool, for handling the ball outside the area.Martin Dubravka, meanwhile, is Newcastle's second-choice but was ineligible to play given the fact he had already played for Manchester United this term in the competition and was cup tied.During the game, Loris let in 2 goals giving United the win and the cup title.Ahead of this Loris' last game for an English club was the Champions League final with Liverpool in 2018.He made two mistakes leading to Real Madrid goals in a 3-1 defeat that night and was subject to fierce criticism.Since then, the German goalkeeper spent loan spells with Turkish side Besiktas and German side Union Berlin before arriving at St James' Park."
    ]
}