{
    "articleURL": "/wires/afp/article-12053593/Philippines-rescues-1-000-trafficking-victims.html",
    "content": [
        "Philippine authorities have rescued over a thousand people from several Asian nations who were trafficked into the country, held captive and forced to run online scams, an official said Saturday.",
        "International alarm has grown in recent months over internet scams in the region often staffed by trafficking victims tricked or coerced into promoting bogus crypto investments.Michelle Sabino, a spokeswoman for the Philippine national police force's anti-cybercrime group, said officers raided a cluster of buildings Thursday in Mabalacat city, about 90 kilometres north of Manila.A total of 1,090 people were rescued who had been recruited to run online scams.Sabino said the victims were forced to target unsuspecting people in the United States, Europe and Canada.Their passports were confiscated and they were made to work up to 18 hours a day, with salary deductions for interacting with colleagues or taking extended breaks.\"You're like a prisoner without a cell. You're not even allowed to talk to your roommates,\" Sabino told AFP.\"They're not allowed to leave outside the bounds of the gate. After 18 hours of work, they're brought to their dormitory.\"The victims were mostly Chinese nationals, Vietnamese, Filipinos and Indonesians, police said in a separate statement.Authorities also rescued people from Malaysia, Thailand, Taiwan, Myanmar, Hong Kong and Nepal.Sabino said the workers were trained to entice strangers into buying cryptocurrency or depositing money into bogus bank accounts after establishing fake romantic relationships.\"They will build up a promise of a good future together. Let's buy a house, buy a car, let's invest money or let's do business together,\" she said.",
        "At least 12 suspected ringleaders of the scheme have been arrested and are set to be charged with human trafficking. They include seven Chinese nationals, four Indonesians and a Malaysian, Sabino said.Sabino also said the police operation was the result of a plea by the Indonesian ambassador in Manila for help locating distressed nationals.A Philippine immigration official also warned on Saturday against trafficking risks while international events are underway.\"In the past we have recorded victims who claimed they were set to join beauty pageants, shows, only to find out that they were being trafficked abroad,\" immigration commissioner Norman Tansingco said in a statement.The warning comes as Cambodia hosts the Southeast Asian Games, which began on Friday and runs until May 17.The immigration bureau said Philippine sports officials were asked to warn Filipino athletes of the \"risks of trafficking\" in the country.An AFP report last year found people from around Asia have been pulled into cryptocurrency scams in Cambodia, some trafficked and beaten by scam operators.Last month, Philippine senator Risa Hontiveros warned that \"scam call centres\" were operating in the Philippines and employing foreigners trafficked into the country."
    ]
}