{
    "articleURL": "/wires/reuters/article-12045201/QUOTEBOX-Fed-pause-baked-dovish-hike.html",
    "content": [
        "May 4 (Reuters) - The U.S. Federal Reserve on Wednesday raised interest rates by a widely expected 25 basis points and dropped from its policy statement language saying that it \"anticipates\" further rate increases would be needed.",
        "The Fed Funds target rate now stands in the 5%-5.25% range, following 500 bps of hikes since March 2022. Money markets no longer expect a hike in June, while they see rate cuts possible in the second half of the year despite Fed Chair Jerome Powell pushing back on such expectations.Even as worries remain about the unfolding U.S. banking crisis, Powell said he still expects the economy to avoid a recession this year.The next monetary policy decision from the Fed is due on June 14.GOLDMAN SACHS\"We saw the May FOMC meeting as supportive of our call for a pause in June.\"\"Admittedly, the statement did not nod toward a June pause quite as strongly as we had expected.... But putting together a statement that was acceptable to everyone when the range of views on the appropriate path forward is wide was likely difficult, and in retrospect we are not surprised that the FOMC simply chose to say less.\"\"(Powell) also made his clearest statement so far that he thinks a soft landing is possible and that he finds the labor market rebalancing to date encouraging, views that we share.\"\"We see Powell's view on the soft landing question as having dovish implications - because he thinks that a recession is not necessary to solve the inflation problem, he is likely to be reluctant to deliver future rate hikes if he thinks that they would materially raise the risk of pushing the economy into a recession.\"",
        "BOFA GLOBAL RESEARCH\"We think the Fed has reached its terminal rate in this tightening cycle, though we note that there are two employment reports and CPI inflation reports before the June FOMC meeting.\"\"Should regional bank stress stabilize, labor markets stay tight, and inflation stay elevated, a rate hike in June could become appropriate.\"MORGAN STANLEY\"(Hint at a pause) can be interpreted as more dovish than we expected, particularly when compared to (member of Fed's board of governors in Washington, Christopher J. Waller's) recent - more hawkish - warning that policy would remain tight for \"longer than markets anticipate\".\"With the range now at the Fed's projected peak of 5.00% to 5.25%, we expect it to remain on hold before making the first 25bp cut in March 2024. Like the Fed, we see the effects of banking stresses on the economy as highly uncertain and will hone our expectations for the economy and monetary policy as incoming data evolves.\"BARCLAYS\"We expect the FOMC to maintain the funds rate target range at 5.00-5.25% through the rest of the year.\"\"This projection assumes that economic activity will slow gradually, turning into a mild recession in the second half of the year, with the labor market easing, the unemployment rate increasing, and core PCE inflation gradually declining toward 3.5% in Q4.\"",
        "\"In particular, we assume that the turmoil in the banking sector does not morph into a severe financial crisis.\"\"...we suspect that the Committee continues to view the tightening in lending conditions that followed the collapse of SVB as weighing on activity gradually over coming months, and as standing in for additional rate hikes...\" (Reporting by Susan Mathew in Bengaluru; Editing by Sonia Cheema)"
    ]
}