{
    "articleURL": "/femail/article-12053947/Prince-Harry-need-hug-makes-nervous-arrival-Westminster-Abbey.html",
    "content": [
        "King Charles Coronation LIVE: Read the latest updates from Westminster Abbey and the Palace hereHow are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.uk Prince Harry appeared in 'need of a small hug' upon his arrival at Westminster Abbey for the King's coronation - before giving Prince William a 'thunderous look', according to body language experts.",
        "The Duke of Sussex, 38, was 'out of step with the others around him' as he twisted and bent his body while arriving at the service and his walk into the ceremony was a 'sure sign he was on his own', Carole Railton explained to FEMAIL.However, the father-of-two then stepped in line and started smiling broadly which showed him being more comfortable. The expert added that his hand holding the edge of his jacket might have signalled the need for a 'small hug' to make himself feel better in what was bound to be a tense reunion with his family.Meanwhile, body language expert Judi James told The Sun that Harry levelled his brother William with a 'severe side-eye glance'. ",
        "She said: 'William is clearly not about to look back here and Harry’s severe side-eye glance suggests he’s sneaking this thunderous look almost unintentionally.'When we tell ourselves not to do something the brain only tends to hear the suggestion without processing the \"don’t\" command, suggesting the more Harry was telling himself not to look across at his brother the more he couldn’t stop.'Elsewhere, Carole also remarked that the twisting and turning of Harry’s body would indicate discomfort, which is an 'unusual pose' which we 'do not normally see this with the royals'.",
        "The Duke of Sussex cut a solo figure as he was forced to walk down the aisle by himself to take his seat in the third row ahead of the arrival of his father and soon-to-be Queen Camilla. Wearing medals pinned to his suit jacket, he had been seen laughing and smiling as he entered the royal church alongside Princesses Eugenie and Beatrice and their respective husbands Jack Brooksbank and Edoardo Mapelli Mozzi.Harry had not been seen for over 24 hours after his arrival and his accommodation plans remained shrouded in secrecy - before it emerged he had flown into the UK on a commercial American Airlines flight on Friday morning. ",
        "It comes after it was revealed today Harry - who is fifth in line to the throne - had been relegated to the third row inside the abbey for the service. He was seated between Princess Eugenie's husband Jack Brooksbank and Princess Alexandra, the cousin of the late Queen who has not worked as a royal for ten years. They were joined by Prince Andrew's daughters Eugenie, 33, and Beatrice, 34, and her husband Edoardo Mapelli Mozzi. Also in the third row, at the other end from Harry, was the Duke of York, who stopped using the title His Royal Highness in an official capacity in January 2022. He wore his Order of the Garter robe.",
        "William and Kate were in the front row at the abbey for the historic ceremony, with their children Prince George and Princess Charlotte.",
        "Their youngest child, Prince Louis, who recently turned five, took his seat after processing through the abbey, but would retire once the ceremony begins.Only the other senior working royals had a front row seat, made up of the Duke and Duchess of Edinburgh - Edward and Sophie - and their children Lady Louise and James the Earl of Wessex, as well as the ever-popular Princess Anne and her husband Tim Laurence. A source told the Sun: 'There were discussions that the seating could be arranged on line of succession. But that would have put fifth-in-line Harry front and centre — and with William and Kate. Instead the decision was working royals only at the front and work back from there. Harry will be a long way from his father.'Sources previously told the Mail there were 'no plans' for Harry to join the Royal Family on the Palace balcony or to even appear in official photos.",
        "It emerged today that the Duke jetted into the UK on a commercial flight on Friday morning, leaving passengers gobsmacked. The King's son arrived from Los Angeles on American Airlines flight AA136, which landed at 11.23am at London Heathrow yesterday.",
        "Sources this week stressed that Harry will be 'in and out of the UK in 24 hours'. He dashed back straight after the two-hour ceremony to be with Meghan Markle for their son Archie's fourth birthday. ",
        "He was expected to spend a final evening at Frogmore Cottage last night after his father decided to evict him and his American wife just days after the release of his memoir Spare.Sources last month suggested that some family members – with the possible exception of Princesses Beatrice and Eugenie – had no interest in talking with Harry at the Coronation beyond the most basic of greetings. It came after the prince publicly called on his family to apologise to himself and Meghan for what they saw as slights against them. He also demanded that his father and brother sit down with him before May 6 to thrash their issues out - a meeting which never came to fruition.Adding fuel to the fire, Harry also indicated he has enough material to fill another book, which is likely to make the royals wary of encountering him.He made a quick exit after the Coronation, flying back to the US to mark Archie's birthday, and only attended the ceremony. Sources previously said the decision by Meghan to remain in California had come as a relief in some circles, following fears her presence could have heightened family tensions.",
        "It is also understood there was real concern in the Sussex camp about the public reception the couple would have received if they attended the Coronation together.Friends, including Meghan's biographer Omid Scobie, suggested her decision was largely due to the Coronation falling on the same day as Archie's fourth birthday.The couple had delayed answering their invitation for weeks, causing difficulties for organisers tasked with complex seating plans, transport and security for senior members of the Royal Family, world leaders and other dignitaries.Sources described the negotiations as a game of 'transatlantic ping pong', and Harry was said to have wanted numerous assurances about arrangements. Coronation organisers admitted that they were stressed about Harry's plans and said that it was like 'trying to communicate with Mars'.Asked in an interview in January whether he would attend the Coronation if invited, Harry said 'the door is always open'.It was then reported last month that the Duke would be coming to the Coronation alone, leaving Meghan at home with their children Archie and Lilibet.Buckingham Palace later said it was 'pleased to confirm' the Duke of Sussex will be at Westminster Abbey. There had been uncertainty at the Palace over the Sussexes' attendance."
    ]
}