{
    "articleURL": "/wires/ap/article-12057661/Marlins-stop-5-game-slide-14-inning-win-Cubs.html",
    "content": [
        "CHICAGO (AP) - Miami manager Skip Schumaker enjoyed the very end. The rest of the afternoon was a challenge.",
        "\"I'm exhausted, and I didn't play,\" Schumaker quipped.Garrett Hampson scored on Adbert Alzolay's balk in the 14th inning, and the Marlins stopped a five-game slide by outlasting the Chicago Cubs for a wild 5-4 victory on Sunday.Hampson opened the inning on second as the automatic runner. He advanced on Luis Arraez's groundout and trotted home when Alzolay (1-2) was called for a balk with a 2-2 count on Jesús Sánchez.\"It goes from getting ready for the contact play and who knows what is going to happen, right?\" Hampson said. \"And then you get to jog home, it's pretty good.\"Steven Okert (1-0) got three outs for the win, and Andrew Nardi pitched the 14th for his first career save. Tucker Barnhart struck out with a runner on third for the final out of the majors' longest game by innings so far this season.",
        "Miami improved to 11-0 in one-run games, matching the 1972 New York Mets for the record for most consecutive wins in one-run games to begin a season.\"When the game's tight and the pressure is on, it shows that we stay poised and somehow just get the job done anyway possible,\" Hampson said.Yuli Gurriel hit his third homer for the Marlins, who were outscored 34-12 during their losing streak. It was the team's first win since it closed out a three-game sweep of the Cubs in Miami on April 30.",
        "Miami also scored in the 10th on Joey Wendle´s pinch-hit triple and the 13th on Jazz Chisholm Jr.'s sacrifice fly. Wendle was reinstated from the 10-day injured list before the game.Chicago responded with run-scoring singles by Nico Hoerner in the 10th and Ian Happ in the 13th. The Cubs put runners on second and third with one out in the 11th, but Happ was cut down at the plate on Trey Mancini's bouncer to third and Matt Mervis grounded out.The Cubs also rallied with two runs in the ninth, spoiling an impressive performance by Sandy Alcantara. Cody Bellinger hit a run-scoring double and scampered home on Eric Hosmer's tying single through a drawn-in infield.Alcantara departed after Hosmer's hit on his season-high 113th pitch. The reigning NL Cy Young Award winner struck out nine and walked none in 8 1/3 innings. He is winless in his last five outings.\"Great job by everyone,\" Alcantara said. \"Great job by my defense, by my bullpen, by everything.\"The Cubs got a stellar start from Hayden Wesneski, who pitched six innings of one-run ball. The right-hander struck out six and walked none on a sunny day at Wrigley Field.\"Wes was great. He threw the ball very well,\" manager David Ross said. \"He started off not on the attack, and then got after it really fast from the second inning on.\"",
        "Gurriel led off the fifth with a drive into the basket in left for his first homer since April 25. Jorge Soler added a two-out RBI single in the eighth against Brad Boxberger.The Marlins had runners on second and third with one out in the fifth. But Nick Madrigal cut down Jean Segura at the plate on Jon Berti's grounder to third and Chisholm struck out swinging.Mervis had two hits for Chicago in his third major league game. But he also was thrown out by Sánchez when he tried to take third on Miguel Amaya's single in the fifth.TRAINER'S ROOMMarlins: Wendle had been sidelined by a strained right intercostal muscle. INF Xavier Edwards was optioned to Triple-A Jacksonville. ... Schumaker said RHP Johnny Cueto (right bicep tightness) had an ankle issue a day after the pitcher left a rehab start for Jacksonville after falling while trying to cover first base. \"We´ll kind of see what he feels like the next couple days,\" Schumaker said.Cubs: C Yan Gomes (concussion IL) took batting practice on the field before the game. ... RHP Codi Heuer (recovery from Tommy John surgery) will make his second rehab appearance with Triple-A Iowa on Tuesday. ... LHP Brandon Hughes (left knee inflammation) was slated to throw a bullpen session on Sunday. ... RHP Adrian Sampson had a meniscal debridement procedure on his right knee on Friday.",
        "UP NEXTMarlins: LHP Braxton Garrett (1-1, 5.81 ERA) gets the ball Monday night at Arizona. RHP Zac Gallen (4-1, 2.53 ERA) starts for the Diamondbacks in the opener of a three-game set.Cubs: RHP Marcus Stroman (2-2, 2.18 ERA) starts Monday night in the opener of a three-game series against St. Louis. RHP Miles Mikolas (1-1, 5.79 ERA) takes the mound for the Cardinals.___Follow Jay Cohen at https://twitter.com/jcohenap___AP MLB: https://apnews.com/hub/MLB and https://twitter.com/AP_Sports"
    ]
}