{
    "articleURL": "/wires/reuters/article-12049387/Slumping-Phillies-host-streaking-Red-Sox-weekend-series.html",
    "content": [
        "The Philadelphia Phillies will return home Friday looking to climb back toward .500 after a rough road trip as the streaking Boston Red Sox visit in the first of a three-game series.",
        "The Phillies were above .500 for a brief three-game stretch last week.After an inauspicious start, the Phillies battled their way out of the losing column and to an even record when they reached 13-13 with a 1-0 win over the Mariners last Thursday. They carried that momentum onto the road, where they took the first two of a three-game set in Houston against the Astros, who downed them in last year's Fall Classic.The success was short-lived, though. After dropping Sunday's series finale with Houston, the Phillies flew to Los Angeles and got thumped in their first two contests at Dodger Stadium, getting outscored by a combined 26-5. The Dodgers completed the sweep on Wednesday afternoon, overcoming an early 5-0 deficit and winning on Max Muncy's walk-off grand slam to claim a 10-6 win.Philadelphia is using the day off Thursday to recoup before the Red Sox come to town.\"You've got to dust yourself off and get back at it again after the off day,\" Phillies manager Rob Thomson said after Wednesday's loss. \"Guys get some rest, come back Friday against Boston and get on it again. It was tough. It's a good ball club but we had them today and gave it away.\"Despite the sour end to the road trip, many Phillies fans are still in good spirits as their star slugger Bryce Harper stepped into the batter's box for the first time this season, returning from elbow surgery he underwent last November.",
        "After he went 0-for-4 with three strikeouts in his 2023 debut Tuesday, he got back to All-Star form the next day, reaching base in all five trips -- going 3-for-3 with two walks, including a double.Philadelphia will have a solid chance to snap their losing streak on Friday as their ace Zack Wheeler (3-1, 3.86 ERA) will get the start. The right-hander dazzled in his previous outing last Friday in Houston, fanning seven batters through six scoreless innings in a 6-1 win.Boston's bats have been hot, though, as the Red Sox have won six straight, tallying at least six runs in each contest. They are coming off a dominating 11-5 win over the Toronto Blue Jays on Thursday to complete a four-game sweep.\"It's been the key the first 32 games of the season. Two-strike hits, grinding at bats,\" Red Sox manager Alex Cora said after their 8-3 victory on Wednesday. .\".. We've been doing that since day one, just moving the ball forward, hitting behind runners, running the bases well.\"A couple of Boston's batters have given Wheeler trouble in the past as well. Red Sox third baseman Justin Turner has a .500 batting average against Wheeler, hitting 4-for-8 with a homer, and left fielder Raimel Tapia is batting .400 in his career facing the Phillies starter.",
        "The Red Sox will also have their ace on the mound as left-hander Chris Sale (2-2, 6.75) will be aiming to deliver another stellar start after his vintage outing against the Cleveland Guardians on Sunday. The 34-year-old allowed just one run on three hits over 6 1/3 innings against Cleveland in a 7-1 victory.--Field Level Media"
    ]
}