{
    "articleURL": "/wires/reuters/article-12059285/Shares-rise-dollar-sags-ahead-inflation-data.html",
    "content": [
        "Dollar under pressure",
        "Global equities edge upFocus on U.S. inflation, banking surveyBank of England seen hiking again this week(Updates prices)By Amanda CooperLONDON, May 8 (Reuters) - Global shares edged up in light trading on Monday, ahead of U.S. inflation data this week that could prove instrumental in setting expectations for the outlook for monetary policy.The dollar came under pressure as a deadline for lawmakers to resolve a standoff over the U.S. government's borrowing limit drew ever closer.The MSCI All-World index, meanwhile, rose 0.2% on the day.Friday's robust U.S. payrolls report has prompted investors to dial back their expectations for the timing and size of the Federal Reserve's first rate cut. Wednesday's consumer price data is expected to show core inflation slowed moderately.\"With the Fed having hiked by 25 basis points last week and signalled a pause, this week´s inflation report is more about how long the Fed will keep rates at 5.25% before cutting,\" CityIndex analyst Matt Simpson said.\"A hot print would presumably be bullish for the U.S. dollar as traders push potential cuts further into the future.\"Money markets show investors expect U.S. rates to have now peaked and could end this year below 4.40%. Against that backdrop, the dollar is close to its lowest in a year against a basket of major currencies.",
        "The dollar index was last down 0.3% on the day at 101.05, mainly due to gains in the euro, which rose 0.3% to $1.10495.Sterling, which has gained 4.5% against the dollar this year, was up 0.3% at $1.2664, at 10-month highs, ahead of a Bank of England policy meeting later this week.\"While it is premature to get too 'beared up' on the dollar until a clearer peak in U.S. rates is seen, the U.S. banking sector travails that have no easy/costless solutions, continue to make for a mildly bearish medium-term story,\" said Alan Ruskin, head of global FX strategy at Deutsche Bank.\"Certainly it imposes more growth constraints and a greater stagflationary bias than for major competing economies.\"The dollar has fared better on the yen as the Bank of Japan remains the only central bank in the developed world to not have tightened policy. The dollar rose 0.1% against the yen to 134.98 yen.HITTING THE CEILINGIn Europe, the STOXX 600 index rose 0.4%, although activity was muted by a public holiday in Britain.S&amp;amp;P 500 futures rose 0.1%, while Nasdaq futures were roughly flat on the day, having jumped on Friday following Apple's upbeat results.Later on Monday, the Federal Reserve's survey of loan officers will draw an unusual amount of attention as markets seek to gauge the impact of regional banking stress on lending.",
        "\"The survey should point to further broad-based tightening in bank lending standards,\" said Bruce Kasman, head of economic research at JPMorgan.\"Continued stress in the banking system does, of course, increase concern that a disruptive financial market event is on the horizon,\" he added. \"Though our analysis suggests that the impact of a credit tightening against an otherwise healthy backdrop tends to be limited.\"Bond markets stabilised after having been rattled by Friday's jobs numbers. Yields on the two-year note were last up 4 bps at 3.9575%, while those on 10-year debt were up 2 bps at 3.462%.U.S. Treasury Secretary Janet Yellen on Sunday warned of a possible crisis should Congress not raise the debt ceiling before the deadline in early June, which has triggered a broad selloff in short-dated U.S. government debt in the past month.Meanwhile, the prospect of a pause in U.S. rate hikes has pushed gold towards record highs above $2,000 an ounce. Because it bears no yield itself, higher interest rates undermine investor appetite for gold. Spot gold was up 0.4% at $2,025 an ounce, having topped $2,072 last week, close to 2020's all-time high.In other commodity markets, oil rose 2.2% to $76.97 a barrel. Brent crude futures have lost 10% in value so far this year, as concern bubbles about the outlook for global energy demand if the economy tilts towards recession.",
        "(Additional reporting by Wayne Cole; Editing by Shri Navaratnam, Alison Williams and Christina Fincher)"
    ]
}