{
    "articleURL": "/tvshowbiz/article-12042051/Russell-Crowe-admits-knew-marriage-Danielle-Spencer-doomed-long-divorced.html",
    "content": [
        "Russell Crowe has admitted that he wrote songs about his inevitable divorce with his ex-wife Danielle Spencer, long before they decided to call it quits. ",
        "The musician and actor, 59, married the fellow actor and songwriter in 2003 and while they split in 2012 their divorce was finalised in 2018. However, Russell said he knew it was doomed in 2011, and some tracks on his album The Crowe/ Doyle Songbook were directed at Danielle, and these were titled Sadness Of A Woman and Too Far Gone. The Gladiator actor has admitted that he even 'tricked' Danielle into singing on this album with him.    He pretended that another woman was recording with him, but that was never the case, and he told Danielle this in the hopes that she would get jealous and offer to sing with him, and it worked.",
        "In a recent interview with The Saturday Telegraph, he said: 'So there I had her, I loved singing with her. I knew Dani and I were heading for divorce.'There are a number of songs on that album talking directly to Danielle, trying to head off what became inevitable.'Imagine getting your spouse to sing these songs in that situation.'",
        "The couple share two children together, Charles, 20, Tennyson, 17, and still have a close relationship 11 years after their divorce. Last month, Danielle even posted a touching tribute to her ex-husband on his 59th birthday and what would've been their 20th wedding anniversary. ",
        "The pair met in 1989 on the set of the film The Crossing, and married in April 2003 at the actor's farm in Nana Glen, New South Wales. 'Twenty years ago today, I married the father of my boys,' she captioned the post, which included a rare, intimate image of the actor with his sons as children.'While it is no longer our anniversary, it is still that guy's birthday. Happy Birthday @russellcrowe,' she added.",
        "Danielle has previously spoken about her unique relationship with her ex Russell and how they co-parent their teenage sons.The singer told Daily Mail Australia at the premiere of Russell's film Poker Face last January that they are still very much friends and 'catch up when they can'.'We catch up when we can. We're a divided family so when we can see each other, that's lovely,' she explained.In 2015, Russell made international headlines when he told The Sunday Times that he didn't rule out a reconciliation with Danielle.",
        "'I've loved Danielle Spencer since 1989 - that's never going to change - and that's one of those things where I stare at her and go, ''How did this fail?' I still can't work it out, because my feelings for her have never changed,' Russell said.",
        "But speaking to Sunday Style in April 2015, Danielle shot down suggestions of a reconciliation and said she was prioritising their children and family unit going forward.The Gladiator star is now dating American actress turned real estate agent Britney Theriot.They have been dating since 2020 but try to keep their relationship out of the public eye.  "
    ]
}