{
    "articleURL": "/wires/reuters/article-12041675/Apollo-seeks-majority-stake-SASs-Chapter-11-rescue-plan--sources.html",
    "content": [
        "Apollo seeking majority stake in troubled airline",
        "Shares rally on news of interest from ApolloSAS seeking investors as part of Chapter 11 bankruptcy planDeal would test EU rules on airline ownershipDanish, Swedish regulatory approval needed(Adds details on shares in paragraphs 2-3, Danish government, Apollo plans in paragraphs 14-20)By Jacob Gronholt-Pedersen, Greg Roumeliotis and Marie MannesCOPENHAGEN/NEW YORK, May 3 (Reuters) - U.S. asset manager Apollo Global Management Inc plans to apply for approval from Swedish and Danish regulators to take a majority stake in SAS AB as part of the Scandinavian airline's rescue plan, a source familiar with the matter said.The news of interest from the U.S. asset manager sent the embattled carrier's shares up as much as 14% in Wednesday morning trading. At 1011 GMT, they were up 5.9%.SAS has lost almost 60% of its value since it filed for Chapter 11 bankruptcy protection last July, seeking to slash costs and debt after wage talks with pilots collapsed.A deal with the U.S. private equity giant, which has also invested in U.S. and Mexican airlines, would be a test of European Union rules, which prevent more than 50% of an airline being held outside the bloc of 27 members.Given a large part of Apollo's capital originates from Europe-based investors, the fund is hoping to get approval for a deal, according to the source, who declined to be identified because the matter is confidential.",
        "No final decision has yet been made on a possible investment, according to two sources familiar with the matter. The first source said a deal could be done before the year-end.Apollo and SAS declined to comment.Apollo will mainly work with aviation regulators in Sweden and Denmark to secure approval, the first source said.The European Commission would also be involved, but the national regulators would be responsible for giving the go-ahead for a change of ownership.The move comes as the airline looks for large investors and seeks to raise equity as part of its Chapter 11 bankruptcy plan.It has also secured a $700 million debtor-in-possession (DIP) loan from Apollo to fund it through process. The U.S. company could become a major shareholder in SAS by converting that loan to equity at the end of the process.The airline has struggled to compete in Europe's fragmented aviation sector, like other national carriers such as Italy's ITA Airways and Portugal's TAP, which are to be bought by larger groups to revive their balance sheets.GOVERNMENT SUPPORTAny deal would likely need support from Sweden and Denmark, which each own about 22% of SAS. The remainder is controlled by private shareholders.Denmark's finance ministry told Reuters it was looking for one or more shareholders to take a majority stake in SAS. Any bailout would require the airline to maintain Copenhagen as a key passenger hub, it said.",
        "Sweden has said it won't inject more cash in SAS.The sources said SAS would maintain its Scandinavian identity, playing down speculation it could get a new hub or be transformed into a low-cost carrier under a new owner.This wouldn't be Apollo's first foray into the airline industry.In 2018, it invested in Sun Country Airlines in an effort to help turn it around, helping it go public in 2021.The company also became the largest shareholder in Mexican airline Aeromexico in 2020 following Chapter 11 bankruptcy proceedings. Those experiences show it can approach long-term investments flexibly, the two sources said. (Reporting by Jacob Gronholt-Pedersen in Copenhagen, Greg Roumeliotis in New York and Marie Mannes in Stockholm; Writing by Josephine Mason; Editing by Louise Heavens, Bernadette Baum and Mark Potter)"
    ]
}