{
    "articleURL": "/wires/reuters/article-12060749/Wall-Street-Journal-New-York-Times-Pulitzer-winners.html",
    "content": [
        "By Joseph Ax",
        "NEW YORK, May 8 (Reuters) - The Associated Press won two Pulitzer Prizes on Monday, including the distinguished public service award, for its coverage of the war in Ukraine, while the New York Times earned the international reporting honor for its stories about the Russian invasion.Washington Post reporter Caroline Kitchener won the national reporting prize for coverage of abortion in the United States after the Supreme Court last year overturned the landmark 1973 Roe v. Wade ruling that had legalized the procedure nationwide. Eli Saslow, now with the Times, won the feature writing award for the Post.Reuters was a finalist in two categories. In international reporting, the Pulitzer board cited Reuters for its four-part investigative series that exposed grave human rights abuses against women and children by the Nigerian military in its war with Islamist insurgents. In national reporting, Reuters was selected as a finalist for a series that revealed the widespread use of child labor by auto parts suppliers and poultry slaughterhouses in the U.S. state of Alabama.The annual Pulitzer awards, first presented in 1917, are the most celebrated honors in U.S. journalism. The prizes are named for newspaper publisher Joseph Pulitzer, who died in 1911 and left money to create the awards and establish a journalism school at Columbia University.",
        "The public service award, considered the most prestigious, honored Associated Press journalists Mstyslav Chernov, Evgeniy Maloletka, Vasilisa Stepanenko and Lori Hinnant, who remained in the Ukrainian town of Mariupol last spring as it came under fire from Russian troops and documented the killing of civilians.Maloletka was also part of the AP team in Ukraine that won for breaking news photography.Before announcing the winners, Neil Brown, co-chair of the Pulitzer board and president of the Poynter Institute, spoke in support of Wall Street Journal reporter Evan Gershkovich, who was detained during a reporting trip and accused of espionage by Russian authorities.The United States has objected to Gershkovich's arrest and called on Russia to dismiss the case.\"The Pulitzer Prize board joins the many organizations around the world demanding Evan's immediate release,\" Brown said. \"He, like so many others, is doing his job.\"An Alabama news website, AL.com, won two Pulitzers, one for local reporting and another for commentary.The Los Angeles Times won the Pulitzer Prize for breaking news for revealing a secretly recorded conversation among city council members that included racist comments, a scandal that prompted two officials to resign. The newspaper's Christina House also earned the feature photography award for her series showing the life of a pregnant homeless woman.",
        "In addition to the international reporting prize, the New York Times took the award for illustrated reporting and commentary. The Times has won 137 Pulitzers since the awards began.The Wall Street Journal won for investigative reporting for revealing financial conflicts of interest among officials at dozens of federal agencies.Caitlin Dickerson, a reporter at The Atlantic magazine, took home the explanatory reporting award for her in-depth examination of a U.S. policy under former President Donald Trump of separating parents from their children at the U.S. border.The Pulitzers also handed out awards in eight categories for books, music and drama.Two Washington Post reporters, Robert Samuels and Toluse Olorunnipa, won the Pulitzer for general nonfiction for \"His Name is George Floyd,\" a book about the Black man whose 2020 murder by police in Minneapolis sparked international protests.A board comprised mostly of leading editors or executives at major U.S. media outlets presides over the judging process. (Reporting by Joseph Ax; Additional reporting by Costas Pitas and Daniel Trotta; Editing by Will Dunham and Lisa Shumaker)"
    ]
}