{
    "articleURL": "/wires/afp/article-12056025/Let-Erdogan-Kurds-cautiously-secular-rival.html",
    "content": [
        "Exhausted by crackdowns in Turkey's Kurdish heartland, Ali is backing the main rival of President Recep Tayyip Erdogan in elections next Sunday -- though his faith in the presidential hopeful is not great.",
        "\"It's time for a change,\" the 50-year-old told AFP in Diyarbakir, the Kurds' unofficial capital in southeast Turkey.\"For anyone watching TV in Turkey, Kurds are terrorists,\" said Ali, who declined to give his full name for fear of retribution.\"But I would be lying if I said I fully trust the opposition candidate,\" he added, referring to Kemal Kilicdaroglu of the secular CHP party.Representing roughly a fifth of Turkey's 85 million people, Kurds have suffered repressions throughout the course of the post-Ottoman republic, which was created by CHP founder Mustafa Kemal Ataturk in 1923.Turkey officially denied the existence of such an ethnicity, depriving Kurds of cultural and education rights.Many Kurds embraced Erdogan's Islamic-rooted AKP when it ended decades of secular rule in 2002, seeing it as more inclusive and committed to changes.Erdogan tried to broker a deal to end a bloody Kurdish fight for an independent state, seeking to etch his place in history as the one who finally settled one of Turkey's most painful problems.The collapse of the talks in 2015 and a failed coup attempt the following year prompted Erdogan to resume military operations in Kurdish regions, pushing him closer to Turkey's nationalists.- 'Mosque or prison'-After holding out for much of the campaign, the pro-Kurdish HDP party has officially backed Kilicdaroglu, an endorsement that might just tip the close vote.",
        "The HDP's support \"is a major boost\" to Kilicdaroglu, Hamish Kinnear, a senior analyst at the Verisk Maplecroft risk consultancy, told AFP.Mehmet Emin Yilmaz, who wears a traditional Kurdish scarf, says he is ready to vote for whomever the HDP points to.\"I am Kurdish. The HDP defends my rights. If the police unjustly detains me today, the HDP will take care of me,\" the 60-year-old said.But while the election is one of Turkey's most important in its modern era, deciding the future of its longest-serving leader, there is little excitement on the streets of Diyarbakir.\"The people are intimidated, there are cameras everywhere. If more than two people gather, the plainclothes police arrive,\" said Erdem Unal, the CHP chief in Diyarbakir's historic Sur district.\"Erdogan left Kurds with two options: mosque or prison,\" he said -- and not the cemevis, places of worship for the separate faith exercised by Alevi Kurds.\"Diyarbakir has turned into an open-air prison,\" he said.- 'Piro'-Erdogan's alliance with the Huda-Par (Free Cause Party) has opened additional wounds.Huda-Par has links to the Kurdish Hezbollah movement, which is distinct from the Lebanese Shiite group of the same name.",
        "Comprised of Sunni Islamists, the Kurdish Hezbollah was implicated in the extrajudicial killings of Kurdish and women's rights activists in the 1990s.",
        "Some analysts viewed the Kurdish Hezbollah as a government tool for fighting the Kurdish insurgency led by the leftist PKK.Eyup Burc, founder of the pro-Kurdish IMC TV channel that has since been shut down, said Erdogan's embrace of Huda-Par meant he was trying to hang on to the most conservative elements of the Kurdish vote.\"Surveys show around 15 percent support for Erdogan in Diyarbakir, and it's melting further,\" Burc said.Kilicdaroglu's leftist CHP is almost invisible in Diyarbakir.But the 74-year-old former civil servant appears to attract local sympathies because of his openly Alevi faith -- and less emphasised Kurdish identity.Most Kurds call Kilicdaroglu \"Piro\" from \"pir\", a Kurdish word for grandfather that also describes an Alevi religious leader.- 'Courage'-But many Kurds have long-standing reservations about Kilicdaroglu and his six-party opposition alliance.It backed Erdogan's military incursions into Syria, which hit Kurdish areas controlled by a sister party of the PKK.",
        "The HDP's support for Kilicdaroglu follows the arrest of more than 100 Kurdish activists, journalists and lawyers in what the government billed an \"anti-terror\" operation.The roundups were aimed at \"sending a message to Turkey's (mostly Sunni) west\", said Nahit Eren, who heads the Diyarbakir bar association.Abbas Sahin, whose Green Left Party will represent pro-Kurdish candidates in the parliamentary portion of the ballot because of a threatened shutdown of the HDP, vowed that Erdogan would be consigned \"to the dustbin of history\".",
        "But Gulistan Atasoy Tekdemir, the HDP co-chair in Diyarbakir, said Kurds expected \"courage\" from the opposition candidate, insisting that their support should not be taken for granted."
    ]
}