{
    "articleURL": "/wires/afp/article-12056563/Arab-League-admits-Syria-11-year-absence.html",
    "content": [
        "The Arab League on Sunday welcomed back Syria's government, ending a more than decade-long suspension and securing President Bashar al-Assad's return to the Arab fold after years of isolation.",
        "In November 2011, the body suspended Damascus over its crackdown on peaceful protests, which had begun earlier that year and which spiralled into a war that has killed more than 500,000 people, displaced millions and battered the country's infrastructure and industry.While the front lines have mostly quietened, large parts of the country's north remain outside government control, and no political solution has yet been reached to the 12-year-old conflict.\"Government delegations from the Syrian Arab Republic will resume their participation in Arab League meetings\" starting Sunday, said a unanimous decision by the group's foreign ministers.",
        "The ministers in a statement emphasised their \"keenness to launch a leading Arab role in efforts to resolve\" the Syria crisis.They agreed to form a ministerial committee to continue \"direct dialogue with the Syrian government in order to reach a comprehensive solution\".Ahmed Aboul Gheit, head of the 22-member Arab League, said the decision \"brings the Arab side into communication with the Syrian government for the first time in years\".Syria's return to the body is \"the beginning... not the end of the issue\", he added, noting it was up to individual countries to decide whether to resume ties with Damascus.- 'Diplomatic victory' -Following the announcement, Syria's foreign ministry stressed the importance of \"Arab cooperation\", in a statement carried by state news agency SANA.",
        "\"The next stage requires an effective and constructive Arab approach... based on dialogue, mutual respect and common Arab interests\", it added.Several Arab countries cut ties with Syria early in the conflict, betting on Assad's demise, while some including Qatar and Saudi Arabia provided support to the Syrian opposition.Qatar on Sunday said it would not normalise relations with Assad's government, but foreign ministry spokesman Majid bin Muhammad al-Ansari told state media Doha would not be \"an obstacle\" to the Arab move.",
        "The last Arab League summit Assad attended was in 2010, while the opposition attended the pan-Arab group's summit in Doha in 2013, to Damascus's fury.Aboul Gheit told a press conference Assad was welcome to attend the Arab League's next summit on May 19 once invited by host Saudi Arabia.Regional capitals have gradually been warming to Assad as he has stubbornly held onto power and clawed back lost territory with crucial support from Iran and Russia.The United Arab Emirates, which re-established ties in late 2018, has been leading the recent charge to reintegrate Damascus into the Arab fold.In a phone call Sunday with UAE President Sheikh Mohamed bin Zayed Al-Nahyan, Assad expressed \"Syria's appreciation for the role the UAE has played in reunifying and improving Arab relations\", the Syrian presidency said.",
        "A February 6 earthquake that wreaked devastation in Turkey and Syria sparked Arab outreach to Assad's government, while intensified regional diplomatic activity has been underway since a March decision by rivals Saudi Arabia and Iran to resume ties.\"Syria's regional isolation is officially broken,\" analyst Fabrice Balanche said, calling Sunday's decision a \"diplomatic victory\" for Assad.- Opposition 'abandoned' -April saw a first Saudi official, Foreign Minister Prince Faisal bin Farhan, visit Damascus since the start of the war, days after a trip to Jeddah by Syrian Foreign Minister Faisal Mekdad.Mekdad has travelled to a string of Arab countries in recent weeks, including a May 1 meeting in Amman with counterparts from Jordan, Saudi Arabia, Iraq and Egypt to discuss the long-running conflict.Assad is hoping normalisation with wealthy Gulf nations could bring economic relief and money for reconstruction.",
        "With the war far from over and Assad still internationally isolated, analysts say sanctions will likely continue to deter investment.The Syrian National Coalition, the main opposition alliance, said Sunday's decision meant \"abandoning\" and ignoring \"the will of the Syrian people\", leaving them \"without official Arab support\".\"It is unacceptable to allow (Assad) to avoid punishment for the war crimes he has committed against Syrians,\" said the Turkey-based coalition.The Qatari foreign ministry spokesman said on Sunday that Damascus had to \"address the roots of the crisis that led to its boycott, and to take positive steps towards addressing the issues of the Syrian people\".",
        "In northwest Syria's rebel-held Idlib region, displaced Syrians expressed frustration.\"We were pushed out of our homes,\" said Ghassan Yussef, 54.\"I ask the Arab rulers: where are you taking us?\""
    ]
}