{
    "articleURL": "/wires/reuters/article-12042417/Suriname-bondholders-reach-debt-restructuring-deal--sources.html",
    "content": [
        "By Rodrigo Campos, Jorgelina do Rosario and Ank Kuipers",
        "NEW YORK/LONDON/PARAMARIBO, May 3 (Reuters) - Suriname reached an agreement in principle with its Eurobond creditor committee for the restructuring of its debt, the government said on Wednesday.The deal to restructure Suriname's two outstanding dollar-denominated bonds includes a single, $650 million 10-year bond with a 7.95% interest rate, amounting to a 25% \"haircut on the total recognized claims,\" the government said in a statement.Reuters first reported that both parties had reached a deal on debt restructuring.\"Of the 7.95% interest rate, 4.95% is required to be paid off in 2024 and 2025, with the remainder added to the principal,\" the government said.A value recovery instrument linked to future oil revenues and with an end date of Dec. 31, 2050, is part of the deal.\"Suriname will allocate a certain portion of royalty income from Block 58 in the future to compensate bondholders for losses incurred as a result of debt restructuring,\" said the government statement.The first $100 million in royalties from that block will go to the government, after which 30% of annual royalties will be allocated for payments to compensate debt holders.The creditor committee said that the agreement is set to provide the country over $900 million of cash flow relief between 2020 and 2026, according to a statement from its financial adviser Newstate Partners. Members of the committee, which holds about 75% of outstanding bonds, include Franklin Templeton Investment Management Limited, Eaton Vance Management, Grantham, Mayo, Van Otterloo &amp;amp; Co LLC, Greylock Capital Management LLC and T. Rowe Price.",
        "Suriname said the deal was subject to reaching a staff-level agreement with the International Monetary Fund by June 15. The IMF did not respond to a request for comment.Last month, the IMF said it was working closely with Suriname authorities to bring their financing program back, while looking for progress in bilateral debt talks between the government and China. A nearly $700 million program was agreed in late 2021, but it stalled after the first review was approved more than a year ago.There were no fresh details on the bilateral talks with China in Wednesday's government statement. (Reporting by Rodrigo Campos in New York, Jorgelina do Rosario in London and Ank Kuipers in Paramaribo; editing by Chizu Nomiyama, Jonathan Oatis and Toby Chopra)"
    ]
}