{
    "articleURL": "/wires/pa/article-12060333/Mark-Robins-proud-Coventry-clinch-phenomenal-play-place.html",
    "content": [
        "Mark Robins saluted his Coventry players for clinching a “phenomenal” play-off place in the Sky Bet Championship before then challenging them to finish off the promotion charge.",
        "The Sky Blues, who were relegated from the Premier League in 2001, secured fifth spot by earning a point at fourth-placed Middlesbrough.The two will now meet again over two legs. The first will be on Sunday, May 14 at the Coventry Building Society Arena before they return to the Riverside for the second leg on Wednesday, May 17 for the right to face either Luton or Sunderland at Wembley.Robins said: “I’m proud of everyone when you consider the start of the season we had, Middlesbrough were similar, near the bottom of the league, albeit different circumstances.“It took us a while to get going, but the achievement just to get into the play-offs is phenomenal. The only way to enjoy them is to win them.“Big teams have missed out. I only heard the scoreline from The Den, I knew what Sunderland were doing and then what Millwall were doing, so we had to stay in the game and it has worked out. The supporters have been right behind us all season. It’s fantastic.",
        "“We have them now Sunday and Wednesday, it’s a really interesting situation.“We have a few days to think about plans, the way we want to go about it. They are not daft here, Michael Carrick is very talented and they have a lot more to come, they are smart. We have to enjoy it, and enjoy the build up.",
        "“We started really brightly. The only thing that blotted the copybook was near half-time when we switched off.”Coventry, who needed to avoid defeat to stay in the play-off zone, secured the lead in the 22nd minute through Gustavo Hamer’s clinical strike into the bottom corner.But in stoppage-time at the end of the first half Cameron Archer hit his 11th of the season from close range to level things up.Despite Sunderland’s win at Preston, Millwall ended up losing a dramatic tussle with Blackburn 4-3, leaving Coventry’s fans celebrating at a sell-out Riverside.After he was asked where securing a play-off spot ranked, Middlesbrough manager Michael Carrick said: “It is not an achievement, it’s about what is next – all eyes are on what happens after that.”He added: “We have really worked hard in terms of preparing the right way, keeping our edge because performances matter, but we knew our fate a couple of weeks ago and where we would be.“It is different now in the play-offs, naturally there is a different feeling about it. There will be a different kind of atmosphere in the two stadiums, you have to relish it because you are fighting for something that is worth achieving.“Coventry are a really good team, well-organised and they play good football. They are a threat going forward.",
        "“The longer this game went on we dealt with it but they are a threat, and you would expect that given the run they have been on – just as you’d expect from all the teams in the play-offs.“Generally I was quite pleased with what we got from the day. We wanted to win the game, but all in all it was a good performance, and everyone came through it pretty well.”"
    ]
}