{
    "articleURL": "/wires/ap/article-12056023/Satellite-images-tankers-Iran-seized-Bandar-Abbas.html",
    "content": [
        "DUBAI, United Arab Emirates (AP) - Two oil tankers recently seized by Iran are anchored off the coast of one of its key port cities on the strategic Strait of Hormuz, according to satellite photos analyzed by The Associated Press on Sunday.",
        "The photos from Planet Labs PBC showed the Advantage Sweet and the Niovi being just south of Bandar Abbas near a naval base in the port city in Iran´s Hormozgan province Saturday. Their capture represents just the latest ship seizure conducted by Iran amid tensions with the West over its rapidly advancing nuclear program, though it appears the two ships may have been taken for different reasons.Iran seized the Marshall Islands-flagged Advantage Sweet, staffed by 23 Indians and one Russian, on April 27 as it traveled in the Gulf of Oman. Tehran claimed the vessel had struck another ship, though tracking data for the Advantage Sweet showed no erratic behavior on its trip. Iran has made claims in the past over ship seizures to cover for the vessels being taken to use as pawns in negotiations with the West.The Advantage Sweet carried Kuwaiti crude oil for American energy firm Chevron Corp. of San Ramon, California, at the time of its capture. And its seizure comes as another tanker believed to be carrying Iranian crude disappeared from anchorage off Singapore a year after being identified as trying to evade U.S. sanctions.The Financial Times, as well as the maritime intelligence firm Ambrey, both have reported that ship named Suez Rajan was seized by order of American authorities. U.S. officials and those associated with the Suez Rajan have not responded to questions about the tanker's disappearance while on a westward path.",
        "Satellite images showed a second ship, the Niovi, a Panama-flagged tanker, which was seized by Iran's paramilitary Revolutionary Guard on Wednesday as it left a dry dock in Dubai, United Arab Emirates, bound for Fujairah on the UAE's eastern coast. While not carrying any cargo, data from S&amp;P Global Market Intelligence seen by the AP showed the Niovi in July 2020 received oil from a ship known then as the Oman Pride.",
        "The U.S. Treasury in August 2021 sanctioned the Oman Pride and others associated with the vessel over it being \"involved in an international oil smuggling network\" that supported the Quds Force, the expeditionary unit of the Revolutionary Guard that operates across the Mideast.Separately, purported emails published online by Wikiran, a website that solicits leaked documents from the Islamic Republic, suggest that cargo carried by the Niovi was sold on to firms in China without permission.United Against a Nuclear Iran, which has tracked sanctioned crude shipments by Tehran, \"strongly suspects the seizure of the Niovi is related to a dispute over a shipment of Iranian oil,\" said Claire Jungman, the chief of staff of the organization. Iran has said it seized the Niovi over an unspecified court order in Tehran.The managers of the Niovi did not answer repeated telephone calls for comment. The Greek Coast Guard have said the Niovi was staffed by Greek, Filipino and Sri Lankan sailors.",
        "Meanwhile Sunday, an internet account describing itself as a group of hackers claimed responsibility for allegedly taking down websites associated with Iran's Foreign Ministry. The claims of the account GhyamSarnegouni, whose name in Farsi means \"Rise to Overthrow,\" went unaddressed for hours as websites of the Foreign Ministry's remained down over what was initially called \"scheduled maintenance and upgrades.\"Cached versions of the websites of Iranian diplomatic posts in Dubai, United Arab Emirates, Munich, Germany, and Seoul, South Korea, appeared to have been defaced with a message in Farsi reading: \"Death to Khamenei, Hail Rajavi.\" Khamenei refers to Iran's Supreme Leader Ayatollah Ali Khamenei, while Rajavi likely refers to Massoud Rajavi, the long-missing leader of the Iranian exile group Mujahedeen-e-Khalq, or his wife Maryam, who is now the public face of the group.\"There is a great revolution in Iran, the uprising will go until the demolition of the palace of oppression,\" the message read.Early Monday, Iran's Foreign Ministry websites were back online. The state-run IRNA news agency quoted Foreign Ministry spokesman Nasser Kanaani as acknowledging its websites had been hacked while trying to downplay the incident.___Jon Gambrell on Twitter: www.twitter.com/jongambrellAP."
    ]
}