{
    "articleURL": "/tvshowbiz/article-12044021/Savage-Gardens-Darren-Hayes-splits-husband-Richard-Cullen-17-years-marriage.html",
    "content": [
        "Savage Garden frontman Darren Hayes has split from his husband Richard Cullen after 17 years of marriage.",
        "The Truly Madly Deeply star, 50, shared the sad news on Wednesday, telling fans on Instagram he separated from British artist Cullen, 52, earlier this year.Hayes began his post by saying he'd kept his marriage woes a secret for 'the past two years', despite being an 'open book' when it comes to his music.'After 17 years of marriage to the best person I ever met, Richard and I have chosen to accept that our union has greatly and beautifully come to rest,' he wrote.'In honour of this realisation, we separated earlier this year and have been supporting each other emotionally throughout this massive changed in our lives.'",
        "Hayes went on to address the 'ugly questions' about what led to his marriage split in order to avoid any hurtful speculation. 'No, there's no scandal to report, no infidelity, guilty or third party. It's just life. We adore each other and always will,' he said.'We view our marriage as our greatest collaboration. Nobody can ever take away what we achieved together. We are still best friends. We always will be.'Besides, we have a very cute and needy labradoodle to take care of, and the business of joy to attend to.'",
        "Hayes concluded his post by praising his fans for their loyalty over the years.",
        "'Thank you for always supporting our union – and for being so gentle with this delicate thing we made. Love Darren (and Richard),' he wrote, in reference to his 2009 album This Delicate Thing We've Made.Hayes accompanied the post with a paper crane artwork that Cullen, 52, had created for the This Delicate Thing We've Made album cover.",
        "Hours after Hayes confirmed the split, Cullen posted his own statement on Instagram, which read: 'Today the sun will set. Tomorrow it will rise again. And there's not a goddamn thing you can do to stop it.'The news comes days after Hayes hinted at personal issues in a lengthy Instagram post about his latest single Feels Like It's Over, which tells the story of a break-up. The music video shows Hayes going through a painful split from a male partner.",
        "'Never in my entire career has art ever imitated life more than this year,' he wrote next to an image from the music video. He went on to praise his co-star Casey James and director Andrew Huebscher for supporting him during an emotional creative journey. 'This is the end of an era in so many ways. I poured my soul into this album, this tour and into people I met along the way and yes, I got my heart broken in the end,' he added.",
        "'Was it worth it? I don't know. But it's all real. I don't know how to be any other way.'  Hayes' split comes just one year after he spoke in glowing terms of his marriage to Cullen in an interview with The Sydney Morning Herald. The former couple met online in 2004 and had their first date on the steps of Westminster University in London, where Cullen was teaching at the time. ",
        "'It was love at first sight,' he told the publication.'He's an Englishman with a cute northern accent. My friends call him the gay Mother Teresa because he's so perfect.'Hayes called Cullen 'the funniest person in the room' who is happy to let him 'shine in public, while in private he is my counsel'.",
        "Cullen was Hayes' second spouse, following his first marriage to his childhood sweetheart Colby Taylor in 1994.Taylor, a makeup artist, was married to Hayes when he shot to fame as the frontman of Savage Garden in 1997.'We were like Will &amp; Grace – inseparable best friends,' he said of Taylor during an interview with the Sydney Morning Herald. 'She is one of the strongest women I know. Colby was there from the beginning of Savage Garden and the cyclone of craziness that ensued.'Savage Garden, comprising Hayes and guitarist Daniel Jones, formed in 1993 and produced a slew of No. 1 hits, like To the Moon and Back and Truly Madly Deeply.",
        "The band called it quits in 2001. Hayes continued with a solo career while Jones went on to marry former Hi-5 star Kathleen De Leon."
    ]
}