{
    "articleURL": "/wires/pa/article-12050381/Serbian-leader-says-gunman-targeted-people-random-latest-mass-shooting.html",
    "content": [
        "Serbia’s president has said the gunman in the latest mass shooting to hit the country targeted people at random.",
        "Aleksandar Vucic said the assailant shot at people “wherever they were”, and branded the assault an attack on the whole country.The gunman killed eight people and wounded 14 others in two Serbian villages south of Belgrade on Thursday, authorities and media reported. Police arrested a suspect on Friday following an all-night manhunt.The shooting came a day after a 13-year-old boy used his father’s guns to kill eight fellow pupils and a guard at a school in Belgrade, the capital.Mr Vucic vowed to the nation in an address that the suspect in the shooting “will never again see the light of the day”.The populist leader called the shooting a terrorist attack, as is typical in Serbia.He announced a series of “anti-terrorist” measures, including the hiring of 1,200 policemen and putting a police officer on guard each day at schools.Reports said that the suspect in the latest shooting, identified by initials UB, was arrested in Vinjiste, a village 90 miles south of Belgrade.Officers searching a relative’s home found a large stash of illegal weapons and ammunition, state broadcaster RTS reported.Authorities released a photo showing a young man in a police car in a blue T-shirt with the slogan “Generation 88” on it. The double eights are often used as shorthand for “Heil Hitler” since H is the eighth letter of the alphabet.",
        "Mr Vucic said the suspect repeated the word “disparagement” but it was not clear what that meant.Reports of the arrest followed an all-night search by hundreds of officers, who sealed off an area south of Belgrade where the shooting took place late on Thursday.The attacker shot randomly at people in two villages near Mladenovac, some 30 miles south of the capital, broadcaster RTS said.Serbian interior minister Bratislav Gasic called Thursday’s drive-by shootings “a terrorist act”.This week’s bloodshed sent shockwaves through a Balkan nation scarred by wars, but unused to mass murders.Though Serbia is awash with weapons left over from the wars of the 1990s, Wednesday’s school shooting was the first in the country’s modern history.The last mass shooting before this week was in 2013, when a war veteran killed 13 people in a central Serbian village.Serbia spent much of Thursday reeling from its first mass shooting in 10 years. Students, many wearing black and carrying flowers, filled the streets around the school in central Belgrade as they paid silent tribute to the dead.Serbian teachers’ unions announced protests and strikes to warn about a crisis in the school system and to demand changes.The same day, authorities moved to boost gun control, as police urged citizens to lock up their guns and keep them away from children.",
        "The government ordered a two-year moratorium on short-barrel guns, tougher control of people with guns and shooting grounds, and tougher sentences for people who enable minors to get hold of guns.A registered gun owner in Serbia must be over 18, healthy, and have no criminal record. Weapons must be kept locked and separately from ammunition.The shooting on Wednesday morning in Vladislav Ribnikar primary school also left seven people in hospital – six children and a teacher. One girl who was shot in the head remains in life-threatening condition, and a boy is in serious condition with spinal injuries, doctors said on Thursday morning.Authorities have said the attacker, whom police identified as Kosta Kecmanovic, is too young to be charged and tried. He has been placed in a mental institution, while his father has been detained on suspicion of endangering public security because his son got hold of the guns.Gun culture is widespread in Serbia and elsewhere in the Balkans: The region has among the highest numbers of guns per capita in Europe. Guns are often fired into the air at celebrations and the cult of the warrior is part of national identities.Experts have repeatedly warned of the danger posed by the number of weapons in the highly divided country, where convicted war criminals are glorified and violence against minority groups often goes unpunished.",
        "They also note that decades of instability stemming from the conflicts of the 1990s, as well as ongoing economic hardship, could trigger such outbursts."
    ]
}