{
    "articleURL": "/wires/reuters/article-12056389/Home-cooking-Guardians-Cal-Quantrill-aims-topple-Twins.html",
    "content": [
        "When Cleveland Guardians right-hander Cal Quantrill takes the mound against the visiting Minnesota Twins on Sunday afternoon, he'll hope the welcome mat will be out for him again.",
        "In previous years, a Quantrill start in his home ballpark practically was a guaranteed win for Cleveland.Quantrill went 6-0 in decisions at home in 2021 and was even better in 2022, going 9-0. All told, he had been 15-0 over his first 44 appearances in Cleveland.And then 2023 happened.On April 8 against the visiting Seattle Mariners, Quantrill lasted only five innings and gave up all three earned runs in Cleveland's 3-2 loss.It got worse on April 24, when Quantrill had his shortest outing of the season. He yielded five runs on eight hits in 3 1/3 innings of a 6-0 setback to the Colorado Rockies.\"This place is usually good to me,\" Quantrill said after the loss to the Rockies. \"I just didn't make good pitches in bad counts and fell behind a couple of guys. We battled. But I just didn't have my best game today.\"Quantrill has enjoyed success against the Twins, posting a 4-0 record and 3.72 ERA in 10 career appearances (seven starts).Quantrill, who is 1-2 overall with a 4.73 ERA this season, is hoping for more like his most recent start as well. He delivered his finest performance of the season last Monday, allowing two runs on six hits in 7 1/3 innings of a no-decision against the New York Yankees.",
        "\"Cal turned it right back around there,\" Cleveland manager Terry Francona said after that start. \"But he's a smart guy, and that's what smart pitchers do.\"Quantrill's counterpart on the mound, Minnesota right-hander Joe Ryan (5-0, 2.37), also should feel comfortable in making his start in Sunday's series finale.Ryan has relied more frequently on a split-finger pitch and has lessened his usage of his fastball and slider this season. He is off to a flying start with 43 strikeouts in 38 innings.Ryan also has had success against the Guardians. He has made five starts against them, posting a 3-0 record with a 1.42 ERA while allowing only 18 hits in 31 2/3 innings.He's been even better pitching in Cleveland, winning both of his starts and allowing only four hits in 14 2/3 innings.\"I feel really positive right now,\" Ryan said after giving up only one hit in six innings of a no-decision against the Chicago White Sox on Tuesday. \"Just keeping it simple, filling up the zone.\"Minnesota and Cleveland have split the first two games of this series.The Twins won 2-0 on Friday on the strength of Max Kepler's two-run home run. Kepler went deep again on Saturday, but the Guardians pulled out a 4-3 win following Steven Kwan's seventh-inning solo shot.",
        "--Field Level Media"
    ]
}