{
    "articleURL": "/tvshowbiz/article-12040679/Alessandra-Ambrosio-keeps-casual-tight-blue-leggings-white-sweatshirt-leaves-gym.html",
    "content": [
        "Alessandra Ambrosio was fashionable in athleisure as she left a gym in West Hollywood on Tuesday.",
        "The 42-year-old Brazilian beauty - who recently enjoyed Coachella - flaunted her famous statuesque figure in clinging blue leggings.The style savvy mother-of-two teamed it with a matching top, which showed slightly under her white zip-up hoodie.She wore her sun-kissed, honey blonde-highlighted locks loose, letting them fall over her shoulders in a straight texture.The bombshell shielded her eyes in a pair of sleek, ombre-tinted aviator sunglasses. ",
        "The former Victoria's Secret Angel was spotted exiting a dark luxury car on the sunny Southern California day.She stepped out in long white tube socks and a pair of matching stark white sneakers.The runway regular slung a slouchy white bag with a chain strap over her shoulder and carried her phone.The star, who regularly takes to social media to share glimpses of her life, flaunted a short, red manicure.Also on Tuesday, Alessandra appeared on Instagram to share two new photos with her more than 11 million followers.The stunner posed outdoors in simple yet striking images that showed her holding lavender plants.She looked youthful and gorgeous with sunlight hitting her flawless complexion.Alessandra glowed in a palette of soft makeup that highlighted her delicate features.She wrote in the caption, 'Soaking up the sun,' and included sun, plant, and star emojis.",
        "The supermodel geotagged her location as Santa Monica, California and tagged photographer Lauren Alexandra as well as fashion stylist Heather Smith.Last week the star turned heads as she flaunted her incredible figure while attending The Daily Front Row's 7th annual Fashion Los Angeles Awards.",
        "The CAA Model showcased her toned physique in a sheer maxi wrap dress with a high slit that featured a long trail that dragged behind her.She slicked her brunette tresses back with a center part and slipped into a pair of open-toed, silver heels to match her HIBOURAMA x MVP Wardrobe Diamond Bag and chunky necklaces.And las month Alessandra showed off her toned abs on a beach in Brazil, joined by her lookalike daughter Anja Louise, 14, and stunning sister Aline. The bikini designer also has a son named Noah, 10.She enjoyed quality time with her family and also attended Lollapalooza."
    ]
}