{
    "articleURL": "/wires/ap/article-12043341/Man-dies-placed-headlock-NYC-subway.html",
    "content": [
        "NEW YORK (AP) - A man who had been shouting at people aboard a New York City subway train died after fellow riders tackled him and one put him in a chokehold that lasted until his body went limp, according to police officials and video of the encounter.",
        "Jordan Neely, 30, died from compression of the neck, the city´s medical examiner determined Wednesday.Neely is recognizable to some New Yorkers as a Michael Jackson impersonator who regularly danced in the Times Square transit hub. On Monday afternoon, he was yelling and pacing back and forth on an F train in Manhattan, witnesses and police said, when he was restrained by at least three people, including a U.S. Marine veteran who pulled one arm tightly around his neck.Video of the altercation posted online by a freelance journalist showed the man lying beneath Neely, holding him in a headlock position for several minutes as Neely tried and failed to break free. A second passenger pinned Neely's arms while a third person held down his shoulder.It was unclear why the group had moved to restrain him.Neely, who is Black, lost consciousness during the struggle. EMTs and police arrived after the train stopped at a station. He was pronounced dead at a Manhattan hospital shortly after.",
        "The 24-year-old Marine veteran, who appeared to be white, was taken into custody and released without charges. His name has not been released publicly.The medical examiner's office classified Neely's death as a homicide and the manner as a chokehold, but noted that any determination about criminal culpability would be left to the legal system.",
        "The Manhattan district attorney's office said it is investigating.\"As part of our rigorous ongoing investigation, we will review the Medical Examiner´s report, assess all available video and photo footage, identify and interview as many witnesses as possible, and obtain additional medical records,\" read a statement from a spokesperson for the DA.As news of Neely´s death spread online, video of the encounter evoked strong reactions from New Yorkers and officials. Some described the act as a lethal overreaction to a person in the throes of mental illness and others defended the Marine veteran´s actions.A group of protesters gathered Wednesday afternoon in the station where Neely died to call for an arrest. Kyle Ishmael, a 38-year-old Harlem resident, said the video of the incident left him feeling \"disgusted.\"\"I couldn´t believe this was happening on my subway in my city that I grew up in,\" he said.Neely's death comes amid a period of heightened public attention to both homelessness and mental illness on New York City´s streets and subways. Following several high-profile incidents, including a shooting on a subway train that left 10 people wounded last year, Mayor Eric Adams promised to deploy additional police officers and mental health workers throughout the transit system.The freelance journalist who recorded the incident, Juan Alberto Vazquez, told the New York Post that Neely was screaming \"in an aggressive manner,\" and complaining of hunger and thirst. Neely did not physically attack anyone, Vazquez said, adding that the Marine veteran approached the man after he threw his jacket to the ground.",
        "The video starts with Neely already on the subway car's floor, with the man's left arm around Neely´s neck, locked into his other arm positioned against the man´s head. A second man holds Neely´s outstretched arm while pinning the other hand against his body. Neely is mostly still, but half a minute later tries to struggle out of the headlock. Eventually, he goes limp.Dave Giffen, the executive director at Coalition for the Homeless, blamed city and state officials for an inadequate response to the mental health crisis - and questioned why the Marine veteran was not facing criminal charges.\"The fact that someone who took the life of a distressed, mentally ill human being on a subway could be set free without facing any consequences is shocking,\" he said. \"This is an absolute travesty that must be investigated immediately.\"Those calls were echoed by several Democratic elected officials, who described the incident as a low point for the city.During an appearance on CNN on Tuesday night, the mayor said there were still too many unknowns.\"We don´t know exactly what happened here,\" Adams said, adding that \"we cannot just blatantly say what a passenger should or should not do in a situation like that, and we should allow the investigation to take its course.\"",
        "Tribute videos posted online show a loyal fanbase who enjoyed crossing paths with Neely on their daily commutes. Some grew concerned when he went missing early last year, according to YouTube comments.Jason Williams, an actor, recalled encountering Neely when he first moved to the city in 2007. Then a teenager, Neely was an agile Michael Jackson impersonator, Williams said, soliciting donations as he moonwalked through the subway and lip-synced to \"Billie Jean.\"\"He embodied the hustle spirit of New York,\" Williams said. \"He was a great performer and it´s a real tragedy that he was killed so senselessly.\"The Rev. Al Sharpton demanded in a statement that Neely's death be investigated as a potential case of manslaughter. Sharpton referenced the Bernhard Goetz case in 1984, in which a white gunman was convicted of a weapons offense after he shot four Black men on a subway train.\"We cannot end up back to a place where vigilantism is tolerable. It wasn´t acceptable then and it cannot be acceptable now,\" Sharpton said.Andre Zachery, Neely´s father, told the New York Daily News that he had not seen his son in four years.Zachery told the paper that Neely´s mother also died violently. Christie Neely was strangled in New Jersey in 2007, according to news accounts at the time. Her body was found days later in a suitcase along a roadway. Neely, who was 14 when she died, testified against his mother´s boyfriend at his murder trial."
    ]
}