{
    "articleURL": "/wires/reuters/article-12039089/Bleach-maker-Clorox-raises-annual-forecasts-higher-prices.html",
    "content": [
        "By Granth Vanaik and Jessica DiNapoli",
        "May 2 (Reuters) - Clorox Co raised its annual sales and profit forecasts on Tuesday, banking on higher product prices that helped the household staples maker overcome a slowdown in demand for its products.Consumer product companies over the past year have been bumping up prices to protect profit margins from a stronger U.S. dollar, rising labor, raw materials, and supply chain costs.While price hikes helped increase gross margins to about 42% from 36% a year ago, it also helped Clorox post a 6% rise in net sales to $1.92 billion for the third quarter ended March 31. Analysts had expected revenue of $1.82 billion, as per Refinitiv data.During the pandemic, Clorox products were in high demand as people stocked up on its wipes and surface cleaners in an effort to keep their homes clean and infection-free.However, demand has since begun to ease with Clorox seeing volumes drop in its health and wellness, and household segments in the reported quarter, even as it said earlier this year there will not be any more price hikes ahead.\"We are still watching the consumer closely... we know they are under financial pressure as inflation continues to drag on,\" said Clorox Chief Financial Officer Kevin Jacobsen in an interview with Reuters.",
        "Peers Procter &amp;amp; Gamble Co and Kimberly-Clark Corp have also raised their respective forecasts in recent weeks banking on higher product prices.The Pine-Sol manufacturer now expects fiscal 2023 net sales to increase between 1% to 2%, compared with a previous forecast range of a 2% decrease to a 1% increase.It now projects annual adjusted earnings between $4.35 and $4.50 per share, compared with prior outlook of $4.05 to $4.30. (Reporting by Granth Vanaik in Bengaluru and Jessica DiNapoli in New York; Editing by Shailesh Kuber)"
    ]
}