{
    "articleURL": "/wires/ap/article-12056287/Across-town-dogs-labor-save-suffering-ones.html",
    "content": [
        "NEW YORK (AP) - On a recent afternoon at a Manhattan animal hospital and adoption center, a pit bull mix called T-Bone, rescued after being tied to a utility pole, gazed out at visitors from his tidy room. Trigger was recuperating from a stab wound, a large incision still visible on his side.",
        "Pert little Melanie had been abandoned at one of the American Society for the Prevention of Cruelty to Animals' community veterinary clinics. Tip´s owner had been overwhelmed by six dogs and four cats. Friendly, retriever-like Rainbow, surrendered by someone who could not care for him, snoozed in the adoption office.While the Westminster Kennel Club crowns the cream of the canine elite on one of tennis´ most storied courts this week, the ASPCA's facility across town will be tending to dogs that have had far darker lives.New York is home to both the United States´ most prestigious dog show and its oldest humane society, the ASPCA. Their histories connect: Some proceeds from the inaugural Westminster show, in 1877, helped the young ASPCA build its first shelter years later.Westminster, being held 10 miles (16 km) east, feels like worlds away.\"We have different priorities, different visions,\" said ASPCA President Matt Bershadker. \"The dog shows are focused on breed and composition and movement. And we´re focused on the heart and the inside.\"",
        "Westminster stresses that it aims \"to create a better world for all dogs,\" and the club donates thousands of dollars a year to individual breeds' rescue groups and to pet-friendly domestic violence shelters. Still, the show draws protests every year from animal-rights activists who argue that spotlighting prized purebreds leaves shelter pets in the shadows.",
        "Bershadker, for his part, says ASPCA leaders \"don't have a problem with purebreds, but we want them to be responsibly bred.\"At the adoption center, there's little reference to breed or might-be breed. Instead, staffers try to characterize dogs by, well, characteristics.During a recent visit, Sauce (\"great on a leash,\" in adoption center leader Joel Lopez's description) was paired with Gordon (\"likes hot dogs!\") in the airy, windowed training room.The two young adult males with gut-twisting histories - Sauce had been stabbed, Gordon starved - were there to learn to play and be around other dogs in a city of shared spaces. They sniffed each other and ran around on leashes, with occasional interventions from staffers when the interactions began to intensify.Elsewhere in the Upper East Side building, a terrace gives a taste of the outdoors to dogs that may seldom have been there. There's even a mock living room where volunteers can bring animals to get used to just hanging out at home.\"Regardless of where these animals are coming from, these are great pets. They just need a little bit of help to just get them over the hump and get them into the rest of their life,\" Lopez said.That help is part of a $390 million-a-year organization that responds to disasters and large-scale animal cruelty cases nationwide. Its wide-ranging work includes a Miami vet clinic, an Oklahoma City horse adoption initiative, a Los Angeles-area spaying and neutering service, a behavioral rehab facility in North Carolina, and more.",
        "Established in 1866, the ASPCA is familiar to many Americans from its fundraising ads featuring woebegone animals, particularly a 2007 spot that featured singer-songwriter Sarah McLachlan and ran for years. The charity spent over $56 million on advertising and promotion alone in 2021, the last year for which its tax returns are publicly available.Bershadker says the organization affects hundreds of thousands of animals annually, and its marketing communications form \"an essential part of the ASPCA´s lifesaving work\" by increasing public awareness and action.On another end of the dog-rescue spectrum, the all-volunteer Havanese Rescue Inc. takes in an average of about 30 Havanese each year and finds new homes for many within two to four weeks, according to group leaders.Getting $5,000 from the Westminster Kennel Club this year is \"huge\" to a group with a $60,000-a-year budget and dogs that have come in needing $10,000 surgeries, President Jennifer Jablonski said.Westminster also is giving $5,000 apiece to the Newfoundland Club of America, which has a rescue arm that found new homes for 67 Newfs last year, and to Lagotto Romagnolo Dog Rescue.At the ASPCA, the New York animal hospital alone treats 9,000 to 10,000 patients a year. In late April, there were at least 50 animals apiece in the adoption and recovery centers and about 100 or more in foster care, with kitten season looming.",
        "There are numerous animal shelters and rescue groups in New York City, and the ASPCA isn't the go-to place for stray and lost dogs and cats. (The city largely directs such inquiries to Animal Care Centers, another nonprofit group.)The ASPCA's charges often come through its work with police, but also from clinics, a food bank partnership and other efforts to connect with people struggling to support their pets because of financial, health or other problems.While the group helps police to build criminal cases, that's not the only outcome.One small dog in the recovery area in late April was to be reunited with its owner. What had seemed like abandonment turned out to be a pet-sitting foul-up, but the owner also needed help with some veterinary issues, said Kris Lindsay, who oversees the recovery center.\"This,\" she said, \"is one of the cases that we like.\"This one, too: Rainbow has a new home - with a Connecticut man who had adopted dogs before.___New York-based Associated Press journalist Jennifer Peltz has covered the Westminster dog show since 2013."
    ]
}