{
    "articleURL": "/sport/nba/article-12048327/Pistons-Rob-Murphy-fired-sexual-assault-harassment-claims-ex-assistant.html",
    "content": [
        "Murphy is accused of trying to force his executive assistant to have sex with himDeJanai Raska said Murphy pinned her down on a bed but she managed to resistDailyMail.com provides all the latest international sports newsThe Detroit Pistons have fired assistant general manager Rob Murphy for an alleged violation of the team workplace conduct policy involving his female executive assistant. ",
        "That woman, 32-year-old DeJanai Raska, is now breaking her silence and has filed a lawsuit against the team, claiming that Murphy groped her private parts in front of her 4-year-old daughter and also grabbed her buttocks on several occasions, subjected her to unwanted kissing, and even told her she aroused him and he wanted to 'put a baby in her.''Rob attempted to force me to have sex with him, and that's something hard to talk about,' Raska, a mother of two, told Detroit's Fox affiliate.  In one 2022 incident, Raska claims, Murphy returned from a scouting trip to his home, where she was babysitting his son. Murphy allegedly told the boy to go to bed when he arrived, which is when Raska claims he tried to force her to perform oral sex on him. 'He got in front of me and pushed me down on his bed,' Raska told the Detroit Free Press.",
        "'I'm literally trying to push my body up because he's on top of me, and I'm like, ''Hey, Rob, I don't want to do this.'Eventually she lied, telling him she was 'on her period,' but Murphy allegedly did not stop. 'Sex is sex,' he allegedly told Raska. 'You think too much.' Murphy was already placed on leave when Raska first made the allegations to the team seven months earlier and has remained away from the team until his firing this week. ",
        "'It felt like I had a dangerous secret. I felt like if the wrong person found out, I could be fired,' Raska told the Detroit Free Press, outlining the allegations in a lawsuit. She said she lived with fear and anxiety for months, until she couldn't take it anymore.'Silence is not an option,' Raska said. 'It's not for me. It shouldn't be for any woman ... This is my chance to voice the truth ... and to take my power back.'Team spokespeople have not responded to DailyMail.com's request for comment on the lawsuit.  ",
        "The team announced its decision in a statement on Thursday. 'Rob Murphy no longer works for the Detroit Pistons or Motor City Cruise, in any capacity,' the team statement began. 'Mr. Murphy was recently terminated for violation of company policy and the terms of his employment agreement. 'The facts that gave rise to his termination surfaced during a review, assisted by a national law firm, of allegations made by a former employee.She also claims Murphy manipulated her into thinking he was her only superior in her corner within the club. 'I was isolated and manipulated. Rob made it feel like he was the only person there who had my back,' said Raska, a fellow Detroit native. 'He made statements ... that HR didn't want me there. Nobody wanted me there. That HR thought I was ghetto.' ",
        "Raska said she endured the treatment from Murphy out of fear of dismissal. 'My main concern and fear is that I would be fired — without a doubt, fired and silenced,' Raska said.'The tightness that I felt he had with HR and the higher-ups was enough for me to just feel like if I opened my mouth, if I said anything .... that I would become a problem,' Raska said.",
        "Another Detroit native, the 50-year-old Murphy was the Pistons G League team president before he was promoted to assistant general manager in 2022.Murphy spent a decade as head coach at Eastern Michigan before joining the Pistons. Like general manager Troy Weaver, Murphy is a former assistant coach at Syracuse, among other stops in the college ranks.A football and basketball star at Detroit Mumford, Murphy went on to coach hoops at Detroit Crockett and Central High Schools. He was also the head coach at Eastern Michigan for 10 seasons (2011-21) and reached three postseasons."
    ]
}