{
    "articleURL": "/femail/article-12047923/I-bought-abandoned-building-Japan-transformed-Swedish-inspired-home.html",
    "content": [
        "Swedish model Anton Wormann invited TikToker Caleb Simpson into his home He reveals how he bought a property which had been left dormant for ten yearsAfter months of DIY he transformed the place into a slick Scandinavian lair Talk about a jaw dropping home makeover project.",
        "Swedish model Anton Love Wormann welcomed property tour guru and content creator Caleb Simpson into his home in central Tokyo and revealed how he transformed an abandoned wreck of a place into slick Scandinavian retreat. In a one-minute long TikTok clip, which has been watching more than 17 million times, Anton explains how he bought a property which had been left dormant for ten years and then spent months transforming the interiors. As Caleb steps into the home and surveys the inside he exclaims 'oh my goodness.' to which Anton says: 'It doesn't feel like Japan, right?'",
        "Caleb agrees that it doesn't have a Japanese feel, with light wood cladding, high beamed ceilings, modern fixtures and fittings and white furnishings.Anton shows the property pro one of his proudest achievements, which comes in the form of an outdoor shower standing over a wooden bath tub.Moving on, the duo continue on their tour and Anton explains that he 'saved the old Japanese pink tiles' in the main bathroom.In the living room he lowered the floor to create more space, while due to the threat of earthquakes, he had to install support beams in certain areas to help prevent against collapse. In the kitchen, he informs viewers that he installed a Swedish kitchen with high countertops with white tiled walls completing the look.",
        "Continuing upstairs, Anton points out that he kept the original hanging light on the landing and then he gave the two bedrooms more of a Japanese look with the mattresses placed on the floors and traditional woven straw mats to provide comfort under foot. At the end of the clip, Anton reveals that abandoned properties are very common in Japan. He concludes: 'Everybody knows someone who has a car [in Sweden], it's the same in Japan. Everybody knows someone who in their family posses an abandoned house.'",
        "Since Caleb uploaded the Japanese home tour clip to TikTok, thousands of viewers have applauded Anton's DIY skills. One commenter said: 'Wow, that's impressive.'And another wrote: 'Very cool.'On Anton's personal social media channels, videos document the renovation process in more detail. In one clip he reveals that termites were a major problem when he moved in, while another surprising feature of the home, was that all of the former owner's possessions were still inside. Some of Anton's finds included kimonos, 'beautiful chests,' and a collection of more than 500 vinyls.However, the amount of rubbish that he had to throw away was a problem as he explains in another video how garbage disposal is very expensive in Japan and he had to factor that into his budget.  "
    ]
}