{
    "articleURL": "/tvshowbiz/article-12059989/American-Idol-not-airing-Disney-themed-episode-Sunday.html",
    "content": [
        "READ MORE: Fans call for a 'permanent' change... after Alanis Morissette and Ed Sheeran filled inAmerican Idol audiences officially whittled down the top eight contestants to just five on Sunday night's episode of the 21st season of the ABC singing competition.",
        "But due to judges Katy Perry and Lionel Richie's trip to England to perform at King Charles III's coronation, Disney Night will not air until next Sunday (instead of this Monday).The top five proudly posed together while wearing various hats and Minnie ear headbands from the theme park/resort Disneyland in Anaheim, which is where the next episode will tape with mentor, Descendants star Sofia Carson.Each performer had to cover songs by guest judges seven-time Grammy winner Alanis Morissette and four-time Grammy winner Ed Sheeran.Fans voted for Colin Stough - an 18-year-old HVAC technician from Gattman, MS - following his renditions of Alanis' 1995 hit Hand in My Pocket and Ed's 2017 song Dive.",
        "Wé Ani (last name McDonald) - a 24-year-old from Harlem, NY - took the stage to perform an emotional cover of Morissette's 1998 track Uninvited and Sheeran's 2017 song Perfect.Iam (born William) Tongi - an 18-year-old from Kahuku, HI - played guitar as he performed Alanis' 2012 song Guardian and Ed's 2015 track Photograph.Megan Danielle - a gospel singer and server from Douglasville, GA - selected Morissette's 1995 hit Head Over Feet and Sheeran's 2017 song Dive to perform.Zachariah Smith - a 19-year-old grill cook from Armory, MS - belted Alanis' 1996 hit Ironic and Ed's 2014 hit Thinking Out Loud.",
        "In one virtual segment, Katy and Lionel spoke with the newly-crowned King Charles III and his mistress-turned-'Queen' Camilla at Windsor Castle in England.'I just wanted to check how long you will be using this room for,' the royal 74-year-old laughed.'I just wanted to check.'The 73-year-old R&amp;B legend replied: 'We have to give up the room up right away.'",
        "The 38-year-old pop diva chimed in: 'Are we making too much noise?'King Charles III then thanked Perry and Richie for their 'brilliant' performances of their respective hit songs - Roar from 2013 and All Night Long (All Night) from 1983 - at his coronation.The regal event, organized by the BBC and watched by millions around the globe, featured a 70-piece orchestra, choirs, and several unique dramatic performances.Four-time Oscar nominee Tom Cruise, Emmy nominee Joan Collins, and Grammy winner Tom Jones all appeared via video message.A series of pre-recorded sketches also aired, revealing little-known facts about Charles and included moments from The Muppets and beloved literary character Winnie the Pooh."
    ]
}