{
    "articleURL": "/wires/aap/article-12052085/PM-meets-Commonwealth-leaders-Buckingham-Palace.html",
    "content": [
        "Commonwealth heads of government including Prime Minister Anthony Albanese have lunched at Buckingham Palace ahead of the coronation of King Charles III.",
        "Mr Albanese had earlier on Friday met United Kingdom Prime Minister Rishi Sunak for talks focused on the AUKUS defence pact, trade and combating climate change.Following the 30-minute meeting in Downing Street, Mr Albanese said he was glad the UK-Australian free trade deal had been completed in time for the King's coronation, which the confirmed republican described as a \"historic event of enormous significance\".Mr Albanese announced on Thursday the free trade agreement would come into force on May 31.Prince William and Kate, Princess of Wales, who joined other royals at the palace lunch on Friday, stopped to chat with Mr Albanese and New Zealand Prime Minister Chris Hipkins.The King, who is head of the Commonwealth, then took part in a meeting of the leaders at Marlborough House in London.The monarch mingled with leaders before they gathered in the garden for a group photograph with the Commonwealth mace.Representatives from 203 countries are in London for the coronation of His Majesty King Charles III and his wife Camilla on Saturday, which begins at 8pm Australian time in Westminster Abbey.The King and Queen Consort will be taken from Buckingham Palace to the abbey in the Diamond Jubilee State Coach, built in Sydney by W J Frecklington.It was originally built to commemorate the late Queen's Diamond Jubilee.",
        "The coronation is expected to last about an hour and will take place before around 2000 guests.Mr Albanese is expected to arrive at Westminster Abbey about 9am London time, before being escorted in with other realm leaders.At the request of the King, some 40 Australian Defence Force personnel will march as part of the Commonwealth Military Forces contingent during the ceremony.The ADF, represented by Australia's Federation Guard, will join The Coronation Procession from Westminster Abbey to Buckingham Palace.Some 14 \"outstanding\" Australians will also be present including footballer Sam Kerr, who will be a flagbearer, and singer-songwriter Nick Cave.This weekend a number of significant buildings and monuments around Australia will be illuminated in royal purple to mark the coronation.At 3pm on Sunday, a National 21 Gun Salute will be conducted by Australia's Federation Guard on the forecourt of Parliament House in Canberra.Following the gun salute, the Royal Australian Air Force will conduct a flypast over the nation's capital.In Australia, young monarchists will gather in six states and territories to celebrate, the Australian Monarchist League said.\"Young people are proud to see their King imbue the same qualities of duty and service of our late Queen, and the forward-thinking attitude towards the conservation of our natural environments,\" Jack Barton, 24, said in a statement.",
        "On behalf of the people of Australia, the government will donate $10,000 to the charity Friends of the Western Ground Parrot as a coronation gift."
    ]
}