{
    "articleURL": "/money/markets/article-12041143/Average-Aston-Martin-selling-prices-jump-213k.html",
    "content": [
        "Aston Martin turning a corner in narrowing its losses, update today reveals But the London-listed group's share price has fallen over 30% in the last year Aston Martin Lagonda losses narrowed in the first quarter of 2023, with the luxury car maker maintaining its outlook for the year.",
        "The London-listed group said it enjoyed strong sales of its sport utility DBX motor and benefited from higher selling prices. Aston Martin said the total average selling price rocketed 18 per cent on a year ago to £213,000, while the core average selling price was 19 per cent higher at £180,000. ",
        "The luxury car maker's pre-tax loss for the three months to came in at £74.2million, against £111.6million at the same point a year ago. Revenue increased by 27 per cent to £295.9million and wholesale volumes were 9 per cent higher at 1,269, driven by 59 per cent year-on-year DBX volume growth. The DBX 707 represented more than 70 per cent of total DBX orders during the period.The group said it sold out of all 499 examples of the DBS 770 Ultimate, the most powerful production Aston Martin ever after being unveiled in January, with deliveries scheduled to begin in the third quarter. Aston Martin shares fell today and were down over 4 per cent to 2,493.00p this afternoon, having fallen around 30 per cent in the last 12 months. Executive chairman Lawrence Stroll, said: 'Since the start of the year, we have continued to see strong demand across our product range, with our current range of sports cars essentially sold out for the year.'",
        "He added: 'The DBX707, the first car developed under my leadership, continues to receive broad media acclaim and, with a growing number incredibly satisfied customers, is strengthening the DBX orderbook in our all major markets, as well as our overall financial performance.'Amedeo Felisa, Aston Martin's chief executive, said: 'Over the course of the first three months of the year, we have continued to build on the progress we have made to meet strong customer demand and deliver on our targets.'Aston Martin said in March that it expected profitability to improve this year and to turn free cash flow positive in the second half after it begins deliveries of its next-generation sports cars in the third quarter.Free cash outflow for the quarter stood at £118million, compared with 25 million pounds of outflow a year ago as it spent on the development of new sports cars and its electrification programme.The company said it expects 2023 to be the 'peak year' of capital spend.Aston Martin reiterated its guidance for the current financial year. It still expects to deliver 'significant' growth in profitability compared to the prior year, driven primarily by an upturn in volumes and higher gross margin in both core and special vehicles.'We expect significant year-on-year growth and positive free cash flow in the second half of the year,' it said.",
        "The group's net debt stood at ££868million by the end of the period and the company said it had a cash stash of £408million, down from£583million in December 2022. ",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}