{
    "articleURL": "/wires/aap/article-12045089/Elders-Olympics-Strictly-no-running-allowed.html",
    "content": [
        "Aboriginal elders from around New South Wales gathered at Tomaree Sporting Complex in Nelson Bay to compete in the annual Elders Olympics.",
        "The event is very different to other Olympics as running is strictly prohibited and if you are caught running you are automatically disqualified from your event.Elders attending the gathering represented 28 Aboriginal nations including Biripi, Awabakal, Darkinjung, Dhungutti, Gumbangiir, Gandangara and Gamilaroi.Elders had gathered at the Murrook Cultural Centre for the meet and greet the day before the main event on Thursday.Former chair of the NSW Aboriginal Land Council and lead organiser of the event, Aunty Bev Manton told AAP it was great to see all the elders together after such a long time.\"To see everyone just talk so happily and being cheerful together talking about what has happened in their lives in the last couple of years since they last saw each other was just so beautiful,\" said Ms Manton.This is the first time since 2019 elders were able to compete in the event as it had been postponed previously due to COVID-19.Elders prepare for the event three months before, with training consisting of mainly walking and building up their arm strength.\"The event is about healthy living, wellbeing and encourages elders to keep physically active,\" said Ms Manton.Competitors on the day competed in seven events including bean bag throwing, netball hoops, hockey, walking races and an egg and spoon race.",
        "Hosts for this year's Olympics were the Worimi Wuburay Elders.The Olympics are an important way to recognise our elders and the contribution they make to our communities across Australia.NSW Aboriginal Land Councillor Abie Wright, who attended the Elders Olympics in Tomaree said the event was a great way to promote health, fitness and emotional wellbeing.\"Elders are the bedrock and lifeblood of our community, you have been through the struggles and hardship, you have laid the foundation for our future, and the paths we all can walk today,\" said Mr Wright."
    ]
}