{
    "articleURL": "/wires/reuters/article-12051803/European-shares-rise-energy-firms-HSBC-boost-end-second-straight-week-lower.html",
    "content": [
        "STOXX 600 index closes 0.3% lower for the week",
        "Energy stocks clock worst weekly fall in sevenHSBC quashes Ping An-backed protest vote at annual meetingAdidas jumps on upbeat earnings(Adds fresh analyst comment, details about weekly performance, HSBC shares; updates prices to close)By Shreyashi SanyalMay 5 (Reuters) - European shares ended Friday on solid ground aided by a boost in shares of HSBC and from energy firms that tracked a rebound in oil prices, but wrapped a week packed with high-profile central bank meetings and heavy earnings with a decline.The pan-European STOXX 600 index closed 1.1% higher, with the oil &amp;amp; gas sector index leading gains, rising 2.7% after crude prices firmed.But falling oil prices for much of the week meant the European energy sector clocked its worst weekly performance in seven weeks. The benchmark STOXX index posted its second weekly decline, down 0.3%, still smaller than the S&amp;amp;P 500 index's 1.2% fall.Boosting the main index for the day,HSBCadded 2.7% after it soundly defeated a bid to break-up the bank and spin-out its lucrative Asian business at its annual investor meeting in Birmingham in England, but still faced a rebellion against its board and pay for top bosses.Earlier in the week, theFederal Reserveraised its interest rate by 25 basis points as expected, while the ECB raised benchmark rates by 25 basis points to 3.25%, the smallest increase in its rate-hike cycle that started last summer, but signalled more tightening was to come.",
        "\"I also think the fear over a new banking crisis is more pronounced in the U.S. at the moment, as that is where all the troubled banks are to be found,\" said Stuart Cole, chief macro economist at Equiti Capital.\"That is not to say there are none in Europe, but so far they are managing to stay under the radar. That, of course, may change as interest rates rise in the EU.\"An ECB surveyshowed euro zone inflation could be lower in the coming years than previously expected but may stay above the ECB's 2% target further out.Shares in German chemical companies jumped after the government announced energy subsidies to help the country's industrial sector.BASF, Covestro, Wacker Chemie and Lanxess jumped between 2.2% and 9%.Air France-KLM SA lost 2.6% after reporting a steeper than expected quarterly operating loss.German sportswear giant Adidas AG jumped 8.9% after reporting better-than-expected first-quarter results.For the week, media stocks were the biggest decliners, falling 5.8% in the worst performance in over three years. Defensive food &amp;amp; beverages rose 1.2%, leading gains for the week. (Reporting by Shreyashi Sanyal in Bengaluru; Additional reporting by Shubham Batra; Editing by Savio D'Souza, Varun H K, and Chris Reese)"
    ]
}