{
    "articleURL": "/wires/pa/article-12056361/Labour-not-entertaining-prospect-coalition-Lib-Dems.html",
    "content": [
        "A senior Labour MP has avoided discussing whether the party would go into coalition with the Liberal Democrats if it falls short of a majority at the next general election, saying “We’re not even entertaining that prospect”.",
        "Lib Dem leader Sir Ed Davey has explicitly rejected any coalition with the Tories under Rishi Sunak, but avoided ruling out a coalition deal with Labour, stressing his party’s focus is “getting rid of Conservative MPs”.It follows analysis of England’s local election results, which showed Labour could fall short of a majority in the House of Commons at the next election.Shadow health secretary Wes Streeting, challenged on the Sunday political shows, appeared to repeatedly avoid ruling out a deal with the Liberal Democrats. We’re just not in that ballpark of talking about coalition governments  Shadow health secretary Wes Streeting  Asked on Sky’s Sophy Ridge On Sunday whether Labour would be prepared to go into coalition with the Lib Dems, Mr Streeting said: “We’re not even entertaining that prospect … I just don’t think that is the scenario that we are going to be in after the next general election.”He also told Sky: “I think for the next general election Labour feels confident but not complacent.",
        "“I think those results do point to enormous progress made under Keir Starmer’s leadership. He’s changed the Labour Party, now he’s got a hearing to be able to change the country, but there’s more to do.”Asked on BBC’s Sunday With Laura Kuenssberg programme about the prospect of a coalition with the Liberal Democrats, Mr Streeting said: “We’re just not in that ballpark of talking about coalition governments.”",
        "He also told the programme: “We think we can win a majority – people wouldn’t have said that after the last general election – that’s what we’re working towards, that’s what we’re fighting for, and I think people can go confidently to the polls at the next general election knowing that a Labour government is possible and within our grasp.”He said a Liberal Democrat “recovery” in areas which moved away from that party to the Conservatives in 2015 “isn’t somehow a risk to a Labour majority, it is a path to a Labour majority”.Put to him that the local election results do not show that Labour can be confident of a majority at the next general election, Mr Streeting said: “Thursday night’s local election results were exactly that – local election results, not a prediction of the next general election.”He insisted there is more to come from Labour in key policy areas such as education and health. The focus is on getting rid of Conservative MPs  Liberal Democrat leader Sir Ed Davey  Sir Ed said the Liberal Democrats’ list of target seats at the next general election will now “almost certainly” be longer.Speaking to BBC’s Sunday With Laura Kuenssberg programme, and asked if he would consider a coalition with the Tories under Mr Sunak, he said: “No. I’ve spent all my life fighting the Conservatives.”",
        "He said he “fought them every day” previously in coalition under David Cameron, adding: “When I became leader of the party I made it very clear that my job was to get the Conservatives out of government.”Asked about the prospect of a coalition with Labour, Sir Ed said: “That is a hypothetical question because we don’t know what’s going to happen after the next election.”Put to him that he is ruling out working with the Conservatives but not Labour, he said: “The focus is on getting rid of Conservative MPs. I make no apology for that.”Culture Secretary Lucy Frazer told Sky’s Sophy Ridge On Sunday programme: “Labour did well, I accept that. But if it wants to get a majority at the next election, it needed to do better.”"
    ]
}