{
    "articleURL": "/wires/afp/article-12054167/Sudan-conflict-war-attrition-experts-warn.html",
    "content": [
        "As Sudan's warring generals have repeatedly failed to honour multiple agreed ceasefires, experts warn of protracted fighting, despite both sides preparing to meet in Saudi Arabia for direct talks.",
        "Army chief Abdel Fattah al-Burhan and his rival Mohamed Hamdan Daglo, who commands the paramilitary Rapid Support Forces (RSF), were once allies but have for weeks been locked in deadly fighting to secure power.The contest for Khartoum, the capital that is home to five million people, has descended into gruelling urban warfare with a high toll on civilian life.\"The battle for Khartoum is quickly developing into a war of attrition where both sides have similar capabilities and capacities,\" said Andreas Krieg of King's College London.The city has become a war zone, witnessing intense street battles involving artillery barrages, gunfights, air strikes and anti-aircraft fire.Since fighting began on April 15, hundreds of civilians have been killed and thousands wounded, with hundreds of thousands forced to flee the violence.Both sides have claimed advances on the other's bases and control over key facilities across Sudan. Most claims could not be independently verified.Multiple agreed truces have quickly been broken as both factions blame the other for violating the ceasefires.Following repeated international appeals for calm, the United States and Saudi Arabia announced direct talks between the army and RSF would open Saturday in Jeddah.In the days following the outbreak of hostilities, foreign countries rushed to evacuate their nationals.",
        "New York-based Soufan Center warned that with most foreigners gone or looking to leave, the two rivals may be \"preparing for a no-holds-barred fight for control of the country\".- No 'knockout blow' -The warring parties both seek to project an image of might and superior firepower, although verifying exact troop numbers on either side is not possible.Sudan's army has about 100,000 soldiers, making it among the largest in sub-Saharan Africa, according to the International Institute for Strategic Studies.The Britain-based research body estimates the RSF has 40,000 fighters, while other observers say the paramilitaries number 100,000.However, clearly both factions have been able to acquire arms despite Sudan being subject to decades of punishing US-imposed sanctions, established during former autocrat Omar al-Bashir's rule.Experts agree Burhan's military enjoys the advantage of air supremacy.But in Khartoum, the benefits are restricted as they \"can't just carpet bomb the city because there are civilians... and both sides have their own ground forces there,\" said Krieg.Aly Verjee, Sudan researcher at the University of Gothenburg in Sweden, said the army's air power has yet to provide \"the knockout blow\" it had \"hoped for\".\"Effective targeting requires good intelligence from the ground,\" he said.Witnesses in Khartoum have observed RSF fighters often taking up positions in residential streets, with soldiers hiding camouflaged trucks under trees.",
        "According to Krieg, the group's \"more direct chains of command\" compared with the army, along with well-practised guerrilla tactics, make them \"more agile\" and pose a challenge to the military.\"In an urban environment RSF has a competitive advantage just by the way they are set up,\" he said.Agility may be key to victory in greater Khartoum, which is spread over 1,000 square kilometres (390 square miles).\"There is not one battle for Khartoum, but several,\" said Verjee.\"There are different theatres of conflict within Khartoum: if one side seizes ground in Omdurman it does not necessarily help it advance in Bahri (Khartoum North), for instance.\"As a result, \"it is to be expected that this will drag out\", Krieg said.- Gold rush -Witnesses say that once the RSF controls an area of Khartoum, it establishes checkpoints and shelters in residential buildings, while army positions have so far been comparatively less visible.RSF propaganda videos have shown its levels of training and discipline \"varies considerably\", Verjee said.\"Classical military training ensures everyone does everything the same way,\" he said, but \"being a bit inconsistent doesn't mean the RSF don't have effective fighters.\"The factions also have respective external backers.According to Krieg, Egypt has long-standing ties with Sudan's army, while the Saudis maintain a \"balanced approach\" to both.",
        "The United Arab Emirates, a key Saudi and US ally, has \"pivoted in favour of\" Daglo, he added.Russian mercenary group Wagner, which the US says has access to Sudan's gold mines, \"has been very instrumental\" over the years for both the army and the RSF, said Krieg.But, having grown wealthy from lucrative RSF-controlled Sudanese gold mines, Daglo has built a support network through Wagner and the UAE.\"If Wagner had to make a choice\", Krieg said, it would be Daglo, whose gold activities have been \"instrumental\" for the Russian mercenaries.Wagner's reliance on the UAE to sell its gold \"to the open market\", ensuring it does not rely on Russian state funding, according to Krieg, gives Daglo \"a competitive advantage\"."
    ]
}