{
    "articleURL": "/femail/article-12038845/What-3rd-bring-star-sign-OSCAR-CAINER.html",
    "content": [
        "In the build-up towards the Coronation Eclipse, the media has often focused less on the royal event and more on the family relationships. Full Moons bring events to a head.  ",
        "And, with this Eclipse in Scorpio (which represents inheritance, shared wealth, and control) taking place opposite rebellious Uranus, the skies are aptly reflecting the situation. Yet honest communications can heal old wounds. With compassion, difficulties can be overcome.Aries Mar 21 - Apr 20 You’ve reached a tough decision. You know you’re right — but you wish you weren’t. And you’ve got a feeling that it’s somehow wrong to be right. At the very least, it’s awkward and inconvenient. The problem is that because you’ve established what you’ve established, things cannot continue in the same way. So, even though you’re clear about what you need to do, you’re downhearted when you should be feeling jubilant. Soon, though, you’ll be glad that you were so brave, clear and correct. You just need some time to adjust. Make sure you take full advantage of May’s powerful celestial events. Call 0906 751 5601.",
        "Taurus Apr 21 - May 21 They say that the longer couples are together, the more they come to look like one another. But there’s more to it than that. Over time, our views mould to theirs, our habits adapt to accommodate their routines; even our speech patterns align. Sometimes this can make us question our identity. Are we just being the person they want us to be? Although adapting to other people helps the world go round, we can’t lose sight of ourselves. If you choose to show your independence today, a bond with someone special will strengthen. ",
        "May is going to be amazing. For insight that could change your life, call 0906 751 5602.GeminiMay 22 - June 22 The problem with words is that they can easily be misinterpreted. So if I tell you that your outlook is about to improve, we’ll both automatically assume that you know what I mean. But in reality, it could be something minor (like a slight headache disappearing) or something major (like a huge work issue resolving). As we edge ever closer to the Coronation Eclipse, you’re moving towards a definite and distinct improvement. As for what form it will take, well, very soon you’ll know the answer to that. To hear uplifting news about the possibilities this month brings, call 0906 751 5603.Cancer June 23 - July 23We all have mental blocks about something. What’s yours? What do you always struggle to comprehend? Perhaps, as a child, you were told that you couldn’t do something? Or that you didn’t take it seriously enough? Or that you weren’t clever enough? Or that you lacked aptitude? Whatever was said, let’s be clear: the person who said it was mistaken. The reality is that you weren’t given the encouragement you needed. If you’re prepared to give something another try, the coming Eclipse indicates you can make a breakthrough. There’s so much to tell you about the month ahead and you’re going to love it. For great news, call 0906 751 5604.",
        "Leo July 24 - Aug 23If you’ve been suffering from a lack of energy recently, you’re about to get your mojo back. If you’re unaware of any problems in this area, then you’re about to become even more excited about a project. The Coronation Eclipse is about to give you a much-needed boost. And because it’s ‘much-needed’, it’s likely you’ll end up feeling as if it’s happening in the nick of time. With hindsight, you’ll be able to see how much you accomplished when you felt you were struggling; and able to appreciate the outcome your efforts achieved. May brings the potential to make your dreams come true. For insight, call 0906 751 5605.",
        "Virgo Aug 24 - Sep 23 Emotions aren’t rational or logical — that’s why they’re hard to explain. Which is the reason we try to justify them. We’d rather come across as being sensible and logical than unreasonable and irrational. Yet there are times when, no matter how hard we try to hide our feelings, we can’t help but wear our hearts on our sleeve. The coming Eclipse makes it difficult for you to conceal your reactions to someone. If you trust that your response is reasonably reasonable, then the experience will be liberating. A mutually beneficial connection is possible. Your May prediction has brilliant news. For inspiration, call 0906 751 5606.",
        "Libra Sep 24 - Oct 23 If I were to ask you to write down all the things that are wrong with the world, I’m pretty confident you could create a long list. It’s an easy task. Instead, though, let’s focus on what’s right with the world. This list will, of course, be much shorter. It takes far less to make us feel good than it does to make us feel bad. One moment of joy, happiness or reassurance is enough to demolish hours of stress, strife and strain. The Coronation Eclipse brings a timely reminder of just how transforming such positive moments can be. Welcome to an exciting month. May’s cosmic events could transform your life. Call 0906 751 5607.Scorpio Oct 24 - Nov 22 In an ideal world, we’re supposed to spend a third of our lives asleep. If we struggle with insomnia, it will be less. And some people like to get more hours of rest. What we all know is that lack of sleep makes life more challenging. Sleep is essential. So is happiness. Are you getting enough of that in your world? The coming Coronation Eclipse, in your sign, shines its light on possible ways to increase your levels of joy. Despite all the worries and concerns you’re dealing with, more happiness is available. You absolutely deserve it. May is chock-a-block with celestial action, with great potential for positive change. Call 0906 751 5608.",
        "Sagittarius Nov 23 - Dec 21 If the point of an astrologer is to look into your future, does that save you a job? Why do you need to bother trying to look ahead if I can do it for you? Yet our expectations influence our experience of our daily reality (and our receptiveness to the planets’ influences). So, if your future looks cold and bleak to you, leave the job to me. If your sense of what lies ahead is full of optimism, you’re on the right track. The Coronation Eclipse brings insight and energy into your world. Your job is to believe that you deserve to be blessed. For uplifting news on exciting opportunities, call 0906 751 5609.Capricorn Dec 22 - Jan 20 There’s so much happening here on planet Earth that it’s impossible to keep up with it all. Seeds are sprouting, waves are pounding, winds are blowing and fires are burning. As for the creatures who live in the midst of this ever-active nature, well, they’ve got lots of living to do. But are we living our lives to the full? Are we being the best that we can be? Are we experiencing joy and fulfilment? The coming Coronation Eclipse shows you a skilful way to move beyond a challenging situation. Here come reasons to feel good. Welcome to May and an action-packed month ahead. For inspiration, call 0906 751 5610.",
        "Aquarius Jan 21 - Feb 19 You sometimes find yourself wondering what normal people are doing with their lives. The reason you ponder this is because you know there’s little that’s completely ‘normal’ about you. You’re ruled by innovative Uranus. Of all the signs in the zodiac, yours is the hardest to classify. Quirkiness is part of your nature. Whereas other folk feel perplexed by eccentricity, you’re drawn towards it. As we move towards the Eclipse, an arrangement that wouldn’t work well for most people suits you (and your nearest and dearest) perfectly. May’s cosmic events could transform your life. Call 0906 751 5611.Pisces Feb 20 - Mar 20 Relax and smile. Although you’re dealing with an irritating situation, it’s not hopeless. Indeed, there’s certainly plenty to feel encouraged by. It’s just that every time you think about a certain person, or you consider the circumstances that you’re in, you get wound up. Yet these kinds of challenges are just part and parcel of life. It’s when we let them get to us that we lose sight of the opportunity to instigate the changes that will lead to an improvement in the scenario that’s driving us crazy. Be open to new ideas today. There’s an easy way for you to move forward. For a treasure trove of inspiration about May, call 0906 751 5612.Calls cost 80p per minute plus your phone company’s access charge. To report a phone line problem, call 0800 138 9789. Go to cainer.com and join the 5 Star Service for personalised messages, audio, video, discounts on full readings, and more! "
    ]
}