{
    "articleURL": "/wires/ap/article-12052739/Maryland-judges-question-jurisdiction-digital-ad-tax-case.html",
    "content": [
        "ANNAPOLIS, Md. (AP) - Attorneys debated the proper jurisdiction for settling a legal challenge to the first-in-the-nation tax on digital advertising during arguments before Maryland's highest court on Friday.",
        "Meanwhile, an attorney for the state appeared to surprise judges when she said Maryland has already collected some taxes from companies that voluntarily submitted revenues to the state under the tax aimed at Big Tech.Last year a lower Maryland court ruled that the tax on digital advertising violates the federal Internet Tax Freedom Act, which prohibits discrimination against electronic commerce. The court also held that the law violates the U.S. Constitution's prohibition on state interference with interstate commerce.The state comptroller is appealing the decision in a case brought by Verizon Media Inc. and Comcast.Julia Bernhardt, an assistant attorney general who is defending the law, said the plaintiffs sought to bypass administrative procedures that the state has in place.\"This court has repeatedly held that constitutional claims are to be presented to the tax court. In case, after case, after case, almost every case involving a constitutional challenge to a state tax has come up through that way since the establishment of the tax court,\" Bernhardt said.",
        "But Jeffrey Friedman, an attorney for the plaintiffs, argued that the tax is \"very unconstitutional,\" because it targets electronic commerce in violation of the Internet Tax Freedom Act, as well as out-of-state companies in violation of the Dormant Commerce Clause. He also said it targets speech and speakers in violation of the First Amendment.",
        "\"It looks like a law school exam question gone awry,\" Friedman said of the law on digital ad taxes.As usual in arguments before the court, the judges had questions for both sides. The jurisdiction of the case was a major focus of their inquiries.\"Mr. Friedman, you make a lot of interesting constitutional arguments. Some of us might agree with you, I don´t know, but why should we consider it here,\" Justice Brynja Booth asked, noting the law of exhausting tax court remedies.Friedman said there was a constitutional exception that applied to this case.\"It does not apply to a run-of-the-mill tax case,\" Friedman said. \"It doesn´t apply to even a taxpayer that alleges his or her constitutional rights were violated on an as-applied basis. It only applies, as this court has repeatedly described it, in a situation where the entirety of the law is invalid. In this case, it´s invalid because it violates federal law.\"In questioning Bernhardt, Justice Steven Gould asked her a theoretical question. If the legislature passed a law that enacted a tax on real estate transfers only on Black Americans, he asked, would she still argue that they'd have to go through the administrative process?Bernhardt said that would be a different matter that raises discrimination and civil rights statutes.",
        "\"We don´t have anything like that here,\" Bernhardt said. \"What we have here is a routine situation where businesses don´t want to pay a particular tax, and they prefer to go into court and get a ruling ahead of time so that they don´t have to comply with the tax law.\"Maryland lawmakers overrode then-Gov. Larry Hogan´s veto of the digital ad tax measure to pass the legislation in 2021. The state estimated the tax could raise about $250 million a year to help pay for a sweeping K-12 education measure.The law taxes revenue that the affected companies make on digital advertisements shown in Maryland.Attorneys for Big Tech companies like Facebook, Google and Amazon have contended that the law unfairly targets them. It would impose a tax based on global annual gross revenues for companies that make more than $100 million globally.The legal case is being closely watched by other states that have also weighed a similar tax for online ads.Bernhardt said the Anne Arundel County Circuit Court ruling against the law has greatly chilled but not entirely prevented some tax payments to the office of Comptroller Brooke Lierman, who is the state's tax collector.\"In other words, some people are voluntarily paying - some taxpayers - and the comptroller accepts voluntary payments,\" Bernhardt said.",
        "When asked by the court whether the comptroller would still accept voluntary payments, if an injunction were issued, Bernhard said the comptroller would not.\"The comptroller would follow a court order, an injunction,\" Bernhardt said.The state has received voluntary payments for digital advertising revenues of nearly $107 million, the comptroller's office said, and it has issued $14.5 million in refunds when taxpayers have asked for their money back."
    ]
}