{
    "articleURL": "/wires/reuters/article-12058569/Asia-shares-edge-higher-wary-US-bank-data.html",
    "content": [
        "Asian stock markets : https://tmsnrt.rs/2zpUAr4",
        "Nikkei dips, U.S stock futures hold steadyFocus on U.S. inflation, banking surveyBank of England seen hiking again this weekBy Wayne ColeSYDNEY, May 8 (Reuters) - Asian shares were mostly higher on Monday as investors braced for a week where U.S. inflation data will test wagers the next move in interest rates will be down, while worries about a possible credit crunch weighed on the dollar.Friday's robust U.S. payrolls report has already delivered a setback to easing hopes and any upside surprise on consumer prices would challenge bets for a rate cut as soon as September.Forecasts are for a rise of 0.4% in April for both the headline and core CPI, with the annual pace of core inflation slowing just a tick to 5.5%.Later Monday, the Federal Reserve's survey of loan officers will draw an unusual amount of attention as markets seek to gauge the impact of regional banking stress on lending.\"The survey should point to further broad-based tightening in bank lending standards,\" said Bruce Kasman, head of economic research at JPMorgan.\"Continued stress in the banking system does, of course, increase concern that a disruptive financial market event is on the horizon,\" he added. \"Though our analysis suggests that the impact of a credit tightening against an otherwise healthy backdrop tends to be limited.\"",
        "Caution made for a slow start in markets and MSCI's broadest index of Asia-Pacific shares outside Japan edged up 0.7%, while Japan's Nikkei eased 0.6%.Chinese blue chips gained 1.1% ahead of data on trade and inflation due later in the week.EUROSTOXX 50 futures added 0.1%, while FTSE futures were closed for a holiday.S&amp;amp;P 500 futures and Nasdaq futures were both little changed, after jumping on Friday in the wake of Apple's upbeat results.While the S&amp;amp;P 500 is up almost 8% for the year so far, all of that is due to just five mega stocks which have collectively risen by 29% so far this year and trade at a 49% premium to the rest of the index.HITTING THE CEILINGBond markets were still stinging from the strong payrolls report with U.S. two-year yields up at 3.93% after briefly getting as low at 3.657% last week.Not helping has been the risk of a U.S. government default with U.S. Treasury Secretary Janet Yellen on Sunday warning of a possible crisis should Congress not raise the debt ceiling.Futures imply a near 90% chance the Fed will keep rates steady at its next meeting in June, and a 75% probability of a cut in September.The market is still pricing in at least one more hike from the European Central Bank, while the Bank of England is widely expected to lift its rates by a quarter point on Thursday. .",
        "The diverging outlook on rates has underpinned the euro and pound, with the latter hitting a one-year high on the U.S. dollar last week. The euro was holding at $1.1040 on Monday, just short of its recent top of $1.1096.\"While it is premature to get too 'beared up' on the dollar until a clearer peak in U.S. rates is seen, the U.S. banking sector travails that have no easy/costless solutions, continue to make for a mildly bearish medium-term story,\" said Alan Ruskin, head of global FX strategy at Deutsche Bank.\"Certainly it imposes more growth constraints and a greater stagflationary bias than for major competing economies.\"The dollar has fared better on the yen as the Bank of Japan remains the only central bank in the developed world to not have tightened policy. The dollar stood at 134.80 yen, with the euro at 148.75 and not far from its recent 15-year peak of 151.55.The prospect of a pause in U.S. rate hikes has been a boon for non-yielding gold which was holding at $2,021 an ounce after nearing a record high last week.Oil prices have been going the other way as fears of a global economic slowdown eclipsed planned output cuts to see U.S. crude shed more than 7% last week.",
        "Brent was last up 40 cents at $75.70 a barrel, while U.S. crude added 42 cents to $71.76 per barrel.(Reporting by Wayne Cole Editing by Shri Navaratnam)"
    ]
}