{
    "articleURL": "/wires/reuters/article-12054191/Australia-govt-change-petroleum-tax-LNG-projects-pay-more.html",
    "content": [
        "SYDNEY, May 6 (Reuters) - Australia will change its Petroleum Resource Rent Tax (PRRT) to increase the tax paid by the offshore LNG industry, moves that should increase revenue by A$2.4 billion ($1.6 billion) over the next four fiscal years, Treasurer Jim Chalmers said on Saturday.",
        "The government will adopt eight of 11 recommendations from a Treasury review of gas transfer pricing rules, including a key proposal to limit the proportion of PRRT assessable income on LNG projects that can be offset by deductions to 90% from July 1.\"Under the current rules, most LNG projects are not expected to pay any significant amounts of PRRT until the 2030s. The changes announced today address this issue,\" Chalmers said in a statement.Other changes to be introduced over the next two fiscal years include equalising the treatment of notional upstream and downstream entities so that losses will be split evenly rather that attributed entirely to the upstream entity.The Treasury review of gas pricing was started under the previous conservative government. Chalmers said the Labor government would concurrently proceed with eight recommendations from a separate earlier review that were accepted by the previous government but not enacted.Chalmers said both reviews had found that aspects of the PRRT were better suited to oil projects than LNG projects, and the deductions cap and other changes would help address that.\"These changes will mean the offshore LNG industry pays more tax, sooner, (and) will provide industry and investors policy certainty to allow the sufficient supply of domestic gas, and will ensure Australia remains a reliable international energy supplier and investment partner,\" Chalmers said.",
        "Last month, the chief executive of Woodside Energy Group had urged the government not to change the tax, saying \"overreaching\" on tax reform could undercut future revenue and choke off the investment needed to increase supply.Chalmers will release the government's budget for 2023/24 on Tuesday evening. There is expected to be a substantial improvement in the budget position due to higher than expected commodity prices boosting revenues.Australia, vying with Qatar and the United States as the world's top LNG supplier, has 10 LNG plants run by companies including Woodside, Chevron Corp, Santos Ltd, Japan's Inpex Corp, ConocoPhillips and Shell . (Reporting by John Mair; Editing by Kim Coghill)"
    ]
}