{
    "articleURL": "/tvshowbiz/article-12040257/Savannah-Chrisley-reveals-mom-Julie-Chrisley-scared-prison-trying-stay-busy.html",
    "content": [
        "Savannah Chrisley shared a glimpse into her mom Julie Chrisley's mindset as she serves out her seven-year sentence in federal prison.",
        "The 25-year-old reality star - who was recently booted off a Southwest flight for being 'unruly' - spoke on the latest episode of her podcast Unlocked sharing that Julie, 50, is 'scared' and is 'trying to stay busy.'Julie was sentenced along with her husband - and Savannah's father - Todd, 54, who received a 12-year-sentence, following a conviction for multiple charges last year, including bank fraud and tax evasion.'She sent me home 30 to 40 days' worth of letters … it was like her daily diary basically,' the Chrisley Knows Best star said.'It was a lot to read, it was tough to see the accounts of her day and just things that she's scared of or nervous about or just all the thoughts that go through her mind,' Savannah revealed.",
        "She also shared that not having Todd around was a struggle for Julie. 'Not having my dad there with her is the biggest thing,' she said.Savannah - who has visited her parents a number of times - went on to describe how her mom is passing the time while in prison by taking a number of classes.'She’s just staying busy. You know, like, she’s trying to do anything and everything, take classes, [be] first at-bat — everything known to man that she can do, she does.'",
        "Savannah also added that she thinks her mom was trying to 'shield' her kids 'from a lot of things' regarding their legal issues so as to protect them. Following her parent's incarceration Chrisley was granted custody of her 16-year-old brother, Grayson, and 10-year-old niece, Chloe.Todd and Julie are also the parents of son Chase, 26. Todd also shares daughter Lindsie, 33, and son Kyle, 31, with his ex-wife Teresa Terry.Todd and Julie are incarcerated at federal prisons 650 miles apart, with Todd serving his sentence at the Federal Prison Camp in Pensacola, Florida, while Julie turned herself into the Federal Medical Center in Lexington, Kentucky. ",
        "Savannah also recently shared how difficult she has found dating to be ever since her parents went to prison.'It's hard, it is extremely...,' she said while discussing her dating life.'I'm helping to raise my 10-year-old sister and 16-year-old brother, and I'm trying to date. And I'm like, \"What do you do with them?\"' she admitted. 'The 16-year-old, he drives [and] all that, but the 10-year-old I'm like, \"You gotta maybe come have dinner with me.\"'Chloe is the daughter of Todd's estranged son Kyle and Angela Johnson, but Todd and Julie adopted her in 2016.Savannah is best known for starring on USA Network's now cancelled Chrisley Knows Best with her family, and spin-off, Growing Up Chrisley. "
    ]
}