{
    "articleURL": "/sport/football/article-12044671/Brisbane-Roar-captain-Tom-Aldred-thinks-League-club-52-000-seat-Suncorp-Stadium.html",
    "content": [
        " Tom Aldred wins top award Bigger ground hoped to boost attendance Golden Boot winner Shae Connors is set to returnAfter winning the top prize at the club's presentation night Brisbane captain Tom Aldred said he was anticipating a successful new era for the Roar under new A-League Men coach Ross Aloisi.",
        "Aldred won the Roar's Gary Wilkins Medal for ALM player of the year after an outstanding season in defence.The Roar's A-League Women top award went to star forward Shea Connors, who also took out the golden boot.The imminent arrival of former Roar ALM assistant coach Aloisi and the return on a regular basis to Suncorp Stadium for home games has Aldred pumped for next season.'Ross comes with a huge pedigree, having worked in Japan and with Brisbane and Adelaide. He also comes with huge experience and I am sure he is looking to get his teeth into the job here,' said Aldred.",
        "'It was important the club got that coaching situation sorted soon. Now the manager can plan for the next season with recruitment of players and staff.'I am sure he's excited to get through the door and get working and I am excited for a new era under him.'It is massive for the football club and the fans that we get back to our home stadium at Suncorp in Brisbane.'We have had some good results at Kayo Stadium in Redcliffe but at Suncorp the other night against Sydney we had 12,500 fans and there is potential to fill that stadium out.'",
        "Aldred said interim manager Nick Green did a good job in winning four games out of nine after taking over from Warren Moon mid-season, to finish eighth on the ladder.",
        "'We had two managers this season and sometimes that can be neither here nor there,' Aldred said.'It was a decent season but we lacked scoring goals in big moments and that is probably why we missed out on finals.",
        "'Personally, I felt really strong this year. I missed two games with an injured throat, which was a freak accident, but I felt I was at my best.'American Connors said she was hoping to be back next season for the Roar's ALW side after finding consistent form on the wing and then as a striker at the back end of the season.'We had so many talented players this season so it means a lot to win this award,' she said.'This year I feel as though I played more to my potential with my goal scoring form, and in being able to set up my teammates.'"
    ]
}