{
    "articleURL": "/femail/article-12059499/Im-chef-make-Michelin-meal-10.html",
    "content": [
        "Content creator Danny Kim challenges LA chef Kevin Lee to the budget mealThe 'ex Michelin cook' used a lemon, chives, a cucumber, perilla leaves, and troutThe viral video has garnered more than 3.8 million views and 451,000 likes A chef has gone viral after revealing how to make a 'Michelin-level' fish dish for under $10 on TikTok.",
        "Danny Kim, a 27-year-old content creator from Maryland, US, challenged LA chef Kevin Lee, who describes himself as an 'ex Michelin cook,' to create a gourmet meal out of a $10 bill.At a Korean market, Kevin purchased ingredients including a lemon ($0.49), chives ($0.69), a large cucumber ($2.49), perilla leaves ($0.79) and rainbow trout ($4.99) – coming to a total of $9.45.Incredibly, he manages to transform the basic ingredients, plus a few kitchen staples into a delicious trout tartare – sharing the process in a TikTok, posted on Danny's account, which has so far garnered 3.8 million views and 451,000 likes.",
        "Kevin starts by filleting the fish and using salt, sugar and lemon to brine it in.He then uses the leaves and blends them with sesame oil before moving on to a sauce.The chef chops up the cucumber and lemon to make a vinaigrette.In a frying pan, he adds black pepper, fennel seeds, coriander seeds, cucumber juice, sugar and white wine vinegar, adding a sprig of thyme and combining the mixture with the vinaigrette.Separately, he creates a mixture of egg yolks, soy sauce and liquid koji.Kevin then chops the chives and moves on to the 'star of the show' – the fish.He chops it up and adds some cucumbers, chives, olive oil and lemon juice.  ",
        "The chef assembles the tartar in a bowl and tops it with the cucumber vinaigrette, the egg yolk mixture, and a cheeky bonus ingredient of smoked trout roe.He also coats some crispy nori paper with sesame oil and chops it up for a garnish.",
        "Kevin says: 'There you have it, I turned $10 into a trout tartar with cucumber vinaigrette and some other accoutrements on there.'The chef and Danny sample the dish, and seem thrilled with the results.TikTok users were equally impressed.One person said: 'Woww (sic) the best dish for 10 bucks.''A 5 dollar TROUT???' another user said.Someone else commented: 'Dude try giving a try at MasterChef you will win for sure.'",
        "But not everyone was so taken by the dish.One user joked: 'I'd rather have Big Mac.''Nah I will just eat two full fish,' another critic commented.Someone else insisted: 'The egg roe is cheating.'This TikTok video follows a father-of-two who also became viral sensation for creating seven lunchbox sandwiches and snacks with just $10. Shawn Willis-Croft, who is based in New Zealand, has his children Levi, eight, and Elijah, six, on two school nights each week and likes to make them nutritious lunchboxes on a budget.In his most popular video on TikTok, which saw him gain more than 12,000 followers in two weeks, Shawn purchases $9.87 worth of groceries to feed his two sons and himself for two days' worth of lunches."
    ]
}