{
    "articleURL": "/wires/reuters/article-12057951/Joey-Meneses-plays-hero-Nationals-rally-stun-D-backs-9-8.html",
    "content": [
        "Joey Meneses hit a three-run home run in the top of the ninth to rally the Washington Nationals to a 9-8 victory over the Arizona Diamondbacks on Sunday afternoon in Phoenix.",
        "Luis Garcia doubled and had three hits, Stone Garrett had two hits and two runs and CJ Abrams also had two hits for Washington, which ended a two-game losing streak. Erasmo Ramirez (2-1) picked up the win in relief and Hunter Harvey pitched around a one-out walk to secure a scoreless ninth and pick up his first career save.The Nationals trailed 8-6 entering the ninth but needed just four pitches by reliever Miguel Castro (1-1) to take the lead. Garcia hit the first pitch for a double and then went to third on a single by Keibert Ruiz. Meneses, who finished 3-for-5 with four RBIs, followed with his second homer of the season, a 381-foot line drive into the left field bleachers.Lourdes Gurriel Jr. homered twice, scored four runs and had four RBIs and Christian Walker also homered for Arizona, which had a three-game win streak snapped. Ketel Marte went 2-for-4 with an RBI triple and Dominic Fletcher also had two hits for the Diamondbacks, who lost despite garnering 11 walks from Washington pitchers.Washington took a 1-0 lead in the second on an RBI single by Alex Call that drove in Meneses. Arizona tied it in the bottom half of the inning when Gurriel led off with a 414-foot homer down the left field line, the third straight game he has homered.",
        "The Diamondbacks took a 3-1 lead in the fourth on Walker's eighth home run of the season and a balk by Nationals starter Trevor Williams that allowed Gurriel to score from third.The Nationals tied it 3-3 in the fifth on an RBI groundout by Lane Thomas and an RBI single by Garcia. But Arizona answered with four runs in the bottom half of the inning to take a 7-3 lead on an RBI triple by Marte and a three-run homer by Gurriel.Washington cut it to 7-5 in the seventh on a bases-loaded fielder's choice by Ruiz followed by an RBI single Meneses.Arizona increased its lead in the bottom of the inning on a bases-loaded fielder's choice by Jose Herrera. The Nationals trimmed it to 8-6 in the eighth when Garrett scored on a double play, setting the stage for Meneses' game-winner in the ninth.--Field Level Media"
    ]
}