{
    "articleURL": "/wires/reuters/article-12052647/LIVESTOCK-Weak-US-pork-demand-knocks-CME-lean-hogs-contract-lows.html",
    "content": [
        "By Tom Polansek",
        "CHICAGO, May 5 (Reuters) - Chicago Mercantile Exchange lean hog futures sank to contract lows on Friday on concerns over anemic U.S. demand for pork, analysts said.The dramatic price decline fueled projections among traders that hog farmers may reduce their herds, after losing money for months on each pig they raise.Farmers are grappling with high production expenses due to inflation and elevated feed costs, along with lackluster domestic demand.\"It looks to me like the carnage in the hog market has become so bad that the board is now pricing in a significant liquidation wave,\" said Dan Norcini, an independent livestock trader.\"Retail prices for pork are still too high to attract sustained consumer demand at a time when many families are struggling to make ends meet.\"Most actively traded June lean hog futures settled down 3.375 cents at 83.775 cents per pound after reaching a contract low of 83.250 cents per pound. The contract is down 23% this year.Export demand for U.S. pork has increased, with shipments reaching their ninth largest volume on record in March, the U.S. Meat Export Federation said. The trade group described U.S. pork as \"very competitively priced\" compared to rival supplier Europe.Still, \"foreign demand is not enough to eat through the supply of pork due to the lag in domestic demand,\" Norcini said.",
        "In China, the world's biggest pork producer and consumer, the state planner said it will consider buying more pork for state reserves in an effort to support domestic hog prices.The announcement fueled some concerns in the U.S. market that Beijing's reserve buying could restrict Chinese imports of American pork, said Rich Nelson, chief strategist for commodity broker Allendale.In CME cattle futures, August feeders fell 1.725 cents to close at 221.425 cents per pound and hit their lowest price since April 10. June live cattle finished 0.350 cent higher at 161.925 cents per pound.(Reporting by Tom Polansek. Additional reporting by Julie Ingwersen in Chicago; Editing by Maju Samuel)"
    ]
}