{
    "articleURL": "/news/article-12052241/Fox-News-Geraldo-Rivera-says-hes-CANCELED-Five-week.html",
    "content": [
        "It comes just days after Rivera sparred on Twitter with co-host Greg Gutfeld He did not give an explanation why he thought he had been axed from the lineupThe journalist shares the 'liberal' seat with Jessica Tarlov and Harold Ford JrVeteran television personality Geraldo Rivera has claimed that his appearances on Fox News' The Five have been canceled this week.",
        "The liberal leaning co-host has not appeared on the network since April 21, which was also Tucker Carlson's last day before his shock firing. Rivera did not give an explanation why he had allegedly been axed from the lineup, although he says he'll be back soon. He wrote on Twitter: 'My appearances today and tomorrow on The Five have been canceled. I’m sure there’s a good reason. Never fear, I’ll be back week after next. Stay safe and happy. Thanks' with a praying emoji. Rivera shares the 'liberal' seat on the top-rate debate show with with commentator Jessica Tarlov and former Democratic congressman Harold Ford Jr.",
        "The three rotating hosts replaced longtime liberal voice Juan Williams last year. For six years, the journalist was the sole left-leaning member of the panel, and remains a political analyst for the network.Rivera's Tweet comes after he was at the receiving end of his co-host Greg Gutfeld's online mockery.On April 26, days after the announcement of Carlson being abruptly let go from Fox News, Rivera tweeted: 'I don’t wish ill on anybody, but there is no doubt - as I said at the time - Tucker Carlson’s perverse January 6 conspiracy theory was \"b******t.\"''Having lost the election President Trump incited an insurrection that sought to undermine our Constitutional process.'",
        "Rivera had many times criticized the former Fox host's downplaying of the violent Capitol riots as 'nothing more than a political protest that got out of hand' as 'inflammatory and outrageous and uncorroborated.'Gutfeld responded to his social media post, writing: 'You’re a class act Geraldo. A real man of the people.'One Fox News insider speculated to The Daily Beast that Gutfeld may have played a role in Rivera’s alleged removal.Other sources within the network claimed however that Rivera was never on the show’s calendar to begin with and that it was always supposed to just be Tarlov and Ford in the 'liberal' seat this week. Rivera did not respond to Gutfeld's remark until more than a week later on May 4, where he wrote: 'Thank you @GregGutfeld for your kind remarks.'",
        "Rivera last appeared on the network on April 21, where he discussed Robert F Kennedy Jr joining the race for the White House in 2024.He has often sparred with Gutfeld on the panel show.In April a contentious exchange between the pair about electric vehicles turned into a shouting match, with Rivera telling his colleague to 'stop pointing at me.'Rivera, who has argued in favor of abortion access, also called Gutfeld an 'insulting punk' in an argument about abortion rights and repeatedly hit out at Israel amid violence in the Middle East in 2021.",
        "The Emmy-award winning journalist, who hosted the daytime talk show Geraldo for over a decade and appeared on Celebrity Apprentice, was, however, a long-time supporter of Donald Trump's presidency - before denouncing him following the Capitol riots.In December 2020 he said that he had supported Trump for four years while the president was ‘assailed by leftist creeps who conjured the Russian Hoax to wreck his presidency’.‘Sadly he lost a bitterly contested election. S*** happens’ he wrote on Twitter. ‘However since he has behaved like an entitled frat boy.’ Gutfeld also came to Carlson's defense on Tuesday as behind-the-scenes clips of Carlson's making lewd comments and criticizing Fox Nation were leaked by the press. Weighing in on a Twitter thread devoted to Carlson's off-air comments, Gutfeld slammed critics coming for Carlson in the wake of his abrupt exit from Fox News.'Apparently everyone understands nonsense banter between segments except for hall monitor failures bitterly chronicling the lives of the far more successful,' he wrote.In clips that have been making the rounds after being leaked to Media Matters, Carlson is seen criticizing the Fox Nation online platform, for which he produced a significant amount content.'Nobody watches Fox Nation because the site sucks,' said Carlson, adding that the site's failures were a 'betrayal of our efforts.'",
        "The video appears to have been shot on the set of Tucker Carlson Today, one of Fox Nation's exclusive shows."
    ]
}