{
    "articleURL": "/tvshowbiz/article-12046107/How-rude-Kate-Garraway-hits-Richard-Arnold.html",
    "content": [
        "Kate Garraway scolded Richard Arnold during Thursday's Good Morning Britain after he made a cheeky joke about pal Carol Vorderman's appearance.  ",
        "Richard, who is the show's entertainment editor, was talking about I'm A Celebrity South Africa with Kate and Ben Shephard. During Wednesday's show, the campmates took part in a challenge to win treats and Helen Flanagan decided to downplay how nice her team's winning picnic was. Richard then spoke about a clip of Carol commenting on the action as she watched it live on television, in which the Countdown host called Helen an 'evil genius.'He said of Carol in the video: 'Carol clearly did her own makeup' while Kate replied: 'How rude!' ",
        "But Richard revealed he was making a jokey comment about Carol and that the close friends had recently gone for dinner together. He also gushed about her laugh and said she should be in the Loose Women audience in the front row because of her funny giggle. Helen's team enjoyed a lavish picnic after Myleene Klass and Jordan Banjo won Wednesday's challenge, complete with sandwiches, a huge fruit platter and lemonade.But she told her campmates to tell the other team that the food was not actually that exciting so that they would not try so hard to win the next task.Carol took to Instagram after seeing the opposing team's deception and said: 'Helen, innocent meerkat, satanic meerkat angel.",
        " 'Let's tell them that it wasn't so nice so they won't be so competitive. Genius, evil genius. Helen is very naughty to play it down and she's the best at fibbing, she's got these big wide innocent eyes.'It comes as Amir Khan became the third person to be evicted from the I'm A Celeb South Africa jungle on Tuesday following a secret ballot from his campmates.In Monday's episode, the campmates learned that, in a dramatic first for the series, they'd be choosing who was voted out of camp next.",
        "And it was the former boxer, 36, who ended up losing his place in the camp after getting the most votes from his campmates.Speaking to hosts Ant and Dec after he left the camp, Amir told how he was proud of himself after overcoming his fears, noting how he'd handled a snake in his last trial. He also gushed over his second stint on the ITV show, remarking that it was one of the 'best experiences I've ever had',  adding that it was 'even better than Australia'. Elsewhere, Carol Vorderman left viewers in hysterics as she claimed she has 'Britain's most buoyant bottom'. "
    ]
}