{
    "articleURL": "/travel/escape/article-12050159/A-look-inside-epicurean-explorations-offer-ultra-luxury-cruise-line.html",
    "content": [
        "From barrel-aged wines to honeyed whisky, fresh-market produce to fragrant spices, to taste the world is to explore it in greater depth.",
        "Cuisine is a gateway to new destinations and rich cultures while enjoying delicious meals together enriches your travel experience to create something truly memorable.It’s why the world’s most luxurious cruise line, Regent Seven Seas Cruises, has created an epicurean programme that combines both gourmet cuisine and culinary exploration. ",
        "Set sail with Regent Seven Seas Cruises and you’ll enjoy everything from chef-led cookery classes to foraging adventures, speciality restaurants to wine-tasting experiences.Luxury at seaStepping aboard your chosen ship with Regent Seven Seas Cruises is like entering a boutique hotel, where personalised service will take care of your every need. With just 750 guests on board, you’ll enjoy a welcoming and intimate atmosphere, with spacious suites, fascinating speaker programmes and incredible on board entertainment.You can choose from more than 500 ports of call across the globe to discover the true meaning of elevated all-inclusive travel.",
        "Abundant luxury is included with your itinerary, from a selection of shore excursions, allowing you to explore however you please, to the delicious food served at speciality restaurants. Dining delightRegent Seven Seas Cruises believes that nothing enhances travel like great cuisine. That’s why you will experience incredible variety with meals that cater to every diet and taste as part of its speciality on-board dining. ",
        "Each restaurant is included in the price of your cruise, so you can simply select which eatery you’d like to enjoy next, from elegant French fare at Chartreuse on Seven Seas Grandeur, Seven Seas Splendor, Seven Seas Explorer, Seven Seas Voyager, and Seven Seas Mariner, to succulent steaks at Prime 7, aboard every ship.",
        "La Veranda serves breakfast and lunch in a chic indoor dining room and al fresco, transforming into Italian Sette Mari At La Veranda by night on each ship, while Seven Seas Grandeur, Seven Seas Splendor and Seven Seas Explorer host pan-Asian delights at Pacific Rim.Exquisite excursions Step ashore and a world of culinary experiences awaits. You can sip fine wines at historic vineyards led by an expert guide, or pair them with delicious local cuisine - all included in the price of your cruise.Exclusive to the Seven Seas Explorer, Splendor and Grandeur, join chef-led Epicurean Explorer tours. As a small group you’ll visit local markets, sample sizzling street foods and visit world-class restaurants.From glamorous Portofino, a short boat ride will whisk you to Rapello, where you can taste local Ligurian olive oil, take a guided stroll through the farmers’ market and try a pasta-making class followed by a delicious lunch of local delicacies.",
        "Or go off the beaten track with a Latvian cooking class, beginning with a tour through the central market of Riga, Europe’s largest bazaar, where you will shop for fresh ingredients before joining a Latvian cooking class. ",
        "A market tour and paella lunch await in Spain’s Valencia, and you’ll learn how to make pintxos – a type of tapas from the Basque Country – when you stop off in Bilbao.If you’re exploring distant shores, the Belizean paradise of Harvest Caye is the perfect place to savour rich flavours, visiting a spice farm and botanical garden. Or try a hands-on cooking class and dine al fresco in St Lucia after a visit to Castries Market, which has been selling fresh produce and spices for more than 100 years.Cookery classes Enrich your Regent Seven Seas cruise with a chance to learn from the culinary masters.Available exclusively aboard the Seven Seas Grandeur, Splendor and Explorer, the Culinary Arts Kitchen invites you to truly immerse yourself in the cultures you explore by learning more about their gastronomy.Select from a range of chef-led classes that showcase the art of cooking. Explore the flavours of the Aegean and you create dishes from Corfu, Crete and Rhodes, or sample the spiced delights of Morocco and Turkey with an Arabesque class.",
        "The Anytime Brunch Favourites class will guide you through the making of your favourite casual meals, or you can travel to the ends of the world with the Beyond Patagonian Deliciousness class, learning to grill meat Argentinian-style and roast and bake just like they do in Chile. ",
        "Epicurean enrichmentFor foodies who really want to delve into the cuisine of the destinations they visit, Regent Seven Seas Cruises offers Epicurean Spotlight Voyages, crafted around particular culinary interest and featuring special guests, where that is a famous chef or a respected vintner.On any cruise, you’ll have the chance to enjoy hosted tastings lead by sommeliers, mixologists and chefs, but if you’d like something a little more in depth, join when culinary experts are on board to host special talks and demonstrations.",
        "They will give you the opportunity for one-of-a-kind experiences while you travel, and to engage with professional chefs and sommeliers and hear more of the secrets of the kitchen.You can choose to sail the Mediterranean, stopping at charming towns in Italy, Greece and Croatia, joined by culinary masters Alain Roux and Michael Nizzero. Journey through the Sbragia Family vineyards in sunny California, learning the traditional secrets of wine-making. Choose your gourmet cruise No matter where you sail, Regent Seven Seas Cruises offers that chance to savour the rich flavours and traditions of each destination you visit for a truly enriched travel experience.Connect with local cultures, get a taste of daily life and dine on sumptuous cuisine with friends and family.With Regent Seven Seas Cruises, you enter a world of ultra-luxury, where your all-inclusive voyage and on-board experience is complemented by a culinary adventure at each destination your visit.",
        "Find out more and book your cruise at rssc.com"
    ]
}