{
    "articleURL": "/wires/ap/article-12051495/Soccer-title-races-Ukraine-Turkey-defy-field-dangers.html",
    "content": [
        "GENEVA (AP) - Forget about Manchester City and Barcelona for a moment and consider the Ukrainian and Turkish soccer leagues.",
        "Both, somewhat amazingly, are set to be completed in the next few weeks despite war and disaster, and both have big showdown games coming up this month that could decide the titles.The entire Ukrainian league season has been played in near-empty stadiums in the safer western part of the country despite the constant threat of disruption from sirens alerting of Russian air raids. Somehow, the league is only one game behind schedule after 24 of 30 rounds - and second-place Dnipro-1 can use that game to close the gap on perennial champion Shakhtar Donetsk to two points.Shakhtar is scheduled to host Dnipro-1 at the end of the month in Lviv, far from each club's home city in war-ravaged eastern Ukraine.\"It´s a little bit easier than it was in the very beginning,\" Shakhtar official Yuriy Svyrydov told The Associated Press in a telephone interview. \"It´s pretty much football as usual now but emotionally we are like a squeezed lemon.\"The quality of games has fallen, Svyrydov said, since overseas players were allowed by FIFA to pause their contracts and seek loan moves to clubs elsewhere. Fourth-place Dynamo Kyiv is in a relative slump despite coach Mircea Lucescu staying. Shakhtar´s coach last year, Roberto De Zerbi, left when the war started and has excelled since taking over as coach of Brighton in the Premier League.",
        "The league's international broadcast deal expires next month, right after a potential title decider that could ultimately send the winner to the group stage of the Champions League.The Turkish league, with traditional rivals Galatasaray and Fenerbahce at the top of the standings, stopped for three weeks after a devastating earthquake in February. Two of the 19 teams did not resume playing.Galatasaray, fueled by goals from former Serie A players Mauro Icardi and Dries Mertens, leads the league by three points and still has a potentially fierce derby game to host.A title for either Gala or Fener would mean a fourth different winner in four years. Another Istanbul club, Besiktas, is close behind in third.At the other end of the standings, Gaziantep and Hatayspor did not resume after the earthquake but they have been protected from relegation by the Turkish soccer federation.Hatayspor forward Christian Atsu, a Ghana international who previously played for English clubs Chelsea and Newcastle, died when the earthquake struck his home in Antakya near the Syria border.TIGHT RACESTense finishes also seem assured in Belgium and Greece.Panathinaikos is tied with AEK Athens at the top of the standings and each team has two games left in the six-team playoff group.Panathinaikos, which hasn't won the Greek title since 2010, leads the head-to-head tiebreaker and plays at Olympiakos on Sunday. AEK will be at Aris in Thessaloniki.",
        "Belgium also has a championship playoff group and three of the four teams - Genk, Antwerp and Union Saint-Gilloise - are in contention.Sparta Prague starts the five-team playoffs in the Czech Republic two points ahead of Slavia Prague. Sparta, which last won the title nine years ago, hosts the city derby on May 13.The runaway leader in Poland could be a first-time league champion. Raków Czestochowa is 11 points ahead of Legia Warsaw with four games left.STAR PERFORMERRed Star Belgrade dominates like no other club in any other country. Already champion again in the Serbian league, Red Star can reach 100 points for the third straight season if it wins its last four games.The 1991 European champions also restored their status internationally. Three years ago, Red Star completed the rare feat of advancing through four Champions League qualifying rounds to reach the group stage in back-to-back seasons.Serbia is now ranked high enough by UEFA so Red Star will go directly to the group stage - partly because Russian clubs have been excluded. The spot that would have gone to Zenit St. Petersburg will go to Red Star, whose long-time shirt sponsor until last year was Zenit owner Gazprom.THROWBACK LOOKRed Star is helping to give the likely Champions League lineup a throwback look with several winners of the old European Cup - the name of the competition before it was rebranded and reformatted in 1992.",
        "Feyenoord, the 1970 European champion, leads by eight points in the Netherlands with four games left. It would be the club´s first league title since 2017 and only a second appearance in the group stage of the Champions League in 20 years.Feyenoord won its European title by beating another former champion, Celtic. The 1967 champions from Scotland will return to the group stage when an inevitable league title is sealed.Celtic has won 30 of 33 games in the Scottish league and is 13 points ahead of Rangers with five games left.MORE QUALIFIERSSalzburg is on track for another Austrian league title and one of the 26 direct Champions League entries into the 32-team group stage.Newcastle looks sure to end a 21-season absence from the elite stage - and 10 years without any European competitions - by finishing in the top four in the Premier League.Union Berlin is third in the Bundesliga and on track to make a Champions League debut that has become rare in European soccer. Union and Newcastle would be among the lowest-seeded teams.___More AP soccer: https://apnews.com/hub/soccer and https://twitter.com/AP_Sports"
    ]
}