{
    "articleURL": "/news/article-12039885/Joanne-Cherry-claims-MPs-share-stance-gender-reforms-scared-speak-out.html",
    "content": [
        "Cherry blasted Angus Robertson for refusing to comment on club's actions The Culture Secretary said he would not be drawn into discussion on ‘live’ issue",
        "An MP ‘cancelled’ by a comedy club over her criticism of gender reforms has claimed that many of her party colleagues agree with her but are too scared to speak out.",
        "Nationalist MP Joanna Cherry is at the centre of a censorship row after staff at a comedy club refused to work at an event at which she was due to speak.Yesterday she accused party colleague Angus Robertson of cowardice for refusing to comment on the action taken by The Stand Comedy Club in Edinburgh.When asked yesterday about the row, on the BBC’s Good Morning Scotland, Culture Secretary Mr Robertson said he would not be drawn into discussion on a ‘live’ issue.In response, Ms Cherry tweeted: ‘There’s no live legal action in relation to this matter and therefore nothing except perhaps cowardice to prevent any politician from commenting on what has occurred.’",
        "Ms Cherry said she has been ‘harassed, discriminated against and cancelled’ by some in the SNP because of her stance on the gender reforms.She told BBC Radio Scotland: ‘Many of my SNP colleagues agree with me, they are just afraid to speak out. I’ve had a lot of private discussions with MPs and MSPs and many party members. But they have seen what has happened to me ever since I spoke out in favour of women’s and lesbian rights.’Ms Cherry said there are ‘many others who are just going along with [gender] self-ID for a quiet life’.",
        "The Stand said it ‘will not compel our staff to work on this event.’Meanwhile, scores of academics and students have urged Edinburgh University to allow a women’s rights documentary to be screened – after two earlier attempts were disrupted by a pro-trans protest mob.Feminist organisation Woman’s Place UK said more than 80 people had signed an open letter to the principal, Professor Sir Peter Mathieson, asking for another screening with security provided."
    ]
}