{
    "articleURL": "/wires/reuters/article-12042515/Serbia-school-shooting-country-s-gun-laws.html",
    "content": [
        "By Aleksandar Vasovic",
        "BELGRADE, May 3 (Reuters) - Serbia, where a schoolboy opened fire on his classmates on Wednesday, has an entrenched gun culture, especially in rural areas, but also strict gun control laws.The entire western Balkans are awash with hundreds of thousands of illegal weapons following 1990s wars in Croatia, Bosnia and Kosovo where ethnic Serbs fought other ethnic groups which together made up former federal Yugoslavia.The then-Serbian authorities promoted nationalist policies and used media outlets to present war criminals and underworld figures as heroes and defenders of Serb lands. Dozens of people were killed in gangland-style shootouts in the 1990s.Tens of thousands of illegal firearms have since been handed over or registered in amnesties. But Serbia still ranks third behind the United States and Yemen with an estimated 39 firearms per 100 people, along with its former federal partner Montenegro, according to the 2018 Small Arms Survey.Hunting is widespread with over 78,000 of Serbia's 6.6 million people having licensed hunting weapons, and many families have had guns in their households for generations.Yet mass shootings are comparatively rare in the country.People over the age 18 may own firearms only with a permit issued after a thorough background check with police. A medical exam is also mandatory and must be repeated every five years.",
        "There must be no history of crime, mental disorder, alcohol or illegal substance use, firearms must be stored locked in a designated gun cabinet, and may be confiscated if the owner is found to be irresponsible.Gun owners are also required to pass a training course and a questionnaire about gun legislation.Having a permit to own a firearm does not itself allow the bearer to carry the weapon anywhere outside the home. Concealed carry permits are very difficult to obtain.In the deadliest shooting in Serbia since the 1990s, Ljubisa Bogdanovic killed 14 people in the central village of Velika Ivanca in 2013 before committing suicide.Nikola Radosavljevic killed nine and wounded five in the eastern village of Jabukovac on July 27, 2007. He was put in a mental institution.Rade Sefer killed six guests at his son's wedding in the northern town of Senta in 2015 and was then killed on the spot by another man with a chair. A year later, Sinisa Zlatic killed five people with an assault rifle in a cafe in the town of Zitiste, also in the north, before being arrested and convicted.All of those assailants were adults.(Writing by Aleksandar Vasovic; editing by Philippa Fletcher and Mark Heinrich)"
    ]
}