{
    "articleURL": "/news/article-12048809/Mom-killed-three-children-jumping-roof-permanently-paralyzed-waist.html",
    "content": [
        "Massachusetts mother who allegedly strangled her children to death then tried to kill herself by jumping off a roof is permanently paralyzed below the waistLindsay Clancy's attorney says she was driven to psychosis by a cocktail of post-partum and anxiety drugsHer defense is being funded by her parents but she will now likely need financial support from the courtA mother who allegedly strangled her three children to death then tried to kill herself by jumping off the roof of their home has been left permanently paralyzed from the waist down. ",
        "Lindsay Clancy, 32, is accused of strangling her five-year-old daughter Cora, three-year-old son Dawson, and seven-month-old son Callan in the basement of their home in Duxbury, Massachusetts, on January 24. She had been battling post-partum depression and begged doctors for help before the deaths - and she cut her own wrists then jumped from a top floor window of the family's home following the ordeal. Lindsay has spent the last four months receiving intense medical care and was recently moved to a different hospital while she awaits a grand jury decision on whether or not she will be charged with murder. Now her lawyer has revealed she has been left with permanent damage and will never be able to move her legs again, according to the Boston Globe. A GoFundMe page set up for her bereaved husband Patrick Clancy in January has raised more than $1million - but her attorney has now insisted ‘not one cent’ of this was being used to pay for her defense. ",
        "Clancy publicly forgave his wife following the ordeal in January. Instead, Lindsay's parents have been paying for her legal bills, her attorney confirmed. Attorney Kevin J. Reddington revealed 'she will be forever' paralyzed from the waist down following the jump from the window and cited medial records and his discussions with doctors. ",
        "She is currently being treated at Tewksbury Hospital and is in the care of the state Department of Mental Health after clinicians determined she needs long-term psychiatric help and medical care. It's unclear if a jury has been impaneled yet, or if it is yet to convene but if charged with murder, Lindsay will face life in prison. Her attorney is fighting for more compassionate charges, and say she will require round-the-clock medical care for the rest of her life.The office of District Attorney Timothy J. Cruz has alleged she plotted to kill her children and asked her husband Patrick to collect food from a restaurant so she had time to commit the murders. The next court hearing has been scheduled for July. Reddinton said the defense has appointed a national expert on parents who kill their children and Dr. Phillip Resnick, a psychiatry professor at Case Western Reserve University, and psychologist Paul Zeizel to look at Lindsay’s mental health.And the attorney is looking into whether Lindsay can raise a defense of diminished capacity.She was arraigned in her hospital bed at Brigham and Women’s Hospital on February 7 where she pleaded not guilty to first-degree murder charges which are pending in Plymouth District Court.",
        "Lindsay was previously being treated at Spaulding Rehabilitation Hospital before she was moved to Tewksbury Hospital two weeks ago.",
        "Reddington has said she was suffering from postpartum depression or psychosis and had been improperly prescribed multiple medications for anxiety mood disorder and psychosis.Lindsay’s defense has been funded by her parents but she will now likely need financial support from the court, her attorney said.‘They’re pretty much depleting everything they have to try and help her out,’ Reddington added.Patrick publicly forgave his wife in January but Reddington declined to say whether he was also helping fund her case.He said: 'I am not going to comment about Patrick, but every nickel that’s been spent on her defense has come from her parents.’A GoFundMe on behalf of Patrick has raised more than $1million since January and he made his only public statement about the tragedy.'I want to ask all of you that you find it deep within yourselves to forgive Lindsay, as I have,' he said. 'The real Lindsay was generously loving and caring towards everyone - me, our kids, family, friends, and her patients. The very fibers of her soul are loving. All I wish for her now is that she can somehow find peace.'She loved being a nurse, but nothing matched her intense love for our kids and dedication to being a mother. It was all she ever wanted. Her passion taught me how to be a better father.'",
        "Reddington made it clear that the money raised was Patrick’s and that ‘not one cent’ was being used to pay for Lindsay’s defense.He said: ‘That’s Patrick’s money. Her parents are paying for her defense.’On January 1, Lindsay - who was herself a labor nurse herself at Massachusetts General Hospital - checked herself into the McLean psychiatric hospital in Belmont.",
        "She spent five days there, according to her attorney Reddington, during which she complained about becoming addicted to benzodiazepines.Doctors at the hospital decided to take her off Seroquel - a drug used to treat schizophrenia and depression.She was then given Trazodone, another anti-depressant, and Ativan, a branded version of Lorazepam, according to her attorney.The circumstances surrounding Lindsay's discharge from the hospital remain unclear, and it is also unclear whether she ever told doctors that she felt homicidal.In the weeks before the killings, she told her husband that she felt suicidal.Her attorney says that she went back to the doctor after leaving McLean, but he has not specified what drugs she was given then.Twenty days later, she strangled her three children then tried to kill herself by slitting her wrists and jumping from a top floor bedroom of the family home.A spokesman for the hospital declined to give details on her care or discharge, citing privacy laws.",
        "'Due to federal privacy laws and our ethical standards, we are unable to comment on specific patient cases.'The complexities of mental health are different for each individual and similarly, treatment strategies vary depending on each person’s unique needs.'Whether it be proven and effective medications, psychotherapy, peer support, complementary and alternative medicine, or a combination of multiple approaches, it is important that any care plan be evidence-based and derived from patient-centered discussions and shared decision making,' he said.Prosecutors told a court that Lindsay told her husband she heard a 'man's voice' telling her to kill the kids and herself, and that it was her 'only chance'.Her attorney says she had become shell of herself in the months since her third child's birth, and that she'd been overprescribed an astonishing combination of 13 different drugs to help her cope."
    ]
}