{
    "articleURL": "/wires/pa/article-12040791/Lloyds-beats-forecasts-46-leap-profits-rates-boost.html",
    "content": [
        "Lending giant Lloyds Banking Group has joined rivals in posting better-than-expected results for the first quarter as rising interest rates helped profits jump 46% higher.",
        "The group reported pre-tax profits of £2.3 billion for the three months to March 31, up from £1.5 billion a year earlier.Lloyds took an impairment charge of £243 million, up from £177 million a year ago, despite a slightly improved economic outlook for the UK.Lloyds said it was seeing “modest” increases in borrowers falling into arrears and defaulting on loans amid the cost-of-living crisis but said levels remain at or below those seen before the pandemic struck. The macroeconomic outlook remains uncertain. We know that this is challenging for many people  Chief executive Charlie Nunn  It said the arrears mostly relate to mortgages written in 2006 to 2008, at a time when borrowers could over-stretch themselves, with many of these loans also on variable rates, making them vulnerable to base rate increases.But the group’s chief financial officer William Chalmers said: “It’s very modest and doesn’t cause us any alarm.”",
        "The group now expects the economy to fall by 0.6% in 2023 overall – against its prediction in February for a 1.2% decline – but still slip into a mild recession over the first three quarters, before returning to growth.House prices are likely to fall by a more muted 5.3% this year and 1.2% in 2024, it added.",
        "Chief executive Charlie Nunn said: “The macroeconomic outlook remains uncertain.“We know that this is challenging for many people.”The figures come after HSBC on Tuesday revealed profits more than tripled in the first three months of the year to 12.9 billion US dollars (£10.3 billion) as the sector is buoyed by higher interest rates.",
        "Pre-tax profits reported by the group for the first three months to March 31",
        "Banking giant Barclays and NatWest also beat profit expectations when they reported last week.But Lloyds said deposits fell £2.2 billion, or 0.5%, including a £3.5 billion drop in retail current account balances, partially offset by a £2.7 billion rise in the commercial banking division.It said this was partly as a result of customers spending more on utilities and bills due to the cost crisis, as well as seasonal tax payments and as people looked to take advantage of better savings rates across the industry.Mr Chalmers said Lloyds does not believe there was a flight to safety amid the worries over a global banking crisis in recent months, sparked by the collapse of Silicon Valley Bank in the US.Troubles in the sector keep bubbling up and, on Monday, US regulators seized troubled First Republic Bank and sold all of its deposits and most of its assets to JPMorgan Chase Bank in a bid to head off further banking turmoil in America.",
        "San Francisco-based First Republic was the third mid-size bank to fail in two months.Mr Chalmers said the impact of this on the UK sector has so far been “very limited”."
    ]
}