{
    "articleURL": "/wires/afp/article-12041787/Germany-says-pull-troops-Mali-May-2024.html",
    "content": [
        "The German government said on Wednesday it had decided to end its participation in the UN mission in Mali by next May over problems with the ruling junta.",
        "Chancellor Olaf Scholz's cabinet said Berlin would pull its 1,110 troops in the UN mission MINUSMA out of the West African country over the next year and pivot towards more humanitarian and development aid for the region.\"Whether we want it to or not, what happens in the Sahel affects us,\" Foreign Minister Annalena Baerbock said in a statement.\"We are reorganising our engagement in the region and will let our participation in MINUSMA run out in a structured fashion over the next 12 months.\"The government said it would \"at the same time deepen its civil support for the region\" and \"strengthen the focus of its engagement on security in Niger, Mauritania and the states on the Gulf of Guinea\".Defence Minister Boris Pistorius said the recent fighting in Sudan had underlined \"how quickly a country's instability can lead to an existential threat for the lives of our citizens\".He said Berlin's goal was to \"foster the growing responsibility of Africans for security and stability on their own continent\".- Stay committed -MINUSMA was created in 2013 to help stabilise the country as it battled a jihadist insurgency.Germany announced last year that it planned to withdraw its troops from the mission by May 2024, a decision now approved by the governing coalition.",
        "It came after the German army, known as the Bundeswehr, had repeatedly run into operational problems with the ruling junta.The Sahel state has been battling a security crisis since jihadist and separatist insurgencies broke out in the north in 2012.It has since August 2020 been ruled by a military junta, which broke a long-standing alliance with France and other Western partners in the fight against jihadism.There had also been growing tensions between the UN mission and Mali's military rulers following the alleged arrival of Wagner operatives from Russia to bolster government forces.Pistorius pledged last month on a visit to the region that Berlin would stay committed to security in the Sahel after its troops left Mali.The German cabinet in March agreed for up to 60 German soldiers to participate in the new EU-led military mission EUMPM, based in Niger.Mali's long-running insurgency has claimed thousands of lives and forced hundreds of thousands from their homes.In claims disputed by experts, the junta says it has routed jihadists over the past year. But recently it has suffered a series of bloody attacks."
    ]
}