{
    "articleURL": "/news/article-12047947/Disabled-army-veteran-struggled-feet-salute-Queens-coffin-faces-homeles.html",
    "content": [
        "EXCLUSIVE: After 14 years of service Sgt Nick Wilson was left with broken spine READ MORE: British girl, six, fights for life in hospital after car crash in IbizaA disabled army veteran, who struggled to his feet to salute the Queen's coffin, faces being made homeless after his council said they cannot find him suitable housing. ",
        "Sgt Nick Wilson was told to move out of his current home by his landlord who has been battling to keep up with his increased mortgage repayments.He turned to West Northamptonshire council who told him to apply for 'private' housing because they had no accommodation to suit his disability needs. The 46-year-old, from Northampton, suffers from Post Traumatic Stress Disorder (PTSD), depression and has to use a wheelchair due to a severe spinal injury caused during his time in service.The gruelling hunt for a new home has led the ex-soldier to battle 'suicidal thoughts' as he lives every day in 'chronic pain'. Mr Wilson told MailOnline: 'Disabled people are sleeping on friends' sofas and in cars as they have nowhere else to go.",
        "'It puts you in a dark place, I'm already battling suicidal thoughts.'I live in chronic pain every single day and the one thing you need to know is you're safe and secure in where you live.'Mr Wilson, who also tried to take his own life six years ago, explained his current landlord cannot afford his current mortgage payments so he has to quickly find accessible accommodation.The ex-soldier, who served in Afghanistan, Kosovo, and Iraq during his 15 years in the Royal Logistic Corps, may have to resort to living in a Travelodge hotel if he cannot find anything suitable. ",
        "'I don't want to live in a hotel, it seems fun and exciting and then it gets boring', he explained. 'It's not a home, I can't cook or settle. I'm disadvantaged because of my age as medically I would be entitled to go into assisted living but as I'm 46 they don't need to take me on.'Rental sites like Zoopla and Rightmove don't let you search for accessible features which means a lot of time is wasted.'Mr Wilson's condition has declined drastically over the last two years and now relies on a powered chair for mobility after spending 14 burdensome years in service.'There was no glory in it, no IED or anything', he added.'It was just the rigours of service. With the toxic masculinity of the army, you just push through the pain but my body said no one day and it resulted in a broken spine.'Despite Mr Wilson's youthful age he may have to consider moving into a retirement home if he doesn't want to live his life in a hotel.He qualifies for priority housing but the lack of suitable homes means little can be done as he already claims to struggle physically to enter most buildings.  This comes just months after the former Sgt waited patiently with thousands of mourners for a final opportunity to honour his later Commander-in-Chief, Queen Elizabeth II. ",
        "Despite his crippling spinal injury, the survivor dug deep to lift himself for one final gesture as he approached her coffin. The Ambassador for the Disability Expo charity became the first person to complete 96km of the Ridgeway National Trail in an off-road mobility chair. This followed his challenge in 2021, where he completed a huge 385-mile cycle ride and  raised over £125,000. He has also completed a half marathon in Basrah, Iraq and a 1000mile cycle ride to commemorate 60th anniversary of D-Day.Sadly, Mr Wilson is far from the only disabled person affected by the country's accessible home shortage. According to a report by the Equality and Human Rights commission, only 7% of English homes have minimal accessibility features with the latest population estimate's for Britain's disabled community registering at 13.3 million people.Alan Wallace Director of i-Matter CIC &amp; Disability Expo said: 'Disability Expo &amp; i-Matter is all about making positive change and policy, &amp; we will be highlighting the need for more Accessible Houses at the show in July.' A spokesperson for West Northamptonshire council said: 'While we wouldn't discuss specific cases, we can say that our teams work extremely hard to manage all housing requests based on the accommodation we have available and in line with our allocations policy.' ",
        "Disability Expo is the first event which will be, for the Disabled Community and led by the Disabled Community, being held at Excel London over 6/7th July – tickets are free http://www.thedisabilityexpo.com/"
    ]
}