{
    "articleURL": "/tvshowbiz/article-12053473/Katharine-McPhee-39-David-Foster-73-enjoy-Cinco-Mayo-dinner-friends.html",
    "content": [
        "Katharine McPhee and husband David Foster met up with friends and grabbed dinner at a celebrity hotspot to celebrate Cinco de Mayo.",
        "On Friday, the celebrity couple were seen arriving at Craig's restaurant in West Hollywood, where they enjoyed a night of tasty American cuisine and drinks.The singer and actress, 39, looked to be a great mood while decked out in a stylish black skirt and matching blazer with a sparkling layered necklace of her own design from her brand, KMF Jewelry. Flashing an infectious smile, the Los Angeles native swiftly made her way inside the restaurant with her party following in tow.Foster, 73, looked his usual dapper self, dressed in a classic black suit with a white dress shirt, and his gray hair styled short.",
        "The group eventually made it inside the establishment and sat down together for dinner.Cinco de Mayo is a yearly celebration held on May 5 to celebrate Mexico's victory over the Second French Empire at the Battle of Puebla in 1862, led by General Ignacio Zaragoza.More popular in the United States than Mexico, Cinco de Mayo has become associated with the celebration of Mexican-American culture.Celebrations began in California, where they have been observed annually since 1863.Eventually, the couple and their friends wrapped up their time at Craig's and made the short walk back to their parked car.Admiring photographers would again snap photos of McPhee and Foster while driving out of the parking lot.",
        "McPhee sat in the backseat while her husband was behind the wheel and a male companion sat in the front passenger's seat.In another picture, the former star of the Broadway version of Waitress turned her attention to her cell phone.Just two days earlier, the couple took to their respective Instagram pages to promote Foster's upcoming concert in Las Vegas, dubbed, Intimate Evening With David Foster: Hitman Tour.The two shows in Sin City are being held on June 23 and 24, with McPhee serving as the special guest singer.",
        "'Las Vegas! We had so much fun last time that we’re heading back to @wynnlasvegas with @martinnievera this June for TWO more nights! Get your tickets now before they’re gone!' it read in the caption. The pair first met on the set of American Idol in 2006 while McPhee was competing on the singing show.She placed second to Taylor Hicks.The couple, who will be celebrating their fourth wedding anniversary on June 28, are now the proud parents of two-year-old son, Reenie.While Rennie is the first child for McPhee, this is child number six for Foster, but the first son for the music composer and producer.He is already a father to five adult daughters: Sara, 42, Erin, 40, and Jordan, 36, whom he shared with second wife Rebecca Dyer. ",
        "Foster also has daughters Allison, 53, and Amy, 49, from previous relationships. "
    ]
}