{
    "articleURL": "/sport/cricket/article-12042123/Candice-Warner-hits-Mitchell-Johnson-criticism-ahead-Ashes.html",
    "content": [
        "Candice Warner has hit back at comments made by Mitchell Johnson The former Australia star lashed her 'weird' defence of David Warner But Candice insists that Johnson is considered irrelevant since retirement Candice Warner has claimed Mitchell Johnson's opinions do not have 'a lot of merit' as the wife of cricket star David hit back at the former fast bowler's criticism of the struggling batsman. ",
        "Candice - who shares three children with Australia's Test opener - has launched a passionate defence of her husband amid questions surrounding his future in the team amid a torrid run of form.When asked by Fox Sports about Warner's performances, Candice said: 'I get (he's struggled), but if Dave doesn't perform in that first Test, who do they bring in that's better?'Her comments failed to satisfy Johnson - who played alongside Warner for four years - and he claimed that Candice's defence was 'weird and cringey' in his column for The Western Australian. 'We've all appreciated Warner's tremendous career as an opener and what he's achieved. But that's not what it's about. His form has not been up to scratch for a while now,' he said.",
        "'Warner even had his wife Candice defending him in her panel role on the TV show The Back Page ...'Her loyalty might be admirable but it was all a bit weird and cringey when she said if Dave doesn't perform in that first Test, who do they bring in that's better? ... I hate that argument.'Now, Candice has dismissed Johnson's comments and claimed that the former fast bowler is irrelevant.'It doesn't surprise me because he doesn't have a lot to do with media anymore and I feel like the only way he gets a headline is by using David's name,' she told News Corp.",
        "'Everyone takes his comments with a grain of salt. They don't have a lot of merit.'She added that she will head for England after the first Test of the five-match series, as it was before the school holidays. ",
        "'The last time we were over there I gave birth to Isla (our youngest daughter) and she'll get to celebrate her fourth birthday in England,' Candice said.'I can't be taking too much time off with my work commitments but for every parent the juggle is real.'David takes it one game at a time and as a family we back him and believe in him.'"
    ]
}