{
    "articleURL": "/wires/ap/article-12047807/Israel-minister-Iran-nuke-enrichment-ignite-region.html",
    "content": [
        "ATHENS, Greece (AP) - Israel´s defense minister claimed Thursday that Iran could have enough enriched uranium for five nuclear weapons, and warned Tehran that proceeding to weapons-grade enrichment could \"ignite the region.\"",
        "His remarks echoed international concerns, which have mounted over the past months, on Tehran enriching uranium closer than ever to weapons-grade levels. Experts have said that the Islamic Republic has enough fuel to build \"several\" atomic bombs if it chooses.\"Make no mistake, Iran will not be satisfied by a single nuclear bomb,\" Israeli Defense Minister Yoav Gallant said Thursday during a visit to Athens.Uranium enriched for use in nuclear power plants is normally below 20%, while 90% enrichment is considered to be weapons grade.\"So far, Iran has gained material enriched to 20% and 60% for five nuclear weapons,\" Gallant said. \"Iranian progress, enrichment to 90%, would be a grave mistake on Iran´s part and could ignite the region.\"Israel´s leadership argues that Iran can only be stopped from developing nuclear weapons by the threat of military action, while the United States publicly favors a return to multilateral diplomatic efforts.",
        "The International Atomic Energy Agency said in March it would restart inspections and camera-monitoring at some Iranian nuclear facilities after it reported that particles of highly enriched uranium were found at an underground nuclear site.In Athens, Gallant was hosted by Greek Defense Minister Nikos Panagiotopoulos. The two promised to further enhance military cooperation.Greece last year launched a new international pilot training center, assisted by Israel and Israeli defense contractor Elbit in a $1.65 billion deal. And last month, Israel agreed to provide Greece with Spike anti-tank missiles in an agreement worth $400 million."
    ]
}