{
    "articleURL": "/wires/ap/article-12051311/Lebanons-finance-minister-questioned-Central-Bank-probe.html",
    "content": [
        "BEIRUT (AP) - A European judicial team questioned Lebanon´s caretaker finance minister on Friday in an investigation related to corruption probes of the country´s Central Bank governor, officials said.",
        "The questioning is part of a probe by a delegation from France, Germany, and Luxembourg, now on its third visit to Lebanon to interrogate suspects and witnesses in the case. Central Bank Governor Riad Salameh is being investigated abroad over several financial crimes and the laundering of some $330 million.During Friday's session, caretaker Finance Minister Youssef El Khalil was questioned about his work as a close associate of Salameh while working at the Central Bank, before he became a Cabinet minister, officials said. They spoke on condition of anonymity because of the ongoing probe.El Khalil worked for the Central Bank from 1982 until he became finance minister nearly two years ago and was last the executive director of its financial operations department.On Thursday, the European delegation questioned Salameh´s brother, Raja Salameh. After questioning El Khalil, the delegation was expected to leave Lebanon. It was not clear if it would return for more questioning at a later date.The three European governments in March 2022 froze more than $130 million in assets linked to the investigation. In March this year, the delegation came to Beirut and questioned the governor about the Central Bank´s assets and investments abroad, a Paris apartment owned by Road Salameh, and Forry Associates Ltd, a brokerage firm owned by his brother.",
        "France has earlier questioned the chairman of Lebanon´s AM Bank, Marwan Kheireddine, on several charges, including money laundering. Reports in Lebanon say the governor and his associates had used commercial banks to siphon off public money.The 72-year-old governor has repeatedly denied all allegations against him, insisting that his wealth comes from his previous job as an investment banker for Merrill Lynch, inherited properties, and through investments. The governor is also being separately investigated by Lebanese authorities."
    ]
}