{
    "articleURL": "/money/comment/article-12051995/Battle-royal-lift-growth-says-ALEX-BRUMMER.html",
    "content": [
        "Growth is proving heavy lifting against a background of double-digit inflation Using tax cuts as a quick fix to encourage expansion is not enough What is needed are incentives for business investment ",
        "The magnificence and mystical rituals of the Coronation will provide useful breathing space for the Tories to lick their local election wounds.",
        "Psephology experts argue that municipal polls are a free ride and don't tell us what will happen in a general election.Losses in places such as Middlesbrough, Stoke-on-Trent and Tamworth, places where it was hoped the Tories could sprinkle stardust, do not augur well.The reality for Rishi Sunak and Chancellor Jeremy Hunt is that, in spite of the resilience of Britain's dominant services sector, there is industrial and economic disruption everywhere you look.A friend, who heads a top Aussie university and is heading back this weekend, was advised to be at Heathrow five hours before flying. Unite security workers, at our gateway airport, could not resist the temptation to disrupt a national festival.Growth is proving heavy lifting against a background of double-digit inflation, the squeeze on personal incomes, rising welfare bills for the millions outside the workforce, high taxation and fiscal stringency.London School of Economics economist Anna Valero, who recently joined the Chancellor's council of economic advisers, says that using tax cuts as a quick fix to encourage expansion is not enough.She argues that what is needed are incentives for business investment. The Chancellor is doing this by means of £7.9billion giveaway through capital allowances (rising to £10billion next year).But when the top rate of tax in the North Sea stands at 75 per cent and the headline rate of corporation tax has been increased from 19 per cent to 25 per cent in a massive gulp, the Government is hardly sending a positive message.",
        "The Chancellor is fond of pointing out that the UK is a treasure house of advanced technology, creativity and much else.Amid the current lively debate about artificial intelligence (AI) and how it is going to take over the world it is often forgotten that Britain and its leading science universities are big players.At least seven of the top global AI pioneers started out or are still in the UK.Most famous is DeepMind, which, foolishly, has been sold to Google owner Alphabet. Recently, chief executive Demis Hassabis was chosen to head a new unit, Google DeepMind, which merges Britain's AI expertise with that of Google AI. Once again, brilliant UK intellectual property and code writers will migrate to California.If SUNAK'S government has ambition to make the UK the next Silicon Valley it needs to act fast. Referrals under the National Security and Investment Act must be ramped up to ensure valuable high-tech, biotech and aerospace does not escape these shores without scrutiny.R&amp;D spend must be rocket-fuelled to meet the 2.6 per cent of output target if not more. Critically, the Government must help release financial flows locked up in defined contribution pension funds.Among potential gushers are Britain's local government pension savings with the capacity to become, like their Canadian counterparts, sovereign wealth funds financing high-growth start-ups. The Purposeful Finance Commission, headed by Pensions Insurance Corporation boss Tracy Blackwell, reckons there are £364bn of assets, some of which could be deployed.",
        "The administrative cost of running these funds is £1billion higher than their Canadian counterparts, which already are enthusiastic investors in UK plc.This is a deadweight, with the money ending up in the hands of consultants, lawyers and asset managers – and doesn't stop poor decisions such as the exposure of Kent council to Neil Woodford funds, resulting in a potential loss of £84m.Were local authority funds consolidated, some of the money being devoted to more productive assets, such as infrastructure at research universities and higher growth UK companies, could be considerable. Britain showed in the pandemic how setting national goals can work. Lower headline tax rates are critical. Listing reforms would make initial public offerings more viable.As critical is creating a better culture for pension fund investment. In the US barely a day passes when people don't check how their personally controlled pension savings are doing. In Australia performance of the funds is a national obsession.Britain needs that if a new tech and infrastructure investment environment is to be cultivated. That would be a tasty dish to set before a King.",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}