{
    "articleURL": "/health/article-12042175/I-went-pop-pimple-turned-skin-CANCER-warning-signs-missed.html",
    "content": [
        "Michelle Davis, 52, from New Zealand, tried to ignore a pimple on her noseBut when she tried to pop it, no puss came out but it wouldn't stop bleedingREAD MORE: How a FACIAL saved my life when beautician spots cancerA woman has been diagnosed with skin cancer after mistaking a malignant mass on her nose for a pimple. ",
        "Michelle Davis, 52, from Orewa, New Zealand, spotted the red bump on her nose in April 2022 and thought it was just a spot until it became 'really sore'.But when she tried to burst it with her fingers, no puss came out but the spot would not stop bleeding, prompting her to seek medical care.Her doctor immediately thought it was cancer and, following a biopsy, diagnosed Ms Davis with basal cell carcinoma – a common form of skin cancer affecting four million Americans every year.Ms Davis missed the warning sign that she had a spot, or sore, that did not heal or go away on its own, which is a common sign of the cancer according to the American Academy of Dermatology.",
        "Ms Davis has had surgery to cut out the cancer and had the skin of her nose stretched to cover up the hole it left.The account manager is now recovering from the surgery at home and won't need further treatment.Ms Davis said that when the pimple first emerged she thought, 'What am I doing getting a pimple at 52'. and that it would go away quickly.But it did not, she said, adding: 'It would flare up and go back down. I remember squeezing it and nothing coming out.",
        "Jillian Murray, from Cairns in Australia, had already been to see doctors about the discolored area above her right breast in June last year — but was told it was nothing to worry about. ",
        "'Then it bled and bled and bled – for like a week. I was in shock when I found out. I had never heard of basal cell carcinoma.'Michelle first spotted the 'pimple' a year ago and spent a year covering it up with concealer.She said: 'It was really hard. Like a volcano under the skin. I went walking with my girlfriend and it went purple and she pointed it out.'I said, \"It's just a pimple\", I was in denial.'But in January 2023 the spot became 'really sore' which led her to try to squeeze it.She said: 'Nothing happened. Then it bled and bled. I thought 'that's not normal'.'Michelle went to her doctor the following month and was told that it looked like skin cancer.A biopsy confirmed she had basal cell carcinoma and she was rushed for surgery to remove the cancer. There was no sign that it had spread to other areas of her body.Michelle underwent a nasal flap reconstruction at Ormiston Hospital, Auckland, in April 2023 to remove the cancer and pull the nose skin over the hole.",
        "She said: 'They cut up my nose in a zig-zag. They cut out a crater. There was a hole in the end of my nose.'They then bring the skin down to cover it.'Michelle was left with scarring and different shaped nostrils but said it is healing nicely. She is also thankful to still have a nose.She said: 'It's still healing. My nostrils are different shapes because they stretched the skin.'The scar tissue is hard. The nerves are numb.'[But] some people end up losing their nose, so thank goodness.'Michelle will need to return for checks once a year, she said, because she is more at risk of skin cancer having already had it once.",
        "She has shared her story to raise awareness of the condition and urge others not to dismiss pimples that won't go away. 'If I'd kept ignoring it, it would have got way bigger,' she said. 'I might have got to the stage where they couldn't cut it out.'I honestly thought it was a pimple. I thought skin cancer was a mole.'She was not sure why the cancer had emerged, but said that she never used skin block when she was growing up — although it is now in her day-to-day skincare routine. ",
        "Michelle said: 'At first I thought I'm 52 and single, now I'm going to have this hideous nose.'But it's been quite empowering. It's only skin deep. It's what's on the inside that counts.'About 4.3million Americans are diagnosed with basal cell carcinoma every year, figures suggest.But the vast majority survive the condition, with about 2,000 deaths recorded from the cancer annually.It is normally caught in the early stages before it has spread to other areas of the body, allowing doctors to quickly remove it during surgery.The number of cases has been trending upward in recent years, which doctors have linked to more sun exposure, having light-colored skin and people living longer.The cancer is more common among men than women, which researchers have linked to them being more likely to work in outdoor professions."
    ]
}