{
    "articleURL": "/wires/reuters/article-12045515/SABIC-Q1-profit-plunges-90-amid-pressure-global-demand.html",
    "content": [
        "DUBAI, May 4 (Reuters) - Saudi Basic Industries Corp (SABIC), one of the world's biggest petrochemical companies, said on Thursday its first-quarter net profit dropped 90% and warned it expected margins to remain under pressure in the second quarter.",
        "The company reported net income of 660 million riyals ($175.98 million) for the three months ending March 31, down from 6.47 billion riyals in the same quarter a year earlier.Despite the fall, SABIC beat analysts' median expectation of 540 million riyals in net income for the quarter, according to Refinitiv data.\"We are closely monitoring the changes and the recovery of the global market demand. New capacities in Q1 2023 are adding more pressure on global prices, while there is limited relief on variable cost,\" SABIC's CEO Abdulrahman Al-Fageeh said in a statement.The company remains determined \"to deliver on growth, innovation and sustainability\" despite market uncertainties, he said, adding the Shareek programme would play a key role in growth plans.TheShareek programme, announced in 2021, is meant to see SABIC and oil giant Aramco, which owns 70% of SABIC, leading $1.3 billion in investments in the private sector through 2030, part of broader plans to cut reliance on oil.\"High inflation and interest rates continues to add to the uncertainty of global demand growth. We expect margins to remain under pressure in Q2 2023,\" SABIC said, as it sees global economic growth averaging 2.1% this year.In March, SABIC announced the start up of commercial operations at a polycarbonate plant in China, a 50-50 joint venture with Sinopec that will have an annual capacity of 260,000 tonnes.",
        "Sources told Reuters on Tuesday that Aramco was listening to proposals from Sinopec and TotalEnergies to invest in the Jafurah development in the kingdom.The state-owned Chinese gas giant said in March it was exploring opportunities in the kingdom, where it already owns a refinery stake. ($1 = 3.7505 riyals) (Reporting by Yousef Saba; Editing by Susan Fenton and Kim Coghill)"
    ]
}