{
    "articleURL": "/wires/aap/article-12044937/North-Melbournes-Tarryn-Thomas-make-VFL-return.html",
    "content": [
        "North Melbourne utility Tarryn Thomas will play in the VFL on the weekend in a significant step towards returning to the Kangaroos' AFL fold.",
        "Thomas has been training with the Kangaroos' VFL team since April 18 while working part-time and taking part in a respectful behaviour program.The 23-year-old's career has been hanging in the balance since he was stood down by the Kangaroos for a second time in March amid concerns over his behaviour towards women.Thomas was an onlooker at North training on Thursday morning and coach Alastair Clarkson said he would face Sandringham at Arden Street on Sunday, provided the AFL ticked off his return to play.\"We're hopeful that he'll play this week in the VFL,\" Clarkson told reporters.\"I'm led to believe that the club and the AFL just need to tick that off if they haven't already.\"I haven't actually checked with (football boss) Todd Viney and (chief executive) Jen Watt on that as yet, but if that hasn't been done it will be done and we're hoping he'll play.\"He's spent the last couple of weeks training in the VFL program. He'll do that for the next couple of weeks, but now with the availability to play and then hopefully he'll be able to come back into the AFL program.\"But he's been doing an away-from-the-club program with the VFL but also doing some work with a cleaning business and he's progressing along really well, from what we're led to believe.\"",
        "Thomas was at training to catch up with his player sponsor, who is over from his home state of Tasmania, and also saw some of his teammates late in the session.\"It was good to see him here and hopefully he can get himself back into the routine of AFL pretty soon,\" Clarkson, who has had little involvement with Thomas away from North, said.\"He's a listed player at our footy club and mates with the players, so they're keen for him to get his life sorted and get back to doing what he does really, really well and that's play AFL footy.\"Thomas was charged in January with threatening to distribute an intimate image and faced court in March. The case will return to the Broadmeadows Magistrates Court on July 18.In February, Thomas faced two counts of violating a court order but those charges were subsequently dropped.In March, North were made aware of further allegations of inappropriate behaviour, which they reported to the AFL's integrity unit.Last month, North fined Thomas $5000 and made him donate a further $5000 to a road safety charity for a video he posted to social media that showed him behind the wheel of his drifting Mercedes with his feet on the dashboard.",
        "He is also due to face court later this year on an unrelated charge of driving with a suspended licence."
    ]
}