{
    "articleURL": "/wires/aap/article-12040593/NZ-offers-humanitarian-refugee-support-Ukraine.html",
    "content": [
        "New Zealand has opted not to send Ukraine military aid or equipment in its latest support package, unveiling instead $NZ5.3 million ($4.9 million) in humanitarian, refugee and legal support.",
        "Prime Minister Chris Hipkins announced New Zealand's first pledge in six months on Wednesday while visiting Kiwi troops in the United Kingdom.There was no support for Ukraine's military beyond the deployment of NZ Defence Force personnel in the UK and Poland on training missions for Ukrainian fighters.\"We thought this was the package where the need was greatest,\" Defence Minister Andrew Little said in Wellington.\"When we looked at what is happening in Ukraine and the growing number of refugees, we wanted to support that activity.\"We will continue to review what support we give and that may well include future contributions for lethal support.\"The new measures include $NZ2 million ($A1.9 million) to both humanitarian needs and refugee support.There is also $NZ1.3 million ($A1.2 million) to the International Criminal Court \"to ensure legal accountability and justice for victims in Ukraine\".New Zealand has offered a special visa which allows Ukrainians to move to NZ, if they have family already there.To date, 1433 visas have been approved, with 649 arriving in New Zealand.New Zealand extended a deployment of 95 personnel to the UK to help train Ukrainian fighters, while deploying two further personnel to Poland on a similar mission, to June 2024.\"New Zealand has stood with the people of Ukraine as they have been subject to a brutal, unrelenting and illegal invasion by Russia,\" Mr Hipkins said.",
        "\"Today's package shows our resolve has not waned and our ongoing support for Ukraine and the international response has not diminished.\"The Kiel Institute has measured Australia's total contribution to Ukraine as $A739 million, compared with New Zealand's $A36 million (prior to Wednesday's announcement).The government says it has now invested $NZ78 million ($A73 million) worth of financial and military support to Ukraine, which Mr Little said included the cost of sending the soldiers and thousands of pieces of military equipment last year.Prior to the announcement, ACT party leader David Seymour called New Zealand's contribution to Ukraine's defence \"pathetic\", asking for a fresh announcement in the tens of millions.His party was left underwhelmed by Wednesday's pledge.\"This announcement simply isn't good enough. This is a desperate situation and Ukraine needs lethal aid as Ukrainians fight for their lives,\" defence spokesman James McDowall said.\"We're out of step with our traditional allies ... New Zealand can't afford to be the weakest link in the West.\""
    ]
}