{
    "articleURL": "/wires/ap/article-12042685/Galactic-gobble-Star-swallows-planet-one-big-gulp.html",
    "content": [
        "CAPE CANAVERAL, Fla. (AP) - For the first time, scientists have caught a star in the act of swallowing a planet - not just a nibble or bite, but one big gulp.",
        "Astronomers on Wednesday reported their observations of what appeared to be a gas giant around the size of Jupiter or bigger being eaten by its star. The sun-like star had been puffing up with old age for eons and finally got so big that it engulfed the close-orbiting planet.It´s a gloomy preview of what will happen to Earth when our sun morphs into a red giant and gobbles the four inner planets.\"If it´s any consolation, this will happen in about 5 billion years,\" said co-author Morgan MacLeod of the Harvard-Smithsonian Center for Astrophysics.This galactic feast happened between 10,000 and 15,000 years ago near the Aquila constellation when the star was around 10 billion years old. As the planet went down the stellar hatch, there was a swift hot outburst of light, followed by a long-lasting stream of dust shining brightly in cold infrared energy, the researchers said.While there had been previous signs of other stars nibbling at planets and their digestive aftermath, this was the first time the swallow itself was observed, according to the study appearing in the journal Nature.",
        "Massachusetts Institute of Technology researcher Kishalay De spotted the luminous outburst in 2020 while reviewing sky scans taken by the California Institute of Technology's Palomar Observatory. It took additional observations and data-crunching to unravel the mystery: Instead of a star gobbling up its companion star, this one had devoured its planet.",
        "Given a star´s lifetime of billions of years, the swallow itself was quite brief - occurring in essentially one fell swoop, said Caltech´s Mansi Kasliwal, who was part of the study.The findings are \"very plausible,\" said Carole Haswell, an astrophysicist at Britain's Open University, who had no role in the research. Haswell led a team in 2010 that used the Hubble Space Telescope to identify the star WASP-12 in the process of eating its planet.\"This is a different sort of eating. This star gobbled a whole planet in one gulp,\" Haswell said in an email. \"In contrast, WASP-12 b and the other hot Jupiters we have previously studied are being delicately licked and nibbled.\"Astronomers don´t know if more planets are circling this star at a safer distance. If so, De said they may have thousands of years before becoming the star´s second or third course.Now that they know what to look for, the researchers will be on the lookout for more cosmic gulps. They suspect thousands of planets around other stars will suffer the same fate as this one did and, eventually, so will our solar system.\"All that we see around us, all the stuff that we´ve built around us, this will all be gone in a flash,\" De said.",
        "___The Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute´s Science and Educational Media Group. The AP is solely responsible for all content."
    ]
}