{
    "articleURL": "/news/article-12048637/Weather-Sydney-Melbourne-Hobart-Adelaide.html",
    "content": [
        "Polar blast moving across Australia's southeast Freezing temperatures to hit east coast this weekendNSW, Victoria, Adelaide and Hobart set to freeze Australians have been told to brace for cold and wintry conditions all weekend as an icy blast delivers heavy winds, rain and freezing temperatures.  ",
        "A cold front is set to bring the first taste of winter to Victoria, NSW, South Australia and Tasmania at the weekend. A fresh blanket of snow had already been dumped across NSW's Snowy Mountains and the Victorian Alps on Friday morning. Residents of Victoria and Tasmania will be the first to feel the cold on Friday, as the front brings cool air and strong winds.",
        "Jenny Sturrock, from the Bureau of Meteorology, said the cold front would bring rain to Victoria, Adelaide and Tasmania on Friday. The system will then spread into NSW before moving into the Tasman Sea next week.The meteorologist said in the wake of the cold front, 'very cold air would be left behind, with minimum temperatures to plummet. Widespread frost is expected across NSW, Victoria, Tasmania and SA. Snow is expected below 600m in Tasmania and 800m in Victoria on Sunday, with snow to fall below 900m in the wake of the polar blast. The combination of the polar blast and cold air could see falls of more than 20cm in the Perisher Valley as temperatures in the mountains plummet.",
        "Forecasters say it will feel like July rather than May, with temperatures dropping to lows of -5 and highs around the freezing mark in the mountains. ",
        "Perisher reported 15cm of snow on Thursday, while Thredbo had 6cm, and Mount Hotham in the Victorian Alps recorded 2cm of snow. Footage from Perisher showed a mid-week snow storm at the popular ski resort with a thick layer of snow covering nearby peaks and runs. 'We could get used to this, bring it on winter,' the resort posted to its Facebook page on Thursday, alongside the series of wintry photos. ",
        "PERTHFriday: Partly cloudy. Max 24Saturday: Shower or two. Min 11 Max 20Sunday: Shower or two. Min 13 Max 24Monday: Shower or two. Min 15 Max 27ADELAIDE",
        "Friday: Rain developing. Max 18Saturday: Showers. Min 9 Max 15Sunday: Shower or two. Min 6 Max 16Monday: Shower or two. Min 8 Max 17MELBOURNEFriday: Showers easing. Min 12 Max 17Saturday: Cloudy. Min 9 Max 20Sunday: Sunny. Min 10 Max 23Monday: Shower or two. Min 12 Max 16HOBARTFriday: Rain easing. Min 12 Max 16Saturday: Partly cloudy. Min 8 Max 20Sunday: Late shower or two. Min 10  Max 23Monday: Showers easing. Min 12 Max 16CANBERRAFriday: Morning showers. Min 10 Max 16Saturday: Mostly sunny. Min 2 Max 19Sunday: Partly cloudy. Min 3 Max 20Monday: Partly cloudy. Min 5 Max 21SYDNEYFriday: Partly cloudy. Min 18 Max 26Saturday: Partly cloudy. Min 14 Max 22Sunday: Partly cloudy. Min 15 Max 23Monday: Possible shower. Min 14 Max 23BRISBANEFriday: Sunny. Min 16 Max 30Saturday: Partly cloudy. Min 18 Max 30Sunday: Partly cloudy. Min 18 Max 27Monday: Partly cloudy. Min 17 Max 27DARWINFriday: Showers, possible storm. Min 25 Max 32Saturday: Possible morning shower or storm. Min 25 Max 33Sunday: Sunny. Min 23 Max 33Monday: Sunny. Min 23 Max 33"
    ]
}