{
    "articleURL": "/tvshowbiz/article-12057651/Kevin-Costners-estranged-wife-Christine-Baumgartner-buys-balloons-son-Cayden-Montecito.html",
    "content": [
        "Kevin Costner's estranged wife Christine Baumgartner was seen buying balloons for her 16-year-old son Cayden's birthday in Montecito on Sunday.",
        "The 48-year-old handbag designer was also joined by her daughter Grace, aged 12, during the outing, and they both carried bouquets of balloons as they made their way through a parking lot.The media personality's supply run took place just days after she blindsided her estranged husband of nearly two decades, Kevin Costner, when she filed for divorce.Baumgartner wore a patterned blouse that was tucked into a pair of cropped white jeans while she picked up the balloons.The model accessorized with a pair of clear-framed sunglasses, and her gorgeous blonde hair cascaded onto her shoulders.",
        "The designer and Costner, 68, initially began their romance in 2000, when they started dating.The Yellowstone star was previously married to Cindy Silva from 1978 until 1994, and they share daughters Annie and Lily, 39 and 36, as well as a son named Joe, 35.He briefly dated Bridget Rooney following his first divorce, and they welcomed a son named Liam, 26, in 1996.The performer was subsequently linked to various individuals, including supermodel Elle Macpherson.Baumgartner and Costner eventually married in 2004, and they brought Cayden into their lives in 2007.The two welcomed another son named Hayes, 14, in 2009, and Grace was born the following year. It was revealed that the former had officially begun the process to end her marriage last week. ",
        "A representative for the Waterworld star spoke to People and confirmed the news about his union with Baumgartner.",
        "'It is with great sadness that circumstances beyond his control have transpired which have resulted in Mr. Costner having to participate in a dissolution of marriage action,' they said. The representative added: 'We ask that his, Christine's, and their children's privacy be respected as they navigate this difficult time.'It was later reported by TMZ that Costner was unaware that Baumgartner was planning on ending their marriage prior to the news becoming public.The star of The Postman was said to have been greatly distressed upon learning about the situation."
    ]
}