{
    "articleURL": "/wires/aap/article-12056153/Brutal-Cowboys-batter-Roosters-turnaround-NRL-win.html",
    "content": [
        "North Queensland have battered the Sydney Roosters in their best display of the year for a deserved 20-6 win with winger Murray Taulagi producing another stunning Magic Round play.",
        "The Cowboys had won just one of their past five matches heading into Sunday's game but defended like demons and took their chances in a stunning reversal of form after last week's 44-6 loss to Cronulla.It was their fourth win of the NRL season and one that could turn their campaign around.\"It was a tough week,\" a delighted Cowboys coach Todd Payten said.\"I challenged our players. I challenged our character, after last weekend, and said this next month is going to be character revealing. I liked what I saw every minute of every day at training, and it was the same in that contest.\"On the cusp of kick-off the heavens opened and delivered a downpour. So intense was the rain it knocked out the Roosters' communication systems and coach Trent Robinson moved from the stands to the sideline to direct his team in the first half.The Cowboys muscled up in the wet, chopped-up turf to score the first try to barnstorming lock Reuben Cotter after a delightful short pass from prop Coen Hess.Hess and Cotter were at their best in the opening half and showcased the grit and physicality for which their side was renowned last season on their way to the preliminary final.To a man, the Cowboys forwards took the Roosters pack on with gusto. Prop Jamayne Taunoa-Brown clipped Roosters warhorse Jared Waerea-Hargreaves around the chin and was put on report.",
        "Waerea-Hargreaves got up and said: \"Let me crack you G.\" He then turned to referee Ashley Klein and added: \"I'm happy to crack him bro.\"Taunoa-Brown nonchalantly grinned during a confrontation that highlighted the Cowboys' approach to the Roosters.North Queensland repelled the Roosters at the start of the second half and then struck. Second-rower Jack Gosiewski got his hand on a grubber by Chad Townsend for a 12-0 lead before Taulagi showcased the skill and strength that earned him a Queensland jersey in 2022.Fullback Scott Drinkwater put up a towering bomb and as it landed, Taulagi let the ball brush his thigh. He tiptoed down the sideline, regathered and threw an inside ball for Chad Townsend to score. The Cowboys never looked back.Taulagi threw what was tagged the \"pass of the century\" last year at Magic Round against Wests Tigers, when he was one metre over the sideline and in mid-air, for Drinkwater to score. Benji Marshall, of 2005 grand final flick pass fame, said it was better than his own stunning effort.Drinkwater and Cowboys halves Tom Dearden and Townsend kicked better than their opponents.The Roosters were disjointed in attack and rarely looked likely to score. Five-eighth Joey Manu was put on report for a high shot on Cotter.",
        "\"We were looking for some relief through them, rather than working for it,\" Roosters coach Robinson said.\"When you're relying on motivation to play this game you're in trouble.\""
    ]
}