{
    "articleURL": "/wires/pa/article-12053985/Archbishop-Canterbury-tells-Charles-crown-King-serve-sermon.html",
    "content": [
        "The Archbishop of Canterbury has told Charles “we crown a King to serve” during his coronation sermon.",
        "Mr Welby spoke of how “Jesus Christ was anointed not to be served, but to serve” – adding: “The weight of the task given you today, Your Majesties, is only bearable by the spirit of God.”The Archbishop also spoke of the King’s priorities as monarch, including “the way we nurture and encourage the young, in the conservation of the natural world.”In his short sermon, the archbishop said: “We are here to crown a King, and we crown a King to serve.“What is given today is for the gain of all.”",
        "Mr Welby continued: “The King of Kings, Jesus Christ, was anointed not to be served, but to serve.“He creates the unchangeable law that with the privilege of power comes the duty to serve.“We see active love in our care for the most vulnerable, the way we nurture and encourage the young, in the conservation of the natural world.“We have seen those priorities in the life of duty lived by our King.”The archbishop told the congregation King Charles’s “unity” was what “binds us together and offers societies that are strong, joyful, happy and glorious.”“They bear heavy weights for us,” Mr Welby said.",
        "He continued: “The weight of the task given you today, Your Majesties, is only bearable by the Spirit of God, who gives us the strength to give our lives to others.",
        "“With the anointing of the Holy Spirit, the King is given freely what no ruler can ever attain through will, or politics, or war, or tyranny: the Holy Spirit draws us to love in action.“Each of us is called by God to serve. Whatever that looks like in our own lives, each of us can choose God’s way today.“We can say to the King of Kings, God Himself, as does the King here today, ‘give grace that in thy service I may find perfect freedom’.“In that prayer there is promise beyond measure, joy beyond dreams, hope that endures.“By that prayer, for every King, every ruler, and, yes, for all of us, we are opened to the transforming love of God.”"
    ]
}