{
    "articleURL": "/wires/ap/article-12059653/Belarusian-jailed-satirical-drawing-dies-bars.html",
    "content": [
        "TALLINN, Estonia (AP) - A Belarusian man sentenced to jail over a satirical drawing of authoritarian President Alexander Lukashenko has died behind bars, the country´s leading rights organization reported on Monday.",
        "Mikalai Klimovicz, a 61-year-old blogger and activist from southern Belarus, died on Sunday while in prison in the northeastern city of Vitebsk, just two months into his sentence, the Viasna Human Rights Center said in a statement.Klimovicz in February was sentenced to one year in jail for drawing a caricature of Lukashenko and sharing it on social media. He suffered multiple bouts of heart disease during his trial.Belarusian authorities on Monday confirmed Klimovicz´s death, but did not clarify what caused it. The Viasna statement said that Klimovicz was registered as disabled due to his illness, a stroke and a complex heart operation that he had undergone, but was denied medication while in jail.\"Before the verdict, the blogger said that he could die behind bars, as he needs to take a large amount of strong medicines,\" the Viasna statement said.During his trial, Klimovicz told reporters that the real reason for his prosecution was his \"very firm\" support of Ukraine and opposition to Russia´s invasion of its neighbor, as well as to Lukashenko´s policies.Marija Pejcinovi´c Buri´c, Secretary General of the Council of Europe, tweeted that she \"deplored\" Klimovicz's death. \"My thoughts are with his family and friends,\" she added.Belarus was rocked by mass protests in 2020 following a presidential election that gave Lukashenko - in power since 1994 - a new term in office, but that was widely regarded by the opposition and Western countries as fraudulent. Authorities responded with a massive crackdown that saw over 35,000 people arrested, thousands beaten by police and dozens of NGOs and independent media being shut down.",
        "Opposition leader Sviatlana Tsikhanouskaya on Monday demanded an independent medical examination of Klimovicz´s body, and said that \"hundreds of political prisoners with serious health problems\" risked suffering a similar fate in Belarus.\"Relatives and lawyers should be immediately allowed to visit prisoners, the possibility to pass on medicines to prisons should be reinstated,\" Tsikhanouskaya said in a Telegram post, alleging that there was \"no treatment\" available in Belarusian jails.\"Not one more person should die,\" she added.According to Viasna, 1,498 political prisoners remain behind bars in Belarus, including the Nobel Peace Prize-winning pro-democracy activist Ales Bialiatski."
    ]
}