{
    "articleURL": "/wires/afp/article-12055831/Resourceful-Gazans-create-work-overcome-dire-prospects.html",
    "content": [
        "Seeking a path out of the Gaza Strip's grinding poverty, Islam Abu Taima combs market alleyways for scraps of cardboard, hoping to transform the castoffs into sellable toys.",
        "Poverty in the conflict-wracked Palestinian territory, a thin strip of land wedged between Israel, Egypt and the Mediterranean Sea, has hit a rate of 53 percent, according to the Palestinian Central Bureau of Statistics.Work opportunities are scarce in Gaza, which has been under a crippling Israeli-led blockade since the Islamist movement Hamas took power in 2007, and Abu Taima, an English literature graduate, has struggled to find a job.",
        "She lives with her husband Mohammed, who is also unemployed, in Al-Shati refugee camp where they began making toys for their five children because \"the children keep asking\" for them.Abu Taima's husband \"started making bicycles and a small car for them to play with\".\"They were happy and we found them lovely,\" said the 39-year-old, whose home lacks running water or electricity.She now sells their creations for five to 10 shekels ($1.40 to $2.80) a piece on pavements in central Gaza's more affluent areas.Abu Taima and her husband also use their creative skills to make models and toys that would otherwise be unattainable to their family.\"My husband thought of making old planes and convertibles like the ones famous people drive. It helps him come out of his depression,\" she said.",
        "For Abu Taima, scouring Gaza's markets for cardboard can be tough.",
        "\"I find it difficult when I walk on the street because people look at me with confusion and ask: 'Why do you collect cardboard?' I can't answer everyone,\" she said.The couple makes one or two toys a day, but even if they sell all their wares the profit falls short of the 450 shekels needed to pay their monthly rent.\"The goal is to help my family live, and make my living on a daily basis, as simple as it is.\"With the unemployment rate hitting 45 percent, according to the International Monetary Fund, many more Gazans are finding alternative ways to make a living.- Soap start-up -In Deir al-Balah in central Gaza, Alaa and Salama Badwan have transformed their rooftop into a small plant nursery.\"We use the roof because we lack space,\" said Salama, 40, between red and green-painted tyres serving as pots.",
        "Alaa collects the sap from aloe vera plants, which Salama then uses to make soaps in a makeshift home workshop.So far, they have yet to cover the start-up costs of the nascent project.Alaa, 37, came up with the idea while researching natural cosmetics online, which have become fashionable in the coastal enclave.They sell their produce to local pharmacies and have ambitions for it to become as popular as the famed olive oil soap from Nablus, a city in the occupied West Bank.",
        "\"The situation is difficult but people's attitudes are positive,\" said Alaa.After returning to Gaza to help her family, 25-year-old graduate Amani Shaath failed to find work.According to Palestinian figures, the unemployment rate for young graduates has hit a staggering 73.9 percent.",
        "Shaath had worked for four years in fast-food outlets in Turkey, and in February took matters into her own hands by opening a kiosk on Gaza's seafront, selling hamburgers for 15 shekels each at the popular recreational spot.Beachside food outlets have multiplied in recent years, but few are staffed by women.\"The first day, people looked at me with astonishment. That shocked me and I was scared that the project would fail,\" Shaath said.\"Then people started to come and they encouraged me, especially because I'm a girl.\""
    ]
}