{
    "articleURL": "/news/article-12059857/Salman-Rushdie-spotted-art-gallery-New-York-City.html",
    "content": [
        "Salman Rushdie seemed in good spirits at the star-studded event this weekend It's one of the first times he's been seen in public since the ordeal on August 12 Salman Rushdie has been spotted rubbing shoulders with Anna Wintour at an art gallery in Manhattan - just nine months after being stabbed 15 times while onstage in upstate New York.",
        "The author, 75, was seen on Saturday standing next to a framed photograph of himself at an exhibition at the Gagosian Gallery in Manhattan, which was devoted to Richard Avedon's centenary.Rushdie, with one of his glasses blacked-out after his stabbing last August, posed in front of the print he loaned to the show which read: 'Yours in the struggle.' The print was signed by photographer Avedon in 1994. Rushdie had to undergo emergency surgery after suffering stab wounds to the neck and stomach, puncture wounds to his right eye and chest and a laceration on his right thigh. Hadi Matar, 24, has pleaded not guilty to trying to murder him.But Rushdie seemed in good spirits at the star-studded event last weekend. It is one of the first time he's been spotted in public since the traumatic ordeal on August 12.",
        "Anna Wintour was also in attendance at the opening night on West 21st Street, alongside Gigi Hadid, Karlie Kloss, Sofia Coppola and Patti Smith. Anne Hathaway, Naomi Campbell and Jared Leto all joined in the fun - since many celebrities were still in NYC following the Met Gala on Monday night. Derek Blasberg, who is a senior staffer for the gallery, wrote : 'Last night, we opened an exhibition devoted to Richard Avedon's centenary. ",
        "'Lauren Hutton came in the same cap she wore when he shot her for Vogue in 1973. 'Salman Rushdie stood in front of a print he loaned to the show, signed by Avedon in 1994, which reads, 'Yours in the struggle.' 'There was Patti Smith in front of her 1998 portrait and there was the groundbreaking model Pat Cleveland in front of a pic of her dancing in a Bill Blass dress from 1977. ",
        "'Precious Lee was educating folks on the civil rights leaders Avedon shot in the 60s and Sofia Coppola was explaining how he printed a 1974 mural of Marilyn Monroe using outtakes from a Bazaar shoot in 1957.'Avedon would have been turning 100 this year - but the photographer died in 2004.He shot Brooke Shield's infamous Calvin Klein jeans campaign when she was 15-years-old. And Avedon was the lead photographer at Vogue and photographed most of the covers from 1973 until Anna Wintour became editor-in-chief in 1988.Rushdie spent six weeks in the hospital and has since been recovering at home. He spoke out to promote his newest book, Victory City, in February, which he completed before the attack. In an interview with The New Yorker, he said was 'better' but was still suffering and needed constant checkups.",
        "Iran - which has long wanted Rushdie dead - denied having any involvement in the attack. Matar, in an interview with The New York Post last year, said he 'didn't like' the author.'I don’t like the person. I don’t think he’s a very good person, I don’t like him. I don’t like him very much.‘He’s someone who attacked Islam, he attacked their beliefs, the belief systems,' he said. He remains in the Chautauqua County Jail awaiting trial.",
        "Rushdie called the interview 'idiotic'.'I don’t know what I think of him, because I don’t know him. All I’ve seen is his idiotic interview in the New York Post.'Which only an idiot would do. I know that the trial is still a long way away. It might not happen until late next year. I guess I’ll find out some more about him then,' he said.While recovering at home, Rushdie has tried and failed to find a TV show that he likes, branding The White Lotus 'awful'.Rushdie has lost more than 40lbs since the attack, has scar tissue on the right side of his face and has a slight droop in his lower lip.'I’ve been better. But, considering what happened, I’m not so bad. As you can see, the big injuries are healed, essentially.",
        "'I have feeling in my thumb and index finger and in the bottom half of the palm. I’m doing a lot of hand therapy, and I’m told that I’m doing very well.'There have been nightmares—not exactly the incident, but just frightening.'Those seem to be diminishing. I’m fine. I’m able to get up and walk around. When I say I’m fine, I mean, there’s bits of my body that need constant checkups.'It was a colossal attack,' he said."
    ]
}