{
    "articleURL": "/sport/football/article-12038301/IAN-HERBERT-Amid-sound-fury-modern-football-joy-Saint-Greavsie-back.html",
    "content": [
        "It is great to see the return of compilation episodes of Saint and Greavsie showITV will screen six 'best bits' episodes this summer - it will brighten up the sport Mail Sport's Ian Herbert adds his thoughts on Graeme Souness and Lucy Ward The news came like a pocket of blue sky on a cloudy day. Amid the sound, fury and self-aggrandisement that increasingly consumes football, it has been announced that Saint and Greavsie is back.",
        "ITV will screen six compilation episodes of their best bits on ITV4 this summer, available as catch-up on ITVX.Judicious editing will doubtless be needed because not everyone will take Greavsie's discussion of Scottish goalkeepers, Hamilton Academical, referees or the Swedish Viking hat that he wore on the last episode in the way they were intended in the 1980s. There is more sensitivity now.But the iconic Aztec Gold theme tune, first used by ITV for the Mexico '86 World Cup, will strike up again and we will revisit one of the boldest, most progressive, and quite beautiful football programmes ever known. A show which, with no explanation to its six million viewers, Ian St John or Jimmy Greaves, ITV dropped like a stone in 1992.",
        "Its seven-year run spanned some of the toughest and most turbulent years in our football history, yet covered the game with the lightest touch, because its presenters did not take themselves too seriously.The programme sweated every second of its 30-minute transmission, initially from noon and later a touch after 1pm on Saturdays. With no live televised football, it created the game's running, weekly narrative.It was a rich journalistic proving ground for talented contributors such as Clive Tyldesley, Martin Tyler, Alan Parry and Jim Rosenthal, while St John and Greaves's lack of pretention drew in many new fans. They were proud to say that many women told them it was their route to discovering the game.",
        "St John was, of course, the straight man, his shoulders rocking with laughter as his friend cracked off the one-liners, though he also produced some wonderful moments. Amid the self-importance of today's game, the idea of St John, a Liverpool legend, arriving at Everton to train with the players before their FA Cup final against Watford would be unimaginable.But there he was, rapping on the imposing Bellefield wooden gates ('Everton FC: Beware of the Dog') one morning in May 1984, boots under his arm.'I'll let you in if you behave yourself,' said Tom, on the gate, in a hilariously staged exchange, before scenes in which Everton's players refused to pass to St John and Gary Stevens took blistering shots at him in goal.St John eventually removed a blue tracksuit top to reveal a Liverpool shirt and was chased, Benny Hill style, around the pitch by the players.",
        "It was one of the classic scenes, along with the Christmas episode six years later, when Greaves was ill and a junior member of the production team suggested his Spitting Image puppet as the stand-in. Commentator Peter Brackley did the voice. At no point in the show did St John allude to Greaves' absence. He kept it together. The production team, in stitches, did not.",
        "Greaves and his puppet later held a discussion, with Harry Enfield doing the voice, and it is hard to believe that Greaves did not initially feel he possessed the gifts to succeed.He turned down his first TV offer, from ATV, looking for someone to partner Gary Newbon on their Midlands Saturday show, Star Soccer, in 1980 and had to be talked into it by his wife Irene.Even Newbon, who first spotted Greaves' potential, was surprised by his prowess. 'Jimmy was a natural,' he tells me. 'And a wonderful reader of the game.' Greaves would drive up to Birmingham on a Friday, doing an evening football spot for ATV on arrival and sometimes dropping into the Tiswas studio the following morning to do a turn there before Star Soccer.'If they wanted to throw a custard pie at him or fill in doing something silly, he'd generally agree,' Greaves' son Danny tells me. 'For me as a kid, he was a great dad because he was such great fun. At Tottenham they will tell you that was one of the beautiful things about dad.'St John and Greaves learned they'd been ditched when a national newspaper ran the story. There was no letter from ITV. When Sky suggested they reprise the show, it was Greaves who said they should not. 'We're done,' he said. 'We've had our run.'",
        "It was the loss of fun in the game, more than the loss of the show, that saddened him. 'Certain people now saw the game that I loved as a very serious business,' he said.More so today than ever before, football has become a brutal land of chaos management, where Leeds install a new manager with only Manchester City, Newcastle, West Ham and Tottenham left to play.Saint and Greavsie went out in style. Their last episode, broadcast from Stockholm at the end of Euro '92, featured St John bungee-jumping.'I've had a chat with the boss of ITV Sport,' Greaves, in Viking headgear, told him. 'In the immortal words of Norman Tebbit…' The two of them duly stepped into a two-seater bike and pedalled away, singing 'This could be the last time'.The pair, who passed away within six months of each other in 2021, would be pleased to know their work is back in fashion. They were deemed expendable and should have been cherished far more. As this summer's shows will remind us, you don't know what you've got till it's gone.Lucy Ward top of her game Lucy Ward's role as co-commentator on BT Sports' coverage of Manchester City v Arsenal last week passed without comment, though her assignment to that game was testament to the first-class analyst that she has become.",
        "Her own path through football has not always been easy. We met six years ago after the lunatic Leeds United owner Massimo Cellino had dismissed her from the club's academy for no other reason than her being the partner of the club's head coach Neil Redfearn, whom he had taken against.",
        "Ward courageously challenged him at an employment tribunal, which delivered a damning indictment of the way she'd been treated. Being cross-examined in such a courtroom is a brutal experience, even when the case against you is tissue thin.Ward always knew the game inside out. Leeds stars including James Milner and Fabian Delph attest to the professionalism of her work as a welfare worker at the academy.Without ceremony, she has become, for me, the best of the new generation of football co-commentators, who more than justified her role at the biggest match of all last week.Souness the perfectionist It was an emotional departure from Sky Sports on Sunday for Graeme Souness. The uncompromising way he played football has contributed to his characterisation as the tough guy among the analysts. It's been my privilege to have worked with Souness for the past nine months, in the development of his weekly column on these pages, and what has struck me most about him is his meticulous attention to detail. ",
        "He will strive to re-work the remotest piece of phraseology if, in some way, he does not feel he is expressing himself precisely enough. The same perfectionism governed the way he played the game and he flourished because of it. He will be Sky's loss. Read him here every Saturday. Panini surpassing Pokemon - how beautiful The final stretch of this season's Panini collecting approaches for me and my grandson. The arrival of the Brighton crest in one of his packs on Saturday was greeted by whoops of joy.I, too, have progressed, though I now have four Shandon Baptistes, in case someone's lacking the Brentford midfielder. An old pleasure had become our new pleasure and Panini has even surpassed Pokemon for the boy. That feels like the most beautiful thing. "
    ]
}