{
    "articleURL": "/tvshowbiz/article-12040415/Comedian-Heather-McDonald-told-old-white-straight-hired-Hollywood.html",
    "content": [
        "Comedian Heather McDonald is one of the biggest names in podcasting, earning more than 200 million downloads of her pop culture show Juicy Scoop.",
        "Speaking to Daily Mail about her success, the former Chelsea Lately star, 52, recalled how she was told by her old management team she was 'too old' to be booked in Hollywood after Chelsea Handler's E! show ended in 2014.'I went to my agents and said, \"Why isn't anything happening after Chelsea Lately?\", and I had the podcast, and they literally said \"They're only looking for people who are up and comers, so you're a little too famous.\"'\"You're too old. You're white. And you're straight.\" And they were like, \"That's just not what anyone is looking for.\"'One agent urged her to build up Juicy Scoop until it was so successful that Hollywood could no longer turn her away, so that's what she did.",
        "The comedian admits she never intended to become a podcaster, and originally turned to the medium during a lull in her TV career after Chelsea Lately wrapped for good.'When all that dried up was when I went to my agents and said, \"Well, I guess it's time for a podcast.\" Nobody made money on it [at the time].'I just thought that it would give me something to do and that people would know I was in their town to do stand-up, because Chelsea was such a great promoter of us doing stand-up on her show, so I didn't have that anymore.'",
        "Despite her incredible success, Heather admits she still feels underrated as a female comic in the industry.'I feel like I was never a comedy darling,' she admitted. 'People like Sarah Silverman were in such a nook of all the creative men that wrote and produced shows, so she just knew all those people and was part of that alternative comedy scene. 'I just never felt like I was a Hollywood darling. And in defence of agents, people are lazy, and if they meet you and think you're funny but don't know how to market you, what are you?' she continued. Recalling conversations with her agents in the past, Heather said that they would tell her, '\"You're not this alternative liberal girl, you're not this Southern mother, you're not this sassy black woman, you're not this flamboyant gay guy, I don't know what to do with you.\"'",
        "Now Heather is on top of the comedy scene thanks to Juicy Scoop, which pulls in millions of downloads a month.Her podcast has even eclipsed the success of her old boss Chelsea Handler's iHeartRadio show Dear Chelsea, which often lags far behind Juicy Scoop on the charts. Despite nailing all her career goals, Heather says that motherhood is still her proudest accomplishment.'By the far the most important and greatest thing - I'll probably cry,' she said as she wiped away a tear.",
        "'It's being a mom, it's the most important thing to me. And I always tell my kids, my goal is just to have a happy family that lasts with me forever,' she gushed.'Some people are estranged from their kids as adults and that's really sad, because I'm like, this is the most important thing.'",
        "Heather is a parent to teenage sons Brandon and Drake, and stepdaughter Mackenzie. The comedian confessed that she's content with where her career is at the moment and isn't as eager for other opportunities like she was in the past.'I'm very happy. I'm not crazy egotistical ambitious. If [Juicy Scoop] could just... I would like it to get bigger, I think I deserve to be more well known. I want more people to know about my opinion whether I'm featured on TV or my podcast and I'd like more people to know about my standup and my comedy,' she said.'But at the same time I'm just so grateful for where everything is. If I could just keep doing what I'm doing, I'm thrilled.'Heather's preparing to hit the road for a series of tour dates kicking off on May 27th in Las Vegas with special guests Spencer Pratt, Chris Franjola, and Justin Martindale. She will then perform in San Diego on June 24 and Napa on July 22, followed by a string of dates in Los Angeles, New York, New Jersey and more from August onwards."
    ]
}