{
    "articleURL": "/wires/reuters/article-12052741/NCAA-rules-committee-taking-charge-offensive-foul-rule.html",
    "content": [
        "The NCAA Men's Basketball Rules Committee recommended a refinement to the block/charge call among multiple rules proposals on Friday.",
        "The committee's recommendations will be reviewed by the NCAA Playing Rules Oversight Panel on June 8 and, if ratified, would go into effect for the 2023-24 season.Currently, defenders must be in position to draw a charge before the offensive player goes airborne.The committee proposed that a defender already has to be in position to take a charge when the offensive player plants his foot to go airborne to attempt a shot. If the defender is set after the foot is planted, it's a blocking foul when contact occurs between the players.A secondary defender still would have to be outside the restricted-area arc to legally draw a charge.The proposed rule change was spurred by members' feedback that too many charges were being whistled in the block/charge scenario.\"Our goal is to try to reduce the number of charges that are called,\" said Rick Barnes, the committee chair and coach at Tennessee. \"We want to give more time to the offensive player to adjust to defensive player movement and reduce the hard collisions that are taking place.\"Among other rule changes proposed:--Officials would be able to review goaltending/basket interference calls during the next media timeout to ensure the calls were accurate, as long as the official calls it on the floor. If there is a foul on the shooter while the ball is in the air with a goaltend/basket interference, the review would be immediate to properly adjudicate the potential free throws.",
        "--Nonstudent bench personnel would be allowed to serve as peacekeepers when an altercation occurs.--Under two minutes, when a coach requests an out-of-bounds play be reviewed, that team would be charged a timeout if the original call is not overturned.--Any time the ball hits the rim and the offense retains possession in the front court, the shot clock would reset to 20 seconds.--A timeout would be able to be granted when a player has possession of the ball even though the player is airborne. An example would be a player grabbing a loose ball and calling timeout before landing out of bounds.--Players would be allowed to wear numbers 0-99. The NCAA has prohibited two-digit jersey numbers beginning with 6, 7, 8 and 9.--Field Level Media"
    ]
}