{
    "articleURL": "/tvshowbiz/article-12040605/Kesha-wears-white-crop-black-wrap-skirt-promoting-upcoming-fifth-album-NYC.html",
    "content": [
        "The 36-year-old singer wore a long-sleeved white crop top that was buttoned up to the collar with a long wrap-around black skirt.Kesha accessorized with black sunglasses and had her short blonde parted down the middle and straight down in loose wavesThe Die Young singer, whose full name is Kesha Rose Sebert, has been promoting her upcoming fifth studio album Gag Order due out on May 19Kesha kept it simple in a white crop top and black skirt on Tuesday while visiting the SiriusXM Studios in New York City while promoting her upcoming new album.",
        "The 36-year-old singer wore a long-sleeved white crop top that was buttoned up to the collar with a long wrap-around black skirt.The Tik Tok singer also was spotted covering up in a long black leather jacket.The Los Angeles native accessorized with sunglasses and had her short blonde parted down the middle and straight down in loose waves.Kesha accentuated her natural beauty with pink lipstick.",
        "The Die Young singer, whose full name is Kesha Rose Sebert, has been promoting her upcoming fifth studio album Gag Order.She released two singles titled Fine Line and Eat The Acid last week in support of her new album that drops on May 19.The LP's title comes amid her long-running legal battle with her ex-producer Dr. Luke, who sued her in 2014 when she accused him of physical, sexual, and emotional abuse.The trial after being delayed is scheduled to start in mid-July and last for a week.Speaking to Rolling Stone about the follow-up to 2020's High Road, she shared: 'I feel like I'm giving birth to the most intimate thing I've ever created.'The Woman singer - who bonded spiritually with the album's producer Rick Rubin - admits it was 'nerve-wracking' laying all of these 'uglier emotions' bare.She continued: 'I really dug into some of my uglier emotions and sides of myself that are less fun.",
        "'It's scary being vulnerable. The fact that I have compiled an entire record of these emotions, of anger, of insecurity, of anxiety, of grief, of pain, of regret, all of that is so nerve-racking — but it's also so healing.' ",
        "The star said she was thankful to the studio wizard for creating a 'safe space' for her to unload her feelings.She said: 'I wrote TiK ToK, and \"the party don't start 'til I walk in,\" so I almost felt like I was becoming a caricature of this toxic positivity.'We live in a culture where I feel like we always show our best side. But Rick Rubin created the most beautiful, safe space for me to really dive into these emotions.'The album was made after the star had a \"spiritual awakening\", which she thought was a mental breakdown. ",
        "She recalled: 'I had this really beautiful, scary, and intense spiritual awakening where it felt like I was talking to my highest self, or God, whatever word you want to say.'I fully thought I was having a mental breakdown. I called my therapist and my doctor. They all were like, \"Oh, you had a spiritual awakening. Yay! Good job'',' Kesha said.Her experience with a higher power and some advice from her songwriter mom Pebe Sebert inspired her to write Eat The Acid.",
        "Her parents told her: 'Do whatever you want in your life, but don't eat acid, because when you eat acid, you see things that you'll never be able to unsee.'"
    ]
}