{
    "articleURL": "/tvshowbiz/james-bond/article-12050817/Henry-Cavill-Aaron-Taylor-Johnson-choices-threatened-new-007-favourite-Paapa-Essiedu.html",
    "content": [
        "Aaron Taylor-Johnson and Henry Cavill have become the favourite choices for the next James Bond role - but a new entry looks to threatened them in the odds.",
        "It has been revealed that a new name has entered the ring as Emmy nominee Paapa Essiedu has been named by betting giant William Hill as number three contender. This year marks the 70th anniversary of Ian Fleming's James Bond  and fans are tingling as they wait for the next star to be revealed, with William Hill revealing the odds for the role and who is pipped against who.A spokesperson said: 'There's been more interesting movement in the betting for the Next James Bond actor, with Paapa Essiedu shaking up the market and emerging as one of the frontrunners for the role...'Essiedu wasn't even an option over the likes of Piers Morgan and David Beckham (both 1000/1) at the start of this week, but after entering the market at 8/1 on Wednesday, he is now the joint-third favourite at 3/1 to replace Daniel Craig...'That price puts him level with James Norton to be awarded the role, with Aaron Taylor-Johnson (11/8) and Henry Cavill (5/2) still leading the way.' ",
        "Although it's been a year and a half since Daniel Craig's last appearance as Bond in No Time To Die - producers are taking their time to make a choice as this role will entail one of the biggest reboot the franchise has seen.",
        "It has been claimed that Aaron, 32, had a secret audition and remains the most voted star for the role. According to Puck New, Aaron sat down with producer Barbara Broccoli and sources claim the meeting went 'very well'.In December it was reported that Aaron had shot scenes as the secret agent, filming the memorable 'gun barrel teaser footage' seen in the films over the years.A source told The Sun at the time: 'Aaron has impressed bosses so much that he has filmed one of the franchise's famous gun barrel teaser scenes, something all the actors do. That move takes him a step closer to signing a deal.'They added: 'Bosses at the brand were really impressed with his unique blend of acting intensity and his impressive back catalogue of action films.'",
        "However the source went on to say that nothing was officially confirmed and it's unclear what any next steps might be.Meanwhile other fans have been rooting for Henry, 40, to star as Bond - as he was previously considered and hope for a better outcome this time.According to the Mail On Sunday, boss Barbara has made it clear she wanted the next actor to portray the character for 15 years, meaning that the 30-year-old is the perfect age to step into the role. ",
        "The two British heartthrobs have been contending the win - but there's one new star that joined the odd race for the 007 franchise.Emmy nominee Paapa is said to to be the third most-voted choice for James Bond - as he threatens their lead.",
        "The I May Destroy You star is now 3-1 to be the next James Bond,  in joint third with James Norton, according to William Hill.Meanwhile, Henry is in second on 5-2 and Aaron remains at the top on 11-8. One of the reasons why Paapa has suddenly caught bookies' attention as the next Bond - could be that Broccoli and her team are keen to have an ethnic-minority star to play 007 so the franchise is reflective of modern society.In fact, Emily In Paris star Lucien Laviscount previously has won millions of fans as the next possible choice for the franchise.",
        "The claim eventually lost credibility as some executives were fearful his appearance on reality show Celebrity Big Brother in 2011 tarnished the chances of getting such a highbrow role.A source said: 'Lucien ticks all of the boxes. He is a super talented actor, is extremely handsome and in the past 18 months has won lots of new fans since he joined Emily In Paris.",
        "'Bond bosses are already saying how you can see him in the 007 tuxedo, how dapper and fitting to the role he will look.'But, there is a sticking point, and that is Big Brother. Lucien appeared on the show at a time when his acting career was not as high-profile as it is now, but he was very popular then and has a fan base now which stretches generations. That is a dream for Barbara who is very taken with him.'Meanwhile, it can also be revealed that despite Ms Broccoli saying no announcement on a new 007 film is imminent, stunt men and women are being tested at Pinewood Studios. A source there said: 'They want to be ready for when things start moving with the new Bond.'It follows reports It follows reports that Idris Elba walked away from 'years of talks' with movie bosses to become the next Bond, paving the way for a new 007.After Idris declined the role - William Hill subsequently placed Henry Cavill at the forefront with 5/2, Regé Jean-Page with odds of 4/1, followed by Tom Hardy and James Norton both with 6/1 and Chiwetel Ejiofor at 7/1. "
    ]
}