{
    "articleURL": "/wires/ap/article-12043757/Woods-caddie-moves-Cantlay-beginning-Wells-Fargo.html",
    "content": [
        "CHARLOTTE, N.C. (AP) - Tiger Woods won´t be at the Wells Fargo Championship, but his caddie will.",
        "Or, rather, his former caddie.Joe LaCava, who has been on the bag for Woods since 2011 and helped him win his fifth Masters in 2019, has accepted a full-time caddying role with Patrick Cantlay, the world´s fourth-ranked golfer. It's not clear whether it's an indication that Woods is done for the season after undergoing foot surgery last month.\"When I reached out to Joe, he said it was possible and it ended up working out and I´m really happy about it,\" Cantlay said.Justin Thomas, who is close friends with Woods, said he isn´t sure when the 15-time major champion will return to play competitive golf. But Thomas called LaCava one of the most loyal people he knows, adding that he has remained true to Woods while he battled through a series of injuries, including a broken leg following a car accident in 2021.\"I don´t know the details and don´t know how long it is or what´s going on, but I know that that´s something that would never ever, ever be done if Tiger would not OK that,\" Thomas said. \"That´s not the kind of guy Joe is, not the kind of guy Tiger is and same with Patrick. There definitely was some kind of conversation that went on there.\"",
        "Cantlay said he´s not spoken directly to Woods about the hire.Thomas said he understands why LaCava would want to get back to work, comparing his competitive nature to Phil Mickelson's longtime caddie Bones Mackay.\"I mean, they love to caddie and they love to win golf tournaments and they love being in that moment,\" Thomas said. \"I´m sure that weighed into his decision as well.\"LaCava told the PGA Tour that he wasn´t actively looking for a job.\"I missed it and I wanted to work more,\" LaCava told the tour. \"He knows me well enough, and I know him well enough, that we know it´s hopefully/probably going to work.\"The 31-year-old Cantlay has won eight times on the PGA Tour, including the 2021 FedEx Cup when he was named player of the year. He's still seeking his first major championship and the hope is LaCava's experience in big events will help get him over the hump.\"He´s just a steady hand on the steering wheel,\" Cantlay said. \"I know he´s been in every moment a caddie could be in and he´s just a good guy. So I´ve enjoyed the limited time that I´ve spent with him and feel confident that we´ll be a good team out there.\"If Woods were to return from injury this year, it's unclear whether LaCava would change course and rejoin him on the bag.",
        "Cantlay recently split with veteran caddie Matt Minister following the Zurich Classic in New Orleans after he and playing teammate Xander Schauffele finished tied for fourth.\"We accomplished a lot together and I´m really proud of all we accomplished,\" Cantlay said. \"He´s a great friend of mine and we had a lot of good finishes together and a lot of wins. So I´m incredibly grateful to him. Just needed a change.\"Cantlay added that longtime friend Fred Couples had great things to say about LaCava.Cantlay is listed at 13-1 odds to win this week at Quail Hollow Club, according to FanDuel Sportsbook, second only to three-time tournament winner Rory McIlroy at 7-1. This will be McIlroy's first event since missing the cut at the Masters.HOMA LOOKS TO DEFENDMax Homa is a two-time winner of the Wells Fargo Championship, although last year's victory came at the TPC Potomac at Avenel Farm. Quail Hollow Club did not host the event in 2022 because it had the Presidents Cup.However, Homa won his first PGA Tour event at Quail Hollow in 2019 and also played extremely well at the Presidents Cup with some clutch putts.\"I love this golf course,\" Homa said. \"The tournament is run really well, everything about this place is first class. I love coming to Charlotte. Charlotte´s probably my favorite city we go to outside of the California ones. The golf course is tremendous and it´s in really good shape, so I love coming here.\"",
        "MISSING THE TOP TWOThe Wells Fargo Championship is considered an elevated tournament, but will not include the world's top two golfers in Jon Rahm and Scottie Scheffler, as both used their one allotted opt out.That leaves McIlroy as the highest-ranked player in the field at No. 3.PRO-AM HIGHLIGHTA star-studded pro-am grouping that included Carolina Panthers owner David Tepper, North Carolina football coach Mack Brown and former Tar Heels and Kansas basketball coach Roy Williams was at 12 under 59 on Wednesday.Tepper sank a 15-foot putt on the closing hole for an \"eagle\" with his handicap factored in.___AP golf: https://apnews.com/hub/golf and https://twitter.com/AP_Sports"
    ]
}