{
    "articleURL": "/sport/football/article-12048827/Sergio-Aguero-investigated-instigating-violence-Twitch.html",
    "content": [
        "Sergio Aguero watched Independiente's clash with Racing Club last monthAguero hit out at the referee after he awarded Racing a penalty in the first halfHe is reportedly being investigated for his alleged remarks towards the referee Former Manchester City striker Sergio Aguero is reportedly under investigation in Argentina for allegedly instigating violence against a referee following his angry reaction to a penalty call in Independiente's match with Racing Club last month.",
        "The derby clash took place on April 16, and Racing were awarded a controversial first-half spot-kick which left Aguero, who started his career at Independiente, furious.Responding to the decision on Twitch, Aguero is alleged to have said: 'How can he, the referee, what the f**k is his name… Yael Falcon Perez.'Listen to me, Yael Falcon, that name is a disaster. You can say [the penalty], 'it starts outside and ends up inside'.'But he goes on to say 'where the first contact is made is where the foul is called'. The truth is that he's ready to kick the s**t out of this fathead.'",
        "The 34-year-old is now being probed by the Agency for the Prevention of Violence in Sport following his alleged remarks, according to AS.'Comments made by the former soccer player, internationally recognised as a supporter of Independiente, Sergio Leonel Aguero, have come out in the media, in relation to the work carried out by the referee Yael Falcon Perez in the match in question, in which there was a disputed play that led to a penalty in favour of the visiting club,' said the agency head Eduardo Aparicio.'It is necessary to mention that his comments towards the referring authority – aggressive and demeaning – clearly contravene the current regulations on sports safety, and could be interpreted as instigating violence.",
        "'[There have been] threats received by referee Yael Falcon Perez and his family, [and] flares launched at his mother's home.'It is not the first time Aguero has caused controversy with his comments on Twitch.The former striker, who retired from football due to a heart condition in 2021, was labelled a 'son of a b****' by an Argentine journalist after discussing the dollarisation of his nation's economy online.He also hit out at Zlatan Ibrahimovic earlier this year after the Swedish forward claimed Argentina would fail to win any more World Cups following their triumph in Qatar last year.Aguero and his representatives are yet to publicly respond to the allegations. "
    ]
}