{
    "articleURL": "/news/article-12052507/Twitter-suspends-Jeremy-Vine-breaking-hateful-content-rules.html",
    "content": [
        "His account was locked after a row with an anti-cycling group leaderConcern is growing among BBC bosses over Vine’s anti-motorist tweetingREAD MORE: Pedestrian says cycling BBC star was endangered himThe Radio 2 host Jeremy Vine was suspended from Twitter for breaking its ‘hateful content’ rule by naming a woman campaigning against a cycle lane.",
        "The cycling enthusiast’s account was locked after he was reported over the row with the woman who runs an anti-cycling group in Chiswick, west London, where he lives.It was part of his crusade to keep what has been described as a ‘dangerous’ cycling lane on a main road in the neighbourhood.The Mail can also reveal that concern is growing among BBC bosses over Vine’s regular anti-motorist tweeting. Some fear he could be at risk of breaking the corporation’s impartiality regulations.One source compared his social media activity to that of Match of the Day host Gary Lineker, who earlier this year was taken off air for saying the Government’s Rwanda refugee policy ‘reminds us of the debate in Germany in the 1930s’.",
        "A BBC insider said: ‘[Vine] hasn’t been reined in but it is becoming an issue and has certainly been noted by some of the executives. The view is very much “watch this space.”’Last week Vine, 57, who earns £240,000-£294,999 for his Radio 2 lunchtime shows, was locked out of Twitter where he has 788,000 followers. The social media giant said: ‘We locked @thejeremyvine’s account for breaking our hateful content rule. We found they broke our hateful content rule through different reports we received about their behaviour.’",
        "It came after Vine accused a woman who runs a group called One Chiswick of allowing abuse to take place on her social media.The group has campaigned for the redesign or removal of what it says is a ‘dangerous’ cycle lane along Chiswick High Road that Vine uses.Under Twitter’s terms of service, offending tweets have to be taken down for accounts to be unlocked.The Mail searched Vine’s Twitter timeline for the message at the centre of the row but could not find it.The presenter said yesterday: ‘So far as I know my account was not locked down; all my tweets comply with Twitter’s rules; none of them has been removed. The whole thing is a bit of a mystery.’A BBC spokesman said: ‘Jeremy is aware of his duty under the BBC’s social media guidelines.’• This article has been amended since it was originally published to correct the name of Jeremy Vine’s Twitter account."
    ]
}