{
    "articleURL": "/wires/reuters/article-12046371/ConocoPhillips-beats-quarter-profit-high-fuel-demand-tight-supplies.html",
    "content": [
        "By Arunima Kumar",
        "May 4 (Reuters) - ConocoPhillips on Thursday raised its full-year production outlook as higher oil output helps the U.S. shale producer mitigate the impact of lower prices, sending its shares up more than 2% in morning trade.Conoco also joined larger rivals Exxon Mobil Corp and Chevron Crop in posting upbeat first-quarter results.Benchmark Brent crude averaged $81.24 a barrel in the first three months of 2023, nearly 20% lower from last year but still well above levels that allow oil and gas producers to drill profitably.Crude prices had surged to multi-year highs in 2022 after Russia's invasion of Ukraine upended global energy markets.The largest U.S. independent oil company raised the midpoint of its annual production forecast range by 10,000 barrels of oil equivalent per day (boepd). Production in 2023 is now expected to be 1.78 million to 1.80 million boepd.The company's first-quarter production hit a record 1.79 million boepd, an increase of 45,000 boepd from the same period a year earlier.Higher output helped the company make up for a 21% fall in its total average realized price of $60.86 per barrel of oil equivalent (boe) in the January-March quarter.Scotiabank analyst Paul Cheng said the results will have a positive impact on the near-term share performance of the company.",
        "For the current quarter, production is expected to be 1.77 million to 1.81 million boepd.The company repurchased $1.7 billion of shares and paid $1.5 billion in ordinary dividends and VROC (variable return of cash) in the first-quarter.Excluding items, ConocoPhillips reported a profit of $2.38 per share, for the three months ended March 31, compared with analysts' average estimate of $2.10 per share, according to Refinitiv data. (Reporting by Arunima Kumar in Bengaluru Editing by Vinay Dwivedi)"
    ]
}