{
    "articleURL": "/wires/aap/article-12048507/Bennetts-12-commandments-key-900-games-top.html",
    "content": [
        "They are 'the 12 commandments' that have proved just as relevant from the infancy of Wayne Bennett's coaching career through to his impending 900th game.",
        "When Brisbane Broncos legend Steve Renouf was rummaging through his memorabilia recently the bottom of a box broke open and out fell a laminated sheet of paper with the heading The Broncos Creed, followed by 12 instructions for players to observe.The 'commandments' were given to the Broncos players by Bennett at the start of the 1989 pre-season, after they had been to a training camp and had a say on what kind of club they wanted the new franchise to be.\"We had input but in the end it was Wayne's own document,\" Renouf told AAP.\"We used to joke as players that we were his disciples and Wayne was Jesus, the saviour.\"The Broncos Creed was his 12 commandments to us. You could say he was leading us to the promised land like Moses ... which he ultimately did in 1992.\"If you look at the instructions he gave us, they are just as relevant now as they were back then.\"That's why Wayne is still relevant and why he is about to coach his 900th premiership game, against Cronulla (on Saturday).\"Renouf said teams that had observed the commandments under Bennett had been successful.They highlight personal responsibility, self-improvement, playing mistake-free football with intelligence, respect for officials and the coach's directions, and never giving up.",
        "The Broncos Creed was as follows:1.Come to each game mentally and physically prepared for a 'best on the ground' performance. Self-motivation is always the best. You are responsible for your own performance.2.Do not carry on with any falsehoods or bull***t in the rooms before a game. Just think about your game and the contribution you are about to make. If you don't mean it don't say it. Don't be a lair.3.Commit yourself to the coach's game plan and objectives. One plan is better than 13.4.Minimise mistakes in your 30-metre zone.5.Get 'your' defence right. Communication - Desperation.6. Control the play. Don't push the play. Be ready to take the opportunity when it comes.7.Work for good field position. Good chasing game. Minimum errors in attack and defence.8.Play to the referee's instructions.9.Bring your brains to the game and play with them. Smart, committed players will always beat dumb, committed players.10.Build your game each week. If a mistake is made or you can't get into the game, go back to doing the basics as perfectly as possible and don't compound problems by trying to do something spectacular.11.Play the game in blocks of six tackles. When we have the ball, and when they have the ball. Forget about the past and don't plan for the future. Focus on the present six.",
        "12.Compete on every play - be mentally tough for 80 minutes. Don't give in to your feelings. If you don't give up anything can happen.Renouf said the creed had a key essence.\"They are simple statements,\" the four-time premiership winner said.\"Wayne's success has been built on keeping rugby league simple but he also enforced it with us.\"One that sticks out to me is No.10, about building your game each week.\"I would make a mistake and think I had to set up a try or score one to redeem myself.\"Wayne would simplify it and give me three things to work on. Defence was always one, but leg speed was a big one.\"Renouf scored a club record 155 tries in his career and many of them came after he kept his legs pumping after being buffeted by defenders.Commandment No.12 came to the fore when the Dolphins came back from a 26-0 deficit recently to beat the Titans 28-26.\"The Dolphins refused to give up, and like Wayne says ... anything can happen,\" Renouf said.Renouf's length-of-the-field try in the 1992 grand final was another classic example.\"Nothing would have happened if Willie Carne hadn't put in the extra effort to get out of our in-goal. He competed on the play,\" Renouf said.",
        "\"We all went, 'Wow'. Then we set ourselves to go the length of the field. It was a play Wayne had told us outside backs to get ready for.\"Bennett recently said one reason he had recruited former Melbourne forward Kenny Bromwich to the Dolphins was because \"what he says he means. He doesn't talk a lot of rubbish and that is always good in a footy team\".Renouf said nothing had changed from the initial commandment No.3.\"It says 'don't be a lair'. Wayne has never liked lairs, except for Wendell (Sailor) but he made sure Wendell backed it up on the field... and Wayne was patient with him,\" Renouf grinned.\"The creed Wayne gave us in 1989 was the building block for all the Broncos success that followed. Everyone I played with would back that up.\""
    ]
}