{
    "articleURL": "/femail/article-12056421/People-discuss-unpopular-opinions-including-nude-leggings-BANNED.html",
    "content": [
        "A woman sparked a discussion on Mumsnet about people's 'unpopular opinions'READ MORE: Mothers reveal 'crazy' moments from their own childhoods Cups of tea, David Attenborough and scones with jam and cream may be cornerstones of the nation to some people, but to others they're just plain overrated. ",
        "Taking to the British parenting platform Mumsnet, a woman started off the debate saying she thinks 'playsuits shouldn't be worn over the age of four'.Asking for other people opinions she requested 'non offensive and very silly unpopular opinions.'Many rushed to the comments with their own opinions which varied from chocolate being 'overrated' to a woman who claimed that David Attenborough has turned into a 'right misery'. Some people took aim at popular treats, with one claiming that nobody genuinely likes ready salted crisps, while another took aim at scones. ",
        "One person wrote: 'Custard should be banned' while another quipped: 'Cake is a bit meh.'Another agreed saying: 'Custard should be banished.'  A fourth said: 'Chocolate is overrated and tastes pretty yuck.'Meanwhile others took aim at the theatre saying it is 'boring'. One person wrote: 'Musicals make my toes curl with cringing embarrassment.'Can't stand Abba… don't get the sodding fuss, just wish they'd clear off. Karaoke should be illegal.'Another said: 'The theatre is boring and uncomfortable.'Some took aim at gender reveal parties, while others gave some parenting advice.  ",
        "One person wrote: 'Anyone who has a gender reveal should have their child confiscated at birth.'Someone else agreed: 'No one gives a s*** about your gender reveal. Seriously. You have a 50/50 chance of one or the other.' ",
        "Another shared a number of unpopular opinions, saying: 'People can cough it's not always contagious.'My cat grooming is bloody annoying, he sounds like someone sucking up the dregs of a milkshake through a straw.'And my separated parents one is! If you routinely reject and ignore your children they will eventually reject and ignore you it's not parental alienation you kid just treats YOU how YOU TREAT THEM. Also the word 'moist' should be banned.'",
        "However there were some other bizarre unpopular opinions, including loving inside of a dogs ear and flags.One person wrote: 'Wet dogs inner ears smell heavenly.' Another said: 'Lemsip only works when someone else makes it for you.'While another said: 'Not nearly enough people appreciate how cool flags are.' "
    ]
}