{
    "articleURL": "/sport/boxing/article-12055749/Saul-Canelo-Alvarez-beats-John-Ryder-dominant-display-Mexico.html",
    "content": [
        "Ryder lost a unanimous decision but impressed with his gritty performanceAlvarez called out Dmitry Bivol after, saying he wants a rematch at 175 pounds DailyMail.com provides all the latest international sports newsJohn Ryder arrived in this land of prize fighters a virtual unknown but he will hold for years a place in the minds and hearts of Mexico's legion of ring fanatics for his astonishing valiance in defeat by one of their greatest ever boxers.",
        "With only his family, his team and half a dozen supporters willing to finance the 5,000 mile journey of hope over reality, the self-proclaimed Gorilla from Islington lasted the championship distance of his near-suicidal mission against Saul Canelo Alvarez.He came through blood, sweat and pain to somehow deny the undisputed world super-middleweight the statement knock-out with which he intended to proclaim his comeback from one embarrassing defeat in a year of injury and setback.But no tears. Ryder is too much of a man for that, too proud a boxer, too brave for his own good.The momentous victory with which he hoped to claim one of the most remarkable away triumphs in the history of British boxing, if not the most wonderful, was beyond him. He goes home instead as one of the most heroic losers in the world's hardest game.",
        "He rose from one sickening knock down, grasped at the straw of a referee deciding another was a slip, and in one surreal sequence like something out of a Rocky movie he simply refused to hit the canvas as Alvarez sent him reeling all around the ring with thunderous blow after blow.Some of us at ringside were calling for his corner to the throw in the towel at that point but they knew their man better than we did.",
        "This was the night, the fight, of his life. The defining moment of an honest career. A pinnacle to be seen through to the end. Heaven's know how. With his nose broken to smithereens. His face so bloodied and scarred that it would not have been out of place on a butcher's counter.Canelo led the salute to a hero. Not least that he know this opponent from nowhere had given him, if not a moment of glory, this chance to proved that he still has stamina for the long haul. The power to do irreparable damage – as he did with the body shots which drained much of the strength but not the will from Ryder.In short, his mojo. Many a superior boxer would have succumbed. But will the next men up have the heart to persist. A question he will ask more urgently of Dmitry Bivol the second time around this September.And far from being disappointed by the lack of knockout, the crowed saluted both men.",
        "(Canelo scores first)1) 10-92) 10-93) 10-94) 10-105) 10-86) 9-107) 10-98) 10-99) 10-910) 10-911) 10-1012) 9-10",
        "Canelo brought boxing home to the high plains of Guadalajara riding a dust-storm of Mexican patriotism on the Cinco de Mayo weekend of national celebration of a famous battle during their war of independence two centuries ago.",
        "The air of this city which gave birth to Mariachi music and this oddly red-haired warrior who has presided over boxing for nigh-on a decade was almost too thick to breathe during the day, until a stiff breeze blew up to clear the atmosphere.The pollution, that is. Not the feverish anticipation within the futuristic new stadium sitting like a space-ship atop a green hill jutting out of a barren landscape on the edge of town.Alvarez had been so mobbed wherever he went in the preceding 48 hours that streets in the historic downtown were frequently closed to traffic of both the motorized and pedestrian variety as his cavalcade of limos wound its way from mass media conferences, the weigh in which involved 3,000 squealing school-kids and his hotel.An idol is as idol does and this one made frequent fan stops to meet and greet the masses. They adore him.Ryder steered clear of as much of the adulation as he could, maintaining an almost karma like serenity as he fulfilled his promotional obligations.Not that Alvarez was agitated in the slightest. Certainly not in the dressing room where he slowly tied his own bootlaces, then sat ear to ear with his beloved white-haired grandmother to receive the Catholic blessing she bestows upon him before any of his fights she attends.",
        "Then came the first clinch of the night, with his beautiful wife, followed by kisses from his adorable children.Boxing for Saul Alvarez is a family affair. With him as the bread-winner, to the tune of another eight-figure purse to add to career earnings in excess of 500 million dollars.How long that career will continue apparently depended on happened in the Estadio Akron this Saturday night.When Ryder was chosen for him as a warm-up opponent before a September rematch the Russian Dmitry Bivol ,who shocked him a year ago, Canelo said he would quit if he lost even though the north Londoner was the mandatory challenger for one of his array of championship belts.Not a single Mexican feared that might happen. Certainly none of the 60,000 in attendance as the local temperature dropped from 91 Fahrenheit in late afternoon to 81 in mid-evening, only to be edged up a couple of degrees by the compressed frenzy of the crowd.The Mexican wave was rehearsed several times before a huge surge greeted their hero's entrance",
        "Barely a handful of English travelers were here to sing God Save The King on this, of all days. Ryder was bombarded with jeers. And kept waiting as videos of Canelo's life, his knock-outs and scenes of his home state of Jalisco also preceded the champion as he came into the ring, wearing a crown of gold. Then duly won a first round featuring a collection of his favorite body shots. As he did the second.",
        "Ryder got to work in the third, notably at close quarters with a couple of uppercuts but still ended the round with blood pouring from a possibly broken nose.Alvarez went for that wounded noses with vengeful straight rights, while also working the body. As Ryder's hands came down to protect his ribs, Alvarez dropped like a sack against the ropes with a brutal right cross. To his enormous credit Ryder not only got up but fought back.Even more impressively, the challenger raised his punch rate in the sixth to win his first round on my card, despite almost being dropped again.",
        "Ryder's was a mask of blood-reddened pain but he still kept throwing punches, no matter how many big hits he was taking.Down went Ryder again but although it was clearly a wicked blow which did the damage the referee appeared to rule it a trip.What a round and what man in the ninth. Ryder was reeling all over the ring as Canelo went for the kill but somehow stayed drunkenly on his feet. Survived the tenth. Then re-emerged for the eleventh battling his way to a potential share of those spoils. And won a do-or-die last.A hero in defeat. And applauded as such by the champion at the end."
    ]
}