{
    "articleURL": "/wires/reuters/article-12049317/MLB-roundup-Orioles-score-13-series.html",
    "content": [
        "The Baltimore Orioles took the rubber game from the host Kansas City Royals 13-10 on Thursday afternoon to collect their seventh straight series victory.",
        "After mounting an 8-1 advantage in the third, the Orioles surrendered the lead on eight straight Royals runs. Baltimore's Ramon Urias, who came on as a pinch hitter, made the most of his two at-bats, driving in four runs on hits in the eighth and ninth.Anthony Santander and Gunnar Henderson hit two-run home runs and Cedric Mullins added a bases-clearing double in Baltimore's attack. Yennier Cano (1-0) earned the win with two innings of scoreless relief.The Royals rallied against Orioles rookie starter Grayson Rodriguez as Freddy Fermin hit his first career homer and Salvador Perez added a two-run shot. In the fourth, Kyle Isbel connected for his first homer, knocking Rodriguez out after 3 2/3 innings. The Royals grabbed a 9-8 lead in the seventh as Isbel tied the game on a bunt single and Bobby Witt followed with his third hit, an RBI single.Braves 6, Marlins 3Marcell Ozuna homered for the third time in two games against his former team as Atlanta completed a three-game sweep of host Miami.Braves star Ronald Acuna Jr. left the game in the seventh inning due to an apparent sore knee. He fouled a ball off his left knee in the sixth and finished the inning. Jorge Soler, a former Brave, belted a two-run homer for the Marlins.",
        "Braves left-hander Dylan Dodd (2-1), who had a 7.71 ERA entering Thursday, gave Atlanta a quality start by allowing eight hits, three walks and three runs in six innings. Dodd filled in for Max Fried, who was moved one day back in the rotation. Marlins left-hander Jesus Luzardo (2-2) allowed seven hits, three walks and four runs (three earned). He struck out five.Nationals 4, Cubs 3Alex Call led off the bottom of the ninth inning with a home run on the first pitch to give Washington a walk-off victory against visiting Chicago in the finale of a four-game series.It was a dramatic ending after a splendid pitching performance from Washington starter Patrick Corbin nearly went for naught. Call hit the only pitch thrown by Brad Boxberger (0-1).Lane Thomas hit a three-run home in the second inning for the Nationals, who have their first three-game winning streak of the season by winning the final three games of the series.Angels 11, Cardinals 7Luis Rengifo drove in four runs on three hits, including a three-run homer, as Los Angeles outslugged host St. Louis to complete a three-game sweep.Matt Thaiss and Zach Neto each drove in two runs for the Angels, who won their fourth straight game and the seventh in their last nine. Rengifo also scored twice. Every Angels starting position player collected at least one hit as the team totaled 16.",
        "Tommy Edman hit a three-run homer, and Willson Contreras and Paul Goldschmidt drove in two runs each for the Cardinals, who lost their sixth straight game and ninth in 10 games.Tigers 2, Mets 0Eduardo Rodriguez outdueled Justin Verlander in the latter's New York season debut and host Detroit completed a three-game series sweep.Rodriguez (3-2) allowed just two singles and a walk while striking out nine in eight innings. The left-hander has allowed just two runs in his last five starts, spanning 34 2/3 innings. Riley Greene and Javier Baez hit back-to-back homers in the first inning, and that was all the support Rodriguez needed.Verlander (0-1) opened the season on the injured list with a teres major muscle strain. He signed a two-year contract with the Mets as a free agent this offseason. After the first inning, he settled in and wound up allowing five hits in five innings while recording five strikeouts.Rays 3, Pirates 2Zach Eflin threw seven shutout innings to help host Tampa Bay complete a three-game sweep of Pittsburgh. Eflin (4-0) allowed three hits, struck out 10, including seven looking, and didn't walk a batter.Taylor Walls, Randy Arozarena and Yandy Diaz provided all the run support with solo home runs for the Rays, who have won six of seven and held the Pirates to four runs in the series.",
        "Vince Velasquez (4-3) pitched three innings for Pittsburgh before departing with soreness in his throwing elbow. He allowed one run and two hits, striking out two and walking one. The Pirates have lost a season-high four in a row.Twins 7, White Sox 3 (12 innings)Nick Gordon had an RBI double and Jorge Polanco added a two-run single to highlight a five-run 12th inning and lead Minnesota over host Chicago.Byron Buxton and Carlos Correa each homered for the Twins, who snapped a two-game losing streak. Emilio Pagan (2-0) struck out two during a hitless inning of relief to pick up the win.Eloy Jimenez went 3-for-5 with a home run and three RBIs and Luis Robert Jr. and Hanser Alberto each doubled for Chicago, which had a three-game winning streak snapped and finished 1-for-16 with runners in scoring position.Red Sox 11, Blue Jays 5Masataka Yoshida went 3-for-5 with a first-inning home run, three RBIs and three runs while Rafael Devers also went deep to help Boston complete a four-game sweep of visiting Toronto.The Red Sox put up a series-high 16 hits -- delivering one more hit in each successive game of the series after 13 on Monday. Justin Turner, Devers and Jarren Duran added three apiece as the Nos. 2 through 5 spots in Boston's lineup went a combined 12-for-20 with nine RBIs. Devers hit his 150th career homer and American League-leading 11th this season to highlight the team's three-run eighth",
        "Bo Bichette, Vladimir Guerrero Jr. (double, home run, two RBIs) and Daulton Varsho had two hits apiece for the Blue Jays.Rockies 9, Brewers 6Kris Bryant, Charlie Blackmon and Mike Moustakas had two hits apiece, and Colorado beat Milwaukee in Denver to sweep the three-game series and win its fourth straight.Brad Hand (1-1) pitched the eighth to get the win for the Rockies, who rallied from down four runs with four runs in the seventh and five in the eighth.Christian Yelich homered among his three hits, and Rowdy Tellez and Tyrone Taylor also went deep for the Brewers. Brian Anderson had three hits and Victor Caratini and Jesse Winker had two hits apiece for Milwaukee.Mariners 5, Athletics 3Kolten Wong broke a tie with a two-run single, George Kirby overcame a shaky start to throw seven effective innings, and Seattle completed a three-game road sweep over Oakland.Taylor Trammell drove in three runs -- two on a third-inning home run -- for the Mariners, who trailed 1-0, then 3-2 before a decisive three-run fourth inning. George Kirby (3-2) allowed three runs and seven hits in his seven-inning start.JJ Bleday homered for Oakland and Esteury Ruiz smacked an RBI triple as the A's bullpen gave its team a shot with 5 1/3 innings of three-hit, no run relief. Bleday and Ramon Laureano had two hits apiece for the A's, who completed a 1-5 homestand.",
        "--Field Level Media"
    ]
}