{
    "articleURL": "/news/article-12039957/Madeleine-West-launches-appeal-hit-AVO-against-ex-Shannon-Bennetts-father.html",
    "content": [
        "West allegedly pushed Shannon Bennett's fatherShe was hit with apprehended violence orderShe has launched an appeal against decision Former Neighbours star Madeleine West has formally launched an appeal after an AVO was taken out against her to protect her ex father-in-law.",
        "West, 42 - who was married to celebrity chef Shannon Bennett, 47 - is accused of pushing Shannon's father Benny Clifton Bennett, 75, at his son's home last year.West has previously denied the allegation and fronted Byron Bay Local Court for two days last month in a bid to fight the apprehended violence order. Prosecutors alleged West pushed Mr Bennett and forced her way into her ex-husband's home on May 4, 2022. The court was shown CCTV of West and Mr Bennett at her ex-partner's home while the MasterChef star was in the US. Magistrate Stafford then ruled the two-year domestic violence order against West be upheld.The 42-year-old appealed the decision with the matter briefly mentioned in Coffs Harbour District Court, on the NSW north coast, on Wednesday morning.",
        "The actress did not appear and was represented by her lawyer Farshad Amirbeaggi, with the matter adjourned to June 7.During last month's court proceedings, prosecutors allege the incident between West and Mr Bennett left the 75-year-old 'in fear' of his ex-daughter-in-law.The actress vehemently denied the claims, telling a police prosecutor she 'didn't lay a hand' on Mr Bennett. The AVO means West is banned from approaching Mr Bennett and Shannon's Byron Bay home when his father is visiting. 'I am satisfied he fears if visiting his grandchildren he will be harassed by (Madeleine West),' Magistrate Stafford said last month.",
        "Magistrate Stafford found West had 'barged her way in' to Shannon's house while the chef was overseas and Mr Bennett was at home. ",
        "The encounter was caught on CCTV which Ms Stafford said showed West's 'demeanour is almost verging on being aggressive'.Shannon had revealed in May last year that the separation process between he and West had 'turned love toxic'.Shannon was with West for 13 years before they split in 2018. The couple share six children.West left Melbourne in 2020 and moved to Byron Bay to be near her children who live with Shannon in Byron Bay.The former soap star bought her own mansion in nearby Suffolk Park, paying $4.6million for a four-bedroom house with a heated pool, open plan-living, spacious sun-filled living areas and a stunning architectural design.",
        "Madeleine West is an actress and model who first came to prominence playing the characters Dee Bliss and then Andrea Somers on the TV hit series Neighbours, the first role in the early 2000s and the second between 2017 and 2020.During filming of Neighbours , West was hit by a bus and sustained head injuries which required her to relearn motor skills. An amateur performer as a child, West has also appeared in the TV series Underbelly and Fat Tony &amp; Co.West was once engaged to Shopping for Love co-host Peter Lazer, before moving on to restaurateur Shannon Bennett, who became best known for his appearances on MasterChef.The couple met in 2005 and had six children together before splitting in 2018, in which Bennett described as a case of love turned 'toxic'.West wrote a book about her experience of motherhood entitled Six Under Eight..Despite her split with Bennett, West relocated to Byron in 2020 and bought a $4.6m home to be nearer her children, who live with the chef at his waterfront Byron estate. In 2022 West announced she might run in the 2023 NSW election as an independent for the seat of Ballina, but she did not nominate.In January 2023, West revealed that she had been sexually abused as a child and the trauma she had gone through had resulted on her suffering from anorexia. "
    ]
}