{
    "articleURL": "/tvshowbiz/article-12057833/Sofia-Vergara-dons-Dolce-Gabbana-dress-date-night-hubbie-Joe-Manganiello-Beverly-Hills.html",
    "content": [
        "Four-time Emmy nominee Sofía Vergara and her second husband Joe Manganiello enjoyed a romantic evening together at The Hideaway in Beverly Hills on Saturday.",
        "The Colombian 50-year-old - who boasts 52.8M social media followers - captioned a selfie with her 46-year-old Italian stallion: 'Date night!'Sofía and Joe - who began dating in 2014 - never had children, but they've been happily married for over seven years.Vergara and Manganiello indulged themselves by ordering the $16 churros plate featuring chocolate mousse, strawberry, and prickly pear dipping sauces.The VIA Riyadh brand ambassador - who relies on stylist Rhonda Spies - flaunted her youthful, taut 5ft7in figure in a white-lace Dolce &amp; Gabbana pencil dress, a beige clutch, and matching platform peep-toe heels.",
        "Sofía will next appear in this Thursday's episode of the Los Angeles-set 18th season of ProSieben competition Germany's Next Topmodel, which is hosted/judged by her fellow America's Got Talent judge Heidi Klum.Vergara and the German 49-year-old resume then their judging duties in the 18th season of the NBC talent competition, which premieres May 30.In 2021, The Cinemaholic reported that the Modern Family alum earns $10M per season, Heidi earns $2.5M per season, judge Howie Mandel earns $1.75M per season, and creator-judge Simon Cowell earns $45M per season.Sofía also has a mystery role in Josh Greenbaum's R-rated canine comedy Strays, which Universal Pictures will release in US/UK theaters on June 9.",
        "And back on June 20, Vergara revealed she was shooting her 'last big week' on Netflix's six-episode series Griselda, which she's executive producing and starring as Colombian cartel leader Griselda Blanco.The first-ever billionaire female criminal was known as the Cocaine Grandmother, the Black Widow, and the Queen of Narco-Trafficking before being gunned down, age 69, in 2012.The four-time SAG Award winner will also executive produce Roku's upcoming six-episode competition Celebrity Family Cook-Off, which will be hosted by her son Manolo Gonzalez Vergara and judged by Kalen Allen and Fariyal Abdullahi.",
        "Sofía mothered the 31-year-old Emerson College grad during her two-year marriage to high school sweetheart Joe Gonzalez, which ended in 1993.Meanwhile, Manganiello will next portray a hitman called Reggie in Nicol Paone's upcoming money-laundering thriller The Kill Room alongside Samuel L. Jackson, Uma Thurman, and Debi Mazar.The Magic Mike's Last Dance actor is also producing and directing a Dungeons &amp; Dragons documentary marking the 50th anniversary of the tabletop role-playing game."
    ]
}