{
    "articleURL": "/tvshowbiz/article-12058043/Succession-Roy-family-hosts-tailgate-party-death-Logan.html",
    "content": [
        "The Roy family re-convenes once again to throw their first 'tailgate party' since Logan Roy's (Brian Cox) death in the new episode of HBO's Succession.",
        "The new episode - entitled Tailgate Party - the seventh episode of the final season - follows last week's Investor Day episode where Waystar Royco announces the acquisition of Living Plus.The acquisition didn't sit well with Lukas Matsson (Alexander Skarsgard), as both sides try to finalize the massive merger of Matsson's GoJo and the Roy Family's Waystar Royco.This week's episode seemingly takes place at what Kendall (Jeremy Strong) calls a 'tailgate party,' an annual tradition that will be the first Logan is not present for.The family is given quite the surprise when Matsson shows up to the party, as it's revealed Logan himself invited Matsson before he died... with the siblings learning a surprising secret about Matsson that could threaten the Gojo/Waystar Royco merger.",
        "The episode begins with Tom (Matthew Macfadyen) bringing breakfast to Shiv, as he reveals it's 'Election eve,' as he brings her the latest polling results.Shiv gets a text from Matsson, saying that the buzz is dying down on the Living Plus deal and he wants to know what her brothers, 'have cooking.'He asks if Matsson is coming to the party and she says he doesn't want to, quoting from Matsson's text, 'Swim around my dad's bulls**t, pre-election, brain-dead, AOL-era, legacy media, putrid, stuffed-mushroom f***fest.'",
        "Tom gets Shiv a present, thanking her for letting them host this party together, revealing they will tell the guests that they took a 'break' but now they're back. He gives her a gift of a scorpion, which Tom thinks is funny because they both try to 'kill' each other, before Tom goes to work.Meanwhile, Kendall gets a visit from his ex Rava (Natalie Gold) who tells him that their daughter Sophie doesn't want to go to school anymore.'Some kids have started this whole anti-atn thing, which is actually very supportive, but, you know, it's... complex for her,' adding someone 'pushed' her in the street.An incredulous Kendall asks why she was 'on the street' as Rava says she was with her friends as they start fighting.",
        "'I'm not blaming you. I'm just-- I'm trying to get all the information before I make a decision on our course of action,' Kendall says.'You need to make a decision if you're gonna call your daughter,' Rava says as the credit sequence begins.Kendall, Shiv, Roman (Kieran Culkin) and Connor (Alan Ruck) all meet to discuss how to handle the funeral of their father.They want to finalize plans at the tailgate party before Connor leaves, as Kendall wonders if they should invite Nate Sofrelli (Ashley Zukerman), a political strategist working for Presidential candidate Daniel Jimenez.",
        "They are still trying tank the deal with Matsson as they try to keep their options open, revealing they want to 'go regulatory' to try and stop the deal.Shiv reluctantly agrees to have Nate at the party, but when Kendall and Roman leave, Shiv immediately calls Matsson and tells him they are going regulatory and he needs to be at the party,' to counter.'Meanwhile, Tom gets in on a video conference with several people before handing it over to Greg, who ultimately fires them all due to restructuring ATN, on the grounds of 'staffing redundancy.''Going forward, we intend to operate Waystar Royco international news gathering operations utilizing third-party contract-based arrangements,' Greg says before terminating the call.",
        "Back at Tom and Shiv's house, Tom is getting ready for the party, telling Shiv he's tired, as Shiv reveals Matsson is coming to the party.Tom is excited because it's his time to shine for Matsson, but he gets angry when Shiv tells him she invited Nate.Guests start arriving at the party, many of whom are checking the latest polling results on their phones.Roman gets a call and heads out to take the call on the balcony, while Tom tells Greg (Nicholas Braun) that Matsson is coming.Greg says that Matsson hates him so he thinks he's 'Team Ken-Ro,' as Tom leaves.",
        "Roman returns to Kendall, saying the call was from Mencken's team, saying their polling is even worse than the public numbers.Roman reveals that Mencken's team wants them to try and coerce Connor to drop out of the race now.Roman tells Connor what Mencken's team wants him to drop out, as Connor thinks he's joking.",
        "Roman says he was authorized to offer another option, revealing they want him for an ambassador in Modadishu, Somalia, as Roman says he'll report back.Kendall gets the party started, going around the room to see who is all there, but during his 'moment of silence' for his father Logan, Matsson shows up.'My dad loved you all, we love you all, so let's have some fun. Let the games begin,' Kendall concludes.Kendall asks Shiv what Matsson is doing here and Roman says Logan invited him and he replied 'yes' just four minutes before arriving.Shiv asks how they want to play it and Kendall asks her to stick close to Matsson, guiding him away from 'high value targets' at the party.She agrees and goes to find Matsson, who is talking with Tom, as Matsson asks if he's more hands-on or an 'overview guy.''I'd like to think I can do both,' Tom says, as Lukas says, 'You're kissing my a**,' as Shiv arrives.",
        "He tells them it's a 'really nice place,' and asks who will 'keep it in the divorce,' which cause them all to disperse.",
        "Shiv tells them what people to 'hit' - Nate, Carly, but Valerie first,' adding, 'I need to keep an eye out for my brothers.She asks him to don't, and he interrupts, 'Don't scream \"People are data\" and stick my d**k in the guac?'She adds, 'Yeah, you're about to purchase one of the most prized cultural assets and political communication channels in America, and you need to prepare the ground because otherwise, your many f***ing enemies will portray you as some jerk-off coder from Gothenburg. 'Roman meets with Connor and his strategist, but Connor is not a fan of going to Somalia.They start throwing out more countries he could possibly be an ambassador for, but Roman insists they wouldn't send him to a country that has nukes.They ask about the possibility of Oman, as Connor ponders and says he has to check with his wife.Meanwhile, Lukas chats with Nate and Lukas says he plans on making some major changes at ATN when the deal goes through.Nate catches up with Kendall, with Kendall saying he's 'throwing out some kingmaker vibes.'",
        "'I think we could be really good for you guys. Like, I'm talking major reset of the dialogue, which I am personally invested in. But that only happens if this deal goes away,' Kendall tells Nate.",
        "'Gojo has had incredible growth. He's a charismatic figure, but he's gonna get wrung out. And, you know, there is really legitimate concern here. DOJ or FTC balking at the sports overlap? The FCC over foreign ownership of broadcast?' Kendall adds.Kendall adds they might shy away from Matsson's, 'extreme political positions and fucking Holocaust jokes.'He says if they push for regulation they will, 'give you a better ride in the first hundred days,' as Nate says he'd run it up the ladder.Meanwhile, Shiv goes to talk with Lukas, saying everyone loved him, but she says she would like a, 'very significant role' in the new company.'So, I know the company. I know everything. I know my way around. I'm collaborative. I have the name. I am... I'm hot s**t and I'm ready to go,' Shiv says.He says, 'I would hate to lose you,' but he asks to, 'circle back in a bit,' as he goes to 'take a break.'Kendall asks Greg to help them distract Lukas by finding him some blonde to mess around with. ",
        "Tom is told there are rumors about him leaving ATN but he is told maybe that was wrong.Roman comes back and reveals he has some dirt on Lukas, saying he's been 'creeping' on his comms person, Ebba, 'sending her some weird shit. Blood, bits of hair.'Kendall tries to tell Nate about what happened, but Nate tells Kendall, 'Daniel's people aren't too comfortable with me rubbing shoulders with you.'Kendall says it's, 'something juicy,' and he wants Nate to tell Daniel they can make primetime safe for them.Nate tells him he doesn't like the, 'tenor of this conversation,' adding, 'I'm not Gil. You're not Logan. That's a good thing. I'll see you,' before leaving.Connor talks to Willa (Justine Lupe) about them possibly living in Oman but she's not a huge fan clearly.Greg tries to chat with Lukas but he ends up getting talked into firing his head of comms, Ebba.When Ebba storms off, Kendall and Roman go and talk to her, revealing they know about the stuff he sent her, but she says that is the least of his worries... revealing his numbers are quite off. ",
        "Kendall and Roman tell Shiv that Lukas' numbers are off because of 'screwy metrics in India,' which is big enough to possibly tank the deal.Shiv goes and talks to Lukas, and asks what the numbers are like, as Matsson asks if it was Ebba or Oskar?'There's a little issue, uh, that we're looking into, with subscriber numbers, uh, being, uh...,' he began.'Well, maybe we discovered a metrics error that has overstated our subs in India. Like, by quite a... Like if there were two Indias, it would make sense,' Matsson says.'It's a long story. But it's, like, you know. It's an emerging market. It's... It's all wet cement,' she says.Shiv says, 'So, stock and cash deal, the board would be well within their rights to pull out. You know that, obviously, so how are you... What are you... When are you addressing?''I don't want some forum monkeys just shorting me. I don't like when people get into me. It's gonna get out eventually. She asks if it is even legal but he says they will 'close quickly' and then 's**t will get crazy good,' adding, 'By next quarter, the numbers will be real, probably.'",
        "He asks Shiv if he can fix it and she says she can build another India as Matsson walks out. Roman goes and finds Gerri and tells her the 'firing thing wasn't real,' and wants to have a chat.  He tells her that she's out and she has, 'some requirements you should know about.''First of all, I want money. Eye-watering sums. Hundreds of millions of dollars,' Gerri says as Roman says, 'No. Pass.''So, I have retained personal reputation management. And they will be on the line when Karolina does her background briefings off a set of my bullet points,' Gerri says.'I will set off your bullet points. And if I ever get a whiff of anything undermining my narrative -anytime in the next five years. I will sue and I will go public with the many, many pictures of your genitalia -that I have in my possession,' Gerri says as Roman leaves.Roman goes to talk to Connor to see if they can settle everything but Connor and Willa are having a 'slight change of heart.' 'We wonder, Roman, if he might have... Invested too much in this campaign to just, you know, drop out now,' Willa says, adding, 'He's fought hard. And we wanna find out what might happen, okay? He might write, you know, a book about this, or a speaker circuit.'",
        "Roman says, 'Nothing is gonna happen. Okay?' but Willa says, 'Anything might happen tomorrow, actually.'Roman yells, 'Con! Man! Eat the f***ing carrot. Okay? Everyone in this room thinks you're a f***ing joke. So tell your \"Wife\" to shut the f**k up, cover her shoulders, and pack a f***ing bag for Oman, okay?' Lukas asks, 'Who's going out tonight in this s***ty f***ing town? Anyone? I gotta say, it's pretty depressing from up here. You can really see how second-world it is.'Kendall fires back 'I don't know, pretty happening town, famously,' though Matsson fires back, 'Compared to Singapore, Seoul, it's like Legoland.'Kendall says, 'You know we still run shit, though?' as Lukas says, 'Like as in, \"Only in New York.\" Matsson fires back, 'Well, uh, nothing happens in New York that doesn't happen everywhere.'Kendall says, 'You should get that written on a cup. Right? Shouldn't he get that written on a cup? Like, that would look so cool. You could sell that in a... In a head shop in Rotterdam,' adding he heard he might need a new revenue stream.Lukas fires back, 'I hear your numbers are gay. You have this, uh, cute little valuation, and your numbers just came out as gay,' as Kendall says that's kind of homophobic.",
        "They both laugh and hug it out, both saying how much they love their deal, while Tom tells Shiv he needs to get some sleep and he wants to end the party.Shiv needs him to stay but he lets it all out, stating that he's heard so much gossip that he was going to be fired at ATN. Shiv tells Tom that she's worried she's nailed herself to the Matsson cross, 'and he might turn out to be bull****. You know, he's erratic and... And... And... And... You know, maybe he isn't real.'Tom adds, 'Shiv, he's real. He's the future,' but shiv adds, 'There is a time bomb in his numbers, and I might get blown up.Tom insists, 'You'll be fine. -You'll always be fine,' but Shiv is near a breakdown, adding, 'No. No, I am f***ing my family for this.'Tom adds, 'At this party here, there are maybe 40 of the most important people in America, and you have just walked all around, all evening, telling them all that I'm gonna get fired.'Shiv retorts, 'No, it was implied, lightly, as a little... part of a tactical kind of joke,' though Tom says he doesn't, 'get the f***ing joke.'She says she's in 'serious trouble' but he insists, 'You will be okay because you are a tough f***ing b***h who will always survive because you do what you need. You will do whatever you need.'",
        "She fires back about his scorpion 'joke' but Tom insists, 'That was a friendly thing. 'You're a hyena. You're a... You're a street rat. Actually, no. You're a f***ing snake. \"Here's a dead snake to wear as a necktie, Tom. Why aren't you laughing?\"' she says.Tom lets it all out, adding, 'I think that you can be a very selfish person, and I think you find it very hard to think about me. And I think you shouldn't have even married me, actually.'Shiv responds, 'What the f**k? What the actual f**k? You proposed to me. You proposed to me at my lowest f***ing ebb. My dad was dying. What was I supposed to say?''Perhaps, \"No\"?' Tom adds but Shiv insists, 'I didn't want to hurt your feelings.''Oh, thanks! Thanks for that! Yeah, you really kept me safe while you ran off to f*** the phone book,' Tom says, adding, 'you hid it because you were so scared of how f***in' awful you are.'Shiv retorts, 'You were only with me to get to power. Well, you got it now, Tom. You've got it!' though Tom insists, 'I'm with you because I love you!'Shiv adds, 'Bull****. You're f***ing me for my DNA. You were f***ing me for a f***ing ladder because your whole family is striving and parochial.'",
        "Tom adds, 'That's not a fair characterization,' but Shiv adds, 'Well, your mom loves me more than she loves you because she's cracked. Tom adds, 'You betrayed me. You were going to see me get sent to f***ing prison, Shiv! And then you fobbed me off with that f***in' undrinkable wine, and you won't have my baby because you never even thought, honestly, that you'd be with me more than, like, four f***in' years.Shiv adds, 'You offered to go to jail, Tom! You offered because you're servile! You're just... You're servile!'Tom says, 'You are incapable of thinking about anybody other than yourself 'cause your sense of who you are, Shiv, is that f***in' thin!'Shiv asks if he read that in a book and he says, 'You're too f***in' transparent to find in a book!'Tom adds, 'I think you are incapable of love. And I think you are maybe not a good person to have children!'Shiv says, 'Well, that's not very nice to say, is it?' as Tom adds, 'You have hurt me more than you can possibly imagine,' but Shiv says, 'you took away the last six months I could've had with my dad. You sucked up to him, and you cut me out!''It's not my fault that you didn't get his approval. I have given you endless approval, and it doesn't fill you up because you're broken,' Tom says.",
        "'You don't deserve me. And you never did. And everything came out of that,' Shiv says before leaving.Kendall meets with Frank (Peter Friedman), telling him that the Gojo deal, 'isn't in the best interests of the shareholders' and he wants to find ways of, 'blocking it.' Frank says he doesn't want to hear it, but Kendall adds, 'What if I told you his subs in India are significantly inflated?' which gets Frank's attention.'I'm just gonna hit you with this. What if we run it all the way back? We go reverse Viking. We pillage their village. Waystar acquires Gojo,' Kendall says.Frank says there would, 'have to be major issues,' but Kendall wants to 'slow this down and we eat Matsson's lunch, bigger than Dad ever was.'Frank asks if Roman and Shiv are in on this, but Kendall says, 'I love 'em, but not in love with 'em, you know? One head, one crown. But I'll need ballast. Are you with me?' though Frank doesn't indicate an answer.Tom starts going around telling everyone to leave his house because he has to get to bed, causing some guests to laugh but he says he's serious.Roman goes to Kendall and Shiv and asks if they are fine with him taking the 'big-energy spot' at the funeral and they say it's fine as the siblings all go their separate ways.The lights finally go out in Tom and Shiv's home, as they both go to separate beds... and despite being exhausted, Tom can't go to sleep, as the episode comes to an end.While it was announced just before the season started that Season 4 would be the last, fans were quite shocked when Logan Roy was killed off in the third episode.The shocking death came as Logan was trying to finalize the merger, which resulted in the company's stock price briefly plummeting. The family managed to get more out of Matsson than they had planned... though Kendall has had designs on tanking the deal, while Matsson has been getting closer to Shiv (Sarah Snook) as well. Succession creator Jesse Armstrong first confirmed that Season 4 will be the end of the show in a wide-ranging interview with The New Yorker, where he was asked why he decided to confirm the final season before it debuted.",
        "'One, we could have said it as soon as I sort of decided, almost when we were writing it, which I think would be weird and perverse,' Armstrong began.'We could have said it at the end of the season. I quite like that idea, creatively, because then the audience is just able to enjoy everything as it comes, without trying to figure things out, or perceiving things in a certain way once they know it’s the final season,' he added.'But, also, the countervailing thought is that we don’t hide the ball very much on the show. I feel a responsibility to the viewership, and I personally wouldn’t like the feeling of, “Oh, that’s it, guys. That was the end.” I wouldn’t like that in a show. I think I would like to know it is coming to an end,' he clarified.He added, 'And, also, there’s a bunch of prosaic things, like it might be weird for me and the cast as we do interviews. It’s pretty definitively the end, so then it just might be uncomfortable having to sort of dissemble like a politician for ages about it. Hopefully, the show is against bulls**t, and I wouldn’t like to be bulls****ing anyone when I was talking about it.'"
    ]
}