{
    "articleURL": "/tvshowbiz/article-12046045/Rhian-Sugden-showcases-sensational-figure-sexy-string-bikini.html",
    "content": [
        "Rhian Sugden showed off her sensational figure in the latest racy Instagram she shared with her 489k followers on Thursday morning. ",
        "The blonde beauty was living it up on her recent trip to Crete as she snapped a sexy selfie in a tiny green bikini which displayed her eye-popping assets. Her string bikini top barely contained her eye-popping bust, while she made the most of her taut stomach with low-slung bottoms. She was showing off her dazzling good looks by going make-up free and shielding her eyes with oversized black sunglasses. Adding delicate accessories, Rhian wore a series of hoop earrings, a delicate bracelet and gold rings to complement her look.  ",
        "Last month, she shared another snap from the impromptu poolside photoshoot, as she opted to shed her sunglasses but maintain her pose.  Rhian's latest post comes after she shared joyous news. The model revealed her mother was 'cancer free' last summer after being diagnosed with bowel cancer in July 2021.Television personality Rhian shared a sweet photo of her 'absolute warrior' mum to Instagram in June as she broke the happy news to her followers.Taking to social media, she penned a gushing tribute and added that she 'couldn't be more proud of anyone' after the 'toughest year' since she was diagnosed.",
        "Rhian wrote: 'The news I've been waiting for... It's been the toughest year with my mum being diagnosed with cancer last July. Today she is cancer free!! She's done it.",
        "'Endless hours of chemo, a few organs removed and she's powered through it like an absolute warrior.'I couldn't be more proud of anyone if I tried! Everyone look at my beautiful Mum!!'Rhian added: 'I will be running #raceforlife for her in July and raising as much money as I can for @cr_uk and @christiecharity they have saved my mum's life and I cannot thank them enough.' "
    ]
}