{
    "articleURL": "/wires/aap/article-12052965/Coalition-govt-spent-20-8b-shadow-public-service.html",
    "content": [
        "The former Coalition government spent close to $21 billion on external labour hires in the public service, an audit has shown.",
        "The Australian Public Service Audit of Employment found the service was 37 per cent larger than originally thought, with an additional 53,900 full-time equivalent workers employed.Those workers were external labour hires, mostly in the form of contractors and consultants.The audit showed that workforce cost the government $20.8b, with about 43 per cent of total spending on external labour relating to ICT (Information and communication technologies) and digital solutions.Seventeen per cent went to hires on service delivery while nine per cent was in the portfolio, program and project management area, the audit found.Public Service Minister Katy Gallagher said the results showed the former government had a shadow workforce that was plugging gaps.\"The Morrison government maintained its artificial cap on public servant numbers, promoting a mirage of efficiency, but were at the same time spending almost $21b of public money on a shadow workforce that was deliberately kept secret,\" she said in a statement.\"While the Coalition pretended to cap the size of the public service, they were signing contracts by the billions to outsource work that still had to be done.\"Opposition Leader Peter Dutton said the spending allowed the government to provide one-off services to people during the COVID-19 pandemic.\"Labor, at the same time, was suggesting that we should be spending an extra $81m,\" he told reporters on Saturday.",
        "\"It's a bit hard to take a morality lecture from them on finances because they always spend, they always tax and they always drive up inflation.\"Ms Gallagher maintained the federal government was committed to rebuilding the public service.\"The government acknowledges that there is a role for external labour in the APS but where it is used, it should provide a clear value add and not simply plug holes,\" she said."
    ]
}