{
    "articleURL": "/news/article-12053445/A-new-era-royal-family-Dawn-breaks-Charles-Coronation.html",
    "content": [
        "CORONATION LIVEBLOG: Click here to follow live updates throughout today  How are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.uk Popstars Katy Perry and Lionel Richie led the world of showbusiness as they attended the King's Coronation at Westminster Abbey.",
        "Other stars in attendance included Sir Andrew Lloyd Webber, Stephen Fry, Nick Cave and magician Dynamo, while Dame Emma Thompson gave a thumbs up in excitement.TV favourites Ant and Dec, along with Repair Shop star Jay Blades, were also in attendance at the service, which was estimated to have been seen by 100million people around the world.It is the first coronation of a British monarch in 70 years and an estimated two million people were on the streets of London to watch history unfold.The monarch had been heir since the age of three and is now embracing his day of destiny with the woman he loves by his side. VIP guests queued for a mile from 6am to get one of the prime 2,300 seats inside. The Abbey was full at just before 9am.Attendees watched on as Charles was crowned in a Christian ceremony that dates back 1,000 years on a day dripping with glorious displays of pageantry. It also shines a spotlight on Britain's place on the world stage in the UK's biggest ceremonial military operation since the state funeral of Sir Winston Churchill in 1965 with 7,000 servicemen and women marching with the King and Queen.",
        "Perry's arrival at the Abbey sparked jokes on social media when she appeared to struggle to find her seat. She was seen asking other guests before finally taking her place. ",
        "The musician, 38, opted for an elegant pink two piece, topped off with a wide-brimmed hat featuring a net overlay. She completed the look with a Camilla-esque pearl choker by Vivienne Westwood. Dame Emma opted for a bold floral pattern in a red wide-sleeved coat with an oversized rose pattern.  Richie, 73, chatted to Mayor of London Sadiq Khan before finding his place among the other guests.Meanwhile, Cave, 65, famous for hits with his band Nick Cave and the Bad Seeds, arrived alongside former Archbishop of Canterbury Rowan Williams. Fry, 65, proudly wore his CBE as he arrived in a cream waistcoat and pink patterned tie.  Before they entered the Abbey, Ant and Dec were seen laughing as BBC journalist Sophie Raworth took a photo of them on her phone. Charles's family, including Prince Andrew and Princess Anne, enjoyed a dinner at Mayfair club Oswald's last night. Mike and Zara Tindall were out until 2am. Prince Harry flew in from Los Angeles yesterday for his 24-hour trip. It emerged last night he has been relegated to the third row in the Abbey with other non-working royals.And on the streets of London today, including on a packed Mall, there is huge excitement among tens of thousands who have been camped out for days so they can see the extraordinary event unfold. ",
        "Approaching two million people - from all corners of the UK, Commonwealth and the world - are flowing into central London, despite rain being forecast. Trains into the capital were packed this morning, with soldiers taking part in the ceremony seen flowing into mainline stations. Guests of the King started arriving at the Abbey from 7am - four hours before the ceremony. Some 100 heads of state are in London, with representatives from 203 countries due to attend.Inside Westminster Abbey, the church buzzed with noise as the congregation filed in and took their seats hours before the ceremony was due to start.A rich royal blue carpet - chosen to highlight the regal red, gold and purple robes of the king and queen - adorned the dais in the coronation theatre.Stunning flowers in reds, burgundies and yellow golds covered the top of the ornate golden High Altar.A smiling Dean of Westminster in his vivid red clerical robe was seen hurriedly carrying the holy oil for the anointing down the length of the abbey from the altar through the quire, clutching the precious ornate silver vessel in both hands.The longest-serving heir to the throne in British history is today being crowned at Westminster Abbey in a ceremony that is steeped in the majesty of his illustrious forebears – but also embraces and emphasises the proud diversity of modern-day Britain.",
        "‘There will be all the pomp and ceremony you could dream of, but as little of the “them and us” as possible,’ one senior royal aide said last night.",
        "Crowned alongside the King, 74, will be his wife of 18 years – and his love for much, much longer.The once unthinkable has become a reality, and from today the former Camilla Parker Bowles will be known as Queen Camilla as she is anointed and has Queen Mary’s Crown placed upon her head.Yesterday the 75-year-old Queen Consort made only a brief public appearance as she attended a final rehearsal at the Abbey with her husband in the morning. She chose not to attend any of the other public engagements by his side, preferring to ‘pace herself’ and also ensure ‘the day was about her husband’, sources said.‘She loves him unconditionally and always wants him to shine,’ a friend said.Last night the couple retired to enjoy a private dinner at their London home, Clarence House.‘The calm before the storm – perhaps metaphorically as well as literally,' a friend said with a nod to the dismal weather forecast, something the new King and Queen’s celebrations have in common with the late Queen’s Coronation in 1953.It came as: Prime Minister Rishi Sunak hailed the Coronation as a ‘moment of extraordinary national pride’; The Archbishop of Canterbury, who will anoint and crown the couple today, predicted that people will be ‘struck by the majesty and sacred wonder of the service’; The King, accompanied by his son and daughter-in-law the Prince and Princess of Wales, shocked and delighted well-wishers camping out along The Mall with an impromptu walkabout yesterday; A relaxed-looking Charles smiled broadly and threw his hands in the air when he was asked if he was feeling the strain, telling one fan: ‘It’s people like you that count’; Kate said she and her children were ‘excited but nervous’ – and she even spoke on the phone to a fan’s aunt in Tennessee who was unable to fly over after breaking her leg; The King and his family entertained dignitaries and world leaders at a series of events, including a glittering reception at Buckingham Palace last night for overseas VIP guests including King Felipe and Queen Letizia of Spain, the Sultan of Brunei, Crown Prince Frederik of Denmark, and the King and Queen of Jordan; Prince Harry was expected to arrive in the UK ahead of his ‘blink and you’ll miss it’ appearance at the Coronation ceremony, but there are no plans for him to feature in any of the private family celebrations or official portraits; Forecasters warned the weather for today looks unsettled, with heavy rain predicted at times, which could threaten the planned 60-aircraft flypast over Buckingham Palace.Today’s Coronation will see 7,000 servicemen and women accompanying Their Majesties, making it the country’s biggest ceremonial event since 1953.",
        "By 7.30am, there were thousands of people lining Whitehall with flags and wearing Union Jack hats.One enthusiastic member of the crowd is Helen Mutlu, 54, a food business owner from Clevedon, who is in London with her grandson Theo.She said: 'This country can't run without royalty behind it. I've been to everything I can, I've supported the Queen at Trooping the Colour every year.'I was so upset and cried and mourned for the Queen for months and I've only just got over that.'She added: 'My husband complains about my memorabilia all the time. I have a life-size stand-up of the Queen in my lounge - my husband doesn't like that, he says it's too big!'Of the Republic protesters, Mrs Mutlu said: 'Absolute lunatics. Just look at other countries with presidents, they haven't got any organisation.'Indeed, the Coronation procession back from the Abbey after the ceremony is so large that when the King and Queen arrive at Buckingham Palace, the rear will only have reached Downing Street, a mile away.The 2,300-strong congregation will include representatives of 39 Commonwealth nations and 100 heads of state, as well as many hundreds of ordinary citizens who have selflessly served their country and communities – in a stark divergence from Queen Elizabeth’s Establishment-heavy Coronation of 1953. Peers have been replaced in key roles with people of a range of faiths and creeds to emphasise the country’s diversity and religious tolerance, as well as women bishops and charity and military representatives.",
        "Inside the historic place of worship, the King will, for the first time, recite a specially written public prayer and pledge his allegiance to his people as he is invested with the glittering regalia of the Crown Jewels, which normally reside in the Tower of London.The moment of his anointing will take place behind a three-sided screen to preserve the moment of solemnity between him and God.Prince William, who was yesterday seen at rehearsals wearing his Order of the Garter robe, will kneel and pledge allegiance to his father, before Charles has the St Edward’s Crown placed on his head by the Archbishop of Canterbury and the spine-tingling cry of ‘God Save The King’ rings out.The King and Camilla – who will arrive without their crowns as a sign of humility – will depart in the 261-year-old Gold State Coach, wearing the Imperial State Crown and Queen Mary’s Crown.The Princess Royal will ride on horseback behind Charles and Camilla in her role as Gold Stick in Waiting and Colonel of the Blues and Royals.In the first carriage behind the Gold State Coach will be the Prince and Princess of Wales with George, nine, Charlotte, eight, and Louis, five. The next carriage will contain the King’s youngest brother, the Duke of Edinburgh, with his wife the Duchess of Edinburgh and their two children.The late Queen’s cousin the Duke of Gloucester and his wife the Duchess of Gloucester, and Anne’s husband Vice Admiral Sir Tim Laurence will travel in the third carriage. Following by car will be the Duke of Kent and Princess Alexandra, also cousins of Elizabeth II. There is no place in the procession for the Duke of Sussex and the Duke of York – who play no formal part in the Coronation ceremony – nor for Andrew’s daughters, Beatrice and Eugenie.Shortly before 2.30pm, the King and his family will make their first appearance on the balcony of Buckingham Palace to greet thousands of well-wishers before a six-minute fly-past involving 60 aircraft including the Battle of Britain Memorial Flight and the Red Arrows, weather permitting.While monarchs have historically held lavish state banquets, the family will then retire for a ‘running buffet lunch’ and nothing more exotic than a ‘nice cup of tea’ while they have their official portraits taken in the Throne Room and Green Drawing Room.It has been suggested that the family may make another appearance later. Tomorrow, members of the Royal Family will join ‘Big Lunches’ across the country as communities come together to celebrate the occasion, before the Coronation Concert at Windsor Castle in the evening, with headline acts including Lionel Richie and a spectacular lighting up of the nation using light displays, lasers and drones.The Coronation bank holiday weekend will conclude on Monday with The Big Help Out, when members of the Royal Family will join volunteers working with local community organisations as part of an initiative to create a lasting legacy from the celebrations. Charles and Camilla, however, will leave for their Sandringham estate in Norfolk for a well-earned break.The Duke of Norfolk, who is organising the ceremony, said: ‘The Coronation is an opportunity to bring our great nation, the realms and the Commonwealth closer together, plugging into the power of the past and promoting our shared values to the wider world with all that we have to offer.’Mr Sunak said the weekend would be a chance to reflect on the ‘enduring nature of monarchy’ and urged the nation to celebrate its history and culture.The Prime Minister added: ‘Let’s celebrate this weekend with pride in who we are and what we stand for. Let’s look to the future with hope and optimism. And let’s make new memories, so we can tell our grandchildren of the day we came together to sing God Save The King.’Will you be watching for a glint from the world's biggest diamond? Will Louis steal the show, or the pages? Discover what happens and when on a day that will go down in history in ROBERT HARDMAN's step-by-step guide to King Charles III's CoronationSome will be looking out for the tiniest glimpse of the anointing (good luck with that) or the glint of the Great Star of Africa, the world’s largest diamond, in the head of the Sceptre.Historians and theologians won’t know where to start. Royal-watchers will be waiting to see who steals the show. Prince Harry? Prince Louis? The page boys?And then there is the music...Everyone, surely, will be waiting for that extraordinary moment when St Edward’s Crown is lowered and the cry echoes around the Abbey: ‘God save the King!’However you may be intending to watch, it will be a day we remember for a long time. But what to look out for and when?",
        "5am-6amAnyone wanting to watch the procession with their own eyes will find that the best positions in Central London were taken by hardy campers who have been lining The Mall for days. The authorities are asking people not to arrive on the day before 6am, when viewing areas will open along the route. Steel gates control access to the processional area.",
        "The award for the most ostentatious gown surely goes to Queen Caroline, wife of George II, whose dress for the 1727 Coronation was so encrusted with jewels a pulley had to be designed to hold up the skirt so she could kneel down to be crowned. ",
        "When the police decide the area is full, the gates will shut and people will be redirected to six public viewing areas, in Green Park, St James’s Park and Hyde Park. There are 57 all over Britain.6am-7amThe first guests will already be making their way to Westminster Abbey, ready for the 7.15am opening of extensive ticket and security checks. If you are coming by Tube (St James’s Park is shut all day), listen out for an unusual ‘Mind the Gap’ message — recorded by the King.7am-8amThe 2,200 ticketed guests will already be filling the Abbey. At 7.30am, BBC1 viewers will join Kirsty Young for the start of seven-and-a-half hours of non-stop coverage on both BBC1 and BBC2 (the latter with sign language).8am-9amThe last non-VIP guests will be taking their seats, even though there are still hours to go before the service begins. All regular guests have been told to be seated by 9am. Viewers will recognise some of the personal guests such as Ant and Dec or Lionel Richie, as well as the county representatives, the Lord-Lieutenants and a small cluster of MPs and peers drawn by lottery (with 50 seats for each chamber — and no plus ones). At 8.30am, ITV viewers will join Tom Bradby and Julie Etchingham. Those along the route will effectively be locked in position as the processional route is declared ‘sterile’ from 9am onwards.9am-10amStreet-lining troops are now taking up their positions and will all be in place by 9.40am. From 9.30am, TV viewers will start to see heads of state, prime ministers (and British former prime ministers) and junior foreign royalty take their seats. Huw Edwards will be the BBC’s commentator inside the Abbey. ‘Very limited toilet facilities’ inside will shut at 10am and will not reopen until 1.30pm.10am-11amBy now, everyone will be glued to the royal arrivals, especially that of the Dukes of Sussex and York. Last into the Abbey before Their Majesties will be the Prince and Princess of Wales with their two younger children. As a page to the King, Prince George will be lining up separately.At precisely 10.20am, the King and Queen will set off for the Abbey in the Diamond Jubilee State Coach. The newest addition to the Royal Mews, it is a masterpiece of engineering by Australian coachmaker Jim Frecklington.",
        "The monarch with the most illegitimate children at his Coronation was William IV, who invited four of his ten children by the actress Mrs Jordan.William, who was 64, declared he wanted his 1831 Coronation to be a cut-price event. It was called a ‘half-crown ceremony’ by his enemies, although it cost £2 million in today’s money. ",
        "It is a travelling museum of our history, with everything from fragments of the Stone of Destiny to slivers of the climber’s ladder which helped the conquerors of Everest to the summit in 1953.The crown on top is from HMS Victory and conceals a hidden ‘coachcam’ for a CCTV camera. The journey to the Abbey, called the King’s Procession, will progress at a walk, with a much smaller following than the great cavalcade which follows later in the day. This is a reflection of the monarch arriving in humility, with the grandeur and splendour yet to come.Clare Balding will take over the BBC commentary. At 10.53am precisely the coach arrives at the Abbey and the King and Queen Consort emerge to line up for the royal procession, assisted by their pages who will help carry their robes of state.11am-12 noonThe service opens with the traditional sound of the scholars of Westminster School, high in the triforium, shouting/singing ‘Vivat Rex’ and ‘Vivat Regina’. For the first time, they include female voices since the school now has a co-educational sixth-form.We hear the soaring I Was Glad by Sir Hubert Parry (one of the King’s favourite composers) as the vast procession streams through the Abbey. Britain old and new is here in force. Following the junior heralds (pursuivants) in their tabards, come the orders of chivalry and gallantry.Next come the quarterings of the Royal Arms (look out for the young Duke of Westminster in this bit) and the Royal Standard, carried by Francis Dymoke, the Hereditary King’s Champion, whose family have been part of every coronation since William the Conqueror.Next up come the clergy, the heralds and the procession of the regalia. The latter has virtually emptied the Jewel House of the Tower of London.Its keeper, Brigadier Andrew Jackson, carries the ring, perhaps the smallest element in a priceless parade of crowns, sceptres, swords, armills and spurs. The Great Officers of State are all here — and, for the first time, a woman will be among them: Penny Mordaunt, Lord President of the Council and bearer of the Sword of State. Here too are women bishops, officiating at a Coronation for the first time.",
        "The King reaches his Chair of Estate, the first of three thrones he will use during the service. And the first voice we hear will be that of a child. Chorister Sam Strachan of the Choir of the Chapel Royal will welcome the King on behalf of everyone, to which the King replies: ‘I come not to be served but to serve.’ It is one of a few new elements introduced to a service rooted in rituals laid down in the 10th and 14th centuries, plus elements of the Old Testament.The service then follows the time-honoured rituals of the Recognition and the Oath. Listen out for an additional oath promising an ‘environment in which people of all faiths and beliefs may live freely’ — articulating the King’s long-held view that a monarch should be a defender of ‘faiths’.A lesson read by Prime Minister Rishi Sunak is followed by something we have not seen at a Coronation for many reigns: a sermon by the Archbishop of Canterbury.12 noon-1pmDepending on the length of Justin Welby’s address, we will be hitting the great anointing moment at around noon. By now, the King has moved to his second - and principal - Throne, St Edward’s Chair, facing the altar. Here is the one part of the entire proceedings off-limits to everyone, even members of the Royal Family.",
        "Elizabeth II went to her Coronation in the Golden State Coach, but in 1761 the 22-year-old George III and 17-year-old Queen Charlotte were carried to the Abbey in sedan chairs. At that ceremony, the Archbishop of Canterbury’s sermon was almost inaudible because the congregation were opening bottles of wine and eating. ",
        "Soldiers from each regiment of the Household Division step forward carrying a special screen - embroidered with the names of every country of the Commonwealth - to shield the moment when the Archbishop dabs holy oil on the King’s head, chest and arms. This is a moment between the King and the Almighty.Next, comes the investiture as members of different communities and Christian denominations present the King with the regalia, piece by piece.Finally, the moment has come. Addressing the ultimate monarch, ‘King of Kings, Lord of Lords’, the Archbishop lifts up St Edward’s Crown and crowns Charles III. The Abbey erupts with God Save The King. From Horse Guards to the Tower of London, to saluting stations around the nation, in Gibraltar and on ships at sea, 21-gun salutes will be fired simultaneously. The bells of the Abbey ring.The King is then enthroned, moving to his third seat of the day, the Throne Chair. Here, he receives a much-shortened homage — just the Archbishop and the Prince of Wales. At which point, we are all invited to join in. This is the bit that has aroused hours of needless squawking. If you don’t want to pledge allegiance in front of family and friends, make a cup of tea.Next comes the anointing of Queen Camilla - a scaled-back version but one which will be on camera - and her crowning. Listen out for Andrew Lloyd Webber’s magnificent new anthem, Make A Joyful Noise. The couple then retire backstage to the Chapel of St Edward to remove their crowns for Holy Communion.",
        "Finally, they retire again and emerge in their Robes of Estate. Look for all the gold embroidered gardening imagery on the Queen’s train. Royal Kremlinologists will now be scanning the rear of the royal party for any signs of a rapprochement as the Duke of Sussex walks down the aisle before heading for home.1pm-2pmCoronation Procession time. The Gold State Coach, the gilded Georgian Cinderella-style monster, is at the Great West Door.The Waleses, their children and the other working members of the family climb into three carriages behind — minus the Princess Royal. She will be on her horse with the other Household Division colonels.",
        "Mary Tudor was the first woman to be crowned Queen in her own right. She was accompanied into the Abbey on October 1, 1553, by her only living stepmother, Anne of Cleves, and her half-sister Elizabeth. For her procession to the Abbey she wore a gown made out of gold and silver thread. ",
        "At the moment the King and Queen start moving, the front of the parade will already be at the top of The Mall. With every unit of the three Services, every Commonwealth realm and almost every Commonwealth nation represented, this procession will be a collector’s item.Made up of eight groups, it features no less than 19 bands. The coach is expected at Buckingham Palace at 1.45pm, at which point the King and Queen proceed through to the West Terrace overlooking the lawn.The entire parade, on reaching the Palace, will have formed up here for a royal salute.2pm-3pmThe King and Queen must make haste for the opposite side of the Palace and the mandatory East Front balcony appearance — still, we hope, in robes and crowns. That wing of the Palace is still a building site so they will need to tread warily. Shortly before 2.30pm, expect to see the curtain flicker and the door open. Out will come the royal party. The royal anoraks will be scrutinising the line-up to see who makes an appearance.Finally — weather depending — it is the turn of the airborne arms of all three services, especially the RAF, led by three Juno helicopters and four more waves of rotary aircraft. Expect great excitement from the Wales children as Daddy’s old colleagues come by.Next come the fixed-wing brigade led by the Battle of Britain Memorial Flight — the mighty Lancaster and a pair of Spitfires and Hurricanes. The fastest come last followed, of course, by the Red Arrows and their red, white and blue smoke. A final crowning moment to a truly crowning day.Coronation order of service: Full list of hymns, music, prayers and readings revealed The Procession of The King and Queen",
        "Following the choir, religious and Commonwealth leaders, Their Majesties will enter Westminster Abbey to the anthem I Was Glad, a version of Psalm 122 set to music by Sir Hubert Parry, the composer of Jerusalem. Parry’s setting contains the cry ‘Vivat Rex!’ (Long Live the King!) which will be proclaimed by scholars from Westminster School.A Moment of Silent PrayerThe Royal Couple take a moment to reflect and pay homage to God.Greeting and IntroductionThe Archbishop of Canterbury welcomes the congregation with a blessing.The RecognitionThis is the first element of the traditional English Coronation Rite in which the congregation affirms support for the King by exclaiming: ‘God Save King Charles.’The Presentation of the Holy BibleA copy of the Bible is gifted to the King, symbolically setting the ‘word of God’ above all human laws. The Moderator of the General Assembly of the Church of Scotland will tell the King: ‘Here is Wisdom; This is the royal Law; These are the lively Oracles of God.’ This tradition dates back to the Coronation of William III and Mary II in 1689.The OathsThe Oaths are vows to support people of all faiths and beliefs. The Archbishop asks Charles III if he is willing to take the Oaths and to ‘promise and swear to govern’, to which the King will reply: ‘I solemnly promise so to do.’",
        "The King’s PrayerThe Monarch offers a specially composed prayer which draws inspiration from Galatians 5 and the much-loved hymn, I Vow To Thee My Country.CollectAnother prayer, written especially for the Coronation, addressing the theme of loving service.The EpistleColossians 1 9:17Prime Minister Rishi Sunak will read from the first chapter of the Epistle (which translates as ‘letter’) to the Colossians.GospelLuke 4:16-21The Gospel — derived from the Greek for ‘Good News’ — is St Luke’s account of Jesus at worship in the synagogue.SermonThis is an opportunity for The Archbishop to place the ceremony within a broader religious context, and explain how the themes of the celebration relate to both the public and the monarch.",
        "The AnointingAs The King prepares to be anointed upon the Coronation Chair, he removes the Robes of State — signifying his humility in front of God.The Archbishop will anoint The King on his hands, breast and head. This sacred part of the ceremony will be held behind a screen and is not broadcast on TV.Meanwhile, the choir sing Handel’s anthem Zadok The Priest, which he composed for the Coronation of George II in 1727.It has been sung prior to the anointing of the sovereign at the coronation of every British monarch since then.The Presentation of RegaliaPeers from the House of Lords and senior Anglican bishops will present various symbols of royalty. Non-Christian peers will present regalia which does not bear explicit Christian motifs, affirming the different faiths that will serve under the King.The OrbA representation of Sovereign power, the Orb is placed in The King’s palm.",
        "The RingSimilarly to rings exchanged during a marriage ceremony, the Coronation Ring is a symbol of the monarch’s promise and commitment to God. The Archbishop will tell King Charles that the ring represents ‘the covenant sworn on this day between God and King, King and people’.",
        "The Sceptre and RodAnother piece of regalia loaded with significance, the Sceptre represents temporal power and authority. The Rod of Equity and Mercy represents the Monarch’s spiritual role and his pastoral care of the people.",
        "The CrowningMade of solid gold and set with precious stones, St Edward’s Crown (made in 1661) represents the King’s vocation before God, and is a reminder of the promises and vows he has made to the people.As he crowns the King, the Archbishop will lead the congregation in declaring ‘God Save the King!’ — a loyal exclamation that has been part of the Coronation ritual since 1689.FanfareRichard Strauss’s famous Vienna Philharmonic Fanfare will follow the crowning and then the Abbey bells will ring for two minutes, followed by a Gun Salute fired by The King’s Troop Royal Horse Artillery as well as all Saluting Stations throughout the Kingdom, including in Bermuda, Gibraltar and on ships at sea.The BlessingThe Archbishop and other Christian leaders will deliver the blessing. It is the first time the Blessing has been shared by clergy from different denominations — a reflection of Britain’s ecumenical progress.Enthroning The KingThe King is settled on the throne while the Archbishop commands him to ‘stand firm, and hold fast from henceforth this seat of royal dignity, which is yours by the authority of Almighty God’ — phrasing which dates back to the coronation of King Edgar in 959.HomageThe Church of England, followed by Prince William, pays homage to the King. This is then followed by a new tradition: the opportunity for the public to swear their ‘true allegiance’ to the Monarch and his heirs. A chorus of millions will participate — from members of the congregation and subjects in the streets outside to people up and down the country — in this solemn and joyful moment.Coronation of the QueenIn a shorter sequence to that of the King, Queen Camilla has her own Coronation, which begins with a brief anointing.The last sovereign consort to be crowned was the late Queen Mother in 1937. It is an honour that is bestowed only on female consorts, and therefore His Late Royal Highness Prince Philip had no such ceremony.The CrowningQueen Mary’s Crown is placed upon her head. The crown has been embellished with jewels from her Late Majesty’s personal collection, including the Cullinan III, IV and V diamonds.Enthroning The QueenCamilla is seated beside the King, symbolising their joint vocation before God. A significant moment of music comes next, as the choir will sing Andrew Lloyd Webber’s coronation anthem, Make A Joyful Noise as the King and Queen are united in their joint vocation. This setting of verses from Psalm 98 was commissioned for this service.Offertory HymnGifts of bread and wine are brought before the King.Eucharistic PrayerThis prayer recalls the words of Jesus at the Last Supper.SanctusWith words dating to the fifth century, the Sanctus will be sung to music composed by Roxanna Panufnik, a British composer of Polish heritage, one of the King’s 12 commissions for the Coronation.The Lord’s PrayerThe Archbishop will invite everyone to join him in prayer, wherever they may be, in whichever language they wish. The Our Father was Jesus’s gift to his followers when they asked how they should pray.",
        "Prayer after CommunionTaken from the Book Of Common Prayer, this prayer asks God to direct us in His holy ways.The Final BlessingThe Archbishop of Canterbury leads a final blessing, praying: ‘Christ our King, make you faithful and strong to do his will, that you may reign with him in glory’.Te DeumThis Latin hymn dates back to the 4th Century and is sometimes called The Hymn Of The Church. It is sung as Their Majesties go to St Edward’s Chapel to be vested in the Robes of Estate and Charles puts on the Imperial State Crown.The term ‘Imperial State Crown’ dates back to the 15th century, when English monarchs chose a crown design closed by arches to demonstrate that England was not subject to any other earthly power.The National AnthemGod Save The King has been the national anthem for more than 250 years. It is both song and prayer, calling on God to protect the Sovereign and ensure their wise rule. The eponymous phrase is far older than the song, appearing several times in the King James Bible.Greeting of faith leaders, representatives and the governor -generalsIn an unprecedented gesture marking the significance of the religious diversity of the Realms, the Sovereign will spend his final moments in the Abbey receiving a greeting from the leaders and representatives from the major non-Christian faith traditions: Jewish, Hindu, Sikh, Muslim and Buddhist.In a historic first, the complete coronation will be recorded and released as an album on the very day of the ceremony."
    ]
}