{
    "articleURL": "/money/markets/article-12043581/Keir-Starmers-promise-housing-comes-no-surprise.html",
    "content": [
        "Pledges to meet targets for home building have long been part of the political weaponry. ",
        "So it is no surprise that, with local elections looming – an important real world test of Labour’s electoral breakthrough – Keir Starmer is choosing to make access to ownership an issue.Starmer says he wants to boost the home ownership rate to 70 per cent from the current 64 per cent where it has languished for a decade.To get there, the Labour leader says, will require building 300,000 homes a year. That is not an aspiration pulled out of the hat.It is a number which reaches back to the heady days of then housing minister Harold Macmillan when the target was achieved. ",
        "That is a sizeable increase on former Labour prime minister Gordon Brown’s declared ambition in 2007 to build 240,000 a year by 2016 and matches the most recent Tory target of 300,000 a year, recently abandoned.It is only too easy for governments to make promises about housebuilding but the reality is that they control few of the levers. The Government of the 1950s was able to reach the magical 300,000 figure because the circumstances were so different.World War II left many cities disfigured by German bombing and there was no shortage of sites in inner cities.Advances in building techniques led to the birth of high rise: more homes for the buck on smaller sites. ",
        "No one predicted the social horrors which would ensue as the high-rises became notorious for socio-economic deprivation, crime and despair.That’s long before safety became a factor at Grenfell Tower.As the property developer Gerald Ronson once told me, what people aspire to is a house with three bedrooms and a garden, not a home in a tower block where maintenance can be a nightmare.That is the rub of it. Building such desirable homes requires more land and runs into Britain’s tight planning laws and rampant ‘nimbyism’. This is no less likely to be prevalent in Labour-controlled boroughs than among Tories, although those boroughs may have the louder voice.Levelling Up and Housing Secretary Michael Gove has been honest enough to publicly talk of the pitfalls in setting targets.‘The current housing model from supply to standards is broken,’ he declared in the foreword of a paper for the Conservative think-tank Bright Blue.So how does Starmer propose to untie the Gordian knot? His key promise is to give more power to councils to override the planning blockages. Perhaps he should have talked to the builders before making this pledge. The great financial crisis wiped out many of the smaller ones, concentrating power in the big five or six.",
        "These companies have not made themselves popular. Fat cat pay cheques for get-rich-quick merchants such as Jeff Fairburn the former boss of Persimmon, which built inferior and sometimes unsafe homes, have undermined faith in their ability to deliver.",
        "They, together with property developers, also are accused by Labour of storing up land to make speculative profits.That may be the case but it is not the real problem. That lies with the local authorities. With the exception of the elected mayors in bigger conurbations such as Manchester, the West Midlands, Teesside and elsewhere, there is very little effective planning.Council chief executives may be better paid than they have ever been but their ability to plan ahead, release sufficient sites and agree on the infrastructure for new large projects from education to housing and social care needs is limited.It is often argued that brown-field sites, abandoned factories, land close to railway stations, former gasworks and even the redevelopment of high streets ought to be the answer. They could be, but the clean-up costs make such housing prohibitively expensive and unattractive to anyone except boutique builders.As for city centres, John Lewis, Sainsbury’s and others have moved into this territory, building on and around store sites. But it is unlikely to yield the vast numbers, which Labour or any other government might wish to build.There is one fact that need challenging. It is often argued that Britain’s green and pleasant land is already overbuilt and this is the argument deployed by Tory nimbys. ",
        "The reality is that even in England, the most crowded part of the UK, 10.7 per cent of the land mass is assessed as developed.The opportunity to provide decent and affordable housing is there. Clearly, more accessible mortgages for first-time buyers would help. But it is leadership, determination and planning from Whitehall and town halls in particular that is the missing link.",
        "Builder Barratt said the number of homes customers are reserving is bouncing back from late 2022.It sold 0.3 homes a week in each location where it was selling houses in the final quarter of 2022. That rose to 0.71 homes, in the 12 weeks to April 23.This is still behind last year, when the figure was 0.94, but it shows demand, which cratered as interest rates shot up after September’s mini-Budget, is starting to strengthen again.Barratt has sold homes for just under £3billion in advance as of April 23, from £4.5 billion a year before. It has slowed construction as a result, building 303 homes per week, compared to 359 a year earlier.It expects to build between 16,500 and 17,000 homes this year.",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}