{
    "articleURL": "/wires/pa/article-12059417/Ange-Postecoglou-hints-Celtic-play-freedom-title-win.html",
    "content": [
        "Celtic manager Ange Postecoglou hinted his team could play with more freedom now they have wrapped up the title.",
        "The Hoops retained their cinch Premiership crown with four games remaining thanks to a 2-0 victory over Hearts at Tynecastle on Sunday.There is no room for dropping off given Celtic face Rangers at Ibrox on Saturday and have a treble to play for with a Scottish Cup final against Inverness to come on June 3.They also have the chance to set a new Scottish top-flight points record of 107 – beating Brendan Rodgers’ Invincibles team of 2017 by a point – if they win their final four matches.Postecoglou said: “We have got an opportunity to (have a special season). We are champions, which is fantastic. There are still four games in the league and we have a cup final to look forward to.“Why let this opportunity slip to continue to maintain standards?“I think the last three or four weeks we have been playing pretty tight in terms of emotionally.“The boys knew they were close to achieving something special and the closer you get to something like that, it’s human nature that you tighten up a bit. I think that’s been reflected in our football the last three or four weeks. We have got an opportunity to (have a special season). There are still four games in the league and we have a cup final to look forward to.  Ange Postecoglou  ",
        "“But through that time they still work so hard for each other, they are still disciplined, they never lose focus. They just have this real determination.“They are winners, mate. They are winners.”Captain Callum McGregor believes the competition within the squad will help ensure they retain their edge for the cup final.McGregor, who is going for his fifth treble, said: “It’s a cup final, we have to prepare well and that includes the last four games. We have to be bang at it, we can’t come off it.",
        "“Listen, the manager won’t let us anyway but we just continue to play the way we are playing, stay hungry, and once we get to the cup final we will try to deal with that as best we can, and that will be a consequence of that happening.“Everybody wants to play, that’s why it’s highly competitive to get in the team and stay in the team.“If you look at the subs who came on on Sunday, Aaron (Mooy) has a huge impact on the game and he is somebody who has been really strong for us this season.“There’s strength in depth there and I think the guys, when they are in the team, they are desperate to stay in the team. To have that competitive environment for the next four weeks will hopefully stand us in good stead.”",
        "Celtic have the chance to go a full season unbeaten against Rangers, who they have beaten in both cup competitions.“You don’t need any extra motivation for these games,” McGregor said. “They are always big games, there’s always something to play for. and I’m sure it will be a highly competitive game again.“We want to go there and be aggressive in the game and get maximum points.”"
    ]
}