{
    "articleURL": "/sport/football/article-12045393/Darwin-Nunez-central-figure-Liverpool-allowed-leave.html",
    "content": [
        "Darwin Nunez still does not seem to have full won Jurgen Klopp's trust His work rate is top notch but he represents such a departure in team style He should start each of Liverpool's last four games, with little left to play forOn the night Erling Haaland broke more records, Darwin Nunez’s run at Liverpool extended to only one goal in his last 10 matches.",
        "Yet the Uruguayan still got a generous ovation for his contribution when substituted late on in a 1-0 win against Fulham. The remainder of this season has to be used by Jurgen Klopp to see if the 23-year-old is up to the task of being the club’s main centre-forward.It has to be remembered Nunez cost £30million more than City paid for Haaland last summer. The early signs were positive, Liverpool’s stand-out signing scored on his debut in the Community Shield against City when Haaland didn’t.Since then, it’s been a series of almosts, similar to Luis Suarez’s first season at Anfield when he kept on hitting the woodwork.Nunez has scored a respectable 15 goals in his debut season in England but doesn’t seem to have fully won Klopp’s trust, starting only 18 of the 34 Premier League games.",
        "Against Fulham, his sharpness was evident when he forced Issa Diop into conceding a penalty which Mo Salah converted for the win.He never stopped running and once Andy Robertson came on as substitute, those darts in behind the Fulham defence became more dangerous.But the issue for Nunez, and Klopp, is that he represents such a different kind of centre-forward to the man he hopes to replace, Roberto Firmino.Whereas Firmino dropped deep, linked play and fed Salah and Sadio Mane, Nunez likes to play off the shoulder of the last defender, running in behind.",
        "That means the whole Liverpool team have to adapt their style to suit him. Presumably, the recruitment team had told the manager what he was getting, but it still seems to have come as something of a surprise.With four matches left this season and Klopp himself discounting a charge into the top four positions, it is time for Nunez to play every remaining game at centre-forward to boost his personal confidence and establish relationships with the rest of the team.The perpetual rotation of Nunez from being a striker one week, wide player the next week and then on the bench does little to indicate whether he is the long-term answer.He showed glimpses of his speed against Fulham but his first touch was rusty befitting a man who hasn’t had many minutes. In Liverpool’s current five-match winning run, he was substitute in the first four of them, arriving between the 60th and 81st minutes.",
        "Nunez is too expensive to a be a bit-part player. He either has to be a central figure or allowed to leave and continue his career elsewhere, and the money reinvested in someone who is a better fit.Klopp needs more evidence before making his mind up which is why it’d be disappointing if Nunez was again left out against Brentford, even if Liverpool can call upon alternative attackers Luis Diaz, Diogo Jota, Salah and Firmino who leaves the club at the end of the season.",
        "Though Fulham boss called the penalty decision “embarrassing”, Klopp liked the way his player had nicked the loose ball first forcing Diop into a challenge. ‘Really strong from Darwin in that moment,’ said the Liverpool manager.Overall, a narrow win to cement fifth spot isn’t up on what Liverpool have achieved in previous seasons before Nunez arrived.‘We have stuff to improve on,’ said Klopp about the team though he could have been talking about the club’s record signing as well. But to judge Nunez on one start when he’d been on the bench for the previous four is harsh.He needs his manager to show a bit of faith so Liverpool can find out if Darwin Nunez deserves to be a stayer."
    ]
}