{
    "articleURL": "/news/article-12043443/Tucker-Carlson-leak-shows-host-joking-deposition-slimy-Dominion-lawyer-triggered-him.html",
    "content": [
        "Tucker Carlson was recorded calling a Dominion lawyer a 'slimy little motherf**ker' that 'triggered' him during his lawsuit deposition 'That guy, he triggered the s**t out of me,' he said.  The amount of times I had: \"First of all, f**k you,\" on my lips was like, it was unbelievable' Carlson's disposition occurred on August 26, 2022, and the former Fox News host accused the lawyer of speculating that he 'cheated on my taxes' Tucker Carlson has been caught on tape calling a Dominion lawyer a 'slimy little motherf**ker' that 'triggered' him during his deposition. ",
        "Carlson, who was recently let go from Fox News after 14 years, was on Wednesday the target of another leaked video filmed from behind-the-scenes of his axed show Tucker Carlson Tonight. The video appeared to have been recorded the same day Carlson had his deposition for the Dominion lawsuit - August 26, 2022 - as he is wearing the same suit. The conservative host can be seen wiping his face with a makeup wipe and telling his staff the opposition's lawyer 'triggered' him. ",
        "'That guy, he triggered the s**t out of me,' he can be heard saying on the video, obtained by Media Matters. '\"Where are you now? Where do you live?\" The amount of times I had: \"First of all, f**k you,\" on my lips was like, it was unbelievable. Suggesting that I was - that I was cheating on my taxes?'Holy s**t, 10 hours [with] that slimy little motherf**ker sitting across from me,' he said. 'The amount, it was so unhealthy, the hate...the hate that I felt for that guy.' Carlson went on to say he doesn't like to feel hatred toward people because 'it's wrong' and it's 'totally bad for you to feel that way,' but he was unable to push the negative feelings away for Dominion's lawyer. ",
        "Yesterday, the same media outlet published more leaked footage of Carlson, where he joked about his 'post-menopausal fans' with his senior staff. Some of the remarks were included in a New York Times report last week which suggested they were among a trove of highly incriminating clips.They show Tucker bantering with producers, assistants and fellow hosts.In one, he makes a reference to someone's girlfriend being 'yummy,' and later, he jokes about relying on 'post-menopausal fans' to tell him how he looks on-air.In the first video, Tucker unleashes on Fox Nation while on the phone to a representative for Andrew Tate, the British influencer arrested in Romania earlier this year.He fumed that 'no one' was watching the service, and that his talents were going to waste.Tucker held the most successful show on primetime Fox News for many years.He also had a daytime show that was streamed on Fox Nation called Tucker Carlson Today.Tate's reps were begging Carlson to wear a sweater or t-shirt for their interview instead of his normal suit and tie.He refused, telling them part of the show would end up on his primetime, cable news show, and that he didn't want to become a 'slave to Fox Nation.'",
        "'Nobody's going to watch it on Fox Nation. Nobody watches Fox Nation because the site sucks,' he said. 'So I'd really like to just put the — dump the whole thing on YouTube. But anyway, that's just my view,. OK. I'm just frustrated with it.",
        "'It's hard to use that site. I don't know why they're not fixing it. It's driving me insane,' he continued. 'And they're like making, like, Lifetime movies.'But they don't, they don't work on the infrastructure of the site. Like what? It's crazy. And it drives me crazy because it's like we're doing all this extra work and no one can find it. It's unbelievable, actually. I don't know who runs that site.In other videos that Media Matters deemed 'creepy' and which the Times referred to vaguely last week, he joked about his own appearance and said he would wait for his 'post-menopausal fans' to tell him how he looked on-air.He joked under his breath that someone's 'girlfriend was yummy', then said: 'Just kidding, in case this is being pulled off the bird. Hey, Media Matters for America, go f**k yourself! I don't even know what his girlfriend looks like.'And if I did, I would not find her yummy.'To an off-camera assistant, he joked: 'I can never assess my appearance. I wait for my postmenopausal fans to weigh in on that.'",
        "Tucker has not commented at length about his firing and Fox's statements have been limited.Many sources have attributed his firing to his insubordinate comments about bosses, some of which were unearthed as part of the defamation lawsuit brought by Dominion Voting Systems.",
        "Fox News agreed to pay Dominion $787.5million in an 11th-hour settlement on April 18, moments before a trial was due to begin.The voting machine company had filed a $1.6 billion lawsuit against the network for  'giving life' to a 'manufactured storyline' about voter fraud after the 2020 election.Dominion has since come out and said they hope the lawsuit will be re-released un-redacted as there's more damning texts from Carlson inside. As part of the lawsuit discovery, Dominion's lawyers uncovered texts in which Fox hosts and journalists seemed to acknowledge that the fraud claims were not true or farfetched, but gave them airtime anyway. In their first interview since the lawsuit was settled unexpectedly, Dominion's CEO John Poulos and Stephen Shackelford, a lawyer who was involved in the case, told Axios they now want the full record to become unredacted.",
        "They also took credit for Carlson's firing, which came after senior Fox News executives learned what he had been saying in them in text messages that the lawsuit unearthed.'Dominion did not insist on them firing Tucker Carlson as part of the settlement.'But the very fact that that's what resulted out of all of this, and it's traceable from the work that Dominion set in motion.. of course I know what’s in the redacted stuff and I can't say anything about it.",
        "'I hope that it all gets un-redacted at some point,' Shackelford, a partner at Susman Godfrey LLP, told Axios."
    ]
}