{
    "articleURL": "/tvshowbiz/article-12055555/Tammy-Hembrow-celebrates-sons-birthday-ex-Reece-ex-fianc-Matt-Poole-admitted-new-love.html",
    "content": [
        "Tammy Hembrow reunited with her ex Reece Hawkins to celebrate their son Wolf's eighth birthday on the Gold Coast on Saturday.",
        "In a video posted to Instagram, the influencer, 29, was all smiles as she enjoyed a burger with Reece at the event.She rocked an eye-popping smart-casual look for the outing in a maroon crop top which she paired with a flowing blue skirt and designer black boots.Tammy's sister Emilee shared footage of the friendly exes as they reunited to co-parent at their eldest child's birthday party.It didn't take long for fans to congratulate Tammy on maintaining a successful co-parenting relationship with her former partner.",
        "'I love to see this. They're getting along for their children's sake,' one fan gushed and another added: 'Good on them. Hopefully the kids had a blast'.The pair, who split in 2018, also share daughter Saskia, five.It comes after Tammy's ex-fiancé Matt Poole revealed that he's in a new relationship. Matt made the confession on Saturday in a now-deleted Instagram comment obtained by the Influencer Updates account. Asked if his latest selfie was for his Tinder profile, the 34-year-old Ironman replied: 'I don't need Tinder. I'm happy with the new upgrade'. ",
        "Back in March, Tammy revealed why she really split with Matt by replying to a fan who asked 'What happened with you and Matt?' in the comments underneath a TikTok video.'Some people are just not meant to be together no matter how hard they try. We are much better as friends,' she wrote. ",
        "In October, the fitness influencer unfollowed the former athlete despite them being seen together the weekend prior.The pair began dating in 2020 and became engaged in November 2021 and two weeks later they announced they were also expecting their first child together - daughter Posy, who was born in June."
    ]
}