{
    "articleURL": "/wires/reuters/article-12038343/Mexicos-Cemex-beats-profit-estimates-price-hikes-easing-inflation.html",
    "content": [
        "By Kylie Madry",
        "MEXICO CITY, May 2 (Reuters) - Mexican cement maker Cemex posted a 14% rise in first quarter profit on Tuesday, as material cost inflation eased and price hikes on bagged cement paid off, sending its shares surging.\"This quarter marks an important inflection point,\" Chief Executive Fernando Gonzalez said in a statement, after the company worked to recoup margins squeezed by rising expenses.The company maintained its projections for the year, and said \"results and market trends could provide upside support\".\"We see this quarter's good performance as supportive of our case that 2023 results might beat current EBITDA guidance,\" Citi analysts said in a note, adding the company's outlook could be revised as soon as the next quarter.Revenue rose 8% to $4.04 billion, topping the analyst consensus estimate of $3.99 billion despite lower volumes in all of the company's product divisions. Net profit rose to $225 million from $198 million a year earlier.Cemex's price mix could rise 15% in 2023, the firm's Chief Executive Officer Fernando Gonzalez said in a call to discuss the results, adding the continued price hikes have helped them navigate the complex global inflationary environment.The company is set to improve its margins back to their 2021 levels in the next few quarters, he added.",
        "In Mexico, cement volumes dropped as customers switched to cheaper alternatives after Cemex hiked prices for bagged cement, the company said. Local prices for gray cement rose 17% year-over-year, while ready-mix concrete was up 24%.In the United States, the drop in volume was largely due to inclement weather snarling construction, Cemex added.Shares in Cemex were up more than 8% after the results, outperforming Mexico's main stock index, which fell 0.45%.Operating expenses rose slightly to 21.2% of revenue, mainly on higher administrative expenses.Operating earnings before interest, tax, depreciation and amortization (EBITDA) rose 7% to $732.67 million, easily beating the $664.74 million consensus estimate.Cemex's growth investments and \"urbanization solutions\" segment, which targets sustainable city development, gave a $40 million boost to EBITDA, it said. (Reporting by Kylie Madry, Natalia Siniawski and Valentine Hilaire; Editing by Kirsten Donovan, Deepa Babington, Alexandra Hudson)"
    ]
}