{
    "articleURL": "/wires/reuters/article-12040153/Gold-hovers-2-000-ahead-U-S-Fed-rate-verdict.html",
    "content": [
        "Fed rate decision due at 1800 GMT",
        "Perth Mint's April gold sales slip m/mUS job openings drop in March(Updates prices)By Ashitha ShivaprasadMay 3 (Reuters) - Gold prices held steady above the key $2,000-level on Wednesday, while investors turned their attention to the U.S. Federal Reserve's interest rate decision due later in the day.Spot gold was trading in a narrow $5.48 range, holding its ground at $2,017.09 per ounce by 0648 GMT after rising more than 1% in the previous session, as yields dropped on renewed fears of contagion in the U.S. banking sector.U.S. gold futures were up 0.1% at $2,025.60.The Fed's rate decision will be announced at 1800 GMT. Most investors expect the U.S. central bank to raise interest rates by another 25 basis points, but are looking for clues on its next steps.\"If the Fed were to surprise with a pause, this would suggest a deepening banking crisis and would likely send gold higher,\" said Clifford Bennett, chief economist at ACY Securities.Bullion is known as a hedge against inflation and economic turbulence, but higher rates tend to dent zero-yielding asset's appeal.Data on Tuesday showed that U.S. job openings dropped in March and layoffs increased to the highest level in more than two years, suggesting some softening in the labor market.",
        "If uncertainties about the banking crisis and concerns over a potential U.S. debt default persist, the dollar will loose its shine and more light will fall on gold, Bennett said.Top U.S. Senate Republicans on Tuesday called on President Joe Biden to accept their party's debt-ceiling package or make a counter-offer, while a top Democrat said the Senate might try to advance a \"clean\" debt-ceiling hike next week.On the physical front, Perth Mint's April gold product sales slipped more than 6% month-on-month, while silver sales hit a six-month peak.Spot silver dipped 0.5% at $25.27 per ounce.Platinum fell 0.1% to $1,064.94, while palladium gained 0.6% to $1,438.25.Analysts have cut their forecasts for palladium after a 60% price fall, but rising vehicle production should limit any sell-off, a Reuters poll showed. (Reporting by Ashitha Shivaprasad in Bengaluru; Editing by Sherry Jacob-Phillips and Varun H K)"
    ]
}