{
    "articleURL": "/wires/ap/article-12057963/Pro-Biden-groups-spend-20M-promote-record-ahead-24.html",
    "content": [
        "WASHINGTON (AP) - Three progressive groups are spending more than $20 million in a new national ad campaign to promote President Joe Biden's record as he begins his 2024 reelection race.",
        "The ads from the groups Future Forward USA Action, Climate Power and Way to Win Action Fund, first shared with The Associated Press, aim to sell voters on Biden's efforts to lower the cost of prescription drugs, create clean energy jobs, and support the middle class as inflation takes a bite out of their take-home pay. The groups aim to remind Americans of what Biden has done in office, as many Democrats believe their party has not done enough to educate voters about what they have accomplished after 28 months in power.\"The Biden-Harris Administration has a good story to tell, and we´re making people aware of the real difference these policies will make in their everyday lives,\" Chauncey McLean, the president of Future Forward USA Action, said in a statement. \"This national advertising and marketing campaign will reach audiences on their TV and digital screens to highlight the Biden administration´s record of historic job growth and common-sense reforms that bring down costs for working people.\"The ads, which will air on national broadcast, cable and streaming platforms, were informed by Democratic research into what Americans knew about Biden´s accomplishments and which they responded to most positively when they heard about them, according to a person involved in the spending who was not authorized to speak publicly.",
        "In an April poll from The Associated Press-NORC Center for Public Affairs Research, Biden´s job approval rating stood at 42%, a slight improvement from 38% in March. The March poll came after a pair of bank failures rattled an already shaky confidence in the nation´s financial systems, and Biden´s approval rating then was near the lowest point of his presidency. The same poll showed just 47% of Democrats say they want him to seek a second term, up from 37% in February.\"America´s clean energy boom isn´t an accident. Thanks to the Biden-Harris Administration´s clean energy plan, Big Oil is paying their fair share, and nearly 150,000 good-paying clean energy jobs are being created,\" said Lori Lodes, executive director of Climate Power. \"We´re excited to tell that story, and show Americans how President Biden´s clean energy plan is making a difference in their day-to-day lives.\"",
        "\"The accomplishments of the Biden-Harris Administration are historic, and they´ve made life better for all people. We´re going to tell that story to the multi-racial, multi-generational majority who made these changes happen,\" said Jenifer Fernandez Ancona, co-founder and chief strategy officer at Way to Win Action Fund. \"Americans are coming together to defend our freedoms and rebuild our communities after a challenging period of history. These policy victories give us a chance to keep building a better future that works for all.\""
    ]
}