{
    "articleURL": "/news/article-12058895/Caroline-Crouchs-killer-husband-persuades-parents-testify-life-sentence-appeal.html",
    "content": [
        "Pilot confessed to staging the murder of his wife and dog at their home in 2021He is now appealing the 27-and-a-half year sentence at a max security prison The Greek pilot who killed his British wife, Caroline Crouch, in May 2021 has convinced his parents to testify in his defence as he appeals his life sentence.",
        "At an appeal hearing in Athens today he told the court 'I regret what I did' and apologised to the family of his late wife.Babis Anagnostopoulos, 35, was sentenced to 27-and-a-half years for strangling his wife, 20, in front of their infant child at their home in Glyka Nera, Greece.The 34-year-old staged a crime scene, where he tied himself up and hanged the couple's dog, Roxy, from a bannister in a bid to throw police off the scent. Babis appeared at court after the trial was postponed when his defence lawyer, Alexandros Papaioannidis, fell sick and was unable to attend on 24 April.Babis is looking to convince the court that the murder of his wife was not premeditated but a 'heat of the moment' act. ",
        "'Babis' Anagnostopoulos was found guilty of the pre-meditated murder of his wife and sentenced to 27 and a half years in prison in 2022 for the crimes.He had claimed that burglars had broken into the couple's home in East Attica, killing the dog, Roxy, in an apparent effort to make the crime look more realistic.",
        "Babis was given a 27-and-a-half year prison sentence in May last year for the crimes.This included a jail term of 11 years and six months for the killing of Roxy, as well as a 21,000 euro fine (£18,316).",
        "For the murder of his wife, he received a life sentence.After the sentencing was passed, his lawyer said the outcome was 'expected'.But Babis has sought to reduce the sentence on the basis that, he claims, the killing was not premeditated.In February, Crouch's family spoke out against the appeal.Her father said: 'It is absolutely despicable that my daughter's killer is trying to get his prison sentence reduced because of his 'good behaviour.''The crime committed by the murderer, that of femicide, is a heinous crime that should deserve particularly severe punishment. 'In my opinion, men who kill their wives, for whatever reason, are the lowest of the low, ranking alongside paedophiles.'Babis will now call his parents and another four witnesses to take the stand in his defence during the appeal.  Ahead of today's hearing, defence lawyer Alexandros Papaioannides said: 'There are going to be quite a lot of new witnesses and documents that will contain elements that will help reverse this case. 'I think there will be a more correct assessment [by the court] of the circumstances that prevailed that day in regards to the crime he committed and whether it was committed in the heat of the moment.'",
        "Babis' lawyer, Alexandros Papaioannidis, has previously argued his client is a 'model prisoner' who 'reads a lot and works in the prison canteen' and should not be punished for a crime 'that was never premeditated.' ",
        "The state coroner has said that Crouch would have suffered 'a long and agonising death'.She was pinned down by the pilot as she slept in the couple's Athens maisonette, resisting as she attempted to fight back as he suffocated her for five minutes with a pillow."
    ]
}