{
    "articleURL": "/wires/ap/article-12054719/Spurs-beats-Palace-stay-hunt-European-places.html",
    "content": [
        "LONDON (AP) - Harry Kane´s first-half header helped Tottenham to beat Crystal Palace 1-0 and keep alive their faint Europa League hopes in the English Premier League on Saturday.",
        "Kane´s 28th goal in all competitions settled a drab contest and moved him ahead of Wayne Rooney into outright second on the league´s all-time leading scorer list with 209.It was enough for Ryan Mason to secure a first victory in his second spell in charge of Spurs, who have jumped up to sixth. But seventh-placed Brighton has three games in hand and is two points behind the London club.While most eyes pre-match were on the coronation of the King, Tottenham sprung a royal surprise with its lineup.Emerson Royal started and Yves Bissouma was on the bench despite both being sidelined with injuries that were expected to keep them out for another couple of weeks. Also, Eric Dier was dropped for the hosts to go to 4-3-3.Given both clubs were involved in seven-goal thrillers last weekend, action aplenty was anticipated but the majority of the first half was played at a subdued pace.Cristian Romero hit the crossbar with a near-post header from Pedro Porro´s 17th-minute corner, and Pierre-Emile Hojbjerg fired over on the turn from Kane´s pass. Spurs were experiencing teething problems in their new system.When Joachim Andersen scooped over for Palace under pressure from Ben Davies, it seemed the opening 45 would end goalless, but Kane had other ideas.",
        "The stand-in captain sprayed the ball out wide to Porro, who whipped in a wonderful cross for Kane to head home.After halftime, Bournemouth's Eberechi Eze dragged a shot wide early after fine work by Wilfried Zaha, who clipped over minutes before.Zaha´s influence was growing. and he turned Emerson inside out before his cross deflected onto the roof of Fraser Forster´s net. Also, Tottenham´s backup goalkeeper saved well from Cheick Doucoure.Tempers boiled over late and referee Darren England issued nine yellow cards in total but Tottenham held on to end their four-match winless run and keep a first clean sheet since Feb. 26.___More AP soccer: https://apnews.com/hub/soccer and https://twitter.com/AP_Sports"
    ]
}