{
    "articleURL": "/tvshowbiz/article-12059781/Cristiano-Ronaldos-girlfriend-Georgina-Rodr-guez-gives-peek-palatial-Saudi-digs.html",
    "content": [
        "They relocated to Saudi Arabia in January when he signed a £175 million-a-year deal to play for the country's Al Nassr team. ",
        "And Cristiano Ronaldo and his girlfriend Georgina Rodríguez look to be settling into Saudi life swimmingly, as illustrated in her new Instagram posts, which gave a peek of the lavish digs they are calling home in the Middle East. In her images from their stay, Georgina looked nothing short of sensational as she posed up a storm in a bikini alongside a shirtless Ronaldo and their kids. Cristiano has son Cristiano Jnr, 12, and twins Eva and Mateo, five, who he had before he met Georgina, and they are parents to daughter Alana Martina, also five, and 13-month-old baby Bella, who they welcomed in April last year.  Georgina looked incredible in the snaps as she posed up a storm in a blue bikini while reclining and showing their fleet of pricey cars.",
        "Not content with showing off her own incredible figure, she was also getting snap happy over her hunky boyfriend and sharing snaps of his shirtless form. Reclining in their idyllic looking pool, the couple were taking time to relax in the sunshine while playing with baby Bella Esmeralda in the pool. It was reported in January that the star striker was living in accommodation fit for a king that affords him the best view of the capital in the plushest of surroundings.",
        "The former Manchester United star, who has signed for the largely unheralded Al-Nassr in the Saudi Pro League with a package worth more than £400m, is staying in the Kingdom Tower, one of the tallest buildings in the country.He was being put up in one of the best suites that Riyadh can offer in one of 17 rooms occupied by his entourage, including his family, friends and security detail. It is estimated that the hotel bill for Ronaldo and his entourage will surpass £250,000 when he checks out and has found a permanent home for Georgina and their kids - which seems to have happened given her new snaps. ",
        "Georgina and footballer Cristiano famously met while she was working as a retail assistant in Madrid, as they caught eyes across the rails in Gucci in 2016.Last year, she admitted that the meeting with the Juventus star saw her 'fall in love at first sight'. She claimed that the feeling was mutual following their encounter as she revealed in a recent interview with Italy's Elle magazine.Georgina said: 'The first meeting with Ronaldo was at Gucci where I worked as a sales assistant. Days later we saw each other again at another brand's event.'It was then we could talk in a relaxed atmosphere, outside of my work environment. It was love at first sight for both.' #",
        "In October 2021, the couple revealed they were expecting twins but tragically their son died at birth on April 18, while their daughter Bella Esmeralda survived.",
        "The Manchester United star welcomed son Cristiano Jr and twins Eva and Mateo with surrogate mothers. Ronaldo's oldest son Cristiano Jr. was born in the United States in 2010 but immediately taken back to Madrid to be raised in Spain. The identity of his mother is unknown.In June 2017, the then-Real Madrid star surprised fans with the news he'd welcomed twins Eva and Mateo through a surrogate, and just one month later he and Georgina announced they were expecting their first child together.Cristiano has in the past claimed he wants to take his tally of children to seven, matching his notorious shirt number and lifestyle brand CR7. "
    ]
}