{
    "articleURL": "/news/article-12051811/Son-20-weeps-court-charged-murdering-mother-54-Staffordshire-home.html",
    "content": [
        "Finn Henry, 20, appeared in court charged with murdering mother Suzanne, 54She was found in a Staffordshire home on Monday and died on Wednesday night A man wept in court today as he was charged with the murder of his mother after she was found with serious facial injuries.",
        "Suzanne Henry, 54, died on Wednesday night after police found her inside a house near Newcastle Road in Madeley, Staffordshire, at around 10pm on Monday.Her son Finn Henry, 20, was charged with her murder on Thursday afternoon.Today Henry appeared at North Staffordshire Justice Centre where he cried throughout the most of the hearing and held his head in his hands.He spoke in court to confirm his name and date of birth and then answered 'yep' when he was told he would be remanded into custody.",
        "Henry clasped his hands together as he left the court and shouted 'love you all' to his relatives, who held each other in the public gallery, the Sun reports.Police were called following reports of a man acting suspiciously on May 1, Staffordshire Police said, and a 20-year-old man was arrested on suspicion of attempted murder.Mr Henry was then further arrested for murder while in custody following Ms Henry's death.Detective Inspector Adrian Webb, from the force's Major Investigations Department, said: 'My thoughts and condolences are with Suzanne's family at this deeply traumatic time.'I understand the state of shock, both in the family and the wider community, that such a tragic event has happened in the town of Madeley.'We are solely focused on securing justice for Suzanne's family and making sure we do everything possible to support them through this incredibly difficult time.",
        "'I'd like to thank all of those who have already been in touch with information and for the patience which has been shown around the cordon on Newcastle Road.'There could still be people with valuable information that haven't come forward yet and we'd urge them to get in touch with us as soon as they can.'Police have reiterated their appeal for anyone in the area between 5pm and 10.15pm on Monday to come forward online."
    ]
}