{
    "articleURL": "/sport/mma/article-12040993/Kamaru-Usman-just-accept-losing-Leon-Edwards-wants-FOURTH-clash-British-star.html",
    "content": [
        "Leon Edwards defeated Kamaru Usman by decision to defend his title in LondonWelterweight champion is now 2-1 up over three fights with 'Nigerian Nightmare'But former champion still feels he needs closure and another contest  Kamaru Usman is struggling to get over his second defeat by welterweight champion Leon Edwards - and wants a fourth fight with the British star. ",
        "Edwards shocked the world by knocking out Usman with a late head kick last year before defending his belt in their trilogy in London back in March via majority decision. 'The Nigerian Nightmare' says he 'can't accept' it and needs 'finality', meaning a fourth fight with 'Rocky'. He told ESPN: 'I still felt like like there wasn’t finality to the fight.'The rest of the world kinda still feels like that but props to him. Right now he has that belt and we have to respect that, but I need finality.",
        "'My thing is I need finality. I need you to show me you are better than me from start to finish. 'Maybe it’s just me selfishly that I need to feel that. If you can’t show me that, you’re not better than me. I just can’t accept that.'He added: 'Of course, he did what he needed to do to get the win and he did it, so he’s the champion right now and I respect that'But I know where I’m at and the level which I still function and where I can. I’m still growing in the sport. 'As crazy as it is to say, I’m still growing in the sport. So, I’m excited to see what’s next.'",
        "He also talked up a fight with fearsome undefeated star Khamzat Chimaev to earn himself another title shot. 'I think Leon needs to definitely keep defending that belt and myself, I’m No. 1 in the world in that division,' Usman said. 'I think it’s who’s No. 2? Colby [Covington]. They’re gonna fight and No. 3 is Khamzat [Chimaev]. So, I think a fight with myself and Khamzat, boom. ",
        "'And if he (Edwards) keeps winning, I think that’s the fourth fight, 100 percent.'It remains to be seen whether Chimaev can still cut down to 170-pounds given his badly botched weight cut last time out. If he and the UFC are confident he can make it, the Usman showdown would be a logical and compelling match-up to make.  "
    ]
}