{
    "articleURL": "/wires/aap/article-12061461/Lifeline-Tasmanias-mother-baby-unit.html",
    "content": [
        "A mother-and-baby unit will be established in Tasmania's public hospital system after the service was set to disappear from the state.",
        "St Helen's Private Hospital in Hobart recently announced it would close in June because operator Healthscope was unable to fund multimillion-dollar repairs on the heritage-listed building.The hospital contains 31 beds for mental health patients, as well as eight private beds for mothers and their babies - the only service of its kind in Tasmania.The state government has pledged to set up three mother-and-baby beds at the Royal Hobart Hospital by mid-June.The unit will accommodate mothers experiencing mental health conditions such as postnatal depression and anxiety.Premier and Health Minister Jeremy Rockliff said setting up the unit was just the starting point.\"While we are disappointed by Healthscope's decision to close St Helen's Private Hospital, we are taking all proactive steps to minimise the impact on patients,\" he said on Tuesday.\"Continuity of care for those using the service is an absolute priority for us.\"Tasmanian Labor opposition MP Anita Dow said the announcement lacked detail.\"While the announcement is a good start for the many families that use the service, three publicly funded beds is clearly not enough to cater for the entire state,\" she said.Ms Dow urged the government to roll out public mother-and-baby unit beds across Tasmania.Mr Rockliff said mothers experiencing physical exhaustion or issues around feeding and settling would be accommodated in the Royal Hobart Hospital pediatric ward and other settings.",
        "He said work was ongoing to ensure the health system could provide other services lost by the closure of St Helen's Private Hospital.The government is working with Healthscope and unions to find employment opportunities in the public health system for staff who lose their jobs."
    ]
}