{
    "articleURL": "/sport/football/article-12050417/Liverpool-Mac-Allister-midfielder-fans-long-craving-for.html",
    "content": [
        "Brighton midfielder Alexis Mac Allister has been strongly linked with Liverpool The World Cup winner scored Brighton's winning goal against Man UnitedMail Sport takes a look whether Mac Allister is the midfielder fans have cravedIt feels like a long time since the question on everyone's lips was whether Liverpool could win an unprecedented quadruple. ",
        "This season the agenda appears to surround over which midfielders will be brought in this summer following a miserable season in which there Champions League prospects are slim at best. Fabinho, Thiago and Jordan Henderson all have suffered a decline in performance this season, while the likes of James Milner, Naby Keita and Alex Oxlade-Chamberlain are set to leave as the Reds look to strengthen their options.  Jurgen Klopp's side have been left to scramble over ideal midfield signings ever since they pulled all their eggs out of the Jude Bellingham basket.They could sign as many as three midfielders this summer, but as things stand, Brighton star Alexis Mac Allister is the one player that stands out.  ",
        "The 24-year-old has enjoyed a fantastic season for the Seagulls who are in contention to qualify for Europe, while he also started six out of seven games for Argentina in the World Cup - including the final.His 99th minute winner from the penalty spot against Manchester United will only increase the clamour among Liverpool fans, who are jumping on the Mac Allister bandwagon after their failure to sign Bellingham. Transfer expert Fabrizio Romano reported on Thursday that the Reds have presented their project and financial proposal to the midfielder and that discussions are advancing - though no agreement has yet been reached. ",
        "He could cost as much as £70m - a large fee for the Reds to pay - though much cheaper than what it would have taken to bring Bellingham to Anfield. Mac Allister is a versatile midfielder who predominantly plays as a central midfielder, but has also proven he can play in the middle of the park in both deeper and more advanced positions. It's obvious to see how important he has been for Brighton's success when you see that he has played 95 per cent of all minutes that he has been available for the Seagulls this season.On the other hand, Henderson and Fabinho's importance for Liverpool is not quite what it once was to Klopp - most likely because of their weak form. Henderson has played just 65% of minutes when he is available and Fabinho 79%.",
        "Thiago has played 92% of minutes when he has been available, and though he has appeared to be Liverpool's strongest midfielder, he has only made 18 Premier League appearances this season. If Liverpool are to return to the summit of the table, they need their star players to be fit, fresh and on form something which has not happened this season. And with Thiago, Henderson and Fabinho all in or approaching their 30s, it's clear a refresh with younger talent is required.  ",
        "There have been suggestions over recent seasons that Liverpool have missed a player like cult hero Georginio Wijnaldum when the Dutchman was in his prime years at Anfield -  an energetic attacking midfielder by trade who can play a deeper role when called upon.Comparisons can certainly be drawn between the pair, and if Mac Allister could guarantee the same amount of success Wijnaldum helped deliver in the red shirt, Klopp would shake hands on a deal for him immediately. The Brighton star out of all of Liverpool's rumoured midfield targets, feels most like a Klopp signing. Someone who has the physical capabilities to bring boundless energy to the midfield, and help create the high-intensity high-pressing style Klopp relishes from the dugout.  Out of all of his statistics this season, there will be one that will get Liverpool supporters jumping out of their seats the most and that's his impressive goal tally.",
        "This season he has netted nine goals in the Premier League. The last time a Liverpool midfielder got close to that tally was Adam Lallana with eight league goals in the 2016-17 season.Stat gurus Delphlyx show that Mac Allister has superior numbers in a number of key defensive and attacking statistics compared to both Jordan Henderson and Thiago - the likely two players he would be challenging the most for a starting position.  ",
        "Against Henderson, he provides more attacking actions per game including shots, while he also wins more defensive duels and has more successful dribbles. The Liverpool captain to his credit, has a big advantage in terms of interceptions won per game, key passes and progressive passes.In comparison to Thiago, the Spaniard dominates the defensive statistics, though Mac Allister again provides more attacking actions per game, as well as higher numbers in terms of key passes, progressive runs and shots. His comparison to Borussia Dortmund star Bellingham is perhaps the most interesting of all, as Delphlyx says there's an 87% comparison rating between the two players - suggesting he is more similar to the England star as a player compared to Henderson or Thiago.",
        "Their statistics also suggest Mac Allister is a more well-rounded player than either Thiago or Henderson. Mac Allister has high numbers in terms of pressing and offensive duels, progressive runs, successful smart passes and expected goals. Unlike the Argentine star, Henderson has a number of low numbers on his chart when it comes to loose ball and offensive duels won, expected goals and his ball recovery is slightly less than the 24-year-old.Thiago has low numbers in terms of successful key passes, expected goals and assists, pressing duels and successful smart passes.",
        "In terms of statistics per 90 minutes, Mac Allister creates more chances and has more shots on goal.",
        "However, he averages less passes, tackles, interceptions, duels, total carries and possession won per - though to Mac Allister's credit, Thiago has played over a 1,000 minutes than the Argentine star, with 11 fewer appearances. Despite Liverpool's strong interest, it would be no surprise to see them face competition from other Premier League sides or top European clubs abroad given his form this season.Liverpool went away from Bellingham because they needed a bigger squad reinforcement this summer rather than one big-money addition.With talks the Reds could bring in three midfielders this summer, the Reds will hope that Mac Allister can fit inside their budget, and allow them to bring in further reinforcements to leave Liverpool in a stronger position for next season.  "
    ]
}