{
    "articleURL": "/news/article-12054253/How-UKs-broadcasting-giants-covered-Coronation-battle-TV-ratings.html",
    "content": [
        "Follow our live blog for all the latest updates on the King's Coronation How are YOU celebrating the Coronation? Send your pictures and videos to pictures@mailonline.co.uk Britain's broadcasting giants hit stumbling blocks today as they battled for the top TV ratings while they covered the historic Coronation of King Charles III.",
        "Furious royalists slammed the BBC after being forced to switch channels following a series of intermittent audio glitches amid its coverage of the ceremony.Sky News was met with backlash over its reporting on the 'Not My King' protests which saw police arrest several Republic campaigners as the Coronation festivities were underway. The Good Morning Britain Coronation Special on ITV descended into chaos this morning after a presenter appeared to swear on the air, resulting in viewers wrongly accusing longtime host Susanna Reid of the live gaffe.Similarly, the nation was left divided over BBC presenter Huw Edwards' commentary which saw him spending 'five minutes' talking about spoons. Sky host Kay Burley was also mocked online after she appeared to butcher Queen Camilla's name - calling her 'Camilly' - during today's broadcast.",
        "The BBC had positioned itself to be a leader in Coronation coverage ahead of this weekend's festivities - even offering a special one-off TV licence dispensation - but its broadcast was heavily criticised today following a slew of errors. Outraged royalists complained on Twitter after 'breaks in the sound feed' interrupted their viewing of the historic ceremony. Critics said the network's sound failure was 'shocking' especially since the BBC had 'months of preparation and years of anticipation' for the monumental event.One alleged that when asked what he remembers most from the historical event he would say 'BBC f*****g the sound up'. Others demanded an 'on-screen apology' from the broadcaster as they vowed to switch the channel to ITV and Sky.",
        "'Come on BBC. Sort the sound out on your outside broadcasts. Keeps breaking up,' Twitter user Jane Trout penned, adding: 'Going over to ITV to watch the Coronation without the hiccups.''Bloody dreadful sound quality for the Coronation,' tweeted Helen Parsons.'Months to prepare, but the BBC clearly have sound issues today of all days!' Twitter user Sherri added: 'Glad it's not my TV but disappointing that the sound has been cutting out so frequently...' Another viewer deemed it 'frankly embarrassing' that the network that 'specialises in effective and smooth communication' had so many breaks in its sound.",
        "The BBC also faced mixed responses over the commentary during its Coronation broadcast, specifically remarks made by presenter Huw Edwards.He was accused of 'throwing shade' at Prince Andrew and former Prime Minister Liz Truss as they made their separate entrances into Westminster Abbey.Mr Edwards said it was a 'rare public appearance from the Duke of York' and introduced Ms Truss as 'Prime Minister for a very brief period, Liz Truss'. One viewer tweeted: 'Top trolling from Huw Edwards there.' A second said: 'Love the subtle shade from Huw Edwards.''With all respect to Huw Edwards what we need at this point is Graham Norton’s “four drinks in” Eurovision commentary,' another stated.He was also criticised on Twitter for spending 'five minutes' talking about spoons. ",
        "One person wrote: 'Huw Edwards has just spent five minutes talking about a gold spoon!!' Another added: 'I’d love it if Huw Edwards could narrate my day. “And here, as you can see, the ceremonial opening of the fridge and the much hallowed ham has been officially opened, ready to be presented to the bread, bringing to an end hours of peckishness”.'",
        "The criticisms of the BBC came amid backlash from royal correspondent Jonny Dymond after the broadcaster branded Charles's Coronation 'the strangest show in town'.In his BBC article, Dymond references Australian singer-songwriter Nick Cave, who will attend today's event 'for the bizarre, the uncanny, the stupefying spectacular, the awe inspiring'. Dymond then states that 'the Coronation will be all these things and more', headlining his article 'the strangest show in town'. One person wrote on Twitter: 'This seems a somewhat \"strange\" adjective to use by the #BBC Royal Correspondent.'Why pick on the Coronation?' Another wrote: 'What a waste of our licence money. This reporter helpfully tells people areas to avoid in London and other unnecessary advice as to how to avoid \"the strangest show in town\".'People who don’t want to go, or even know about this historic day have already made their plans.' ",
        "Dymond also wrote: 'Every big royal occasion, jubilee or wedding, birth or death, is an opportunity of sorts.",
        "'A chance to remind the nation and the world of the institution's role and relevance. And a moment to reinvent and rebrand.' He added: 'And this Coronation comes against a challenging backdrop.' Similarly, ITV came under fire today over Good Morning Britain's Coronation Special, which was presented by a range of hosts including Ben Shephard, Kate Garraway and Susanna Reid.Ms Reid was presenting a link in which she was preparing to cut to Ms Garraway at Buckingham Palace as she told viewers: 'Now, many people would say she is and has been one of the most vilified figures in Britain, but today she will be crowned Queen.'The public mood towards Camilla, the Queen Consort, has definitely softened in recent years, and she is now considered one of the most senior royals of course. Kate is at Buckingham Palace.' But as Ms Garraway began to speak when the camera cut to her, viewers heard a voice who they wrongly assumed was Ms Reid which said: 'B***h, it is not good' before Ms Garraway promptly carried on with her broadcast.The expletive was uttered by correspondent Petronella Wyatt, who later admitted she was responsible for the gaffe, but not before viewers blamed the long-serving host. ",
        "A debate involving amused viewers then erupted on Twitter, as they queried how the blunder occurred and if it was Susanna who said the rude word.",
        "One person wrote: 'I can't rewind tv, but was someone's mic still on, called someone a b***h?'Another said: 'I swear someone just said b***h as it went to Kates part' while a third added: 'Susanna and Ben blushed and smirking says everything. It was defo their convo when we overheard the word 'b***h in GMB'.Someone else penned: 'Did I just hear Susanna off camera on a live mic say b***h?'A separate person reacted with laughing emojis as they shared a clip of the moment, and someone else wrote: 'Swear someone just said b***h in the background while talking about Camilla.'Another penned: 'I'm obsessed with it not even being 8am and Susanna has called someone a b***h off camera. Coronation day is brightening up!' Meanwhile, journalist Petronella Wyatt claimed it was her who had sworn and a mic had picked it up.She said: 'Oops. Was off air this morning when a mike picked me up having a private chat about how a royal had been unfairly smeared in some quarters as a b….. apologies if anyone thought it referred to them. It didn't!!'Elsewhere on the show, as the King and his wife began their procession to Westminster Abbey, Kay Burley mistakenly called the Queen 'Camilly'.",
        "Some viewers said they hoped the accidental nickname would 'catch on', while others seemed disappointed by the blunder. ",
        "Sky was also met with divided response over its coverage of the 'Not My King' protests that took place in Trafalgar Square while the Coronation ceremony was taking place.The demonstrations were held by campaign group Republic, which claims the Royal Family has no place in a modern constitutional democracy and is staggeringly expensive to maintain. Director of Republic, Harry Stratton, told MailOnline that some of the group were cuffed by Metropolitan Police officers as they arrived at Trafalgar Square this morning. The group's megaphone-wielding chief executive Graham Smith was among those arrested, while police said they had seized multiple lock-on devices and hundreds of posters.Some Twitter users applauded Sky for covering the demonstrations, while others thought it took focus away from the ceremony.One user, slamming Sky's competitors, said: 'Has the BBC found space in its acres of reverent Coronation coverage to mention that people have been arrested for peaceful protests? I've heard nothing. Nada.'Sky News and TalkTV have both taken pictures of the arrests. Sky even interviewed a rep.'",
        "'BBC are not showing the protests on the streets of West Minster Abbey, switching to sky,' a second said. Another added: 'Interesting to see Sky showing the Republic protests but not the BBC.' One user implied that Sky over dramatised its coverage of the demonstrations, saying: 'The way they've been talking about the protests, I thought there were 1000s of them. There's about 100 of them if that, judging by Skys pictures. Talk about making a huge deal out of very little. Don't get me wrong, though they should never have been arrested.'"
    ]
}