{
    "articleURL": "/sport/football/article-12042749/Manchester-United-unveil-statue-legendary-assistant-manager-Jimmy-Murphy-outside-Old-Trafford.html",
    "content": [
        "Jimmy Murphy played was key in Man United's rebuild after the Munich air crashHe led them to the FA Cup final after eight players lost their lives in the disasterA statue of the club legend has been unveiled at Old Trafford's Stretford End Walking through the Munich Tunnel at Old Trafford on Wednesday, you emerged from the gloom and into the sunshine behind the Stretford End where Jimmy Murphy's statue was about to be unveiled.",
        "It was a scene befitting the man who did more than anyone else to lead Manchester United out of the darkness of the 1958 air disaster when all seemed lost.By a twist of fate, Sir Matt Busby's right-hand man wasn't on British European Airways Flight 609 when it crashed on take-off in Munich after stopping en route from a European Cup tie against Red Star Belgrade.Murphy was also manager of Wales and couldn't make the journey to Yugoslavia because he had a World Cup qualifier against Israel in Cardiff that saw the Welsh reach the finals for the first time.In the aftermath of Munich, he went one by one to the beds of the survivors at the Rechts der Isar Hospital and arranged for the coffins of those who didn't make it to be returned to Old Trafford where they were laid out in the gymnasium.",
        "He sat with the gravely injured Busby who grasped the hand of his assistant and whispered: 'Keep the flag flying, Jimmy.' Murphy did just that. Having helped build the Busby Babes - eight of whom perished among the 23 lost at Munich - he somehow put together a team made up of the survivors, amateurs and apprentices and incredibly led United out for a FA Cup tie against Sheffield Wednesday just 13 days after the tragedy. They even reached the Cup Final that season, losing to Bolton Wanderers.",
        "His statue was unveiled on Wednesday, 65 years to the day since that Wembley appearance, the latest tribute to the man who did more than anyone else to help United rise from the ashes.The club's Young Player of the Year award has already been named after the inspirational coach whose first job at United was to nurture the youngsters.. The room in which Erik ten Hag spoke as usual before Thursday's game against Brighton is on the first-floor of the Jimmy Murphy Centre.'I think it's very good that the club gives so much honour and congratulations to the main person in the history of Manchester United,' said Ten Hag.",
        "'He stands for more symbols: a symbol of youth and youth development. He stands for resilience and determination, and they are the standards for Man United.'After Munich, a manager and many players fell away. The club was devastated and they bounced back, and this person played the main role. It's totally deserved he gets an honour for this. The Jimmy Murphy Centre, the Jimmy Murphy Young Player of the Year and now this statue - it's fantastic.' An official ceremony attended by club dignitaries was held ahead of the unveiling behind the Stretford End where the statue now overlooks the cinder pitch that Murphy used to train the Busby Babes.",
        "Either side of the statue were two banners bearing quotes from Murphy. 'We have the greatest club spirit in the world,' read one. 'It can be done, it will be done, I'll make sure of it,' declares the other.In the 2011 BBC drama about the Babes, David Tennant - the actor playing Murphy - utters these words in response to a threat from the FA to close United down because they were no longer able to compete.Whether that was strictly true is debatable, but there is no doubt that Murphy led United back into the light and effectively saved the club.He did so while leading Wales to the World Cup finals in '58 where they were beaten by Brazil and Pele's goal in the quarter-finals. Such was Murphy's reputation in the game that he was later offered the Brazil job and declined it.",
        "A wing-back for West Brom and Swindon, he met Busby by chance after their careers were interrupted by the Second World War.They were both deployed to Bari, Italy where Busby was impressed by Murphy's motivational skills while coaching the Army football team.'He spoke as if delivering a sermon and we were all transfixed,' recalled Busby. 'It was his attitude, his command, his enthusiasm and word power that caused me to say to myself: \"He's the man for me\".' United were still playing at Maine Road while Old Trafford was repaired in the aftermath of the bombing raids. It was a fitting start for a partnership that was to become characterised by strength in the face of adversity.",
        "They built the Busby Babes and then started all over again on a team that went on to lift the European Cup 10 years after the tragedy.After working as a coach, assistant manager and temporary manager, Murphy ended his time at United as a scout. He died in 1989, aged 79.As you walked back through the tunnel after yesterday's ceremony, Murphy's role in United's resurrection is depicted in the glass cases that chart the story of Munich. Now it will be immortalised in bronze as well."
    ]
}