{
    "articleURL": "/wires/afp/article-12054205/Pacific-Island-tribe-celebrates-Charless-coronation.html",
    "content": [
        "A small South Pacific island boomed with song on Saturday as hundreds gathered for King Charles's coronation, a momentous occasion for villagers who believe his father was a local deity.",
        "The volcanic island of Tanna in the south of Vanuatu is the cradle of the Prince Philip movement, which claims the late royal patriarch as a long-lost ancestor.A world away from the coronation pageantry at Westminster Abbey, some 1,000 islanders gathered in the lush, rugged highlands to mark the coronation.The verdant hills rang with polyphonic harmonies as men, women and children -- all clad in grass skirts or gourds -- skipped through the village in a joyous display of song and dance.Villagers also feasted on local delicacies and drank shells full of kava -- a peppery, mildly intoxicating root drink that is a key part of Pacific culture.",
        "\"I'm very happy\" Chief Yabah, who once travelled to Windsor Castle and met Philip, told AFP, \"because Philip's child is Charles. I'm very happy with Charles.\"Yabah said he would like to visit Buckingham Palace, but also extended an invitation to the new king.\"I want him to come to my place and see me here, in Tanna,\" he said.British diplomats joined them on a special coronation mission, gifting tribal leaders a framed portrait of Charles in a symbolic display of mutual respect.They will add it to a fading collection of photographs showing Philip in his prime, which have long been among the movement's most treasured possessions.",
        "Acting UK High Commissioner Michael Watters -- who flew to Tanna from the capital Port Vila -- shuffled in at the end of a long procession, flanked by village elders.\"I've been greeted with such warmth and joy by the community,\" Watters told AFP.\"The ceremony was a wonderful way to pay respect to the unique relationship shared by the UK and Vanuatu.\"- Enduring relationship -Although Philip had a reputation for culturally-insensitive gaffes, he treated the movement and its followers with sincerity and respect.He wrote them letters, sent them signed photographs and even sat down with leaders at Windsor for a private meeting in 2007.",
        "His death in 2021 shook the island of Tanna, prompting much soul-searching among tribal elders concerned about the future of their \"kastom\", or customary beliefs.Anthropologist Kirk Huffman -- the former curator of Vanuatu's national museum -- said the gifts from British officials would infuse Saturday's celebrations with a deeper significance.\"That will probably signify (to the villagers) that Prince Charles wants the relationship to continue,\" he told AFP.The Prince Philip movement can be traced back to the 1970s, when the Duke of Edinburgh visited the former British and French colony then known as the New Hebrides.",
        "Although the origins remain murky to outsiders, anthropologists believe this fulfilled an age-old prophecy about the return of a pale-skinned son.",
        "Some believed he had set off from Tanna before World War II to marry the most powerful woman in the world.\"There's a whole series of clans that would have been waiting for this mythological person to return,\" Huffman said.The Prince Philip movement is concentrated in the villages of Yaohnanen and Yakel, which are accessed through a gruelling jungle track.Both lie close to the active volcano Mount Yasur, in a region famous for both its rich traditions of storytelling and spiritualism.Huffman said their beliefs were easily misunderstood, and often lazily associated with Western notions of a \"white god\"."
    ]
}