{
    "articleURL": "/tvshowbiz/article-12053941/Royal-fans-left-scratching-heads-star-attending-historic-event.html",
    "content": [
        "Royal fans were left scratching their heads on Saturday morning as they saw one unusual guest arriving at the King's Coronation. ",
        "As the anticipation built for the historic event, eagle-eyed viewers spotted Dynamo the Magician turning up with Stereophonics singer Kelly Jones at Westminster Abbey.Many queried why Dynamo, real name Steven Frayne, was there amongst such a star-studded line-up of guests including Ant and Dec and Katy Perry.People took to Twitter in their droves to express their confusion about the guest being at the event. One person wrote: 'Wonder what kind of chat Dynamo and Kelly Jones from the Stereophonics are having at the #Coronation do.'",
        " While someone else said: 'How has Dynamo ended up at the Coronation.'Another person wrote: 'I can't believe Huw Edwards didn't recognise the world's greatest magician Dynamo smh.'A separate person penned: 'Heavy that Charles doesn't have enough mates so had to invite Kelly Jones and Dynamo to his Coronation.'These are the faces of two men that feel very much out of their depth.'It was later revealed that, like Ant and Dec, Dynamo has a role within the Prince's Trust, founded by King Charles.He is an ambassador for the charity, which helped him greatly at the start of his career.It comes after Ant and Dec posed for pictures with a guest at the King's Coronation on Saturday morning as they prepared for the festivities to begin.",
        "They were among the hundreds of guests who had to take their seats in Westminster Abbey by 9am- and couldn't quite believe they'd been asked along.As they waited for the proceedings to kick off, the stars looked in good spirits as they took a selfie with another invitee. Ant and Dec smiled broadly as the man held out his phone and snapped the picture.",
        "Ant and Dec joked they were going to recruit for the next I'm a Celeb series as they spoke of how 'proud and privileged' they felt to be among those invited to the Coronation of King Charles. They burst out laughing at the fact they would be in the Abbey with dignitaries and world leaders ahead of the service this morning. Speaking in an ITV interview as they excitedly arrived, they were asked: 'How does it feel for you guys to not be the most important people in the room?''It feels wonderful to be honest,' Ant said. 'You know, I was watching all the coverage last night, I have been, leading up to it... people have been getting coronated at Westminster Abbey for thousands of years...'You're part of history! It's fantastic. So we're just happy to be invited.' "
    ]
}