{
    "articleURL": "/usshowbiz/article-12055463/ROBERT-GORE-LANGTON-reviews-Motive-Cue.html",
    "content": [
        " In 1964 John Gielgud directed Richard Burton on stage as HamletBurton was a boozy Welsh boyo superstar with a new wife – Liz Taylor – in tow The Motive And The Cue",
        "Lyttelton Theatre, London Until July 15, 2hrs 40minsRating:RetrogradeKiln Theatre, London Until May 27, 1hr 30minsRating:In 1964 John Gielgud directed Richard Burton on stage as Hamlet. Gielgud was a plummy, grand old actor of immense distinction. Burton was a boozy Welsh boyo superstar with a new wife – Liz Taylor – in tow. The result? Rehearsal room bickering, soaring bouts of Shakespeare and 1960s glamour galore. You also get to see Burton in his underpants – a first.The actors in this are bang-on. Mark Gatiss has Gielgud’s dry, headmasterly posture down to a tee. Johnny Flynn echoes the younger Burton’s piercing bugle voice. The two friends or, rather, frenemies, slug it out in rehearsals. Gielgud gives him notes and Burton bristles. He shouts too much and he drinks all the time. His Hamlet is Tom Jones on the lash.",
        "But in a way this is more Gielgud’s play. We see his buttoned-up Alan Bennett-ish sexuality and his lovely light irony and, above all, his thrillingly direct line into the mind of the Danish prince. If only he could get Richard to listen! The rehearsal scenes feel wonderfully authentic.Tuppence Middleton is not my idea of Liz Taylor. Too tinny, and top actors like Janie Dee (playing Eileen Herlie as Gertrude) and Allan Corduner (Hume Cronyn as Polonius) don’t have enough lines. A huge cast directed by Sam Mendes is expensively under-employed. Perhaps Jack Thorne’s latest is not a great play, but it’s certainly a great evening out.",
        "Retrograde is a burning-fuse play about the movie biz. A screenwriter, a studio lawyer and a young black actor are all hoping to sign a contract. The actor is the 28-year-old Sidney Poitier – on the up, angry, principled. The lawyer knows he is part of the Civil Rights movement and thus trouble for the studio. The horrendous price of his future career is to sign a pledge denouncing his great hero Paul Robeson.Playwright Ryan Calais Cameron superbly recreates the fast-gun patter that gave old movies their verbal colour. ‘I got Sidney Poitier in here acting like he was in a nunnery for grandpas,’ the lawyer despairs, trying to get his actor to take a mid-morning Scotch.Said lawyer is played with loathsome charisma by Daniel Lapaine, while Ian Bonar is the nerdy writer. As Poitier, Ivanno Jeremiah (left) is prickly and full of moral agonising.It’s a shame about the overly righteous ending. But there’s dialogue of the first order and it’s a joy to hear."
    ]
}