{
    "articleURL": "/news/article-12057925/Queensland-Police-downgrade-search-Thursday-Island-identity-Denne-Bourke.html",
    "content": [
        "Grave fears for coffee van operator Denne BourkePadding canoe in Torres Strait when he went missingFriends and family praying for miracle Hopes are fading to find a new dad who recently made coffee for Anthony Albanese after the extensive search was downgraded.",
        "Outrigger paddler Denne Bourke, 38, was last seen paddling his canoe in Torres Strait between Thursday and Horn Islands off far north Queensland last Wednesday but failed to return.A desperate large-scale search involving police and federal partner agencies was launched after his canoe was found 100 metres off Thursday Island later that day. His hat was later found on rocks between the two islands.Queensland Police has confirmed the rescue mission has been scaled back as the search enters its sixth day.Water and aerial searches will continue, but land-based shoreline searches have been suspended.",
        "'Family and friends would like to thank the community for their support and efforts with the search and rescue,' a police statement read.'They are very grateful for the local community's quick and detailed response. The kindness and generosity during this difficult time has been greatly appreciated.'The Department of Environment and Science also assisted in the search along with a contingent of local vessels.A Thursday Island local, Mr Bourke and his partner Georgia became parents for the first time three months ago.He ran a popular coffee van and was well-known among locals and tourists who visited Thursday Island.Australian Prime Minister Anthony Albanese, Australian basketball legend Patty Mills and a host of NRL and NRLW stars are among those who have crossed paths with Mr Bourke and his coffee van while visiting the island.",
        "Mr Bourke was also president of the Torres Strait Outriggers Canoe Club.His friends and family remain hopeful of a miracle. 'The sea and island search for Denne Bourke is continuing,' Townsville OCC wrote.'Our thoughts and prayers are with Denne, Georgia, their families and their wider Torres Straits OCC family. Such a terrible time for them.'Horn Island local Farhad Kamal was among the last people to speak to Mr Bourke at a grocery store on Thursday Island last Wednesday shortly before he hit the water.'It's hard to hold back the tears when you're thinking about him,' Mr Kamal told the ABC.'He's in everyone's thoughts and still we are hoping that a miracle will happen.'"
    ]
}