{
    "articleURL": "/money/markets/article-12042603/Why-banks-gone-bust-Im-shorting-them.html",
    "content": [
        "'How did you go bankrupt?' Bill asked. 'Two ways', Mike said. 'Gradually, then suddenly.' Ernest Hemmingway 'The Sun Also Rises' (1926)",
        "It seems incredible to think that just over a year ago, interest rates were still near zero, where they had been cut to in reaction to the Covid crisis. Now just 13 months later, after ten US rate hikes, the key Fed Funds rate – which is also the key interest rate for global financial liquidity – has increased to 5.25 per cent.Similarly, the Bank of England has now hiked 11 times to 4.25 per cent. This represents the fastest pace of monetary tightening experienced in over half a century, and if we consider the near-zero starting point, then the 20-fold rise from 0.25 per cent in the US (42-fold in the UK from 0.1 per cent) is probably historically unprecedented. ",
        "Considering this steep increase in the cost of money it is remarkable that we are yet to witness an economic recession or even a meaningful deterioration in the credit cycle. But four large banks have recently failed: first US duo Silicon Valley, Signature, and Credit Suisse, in Europe, and then recently First Republic in America.These institutions suffered a collective loss of confidence not just from their investors but crucially from their depositors, who transferred their balances elsewhere. These banks were reliant on these to fund loans and other investments. ",
        "Since the banks could not liquidate their assets at a fast enough pace to meet customer withdrawals, they ran out of cash, and were suddenly declared bankrupt.The extraordinary Covid economic stimulus - at a time when spending was constrained by lockdowns - saw a savings boom which would end up causing some banks to drown in their own liquidity. US bank deposits rose by an additional $4.4trillion (+37 per cent) in just two years, whilst at the same time demand for US bank loans rose by a measly $390billion (+3 per cent). These deposits, which at the time cost nothing, but needed to be invested somewhere, ended up in 'safe assets' such as government bonds and mortgage-backed securities. Ironically, this was also encouraged by financial regulators, who fighting the last war, were solely focused on credit risk and ignored the potential for valuation losses arising from higher interest rates on bond portfolios. ",
        "Barry Norris is the fund manager of the VT Argonaut Absolute Return Fund, a long/short equity fund which aims to generate uncorrelated double digit annual returns. The fund which benefitted from short positions against Silicon Valley Bank, Signature Bank and Credit Suisse in March, continues to have selective short positions in US regional banks.At the end of March, the VT Absolute Return Fund had returned 18.4 per cent over three years, 39.7 per cent over five years, 115 per cent over 10 years and 176 per cent since launch. ",
        "When interest rates began to rise US banks had fixed low yields on their investments, which would result in accounting losses, but had not locked in the low cost of deposit funding, since savers would now demand higher rates on their savings as the official central bank rate rose.When Silicon Valley Bank disclosed its theoretical losses on its bond portfolio if it ever had to liquidate its positions, its depositors panicked, withdrew their funding, meaning that the bonds were sold in a fire-sale, realising losses which its shareholders had no stomach to continue funding. A few days later, Signature Bank – which had similar funding problems but was also rumoured to have other issues related to money laundering from crypto – was also forced to close by US regulators.Following Walter Bagehot's Nineteenth Century dictum, that in a financial crisis, central banks, as 'lender of last resort', should lend freely, against good collateral, at a penalty rate, the Federal Reserve has now allowed banks to pawn their assets at their purchase - rather than market - price in return for cash, meaning that few banks should now fail solely owing to the absence of liquidity. However, since the cost of this cash comes at the key central bank interest rate, which is significantly above the interest rate passed on to savers on their deposits, this source of funding gradually becomes ruinously expensive for banks.",
        "American banks are currently paying an average interest rate of just over 1 per cent on their deposits compared to a 4 per cent average yield on their assets, generating an average spread of 3 per cent. Increasingly, individual savers and companies are switching their deposits to either 'safer' banks or to money market funds able to pay a yield close to the official interest rate of 5.25 per cent. Since it is unlikely that banks will be able to pass on higher interest costs to their borrowers without causing defaults, or invest in assets with higher yields without more default risk, bank profitability will now fall, as the spread between bank assets and liabilities will be squeezed.",
        "Banks which continue to lose deposits will now attempt to increase their liquidity, which will make less credit available to the real economy. This credit crunch will lead their customers to focus on their own cash-flow, which will constrain economic activity and depress asset prices, meaning it will be more difficult to liquidate assets without realising losses. It is likely this new credit crunch will accelerate the process of disinflation which began in the summer of 2022, but it will probably require a significant crisis for inflation, which has been stickier than expected, to fall back below the 2 per cent level that would justify monetary easing.",
        "Many will inevitably compare this banking panic to the financial crisis of 2008, but the better comparable is to the 'Savings and Loan Crisis' of the 1980's, during which more than 1,400 US banks failed, with the common cause of failure being the funding of long-term lower interest rate fixed-rate mortgages with higher cost short-term deposits. Paying more to their depositors than they were making on their mortgages, these Thrift Banks went bust gradually owing to chronically poor profitability, which their shareholders could not endure indefinitely and eventually were unwilling to fund.As they continue to hike rates, central bankers have also made clear through their actions and rhetoric, that any monetary policy U-turn - involving cutting rather than raising interest rates, which would relieve pressure on US bank funding costs- will only take place after a crisis and not before. Therefore, the US banking system looks stuck between a rock, with rising deposit costs eating into net interest margins, and a hard place, of economic crisis causing elevated credit losses. Neither is attractive from an investment perspective. ",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}