{
    "articleURL": "/news/article-12058451/Retired-Navy-senior-chief-claims-saw-metallic-orb-UFO-sky-Afghanistan-not-willing-jail.html",
    "content": [
        "A retired Navy senior chief petty officer revealed how he witnessed a metallic orb in Afghanistan similar to one seen in a video during a recent Senate hearingDue to security agreements and the fear of legal consequences, he is unable to come forward with more detailed information and has remained anonymousThe All-domain Anomaly Resolution Office (AARO), an agency within the US Office of the Secretary of Defense, investigates UFOsA retired Navy senior chief petty officer has said that he witnessed a metallic orb in Afghanistan similar to the one that was displayed in a video during a recent Senate hearing. ",
        "However, due to security agreements and the fear of legal consequences, he is unable to come forward with more detailed information.The retired Navy senior chief, whose identity continues to remain anonymous has said there is a need for a secure method for individuals to report potential unidentified flying objects (UFOs). 'I'm going to be honest with you. I'd love to tell everything in detail, but I'm not willing to go to jail to do it,' the retired Navy senior chief told Fox News. 'I'm constrained because of security agreements, so they need a way for submissions to be made.'According to the retired Navy senior, he along with other military service members observed a metallic orb from above in Afghanistan in the early 2000s. But being constrained by security protocols it means the materials that were collected are unable to be shared and analyzed. ",
        "'There's quite a bit of gray here, because the customer we were working for at the time retained all collected materials but I know where the bodies are buried, not necessarily where the digital data is though. I can point them in the right direction,' the Navy retiree stated. The very lack of such a secure reporting mechanism was criticized by lawmakers from both parties following the April 19 hearing of the All-domain Anomaly Resolution Office (AARO) before the Senate Armed Services Subcommittee on Emerging Threats and Capabilities.",
        "The AARO, an agency within the US Office of the Secretary of Defense, investigates unidentified anomalous phenomena (UAPs), the U.S. government's term for UFOs.During last month's hearing, Dr. Sean Kirkpatrick, the head of the agency, presented video clips but noted that the available data was insufficient to fully identify the events captured, simply describing them as 'unresolved cases.''This is essentially all the data we have of this event,' Kirkpatrick stated. 'It's going to be virtually impossible to fully identify that, just based off that video.'Kirkpatrick said his office is currently tracking 650 cases. ",
        "In response to the hearing, Democratic Senator Mark Warner and Republican Marco Rubio penned a letter to the Department of Defense (DOD) expressing their concerns there is no secure process for witnesses of UFOs to come forward safely. Speaking to Fox, Rubio acknowledged the public's concerns regarding unidentified objects in the country's airspace and near facilities.Rubio referred to February's incident in which the Biden Administration shot down Chinese spy balloons and three other UAPs, emphasizing the need for transparency and information sharing with Congress.Rubio said that not only are the American public lacking information about such incidents, but lawmakers responsible for oversight are also being denied critical details. 'What's worse, our government spent too many years ignoring or downplaying the threat. Thankfully, that is beginning to change, but as we saw earlier this year, the defense and intelligence communities are still struggling.' ",
        "During April's hearing, the video, shot from an MQ-9 Reaper drone in the Middle East in 2022, pans across desert scrub, over buildings, vehicles and people, struggling to keep up with a spherical object zooming over their heads.It is very similar to Reaper drone videos currently held on classified servers, described by an intelligence official to DailyMail.com last October, of 'orbs' flying around then 'suddenly bolting off the screen'.It is also similar to a drone camera image dubbed the 'Mosul Orb', leaked to documentarian Jeremy Corbell and first reported by DailyMail.com earlier this year, of a metallic-looking spherical object over an Iraqi city.Kirkpatrick revealed statistics gleaned from AARO's UFO cases from 1996 to the present day, describing ‘typically-reported UAP characteristics’ including ‘round, atypical orientation’; 1-4 meter size; white, silver and translucent color; altitudes of 10,000 to 30,000 ft; and speeds ranging from stationary to Mach 2 (1,534 mph).Typically there was ‘no thermal exhaust detected’ from the objects and they were caught only intermittently on 8-12 GHz radar and 1-3 GHz or 8-12 GHz radio.Kirkpatrick presented a map of ‘reported-UAP hotspots’ showing concentrations on the US East and West coasts, the Middle East around Iraq, and the Sea of Japan between Japan, South Korea and North Korea.",
        "However, he cautioned that this could be a ‘collection bias’ – as these are locations where the US military has the most assets to catch UFOs on camera and radar.32.2% of AARO’s cases flew at 20,000 ft, and 23.5% at 25,000 ft. Only 4.3% were spotted above 30,000 ft.52% were described as ‘orbs’, ‘round’ or ‘sphere’, and 23% they were unable to determine the shape due to ‘ambiguous sensor contact’.Despite some of the most famous recent cases involving sightings by Navy pilots of the East and West coasts of the US, only 1% of cases were described as having a ‘TicTac’ shape, and 2% ‘cylinder’.2% had a ‘disk’ shape and 2% triangular.The veteran intelligence officer and physicist told senators his office ‘will follow scientific evidence wherever it leads.’ 'This is a hunt mission for: what might somebody be doing in our backyard that we don’t know about,' Fitzpatrick said of his office's mission. He has dozens of scientists at work on case files. "
    ]
}