{
    "articleURL": "/wires/reuters/article-12048031/Israel-seized-Binance-crypto-accounts-thwart-Islamic-State-document-shows.html",
    "content": [
        "By Tom Wilson and Angus Berwick",
        "LONDON, May 4 (Reuters) - Israel has seized around 190 crypto accounts at crypto exchange Binance since 2021, including two it said were linked to Islamic State and dozens of others it said were owned by Palestinian firms connected to the Islamist Hamas group, documents released by the country's counter-terror authorities show.Israel's National Bureau for Counter Terror Financing (NBCTF) on Jan. 12 confiscated two Binance accounts and their contents, one of the documents on the NBCTF's website showed. The seizure was to \"thwart the activity\" of Islamic State and \"impair its ability to further its goals,\" the NBCTF said on its website.The NBCTF document, which has not been previously reported, did not give any details on the value of the crypto seized, nor how the accounts were connected to Islamic State.Binance, the world's largest crypto exchange by trading volumes, did not respond to Reuters' calls and emails seeking comment.Israel's defence ministry, which is responsible for the NBCTF, did not immediately respond to a Reuters request for comment.Under Israeli law, the country's defence minister can order the seizure and confiscation of assets that the ministry deems related to terrorism.Regulators globally have long called for tighter controls on crypto exchanges to prevent illegal activities, from money laundering to the financing of terrorism. The seizures by Israel's NBCTF highlight how governments are targeting crypto companies in their efforts to prevent illegal activity.",
        "Binance, founded in 2017 by CEO Changpeng Zhao, says on its website it reviews information requests from governments and law enforcement agencies on a case-by-case basis, disclosing information as legally required.Binance has also said it checks users for connections to terrorism and has \"continued to invest tremendous resources to enhance its compliance program,\" it told U.S. senators in March in response to their requests for information on Binance's regulatory compliance and finances.MILITANT GROUPIslamic State emerged in Syria after Iraq's civil war. At its 2014 peak, it controlled a third of Iraq and Syria, before being beaten back. Now forced underground, Islamic State militants continue to wage insurgent attacks. The U.S. Treasury said in a report last year that Islamic State had received crypto donations it later converted to cash, accessing funds via crypto trading platforms. The Treasury did not specify which platforms and declined to comment for this article.The owner of the two Islamic State-linked Binance accounts seized by Israel was a 28-year old Palestinian called Osama Abuobayda, the NBCTF document shows. Abuoyada did not respond to requests for comment via email addresses and a phone number listed in the NBCTF document.In a series of investigations last year, Reuters reported that Binance intentionally kept weak anti-money laundering controls. Since 2017, Binance has processed over $10 billion in payments for criminals and companies seeking to evade U.S. sanctions, Reuters reported. Binance disputed the articles, calling the illicit-fund calculations inaccurate and the descriptions of its compliance controls \"outdated.\"",
        "Two men suspected by Germany of assisting an Islamist gunman who killed four people in Vienna in 2020 used Binance, a letter from German police to the company said. Islamic State later claimed responsibility for the attack.Binance shared information with the police on the clients, its legal representatives said last year. Reuters could not independently establish this.MONEY EXCHANGERSNearly all of the 189 Binance accounts seized by Israel since Dec. 2021 were owned by three Palestinian currency exchange firms, the NBCTF documents showed.The three are designated by Israel as \"terrorist organizations,\" according to a list on the NBCTF's website, for their alleged involvement in the transfer of funds by Hamas, which runs the Palestinian territory of Gaza.Last month, the NBCTF said in a document it had seized crypto worth over 500,000 shekels ($137,870) from over 80 Binance accounts belonging to the three Gaza-based companies, Al Mutahadun For Exchange, Dubai Company for Exchange and Al Wefaq Co. For Exchange.The accounts were the property of \"terrorist organizations\" or used for a \"severe terror crime,\" the document said, without elaborating. Local media outlets in Israel previously reported the April seizures.A person with direct knowledge of Al Mutahadun said it did not work \"at all\" with crypto or cooperate with Hamas. \"We are a money exchange company. Israeli allegations are all lies and are foundless,\" the person said.",
        "Al Mutahadun was designated as a \"terrorist organisation\" in May 2021 by Israel, the NBCTF list shows.Al Wefaq and Dubai Co. did not respond to Reuters' requests for comment via email and WhatsApp.Binance did not respond to Reuters' questions on the accounts owned by the three currency exchange companies.Hamas does not have any connection with the money exchange companies, spokesperson Hazem Qassem said. The allegations of links to the companies were an attempt by Israel to \"justify its economic war against Gaza and its people,\" Qassem said.Hamas's armed wing said last week it would stop receiving funds in bitcoin after an increase in \"hostile\" activity against donors.Binance, its CEO Zhao and its former compliance chief Samuel Lim are facing civil charges from the U.S. Commodity Futures Trading Commission (CFTC) for \"wilful evasion\" of U.S. commodities laws.Zhao has called the charges an \"incomplete recitation of the facts.\"In its complaint, the CFTC said Lim received information in 2019 on Hamas' transactions at Binance. Lim told a colleague that \"terrorists\" usually send small sums of funds, as \"large sums constitute money laundering,\" according to the CFTC complaint.Lim has not publicly responded to the charges. He did not respond to messages sent via Telegram seeking comment for this article. ($1 = 3.6266 shekels) (Reporting by Tom Wilson and Angus Berwick in London; additional reporting by Nidal al-Mughrabi in Gaza. Editing by Elisa Martinuzzi and Jane Merriman)"
    ]
}