{
    "articleURL": "/sport/football/article-12060927/Roberto-Zerbi-accuses-Brighton-mentally-weak-defeat-Everton.html",
    "content": [
        "Roberto De Zerbi was heavily critical of Brighton after their 5-1 loss to Everton De Zerbi accused his team of being mentally weak following the heavy defeat Defeat is a blow for Brighton's hopes of securing European qualification Roberto De Zerbi accused Brighton’s players of being mentally weak as he held an angry post-match dressing room inquest at the Amex Stadium.",
        "Everton started the day as the lowest scorers of all the Premier League and EFL’s 92 clubs but ended it having scored five goals from counter-attacks. That lifted Sean Dyche’s team out of the bottom three, but bruised Brighton’s push for Europe under De Zerbi.Everton’s Neal Maupay could be seen waiting more than half an hour after full-time to see old Brighton team-mates but they were still locked in with De Zerbi. Speaking afterwards, the Italian did not hold back as he said: ‘We didn’t forget the victory against Manchester United. ",
        "'The biggest quality of the big team is to forget when you win. You have to be ready to play every game, every day, and we arrived at the stadium late – in the second half.'Brighton beat United 1-0 at the Amex on Thursday but found themselves trailing 3-0 at half time to Everton, and they face Arsenal next.‘If you watched the game with Man United, and if you watched this game, you can watch two completely different teams,' De Zerbi added. 'What is the problem? The problem, maybe, is the mentally – in your head.'I hope we can remember this date for a long time. What you did in the past is not important. It doesn’t count. We are Brighton. We won against Liverpool, against Man United, against Chelsea, not because there is a top coach, not because there are top players, but because we showed pride, we showed courage, energy, passion.’",
        "Everton face Manchester City next and this was a good day for Dyche. His son, Max, won promotion from League Two with Northampton.‘The feel-good factor is very important,’ Dyche said. ‘But I said to them, \"Lads, it's only another step\". I said that after Arsenal. We've made another step, but there are three more big steps we need to make.’Goalkeeper Jordan Pickford added: ‘We still have three cup finals and we have to keep going. We have to keep believing and focus on Everton, not what is around us.’"
    ]
}