{
    "articleURL": "/wires/ap/article-12060537/Search-teen-Philadelphia-ambush-zeroes-Atlanta.html",
    "content": [
        "PHILADELPHIA (AP) - The search is focusing on the Atlanta area for a teenage suspect in a 2022 ambush that killed a 14-year-old and wounded several other teenagers outside a Philadelphia high school after a football scrimmage, authorities said Monday.",
        "U.S. marshals in Philadelphia are working with their counterparts in the Southeast and are seeking help from the public in light of \"credible information\" that as of November 2022, the now-17-year-old suspect was \"hiding in the Atlanta, Georgia area,\" a Marshals Service task force said in a news release.The reward for information leading to the arrest of Dayron Burney-Thorn, of Philadelphia, has been increased to $50,000, up from $45,000, according to the U.S. Marshals Eastern Pennsylvania Violent Crime Fugitive Task Force.A judge in January ordered an adult and three other juveniles to stand trial in the shooting. All are charged as adults with murder, aggravated assault, firearms crimes and other counts.Authorities said five people jumped from a parked SUV and opened fire on teens who were walking away from an athletic field at Roxborough High School in September 2022. Nicholas Elizalde, 14, of suburban Havertown, was killed, and three other teens were taken to a hospital with wounds; another was treated at the scene.Police have said they don´t believe Elizalde was one of the intended targets. They said one of the shooters chased a 17-year-old victim down the street, striking him with shots to the leg and arm, and tried to fire as he stood over the victim, but the gun either jammed or was out of bullets.",
        "The shooting drew national attention around the U.S. amid a string of mass shootings and also came just after Philadelphia surpassed 400 homicides for the year. A total of 516 people were killed last year in the city, and the total of 562 the previous year marked the highest in the city in at least six decades.Hours before the shooting, Mayor Jim Kenney, a Democrat, signed an order banning deadly weapons from indoor and outdoor recreational spaces including parks, basketball courts and pools. A judge barred enforcement of the order after a legal challenge cited a state law that prevents any city or county from passing gun-control measures."
    ]
}