{
    "articleURL": "/travel/article-12053683/A-tour-visited-north-Argentina-reveals-beguiling-capital-dramatic-gorges.html",
    "content": [
        "John Kampfner starts his tour of Argentina's northwest in Buenos Aires  'One of the problems with this vast country is choosing where to go,' he reveals READ MORE: Flight safety expert - why pilots are much more than 'plane drivers'There is a saying that Argentinians are Italians who speak Spanish and act like the English. Yes, they seem to enjoy queuing, polo is popular among rarefied groups and some apparently take tea at 4 o’clock (though I don’t meet any). But it would be more accurate to say that Argentina feels European.",
        "Two-thirds of its 45 million population have family who made the journey in search of a better life at the turn of the last century. Italy is everywhere: in charm, style, cuisine. Mostly in the way the country is run. Business and politics revolve around what you can get away with. The economy should be in ruins but somehow manages to get by.One of the problems with this vast country is choosing where to go. I could head to Patagonia and its glaciers or Bariloche and its lakes. But I choose the less-visited northwest, with its volcanoes and mesmerising emptiness.Most trips begin and end in Buenos Aires. We stay in Palermo, the home of the impressive MALBA, the Museum of Latin American Art, where Frida Kahlo is the star.Close by, Recoleta is wealthier, and coiffed ladies fight for pavement space with professional dog walkers. Here, the cemetery contains tombs of Argentina’s greats, including Eva Peron (Evita), the famous First Lady who stole the nation’s heart from 1946 until her premature death in 1952.",
        "With the country’s annual inflation running near 100 per cent, people spend monthly salaries almost as soon as they are paid. Bars and restaurants in Buenos Aires seem to be doing a roaring trade, serving steaks and exotica such as llama carpaccio.",
        "When you think of Argentina, you invariably think of tango, the sensual dance that many aspire to but few achieve (my wife and I took classes in London before we left, only to find that we tripped on each other’s toes). Buenos Aires is replete with clubs where you can watch tango over food and drink until the early hours – but choose carefully.My favourite attraction in the capital is Palacio Barolo. When completed in 1923 it was South America’s tallest skyscraper – 22 storeys inspired by Dante Alighieri’s 14th Century poem, The Divine Comedy. At the top is a lighthouse that has been switched on only twice – at the end of the First World War and for Argentina’s recent World Cup win.A two-hour flight takes us to the colonial city of Salta, its central square dominated by a cathedral.",
        "Also on the square is the Museum of High-Altitude Archaeology. Inside, in a glass box, sits a 15-year-old girl, frozen in time. In 1999, scientists working 23,000ft high on the Chilean border found three Inca children buried at the top of the Llullaillaco volcano. They had been there for 500 years.These children had been chosen for their beauty, and walked for seven months from Cusco, the Inca capital, to reach the summit. They were then put to sleep with alcohol and froze in the extreme cold. Child sacrifice was considered a gift to the Gods.",
        "As we drive down Calchaqui Valley the next morning, we stop at gorges with names such as Devil’s Throat. We’re heading to Bodega El Esteco, a vineyard in Cafayate. It is a mystery to me why Argentina does not export more wine. The reds – malbec or the less famous tannat – would give most competitors a run for their money.For the next four days we are ensconced in a 4x4 with our guide Gaston, as he takes us to remote terrain. They call it Pachamama, Mother’s Land, where you can visit Museo de la Pachamama to see its striking Viracocha pre-Inca and Inca masks.",
        "Its barrenness is the attraction: vast stretches of jagged rocks, pumice fields and lakes populated by pink flamingos.With just a few settlements and hundreds of miles of unpaved road, most of the time you’re on your own.Gaston also escorts geologists carrying out experiments on rock erosion. ‘Scientists have scoured the earth,’ he says, ‘here is the closest you get to Mars.’On the way down from our lunar landscape we pass the town of San Antonio de los Cobres, the end point for the Train to the Clouds. The line is an engineering marvel. Originally built for freight, it now runs for tourists to wonder at the sights below.",
        "Though you see posters proclaiming the Falklands, known here as the Malvinas, to be Argentine, the British are popular here, and populous. I meet the ancestor of one emigrant – Kevin Begg – while sipping torrontes wine.I had arrived at Los Potreros ranch that morning on a flight from Salta to Cordoba. Kevin’s is one of the region’s largest cattle farms: 500 Aberdeen Angus spread across 6,500 acres. He wears the gaucho beret and seems as Argentine as anyone here – though he went to boarding school in the West Country.Apart from the decor, sumptuous food and lively conversation, people mainly visit Los Potreros for the riding – 100 horses cater to every level. You can go fast or slow, savouring the open hills – think Yorkshire Moors in abundant sunshine.",
        "On our final morning, Kevin springs a surprise. We are going to play polo.I am not a good horseman, I remind him, but he just smiles and introduces me to Belem, our teacher, who encourages me with exhortations of ‘well done, come on’ as I lean to hit the ball.We split into two teams, divided between hapless visitors and accomplished gauchos. My team loses 3-0. It’s like (far too often) England versus Argentina, but they are all too polite to say so.",
        "Steppes Travel has a 12-day guided trip staying at Estancia Los Potreros in Cordoba from £4,495pp; flights cost from £900pp extra (steppestravel.com)."
    ]
}