{
    "articleURL": "/news/article-12057187/Charles-royal-raver-DJ-Pete-Tong-reveals-King-requested-Ibiza-classics-Coronation-concert.html",
    "content": [
        "The BBC Radio 1 DJ says he hopes it will be a 'brilliant' way to start the show Follow the latest royal news on Coronation events on MailOnline's live blog hereDJ Pete Tong has revealed the King specifically requested Ibiza classics songs as part of his coronation concert.",
        "The BBC Radio 1 DJ, who has been tasked with delivering the King's wish at the event being held on Sunday evening, said he hopes it will be a 'brilliant' way to start the show in the grounds of Windsor Castle. Speaking backstage ahead of the event, Tong said: 'He wanted Ibiza classics, that was very specific.'And then they asked us to suggest a couple of songs so we suggested three or four, and he came back with one of them and that's the one that's starting the show, so they very much had an involvement in what they wanted us to perform.'Asked why he felt this genre was among the playlist requests, he added: 'I think they want to put across a big variety of UK talent and touch all different demographics and be relevant to different age groups.",
        "'I mean, the shows we do we literally get kids up to pensioners. Relapse ravers, we call them - so maybe there's a few relapsed ravers in the royal household, we don't know.' Stars including Nicole Scherzinger and Amanda Holden have arrived for tonight's spectacular Coronation Concert on a Union Flag-shaped stage in the shadow of Windsor Castle. With more than 20,000 people in attendance, the excitement is certainly starting to build.",
        "The concert show will be hosted by Downtown Abbey star Hugh Bonneville.The King and Queen and other members of the Royal Family including Prince William and his wife the Princess of Wales will join the public at the event to continue the celebrations after their crowning at Westminster Abbey on Saturday.Artists from Paloma Faith to Olly Murs, Andrea Bocelli, Welsh bass-baritone Sir Bryn Terfel and Chinese pianist Lang Lang will be in attendance as well.Hollywood star Tom Cruise, adventurer Bear Grylls and singer Sir Tom Jones will all also make an appearance via video link. ",
        "Reflecting on his thoughts surrounding the royal family ahead of the concert, Bonneville has hailed the King's coronation as an 'extraordinary' event, but thinks the challenge for the future of the monarchy will be to allow the next generation to define what it means to them.'I think each generation will need to make its own definition of what monarchy means,' he said.'And I think that is the challenge for the future. In our ever-changing world, where does the monarchy stand? What does it mean?'I mean, for my generation, and for my parents' generation, it was the glue that bound our nations together, and that glue will need to shift and evolve in order to keep the strength that it's had in the past.'",
        "Bonneville said he thought the coronation service was 'extraordinary' and admitted that he found the moment the King swapped his 'robes of status and honour' for a simple white shirt for the private anointing as 'particularly touching'.He added: 'It's a crazy old service, it's strange to think how it's accreted over the years, over the centuries to what it is today and it obviously will have a new meaning, a different meaning for our generation, the generation that witnessed it with the late majesty.'I found it moving and an extraordinary change-marker in the sand for our culture and for our generation.'The actor added that he feels the concert this evening will be a 'magical' way to continue the festivities.",
        "US singer Scherzinger said she felt like a Disney princess when she was in rehearsals for her rendition of Reflection, which was written and produced for Disney's 1998 animated film Mulan.'Now that I'm here, it just feels really surreal. Being on the ground and having Windsor Castle as your backdrop is the dream,' she added.Singer and former X Factor runner-up Murs admitted his family thought it was an April Fool's prank when he told them he would be performing at the concert.Also on the night, choirmaster Gareth Malone will conduct the 300-strong Coronation Choir, which he hopes will be his moment to redeem himself after he suffered a major technical issue when he performed in front of the King during a Royal Variety Performance.",
        "He recalled: 'I performed at the Royal Variety Performance in front of the then-Prince Charles and my backing track went completely wrong and so the whole thing fell apart and it was the worst ever performance I've ever had in my whole career.'For years I wouldn't use any technology and I'm hoping that I'm going to lay that ghost to rest this very night.'Classical acts including Andrea Bocelli, Welsh bass-baritone Sir Bryn Terfel and Chinese pianist Lang Lang are also on the bill.Lang told PA it was a 'tremendous honour' to be on the bill with 'many great artists from different parts of the world to celebrate music and love for music'.Reflecting on how the coronation was viewed in China, he added: 'It's a big country and people have different opinions but I think from what I see from the media, it's basically quite positive from the media.'There's a lot of pictures from it and they talk about it a lot because of the music so I would say overall it was a positive feedback.'Hollywood star Tom Cruise, Dynasty actress Dame Joan Collins, adventurer Bear Grylls, singer Sir Tom Jones and former Strictly Come Dancing professional Oti Mabuse will also make an appearance via video.",
        "The series of pre-recorded sketches will reveal little-known facts about the monarch and will also include moments from beloved literary character Winnie the Pooh - seemingly echoing the famous moment Paddington Bear drank tea with the Queen during her Platinum Jubilee celebrations.Nigerian singer Tiwa Savage and winner of The Piano TV talent show, 13-year-old Lucy, will also perform.Meanwhile, fashion designer Stella McCartney will deliver a spoken word performance with a conservation theme which will reflect her and the King's 'shared passion for environmental sustainability', the BBC has said.Her performance will be part of a broader nature-themed section of the concert which will also include a rendition of a 1980s hit by classical-soul composer Alexis Ffrench and London-based singer-songwriter Zak Abel alongside a house orchestra, band and choir.Bollywood star Sonam Kapoor will also deliver a spoken-word performance.The Royal Ballet, the Royal Opera, the Royal Shakespeare Company, the Royal College of Music and the Royal College of Art will come together for the first time to create a one-off performance featuring Sex Education and Doctor Who star Ncuti Gatwa and Olivier Award nominee Mei Mac.Former Desert Island Discs and Crimewatch presenter Kirsty Young will anchor the special live broadcast of the concert in the grounds of Windsor Castle after reporting from a studio at Buckingham Palace on Saturday's coronation day.",
        "The concert on the castle's East Lawn will also see TV presenter Clara Amfo and Diversity dance troupe member Jordan Banjo speaking to the artists backstage.Rendered images released last month revealed that the concert will feature a Union flag-shaped stage which fans out to the audience.The stage will also have a halo-like screen surrounding the roof, which the BBC said will 'symbolise the Crown protecting the nation'."
    ]
}