{
    "articleURL": "/wires/reuters/article-12046399/Peloton-forecasts-better-expected-revenue.html",
    "content": [
        "By Kannaki Deka",
        "May 4 (Reuters) - Peloton Interactive Inc reported a wider-than-expected quarterly loss and warned it expects to sign up fewer members for the year, raising concerns about the fitness equipment maker's growth prospects.Shares of the company fell 15% in morning trading after initially rising on stronger-than-expected forecast for fourth-quarter revenue. Last year, the pandemic darling had tanked 78% as demand for its bikes slumped with people returning to gyms.The company's revenue from sale of connected products and subscription to fitness programs is also under pressure due to a turbulent economy.\"We're definitely uncertain about what's next in terms of the economic environment,\" Chief Executive Barry McCarthy said.Peloton said it expects 3.08 million to 3.09 million members in fiscal 2023 connected fitness subscriptions, compared with FactSet estimates of 3.095 million, and 3.11 million reported in the third quarter ended March 31.Although the company management is pointing to seasonality, Peloton guided a net decline in fourth-quarter memberships for the first time, which stresses our concerns over a smaller total addressable market, BMO Capital Markets analyst Simeon Siegel said in a note.CEO McCarthy has taken a series of measures to cut costs and stem cash bleed, including layoffs, store closures, selling equipment on third-party platforms such as e-commerce giant Amazon and increased focus on subscription, among others.",
        "The efforts have shown improvement. Peloton's third-quarter cash burn slowed to $55.3 million from $747 million a year earlier.\"We actually are pretty close within striking distance of achieving free cash flow breakdown,\" Chief Financial officer Liz Coddington said.Peloton forecast fourth-quarter revenue between $630 million and $650 million, above estimates of $607.7 million.In the reported quarter, however, Peloton posted a bigger-than-expected net loss of 79 cents per share, due to a $51.3 million impairment and restructuring charge.Revenue also fell to $748.9 million, but beat expectations.(Reporting by Kannaki Deka in Bengaluru; Editing by Shinjini Ganguli)"
    ]
}