{
    "articleURL": "/sport/football/article-12051145/Liverpool-stadium-announcer-happily-play-national-anthem-day-King-Charles-coronation.html",
    "content": [
        "Liverpool reluctantly agreed to play national anthem before Brentford gameIt came after the Premier League 'strongly suggested' club play it pre-matchStadium DJ George Sephton tweeted he will be happily playing the anthem Liverpool's stadium announcer George Sephton says he will 'happily' be playing the national anthem after the Anfield club reluctantly agreed to do so on Coronation day.",
        "The Premier League contacted clubs last week to 'strongly suggest' they mark the accession of King Charles III to the throne by playing 'God Save the King' pre-match.Liverpool fans have booed the national anthem in recent years but the club felt they had little choice but to play it ahead of Saturday night's fixture with Brentford.Sephton, 77, who has been the stadium DJ for over 50 years and is known as 'the voice of Anfield', tweeted he will gladly play it.In reply to a message suggesting Sephton plays 'God Save the Queen' by punk band Sex Pistols instead, he wrote: 'I will happily playing the National Anthem. It's coronation Day.'",
        "In response, Liverpool fans told him it would 'be the worst received song you'll ever play' and that they'll be singing club anthem You'll Never Walk Alone instead.There was a huge spotlight on Liverpool after the Premier League contacted all clubs hosting games over the Coronation weekend and advised them to play 'God Save the King.'There was no directive from the governing body that this was compulsory and Liverpool contemplated not acquiescing to the Premier League's suggestion.Liverpool were well aware not playing the anthem would subject them to a nationwide backlash and they'll hardly win either if fans do boo it.",
        "A section of supporters chanted 'you can stick your coronation up your a**e' during Wednesday night's 1-0 win over Fulham.The Liverpool and Brentford players will gather around the centre circle while it is played and the reaction of the supporters remains to be seen.There could be boos or jeers, but some believe a spontaneous chorus of You'll Never Walk Alone could be sung.A minute of silence to mark the death of Queen Elizabeth II last September was observed by the Anfield crowd.",
        "Liverpool manager Jurgen Klopp said he agreed with the club's decision.Asked about the coronation in the first question of the press conference on Friday, he responded: 'The club's position is my position. That is clear. 'Besides that, this is definitely a subject which I cannot really have a proper opinion about. I am from Germany, we don't have a king or a queen, I am 55-years-old and I have no experience of that. 'Watching from the outside, it is a nice thing to watch when all the weddings are massive things in Germany but no one really knows what it is like. It is like watching a movie. We don't feel that. 'That is it pretty much. I am pretty sure a lot of people in this country will enjoy the coronation, some will not be interested and some will not like it. That is it and that is over the whole country. That is all I can say about it. The club's position is my position."
    ]
}