{
    "articleURL": "/wires/afp/article-12039171/UN-rings-alarm-diminishing-global-press-freedoms.html",
    "content": [
        "Press freedom is under attack in every corner of the globe, with journalists continually harassed, jailed and killed, UN officials and media outlets warned Tuesday.",
        "Speaking ahead of World Press Freedom Day on Wednesday, UN Secretary-General Antonio Guterres issued a rallying cry for journalists and media worldwide.\"All our freedom depends on press freedom,\" he said in a video message, calling it the \"foundation of democracy and justice\" and the \"lifeblood of human rights.\"\"But in every corner of the world, freedom of the press is under attack,\" Guterres added, addressing a conference held at UN headquarters in New York.Highlighting the problem, UNESCO awarded its 2023 World Press Freedom Prize to three Iranian women, two journalists and a human rights activist, who have been jailed.While Guterres did not cast blame on specific countries, other speakers highlighted individual cases, such as that of Wall Street Journal reporter Evan Gershkovich, detained in Russia on espionage charges he has rejected.\"The fight for press freedom, the fight for Evan's release is a fight for everybody's freedom,\" Wall Street Journal publisher Almar Latour told the forum.Dozens of news organizations have denounced the charges against Gershkovich as unfounded, while US President Joe Biden has called his imprisonment \"totally illegal.\"Other journalists hit upon the rising dangers of the profession.\"I'm coming from a country, Iran, where being a journalist is a crime... (and) can land you in jail, can get you killed, can get you tortured,\" said Masih Alinejad, an Iranian-American journalist living in exile.",
        "- 'Threatened by disinformation' -According to Reporters Without Borders, 55 journalists and four media workers were killed in the line of duty in 2022.",
        "\"Truth is threatened by disinformation and hate speech, seeking to blur the lines between fact and fiction, between science and conspiracy,\" Guterres said.Journalists, he added, \"are routinely harassed, intimidated, detained, and in prisons.\"Others voiced similar concerns, with the head of UNESCO, which is organizing an event at the United Nations in New York on Wednesday to mark the occasion, also speaking out.Audrey Azoulay said the digital age was changing the entire information landscape -- making \"professional, free, independent journalism\" more necessary than ever.She said harassment and intimidation of journalists was unacceptable.\"We find ourselves at a new crossroads,\" she said. \"Our current path is leading us away from informed public debates... a path towards ever more polarization.\"New York Times publisher A.G. Sulzberger said it was not only direct repression that threatens journalists and freedom of information.\"The internet also unleashed the avalanche of misinformation, propaganda, punditry and clickbait that now overwhelms our information ecosystem... accelerating the decline in societal trust,\" he said.\"When the free press erodes, democratic erosion almost always follows.\"The secretary general of Amnesty International, Agnes Callamard, said censorship has also become more common.",
        "\"Sadly, censorship has become the default position of many governments in terms of controlling the knowledge of their societies,\" she said.The recipients of the UNESCO prize were Iranian reporters Elaheh Mohammadi and Niloufar Hamedi, who helped expose the death in custody of Mahsa Amini in September, and human rights activist Narges Mohammadi."
    ]
}