{
    "articleURL": "/tvshowbiz/article-12047741/Lisa-Vanderpump-close-Pump-Restaurant-Lounge-July-response-untenable-rent-hike.html",
    "content": [
        "Lisa Vanderpump is preparing to say goodbye to her Pump Restaurant Lounge after its rent was significantly increased.",
        "On Thursday, the 62-year-old reality star and the Pump Family shared a statement on social media confirming that the restaurant would be closing in just two months.'It's with heavy hearts that we announce that the lease at Pump Restaurant is expiring, and we will be closing its doors on July 5th, after 10 years of beautiful evenings under our olive trees,' she wrote.But among the bad news for the Vanderpump Rules namesake were some brights spots, as she plans to open two new restaurants in Las Vegas at Caesars Palace.The latest setback for Vanderpump comes after her reality series was overwhelmed by 'Scandoval' after star Tom Sandoval cheated on his partner Ariana Madix with their costar Raquel Leviss. ",
        "The group described the property owner's new rent rates as being 'untenable,' leading them to opt to shut down Pump rather than pay up. 'While we have loved our time operating Pump, to take on another 10-year lease with a huge increase in rent by the landlords, is not something we are ready to commit to. After successfully running 37+ establishments for many years, this type of rent is untenable,' they continued.Sources close to Lisa and her husband Ken Todd told TMZ that the yearly rent on Pump would be nearly $1 million, a figure the couple thought was 'ridiculous,' and which they weren't willing to pay.",
        "The sources also claimed that their previously closed restaurant Villa Blanca suffered a similar fate.The Beverly Hills–located restaurant was closed in 2020 in response to a rent hike, though the landlord doesn't seem to have gotten anything yet from the increase, as the location has sat empty for the past three years.The publication's sources said Vanderpump made sure to keep Pump open through June, as it is Pride Month, which is a particularly big deal in gay-friendly West Hollywood.They added that the former Real Housewives Of Beverly Hills star wanted to 'support the local community with one last hurrah.'Although Lisa and her husband are now down one LA restaurant, they still have the high-profile Sur and TomTom remaining in the area.'We look forward to welcoming you all to TomTom &amp; Sur in the months following! Thank you for the past decade of support, we have loved our staff, our patrons and our time together,' the Pump Family added in its statement.",
        "Back in March, Pump was beset by other issues after its liquor license was suspended. According to WeHo Times, the restaurant lost the license as of March 8, as did Tom Tom, though the latter regained its license two days later.The suspension was listed as a 'Collections Suspension,' suggesting that the license fee had simply not been paid, rather than being revoked due to some kind of misconduct.",
        "As of Thursday, it had been changed back to 'Active' on California's liquor license registry."
    ]
}