{
    "articleURL": "/sport/rugbyunion/article-12045215/RFU-confirm-Wasps-applied-play-Sixways-Atlas-group-complete-Worcester-takeover.html",
    "content": [
        "The prospects for stricken Worcester Warriors and Wasps are now intertwinedAtlas Group completed Warriors' takeover and Wasps want to play at SixwaysRemains to be seen if Warriors will die in what would effectively be a mergerThe RFU have confirmed that an application has been received from Wasps to play at Sixways from next season, after the Atlas group completed their take-over of Worcester.",
        "After sources informed Mail Sport that Wasps had made their application, the governing body responded by saying: 'Wasps have applied to use Sixways Stadium. The RFU will consult with local stakeholders before the request is considered by the RFU board towards the end of May.'This is a dramatic turn of events, which shows how the prospects for stricken Wasps and Worcester have become intertwined. Both clubs went into administration last autumn, which led to automatic relegation from the Premiership. Now, it appears that one of them – Wasps – could swiftly re-surface in a reconfigured Championship next season, subject to RFU consent.However, this is a complex situation. The union have reservations about the Atlas group, fronted by ex-Worcester chief executive Jim O'Toole – meaning they were unwilling to approve them as 'fit and proper' club owners. ",
        "But official administrators, Begbies Traynor, chose to proceed with the Atlas bid in preference to the one lodged by a consortium led by Steve Diamond, who was the Warriors' director of rugby when the club collapsed following a spirited struggle for survival.It remains unclear whether Worcester as a club will cease to exist in what effectively amounts to a merger with Wasps – something which was fiercely denied when rumours emerged months ago. ",
        "The RFU must consider if Wasps can become tenants in a ground where there is no 'landlord' club, but just a company which owns the venue, and whether that allows Atlas to circumvent any issues the union may have about their fit-and-proper owner credentials.O'Toole and his business partner, ex-player James Sandford, had previously declared their intention to discard the Warriors 'brand' and merge with nearby Stourbridge RFC, who are set to play in the fifth tier of English rugby next season. They were forced to row back on their plan following a furious backlash, but there remains considerable local opposition to and suspicion of their involvement.Wasps announced last December that former non-executive director Chris Holland had become the new club owner after a buy-out by a consortium including ex-players. If they are cleared by the RFU to play at Sixways next season, they face a frantic race to assemble a squad, management team and staff at short notice. Championship clubs may welcome their iconic presence in the second tier, but are desperate for clarity about the make-up of their league for the 2023-24 campaign."
    ]
}