{
    "articleURL": "/wires/reuters/article-12060583/Braves-Charlie-Morton-seeks-success-vs-Red-Sox.html",
    "content": [
        "Two pitchers with a history of success against the opposing team will face off when the Atlanta Braves host the Boston Red Sox on Tuesday in the opener of a two-game interleague series.",
        "Atlanta's Charlie Morton (3-3, 3.38 ERA) is 7-1 in his career against Boston. He will be opposed by Boston's Nick Pivetta (2-2, 4.98), who is 6-3 in his career against the Braves. It's the second-most wins against an opponent for both right-handers.Atlanta took two of three games from Baltimore over the weekend, winning Sunday's rubber game 3-2 in 12 innings. The Braves improved to a National League-best 24-11 and matched the franchise record for the best start after 35 games.\"We just battled the whole weekend and we're glad to get the series win,\" said center fielder Michael Harris II, who drove in the winning run in the last game.Boston had its eight-game winning streak broken in Sunday's 6-1 loss to Philadelphia. The Red Sox have the fourth-best record in the American League, but that's only good for fourth place in the East.Morton will be making his seventh start of the season. In his last appearance on May 1 against the New York Mets, he worked 5 1/3 innings and allowed four runs on six hits, with three walks and six strikeouts.Morton has a 4.03 ERA in 13 career starts against the Red Sox but hasn't lost to Boston since 2018. He faced them once last year and received no decision after giving up five runs in six innings.",
        "Pivetta will be making his seventh start. In his last outing against Toronto on Wednesday, he earned a win after pitching a season-high six innings and allowing four runs on five hits -- two of them home runs -- with two walks and five strikeouts.\"I'm grateful for every opportunity I've been given,\" Pivetta said. \"You figure out who you are as a big leaguer, so you can develop yourself and make it to where you need to be.\"Pivetta has a 4.82 ERA against the Braves in 17 career appearances (14 starts) but has surrendered 12 homers in 80 1/3 innings. He took the loss in his only appearance against the Braves in 2022, giving up three runs in five innings.The game will mark the return of Boston's Kenley Jansen to Atlanta. The veteran right-hander played for the Braves in 2022 and led the league with 41 saves. Jansen signed with Boston as a free agent and needs one more save to reach 400 for his career, a milestone only six pitchers have reached, most recently Francisco Rodriguez in 2016.On Monday, the Braves reinstated catcher Travis d'Arnaud, who has been out since April 8 with a concussion, the fourth suffered in his professional career. He caught five innings in a rehab assignment for Triple-A Gwinnett on Friday and was the designated hitter the next day. Atlanta optioned catcher Chadwick Tromp to Gwinnett.",
        "--Field Level Media"
    ]
}