{
    "articleURL": "/wires/reuters/article-12040533/Jonathan-Indias-single-10th-lifts-Reds-past-Padres.html",
    "content": [
        "Jonathan India singled home automatic runner Matt Reynolds from second leading off the top of the 10th Tuesday night to give the visiting Cincinnati Reds a 2-1 victory over the San Diego Padres.",
        "The win snapped a run of seven straight Reds losses to the Padres and a streak of nine straight losses in San Diego.India's sharp grounder off Luis Garcia was to the left of shortstop Ha Seong Kim, easily scoring Reynolds. TJ Friedl followed with a single but Garcia got Spencer Steer to ground into a double play and pinch hitter Tyler Stephenson grounded out to third.The Padres had runners on first and second in the bottom of the 10th. But Reds closer Alexis Diaz struck out Fernando Tatis Jr., retired Manny Machado on a liner to left then threw a called third strike past Juan Soto to end the game.Derek Law (1-4) pitched a scoreless ninth to win his first game of the season. Diaz earned his fifth save. Garcia (1-3) took the loss.The Padres scored the game's first run on a pair of two-out hits off Cincinnati starter Graham Ashcraft in the third. Machado singled to center and came around from first on Soto's double into the right field corner.The Reds tied the game in the top of the eighth, ending the run of 14 straight scoreless innings by Padres reliever Nick Martinez. Friedl singled with one out, stole second and scored on Jake Fraley's two-out single to right.",
        "The Reds couldn't score in the first after getting their first two runners on base and had two more on in the second when Padres starter Michael Wacha retired India on a fly to left to end the inning.That out started a run of 12 straight Reds retired by Wacha before Fairchild drew a walk with two out in the sixth and Fraley followed with a single sending the tying run to third. But Wacha retired Nick Senzel on a fly to center on his 100th pitch to end the inning and his night.Wacha gave up two hits and two walks with three strikeouts over six shutout innings. Ashcraft gave up the one run on six hits and a walk with three strikeouts in six innings.--Field Level Media"
    ]
}