{
    "articleURL": "/wires/reuters/article-12039935/GRAINS-Wheat-rises-25-month-low-improved-US-weather-caps-gains.html",
    "content": [
        "SINGAPORE, May 3 (Reuters) - Chicago wheat inched higher on Wednesday with prices recovering from their lowest levels in more than two years, although rains in the U.S. winter wheat-growing areas and ample world supplies kept a lid on the market.",
        "Corn and soybeans slid as rapidly progressing U.S. planting weighed on prices.FUNDAMENTALS* The most-active wheat contract on the Chicago Board of Trade (CBOT) was up 0.3% at $6.10-3/4 a bushel, as of 0010 GMT, after dropping on Tuesday to it lowest since early April 2021 at $6.07-1/2 a bushel.* Corn fell 0.3% to $5.78-1/4 a bushel and soybeans gave up 0.2% to $14.08 a bushel.* Wheat is facing pressure with forecasts of rains in parched U.S. Plains. The winter wheat crop rating as of Sunday was up 2 points from the prior week at 28% \"good to excellent\", according to the U.S. Department of Agriculture (USDA).* The wheat market is awaiting news on extension of the Black Sea grain export deal.* Talks on the U.N-brokered deal that may allow the safe Black Sea export of Ukrainian grain are scheduled later in the day, with all sides in the negotiations involved, a senior Ukrainian source said on Tuesday.* Ukraine's grain exports could fall to around 26 million tonnes in the 2023/24 season as the grain harvest has sunk, largely due to Russia's invasion, a senior ministry official said.* Soft wheat exports from the European Union in the 2022/23 season that started in July had reached 25.67 million tonnes by April 30, up 9% compared with 23.46 million a year earlier, data published by the European Commission showed on Tuesday.",
        "* In the corn market, the USDA said planting was 26% complete as of Sunday, just below the average analyst estimate of 27% and matching the five-year average.* U.S. soybean planting was 19% complete, ahead of the average analyst estimate of 17% and the five-year average of 11%.* Commodity funds were net sellers of CBOT grain and soy futures contracts on Tuesday, traders said.MARKET NEWS* Wall Street stock indexes closed lower on Tuesday, a day ahead of the Federal Reserve's interest rate decision, while U.S. Treasury yields fell as investors worried the government could run out of cash after June 1 without a debt ceiling hike.DATA/EVENTS (GMT) 0900 EU Unemployment Rate March 1345 US S&amp;amp;P Global Comp, Svcs Final PMIs April 1400 US ISM N-Mfg PMI April 1800 US Federal Open Market Committee announces its decision on interest rates (Reporting by Naveen Thukral; Editing by Sherry Jacob-Phillips)"
    ]
}