{
    "articleURL": "/wires/ap/article-12053011/Hatton-3-way-tie-lead-Wells-Fargo-McIlroy-falters.html",
    "content": [
        "CHARLOTTE, N.C. (AP) - Tyrrell Hatton shot a 6-under 65 on Friday to move into a share of the second-round lead at the Wells Fargo Championship, while Rory McIlroy´s bid for a record fourth tournament title hit a major snag.",
        "Hatton, who has one PGA Tour victory and six more on the European tour, played the final four holes at Quail Hollow in 4 under to reach 8-under 134, matching Nate Lashley and Wyndham Clark through 36 holes.Lashley is also a one-time winner on tour, while Clark has zero victories.Several highly ranked players were close behind, including No. 5 Xander Schauffele and major champions Justin Thomas and Adam Scott in the group of six at 7 under alongside Sungjae Im, J.J. Spaun and Adam Svensson.Defending champion Max Homa moved into contention. He shot 67 and was three shots back.With 28 players within four shots of the lead, Schauffele called the tournament \"anyone's game.\"",
        "\"They say the cream rises to the top and the harder the property ... the better players typically rise,\" Schauffele said. \"So, I mean, I think it´s just these fields are really good now.\"Hatton began his round on the back nine and his strong closing stretch included a 26-foot eagle putt on the par-5 seventh hole. The Englishman made three putts of 25 feet or more on his last four holes.\"They´re not the type of putts that you hole consistently, so to finish the round that way, I´m obviously very pleased with that,\" Hatton said. \"Nice to see some putts go in.\"",
        "McIlroy, who won at Quail Hollow in 2010, 2015 and 2021, shot 73 and escaped with an impressive par on the par-4 18th to make the cut on the number.His tee shot on 18 nearly rolled into the stream along the left side of the fairway. Facing an uneven lie with the ball well above his feet, McIlroy changed clubs multiple times before settling in and finding the front of the green with his approach shot. He two-putted from 75 feet.While a seven-shot deficit seems a lot to overcome, it was McIlroy who shot 61 on Saturday in 2015 on the way to victory.Thomas, who won the PGA Championship at Quail Hollow in 2017 and helped lead the United States to a win at the Presidents Cup here last year, shot 67 to get himself in the mix.\"I know how to get around the course pretty well,\" Thomas said. \"I think it´s obviously different but kind of similar to Augusta National. I feel like if I´m not hitting it well, there´s always a spot I have like I can kind of get it to.\"First-round leader Tommy Fleetwood followed his opening-round 65 with a 71 and was 6 under. Fleetwood has six European tour victories but none on the PGA Tour. He remained confident about his chances.",
        "\"Nobody´s really getting away (from the pack) and there´s not that many low scores,\" Fleetwood said. \"Just shows how difficult the test of golf is out there on that golf course. I played really well. I feel like if you do that, then your chances are going to come and you can take them.\"Mark Hubbard aced the 170-yard, par-3 17th and was 2 under.Among the notable players who missed the cut were 14th-ranked Collin Morikawa, who shot back-to-back 73s, and Jordan Spieth, who had a 77 on Friday.___AP golf: https://apnews.com/hub/golf and https://twitter.com/AP_Sports"
    ]
}