{
    "articleURL": "/wires/pa/article-12039723/Large-scale-trials-needed-test-anti-ageing-supplements-expert-says.html",
    "content": [
        "Anti-ageing supplements need to be clinically tested, but the answer to a longer healthy life may already be available, an expert has said.",
        "Professor Cynthia Kenyon, an expert in ageing and longevity, said that while many supplements are easily accessible and inexpensive, there is little evidence to show they are effective.However, clinical trials may reveal that one of the supplements already in circulation holds the answer to people remaining healthy as they age.With people living longer, researchers hope to find a way to keep them healthier later into life, by slowing down the biological ageing process and therefore age-related diseases, like cancer, dementia and frailty. They're taking these supplements, but the supplements haven't actually gone through large clinical trials  Professor Cynthia Kenyon  Prof Kenyon, whose research revolutionised the scientific understanding of ageing, told the Frontiers Forum that large-scale trials were needed to prove the effectiveness of supplements like rapamycin and metformin, which have both been linked to anti-ageing.She told the PA news agency: “They’re taking these supplements, but the supplements haven’t actually gone through large clinical trials.",
        "“There are many companies that are trying to slow down ageing, and that’s terrific, but meanwhile, you have these people taking substances that are pretty easy to get and they have no idea if they work or not.“The thing is that a clinical trial that’s large enough to be meaningful costs millions of dollars. And so there’s no business model for this because if you want a clinical trial with something that’s freely available and inexpensive, you can’t recoup your cost of the trial.",
        "“And yet it’s an important need for the world because if they work and make you more resilient, not only do these interventions slow down ageing, but they counteract age-related disease also.“So you would make people – if they work – resilient and more disease-resistant, and they can be sold to everyone, poor people can be given them.“Really, it would be wonderful for the world to actually know that this is good for you.”Prof Kenyon, who works for Calico Life Sciences – a subsidiary of Google parent company Alphabet – said that while these substances had been tested in mice, human trials have not been conducted.She told the science conference in Switzerland that because of the costs of trials international organisations like the World Health Organisation, governments, non-profit groups and philanthropists need to get together and start testing the compounds, which also include resveratrol, which is a substance in red wine, and spermidine.She said: “We don’t know if any of them will work, but you find out.“And then when you get some that work, and I think you will, that will be fabulous, then you have to just disseminate them – that will happen.”"
    ]
}