{
    "articleURL": "/wires/reuters/article-12047657/Bank-Canada-hike-rates-inflation-gets-stuck-2--Macklem.html",
    "content": [
        "By Steve Scherer and David Ljunggren",
        "OTTAWA, May 4 (Reuters) - Canadian inflation risks getting stuck significantly above the Bank of Canada's 2% target, and if that happens the central bank is ready to hike interest rates rates further, Governor Tiff Macklem said on Thursday.Last month the Bank of Canada left its key overnight interest rate on hold at 4.50% but said rates may need to stay high for a while because of wage pressure in a tight labor market and sticky services prices.The bank's baseline scenario sees the labor market softening as growth slows, easing wage pressure and business price-setting behavior, Macklem said.\"But there is a risk that these adjustments will take longer or stall, and inflation will get stuck materially above the 2% target,\" Macklem told the Toronto Region Board of Trade.If the bank sees signs inflation is becoming entrenched above 2%, \"we are prepared to raise rates further,\" he said.After eight consecutive rate hikes, the bank said in January that it would pause its tightening campaign and not raise rates again if inflation came down as expected.But at its policy-setting meeting last month, the bank mulled an increase because of a persistently tight labor market and stronger-than-expected growth. It decided to hold off to collect more evidence on the impact of previous rate increases.",
        "The bank expects inflation to fall to 3% this summer even as the economy continues to grow modestly and then make a slower and more uncertain decline to 2% by end-2024, Macklem said.March inflation eased to 4.3%, its slowest pace in 19 months, after peaking at 8.1% last year.While Macklem focused much of his speech on monetary policy and price stability, he also addressed the risk that recent U.S. and European financial instability could spread.Macklem said that so far market stress had had a \"muted\" impact on Canada, but added, \"if global financial stress were to re-emerge and prove more pervasive, the spillover effects into Canada could be more significant\".This week regulators seized First Republic Bank and sold its assets to JPMorgan Chase &amp;amp; Co, in a deal to resolve the largest U.S. bank failure since the 2008 financial crisis.\"If more severe stress emerges (in Canada), we have the tools to provide liquidity while we continue to work toward restoring price stability,\" Macklem said.(Reporting by Steve Scherer, editing by David Ljunggren)Keywords: CANADA CENBANK/"
    ]
}