{
    "articleURL": "/wires/ap/article-12048403/Rengifo-homers-drives-4-Angels-sweep-Cardinals-11-7.html",
    "content": [
        "ST. LOUIS (AP) - Luis Rengifo homered, drove in four runs and finished a triple shy of the cycle, as the Los Angeles Angels beat the St. Louis Cardinals 11-7 on Thursday to complete a three-game sweep.",
        "The Angels won for the fourth straight time to improve to four games above .500 for the first time since June 1, 2022. The Cardinals lost their sixth in a row and have dropped nine of their last 10.\"They´re a good team over there,\" Angels manager Phil Nevin said. \"I know their record isn´t indicative of the talent they have, but they´re I know they´re coming and I never really felt comfortable until the last out, I´d never do. But resilient, we played great.\"Griffin Canning (2-0) gave up five runs in five innings to earn his second-straight decision for the Angels. Canning allowed six hits, struck out three and walked three.\"Obviously, I´d like the line to look prettier, but yeah, I feel pretty good with where I´m at physically and mentally,\" Canning said.Rengifo´s three-run homer capped a four-run second inning and gave the Angels a 4-2 lead. He drove in another with a sacrifice fly in the fourth and scored twice.",
        "Rengifo also came up with a big defensive play to thwart a potential Cardinals rally in the eighth.\"I feel really good,\" Rengifo said. \"Be focused and you know do my job every single day and I´m so happy for the results today.\"The Angels blew the game open by sending 11 batters to the plate in a six-run third that featured seven hits - all of which were singles. Zach Neto, who left Wednesday´s game in the fifth inning with a right finger contusion, capped the inning with a two-run single to make it 10-2.",
        "\"Just quality at bats,\" Nevin said. \"It was one thing I was proud of is, you know, the lead increased, we kept taking quality at bats and kept the line moving.\"Matt Thaiss had a pair of RBI singles in the second and third and scored a pair of runs for Los Angeles. Anthony Rendon reached safely four times and also scored twice.\"I personally feel pretty good at the plate,\" Thaiss said. \"Gotta keep trying to get the right pitch to the hit and make good decisions.\"Cardinals starter Jack Flaherty (2-4) gave up a career-high 10 runs in just 2 1/3 innings. The Angels went 7 for 10 with two strikes against Flaherty, who left the game after getting hit in the hand by a Rengifo comebacker.\"My hand´s fine,\" Flaherty said. \"I didn´t get taken out because I got hit in the hand, I got taken out because I sucked.\"The right-hander lamented the Angels´ success with two strikes.\"It´s a lot more frustrating giving up two-strike hits,\" Flaherty said. \"If you give up the hits in 2-1, 1-0 counts, you can understand that, that´s called falling behind. But if you give them up with two strikes, it´s called doing a bad job of executing.\"The Cardinals took a short-lived lead in the bottom of the first on Willson Contreras´ two-run double. Tommy Edman hit a three-run homer in the fourth and Paul Goldschmidt added a two-run double in the sixth for St. Louis, which at 10-22 is off to its worst start since the 1973 squad opened the season 8-23.",
        "Cardinals outfielder Lars Nootbaar recorded his first career four-hit game.TRAINER´S ROOMAngels: LHP José Quijada (left elbow) will undergo Tommy John surgery.Cardinals: IF Nolan Gorman (lower back tightness) was taken out of the game in the sixth inning for precautionary reasons.UP NEXTAngels: LHP Tyler Anderson (1-0, 5.74 ERA) gets the start Friday night as Los Angeles returns home to face the Rangers, who have not officially named a starter. Anderson is 1-0 with a 2.45 ERA in five career appearances (four starts) against Texas.Cardinals: LHP Jordan Montgomery (2-4, 3.34 ERA) kicks off a three-game set Friday night as St. Louis hosts the Detroit Tigers and LHP Matthew Boyd (1-2, 5.47 ERA). The Cardinals are 0-10 in series openers, setting a franchise record to begin a season.___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}