{
    "articleURL": "/wires/aap/article-12049371/Fire-burns-surf-queen-Sally-Fitzgibbons.html",
    "content": [
        "It takes a lot to wipe the trademark smile from the face of Sally Fitzgibbons, but the Australian says missing the World Surf League mid-season cut broke her heart.",
        "A Tour regular since 2009, the 32-year-old finished 11th with just 10 female surfers progressing to the remaining five events - the top five then contesting the CT finals in September.Fitzgibbons also missed the controversial cut last year when it was first introduced, but was granted a wildcard which meant she could compete in three further events.This time she retreated to her home break on the NSW south coast to re-connect with the ocean and set herself for the Challenger series, which gets underway on Saturday with the Gold Coast Pro.While she's won 12 Tour events, Fitzgibbons has felt pain before following three world champion runner-up finishes.\"It breaks your heart - it's like a big heart punch and those ones take a beat,\" Fitzgibbons told AAP.\"Putting yourself out there and absolutely getting knocked back down, it's so hard.\"Everyone can relate in their work and life and it just sucks and you think 'how am I going to rebuild', but after doing it time after time you know where to go and what to do.\"As well as missing the chance to push for an elusive world title, Fitzgibbons' hopes of again representing Australia in next year's Olympics ended with her quarter-final elimination at the Margaret River Pro.",
        "\"Just in that one heat all those goals get wiped off the table and that's another big reason why it hurts so much,\" she said.\"But that's life and you want to be fair and reason with it and make sense of it but a lot of the time you just got to fly with it.\"Fitzgibbons said she was inspired by the likes of 2022 world champion Stephanie Gilmore, 35, and 51-year-old Kelly Slater, so sees no reason to retire.\"Having role models like Steph and Kelly Slater who have pushed the envelope on the age conversation - it really shows in our sport, as long as you're engaged, enthusiastic, you can push that envelope to whatever you want to,\" she said.\"I proceed with curiosity as I feel healthy and I've got plenty of surfing in the tool belt that haven't been able to access with the new Tour schedule on the world Tour.\"Hopefully in the Challengers series I can showcase more sort of progressive surfing maneuvers so I've got some other goals that are kind of interesting and towing me along.\"Plus I just love that challenge of showing up on game day and trying to bring out the ultimate performance and so I'm still very much into it.\"",
        "Fitzgibbons needs to finish the Challengers series ranked in the top five out of 48 surfers to regain a place in the top Tour.With competition ever improving in the women's field, Fitzgibbons is pushing for more surfers to survive the mid-season cut.\"Considering on the Tour one to 18 can definitely win the event, and pretty much be a title contender, it really shows the depth,\" Fitzgibbons said.\"I'm more of a facts-based person and I just see all the evidence is there so we're knocking on the door and asking that question, so we will see if it's answered.\""
    ]
}