{
    "articleURL": "/tvshowbiz/article-12060085/Alesha-Dixon-teases-toned-midriff-orange-bralette-Eurovision-2023-rehearsals-Liverpool.html",
    "content": [
        "Rita Ora sizzled as she took to the stage for Eurovision Song Contest's dress rehearsals at the M&amp;S Bank Arena in Liverpool on Monday. ",
        "The songstress, 32, who is performing during Tuesday's Semi Final , sent temperatures soaring in a plunging PVC corset.She put on an incredibly busty display in the ensemble that also included tiny matching shorts and a dramatic chiffon train. Rita completed the look with PVC opera gloves and accentuated her height with platform boots.  The stunner wore her blonde tresses in loose curls and accentuated her features with glamorous make-up.",
        "She was joined by host Alesha Dixon, 44, as the acts rehearsed ahead of Tuesday's live show, which will be followed by a second semi final on Thursday before the Grand Final Saturday May 13. The speculator run through featured a whole hosts of acts strutting their stuff in wild costumes and sets featuring wild pyrotechnics.Alesha, was joined by co-hosts Julia Sanina and Hannah Waddingham, and cut a stylish figure for the run through and showcased her toned midriff in a tiny orange bralette.The BGT judge layered the look with an oversized black suit and slipped her feet into a pair of comfy white trainers. Sporting a glamorous make-up palette the stunner wore her brunette tresses in a long sleek braid. Alesha completed the look with a selection of gold jewellery as oozed confidence ahead of the big night.Meanwhile Ted Lasso's Hannah, 48, cut a chic figure in an silk green cami top which she wore with a tailored black blazer.",
        "She added a little rock and roll to the enemble with distressed jeans and added height to her frame with heels. ",
        "Finally Ukrainian star Julia Sanina, 32, stunned in a chic leather dress that boasted a fitted bodice and sheer sleeves.The trio appeared on high spirits as they rehearsed their lines and watched the first batch of semi finalists perform.  They will be joined on stage at Saturday's final by Graham Norton, 50, with an worldwide expected audience of 180million. Ukrainian broadcaster Timur Miroshnychenko will be the Eurovision correspondent in Liverpool, appearing in VT inserts during the live shows and giving live insights from Ukraine’s commentary box in the Liverpool Arena.He will front the opening ceremony live stream on the official Eurovision Song Contest YouTube Channel alongside Liverpudlian presenter Sam Quek.For the grand final commentary on BBC One and BBC iPlayer, Graham and comedian Mel Giedroyc will take turns in the commentary box to bring those watching at home their unique and expert views on the 2023 acts.",
        " For the first time in the UK’s Eurovision Song Contest history, both semi-finals will be live on BBC One and BBC iPlayer.Radio DJs Scott Mills and Rylan will bring UK audiences their colourful commentary.There will be a special commentary team on BBC Radio Merseyside, which will include Claire Sweeney and the winner of The Voice of Eurovision talent search, which is currently underway to discover new Liverpudlian talent.",
        "This year’s Eurovision Grand Final has the Royal seal of approval. During a visit to the venue, the Liverpool Arena, the King told the UK entrant Mae Muller that he would be ‘watching with great interest’ and ‘egging her on’. ‘Thank you. No pressure,’ she joked.Eurovision is one of television’s great event nights. Whether you’re a super-fan or you couldn’t care less, it provides spectacle, a real sense of watch-along community and some brilliant pop music.At last year’s contest, held in Italy, the UK fielded its strongest entry for years with Sam Ryder’s Space Man, but no one begrudged the Ukrainians their victory with Kalush Orchestra’s ebullient Stefania.",
        "In happier times, this year’s event would have been held in Ukraine but, because of the Russian invasion, the UK offered to host and Liverpool won the contest to stage it.For the first time in the UK’s Eurovision history, both semi-finals (Tuesday and Thursday, 8pm) will be live on BBC1. UK viewers can vote in the second semi-final. But it is the final, in which 26 countries compete, that is set to attract more than 160 million viewers globally. Graham Norton and Mel Giedroyc (top, with commentator Rylan Clark) will provide the waspish commentary, while Ted Lasso’s Hannah Waddingham, pop star Alesha Dixon and Ukrainian singer Julia Sanina take on hosting duties.",
        "A performance from Kalush Orchestra will get the show under way, and we’ll hear from 2022 runner-up Sam Ryder during the first interval. The second interval act celebrates Liverpool’s pop heritage, with six past Eurovision acts reinterpreting some classic hits.",
        "The beauty of Eurovision is that you can watch it with amused detachment, you can watch it as a competition and try to work out the various countries’ voting strategies based on their geo-political allegiances, or you can watch it simply as a pop music festival.And who is going to win? At the time of writing, the bookies have Sweden’s entry, Tattoo, sung by 2012 winner Loreen, as the odds-on favourite. The UK’s entry, Mae Muller’s I Wrote A Song, is less favoured but it’s certainly not out of the running.The Eurovision Song Contest's first Semi Final will air Tuesday May 9 at 7pm on BBC1"
    ]
}