{
    "articleURL": "/wires/reuters/article-12061469/Writers-strike-freezes-Handmaids-Tale-Game-Thrones-spinoff.html",
    "content": [
        "By Lisa Richwine and Dawn Chmielewski",
        "LOS ANGELES, May 8 (Reuters) - Writing for a new season of \"The Handmaid's Tale\" and a coming \"Game of Thrones\" prequel was halted as a nearly week-long strike by thousands of film and television writers rippled across Hollywood on Monday.The writers of Emmy-winning Hulu drama \"The Handmaid's Tale\" had penned some early episodes for a new season ahead of filming that was supposed to start in late summer, said co-showrunner and executive producer Yahlin Chang.Writing of the dystopian drama stopped when the Writers Guild of America (WGA) called a strike last week, Chang told Reuters on Monday.A representative for Hulu declined to comment.Also on Monday, \"Game of Thrones\" author George R.R. Martin said in a blog post that the writers' room for prequel series \"A Knight of the Seven Kingdoms: The Hedge Knight\" was \"closed for the duration of the strike.\"The WGA began a work stoppage on May 2 after failing to reach a new labor agreement with higher pay from Hollywood studios such as Netflix Inc and Walt Disney Co. The studios have said they made a \"generous\" offer to boost compensation.Late-night talk shows immediately went dark, and some TV series and movies have followed. The final season of Netflix hit \"Stranger Things\" was paused. Marvel movie \"Blade,\" starring Mahershala Ali, shut down just before filming was set to start.",
        "\"The Hedge Knight\" was touted by Warner Bros executives last month as one of the marquee shows in development for Max, the new name for what had been HBO Max.The series is set 100 years before the events of \"Game of Thrones,\" a time when the Targaryen line holds the Iron Throne, and focuses on a young knight and his squire.Warner Bros has not announced a release date for \"The Hedge Knight.\"The second season of \"House of the Dragon,\" another \"Game of Thrones\" prequel, began filming in April, Martin said, and will continue in London and Wales. All eight episodes already were written and revised, he said.Martin also expressed his \"unequivocal support\" for the WGA.\"I hope the writers are given a fair deal as soon as possible,\" U.S. President Joe Biden said at a screening of the TV series \"American Born Chinese\" at the White House as part of a celebration of Asian American, Native Hawaiian, and Pacific Islander Heritage Month.It is unclear how long the strike will last. No new talks have been scheduled between the Guild and the Alliance of Motion Picture and Television Producers (AMPTP), the group negotiating on behalf of studios.\"Maybe the AMPTP members will come to their senses tomorrow and offer some meaningful concessions, and the whole thing can be wrapped up next week,\" Martin said. \"I would not bet the ranch on that, however ... I have never seen the Guild so united as it is now.\" (Reporting by Lisa Richwine in Los Angeles Additional reporting by Dawn Chmielewski, Dan Whitcomb in Los Angeles and Trevor Hunnicutt in Washington; Editing by Mary Milliken, Aurora Ellis, Matthew Lewis and Cynthia Osterman)"
    ]
}