{
    "articleURL": "/news/article-12049287/Bryan-Kohberger-seen-arguing-Washington-police-officer-law-new-body-cam-footage.html",
    "content": [
        "Newly-released body camera footage shows Bryan Kohberger, 28, pleading ignorance when a Washington State University officer pulls him overHe claims in the video that he does not know about Washington's law prohibiting drivers from blocking intersections because he is from rural PennsylvaniaFootage comes just weeks before Kohberger is due back in court for the quadruple homicide of University of Idaho students Newly-released body camera footage shows quadruple murder suspect Bryan Kohberger arguing with a Washington police officer just weeks before the Idaho massacre.",
        "In the footage released Thursday, Kohberger, a 28-year-old with a master's degree in criminal justice, could be seen in his sedan trying to get out of a red light ticket.Kohberger claimed he was ignorant of Washington state laws prohibiting drivers from blocking intersections because he is from a rural town in Pennsylvania.The body camera footage offers new insight into Kohberger's character in the weeks leading up to the deaths of University of Idaho students Kaylee Goncalves, 21, Madison Mogen, 21, Xana Kernodle, 20, and Ethan Chapin, 20.Kohberger is charged with one count of felony burglary and four counts of first-degree murder in connection to the Idaho killings, and is due back in court later this month.",
        "In the footage released Thursday evening by Washington State University police,  a female officer told the murder suspect: 'I think you know why I stopped you. You ran the red light.'But Kohberger wanted to correct the officer and said: 'What actually happened is I was stuck in the middle of an intersection, so I was forced to go left.'",
        "The officer then replied that she was behind Kohberger 'the whole time,' and explained. 'You're not supposed to enter the intersection at all for that reason because if the light turns red, then you're stuck in the intersection.' ",
        "At that point, Kohberger claimed he was unfamiliar with how to drive through intersections because he grew up in a rural town in Pennsylvania.The female officer tried to explain that under Washington law, drivers are not allowed to enter an intersection unless there's enough space for vehicles on either side.After handing over his license and registration, Kohberger then asked the officer for more clarification.'Can you explain that to me a little bit further?' he asked. 'So in Pennsylvania, when you're in an intersection you have to make the left. What would the appropriate thing for me to have done been?'The officer replied simply: 'You're not supposed to block an intersection like that in Washington.'She said doing so qualifies as running a red light, and is a ticketable offense. 'So you're not supposed to proceed into the intersection until you can go, 'cause a lot of people do what you just did.'",
        "He then claimed he was confused because in the moments before he made the turn a vehicle opposite him turned right without their blinker on.'I was just slightly into the crosswalk,' Kohberger continued. 'Where I'm from in Pennsylvania, we actually don't have crosswalks,' he stated. 'There's a little more leeway as well.''It never even occurred to me that was actually something wrong,' he said. ",
        "So, he said, he was confused about the law and told the officer: 'I apologize if I was asking you too many questions about the law.' The officer then let him go with just a warning. That video was cited in a probable cause affidavit for Kohberger's arrest in eastern Pennsylvania, with homicide detectives noting that the officer's body camera footage depicted him as the driver and sole occupant of a white sedan with a Pennsylvania license plate.A matching white sedan was seen speeding away from the house where the four college students were murdered in Moscow, Idaho.Washington police also released footage Thursday showing cops banging on his door on December 30, announcing their presence and serving a search warrant.But Kohberger was already back in Pennsylvania, where he was taken into custody by state police and the FBI that same day.",
        "Meanwhile, newly-unsealed court documents describe what police noticed was missing from Kohberger's apartment in Pullman, Washington.'We also noticed, while cleaning the apartment, it was sparsely furnished and fairly empty of belongings, including no shower curtain in the bathroom and the trash cans appeared empty,' Washington State University Assistant Chief of Police Dawn Daniels wrote. The desk and his office were also empty.But police said they found evidence connecting Kohberger to the brutal stabbings in Moscow, Idaho.",
        "Authorities said they retrieved a single 'nitrite-type black glove,' eight 'possible hair strands' and a single 'possible animal hair.'Officers also found what appeared to be blood stains, describing 'cuttings from [an] uncased pillow of reddish/brown stain' and mattress covers with multiple stains.They also asked for, and were granted, a search warrant for a storage unit they believed belonged to Kohberger. It is not clear what, if anything, they found in the storage unit.Washington State also released an official letter from the school informing Kohberger he is no longer welcome on the campus.It was signed by Kohberger from his Idaho jail cell. "
    ]
}