{
    "articleURL": "/femail/article-12042397/Video-clip-shows-cars-blocking-pavement-mounting-kerb-park.html",
    "content": [
        "Clip reveals common problem for pedestrians in UK towns and villages Do you know which street this is? Do you have a similar problem in your area? Email: siofra.brennan@mailonline.co.ukRead more: Full list of 111 yellow box junctions which 27 councils plan to fine drivers for using as local authorities push for wider enforcement powersA pedestrian has shared footage showing how hard it is to walk on the pavement in a street near where they live - because cars mount the kerb to park.",
        "Twitter user @lucy_khall shared a clip of the Norwich street where a series of cars had parked on the pavement, making it almost impossible to navigate it on foot.A blue Norwich City Council wheelie bin adds insult to injury.  She captioned the video: 'Went for a walk today - or tried to.'The ensuing footage shows a series of cars parked half on the pavement and half on the road. Before too long she reaches the path-blocking wheelie bin. She followed up the photo adding, with a note of sarcasm that the 'stretch of public amenity land in highly desirable NR2' had been 'donated to a dozen car owners'.It's currently not illegal to park on the pavement, say the Department of Transport - unless you live in London, where fines can be issued. ",
        "The clip has been viewed nearly 300,000 times and has sparked furious debate about whether the motorists are in the wrong to put their vehicles in a position that clearly compromises the safety of those with pushchairs and using wheelchairs.Radio 2 presenter Jeremy Vine, who regularly shares videos of altercations and incidents on the London roads he commutes along, re-posted the video asking 'What's the solution to this?' A deluge of responses has followed, with many pointing out that the combination of cars and a wheelie bin would make it almost impossible for someone in a wheelchair to get down the road. ",
        "One raged that the pedestrian should: 'Cross over, the pavement on the other side of the road was perfectly clear. Why make a fuss? Why attention seek? Why the hatred towards cars?'Another suggested nothing will change until fines are doled out to drivers parking on pavements. They wrote: 'Fine people for driving and parking on the pavement - if it’s not illegal currently make it so - they , the drivers , would be less inclined to do this if it resulted in a fine.'It's currently not illegal to park on the pavement - unless you live in London according to the Department for Transport, although the DfT is considering introducing fines in other parts of the country to dissuade motorists from parking on pavements.Highway Code rule 244, in place for nearly 50 years,  states that drivers 'MUST NOT park partially or wholly on the pavement in London and should not do so elsewhere unless signs permit it.'However, outside of the capital, the language changes, with 'should not' replacing 'must not'...giving motorists the green light to park up deep onto the kerb.  "
    ]
}