{
    "articleURL": "/wires/pa/article-12050845/Katherine-Sciver-Brunt-announces-England-retirement-19-extraordinary-years.html",
    "content": [
        "Katherine Sciver-Brunt has announced her international retirement, bringing the curtain down on an extraordinary 19-year career in which she took more wickets than any other woman for England.",
        "Sciver-Brunt made her international debut in August 2004 and went on to collect 335 wickets in 267 appearances, helping England to three Ashes series victories and as many World Cup wins – two in ODIs and one in T20s.Only India’s Jhulan Goswami (355) has more dismissals than Sciver-Brunt in all women’s international formats, with the seamer finishing as England’s leading wicket-taker in both ODIs (170) and T20s (114).Now 37, Sciver-Brunt quit playing Tests last year and quietly slipped away from ODIs as well but she has now elected to walk away from England altogether, despite contemplating staying on for the T20 portion of this summer’s multi-format Ashes series.“Well here I am, 19 years later, at the end of my international journey,” she said. “I thought I’d never be able to reach this decision but I have and it’s been the hardest one of my life.“I never had any dreams or aspirations to do what I’ve done, I only ever wished to make my family proud of me. And what I’ve achieved has gone way beyond that.”Sciver-Brunt’s last England appearance came in the T20 World Cup semi-final defeat against hosts South Africa in February, where she attracted some criticism for her on-field outbursts of frustration.However, that white-line fever she sometimes exhibited was instrumental to her and England’s success, particularly in 2009 when they claimed World Cup glory in both limited-overs formats.",
        "Another 50-over World Cup followed in 2017, while she married her England team-mate Nat Sciver-Brunt in May 2022, with the couple electing to use the same surname on the field earlier this year.“I have so much to be thankful for, cricket has given me a purpose, a sense of belonging, security, many golden memories and best friends that will last a lifetime,” Sciver-Brunt added.“Of the trophies and titles I could have wished to achieve, I have reached them all, but my greatest achievement is the happiness that I have found in Nat.“It has been a huge honour representing England for so long and I’d like to thank all of the England cricket family past and present for making my time a special one.“The supporters – you are awesome. Without you we wouldn’t be able to do what it is that we love and the atmosphere you guys create is irreplaceable.“The biggest thanks I have though goes to my family, they are my biggest fans and greatest support without which I wouldn’t have made this journey at all.”Sciver-Brunt, often considered a bowling all-rounder after amassing 1,864 international runs, has already stepped away from regional cricket but will continue to play in The Hundred.Clare Connor, deputy chief executive officer and England Women’s managing director, paid tribute to her former team-mate.",
        "Connor, Sciver-Brunt’s first England captain, said: “Katherine has done so much for the game of cricket and for women’s cricket in particular. She has been an unbelievable role model, giving us everything she has for nearly 20 years.“Katherine began her career in a completely different era from the one we are in now and we owe her a debt of gratitude for the part she has played in progressing our game, raising standards and bringing a new audience to women’s cricket.“She is quite simply a legend of our sport.”"
    ]
}