{
    "articleURL": "/wires/ap/article-12057567/Cole-wastes-6-run-lead-Rays-beat-Yanks-8-7-10-innings.html",
    "content": [
        "ST. PETERSBURG, Fla. (AP) - Gerrit Cole had sailed through this season until a pair of long balls ended his day and sparked the Tampa Bay Rays to an improbable comeback.",
        "Cole failed to hold a six-run lead, allowing his first two home runs of the year, and the Rays beat the Yankees 8-7 Sunday on Isaac Paredes' 10th-inning single to take two of three from New York.\"It feels awful,\" said Cole, who briefly paused, searching for words. \"I let them down today by just coughing up the lead.\"Anthony Rizzo and Harrison Bader homered for the Yankees (18-17), who led 6-0 before Tampa Bay scored twice in the fifth and five times in the sixth to surge ahead 7-6.\"A tough one, obviously,\" Yankees maanger Aaron Boone said. \"Difficult.\"Jose Siri and Christian Bethancourt homered for the major league-best Rays (28-7), who improved to 19-3 at home. Last-place New York has lost 10 of its last 16 games and at 18-17 trails the Rays by 10 games.",
        "\"This was a big one,\" Rays manager Kevin Cash said. \"I know that our clubhouse is pretty excited and they should be.\"The announced crowd of 32,142 was the largest at Tropicana Field since 40,135 for a game against San Francisco on June 17, 2016, according to the Rays.Paredes broke a 7-7 tie with a one-out hit to right off Albert Abreu (1-1) that scored automatic runner Brandon Lowe.Aaron Hicks avoided Garrett Cleavinger's tag attempt during a rundown between third and home on GleyberTorres' grounder to shortstop with one out in the 10th but was thrown at the plate. Cleavinger took a tumble on the play, point to a leg and left the game with a limp.",
        "Cash said Cleavinger has a knee injury and will likely be placed on the injured list.Jalen Beeks (1-2) replaced Cleavinger and struck out Rizzo on a 3-2 pitch.Cole's ERA rose to 2.09 from 1.35, which had been tied for the major league lead. He retired 13 of his first 17 batters but allowed seven of his last nine to reach.After allowing a major league-high 33 homers last year, Cole didn't allow one in his first 51 innings before Siti homered in the fifth. Yandy Díaz scored later in the inning when second baseman Gleyber Torres made a tumbling grab shallow right field on Wander Franco´s hit but followed with an errant throw to third base.\"It motivates everyone,\" Siri said. \"It was a key moment at that point in the game that we had to take advantage of it and start scoring some runs.\"Paredes hit an RBI double in the sixth ahead of Bethancourt's three-run homer, that tied the score 6-6. Siri walked and stole second, and sprinted home when reliever Jimmy Cordero failed to look at him after fielding Díaz's grounder near the first-base line and throwing to to first for the out.\"Obviously, got to be more aware in that situation,\" Boone said.Jose Trevino hit an RBI grounder in the seventh.",
        "Cole was allowed six runs and eight hits in five-plus innings. It was the first time this season he as given up more than two runs and his ERA climbed from 1.35 to 2.09.Cole, who is 2-8 in regular-season games against the Rays, said he lost command of his secondary pitchers and hasn't pinpointed the problem.Rizzo had a solo homer and Bader added a two-run drive off Josh Fleming in the third. Hicks got his first extra-base hit this season, coming on his 57th at-bat, with an RBI double in a two-run fourth.. He scored on Torres' two-base hit. New York took a 6-0 lead when Bader tripled in the fourth and scored on Oswaldo Cabrera's sacrifice fly.UP NEXTYankees: LHP Nestor Cortes (3-2) and Oakland LHP JP Sears (0-2) are Monday night´s scheduled starters.Rays: LHP Shane McClanahan (6-0) will face Baltimore RHP Kyle Gibson (4-1) on Monday night. ___AP MLB: https://apnews.com/hub/mlb and https://twitter.com/AP_Sports"
    ]
}