{
    "articleURL": "/wires/pa/article-12059167/Police-hunt-four-suspects-teenager-stabbed-death.html",
    "content": [
        "A 17-year-old boy has been stabbed to death in Buckinghamshire in a “targeted attack”, police said.",
        "Thames Valley Police are hunting for up to four suspects – who had their faces covered – following Sunday night’s attack in High Wycombe.Another 17-year-old boy was also hurt but his injuries are not thought to be life-threatening and he has been taken to hospital.",
        "Officers were called to reports of the stabbing in the Easton Street area of High Wycombe at about 7.30pm on Sunday.No arrests have been made.Senior investigating officer Detective Superintendent Kevin Brown said the investigation into the “tragic incident” was in “the very early stages” and “details as to what has happened are currently very limited”.He added: “The incident occurred between around 7pm and 7.30pm close to the main car parks of Easton Street at a time when members of the public would have been using the car parks, attending the theatre or preparing for a night out in the town.“It is therefore very important that anyone who was close to Easton Street at this time and saw something unusual or out of the ordinary or indeed knows anything about this incident gets in touch as soon as possible.“Anyone who has any information or footage from dash-cams, doorbells or CCTV close to Easton Street is urged to make contact.“This is a tragic incident in which a teenage boy has been killed, and I know that it will cause a great deal of concern in the community.",
        "“However, I’d like to reassure everyone that we are carrying out a thorough investigation into what appears to be a targeted attack.”He said there would be a “large police presence” in the area as officers investigated.",
        "On Monday, Wycombe MP Steve Baker, who is also a Northern Ireland Office minister, told the PA news agency: “This is a tragic incident and it’s vital we leave space for the police to conduct their inquiries and, for that reason, I don’t want to say much about this continuing inquiry.“But my heart goes out to the young man’s family and friends who I do not doubt will feel devastated.“For the people of Wycombe, they should know that the police are closely investigating this and they have my complete confidence as they follow things up.”Easton Street remained cordoned off on Monday evening as police officers in white forensic suits entered properties and searched front gardens.One local business owner, whose premises back onto the site of the police investigation, said he was “scared”.Akib Tayyab, 28, branch manager of QV Traditional Turkish Barber, said: “It was scary because it is behind my shop. I’m scared this happened. It is very dangerous.“I hope the police catch them soon because this is not good for our town.”",
        "Video footage from Mr Tayyab’s premises showed two police tents remained in place in the small car park where the teenager is reported to have been killed.Mr Tayyab added: “You see too much drug dealers and homeless people around here. It’s not good.”Saravnan Karuvayan, 46, the manager of Kappad restaurant on High Street, said: “I was shocked. We have never had anything like this before.“We’re worried because people might think it’s not a nice place for safety.”Rav Lam, 34, a shop assistant at Londis on High Street, said: “I was working here after 7pm on Sunday. Some people told me that some boy got stabbed in the hand. In the morning, people came in and said somebody had been killed.“It’s very shocking. It’s ridiculous. Usually, I feel safe in this area.”A woman who works close to the scene of the stabbing but did not want to give her name, said, while she did not see the incident, she was a “bit scared because it’s on our doorstep because my shop is just 10 metres from that”.Anyone with information or footage which could help the investigation is asked to call 101, quoting reference number 43230199275.The stabbing came after three people were stabbed to death in separate incidents in east London over a period of less than eight hours on the eve of the coronation.",
        "Renell Charles, 16, was ambushed as he left school and stabbed to death, while murder investigations were also started after the killings of 18-year-old Jordan Kukabu and 27-year-old Sebastian Zon, the Metropolitan Police said.In another incident, an 18-year-old man who has been named by police as Ben Moncrieff was killed in Bath, in Somerset, in the early hours of Saturday."
    ]
}