{
    "articleURL": "/news/article-12039505/Alex-Murdaugh-admits-LIED-told-responders-dogs-caused-housekeepers-fatal-fall.html",
    "content": [
        "Gloria Satterfield was the family's housekeeper and nanny for 25 years before she died in February 2018Insurance company Nautilus - which paid out millions of dollars following the death - has filed a fraud lawsuit against the disgraced attorneyMurdaugh's surprise ‘confession’ appears in legal papers obtained by DailyMail.com Alex Murdaugh has claimed he lied when he told emergency responders and investigators that his dogs caused housekeeper Gloria Satterfield’s fatal ‘trip and fall’ at his hunting lodge home of Moselle.",
        "It is a sensational development in what remains an ongoing investigation into the circumstances of the 57-year-old’s death following an incident at the Murdaugh family home in 2018.Murdaugh, 54, made his ‘confession’ in legal papers obtained by DailyMail.com in response to a fraud lawsuit being brought against him by insurance company Nautilus.The company shelled out millions to Satterfield’s sons when Murdaugh encouraged them to sue him in the wake of their mother’s death, assuring them that he would admit liability.He did so to pocket the money himself, recommending that the brothers use the services of attorney Corey Fleming without telling them that Fleming was his best friend and co-conspirator in what has been described as a ‘depraved’ plot to cheat them out of the guaranteed pay day, the court documents allege. ",
        "When Nautilus settled the case, Murdaugh concealed it from Tony and Brian Satterfield and took the lion’s share of the money intended for them. Fleming took $600,000 in legal fees.Now, having stuck to the story that secured a multimillion dollar pay-out five years ago, Murdaugh has changed his tune.According to the Satterfields’ attorney, Eric Bland, he has done so in a bid to cheat the housekeeper’s boys once again.In court documents filed May 1, Murdaugh states: ‘No dogs were involved in the fall of Gloria Satterfield on February 2, 2018. After Ms Satterfield’s death, [he] invented Ms Satterfield’s purported statement that dogs caused her to fall to force his insurers to make a settlement payment.’",
        "With Bland’s persistence Satterfield’s sons have recouped north of $7.5million of the insurance money from other liable parties and secured a separate judgment of $4.3million against Murdaugh.",
        "But, if Murdaugh made up the circumstances of Satterfield’s death, then the claim was fraudulent, meaning no money should have ever been paid out in the first place and that, while Murdaugh defrauded Nautilus, he owes Satterfield’s sons nothing at all.Speaking to DailyMail.com Bland said: ‘Are you going to believe anything that comes out of the mouth of a convicted double murderer, fraudster and liar?‘This is a desperate bid by a desperate man with desperate lawyers.’Nautilus filed their suit against Murdaugh in June, 2022.In the complaint seen by DailyMail.com the company states that it was Murdaugh's son Paul and wife Maggie who were at Moselle when the incident happened, with Paul calling 911.",
        "According to the court papers: ‘Immediately following Gloria Satterfield’s fall on February 2, 2108, [Murdaugh] rushed to the scene, arriving before EMS. On March 29, 2018 Murdaugh stated that Ms. Satterfield briefly regained consciousness during which time she stated that Murdaugh’s dogs had caused her to fall. This statement was heard by no one else and is contradicted by Ms. Satterfield’s later statement to hospital staff that she had no idea what made her fall.’",
        "Murdaugh also claimed that Satterfield was at his property ‘not to perform work for Murdaugh and his family, but to collect a check for work performed by someone else, thus avoiding a worker’s compensation defense.’The insurance policy documents seen by DailyMail.com show that Murdaugh took out a $5million umbrella policy to cover Moselle just one month before Satterfield’s fall.Heartless text messages have revealed how Murdaugh lied to his former housekeeper's son about a $4million wrongful death payout.The disgraced attorney, 54, promised Tony and his brother Bryan, a vulnerable adult, he would 'take care' of them after their mother died.During Murdaugh's trial for the cold-blooded murders of his wife, Maggie, 52, and son Paul, 21, Tony told the court that Murdaugh pledged to get the pair $100,000 each and cover Gloria's medical expenses. But he went on to steal more than $4.3million from two insurance policies without giving them a cent.",
        "'When the defendant came to you around the time of your mom's funeral and said he was going to help you and file a claim on your behalf, why did you agree?' prosecutor Creighton Waters asked.'Because I trusted him,' said Satterfield.Satterfield testified he was only informed of the settlements in June, 2021, after the murders.",
        "'Did you ever get one cent from Alex Murdaugh?' Waters asked.'No,' Satterfield answered.Even though Gloria Satterfield died in an accident, her death was never reported to the Hampton County coroner.State Law Enforcement Division agents said they would exhume her body about a year after the deaths of Murdaugh's son and wife, but never announced any findings or reopening of the investigation into her death.",
        "The Murdaugh family told the sons their mother tripped over the family dog. Gloria died in hospital around four weeks later from a head injury. She was never able to relay the events of that day.However, the boys' lawyer Eric Bland has stated that they do not suspect foul play was at work. Bland later secured $4.3million for Gloria's children after suing Murdaugh.But when his fraud regarding the Satterfield payout was exposed in September 2021 it was as shocking as it was damaging and came as one of the first major revelations that saw his life implode.South Carolina Law Enforcement Department announced that they would be opening a criminal investigation into Satterfield’s death on September 15, 2021.The decision was prompted by a letter written by Hampton County Coroner Angela Topper to Mark Keel, then SLED Chief, in which she expressed concern that no autopsy had ever been conducted on Satterfield, whose death, she noted, was ruled ‘natural’ which was inconsistent with a trip and fall."
    ]
}