{
    "articleURL": "/wires/ap/article-12042697/Swedes-tighten-terror-laws-likely-help-NATO-membership.html",
    "content": [
        "STOCKHOLM (AP) - Lawmakers in Sweden passed legislation Wednesday that tightens the country's anti-terrorism laws, a move expected to help persuade Turkey to approve the Nordic nation's request to join NATO.",
        "The revision includes a prison term of up to four years for individuals convicted of participating in an extremist organization in a way that is intended to promote, strengthen or support the group. However, the penalty can be increased to eight years when a crime is deemed serious.The legislation allows for someone identified as a leader of a terror organization to receive a life sentence, which in Sweden generally means a minimum of 20-25 years.The bill, which passed on a 268-34 vote with 47 lawmakers absent, made it illegal to finance, recruit for or publicly encourage a terrorist organization, as well as traveling abroad with the intention of joining such a group.The revisions are set to take effect June 1.Turkey has accused Sweden of failing to take concrete steps to crack down on groups that Ankara lists as terror organizations or considers existential threats, including Kurdish groups.Sweden´s center-right government has taken a harder line not just toward Turkey´s outlawed Kurdistan Workers´ Party, or PKK, but also toward the Syrian Kurdish militia group YPG and its political branch, PYD. Turkey regards the YPG as the Syrian arm of the PKK, which for decades has waged an insurgency within Turkey.Swedish Foreign Minister Tobias Billström has said there were close links between the PKK and the YPG/PYD, and Sweden would therefore \"keep a distance\" from Syrian groups in order not to harm relations with Turkey.",
        "Sweden and Finland jointly applied for NATO membership in May 2022, abandoning decades of non-alignment in the wake of Russia´s invasion of Ukraine.While Finland became the Western military alliance's 31st member nation in April, opposition from Turkey and Hungary stalled the Swedish bid. NATO requires unanimous approval to admit new members."
    ]
}