{
    "articleURL": "/sport/football/article-12058259/Emotional-Ange-Postecoglou-breaks-Celtic-win-second-Scottish-title.html",
    "content": [
        "Celtic secured back-to-back Scottish league titlesPostecoglou fights back tears after match Bhoys could wrap up a treble next month An emotional Ange Postecoglou has struggled to hold back tears as he talked about his family and those close to him who have made sacrifices to help his career after guiding Celtic to a second Scottish title. ",
        "Goals from Kyogo Furuhashi and Hyeong-gyu Oh claimed a 2-0 win over 10-man Hearts and retained the SPFL Premiership for a second season; the club's 11th title win in 12 years.Needing one win from their last five league games, a red card for Hearts defender Alex Cochrane at the end of the first half saw the champions move through the gears to place the league out of the reach of closest rivals Rangers.Victory over Inverness Caledonian Thistle in the Scottish Cup Final on June 3 would secure the Australian's first treble as manager – the club's fifth clean sweep in the last seven years.'Plenty of people in my circle make sacrifices - my family, my kids,' Postegoclou told Sky Sports while fighting back tears.",
        "'Like I said, I've got the easy bit - I'm doing what I love,' he continued with emotion in his voice.'But they're the ones who are a constant support. And not just my family, my friends - here and in Australia. The whole football club really embraced me from day one. And for that I take pride that I'm able to give something back.'Celtic has now won 53 league titles — just two off Rangers' record of 55.'I'm really proud,' said Postecoglou afterwards to the press. 'They're just an outstanding group of players and staff.",
        "'After the success of last season you wonder whether the hunger is still going to be there as it's still a young group. Are they going to be as motivated?'But from the first day of pre-season they came back and wanted to be a better team and be a stronger team.'They have maintained a ridiculous standard of performance this year.'They've just been incredible and I've rarely had to intervene at any stage to get them back on track.'I've had the easiest job in the world in terms of just allowing these guys to drive how good they want to be.'The consistency of our football and the goals we've scored is about trying to be successful on all fronts.'We never want to take a backward step in any competition.'You want that rewarded because that's what makes them continue to strive towards being the best they can be.'",
        "Given a rousing ovation from the 1300 away fans in a corner of Tynecastle Postecoglou confessed to feeling emotional over his fourth trophy as Celtic manager. Lifting the Scottish Cup would make it five domestic trophies from a possible six.'I am emotional because you put a lot into it, you know. I realise that I'm doing what I love.",
        "'I'm pretty good at it but it doesn't happen in isolation without the people around you, whether that's my wife and kids and family and friends or the support I've had within the football club and outside the football club. You want to pay that back as well.'It's not just about having success, it's about giving back to all those people who are prepared to support me on a daily basis to allow me to do what I do.'Everything you do it hard earned and all those sacrifices people make - and the commitment and support they give me - makes you emotional to think about.'With four games left Celtic travel to Ibrox next weekend hoping to go an entire league season without losing to their bitter rivals.",
        "Games against St Mirren, Hibs and Aberdeen then round off the league campaign before the Hampden final.The title a foregone conclusion, Postecoglou admitted the performances of his side had dipped slightly the closer they came to the line.'I think we have been playing pretty tight in the last few weeks, just in emotional terms.'The boys know they have been close to achieving something special and the closer you get, it's know human nature to tighten up a bit. I think that's been reflected in our football.",
        "'But through that time they are still disciplined and work so hard for each other. They never lose focus.'They just have this determination – they are winners, mate.'Five points adrift of Aberdeen in the race for third Hearts interm boss Steven Naismith criticised the game-changing Alex Cochrane red card which reduced his team to ten men for the second half.The left-back tugged back Daizen Maeda as the Japanese attacker raced through on goal.Initially shown a yellow by referee Nick Walsh, the decision was upgraded to a red after a review by VAR official Willie Collum.",
        "'I don't agree with it. That is my opinion but there is still a bit of work to be done by Maeda as he heads into the box.'He is travelling at speed, the ball is moving, and there are recovering players. I think the referee made the right call and that was disappointing because until that moment in the game we had the best chances.'The game had been mainly played in the Celtic half and we had a real belief that we could get something from the game. Then it became harder.'As soon as the red card happens, the game hinges on the first goal. It's as simple as that.",
        "'Credit to celtic, the goal is very good, that's what they do and you see loads of their goals come from that same kind of movement.'Their two goals today come from the same movement but we worked really hard and when we look back there will be lots of positives for us.'Naismith believes Hearts now face two huge games in the battle for third against St Mirren and Aberdeen.'The next two games are the biggest of the season and they will define our season.''This was going to be our toughest challenge but we equipped ourselves well. Before the game i aid we would be aggressive and have our moments and we did that.'We were brave defensively against the best forwards in the league and they never created too many until the red card. There are loads that we can take from it. Loads of positives.'"
    ]
}