{
    "articleURL": "/wires/reuters/article-12039867/Reuters-World-News-Summary.html",
    "content": [
        "Following is a summary of current world news briefs.",
        "Israeli jets hit Gaza as fighting escalates after hunger striker deathIsraeli jets hit targets across the Gaza strip on Tuesday, in response to rocket barrages fired by militant groups earlier in the day following the death of a Palestinian hunger striker in Israeli custody. Plumes of smoke spiraled into the night sky as the jets hit targets including training camps of Hamas, the Islamist group that controls the coastal enclave.Sudan's warring generals extend theoretical truce but keep fightingSudan's warring military factions agreed to a new and longer seven-day ceasefire from Thursday, neighbor and mediator South Sudan said, even as more air strikes and shooting in the Khartoum capital region undercut their latest supposed truce. Previous ceasefire pledges have ranged from 24 to 72 hours but there have been constant truce violations in the conflict that erupted in mid-April between the army and a paramilitary force.Family of ex-Bosnian Serb leader sues US to escape sanctions listFamily members of former Bosnian Serb political leader Radovan Karadzic, who was convicted of war crimes for his role in the 1990s Balkan conflict, sued the U.S. Treasury Department on Tuesday over their continued inclusion on a U.S. sanctions list. Karadzic´s wife Ljiljana, son Aleksandar and daughter Sonja said in a complaint in Washington, D.C., federal court that the Treasury Department´s Office of Foreign Assets Control, which administers U.S. sanctions, has unreasonably delayed its decision on whether to lift sanctions against them.",
        "EU plans to boost ammunition production to aid UkraineThe European Union's executive wants to set aside more than 500 million euros ($550 million) to increase ammunition production to help Ukraine and replenish the stocks of EU member countries. Under a plan to be presented by the European Commission on Wednesday, the EU would give subsidies to European arms firms for investments that increase production of ammunition and missiles.US set to open new embassy in Tonga this month -senior US diplomatThe United States is on track to open a new embassy in Tonga this month, the top U.S. diplomat for East Asia said on Tuesday, part of efforts to step up its diplomatic presence in the Pacific region to counter China. Daniel Kritenbrink told a subcommittee of the Senate Foreign Relations Committee that the United States was also continuing to engage with Vanuatu and Kiribati about opening proposed new embassies in those countries.Kosovo, Serbia fail to agree on lowering tensions in north Kosovo, says EU policy chiefLeaders of Kosovo and Serbia failed to agree on how to lower tensions in Serb-majority areas in north Kosovo, EU foreign policy chief Josep Borrell said on Tuesday, warning that any further escalation could undermine the EU-backed deal on normalizing ties. In March, Pristina and Belgrade verbally agreed to implement a Western-backed plan aimed at improving ties but little progress has been seen since.",
        "Explainer-What is happening in Sudan? Fighting in Khartoum explainedA conflict in Sudan that erupted on April 15 has killed hundreds of people, driven more than 100,000 to flee across the borders and displaced hundreds of thousands inside the country where many already relied on international aid before fighting began. WHAT TRIGGERED THE VIOLENCE?Syrians in Sudan flee war for second timeRadwan Hisham Wahba fled Syria in 2012 for Sudan, hoping to build a new life after being shot when his country collapsed into civil war. Now, as violence engulfs his adopted home, he and many other Syrians living there are on the move once more. Days after escaping the bloodshed in Khartoum as military factions turned on each other in a new war, Wahba is camping in the streets of Port Sudan on the Red Sea coast waiting for passage to safety and another fresh start.Zelenskiy says White House did not inform him of documents leak, Washington Post reportsUkrainian President Volodymyr Zelenskiy told the Washington Post in an interview published on Tuesday that the White House did not inform him about a leak of secret U.S. documents that grabbed attention around the world last month. \"I did not receive information from the White House or the Pentagon beforehand,\" Zelenskiy was quoted as saying.",
        "As counteroffensive looms, Ukraine vows not to give up BakhmutUkraine's military vowed on Tuesday not to give up the pulverized eastern city of Bakhmut as it prepares to launch a long-promised counteroffensive against Russian forces. General Oleksandr Syrskyi, commander of ground forces, underlined the importance Kyiv attaches to holding Bakhmut as preparations continue for a counterattack which it hopes will change the dynamic of the war."
    ]
}