{
    "articleURL": "/tvshowbiz/article-12052615/Da-Brat-wife-Jesseca-reveal-did-NOT-choose-black-sperm-donor.html",
    "content": [
        "Da Brat and her wife Jesseca 'Judy' Harris-Dupart have insisted that the reason they did not choose a black sperm donor is that there were too few options.",
        "The couple have been facing a barrage of criticism from trolls who believe they selected a non-black donor out of racial preference.However Jesseca, 41, whose egg was used, and Da Brat, 48, who is carrying the baby, have repeatedly clarified that a scarcity of black donors prompted their decision.On a recent episode of their reality show Brat Loves Judy, the couple were seen meeting with their fertility doctor and weighing their choices.When the results of Jesseca's genetic testing were taken into account, the couple had only 224 donors whose samples they could use - of whom only one was black.",
        "Their fertility specialist Dr. Obehi Asemota informed them that 'there are not enough black donors - black sperm donors, black egg donors.'Da Brat, whose legal name is Shawntae Harris-Dupart, then joked that the single black donor available to them looked 'like Jiminy Cricket.'She repeated the Jiminy Cricket comparison in an interview with The Root, saying with a laugh: 'I was like: \"I'm sorry but that wasn't gonna be my choice.\"'While discussing the donor they did use, she said: 'Because we didn't have a lot to choose from, he definitely wasn't black. But I think we did a great job with picking. He's handsome, he's tall and I think he's going to look beautiful with my wife's egg.'",
        "Social media users were quick to take offense at the Jiminy Cricket jibe and began theorizing that the couple simply preferred not to use a black donor.An exasperated Jesseca responded to the furor on her Instagram this week, writing: 'So , as a mother of 3 beautiful black kids , and even a black grand baby I want to CLARIFY S*** to avoid this STORYLINE from continuing that we choose our donor off of looks and that we didn't want a black donor.'She laid out a seven-point explanation of her and Da Brat's choice that began: '1) WE HAD NO IDEA GOING INTO THIS THAT our chances of a black donor would be slim to none 2) that I was a carrier of so many disorders 3) that our window was SOOOO slim and such high risk cus of age and more'.Jesseca added: '4) with my genetic testing I'm the carrier of 4 disorders , that reduced our chances of a black donor down to 1 person and that 1 person had very limited info / portfolio to judge on ….. including BACKGROUND'.",
        "She noted: '5) I'm honestly disappointed more than anything at the storyline , but do understand the lack of knowledge on IVF in our community cus a lot of people don't even realize all the things when it comes with the journey including LACK OF BLACK DONORS, genetic testing , age where most your eggs are gone , etc'.",
        "Jesseca acknowledged: '6) the headlines are misleading but also my wife made a distasteful joke and now it's attached to the headline and making it seem like we choose strictly off of looks and we didn't at all attempt to find a black donor when in fact not only did we try but we also waited to see if more would pop up over time - but had to stay within the window that we had to choose.'She pointed out: 'Furthermore people think just cus u have money that ANYTHING is possible but no amount of money was Changing the cryobanks inventory.'Further, Jesseca wrote: '7) our baby created with a HEALTHY baby first mindset once we learned all the things , was a hard decision and of course we didn't want to add any other stigmas or anything to our child but we had SEVERELY limited options .'In conclusion, she offered: 'Thanks to all the people supporting us on our journey and I truely hope this brings Awareness to more black men to donate.'Da Brat and Jesseca went down the aisle last February, then joyfully announced a year later that the former is pregnant with their first child together.'I never thought I was going to have kids,' Da Brat confessed to People. 'I just thought it wasn't in the cards for me. I've had a great career, a full life. I felt like, because I didn't get pregnant earlier on, then it just wasn't going to happen for me.'",
        "Her relationship with Jesseca, however, prompted her to begin 'looking at life so differently. I was like, I want a little me with you. Something special from the both of us that we can share and raise and love unconditionally.'"
    ]
}