{
    "articleURL": "/wires/ap/article-12059523/Tyson-Foods-moves-2Q-loss-weighed-charges.html",
    "content": [
        "Tyson Foods suffered a surprise loss in the second quarter, something not since 2009, and cut its sales forecast due to the cost of plant closures and layoffs.",
        "Shares slid more than 15% Monday.Tyson has been trying to cut costs over the last six months. It closed its corporate offices in Chicago and South Dakota late last year and consolidated its workforce in Arkansas. In March it announced the closure of two plants in Arkansas and Virginia in order to better use available capacity at other facilities.Tyson laid off 15% of its senior leadership and 10% of its corporate workers last month as it faces steep inflation on labor, grain and other inputs.CEO Donnie King said in a conference call Monday that feed costs for chickens were $145 million higher in the second quarter. And in 2021 the company raised wages and implemented changes like flexible scheduling in order to combat rising absenteeism at plants.Chicken sales volumes rose 6% in the quarter but prices lagged as supplies rose across the industry. Tyson's pork volumes rose 1% but prices dropped 10% on lower global demand. And beef sales volumes and prices dropped as U.S. demand sank, with inflation-weary shoppers looking for alternatives.\"I can´t remember a time when our business faced the highly unusual situation that we´re currently seeing, where all three of our core protein categories __ beef, pork and chicken __ are experiencing market challenges at the same time,\" King said.",
        "The Springdale, Arkansas, company __ which processes 20% of all U.S. chicken, beef and pork __ lost $97 million, or 28 cents per share, for the three months ended April 1. A year earlier it earned $829 million, or $2.28 per share.Taking out one-time restructuring charges, Tyson lost 4 cents per share at a time when Wall Street analysts had been projecting a per-share profit of 81 cents, according to a survey by Zacks Investment Research.One bright spot was Tyson's prepared foods business, which produces brands like Jimmy Dean, Hillshire Farm, Ball Park and Sara Lee. Sales volumes were flat but prices rose 2% and Tyson said its products gained market share.\"Branded food is our best opportunity to drive faster growth, higher margins and stronger results,\" King said.King also expressed confidence that global demand for meat will grow as incomes increase, even if U.S. demand flattens.\"We've been through market cycles before. I've been through them before myself. And we've always come out stronger on the other side,\" King said.Tyson's second quarter revenue was flat at $13.13 billion, which is a little short of expectations.Tyson Foods Inc. now anticipates fiscal 2023 revenue of $53 billion to $54 billion. Its previous forecast was for revenue between $55 billion and $57 billion.",
        "Analysts surveyed by FactSet had expected revenue of $55.19 billion."
    ]
}