{
    "articleURL": "/femail/article-12050015/Queen-Camillas-elevated-role-challenging-Prince-Harry-experts-claim.html",
    "content": [
        "Queen Camilla's 'elevated role' will be 'challenging' for Prince Harry, expert said Read more: For all the latest Royal news, pictures and video click here The Queen Consort's 'elevated' role will be 'challenging' for the Duke of Sussex, experts have told Palace Confidential. ",
        "Prince Harry will see his father, King Charles III, and stepmother Camilla crowned at Westminster Abbey on Saturday but will be jetting straight back to his LA home.It is understood the Duke will only be in the UK for around 24 hours as he intends to be back home for his son Archie's fourth birthday, which coincides with Saturday's Coronation.Experts have now revealed Camilla's position in the Coronation may be particularly difficult for Prince Harry. Speaking on Palace Confidential, Richard Eden said: 'Harry felt that everything was directed towards Camilla and rehabilitating her and he sees that as being behind his row with the press essentially: that all his father cared about was good press for him and Camilla. But it’s the right thing to do, Charles needs Camilla to be accepted alongside him, she is his Queen.’  ",
        "Our panel discussed the elevated role that Queen Camilla will play and what effect that might have on the family. Sarah Vine said: 'No heir to the British throne has ever been able to marry a divorcee and keep the crown.'What Charles is doing is unprecedented in a constitutional sense. He has...they were both divorced. It would have been unthinkable.'There's a sense of him putting himself out in order to make people understand the level of commitment he has to this woman.",
        "'She is going to be anointed in this ceremony. It's...this is not going off at half cop. He is really making it clear, you must respect this woman.'She is your Queen but she is my Queen and I really want her to have the respect she deserves.'The great tragedy of our royal family is that Charles was never allowed to marry Camilla in the first place.'If he had been allowed to marry her in the first place, none of this stuff would have happened. Poor Diana wouldn't have had the nightmare she wouldn't have had, Harry wouldn't have been living in America furious with everyone.'People asking if there will be a presence of Diana on Saturday - there will be, in the shape of Harry who has made it clear what he thinks about Camilla.",
        "'He really feels she has usurped his mother. It's complicated.'  The Daily Mail’s Diary Editor Richard Eden said that for Prince Harry in particularly, the Coronation will be challenging.‘We know the significance it’s had for his family because of how large it looms in Prince Harry’s memoirs,’ he tells the show.Sarah asked 'why shouldn't Camilla be respected as the Queen', adding: 'She is his second wife. They had a very low key ceremony. She's being anointed Queen in the eyes of the country and God.",
        "'It's very contemporary and very modern. This is normal now. It reflects how times have changed.'This is the culmination of Charles lifelong romantic quest that the woman he loves be given the respect and credibility he feels she deserves.' Elsewhere on the show, royal eyebrows were raised this week when Princess Anne questioned the new King’s long-held plans of a slimmed-down monarchy, during a TV interview. Daily Mail columnist Sarah believes Anne ‘has a point’ as the monarchy has already ‘slimmed itself down’ and that the Princess Royal speaks from ‘a position of absolute strength’.‘You know what siblings are like, they don’t hold back,’ she says. ‘She’s not scared of him and doesn’t care what he thinks particularly and presumably speaks up constantly at private events.’Asked by Palace Confidential host Jo Elvin if she thinks the new King is ‘scared’ of his sister, she replied: ‘Yes! I would be scared of Anne. Is there anyone who is not? 'Have you seen her control a horse? I imagine a king is much easier to control than a horse.’"
    ]
}