{
    "articleURL": "/sport/nfl/article-12043625/Ex-Packer-Randall-Cobb-join-Aaron-Rodgers-New-York.html",
    "content": [
        "Aaron Rodgers reportedly asked for Randall Cobb to join him in New YorkAnd Cobb now looks set to join the Jets on a one-year contractDailyMail.com provides all the latest international sports newsAfter joining ex-Packers teammate Allen Lazard in New York, Aaron Rodgers will be welcoming yet another Green Bay face to the Jets.",
        "According to ESPN, the team will sign wide receiver Randall Cobb on a one-year deal, reuniting Rodgers with one of his favorite targets from his 18 seasons with the Packers.Cobb and Rodgers have played ten seasons together across two stints, as the former was in Green Bay from 2011-18 before returning for two more years in 2021 after year-long stints with the Texans and Cowboys.And Rodgers reportedly expressed his desire to play with Cobb during talks with the Jets, naming him, Lazard, Odell Beckham Jr. and tight end Marcedes Lewis on a 'wish list,' according to ESPN. Rodgers pushed back against that reporting, calling it 'ridiculous.' ",
        "He told Pat McAfee on his eponymous show that he simply gave 'glowing' reports about some of his former teammates to the Jets.Nonetheless, he now has two of his favorite targets from Green Bay in New York.Lazard, who signed a four-year, $44million deal with the Jets before Rodgers was officially traded there, played five seasons under the star quarterback after joining as an undrafted free agent in 2018.Rodgers was finally dealt to the Jets last week after declaring on March 15 that he wanted to play in New York.Lazard posted a career-high in receiving yards last season with 788, along with six touchdowns.",
        "Additionally, backup quarterback Tim Boyle and tackle Billy Turner moved from Green Bay to New York, while former Packers offensive coordinator Nathaniel Hackett took the same job in New York.Cobb will be 33 when the season starts and will join a crowded receivers room also including Offensive Rookie of the Year Garrett Wilson, Corey Davis and Mecole Hardman Jr."
    ]
}