{
    "articleURL": "/wires/pa/article-12042937/I-not-fallen-victim-fraudsters-I-received-scam-texts--Sunak.html",
    "content": [
        "Rishi Sunak has said that he has received scam text messages before, as he announced plans to crack down on fraudsters.",
        "The Prime Minister, on a visit in Buckinghamshire to promote the Government’s new fraud strategy, said that he had received fake delivery messages before.He did not say when this occurred, but told broadcasters he had not fallen for it “largely because I don’t have time now to answer my phone anymore”.The new strategy will include banning cold calls on all financial products, such as those relating to insurance or sham cryptocurrency schemes, the Government said. It is really important that people don't feel embarrassed. There's stigma to talk about it. People feel that somehow they have done something wrong. That is not the case  Rishi Sunak, Prime Minister  It also plans to work with Ofcom to use new technology to further clamp down on number “spoofing”, so fraudsters cannot impersonate legitimate UK phone numbers.Under the plans, banks will also be allowed to delay payments from being processed for longer to allow for suspect payments to be investigated.The Government said it will also ban other devices or methods commonly harnessed by scammers to reach thousands of people at once – such as so-called “sim farms” and review the use of mass-texting services to keep these technologies out of the hands of criminals.Sim farms are devices that can be loaded with hundreds of sim cards and controlled from a computer. Fraudsters use them to send thousands of scam texts at once.",
        "The Prime Minister, who said that there was an unfortunate “stigma” attached to falling for a scam, said he had never been a victim himself.“We were just participating in a workshop. I have, like almost everybody, received one of these text messages claiming to have a delivery that I need to pay for.”He added that “most of our families have been impacted by this”.“It is really important that people don’t feel embarrassed. There’s stigma to talk about it,” he said.“People feel that somehow they have done something wrong. That is not the case.”Ministers said that to make it easier for victims to report fraud and rebuild confidence that cases are being dealt with properly, a new system will be up and running within the year.It will replace the current Action Fraud service, the UK’s fraud reporting centre.Backed by a £30 million investment, the new system will provide a simpler route for reporting fraud online, with reduced waiting times and an online portal to allow victims to get timely updates on the progress of their case, the Government said.A new anti-fraud champion, Anthony Browne MP, has been appointed.Opposition parties criticised the plan as not doing enough.Yvette Cooper, Labour’s shadow home secretary, said: “This plan is too little, too late, and fails to match the scale of the problem.",
        "“All the Home Secretary has delivered is a rebadging of existing national teams, and a re-announcement on the replacement of Action Fraud from almost two years ago.”"
    ]
}