{
    "articleURL": "/news/article-12043071/Man-catches-control-stroller-rolling-traffic-grandmother-slips-falls.html",
    "content": [
        " An unidentified woman fell losing her grip on stroller with baby strapped inside  Footage shows the stroller rolling backwards towards the busy intersection A Good Samaritan jumps into action saving the child with just moments to spareHeart-stopping video shows the moment a California man catches an out-of-control stroller with a baby inside moments before it nearly rolled onto a four-lane highway - after the woman pushing it tripped and fell. ",
        "The terrifying ordeal happened on Monday when an unidentified woman who was standing near her vehicle suddenly tripped and fell down onto the ground losing her grip on the baby stroller.Dramatic footage then shows the stroller - with the child inside - speeding backwards towards the fast-moving intersection as the injured and panicked woman struggles to get up.Within seconds, a Good Samaritan is seen racing towards the speeding stroller and catches it with just seconds to spare. Another passerby runs over to help the woman who was still on the ground and barely able to stand up. The harrowing video was posted on Monday around 7:30pm by USSGoodGirl with the caption:  'Windy AF here today and the stroller rolled away… Thank god a man catches the stroller before anything bad happens to this lady’s baby.' ",
        "Someone on the video is overheard saying,'Omg... she started running and she fell.' 'They cannot get up because she hurt her knee so bad... she can't move an inch,' said the other narrator.Once the random stranger is seen running to help save the baby, the other person watching the video adds,  'You are the man... lifesaver right there...perfect timing.'It is unclear when the incident actually took place and in what area in California it happened. But, certain parts of Southern California had been under a high wind advisory that day.  ",
        "It is also unclear who the child's caretaker was. The post garnered more than 20 million views after being shared on Twitter. USSGoodGirl wrote:  'Oh my goodness.. I was panicked. How terrifying! Thank God for that man being there.'But, some people who watched the video wondered if the lock on the stroller had ever been released and with the combination of the high winds and no lock - it seemed like a disaster waiting to happen. 'Holy s**t!!; wrote one person. 'Why wasn’t it locked?! No way I’d let my hands off a stroller if it was windy like that.'",
        "Many shocked viewers agreed and were still reeling from the scene and grateful that there was a happy ending.  'I hope the guy who saved the day by catching the stroller got some kind of kudos locally. Impressive feat,' wrote someone. While others were still shaken by what could have been a very tragic ending.'I watched that with my heart in my throat,' someone wrote. 'God bless that manAnother said, 'Winds are bad today … I was holding my breath on that one.'"
    ]
}