{
    "articleURL": "/wires/ap/article-12051965/After-Rich-Strike-Derby-long-shots-2nd-look.html",
    "content": [
        "LOUISVILLE, Ky. (AP) - Two long shots winning the Kentucky Derby over the past four years might be coincidental, but they also are a reminder not to dismiss any of the 19 horses running Saturday at Churchill Downs.",
        "Especially since Rich Strike and Country House demonstrated how some faith could pay off big.Country House's stunning elevation in 2019 from Derby runner-up to winner stood out initially because of the unprecedented circumstance in which stewards disqualified Maximum Security for interference after he crossed the line first. An eye-popping payout of $132.40 followed for the 59-1 long shot, which ranked as the second-highest payout until Rich Strike came out of nowhere last May to overtake favorite Epicenter in the stretch and post the dramatic upset.Rich Strike returned $163.60 at nearly 81-1, second only to Donerail´s $184.90 in 1913. His remarkable run still generates buzz, which might stir interest in nine starters saddled with morning line odds of 30-1 to 50-1.\"It´s a race where the odds don´t really matter nearly as much as they do in the other races because the favorite can get a bad draw at the post,\" Rich Strike´s trainer, Eric Reed, said this week. \"He could get a trouble trip, and a lot of times a lot of horses get bad trips.\"If I´m handicapping the Derby, I always look first and foremost for a horse that can get the distance because three-quarters of the field won´t. And if you can single out the one that will, then you´ve got a horse that´s going to run in the top five or six.\"",
        "Hall of Fame trainer Todd Pletcher has the top two 3-year-old choices on Saturday in Forte (3-1), who is on a five-race winning streak, and Tapit Trice (5-1), who rallied to win the Blue Grass at Keeneland. Angel of Empire (8-1) is the third choice and trained by Louisville-born Brad Cox.Everybody else has double-digit odds, with Jace´s Road, Raise Cain, Reincarnate, Sun Thunder and just-added King Russell the longest shots at 50-1. Disarm, Hit Show, Cyclone Mischief - who got in on Thursday after Practical Move was scratched - and Rocket Can are listed as 30-1. Japan-bred horse Mandarin Hero, who replaced Lord Miles following trainer Saffie Joseph Jr.´s suspension, and Confidence Game are listed at 20-1.While wide-ranging odds are common in most races, horsemen and handicappers note the gaps in Derby horses don´t necessarily reflect quality. The qualifying process begins in the fall with points awarded to the top four in selected graded stakes races, increasing in value in early spring championship races that largely determine the field and presumed favorites.And the horses to watch.\"Every horse that runs in the Derby absolutely needs to be taken seriously because of the nature of the Derby that you need to qualify,\" said Andrew Moore, racing general manager for FanDuel.com. \"There has to be a certain standard to get into the Derby in the first place, so there is quality control.\"",
        "From there, a horse needs a combination of ability, determination and a little luck.Rich Strike was the first of two also-eligibles poised to get in with a defection, which occurred at the last minute when Hall of Fame trainer D. Wayne Lukas scratched Ethereal Road the Friday before the Derby. Little was known about Rich Strike, hence the high odds, but the racing world quickly learned about him as he navigated from the outside No. 20 post through any space he could find before eventually passing Epicenter.Country House was ninth at the three-quarter mile point before surging through the slop into the top three and finishing 1 3/4 lengths behind Maximum Security before the historic DQ after a 22-minute review. His run was no fluke, considering he was fourth or better in three preceding stakes races.\"Country House was a horse that I always liked, but did I know he was going to show up that way on Derby day?\" Hall of Fame trainer Bill Mott said last week. \"He was 50-1 and was one of the biggest payoffs in Derby history. When they run a race, you´re never really sure.\"Tempting as it might be for bettors to think it could happen again Saturday and take a chance on long shots, Moore believes those wagers will be more recreational wagers than primary. Short odds speak volumes about a horse´s form, and favorites have displayed it very well in the Derby.",
        "But as Rich Strike demonstrated last year, anything is possible in the Derby if everything falls into place.Moore added: \"That is part of the fun and fascination of the Derby, what we don´t know.\"___AP sports: https://apnews.com/hub/sports and https://twitter.com/AP_Sports"
    ]
}