{
    "articleURL": "/tvshowbiz/article-12052773/Im-Celebs-Myleene-Klass-recalls-told-lose-weight-24-male-cast-members.html",
    "content": [
        "Myleene Klass recalled how she was publicly told to lose weight for her role in West End musical Miss Saigon aged 18.",
        "The TV personality, 45, made the revelation during Friday's episode of I'm A Celebrity All Stars as she had a heart to heart with campmate Carol Vorderman, 62.Myleene explained: 'When I joined the Miss Saigon cast, I was lined up with all the other girls and I was told, 'You've got to lose weight'.She said the rude remark was made in front of her 24 male cast members who starred in the production as American G.I's.Adding: 'I wasn't pulled aside and I just stood there and it swallowed me up'.",
        "Myleene appeared in the tragic love story set in the Vietnam war alongside Jonathan Pryce, 75, which premiered at London's Theatre Royal Drury Lane in 1989.Later in the conversation, she spoke about being body-shamed when joining band Hear'Say in 2001 after being formed on reality show Popstars.   She went on: 'And then I got in the band and I had other band managers coming up saying, 'You're the fattest band in pop'.'So again, rather than the fact we had talent, I could read any music, play most instruments you put in front of me - it came back to 'fattest band in pop',' she added.Elsewhere, Myleene revealed she was told to change her name at the start of her career because it was too 'ethnic'.",
        "The presenter, who's mum is Filipino and Dad is Chinese, said she was advised to use her middle name 'Angela', but she refused.She told campmate Carol: 'I was asked to change my name. I was told people wouldn't be able to pronounce it because it was quite an ethnic name.'You'd be cancelled if you said something like that now. I was told to use my middle name. My middle name is Angela.' ",
        "Later Emotional scenes unfolded when Helen Flanagan was treated to a phone call home to her children.The former Coronation Street actress, 32, is mother to Matilda, seven, Delilah, four, and Charlie, two, with her ex-fiancé Scott Sinclair.Helen was chosen nominated to speak to her offspring for 90 seconds, with the ex soap star being chosen over Myleene because Helen had been in the camp longer.Myleene, who is mother to daughters Ava, 15, Hero, 12, and son Apollo, three, burst into tears at the news. ",
        "Although Myleene insisted she was over-the-moon for Helen and thrilled to hear her kids were doing well, the singer was left devastated over not being chosen. A delighted Helen went to a clearing nearby for her call, with her mother Julia answering the phone, telling her the girls had been on their best behaviour.",
        "I'm A Celebrity... South Africa continues at 9pm on ITV1 and ITVX on Monday."
    ]
}