{
    "articleURL": "/news/article-12058147/Shane-Drumgold-text-Lisa-Wilkinsons-Brittany-Higgins-Logies-speech-Bruce-Lehramnn.html",
    "content": [
        "ACT DPP Shane Drumgold grilled over Bruce Lehrmann trialThought Lisa Wilkinson was 'bragging' about Logies nominationMr Drumgold texted 'oh no' after hearing about her speech",
        "Lisa Wilkinson sent multiple emails to the top prosecutor at the helm of the rape trial against Bruce Lehrmann pleading with him to tell the public that her disastrous Logies speech was not in contempt of court.",
        "Shane Drumgold, the ACT Director of Public Prosecutions, told a special Board of Inquiry on Monday his account of the fallout from Wilkinson's speech which delayed Lehrmann's rape trial last year. Mr Drumgold told the inquiry that he first reacted to Wilkinson's Logies speech last June by texting his junior counsel something along the lines of 'oh no'. The speech delayed Mr Lehrmann's trial and sparked a media furor, with the inquiry hearing reports in the press were 'impacting her personally'. On Monday, Mr Drumgold was grilled over why he didn't respond to emails from Channel Ten's lawyer Marlia Saunders asking him to specifically clear her name. He argued he 'probably' didn't respond because he was concerned about Brittany Higgins' mental health at the time, and didn't think the emails warranted a response.In the emails, Wilkinson's lawyer Ms Saunders pointed to an earlier conversation in which she claimed Mr Drumgold had agreed to clear Wilkinson's name.The lawyer's emails also claimed Wilkinson did not believe she was warned against delivering her Logies speech, but that media reports incorrectly suggested she was due to a comment by the presiding judge.Ms Saunders said Wilkinson had been treated 'unfairly' by the DPP's office, and left her role as host on The Project due to media backlash following the speech on June 19 last year.",
        "When Erin Longbottom, the counsel acting for the inquiry, asked why he never told the public that he did not believe Wilkinson's speech was in contempt of court, Mr Drumgold said: 'I'm not a publicist, I'm the Director of Public Prosecutions.'",
        "Mr Drumgold then said it was not his responsibility to rectify calls for Wilkinson to be charged with contempt because the information was not in the public record.'What you're suggesting is that me, as the DPP, should monitor media and rebut false media,' he told the inquiry.Ms Longbottom and retired judge Walter Sofronoff, who is leading the inquiry, interjected and said that was not the suggestion at all.Mr Sofronoff said: '[In the email] Ms Saunders is putting to you that her client feels she has been treated unfairly. You don't get that every day, do you?'Mr Drumgold said he did not often receive emails like that. During her Logies acceptance speech last year, Wilkinson said generally implied the Ms Higgins' allegations were true.The speech, which was broadcast nationally, ultimately resulted in Mr Lehrmann's defence lawyers successfully applying to have the case postponed on the grounds that Wilkinson's words may have biased a jury against him.Mr Lehrmann was charged with sexual intercourse without consent in August 2021, with the jury set to meet for the first time on June 27, 2022 - eight days after Wilkinson's speech. Mr Lehrmann had pleaded not guilty and has continually maintained his innocence.",
        "Following her Logies win, media reports claimed Wilkinson was sufficiently warned against making any public speech about the rape trial, but that she ignored those warnings and went ahead with her speech anyway.There were further calls on social media to charge the journalist with contempt of court. On Monday, the Inquiry heard Wilkinson claims those reports were false and that she does not believe she was warned.Furthermore, Mr Drumgold agreed that he did not believe Wilkinson had committed any offence. ",
        "Earlier, Mr Drumgold told the inquiry he did not watch the television awards on June 19 last year and did not know the contents of Wilkinson's speech until he looked it up.During her acceptance speech, the TV journalist generally implied Ms Higgins' allegations were true.Mr Lehrmann was charged with sexual intercourse without consent in August 2021, with the jury set to meet for the first time on June 27, 2022 - eight days after Wilkinson's speech.The speech, which was broadcast nationally, ultimately resulted in Mr Lehrmann's defence lawyers unsuccessfully applying to have the case thrown out on the grounds that Wilkinson's words may have biased a jury against him.The case was delayed instead. Mr Lehrmann had pleaded not guilty and has continually maintained his innocence.On Monday, Ms Longbottom KC asked Mr Drumgold whether he was alerted to the speech on the morning of June 20.",
        "'I think I may have been alerted, I can't quite recall, I may have got a text alerting me that something had happened, it might have been from Skye' he said, referring to his junior counsel during the trial, Skye Jerome.When asked what his response was, Mr Drumgold said it was probably words to the effect of 'oh no'.'I was given enough information to conclude that something had gone wrong,' he recalled.Mr Drumgold was also quizzed about a Microsoft Teams meeting he had with Wilkinson, a lawyer for Channel 10, and Ms Jerome on June 15 - four days prior to the Logie awards.The inquiry heard Wilkinson told him she had a speech prepared in the event that she won, and and tried to read it aloud during the meeting as a way of asking whether she should make edits for legal reasons.",
        "Mr Drumgold was adamant that he warned the journalist that any publicity about the case could jeopardise the trial, but did not listen to her speech.When the head of the inquiry Walter Sofronoff asked why he didn't listen to her speech, the prosecutor said he effectively thought she was 'bragging' about her nomination.When Ms Longbottom asked why else Wilkinson would have tried to read her speech to him, Mr Drumgold said 'I don't know'.",
        "'Frankly, when I was hearing it I thought it was Ms Wilkinson pointing out that she was up for a Logie,' he continued.Mr Sofronoff interjected: 'You thought she was bragging about being nominated?'Mr Drumgold replied: 'Of that flavour, yes.'The inquiry, which is the Territory's version of a royal commission, will examine interactions between prosecutors and ACT Police regarding the charge against Mr Lehrmann, and the decisions to go ahead with a first trial and then not proceed with a retrial.Conflict arose between ACT Police and prosecutors about whether it was appropriate for police to interview Ms Higgins for a second time. There was also 'confusion' about whether Mr Lehrmann should be charged.Wilkinson won a news and current affairs Logie award for her interview with Brittany Higgins on The Project in February 2021, during which the former parliamentary staffer first aired her sexual assault allegations against Mr Lehrmann.The ACT government established the inquiry following accusations by police and prosecutors about each other's conduct during Mr Lehrmann's 12-day rape trial. "
    ]
}