{
    "articleURL": "/wires/reuters/article-12048569/Colombia-cancels-flights-returning-migrants-US-cites-mistreatment.html",
    "content": [
        "BOGOTA, May 4 (Reuters) - Colombia's migration agency has temporarily suspended a program to return Colombian nationals found by immigration officers at the U.S. border with Mexico, it said on Thursday, citing cruel and degrading treatment and last-minute flight cancellations.",
        "The number of Colombians trying to migrate north to the United States has soared in recent years, with more than 125,000 apprehended at the United States' southern border in 2022, according U.S Customs and Borders Protection (CBP), up from around 6,200 in 2021.Colombia expected to receive some 1,200 migrants in flights programmed to arrive from the United States during the first week of May, the migration agency said in a statement.The plan - which saw expulsion flights to Colombia rise to around 20 per month according to Colombian authorities - follows a push by U.S immigration officials to ramp up expulsions of migrants from the southern border before COVID-19 era restrictions are lifted.However, the plan was suspended after flights programmed for May 1 and May 2 were canceled, Colombia's migration agency said.\"Before the arrival of the scheduled flights ... both were canceled by the North American immigration agencies,\" Fernando Garcia, head of Colombia's migration agency, said in the statement.Garcia blasted the cruel and degrading treatment that some migrants were subjected to before boarding and during the flights, including the use of cuffs for hands and feet.\"There are recurring complaints about the poor conditions in detention centers and mistreatment during flights, which represented a determining factor in the decisions adopted in the last few hours,\" Garcia said.",
        "The U.S embassy in Bogota declined to comment on the matter.The lifting of the COVID restrictions, known as Title 42, which allows U.S authorities to expel migrants to Mexico without the chance to seek asylum, is due to take place on May 11. (Reporting by Luis Jaime Acosta; Additional reporting and writing by Oliver Griffin; Editing by Stephen Coates)"
    ]
}