{
    "articleURL": "/wires/aap/article-12054805/Albanese-leaves-UK-coronation-King-Charles.html",
    "content": [
        "Anthony Albanese's decision to pledge allegiance to King Charles at the monarch's coronation has been described as crucial, despite the prime minister's stance as a staunch republican.",
        "The prime minister on Sunday said it was an honour to represent Australia at the coronation, where he entered Westminster Abbey behind Governor-General David Hurley and the national flag-bearer, soccer star Sam Kerr.Mr Albanese, a self-proclaimed life-long republican, previously said the event was one of \"enormous significance\" and it was entirely appropriate that he attend and pledge allegiance to the King.Republicans had called on the prime minister to stay silent during the oath.Mr Albanese's frontbench colleague, Treasurer Jim Chalmers, said it was the right call for the prime minister to join the pledge on behalf of Australians.\"This was an important day and it's obviously crucial that the prime minister attend and pledge allegiance - I think that's what people expect,\" Dr Chalmers said.Opposition Leader Peter Dutton, who did not attend the ceremony in London, said the coronation was a momentous occasion for the British people, Australians and all citizens of the Commonwealth.\"It's a moment when an age-old tradition brings with it both a sense of reconnection to history and regeneration in our times,\" he said in a statement.The avowed monarchist noted the King respected the right of the people of the Commonwealth to determine their own destiny, including any move to become a republic.",
        "\"In 1994, Charles said that whatever course Australia takes, that is something which only the Australian people can decide,\" he said.\"In the meantime, all his family will 'continue to take a close personal interest in the welfare and fortunes of this country'.\"A 21-gun salute by Australia's Federation Guard was held in the forecourt of Parliament House in Canberra on Sunday, followed by a fly-past from the Royal Australian Air Force to mark the coronation.But the Australian Monarchist League criticised a NSW government decision to cancel plans for the Sydney Opera House sails to be lit up in honour of the coronation due to the cost involved.\"From now on, should taxpayer funds ever be used to light up buildings, it will prove that this decision was based on (NSW Premier Chris Minn's) republican sympathies and not on cost,\" national chairman Philip Benwell said.Meanwhile, the coronation triggered upset in some quarters, with independent senator Lidia Thorpe addressing a Sovereign Tea Party in Melbourne on Saturday about the \"violent colonial occupation\" by the British.\"Today is a painful day for our people and all colonised people around the world,\" Senator Thorpe said.\"The British Empire proudly displays the wealth it has stolen from us while our people continue to suffer and die at the hands of a colonial system that was violently imposed on us.\"",
        "Singer Nick Cave, who lives in the UK and attended the coronation as part of the Australian delegation, earlier said the event was likely to be the most important in the UK in the current era.\"Not just the most important, but the strangest, the weirdest,\" he said."
    ]
}