{
    "articleURL": "/tvshowbiz/article-12038853/CHRISTOPHER-STEVENS-reviews-nights-TV.html",
    "content": [
        "Glow Up: Britain’s Next Make-up Star ",
        "Rating:The Big Steam AdventureRating:That’s awkward timing. The trend for making yourself look as ridiculous as possible appears to be on the wane, just as the Beeb relaunches its absurd make-up show.Reality show celebs are dumping Botox and having their lip fillers removed, according to the wonderfully named BAAPS, the British Association of Aesthetic Plastic Surgeons.Demand for cosmetic procedures is down by about seven per cent. Love Islander Faye Winter now complains she ruined her face by inflating her mouth: ‘The only feature you could see on my face was my protruding lips. They became massive.’What collective madness has induced a generation of young women to suppose they’d look better with pink sofa cushions under their noses? They imagine they look fab when the effect is painfully silly — like the looks sported by the judges on Glow Up: Britain’s Next Make-up Star (BBC3).",
        "Val Garland wears Joe 90 goggles moulded to her cheekbones. Dominic Skinner has waxed his moustache into Poirot spirals and dyed his eyebrows pink. And these are the people, we’re meant to believe, who know what a perfect face looks like.The show’s latest presenter, Leomie Anderson, replacing Maya Jama, wisely keeps her make-up understated. Not so the ten contestants, who vie to create the most outlandish effects in powder and paint.",
        "Whether they are meant to be beauticians or special effects artists is never clear. Their first challenge was to make up actresses for a ballroom scene on Bridgerton, the steamy Regency drama on Netflix.Those who had seen the show were at an advantage. The rest went for lashings of pink eyeliner and neon lipstick, a look I last remember in Duran Duran videos of the 1980s. Perhaps that’s coming back into style — the Even Newer Romantics.The results of the next round were distinctly sci-fi. Urged to reveal a secret with facepaints, one artist covered her scalp in ping pong balls like plague buboes and sprayed her face with fake blood, to express her hidden anxieties.The judges loved it. I can’t imagine it’s ideal for a night out, though it ought to ensure you get a table in a busy restaurant — the other diners would run out screaming.One thing the show has in its favour is an absence of fake suspense. It was quite obvious which trainee MUAs, or Make Up Artists, were flagging.In the elimination round, where the last-placed duo had to apply liquid chrome lipstick to their models, the judges didn’t even pretend to wrestle with their decision. Howard, the oldest of the bunch at 30, got the boot, and precious little sympathy with it. Such a difficult age, 30: too old for fashion and too young to be a steam enthusiast.",
        "No such troubles for Peter Davison and John Sergeant, on The Big Steam Adventure (Ch5). Admiring a replica Thomas the Tank Engine, which first acquired its painted face in 1971, Peter remarked that he turned 20 that year. ‘I was 75,’ replied John cheerfully. The pair, accompanied by enthusiast Paul ‘Piglet’ Middleton, had a go at driving a traction engine and steering a steam barge as they meandered towards their finish line, the Scottish border.Mostly, they lurched from teashop to pub, though a little elbow grease was required as they chuntered through the seven Watford Locks near Leicester.They took things easier in First Class on the Duchess of Sutherland, where John ordered champagne and fresh rolls, before producing a jar of pickled eggs and a pot of gentleman’s relish.Bet that made the carriage pong. First Class isn’t what it used to be."
    ]
}