{
    "articleURL": "/wires/aap/article-12044541/Social-justice-commissioner-backs-holistic-kinship-care.html",
    "content": [
        "As the Aboriginal and Torres Strait Islander Social Justice Commissioner, Bunuba woman June Oscar leads work for the Australian Human Rights Commission.",
        "That includes the development of international human rights standards relating to Aboriginal and Torres Strait Islander peoples, co-chairing the Indigenous health campaign, Close The Gap, and monitoring the impact of laws, policies and programs on Indigenous people.She is a mother, grandmother and great grandmother.And as Ms Oscar explained to ABC Radio National's Patricia Karvelas, she is also a kinship carer for her great granddaughter.\"Her safety and wellbeing is the utmost priority,\" Ms Oscar said.\"As a kinship carer, it is important that children are placed with Aboriginal and Torres Strait Islander family members to ensure their sense of belonging, their connection emotionally and physically.\"They have a right to guaranteed safety and protection and love and care.\"She said the importance of placing Indigenous children with family should not be underestimated.\"I can't help but feel like, whilst I'm the blood-connected family member and the most senior female member in my little great granddaughter's life, I feel like I'm the new addition to the family and the agency holds more authority than I,\" Ms Oscar said.She said she had found the process of becoming a registered carer rigorous and challenging to navigate, because the child protection system was not designed to take Indigenous knowledge into account.\"I just cannot fathom how long we have to endure this type of treatment by government agencies when we have had the Stolen Generation inquiry and the national Aboriginal and Torres Strait Islander child placement policy and the recommendations on how the child protection statutory organisations and agencies have to work with Indigenous folks in this country,\" Ms Oscar said.",
        "\"We're not being respected across this country in terms of what we do bring to support children and how agents of governments can work with us to strengthen the supports that we need to provide the best care to vulnerable children.\""
    ]
}