{
    "articleURL": "/tvshowbiz/article-12051419/Cindy-Crawford-Helena-Christensen-Christy-Turlington-enjoy-1990s-Supermodel-reunion.html",
    "content": [
        "Legendary 1990s Supermodels Cindy Crawford, Helena Christensen and Christy Turlington enjoyed an Instagram reunion this week.",
        "The trio of bombshells sat at the pinnacle of the fashion industry three decades ago, when their fellow supermodel Linda Evangelista famously told Vogue: 'We don't wake up for less than $10,000 a day.'During their latest meetup Cindy, 57, Christy, 54, and Helena, 54, exuded the same megawatt glamour they were celebrated for all those years ago.They gathered together in front of an elegant art display and smiled radiantly as they posed for snap after snap to demonstrate their lasting bond.Their Instagram album also included special appearances by Cindy's daughter Kaia Gerber, Helena's son Mingus Reedus and Christy's daughter Grace Burns.",
        "Helena slid her enviably svelte frame into a skintight chrome green cocktail dress that featured a swirling pine tree motif.Meanwhile Cindy tucked her sleek black blouse into her high-waisted jeans in a move that emphasized her still enviably petite frame.Christy on the other hand wrapped herself in a black blazer over a midnight blue top, wearing her hair down in luxuriously bouncy curls.Kaia, Mingus and Grace have all followed their mothers' footsteps into modeling - now against the backdrop of a social media backlash to 'nepo babies.'Cindy shares Kaia, 21, with her dashing second husband Rande Gerber, who co-founded the tequila brand Casamigos with George Clooney and one Mike Meldman.",
        "Helena welcomed Mingus in 1999 with her ex Norman Reedus, who has since became a global star on The Walking Dead and is now with Diane Kruger.Grace meanwhile is Christy's daughter by the smoldering actor Edward Burns, whom she will celebrate her 20th wedding anniversary with next month.Mingus was sentenced to private counseling last year after pleading guilty to disorderly conduct, following allegations that he punched an unknown woman in the face at the San Gennaro festival in Manhattan.",
        "Although he initially stood accused of misdemeanor assault, his attorney told DailyMail.com the charge was negotiated down to disorderly conduct.In an interview with the New York Daily News, Mingus maintained that the woman was in a group of 'girls under the influence and looking for a fight.'He insisted that 'these girls swarmed me, one pulling my hair from the back, another throwing water in my face' - so he 'threw his arm out' as a form of self-protection and struck one of the women by mistake.'It was instinct. I was reacting to them swarming me and was afraid for the safety of my group,' said Mingus, alleging that the band of women he fell afoul of had been 'threatening to hurt my girlfriend and her friend.'As he recounted the sequence of events: 'Ten seconds later the police got involved. Police saw one of the girls hurt and refused to listen to the context.'"
    ]
}