{
    "articleURL": "/tvshowbiz/article-12043633/Chloe-Ferry-puts-busty-display-plunging-red-swimsuit.html",
    "content": [
        "Chloe Ferry put on a very busty display as she posed up a storm in a plunging swimsuit during a sun-soaked getaway.",
        "The Geordie Shore star, 27, took to Instagram on Tuesday to share a slew of sizzling snaps as she relaxes on a balmy holiday in a mystery location.She put on an eye-popping display in a very low-cut red two-piece with side cut-outs which showed off her incredible figure.Chloe styled her dampened brunette tresses loosely across her shoulders in natural waves as she enjoyed her beach day.She accentuated her striking features with a high-glamour make-up palette as she struck a series of sultry poses.",
        "The bombshell shielded her eyes with a pair of oversized black sunglasses from her very own brand Chloe Ferry Cosmetics as she promoted them in a caption.Announcing a giveaway, she penned: 'My new sunglasses has just launched! 50% OFF for 24 hours only @chloeferrycosmetics.'Also I am wanting to give back to my followers so I am giving away my sunglasses range to 1 lucky person.'All you need to do is: 1) follow me 2) comment what’s your fave style below 3) share on your stories &amp; tag me in I’ll be choosing a winner Monday 9th May 2023 at midday. 'Good luck, all sunglasses are linked too, happy shopping!'Chloe has not shied away from documenting her sun-soaked getaway as she has shared an array of gorgeous snaps to Instagram.",
        "On Monday, she sent temperatures soaring as she reclined in a pool on a watermelon shaped float while wearing a minuscule red two-piece. While most comments under the snap were appreciating the stunner and her flawless figure, one fan sparked concern about her surgery aftermath.They wrote: 'Look at the scaring under the boob Chloe go get them looked at [sic]'. ",
        "Chloe has made no secret of her love of surgery and previously admitted that she has spent in the realm of £50k to completely change her image, with work including three nose jobs, chin filler, Botox, two boob jobs and a Brazilian butt lift.Last year, she revealed her bitter regrets over undergoing a 'fox eye' treatment, which left her permanently scarred in a horrific aftermath. Speaking on Instagram last year in the wake of Big Brother star, Ryan Ruckledge discussing the same experience, she said: 'Hi guys I've been putting this off for a bit now but after seeing Ryan going on This morning to speak about the fox eye trend...'I feel like I need to tell everyone about my experience and what has happened to myself. I had the same procedure as Ryan done seven months ago and still to this day I'm left with terrible scars on my face which may never go away....",
        "'I'm seeing this procedure becoming increasingly more and more popular. This may not happen to everyone but as I'm left with scars seven months later I just wanted to take to social media just to let everyone know what had happened to myself.'In 2016, Chloe sadly revealed she found herself 'ugly' prior to her cosmetic procedures which she began at a tender age.She said: 'I don't have any regrets. I feel like I look a lot better now. I don't like natural. When I see before and after pictures I think I've changed so much...'When I see pictures from when I first went to Geordie Shore, I think: \"Woah. Was I that ugly?\" I wasn't gorgeous!'"
    ]
}