{
    "articleURL": "/wires/ap/article-12056359/Czech-opera-singer-Sona-Cerven-dies-age-97.html",
    "content": [
        "PRAGUE (AP) - Sona Cervená, a Czech opera singer who became known for playing Carmen and more than 110 roles in San Francisco and other opera houses behind the Iron Curtain, has died. She was 97.",
        "Cervená died Sunday at a hospital in the Czech capital where she was being treated for an unspecified illness, the National Theater in Prague said.Born Sept. 9, 1925 in Prague, Cervená was as a guest singer at the Unter den Linden opera and the Berlin State Opera in the Soviet-controlled part of Berlin when she emigrated to West Berlin in January 1962 through the last opened crossing in the newly built Berlin Wall.\"I couldn´t live and sing without freedom,\" she once told the Czech public radio.The Iron Curtain kept her outside her country for 30 years.In the West, Cervená was based at the Frankfurt Opera, but she became known for her guest performances in numerous opera house in Europe and the United States, including in Vienna, Milan, Paris, Amsterdam, Los Angeles, Chicago and festivals at Bayreuth and Glyndebourne and many others.",
        "She performed with conductors such as Rafael Kubelik, Herbert von Karajan, Pierre Boulez, Charles Mackerras and Francesco Molinari Pradelli.In 1962, Cervená started her 11-year regular cooperation with the San Francisco Opera in the title role of Georges Bizet´s Carmen, her trademark character.Others followed, including Azucena in \"Il trovatore\" and Dame Quickly in \"Falstaff\" by Giuseppe Verdi, Herodias in \"Salome\" by Richard Strauss, Mother Goose in \"The Rake´s Progress\" by Igor Stravisnky and many others. She returned again to San Francisco in 1980.",
        "After she retired from opera, she moved to the Thalia Theater in Hamburg, Germany, where she worked with U.S. director Robert Wilson as an actress.After Cervená return home following the 1989 collapse of communism, Cervena starred in Wilson's productions at the National Theater in Prague. They included Karel Capek's \"The Makropulos Case\" and a mute character of Fate in Leos Janacek's opera of the same name. Janacek was one of her favorite 20th-century composers.Cervená performed last year on Sept. 29 in Jan Zastera´s oratorio \"Saint Ludmila\" at the Lateran Basilica in Rome to mark the Czech presidency of the European Union.Among her awards, she received the Gold Medal in the Arts from the John F. Kennedy Center in Washington in 2013 and received a medal of merits, a Czech state decoration the same year."
    ]
}