{
    "articleURL": "/wires/reuters/article-12053431/Savea-ties-Super-Rugby-try-scoring-record-Drua-stun-Canes.html",
    "content": [
        "May 6 (Reuters) - Julian Savea crossed twice to equal Israel Folau's Super Rugby record of 60 tries but it was not enough to stop the Fijian Drua adding the Wellington Hurricanes to their list of victims in Suva on Saturday.",
        "A noisy crowd at HFC Bank Stadium erupted in delight as replacement back Kemu Valetini kicked two penalties in the last five minutes to give the Drua a 27-24 win, a fourth victory in their second season in Super Rugby Pacific.Three of Drua's four wins this season have come in Fiji and captain Tevita Ikanivere said they needed to make the most of their last two home games as they make a push for the playoffs.\"We're glad we're back in the winners' circle,\" he said.\"We're fighting for a spot in the quarter-finals and we need to come home in those two home games.\"The Hurricanes earned a losing bonus point to move alongside the ACT Brumbies in second place behind the Waikato Chiefs in the standings, pending the Australian team's match on Sunday.\"We always knew it was going to be tough but I think we just weren't good enough,\" said Savea's brother Ardie, the Hurricanes captain.\"The Drua came out to play and they played the whole 80 and put us under a lot of pressure ... The Drua were awesome.\"The Hurricanes, who had lock Isaia Walker-Leawere sin-binned twice, were put under immense pressure from the start and Drua winger Taniela Rakuro scored the first of his two tries by forcing his way over the line in the 18th minute.",
        "When former All Blacks winger Savea crossed in the 30th and 43rd minutes, though, it looked like the Hurricanes might survive the examination of their title credentials in the sweltering heat.Rakuro scored his second try after a brilliant offload from centre Iosefo Masi in the 46th minute but Hurricanes prop Xavier Numia kept the visitors out front when he drove over the line five minutes later.Flanker Du'Plessis Kirifi then gave the Hurricanes a 24-14 lead with a converted try under the posts but the Drua would not lie down.Club captain Meli Derenalagi, returning from injury off the bench, finished off a brilliant move from the restart to cut the deficit to five points with 20 minutes on the clock.Valetini kicked the winning points when the Drua stunned the 13-times champion Canterbury Crusaders in Lautoka in March.He coolly converted Derenalagi's try and proved just as accurate with penalties in the 75th and 77th minute to secure the victory.Savea, who was playing in his 150th Super Rugby match in his final season with the Hurricanes, was still appreciative of having matched former Wallabies fullback Folau's tally.\"Milestones like that always bring back memories of when you were a kid trying to make a dream come true,\" said the 32-year-old.",
        "\"Hopefully there's a little bit more to go.\" (Reporting by Nick Mulvenney, editing by Kim Coghill)"
    ]
}