{
    "articleURL": "/wires/aap/article-12058203/Sugar-hit-expected-Aussie-canegrowers-UK-deal.html",
    "content": [
        "The historic free trade agreement between the UK and Australia is expected to give a sweet hit to the sugar industry.",
        "British companies have already expressed interest in buying Australian sugar because of the deal, with 80,000 tonnes to be tariff free from the end of May.Tariffs on Australian sugar entering the UK market will be eliminated after eight years.\"It's the first time we've had meaningful access in the UK since the mid-seventies,\" said Canegrowers chief executive officer Dan Galligan.\"It comes at a time when the prices are at 30 or 40-year high, so it's a pretty good time for the industry.\"The last shipment of Australian sugar into Britain was in the mid-1970s, when it was Australia's number one export market.Since then Australia has shifted its focus to southeast Asia.Eighty per cent of Australian sugar is exported, with South Korea one of the most important markets.Canegrowers chairman and cane farmer Owen Menkens said the agreement was good news for producers.\"It looks like it's going to be a premium market based on sustainable sugar, so it should be good for growers,\" Mr Menkens told AAP.\"It will be good for us as growers to get more money for our crop. It's always good to have more markets available so you can get better returns.\"The UK-Australia trade agreement will strip taxes on billions of dollars worth of goods, including beef, sheep meat, dairy and sugar.",
        "Cattle Australia expects new opportunities to flow from the agreement to beef producers.A total of 35,000 tariff-free tonnes of eligible Aussie beef will be allowed into the UK market in the first year, with duties to be scrapped completely by 2038.Cattle Australia said the agreement offered access to the UK market that Australian producers hadn't seen for generations.\"This agreement will see much more Australian beef on the menu in the UK,\" said Cattle Australia's David Foote.\"The free trade agreement will also help to further diversify our export markets and a growing list of countries with which we enjoy free trade access.\"After two years, there would be no tariffs on 99 per cent of Australian exports to the UK, which are worth some $9.2 billion.The agreement will come into effect on May 31."
    ]
}