{
    "articleURL": "/wires/pa/article-12050059/Julen-Lopetegui-warns-Wolves-close-perfection-beat-Aston-Villa.html",
    "content": [
        "Julen Lopetegui has told Wolves they need to be “very close to perfection” if they are to prevent Aston Villa from plunging them back into a Premier League relegation fight.",
        "The Black Country club entertain Unai Emery’s men on Saturday still smarting from their 6-0 humiliation at Brighton last weekend and knowing they need to bounce back immediately if they are to avoid conceding ground to the chasing pack.However, that will be easier said than done, with Spaniard Emery having transformed Villa’s fortunes to the extent that they are level on 54 points with seventh-placed Tottenham with four games remaining, and just one behind Brighton in sixth.Compatriot Lopetegui told a press conference: “It’s a match against a very good team. They have improved a lot from the first half of the season until now.“They are a very good team, good players, very experienced coach. They have a very clear idea and have developed, and after they have the quality to damage you in each moment.“They have very big players so we have to have confidence in our players, our idea, to be able to beat them. We have to be very close to perfection to play against this kind of team.",
        "“Above all, we have to put the focus on our strengths, be confident with our work and we have to be ready.“I prefer to talk about us, our strengths, because we have to be confident in our energy, our strengths, and put the focus to be able to compete with them.”",
        "Lopetegui, who hopes to have defender Nelson Semedo at his disposal following his return to training after resting the knee he damaged at Brighton, has a task on his hands after witnessing an alarming capitulation at the AMEX Stadium.The Seagulls were 4-0 up by half-time and ultimately won the game at a canter to further their own European ambitions while at the same time arresting a run of three wins in four games for Wolves.However, Lopetegui remained philosophical as he sifted through the wreckage of an extremely bad day at the office.He said: “If we won or lost, the next day we know we have to improve a lot of things. We analyse the matches but this is over, the match is over and we have to put the focus on the next challenge.“It’s important for us to be able to compete because Aston Villa demand a lot of things from the opponent.”"
    ]
}