{
    "articleURL": "/wires/reuters/article-12051593/Union-Red-Bulls-trying-footing.html",
    "content": [
        "Last year, the Philadelphia Union vaulted to the top of the Eastern Conference and made a run to the MLS Cup where they fell short in a bid for a championship.",
        "A little over two months into their defense of their conference title, the Union are encountering inconsistencies but are coming off one of their better MLS showings heading into Saturday night's visit to the struggling New York Red Bulls in Harrison, N.J.Philadelphia (3-4-2, 11 points) begins this week in 10th place, one point behind Toronto FC. Last week, the Union ended a five-game winless streak with a 4-2 home victory over Toronto, marking the second time they scored at least four times.Mikael Uhre notched his first career hat trick by scoring twice before halftime and in the 56th minute for the ninth hat trick in team history. Philadelphia also added an own goal and Julian Carranza contributed two assists after the Union scored just five times during the winless skid.While Philadelphia could enjoy its outcome against Toronto, the Union were not enjoying things in a 3-0 loss to Los Angeles FC in the semifinal of the CONCACAF Champions League on Tuesday.\"We had a few chances, we just couldn't put the ball in the back of the net tonight,\" Philadelphia goalkeeper Andre Blake said.Blake's comments can also describe New York's first two months. The Red Bulls (1-3-6, 9 points) are last in the East and their seven goals are tied with CF Montreal for the fewest in the conference.",
        "New York has not scored more than two goals in a game this season and has found the back of the net four times in a six-game winless skid (0-2-4).New York played its fourth 1-1 draw of this skid last Saturday when Cory Burke scored on a header in the 89th minute against the Chicago Fire after a corner kick by John Tolkin.\"It's a big relief for me to get my first goal for the New York Red Bulls, but a little disappointed we didn't get the two points as well,\" Burke said. \"It's a takeaway and to stay positive and move on to the other game.\"--Field Level Media"
    ]
}