{
    "articleURL": "/wires/pa/article-12058531/On-This-Day-2006-Theo-Walcott-lands-shock-England-World-Cup-call-up.html",
    "content": [
        "Sven-Goran Eriksson named 17-year-old Theo Walcott in his provisional England World Cup squad on this day in 2006, despite the forward not having played in the Premier League for Arsenal.",
        "Walcott became England’s youngest international when he played in a pre-tournament friendly against Hungary.But he did not make an appearance at the tournament as England reached the quarter-finals but lost to Portugal after Wayne Rooney’s red card.",
        "Walcott was no stranger to making history at a tender age. He had become Southampton’s youngest ever player when he featured in a 0-0 Championship draw at home to Wolves aged 16 and 143 days, then became their youngest goalscorer with a strike in a 2-1 defeat to Leeds two months later.His early promise persuaded Arsenal to sign him for an initial £5million, potentially rising to £12m, in January 2006, but he had been kept waiting for his first-team chance before Eriksson came calling in the summer.Walcott got the news of his selection from his dad, and later said: “I thought he was having me on. I was shocked and surprised as everyone was; my eyes were just popping out of my head.”Eriksson admitted at the time the selection was “a gamble” but he felt Walcott’s pace could offer England a wild card option.",
        "But the Swede later admitted he did not help Walcott when saying the player had never quite reached the levels expected of him.“Maybe the expectations on him were too high, and maybe I didn’t help him there,” Eriksson told OLBG last year.",
        "Walcott went on to earn 47 England caps, but agreed his first call-up came too soon.“I was thrown into the limelight straight away having not even played a Premier League game,” he said.“Suddenly you are surrounded by these top-quality players and you are thinking ‘do I deserve to be here?’”"
    ]
}