{
    "articleURL": "/sport/football/article-12043769/Man-City-forced-refund-HUNDREDS-tickets-allocation-issue-Brentford-clash.html",
    "content": [
        "Manchester City travel to Brentford for their final Premier League gamePep Guardiola's side could be presented with the title after the matchCity have been forced to refund hundreds of fans after a technical error Manchester City have been forced to refund hundreds of fans who bought tickets for their final day clash at Brentford due to a technical issue.",
        "City dedicate a small percentage of their allocation for Premier League away matches to season ticket members who are aged between 18-25.But the problem meant up to 95 per cent of the 1,725 tickets the club received for the fixture on the last day of the season on Sunday, May 28 were mistakenly allocated to those members, sparking anger among other season ticket holders.Demand was high for the game at the Gtech Community Stadium as City could be presented with their third straight Premier League title after the match.Tickets for the trip to Brentford went on sale to eligible fans at 9am on Wednesday morning and sold out within minutes.",
        "Supporters, some of whom have had season tickets at City for decades, were left furious and quickly complained but it wasn't until Wednesday evening that the club apologised and confirmed all those sold to 18-25 members would be recalled.Those eligible in the category who successfully purchased tickets for the game will now have to enter a ballot to determine whether they get a seat for a potentially historic occasion for the club. The rest of the tickets will go back on sale to supporters with a certain number of loyalty points on Friday morning.The decision has been criticised as some fans who bought tickets have already booked travel and accommodation for the fixture in west London, which kicks off at 4:30pm.",
        "'As a result of a technical issue on our website earlier today, which saw more than the allocated number of 18-25 year-old away tickets for this match sold, ticket sales were paused,' City said in a statement.'We have now resolved this issue and can confirm that ticket sales will resume at 9:00am on Friday 5th May for season ticket members.'In the interest of fairness and to respect our ticket points structure, we have taken the decision to recall all 18-25 tickets for this match and will be running a ballot to distribute the correct number of tickets amongst those 18–25-year-old fans that purchased on the morning of Wednesday 3rd May,' City said in a statement.",
        "'We have subsequently made all those impacted aware of this, and fans taking part in the ballot will be issued further information on this in due course. As a result, no further 18–25 year-old tickets will be made available for this match.'Fans who purchased a ticket because they had the necessary number of ticket points will still have valid tickets, and they have all received email confirmation of this.'City are being pushed in the title race by Arsenal but leapfrogged the Gunners back into top spot with a 3-0 win over West Ham on Wednesday."
    ]
}