{
    "articleURL": "/news/article-12057587/Sydney-Airport-slammed-creepy-act-check-in.html",
    "content": [
        "Airport security demands female remove jacket Traveller was wearing a blouse with no zip or buttonsClaims Sydney Airport security staff were unrelenting A female traveller is slamming Sydney Airport after security confused her blouse with a jacket and demanded she remove it.",
        "Yumi Lee, who is from Blacktown in Sydney's west, was heading to Malaysia in January for a holiday.While passing through Sydney Airport's International Terminal, Ms Lee was stopped by a male security guard and ordered to take off her jacket.Ms Lee was wearing a collared pullover blouse that had no buttons and no zip - a design that would not be mistaken for a jacket.",
        "'I was stunned because I was wearing a blouse. I told him so, and he shouted 'take off your jacket' multiple times,' Ms Lee told The Sydney Morning Herald. 'He then shouted at me, 'I can stop you from getting to your plane'... I was shaking. To be asked to remove my blouse was completely unthinkable.'Everyone who saw the blouse said there was no way that it could be mistaken for a jacket.'Ms Lee explained it was only until she showed the security guard part of her blouse that he stopped demanding she removes it.The frustrated traveller lodged a complaint with Sydney Airport, who then passed the grievance to its security contractor - Certis Security Australia.Sydney Airport has received a number of complaints from female travellers over their treatment by male security at the domestic and international terminals in the past 12 months.",
        "A female airline executive, who spoke anonymously with the Sydney Morning Herald, said she observed Sydney Airport security staff treating women differently than their male counterparts.The airline employee explained men walk through body scanners wearing their suits, jackets and jumpers while women are ordered to remove clothing.She added if her aviation security ID card was not displayed, security staff would force her to remove her shoes, Apple Watch and strip down to a singlet or camisole.'The incidents have been slowly increasing. But mostly the issue is the way the Sydney staff behave; how they shout orders at you, don't say please, and don't give instruction, leaving passengers confused,' the airline employee said.",
        "The executive claims she attempted to lodge several complaints about her treatment, requesting to speak with the screening supervisor but was denied on the spot.The Department of Home Affairs advisers travellers who have a negative experience during their security screening process and want to lodge a complaint to request to speak to the on-duty screening supervisor.Travellers can also lodge a complaint directly with the relevant airport or screening authority - in this case, Sydney Airport.Daily Mail Australia has contacted Sydney Airport and Certis Security Australia for comment."
    ]
}