{
    "articleURL": "/wires/reuters/article-12046891/Trump-says-probably-attend-New-York-civil-rape-trial.html",
    "content": [
        "By Luc Cohen, Jack Queen and Padraic Halpin",
        "NEW YORK/DOONBEG, Ireland, May 4 (Reuters) - Jurors in Donald Trump's civil rape trial on Thursday saw a video deposition in which the former U.S. president defended private comments he made in 2005 about grabbing women sexually without asking.Trump was asked by a lawyer for his accuser, the writer E. Jean Carroll, about the 2005 \"Access Hollywood\" tape, where he said on a hot microphone that \"when you're a star, they let you do it. You can do anything... Grab 'em by the pussy.\"\"Historically, that's true, with stars... if you look over the last million years,\" Trump said in the video deposition taken last October and shown to the jury on Thursday, the seventh day of the rape trial in Manhattan federal court.The \"Access Hollywood\" tape was first made public in October 2016, a month before Trump was elected U.S. president.Carroll, 79, has testified that Trump, 76, raped her in a Bergdorf Goodman department store dressing room in Manhattan in the mid-1990s, and then tarred her reputation and career by lying about it online.A social media and marketing expert hired by Carroll told jurors on Thursday that the cost to repair the reputational damage of Trump's statements could range from $368,000 to $2.8 million. Carroll is seeking unspecified damages.",
        "Trump's lawyers rested their case on Thursday without calling any witnesses, paving the way for closing arguments on Monday after a break on Friday.U.S. District Judge Lewis Kaplan said he would give Trump until 5 p.m. ET (2100 GMT) on Sunday to ask to reopen his case for the sole purpose of personally testifying.Trump has not been in the Manhattan courtroom so far, but on Thursday he told reporters during a trip to Ireland that he would probably attend.Trump, the front-runner for the 2024 Republican presidential nomination, has said he could not have raped Carroll, because \"she's not my type\" and has called the case politically motivated.'IT'S MARLA,' TRUMP MISTAKENLY SAYS OF ACCUSER'S PHOTOIn an excerpt on Thursday from the October video deposition by Carroll's lawyer Roberta Kaplan, who is not related to Judge Kaplan, Trump also mistook Carroll for an ex-wife in a black-and-white photograph that shows him speaking to people at an event.\"It's Marla,\" he said, referring to his second wife Marla Maples.When Kaplan asked him if he was saying the picture depicted Maples, Trump's lawyer Alina Habba said, \"No, that's Carroll.\"Carroll's lawyers have argued that the episode, made public in January, undermines Trump's argument that Carroll was not his type.",
        "In the deposition, taken last October at his Mar-a-Lago estate in Palm Beach, Florida, Trump reiterated his denials of having raped Carroll, whom he called \"mentally sick.\"\"You know it's not true too,\" Trump said, addressing Kaplan. \"You're a political operative also. You're a disgrace.\"Earlier on Thursday, during a visit to a resort he owns in southwestern Ireland, Trump dismissed what he called untrue allegations \"against a rich guy.\"\"I have to go back for a woman that made a false accusation about me, and I have a judge who is extremely hostile,\" Trump told reporters while playing golf at the Doonbeg resort.Judge Kaplan warned last week that Trump could face more legal problems if he kept discussing the case. He did not address Trump's latest comments before trial resumed on Thursday.The trial is expected to extend into next week.Carroll, a former advice columnist at Elle magazine, said during three days of testimony and cross-examination that Trump slammed her against the wall in either 1995 or 1996, put his fingers into her vagina and then inserted his penis.Two of Carroll's longtime friends have testified that Carroll told them about the attack shortly after it occurred and said they believed her.Two other women have also testified in support of Carroll, saying Trump sexually assaulted them in separate alleged incidents decades ago.",
        "Trump has denied those claims as well. He has accused Carroll of making up the story to drive sales of a 2019 memoir in which she made her claims public.(Reporting by Luc Cohen and Jack Queen in New York and by Padraic Halpin in Dublin; Editing by Noeleen Walder, Jonathan Oatis, Will Dunham and Howard Goller)"
    ]
}