{
    "articleURL": "/sport/football/article-12057621/Klaxons-maniacal-mopeds-pets-wearing-face-masks-Napoli-coronation-dedicated-Maradona.html",
    "content": [
        "Napoli sealed their first Scudetto in 33 years after draw at Udinese in midweekThousands of fans have taken to the streets of the city to celebrate the big feat Diego Maradona was a big feature as fans dedicated the league title to him  Far from the madness of the Fuorigrotta district near the stadium, where the klaxons, the maniacal moped drivers and the fog of blue flare smoke took you to the epicentre of the delirium, a craftsman in the cobbled streets of the Quartieri Spagnoli told a deeper story of Napoli's coronation as champions of Italy.",
        "Genny Di Virgilio makes figurines for Christmas nativity scenes and the family business has long flourished, though they turned their minds to producing little Diego Maradona pieces as Napoli closed in on the Serie A title. The Maradonas are now outselling Jesus.The title, secured in midweek with a draw at Udinese, means the world to so many in the football-obsessed city and it is being dedicated to the man who led them to their last one, 33 years ago.Maradona adopted the city and team at a time when the rest of Italy was demeaning it, in 1984, and when he left seven years later there were attempts from some beyond Naples to demean him, with talk of drug use and links to the local Camorra mafia.'It was the bitterness of those who could not accept our poor town and humble team winning through,' says Alessia Giuliani, a supporter on her way to see the team play Fiorentina in the stadium which took his name after his death three years ago. ",
        "Reclaiming the Serie A title has become a form of remembrance for the man whose mural at the stadium was on Sunday simply adorned with the word: 'Love.''This is for him. He is an emblem of our people. Napoli was in his soul,' says Alessandro Catalano, out at Pallonetto near the seafront, where blue lights have been illuminating the citadels since Thursday's 1-1 draw at Udinese.",
        "The sense of vindication transcends Maradona, whose significance to the city and enduring impact is best captured by Paolo Sorrentino's unforgettable autobiographical film E stata la mano di Dio ('The Hand of God').Naples has never forgotten the disgusting banners and chants about the city's 1973 cholera epidemic, which greeted its team for years in Italy's wealthy northern cities. Maradona knew that Naples was marginalised. 'I felt as though I represented a part of Italy which counted for nothing,' he said years later.Given that history, vindication has been particularly sweet, these past few days. Juventus were 14 points adrift even before Napoli played Fiorentina on Sunday, having found themselves mired in a financial scandal which saw them docked 15 points — later reversed (for now). ",
        "Mock coffins bearing images of the Juventus team were being borne around Naples on Saturday. Banners sporting the message 'Juventus Merda' have been hoisted up to balconies.While the two Milanese giants are also wracked by debt, Napoli have thrived through patient and intelligent methodology, bringing in players the giants of Serie A ignored and developing them. It has been a new kind of glory. Maradona was the totemic presence in a Napoli team crowned Serie A champions in 1987 and 1990, having arrived in the Italian south after an ignominious exit from Barcelona. Luciano Spalletti's Napoli are a collective. A team of all the talents.",
        "The new heroes are Nigerian Victor Osimhen, whose distinctive face-mask explains why adults, children and even pets were sporting the accessory in the Quartieri Spagnoli. There is the Georgian Khvicha Kvaratskhelia signed for less than £15million and Stanislav Lobotka, a Slovakian from Celta Vigo. 'It is a professional and sustainable model which Juventus can do well to examine and learn from,' says Catalano.Analysts see this the same way. 'In Naples, there is an idea that all beautiful things are a miracle, ephemeral,' journalist Angelo Carotenuto told the Financial Times at the weekend. 'Here, Naples has won with a European footprint — a business plan, a project, organisation. It's not Neapolitan improvisation — just one big player and then bust.'Even amid the new order, there has been an element of mayhem. Under the cover of the wild title celebrations on Thursday night, the 26-year-old son of a Mafia boss was shot dead in the Ponticelli district, where a feud among clans is ongoing. ",
        "Gaetano Manfredi, the mayor of Naples, told a local radio station that the incident was related to 'dynamics that have nothing to do with the celebrations, it was probably a settling of scores that took advantage of the party'.But nothing can cloud this peerless moment. Every available mode of transport — even a small boat on wheels — has been requisitioned to whizz supporters around the historic city's narrow streets and those on foot yesterday were posing next to life-size cardboard models of Maradona, Spalletti and Osimhen placed casually in the cobbled streets of the old quarter. ",
        "The Fiorentina game, which Napoli won 1-0 through an Osimhen penalty, was not a classic but fireworks illuminated the sky as darkness fell. Sorrentino is making a new film of all this.The sun was still high in the sky when the city streets emptied and tens of thousands made a pilgrimage to Stadio Diego Armando Maradona for the coronation. Inside, there was a mosaic of blue and white and a multitude of Maradona banners carrying nothing more than his image. No words were needed, really, though a front page from the Tuttosport paper put it well. Hai vista, Maradona? 'Are you watching?'"
    ]
}