{
    "articleURL": "/tvshowbiz/article-12053341/Davina-Rankin-wearing-wedding-ring-split-husband.html",
    "content": [
        "Davina Rankin and her little girl Mila-Mae were a matching pair on Thursday as they stepped out for some quality mother-daughter time. ",
        "The former Married At First Sight star, 31, and her three-year-old child both donned black shirts and dark blue jeans with squeaky clean white sneakers to boot.Flashing her forearm tattoo, the brunette beauty was spotted still wearing her wedding band despite confirming her split from husband Jaxon Manuel on Tuesday.With her dark locks flying straight and free around her shoulders, Davina slipped into a black jacket to protect against the cold. Taking the hand of her daughter, whom she shares with Jaxon, the influencer folded a smaller pink jacket over her handbag. ",
        "Davina confirmed she'd split from Jaxon less than a year after tying the knot.She issued a statement on Tuesday confirming the break-up 'speculation' after fans noticed she had quietly unfollowed Jaxon on Instagram.The former couple, who are parents to three-year-old daughter Mila-Mae, had been married for less than a year.",
        "'Relationships are hard,' Davina wrote on Instagram alongside a photo of a beach at sunset.'Given the recent speculation, I feel like I need to confirm that Jax and I have separated.'I will at some point discuss this further, but my current focus is learning to navigate my new normal while providing a seamless and loving transition into co-parenting for our daughter.'",
        "Split rumours had been swirling for months with influencer Davina all but confirming the end of her marriage by unfollowing Jaxon on Instagram.",
        "A search of the wellness author's following list showed no sign of Jaxon's account, which is still active.The pair tied the knot in a glamorous wedding in April last year.But suspicions were raised when Jaxon abruptly stopped appearing on his wife's Instagram grid in August 2022."
    ]
}