{
    "articleURL": "/wires/aap/article-12049695/WA-creates-national-park-reserve-bigger-Bali.html",
    "content": [
        "A national park bigger in size than Bali and home to hundreds of native species including the critically endangered Night parrot has been created in Western Australia's remote Goldfields.",
        "The 800,000-hectare Matuwa Kurrara Kurrara National Park and the Lake Carnegie nature reserve will be jointly managed by Tarlka Matuwa Piarku Aboriginal Corporation and the Department of Biodiversity, Conservation and Attractions.Designed to protect biodiversity and cultural heritage, it will be the largest jointly managed and vested conservation estate ever reached in WA.\"We are entering a new chapter in joint management where Martu law and culture have been practised and stories told through the generations,\" Aboriginal Affairs Minister Tony Buti said.Matuwa Kurrara Kurrara National Park was purchased as two pastoral leases by the state government more than 20 years ago and features over 480 plant species.The Lake Carnegie nature reserve, listed on the Commonwealth Directory of Important Wetlands, is culturally significant to Martu Aboriginal people and believed to be home to the elusive and critically endangered Night parrot.An Indigenous Land Use Agreement was signed in October 2022 making it the largest exclusive possession native title agreement in Australia.\"Our government is committed to protecting these special areas and we look forward to working with the Tarlka Matuwa Piarku Aboriginal Corporation to safeguard cultural heritage and biodiversity,\" Environment Minister Reece Whitby said.\"These reserves contribute 16 per cent to the overall Plan for Our Parks target of five million hectares and it's great to see the positive impact the initiative is having in protecting our state's vast and unique landscapes.\"",
        "It is hoped the reserve will pave the way for greater on-country employment for traditional owners.\"Healthy partnerships will help balance Martu and Western knowledge of land management and ensure all levels of management and implementations are economically and environmentally sustainable,\" the Tarlka Matuwa Piarku Aboriginal Corporation said."
    ]
}