{
    "articleURL": "/wires/ap/article-12052985/Charges-NYC-chokehold-death-hinge-reasonableness.html",
    "content": [
        "NEW YORK (AP) - The potential criminal charges against a U.S. Marine veteran who put Jordan Neely in a fatal chokehold aboard a New York City subway train might depend on whether a \"reasonable\" New Yorker would have acted similarly.",
        "Neely, a locally-known Michael Jackson impersonator who friends say suffered from worsening mental health, died Monday when a fellow rider pulled him to the floor and pinned him with a hold taught in combat training.Neely had been screaming at other passengers but hadn't attacked anyone, according to a freelance journalist who recorded video of his final minutes.The man who administered the chokehold, Daniel Penny, said through his lawyers Friday that he was only protecting himself after Neely threatened him and other passengers.\"Daniel never intended to harm Mr. Neely and could not have foreseen his untimely death,\" said his lawyers, Thomas Kenniff and Steven Raiser.The Manhattan District Attorney´s Office is investigating the incident and no charges have been announced.",
        "If a case does go forward, an argument of self-defense would likely brush up against a \"tricky\" legal requirement, according to Mark Bederow, a former assistant district attorney in Manhattan.Under New York´s penal code, a person who uses deadly force must not only prove that they feared for their own life or someone else´s, but that any reasonable person would have felt the same way.\"Suppose the Marine says, `I honest to God thought I had no choice but to save someone,´ the question would be whether an objectively reasonable person in his circumstances would have felt the same,\" Bederow said.",
        "The interpretation of that statute was last clarified by the state's highest court in 1986, in response to Bernhard Goetz´s shooting of four teenagers aboard a subway, an infamous case that has drawn comparisons to Neely´s death.In 1984, Geotz, who was white, shot four young Black men after one of them asked him for $5. Goetz said he thought he was being robbed. A jury ultimately acquitted Goetz of attempted murder but convicted him of carrying an unlicensed handgun.Neely´s killing has set off an emotionally-charged debate in New York about compassion and mental illness.Most people who ride the subway system have had occasional uncomfortable encounters with people who shout or behave in unsettling ways, but pose no danger to anyone. The most common response is to simply ignore it or move to a different car. It is unclear why either Penny, or two other men who can be seen on the video helping to restrain Neely, decided to act.In a statement Friday, Penny's lawyers didn't offer details of what happened, other than to say that \"when Mr. Neely began aggressively threatening Daniel Penny and the other passengers, Daniel, with the help of others, acted to protect themselves, until help arrived.\"No arrests were made by police, prompting outrage from some who demanded criminal charges in the death.",
        "Others, including New York City Mayor Eric Adams, have urged caution, highlighting the rights of riders to defend themselves in certain situations as well as the perils of a transit system that often serves as a shelter for the city´s neediest residents.Bederow predicted Manhattan District Attorney Alvin Bragg may choose to bring the case before a grand jury, a process sometimes used in controversial or complex cases. A charge of second degree manslaughter or criminally negligent homicide was most likely, he said.Walter Signorelli, a former NYPD inspector and professor at John Jay College, said he was uncertain charges would be filed, given the apparent fear among riders in response to Neely´s behavior. If the case went to trial, he said a jury could empathize with the defendant.\"It´s not like he´s a villain,\" Signorelli said. \"He did what he thought was right and what seemed reasonable to him. He´s stepping up where most people turn away.\"The defense could also highlight Neely´s criminal record, which includes dozens of arrests, ranging from disorderly conduct to assault. Most recently, in 2021, he was charged with assaulting a 67-year-old woman leaving a subway station. After pleading guilty, he missed a court date, leading to a warrant for his arrest that was still active at the time of his death.",
        "At the same time, legal experts said Neely´s record would have been unknown to people inside the subway car.The fact that Penny served in the U.S. Marines could also count against him, if prosecutors argued that he had the training to know better than to use a dangerous chokehold. Military records show he served in the corps from 2017 to 2021, rising to the rank of sergeant. His lawyers said he's now a college student.Video of the incident shows Penny placing Neely in a chokehold for several minutes. He maintained the grip even after Neely stopped struggling.\"Even if you found him initially justified, the question then becomes how much is too much?\" Bederow said. \"If you look at that video, I don´t think anyone would say that guy is a threat at that point in time.\"As Neely lay face down on the subway car's floor, still wrapped in the chokehold, at least one bystander can be heard on the video urging restraint, warning that they might be killing him.\"You´ve got to let him go,\" the man says.Another witness, Johnny Grima, then tells Penny and the other riders that the unconscious Neely could choke on his spit if they aren´t careful.Grima arrived inside the subway car as the chokehold was in progress, and said he was deeply disturbed by the scene. He said the men assured him that Neely was still breathing.",
        "\"But when they let him go he just fell limp, staring off into space,\" Grima said. \"His eyes were open, but there was no light.\""
    ]
}