{
    "articleURL": "/femail/real-life/article-12040459/Wendys-famous-burger-logo-mom-mum-hidden-collar-restaurant-moving-Australia.html",
    "content": [
        "Customers ponder a hidden meaning in Wendy's burgers famous logo It's said the word 'mum' is written in the shirt collar  Fans of popular American burger chain Wendy's have noticed a potential hidden meaning in the company's logo.",
        "The design depicts a red-haired girl with her hair in two side braids wearing a white shirt with a blue trim.Some believe the girl's collar spells out the word 'mom' or 'mum', a possible hint at the brand's humble beginnings and the thought of a mother's home-cooked meals.Fast food lovers on TikTok say they now 'can't unsee' the word in the girl's collar. ",
        "However, it turns out the rumour traces back years and Wendy's has previously denied any claims of subliminal messaging in their branding. According to The Sun, a spokesperson for Wendy's previously said: 'We are aware of this and find it interesting that it appears our Wendy cameo has 'mom' on her ruffled collar. We can assure you it was unintentional.'It comes after news dropped that the fast food chain is planning to open 'hundreds' of restaurants across Australia.Despite launching into a competitive market, the company has big plans for its expansion Down Under.The chain, which has more than 7000 locations worldwide, is best known for its square hamburgers, French fries and 'Frosty' frozen dairy desserts. It's also America's third biggest burger behind McDonald's and Burger King.Eager customers have posted videos online to share their excitement, although where the first restaurant location will be is yet to be decided. ",
        "The US$4.8billion (AUD $7.26billion) company wants to raise global restaurant numbers by 1,500 over the next two years and is eyeing Australia as a prime expansion market.",
        "In March eagle-eyed travellers spotted a symbol in one of the logos of Australian budget airline Jetstar.People have noticed the negative space between the 'T' and the orange star create a perfect arrow. Jetstar have two logos; one with the full company name spelled out with an orange star at the end and a shortened version with the word 'Jet' followed by the orange star.The shortened version is usually seen on the tail of the airline's planes and hides the forward-facing arrow which has gone unnoticed by many flyers. Australians have been shocked to find the secret symbol in the familiar logo and say they will never be able to 'unsee it'. ",
        "Digital agency eDigital explained on its website the Jetstar logo was designed in 2003 and the orange star was modified between the two emblems to include the arrow. 'The logo saves you the time to spell out the word 'star' by simply incorporating an actual star. The star symbol has been slightly changed to show a forward-pointing arrow,' the site read. In a Reddit post another Aussie asked: 'Has anyone noticed the arrow in the Jetstar logo?'.",
        "'Now I can't un-see it. Thanks,' someone replied."
    ]
}