{
    "articleURL": "/wires/reuters/article-12040333/NHL-Panthers-stun-Maple-Leafs-draw-blood-playoff-series.html",
    "content": [
        "By Frank Pingue",
        "TORONTO, May 2 (Reuters) - The Florida Panthers spoiled the Toronto Maple Leafs' long-awaited return to the second round of the Stanley Cup playoffs on Tuesday with a 4-2 victory in the opener of their best-of-seven series.From the moment Toronto sealed their place in the second round there has been a palpable buzz all around the city.The Leafs' win over Tampa Bay in the first round had snapped a 19-year playoff series win drought, which was the longest active such streak in the NHL, but the Panthers brought Leafs' fans crashing down to Earth at Scotiabank Arena.\"There's some real high-end skill through their lineup that can make a lot of plays at a real high pace,\" said Toronto head coach Sheldon Keefe.\"And they attacked the net with a lot of urgency. So I think those are the kind of things that just happened a step quicker tonight than it was in the previous series. I think that caught us and I think our guys will adjust to that.\"Despite being the underdogs, the Panthers came to Toronto full of confidence after storming back from a 3-1 series deficit to defeat a top-seeded Boston team that won an NHL-record 65 games in the regular season.Florida opened the scoring midway through the first period when Nick Cousins pounced on a rebound for his first goal of the playoffs, sucking some of the energy out of the Toronto crowd.",
        "The Panthers doubled their lead eight minutes into the second period when Sam Bennett tipped in Aaron Ekblad's shot from the point.But the Maple Leafs needed only 11 seconds to respond as Matthew Knies found the net, and another goal from Michael Bunting followed seven minutes later to nearly blow the roof off the electric arena.Florida restored their lead with just over two minutes left in the second period when Carter Verhaeghe broke in alone and quickly released a shot that beat Ilya Samsanov.\"You can tell they got a lot of confidence and they are feeling real good right now and playing real well,\" said Keefe.Toronto fans, including some 6,500 clad in blue-and-white Leafs jerseys watching the game on screens set up outside the arena, did their best to will the home team back but the comeback never materialized.Panthers defenseman Brandon Montour made it 4-2 on a delayed penalty when he blasted home a shot from the point with just over seven minutes left in regulation.\"We just gave them too many clean looks at our net and they buried them,\" said Toronto forward Mitch Marner.Toronto threw everything they had at the Panthers late in the game, even pulling Samsanov in favor of an extra attacker with three minutes left, but to no avail.",
        "Toronto rang one shot off the post in the final minute and then got a late power play but Panthers goalie Sergei Bobrovsky closed the door to secure the win.\"It's a bad result but it's just the first game,\" said Samsanov.The series, which will determine which team advances to the penultimate round of the Stanley Cup playoffs, resumes on Thursday in Toronto before moving to Florida for two games. (Reporting by Frank Pingue in Toronto; Editing by Peter Rutherford )"
    ]
}