{
    "articleURL": "/wires/ap/article-12043905/Soldier-Texas-governor-wants-pardon-denied-retrial.html",
    "content": [
        "AUSTIN, Texas (AP) - A Texas judge on Wednesday denied a request for a new trial for an Army sergeant convicted of killing an armed protester during a Black Lives Matter march and set a May 9 sentencing in a case where Republican Gov. Greg Abbot has said he will seek a pardon.",
        "Sgt. Daniel Perry faces up to life in prison for the 2020 fatal shooting of 28-year-old Garrett Foster, who was legally carrying an AK-47 rifle through downtown Austin during a summer of nationwide unrest over police killings and racial injustice.Perry sought a retrial in part over claims of improper jury behavior during trial and deliberations. State District Judge Clifford Brown, who presided over the original trial, denied the request after a brief hearing.A jury unanimously voted to convict Perry on April 7. The verdict prompted outrage from prominent conservatives including former Fox News star Tucker Carlson, who called the shooting an act of self-defense and criticized Abbott on the air after he didn´t come on his show.Abbott, a former judge who has not ruled out a 2024 presidential run, tweeted the next day that \"Texas has one of the strongest `Stand Your Ground´ laws\" and that he looked forward to signing a pardon once a recommendation hits his desk.The Texas Board of Pardons and Paroles has already begun what legal experts say is a highly unusual and immediate review of the case on the orders of Abbott, who appoints the panel.",
        "The governor has not said publicly how he came to his conclusion. It is not clear when the parole board will reach a decision on Perry´s case.",
        "Perry attorney Clinton Broden declined to comment on the judge's rejection of a retrial and the potential pardon.Perry served in the military for more than a decade and was stationed at Fort Hood, about 70 miles (110 kilometers) north of Austin. He was working as a ride-share driver the night of the shooting and had just dropped off a customer when he turned onto a street full of protesters.Perry claimed he acted in self-defense while attempting to get past the crowd blocking the street and said Foster pointed a rifle at him. Witnesses testified that they did not see Foster raise his weapon, and prosecutors argued that Perry could have driven away without shooting.After the trial, the court unsealed dozens of pages of text messages and social media posts that showed Perry having hostile views toward Black Lives Matter protests. In a comment on Facebook a month before the shooting, Perry allegedly wrote, \"It is official I am a racist because I do not agree with people acting like animals at the zoo.\""
    ]
}