{
    "articleURL": "/wires/ap/article-12041217/Thai-candidate-resumes-campaign-2-days-giving-birth.html",
    "content": [
        "BANGKOK (AP) - A popular candidate for prime minister of Thailand said Wednesday she´s eager to get back on the campaign trail, just two days after giving birth.",
        "Speaking at a news conference at the hospital in Bangkok where she gave birth, Paetongtarn Shinawatra said her new baby boy wouldn´t affect her ability to rally support for her Pheu Thai party with just under two weeks to go before the polls.\"I believe good things come along with children,\" she said, sitting beside her husband, Pidok Sooksawas. \"I believe that children are my secret power to work, and to lead everyday life.\"The newborn, Prutthasin Sooksawas, was brought into the room in a rolling incubator and displayed briefly to the media before being moved out again.Paetongtarn is the youngest daughter of Thaksin Shinawatra, the popular but divisive former prime minister who was ousted by a military coup in 2006. She´s also the niece of Yingluck Shinawatra, whose government met a similar fate eight years later.Thaksin, who has been in self-exile since the 2006 coup, tweeted Monday after the birth that he would like permission to come home to see his grandchildren, ending the tweet with \"See you soon.\" He lives abroad to escape a prison term for abuse of power, a conviction he has decried as politically motivated.",
        "Paetongtarn played down the significance of the message, saying it was just a natural expression of a grandfather who was \"very happy and excited.\"",
        "Thaksin is a popular but divisive figure of Thai politics, and there has been concern that his return could be destabilizing.\"Of course, the things he said would have a political effect,\" she said. \"However, as a family, I think there´s nothing wrong to hope for that, especially when there´s a good thing happening to the family.\"Paetongtarn campaigned throughout her pregnancy. She and the Pheu Thai Party have consistently topped the opinion polls as Thailand´s favored prime minister candidate and next government. She took the opportunity Wednesday to underline that she was 100% confident of a landslide victory.\"I´d like to ask the Thai people to remain firm, because this vote is not like any other,\" she said. \"Thailand cannot just hope for the best anymore. Thailand needs change, and only the Pheu Thai Party is the best answer for the Thai people now.\"Analysts have complimented Paetongtarn on her confident public performances, though the residual popularity of her father remains a factor behind her popularity, especially among poor and working-class Thais. Thaksin, a populist billionaire, championed poor people during his years in power and reaped the benefits at election time.Even if the Pheu Thai Party secures a big win at the May 14 general election, there is no guarantee Paetongtarn will become prime minister. The top post is selected in a vote involving both houses of Parliament. That includes the Senate, which was appointed by the junta led by current prime minister and candidate Prayuth Chan-ocha, rather than by the public. Prayuth won all the senators´ votes after the 2019 election.",
        "___Find more of AP´s Asia-Pacific coverage at https://apnews.com/hub/asia-pacific"
    ]
}