{
    "articleURL": "/news/article-12054357/Police-launch-McDonalds-murder-investigation.html",
    "content": [
        "Avon and Somerset Police have arrested three people on suspicion of murderThe investigation follows an incident on Southgate Street in Bath at 3:30am  Police have arrested three people on suspicion of murder after a man was fatally stabbed in the street outside a McDonald's restaurant in Bath city centre. ",
        "Avon and Somerset Police said a murder investigation is underway after emergency services were called to an incident on Southgate Street at 3:30am. In a statement, the police force said the trio were being held in custody on suspicion of murder.One witness told reporters he saw a male stab another young male outside the fast food chain, before security intervened. 'I was going home, and there was around 15 younger people outside McDonald's and I saw a male stab a male and he fell to the floor,' the witness said. ",
        "'Security then restrained the male to the floor. Other security gave CPR to try and save him but this wasn't successful.'People then tried to get to the lad who was being restrained. The police took a while to get there, it was chaos. Seeing the poor lad on the floor dead will live with me forever.'He only looked around 18 years old. The police then took the lad away and ambulances arrived.'Forensics officers were pictured searching a cordoned-off area outside the fast food outlet which is located on a popular high street at the heart of Bath's historic centre. A floral tribute has been left at the scene alongside a card, with the words 'God bless you darling' written on it. ",
        "Police called on witnesses to come forwards as they also asked local residents to avoid the popular high street area. Forensics officers were also spotted searching a nearby river as police said the area would be closed for two days and that bus routes would be disrupted.",
        "Avon and Somerset Police Chief Inspector Ronnie Lungu said: 'First and foremost our thoughts go out to the family of the man who has died at this difficult and incredibly upsetting time.'A murder investigation is underway and we'd please ask for the benefit of our enquiries, but more importantly the welfare of the man's family, that people avoid speculating on the possible circumstances while that is ongoing.'Three people were arrested this morning on suspicion of murder and are in custody.''While such tragic incidents are rare in Bath, people can expect to see an increased police presence in the area over the coming days while investigative enquiries are carried out and officer patrols conducted. 'We would encourage anyone who does have concerns to speak with those officers who will be happy to assist.'A scene remains in place at this time. We appreciate that will cause some disruption to the public and businesses today, but would please ask for understanding while officers carry out important work to establish what has happened.",
        "'Anyone who witnessed the incident, has footage of the surrounding area or has information that may assist our investigation is please asked to call 101 and quote reference number 5223105088.'"
    ]
}