{
    "articleURL": "/tvshowbiz/article-12039543/Jonas-Brothers-announce-massive-summer-tour-musicians-perform-five-albums.html",
    "content": [
        "The Jonas Brothers are hitting the road for a massive summer tour they are billing as 'Five Albums. One Night.'",
        "'It's official!' Nick, 30, Joe, 33, and Kevin, 35, wrote on Instagram alongside the tour announcement. 'Let's go!'The tour kicks off August 12 with two shows at Yankee Stadium in New York City, and the brothers will spend the next two months hitting up stadiums across the country including Chicago's Wrigley Field and Los Angeles' Dodgers Stadium. The tour wraps up in Miami on October 14 after 35 shows.Last month, the band said they will  'pretty much every song from all the albums' during the concert at Yankee Stadium - which was announced before the full tour - during an interview on SiriusXM's Radio Andy show.",
        "The Five Albums. One Night .tour comes after the brothers played a five night residency on Broadway.During the residency they played a full album each night starting with 2007's Jonas Brothers, 2008's A Little Bit Longer, 2009's Lines, Vines and Trying Times, 2019's Happiness Begins and 2023's The Album.The newest album drops on May 12.During the interview with Andy Cohen, Nick, 30, revealed that the Broadway residency was a test run for the upcoming tour.'For those that don't know, we basically played five nights and picked a different album that we spotlit for the first act of the show,' he said.",
        "'We played it in its entirety,' Nick continued. 'Which, for a lot of these songs, we've never even played them or we hadn't played them in 15-plus years.'A few days after their Broadway residency wrapped up, they got a call to talk about how they could adapt that format into a one night event and take it on the road.The Jonas Brothers plan to 'play the familiar songs from each album' and have a few ideas and surprises up their sleeves.",
        "The brothers also pointed out that they were teenagers when their earlier albums came out. 'We were teenagers with tons of energy,' Nick explained. 'And so the tempo of the songs are a little faster. So, it's actually not gonna be that long.' Kevin revealed the excitement he felt after the first night on Broadway. 'We got off the stage, and we were like, \"Wow, that was a very fast set.\" Everything was really quick.'Tickets will go on sale through Ticketmaster's Verified Fan Presale on May 9. Citicard and Verizon also have pre-sale periods before the general on sale date."
    ]
}