{
    "articleURL": "/tvshowbiz/article-12052467/Drew-Barrymore-spotted-ditching-MTV-Movie-Awards-support-Writers-Guild-strike.html",
    "content": [
        "Drew Barrymore was spotted out with a friend in New York City after stepping down as the host of Sunday's MTV Movie and TV Awards.",
        "The E.T. star, 48, relinquished the hosting gig as a sign of solidarity with the Writers Guild of America strike. The Drew Barrymore Show host looked very casual in a pair of grey joggers, a t-shirt with a lion on the front of it and a yellow and tan knit beanie.The Never Been Kissed actress had a blue jacket tied around her waist and brown shearling boots on her feet.'I have listened to the writers, and in order to truly respect them, I will pivot from hosting the MTV Movie &amp; TV Awards live in solidarity with the strike,' Barrymore said in a statement. ",
        "'Everything we celebrate and honor about movies and television is born out of their creation. And until a solution is reached, I am choosing to wait but I'll be watching from home and hope you will join me,' she added.'I thank MTV, who has truly been some of the best partners I have ever worked with. And I can't wait to be a part of this next year, when I can truly celebrate everything that MTV has created, which is a show that allows fans to choose who the awards go to and is truly inclusive,' her statement concluded. The Writers Guild Of America began its strike at midnight on Tuesday after its negotiations with the studios fell apart, with sticking points that included residual payments for work for streaming platforms, as well as staffing requirements and A.I.",
        "The 50 First Dates star will not be attending the live event but she has already taped some segments that will air on the broadcast.There will also be no red carpet or talent interviews as a nod of support to the striking writers. As of now, MTV isn't sure which presenters still plan to show up or how to open the show without a host.Bruce Gillmer, the producer of the event, told Variety, that he plans to explain what's happening with the strike and why the show isn't going on exactly as it was planned and rehearsed.'But we have a plan, since the award show is fan-voted, we want to honor the fans' participation and also honor the talent that earn these awards,' he said.'So we'll be giving the awards away. We're working on a plan on how to do that without the traditional presentation involved, should the talent or some of the talent not show. We've got backups to our backups,' he added.",
        "'And we're planning on keeping as many of the signature elements of the show intact. We will have a live audience and it will still be a live event. 'Different, with more pre-taped packages and so forth, which are scalable, but it'll still have that live event feel,' he explained.",
        "'We're going to be super respectful of the talents' decisions to either be involved in pre tapes, show up or not show up, whatever they decide,' he said. 'We've got backup plans and coverage just in case, so I guess the short answer is, I'm not sure yet…'"
    ]
}