{
    "articleURL": "/wires/ap/article-12055081/In-London-Brazils-Lula-calls-efforts-free-Assange.html",
    "content": [
        "RIO DE JANEIRO (AP) - After attending the coronation of King Charles III in London, Brazil´s President Luiz Inácio Lula da Silva denounced the lack of concerted efforts to free WikiLeaks founder Julian Assange, who has spent four years in Britain´s Belmarsh Prison.",
        "\"It is an embarrassment that a journalist who denounced trickery by one state against another is arrested, condemned to die in jail and we do nothing to free him. It´s a crazy thing,\" Lula told reporters. \"We talk about freedom of expression; the guy is in prison because he denounced wrongdoing. And the press doesn't do anything in defense of this journalist. I can't understand it.\"Lula offered the remarks in response to a question about Assange, who is a native Australian. He said he had forgotten to discuss the matter with U.K. Prime Minister Rishi Sunak, but that he would write to him upon returning to Brazil.Assange has been fighting extradition to the United States, and Lula's comments come at a moment that he has shown little reluctance to voice his differences of opinion with Washington regarding geopolitical matters, particularly in his opposition to providing arms to Ukraine for its war against Russia, and accusing the US and Europe of encouraging the fighting. His stance and repeated statements have drawn sharp rebukes from the White House and Europe.For its part, Australia has been stepping up diplomatic pressure on the US government to call off its prosecution of Assange.On Friday, Australia´s Prime Minister Albanese told the Australian Broadcasting Corp. in an interview that \" enough is enough. There is nothing to be served by his ongoing incarceration.\" Last November, Albanese told Parliament that his \"position is clear and has been made clear to the U.S. administration: That it is time that this matter be brought to a close.\"",
        "Assange has battled in British courts for years to avoid being sent to the U.S., where he faces 17 charges of espionage and one charge of computer misuse that stem from WikiLeaks´ publication of a huge trove of classified documents in 2010.American prosecutors allege he helped U.S. Army intelligence analyst Chelsea Manning steal classified diplomatic cables and military files that WikiLeaks later published, putting lives at risk.To his supporters, Assange is a secrecy-busting journalist who exposed U.S. military wrongdoing in Iraq and Afghanistan.\"I think there must be a movement of world press in his defense. Not in regard to his person, but to defend the right to denounce,\" Lula told reporters. \"The guy didn't denounce anything vulgar. He denounced that a state was spying on others, and that became a crime against the journalist. The press, which defends freedom of the press, does nothing to free this citizen. It's sad, but it's true.\"Last year, Assange's father John Shipton sought to convince Mexico's President Andrés Manuel López Obrador to address the issue of his son's prosecution with the US' top diplomat, and to get Australia's Albanese to raise the issue with US President Joe Biden at Queen Elizabeth II´s funeral.In his comments to reporters on Saturday, Lula also noted that Charles III asked him to take care of the Amazon rainforest, and that he responded he needs resources in order to do so. Prime Minister Sunak on Friday pledged to contribute 80 million pounds ($101 million) to Brazil's Amazon Fund that aims to stop deforestation, adding to contributions from Norway and Germany, as well as a recent promise from the Biden to seek congressional approval for $500 million.",
        "But Lula told reporters that the amount pledged by Britain \"is not sufficient\".___Pollastri reported from Sao Paulo"
    ]
}