{
    "articleURL": "/news/article-12049855/British-mother-killed-head-crash-Ibiza-left-daughter-6-seriously-injured.html",
    "content": [
        "Sommer Amari, 42, died at the crash scene and her daughter is severely injuredBetty, 6, was airlifted to hospital in Mallorca after being admitted to unit in Ibiza Tributes have been paid to a British woman who died in a crash in Ibiza which left her six-year-old daughter seriously injured.",
        "Sommer Amari, 42, died at the scene of the head-on collision and her daughter Betty was admitted to the intensive care unit of a hospital on the island before being airlifted to a hospital in Majorca because of the severity of her injuries.She was said to be serious but stable at Son Espases Hospital in Palma today with her dad at her side.Nick Purt, who owns a carpentry firm in Ibiza, had announced his engagement to Kingston University-educated Sommer on Christmas Day last year on social media, writing: 'So happy to be engaged to my love Sommer Amari. I can't believe she said yes.'A friend who organised an online fundraiser for the dead woman's daughter and partner, which had already raised more than €50,000 of its £500 goal early this morning, said: 'It's with a very heavy heart that we bring the news to you that our dear friend Sommer died in a collision on Wednesday evening on the road from Santa Gertrudis to Ibiza.",
        "'It was an accident where someone went head on into her and she died at the scene after they tried to save her.'Betty, her daughter, is in Palma in Son Espases hospital after being airlifted with her dad Nick.'Nick wasn't with them at the time. She has had an operation on her skull and is in recovery right now. She has some internal damage and a fractured leg but we are praying she will be ok.",
        "'Please keep her in your thoughts and pray for her. Send Nick loads of love and all the family and friends that are devastated by this news. We are all heartbroken.'This fundraiser is to help Nick and Betty in this incredibly tough time. The money can be used for travel too and from Palma if needed and to alleviate the stress and burden of finances over the next few months.'Any donation greatly received.'Sending all our love and strength to Nick. We want him to know the Ibiza community is behind him and are with him.'Another friend Colleen Wilson wrote in an emotional Facebook post flagging up the GoFundMe fundraising appeal: 'Our hearts will forever be broken.'Sending love and strength to Betty and Nick. Tonight a daughter goes to sleep without her mother.'",
        "Pernilla Parfit added: 'Beyond heartbreaking. I feel Sommer's loss deeply. She was such a ray of sunshine and her sunny personality and energy was infectious.'I will miss bumping into her around town.'Sending so much love to her family and friends and praying for little Betty.'Another friend, who works as a holistic health practitioner in Ibiza, said: 'Lost for words and shocked.'Can't believe you're gone Sommer Amari.'So much life in you and had so much more to offer this world with your unbeatable personality, fun, huge heart and laughter that touched everyone.'",
        "Lucie Hutton added: 'No words can describe what a shock the world had this morning when you were not in it.'Heaven has truly gained a party angel. Whenever I saw you were out I knew I would not be going home at any point.'We have some funny stories that we can all tell so your spirit will always live on. Keep on partying up there our darling Sommer.'Local reports say Sommer died after a Norwegian woman aged 40 at the wheel of a rented Toyota lost control of her vehicle and collided into a roadside crash barrier before invading the oncoming carriageway and hitting the tragic mum's Ford Focus head-on.The British expat, who describes herself as a private tutor on Linkedin and spent 10 years working as a primary school teacher at fee-paying Morna International College in Santa Gertrudis in Ibiza, was pronounced dead at the scene after firefighters cut her body out of the mangled wreckage of her car.Betty was admitted to intensive care at Can Misses Hospital in Ibiza, shortly after the horrific accident just after 6.35pm on Wednesday, by a MOT testing centre on the road between Ibiza and the town of Santa Gertrudis. She was airlifted to the hospital in Palma about four hours after her admission to the first hospital.",
        "Police investigators confirmed this morning they were awaiting the results of alcohol and drug tests on the unnamed Norwegian woman, who was also injured and is being treated at Can Misses Hospital.A Civil Guard source said: 'She wasn't breath-tested at the scene but drug and alcohol tests were done at hospital.'We are still awaiting the results. It would appear she caused the crash by losing control of her vehicle and smashing head-on into the Ford Focus coming the other way driven by the British woman.",
        "'Excess speed could be a factor but the accident is still under investigation.'A third car was involved, driven by a Spanish woman who crashed after swerving to avoid the other two cars. She was unharmed.'One British well-wisher donated a staggering €5,000 (£4,373) to the fundraising appeal.Austrian-born photographer and designer Clarisse Grumbach-Palme, another of those who was among those who donated cash, urged others: 'We need to help in this terribly sad situation. That's the least we can do and sending much love to the family.'Another wrote after donating €1,000 (£875): 'Love you Sommer. Sending all the love and strength to Betty and your family and amazing friends.'A schoolfriend who also donated money said: 'You were an awesome force of nature at school and it's clear you continued to live your life in the same way - love to all your family.'",
        "Lesley Allen wrote against her donation: 'Sommer you were one in a million. Always smiling, full of fun and an amazing person with a heart of gold.'You will be sorely missed as you touched the hearts of so many people. Sending much love to Nick, Betty and the rest of your family. Rest in peace dear Sommer, you will never be forgotten.'Police sources insisted it was too early to say whether the Norwegian woman driving the rental car that went into Sommer's Ford Focus would face criminal charges.One said it would depend on factors like the results of the drink and drug tests and confirmation of initial indicators pointing to excess speed and a distraction at the wheel being possible causes of her losing control of her vehicle.Her injuries have been described as serious and it is thought police have not yet been able to speak to her in hospital.Police investigators were not able this morning/yesterday morning (FRI) to confirm local reports Sommer Amari's injured six-year-old daughter was pulled from the Brits' wrecked Ford Focus before the first emergency responders arrived.Rola Alkurdi Hallam, founder of a humanitarian startup called CanDo, said of her friend: 'We lived together, broke bread together, cried together and had more fun together than you can shake a stick at!",
        "'And … we supported Liverpool together!'Met some of my dearest friends with you.You always supported me and my work. When you first told me you were moving to Ibiza, I thought you were crazy. Then I ended up living there with you. I don't understand why you were taken away.'You personified living life to the FULL. My heart is with your family - Laila, Adam, and of course Nick and all your loved ones. But especially Betty - your little angel.'I pray for her, for you and for all of us. May we know how precious life is, love and live it fully AND don't forget to do the work of preparing for the next life. Love you Sommer. RIP.'"
    ]
}