{
    "articleURL": "/health/article-12046767/Ozempic-Wegovy-maker-starts-RATIONING-weight-loss-drugs-cope-demand.html",
    "content": [
        "Novo Nordisk said it has to halve the supply of the drugs' starter doses in the USChief executive of the firm said it would be cut for 'some months' due to demandREAD MORE: The VERY bizarre (and scary) side effects of OzempicThe maker of Ozempic and Wegovy will ration the popular weight-loss drugs to cope with demand, it has announced.",
        "Danish drug developer Novo Nordisk said it would have to halve the supply of starter doses of its popular Wegovy weight-loss drug in the US to cope with consumer pressure after reporting forecast-beating results on Thursday.The slimming jabs have flown off shelves in recent years as many doctors see them as a magic bullet to fight America's obesity crisis.   Their popularity, combined with manufacturing issues, led to month-long shortages of both Novo's Wegovy and its sister drug Ozempic at the start of the year.",
        "Novo said in a statement: 'To safeguard continuity of care, the supply of the lower Wegovy dose strengths in the US will be reduced temporarily.'Novo has faced supply constraints for its hugely popular Wegovy drug as a result of overwhelming demand, and has invested massively in increasing supply.Sales of Novo's obesity care products, including Wegovy, rose 124 percent in the first quarter.More than five million Americans received a prescription for Ozempic in 2022, data shows, compared to 230,000 in 2019.And the number is only growing, with more than 373,000 prescriptions filed in the last week of February alone, double the number from the same time last year. Analysts said more than half of these were new.Chief executive Lars Jorgensen told journalists on Thursday: 'We cannot supply an uptake that just continues growing, so it's important for us that we secure continuity of supply for those patients who have started treatment.'",
        "Supply of starter doses in the US would be cut by around 50 percent for 'some months', Mr Jorgensen added.Credit Suisse analysts said they were not surprised by the move, given the level of demand for the drug.",
        "An American TikToker who lost 60lbs while on Ozempic claims her hairline has receded so much she now has to cover it with makeup. ",
        "Last month the company said a second contract manufacturer would commence production of Wegovy and on Thursday Jorgensen said a third manufacturer would begin production later this year.Jorgensen said he could not give a date for when Wegovy would be launched in the UK, where in March the country's cost effectiveness watchdog recommended it for use for certain obese people.'We will gradually roll out in International Operations, and UK is a part of that. We are not commenting on specific launch dates,' he said.Novo on Thursday reported earnings before interest and taxes (EBIT) of 25 billion Danish crowns ($3.72 billion), above an average analyst forecast of 22.4 billion, according to a Refinitiv poll.Earlier this month, Novo, the second-most valuable company in Europe by market capitalisation behind French luxury goods group LVMH, significantly raised its full-year operating profit and sales expectations on the back of strong demand for Wegovy.",
        "Novo on Thursday maintained full-year growth guidance in local currencies, but said due to the strength of the Danish crown sales and operating profit growth reported in Danish crowns are now expected to be six and nine percentage points lower, respectively.Shares in Novo Nordisk traded down 4.7 percent at 07:31 GMT, putting a small dent in a rise of more than 140 percent since the firm launched Wegovy in the US in June 2021. The company's stock is the best performing in Europe. Ozempic and Wegovy use the same drug, semaglutide, which suppresses appetite and triggers weight loss. The former was approved for type 2 diabetes in 2017. A reformulated version was approved under the name Wegovy in 2021. The drug is a GLP-1 receptor, which triggers hormones in the brain that keep the stomach full and tell the body to stop eating and avoid cravings.The drugs - originally targeted for people with diabetes - have exploded in popularity after several celebrities and influencers were rumored to have used them to slim down, including Kim Kardashian and Elon Musk.Wegovy became highly sought-after since it first became available in the US last year, after it showed the ability to drop a person's body weight by around 15 percent over 68 weeks in clinical trials. ",
        "Texas, Florida, California, New York and Georgia are the states where it is most common for patients to receive a new prescription for the drugs.Some patients were even making DIY weight-loss injections at home with raw chemicals bought online. "
    ]
}