{
    "articleURL": "/femail/article-12042363/Kentucky-Derby-fashion-hats-wear-NOT-wear.html",
    "content": [
        "The Kentucky Derby, 'the most exciting two minutes in sports,' is on SaturdayEtiquette expert Myka Meier has shared her dos and don'ts for derby fashion Her tips include pointers on conversation, drink of choice and dress codesStart mixing up your mint juleps and dusting off your most over-the-top hats!",
        "The Kentucky Derby is almost upon us, and if you're heading to Churchill Downs in Louisville this weekend and still struggling to find the perfect outfit, FEMAIL is here to help you make sure you don't put a foot wrong.All eyes will be on the track at 6.57pm for the $3 million horse race, that's touted as 'the most exciting two minutes in sports,' on Saturday after a day of festivities, with gates opening at 9am.From conversation and drink of choice to following dress codes and the one item you should absolutely avoid, we've asked etiquette expert Myka Meier to weigh in on how to be the perfect Kentucky Derby attendee.",
        "Myka, who founded Beaumont Etiquette, told DailyMail.com patrons should use 'Happy Derby' to greet people on the big day.The drink of choice at the derby is the mint julep - but beware you may be asked to leave if you're 'overserved,' she said.As for conversation, the derby is obviously an extremely social event, so Myka advises people to read up ahead of time about the horses and their names, the timings of the day and the basics of the race - 'such as The Kentucky Derby [is] a mile and a quarter long or 10 \"furlongs.\"''Brush up on your derby terminology! A fun fact is that each horse running is three years old,' she added.",
        "And if you're looking to place a bet, there's nothing worse than a sore loser.'No matter if you win or lose, you want to remain kind and respectful to others. Everyone for the most part comes to the derby for a good time and remains in good spirits! Poor sportsmanship is looked down upon and seen as bad etiquette,' Myka said.Now that we've got the basics out of the way, let's dive into the dos and don'ts when it comes dressing up for the Kentucky Derby.The bigger, the better in most cases  - but ALWAYS follow the dress codeThe key to a winning outfit for the Kentucky Derby is embracing color.Myka advises people against wearing dark colors and it's 'even seen as anti-social.''Instead opt for bright, fun, festive colors to show support,' she told DailyMail.com.",
        "'Lightweight materials of outfits are encouraged with warmer weather - traditional lighter fabrics for suits are commonly seen such as seersucker.'As for headwear, Myka added: 'Hats and fascinators are highly encouraged! The more festive, fanciful and over the top the hat, the better!'But this bigger is better attitude doesn't apply to one accessory.'Leave large handbags and bags at home. In fact, it's a rule at the Kentucky Derby that you can not bring in bag of any kind larger than 12 inches in any direction,' Myka said.",
        "And you should also be practical about your footwear.'Flat shoes, block or wedge heels are suggested as there are many different surface area types at Churchill Downs and you want to avoid sinking a heel in grassy or pebbled turf,' the etiquette expert warned.But there is one accessory you should leave at home: an umbrella.'Umbrellas are banned from being used at the Kentucky Derby. Instead opt for a sleek rain jacket,' Myka suggested.Along with these dos and don'ts, Myka reminded people to follow the dress code.'It's good etiquette to not only follow the dress code provided, but it is also good manners to show respect to mirror the festiveness and formality of the occasion.'",
        "What is the dress code at the Kentucky Derby? It depends on your vantage point at Churchill DownsSpeaking of dress codes, it depends on where you are watching the race at Churchill Downs.There are three dress codes at the racetrack: the informal 'track casual,' the well-known 'smart casual' and the most formal 'business casual.' On its website, Churchill Downs has listed the dress codes for each area. The racetrack has also broken down their rules, which FEMAIL has included below: ",
        "Track CasualDo: Jackets and blazers optional. Vests, shirts with collars, sweaters, dresses, pantsuits, dress jeans, dress shorts and slacks are appropriate, as are golf shorts and capris.Don't: Worn or torn garments, crop or midriff tops, athletic wear, swim wear, frayed or torn denim, and flip-flops are considered inappropriate attire.Smart CasualDo: Jackets and blazers optional. Vests, shirts with collars, sweaters, dresses, pantsuits, dress jeans, dress shorts and slacks are appropriate.Don't: Cargo shorts, T-shirts, crop or midriff tops, athletic wear, swim wear, frayed or torn denim or shorts, and tennis shoes are considered inappropriate attire.Business CasualDo: Jackets and blazers, vests, shirts with collars, sweaters, dresses, pantsuits, slacks and capri pants are appropriate.Don't: Jeans/denim, shorts, T-shirts, crop or midriff tops, athletic wear, swim wear, and flip-flops are all considered inappropriate attire and are not permitted in these areas."
    ]
}