{
    "articleURL": "/wires/reuters/article-12041371/CEE-MARKETS-Czech-crown-keeps-strength-central-bank-rate-decision.html",
    "content": [
        "By Jason Hovet PRAGUE, May 3 (Reuters) - The Czech crown inched higher on Wednesday before a central bank decision likely to lean toward maintaining stable policy while leaving the chance of another interest rate hike ahead as inflation eases slowly and price pressures simmer. The Czech central bank (CNB) has pushed back against market expectations of interest rate cuts in the coming meetings, similar to other policymakers in central Europe who are not willing to rush into policy easing with inflation still stuck at double-digit rates. Hungary took a tentative step last week to looser policy by slashing the top of its interest rate corridor, paving the way to later rate cuts to soothe slowing economies. The Czech rate meeting comes, though, after preliminary first-quarter gross domestic product data showed the economy emerging from a mild recession, improving growth prospects. With unemployment in the Czech Republic still the lowest in the European Union and wage growth showing signs of heating up, central bankers have been cautious to downshift into lower rates. Analysts in a Reuters poll forecast no change to rates on Wednesday, but some said a possible hike could not be ruled out. \"The chances of a hike itself are small but it does not have to be a complete surprise,\" J&amp;amp;T Banka analysts wrote in a note. \"Overall, we expect the CNB will keep rates flat not just this year but also at the beginning of next year due to slower deceleration of inflation and faster wage growth.\" Markets currently price in around 50 basis points in cuts in the next six months. The crown is sitting off a 15-year peak and its strength has helped the central bank cool inflation. It was a touch higher at 23.577 to the euro at 0851 GMT after easing from its high of 23.233 in mid-April. CSOB said the bank keeping the chances of a rate hike on the table has helped the crown, but it may have already been worn out. It added the crown could still find support from a \"markedly\" hawkish tone after today's policy meeting or more rate setters raising their hand for a hike. The bank board voted 6-1 for unchanged rates at its March meeting. In other trade, the Hungarian forint led gains in the region with a 0.1% rise to 374.50 per euro and the zloty steadied at 4.579 to the euro. Warsaw markets were closed for a holiday. Prague stocks eased 0.4% and Budapest climbed 1.2%. CEE SNAPSHO AT MARKETS T 1051 CET CURRENC IES Latest Previou Daily Change s bid close change in 2023 EURCZK Czech &amp;lt;EURCZK 23.5770 23.5850 +0.03% +2.46% = crown =&gt; EURHUF Hungary &amp;lt;EURHUF 374.500 374.900 +0.11% +6.66% = forint =&gt; 0 0 EURPLN Polish &amp;lt;EURPLN 4.5785 4.5800 +0.03% +2.43% = zloty =&gt; EURRON Romanian &amp;lt;EURRON 4.9300 4.9310 +0.02% +0.25% = leu =&gt; EURRSD Serbian &amp;lt;EURRSD 117.170 117.250 +0.07% +0.11% = dinar =&gt; 0 0 Note: calculated from 1800 daily CET change Latest Previou Daily Change s close change in 2023 .PX Prague 1374.58 1379.93 -0.39% +14.38 00 % .BUX Budapest 46019.4 45490.0 +1.16% +5.08% 3 1 .WIG20 Warsaw &amp;lt;.WIG20 1919.24 1919.24 +0.00% +7.10% &gt; .BETI Buchares 12278.8 12298.6 -0.16% +5.28% t 6 9 .SBITO Ljubljan &amp;lt;.SBITO 1228.00 1229.41 -0.11% +17.09 P a P&gt; % .BELEX Belgrade &amp;lt;.BELEX 904.34 904.49 -0.02% +9.67% 15 15&gt; .SOFIX Sofia &amp;lt;.SOFIX 609.43 609.55 -0.02% +1.32% &gt; Yield Yield Spread Daily (bid) change vs Bund change in Czech spread Republic CZ2YT= 2-year &amp;lt;CZ2YT= 5.6170 -0.3030 +296bp -30bps RR RR&gt; s CZ5YT= 5-year &amp;lt;CZ5YT= 4.8600 -0.0330 +263bp -2bps RR RR&gt; s CZ10YT &amp;lt;CZ10YT 4.4820 -0.0220 +225bp +0bps =RR 10-year =RR&gt; s Poland PL2YT= 2-year &amp;lt;PL2YT= 5.8920 -0.0230 +324bp -2bps RR RR&gt; s PL5YT= 5-year &amp;lt;PL5YT= 5.8800 0.0440 +365bp +6bps RR RR&gt; s PL10YT &amp;lt;PL10YT 5.8210 0.0030 +359bp +2bps =RR 10-year =RR&gt; s FORWARD 3x6 6x9 9x12 3M interba nk Czech &amp;lt;CZKFRA 7.20 6.63 6.01 7.18 Rep &gt;&amp;lt;PRIBO R=&gt; Hungary &amp;lt;HUFFRA 14.60 12.78 11.48 16.23 &gt;&amp;lt;BUBOR =&gt; Poland &amp;lt;PLNFRA 6.77 6.45 6.05 6.90 &gt;&amp;lt;WIBOR =&gt; Note: are for ask FRA prices quotes ******************************************** ****************** (Reporting by Jason Hovet in Prague and Boldizsar Gyori in Budapest; Editing by Krishna Chandra Eluri)"
    ]
}