{
    "articleURL": "/femail/article-12049945/Im-Chicago-identify-British.html",
    "content": [
        "The man who goes by the name Tlo is sent British snacks by his many followersREAD MORE: Kate and William meet TikTok royalty to connect with younger fansA man originally from Chicago loves Britain's culture and weather so much that he now 'identifies' as a British man.",
        "The social media star, who goes by the name Tlo, now lives in Florida but is obsessed with British food, TV shows and even the weather.To show his commitment, Tlo, who didn't wish to reveal his name, starts his days off with a 'perfectly brewed cuppa' and a 'homemade chip butty' while watching the British teen sitcom The Inbetweeners.And his online UK followers now even send him suggestions of British snacks to try.Tlo' s first foray into British cuisine started when he ate beans and cheese on toast several years ago.",
        "Tlo said: 'I've been doing YouTube for five years now and when I moved to Florida my subscribers started sending me the foods they like and grew up on.'In January, I started trying the items on TikTok because it just felt like the right thing to do on TikTok, and then it just snowballed from there.'99% of the items I've ever tried were sent to me straight from the UK from subscribers.'Tlo even found a British food store on the outskirts of Miami, Florida, where he now lives, to feed his obsession.A video shows him exploring the store, amazed at all the British foodstuff that are now available to him on his doorstep.",
        "He says: 'Ya'll don't even know here I'm at. I am in the UK almost. British Marketplace in Florida.''I feel like I have almost passed away and went to heaven.'Tlo has only visited the shop once, but he was able to buy enough items to keep him going for several weeks.",
        "Videos show him cooking up some Yorkshire puddings, plating up a crisp sandwich and even making his own fried Mars bar.Tlo has a few items that he loves but wants to gain a better understanding of British snacks.He said: 'I can't say this is my favourite because I believe I still have a lot left to try but the best things I've had so far are a chip butty, deep-fried Mars bar and tea cakes.'A Sunday roast is the one meal I want to try but it has to be done properly in the UK.'The worst thing I ever tried was tea biscuits and I'm terrible at making beans and toast.'Tlo's obsession doesn't only revolve around British food.He has also been researching UK-themed pubs, bars and stores in the Florida area and he is planning on visiting the UK soon.He has even started raising money for the trip with the help of his fans and has collected $50 so far.",
        "He said: 'I have a few things in mind. I want to visit subscribers at their homes and have their favourite meals.'[I want to] try a lot of authentic stuff that cant be replicated in the USA.'"
    ]
}