{
    "articleURL": "/wires/pa/article-12057531/Charlotte-George-sing-dance-Coronation-Concert.html",
    "content": [
        "Princess Charlotte and Prince George danced the night away at the Coronation Concert at Windsor Castle.",
        "The youngsters stood with the rest of the royal box, including the King and Queen, and bopped to the sound of Lionel Richie’s hit All Night Long and Take That’s anthems.In a big royal sing-a-long, Charlotte and George waved their flags enthusiastically and swayed in time to the music.",
        "The princess also sang the words to Katy Perry’s Roar and Firework, as the US singer took to the stage in a shiny gold metallic ball gown.Ahead of Take That’s finale, Kermit the Frog joined the Windsors in the royal box.The Muppet, dressed in a smart suit and tie, bounced on the spot and waved his flag in front of a delighted Duke of Edinburgh.",
        "It was a special late night out for the Prince and Princess of Wales’s two eldest children, who are just nine and eight, after a busy day on Saturday at their grandfather’s coronation.Like the rest of the 20,000-strong crowd, they wore flashing LED wristbands.George and William were seen smiling and laughing together as they enjoyed the show.",
        "Among the star royal dancers was the Duchess of Edinburgh, who beamed as she danced to Richie’s set.When William took to the stage to deliver a touching tribute to his “Pa” the King, Charlotte turned to George to get his attention, pointing at the stage with her flag.",
        "The princess was wearing a white dress with frilled Peter Pan collar and bow but later put on a white coat over the top, while George was in a suit and tie just like William.Charlotte was seen singing “bring me a higher love” to Steve Winwood’s performance of Higher Love.Five-year-old Prince Louis was not at the concert, with the late-night show starting past his bedtime.",
        "In the second row, Peter Phillips’ daughters Savannah and Isla waved union flags, while also in the front row like the Waleses were the Edinburghs’ children Lady Louise Windsor and the Earl of Wessex.Charlotte curtseyed to the King and Queen as they arrived while George gave them a bow.",
        "At one point, Charlotte bent backwards as William playfully waved a flag near her face.Kate wore a vivid red suit, while Camilla was in a royal blue Anna Valentine jumpsuit."
    ]
}