{
    "articleURL": "/femail/cleaning/article-12044735/Mama-Mila-shares-three-easy-cheap-hacks-making-home-look-expensive.html",
    "content": [
        "Chantel Mila shared her cleaning tips Revealed easy ways to make home smell great A mum-of-two has revealed the three budget-friendly ways to make your home appear more expensive. ",
        "Chantel Mila, known as Mama Mila to her 1.6million followers, revealed details matter when it comes to making your home look and feel luxurious.So her three tips focused on carpets, cords and getting your cups and plates to shine. To freshen musty carpets, Chantel advises placing essential oil on cotton balls and scattering them on your carpets before vacuuming them up.    She advises leaving the cotton ball on the sheet for 15 minutes to allow the smell to waft through the home.The process also helps to deodorise your vacuum.",
        "Next, Chantel advises hiding messy wires around your home using stick on hooks on the back of furniture or appliances. 'This one is a favourite and can be used on your bedside, living room and even your kitchen to keep wire clutter under control,' she explained in an Instagram video.Finally, Chantel shared an easy tip to clean your dishwasher filter.'Run it with a bowl of white vinegar to remove musty odours,' she said. 'This process also helps clean your machine to leave your dishes shining'.",
        "One person asked if the cotton balls would clog the vacuum, but Chantel explained she prevents this by ripping them up into smaller pieces.In a previous video, Chantel has explained how to make your bed 'cosy and fluffy'. ",
        "To make her bed cosy and fluffy the Melbourne mum-of-two start by stripping the sheets and letting the mattress air out for an hour to deodorise it. She then washes her bed linen with half a cup of baking soda to make the sheets come out softer and brighter.When the sheets are clean, dry and ready to go back on the bed, Chantel sprays a light mist of water over them as she's tucking to get rid of wrinkles without having to iron them out.",
        "Deodorise + freshen musty carpets by placing essential oil on cotton balls and scattering them on your carpets. Allow the smell to waft through your home. Leave for 15 mins + vacuum (this process also helps deodorise your vacuum - win-win!). Use discretion with essential oils if you have pets or small children Hide messy wires around your home using stick on hooks on the back of furniture or appliances. This one is a favourite and can be used on your bedside, living room and even your kitchen to keep wire clutter under control The next time you clean your dishwasher filter, also run it with a bowl of white vinegar to remove musty odours. This process also helps clean your machine to leave your dishes shining",
        "She places her pillows in the dryer with a tennis ball for five minutes to fluff them up 'instantly'.Finally, Chantel suggests adding a throw blanket under the duvet to give it extra height and make the bed look ultra fluffy.She shared the tricks in a video posted to her popular social media channels and many of Chantel's followers were wowed by the tricks while some asked for extra advice. One woman wondered if she could use dryer balls instead of tennis balls to fluff up pillows. 'Yes, you definitely can, lovely, as they're softer. Add three dryer balls in with your pillows,' Chantel replied. ",
        "Another viewer asked if baking soda would work coloured sheets as well as white ones. 'It's great for colours as well to soften the sheets and brighten them too,' Chantel said back. ",
        "A third asked what the difference between bicarb soda and baking soda was and Mama Mila confirmed they are the same thing.'I put it directly into the drum with your usual detergent in the tray,' she added. ",
        "Strip bed and air out mattress for one hour to deodorise Wash linen (add half a cup of baking soda for softer brighter sheets)Spray a light mist of water while tucking to rid wrinkles without ironing Place pillows in the dryer with a tennis ball for five minute to fluff them instantly Place a throw under your doona for added height"
    ]
}