{
    "articleURL": "/wires/pa/article-12040711/Man-saved-40-000-two-years-fulfils-childhood-promise-buys-house-mother-struggling-rent.html",
    "content": [
        "A graphic designer who saved an average of £1,600 per month over approximately two years, amounting to a total of £40,000, has fulfilled a childhood promise and bought a two-bedroom house for his single mother who had been struggling to afford her rent.",
        "Will Hemming, 32, a creative director who lives in London, told his mother Vivienne years ago: “Mum, when I grow up, I’ll buy you a house.”Vivienne, a 69-year-old banqueting manager, explained that Will was about 11 when he said this, and it was when the family-of-four was living in Alcester, Warwickshire, and had a “beautiful life”.",
        "Vivienne’s marriage subsequently “went upside down” and she was later diagnosed with breast cancer. She had to sell the family home and moved into another property in 2018.Struggling to pay her rent, especially during the Covid pandemic, Vivienne lived in three different properties over the next four years and ended up owing one of her landlords £7,000.Will said his mother is “very resilient” and would never ask for help, despite her “depleted savings” – and so in 2020, he decided to look into covering a mortgage for her in secret.",
        "Since he was not buying the property for himself, he needed a 20% deposit for the house – £40,000 – so Will, who has an annual salary of £75,000, began saving, putting an average of £1,600 monthly into Monzo Pots over about two years.On the day he revealed the secret and told Vivienne he had bought a house for her, Will said she was “in shock” and did not believe him, but she has since settled into the cottage-style, two-bedroom end-of-terrace house in Alcester and is “really thankful”.",
        "“We were talking about her wanting to move, like we always would, and I just said, ‘Would you move somewhere in Alcester?’” Will said.",
        "“She said ‘Yeah’ and then I said, ‘Oh, that’s good, because I’ve bought a house in Alcester for you to live in, if you want to live in it’.“She said, ‘Yeah, that would be nice, that would be really nice. Wait, what did you say?’“She was really confused, and I think she was in shock… but she was really happy.”",
        "Will said he and his mother used to “joke around” about him buying a house for her.At the time, it “seemed like a massive expense” – and since he was living in London, paying expensive rent, bills and council tax, he had “no intention of buying a house”.“It was always there as an idea, but never really taken seriously,” Will said.“But then I thought, I’m saving some money, what am I going to do with it?”",
        "Will wanted to invest his savings rather than leaving them in his bank account, and as his mother was struggling with renting, he started considering buying a property.He began saving money using Monzo Pots – where customers can keep money separate from the balance in their main account – their round-up tool, and the 1p Saving Challenge.",
        "The challenge involves saving small amounts of money every day, starting with 1p. The next day you save 2p, and then 3p, until you save a total of £667.95 in a year.Will then started speaking with mortgage advisers and viewing houses in Alcester, but everything was done without Vivienne’s knowledge.",
        "Vivienne said he would ask her questions about where she would like to live, and what type of property she would prefer, but she never thought anything of it.“I always wanted to keep it a surprise, but at the same time it was like a safety net as well, just in case it didn’t work out,” Will explained.He had no timeframe in mind when he started saving for the deposit in 2020, which meant the challenge was not “daunting” but “quite liberating”.While he restricted certain expenditures and made “small sacrifices”, such as reviewing the number of subscriptions he paid for and not buying as many clothes or going out as much, he said it resulted in “positive changes” in how he viewed his finances.",
        "“Getting to know who you are financially is a really positive thing, it reveals a lot about who you are,” Will said.“Being more honest with yourself and looking into how you are with money, opening your eyes to it and not being embarrassed or ashamed, is a really good way of managing your life and what you can do.”",
        "In the first year, he saved about £20,000, and he replicated this over the second year through saving and doing freelance work.He said saving enough for the deposit was an “amazing” feeling, especially as he had found the “perfect” house for Vivienne.",
        "He said speaking to professionals, not making promises, staying patient, and making financial “sacrifices that are worthy” were vital in ensuring he achieved his goal while still enjoying life – and he said “if you really put your mind to something, you can do it”.He also believes he would not have been able to save as much without Monzo due to how “transparent” everything is.“It felt really good, it felt really good knowing it was now possible,” he said.While it “felt like a never-ending process” for a while, with copious amounts of documents, emails and meetings, Will said finally holding the key to the new home was the best part.",
        "The two-bedroom cottage is “cosy”, “quirky” and traditional, with an open kitchen and garden.Vivienne moved in last year, and Will feels he does not have to “stress” about her living situation as the house will “keep her safe” and give her security when she retires.“I said to her, ‘If anything goes wrong, no one’s going to kick you out’,” he said.",
        "“That was the nicest thing for me.”",
        "Vivienne said she never thought she would be able to buy a new home, especially as a single mother, but she now has “peace of mind” and covers the mortgage with Will.She described him as “such a loving, caring person”, and even now she is “in disbelief” that she has her own home.She said: “An unbelievable weight has been lifted.“When do I retire? When do I give up? I don’t want to give up, but at least I know I can.”",
        "She added: “I wouldn’t change him for the world.“He’s a sweetheart, he’s my rock; he held me up when I was down.“He could have bought himself a house, or he could have bought a little house in Portugal with his girlfriend, but he put me first.”"
    ]
}