{
    "articleURL": "/news/article-12042535/San-Diego-YMCA-spends-70-000-rebuilding-locker-rooms-transgender-policy-controversy.html",
    "content": [
        "The Cameron Family YMCA in Santee made changes after protests erupted The month-long project involved adding privacy stalls in the locker rooms Rebecca Philips, 17, told a city council meeting in January she had been 'terrified'A California YMCA which was at the center of a locker room controversy has re-opened its doors after a $70,000 remodel. ",
        "The new facilities at Cameron Family YMCA in Santee, San Diego County, come after multiple protests erupted when a teenager claimed she ran to hide in the showers after seeing the bare backside a transgender woman in the locker room.The month-long project included adding privacy stalls in both the women's and men's locker rooms to allow members to change behind closed doors.Rows of benches surrounded by raised walls and a door to allow people to change without showering have also been installed.Under new rules, public nudity is also now banned at the facility. ",
        "In January, Rebecca Philips, 17, addressed a city council meeting in Santee about the 'trauma' she experienced at seeing a transgender woman in the locker room at the Cameron Family YMCA in December 2022.She sobbed as she spoke about encountering what she described as a 'naked male' after swimming at the facility.  'As I was showering after my workout I saw a naked male in the women's locker room,' she said.'I immediately went back into the shower, terrified, and hid behind their flimsy excuse for a curtain until he was gone.'Philips did not name the woman, who was later revealed to be 66-year-old Christynne Wood. Wood started transitioning in 2016 and as of December 2021, had not yet undergone bottom surgery.",
        "In 2021, she issued a lawsuit against a branch of Crunch Gym, where she'd been told she couldn't use the women's locker rooms unless she had gender reassignment surgery.   Philips later clarified that she had not seen a penis, but had only seen Wood's 'backside'. ",
        "Speaking at the city council meeting, Philips said: 'This is the YMCA, where hundreds of children spend their summer afternoons in child care camps.'This is the YMCA where my little sister took gymnastics lessons.'The locker room was supposed to be her safe haven to gossip with her friends, and shower and change.'Philips says staff told her the trans woman was perfectly entitled to be in the changing rooms, and that only those on the sex offender's registry were banned from entering. In California, transgender people can use the locker room or restroom of the gender they identify with, regardless of how far along their transition process is.After being accused of 'terrifying' Philips, Wood hit back at the claims, insisting she did not parade around naked as was suggested.She claims she showered - as she always does - in one of the private stalls with the curtain closed. She also spoke at a protest at the YMCA, where she said: 'I’m Christynne Lili Wrene Wood. I’m the scary transgender woman who that child misidentified as a man,' she said.",
        "She praised children who had come to support her, saying: 'You’re the people we truly love. And you’re the next generation to make those Neanderthals irrelevant.' After Philips spoke at the council meeting, Wood said she went to her water aerobics class at the center, insisting 'I do not run from bullies and I sure don't run from lies.' 'The staff of the Y came out and they all hugged me and said Christynne we all support you 100 percent,' she said. Member Reanna Cook told NBC San Diego that she was happy with the changes that had been made to the center. ",
        "'I feel like the Y really focuses on inclusivity for everyone and I feel like they also want to respect everyone as well, so I feel like they've made changes that allow everyone to come to the Y no matter why you're coming or what your beliefs are.'They allow you to come and feel comfortable,' she said.A Cameron Family representative told the outlet that only 18 people canceled their membership due to the controversy, while 400 locals joined the YMCA between January and May. "
    ]
}