{
    "articleURL": "/wires/pa/article-12043321/Michael-Beale-changes-limited-needs-win--Kenny-Miller.html",
    "content": [
        "Former Rangers striker Kenny Miller believes Michael Beale will be limited in the experimentation he can do in their final five games – because he needs to get back to winning ways.",
        "Beale promised the “biggest rebuild in years” this summer after Rangers were consigned to a barren season by Sunday’s Scottish Cup semi-final defeat by Celtic.The Rangers manager gave a strong hint that Alfredo Morelos and Ryan Kent would depart and admitted some players would be playing for their futures in the remaining cinch Premiership games.The Light Blues go into the closing stages of the season 13 points adrift and on the back of defeats by Aberdeen and Celtic, who they play in their next two games.“Michael has got to weigh it up because they need to win the games,” said Miller after taking part in a McDonald’s Fun Football with children in Glasgow.“That’s two losses in a row. You need to finish the season strong, you don’t want that gap to get any bigger.",
        "“You need to pick the right team that’s going to win the game. There will be an element of guys that are moving on, you might not see that much of them, but there needs to be guys to come in and take their place.“It’s really important they keep winning because he’s had a good start to his managerial career, he wants to maintain that and finish the season strongly, and then he can really focus on the recruitment which by all accounts he is already doing.",
        "“It’s going to be interesting because there are a lot of guys out of contract. I can’t see none of them playing between now and the end of the season because you still need to win the games and these guys are big players.”Rangers have now gone six games without beating Celtic but Miller feels the gap between the teams has been overstated in some quarters.“It was a very close game, a game I felt Rangers just edged in terms of how the game went,” he said of Sunday’s 1-0 win for Celtic. “But, similar to the game at Celtic Park, they were undone by a really poor goal to lose, and Fashion Sakala’s chance was absolutely massive.“These games are won and lost on the big moments and it’s whether you take those moments or not. From a Rangers perspective, unfortunately in the last couple of games they have not taken those moments and Celtic have.“I don’t think the gap between the two teams is as big as everyone makes out.“I do believe Michael has made big progress. He is four Old Firm games without a win but they were within three minutes of winning the first one and the other games have been really, really close.",
        "“The edge is with Celtic in terms of the mentality but Rangers have put in some pretty good performances, just never really taken the big moments.”Miller feels signing a goalscorer is the priority.“A striker is really, really important,” the former Scotland international said. “I think Morelos this season has not really performed to the levels we have seen over the past five years. That might just be down to the fact he probably knew he was going to move on.“You see the impact Kyogo (Furuhashi) has made across the city. Rangers probably need a player to come in and make a similar impact, in a similar time scale as well, because Kyogo hit the ground running.“And at the other end of the pitch, if Allan McGregor does decide to hang the gloves up, you are going to need someone to follow him because that guy puts points on the board, he has done his whole career as a Rangers goalkeeper. It’s big gloves to fill.”Miller said of his coaching session: “It was great to get involved, I really enjoyed the session, I counted maybe seven nutmegs on the kids! I am still young enough that a few of them remembered me.“It would have been great to have these kind of things when I was a kid, to go with your friends or meet new friends and be coached by a good level of coach. You are having a lot of fun and it’s not costing any money.”",
        ":: Kenny Miller joined children for a McDonald’s Fun Football session at The Riverside Museum, Glasgow. McDonald’s provides free fun football coaching for 5–11-year-olds across the UK. Find a Fun Football session near you at: www.mcdonalds.co.uk/football"
    ]
}