{
    "articleURL": "/news/article-12042269/First-Amendment-America-falls-three-places-rank-Tonga-press-freedom-index.html",
    "content": [
        "The US now ranks 45th in global press freedoms, between Tonga and GambiaSix-in-ten US journalists are extremely or very concerned about the industry Follows high-profile sackings of hosts and Fox News suit over voting machines  The US has dropped three places on an index of global press freedom and now ranks alongside Tonga and Gambia, as local news outlets shutter and major networks turn increasingly partisan.",
        "Reporters Without Borders (RSF), a global media watchdog, ranked the US 45th out of 180 countries, trailing far behind many of its European allies and barely keeping its 'satisfactory' rating.Meanwhile, a Pew Research Center survey of US-based journalists found that six-in-ten were extremely or very concerned about declining press freedoms, regardless of whether they worked for left or right-wing outlets.These startling indictments of US journalism follow the sackings of hosts Tucker Carlson and Don Lemon, and Fox News settling a defamation suit over its presenters misleading viewers about the 2020 election results. 'Freedom of the press violations have fallen significantly in the US,' RSF said in its online report, which was released on World Press Freedom on Wednesday.",
        "'Major structural barriers to press freedom persist in this country once considered a model for freedom of expression.'RSF said US media outlets operated free from government interference, but were increasingly owned by a handful of billionaires as ever-more local newspapers shuttered as the switch to online news hit advertising revenues.More than 360 newspapers have closed since 2019, major national newspapers continue to lose subscriptions, and such outlets as CNN, NBC, Buzzfeed, Vox and The Washington Post have carried out waves of layoffs this past year, the study said.At the same time, US consumers have increasingly turned to partisan media, deepening the country's political divides, as the public trust in new outlets and journalists has 'fallen dangerously,' researchers said.",
        "Journalists faced ever more harassment and difficulty doing their job, including reporters covering the massacre in Uvalde, Texas, last May, who said they were threatened with arrest by police and hassled by vigilante bikers.RSF researchers highlighted the Las Vegas Review-Journal investigative reporter Jeff German, who was stabbed to death in September. Robert Telles — a local elected official who German had reported on — was arrested and charged with his murder.Meanwhile, Pew's survey of 12,000 working US journalists found alarming levels of concern about the country's declining media freedoms, with 57 percent of respondents saying they were extremely or very concerned about press restrictions.Older journalists and those who have worked in the industry longer were especially vexed. The concern stretches across political divides to those working at both liberal and conservative outlets.",
        "The situation is bleak beyond America's borders, RSF said.Journalism is being battered by propaganda and increasingly sophisticated fakes, aided by AI software and a failure of oversight from tech companies.Overall, the environment for journalists was rated as 'bad' in 70 percent of the 180 countries in the group's annual scoreboard, and 'good' in just eight nations.Norway and North Korea remain best and worst, respectively, for press freedom.RSF warned of myriad forms of misinformation were 'drowning out' trustworthy news — a problem compounded by the rapid evolution of artificial intelligence.",
        "'It is the tech industry that allows disinformation to be produced, distributed and amplified,' RSF secretary-general Christophe Deloire told AFP.'Reliable information is drowned in a deluge of disinformation,' Deloire added.'We are less and less able to perceive the differences between the real and the artificial, the true and the false.'He said a prime example was Elon Musk, who took over Twitter in late 2022. The report criticizes his new paid-for verification system, saying Musk was pushing 'an arbitrary, payment-based approach to information to the extreme'.The report used the example of Midjourney, an AI program that generates high-quality images that are 'feeding social media with increasingly plausible and undetectable fake 'photos''Among the software's best-known images were those of Donald Trump being manhandled by police and a comatose Julian Assange in a straitjacket, which recently went viral.Traditional forms of political interference are also gaining ground in many countries, RSF said.",
        "Some two-thirds of countries have political actors who are 'often or systematically involved in massive disinformation or propaganda campaigns', it said, highlighting the cases of Russia, India, and China.They are assisted by a vast disinformation industry.RSF recently supported a consortium of investigative journalists working on 'Forbidden Stories', a project which uncovered the activities of Israeli firm 'Team Jorge' which specializes in producing disinformation.",
        "The worst countries in the new ranking, apart from North Korea, were Vietnam, 'which has almost completed its hunt of independent reporters and commentators,' and China, 'the world's biggest jailer of journalists'.India fell from 'problematic' to 'very bad', thanks to 'media takeovers by oligarchs close to' Prime Minister Narendra ModiIn Turkey, the government 'has stepped up its persecution of journalists in the run-up to elections scheduled for 14 May,' the report said.The biggest falls were seen in Peru (down 33 places to 110), Senegal (down 31 to 104) and Haiti (down 29 to 99th).Major improvement was seen in Brazil, up 18 to 92 thanks to the departure of far-right president Jair Bolsonaro.The Middle East and North Africa remains the most dangerous region for journalists, RSF said, while Europe remains the safest, though attacks on journalists in Germany saw it drop five places.The ranking is compiled by combining data on abuses committed against journalists with hundreds of surveys sent to journalists, academics, and human rights activists.AFP contributed to this report."
    ]
}