{
    "articleURL": "/wires/ap/article-12043001/McDonald-s-franchises-fined-child-labor-violations.html",
    "content": [
        "LOUISVILLE, Ky. (AP) - Two 10-year-olds are among 300 children who worked at McDonald's restaurants illegally, a Labor Department investigation of franchisees in Kentucky found.",
        "Agency investigators found the 10-year-olds received little or no pay at a McDonald's in Louisville, the Labor Department said. The franchisee for the Louisville store was among three McDonald´s franchisees fined $212,000 in total by the department.Louisville's Bauer Food LLC, which operates 10 McDonald´s locations, employed 24 minors under the age of 16 to work more hours than legally permitted, the agency said. Among those were two 10-year-old children. The agency said the children sometimes worked as late as 2 a.m., but were not paid.\"Below the minimum age for employment, they prepared and distributed food orders, cleaned the store, worked at the drive-thru window and operated a register,\" the Labor Department said Tuesday, adding that one child also was allowed to operate a deep fryer, which is prohibited task for workers under 16.Franchise owner-operator Sean Bauer said the two 10-year-olds cited in the Labor Department's statement were visiting their parent, a night manager, and weren't employees.\"Any `work´ was done at the direction of - and in the presence of - the parent without authorization by franchisee organization management or leadership,\" Bauer said Wednesday in a prepared statement, adding that they've since reiterated the child visitation policy to employees.",
        "Federal child labor regulations put strict limits on the types of jobs children can perform and the hours they can work.",
        "The Kentucky investigations are part of an ongoing effort by the Labor Department's Wage and Hour Division to stop child labor abuses in the Southeast.\"Too often, employers fail to follow the child labor laws that protect young workers,\" said division Director Karen Garnett-Civils. \"Under no circumstances should there ever be a 10-year-old child working in a fast-food kitchen around hot grills, ovens and deep fryers.\"In addition, Walton-based Archways Richwood LLC and Louisville-based Bell Restaurant Group I LLC allowed minors ages 14 and 15 to work beyond allowable hours, the department said. Archway Richwood didn't immediately return a call seeking comment and Brdancat Management Inc., which Bell Restaurant Group is part of, declined comment.\"These reports are unacceptable, deeply troubling and run afoul of the high expectations we have for the entire McDonald´s brand,\" McDonald´s USA spokeswoman Tiffanie Boyd said. \"We are committed to ensuring our franchisees have the resources they need to foster safe workplaces for all employees and maintain compliance with all labor laws.\""
    ]
}