{
    "articleURL": "/wires/aap/article-12040061/Tech-breakthroughs-jobs-pledged-quantum-strategy.html",
    "content": [
        "New medicines, better batteries and tougher cyber security are some of the benefits being touted from a national quantum technology strategy.",
        "The government is slating a $1 billion investment in supercomputing technology through the national reconstruction fund, which would put the nation at the cutting edge of new technology.Industry Minister Ed Husic unveiled the new national quantum strategy on Wednesday, identifying five key areas.The areas include investing in research and development, securing the necessary infrastructure and materials and growing a skilled workforce.\"I can't emphasise this enough, quantum technologies will be truly transformative. We are already seeing how quantum sensing equipment is making a huge difference for industry,\" he said.\"In time, quantum computing will unleash incredible computing power that can phenomenally outperform traditional computing.\"It's estimated quantum industries could create 19,400 jobs and $5.9 billion in revenue by 2045.Benefits includes cutting the time and cost of developing new medicines, boosting the transition to net-zero emissions and shoring up cyber security.Opposition science spokesman Paul Fletcher said the strategy would not put Australia at the forefront of the technology.\"It is full of wishy-washy and essentially meaningless commitments to 'actively monitor supply chain challenges', to 'explore measures' to attract global talent and 'explore options to strengthen collaboration',\" he said.\"There are some serious omissions in the strategy. There is a clear need for closer alignment between industry and government, but the strategy has very little to say about this.\"",
        "Mr Fletcher said the strategy did not have any meaningful action in advancing quantum technology.\"One of the defining features of quantum computing is that a qubit can represent both a one and a zero simultaneously,\" he said.\"Minister Husic has ingeniously replicated this feature in his approach to the national quantum strategy: it represents a one for talk but a zero for tangible new action.\"The second part of the AUKUS alliance with the US and UK is underpinned by developing cutting edge quantum technology as well as artificial intelligence and hypersonics.Defence Minister Richard Marles said the aim was to use the relationship between the three countries to break down the technology-sharing barriers.\"If you are not in the technological race, you're not in the game,\" he said.Quantum science describes the behaviour of matter and light on the atomic and subatomic scale.It has the potential to be used to build advanced technologies such as sensors, simulators and communication devices, as well as highly-sophisticated computers, security systems and medical devices."
    ]
}