{
    "articleURL": "/wires/reuters/article-12043919/Qualcomm-gives-grim-outlook-smartphone-sales-stay-weak.html",
    "content": [
        "By Chavi Mehta, Jane Lanhee Lee and Stephen Nellis",
        "May 3 (Reuters) - Qualcomm Inc on Wednesday forecast third-quarter revenue and profit below Wall Street estimates, saying the smartphone industry would take longer to use up excess chips before fresh orders flow in.Shares of the chip designer fell nearly 7% in extended trading after it said its forecast also accounted for macroeconomic headwinds and weaker global sales of handsets.While Qualcomm hopes smartphone sales will recover in China in the second half of the year, CEO Cristiano Amon told investors on a conference call that \"we have not seen evidence of meaningful recovery and are not incorporating improvements into our planning assumptions.\"The company said a larger-than-normal decline in its chip revenue forecast from the prior quarter was mainly due \"to the timing of purchases by a modem-only handset customer.\"Qualcomm did not name the customer, but Kinngai Chan, analyst at Summit Insights Group, said it was Apple Inc , which makes its own application processor.Apple is the largest purchaser of Qualcomm's standalone modem chips, instead of its main flagship chip which includes a modem and an application processor.Apple reports earnings on Thursday after markets close.Qualcomm forecast chips revenue of $6.9 billion to $7.5 billion.The smartphones market was one of the first hit by declining demand after high inflation curbed consumer spending on discretionary goods like electronics, resulting in vendors slashing new chip orders.",
        "Smartphone demand has remained weak despite promotions and price cuts. Global smartphone shipments fell 13% in the first quarter, according to research firm Canalys.Easing COVID-19 curbs in China has not significantly boosted demand, with sliding first-quarter sales for Apple and its Android rivals in the world's second largest economy.Qualcomm also faces stiffer competition, especially for high end smartphone chips, from Taiwan's MediaTek.\"MediaTek is pushing hard into the high-end market,\" said Runar Bjorhovde, analyst at research firm Canalys. \"It is very open to working with anyone that can help it grow a bit more into the high-end where I guess Samsung is the big one for Qualcomm to defend.\"Amon said that when Huawei Technology Co Ltd left the smartphone market, Apple picked up some of its premium-handset market share, resulting in a net loss for Android phones powered by Qualcomm's flagship processorsUsed phones are also starting to eat into sales of premium-tier devices, Chief Financial Officer Akash Palkhiwala said, noting that this is baked into Qualcomm's forecast and the company is monitoring it closely.Qualcomm forecast total revenue of $8.1 billion to $8.9 billion in the third quarter. Analysts polled by Refinitiv expected revenue of $9.14 billion.It estimated adjusted earnings per share of $1.70 to $1.90, compared to analysts' expectations of $2.16.",
        "(Reporting by Chavi Mehta in Bengaluru and Jane Lanhee Lee in Oakland, California, and Stephen Nellis in San Francisco; Editing by Arun Koyyur and Richard Chang)"
    ]
}