{
    "articleURL": "/femail/article-12056495/Prince-Princess-Michael-Kent-spent-night-Mayfair-Private-Members-Club-Loulous.html",
    "content": [
        "The Prince and Princess of Kent had attended the Coronation earlier in the dayREAD MORE: Charles' cousins the Duke and Duchess of Gloucester, Prince Michael of Kent and Princess Alexandra make the cut Prince and Princess Michael of Kent spent the night at glitzy Private Members Club Loulou's following King Charles' Coronation at Westminster Abbey.",
        "Prince Michael of Kent, 80, who is a cousin of the late Queen, chose not to go straight home after the day's celebrations, but instead went to eat at the exclusive Mayfair club with his wife and friends.The Princess, 78, looked radiant in an aqua-blue button-down shirt with a high collar. She sported a long double-pearl necklace which had matching teal beads along with patterned drop earrings with a sky-blue stone. Princess Michael paired the stand-out garment with smart black trousers and heels - she was also carrying a matching onyx clutch purse and a lavish silk scarf.",
        "She wore her blonde tresses tied in a low ponytail with a black ribbon. Her husband looked dapper in a navy suit with a light-blue shirt, topped off with a midnight blue patterned tie and a handkerchief in his pocket. Later in the evening, when the couple came out of the club, the Princess drove as usual as they headed home.Earlier in the day, the Prince and Princess arrived dressed to impress at the Coronation ceremony. Michael wore his traditional dress - a morning coat, with a Garter Star and the Order of St Michael and St George neck decoration.He also witnessed the coronation of King Charles' mother, Queen Elizabeth II, in June 1953. Then aged 10, he attended the event with his brother Prince Edward, Duke of Kent.",
        "The Mantles worn by members of the Royal Family are made from deep blue silk velvet, with white satin ribbons and a lining of white taffeta. They were hand-embroidered with a gold badge on the left-hand side, with a crimson hood over the right shoulder.",
        "His wife donned an elegant knee-length dusty lilac dress and accessorised her ensemble with purple gloves, a nude handbag and matching heels. The former interior designer and author, who married Princess Michael in 1978, also donned a chic purple floral-patterned coat - topping off the outfit with a hat and pearl earrings.After the grandeur of the Coronation ceremony, the Coronation Big Lunches are taking place in what a palace spokesperson has described as 'a nationwide act of celebration and friendship'.King Charles and Camilla, Queen Consort have officially chosen a coronation quiche, which features spinach, broad beans and tarragon as the designated dish for the Big Lunch.The new Coronation dish was developed in close conjunction with the King and Queen Consort by the Royal Chef Mark Flanagan, at Buckingham Palace.",
        "Quiche was chosen because it is considered a good 'sharing' dish to take to a street party and can be served hot or cold.It also suits a wide variety of dietary requirements and preferences and is considered to be 'not too complicated to make or require costly or hard-to-source ingredients'.",
        "Members of the public and organisers from a number of charities have expressed their enthusiasm ahead of the event.Lucinda Spelman-Ives, from Wilstock, who raised over £1 million to fund a community hub, hopes the Big Lunch will 'unify and bring everyone together being part of history, making amazing memories, laughing and meeting lots of people who have never met before'.'Everyone is bursting with pride after yesterday's ceremony,' she said.'This will be a very special memory for us all. Long live the Big Lunches and long live the King.'"
    ]
}