{
    "articleURL": "/news/article-12038585/Democratic-Rep-Colin-Allred-plans-challenge-Ted-Cruz.html",
    "content": [
        "Democratic Rep. Colin Allred, 40, is planning to challenge Republican Sen. Ted Cruz in the 2024 Texas Senate racePolitico reported Monday that Allred - a former NFL linebacker - was planning to announce his bid as early as this weekCruz nearly got picked off in 2018 by Democratic Rep. Beto O'Rourke Democratic Rep. Colin Allred, 40, is planning to challenge Republican Sen. Ted Cruz in the 2024 Texas Senate race. ",
        "The former NFL linebacker cold announce his bid as early as this week, Politico reported Monday.Allred, now a civil rights lawyer, has already had some success ousting entrenched Republicans. In 2018, he beat Republican Rep. Pete Sessions, a former House Rules Committee chair and National Republican Congressional Committee chair, in his suburban Dallas district. Cruz - a national figure due to his previous presidential campaign - was almost picked off by former Democratic Rep. Beto O'Rourke in 2018. ",
        "O'Rourke came within 2.6 percentage points of ousting Cruz - in a midterm year Democrats won back the House due to the unpopularity of former President Donald Trump. In other races, including the Texas Senate race and gubernatorial elections in Georgia and Florida, Democrats came up short. ",
        "Democrats, however, tend to do better in presidential election years - which could give a boost to Allred, who played football for the Tennessee Titans before going to law school at UC Berkeley. That being said, Texas remains a Republican-leaning state where Democrats have struggled to be elected to statewide office.In 2020, Trump beat President Joe Biden in the Lone Star State by nearly 6 points. Allred will come into the race with good fundraising chops. He's popular in the party and worked his way into leadership in just four years, to a position on House Minority Whip Katherine Clark's team. ",
        "Redistricting after 2020 put Allred in a safe Democratic seat - so his vacancy shouldn't impact Democrats' numbers in the House. Cruz's latest approval ratings, which come from February, show that 40 percent of Texans approve of the job that he's doing and another 46 percent do not. Party affiliation plays a big role in Texans' views of the senator - with 78 percent of Republicans saying they approve of him and just 10 percent of Democrats sharing the same opinion. A month before he was narrowly reelected in 2018, Cruz had a 47 percent approval rating and a 42 percent disapproval rating, according to University of Texas-affiliated polling. At the time, 87 percent of Republicans approved of him, as well as 6 percent of Democrats. "
    ]
}