{
    "articleURL": "/tvshowbiz/dani-dyer/article-12056629/Pregnant-Dani-Dyer-shows-bare-baby-bump-shares-slew-sweet-family-snaps.html",
    "content": [
        "She is expecting twin girls this summer with her footballer boyfriend Jarrod Bowen.",
        "And Dani Dyer showed off her bare baby bump in a brown sports bra on Sunday as she shared her weekend photo dump on Instagram.The former Love Island winner, 26,  posed for a mirror selfie as she cradled her baby bump.Dani - who is already mum to two-year-old son Santiago - cut a casual figure in a cosy ensemble with black joggers and wore her eyeglasses.The reality star also shared a stunning selfie in her car as she wore a one shoulder pink dress with a long sleeve.",
        "'Weekend photo dump,' she penned the post.She also shared a slew of heart-melting snaps of her son Santi as he cradled a turtle and another one where he played with a toy car as he displayed a cheeky smile.Another snap captured little Santi in a blue and white bomber jacket.The reality favourite shared two more snaps beaming with some of her girl pals as she attended a close friend's bachelorette party.Dani appeared in great spirits as she celebrated her friend and reposted a few snaps on her stories.The Love Island star showed off her baby bump in a pink midi dress and kept it cosy with a pair of silver slippers.The stunner carried a white shoulder bag and her phone in one hand as her girl pals posed with big smiles while cradling her baby bump.",
        "Earlier this week, Dani unveiled her unborn twins' nursery ahead of their arrival.Layered against JJ Heller's This Little Light of Mine, she gave fans a glimpse of the 'perfect princess haven', which comprises of lilac and pink tones.",
        "With soft balloon cushions and white baby grows hanging from the wall, the area features a large cream sofa and a coordinating foot stool.Two matching cribs and a canopy crib drape could also be seen in the footage, and so could a changing table, a cot mobile, soft toys and blankets.It comes as the TV personality took to her Instagram Story to answer a Q&amp;A last month and revealed she has been 'crying all the time' as she nears the end of her pregnancy.Dani admitted her symptoms have been extremely different to when she was expecting her son Santi.She said: 'I have been soooo emotional I cry all the time! The tiredness has been hard but I think that's from the low iron levels.. and just want spicy food all day long!'The reality star also said her mum will 'definitely be round all the time' to help her out after she gives birth to her twins.",
        "Dani is planning to dress her identical girls the same to start with and has already thought of a special way of identifying them.",
        "She wrote: 'I'm going to paint one of there toenails and then write in my notes whose toenail is painted. But they might have small differences that we notice? Not too sure but the painted toenail is the answer for me x [sic].'She continued: 'I definitely will dress them the same at the beginning because it excites me all the pink frilly dresses.'However as they start to get a bit older I'll dress them differently just so they have there own identities x [sic]'."
    ]
}