{
    "articleURL": "/sciencetech/article-12038399/These-10-demand-jobs-worldwide-suggests-new-study.html",
    "content": [
        "A new report compiled internet data and Google job searches to create the list The number one in the report is software quality assurance analystREAD MORE:  Up to 80% of US jobs could be impacted by ChatGPT-like AIKnowing the state of the job market is critical to finding your next position - a new report aims to take out the guesswork by revealing the most in-demand worldwide.",
        "Experts compiled internet data and Google job searches to create a list of the top 10 most sought-after positions, ranking software quality assurance analyst at the top.A software quality assurance analyst, someone that tests software to ensure it is free of bugs, saw a 155 percent increase in searchers from 2021 to 2022.The second most searched was solar consultant, who provided customers with information about solar-powered equipment, and customer service associate.However, the report was conducted before AI's success, which is set to take over many positions, and the recent tech layoffs that saw thousands of people lose their jobs.",
        "The report comes from Lensa, a job search engine, which delved into their internal data.Knowing the in-demand jobs typically helps people find better salaries, benefits and more stability at their next position. They have then calculated the percentage increase in job searches, comparing 2021 and 2022 data and ranking the top 10.A software quality assurance (QA) analyst oversees computer software development, ensuring that no product errors go to market. And it may not be a surprise that it has increased in popularity as companies turn to software to run their operations. The base salary for Software Quality Assurance Analyst I ranges from $58,757 to $71,824, with an average base of $64,892, according to Salary.com.",
        "'With more and more people concerned about the impact of their everyday lives on the environment, the job market in the renewable energy sector has expanded rapidly over recent years,' Lensa shared in a statement.'So it’s no surprise solar consultants, who provide sales and support for solar energy systems, take second place with a 106 percent increase in job searches between 2021 and 2022.'Solar consultants are primarily paid through sales commissions but have an average salary of $49,390.Positions for a vocational nurse was found to be the fourth most searched, seeing a 60 percent increase, followed by business operations specialist - this saw a 49 percent uptick in searches. The average salary for a vocational nurse is $46,050, and for a business operations specialist, positions typically start at $67,782.The sixth and seventh worldwide were digital marketing professional and data analyst.The eighth most in-demand job on the list is site reliability engineer, which uses automation tools to monitor and observe software reliability in the production environment.And this occupation starts at around $146,783 for the salary.Information security analyst, a salary of $106,064 a year, and cloud architect that manages cloud computing ranked ninth and tenth on the list.",
        "The report also focuses on the most in-demand jobs in the US, with the position of a teacher taking the top spot. ",
        "'The country is currently facing high demand for teachers as many are leaving the profession thanks to low pay and stressful working conditions,' Lensa shared.",
        "‘I believe that ChatGPT could replace 20 percent of the workforce as is,’ AI expert Richard DeVere, Head of Social Engineering for Ultima, told DailyMail.com. ‘ChatGPT is no fad – it’s a new technological revolution.",
        "The job for a flood risk engineer saw a 167 percent increase, which the company attributes to increased infrastructure spending from the government boosting job openings.Both the global and US report had customer service associate rank as third amid a time when AI is poised to take over this occupation. 'Demand for customer-facing roles is growing, as many companies are shifting away from product innovation and focusing on customer satisfaction to grow their businesses in the face of a volatile global economy,' shared Lensa.OpenAI's ChatGPT launched after the report's data was compiled, suggesting people might not search for customer service associates as a job position in 2023.The company and researchers at the University of Pennsylvania released a study in March that warns AI systems will impact 80 percent of US jobs, with personal financial advisors and brokers, insurers and data processors at the top of the list.The team found that about 15 percent of all worker tasks could be completed significantly faster by AI and with the same level of quality. ",
        "The most 'exposure' falls on white color jobs, such as mathematicians, accountants and writers, and occupations making at least $80,000 a year. The study analyzed 1,016 occupations and their 19,265 tasks and obtained employment and wage data from the 2020 and 2021 Occupational Employment series provided by the Bureau of Labor Statistics.The team then cross-analyzed the data with AI capabilities to see which positions could run smoother when done by the technology.The overall findings show 'at least 10 percent of their work tasks affected by the introduction of LLMs, while approximately 19 percent of workers may see at least 50 percent of their tasks impacted,' reads the study published in arXiv.The team looked at exposure when formulating the list of jobs at risk, which included basic skills of occupations like active listening, speaking and critical thinking that Ai is designed to perform.The study determined 86 occupations as 'fully exposed' to AI, with several receiving 100 percent scores.These include legal secretaries, clinical data managers, web designers and journalists."
    ]
}