{
    "articleURL": "/wires/reuters/article-12059339/FOREX-Pound-hits-one-year-high-against-struggling-dollar.html",
    "content": [
        "By Tom Westbrook and Alun John SINGAPORE/LONDON, May 8 (Reuters) - Sterling hit an over-one-year high against the dollar on Monday as the greenback began the week under pressure, with traders betting it might have peaked along with U.S. interest rates while keeping a wary eye on looming inflation and loans data. The pound poked its head as high as $1.2668, its highest since April 2022, and was last trading a touch below that, up 0.26% on the day. The pound is in focus this week ahead of an expected Bank of England rate increase on Thursday, and has also been firming versus the euro. The European common currency was last at 87.23 pence , having dipped to 87.11 pence on Friday, its softest against the British currency this year. Goldman Sachs on Friday revised their three-month forecast for the euro to 86 pence, and said: \"we think that the same factors that acted as headwinds on Sterling in 2022 - mostly natural gas prices and the relative stance of BoE policy - have turned to tailwinds.\" Against the dollar, however, the euro has rallied nearly 16% from September lows, and was up 0.29% to $1.10505, supported by expectations the European Central Bank will keep interest rates high for longer than the U.S. Federal Reserve. Last week the Fed raised rates by 25 basis points but sounded slightly more cautious than peers on the outlook, dropping guidance about the need for future hikes. U.S. interest rate futures are pricing about a one-third chance of a rate cut as soon as July, according to the CME FedWatch tool, in spite of stronger-than-forecast U.S. jobs data released on Friday. The ECB last week also slowed the pace of its interest rate increases but signalled more tightening to come. \"Interest rate differentials between the Eurozone and US continue to narrow, removing a headwind for (the euro vs the dollar),\" said Carol Kong, currency strategist at Commonwealth Bank of Australia. \"We expect EUR/USD to remain supported while financial markets continue to price interest rate cuts for the US this year and further interest rate hikes from the ECB.\" The dollar index, which tracks the unit against six major peers, was down 0.25% at 101.06. Last month's 100.78 was its lowest in a year. Later Monday, the Fed's loan officer survey might show whether and how hard banks are tightening up on credit after three U.S. lenders failed over recent weeks - which could weigh on the dollar if it puts downward pressure on interest rates. Traders will also be watching headlines from Capitol Hill as lawmakers attempt to negotiate an impasse over the looming U.S. debt ceiling, with the Treasury Secretary warning the government might be unable to pay debts by June 1. U.S. inflation data is due on Wednesday. Elsewhere, the dollar was 0.1% stronger against the yen at 135.02, though it dipped 0.24% on the Swiss franc the other traditional safe haven to 0.8885. The Australian dollar hit a three-week high of $0.680, a gain of as much as 0.74% on the day. ======================================================== Currency bid prices at 1121 GMT Description RIC Last U.S. Close Pct Change YTD Pct High Bid Low Bid Previous Change Session Euro/Dollar $1.1047 $1.1019 +0.26% +0.00% +1.1054 +1.1016 Dollar/Yen 135.0300 134.7900 +0.16% +0.00% +135.2850 +134.7100 Euro/Yen &amp;lt;EURJPY=EB S&gt; 149.17 148.57 +0.40% +0.00% +149.2700 +148.6400 Dollar/Swiss 0.8887 0.8905 -0.21% +0.00% +0.8912 +0.8869 Sterling/Dollar 1.2661 1.2631 +0.25% +0.00% +1.2668 +1.2627 Dollar/Canadian 1.3342 1.3374 -0.25% +0.00% +1.3387 +1.3332 Aussie/Dollar 0.6791 0.6750 +0.60% +0.00% +0.6796 +0.6740 NZ Dollar/Dollar 0.6344 0.6293 +0.83% +0.00% +0.6347 +0.6294 All spots Tokyo spots Europe spots Volatilities Tokyo Forex market info from BOJ (Reporting by Tom Westbrook; Editing by Alexander Smith and Chizu Nomiyama)"
    ]
}