{
    "articleURL": "/news/article-12046651/Moment-Ukrainian-teenager-refuses-sing-UNICEF-contest-Russian-boy-allowed-part.html",
    "content": [
        "Sofia Samoliuk has won a number of awards for her singing across EuropeShe chose not to perform at the event in Italy yesterday, instead giving a speech A teenager from Ukraine yesterday refused to share a stage with a Russian contestant ahead of her performance at a UNICEF singing contest in Italy.",
        "Sofia Samoliuk, 13, stood down from the Sanremo Junior festival yesterday after she learned Kirill Yezhov would participate.The organisers had announced the participation of the Russian hours before the contest - but Sofia waited and gave a speech.She said: 'I cannot sing on the same stage with a representative of the terrorist state.'I do believe that next year that the terrorist country will not be here. Please, stay with Ukraine.'",
        "In the video, a host introduces the performers to the stage to sing.Sofia takes her mark and launches into a pre-prepared speech in English.She addresses the audience: 'I decided I cannot sing today. I found out there is a participant from Russia - the state that killed already more than 500 Ukrainian children.'",
        "On April 3, charity Save the Children confirmed the number of children who had been killed in Ukraine had passed 500 since the start of the Russian invasion.They added that since February 2022, at least one child has been killed every day in Ukraine, based on their analysis of UN data.At least 991 had been injured in the violence - mainly the result of explosive weapons affecting large areas.As fighting raged in the south and east of the country, children in Ukraine last year spent on average 38.3 days in bunkers underground. ",
        "In her speech yesterday, Sofia went on to thank the audience for their understanding and says she believes that next year the 'terrorist country' will not be [appearing].Members of the audience are heard to applaud as she bows.The singing competition in Italy is organised by UNICEF, a charity which exists to protect the rights of children.It is an international competition welcoming solo singers aged six to 15 years old.Separately, also this week the Ukrainian Judo Federation said Ukrainian judokas will not take part in the World Judo Championships in Qatar between May 7 and 14 due to the International Judo Federation's decision to readmit Russians and Belarusians. The IJF said its decision to readmit Russians and Belarusians as neutrals would allow them to participate in qualifying for the 2024 Olympic Games in Paris.The body said it will perform background checks to flag any athletes who back the invasion of Ukraine or who are contracted to the military in any way.",
        "Thirteen-year-old Sofia was already known for winning in her category of vocalists aged 11-13 at the Black Sea Games in 2021.She went on to win the 'Grand Prix' at the United Kids Children's Festival in Bulgaria - the jury-chosen first prize place.MailOnline contacted Sanremo Junior for comment."
    ]
}