{
    "articleURL": "/sport/nba/article-12053375/Devin-Booker-Kevin-Durant-crazy-86-points-COMBINED-Suns-win-121-114-vs-Nuggets.html",
    "content": [
        "Game 4 is once again in Arizona, at the Footprint Center Sunday 8:00pm ET Kevin Durant and Devin Booker created history for Phoenix in the crucial winDailyMail.com provides all the latest international sports news Devin Booker was on a different level, scoring 47 points, as the Phoenix Suns halved the deficit in the Western Conference finals with a 121-114 win Friday night. ",
        "Already trailing 2-0 in the series, Booker - who dropped 35 in Game 2 - drained 5 of 8 from deep as Phoenix clawed back a game. Kevin Durant joined the Phoenix party with 39 points, nine rebounds and eight assists. Such was the dominance of the duo, the Suns did not have, or need, another player in double-digit points. T.J. Warren and Cameron Payne scored the next-highest with seven each.Nikola Jokic starred in his first game since the 76ers' Joel Embiid was announced as the Association's MVP, simultaneously bringing an end to his hopes of an historic back-to-back-to-back MVP nod.While he stood tall, The Joker's supporting cast wilted late in the game -- most notably, Jamal Murray who - despite 32 points - went 1 for 8 in the fourth quarter.",
        "Jokic equaled the iconic Wilt Chamberlain with the most playoff triple-doubles by a center in NBA history (9). The Serbian sensation continued to show why he is a two-time MVP -- with 28 points, 17 rebounds and 17 assists. Michael Porter Jr. chipped in for the Nuggets with a double-double -- 21 points and 12 rebounds.Booker dropped 35 points in Game 2 as Phoenix were overrun and took it his game to an absurd level in the Valley with the Suns staring at a potential 0-3 deficit.",
        "One would be forgiven for thinking the Lakers had a home game Friday night given the array of celebrities present courtside at the Game 3 Western Conference Semifinals matchup. Portland Trailblazers stud Damian Lillard, Ravens wideout Odell Beckham Jr., Clemson football coach Dabo Swinney and 2023 Masters champ Jon Rahm were all in attendance at Phoenix's Footprint Center.Kevin Durant and Devin Booker have already been impressive throughout the series for Phoenix but created history Friday night. It was the third time this postseason both had scored 30 points - the most in franchise history. ",
        "Without Chris Paul, Phoenix were, and are, facing an uphill battle but no one seemed to tell the dynamic duo of Durant and Booker. In truth, Phoenix deserved Game 3 and if it weren't for Denver's persistence could have had this game over much earlier. The Suns lead by 15 at half before Jokic and Co. closed the deficit to just two. Though, Phoenix showed its nerve - starting the last quarter hot and standing strong amid the fightbacks thrust upon them by the road team. Game 4 will once again be in Arizona come Sunday night, and after the Booker-Durant coming out party, the question is can they stay there? "
    ]
}