{
    "articleURL": "/wires/reuters/article-12046799/FOREX-Euro-falls-dovish-ECB.html",
    "content": [
        "By Alun John",
        "LONDON, May 4 (Reuters) - The euro dipped on Thursday, giving back some of its overnight gains against the dollar, after the European Central Bank eased the pace of its rate hikes a day after the U.S. Federal Reserve signalled it was done with its tightening programme.The euro was last down 0.35% at $1.10260, having traded broadly flat before the decision.The ECB eased the pace of its interest rate hikes on Thursday with a 25-basis-point increase to its three policy rates, the smallest since it started lifting them last summer.The central bank did not explicitly commit to further hikes and kept its options open on future moves as it continues its fight against stubbornly high inflation in the euro zone.\"The ECB was relatively dovish, the tone is a little more cautious, and there is a bit more focus on the past effects of tightening and the fact that these are being transmitted forcefully to the euro area economy,\" said Sebastian Vismara, global macro economist and strategist, BNY Mellon Investment Management.\"The ECB is clearly striking a more balanced tone and the market is pricing a bit of that, the euro is depreciating and pricing for interest rate hikes at future meetings is coming down, but just a little bit.\"",
        "The euro's moves reversed some of its 0.57% Wednesday gain after the Fed raised its benchmark overnight interest rate by a quarter of a percentage point, as expected, but dropped from its policy statement language that it \"anticipates\" further rate increases would be needed.The narrowing rate differentials between the U.S. and Europe, as markets price in more European rate increases than in the U.S., has been boosting European currencies in recent months.\"If this does prove to be the last hike of the (U.S.) cycle, the next big question for FX markets will be: how long will rates remain at these levels?\" said HSBC analysts in a note.The Fed has guided markets away from the possibility of rate cuts this year, though markets are pricing them in nonetheless.\"If the Fed is proved right over the course of 2023, then it will make it harder for the USD decline to extend later in the year.\"\"But for the time being, the market is likely to run with the theme of a peak in Fed rates justifying a clear peak in the USD and an ongoing reduction in the greenback's residual overvaluation,\" said HSBC.Money markets are now pricing in around a 15% chance the Fed will begin cutting rates in June, and expect roughly 80 basis points of rate cuts through to the end of the year.",
        "Adding to expectations the Fed will soon have to begin easing monetary conditions were lingering fears of banking sector turmoil, intensified by news that PacWest Bancorp is exploring strategic options. The Los Angeles-based lender said it has been approached by several potential partners and investors.The pound was last flat at $1.2566, but in Asia trade hit $1.2595, its highest since June 2022, and the Swiss franc reached 0.88215 per dollar, its strongest since January 2021, before softening.The cautious sentiment kept the Japanese yen - a traditional safe haven in times of market turmoil - well supported, with the currency at 134.7 against the U.S. dollarThe dollar fell 1.4% against the yen on Wednesday, with the rate sensitive Japanese currency supported by a slide in U.S. Treasury yields.The Norwegian crown took a short trip after Norway's central bank raised interest rates by 25 basis points as expected. It initially softened sharply against the euro and dollar, but recovered.The dollar was last down 0.6% at 10.69 crowns.(Editing by Robert Birsel;Editing by Elaine Hardcastle)"
    ]
}