{
    "articleURL": "/wires/afp/article-12044935/Indigenous-leaders-demand-King-Charles-apologise-colonialism.html",
    "content": [
        "Indigenous leaders from a string of former British colonies on Thursday urged King Charles to swiftly apologise for \"centuries of racism\" and the \"legacy of genocide\" perpetrated by the crown.",
        "In a staunchly worded letter that could sour the build-up to this weekend's coronation, Indigenous representatives from 12 Commonwealth nations also called for financial reparations and the return of stolen cultural treasures.The letter was signed by leaders from Australia -- where Indigenous people were massacred by British colonisers and forced off their lands -- as well as several Caribbean nations once plundered for slaves.The group said they had banded together to help their people \"recover from centuries of racism, oppression, colonialism and slavery\".Charles has in recent years stepped up efforts to engage with Indigenous leaders, as the monarchy faces a reckoning over its links to the slave trade and the British Empire's legacy of violence.Although he has conceded the crown must \"acknowledge the wrongs which have shaped our past\", the letter implores him to go further by offering a formal, royal apology.Former Olympian Nova Peris, the first Aboriginal woman elected to Australia's federal parliament, was one of the leaders to sign the letter.A staunch critic of Australia's ties to the royal family, Peris said it was time to \"acknowledge the horrific and enduring impacts\" of colonisation and the \"legacy of genocide\" felt by many Indigenous populations.\"It's vital for us to discuss and educate people on the truth behind colonisation, during the week of the coronation,\" she said.",
        "\"Conversations start with listening.\"The letter said Charles should start discussions about compensating Indigenous people, who watched as British colonisers pilfered their treasures and trashed their cultures.Human rights expert Hannah McGlade, an Aboriginal woman from Western Australia, said reparations remained a key sticking point for many.\"We are increasingly seeing Indigenous people call for reparations from the royal family,\" she told AFP.\"They really do have that history that they haven't tackled. Genocide happened on their watch.\"The letter was also signed by representatives from Canada, New Zealand and Papua New Guinea."
    ]
}