{
    "articleURL": "/tvshowbiz/article-12038169/Keanu-Reeves-mistakenly-visited-police-conducting-welfare-check-unidentified-woman.html",
    "content": [
        "Keanu Reeves was recently visited by police officers conducting a welfare check.",
        "According to TMZ, the 58-year-old performer was paid a visit by the authorities, who had responded to a call concerning the disappearance of an unidentified 27-year-old woman, at his Los Angeles-area residence.The actor, who recently shared a kiss with his longtime girlfriend Alexandra Grant at a gala, did not have any information about the individual in question and confirmed that they did not reside at his home.Reeves was reported to have been understanding about the mistake and acted graciously towards the responding officers.It was unclear if the person who made the report was mistaken about the actor's address or if they were attempting to pull a prank.",
        "The actor was recently featured in a promotional photo for his band, Dogstar, that was released on the group's Instagram account last week.In the snap, Reeves posed alongside guitarist and vocalist Bret Domrose and drummer Robert Mailhouse as they stood on the roof of a house in the Lincoln Heights neighborhood of Los Angeles. The band expressed that there was 'exciting news coming soon' in the post's caption.Dogstar was originally formed in Los Angeles in 1991 and they began touring heavily in the following years.The group's debut album, entitled Our Little Visionary, was released to the public five years later.",
        "The band went on to release a follow-up, Happy Ending, in 2000 before they largely became inactive in 2002.However, Dogstar revealed that they were planning on recording a third album in July of last year.Reeves was subsequently featured in several videos and photos that had been taken during the record's writing and recording process that were shared to the band's Instagram account over the course of 2022. ",
        "The performer spoke about his band during an interview with GQ, where he discussed how the group could have received more exposure during its heyday. The John Wick franchise star stated: 'I guess it would have helped if our band was better.'Reeves then told a humorous story about an instance where Dogstar was negatively received during a metal festival in Wisconsin.'We were like, \"They hate us. What are we doing here? What can we do? Let's do the Grateful Dead cover.\" They were just like, \"F*** you, you suck.\" I had the biggest grin on my face, man,' he said."
    ]
}