{
    "articleURL": "/news/article-12041499/EXCLUSIVE-Heartbroken-Ed-Sheeran-misses-funeral-grandmother-copyright-trial.html",
    "content": [
        "Ed Sheeran's father John said the star was 'so upset that he cannot be present'Ed Sheeran missed his beloved grandmother’s funeral in Ireland today because he had to ‘defend his integrity’ in his court case in New York, his father told a packed church today.",
        "The superstar singer is believed to have tuned in online to bid goodbye to 98-year-old Anne ‘Nancy’ Sheeran who inspired one of his most personal songs, Nancy Mulligan.Today, his voice breaking with emotion, Ed’s father John gave the eulogy for his mother, saying: ‘I am very sad that our son Edward is unable to be here today. He’s so upset that he cannot be present – he has to be thousands of miles away in a court in America defending his integrity.‘I know he is comforted by the fact that he was able to spend some precious time alone with his grandma just a month ago.’Ed, 32, is fighting a copyright infringement case before a Manhattan Federal jury, based on alleged similarities between Marvin Gaye’s ‘Get it On’ and Sheeran’s hit ‘Thinking Out Loud’.",
        "He has even vowed that if the jury does find him guilty, he will be 'done' with music.And his absence from Nancy’s funeral underlined just how much fighting the plagiarism accusation means to the singer.St Patrick’s Church, Monaseed, Nancy’s home village, set in the rolling hills of County Wexford, was full to the brim for the service and Guards of honour were provided by local boxing and golf clubs which she was involved with.",
        "John Sheeran, 65, Nancy’s youngest son, who was attending with Ed’s mother Imogen and elder brother Matthew, described his mother’s life as ‘rich and fulfilled’.‘Nancy Mulligan was a country girl with a tomboy spirit helping out on the family farm,’ he said‘Mum was a driven woman all her life, with a strong social conscience, and an innate desire to help others less fortunate than herself.She spent the first 20 years of her life in Ireland, then the next 40 in London, followed by 40 more back in Wexford.He said she was well aware of the rural poverty surrounding her with many classmates at Monaseed National School walking miles in bare feet, adding that ‘For the rest of her life, her instinct lay with the underprivileged.’He raised a wry chuckle from the congregation when he told them: ‘Mum was expelled as a teenager from Loretto Abbey School after writing a poem, inspired by the cruelty of the nuns.’He then turned to the ‘Romeo and Juliet’ love story of his parents, who met in London during WWII, referenced in Ed Sheeran’s hit song.",
        "He said: ‘After the U-boat threats had abated in the Irish Sea, Mum travelled to London in October 1944 to study nursing at Guy’s Hospital.",
        "‘She recalled the challenges of looking after badly injured and burned fighter pilots and bomber crews who were undergoing plastic surgery, and she herself narrowly avoided injury or death from a devastating V-2 rocket explosion.‘Mum said she and her fellow nurses developed a spirit of resilience and defiance and a “just get the job done” attitude, which is what she did for the rest of her life -- got the job done.‘Mum met Dad, a dental student, at a Guy’s nurses’ home party. Friendship turned into love, but the Northern Ireland Presbyterian side of dad's family did their utmost to end the relationship.‘Their wedding was attended by only one family member – mum’s twin sister Peggy. They lived above that dental surgery in South London with a growing family. Eventually five boys and three girls. Mum joked to us that she had originally wanted 11 children so she could feel the football or cricket team.’Joining the Sheerans in their grief were the Irish side of the family, who included her granddaughter Laura Sheeran, who like her cousin Ed, is also a singer – in her case for an ‘alien synth pop band’ called Nanu Nanu.Joining Matthew and Laura Sheeran as pall-bearers were other grandchildren Murray and Rory Cummings and Bridget Sheeran.",
        "After the final commendation, Nancy was borne from the church to the strains of the ‘Hawk of Ballyshannon’, as a single bell pealed above.As Father Byrne sprinkled holy water over the coffin, the family followed behind for the interment a few miles down the hillside.Earlier, the priest who conducted the service said Mrs Sheeran will be missed by the entire community where she lived.Father Felix Byrne, 93, told MailOnline: ‘Anne was a lovely woman and her late husband was a gentleman.‘They lived just down the road from here on a farm, but sold off a lot of the land after they retired.‘Anne was involved in all the community’s activities, organising all kinds of groups attached to the church and the village. We will all miss her dearly, it’s a great loss.‘I know her grandson Ed was over to see her quite a lot but I only met him once, about 15 years ago.‘Anne was helping me organise a service to bless all the animals in the parish – people’s dogs and cats and what have you. Ed came along to that, and I found him a nice chap to deal with.‘Everyone around here knows the lovely story of how William melted down gold from a dentist’s surgery and made Anne a wedding ring.’",
        "Ed Sheeran himself recalled the inspiration for his song Nancy Mulligan, a few years ago.They were married in Wexford and Ed said ‘nobody turned up at their wedding,’ he said.‘My grandfather stole all the gold teeth in his dental surgery and melted them down into a wedding ring.‘They wore borrowed clothes to get married, and just basically had this kind of Romeo and Juliet romance, which is like the most romantic thing.‘So I thought I'd write a song about it and make it a jig,’ Ed said.The singer’s grandparents subsequently went on to have eight children and 23 grandchildren.When the song went public, a touching video emerged of Nancy listening to it for the first time back in 2017.She even made an appearance on RTE News where she spoke at length about her gifted grandchild.‘I will never think of him as being famous, I have to say. He’s exactly the same as he always is when he visits.‘And it’s very rare because he’s always working and when you think he was working from the age of 14, you’d have to feel sorry for him, you know he’s so tired but he loves it,’ Nancy said.Last night, the singer sported a laid-back look while attending the premiere of his Disney+ documentary series in New York. ",
        "Ed wore a black leather jacket over a white T-shirt, black jeans and Nike sneakers for the screening, where guests were treated to his docuseries, 'Ed Sheeran: The Sum of It All.'He also rocked his usual scruffy beard and wore his ginger hair in a tousled bedhead style with a choppy fringe.After originally believing his four-part documentary series would follow him in the studio and writing music, the challenges in Ed's life - particularly in February 2022 - saw the show turn into a therapeutic experience, where he bares his soul to his enormous fanbase. The series features a personal behind-the-scenes look at Sheeran's life, including a heartbreaking moment of him crying as he recalled finding out about his wife Cherry Seaborn's cancer diagnosis."
    ]
}