{
    "articleURL": "/sport/football/article-12042433/Man-United-hope-agree-new-deal-David-Gea-current-one-expires-June.html",
    "content": [
        "The Spain international is currently engaged in a contract stand-off with UnitedReports suggest the two parties are closer to an agreement than they had beenRashford will be out of contract in 2024, with the club triggering an extensionManchester United are reportedly hoping to agree a new deal for David de Gea before his current one expires at the end of June, but new terms for Marcus Rashford will take more time to finalise.",
        "The Spain international is currently engaged in a contract stand-off, with the Red Devils keen to lower his £375,000-a-week wage packet.Speculation suggests the two parties are closer to an agreement than they had been, though the dotted line remains unsigned with the weeks ticking down until De Gea is a free agent.However, the Manchester Evening News now report De Gea is expected to reach a compromise and talks about a new, long-term contract with Rashford are ongoing.The England forward will be out of contract in 2024, with the club having triggered a one-year extension earlier this season. ",
        "Much of the criticism that has been thrown De Gea's way this season has been in relation to his perceived shortcomings with the ball at his feet. There have been a number of high-profile incidents this campaign, most recently away at Sevilla in the Europa League, in which he has appeared to struggle with the demands of manager Erik ten Hag's brand of football.The Dutchman is insistent that his teams must build from the back, which has exposed glaring weaknesses in De Gea's game.At the start of April, left back Luke Shaw inked a new four-year deal after featuring regularly this season for the Dutch manager. Now, attention will slide to the fortunes of Diogo Dalot and Rashford. ",
        "The Portuguese defender is said to be keen for the five-year deal that United are considering for the player.Bruno Fernandes' strike strengthened Manchester United's grip on Champions League qualification and ended Aston Villa's 10-match unbeaten run.Unai Emery has overseen an incredible turnaround since replacing Steven Gerrard and kicking off his Villa reign with an impressive win against the Red Devils in November.But Fernandes' first-half goal sealed United a 1-0 victory amid a backdrop of anti-Glazer protests on Sunday.United had failed to win their last three Premier League matches against the Birmingham outfit and looked determined to halt that run as they flew out of the blocks at Old Trafford."
    ]
}