{
    "articleURL": "/wires/reuters/article-12044889/Celtics-clobber-76ers-Joel-Embiids-return.html",
    "content": [
        "Joel Embiid returned to the Philadelphia 76ers' lineup for Game 2 of the Eastern Conference semifinals Wednesday night, but the host Boston Celtics received a game-high 25 points from Jaylen Brown and pulled even in the best-of-seven series by earning a 121-87 victory.",
        "The second-seeded Celtics led by eight at halftime and took control of the game in the third quarter, when they outscored the third-seeded 76ers 35-16 to take a 92-65 advantage into the fourth.Malcolm Brogdon came off the bench to toss in 23 points for the Celtics, who won even though leading scorer Jayson Tatum finished the game with seven points in 19 minutes. Marcus Smart (15 points), Derrick White (15) and Grant Williams (12) also scored in double figures for Boston, which made 20 of its 51 (39.2 percent) 3-point attempts.Embiid, who was named the NBA's MVP on Tuesday, sprained his lateral collateral ligament on April 20 during Game 3 of Philadelphia's first-round series against the Brooklyn Nets. He didn't play in Game 4, when the 76ers completed a four-game sweep of the Nets. He also sat out Philadelphia's 119-115 Game 1 victory over Boston on Monday.Embiid finished Game 2 with 15 points and five blocks in 27 minutes. He won a second straight scoring title by averaging 33.1 points per game during the regular season.Tobias Harris led Philadelphia with 16 points. James Harden, who scored 45 points in Game 1, scored 12 in Game 2. The 76ers were 6 of 30 (20 percent) from behind the 3-point arc.",
        "The Celtics led 28-22 after one quarter and increased their lead to 12 points -- their largest lead of the first half -- when an Al Horford 3-pointer made it 50-38 with 4:41 left in the second quarter. The 76ers missed 12 of their 13 3-point attempts in the first half and trailed 57-49 entering the third quarter.Boston cruised from there, leading by as much as 36.The series will continue with Game 3 in Philadelphia on Friday.--Field Level Media"
    ]
}