{
    "articleURL": "/tvshowbiz/article-12048977/RHOM-star-Chyka-Keebaughs-French-villa-style-family-home-sale-6million.html",
    "content": [
        "The picturesque family home of ex-Real Housewives of Melbourne star Chyka Keebaugh has been listed with an eye-watering price guide of $5.5-$6million.",
        "Located in Hesket, Victoria, the stunning four-bedroom, two-bathroom sprawl has been home to Bruce and Vannese Siney, Chyka's parents, for 25 years, reports the Herald Sun.Situated in the prestigious Macedon Ranges outside of Melbourne, the beautiful woodland estate features stunning views and covers 80 acres.Accessed by a 1km private road, the two-level house is designed in the style of a 'French villa' and features French oak parquetry flooring, bespoke joinery and Italian tiling.Built in rendered brick and styled with a mix of old world elegance and modern luxury, the amazing house features double-glazed conservatories, chandeliers and an extensive library.",
        "'It’s an incredibly beautiful little pocket of paradise, and very rare in the sense that it’s on that north side of Mt Macedon and tucked away,' RT Edgar Woodend director Beverley Higgs told Real Estate. Adding to the estate's European charm is a Cheminees Philippe fireplace and a classic oversized farmhouse kitchen.Other highlights include a private garden and lake, a Chestnut orchard, a rose and vegetable garden, and a tennis court.There's also hydronic heating, gas log fires and ducted heating.Meanwhile, the master en suite, located on the home's second storey, boasts an open fireplace and walk-in wardrobes.According to the report, Chyka's parents have filled the home with antiques and rarities.",
        "Chyka's father Bruce is a prominent businessman who became managing director of Foster's Brewery.",
        "Chyka's mother Vanessa is a well known fashion designer and stylist, and is the daughter of Ray Hensell, the inventor of the plastic lawn bowl.The couple, who bought the property in 1999, have decided to sell-up in order to downsize and be closer to their daughters and grandchildren.Chyka, 53, starred on the first three seasons of The Real Housewives of Melbourne before quitting in 2016.In an interview published in Stellar magazine in 2022, the event planner and entrepreneur said she was not a 'controversial person', adding that filming the reality show 'was not fun'."
    ]
}