{
    "articleURL": "/wires/aap/article-12047827/Attorney-general-grilled-truth-telling-inquiry.html",
    "content": [
        "Intoxicated people could be slapped with more serious charges once public drunkenness is decriminalised in Victoria but safeguards should prevent unfair cases piling up.",
        "The offence will be wiped from the criminal code on Melbourne Cup Day, with the government ploughing ahead despite objections from the police union.Attorney-General Jaclyn Symes fronted the Yoorrook Justice Commission, which is examining wrongs in criminal justice and child protection, where she was quizzed about the reforms.Ms Symes said the decision to not give police replacement powers was influenced by experiences in other states where residual powers meant decriminalisation didn't bring about cultural change.She acknowledged there could be unintended consequences, including police charging intoxicated people with more serious crimes when the public drunkenness offence wasn't an option.\"We hope there's not the consequences of up-charging,\" Ms Symes told the truth-telling inquiry on Friday.\"We don't want to see that happen and that's an ongoing conversation with the police and the agencies on the ground and, indeed, people with lived experience.\"The Victorian government committed to decriminalising public drunkenness at the start of a 2019 coronial inquest into the death of Yorta Yorta woman Tanya Day.Ms Symes acknowledged police turned a blind eye to public drunkenness in the mainstream community and at sporting events including the spring racing carnival.\"I don't think you will see many non-Aboriginal women who have been left by their friends on the side of a road drunk being picked up and put in a police cell,\" she said.",
        "She acknowledged the system had been a \"site of exclusion and oppression\", and told commissioners structural racism with colonial roots persisted.There were two lines in the Uluru Statement from the Heart she found most gut-wrenching: \"Proportionally, we are the most incarcerated people on the planet. We are not an innately criminal people.\"Ms Symes admitted the government got the balance wrong when it strengthened bail laws in 2018 and knew the reforms would lead to more people being locked up.It was working towards improving sentencing and police oversight, the attorney-general said.Ms Symes agreed it was universally accepted the age of criminal responsibility should be at least 14 but said support systems including diversion programs needed to be bolstered before that could be achieved.Victoria's age of criminal responsibility will soon be raised from 10 to 12, with an intention to introduce legislation to parliament in about October and have it enacted by mid-2024.The government wants to increase the age of criminal responsibility to 14 in 2027.\"If we can do it before (2027), we'd love to but we want to make sure the services are available so we get good outcomes,\" Ms Symes said.She apologised for harm and injustices to the Aboriginal community and said she wanted to walk beside them in their fight for justice.",
        "Yoorrook is the first formal truth-telling inquiry into injustices against Indigenous people in Victoria, as part of the state's treaty process.Police Minister Anthony Carbines and Police Chief Commissioner Shane Patton will testify on Monday."
    ]
}