{
    "articleURL": "/wires/ap/article-12047931/Justice-Clarence-Thomas-let-GOP-donor-pay-tuition.html",
    "content": [
        "WASHINGTON (AP) - A Republican megadonor paid two years of private school tuition for a child raised by Supreme Court Justice Clarence Thomas, who did not disclose the payments, a lawyer who has represented Thomas and his wife acknowledged Thursday.",
        "The revelation of tuition payments made by Dallas billionaire Harlan Crow is the latest example of Crow's generosity to Thomas and his family that has raised questions about Thomas' ethics and disclosure requirements more generally. The payments, along with the earlier examples of Crow's financial ties to Thomas, were first reported by the nonprofit investigative journalism site ProPublica.ProPublica reported Thursday that Crow paid tuition for Thomas' great-nephew Mark Martin. Thomas and his wife, Virginia, raised Martin from the age of 6.Over the past month, ProPublica has reported in other stories about luxury vacations paid for by Crow that the conservative justice took as well as Crow's purchase of property from the Thomas family, neither of which were disclosed. Democrats have used the revelations to call for stronger ethics rules for the Supreme Court, and the Democrat-controlled Senate held a hearing on ethics issues this week. Republicans have defended Thomas.According to the ProPublica story, Crow paid tuition for Martin at a military boarding school in Virginia, Randolph-Macon Academy, as well as Hidden Lake Academy in Georgia.ProPublica said Thomas did not respond to questions. Crow's office responded in a statement to questions but did not address a question about how much he paid in total for Martin´s tuition. He did say that Thomas had not requested the support for either school, ProPublica reported.",
        "A Supreme Court spokeswoman did not immediately respond to an email from The Associated Press about whether Thomas would have any response to the story. On Twitter, however, lawyer Mark Paoletta defended Thomas in an extended statement. Paoletta, a longtime friend of Thomas, called the story \"another attempt to manufacture a scandal about Justice Thomas.\"Paoletta said in his statement that Crow had recommended that Thomas consider Randolph-Macon Academy, which Crow had attended, and had offered to pay for Martin's first year there in 2006, a payment that went directly to the school. When the school recommended Martin spend a year at Hidden Lake Academy, Crow offered again to pay for that year, a payment that also went directly to the school, Paoletta said.In response to the story, lawmakers in Congress were again divided by party.Sen. Josh Hawley, R-Mo., who once clerked for Chief Justice John Roberts, said it was \"just the latest installment of the left´s multi-decade campaign to target Justice Thomas.\"Sen. Ron Wyden, D-Ore., said in a statement that with \"every new revelation in this case, it becomes clearer that Harlan Crow has been subsidizing an extravagant lifestyle\" that Thomas could not otherwise afford.\"This is a foul breach of ethics standards, which are already far too low when it comes to the Supreme Court,\" Wyden said.",
        "Democratic Sen. Dick Durbin of Illinois, chairman of the Senate Judiciary Committee, urged Roberts to take note.\"I hope that Chief Justice Roberts reads this story this morning and understands something has to be done,\" Durbin said. \"The reputation of the Supreme Court is at stake here, the credibility of the court when it comes to its future decisions is at stake.\"___Associated Press video journalist Rick Gentilo contributed to this report."
    ]
}