{
    "articleURL": "/sport/football/article-12060949/IAN-LADYMAN-Pep-Guardiola-never-better-chance-end-Man-Citys-Champions-League-hoodoo.html",
    "content": [
        "Pep Guardiola rewatched last year's Champions League exit to Real MadridManchester City have a great opportunity for revenge in this year's competitionWe want REVENGE! Rodri insists Man City have a score to settle with Real MadridThere are some members of Manchester City’s squad who have still never watched the moment that last year’s Champions League aspirations were washed away at the Bernabeu.",
        "For Pep Guardiola, that was never going to be an option. So the City manager sat down at home two days ago and watched one of the most remarkable and catastrophic five minutes of his career unfold all over again.‘I watched the two games against Madrid again to see again what happened,’ said Guardiola last night. ‘What I saw was we played exceptionally but it was not enough. That is football.’The details of May 4, 2022, at the Bernabeu will never quite leave the memories of City supporters perhaps until their club finally manages to win the Champions League.",
        "Guardiola’s team were 1-0 up on the night and leading 5-3 on aggregate late in the second leg of last season’s semi-final. They were on the threshold of a final meeting with Liverpool in Paris.But a couple of close calls at one end — substitute Jack Grealish denied once by a goal-line clearance and then from Thibaut Courtois’ toe end — were followed by two goals at the other.Madrid’s goals came in added time. Soon after, Karim Benzema completed the turnaround with a penalty in extra time.‘I haven’t watched it again,’ said City defender Rodri. ‘But what I do know is we had 180 brilliant minutes and it wasn’t enough. Maybe we didn’t handle everything the right way but at the same time some things in football are unexplainable.’",
        "Sitting in the media room deep beneath a famous stadium that remains in the middle of a rebuild, both Guardiola and Rodri alluded to fundamental changes that have also taken place in the City team this season.Whether City are a better team than last season is open for debate but they are certainly different. Erling Haaland, City’s remarkable young centre forward, is one of the reasons for that and tonight he will bring his team’s efforts something they did not have last season.Equally, it should not be forgotten just how well City did play when these teams met last season. Much has been made of how Madrid — 14 time winners — just ‘know’ how to excel in this competition. It’s a neat narrative. What is undeniably true, though, is that in terms of chances and possession they were second-best in both games against City, and indeed against Liverpool in a final they won 1-0 with their goalkeeper as their best player.",
        "So as much as there may be some scarring present in the ranks of the English club, City are not stupid.They will recall how much of a chasing they gave Madrid in last season’s first leg in Manchester — a 4-3 victory did not reflect this — and how comfortable they were for long periods in the return in Spain. For City, the story has a recurring theme.",
        "Guardiola, while manager of Barcelona more than a decade ago, looked so at home in this competition that it seemed only a matter of time until the Catalan was given the famous trophy to keep. But during his seven seasons in Manchester, it has been less straightforward.Last year was painful, and the year before they played poorly in losing a final in Porto to Chelsea of all teams. Previously, in 2019, Tottenham knocked them out. The year before it was Liverpool.‘I am a Barcelona fan and my club did not always have it easy either,’ said Guardiola. ‘We had to wait until 1992 to win it once. After that it was better.‘The important thing is that we are a stable club at City. One day it will be our turn. Other clubs have won it and then gone down and down.’All of this makes perfect sense. But still we know it makes no sense that the coach of the modern era has not won the Champions League for so long.Still it makes no sense that City — for all their sustained brilliance and domestic dominance — have not managed it at all. It will remain painful, both individually and collectively, until the spell is broken.This, on paper, seems a very good opportunity for the Premier League leaders. They face the second leg of this semi-final at home and then, if successful, one of the two Milan clubs in the final in Istanbul.",
        "It is worth noting here that Inter and Milan are 20 and 22 points behind new Italian champions Napoli in Serie A. So for City it would not be Madrid in the final or Liverpool or Bayern or Napoli. It would be an opponent City are heavily favoured to beat.Strangely here in Madrid last night, there was no mention of the treble City are chasing. For one day at least, that has been set aside simply because everything feels as though it hinges on what happens tonight.Football is all about what happens in the next game but on this occasion it is very hard to look forward without looking back.City need less drama this time round, less excitement. For a team that currently cannot stop winning, a draw really would be something."
    ]
}