{
    "articleURL": "/tvshowbiz/article-12057853/Kylie-Jenner-shares-scenes-snaps-sexy-new-Jean-Paul-Gaultier-Flowers-campaign.html",
    "content": [
        "Kylie Jenner wowed her fans appearing as a sexy siren in a new campaign for Jean Paul Gaultier, and now the reality star is sharing more looks in some behind-the-scenes snaps.",
        "Kylie, 25, who showcased her hour glass figure in a JPG gown at the Met Gala May 1, put her curves on display in the body hugging looks from the designer's Flowers collection.The Kardashians star was styled in a long blonde wig making her barely recognizable in the high end campaign.Her eyeshadow was petal pink and the makeup artist place bright pink blush high on her cheeks.Kylie's trademark lips were lined but seemed to have been shaded in a neutral tone. ",
        "She clasped her arms over her head as she sat in a chair wearing a sheer pink ankle length dress body flower dress, which retails for about $460.Stylists were seen applying product to the beauty moguls toned abs as she sported a multi colored sleeveless crop top with a boat neck and a high waist mini skirt. Another look included a body hugging dress that seemed to have been inspired by Madonna's bullet bra days in the early 90s.The salmon pink 'Iconic' satin corseted dress featured a cone bra, topstitched accents and lace-up back.The Keeping up with the Kardashians star posed in front of a shiny white background and held her arms above her head. Pink and Blue accessories were placed on top of her head for the shot. ",
        "The stylists had Kylie tackle horizontal stripes next in a sexy black and white crop top with a plunging neck and flower clasp, paired with a matching mini skirt with a cutouts at the thigh. A red sailor hat was added to the look as the Kylie Beauty founder sat in a clear acrylic chair in front of a bright yellow background. ",
        "The main look from the campaign featured Kylie in what the designer called a morphing dress.The see through frock featured green and purple horizontal lines across the arms and torso.Lengthening vertical lines covered the legs. Posters of Kylie looking larger than life placed in on billboards and store windows.The design house described the campaign as  '\"Flowers” are blooming and acting both as motif and motive to create geometric, deconstructed looks.'",
        "Also on Sunday, the mother of two jumped to her TikTok account to share a 25 second clip that offered a behind-the-scenes look from the Jean Paul Gaultier photo shoot. The beginning of the video, which had a remix track titled Kidtendo! by SZA playing in the background, showed the process of Kylie dying her eyebrows a blonde color to coincide with her platinum wig. The clip then quickly jumped to her newly dyed brows and showed a layer of vibrant pink shadow being applied around her eyes. ",
        "The media personality also took a video selfie donning a skintight, printed dress as she prepared to start the photo session inside the spacious studio. The Kardashian star striked a few poses on top of a large, raised platform modeling the minidress as she rested on her side. The long locks from the wig spilled behind her as her hand rested on the side of her head to prop herself up. ",
        "After an outfit change into the green and purple morphing dress, Kylie returned to the platform to once again showcase a few of her favorite poses as a fan offscreen gently blew the long locks away from her face. The reality star additionally wore a white, semi-sheer ensemble made of a netted material while laying near a purple backdrop on the floor. She paused for a variety of photos in dim lighting and a spotlight aimed directly towards her face. The TikTok video came to an end as she stepped into a shallow pool of water that was also filled with a variety of leaves and other items. Kylie let herself fall completely under the water for some snaps, while also sending a sultry gaze towards the camera as she turned her back away and glanced over her shoulder. "
    ]
}