{
    "articleURL": "/sport/wwe/article-12060183/WWE-announces-highest-grossing-viewed-Backlash-event-Puerto-Rico.html",
    "content": [
        "The records come after Bad Bunny fought Damian Priest in San Juan, Puerto RicoMore than 34,800 fans showed up for SmackDown (16.9k) and Backlash (17.9k) DailyMail.com provides all the latest international sports news This year's Backlash event became the highest-grossing and most-viewed of its kind in WWE history after it was held in Puerto Rico, where Latin Pop star Bad Bunny made a surprising appearance. ",
        "The wrestling event saw a 28 percent increase versus the record set in 2022. Bad Bunny, who's the most-streamed music artist in the world, marked the largest gate ever for any WWE event held in Puerto Rico, his homeland, and the largest gate in the history of Backlash.More than 34,800 fans showed up in the island's capital of San Juan for back-to-back fellout nights of SmackDown (16,898 attendees) and Backlash (17,944 attendees). It also marked the most social Backlash of all-time, led by over 40million views of the San Juan Street Fight featuring Bad Bunny vs. Damian Priest. ",
        "The hashtag #WWEBacklash, accompanied by a custom Bad Bunny emoji, trended No. 1 across the entire evening of sports.What's more is that Backlash broke merchandise and sponsorship records too. As the first-ever WWE event under the company's new partnership with Fanatics overseeing the on-site event retail experience, top-selling items included the WWE Backlashand LWO Puerto Rico t-shirts. Sponsorship revenue surpassed any Backlash event in history, breaking last year's record with a 98 percent year-on-year increase through partnerships with Netflix's FUBAR, Mike's Harder Lemonade and Xfinity.",
        "WWE, which is joining with the company that runs Ultimate Fighting Championship to create a $21.4 billion sports entertainment company, saw a drop in its revenue and profit in the first quarter but still managed to top the $285.5million that analysts polled by Zack Investment Research were calling for.",
        "WWE's biggest premium live event of the year, WrestleMania, took place just after the first quarter ended.'WrestleMania, as well as our other successful premium live events such as Royal Rumble and Elimination Chamber, and strong viewership for our weekly flagship programs, Raw and SmackDown, further expanded the reach of our brands and enhanced the value of our content,' CEO Nick Khan said in a statement.The company also disclosed Wednesday that during the first quarter it incurred $1.7 million of expenses paid by Vince McMahon for plaintiffs´ attorneys´ fees in connection with a shareholder lawsuit that was mooted. WWE said other shareholder litigation remains ongoing.McMahon, executive chairman at WWE, made a $17.4 million payment to WWE during the quarter to reimburse the company for costs incurred and paid by WWE through Jan. 31 related to an investigation conducted by a special committee in regards to revisions to WWE´s financial statements and other matters."
    ]
}