{
    "articleURL": "/femail/article-12053521/Prince-George-carries-King-Charles-robes-leads-page-honour-arrivals-Westminster-Abbey.html",
    "content": [
        "Prince George, 9, is the most notable of the King's four pages for his Coronation Queen Camilla's four pages include her three grandsons and her great-nephew Read more: Who are King Charles' Pages of Honour?How are YOU celebrating the Coronation? Send your pictures and video to pictures@mailonline.co.ukPrince George today arrived at Westminster Abbey as a page of honour for his grandfather - a role he shared with members of the Queen Consort's family.",
        "The young royal, nine, was the most notable of the boys who were tasked with carrying the King and Queen Consort's robes into the church in central London today.He was joined in the King's party by Nicholas Barclay and Lord Oliver Cholmondeley, both 13, and Ralph Tollemache, 12 - all the sons of notable, royal-linked families.George and the King's Pages of Honour were in traditional uniforms first seen at the Coronation of King Edward VII in 1902 - scarlet tunics decorated with gold lace trim and blue velvet cuffs.The outfit has an open-fronted design and is lined with silk. It is worn with a waistcoat trimmed with gold braid, with wool trousers and boots. These particular outfits were first made by Ede and Ravenscroft during the reign of the late Queen.",
        "The Queen Consort's pages of honour all come from Her Majesty's family. They include her grandsons Gus and Louis Lopes, 13, and Freddy Parker Bowles, 13. Her great-nephew, Arthur Elliot, 10, was her fourth page.These four were wearing a slightly different ensemble, in uniforms that pay tribute to some of Her Majesty's military affiliations. Gus and Arthur were wearing outfits based on the uniform of the Rifles, of which Camilla is Colonel in Chief.Their green jackets featured red Rifles piping, with a collar braid on the neck and front, and Her Majesty's royal cypher on their shoulders.",
        "Meanwhile, Louis and Freddy were dressed in outfits that take inspiration from the uniform of the Grenadier Guards. It replicated elements of the military dress, with gold cuffs and a gold and crimson sash around the waist. ",
        "These choices demonstrated Charles and Camilla's determination to put loyal family and friends at the heart of this historic occasion at Westminster Abbey - the first coronation to take place in England since the late Queen was crowned in June 1953.Charles and Camilla were crowned in a Christian ceremony that dates back for 1,000 years on a day dripping with glorious displays of pageantry. It was watched by millions.Prince George was the youngest future king to have an official role in today's coronation, attending as one of his grandfather's four pages of honour.This is a ceremonial position within the Royal Household that only requires attendance on state occasions - like today - when they carried the King's robe through the ceremony in Westminster.Asked by Sky News what they would do after their duties were through, the young boys reportedly said: 'I think we'll all collapse.' ",
        "He will be joined by Nicholas Barclay, 13, the grandson of Sarah Troughton, who is one of the Queen Consort's six companions (a role which replaced the former lady-in-waiting position) and oldest friends. ",
        "Lord Oliver Cholmondeley, 13, son of David, the Marquess of Cholmondeley, and his former model wife, Rose, will also be a page of honour for King Charles, as will Ralph Tollemache, 12.Ralph is the son of British banker and aristocrat the Honourable Edward Tollemache and Sophie Tollemache. Edward is a godson of the King and was a page of honour to the late Queen.Camilla's grandsons will also be involved in the ceremony - a clear indication to the UK that the Queen Consort's family will be very much engaged in royal life. Gus and Louis Lopes, 13, and Freddy Parker Bowles, 13, will act as Camilla's pages of honour, as will her great-nephew, Arthur Elliot, 10. ",
        "However, their task of carrying the Queen's robes might be challenging for Gus - the son of Camilla's daughter, Laura, and her husband, Harry Lopes - as he has a broken arm.The eight boys were spotted driving to and from Westminster Abbey earlier in the week, as rehearsals for the coronation ceremony took place. The streets of London are packed with well-wishers today, as huge excitement builds for tens of thousands who have camped out to watch this extraordinary event unfold.",
        "It is thought 100million people will watch the ceremony on TV around the globe. ",
        "Some two million people - from all corners of the UK, Commonwealth and the world - are flowing into London, despite rain being forecast. Trains into the capital were packed this morning, with soldiers taking part in the ceremony seen flowing into mainline stations. Guests of the King started arriving at the Abbey from 7am - four hours before the ceremony. Some 100 heads of state are in London, with representatives from 203 countries due to attend.'There will be all the pomp and ceremony you could dream of, but as little of the \"them and us\" as possible,' one senior royal aide said last night."
    ]
}