{
    "articleURL": "/sport/mlb/article-12059355/Red-Sox-reliever-Kutter-Crawford-Phillies-southpaw-Matt-Strahm-tossed-fined-anthem-standoff.html",
    "content": [
        "Crawford and Strahm, former teammates, were both ejected before the gameCrawford was injured, and ineligible to play, so he received a larger fine DailyMail.com provides all the latest international sports newsAn impromptu standoff between Red Sox right-hander Kutter Crawford and a former teammate, Phillies southpaw Matt Strahm, ended with both players being ejected in a bizarre scene in Philadelphia on Saturday.",
        "The crime: Both relief pitchers refused to leave the field following the national anthem.It's not entirely uncommon in sports – and particularly baseball – to see players lingering after The Star-Spangled Banner in a childish faceoff to see who can be the last player standing on the field. Only now, with the implementation of Major League Baseball's new pitch clock, umpires are in a rush to get everyone into their respective dugouts.As a result, both Crawford and Strahm were warned, ejected and later fined after failing to follow their teammates off the Citizens Bank Park field on Saturday. An MLB spokesman declined Monday to tell DailyMail.com exactly how much the players were fined.'Zero of it was planned,' Strahm told Rob Bradford on Audacy's Baseball Isn't Boring. 'Just, anthem was over, and I looked across, and Kutter kind of gave me a grin, and I knew exactly what that grin meant, so [I] just stood there.",
        "'Just locked eyes after the anthem, both still had our hat over our heart and neither of us were moving.'Strahm, a long-haired North Dakotan who pitched for Bostin in 2022, said he'd 'never done anything like that' in his life, but couldn't resist competing with Crawford.'If you know me, you know competition is everything to me, so kind of felt like I was being called out right there,' Strahm said. 'Looking back on it, probably not the wisest decision I've made in my big-league career. But yeah, moving on.'",
        "The incident played out in a confusing, somewhat chaotic scene before Boston's 7-4 win on Saturday in Philadelphia.The standoff was immediately apparently to players, umpires, fans, and even the Phillie Phanatic, Philadelphia's fury, green mascot, who immediately focused his attention on Crawford.In addition to waving his hands (paws?) in front of Crawford's face, the Phanatic also gyrated its backside in an effort to dislodge the entrenched Boston reliever.Eventually both players quietly returned to the dugouts, where they learned they had been ejected.'I didn't even realize I was thrown out either,' Strahm said.'The first base umpire came over to me and said 'You gotta get going,' he continued. 'All I said was 'OK well it's our home field, so he should go first.''Then said 'OK.''When I looked over, Kutter was leaving and I walked down the steps [into the dugout] and then they told me I was thrown out.'As Strahm explained, he 'never received a warning or anything.'",
        "'I guess I should have known better with how strict they are with the pitch clock,' Strahm said. 'Lesson learned. Like I said, embarrassing moment, learn from it, move on.'While the exact fine amounts are unknown, Crawford's is believed to have been heftier since he was on the disabled list with a left hamstring strain.",
        "Fortunately, his teammate and fellow Florida Gulf Coast University alum Chris Sale is expected to pay the penalty for Crawford.'The fines increase if you're on the injured list, so it was a hefty fine for Crawford,' NESN's Tom Caron said on Sunday's broadcast. 'Word is, a Florida Gulf Coast University teammate by the name of Chris Sale will be picking up the tab on that one. Alex Cora had a chuckle with us before the game saying, 'He got a guy out of the game. He did his job.'"
    ]
}