{
    "articleURL": "/wires/ap/article-12060781/Texas-lawmaker-resigns-ahead-misconduct-expulsion-vote.html",
    "content": [
        "AUSTIN, Texas (AP) - A Republican Texas state lawmaker resigned Monday ahead of an expected vote to expel him after an investigation found he had inappropriate sexual conduct with a 19-year-old intern.",
        "Rep. Bryan Slaton, 45, had faced mounting calls from the state Republican party and conservative groups to resign after the House investigation determined last week that he gave the intern and another young staffer alcohol at his home, had sex with the intern after she was intoxicated, and later showed her a threatening email but said everything would be fine if the incident was kept quiet.Slaton also asked a fellow lawmaker to keep his behavior secret, the House General Investigating Committee report noted.The chairman of the investigating panel, Rep. Andrew Murr, said he still plans to call for a vote to expel Slaton because he remains an officer of the state until a successor is elected and sworn in.Slaton's resignation letter did not address the allegations, which his attorney previously called \"outrageous\" and \"false.\"Slaton said it had been an honor to serve in the Legislature from his East Texas district and thanked his colleagues.\"I look forward to spending more time with my young family, and will continue to find ways to serve my community and all citizens across our great state,\" he wrote.State Republican Party leaders welcomed his departure and said House members should be held accountable for misconduct.\"The misconduct described in the General Investigative Committee Report should never be tolerated and is proper grounds for expulsion,\" party officials said in a statement. \"These actions have betrayed the trust that the people of Representative Slaton´s district put in him as an elected official, and he has rightly resigned.\"",
        "Slaton´s legislative biography describes him as holding values and principles formed by church and family gatherings. It also cites his degrees from a Baptist seminary and work as a youth minister.The misconduct investigation began after two 19-year-old legislative aides and a 21-year-old legislative intern filed complaints in April.Two of the women said they tried to dissuade the intern from spending time with Slaton and suggested his behavior was inappropriate. But the intern, who one complainant described as \"naive,\" agreed to Slaton´s request to visit his apartment. The other women went with her, according to the report, and the lawmaker served them alcohol.One of the young women drank enough to vomit and the others got so drunk they were dizzy and had \"split vision,\" the investigation report noted.Two women eventually left but the intern stayed, according to the report. She told her friends Slaton drove her home the next morning, stopping at a drugstore so she could obtain emergency contraception.The Associated Press found that between 2017 and 2021, at least 120 state lawmakers in 41 states faced public allegations of sexual misconduct or harassment. They often run again for office and are re-elected, and efforts to remove them are rarer."
    ]
}