{
    "articleURL": "/money/beatthescammers/article-12042471/New-scam-measures-Government-step-right-direction.html",
    "content": [
        "Government has revealed new measures to tackle scam epidemic Consumer fraud now makes up two in five crimes in England and Wales For it to work, banks, big tech, social media and telecoms must come together Finally. It feels like the Government has woken up and will take proper, measured action to combat one of the biggest blights of modern life… scams.",
        "It's just a shame it has taken this long. The fraud balloon has swelled into a monster and little pinpricks haven't been enough. A torpedo is needed to deflate it.Every single day, our email box is filled with yet more cases of financial fraud. We feel the last decade has been frustratingly slow on combatting the problem at source.",
        "Seven years ago, This is Money launched a Beat the Scammers section of the website.We have continuously warned about this clearly huge and growing problem, as more of us were pushed into living our financial lives digitally.The aim of the Beat the Scammers was to arm our readers with as much knowledge as possible.Our thinking was that if the authorities weren’t going offer any meaningful help, we’d take the matter into our own hands and report on the latest ruses as they happen - to help people avoid them.Also that year, I wrote a hard-hitting piece for the Daily Mail about how Action Fraud was just not fit for purpose.Indeed, just 1 in 500 fraud cases at that time were investigated by the agency. Essentially, it is a reporting body that we felt gave false hope to victims on ever receiving scam refunds.Now, Action Fraud is being wound down to be replaced with a new £30million service, which includes – crucially – a portal to keep track of a scam report, if you need to ever file one.",
        "Let's hope this new service hits the mark.For the scam scourge to really be tackled, all the banks, big tech, social media and telecoms firms need to be fully onboard working together, singing off the same hymn sheet.That's a mammoth task – but if achieved, maybe, just maybe, we can finally get on top of the problem.There have been some notable moves in recent years. For example, the industry-backed 159 phone number is a simple idea to help stop fraudsters in their tracks.Most big banks have also introduced stronger two-factor authentication and better processes when making online payments – namely, checking the payee matches the account number and putting out fraud warning messages while doing so.Meanwhile, the police smashed the iSpoof ring late last year.That gang made 3.5million calls targeting Britons, defrauding them in large numbers. That sting shows there is appetite to combat organised fraud gangs and I'm sure more investigations are ongoing to smash more rings.The trouble is, 70 per cent of fraud in the UK originates from overseas or has an international link. Once the money is gone, it is nearly impossible to track down.And the fact of the matter is consumer fraud has snowballed out of control – it now makes up two in five crimes in England and Wales and is said to be a £7billion a year problem.",
        "It's the fastest growing crime and this all feels inevitable – far more could have been done to stop it.Measures announced by Prime Minister Rishi Sunak include cracking down on 'SIM farms' – where criminals can scattergun out scam messages and calls with little outlay - alongside the banning of cold calls on all financial products.There are also incoming plans from regulator Ofcom to stop scammers 'spoofing' legitimate phone numbers, which makes victims believe they are being contacted by a legitimate organisation.All these moves may help ensure that £7billion figure is the peak, never to be repeated.But the proof will well and truly be in the pudding, if the Government can manage to get all the big players pulling in the same direction, there is a fighting chance.",
        "Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence."
    ]
}