{
    "articleURL": "/sport/football/article-12046813/Xabi-Alonso-hands-blow-Tottenham-search-new-manager.html",
    "content": [
        "Tottenham are searching a permanent successor to manager Antonio ConteBayer Leverkusen boss Xabi Alonso is said to be among those being observedHe has since spoken out of his plans, and why a move to England is not incoming Any hopes Tottenham had of convincing Xabi Alonso to become their next boss appear to have been dashed. ",
        "The Spaniard, who is manager of German side Bayer Leverkusen, has been quizzed o on reports he could be bound for north London this summer.Alonso, who has guided Bayer Leverkusen to the semi-finals of the Europa League, said of the suggestion: 'I've been in football for many years, rumours are normal but we still have a lot to achieve. 'That's why my head is 100 per cent here for the last few months. And my head is also 100 per cent here for next season.' A report in Dutch outlet De Telegraaf detailed that Alonso's 'calibre' during his playing days as a top midfielder for Liverpool and Real Madrid is attractive to Tottenham.",
        "But, nonetheless, it appears the 41-year-old is eager to stay in Germany and continue his coaching development.His Leverkusen side sit sixth in the Bundesliga, having won 14 matches out of a possible 30 so far this season. He has implemented an attractive style of attacking football, which appeals to rival teams.Mail Sport previously reported Spurs are exploring an interest in Sporting Lisbon head coach Ruben Amorim.Mauricio Pochettino had been the preferred candidate for a number of players and the large sections of the fanbase, but appears set to become manager at Chelsea. Spurs remain managerless since Antonio Conte was dismissed after a blistering attack on the club and his own players' mentality. ",
        "Cristian Stellini, Conte's deputy, was then brought in as interim boss but won only one game and was axed after a brutal 6-1 mauling at Newcastle. And now Ryan Mason is in charge, leading the side to a 2-2 draw with Manchester United followed by this weekend's heartbreaking late 4-3 defeat by Liverpool. Former Bayern boss Julian Nagelsmann remains favourite to take over at Spurs and is still regarded as one of the brightest young coaches in the game. ",
        "Mail Sport have been told that Nagelsmann is not demanding full control of transfers if he takes over at the club, contrary to reports elsewhere. A further complication is the lack of a sporting director after Fabio Paratici's appeal against his two-year ban from football was rejected, prompting his resignation. The role in Juventus' financial scandal led to his ban and subsequent departure from Spurs, who have no manager or sporting director at present. With the looming transfer saga around Harry Kane still to come this summer, it is a time of great uncertainty at the club.  "
    ]
}