{
    "articleURL": "/wires/reuters/article-12049655/New-Zealands-hot-migration-risks-fanning-inflation-forcing-rates-higher.html",
    "content": [
        "New Zealand migration red hot, could hit 100,000, boost demand",
        "Migration raises inflation risks, could force cenbank to tighten moreBut feeds into lower wage inflation, helps ease tight labour marketRisk of house market rebound poses challenge for policymakersBy Lucy CraymerWELLINGTON, May 5 (Reuters) - Gastroenterologist Wesley Kasen arrived in Hawke´s Bay New Zealand in February with his wife Marnie, two kids and dog from Colorado. Their arrival filled a vacancy at the local hospital.The Kasens are part of a migrant boom helping to ease the country's acute labour shortages - a relief for firms desperate to fill vacancies and keep a lid on wages but which economists warn risks fanning inflation and keeping rates higher for longer.The government, keen to plug the job shortages and make inroads in the global talent war, is facilitating the inflow of migrants drawn to the country's unspoilt, scenic landscape, relative safety and liberal politics.\"I am just constantly amazed by how friendly the people are everywhere we go, and how easy things are,\" said Marnie.However, it may not be so easy for the Reserve Bank of New Zealand, which has noted that rising long-term net migration could boost activity and inflation, with surging migration inflows highlighted in robust labour market data this week.\"There is a risk that we don't get the recession and that we keep sort of plodding in a lot stronger environment which would frustrate the outlook for inflation, would frustrate the central bank, keep interest rates higher for longer,\" said Kiwibank chief economist Jarrod Kerr.",
        "Indeed, New Zealand's migrant numbers are tracking at a much faster pace than expected a few months back and are set to hit a record this year, which could keep demand strong and more worryingly reignite the housing market - a perennial thorn in the RBNZ's inflation battle.A net 51,955 migrants settled in New Zealand in the year ended February, according to Statistics New Zealand. ANZ and Westpac economists say total net arrivals could hit a record 100,000 this year if current trends persist.STICKY INFLATIONNew Zealand's inflation is running at an annual 6.7% rate, off a three-decade 7.3% peak hit in the second quarter last year, but still at historically elevated levels and well beyond the top end the central bank's 1%-3% target despite the nation's most aggressive policy tightening cycle in a quarter century.The benchmark cash rate is currently sitting at more than a 14-year high of 5.25% after a streak of hikes that began in October, 2021, yet the risk is that the RBNZ might have more work to do, potentially even pushing the peak beyond the current forecast of 5.50%\"If the demand impulse (from migration) overrules the supply effects it would take inflation longer to fall to the RBNZ´s target and could even necessitate more tightening than anyone is so far bargaining on,\" said Stephen Toplis, head of research at the Bank of New Zealand, in a note to clients.",
        "Kiwibank's Kerr noted there were already signs of weakness in the economy to hopefully keep pushing inflation lower. Economic growth contracted 0.6% in the fourth quarter.MORE LABOUR, LESS HOUSESNew Zealand is desperate for migrants to fill jobs for everything from driving buses to programming computer games but like Australia and Singapore, which are also trying to attract new migrants, the country faces a systemic housing shortage.House prices, a key driver of inflation, rose rapidly for a decade before peaking in 2021. Since then, higher interest rates coupled with a construction boom have seen prices fall 16% although they are now starting to stabilise thanks in part to the migrant-led demand for homes.It is largely good news for the government, which has introduced new policies to fill job gaps that businesses say were stymieing growth, although any significant rise in house prices will play badly for voters.NZBus, one of the country´s biggest public bus operators, is a case in point. It is currently training 72 Fijian and Filipino bus drivers.That helps to tamp down wage inflation by pushing against pressure to raise pay, but at the same time keeps consumer prices stubbornly high.Infometrics principal economist Brad Olsen said increased migration is good news for businesses desperate for workers though it also poses a real challenge.",
        "\"Adding any additional demand to the economy at the moment does seem to be a challenge for New Zealand given that inflationary pressures are still high.\" (Reporting by Lucy Craymer Editing by Shri Navaratnam)"
    ]
}