{
    "articleURL": "/wires/reuters/article-12049299/China-assures-Russia-India-deepening-cooperation.html",
    "content": [
        "BEIJING, May 5 (Reuters) -",
        "Chinese Foreign Minister Qin Gang assured his Russian and Indian counterparts of deepening bilateral ties, promising that \"coordination and cooperation\" will only grow stronger, in a show of solidarity with two of China's biggest neighbours.Qin met in India on Thursday with other foreign ministers of the Shanghai Cooperation Organisation, ablocof nations spanning most of Eurasia, with Beijing seeking to preserve stable relations with countries in the region as ties with the West, particularly Washington, remain tense.The United States has long urged China to help resolve the war in Ukraine even though Beijing has refused to denounce Russia's military moves as an invasion. In a landmark move last week, Chinese President Xi Jinpingspokedirectly with Ukraine's Volodymyr Zelenskiy for the first time since Moscow sent its troops into Ukraine.During his meeting with Russian Foreign Minister Sergei Lavrov on the sidelines of the SCO meeting, Qin said China is \"willing to maintain communication and coordination with Russia to make tangible contributions to the political settlement of the crisis\" in Ukraine.The two sides also agreed to strengthen communication and coordination with other SCO member-states and maintain the bloc's \"unity\", according to a statement from the Chinese foreign ministry on Friday.They additionally agreed to strengthen coordination in the Asia-Pacific, the ministry said, without giving details.",
        "Currently the bloc includes Russia, India, China, Pakistan and four Central Asian countries - Kazakhstan, Kyrgyzstan, Tajikistan and Uzbekistan. Iran and Belarus are expected to be inducted into the SCO at a summit in New Delhi in July, an Indian foreign ministry official said.In a separate meeting with Indian Foreign Minister Subrahmanyam Jaishankar, Qin said China is willing to deepen \"coordination and cooperation\" on international and regional issues with India and bring ties back to a \"healthy\" track of development.China's ties with India have deteriorated since 2020, when their troops clashed on a disputed Himalayan border and 24 people were killed. Last month, Beijing published amapshowing Arunachal Pradesh, claimed by India, as part of Tibet, angering New Delhi.Qin told Jaishankar that the situation on the border is \"generally stable\".\"We should draw experience and lessons from history, grasp bilateral relations from a strategic height and a long-term perspective, respect each other, learn from each other, and achieve mutual success,\" Qin told Jaishankar. (Reporting by Ryan Woo and Liz Lee; Editing by Christian Schmollinger)"
    ]
}