{
    "articleURL": "/sport/othersports/article-12047969/Dave-Portnoy-fears-firing-host-Ben-Mintz-death-blow-Barstool-Sports.html",
    "content": [
        "Mintz was fired after saying a racial slur while reading rap lyrics on a livestream Portnoy vouched for the ex-Barstool Sports host to stay on but that didn't matter DailyMail.com provides all the latest international sports newsDave Portnoy has revealed that he fears the firing of former host Ben Mintz may have been a 'death blow' for Barstool Sports as the stock price of parent company Penn Entertainment continues to dwindle after a high-volume of backlash. ",
        "The 46-year-old shared an explanatory video on Twitter on Wednesday in regards to Mintz's axing from the 'Wake Up Mintzy show'. Mintz was fired on May 3 for saying a racial slur while reading lyrics of a rap song on a live stream on May 1.'By the way for everybody saying Barstool is dead to them I knew this would happen,' Portnoy first wrote on Wednesday. 'I said it's so against everything we stand for that it could be a death blow. 'Penn understood this. They still did it. That's how frightened they were of regulators who operate with no impunity.' Portnoy previously claimed that he did everything in his power to try to keep Mintz on board along with the backing of Barstool CEO Erika Nardini and 'Barstool Big Cat' Dan Katz. Ultimately, Penn decided to go in another direction. ",
        "One of several reasons for Mintz's departure from the brand is related to concerns linked to regulatory gambling licenses being stripped from the company all over the USA. On Wednesday, Portnoy hit back at critics calling him a 'sell-out' after he stayed on following Mintz's decision to be fired by Penn. 'So I got every Tom, Dick and Harry since this Mintzy thing saying, ''pres', you’re a sell-out. Hey pres', you sold out,'' the Barstools founder said, admitting to the labels given to him online. ",
        "'You’re just figuring that out? I started a company and I f***ing sold it the f*** out. Made hundreds of millions, made millions for everybody that grinded. Yeah we sold the f*** out because that’s what you do when you’re an entrepreneur. 'You start this little company you dream one day and you sell it the f*** out. Still means this decision sucks. I hate it, it makes me want to puke.  'But guess what, when I sold out, a couple words, a couple things is very clear: you say these things, those decisions are no longer mine. I can’t protect you, you know why, because I sold out.",
        "Penn Entertainment purchased 36 percent of Barstool Sports from The Chernin Group during the pandemic in early 2020. The acquisition cost $163million before the remainder of the company was sold for an extra $388M in February 2023. Mintz has apologized since his firing on May 1 before sharing an update on Twitter, two days later. 'I am in good spirits,' he wrote. 'I am def an idiot but I am a resilient one. Will have a long video tomorrow thanking everyone. Way way too grateful to be too down.' Portnoy added that although he doesn't agree with Penn CEO Jay Snowden on his decision to fire Mintz, he had no control on the final call to sack his colleague.",
        "Barstool was founded in 2003 by Portnoy as a free sports and gambling newspaper. It is now a digital platform that covers sports, lifestyle, and entertainment with more than 200 million followers. "
    ]
}