{
    "articleURL": "/wires/reuters/article-12039139/Soccer-Alba-strikes-late-Barcelona-narrow-win-10-man-Osasuna.html",
    "content": [
        "BARCELONA, May 2 (Reuters) - Barcelona defender Jordi Alba came off the bench to strike late on and secure a 1-0 victory over a 10-man Osasuna at Camp Nou on Tuesday as the home side moved a step closer to clinching their 27th LaLiga title.",
        "Barca moved to 82 points from 33 matches and extended their lead to 14 points over second-placed Real Madrid, who play at fourth-place Real Sociedad later on Tuesday.With five games remaining, Barcelona are four points away from winning the title with Real Madrid on 68 points and, in the best-case scenario, would only be able to reach 86 points.If results go their way, Barca could secure the trophy in front of their fans on May 21, against Real Sociedad at Camp Nou.Barca missed a string of chances against a dogged Osasuna who defended with tenacity while playing much of the match with 10 men.Following defender Jorge Herrando's red card for a foul that prevented Pedri from scoring midway through the first-half, Osasuna managed to hang on until the 85th minute, when Robert Lewandowski crossed to Frenkie de Jong, who nodded the ball to Alba who hit a left footed strike into the net.\"It was an important step because we suffered too much (in trying) to break the deadlock,\" coach Xavi Hernandez told DAZN.\"We missed some very clear opportunities. And then came Jordi's goal, which almost makes it better to win like that.\"We lacked effectiveness but it a summary of the season, struggling to score the many chances we create, but we played with hunger and I think we deserved to win.",
        "\"The league is almost over. That's the sensation after winning the last two games. It was a giant step.\"Barca's profligacy started before Herrando's red card, with Pedri missing a sitter from close-range in the 25th minute.Raphinha sent a free-kick wide from the edge of the box and coach Xavi had to bring Ansu Fati off the bench a little later for an injured Gavi.Araujo, De Jong, Ansu Fati and Lewandowski all missed clear chances, while the Polish striker also had a goal ruled out by VAR due to an offside in the build-up in the 78th minute.With the game looking destined to end goalless, Alba ghosted behind the defence to score a clever shot between the goalkeeper and the right post to edge Barca closer to the title. (Reporting by Fernando Kallas in Madrid Editing by Christian Radnedge)"
    ]
}