{
    "articleURL": "/wires/pa/article-12054877/We-value--Ryan-Mason-hails-Harry-Kane-s-round-contribution.html",
    "content": [
        "Tottenham interim boss Ryan Mason believes there are still elements of Harry Kane’s contribution to the team that go underappreciated.",
        "The stadium announcer was still in the midst of declaring one minute of first-half added time when Kane connected with Pedro Porro’s whipped cross and nodded in the eventual winner as Tottenham beat Crystal Palace 1-0.Kane’s strike, his 209th in the Premier League, also moved him ahead of Wayne Rooney and into outright second on the all-time top scorer list.",
        "Mason said: “Naturally we’ll all talk about Harry’s goals and Harry when he plays games of football he will continue to score goals. We know that.“But also that elite mindset, that example that he sets every day in and around the place, it’s great to be around. Because when you have people like that they inspire you to be better and we appreciate Harry, we value him so much at this football club.”The England captain’s 28th goal in all competitions this season leaves him 51 behind all-time Premier League leader Alan Shearer, who netted 260 in the top flight.",
        "Alan Shearer (260)Harry Kane (209)Wayne Rooney (208)Andrew Cole (187)Sergio Aguero (184)",
        "“Harry is certainly one player that is focused every game to be the best version of himself every time he is out on that football pitch, whether it’s the training ground or on matchday, so hopefully Harry continues to play and I’m sure he’ll continue to score goals.” Mason remained pragmatic when asked if Kane was set to break that mark, saying: “I don’t really like speaking too much about the future because from personal experience I know that you can’t really plan too much far ahead in football terms and in life, and you’ve got to be in the moment.",
        "Saturday’s victory was a subdued affair but enough to secure Mason a first victory in his second spell in charge of Spurs.",
        "Roy Hodgson’s Palace, meanwhile, had a handful of chances and were kept in it by several good saves from Sam Johnstone, who has in recent weeks usurped Vicente Guaita as his boss’ first-choice keeper.The former England manager was more forthcoming about 29-year-old Kane’s chances at surpassing Shearer, saying: “I would expect it, you know his age, he’s got several good years ahead of him and he doesn’t get injured very often, touch wood.“I think the only thing that stands between him and the record will be is he going to avoid serious injury? Is he going to be able to get 20, 30 matches a year behind him? Is he going to get help from his team-mates and play in a good team which is what he has been playing in?",
        "“If all those things take place I expect him to break the record, absolutely.”Hodgson departed from Mason when asked if Kane was to some degree still viewed as an underrated talent.He added: “You’re talking maybe for a body of football fans and football people that I don’t know. I don’t know who they are, I don’t know what they’re saying, but I can guarantee that none of us that work in football on a serious basis in what I call the football village, there’s none of us that have that opinion.”"
    ]
}