{
    "articleURL": "/wires/reuters/article-12058281/Devin-Booker-Kevin-Durant-pull-Suns-level-Nuggets.html",
    "content": [
        "Devin Booker and Kevin Durant scored 36 points apiece and Landry Shamet buried four 3-pointers in the fourth quarter as the Phoenix Suns recorded a 129-124 victory over the visiting Denver Nuggets on Sunday night to even their Western Conference semifinals at two games apiece.",
        "Booker shot 14-for-18 and registered 12 assists while Durant added 11 rebounds and six assists as fourth-seeded Phoenix won its second straight game. Shamet became a surprise hero off the bench by scoring 14 of his 19 points in the fourth quarter.Nikola Jokic scored 53 points, his career best in the postseason or the regular season, and had 11 assists for top-seeded Denver. He hit 20 of 30 field-goal attempts. Jamal Murray contributed 28 points and seven assists and Michael Porter Jr. added 11 points and 10 rebounds for the Nuggets.Game 5 of the best-of-seven series is scheduled for Tuesday in Denver. The home team has won every game so far.The Suns were without veteran point guard Chris Paul (groin) for the second straight game.Booker and Durant combined for 72 points on Sunday after teaming up for 86 in Phoenix's Game 3 win on Friday.In Game 4, Denver crept within 121-118 on Jokic's three-point play and Aaron Gordon's tip-in with 1:45 remaining. Durant made two free throws with 1:27 left to push the margin to five before Murray hit a short jumper 19 seconds later.Phoenix's T.J. Warren sank two free throws with 22.4 seconds remaining and Durant added two with 13.7 seconds left as the Suns pushed the lead to 127-120 before closing it out.",
        "Phoenix made 56.8 percent of its field-goal attempts and was 13 of 29 (44.8 percent) from behind the arc. Shamet, who didn't even play in Game 2, was 5 of 8 from long range.Shamet started his hot fourth quarter with two treys in a span of 58 seconds to help the Suns take a 108-100 lead with 7:35 remaining.He made another with 6:48 left to make it a nine-point margin. Nearly two minutes later, Shamet buried a 3-pointer from the corner to give Phoenix a 116-106 advantage with 4:56 remaining.Denver shot 56.2 percent from the field, including 7 of 22 (31.8 percent) from 3-point range. Gordon scored 11 points for the Nuggets.Jokic put up 18 points in the third quarter for the Nuggets -- including 13 straight Denver points during one stretch -- and Booker had 17 on 6-of-6 shooting for the Suns.Phoenix closed with an 11-4 burst as Booker drained two treys in the final minute, giving the Suns a 98-92 lead entering into the fourth.Durant had 21 points and Booker had 19 as the Suns led 63-61 at halftime. Jokic scored 24 before the break for Denver.--Field Level Media"
    ]
}