{
    "articleURL": "/news/article-12054165/Referee-Khodr-Yaghi-breaks-silence-left-broken-jaw-post-match-attack.html",
    "content": [
        "Referee Khodr Yaghi attacked after matchAdam Abdullah, 25, charged over incidentYaghi left with broken jaw, fractured ribs A football referee has broken his silence after the father-of-four was left with fractured ribs and a broken jaw following a shocking on-field attack. ",
        "Khodr Yaghi, 45, was attacked moments after the full-time whistle was blown at an amateur soccer match in Padstow Park, in Sydney's southwest, on May 28.Adam Abdallah, 25, was charged with wounding with intent to cause grievous bodily harm and affray on Sunday night after footage of the incident went viral. Abdallah, an amateur boxer, allegedly pushed the referee to the ground before landing a series of punches and kicks to his head.The father-of-four lost several teeth and was left with a broken jaw and ribs. Remarkably, Mr Yaghi has forgiven his alleged attacker and hopes the incident will improve the way referees across Australia are treated in the future. 'Honestly, I got nothing against him. I just want to move on... and I wish him all the best and that he too learn from that,' he told 9News.'If I knew from day one I'm gonna be victim to change that game, I will always put my hand up and take it.'",
        "He said up to 13,000 referees had been similarly attacked in the last five months, with officials at Bankstown Football Association to trial body cameras.The referee will spend at least nine months recovering from his injuries, after undergoing surgery at Liverpool Hospital last week. Shocking new allegations surrounding the incident were revealed when Abdallah faced Bankstown Local Court via videolink on Monday.",
        "The court heard Abdallah allegedly taunted officials from the sideline before jumping the fence to confront Mr Yaghi after the full-time whistle was blown.Police allege Abdallah 'stood in a boxing stance' and punched Mr Yaghi before striking him repeatedly in the head with his fist and foot.The court was also told Mr Yaghi used a metal sideline flag to defend himself during the incident, which left Abdallah injured.",
        "The accused hung his head as a magistrate refused to release him on bail on Monday as his five months' pregnant wife held back tears.Defence lawyer Talal Krayem told the court his client did not have a history of violence and would be under strict bail conditions.Aussies were quick to condemn the violent clash, that followed the Greenacre Eagles and Padstow Hornets game, after the footage circulated on social media.Steve Kamper, a former President of Sydney Olympic Football Club, said it was one of the 'worst attacks' he had seen at any sporting event at any level.'This was a disgusting and cowardly attack. It goes without saying that this kind of behaviour is totally unacceptable,' he said in a statement. Abdallah will return to court in June. "
    ]
}