{
    "articleURL": "/tvshowbiz/article-12054423/Rylan-Clark-makes-X-rated-joke-spotted-NAKED-Liverpool-hotel-room.html",
    "content": [
        "Rylan Clark was spotted naked in his Liverpool hotel room by three men, on Friday morning. ",
        "The former X Factor star, 34, took to Twitter following the incident, to make X-rated joke about what had happened.Rylan tweeted: '3 men on a crane have just seen me naked in my hotel room…. Morning boys,' followed by an awkward-face emoji. He then added: 'Their erection was bigger than mine.' And on Saturday morning, things still didn't seem to be going to plan, as the reality star revealed on Instagram he'd woken up to find his underwear in the bath, admitting: 'No idea.'",
        "His awkward mornings come a week after Rylan shared no less than 18 updates from his disaster-filled journey to Liverpool, where he is due to present the Eurovision Song Contest.The presenter left fans in hysterics on Saturday as he posted a series of tweets during the train ride, which began at London's Euston station.Disruption due to engineering works had affected Rylan's trip up north, with the melodramatic star first writing: 'All trains suspended at Euston you cannot be serious. This is how I perish.'The Essex-native soon added: 'A group of women have just screamed RYLAN at the top of their voice on the concourse. Slowly dying.'He later revealed: 'I've befriended an elder who has just come back from Japan and is looking to get to Birmingham. Lovely man . This is real.'",
        "It wasn't long before he joked: 'EUSTON WE HAVE A PROBLEM,' before sharing snaps of the chaotic-looking station and a glass of red wine.The Radio 2 presenter posed for a selfie with fellow passenger who had also been stranded - but he soon made it to the train.However, the situation had not been resolved with Rylan typing: 'The train has been declared Declassified. No drinks. No good. No seats.",
        "'Nothing matters anymore. A lady has give me a pornstar martini. This could be the end. God speed x.He quipped in another tweet: 'I will give £50 to anyone that will cuddle me at the end of this experience, preferably throughout the night.'Rylan issued a public appeal for Sheridan Smith to play him in a dramatisation of his calamatous journey.He wrote: 'I wish for SHERIDAN to play me in the tv drama.' Actress Sheridan soon replied, 'With pleasure.'The former X Factor contestant's spirits were lifted when he discovered a karaoke machine had been left in his hotel room.In a video shared at 10:39pm, he said, 'So, I've just got to my hotel and they've f*****g put a karaoke machine in my f*****g room. I just wanna apologise to every other guest but... da da da da da da, hey!' ",
        "It comes after Rylan credited Eurovision for helping him get over his divorce.The TV personality had to pull out of covering the annual competition for the BBC in 2021 because he was so devastated by his split from Dan Neal. ",
        "Rylan suffered a mental health breakdown following his marital split that year from now ex-husband Dan, who he was with for five years.Following the breakdown of his marriage the telly favourite took five months away from the spotlight due to his deteriorating health.  But he said flying out to Italy for last year's musical extravaganza was exactly what he needed to feel back to himself again.He told the Daily Star Sunday: 'Last year I needed to get away from the UK and the Eurovision bubble was perfect for that.'It was what I needed on a personal level. Being there was a full circle moment for me. It was like, 'I'm back, I'm ready to go'.'That's why Eurovision is so important to me. If you cut me open, it's there.'Eurovision's first semi-final takes place on Tuesday May 9 at M&amp;S Bank Arena, with the second scheduled for Thursday May 11.The grand final, which will also be broadcast on BBC One, has been set for Saturday May 13."
    ]
}