{
    "articleURL": "/health/article-12051525/Americas-biggest-fruitphobe-states-REVEALED.html",
    "content": [
        "Shocking statistics on the states were revealed in a report by US health officialsReports suggest that poverty levels are to blame for the variation between statesREAD MORE: HALF of US children don't eat fruit or vegetables dailyMOBILE USERS, click here to view the map of fruit consumption by stateMOBILE USERS, click here to view the map of vegetable consumption by state America's biggest fruitphobe states have been revealed in a DailyMail.com interactive map.",
        "Based on Centers for Disease Control and Prevention (CDC) data, the map shows how nearly half of adults in eight states do not consume a single piece of fruit per day.The states are concentrated in the South, which has traditionally scored poorly for fast food consumption, obesity and other diet metrics.Overall, across the country, three in five Americans consume more than one piece of fruit a day. The CDC says every adult should consume 1.5 to two cups of fruits and two to three cups of vegetables per day to get enough nutrients and avoid any deficiencies, or five a day.The data was pulled from the 2021 CDC Behavioral Risk Factor Surveillance System, which surveyed 440,000 Americans across the US.For the survey, participants were asked: 'Now think about the foods you are or drank during the past month, that is, the past 30 days, including meals and snacks.'Not including juices, how often did you eat fruit?'",
        "Oklahoma - 48.7%Louisiana - 48.6%Mississippi - 46.8%Tennessee - 46.1%West Virginia - 46%Alabama - 45.8%Arkansas - 45.4%Kentucky - 45%North Dakota - 44%Kansas - 43.7% Source: CDCData shows the proportion of people eating less than one fruit per day. ",
        "For vegetables, they were asked: 'How often did you eat a green leafy or lettuce salad, with or without other vegetables?'Oklahoma had the highest proportion of people who didn't eat at least one piece of fruit per day at 48.7 percent of respondents.",
        "Rounding out the top five were Louisiana (48.6 percent), followed by Mississippi (46.8 percent), Tennessee (46.1), and West Virginia (46).These states were also among the most impoverished in the nation, all in the top ten for those with the highest poverty rates according to the 2020 US census.Low-income families are more likely to purchase ultra-processed foods and less likely to buy fruits and vegetables than those from wealthier households.This is linked to ultra-processed foods being cheaper, as well as convenience and processed foods being more palatable because they contain more fats and sugars, according to a 2018 study from Johns Hopkins University.In Oklahoma, about one in six individuals are food insecure — unable to access sufficient food to meet their needs — according to the Oklahoma Policy Institute.One in four employees in the state also earns less than the national poverty level — below $13,590 per year for individuals.",
        "Louisiana - 25.6%Texas - 24.1%Nevada - 24%Mississippi - 23.2%Iowa - 23%North Dakota - 22.7%California - 22.5%New Mexico - 22.3%Hawaii - 21.9%Arizona - 21.6% Source: CDC.Data shows the proportion of people eating less than one vegetable per day. ",
        "The situation is no better in Louisiana, where nearly a fifth of children live in a house that is food insecure, data from 2019 to 2021 collected by the Annie E. Casey Foundation shows.Some 19 percent of households in the state also live below the national poverty line, while the proportion in deep poverty — earning less than half the $27,750 needed for a family of four — was 8.7 percent.",
        "In terms of vegetable consumption, Louisiana had the most people eating too few vegetables, with 25.6 percent having less than one a day.It was followed by Texas (24.1 percent), Nevada (24), Mississippi (23.2) and Iowa (23).The lack of consumption of sufficient fruits and vegetables is putting people in these states at higher risk of obesity because they are eating more processed foods.Of the top ten states for the most people avoiding fruits, seven of them — Oklahoma, Louisiana, Mississippi, Tennessee, West Virginia, Arkansas and Kentucky — were also in the top ten obesity rates in the US.Oklahoma also had the highest death rate from heart disease in the US — at 264.2 fatalities per 100,000 people — while Louisiana — at 235.5 per 100,000 — has the fourth highest.Health officials say it is essential to get the 'full rainbow' of fruit and vegetables every day to ensure consumption of the full range of nutrients their body needs.Previous research has shown how adequate consumption is linked to a lower risk for heart disease, diabetes, some cancers and obesity."
    ]
}