{
    "articleURL": "/wires/pa/article-12057277/Ukrainian-act-preparing-confidence-Eurovision.html",
    "content": [
        "Ukraine’s Eurovision act said they felt part of a family of countries trying to “win the fight” against evil as they arrived at the song contest’s opening ceremony.",
        "Electronic duo Tvorchi, representing last year’s winning country Ukraine, joined the 36 other artists for the Turquoise Carpet welcome ceremony in Liverpool on Sunday.",
        "The duo’s producer Andrii Hutsuliak said: “We’re very excited that we have such friends as the United Kingdom hosting this here.“This really means a lot to us, it makes our hearts warm.“It’s great to be a big family with all countries around to win the fight against the evils that came to our land, because we don’t destroy, we create.”",
        "He said he was “excited” to perform in the final on Saturday.“We want to show what we were preparing for all this period of time and we hope we can inspire people,” he said“We want people to know that no matter how hard time is, because definitely everyone has it, we want everyone to have a good attitude in a negative situation.”Vocalist Jeffery Kenny said their experience in the contest so far had been “beautiful”.Asked what Eurovision fans could expect from their performance, he said: “They can expect a show of confidence, a show of bravery and courage and a show that we will win the war at the end of the day.”UK entry Mae Muller said it was an “honour” to be the host country on behalf of Ukraine.",
        "She said: “It feels really, really special. We’re really grateful to be hosting in the UK but it’s important to remember that it’s their party, it’s just at our house.“I love the Tvorchi boys, I think they are brilliant.”",
        "Muller, who will perform I Wrote A Song at next week’s final, said: “The nerves are there. They’re there, they’re having a little party inside but I’m just trying to stay focused, focus on the positives and try and enjoy it.”Hundreds of fans lined the carpet for the welcome ceremony, hosted by Olympian Sam Quek and Ukrainian presenter Timur Miroshnychenko.Conor O’Donohoe, from Irish band Wild Youth, said: “It’s all starting to feel very real. Everyone’s getting here now, all the press are here and family are starting to fly in, so it’s all starting to kind of really settle in.”Bookies favourite Loreen said returning to the competition after winning in 2012, she felt like she already knew the “community”.She said: “We unite around music. These are all positive vibrations.”Kaarija, representing Finland and wearing a fluorescent green leather outfit, said he was “so happy” to be at the ceremony.He said: “I’m excited. I’m not nervous because I just want to do my best and enjoy.“This is not so serious. Why not? Live my best life. I’m ready to win.”",
        "The contestants wore their finest for the occasion, with Croatian group Let 3 taking to the carpet in bustled gowns accessorised with military-style peaked hats and facial hair.In scenes reminiscent of 1981 UK Eurovision entry Bucks Fizz, the group whipped off their gowns while having their photos taken to reveal white petticoats and vests.Latvian group Sudden Lights paid homage to Liverpool’s most famous music act the Beatles by recreating the outfits worn on the Abbey Road album cover.The ceremony was followed by The National Lottery’s Big Eurovision Welcome outside St George’s Hall, with performances from Frankie Goes to Hollywood and Atomic Kitten."
    ]
}