{
    "articleURL": "/wires/reuters/article-12046071/Deltas-pilot-deal-turns-heat-rival-airlines-union-negotiations.html",
    "content": [
        "By Rajesh Kumar Singh and Allison Lampert",
        "May 4 (Reuters) - Delta Air Lines' industry-changing pilot contract that offers $7 billion in higher pay and benefits is putting pressure on rival carriers to hand out similar deals ahead of a busy summer travel season.Any proposal that falls short of Delta's deal will likely have no takers among the unions, but airline executives say even matching that contract could balloon operating costs at a time when a worsening economy has clouded travel outlook. The Delta deal, working conditions and other topics will be discussed at a global conference of pilots in Montreal through Sunday.\"Delta is out there as a marker,\" American Airlines CFO Devon May told Reuters. \"That's what we are looking towards as we are working with our pilots union to get a deal done.\"The Fort Worth, Texas-based carrier has estimated that matching Delta's offer will cost it about $8 billion over four years. American Airlines, United Airlines and Southwest Airlines are all in the middle of contract negotiations with their pilots.Southwest and United have not quantified the potential impact publicly, but both expect a marked increase in non-fuel operating costs.Jason Ambrosi, head of the Air Line Pilots Association (ALPA) and an architect of Delta's deal, told Reuters the big increases in pay rates and benefits will not break airlines. They serve as a way for pilots to make up for concessions made during earlier crises like after Sept. 11, he said.",
        "\"Guess what? That's what pilots are worth,\" Ambrosi said. \"I'm not going to make any excuses for why we got the deal we got.\"But some industry officials say hefty raises for pilots will likely spark demands for similar deals from flight attendants and other workers, potentially resulting in millions of dollars in additional costs.Delta, whose earnings have recovered from pandemic lows faster than rivals, has to deal with just one major union. Its flight attendants are not unionized. But American, United and Southwest have unions with multiple worker groups.Delta's deal has put competitors in a bind.One Southwest official, who asked not to be identified discussing labor talks, said the company is \"realistic\" about the situation and any deal less than Delta's would likely be voted down.Airlines have leaned on higher ticket prices amid strong travel demand to mitigate cost pressures, but consumer spending is at risk.MARKET SHIFTIndustry executives say Delta's agreement has shifted the market. The carrier's pilot union said it made no concessions in the deal, which included dozens of work-rule improvements and quality-of-life related items.In an update to its members this week, United's pilot union said it is seeking similar improvements.Dennis Tajer, a spokesman for American's pilots union, said while pilots are not ready to sacrifice market-linked compensation, work-life balance and scheduling certainty have become a far bigger priority.",
        "\"The new currency for our pilots, regardless of age, is quality of life,\" he said. \"Delta came in and changed what pilots believed was possible.\"American pilots have voted to authorize a strike if a new employment contract isn't reached. Southwest pilots are voting for a similar measure and United pilots are picketing.While pilots cannot walk off the job until the National Mediation Board grants them permission, union officials warn further delays will make it harder to attract and retain talent and that impacts airlines' flight schedules.United executives declined to provide a timeline for the pilot deal. They said the airline has the pilots it needs to fly its summer schedule.American has said it has as much as 50 underused mainline jets and about 150 regional aircraft grounded because of a shortage of pilots.Tajer, the union rep for American's pilots, said while the company is not facing a problem in attracting pilots, it is hard pressed for enough instructors to train them. A deal will increase the population of instructor pilots, he added.Southwest, too, has a surplus of under-utilized aircraft. Casey Murray, head of the Dallas-based airline's pilot union, said it has lost more pilots in the first four months of this year than it did in all of 2022.",
        "ALPA's Ambrosi said any gains at larger airlines will also be felt at mid-sized players like JetBlue, Spirit , and Frontier, which will have to pay competitive wage to retain pilots or else will have an \"attrition issue.\" (Reporting by Rajesh Kumar Singh in Chicago and Allison Lampert in Montreal, editing by Ben Klayman and Aurora Ellis)"
    ]
}