{
    "articleURL": "/sport/cricket/article-12052089/ECB-VETO-Saudi-Arabias-proposed-investment-Yorkshire-County-Cricket-Club.html",
    "content": [
        "Prince Badr is currently in negotiations to invest in Yorkshire Cricket Club But, Saudi Arabia's proposed investment in Yorkshire could be vetoed by the ECBBadr is set to become the first person subject to the fit and proper person's test Saudi Arabia's proposed investment in Yorkshire could be vetoed by the ECB with Prince Badr set to become the first individual subject to the governing body's fit and proper person's test if his offer to buy into the club is accepted. ",
        "Mail Sport revealed on Thursday that the Saudi culture minister has offered to buy the £15million debt Yorkshire owe to former chairman Colin Graves in what would be the first case of foreign investment in county cricket.Yorkshire have also had talks with other foreign investors, including a group from India, as they seek to re-finance their debt and raise funds to get through the season. As Mail Sport revealed last month the club's attempts to secure a £20m loan from UK banks have foundered due to concerns over the club's financial forecasts, which has led them to look overseas, although this presents the additional complication of requiring ratification from Lord's.The ECB are understood to be cautious about foreign investment having had their fingers burned 15 years by signing a deal with American businessman Allen Stanford, who was subsequently charged with an £8billion fraud and sentenced to 110 years in prison. While there is no block on overseas investment the fit and proper person test would be conducted rigorously.",
        "Yorkshire chief executive Stephen Vaughan confirmed the talks with potential foreign investors yesterday in what appears to be an attempt to reduce the club's reliance on Graves. The 75-year-old, who was also chair of the ECB for five years, is seeking to return to club he saved from liquidation 20 years ago in a move that is being resisted by Vaughan and other members of the Yorkshire Board.",
        "'While we are not able to comment on any of the individual parties involved, we are involved in numerous positive and serious conversations around refinancing of the club and continue to explore all the avenues available to us,' Vaughan said."
    ]
}