{
    "articleURL": "/wires/ap/article-12052077/Russia-jails-theater-director-amid-crackdown-dissent.html",
    "content": [
        "TALLINN, Estonia (AP) - A Russian court on Friday ordered pretrial detention for a theater director and a playwright facing charges of justifying terrorism, the latest move in a relentless crackdown on dissent in Russia that spiked to unprecedented levels since the start of the war in Ukraine.",
        "The Zamoskvoretsky District Court in Moscow jailed Zhenya Berkovich, a prominent independent theater director, and Svetlana Petriychuk, a playwright, for two months pending investigation and trial. The two were detained in the Russian capital on Thursday because of the play Petriychuk wrote and Berkovich staged, \"Finist, the Brave Falcon.\" Police also raided the apartments of Berkovich's parents and grandmother in St. Petersburg.The play, named after a Russian fairy tale, depicts Russian women who faced prosecution after being lured into marriage and life in Syria by representatives of radical Islam.The authorities have alleged that the play justifies terrorism, accusations that both Berkovich and Petriychuk have rejected, maintaining their innocence.Berkovich's lawyer Yulia, Tregubova, pointed out in court on Friday that the play was supported by the Russian Culture Ministry and won the Golden Mask award, Russia's most prestigious national theater award. Petriychuk's lawyer Sergei Badamshin told the court that in 2019, the play was read to inmates of a women's prison in Siberia, and Russia's state penitentiary service praised it on its website.Justifying terrorism is a criminal offense in Russia, punishable by up to seven years in prison.",
        "The case against Berkovich and Petriychuk elicited outrage in Russia. An open letter in support of the two artists, started by the independent Novaya Gazeta newspaper, has been signed by more than 3,400 people by Friday evening. The play, the letter argued, \"carries an absolutely clear anti-terrorist sentiment.\"",
        "Dozens of Russian actors, directors and journalists also signed affidavits urging the court to release Berkovich from custody pending investigation and trial.Immediately after Russia launched its full-scale invasion of Ukraine, the Kremlin unleashed a sweeping campaign of repression, unparalleled since the Soviet era. It has effectively criminalized any criticism of the war, with the authorities targeting not only prominent opposition figures who eventually received draconian prison terms, but anyone who spoke out against it, publicly or otherwise.Pressure mounted on critical artists in Russia, too. Actors and directors were fired from state-run theaters, and musicians were blacklisted from performing in the country. Some were slapped with the \"foreign agent\" label, which carries additional government scrutiny and strong negative connotations. Many left Russia.Berkovich, who raises two adopted daughters, has refused to leave Russia and continued working with her independent theater production in Moscow, called Soso's Daughters. Shortly after the start of the war in Ukraine, she staged an anti-war picket and was jailed for 11 days."
    ]
}