{
    "articleURL": "/sport/boxing/article-12056273/John-Fury-defends-Anthony-Joshua-says-team-needs-wake-f-up.html",
    "content": [
        "John Fury has defended former world heavyweight champion Anthony Joshua Fury claims he knows the main issue that is currently facing the British boxer  He also called on fans to rally around Joshua saying 'stop giving the kid stick'John Fury has come to the defence of Anthony Joshua claiming his team needs to 'wake the f*** up' to help the British fighter rise back to the top of the sport.",
        "The 33-year-old returned to the ring last April to defeat Jermaine Franklin via a unanimous decision, ending his two-year wait for a win. It's been a tough time of late for Joshua, who prior to that win, had suffered back-to-back defeats against Oleksandr Usyk, losing his IBF, IBO, WBO, WBA heavyweight titles in the process. Joshua's fight record now stands at 25-3, with the two-time unified heavyweight champion having also lost to Andy Ruiz Jr in 2019. It has prompted some, including Dillion White, to ask questions over whether the the fighter can climb his way back to the top of boxing's marquee division. ",
        "Following his win against franklin, Joshua also told Mail Sport that he was 'not happy' with the victory, with it perhaps not living up to the spectacular triumph he may have been expecting, but admitted he was still targeting a fight against Tyson Fury next.Fury's father, John, has now come to the defence of the former world heavyweight champion and called on AJ's fans to stop criticising him and get behind him instead. 'Poor old AJ, stop giving the kid stick,' Fury senior told Spencer Fearon on the Stamina For Sale YouTube channel. 'Support your man, support your man.'We're all British and he's a fellow heavyweight. There are a few little rising UK heavyweight stars and I support them all, they need all the support and attention we can give them.",
        "'If you supported him before, then support him now.''You don't put the boot in when they're down do you. He's come off a win against Jermaine Franklin, can he get better? Of course he can.'Despite his critics, Joshua called his fight against Franklin 'The New Dawn' and he now has something to build on. He recently confirmed that he will not be fighting again until December where he will reportedly square off against Deontay Wilder.Fury, meanwhile, claims he knows what the main issue facing Joshua is, and that relates to his team, who he claims are not helping to address the immediate problems that are facing Brit. 'They are digging in the wrong places with him,' Fury continued. 'AJ needs to be worked on mentally.'They need to wake the f**k up and recognise the obvious problem with the kid and work on it.'Joshua and Franklin had to be pulled apart by their corners after they continued to brawl after the final bell sounded in their April fight. Following the bout, his promoter Eddie Hearn admitted the Franklin fight was a 'step down from Oleksandr Usyk'.He said: 'AJ is going to want the biggest fights.'Tonight was a step down from Oleksandr Usyk, but there was huge pressure.",
        "'He ended the fight well, but like he said they aren't getting any younger. We would be willing to entertain those conversations to go straight into a Tyson Fury fight in the summer.'",
        "But others, including Carl Froch, questioned whether Joshua still had the motivation to become a heavyweight champion. 'In the ring at world title level he’s been there, done the business. And now I don’t know. What motivates him?' Froch told the BBC.'We talked about it, he wants the money. I don’t understand why he’s fighting. I just don’t. It’s a dangerous sport. Money can’t be the motivation when you’ve earned over £100m.'I've not seen anything in that performance that he wants to be a world champion again.'"
    ]
}