{
    "articleURL": "/wires/reuters/article-12050629/Weak-demand-pushes-copper-straight-weekly-loss.html",
    "content": [
        "LONDON, May 5 (Reuters) - Copper prices rose on Friday after strong U.S. jobs data brightened the near-term economic outlook, but the gains only offset losses suffered earlier in the week due to lacklustre demand in China and rising inventories.",
        "The jobs numbers helped trigger a rally in global stock markets and oil prices, but they also raise the threat of higher-for-longer interest rates, which should over time restrain economic growth.Benchmark copper on the London Metal Exchange (LME) was up 0.9% at $8,568.50 a tonne at 1601 GMT but still down about 0.3% for the week.The metal used in electrical wiring has fallen 10% from a high of $9,550.50 in January and many analysts expect further losses before supply shortages lift prices again.Pressuring copper are a weaker than expected demand recovery in China, where manufacturing contracted in April, and fast-rising interest rates in the United States and other countries that have caused a string of U.S. bank failures.The U.S. Federal Reserve is \"hitting the brakes like we've never seen before\", said Bjarne Schieldrop, chief commodities analyst at Swedish banking group SEB.\"There should be a further (economic) slowdown and weakness in copper prices,\" he said. \"The outlook for copper is probably very bright in the coming years but maybe not in the coming half year.\"Meanwhile, data on Friday showed that German industrial orders fell significantly more than expected in March.Satellite surveillance of metal processing plants showed on Friday that global copper smelting activity slid in April to its lowest in two years.",
        "But while copper inventories in Shanghai Futures Exchange warehouses fell slightly in the week to Friday, inventories in Chinese bonded warehouses are rising and on-warrant LME stocks have doubled since early April to 69,400 tonnes, the most in nearly four months. &amp;lt;CU-STX-SGH&gt; &amp;lt;SMM-CUR-BON&gt; &amp;lt;MCUSTX-TOTAL&gt;LME aluminium was up 1.5% at $2,320.50 a tonne, zinc rose 2.5% to $2,688, nickel climbed 2.2% to $24,530, lead was up 0.9% at $2,120 and tin gained 1.9% to $26,075.Aluminium, lead and tin were nevertheless heading for weekly losses. (Reporting by Peter Hobson Additional reporting by Mai Nguyen in Hanoi Editing by David Goodman, Kirsten Donovan)"
    ]
}