{
    "articleURL": "/tvshowbiz/article-12058443/Kool-Gang-announces-release-new-album-People-Just-Wanna-Fun.html",
    "content": [
        "Get ready for some new tunes from Kool &amp; The Gang.",
        "The R&amp;B and funk group has announced People Just Wanna Have Fun, a 15 track album set for release on July 14. With songs spanning multiple genres and a catchy new single Let's Party, their 34th studio album has something for everyone with beats from the 70s, 80s, and even today. It also features the work of late members Ronald 'Khalis'' Bell and Dennis 'D.T.' Thomas. Bell passed in 2020 and Thomas in 2021.  'You've got the funk, you've got the jazzier tracks, we have a few ballads on there. Then there are songs that cross over to a pop sort of thing. We go from the '70s, the '80s, right into now,' founding member Robert 'Kool' Bell said in a statement obtained by DailyMail.com.",
        "'It's old school, it's new school — we kinda captured it all here. With all our music over the years, people have had fun. So I'd say this album just about sums it all up.'While the group first began working on People Just Wanna Have Fun five years ago, much was done during the peak of the pandemic.Safety precautions were taken to ensure everyone remained healthy throughout recording.'It's all done live. Nothing was flown in. We made sure we had the ultraviolet lights and the sprays and the masks. Nobody got sick. We kept the number of people in the studio way down,' founding member George 'Funky' Brown said in the statement. ",
        "Not only is Kool &amp; The Gang celebrating their upcoming album, they are also looking forward to the release of Brown's book, Too Hot: Kool &amp; the Gang &amp; Me, which lands on bookshelves July 11, 2023.They will also be taking their music on the road with Kool and the Gang Rock the World Tour. Beginning May 5, fans worldwide can catch the legends performing in Las Vegas, London, Bulgaria, and more.  Next year the group will be marking their 60th anniversary.Founded in 1964, the legendary soul group behind the hits Celebrate and Ladies Night have garnered two Grammy awards, inductions into the Songwriters Hall of Fame, and a star on the Hollywood Walk Of Fame."
    ]
}