{
    "articleURL": "/tvshowbiz/article-12044217/Miranda-Kerr-long-legs-tiny-Dolce-Gabbana-mini-dress.html",
    "content": [
        "She looked as pretty a princess at this year’s Met Gala.",
        "And Miranda Kerr sexed up her look for the fashion extravaganza’s after party in New York City.The 40-year-old showed off her endless legs in a Dolce &amp; Gabbana glittering silver mini dress.The diamond theme continued in her accessories, with the mother-of-three boosting her already statuesque height in a pair of sparkling stilettos and some seriously stunning bling from Dior's HAUTE JOAILLERIE collection - including a diamond choker necklace decorating her décolletage and huge stud earrings. She rocked the same Nineties-inspired hairstyle as she did at the gala, and a fresh application of makeup.",
        "Miranda's frock comes from Dolce &amp; Gabbana Fall 2021 collection and was once also worn by Heidi Klum's model daughter, Leni, 18.He looked utterly breathtaking at the 2023 Met Gala in New York City on Monday.Miranda was as pretty as a princess in an off-white gown from designer Dior with pearl embellishments. The glamorous garment was cinched in at the waist and featured a tastefully low-cut neckline to reveal the model's décolletage. The floor-length gown had a petite train for a touch of drama and elegant straps on the shoulders.",
        "Kerr paired her frock with a diamond choker, along with matching earrings and a ring. She carried a rose gold clutch in one hand and had streaks of blonde through her brown hair. ",
        "The star's followers were blown away by her stunning look, with one commenting that she was the 'best dressed' of the night.'Miranda is actually a real life Disney princess,' gushed another admirer. Earlier that day, the model looked youthful and rejuvenated as she received an IV drip of vitamins and hydration infusions.Sharing the moment to Instagram, the ex-Victoria's Secret stunner sat with her arm outstretched as she took a dose before the anticipated fashion event.'Quick IV with Samir,' she wrote alongside the smiling photo.",
        "The model has been keeping fans up to date while she prepares to walk the Met Gala at New York's Metropolitan Museum of Art on Monday evening.In fact, the model-turned-beauty brand founder even did her own skincare prep for the glittering event, using a host of products from her own company, KORA Organics. Miranda 'created a flawless, glowing makeup base' using the brand's newly-launched Plant Stem Cell Retinol Alternative Serum, after de-puffing her face with the KORA Rose Quartz Heart Facial Sculptor to 'lift and sculpt' while also 'bringing about a calm, soothing energy' ahead of the red carpet. To perfect her Met Gala glow, Miranda applied the Turmeric Glow Moisturizer, the Noni Glow Face Oil, then finished off her skincare routine with the Minty Mineral Hydration Mist 'to keep skin hydrated and dewy' throughout the night. ",
        "Turning to makeup, Miranda relied on another all-natural brand: Ilia. Using products from the brand, celebrity beauty pro Ericka Verrett created a 'high glamour' look that was inspired by the Chanel runway shows of the 90s. 'I was inspired by the high glamour girls of the 90s Chanel runway shows,' Ericka shared. 'I love how everything was everything. Hair was having a moment, (overdone and accessorized), and makeup felt like it had no rules. There was an eye, a lip, a cheek… the whole kitchen sink!'To that end, Ericka gave Miranda a natural, glowing base using the Ilia Super Serum Skin Tint SPF 40 then added a flush to the cheeks with the brand's Multi Stick, before adding some serious sparkle to the eye with the Liquid Powder Chromatic Eye Tint in Mythic.Miranda's bold lip for the night was created using a mix of the Ilia Color Block Lipstick in Tango and Ultra Violet, with Ericka describing the hue as her 'favorite' aspect of the look.",
        "Ericka was also responsible for Miranda's 'do for the evening - which she created using products from äz Craft Luxury Hair Care, including the Elevate Luxe Mousse, the Intense Volume Mist and the Amplify Texture Spray, which gave the stunning style plenty of oomph. To ensure the style stayed locked in place all night, Ericka finished it off with the äz Craft Luxury Hair Care Obey Hairspray. Et voila! ",
        "The cover girl, known for her elegant and timeless fashion, has previously attended the Met Gala in 2011, 2013, 2016, 2017 and 2022.Last year, Kerr oozed elegance in a strapless ivory tulle Oscar de la Renta gown, which was custom made by designers Laura Kim and Fernando Garcia.Ahead of her recent milestone 40th birthday, the businesswoman took to her company Kora Organics' Instagram to gush about her secret to happiness and youth.  Additionally, she raved that being a mother to her three sons 'is really the most incredibly rewarding experience' of her life.In addition to her eldest, Flynn, 12, who she shares with ex-husband Orlando Bloom, Kerr and Snapchat CEO Evan Spiegel welcomed their first child, Hart, four, in 2018, and his younger brother Myles, three, the next year.'Being a mum has its challenges for sure. Not all days are so easy, but I really try my best to be patient and kind and nurturing,' she said in her post.The Sydney native continued: 'Being a mother has taught me that I'm so much more capable of more than I actually thought I was capable of. More love, more patience, more resilience.'"
    ]
}