{
    "articleURL": "/tvshowbiz/article-12050073/Lucien-Laviscount-steps-mystery-brunette-carries-flowers-bouquet.html",
    "content": [
        "Do you know Lucien's mystery companion? Email tips@dailymail.com Lucien Laviscount showcased a casual look as he was spotted with a mystery female companion while stepping out of The Chiltern Firehouse on Friday.",
        "The Emily In Paris star, 30, donned a black hoodie by Creo studios and black Louis Vuitton trousers - as he was captured carrying a bag with flowers in it. The pair appeared relaxed and in good spirits as they made their way out of the luxurious hotel and restaurant in Marylebone.The mystery brunette oozed style in a baby blue coat and a pink checked co-ord, featuring a blazer and matching trousers.The unknown woman kept it cosy with a pair of Air Force trainers and and sported dainty earrings - as she was captured making her way out of the hotel right behind Lucien.",
        "The hearttrob - who has reportedly dated celebrities such as Kelly Osbourne and Little Mix singer Leigh-Anne Pinnock - recently starred in the third season of Emily In Paris as Alfie - the British love interest of the title character. The actor joined the show for its second series when his British banker character swept leading lady Emily off her feet after meeting her during their French lessons.They went on to enjoy a romance after he decided to live in the French capital.Lucien has even been tipped to become the next James Bond after he won over millions of fans in his latest role.",
        "According to the Mail On Sunday, boss Barbara Broccoli has made it clear she wanted the next actor to portray the character for 15 years, meaning that the 30-year-old is the perfect age to step into the role.It is also thought that Broccoli and her team are keen to have an ethnic-minority star to play 007 so the franchise is reflective of modern society.However, some executives are fearful his appearance on reality show Celebrity Big Brother in 2011, when he finished in fifth place, will tarnish his chances of getting the job because previous Bonds have been more highbrow.The debonair Burnley-born actor's first role was as a child model for Marks &amp; Spencer when he was ten. He has also featured in Waterloo Road, Scream Queens and Katy Keene.",
        "A source said: 'Lucien ticks all of the boxes. He is a super talented actor, is extremely handsome and in the past 18 months has won lots of new fans since he joined Emily In Paris.'Bond bosses are already saying how you can see him in the 007 tuxedo, how dapper and fitting to the role he will look.'But, there is a sticking point, and that is Big Brother. Lucien appeared on the show at a time when his acting career was not as high-profile as it is now, but he was very popular then and has a fan base now which stretches generations. That is a dream for Barbara who is very taken with him.'",
        "Meanwhile, it can also be revealed that despite Ms Broccoli saying no announcement on a new 007 film is imminent, stunt men and women are being tested at Pinewood Studios. A source there said: ‘They want to be ready for when things start moving with the new Bond.’Laviscount’s first acting role was in BBC drama Clocking Off before he landed a full-time job on Coronation Street, playing religious swimmer Ben Richardson. Following his stint on Celebrity Big Brother, he starred in Waterloo Road before moving to the US and a role as Earl Grey in Fox’s horror comedy series Scream Queens.He is also in BBC3 drama Peacock, as well as Netflix movie Your Christmas Or Mine alongside Angela Griffin and Sex Education actor Asa Butterfield. In January, Lucien made quite the entrance at Paris Fashion Week as he modelled an ice-blue pleated skirt for the Louis Vuitton catwalk show.He rocked a grey knitted short sleeved T-shirt with Vuitton printed across the front which he teamed with a bold skirt."
    ]
}