{
    "articleURL": "/news/article-12060679/Brian-Laundries-mother-offered-bake-cake-SHIV-inside-lawsuit-claims.html",
    "content": [
        "Roberta Laundrie wrote her son a letter offering to bury a body and bake him a cake if he was sent to prisonThe undated letter was found in Brian Laundrie's backpack when his body was found in a Florida park on October 20, 2021His mother has since claimed the letter was written before Gabby's death and merely referenced books they loved An undated letter from around the time Gabby Petito died revealed Brian Laundrie's mom offered to bake him a cake with a shiv if he was sent to prison.",
        "The letter by Roberta Laundrie 'references bringing a shovel to help bury a body and baking a cake with a shiv,' lawyers for Gabby's family claimed in a May 5 court filing, according to Fox News.The stunning discovery, which was labeled 'burn after reading,' was found in Brian's backpack when his body was found in the Myakkahatchee Creek Environmental Park in North Port, Florida. Patrick Reilly, the attorney representing the Petito's family, claimed the letter was in the FBI's regional office and included details that Roberta was also willing to help get Brian 'out of prison.' The shocking letter has not been publicly released, but the Petito's attorneys have petitioned to have it included as evidence in their civil suit against the Laundries, alleging they were aware that their son had killed Gabby.",
        "Petito, 22, was strangled by Brian Laundrie in Wyoming during a road trip in the summer of 2021. Her remains were found in Grand Teton National Park on September 19 after he killed her around August 28.Investigators determined she died by manual strangulation and had been dead for three to four weeks. Her death was ruled as a homicide.According to Brian's notebook obtained by authorities, he killed Gabby after she injured herself on their trip and believed she wanted to die.",
        "Out of guilt, he took his own life. Brian's skeletal remains were found in October in a Florida park after a massive manhunt when he ran away from home as police investigated Gabby's death. He died from a self-inflicted gunshot wound on a nature reserve near his parents' house. The notebook was found along with Roberta Laundrie's suspicious letter.In March, Roberta spoke out about the letter and argued she wrote to her son with 'quirky' references from books they loved in an attempt to repair their 'strained' relationship. She said it had nothing to do with Gabby's murder.Roberta claimed she wrote the letter months before Brian and Gabby set off on their cross-country road trip.'Although I do not know the exact date I wrote the letter, I do know that I wrote it and gave it to Brian before Brian and Gabby left Florida for New York, which was on June 2, 2021,' Roberta said. She added the two books she referenced in the letter were The Runaway Bunny and Little Bear. Roberta then claimed that one book, 'Burn After Writing,' which she said Gabby had given Brian, was often the subject of a joke between her and the couple.She said that book is the reason she wrote 'burn after reading' on the envelope that contained the letter to her son. ",
        "In her statement to the court, Roberta admitted her letter did contain references that some would think could be about her son and Gabby, but she claimed there is 'no connection' between her letter and the tragic deaths.'While I used words that seem to have a connection with Brian's actions and his taking of Gabby's life, I never would have fathomed the events that unfolded months later between Brian and Gabby would reflect the words in my letter.'The words in the letter could never have been a comment on that tragic situation as they were written so many months before.' The Laundrie's lawyer's filed a motion to block Gabby's parents, Joe Petito and Nichole Schmidt, from making the letter admissible as evidence in court.The civil trial between the two families is set to begin in August. ",
        "Since Gabby's death, her parents have revealed bombshell findings.Earlier this year, her family released a new selfie, which showed her with a bruised face moments before police responded to a 911 call that said she'd been attacked by her boyfriend. Viral bodycam footage showed Gabby and Brian pulled over to the side of the road in Moab, Utah, two weeks before her death in 2021. Gabby can be heard telling officers how Brian had grabbed her face while gesturing toward her neck.",
        "Two officers responded to the domestic dispute call and eventually let the couple go despite reporting Brian 'was an emotional threat to' Gabby,' according to a recent lawsuit filed by Gabby's parents.The suit against the Moab Police Department - which seeks damages in excess of $50 million - named the officer, Eric Pratt as a defendant, charging that both he and his department did not uphold their duties as peace officers by failing to an arrest, despite Pratt later telling other cops Laundrie raised 'more red flags than a Chinese communist rally.' A Utah statute requires all officers to make an arrest or issue a citation in all domestic incidents. Upon being questioned about the incident during a recent outside investigation, Pratt conceded to police that he, at the time, viewed Brian as a threat to Gaby's well-being. 'I thought he was an emotional threat to her,' the officer, who still works at the force, allegedly said during an independent review of the incident, which launched due to the lack of arrest. 'I thought he was a mental threat to her.'Transcripts of the interview produced by Petito's parents further revealed how Pratt failed to adhere to proper police policy by cutting Brian loose - despite telling Price Police captain Brandon Ratcliffe the suspected killer showed 'red flags.'",
        "Pratt allegedly told Ratcliffe that Brian was 'a weird, not healthy dude that 'looked unsavory,' the lawsuit claims.",
        "Roberta Laudrie, mother of Brian Laundrie, in a letter obtained by WFLA, explains why she wrote her 'burn after reading' letter:I, Roberta Laundrie, am a defendant in the above-styled cause and I do hereby swear or affirm that: I fully understand the meaning of all of the terms of this affidavit. I wrote the letter requested by Plaintiffs' Second Request for Production. I wrote the letter to my son, Brian Laundrie, on or about the end of May 2021. Although I do not know the exact date I wrote the letter, I do know that I wrote it and gave it to Brian before Brian and Gabby left Florida for New York which was on June 2, 2021. (Brian and Gabby went from Florida to New York before they went out West.)The purpose of the letter was to reach out to Brian while he and I were experiencing a difficult period in our relationship. Brian and I always had a very open and communicative relationship and in the months prior to the trip our relationship had become strained. Brian and I shared a love of stories and some of the language in the letter was using similar phrases to describe the depth of a mother's love. The two books that come to mind are The Runaway Bunny and Little Bear. In addition, Gabby had given Brian a book called Burn After Writing which contains printed questions to which the reader responds by writing their answers on the page. The back of the book instructs the reader to create a secret book and then destroy by 'burn after writing.' The bottom of the back cover says: 'Write. Burn. Repeat.' Brian, Gabby and I often joked about this book and the importance of being able to express yourself. If you were embarrassed or simply did not want anyone to know your thoughts or feelings then the book offered the perfect solution by telling you to burn it. This is where my message to Brian came from and I wrote on the cover of the letter for Brian to 'Burn After Reading.' In short, I was trying to connect with Brian and repair our relationship as he was planning to leave home – and I had hoped this letter would remind him how much I loved him.There were some other phrases that I used in the letter which are not found in the books I shared with Brian as a child. However, these phrases were common enough in our circle of friends and family to describe who you could turn to in the most troubling times of your life. While I used words that seem to have a connection with Brian's actions and his taking of Gabby's life, I never would have fathomed the events that unfolded months later between Brian and Gabby would reflect the words in my letter. The words in the letter could never have been a comment on that tragic situation as they were written so many months before. My words to Brian were meant to convey my love and support for my son through a light-hearted and quirky reminder that my love for him was not diminished and could not be shaken by the miles of separation we would soon be faced with.Although a few of the words in the letter are being quoted by others as having a connection to this case, all of the words taken together and in the context of the reason the letter was written show that there is no connection. In addition, there has been some speculation that this letter was in Brian's possession or in his backpack when he died – insinuating that I gave it to him as he left my home on September 13, 2021 – but that is not true because the FBI had the letter in their possession and questioned members of my family about it prior to October 20, 2021 when my husband and I found Brian's remains in the reserve.I repeat that the letter I wrote to Brian before he left with Gabby for their fateful trip was nothing more than a private communication between myself and my son and I never expected anyone else would read it. In some way, I did not want anyone else to read it as I know it is not the type of letter a mother writes to her adult son and I did not want to embarrass Brian. That is why I wrote 'Burn After Reading' on the envelope and I knew that Brian would know what that meant. I am now appreciative that he actually kept it.[Signed] Roberta Laundrie"
    ]
}