{
    "articleURL": "/tvshowbiz/article-12059649/Shaughna-Phillips-shares-sweet-snaps-Bank-Holiday.html",
    "content": [
        "Shaughna Phillips enjoyed a fun and family-filled Bank Holiday weekend to remember for the King's Coronation.",
        "Taking to Instagram on Sunday, the former Love Island star, 28, who has one-month-old Lucia, with ex-partner Billy Webb, posted snaps of the festivities. However, she joked that her newborn had spent most of the weekend asleep.One photo showed the new mother looking glamorous in a white summer dress as Lucia slept in her pram. Another image showed her baby girl looking comfortable as she had a snooze on the sofa wrapped in a pink blanket. ",
        "She also posted a photograph of a lunch where she smiled for a family photo while she cradled Lucia, who slept yet again.The television personality captioned her post: 'A corry nash weekend to remember… or not in Lucia’s case.'It comes after Shaughna detailed her battle with 'crippling anxiety' as she hit out at 'mum police' via Instagram in April.The Love Island star revealed her mental health struggles as she told her followers how she had completed her first drive on her own with her baby girl.The TV personality admitted she has been battling her emotions since her newborn arrived on April 4 and 'needs to speak to her doctor for some help'. The reality star said she doesn't want it to stop her doing things causing Lucia to 'miss out' on experiences. ",
        "Shaughna shared a picture of her baby girl looking cosy in a pink outfit and blanket while fast asleep in her car seat in the front of the vehicle. The mother held up her thumb after the drive because it was a 'huge' deal for her.",
        "She wrote: 'First drive on my own? Completed it m8. Now I know this might not be a big deal to most people, but to me this was H U G E.'I can't explain how crippling my anxiety has been since Lucia arrived, I had anxiety through my pregnancy and I really thought it would ease up once she was here but my god I was wrong. 'I've spoken briefly with my midwife about it, and I think it's going to be something I may need to speak to my doctor about for some help with, but I'm trying.'I know the more I let my anxiety stop me from doing things, the more Lucia will miss out on, and I'm determined to not let it get the better of me! Small steps.' Shaughna also made clear to any 'mum police' that she had secured her daughter properly in the car and done everything right. "
    ]
}