{
    "articleURL": "/wires/pa/article-12054429/Charles-wears-heaviest-crown-coronation--burden-King-lasts-lifetime.html",
    "content": [
        "The King and his Queen Camilla – freshly crowned – sat in their thrones at a modern-day coronation still saturated in ancient rituals of old.",
        "For Charles, the moment of his crowning marked a lifetime’s journey towards kingship, cementing him as sovereign in the nation’s psyche.As the glittering Edward’s Crown was held high for all to see by the Archbishop of Canterbury and brought swiftly down to sit upon the head of Charles III, the abbey was silent and still.Justin Welby, conscious of the momentous task at hand, settled it carefully in place, adjusting it and placing his own face level with the concentrating and composed monarch’s to ensure it was straight and steady.",
        "Reassured, the archbishop let out a of cry of God Save the King and the congregation erupted to echo him in a hearty unison.It will be the only time Charles wears the heaviest crown in the Crown Jewels used just for the moment of coronation – but its burden as the sovereign will symbolically last the rest of his life.In his sermon, the archbishop spoke of the “weight of the task” facing “Your Majesties” as he steered them though the nation’s first coronation in 70 years.Charles, with his glittering golden costumes, continual wardrobe changes and switch from crimson robes in act one to vivid royal purple for the finale, was the lead actor in his coronation theatre.",
        "His stage was set in the ancient Coronation Chair on the medieval Cosmati pavement, with the abbey transformed with a yellow golden dais and rich blue carpet stretching through the Quire.And with the King – his leading lady, the Queen.In a scene inconceivable just mere years ago, the transformation of the former Mrs Parker Bowles was complete.Camilla, consecrated with holy oil in full public view, was crowned as the nation’s Queen, watched by her husband and a global audience of millions.She shifted slightly in her chair and glanced up at Queen Mary’s Crown as it was held above.Then with the precious symbolic headwear in place, she used her finger to brush her fringe to the side, before touching the back of the crown.Witnessing it all was the Duke of Sussex, sitting in the third row of royals, seeing the stepmother he denounced as dangerous, a villain and playing the long game to the crown finally bestowed with one in true, undiluted glittering Queendom.Once upon a time it was Harry’s mother, Diana, Princess of Wales, who was set to be crowned at Charles’s side.",
        "Decades later, the role belonged to the woman labelled the third person in the Waleses’ marriage – now nearly 20 years a royal and approved by the late Elizabeth II, in a Jubilee masterstroke, to be the next to be called queen.",
        "As Charles and Camilla – in their crimson Robes of State – made their way through the abbey at the beginning, the choristers’ traditional Latin coronation greetings of “Vivat Regina Camilla” and “Vivat Rex Carolus” – Long Live Queen Camilla and Long Live King Charles – echoed around.Like a bridal gown, Camilla’s coronation dress was kept secret until the big day, with her embroidered Bruce Oldfield creation simple and tailored.Stunning seasonal flowers in reds, burgundies and golds covered the top of the ornate golden High Altar.Dozens of world leaders, foreign and home-grown royals, politicians and celebrities from Nick Cave to Ant and Dec gathered within the walls of the gothic abbey.Little Prince Louis – spotted yawning and fidgeting – lasted longer in his seat than planned during the slow-paced two-hour service, taking a break after more than an hour – after the crownings – before returning for the national anthem.Eight months ago, the abbey was in mourning with the congregation in funereal black for the late Queen’s farewell.",
        "Now, guests turned up in a colourful cascade of hats and outfits. Selfies were taken, amid occasional reminders from the church’s staff not to, with the venue buzzing with chatter before the service.It was unlike any coronation that has gone before, with multi-faith representatives, Celtic songs, and the refreshing Ascension Choir, who stood in a circle, swaying in time to the music as they sang.",
        "While the Homage to the People was watered down after controversy, within the abbey it was heartily received.But the ceremony was at its core a Christian service amid much solemnity, with an assortment of curious rituals and deeply religious conventions.A carousel of Crown Jewels – priceless sceptres, ruby and diamond rings, jewelled swords and the famous orb – was carried around for the King and Queen to touch, look upon or briefly hold.",
        "A carefully choreographed movement of three anointing screens, swept into place by six red tunic-clad soldiers, ensured the privacy of Charles’ consecration with holy oil, to the sounds of Handel’s stirring Zadok the Priest.Not everything went entirely to plan. The King and Queen arrived five minutes early and ended up waiting in their coach outside the abbey.The Prince and Princess of Wales and Princess Charlotte and Prince Louis were late and, unable to overtake to get ahead of the King, joined his procession through the church.Yet two hours later, the intricately organised historic ceremony was complete without a hitch, having proclaimed its “undoubted” King and “our Queen”, and Charles and Camilla exited the theatre, departing in their crowns in a golden state coach."
    ]
}