{
    "articleURL": "/sciencetech/article-12041941/AI-affect-jobs-industrial-revolution-Patrick-Vallance.html",
    "content": [
        "The Government's former chief scientific advisor said MPs need to 'get ahead' Sir Patrick Vallance believes AI will cause an initial 'decline in economic output'But he does acknowledge there could be some benefits in the medical industry Artificial intelligence (AI) could have as big an impact on careers as the Industrial Revolution, Sir Patrick Vallance has warned.",
        "The Government's former chief scientific advisor stressed that MPs need to 'get ahead' in the midst of a global technological boom. While he acknowledged its potential benefits within industries such as medicine, Sir Vallance raised concerns over the distortion of truth and erasure of jobs.'I think everyone's been surprised by how much the large generative models have done things that people didn't expect them to do,' he said in a committee meeting.'And then I think there are three areas of society that needs to be thought about.",
        "'The first is, with the large models and the potential, how do you determine what's true and what's not? As you can get replication of all sorts of things.'And the second is there will be a big impact on jobs. And that impact could be as big as the industrial revolution was.'How are we going to think about that, over a slightly longer timeframe?'And the third, of course, is what happens with these things when they start to do things you really didn't expect and what are the risks associated with that? That may be a slightly longer-term question.'The former advisor's thoughts come after the man widely seen as the godfather of AI, Geoffrey Hinton, quit his job at Google and said some of the dangers of AI chatbots were 'quite scary'. ",
        "Mr Hinton drew comparisons with the 'father of the atomic bomb' Robert Oppenheimer, who was reportedly ashamed of his invention and dedicated the rest of his life to stopping its proliferation.In the midst of Silicon Valley's AI explosion, Sir Vallance said that governments now need the ability to probe major tech giants and understand them better.He believes the initial effect of this boom will see a decline in economic output as people lose jobs and realign themselves, then an eventual benefit.'I think we need to get ahead of that actually. Which are the jobs, the sectors that will be most affected,' he continued.'And what are the plans to retrain and give people their time back to do a job differently, because there will be jobs that can be done by AI, which can either mean lots of people don't have a job, or it can mean actually lots of people have a job that only humans can do. ",
        "'And in the area I know most about in this – in medicine – that could be that you actually get more time with your doctor rather than being pressurised. So that could be a good outcome.'Despite this, recent studies indicate that ChatGPT can provide higher quality answers with more empathy than real doctors.",
        "The world famous bot recently caused a stir in the medical community after it was found capable of passing the gold-standard exam required to practice medicine in the US, raising the prospect it could one day replace human doctors.While acknowledging that AI is a 'global issue', Sir Vallance stressed that slowing down its progression did not seem sensible either. He said: 'There's no point thinking you can protect yourselves against something that you might view as a harmful effect individually, because you won't. And therefore there does need to be an international position on how to think about this.'And also, in terms of regulation, what do you actually want to regulate? My own view is you don't regulate the advance of technology, but you want to think very carefully about the application.'In the face of these issues, the former advisor emphasised that one of the most immediate problems was a distortion of the truth.He said: 'How do you make sure that the output of AI doesn't distort the perception of truth? ",
        "'And that seems to me something that can be looked at, and there would be ways of thinking about marking something as an output of AI where it's appropriate to do so, so you didn't end up with people inadvertently thinking that something was something that it wasn't.'",
        "As part of coping with this, he also added that not being a part of EU's Horizon would be 'a mistake'. This programme is a scientific research initiative, helping to tackle issues such as climate change in addition to funding societal aspects of AI.'I think we would be causing ourselves a problem not to continue to be part of it,' he said.His thoughts come as around 15 Nobel laureates have written to the Prime Minister following reports of a potential UK-led research programme. This initiative referred to as Pioneer would be a 'Plan B' put together by ministers. Asked about Pioneer, Sir Vallance said he liked some aspects but 'Horizon is plan A and you're better off going with plan A'. 'The European funding programme probably took a decade to get going well, so that tells you how long it takes to set up these schemes,' he said.'So the idea that you can instantly set up something equivalent… is, I think, flawed.'",
        "An image of Pope Francis wearing a shiny white puffer jacket, a long chain with a cross and a water bottle in his hand is the latest example of the dangers of AI.The stylish pontiff was created by image-generator Midjourney, which was also behind the shocking fake scenes of Donald Trump being arrested by police officers in New York City.Deepfake videos have also shown the evil powers of AI, allowing users to create clips of public figures spreading misinformation - and experts predict 90 percent of online content will be made this way by 2025.These scary AI developments seem to be just the tip of the iceberg. ",
        "Elon Musk, Apple co-found Steve Wozniak and more than 1,000 tech leaders are calling for a pause on the 'dangerous race' to develop AI, which they fear poses a 'profound risk to society and humanity' and could have 'catastrophic' effects.The AI-generated image of Pope Francis, published Friday on Reddit, made waves on the internet this week, ultimately because the public believed it was real.'I thought the pope's puffer jacket was real and didn't give it a second thought,' tweeted model and author Chrissy Teigen. 'No way am I surviving the future of technology.' Experts have also weighed in on the realistic AI image.Web culture expert Ryan Broderick said the pope image was 'the first real mass-level AI misinformation case.'The image, however, followed a gallery of fake photos showing what it could look like if Trump were arrested - but these were publicly known to be AI-generated. Bellingcat journalist Eliot Higgins created the images this month, showing  Trump being chased down the street by police officers while his wife Melania screams. Others show the former President in jail wearing an orange jumpsuit.'Legit thought these were real,' one person tweeted, while another said: 'We should really be putting watermarks on these that disclose they are AI-generated and not real.' It comes after Trump claimed without evidence that he would be arrested today and called on his supporters to 'protest, protest, protest' in response to a possible indictment over the former president's alleged hush money payments to porn star Stormy Daniels.",
        "Deepfake videos and images have also seen a boom online, showing influential figures relaying misinformation.Meta CEO Mark Zuckerberg was used in a clip where he thanked Democrats for their 'service and inaction' on antitrust legislation.Demand Progress Action's advocacy group made the video, which used deepfake technology to turn an actor into Zuckerberg.More recently, in February, several female Twitch stars discovered their images on a deepfake porn website earlier this month, where they were seen engaging in sex acts.Currently, no laws protect humans from being generated into a digital form by AI."
    ]
}