{
    "articleURL": "/wires/reuters/article-12045189/Shanghai-Hong-Kong-stocks-rise-led-financial-shares-Shenzhen-stocks-down.html",
    "content": [
        "SHANGHAI, May 4 (Reuters) - Shanghai and Hong Kong stocks rose on Thursday, led by gains in financials and state-owned enterprise after the May Day holiday, while shared traded in Shenzhen were down.",
        "** China's blue-chip CSI300 Index edged down 0.1% by the lunch break, while the Shanghai Composite Index gained 0.6%.** Hong Kong's benchmark Hang Seng Index was up 1.0%, while the China Enterprises Index added 1.6%.** Financial stocks along with state-owned enterprise (SOE) themes surged in the session.** Bank of China Ltd, Bank of Communications Co Ltd, and China Pacific Insurance Group Co Ltd soared 6.0%, 5.2%, and 8.1%, respectively.** Hang Seng Mainland Banks Index gained 2.9%, with Ping An Insurance Group Co of China Ltd up 6.2%.** SinoSteel Engineering &amp;amp; Technology Co Ltd and China Science Publishing &amp;amp; Media Ltd rose around 10% each.** Despite news that China's tourism rebounded to pre-COVID 19 levels in the May Day holiday as the number of domestic trips rose by more than two-thirds from a year earlier, CSI tourism shares were down 4.5%.** Meanwhile, China's factory activity unexpectedly dipped in April, a private sector survey showed on Thursday, due to softer domestic demand and suggesting the manufacturing sector is losing momentum amid a bumpy post-COVID recovery.** \"The headline Caixin Manufacturing Purchasing Managers' Index fell to 49.5 in April from 50.0 in March, suggesting a modest decline in activity in the manufacturing sector on the back of subdued demand,\" analysts at Goldman Sachs said.",
        "** Following U.S. Federal Reserve, the Hong Kong Monetary Authority (HKMA) on Thursday raised its base rate charged through the overnight discount window by 25 basis points to 5.50%, its highest since January 2008.** HKMA also bought HK$4.671 billion ($595.1 million) from the market in New York trading hours to stop the Hong Kong dollar weakening and breaking its peg to the U.S. dollar. ($1 = 7.8495 Hong Kong dollars) (Reporting by Shanghai Newsroom; Editing by Varun H K)"
    ]
}