{
    "articleURL": "/femail/article-12041425/Prince-Joachim-family-frolic-penguins-trip-aquarium.html",
    "content": [
        "Prince Joachim and Princess Marie of Denmark visited aquarium with childrenThe Danish royals will re-locat to Washington DC later this year For all the latest Royal news, pictures and video click herePrince Joachim and Princess Marie of Denmark looked all smiles yesterday as they took their children - Count Henrik and Countess Athena - to an aquarium.",
        "The family paid a visit to the Kattegatcentret marine centre in Grenå, Denmark on Tuesday, to mark the attraction's 30th anniversary. The European royals looked delighted to enjoy some family time in their homeland, ahead of their relocation later this year to Washington DC. Prince Joachim, 53, is set to become the Defence Industry Attaché at the Embassy of Denmark in the US city, sparking a new chapter for his family following Queen Margrethe's decision to strip his four children of their Prince/Princess titles. During their outing to the aquarium, Princess Marie, 47, looked effortlessly elegant for the day trip, opting for a chic black turtleneck and a sage green trouser suit with tapered trousers. The mother-of-two wore her chestnut tresses down in loose waves and sported a natural make-up look, with a subtle smokey eye and dusky pink lipstick.",
        "The family were greeted by dozens of well-wishers waving the Danish flag as the royals took time to observe the sea creatures in huge tanks, and were even pictured feeding some penguins.In another photograph, they donned aprons and gloves to poke and prod what appeared to be a squid. Prince Joachim, 53, looked relaxed, wearing a simple black suit worn over a checkered shirt. His son Henrik, 13, channelled his father with an equally laid-back look as he sported red trousers, a blue jumper and a collared button-down.",
        "Meanwhile, his little sister Athena looked adorable and ready for adventure in khaki cargos, Converse and a beige turtleneck.",
        "When it was time to meet the penguins, the whole family swapped their chic jackets out for blue puffers, and their smart shoes for white wellies. Joachim and Marie grinned as they watched their children excitedly handing the animals their fish.And it was time for yet another outfit change as the family also enjoyed getting some lab gear on while aquarium staff presented them with a close-up look of sea creatures. The trip comes after the Danish royals put on a united front last month to mark the 83rd birthday of Queen Margrethe - who underwent back surgery in March -at Amalienborg Palace in Copenhagen.It was a tumultuous end to 2022 for the Danish Royal Family after the monarch stripped Prince Joachim's four children of their prince and princess titles - a shocking move which he publicly spoke out against. She has said the decision was intended to allow Nikolai, 23, Felix, 20 - born from Joachim's first marriage - and Henrik and Athena to live normal lives without royal obligations. ",
        "Instead of being Princes and Princesses, they are Counts and Countess and referred to as Their Excellencies - a change which is now reflected on the household's website. ",
        "At the time, Joachim publicly spoke out against his mother's decision - claiming that his children had been 'harmed' in the process.Later this year, the 53-year-old royal, who is sixth in line to the Danish throne, will relocate to Washington DC with his family to become defence industry attaché at the Embassy of Denmark. In 2022, a split arose between Joachim and the Danish royal house when Queen Margrethe decided that his four children should lose their titles as prince and princess.Denmark's popular long-serving monarch later apologised for upsetting members of her family with the decision – with Joachim publicly expressing his frustration, but she has refused to change her mind.",
        "The official reason was to allow the children to live more normal lives, and follows similar moves by other royal families in Europe, including the Windsors, to slim down their monarchies, the palace said.But Countess Alexandra of Frederiksborg, Joachim's first wife and mother of his two older children, said at the time: 'We are all confused by the decision.'We are saddened and in shock. This comes like a bolt from the blue. The children feel ostracized. 'They cannot understand why their identity is being taken away from them.'And Joachim himself added in an interview with Danish news outlet Ekstra Bladet that: 'We are all very sad. It's never fun to see your children being harmed. They have been put in a situation they do not understand.'"
    ]
}