{
    "articleURL": "/wires/ap/article-12048323/Georgia-election-chief-denies-Democrats-early-2024-primary.html",
    "content": [
        "ATLANTA (AP) - Georgia´s Republican secretary of state has set the battleground state´s 2024 presidential primary for March 12, rebuffing the wishes of Democrats, including President Joe Biden, to move the state into the early weeks of the nominating calendar as a part of elevating more diverse electorates.",
        "Brad Raffensperger said Thursday that the Democrats' push was \"unilateral,\" given that national Republicans have set the traditional early slate for 2024: Iowa, New Hampshire, South Carolina and Nevada.\"If you want to get most things done in America, sometimes you have to build some consensus and reach out to both sides of the aisle,\" Raffensperger said, arguing that Democrats \"never did\" reach out, at least \"not to me.\"Democrats refute that characterization, pointing to months of lobbying efforts aimed at Raffensperger's office and considerable discussion of the matter, even if Raffensperger himself avoided direct participation in those talks.The Democratic National Committee already overhauled its nominating calendar to move South Carolina into its opening slot, while endorsing the idea of Georgia and Michigan moving into the first month of voting. That would lessen the influence of Iowa and New Hampshire, the two overwhelmingly white states that have opened Republican and Democratic nomination battles for decades.But Raffensperger holds sole power to set Georgia's primary date, and the secretary said he had no desire to authorize separate party primaries or do anything that would cost a Georgia delegation votes at a national party convention. Both national party committees have promised to dock delegate seats from states that flout their preferred nominating schedules.",
        "A DNC spokesman said the national party had no comment. State Democrats did not immediately respond to a request for comment. Democrats in Atlanta and Washington had expected Raffensperger's announcement.It's another disappointment for Georgia Democrats after losing out on the 2024 national convention. Atlanta was a finalist. Local officials viewed the city as the favorite, but Biden opted for Chicago.Georgia Gov. Brian Kemp, widely regarded as the state's most influential Republican, also did not support moving Georgia into the early nominating window. Kemp has no official power over primary dates, but he would have been key to any effort to convince national GOP leaders to reconsider their calendar ahead of 2024.Now, Republicans and Democrats are headed for considerably different opening weeks for the first time in decades. GOP hopefuls, including former President Donald Trump, already have begun building their campaigns in Iowa and New Hampshire.Raffensperger's decision puts Georgia one week after the March 5 Super Tuesday. Raffensperger said waiting for that slot will make Georgia the clear \"prize\" of that day's voting because it's the only large battleground alongside Idaho, Washington and Mississippi.The differences could be moot for Democrats, with Biden yet to draw heavyweight opponents. Challengers Marianne Williamson and Robert Kennedy Jr. are not expected to threaten the sitting president within his own party.",
        "Republicans have a more crowded field. But the risk for Georgia is that Super Tuesday yields a clear separation for a front-runner. Trump, for example, dominated a Super Tuesday slate in 2016 that included Georgia, emerging from that day's voting with a clear delegate lead that none of his competitors seriously challenged even as Texas Sen. Ted Cruz and others held on for additional primary battles.Georgia Democrats argued that to guarantee attention from candidates and national media, the state needed to crack the early nominating window.Regardless of whether Raffensperger ever spoke with any Democratic Party leaders about the issue, key Democrats spoke with Raffensperger aides and Kemp's representatives in an attempt to garner support for an early Georgia primary. They spent months highlighting the potential economic benefits for the state, trying to coax more support from Republicans. They argued also that the state´s voters and local political figures - of both parties - would benefit from the attention and having a stronger say in national politics, building on Biden's narrow general election win 2020 and split results in the 2022 governor's and U.S. Senate contests.Raffensperger, who is considering running for higher statewide office in 2026, insisted Georgia can still prove its sway.\"If you can win Georgia,\" he said, \"you will win nationally.\""
    ]
}