{
    "articleURL": "/news/article-12038033/Coca-Cola-shareholders-vote-against-proposal-anti-abortion-laws-affect-business.html",
    "content": [
        "Coca-Cola shareholders opposed a report on how abortion laws affect businessThe proposal was made by non-profit As You Sow and got 13 percent of votesIt suggests that strict abortion laws are likely to drive female employees away Almost 87 percent of Coca-Cola shareholder votes opposed a proposal to look into whether anti-abortion laws in some states would negatively affect the business.",
        "During its annual shareholder meeting last week the company voted on several items, including whether to produce a report on the impact of anti-abortion laws.The proposal was made by As You Sow, a non-profit group that lobbies shareholders in corporations to enact policies it believes will bring about positive social change. As You Sow suggested anti-abortion laws in some states could cause Coke to lose female employees, and that shareholders should consider the risk.But in a statement rejecting the proposal, the board said measures 'already in place are appropriate and sufficient to address potential risks'.",
        "'In addition, the Company already has in place comprehensive health benefits that provide for our employees' needs, as opposed to what might be otherwise suggested in this proposal,' it added.On April 25, nearly 2.7 billion votes (87 percent) were cast against the proposed report, and just over 400 million (13 percent) were in favor. Around 70 million votes were abstained.Each share corresponds to a single vote, so shareholders with more shares in the company have more votes and yield greater power.In its proposal As You Sow said 'Coke has given more than $1.8million to politicians and political organizations seeking to limit women's reproductive rights'. CEO of As You Sow, Andrew Behar, said that by coordinating a report into anti-abortion laws the company would actually be withdrawing itself from a potentially damaging political debate.",
        "'We don't think it's good for business,' Behar told DailyMail.com. 'We don't think they should be associating the brand with polarizing political topics.'Behar was unable to say whether Coke donated that money to political entities in order to actively promote an anti-abortion agenda or whether it had merely associated with politicians who happened oppose to abortion.'You don't just get caught up [in anti-abortion policy],' said Behar. 'We know the people in Coca-Cola. We've been in this conversation for four years.'In a statement to DailyMail.com, Meredith Benton, who consults with As You Sow on diversity, equity and inclusion programs, said: 'Coca-Cola, as a result of politicians' decisions, has new challenges in strategically managing its ability to provide employees with the health care they want.'There is a potential upside to the company in acknowledging this truth through a thoughtful report to its shareholders; stronger long-term strategic planning, increased investor confidence in the stock, increased employee confidence in the company, and stronger allyship with the majority of Americans.When asked about the costs of implementing such programs she described them as 'limited and unquantified'.The proposal As You Sow put forward made direct reference to Georgia, where the company is headquartered and hires thousands of staff. In Georgia, abortion is banned when a 'fetal' heartbeat can be detected - about six weeks into a pregnancy. Under previous law before the repeal of Roe v. Wade, abortions were legal up to about 22 weeks.",
        "'Women who cannot access abortion are three times more likely to leave the workforce than women who have access to abortion,' wrote As You Sow in the proposal, citing a report by the UCSF Bixby Center for Global Reproductive Health.It also referred to the Institute for Women's Policy Research, which estimated that state-level abortion restrictions may annually keep more than 500,000 women aged 15 to 44 out of the workforce. 'Shareholders request that Coca-Cola's Board of Directors issue a public report prior to December 31, 2023,' read the proposal, first filed in November. It said the report should detail 'any known and potential risks or costs to the company caused by enacted or proposed state policies severely restricting reproductive rights,' it went on.",
        "Non-profits like As You Sow seek to influence corporate decision-making by leaning on shareholders to consider social and environmental impacts.It can exert influence because shareholders of publicly-traded corporations have a right to put proposals up for a vote. But ESG strategies have come under criticism in recent years, especially from conservatives, who believe investment decisions should be guided by nothing other than profit.In response, some advocates of ESG investing have argued the approach is most profitable because it is indicative of good, forward-looking corporate values.The purpose of the proposed report would likely have been to apply pressure on Coca-Cola to use its might to oppose, and potentially divest from, states that have strict anti-abortion laws.",
        "Similarly, in Florida Disney is standing up against Republican governor Ron DeSantis and his recently passed 'Don't Say Gay' bill, which limits how homosexuality can be spoken about in schools.Disney and DeSantis are now embroiled in a war in which the governor has tried to revoke the company's special jurisdiction over the Disney World Resort after the company spoke out against the bill.DailyMail.com wrote to Coca-Cola for details on exactly which states it operates in but did not hear back. The company relies on a network of independent bottling companies in different regions, some of which are independent.Another item voted on by shareholders on April 25 was a proposal requesting an audit of the company's 'impact on non-white stakeholders'.It was similarly unpopular - 17 percent of votes were in favor and 83 percent against."
    ]
}