{
    "articleURL": "/wires/afp/article-12050513/Sister-tells-heartbreak-Kenya-cult-member-accused-starving-kids.html",
    "content": [
        "When Roseline Asena's younger brother quit drinking after joining a Kenyan church run by now notorious cult leader Paul Nthenge Mackenzie, she hailed the self-proclaimed pastor for \"saving\" him from the clutches of alcoholism.",
        "Little did she imagine that two decades later, Kevin Sudi Asena would be charged with murder and accused of working with Mackenzie to starve scores of followers, including his own wife and children -- the youngest only a year old.\"My heart sank, and I felt afraid,\" the 43-year-old mother of three told AFP, her voice tinged with despair, as she described the moment when she saw her brother in handcuffs on television.The 41-year-old is among 16 suspects accused of operating an armed -- and apparently well-fed -- \"enforcer gang\" tasked with ensuring that no one broke their fast or left their forest hideout alive, investigators said, with more than 100 bodies already exhumed from mass graves in the bush.Autopsies carried out on 100 bodies found in the coastal Shakahola forest have found that while starvation appeared to be the main cause of death, some of the victims -- including children -- were strangled, beaten, or suffocated.The gruesome saga, dubbed the \"Shakahola Forest Massacre\", has shocked Kenyans, including Asena, who has since launched a desperate search for her five nieces and nephews.\"I don't know what happened to my brother. I am very heartbroken.\"- 'Already crazy' -The family first realised that all was not right with Mackenzie's Good News International Church when the zealot began urging parents to remove their children from school, claiming that the Bible did not approve of education.",
        "Other sermons preached against the use of mobile money, visits to medical facilities, vaccinations and women wearing wigs.In lush Vihiga county in western Kenya, where the Asena clan lived, family members launched a frantic effort to convince the former mechanic to abandon the church.Yet, even as Mackenzie's activities drew the attention of the authorities who briefly arrested him on charges of \"radicalisation\" in 2017, Asena's brother refused to walk away from the church.In 2019, when the preacher closed his church and asked his followers to come to the sleepy town of Shakahola, 700 kilometres (450 miles) from Vihiga, the father of five immediately complied.\"He woke up and said he does not want his land and house, that he is going to Jesus,\" Asena said.\"When he left, he was already crazy.\"But nothing could have prepared them for what was to come.In February, Asena's 63-year-old mother took a phone call from her son who told her he was on his way to \"meet God\" in Golgotha, the Biblical site outside Jerusalem where Jesus was crucified.Two months later, when police uncovered mass graves outside the coastal town of Malindi, their worst fears were confirmed.- 'Not remorseful' -Asena's sister-in-law, who gave birth in the wilderness to their youngest child, a baby boy named Syla, was rescued by emergency workers and is receiving counselling.",
        "Her husband and the other suspected enforcers \"appeared well nourished as opposed to the severely malnourished victims\", according to court documents seen by AFP.No one knows if their children are alive.\"I went to the rescue centre looking for even one child. I found nothing,\" Asena said.With many of the exhumed bodies yet to be identified, she has no idea if her nephews and nieces are among the corpses.Some of the rescued cult members advised her to focus her search on the eldest child, 15-year-old Sheila, who used to sneak out and risk beatings to drink puddle water in a bid to survive.Asena even approached her brother for help in finding his children but the effort proved futile, she said, adding that she was unable to recognise the man she met.\"He is not remorseful,\" she said, describing his demeanour as confident.\"He told me there is no case and that authorities have no evidence.\"He had even changed his name to Alfred Asena, she said, suggesting that some of Mackenzie's followers were re-baptised with new names.With each day, the family's hopes of finding Sheila -- or any of the other children -- alive are fading.\"Our mother is broken,\" Asena said.\"It looks like that entire generation of children has been wiped out.\""
    ]
}