{
    "articleURL": "/femail/article-12047283/India-Hicks-shares-previously-unseen-topless-snap-King-Charles.html",
    "content": [
        "India Hicks shared a previously unseen photograph of King Charles on InstagramRead more: For all the latest Royal news, pictures and video click here India Hicks has shared a previously unseen picture of King Charles topless - while calling him a 'very considerate' godfather.",
        "The designer, 55, posted photos on her Instagram showing herself outside Buckingham Palace as she appeared on Australian TV to discuss all things royal ahead of the ceremony in Westminster Abbey on Saturday.India, whose mother is Lady Pamela Hicks, posted two snaps, writing: 'Talking on telly today about @princestrust, the remarkable man behind it, and a very considerate, very patient godfather (with an annoying five year-old India).'Her visit to the UK comes after she posted a photo of herself on Instagram with a caption praising King Charles's invitations to the coronation which are based on 'meritocracy' as she failed to make the list.It recently emerged that her mother, who was the late Queen's bridesmaid at her wedding to Prince Philip in 1947, was also snubbed from the coronation ceremony.",
        "In the photograph, which was not dated, Charles could be seen reclining in a pair of black and white striped swimming trunks.Meanwhile India appeared to be balancing shells onto the young King's shoulder. In a second photograph, she donned a chic cream dress and a matching tweed jacket from Nina Morris.On her jacket, she wore a gold brooch with a diamond, which she revealed belonged to her mother.India's busy day comes days after she posted a photo of herself on Instagram with a long caption discussing the commentary over King Charles's invitation list for the coronation. ",
        "She wrote: 'There has been so much heated discussion about who has, or has not, been invited to this Coronation, why? Surely it’s exciting to see so many invitations based on meritocracy?'Does it not show we have a King who understands both tradition and what it takes to evolve with the times? 'Although this should come as no surprise from a man who upon completing his duty in the Royal Navy, used his severance pay to fund a community of initiatives, which were the founding projects of The Prince’s Trust.",
        "'The Prince's Trust has always focused on equality, diversity and inclusion and isn’t that what we are seeing with a guest list mainly awarded on effort, not rank?'On Lady Pamela's 94th birthday, she received a telephone call from a secretary at Buckingham Palace, informing her that she had not been invited to the Coronation, to be held at Westminster Abbey this weekend.'One of the King's personal secretaries was passing on a message from the King,' India Hicks said.'The King was sending his great love and apologies, he was offending many family and friends with the reduced [guest] list.'The palace official 'explained that this Coronation was to be very different to the Queen's' in 1953, when thousands more squeezed into the Abbey.",
        "'Eight thousand guests would be whittled down to 1,000, alleviating the burden on the state.'India, who is a goddaughter of King Charles and was a bridesmaid when he married Lady Diana Spencer, insists: 'My mother was not offended at all.''How very, very sensible,' she said. Invitations based on meritocracy not aristocracy. 'I am going to follow with great interest the events of this new reign'.'After Lady Pamela, whose father was assassinated by the IRA in 1979, attended the funeral of her close friend Queen Elizabeth at Westminster Abbey, India said: 'She might be the only living person to attend three Coronations.'Lady Pamela was eight when she was taken to see George VI being crowned in 1937.King Charles's apparent desire to make his Coronation 'meritocratic not aristocratic' has caused anguish in the upper echelons of society."
    ]
}