{
    "articleURL": "/wires/ap/article-12043051/What-striking-Hollywood-writers-want-A-look-demands.html",
    "content": [
        "The 11,500 members of the Writers Guild of America went on strike Tuesday after negotiations with Hollywood studios that began in March failed to result in an agreement. The guild has billed the issues behind the labor dispute as \"an existential crisis.\" Writers say they're facing a host of new issues brought on by streaming and other recent technological shifts in the industry.",
        "Here's a look at the demands behind the first Hollywood strike in 15 years, as the industry braces for a long hiatus:INCREASED PAYThe guild is seeking higher compensation for writers across the board. Though there are more jobs available to WGA members than ever before because of the proliferation of streaming services, pay for most writers is down. Ten years ago, 33% of TV writers were paid the minimum rate. Now, according to the WGA, 49% are. Accounting for inflation, writer pay has declined 14% in the last five years. The median weekly writer-producer pay is down 23% over the last decade, with inflation factored in. Writers say many of their members aren't even making a living wage. They are also seeking increases for their pension plan and health fund.BETTER RESIDUALSFor more than half a century, residuals have been a foundational way for writers to make money. But streaming has upended those payouts. Writers used to be handsomely compensated anytime their work went into syndication or was sold for overseas territories. Reruns meant a big payday. But now, series and films often simply land a streaming service and stay there. Streaming services also generally don't share viewership data with filmmakers and writers, meaning writers don't know how valuable their work has been. To replace backend residuals, the WGA is seeking more upfront fees.",
        "STAFFING REQUIREMENTSThe union wants TV shows to staff a certain number of writers for a period of time. At issue is the rising practice of \"mini rooms\" where only a handful of writers are working on a series. Such writer rooms are often employed during development, before a show is greenlit. That means writers can be working on a series that doesn't get picked up for as much as a year after they worked on it, or not at all. The process has circumvented some of the protections WGA members have from being overworked and understaffed. The use of mini rooms accelerated during the pandemic, with writers often meeting by Zoom - a still commonplace practice.SHORTER EXCLUSIVITY DEALSMany of the rules around TV writing are also still based on a now increasingly outdated model. Writers might have once expected to spend almost a year working on a 22- to 25-episode season of broadcast TV. Now, the average season is much shorter. Popular shows like \"Bridgerton\" might have only eight episodes. Not only does that diminish writers' per-episode pay, it can limit them from working on other programs if they're tied to longer terms of exclusivity.ASSURANCE ON AIWriters are also increasingly concerned that producers will use artificial intelligence to write scripts or at least fill in the blanks on unfinished screenplays. The fast-advancing technology has potentially widespread ramifications for Hollywood, and, in some cases, may be a useful tool. But the WGA wants production companies to agree to safeguards around its usage."
    ]
}