{
    "articleURL": "/wires/pa/article-12059567/Newcastle-s-Dan-Burn-refuses-criticise-Arsenal-s-stifling-tactics.html",
    "content": [
        "Newcastle defender Dan Burn had no complaints over Arsenal’s streetwise tactics after a tooth-and-nail Premier League battle at St James’ Park.",
        "The Gunners emerged from Sunday’s fiercely-contested encounter on Tyneside with a 2-0 victory on an afternoon when anything less would have all but handed the title to leaders Manchester City.In doing so, they dealt a blow to the Magpies’ Champions League qualification hopes in a game punctuated by frequent delays in play and ill-tempered confrontations which prevented the home side from establishing a rhythm, something they themselves had been accused of doing in the reverse fixture at the Emirates Stadium in January.But, asked about Arsenal’s approach, Burn said: “Of course it’s frustrating, but that’s what they said we did at their place. We get a lot of stick for slowing the game down, which I don’t know if we intentionally do all the time.“They did that, but it’s part and parcel of football. We can’t do it and then complain when it happens to us.“A lot of teams tend to do that now when they feel the energy of the crowd, they try and stifle it a little bit.“When a team like Arsenal is coming here and doing that, it’s a compliment.”",
        "Newcastle set off with high hopes of repeating their 2-0 home win over the Gunners last season and might have been on their way in front of an expectant home crowd had Jacob Murphy’s early shot not come back off a post or had referee Chris Kavanagh not been advised to review his decision to award a penalty for handball against Jakub Kiwior.",
        "In the event, they were undone by Martin Odegaard’s first-half strike and Fabian Schar’s unfortunate own goal.Burn said: “We knew it wasn’t going to be the same as last season, where we played them off the park. They’re a lot better this year and they’ve shown that all season.“They’ve been unlucky that City have overtaken them, but they’re a very good team who caused us problems, especially at home. We’re just unfortunate we couldn’t get the win.” We’re disappointed, but we’ve got four games to go and it’s still in our hands  Newcastle defender Dan Burn  Manchester United’s defeat at West Ham means Newcastle remain two points clear in third place with four games remaining, although with Liverpool and Brighton making concerted bids to reel them in.Burn said: “We’re disappointed, but we’ve got four games to go and it’s still in our hands.”"
    ]
}