{
    "articleURL": "/wires/reuters/article-12048077/Canada-opens-formal-investigation-Imperials-oil-sands-tailings-leak.html",
    "content": [
        "By Nia Williams",
        "May 4 (Reuters) - Canada's federal environment ministry on Thursday opened a formal investigation into a months-long tailings leak at Imperial Oil's Kearl oil sands mine in northern Alberta, signaling a potential prosecution.Environment Canada is investigating a suspected contravention of the Fisheries Act, which prohibits the \"deposit of a deleterious substance into water frequented by fish,\" or any place where such substances could enter fish-bearing water.Tailings, a toxic mining by-product containing water, silt, residual bitumen and metals, have been seeping from Imperial's site since last May, angering local Indigenous communities who hunt and fish on the lands downstream from Canada's oil sands mines.The federal government has been carrying out inspections of the site since it learned of the leak in early February, when the Alberta Energy Regulator (AER) issued an environmental protection order against Imperial.Environment Minister Steven Guilbeault told reporters in Ottawa the decision to move from an inspection to a full investigation means officers will decide whether charges are warranted.\"It means the process is underway to hold the company to account,\" Guilbeault said.Imperial, a unit of Exxon Mobil Corp, said in a statement it is cooperating with Environment Canada and continues to take actions to prevent potential impacts to downstream bodies of water.Testing shows drinking water is safe and there is no indication of impacts to fish or wildlife, Imperial added.",
        "The company first discovered discolored water on its Kearl site in May 2022 and informed the AER and some local Indigenous communities, but failed to update those communities when testing showed the water contained tailings.Canada's Tourism Minister Randy Boissonnault, one of only two Liberals lawmakers in Alberta, said the Kearl leak and poor communication was \"simply unacceptable.\"He also criticized the explanations offered by Imperial CEO Brad Corson, who apologized when he appeared before a parliamentary committee last month.\"Imperial Oil's CEO did not acquit himself well at committee, in fact they did themselves no favors,\" Boissonnault said. \"It's unjust for Indigenous communities that are living downstream to have questions about their drinking water table and the health of the natural environment.\" (Reporting by Nia Williams Editing by Chris Reese, Aurora Ellis and Deepa Babington)"
    ]
}