{
    "articleURL": "/news/article-12056913/Royal-expert-suggests-Beatrice-Eugenie-work-lay-charm-party.html",
    "content": [
        "The sisters greeted members of the public at a lunch in Chalfont St Giles todayPrincesses Beatrice and Eugenie could take on more work for the Royal Family after they laid on the charm today and made a surprise appearance at a street party for the King's Coronation, a royal expert has suggested.",
        "Prince Andrew's two daughter greeted and posed with members of the public as they joined in with a lunch on the village green in Chalfont St Giles, Buckinghamshire this afternoon.Beatrice, 34, and Eugenie, 33, are currently not considered working royals and the Duke of York is understood to have previously expressed disappointment at his daughters being omitted from the royal roster of official engagements.But royal expert Richard Fitzwilliams has suggested the 'stylish' sisters could take on more work after they were praised by members of the public during their appearance today.He told MailOnline: 'Beatrice and Eugenie are not working members of the royal family, but carry out some royal engagements. ",
        "'They seemed stylish and relaxed at a Big Lunch engagement in Buckinghamshire today where they also posed for selfies. They were obviously enjoying themselves and their presence was clearly appreciated. 'The question which is undoubtedly being asked is whether it might be possible for them to carry out some more royal engagements. They both have families and have balanced their private and professional lives well. 'As Princess Anne has just reminded us, there are not many royals who undertake engagements. Also, few of those who do are under 70. 'So this is a matter, as the Palace is currently conducting a review of who should undertake royal patronages, which is up for debate.'",
        "Beatrice and Eugenie met representatives from All Together Community, a group which distributed food parcels to vulnerable people during the pandemic and continues to offer the same service, along with running a community fridge.They carried on the party atmosphere as they watched live music ahead of tonight's Coronation concert and admired a Coronation-themed table dressing competition.Their visit comes after the sisters made a glamorous appearance at the Coronation of King Charles III and Queen Camilla at Westminster Abbey yesterday.",
        "Earlier today Eugenie took to Instagram to reveal just how important yesterday was for her.She wrote: 'Yesterday meant so much to me, as I'm sure it did to so many watching. What a magical celebration for The King, The Queen, our country, and the Commonwealth.'The day was such a reflection of dedication and service to our country.'While the King is known to be in favour of a smaller and cheaper monarchy, his sister this week said the idea of a slimmed down Firm was 'not a good idea'.Princess Anne, the hardest working royal in terms of annual engagements, instead insisted the Royal Family brings 'long-term stability', 'continuity' and 'goodness' to the UK and Commonwealth.Since 2020, the Sussexes have stepped down as working royals and Prince Andrew was stripped of his HRH title, patronages and military affiliations by his mother.",
        "Before he became King, Charles was vocal about wanting fewer working members of the Royal Family and a cheaper, smaller, institution.But Anne has suggested she believes the pool of working royals is already small enough, in a nod to Megxit and her brother Andrew's fall from grace."
    ]
}