{
    "articleURL": "/wires/reuters/article-12038645/Soccer-Klopp-expects-punishment-Spurs-celebration-comments-referee.html",
    "content": [
        "May 2 (Reuters) - Liverpool boss Juergen Klopp said he expects to be punished for his behaviour during Sunday's 4-3 win over Tottenham Hotspur as well as for his post-match comments on referee Paul Tierney, with England's FA charging the German manager later on Tuesday.",
        "Klopp was handed a yellow card for celebrating Diogo Jota's 94th-minute winner by running towards the fourth official John Brooks at Anfield, where the German also injured himself in the process.After the game, Klopp accused referee Paul Tierney of having something \"against\" Liverpool but the referee's body PGMOL reviewed the audio of Tierney and said he acted in a professional manner throughout.\"I probably have to expect the punishment because the referees think I questioned their integrity. But in the moment, I just described my feelings,\" Klopp told reporters on Tuesday ahead of Wednesday's game against Fulham.\"The whole situation shouldn't have happened at all. It was out of emotion, out of anger. That's why I celebrated the way I celebrated.\"I couldn't get close to the fourth official and I didn't want to get close to the fourth official, and then I pulled my muscle. I tried to calm down, it didn't work.\"The FA charged Klopp hours after his news conference and said he has until Friday to respond.\"It is alleged that the manager's comments... constitutes improper conduct in that they imply bias, and/or question the integrity of the referee, and/or are personal/offensive, and/or bring the game into disrepute,\" the FA said.Klopp said he had not expected a red card but added that Tierney thought otherwise.",
        "\"I expected the yellow card and he said to me: 'For me it is a red card, but because of him (fourth official), it is yellow', and he shows me a yellow and smiles in my face, that is it,\" he added.\"We won a football game 4-3 in a spectacular manner and the only headlines were about me and I really regret that, it's not necessary and it is not how it should be.\"Klopp, who could face a ban, has been punished for comments about referees in the past. He was fined 45,000 pounds ($56,000) by England's Football Association in 2019 for remarks about referee Kevin Friend.Liverpool, who are fifth in the Premier League and seven points behind fourth-placed Manchester United having played a game more, will look to make it five wins in a row for the first time this season when they face Marco Silva's Fulham on Wednesday.Klopp said Jota, who has scored five goals in his last four games, is a doubt for the game.($1 = 0.8028 pounds) (Reporting by Pearl Josephine Nazare in Bengaluru; Editing by Hugh Lawson and Christian Radnedge)"
    ]
}