{
    "articleURL": "/wires/reuters/article-12044231/Brazil-central-bank-holds-rates-nods-fiscal-policy.html",
    "content": [
        "By Marcela Ayres",
        "BRASILIA, May 3 (Reuters) - Brazil's central bank on Wednesday held interest rates steady at a sixth consecutive policy meeting and said it was \"less likely\" to resume hikes, while adding the government had eased concerns about fiscal policy with proposed new budget rules.Although the bank's rate-setting committee, known as Copom, gave no concrete signal about when to expect rate cuts, its statement marked a shift in tone on key issues that policymakers had flagged as necessary for looser monetary policy.Copom held its benchmark interest rate at a six-year high of 13.75% as expected by all 40 economists polled by Reuters.In the statement explaining their decision, policymakers said the government had helped to allay doubts about fiscal policy. A recurring reference to the chance of renewed rate hikes was modified to call it \"a less likely scenario.\"Still, economists' views were mixed about how soon to expect rate cuts amid falling inflation and uneven growth.\"The message was less harsh than the previous one,\" said Nicolas Tingas, chief economist at Acrefi, adding that in an optimistic scenario the central bank could make its first rate cut as soon as June.By contrast, Marcelo Fonseca, the chief economist of Opportunity Total, pointed to Copom calling for \"patience and serenity\" in policy decisions, suggesting, in his view, that monetary easing will have to wait until the fourth quarter.",
        "Brazil's interest rate decision came just hours after the Federal Reserve increased U.S. interest rates by a quarter of a percentage point and hinted at the possibility of pausing on future hikes.In its policy statement, Copom wrote \"the reinstatement of fuel taxes and, primarily, the presentation of a proposal for the fiscal framework have partly reduced the uncertainty arising from fiscal policy.\"Brazil's central bank directors have said the new fiscal rules, which are pending congressional approval, do not have an automatic effect on the level of interest rates. Instead, they have stressed the key for monetary policy will be how fiscal measures affect inflation expectations, which have been drifting away from official targets.MORE STABLE OUTLOOKWednesday's policy decision also dropped a reference from prior rate-setting meetings to \"deteriorating\" long-term inflation expectations.Policymakers held their inflation projections at 5.8% for 2023 and 3.6% in 2024, unchanged from their last rate-setting meeting. They acknowledged that market forecasts from a weekly survey had \"increased marginally\" to around 6.1% and 4.2% for this year and next, respectively.When Brazil's central bank paused its aggressive tightening cycle in September after lifting rates from a record-low 2% in early 2021, annual inflation was running at 8.73%. By contrast, consumer prices rose just 4.16% in the 12 months to mid-April.",
        "The central bank is officially targeting inflation of 3.25% in 2023 and 3% in 2024, with a tolerance margin of 1.5 percentage points up or down. (Reporting by Marcela Ayres Editing by Brad Haynes and Chris Reese)"
    ]
}