{
    "articleURL": "/tvshowbiz/article-12054775/Mama-June-Shannon-husband-Justin-Stroud-dash-NYC-promoting-Mama-June-Family-Crisis.html",
    "content": [
        "Mama June Shannon and her new husband Justin Stroud were spotted dashing around New York on Friday to promote their reality show.",
        "Entitled Mama June: Family Crisis, the WE tv series debuted its sixth season Friday  night over the course of an explosive episode packed with drama.The 43-year-old reality star had a courthouse wedding with Justin, 35, last March before a full family ceremony this February.Her show, which lifted the curtain on June's turbulent family life and battles with addiction, bared some of the tension in the run-up to February's nuptials.However June and Justin appeared to be the image of wedded bliss when they stepped out in New York City a few hours before the episode aired.",
        "June, whose weight loss journey also unfolded in front of reality TV cameras, draped herself in a flowing, monochrome floral maxi dress.Warding off the northeastern chill with a fashionable denim jacket, she added a pop of contrast to the look with a bubblegum cross-body bag.Meanwhile her husband cut a casual figure in a powder blue T-shirt that showed off his toned arms as he pounded the pavement beside her.Justin jazzed up the look with a massive pair of gleaming blue shades and amped up the glitz factor with a chain necklace. In the debut episode which premiered that night, June and her daughters still have a tense relationship and appear to be barely talking to each other after last season's events. ",
        "At the beginning, the matriarch of the Shannon family was seen moving to Alabama with her husband, Justin Stroud, without telling any of her daughters.Her 23-year-old daughter, Lauryn — who goes by 'Pumpkin' — is still upset with her mother all while she raises four children with her husband, Josh Efird, as well as her younger sister, Alana 'Honey Boo Boo' Thompson, now 17.All of this was happening as the second eldest daughter, Jessica Shannon, 26, was becoming more distant from her family and, as Pumpkin suspected, hiding a big secret.",
        "The episode begins with Mama June having breakfast with her new husband and talking about the mysterious symptoms plaguing her health.Justin — whom she married at the courthouse after he got out of jail for violating his probation — expressed his concern and brought up a big issue about their marriage.'This ain't how I wanted this to go,' he said. 'Like, this whole marriage, you know? And how it went down. That's not what I wanted.' June exclaimed: 'You took me to breakfast to tell me you want a divorce?' Then, Justin quickly rephrased and explained that he wanted to give his bride a real wedding.Later in the episode, June seemed stressed out about wedding planning — albeit still sure that she and her daughters will work out their differences in time — while dealing with a serious headache.",
        "The day after, Justin takes her to the emergency room after she started experiencing a loss of feeling in half of her face and body.During a tense phone call, her daughter seemed worried that June — who has been three years sober — had started using drugs again. ",
        "Previously, Mama June signed over full custody of her youngest daughter Alana to Pumpkin and her husband.She was also instructed to pay $800 in child support every month — a measly amount, Pumpkin said in the episode, considering all of Alana's senior dues as she prepared to graduate from high school.As such, Pumpkin and Josh — who just welcomed twins in the last season — are seen struggling to make ends meet and juggling four kids under five years old, as well as a temperamental teenager.At one point, Pumpkin had to end her surprise visit short after showing up at Jessica's new apartment with hardly any notice. (She was there to probe her older sister about why she had been so distant and unresponsive since moving out of her home.) Josh was running errands with their two-year-old son, Bentley, when his card declined at the gas station, and Pumpkin had to come to the rescue.In a confessional, they explained that even with Mama June's contributions, they need more support from their family.",
        "Before Jessica gave up on sleeping on their couch and moved out of the overwhelmed couple's place, Pumpkin and Josh also expressed how much they missed her help.",
        "Anna 'Chickadee' Cardwell did not appear in the first episode as the 28-year-old television personality recently revealed she has been battling stage 4 cancer. The rest of the season will see if the family can repair their relationship and come together before June's wedding ceremony and Alana's high school graduation. Also, what life-altering secret is Jessica hiding?The newest season's debut episode of Mama June: Family Crisis premiered on Friday on WE tv. The following episodes will be released every Tuesday on the AMC streaming service ALLBLK."
    ]
}