{
    "articleURL": "/sport/football/article-12048607/NOTEBOOK-Arsenal-target-Caicedo-showed-versatility-Seagulls-fight-Irish-treasure-trove.html",
    "content": [
        "Mac Allister smashes home 99th minute penalty to seal a 1-0 win for BrightonMidfielder Caicedo added yet another string to his bow by playing right back De Zerbi has now handed 49 Premier League starts to players aged 21 and under Alexis Mac Allister fired Brighton to sixth in the Premier League by converting a dramatic added-time penalty to secure a 1-0 win over Manchester United and dent their Champions League hopes.",
        "The Argentina World Cup winner emphatically dispatched the ball into the top left corner nine minutes beyond the regulatory 90 after Luke Shaw was penalised for handball following VAR intervention.Albion's 1-0 win from a pulsating Amex Stadium contest moves them above Tottenham and Aston Villa, while leaving United looking over their shoulders at fifth-placed Liverpool.The Seagulls sit just four points behind Jurgen Klopp's Reds with two games in hand thanks to the stunning late twist.Sportsmail's KIERAN GILL looks at some of the things you may have missed. ",
        "Caicedo showed his versatilityBrighton are primed for Arsenal to return for Moises Caicedo this summer after turning down their £70million offer in January and the midfielder could be seen playing at right back here, adding yet another string to his bow. That was only one of Roberto De Zerbi’s intriguing tactical tweaks which troubled Manchester United. Another involved Danny Welbeck, the former United striker who was dropping deep into midfield.Rivals eye treasure troveThere is a growing feeling in football that Ireland is an untapped treasure trove of talent and Brighton are embracing that after setting up an extensive scouting network there. Chief executive Paul Barber is neighbours with Liam Brady — the former Arsenal and Republic of Ireland midfielder — in Hove and you can imagine the gushing about Irish emeralds such as Evan Ferguson over the garden hedges. ",
        "Brighton have competition, mind. When West Ham won the FA Youth Cup by beating Arsenal 5-1, three Northern Ireland youths were involved — Callum Marshall, Patrick Kelly and Josh Briggs. Brighton and West Ham are now competing to sign Cliftonville winger Sean Moore, 17, a ‘wonderkid’ who has represented both Irish nations at youth level. Better late than neverIt disappointed me,’ said Paul Ince after his Reading team were beaten by Manchester United in the FA Cup in January, ‘because none of the United staff asked me in for a glass of wine. It’s a lack of respect. Whoever it is, win, lose or draw, you say, “Pop in for a drink”, whether it’s wine or tea, it doesn’t matter.’ Erik ten Hag made up for that by gifting Ince, who was pitch-side working for Sky Sports, a bottle of red. Better late than never.Back in the cornerIn the 29th minute, a wonderfully-worked corner routine nearly gave United the lead through Antony. In the 30th, another corner saw United take it short, only to forget the offside rule exists. From one extreme to the other. United have scored from just four corners this season — only Brighton have a worse record in the Premier League, on three.Starlets are joy to watch",
        "De Zerbi has now handed 49 Premier League starts to players aged 21 and under this season. Only Mikel Arteta’s 92 and Steve Cooper’s 56 have bettered that total. The way Brighton’s starlets, including Facundo Buonanotte, 18, and Julio Enciso, 19, are so willing to express themselves makes you think this is a wonderful place to play football.",
        "It's a dance offAaron Wan-Bissaka will have few busier evenings than this. Kaoru Mitoma was dancing with the right back so much that the pair might make decent partners on the next Strictly series. It was a great battle between a defender who thrives in one-v-one situations and an attacker who has dazzled us this season."
    ]
}